{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 04:48:31","date_modify":"2018-10-23 04:48:31","date_publish":"2016-01-28 21:00:30","description":"Some fans of the books said the 27-year-old actress wasn't pretty enough to play the beautiful character of Rosalie, and that pressure made Nikki feel bad about herself.","filename":"data/vaneerConsumption/NikkiReedrevealsplayingTwilightsRosaliegaveherselfesteemissues.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD3A7800000578-0-image-a-33_1454012295290.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421403_Nikki-Reed-reveals-playing-Twilight-character-described-beautiful-woman-world-gave-self-esteem-issues-doubt-beauty_1540270111.html","title":"Nikki Reed reveals playing Twilight's Rosalie gave her self-esteem issues","title_page":"Nikki Reed reveals playing Twilight's Rosalie gave her self-esteem issues | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Getting cast as 'the most beautiful woman in the world' can be very flattering — but also incredibly daunting.\nThat's what Nikki Reed felt when she landed the role of Rosalie in the Twilight saga, a character that is described as stunningly beautiful — even for a vampire, a race that is already better looking than average.\nIn fact, the 27-year-old told Yahoo that taking on the part made her feel self-conscious, because it opened her up to a ton of pressure to meet those high beauty standards.\nA lot to live up to: Nikki Reed said playing the character of Rosalie in Twilight (pictured) made her doubt if she was pretty enough\nA major breakthrough: The 27-year-old actress was cast in the first of the four films at 19\n'This role was supposed to be characterized as the \"most beautiful woman in the world\". That’s how the part was written,' the actress explained. 'And when you’re cast to play that character with that description, there’s an inevitable amount of external and internal criticism.\n'Suddenly, you’re wondering if you’re able to play that, and you’re listening to the rest of the world say, \"That’s not who I would describe as the most beautiful woman!\"'\nIt took her some time to get past that pressure and realize that, as she says, 'beauty is in the eye of the beholder'.\nNikki added that she really was just a regular girl who could be self-conscious like everyone else, so it took some soul searching to overcome her own insecurities as well as those newly imposed by Twilight fans.\nNaysayers: She said that there were a lot of people saying she wasn't right for the 'beautiful' part\nTake that, haters! Those doubters made her wonder if she really wasn't pretty enough — but she soon overcame her worry\nFor example, when she was younger, she wasn't a fan of the distinctive mole on her face. But she eventually learned to prize it - kind of like Cindy Crawford, who was teased for her mole as a kid but found that it later became her trademark.\n'When I was a kid, I hated this mole that’s by my lip. I hated it so much,' she said. 'But now, as an adult, it’s one of the things that kind of creates that uniqueness. People see it — they know that mole.'\nShe started finally feeling better when she stopped caring so much about what she looked like, focusing on other things that make her beautiful and sexy — like by being smart, and feeling like she is always learning and growing.\nNow, looking back, she wishes she wasn't so hard on herself in the first place.\nStriving for perfection: Nikki also worries about how images on social media are effecting kids' self-esteem, since everyone has a photo-editing app in their phones these days\nMore than a pretty face: Nikki, who is married to actor Ian Somerhalder, said she focuses more on non-physical things that make her beautiful, like being smart\n'If I could talk to my younger self, I would’ve told myself to be gentler to myself,' she said. 'Because there comes a time when everything you thought mattered, in terms of physicality or standards — all of that stuff becomes so irrelevant and unimportant. And you start realizing what you’re actually meant to do on this Earth.'\nNikki also talked about how the pervasiveness of unattainable beauty standards is becoming worse with social media.\n'Social media has also changed our perception of body image, of what’s real,' she said. 'We have such a distorted perception of what’s real, and that’s even more so now that we have the ability to basically Photoshop from our phones.'","url":"https://www.dailymail.co.uk/femail/article-3421403/Nikki-Reed-reveals-playing-Twilight-character-described-beautiful-woman-world-gave-self-esteem-issues-doubt-beauty.html"}
