{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-23 01:01:06","date_modify":"2018-10-23 01:01:06","date_publish":"2016-01-11 11:28:24","description":"Looking divine in a gorgeous golden gown, 27-year-old Nikki stole the limelight from her handsome man as they posed on the red carpet before heading inside the star-studded soiree.","filename":"data/vaneerConsumption/NikkiReedandhusbandIanSomerhalderattendGoldenGlobes2016afterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007CE7D00000578-0-image-a-112_1452511581363.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393741_Nikki-Reed-showcases-svelte-figure-glitzy-gown-puts-sweet-display-husband-Ian-Somerhalder-Golden-Globes-afterparty_1540256466.html","title":"Nikki Reed and husband Ian Somerhalder attend Golden Globes 2016 afterparty","title_page":"Nikki Reed and husband Ian Somerhalder attend Golden Globes 2016 afterparty | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're fast approaching their one-year wedding anniversary.\nBut Nikki Reed and Ian Somerhalder are obviously still very much in the honeymoon phase, as the smitten pair couldn't have looked more in love as they attended The Weinstein Company And Netflix Golden Globe Afterparty sponsored by Heineken in Los Angeles on Sunday night.\nLooking divine in a gorgeous golden gown, 27-year-old Nikki stole the limelight from her handsome man as they posed on the red carpet before heading inside the star-studded soiree.\nScroll down for video\nGolden couple: Nikki Reed and Ian Somerhalder were the perfect pair as they attended The Weinstein Company And Netflix Golden Globe Afterparty in Los Angeles on Sunday night\nThe Twilight actress covered her svelte frame in a beautiful halterneck-style golden gown, complete with a delicate swirly pattern in bronze all over the fabric.\nShe also dazzled in a JudeFrances ring.\nCinched in at her slim waistline, the dress drew attention to her enviable figure as well as her shapely, toned arms and shoulders\nKeeping it fuss-free, the beauty rocked the red carpet with a simple gold clutch, while wearing her brunette locks in a chic chignon, tendrils of hair framing her pretty face.\nGlitz, glamour, and greatness: Nikki, 27, dazzled in a beautiful gold and bronze dress with a swirly pattern aswell as a JudeFrances ring\nArm-in-arm: The smitten pair - who tied the knot last April - strode up the red carpet together\nSnap! Showing off their fun sides, Nikki and Ian, 37, took selfies on the red carpet\nGoing for a sultry look, Nikki accentuated her eyes with a heavy smoky shadow effect with well-defined brows, finishing off her beauty look with a rose pink lipstick.\nHer Vampire Diaries actor husband Ian, 37, cut a dapper figure - as ever, the good-looking gent showed he's got his tuxedo game nailed, as he rocked his black tie ensemble with panache.\nBut it wasn't just their respective outfits that caught the eye as they mingled with others at the party.\nClearly still in the fresh throes of love, Nikki and Ian packed on the PDA as they spent much of their time together joined at the hip.\nAnother adorable moment saw Ian rest his head gently on his wife's bare shoulder as they posed for a picture together, after taking a fun selfie for Twitter on the red carpet.\nRelationship goals: Ian rested his head on his wife's bare shoulder for a sweet photo inside the soiree\nWorking it: The Twilight actress oozed real Hollywood glamour in her lovely frock\nSticking together: Ian and Nikki had barely a moment apart while at the star-studded post-Globes party\nHowever, Sleepy Hollow star Nikki did release herself from her beau for a short while, and she took the opportunity to pose with actress Jaime King, who wowed in a black and nude striped dress.\nNikki and Ian tied the knot in April 2015, in an exquisite wedding ceremony in Topanga Canyon in Malibu, California, before taking an idyllic honeymoon in Mexico, Brazil and Costa Rica.\nThey became engaged in January 2015 after a whirlwind six-month romance, their actual wedding coming after just being together for nine months.\nNikki said of her handsome man in a previous interview: 'He's quite possibly the most amazing man that's ever walked the planet, it's crazy. I'm so lucky, I love him.'\nIan had previously dated his Vampire Diaries co-star Nina Dobrev for three years before splitting in 2013.\nJust the girls! Nikki broke away from her handsome spouse to post for a snap with Jaime King","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393741/Nikki-Reed-showcases-svelte-figure-glitzy-gown-puts-sweet-display-husband-Ian-Somerhalder-Golden-Globes-afterparty.html"}
