{"authors":["A.B. Sanderson"],"date_download":"2018-10-30 22:08:55","date_modify":"2018-10-30 22:08:55","date_publish":"2014-12-30 11:51:18","description":"Eurosceptic cabinet ministers are clamouring for David Cameron to let them join the NO side in a referendum on Britain’s continued membership of the |","filename":"data/vaneerConsumption/NineToryCabinetMinistersWantToCampaignForOUTin2017EUReferendum.json","image_url":"https://media.breitbart.com/media/2014/12/Cabinet_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_12_30__1540937335.html","title":"Nine Tory Cabinet Ministers Want To Campaign For 'OUT' in 2017 EU Referendum","title_page":"Nine Tory Cabinet Ministers Want To Campaign For 'OUT' in 2017 EU Referendum | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Eurosceptic cabinet ministers are clamouring for David Cameron to let them join the NO side in a referendum on Britain’s continued membership of the European Union, and are concerned that the strategy of negotiations followed by a vote will effectively put the party at war for two years, The Times reports.\nThe Prime Minister pledged that he would renegotiate terms with Brussels, something which so far has been almost entirely unsuccessful, then offer a referendum in 2017 – anticipating that his successes at the discussion table will quell the demand for withdrawal.\nAt least nine Tory Ministers are prepared to campaign for an out vote in what would be a cross party campaign with members from UKIP, Labour and the Conservatives as well as business joining up to champion an independent country free to trade with the rest of the world.\nThis group refer back to the example set by Harold Wilson, who abandoned collective responsibility during the last in-out campaign in 1975. They hold the opinion that if Mr Cameron fails to deliver on his promised reforms, including power transfers back to Westminster on immigration, benefits and financial services, then they cannot support the UK remaining part of the political bloc.\nThe referendum pledge was announced by Mr Cameron as the UKIP surge picked up pace and polls showed the mood of the nation was drifting towards Mr Farage’s view point. And a series of huge financial demands made by the European Commission, including a €1.7bn surcharge because the British economy had performed successfully outside the shackles of the single currency, riled tax payers and allowed withdrawalists to make hay.\nBut leaving a gap of two years is considered by some to be a risk, especially given the less than impressive track record Mr Cameron has secured so far, which mainly includes losing his high profile campaign against Jean Claude Juncker becoming the EU President and being told off by Angela Merkel, the German Chancellor.\n“The timetable we have given ourselves is madness,” said one Cabinet Minister. “It would be a continual distraction from all our work on the economy and the progress we are making on it.”\nSpeaking on the BBC’s World at One programme yesterday, former Commission President Jose Manuel Barroso said that Cameron’s strategy had already cost the UK influence at the debating table.\nHe said his “aggressive rhetoric” could lead to Britain’s exit from the Union although by previously refusing to support withdrawal if he did not get signifiant changes the Prime Minister had been accused of not playing his trump card by the opposing side.\nSo far the Prime Minister has refused to be drawn on whether he will support yes or no in order to avoid speculation about his own confidence in successfully renegotiating significant legal changes. Similarly, George Osborne is staying quiet on the subject as his position as Chancellor is crucial in any negations and the presentation of the outcomes.\nOther ministers, noticeably representing constituencies in the Home Counties including Michael Gove, Philip Hammond and Oliver Letwin say they would vote to leave the EU without any radical reforms.\nConservative backbenchers, led by outspoken eurosceptic Graham Brady, Chairman of the 1922 committee, have already won the right to a free rein during the campaign even if their leader is campaigning to stay in.\nA senior government figure said the Prime Minsiter would be “very wise to suspend collective responsibility on the issue” adding, “It is the only way to avoid resignations and to ensure that once the referendum result is in, everyone comes back together.”\nDuring the last referendum in 1975, Tony Benn, Michael Foot, William Ross, Peter Shore, John Silkin, Barbara Castle and Eric Varley joined the campaign to leave the EU whilst staying in the cabinet,\nMr Cameron has made his path a bumpy one: with reelection far from certain, even if he does win he will have two years of laying himself open to attacks from all sides. One former minister said he had given himself a “suicide mission” by creating massive expectations even with early indications from senior Brussels officials making it clear many of the changes he wants will not be up for negotiation.\n“Whatever he manages to secure from the EU, I can’t see it being enough for me and many others,” the former minister said. “It is going to create huge problems for the party if it wins the next election.”","url":"https://www.breitbart.com/europe/2014/12/30/nine-tory-cabinet-ministers-want-to-campaign-for-out-in-2017-eu-referendum/"}
