{"authors":["Abc News","More Azure"],"date_download":"2018-10-30 00:53:07","date_modify":"2018-10-30 00:53:07","date_publish":"2018-10-28 15:59:04","description":"The facility currently having an adenovirus outbreak.","filename":"data/vaneerConsumption/NinthchilddiesinNewJerseyfacilitysufferingadenovirusoutbreak.json","image_url":"https://s.abcnews.com/images/Health/wanaque-center-ap-jt-181024_hpMain_2_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Health_ninth-child-dies-jer_f186bdbfbbf29c3d5a4da850d44d6c70_story_id=58810310_1540860787.html","title":"Ninth child dies in New Jersey facility suffering adenovirus outbreak","title_page":"Ninth child dies in New Jersey facility suffering adenovirus outbreak - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"A ninth child has died in a New Jersey rehabilitation facility that is currently suffering an adenovirus outbreak, according to officials.\nThe child, whose name has not been released, died late Saturday night at the Wanaque Center for Nursing and Rehabilitation in Haskell, New Jersey. This latest death was a confirmed case of adenovirus, according to the New Jersey Department of Health.\nTwenty-five pediatric cases of adenovirus have been connected to the outbreak at this facility, officials said. A staff member at the facility also became ill, but has since recovered.\nCDC via AP\n\"This is a tragic situation, and our thoughts are with the families who are grieving right now,\" New Jersey Health Commissioner Dr. Shereef Elnahal said in a press release. \"We are working every day to ensure all infection control protocols are continuously followed and closely monitoring the situation at the facility.\"\nPeople associated with the outbreak became sick between Sept. 26 and Oct. 22, according to the New Jersey Department of Health. The health department was first notified of the outbreak on Oct. 9, according to a statement from the agency.\nEach of those who became ill had \"severely compromised immune systems\" before they got sick, and ranged in age from toddlers to young adults.\nJulio Cortez/AP\nAdenovirus is a respiratory disease with symptoms that may include a sore throat, pneumonia, diarrhea, pink eye, fever, and inflammation of the stomach and intestines.\nThe Centers for Disease Control and Prevention is assisting with the outbreak at the facility, and the Department of Health Communicable Disease Service is on site as well.\nThe Wanaque Center has established a hotline for people who have been affected, and are also offering grief counseling.","url":"https://abcnews.go.com/Health/ninth-child-dies-jersey-facility-suffering-adenovirus-outbreak/story?id=58810310"}
