{"authors":[],"date_download":"2018-10-22 22:35:47","date_modify":"2018-10-22 22:35:47","date_publish":"2014-06-10 17:30:36","description":"Nintendo is bringing real-world toys into virtual-world video games, as rumored.","filename":"data/vaneerConsumption/NintendoUnveilsRealWorldFigurinesForWiiUPlusNewGames.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500121/140610-e3-2014-outside-jsw-304p_37a6ea4edc9691295bf19f1c99d5c17c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_video-games_nintendo-unveils-real-world-figurines-wii-u-plus-new-games-n127501_1540247747.html","title":"Nintendo Unveils Real-World Figurines For Wii U, Plus New Games","title_page":"Nintendo Unveils Real-World Figurines For Wii U, Plus New Games","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNintendo is bringing real-world toys into virtual-world video games.\nThey look like toy figurines of Mario, Link and other popular Nintendo characters -- but they sit atop disks with special chips embedded. When placed on a Wii U GamePad controller, the toys can store game data or even insert characters right into the action.\nSign up for top Tech news delivered direct to your inbox.\nNintendo unveiled the new \"amiibo\" toys at the E3 video-game conference in Los Angeles on Tuesday. They're part of Nintendo's big push to shore up interest in its Wii U console, which was released in 2012 to lackluster sales compared with rivals Playstation and Xbox.\nNintendo called the figurines \"toy-to-life\": Players place the physical figurines on a Wii U controller, and a virtual version of the amiibo immediately pops up on screen ready to play.\nThe chips store information about past gameplay, and like real-life players or fighters, the skills of the amiibo avatars improve over time. Each figure develops unique strengths.\nThe amiibo -- which are similar to existing game-compatible toys from Activision Blizzard and Disney -- will work with Nintendo's handheld 3DS system starting in 2015.\nNintendo showed off the amiibo in a clip of company executives battling one another in \"Super Smash Bros. 4.\" About 10 amiibo will be released in the holiday season of 2014, along with the new \"Super Smash\" for Wii U -- and they'll eventually be compatible with \"Mario Kart 8\" and other Wii U games.\nAlso new for \"Super Smash Bros.\": Players can add their personalized avatars, called Miis, to the fight. The Miis come in three fighting types -- brawler, swordfighter and gunner -- and will have 36 special moves to choose from.\nLater in Nintendo's E3 presentation, fans of the acclaimed \"Legend of Zelda\" franchise received two bits of news. First, Nintendo previewed an unnamed new title in the series that features a panoramic, \"open world\" style of play. The game will be released in 2015.\nNintendo also showed clips from \"Hyrule Warriors,\" a spinoff title that lets gamers play as characters from the \"Zelda\" franchise. \"Hyrule Warriors\" is slated for release in North America on September 26.\nBeyond the Zelda games, Nintendo showed clips of gameplay from several other upcoming titles, including: \"Bayonetta 2\" (which will include \"Bayonetta 1\" in the pack), \"Captain Toad: Treasure Tracker,\" \"Fantasy Life\" and \"Mario Party 10\" for Wii U, as well as two Pokemon games for 3DS.\nOne of the upcoming games is \"Mario Maker,\" in which gamers can build their own levels in the style of \"Super Mario Bros.\" or the classic 2-D games. Retro!","url":"https://www.nbcnews.com/tech/video-games/nintendo-unveils-real-world-figurines-wii-u-plus-new-games-n127501"}
