{"authors":[],"date_download":"2018-10-22 21:38:20","date_modify":"2018-10-22 21:38:20","date_publish":"2014-05-07 19:34:15","description":"The company says it won't bow to pressure to allow players to engage in same-sex relationships in English editions of \"Tomodachi Life.\"","filename":"data/vaneerConsumption/NintendoSaysGayMarriageNotAllowedinTomodachiLifeVideoGame.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/427141/140507-tomodachi-life-spread-1523_fe9433962228851e8fb39bfba6fdef12.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_video-games_nintendo-says-gay-marriage-not-allowed-tomodachi-life-video-game-n99611_1540244300.html","title":"Nintendo Says Gay Marriage Not Allowed in 'Tomodachi Life' Video Game","title_page":"Nintendo Says Gay Marriage Not Allowed in 'Tomodachi Life' Video Game","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNintendo isn't allowing gamers to play as gay in an upcoming life simulator game.\nThe publisher of such gaming franchises as \"The Legend of Zelda\" and \"Mario Bros.\" said Tuesday it wouldn't bow to pressure to allow players to engage in romantic activities with characters of the same sex in English editions of \"Tomodachi Life.\" This follows a social media campaign launched by fans last month seeking virtual equality for the game's characters, which are modeled after real people.\n\"Nintendo never intended to make any form of social commentary with the launch of 'Tomodachi Life,'\" Nintendo of America Inc. said in a statement. \"The relationship options in the game represent a playful alternate world rather than a real-life simulation. We hope that all of our fans will see that 'Tomodachi Life' was intended to be a whimsical and quirky game, and that we were absolutely not trying to provide social commentary.\"\n\"I want to be able to marry my real-life fiancé's Mii, but I can't do that.\"\nTye Marini, a gay 23-year-old Nintendo fan from Mesa, Arizona, launched the campaign last month, urging Osaka, Japan-based Nintendo Co. and its subsidiary Nintendo of America Inc. to add same-sex relationship options to English versions of the hand-held Nintendo 3DS game.\nThe game was originally released in Japan last year and features a cast of Mii characters — Nintendo's personalized avatars of real players — living on a virtual island. Gamers can do things like shop, visit an amusement park, play games, go on dates and encounter celebrities like Christina Aguilera and Shaquille O'Neal.\n\"I want to be able to marry my real-life fiancé's Mii, but I can't do that,\" Marini said in a video posted online that attracted the attention of gaming blogs and online forums this week. \"My only options are to marry some female Mii, to change the gender of either my Mii or my fiancé's Mii or to completely avoid marriage altogether and miss out on the exclusive content that comes with it.\"\n\"Tomodachi Life\" has been a hit in a Japan, where Nintendo said last December it had sold 1.83 million copies of the game.\nNot real life?\nThe English-language packaging for \"Tomodachi Life\" — \"tomodachi\" means \"friend\" in Japanese — proclaims: \"Your friends. Your drama. Your life.\" A trailer for the game boasts that players can \"give Mii characters items, voices and personalities, then watch as they rap, rock, eat doughnuts and fall in love.\" However, only characters of the opposite sex are actually able to flirt, date and marry in the game, which is set for release June 6 in North America and Europe.","url":"https://www.nbcnews.com/tech/video-games/nintendo-says-gay-marriage-not-allowed-tomodachi-life-video-game-n99611"}
