{"authors":["Associated Press"],"date_download":"2018-10-22 22:06:03","date_modify":"2018-10-22 22:06:03","date_publish":"2017-03-16 02:44:15","description":"ATSUGI, Japan (AP) - Alfonso Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at...","filename":"data/vaneerConsumption/NissandesignchiefAlbaisainspiredbyCubanJapanroots.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/02/wire-226005-1489632564-966_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318690_Nissan-design-chief-Albaisa-inspired-Cuban-Japan-roots_1540245963.html","title":"Nissan design chief Albaisa inspired by Cuban, Japan roots","title_page":"Nissan design chief Albaisa inspired by Cuban, Japan roots | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ATSUGI, Japan (AP) - Alfonso Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize.\nThe Cuban-American, who has worked on the luxury brand's Q30 and award-winning Q60 models, was promoted this week to senior vice president and head of design at Nissan Motor Co.\nJapanese artworks and his Cuban roots are among the influences from East and West that inspire Albaisa's sometimes whimsically poetic approach.\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks with a model of Infiniti Q60 during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)\n\"I feel a car is a dream, more than the nuts and bolts that make it real,\" Albaisa told The Associated Press at the Nissan Technical Center on the outskirts of Tokyo recently. \"It's a reflection of our dream to fly, to move,\" he said.\nCar makers are increasingly focusing on design to woo customers in an industry where performance, safety and mileage tend to be uniformly high.\nBefore his latest promotion, Albaisa was a corporate vice president and design director for Infiniti.\nThe Infiniti Q50, which debuted at the Geneva International Motor Show this month, showcased a stylish interior with hand-worked materials like genuine-looking wood dashboard trims.\nAlbaisa speaks lovingly of that kind of dedication to craftsmanship, what the Japanese call \"monozukuri.\"\nThe 52-year-old graduate of the Pratt Institute joined Yokohama-based Nissan in the U.S. in 1988, a decade before it forged its alliance with French automaker Renault.\nPartly due to the Nissan-Renault tie-up - its chairman is Brazilian-born Frenchman Carlos Ghosn - Nissan's ranks are more diverse than many other Japanese companies: half its top 10 executives are non-Japanese, compared to about a fifth at rival Toyota Motor Corp.\nBut Albaisa's Japan connection started much earlier: growing up he was exposed to Japanese artists and architects like Isamu Noguchi and Kenzo Tange by his father, an architect who moved to Miami after the Cuban revolution of the 1950s.\nAlbaisa is proud of his heritage. Last year, he shipped a crimson Infiniti Q60S sedan to Cuba, to be filmed on its potholed but picturesque streets while he visited, for coverage by Fortune magazine.\nThe designer's Latin flair seems typical of Nissan's trail-breaking approach among Japanese brands.\n\"The Japanese brands for a long time had that reputation of being kind of bland and dry, and boring, if you will,\" said Hans Greimel, Asia Editor at Automotive News.\n\"That's changing gradually. But at the vanguard of that change has always been Nissan. They've always stood out a little bit extra for their design. They've been a little bit quirky, a little bit daring.\"\nJapanese autos once may have been stereotyped as staid, but that's changing, says Albiasa. The internal code-name for developing the Infiniti QX70, for instance, was \"bionic cheetah,\" to help its designers grasp an image of agile, lean muscularity and state-of-the-art technology.\n\"Japanese culture is not boring. Japanese culture is beautiful. It's innovative. It's thoughtful, inward-looking, outward-acting, and we have to make a car like that,\" he said.\n\"If that is perceived as boring, then we are not doing it correctly. So my job is to make Japanese cars reflect the beauty and innovation of Japan.\"\nAlbaisa believes advances like autonomous driving and artificial intelligence, can bring still more creative opportunities. Side mirrors may become obsolete, and assumptions on how much glass to use may literally go out the window, he says.\nIn the meantime, despite the demands of his corporate role as a vice president, he continues working on vehicle clay models, using them to understand his Japanese co-workers on a deeper level by communicating intuitively and overcoming language barriers.\nThey take turns, switching their positions from one side of the model to the other, shaping the clay, transforming it bit-by-bit, as each adds touches and interpretations for future products.\n___\nNissan footage of Alfonso Albaisa's visit to Cuba: https://www.youtube.com/watch?v=3c4yFBWOsyg\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\nHer work can be found at http://bigstory.ap.org/content/yuri-kageyama\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks with a model of Infiniti Q60 during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks with a model of Infiniti Q60 during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks with a model of Infiniti Q60 during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks with an Infiniti Prototype during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)\nIn this Feb. 27, 2017 photo, Nissan's design chief Alfonso Albaisa speaks with an Infiniti Prototype during an interview at the Nissan Technical Center in Atsugi, near Tokyo. Albaisa draws upon the cultures of Japan, America and Cuba in concocting car designs with a flair that once was lacking at Japanese automakers, critics say, but is becoming evident as they globalize. (AP Photo/Shizuo Kambayashi)","url":"https://www.dailymail.co.uk/wires/ap/article-4318690/Nissan-design-chief-Albaisa-inspired-Cuban-Japan-roots.html"}
