{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 00:04:56","date_modify":"2018-10-23 00:04:56","date_publish":"2017-03-16 08:55:04","description":"Relations between the residents of Downing Street have plunged to a new low after the PM forced Mr Hammond into an humiliating climbdown over the key Budget measure.","filename":"data/vaneerConsumption/No10WARNEDPhilipHammondBudgettaxraidwasbadidea.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E4B294F00000578-0-image-a-32_1489654340390.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319262_No10-WARNED-Hammond-Budget-tax-raid-bad-idea_1540253096.html","title":"No10 WARNED Philip Hammond Budget tax raid was 'bad idea'","title_page":"No10 WARNED Philip Hammond Budget tax raid was 'bad idea' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May and Philip Hammond are on the brink of war amid claims No10 warned the Chancellor his tax raid on the self-employed was a bad idea - but he wouldn't listen.\nRelations between the residents of Downing Street have plunged to a new low after the PM forced Mr Hammond into an humiliating climbdown over the key Budget measure.\nMrs May told the Chancellor his hike to Class 4 National Insurance, which smashed a Tory manifesto pledge, had to be scrapped at a tense 8am meeting yesterday.\nMr Hammond made the embarrassing announcement in a letter to MPs shortly before Mrs May took Prime Minister's Questions - easily fending off a weak response from Jeremy Corbyn.\nMrs May offered a public declaration of confidence in her Chancellor today in a bid too cool the row.\nPhilip Hammond, pictured at No 10 yesterday, was forced into a huge u-turn on his first Budget and confirmed he will cancel hikes to national insurance on the self employed.\nRelations between Theresa May (pictured at PMQs yesterday) and Mr Hammond have plunged to new lows after the row over the tax raid on the self-employed\nThe row has laid bare the growing friction between the holders of the two most important roles in government, with the PM taking the opportunity to stamp her authority.\nMrs May's aides are believed to have been particularly infuriated by briefing to Sunday papers from 'friends' of the Chancellor, complaining of 'economic illiteracy' in No10 and saying they had been pressing for the Budget to raise more money.\nAccording to The Times, Mrs May's team warned the Treasury before the fateful package was announced that raising NI for the self-employed was a 'bad idea'.\n'No 10 said don't do it, but Philip wouldn't listen,' a ministerial source said.\nThe screeching U-turn has dealt a massive blow to the standing of the Chancellor, who previously held a reputation in Westminster as a safe pair of hands.\nHe is now facing questions about his future in the role.\nThe Prime Minister herself expressed confidence in her Chancellor today.\nAsked if she had ever thought he should resign, Mrs May told ITV News: 'I have absolute faith in the Chancellor. We made very clear yesterday - he and I - about the tax lock, that we recognised the spirit of the manifesto and the change has been made.'\nMr Hammond tried to shore up his position today by pleading for the public to keep 'faith' in him, saying the climbdown showed he could be 'trusted'.\nTIMELINE OF CHAOS: HOW THE NICs U-TURN HAPPENED Wednesday March 8: Chancellor Philip Hammond unveils his first Budget, including a hike to class 4 National Insurance Contributions (NICs). The backlash begins immediately. Thursday March 9: Theresa May defends the policy at a press conference in Brussels but does postpone the introduction of legislation until the Autumn. Sunday March 12: Revelations that Hammond failed to advise Cabinet his policy could be seen as a manifesto breach. Wednesday March 15 at 8am: May and Hammond meet in Downing Street and the Chancellor is told to scrap the NI rise. Wednesday March 15 at 11.30am: Hammond tells MPs he is making a huge U-turn. Wednesday March 15 at noon: Minutes later, May faces the music at PMQs confirming the U-turn was going ahead.\nAfter delivering his Budget a week ago, Mr Hammond was accused of lying and breaching the Tory manifesto by placing the £2billion tax raid at the heart of his Budget.\nHe appeared to confess to MPs yesterday that he had not realised there could be a conflict with the manifesto until he saw it mentioned by journalists.\nLabour leader Mr Corbyn mocked the Prime Minister for leaving a 'black hole' in the Budget and claimed the Government was in 'chaos'.\nNo 10 today insisted the U-turn ensured the Budget met both the 'spirit' and the letter of the manifesto.\nMr Hammond had wanted to increase class 4 National Insurance paid by the self employed from 9 per cent to 11 per cent over the next two years.\nHe admitted in the Commons today his Budget was no longer balanced after scrapping the plan but he vowed to fix it in the autumn.\nAt PMQs, Mrs May told MPs that legislation on the Tory 'tax lock' quietly passed last year was intended to meet the manifesto commitment.\nNo 10 said Mrs May retains full confidence in her Chancellor.\nMr Hammond said he still believed the intention of his plan was correct but admitted it was not compatible with the manifesto promise to freeze national insurance.\nIn a letter, Mr Hammond told Tory MPs: 'The measures I announced in the Budget sought to reflect more fairly the difference in entitlement in the contributions made by the self-employed and address the challenge of sustainability in the tax base.\n'The Government continues to believe that this is the right approach.\nMr Hammond appeared in the Commons today to explain his embarrassing U-turn to MPs\nMr Hammond insisted to MPs that the Budget had not broken the letter of the manifesto but would now also comply with its spirit\n'In light of the debate over the last few days it is clear that compliance with the ''legislative'' test of the manifesto commitment is not adequate.\n'In light of what has emerged as a clear view among colleagues and a significant section of the public, I have decided not to proceed with the Class 4 NIC measures set out in the Budget.\nTORIES U-TURN ON THREE BUDGETS IN THREE YEARS The Conservative Government has now made a major U-turn on every Budget since the 2015 General Election. Shortly after the election, then Chancellor George Osborne delivered a summer Budget that contained £1,000 cuts to low-income families on tax credits. After a storm of opposition from Tory MPs and the House of Lords, he dropped the plan in the Autumn Statement. At his next Budget in spring 2016, Mr Osborne announced a raft of cuts to disability benefits. It exposed a long-running row with the then Work and Pensions Secretary Iain Duncan Smith, who explosively quit the Cabinet. His replacement immediately abandoned the plan.\n'There will be no increases in NICs rates in this Parliament.'\nAfter sending the letter, the Chancellor addressed MPs to explain his U-turn to Parliament.\nMr Hammond was bombarded with questions from Labour on how he will fill the gaping hole in the Budget red book.\nHe was urged to apologise by his Labour counterpart John McDonnell, who claimed Mr Hammond should have spent less time writing 'stale jokes' for his Budget speech.\nMr McDonnell added that Prime Minister Theresa May should also have spent less time 'guffawing like a feeding seal'.\nAnswering Alex Salmond's question about who first noticed the manifesto problem, Mr Hammond said: 'Credit where credit is due, I think it was Laura Kuenssberg on the BBC shortly after I said it in the Budget speech.'\nLabour MP Yvette Cooper demanded: 'Can he confirm that in fact nobody in Number 10 and nobody in Number 11 actually checked the Conservative Manifesto before he wrote the Budget?'\nHammond squirmed, insisting: 'I didn't say that.\n'Let me be clear, Laura Kuennssberg was the first person after I spoke , to raise the issue outside.'\nNo 10 insisted all spending commitments - on social care, education and easing business rate hikes - would be honoured, with the details to be spelt out at the Autumn Budget.\nMrs May was forced to defend the screeching U-turn at PMQs today while her Chancellor sat next to her on the front bench\nMr Hammond presented his first Budget last Wednesday and today's U-turn leaves a huge black hole at the centre of his plans\nThe Conservative manifesto in 2015 promised 'no increases in National Insurance'\nThe Budget scorecard said it the measure was worth £495million a year by 2022 and it was one of just two significant money raisers in the Budget.\nHAMMOND ADMITS MANIFESTO BUNGLE WAS FIRST SPOTTED BY THE BBC Philip Hammond has appeared to admit he did not realise he had smashed the Tory manifesto until appeared on the news. The Chancellor hastily backed off from the startling claim while he was quizzed by MPs on his screeching National Insurance U-turn. Answering Alex Salmond's question about who first noticed the manifesto problem, Mr Hammond said: 'Credit where credit is due, I think it was Laura Kuenssberg on the BBC shortly after I said it in the Budget speech.' Labour MP Yvette Cooper demanded: 'Can he confirm that in fact nobody in Number 10 and nobody in Number 11 actually checked the Conservative Manifesto before he wrote the Budget?' Hammond squirmed, insisting: 'I didn't say that. 'Let me be clear, Laura Kuennssberg was the first person after I spoke , to raise the issue outside.'\nShadow chancellor John McDonnell said: 'This is a humiliating reversal for the Chancellor forced upon him by Labour's opposition.\n'His authority is now shredded after just one Budget, and he tore up a manifesto commitment to do it.'\nHe added: 'This is also the second year we have had a Tory Budget with a black hole in it worth billions. This is not acceptable.\n'What will he do to fill the shortfall in a Budget he delivered less than a week ago without pursuing unfair tax increases or further cuts to public services?\n'As the Budget will still see working people £1,400 worse off under the Government.'\nShadow health secretary Jon Ashworth said: 'So if NICs rise now not happening where is the £2billion for social care coming from?'\nMike Cherry, Federation of Small Businesses chairman, said: 'We are delighted for our members and all the nation's self-employed that the Chancellor has recognised the strong opposition to this measure, admitting it was against the spirit of the Tory manifesto on which his party stood, and has now decided to scrap it for the duration of this parliament.\n'The army of self-employed make a massive contribution to the UK economy.'\nSelf employed builder Terry Christie said he was relieved at the Chancellor's U-turn, admitting the week since the Budget had been full of 'stress and worry'\nAdam Marshall, director general of the British Chambers of Commerce, said: 'The NICs rise, together with the cut to dividend tax-free allowances, was not viewed favourably by entrepreneurs - so this move and pause for thought are welcome.\n'It would be far better to look at business and employment taxation in the round, to ensure that our tax system is competitive and equitable.'\nMrs May defended the changes in a press conference on Thursday but did stall the reforms arrival in Parliament until the autumn.\nMinisters had insisted that because the self employed now receive much more benefit from the state, it was time for them to pay the same National Insurance as those in regular employment.\nLoyal Tory MPs have spent a week defending the measure.\nLoyal Tory MPs have been defending the measure for the past week and the latest twist will irritate MPs. Former minister Ed Vaizey quipped 'blimey\nShadow health secretary Jon Ashworth said: 'So if NICs rise now not happening where is the £2 billion for social care coming from?'\nFormer Minister Ed Vaizey quipped on Twitter: 'Blimey. I've been vigorously defending it...'\nTory MP Anne-Marie Trevelyan revealed the scale of the revolt in a Mail on Sunday column.\nShe said: 'Self-employed people are part of the backbone of our economy. They drive growth and innovation. I firmly believe the Conservative Party should continue to encourage them, rather than increase their tax burden.\n'The increase in Class 4 National Insurance Contributions announced by the Chancellor in his Budget last week did not just concern me because I believe it is wrong in principle.\n'It is also a clear breach of a promise we made in our manifesto not to increase VAT, income tax or National Insurance.'\nAs the row escalated last week, even a Government minister called for an apology.\nGuto Bebb, the junior Wales Office minister, said: 'I will apologise to every voter in Wales that read the Conservative manifesto in the 2015 election.'","url":"https://www.dailymail.co.uk/news/article-4319262/No10-WARNED-Hammond-Budget-tax-raid-bad-idea.html"}
