{"authors":["Press Association"],"date_download":"2018-10-23 01:59:42","date_modify":"2018-10-23 01:59:42","date_publish":"2016-01-29 16:17:36","description":"Downing Street has rejected a Labour MP's claim that women on the streets of British cities are subjected to mass sexual harassment of the kind seen in Germa...","filename":"data/vaneerConsumption/No10rejectslabourmpsclaimsovermasssexualharassmentinuk.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-294080d8-b922-4626-8ab3-f71f98bc0596-4PuZeKVXE7cd9005b2c876c24885-542_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3423012_No-10-rejects-Labour-MPs-claims-mass-sexual-harassment-UK_1540259982.html","title":"No 10 rejects labour mp's claims over mass sexual harassment in uk","title_page":"No 10 rejects labour mp's claims over mass sexual harassment in uk | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"No 10 rejects Labour MP's claims over mass sexual harassment in UK\nDowning Street has rejected a Labour MP's claim that women on the streets of British cities are subjected to mass sexual harassment of the kind seen in Germany on New Year's Eve.\nBirmingham Yardley MP Jess Phillips said that Britain could not \"rest on our laurels\" over its record of protecting women, when two are murdered on average every week.\nRecent migrants from the Middle East and north Africa were widely blamed for organised attacks on women in Cologne, where more than 800 women claimed they were sexually assaulted or robbed by mobs of young men.\nJess Phillips claimed women in Birmingham are subjected to sexual harassment similar to that seen in Cologne on New Year's Eve\nBut Ms Phillips told BBC1's Question Time that similar scenes were regularly witnessed in Britain's second city.\n\"A very similar situation to what happened in Cologne could be described on Broad Street in Birmingham, every week, where women are baited and heckled,\" said the MP.\n\"We should be careful in this country before we rest on our laurels, when two women are murdered ever week.\"\nHer comments sparked outrage among some Twitter users, with one describing them as \"a disgraceful slur against the streets of Birmingham\" and another saying she had \"trashed her home city\". However, another said: \"Jess Phillips was right in what she said - It's very sad woman should be subjected like this, but it has always been like this.\"\nWest Midlands Police inspector Gareth Morris acknowledged that the city centre experiences \"issues associated with the night-time economy\" but insisted it was \"a safe, positive and vibrant place for people to visit\". Sexual offences on Broad Street itself were down by more than 20% this year.\nWith more than eight million visitors a year, the area had seen 31 serious sexual offences, said Insp Morris, adding: \"W hilst even one offence is too many, these are extremely low against sheer numbers of people visiting.\"\nAnd he said: \"There is certainly nothing to suggest any crime patterns or trends related to immigration.\"\nAsked whether Prime Minister David Cameron believed that problems equivalent to those experienced in Cologne were taking place in Birmingham and other cities in the UK, a Downing Street spokesman replied: \"No.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3423012/No-10-rejects-Labour-MPs-claims-mass-sexual-harassment-UK.html"}
