{"authors":["James Delingpole"],"date_download":"2018-10-30 22:14:11","date_modify":"2018-10-30 22:14:11","date_publish":"2015-10-29 14:42:47","description":"The US government's main climate research agency has refused to release key documents concerning whether there has been a \"pause\" in global warming.","filename":"data/vaneerConsumption/NOAAAttemptsToHideThePauseInGlobalWarmingTheMostDisgracefulCoverUpSinceClimategate.json","image_url":"https://media.breitbart.com/media/2015/10/noaa.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_29__1540937651.html","title":"NOAA Attempts To Hide The Pause In Global Warming: The Most Disgraceful Cover-Up Since Climategate","title_page":"NOAA Attempts To Hide The Pause In Global Warming: The Most Disgraceful Cover-Up Since Climategate","title_rss":"NULL","source_domain":"breitbart.com","text":"The US government’s main climate research agency has refused a request by House Republicans to release key documents concerning the controversial issue of whether or not there has been a “pause” in global warming.\nDespite being a public, taxpayer-funded institution, the National Oceanic and Atmospheric Administration (NOAA) insists that it is under no obligation to provide the research papers, as demanded in a subpoena by Rep Lamar Smith (R-Texas).\nGosh. What vital information of national secrecy importance could NOAA possibly have to hide?\nThat question is entirely rhetorical, by the way. The answer is obvious – well known to every one within the climate change research community. And the whole business stinks. When these documents are released, as eventually they surely must be, what will become evident is that this represents the most disgraceful official cover-up by the politicized science establishment since the release of the Climategate emails.\nAt the root of the issue is the inconvenient truth that there has been no “global warming” since January 1997.\nThis is clearly shown by the most reliable global temperature dataset – the RSS satellite records – and was even grudgingly acknowledged in the most recent Intergovernmental Panel on Climate Change (IPCC) Assessment report. While still insisting that there has been a slight warming – an increase, since 1998, of around 0.05 degrees C per decade – the IPCC had in all honesty to admit that this is smaller than the 0.1 degrees C error range for thermometer readings, and consequently statistically insignificant.\nBut if there has been no “global warming” for nearly 19 years how can alarmist proselytisers like President Obama and John Kerry possibly hope to convince an increasingly skeptical public that this apparently non-existent problem yet remains the most pressing concern of our age?”\nStep forward the Obama administration’s helpful friends at NOAA. It’s not supposed to be a politicized institution: its job is to do science, not propaganda. But the memo must have been missed by NOAA scientists Thomas Karl and Thomas Peterson who, in May this year, published a “study” so favourable to the alarmist cause it might just as well have been scripted by Al Gore and Greenpeace, with a royal foreword by the Prince of Wales, and a blessing from Pope Francis.\n“Data show no slowdown in recent global warming” declared NOAA’s press release. “The Pause”, in other words, was just the construct of a few warped deniers’ twisted imaginations.\nNaturally this new “evidence” was seized on with alacrity by the usual media suspects.\n“No Pause in global warming” crowed Scientific American. “Global warming hasn’t paused, study finds” echoed the Guardian.\nBut as I reported at the time – in a piece titled “‘Hide the Hiatus!’ How the Climate Alarmists Eliminated the Inconvenient ‘Pause’ in Global Warming” – there was precious little hard science in this swiftly-debunked “study”.\nRather, it was a case of “getting your excuses in early before the UN climate conference in Paris in December.”\nOr, as Judy Curry of Georgia Tech put it:\n“This short paper is not adequate to explain the very large changes that have been made to the NOAA data set… while I’m sure this latest analysis from NOAA will be regarded as politically useful for the Obama administration [which is currently bent on using executive action to set unilateral emissions limits against the will of Congress], I don’t regard it as a particularly useful contribution to our scientific understanding of what is going on.”\nWhich is the real reason, of course, that NOAA is so reluctant to respond to Rep Lamar Smith’s subpoena. As will almost certainly become clear, NOAA’s study was a nakedly political artefact not a scientific one.\nAlarmist sympathizers such as Rep. Eddie Bernice Johnson (D-Texas) may claim that the subpoena constitutes harassment:\n“By issuing this subpoena, you have instigated a constitutional conflict with an inquiry that seems more designed to harass climate scientists than to further any legitimate legislative purpose,” she wrote last week. “This is a serious misuse of congressional oversight powers.”\nBut this is a standard trick in the climate alarmist playbook. The same excuse was trotted out by Michael Mann when Steve McIntyre tried – unsuccessfully – to ask him to share the raw data he had used to create his infamous “Hockey Stick”; it was also employed by another notorious figure from the Climategate emails – Phil Jones of the Climatic Research Unit at the University of East Anglia – as part of a campaign to present himself as an innocent victim of harassment rather than an FOI-breaching, data-fudging, grant-troughing conspirator in the great global warming scam.\nAs I revealed in my book Watermelons: How Environmentalists Are Killing The Planet, Destroying The Economy And Stealing Your Children’s Future, the climate change scam has only been able to keep going for so long because of the complicity of the politicized activist-scientists who have hijacked every one of the world’s leading scientific institutions from NASA GISS, NOAA, and the National Academy of Sciences in the US to the Royal Society and the CRU in Britain to CSIRO in Australia. They endorse one another’s scientifically dubious papers (not so much “peer-review” as “pal review”), they recommend one another for awards, they big one another up at fancy all-expenses-paid climate “science” junkets all around the globe.\nAnd the longer they have got away with it, the more shameless they have become. To give you an idea of how unrepentantly biased NOAA’s Thomas Peterson is here – courtesy of Watts Up With That? – is a cartoon he circulated in 2009, while working on the taxpayers’ dime, in which he ridiculed climate skeptics as a bunch of loons.\nThis has nothing to do with science. This is pure political activism. Rep Lamar Smith is quite right to investigate this grotesque abuse of taxpayers’ money and this flagrant corruption of the scientific method at NOAA. I think we can safely bet, however, that NOAA will find a way of staving off his investigation until after the UN Paris talks are over and that the Obama administration will do everything in its power to support its stonewalling.\n“The Pause”, as most alarmists are painfully aware, represents the last nail in the coffin of man-made global warming theory. That’s why they’ll go on fighting so hard to pretend it doesn’t exist.","url":"https://www.breitbart.com/politics/2015/10/29/noaa-attempts-hide-pause-global-warming-disgraceful-cover-since-climategate/"}
