{"authors":["Allyson Koerner"],"date_download":"2018-10-31 01:47:27","date_modify":"2018-10-31 01:47:27","date_publish":"2018-08-27 18:53:26","description":"Celebrities aren't strangers to having someone gain access to their social media accounts without permission. According to Cosmopolitan, To All The Boys I've Loved Before star Noah Centineo's Instagram got hacked on Sunday. As frustrating as it…","filename":"data/vaneerConsumption/NoahCentineosInstagramWasHackedTheToAllTheBoysIveLovedBeforeStarHandledItLikeAPro.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/d86ceb1e-b271-492b-8983-fda935b6e342-getty-1017901910.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_noah-centineos-instagram-was-hacked-the-to-all-the-boys-ive-loved-before-star-handled-it-like-a-pro-10251020_1540950447.html","title":"Noah Centineo's Instagram Was Hacked & The 'To All The Boys I've Loved Before' Star Handled It Like A Pro","title_page":"Noah Centineo's Instagram Was Hacked & The 'To All The Boys I've Loved Before' Star Handled It Like A Pro","title_rss":"NULL","source_domain":"bustle.com","text":"Celebrities aren't strangers to having someone gain access to their social media accounts without permission. According to Cosmopolitan, To All The Boys I've Loved Before star Noah Centineo's Instagram got hacked on Sunday. As frustrating as it sounds to have your privacy violated like that, Centineo has regained full control of his Instagram and also handled the situation like a complete professional.\n\"I want to apologize if the hackers contacted any of you guys through my DMs,\" Centineo said on his Instagram Story on Monday. \"It’s not cool, really skeevy, and f*cking disgusting. Sorry about that.\"\nPer Cosmo, posts offering free iPhones to his followers appeared on the 22-year-old actor's Instagram Story. Apparently, one of the messages read, \"Heyyy guys! I'm giving away 450 Free!! iPhone X's and Apple Watches on my Instagram Stories RIGHT NOW!! Claim one before they're all gone! Love you guys so much! [four heart emojis] xx.\"\nAs reported by Seventeen, another post on Centineo's Instagram Story told followers to \"swipe up\" in order to claim their free iPhone X and that there was a \"limited stock.\"\nSoon after the Netflix star's account was hacked, he took to Twitter to warn everyone about the incident. \"Unfortunately I have absolutely no IPhone X’s to giveaway,\" he tweeted on Aug. 27. \"Which leads me to my next point, My instagram is Hacked [heart emoji].\"\nEarly on Monday morning, Centineo alerted his fans that he regained access and control of his Instagram. He tweeted, \"Two-step Verification I needed that sh*t. But we back now [thumbs up emoji].\"\nIt seems Centineo turned on two-step verification for his Instagram as a way to hopefully protect his account from being hacked in the future. Two-step verification is simply a process involving two authentication methods, like entering a code that is sent to the individual via text, as a way to verify the user of that account is the one requesting access. Hopefully, Centineo won't have any further issues.\nCompared to how most people might react to this type of invasion of privacy, Centineo was so chill about the ordeal. Granted, his hacking could've been much worse, like other celebs have dealt with, which may have resulted in a different reaction from the actor. Thankfully, the hackers didn't seem to do any real harm or damage causing Centineo to take a more relaxed approach to the situation.\nTo be clear, yes, Centineo wasn't happy, as he expressed on his IG Story. He even called the hackers' actions \"not cool, skeevy, and f*cking disgusting.\" However, Centineo briefly discussed the situation in such a totally calm way. As seen on his Instagram Story, the now beloved actor delivered his apology to his followers after just waking up and sporting out-of-control bed head, which he totally rocks, by the way.\nBefore he even mentioned his account being hacked, Centineo posted two unrelated videos onto his Story. Here's one of the messages:\n\"Good morning to everybody. It's Monday. You guys, some of you, are at school. That's fun, try not to get caught and kicked out of class or your phone taken away from watching this video. The rest of you that are home or skipping, I love you too.\"\nHe ended the following video by blowing a kiss. Have you ever seen a celebrity respond to their social media being hacked this way?\nOf course, the actor was probably concerned about the hackers, but he didn't show any ounce of panic on social media. Heck, he even used a heart emoji when confirming his Instagram got hacked. Centineo was apparently all about staying true to his totally chill and lovable ways.","url":"https://www.bustle.com/p/noah-centineos-instagram-was-hacked-the-to-all-the-boys-ive-loved-before-star-handled-it-like-a-pro-10251020"}
