{"authors":["Parry Ernsberger"],"date_download":"2018-10-31 01:44:20","date_modify":"2018-10-31 01:44:20","date_publish":"2018-09-06 18:15:52","description":"If you've found yourself pining for Peter Kavinsky (played by Noah Centineo) after watching To All The Boys I've Loved Before, well, you're not alone. He's super swoon-worthy, and has kind of become the new paragon of boyfriends. Centineo supports…","filename":"data/vaneerConsumption/NoahCentineoSupportsToAllTheBoysILoveBeforeFansFindingTheirOwnPeterKavinsky.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/fdec285c-7bdd-4864-9ce2-af8ce9369177-getty-1025450200.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_noah-centineo-supports-to-all-the-boys-i-love-before-fans-finding-their-own-peter-kavinsky-11773602_1540950260.html","title":"Noah Centineo Supports 'To All The Boys I Love Before' Fans Finding Their Own Peter Kavinsky","title_page":"Noah Centineo Supports 'To All The Boys I Love Before' Fans Finding Their Own Peter Kavinsky","title_rss":"NULL","source_domain":"bustle.com","text":"If you've found yourself pining for Peter Kavinsky (played by Noah Centineo) after watching To All The Boys I've Loved Before, well, you're not alone. He's super swoon-worthy, and has kind of become the new paragon of boyfriends. Centineo supports fans finding their own Peter Kavinsky, he recently told Teen Vogue, and totally understands what makes his character so undeniably appealing.\nIt kind of felt like To All The Boys — which was based off the eponymous book series by Jenny Han — was an overnight sensation. Its cast of rising stars was thrust into the spotlight almost immediately after the rom-com dropped, and the interest in Centineo and Lana Condor (who plays Lara Jean), in particular, has yet to quiet down.\nWhen Teen Vogue told Centineo that fans of the film had become determined to find a Peter Kavinsky-esque love of their own, he sweetly replied, \"Really? I love that.\" The 22-year-old actor continued,\n\"I think it's cool, man. I feel like as far as relating to someone, I think Lara Jean and Peter Kavinsky really relate to each other and have such a beautiful dynamic by the end of the film. To find that, I'm totally behind that concept. Finding your own Peter Kavinsky, finding your own Lara Jean. I'm 100% behind that.\"\nTo reiterate, though, Centineo supports the idea of fans finding someone who they get along with like Peter gets along with Lara Jean. By no means was he encouraging everyone to go out and find him — the actor who plays Peter Kavinsky in a fictional film — specifically. Stalking is bad.\nWhile Centineo may think that his popularity is fleeting — \"maybe getting a Peter Kavinsky is a goal now,\" he told Teen Vogue, \"but I wouldn't be surprised if a week from now it really dies down\" — he also understands why fans have felt such a strong connection to the film and its characters.\n\"Lara Jean, I feel like everyone can relate to. She's a girl dealing with insecurities and fears, and then she gets swept up in this romance,\" he told the publication. \"It's the same with Peter. He's this sensitive person deep down, and this man that can protect you, but who also knows how to connect with you on an emotional and mental level.\"\nSeeing that kind of vulnerability in fictional male protagonists is somewhat of a rarity these days, Centineo mused, and continued to explain,\n\"'To All The Boys' is one film amongst a couple other romantic comedies through the decades that promotes ... I don't know what they're calling it. A modern man? A man that's more emotionally accessible and available, and willing to communicate and actually care and nurture. And I think maybe that's why people really connect with both these characters.\"\nSounds about right. As for Centineo, himself, he's still on the look-out for his own rom-com-like love story. The actor recently confirmed that he's currently single, but again — don't go hunting Centineo down. Maybe just try to find yourself a person who looks at you the way Peter looks at Lara Jean. #Goals","url":"https://www.bustle.com/p/noah-centineo-supports-to-all-the-boys-i-love-before-fans-finding-their-own-peter-kavinsky-11773602"}
