{"authors":["Samantha Raphelson"],"date_download":"2018-10-22 23:11:01","date_modify":"2018-10-22 23:11:01","date_publish":"2018-08-24 00:00:00","description":"While the study's authors acknowledge moderate drinking may protect some people against heart disease, these potential benefits do not outweigh the risks of cancer and other diseases.","filename":"data/vaneerConsumption/NoAmountOfAlcoholIsGoodForYourHealthGlobalStudySays.json","image_url":"https://media.npr.org/assets/img/2018/08/24/gettyimages-994655446_wide-5b7905534e634db704bb842cd43313eacd21f857.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_24_641618937_no-amount-of-alcohol-is-good-for-your-health-global-study-claims_1540249861.html","title":"No Amount Of Alcohol Is Good For Your Health, Global Study Says","title_page":"No Amount Of Alcohol Is Good For Your Health, Global Study Says : NPR","title_rss":"NULL","source_domain":"npr.org","text":"No Amount Of Alcohol Is Good For Your Health, Global Study Says\nEnlarge this image toggle caption Peter Forest/Getty Images for Starz Peter Forest/Getty Images for Starz\nCountless scientific studies have espoused the idea that a glass of red wine a day can be good for the heart, but a new, sweeping global study published in The Lancet on Friday rejects the notion that any drinking can be healthy.\nNo amount of alcohol is safe, according to The Global Burden of Diseases study, which analyzed levels of alcohol use and its health effects in 195 countries from 1990 to 2016.\nWhile the study's authors say that moderate drinking may safeguard people against heart disease, they found that the potential to develop cancer and other diseases offsets these potential benefits, as do other risks of harm. The report urges governments to revise health guidelines to suggest lower levels of consumption.\n\"Our results show that the safest level of drinking is none,\" the report states. \"This level is in conflict with most health guidelines, which espouse health benefits associated with consuming up to two drinks per day.\"\nThe study looked at a broad range of risks posed by alcohol consumption, including diseases, driving accidents and self-harm. According to the report, alcohol led to 2.8 million deaths in 2016. It was the leading risk factor for disease worldwide, the study found, accounting for almost 10 percent of deaths among those ages 15 to 49.\nFor younger people, the three leading causes of death linked to alcohol use were tuberculosis, road injuries and self-harm, according to the study. Drinking alcohol was also a leading cause of cancer for people older than 50.\nDespite the study's uncompromising message, some critics say its conclusions may be overblown. Claiming there is no safe level of alcohol consumption is not a compelling argument for people to stop drinking altogether, says David Spiegelhalter, the Winton professor for the public understanding of risk at the University of Cambridge\n\"There is no safe level of driving, but governments do not recommend that people avoid driving,\" Spiegelhalter told the BBC. \"Come to think of it, there is no safe level of living, but nobody would recommend abstention.\"\nIn the U.S., social acceptance of alcohol is at a high point. Some states have liberalized their drinking laws. For instance, New York passed a law in 2016 to allow restaurants to sell alcohol earlier on Sundays. And Georgia this year passed what was dubbed the \"mimosa mandate.\"\nThis may send a message that alcohol consumption is OK, experts say, but they warn that about 5 percent of cancers are linked to alcohol. The American Cancer Society of Clinical Oncology, a group of cancer doctors, has been working to raise awareness about the risks of excessive drinking.\nThe Centers for Disease Control and Prevention currently recommends women limit alcohol consumption to one drink per day and men two drinks per day, but it's easy to unknowingly go over these limits. A drink is 5 ounces of wine, 12 ounces of beer that contains 5 percent alcohol, or one shot of liquor, though many mixed drinks contain more than one shot and some craft beers contain higher levels of alcohol.\nThe study found that worldwide, about 1 in 3 people drink alcohol and that 25 percent of women and 39 percent of men are drinkers. Women consume an average of 0.73 drinks per day, while men drink about 1.7 each day. The study also finds what lots of prior research has shown: The more people drink, the higher their risk of alcohol-related health problems.\nAt the same time, many cancer doctors acknowledge that moderate alcohol consumption may be safe, says Noelle LoConte, an oncologist and associate professor at the University of Wisconsin.\n\"We're not proponents of complete abstinence. There probably is an amount of drinking that's OK,\" LoConte told NPR in June. \"But from a cancer-prevention standpoint, drinking the least amount of alcohol possible would be the best strategy.\"","url":"https://www.npr.org/2018/08/24/641618937/no-amount-of-alcohol-is-good-for-your-health-global-study-claims"}
