{"authors":[],"date_download":"2018-10-30 18:38:22","date_modify":"2018-10-30 18:38:22","date_publish":"2016-12-13 15:58:00","description":"Police have made no arrests after a fatal shooting outside an Atlanta recording studio Monday night.","filename":"data/vaneerConsumption/NoarrestsaftermankilledatAtlantarecordingstudio.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/13/Images/newsEngin.17123163_homicide.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_arrests-aft_c0724a62370edca15ac947ae82544928__1540924702.html","title":"No arrests after man killed at Atlanta recording studio","title_page":"No arrests after man killed at Atlanta recording studio","title_rss":"NULL","source_domain":"ajc.com","text":"Police have made no arrests after a fatal shooting outside an Atlanta recording studio Monday night.\nThe incident happened shortly after 8 p.m. in The Metropolitan recording studio in southwest Atlanta, police spokesman Officer Donald Hannah said.\nA man, later identified as 23-year-old Joshua Sherrod of Atlanta was found dead, shot multiple times.\nHannah said police were told the Sherrod recently visited one of the recording studios in the area, but he was shot and killed outside.\n\"Currently, we have not drawn a connection between any occurrences inside the studio and the homicide that occurred,\" Hannah said.\nLt. Charles Hampton told Channel 2 Action News the shooting appears deliberate.\n“It appears that the victim was the intended target, but we still have a lot of work to do right now,” Hampton said.\nPolice say they do not have anyone in custody and they are still working on a motive behind the shooting.\nPotential witnesses who quickly left the scene in cars are asked to contact police.\n“I’m not going to say that it’s related, or that cars leaving was related; that’s why we’re asking anyone who was here, if they know or heard anything, to give us a call,” Hampton told Channel 2.\nAnyone with information is asked to call Crime Stoppers at 404-577-8477.\nNathan Shannon, 27, of Atlanta, was one of two people killed in April when gunfire erupted at the same southwest Atlanta recording studio. Jerome Blake, 28, was the second victim of that shooting.\nBlake’s family says he was a rapper. His first time at the studio was the night he was killed.\nMORE: Rapper Bankroll Fresh killed in shooting at Atlanta studio","url":"https://www.ajc.com/news/crime--law/arrests-after-man-killed-outside-atlanta-recording-studio/ClP8ro5hgEouTOtoR8CrWJ/"}
