{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:53:11","date_modify":"2018-10-30 20:53:11","date_publish":"2016-12-24 00:00:00","description":"Angus Deaton said in an interview that he thinks innovations like driverless cars could destroy jobs.","filename":"data/vaneerConsumption/NobelEconomistAngusDeatononhowroboticsthreatensjobs.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_nobel-economist-angus-deaton-on-how-robotics-threatens-jobs-2016-12_1540932791.html","title":"Nobel Economist Angus Deaton on how robotics threatens jobs","title_page":"    Nobel Economist Angus Deaton on how robotics threatens jobs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Economist Angus Deaton. REUTERS/Dominick Reuter A Nobel Prize-winning economist has warned that the rise in robotics and automation could destroy millions of jobs across the world.\nAngus Deaton, who won the Nobel Prize last year for his work on health, wealth, and inequality, told the Financial Times he believes robots are a much greater threat to employment in the US than globalisation.\nAddressing the theory that Donald Trump's victory in the US presidential elections was fueled by a backlash against globalisation, Deaton told the FT: \"Globalisation for me seems to be not first-order harm and I find it very hard not to think about the billion people who have been dragged out of poverty as a result. I don't think that globalisation is anywhere near the threat that robots are.\"\nHe added: \"It's hard to think that Mark Zuckerberg is actually impoverishing anyone by getting rich with Facebook. But driverless cars are another matter entirely.\"\nObama's White House warned on Thursday that advances in artificial intelligence and robotics have the potential to wipe out millions of jobs in factories and industries like trucking, potentially increasing inequality.\nThe World Economic Forum (WEF) predicted a \"Fourth Industrial Revolution\" at the start of this year, as automation and robotics transform the global economy and the way we work. WEF expects 5 million jobs to be destroyed by 2020 by the trends. An in-depth study by Citi and Oxford University also found that 77% of all jobs in China are at risk of automation and 57% of all jobs across the OECD.\nChanges are already starting to be seen. Foxconn, a key manufacturing partner for Apple, Google, Amazon, and the world's 10th largest employer, has already replaced 60,000 workers with robots. And two of the world's ten largest employers globally — Walmart and the US Department of Defence — are using drones, for warehouse delivery and surveillance respectively.\nYou can read the full FT interview with Deaton here.","url":"https://www.businessinsider.com/nobel-economist-angus-deaton-on-how-robotics-threatens-jobs-2016-12"}
