{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:10:57","date_modify":"2018-10-30 20:10:57","date_publish":"2015-01-24 00:03:17","description":"In the continuing saga of the failure of House Republican leadership to pass a bill that would ban late-term abortions in the United States after the fifth month of pregnancy, Sen. Lindsey Graham (R-SC), who has sponsored the bill in the Senate, now says the measure should not move ahead without changes to language about rape. |","filename":"data/vaneerConsumption/NobodysForRape.json","image_url":"https://media.breitbart.com/media/2015/01/lindsay-graham-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_23__1540930257.html","title":"‘Nobody’s For Rape’","title_page":"Lindsey Graham on Abortion Bill: ‘Nobody’s For Rape’","title_rss":"NULL","source_domain":"breitbart.com","text":"In the continuing saga of the failure of House Republican leadership to pass a bill that would ban late-term abortions in the United States after the fifth month of pregnancy, Sen. Lindsey Graham (R-SC), who has sponsored the bill in the Senate, now says the measure should not move ahead without changes to language about rape.\nRep. Renee Ellmers (R-NC) and a group of other House Republicans were effective in having the bill, called the Pain Capable Unborn Child Protection Act, pulled on the eve of the March for Life in Washington, D.C. Graham said, according to Niels Lesniewski at Roll Call, “This is going to be about wholesale abortions on demand in 20 weeks, five months into pregnancy, and it won’t be about rape. Nobody’s for rape.”\nHouse Republican leader Cathy McMorris Rodgers told Breitbart News at the March for Life Thursday, “We’re going to have to keep working through the language to get us to a place where we are unified in the support for this bill and moving it forward.”\nAccording to Roll Call, Graham says he will bring the bill to the Senate floor after changes are made.\n“Somebody in the House put a provision in there, if you didn’t report the rape to law enforcement, then it’s not going to be considered a legitimate rape. Well, that’s ridiculous,” Graham said. “I’ve been, you know, in criminal law all my life, and the vast majority of women who are raped don’t report it, so we’re not going to go down that road.”\nGraham, however, introduced the Senate version of the Pain Capable legislation – after the House passed its bill last year – with the same language in it.\n“We’re going to fix it. I really, didn’t really pick that up. Quite frankly, it passed the House, but they used some law enforcement definition,” Graham said. “I’m a traditional Hyde amendment guy.”\nSpeaking with Breitbart News about the GOP cave on the Pain Capable bill at the Students for Life (SFLA) Conference on Friday, SFLA president Kristan Hawkins said Republican House leadership has broken a trust with its base.\n“The House has to move fast. That’s the point we made to leaders yesterday – I met with congressional leaders all day yesterday at the March for Life events – they have to work fast to remedy this situation,” she said. “Voters have trusted them to do what they said they would do. This is a campaign promise that a lot of them made to their constituents. And now they’ve broken that trust, and it takes time to build up that relationship again. The first way to start is to pass this bill now.”","url":"https://www.breitbart.com/politics/2015/01/23/lindsey-graham-on-failed-late-term-abortion-bill-nobodys-for-rape/"}
