{"authors":[],"date_download":"2018-10-30 19:38:09","date_modify":"2018-10-30 19:38:09","date_publish":"2018-08-09 19:01:00","description":"ATHENS – There are no questions or controversies any more.","filename":"data/vaneerConsumption/NobodyisdoubtingGeorgiasRodrigoBlankenshipnow.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/09/Images/100117%20Georgia%20photos%20CC1-U46020276585FLR-680x383.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_nobody-doubting-georgia-rodrigo-blankenship-now__1540928289.html","title":"Nobody is doubting Georgia’s Rodrigo Blankenship now","title_page":"Nobody is doubting Georgia’s Rodrigo Blankenship now","title_rss":"NULL","source_domain":"ajc.com","text":"ATHENS – There are no questions or controversies any more. The nicknames aren’t even necessary. At this point, there is only a growing legend of Rodrigo Blankenship.\nFor the first time since he showed up on campus three years ago, Blankenship is not having to prove anything to anybody anymore. He entered Georgia’s preseason camp not only as the undisputed place-kicker, but also as one who was carrying a quite a bit of expectations.\nBut after last season, who could doubt him?\nAs a redshirt sophomore, this former walkon went from being beloved for his quirkiness and grit to being a certified offensive weapon the Bulldogs were just waiting to unleash. And he seemed to only get better as the stakes rose throughout the season.\nIn fact, if it hadn’t been for that dreaded Alabama pass on second-and-26 in overtime, Blankenship would be forever known as the hero of Georgia’s 2017 national championship. The Marietta native drilled a 51-yard field goal in overtime that gave the Bulldogs a 23-20 lead. But only minutes later, Alabama’s Tua Tagovailova connected with DeVonta Smith for a 41-yard touchdown, and Georgia fell 26-23.\n“I just went out on the field thinking, ‘all right, I need to come through for my team and give them everything I’ve got,’ ” Blankenship said after the game.\nBlankenship did that all year. That 51-yarder was the third field goal Blankenship made in the title game, fifth overall in the playoffs and second of more than 50 yards. Blankenship also nailed a Rose Bowl record 55-yarder as time expired in the first half against Oklahoma. That proved to be the tide-turner in the national semifinal as the Bulldogs came roaring back in the second half on the way to a double-overtime victory.\nAnd so it went. Everything Blankenship did in 2017 seemed to come with drama attached. His 30-yarder with 3:34 remaining against Notre Dame in South Bend in September proved to be the game-winner in a nationally-televised 20-19 victory. Afterward, Blankenship was the focus of a mob celebration in the Georgia locker room as players were informed he finally had been placed on scholarship just a day earlier.\nHopefully by now Blankenship has copyrighted the monikers of “Hot Rod” and “Mr. Rec Specs” for which he is so well known. But perhaps he should add something that reflects his ability to come through in the meaningful moments, something like Drama King or Mr. Clutch.\nBlankenship said he doesn’t go through any special mental gymnastics or rituals to keep him cool in the big moments. He said he simply relies on the knowledge that he is prepared for it.\n“I think that for kickers and punters especially, confidence has to come from mental muscle memory,” Blankenship told reporters back in January. “Just building up that memory over time, especially when you’ve been kicking for a long time like I have. It comes from thousands of reps that you’ve taken in practice and hundreds of reps that you’ve taken in games. Knowing that you’ve put together a body of work that you can be proud of, that’s where it comes from.”\nIt’s hard to remember that Blankenship’s future was so uncertain with the Bulldogs at the beginning. He came from Sprayberry High as a preferred walkon in 2015 with the promise from then-coach Mark Richt of earning a scholarship if he won the starting job. After an initial redshirt season, Blankenship did just that four games into the 2016 season.\nBut Smart was the coach by then, and he made no such promises. In fact, he was openly critical about a lot of shortcomings he saw in Blankenship’s game. He wanted to see consistency and range on placement kicks and demanded more distance on kickoffs. In the meantime, Smart continued to pursue kickers through recruiting and even brought in a couple via transfer.\nAll Blankenship did was go to work on those perceived weaknesses and compete. By the time 2017 came around, they weren’t weaknesses anymore. Blankenship broke Hall of Fame kicker Kevin Butler’s 34-year-old record for touchbacks in a season with 67 in 2017. He was also a perfect 61-of-61 on PATs and 20-of-23 on field goals, including 6-of-9 from 40 or more yards.\n“I would consider it a fairly successful season for me personally,” Blankenship said modestly. “But there was still some goals and benchmarks that the team set for me at the beginning of the season that I didn’t meet.”\nYeah, like he didn’t make them all and the team didn’t win it all. Other than that, Blankenship did all right.\nNow he’s not only considered one of the best kickers in the SEC, but in the country. He’s an early favorite to contend for the Lou Groza Award, which goes annually to the top kicker in the nation. And if the No. 4-ranked Bulldogs do what they’re expected to do this season — play for the 2018 SEC championship and return to the College Football Playoff — such awards should be well within Blankenship’s grasp.\nSo no matter what happens, Rodrigo “Hot Rod” Blankenship will continue to draw attention for his “rec specs” and his specially-ordered pink cleats. But, ultimately, it’ll be the way he actually kicks the football that helps determine whether Georgia “owns the East.”","url":"https://www.ajc.com/sports/nobody-doubting-georgia-rodrigo-blankenship-now/tcOmSNvMbRx2SlZZ9B8ZqL/"}
