{"authors":["Rebecca Hersher"],"date_download":"2018-10-23 00:53:23","date_modify":"2018-10-23 00:53:23","date_publish":"2017-03-28 00:00:00","description":"A task force says there is not enough evidence to recommend testing, or not testing, people with no symptoms for celiac disease, and that people who think they do have symptoms should see a doctor.","filename":"data/vaneerConsumption/NoCeliacScreeningForThoseWithoutSymptomsTaskForceSaysShots.json","image_url":"https://media.npr.org/assets/img/2017/03/28/celiac-testing_wide-0b4421b5e6e05aca80ec3c4a6116ad7d35698a73.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2017_03_28_521660924_no-need-to-get-screened-for-celiac-unless-you-have-symptoms-panel-says_1540256003.html","title":"No Celiac Screening For Those Without Symptoms, Task Force Says : Shots","title_page":"No Celiac Screening For Those Without Symptoms, Task Force Says : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"No Need To Get Screened For Celiac Unless You Have Symptoms, Panel Says\nEnlarge this image toggle caption Andrew Brookes/Cultura RF/Getty Images Andrew Brookes/Cultura RF/Getty Images\nCeliac disease, the autoimmune disorder that prevents people from digesting gluten, affects about 1 percent of the population.\nBut there's not enough evidence to recommend screening everybody to find that 1 percent, an advisory panel said Tuesday.\nIn people with celiac disease, eating foods with gluten inflames the lining of the intestine and makes it difficult to absorb nutrients. People who are diagnosed with the condition are told to cut gluten out of their diets entirely, which can be difficult and expensive, even as gluten-free products have become more widely available.\nGluten is found in wheat, barley and rye, and those three grains are found in an awfully large number of prepared and processed foods.\n\"Gluten-free diets are widely promoted, and I think a lot of individuals question and ask and wonder if gluten is bad for their health,\" says Dr. Alexander Krist, a family physician in Fairfax, Va., and a member of the U.S. Preventive Services Task Force, an independent group that evaluates the effectiveness of preventive treatments.\n\"It's not uncommon for people to come to the doctor and ask if they should be avoiding gluten, and if they might have celiac disease and if they should be tested.\"\nOn Tuesday, the task force announced there is not enough evidence to recommend, or not recommend, that patients without symptoms of celiac disease should be screened for the condition.\n\"There are a group of individuals who have asymptomatic celiac or have subtle symptoms,\" says Krist. \"Our main message is just that there really isn't evidence right now to say whether checking people if they don't have any signs or symptoms is beneficial.\"\nThe subtler symptoms of celiac disease include common things like abdominal pain, gas and diarrhea, so the task force's findings could still lead to more people getting tested.\nThe task force is also calling for more studies, especially of people who are at higher risk for celiac, including those with family members who have already been diagnosed and people with Type 1 diabetes.\nAs for consumers, Krist says, \"If you're concerned that you might have celiac disease, or that you're having symptoms of celiac disease, I'd encourage people to talk with their doctor and to figure out what's right for them.\"\nDr. Ivor Hill directs the Celiac Disease Center at Nationwide Children's hospital in Columbus, Ohio. He says it's a challenge for physicians to figure out whether to test a patient for celiac disease, given the wide range of symptoms associated with the condition.\n\"It's extremely weird in its clinical presentation,\" he explains. \"Although the disease affects the intestinal system, in fact more than half of patients have symptoms that are not even related to the gastrointestinal tract.\"\nFor example, people with celiac can suffer from anemia, weight loss, diarrhea, abdominal pain, chronic fatigue, osteoporosis, infertility and peripheral neurological problems.\nHe says the medical community is still split over how to handle people who do not have clear symptoms of celiac disease but are at higher risk for the condition.\n\"I think you'll get people on both sides of the fence who deal with celiac disease,\" Hill says. \"There are those that avidly recommend everybody should be screened, and others who say, 'No, because we don't know, [I'd] rather follow those people closely and, if they develop symptoms, consider screening.' \"\nHill says he generally lets patients choose. For example, if a child is diagnosed with celiac disease, parents wonder often whether to test their other children immediately, or test them only if symptoms of the condition emerge later. Hill says he generally tells them there is no evidence that either decision is harmful or beneficial, and they should choose whichever is right for them.\nThe primary test for celiac disease is simple blood test to look for the presence of an antibody that shows up in almost all people with celiac disease who are eating a diet that contains gluten. The tTG-IgA test, as it is called, is often covered by insurance for people with symptoms of celiac disease.\nDr. Joseph Murray, a celiac specialist and researcher at the Mayo Clinic in Rochester, Minn., warns that recognizing symptoms can be difficult for patients.\n\"There are a lot of people out there who might have symptoms but they don't associate them with celiac disease,\" he says. \"They might be living with symptoms without knowing it. Maybe they move their bowels and it stinks so bad, you'd think something died up there. Or they have chronic fatigue, but maybe they attribute it to something else.\"\nFor that reason, Murray thinks doctors need to increase their level of suspicion when it comes to diagnosing celiac disease.\nAnd, in an editorial accompanying the task force announcement published in the Journal of the American Medical Association, Murray and co-author Rok Seon Choung write:\n\"Patients with atypical or nonspecific symptoms often report a delay in diagnosis of celiac disease that may last for years. Thus, screening would enable the earlier detection of symptomatic but undetected celiac disease and shorten the duration of symptoms.\"\nSince the blood test is relatively cheap and non-invasive, and gluten-free food is easier to find than ever before, Murray says the medical community must come up with better data to decide who should be screened and treated for celiac disease.\nFor people who are concerned they might have celiac disease, Murray has the same advice as Krist and Hill: Go see your doctor.","url":"https://www.npr.org/sections/health-shots/2017/03/28/521660924/no-need-to-get-screened-for-celiac-unless-you-have-symptoms-panel-says"}
