{"authors":["Associated Press"],"date_download":"2018-10-23 03:29:04","date_modify":"2018-10-23 03:29:04","date_publish":"2017-03-16 14:19:16","description":"NEW YORK (AP) - State and federal investigations of Mayor Bill de Blasio's fundraising will not result in criminal charges against him or others acting on...","filename":"data/vaneerConsumption/NochargestobefiledagainstNYCmayoroverfundraising.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/20/wire-230547-1489694985-950_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320484_Prosecutors-No-charges-filed-against-NYC-mayor_1540265344.html","title":"No charges to be filed against NYC mayor over fundraising","title_page":"No charges to be filed against NYC mayor over fundraising | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - State and federal investigations of Mayor Bill de Blasio's fundraising will not result in criminal charges against him or others acting on his behalf, prosecutors said Thursday as they eliminated an election-year obstacle for the mayor.\nManhattan District Attorney Cyrus Vance said the facts were insufficient to successfully argue a provable violation of state election laws, in part because the parties relied on the advice of attorneys. But he said the actions appear to be \"contrary to the intent and spirit of the law.\"\nDe Blasio said he wasn't surprised he'd be cleared, and he maintained throughout his administration had done nothing wrong.\nFILE - In this Jan. 30, 2017 file photo, New York City Mayor Bill de Blasio testifies during a joint legislative budget hearing on local government in Albany, N.Y. On Thursday, March 16, prosecutors say state and federal probes of de Blasio's fundraising will not result in criminal charges for the mayor or others acting on his behalf. Manhattan District Attorney Cyrus Vance said the facts were insufficient to successfully argue a provable violation of election laws. But he said the actions appear to be \"contrary to the intent and spirit of the law.\" (AP Photo/Hans Pennink)\n\"I fully expected when all was said and done this conclusion would be reached,\" he said during an unrelated news conference. \"My only feeling was we can finally put this behind us and focus on the needs of everyday people.\"\nActing U.S. Attorney Joon H. Kim said a \"thorough investigation\" was conducted into complaints about circumstances in which de Blasio and others solicited donations from individuals who sought official favors from the city. The investigation looked into allegations of misconduct by and on behalf of the Democratic mayor for his 2013 election campaign and the 2014 state Senate effort.\n\"In considering whether to charge individuals with serious public corruption crimes, we take into account, among other things, the high burden of proof, the clarity of existing law, any recent changes in the law, and the particular difficulty in proving criminal intent in corruption schemes where there is no evidence of personal profit,\" he wrote.\nKim said it was rare for his office to issue a public statement about the status of an investigation but believed it appropriate \"in order not to unduly influence the upcoming campaign and mayor election.\" The next mayoral election is in November, and de Blasio thanked prosecutors Thursday for closing the investigation before the election.\nVance said that he would not prosecute allegations of election violations in state Senate races in 2014 but that it didn't mean he condoned the behavior. And he called for the board of elections and the state to consider prohibiting the kind of transactions that were at stake in the probe.\n\"This conclusion is not an endorsement of the conduct at issue; indeed, the transactions appear contrary to the intent and spirit of the laws that impose candidate contribution limits, laws which are meant to prevent 'corruption and the appearance of corruption' in the campaign financing process,\" he wrote in a letter to the state board of elections.\nDe Blasio took issue with that characterization, saying they operated above board always. De Blasio was recently interviewed by federal prosecutors as part of their probe.\nThe state probe stemmed in part from de Blasio's effort in 2014 to raise hundreds of thousands of dollars for Democratic state Senate candidates.\nWhile New York law restricts individual donations to any candidate at just over $10,000, party committees can receive individual donations of more than $100,000, and the committee can then transfer an unrestricted amount to a candidate. But money can't be given to a party committee with the direction that it will be passed on to a particular candidate.\nVance said his probe involved over a million documents from more than 100 individuals and interviews of over 50 people, including City Hall officials, individual and union donors, candidates and campaign managers and political consultants.","url":"https://www.dailymail.co.uk/wires/ap/article-4320484/Prosecutors-No-charges-filed-against-NYC-mayor.html"}
