{"authors":[],"date_download":"2018-10-30 18:34:28","date_modify":"2018-10-30 18:34:28","date_publish":"2017-03-03 23:31:47","description":"After the death of 45-year-old Dwayne Gordon, some friends said the driver who struck him on Glenwood Road kept driving. Police found otherwise.","filename":"data/vaneerConsumption/NochargesfordriverwhohitkilledmancrossingbusyDeKalbroad.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/27/Videos/5338932553001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_charges-for-driv_0e05469b0d97f99e4cf54ca37e730449__1540924468.html","title":"No charges for driver who hit, killed man crossing busy DeKalb road","title_page":"No charges for driver who hit, killed man crossing busy DeKalb road","title_rss":"NULL","source_domain":"ajc.com","text":"After the death of 45-year-old Dwayne Gordon, some friends said the driver who struck him on Glenwood Road kept driving. But DeKalb County police said the evidence has shown otherwise.\n“The driver that struck the pedestrian and caused his death remained at the scene,” Maj. Stephen Fore told The Atlanta Journal-Constitution. “He is not facing any charges.”\nThe crash happened last Saturday night at the intersection of Austin Drive.\nAccording to the incident report, a witness and the driver who struck Gordon said they saw a white vehicle driving erratically before the wreck.\nIt was that white vehicle that kept going as the other driver hit Gordon, they said. The driver who hit him stayed and spoke to police, according to the report.\nGordon allegedly was not in the crosswalk.\nHundreds of people turned out for a vigil Sunday night for Gordon, who friends knew affectionately as “Playa Playa.” Friends and family recalled his colorful outfits and infectious smile as legendary in the Glenwood community, according to Channel 2 Action News.","url":"https://www.ajc.com/news/local/charges-for-driver-who-hit-killed-man-crossing-busy-dekalb-road/FVGP0FXvTw0d5psBr403xH/"}
