{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:02:58","date_modify":"2018-10-30 21:02:58","date_publish":"2015-07-06 16:01:03","description":"The House’s version of the redo, known as the Student Success Act (H.R. 5), was pulled from the House floor by GOP leadership in late February after it was determined the measure lacked sufficient support. Grassroots parents’ groups – many that have been fighting against the Common Core standards in their states – voiced their concerns that the Student Success Act still required excessive federal intrusion into the right of states to set their own education policies. |","filename":"data/vaneerConsumption/NoChildLeftBehindRewritesinHouseandSenateDrawIntenseCriticismFromGrassroots.json","image_url":"https://media.breitbart.com/media/2015/03/american-flag-classroom-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_06__1540933378.html","title":"No Child Left Behind Rewrites in House and Senate Draw Intense Criticism From Grassroots","title_page":"No Child Left Behind Rewrites in House and Senate Draw Intense Criticism From Grassroots | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This week, both the House and Senate will prepare to consider the controversial rewrite of the federal No Child Left Behind (NCLB) law – the current version of the Elementary and Secondary Education Act (ESEA) – at a time when many parents throughout the country would like to completely eliminate the role of the federal government in education.\nThe House’s version of the redo, known as the Student Success Act (H.R. 5), was pulled from the House floor by GOP leadership in late February after it was determined the measure lacked sufficient support. Grassroots parents’ groups – many that have been fighting against the Common Core standards in their states – voiced their concerns that the Student Success Act still required excessive federal intrusion into the right of states to set their own education policies.\nThe Washington Examiner recently reported that although conservative House members say they will not support the measure without significant changes, GOP leaders have said they have no intentions to make alterations to the bill, and plan to put it back on the House floor exactly as it was in February.\nA recent summary of parents’ and other citizens’ concerns posted at American Principles in Action (APIA) cites that although language in H.R. 5 appears to prohibit the U.S. Department of Education (USED) from coercing states into adopting the unpopular Common Core standards, that language “largely replicates existing protections” that have not stopped the education reform initiative from moving forward over the past six years.\nIn addition, other language in H.R. 5 continues to lay out the strings attached when states receive federal funding for education, and although proponents of the legislation observe that states should be held accountable for federal monies received, the Student Success Act still gives the Secretary of Education – currently Arne Duncan – tremendous authority to approve or disapprove of state education plans.\n“Under HR 5, states must submit their state plans to a ‘peer-review process’ before they are presented to the Secretary,” the APIA document states. “This peer-review team, which is appointed by the Secretary, must operate within the highly prescriptive parameters of the federal legislation…”\nThe APIA document also notes that H.R. 5 “removes protection against socioemotional profiling in the statewide assessments and fails to protect against other psychological data-gathering in any other federal education program covered by the Elementary and Secondary Education Act.”\nHigh-stakes testing is still front and center in the Student Success Act, which mandates that schools enforce the requirement that 95 percent of all students take the state assessment – a provision that specifically targets parents’ rights groups and the Opt-Out movement.\nAccording to Education Week, the House will likely consider other amendments this week, including APLUS (Academic Partnerships Lead Us to Success) provisions, which are supported by the Heritage Foundation and would allow states to entirely opt out of federal ESEA programs, permitting them to use their federal funding for any legal education purpose under state law.\n“A-plus isn’t expected to pass, but getting the chance to vote on it could appease conservatives who doomed the last attempt,” reports Education Week in a statement that aptly describes the hostility between establishment Washington politicians and grassroots parents’ groups in the area of education.\nOne politically appealing amendment that is likely to obtain further consideration in the House is one introduced by Rep. Matt Salmon (R-AZ) that would permit parents to opt their children out of state standardized testing.\nSen. Lamar Alexander (R-TN) heads the Senate’s committee that oversees education. Pushing his Every Child Achieves Act (ECAA) of 2015, Alexander writes in an op-ed in The Tennessean that he and ranking committee member Sen. Patty Murray (D-WA) came to the following “consensus:”\nContinue the law’s important measurements of academic progress of students but restore to states, school districts, classroom teachers and parents the responsibility for deciding what to do about improving student achievement. This legislation would end the federal mandate on Common Core — one of many ways it would put decisions about educating Tennessee’s children back in the hands of Gov. Haslam, the Tennessee legislature, our school districts, teachers and parents.\nWriting at Townhall, however, Jane Robbins, senior fellow of American Principles Project, and Heidi Huber, founder of Operation Opt Out Ohio, observe that ECAA “maintains NCLB’s requirement of administering annual assessments in English and math in grades 3 through 8 and once in high school” and actually “adds language that effectively encourages the states to lower the boom on noncompliant students and parents.”\nIn addition, coming from the left will be an amendment to ECAA introduced by Sen. Chris Murphy (D-CT) that will require states to do even more to close the ever-elusive achievement gap with their federal education funding.\n“ECAA also continues to mandate that results of high-stakes assessments be used in state accountability systems,” write Robbins and Huber, noting that the measure “requires states to use assessment scores, progress toward readiness for ‘college and the workforce,’ and high-school graduation rates as a ‘substantial’ portion of a school’s grade.”\n“So not only must states ensure 95% participation in the assessments, they must use the results to rate their schools,” the authors point out.\nOther amendments to the ECAA include a data privacy bill by Sen. David Vitter (R-LA), the establishment of a new federally funded preschool program, and federal childcare subsidies.\nAs the Heritage Foundation observed in June, the federal government already runs 45 early learning and childcare programs, the largest of which is the Head Start program – which costs taxpayers $8 billion and has a rather deplorable track record.\nIn February of 2013 the Obama Department of Health and Human Services (HHS) published a study that found that students who participate in the Head Start program actually fare worse, in some ways, than students who do not.\nThe large-scale study found that children who participated in the Head Start program actually did worse in math and had more problems with social interaction by the third grade than children who were not in the federally funded program.\nFurthermore, teacher reports provided as part of the study demonstrated strong evidence of the Head Start program having an unfavorable impact on the incidence of children’s emotional symptoms, and possible effects on both ability to have close relationships and positive relationships with teachers. The study concluded that, even when some positive effects of participation in Head Start are found in preschool age children, those effects disappear once children enter early elementary school:\nIn terms of children’s well-being, there is also clear evidence that access to Head Start had an impact on children’s language and literacy development while children were in Head Start. These effects, albeit modest in magnitude, were found for both age cohorts during their first year of admission to the Head Start program. However, these early effects rapidly dissipated in elementary school, with only a single impact remaining at the end of 3rd grade for children in each age cohort.\n“Leadership is bull rushing the No Child Left Behind reauthorization bill through,” write Robbins and Huber. “We hope people will realize what’s going on and will demand that Congress prohibit the Feds from dictating to the states how often and in what subjects children must be tested.”","url":"https://www.breitbart.com/politics/2015/07/06/no-child-left-behind-rewrites-in-house-and-senate-draw-intense-criticism-from-grassroots/"}
