{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:21:54","date_modify":"2018-10-30 21:21:54","date_publish":"2015-01-29 14:10:36","description":"Education Commissioner Michael Williams is bracing for the possibility that Texas may lose its No Child Left Behind (NCLB) waiver. State and federal education officials are not seeing eye-to-eye on educator evaluations but is that a bad or good thing? |","filename":"data/vaneerConsumption/NoChildLeftBehindWaiverAtRiskinTexas.json","image_url":"https://media.breitbart.com/media/2015/01/classroom.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_01_29__1540934514.html","title":"'No Child Left Behind' Waiver At Risk in Texas","title_page":"'No Child Left Behind' Waiver At Risk in Texas","title_rss":"NULL","source_domain":"breitbart.com","text":"Education Commissioner Michael Williams is bracing for the possibility that Texas may lose its No Child Left Behind (NCLB) waiver. State and federal education officials are not seeing eye-to-eye on educator evaluations but is that a bad or good thing?\nOn Tuesday, January 27, at the Texas Association of School Administrators (TASA) Midwinter Conference, Williams said Texas could go the way of California and say ‘keep your waiver,’ while emphasizing the state of Texas has not lost it yet, the Austin American-Statesman reported.\nIt is an interesting comparison because California is a Common Core state. However, on the waiver front, the Golden State was ineligible to receive “relief” from NCLB because they did not meet the federal requirements to link teacher evaluations with student outcomes. Eight of its school districts formed a consortium named CORE (California Office to Reform Education) that applied for and were granted the waiver independently. Included were Los Angeles, San Francisco, Oakland, and Santa Ana Unified School Districts.\nThe issue-at-hand in Texas is that the 2013 conditional NCLB waiver is up for renewal. The US Department of Education (USDE) rejected the new teacher and principal evaluation systems the Commissioner presented. If the state loses the waiver, Williams noted more schools would be considered failing and the state would face the prospect of losing billions of dollars in federal education funding, according to the Statesman.\nThis school year, though, the Texas Education Agency (TEA) has been piloting a new Texas Teachers Evaluation and Support System (T-TESS) in school districts as part of the NCLB waiver requirements mandated by the US Department of Education (USDE).\nA key component of this evaluation system is the Value-Added Measure (VAM), a diagnostic tool that US Education Secretary Arne Duncan believed so strongly in that he once threatened to punish Washington state for refusing to adopt this method of evaluating teachers and principals.\nThe teacher and principal job performance tool championed by the USDE is the Education Value-Added Assessment System (EVAAS). It contains VAM but is a different evaluation system than T-TESS.\nWilliams noted that the main criticisms from federal officials and peer reviewers centered on items that would require either statutory changes to TEA authority or specific mandates to all school districts from the state level.\nUSDE Assistant Secretary Deborah Delisle wrote to Williams, “I have determined that Texas has not yet adopted guidelines for teacher and principal evaluation and support systems that meet all requirements of ESEA (Elementary and Secondary Education Act aka NCLB ) flexibility.”\nDelisle was also concerned that there weren’t processes for ensuring that each district in Texas develops, adopts, pilots, and implements teacher and principal evaluation and support systems consistent with those guidelines as required for the NCLB waiver. Under state law, districts and charters are not required to use the state-designed evaluation system, but most do.\nNow, the TEA has until March 31 to resubmit its waiver request.\nUnder NCLB, schools had to test students for proficiency each year in reading and math in grades 3-8, then once during high school. The objective was to have all students proficient by 2014. There were penalties for not meeting these and other unrealistic goals. One of the biggest criticisms of NCLB was that it was “teaching to the test.” Under the Obama administration came the “waiver,” which released states from these NCLB requirements.\nHowever, NCLB did not tie teacher evaluations to student achievement. That was attached to the school. Schools vied to become “blue ribbon” and “distinguished” through testing based on state academic content standards and student outcomes. Unlike the Common Core, there were no testing consortia mandating one federal test or a national achievement standard. Each state was left to develop its own.\n“Well before this waiver, TEA’s work to develop new teacher and principal evaluation and support systems was under way with the clear intent of offering it to districts as a resource to improve instruction,” said the commissioner in a TEA news release.\nUnder the waiver, Texas schools were no longer designated as having met Average Yearly Progress (AYP) goals; nor were they required to set aside 20 percent of their Title I federal dollars to provide Supplemental Educational Services (SES) for students at low-performing campuses. Only the lowest performing 15 percent of schools were identified as Priority or Focus Schools.\nAccording to DeEtta Culbertson, TEA spokeswoman, Title I (Part A) currently serves 1,184 districts, breaking down to 5,863 school-wide campuses and 141 targeted assistance campuses. School-wide students served is 3,369,311 and 14,642 are served in targeted assistance.\nAt the TASA Midwinter Convention, Williams also expressed his support of voucher-type tax credit programs that give public school students state money to attend private schools. He said “everyone knows” he supported vouchers when working for the Bush administration in the 1990s and that he “continues to do so,” according to the Statesman.\nFamilies “ought to have the opportunity to make decisions about where their youngsters go to school,” Williams added.\nBefore speaking at the TASA convention, the commissioner previously met with some superintendents, teacher and principal organizations, said Culbertson. “He wants to hear from all the stakeholders: teachers, principals, superintendents, education officials, state leadership” said Culbertson.\nThe loss of the NCLB waiver has its consequences, though. It means that school districts will have less freedom in how to use those federal Title I funds. They will likely be required to spend millions of that funding on private tutoring services for at-risk students.\nNow, the waiver is in jeopardy but hands are also tied.\n“I have always made it clear to federal officials that as part of the waiver process TEA could not exceed its current authority nor would we do anything to erode our state’s strong commitment to local control in public education. My position on this front has not, and will not, change,” the Commissioner said in the TEA news release.\nThe state of Washington was the first state to lose its NCLB waiver because the state legislature failed to fix that its teacher performance evaluations were not tethered to statewide student assessment results. Oklahoma and Indiana are also waiver-less from opting out of Common Core.\nIn Texas, Williams said that meeting many of the federal requirements would require action from state lawmakers — to either pass legislation mandating changes or giving the state education agency the authority to do so. Under state law, districts and charters are not required to use the state-designed evaluation system, but most do.\n“I have always made it clear to federal officials that as part of the waiver process TEA could not exceed its current authority nor would we do anything to erode our state’s strong commitment to local control in public education. My position on this front has not, and will not, change,” the commissioner stated.\nUnlike the Common Core State Standards, NCLB was approved by Congress and signed into law by former President George W. Bush. Currently, NCLB or ESEA is being eyed up for another redo by Sen. Lamar Alexander (R-TN) as Breitbart News reported. This go-round is legislation that claims it will embrace that every child is ready for college or career. Already, the bill has met with as much praise as it has criticism, depending upon which side one is on with education issues — from federalization of public education to local control and school choice.\nTEA first pursued the NCLB waiver at the urging of the state’s superintendents and educators, according to Williams. “Now that we have more specifics from the federal government on what they are seeking, I will be discussing our status with key Texas stakeholder groups and others in the coming weeks,” he added. Williams pointed out at the TASA event that if Congress alters NCLB, as has been discussed for years, it could bode well for the Lone Star State.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/01/29/no-child-left-behind-waiver-at-risk-in-texas/"}
