{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 20:21:52","date_modify":"2018-10-30 20:21:52","date_publish":"2015-10-19 22:40:13","description":"No Diversity; Webb Considers Exit From Democrats, Run As Independent","filename":"data/vaneerConsumption/NoDiversityWebbConsidersExitFromDemocratsRunAsIndependent.json","image_url":"https://media.breitbart.com/media/2015/10/Jim-Webb-CNN-Dem-Pres-Debate-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_19__1540930912.html","title":"No Diversity; Webb Considers Exit From Democrats, Run As Independent","title_page":"No Diversity; Webb Considers Exit From Democrats, Run As Independent","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic presidential candidate Jim Webb is considering leaving the Democratic Party to run as an independent in 2016, asserting that the Democratic Party is helping frontrunner Hillary Clinton win her bid for the presidency.\nFormer Sen. Webb’s campaign released initial information about his possible exit from the Democratic Party when sending out details about a press conference he is holding on Tuesday at the National Press Club.\nThe email from the Webb was campaign was titled: “Jim Webb to consider independent run.”\nHis departure would leave Democratic primary voters with a narrow menu of left-wingers, including three male or female progressives, plus one socialist Senator from Vermont.\nWebb was disappointed that the last Democratic debate did not distribute time equally to all of the candidates on stage.\n“It was rigged… Anderson Cooper was selecting people to supposedly respond to something someone else said,” Webb said last week during an event sponsored by the Council On Foreign Relations. “It’s very difficult to win a debate when you don’t have the opportunity to speak the same amount of time on issues as the other two did.”\nDuring the debate, Webb noticeably stood out from his Democratic rivals on several issues.\nHe remained a strong supporter of the 2nd amendment, and articulated a foreign policy vision that clashed strikingly with some of his rivals. He was the only candidate on stage to reject the Iran deal negotiated by President Barack Obama, and to announce his support for Israel while the Jewish State continues defending itself against a wave of Palestinian terrorism.\nWebb was the only Democrat to state that “all lives matter,” when asked whether black lives or “all lives” matter.\nWebb served honorably as a combat soldier during the Vietnam War. He was awarded the Navy Cross and the Silver Star, among other honors, for his combat actions. He later went on to serve as Secretary of the Navy under Republican President Ronald Reagan.\nHe served one term, from 2007 to 2013, as a Democratic Senator from Virginia, before resigning.","url":"https://www.breitbart.com/politics/2015/10/19/no-diversity-webb-considers-leaving-democrat-party-running-independent/"}
