{"authors":[],"date_download":"2018-10-23 05:45:12","date_modify":"2018-10-23 05:45:12","date_publish":"2015-03-31 00:00:00","description":"Clinicians correctly predict a suicide attempt about half the time — no better than a coin toss. Certain tests of involuntary responses, although still experimental, aim to improve the odds.","filename":"data/vaneerConsumption/NoEasyReliableWayToScreenForSuicide.json","image_url":"https://media.npr.org/assets/img/2015/03/30/german-wings_wide-311daeb96073e9b044e93002cb03026b0ebc0d52.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=396399647_1540273512.html","title":"No Easy, Reliable Way To Screen For Suicide","title_page":"No Easy, Reliable Way To Screen For Suicide : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nInvestigators are still trying to understand why a pilot apparently crashed a commercial plane into the French Alps last week. Yesterday, one more possible clue was revealed. German officials say Andreas Lubitz, the co-pilot on the Germanwings plane, was treated for suicidal tendencies. That was before he got his pilot's license and in treatment since they say he showed no signs of those tendencies. But this raises a question; with that earlier diagnosis, could anyone at the airliner or elsewhere have anticipated his actions? NPR's Jon Hamilton reports that the answer is probably not.\nJON HAMILTON, BYLINE: Matthew Nock, a psychology professor at Harvard, has spent years searching for a better way to identify people who are likely to attempt suicide.\nMATTHEW NOCK: Right now, the reality is as a society, as a field, we're not very good at accurately predicting who's at risk for suicidal behavior.\nHAMILTON: Nock says that's true even when highly trained psychiatrists or psychologists are able to directly question a person about their intentions.\nNOCK: Sometimes they're right; sometimes they're wrong. But on the whole, we as clinicians, just using our clinical interview skills and clinical judgment, unfortunately perform no better than chance.\nHAMILTON: And the odds may be even worse when it comes to pilots who deliberately crash an airplane. Guohau Li directs the Center for Injury Epidemiology and Prevention at Columbia University. He says one challenge is that there's not much information about these pilots because the crashes are so rare.\nGUOHAU LI: Fortunately it happens only about twice a year.\nHAMILTON: And Li says nearly all of the crashes involve general aviation pilots flying alone. In 2005, Li co-authored a study that looked at several dozen pilot suicides. He says what emerged was a pretty clear profile.\nLI: Male, young, mental health problems such as depression, social problems such as marriage breakdown.\nHAMILTON: Also financial problems, legal problems and relationship issues. Li says the co-pilot of the Germanwings plane appears that profile pretty well, but Li says so do lots of other pilots who will never have any problems while flying.\nLI: There is no reliable way for any airline to predict which pilots are going to commit a suicide by airplane.\nHAMILTON: Li says airlines outside the U.S. could do a better job screening for alcohol and illicit drug use, though it's not clear whether either of those was a factor in the Germanwings crash. Matthew Nock, the Harvard professor, says one reason mental health professionals often get it wrong is that they only know what people are willing to tell them.\nNOCK: An especially problematic issue in the case of suicidal behavior is that people are often motivated to deny or conceal thoughts about suicide for fear of being intervened upon or locked in a psychiatric hospital against their will.\nHAMILTON: Nock says other motivations include fear of being stigmatized or losing a job. But he says even people who are already in a psychiatric hospital rarely reveal their intentions.\nNOCK: Seventy-eight percent of people who die by suicide in the hospital explicitly denied suicidal thoughts or intentions in their last assessment before dying.\nHAMILTON: Nock says in some cases that's because they lack insight into their own state of mind, so Nock has been experimenting with tests that are harder to fool. One involves simply indicating the color of words as they appear on a computer screen. Participants push one button for red words and another for blue words while the computer measures their reaction time.\nNOCK: If you have suicide on the mind, if you're thinking about suicide, seeing the word suicide or death interferes with your ability to respond, and it takes you just a few milliseconds longer to respond.\nHAMILTON: Probably because the person has an involuntary emotional reaction to the word that slows them down. Nock says those tests can greatly improve predictions about what a person is going to do, but he says they are still experimental and still don't reveal precisely when someone will act.\nNOCK: To date, we've followed people over a six-month period. What we really want to get better at and what we need to get better at is identifying who's at risk of suicidal behavior eminently - in the next hours or days or even week. And that's where we still have a lot of work to be done.\nHAMILTON: Before mental health professionals are able to make reliable predictions about pilots or anybody else. Jon Hamilton, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=396399647"}
