{"authors":[],"date_download":"2018-10-22 23:47:08","date_modify":"2018-10-22 23:47:08","date_publish":"2017-04-26 08:36:21","description":"Legions of Japanese crisps addicts are suffering and it doesn't look like they'll be getting their full fix anytime soon.The country is in the midst of a...","filename":"data/vaneerConsumption/NoendinsightforJapancrispscrisis.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463925-1493192182-139_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446644_No-end-sight-Japan-crisps-crisis_1540252028.html","title":"No end in sight for Japan 'crisps crisis'","title_page":"No end in sight for Japan 'crisps crisis' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Japan is in the midst of a dire crisps shortage after violent typhoons wiped out potato crops in top tuber producing Hokkaido\nLegions of Japanese crisps addicts are suffering and it doesn't look like they'll be getting their full fix anytime soon.\nThe country is in the midst of a dire crisps shortage after violent typhoons wiped out potato crops in top tuber producing Hokkaido.\nThe unprecedented series of storms last year has forced chipmakers Calbee and rival Koikeya to halt production of some of their most popular flavours -- including pizza and French salad.\nPictures online have shown store shelves bare and bags have been selling for inflated prices on Internet auctions.\nCalbee, Japan's top snacks maker, has stopped selling about 30 kinds of crisps in all or part of the country since the middle of April.\n\"We don't know when we'll be able to restart,\" company spokesman Masaya Kawase told AFP on Wednesday.\n\"Potatoes are only harvested once a year.\"\nA dizzying number of government regulations on potato imports is exacerbating the shortage problem.\nJapan may not usually be associated with crisps, but industry figures show they rake in nearly 163 billion yen ($1.46 billion) in annual sales.","url":"https://www.dailymail.co.uk/wires/afp/article-4446644/No-end-sight-Japan-crisps-crisis.html"}
