{"authors":[],"date_download":"2018-10-22 22:05:56","date_modify":"2018-10-22 22:05:56","date_publish":"2014-05-08 23:25:44","description":"Automaker's 1997-model sedan had lock-system defect that trapped 14-year-old in vehicle as temperatures outside topped 100, lawsuit alleges.","filename":"data/vaneerConsumption/NoEscapeCaliforniaFamilySuesBMWAfterTeenDiesinLockedCar.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/430581/140508-bmw-logo-jms-1935_e1030c53ce2809b1872e491cc32e93d1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_no-escape-california-family-sues-bmw-after-teen-dies-locked-n100881_1540245956.html","title":"No Escape: California Family Sues BMW After Teen Dies in Locked Car","title_page":"No Escape: California Family Sues BMW After Teen Dies in Locked Car","title_rss":"NULL","source_domain":"nbcnews.com","text":"“She was pale in color and did not have a pulse,” it said. “Graciela Martinez was pronounced dead a short time later. An autopsy revealed that she had died of heat stroke and environmental hyperthermia due to vehicle entrapment.”\nThe lawsuit alleges that the design of the “double-locking mechanism” was faulty and presented a “substantial danger” to passengers because it did not allow them to unlock the vehicle from inside. Furthermore, it said, the car’s horn could not be operated without the key being inserted in the ignition and that the vehicle was not equipped with an emergency release lever.\nWarren Paboojian, who is representing Graciela Martinez’s parents, Pedro and Jacinta, said that as a result of the alleged design deficiencies, the family’s BMW was a death trap for Graciela as the temperatures climbed over 100 on that late summer day.\n“There’s nothing you can do electronically in any way to escape that car,” he said. “I found the 1997 handbook, it clearly states that if you lock the car from the outside, the occupants cannot get out. The problem is that this was a 16-year-old car and my clients didn’t have the luxury of having the handbook.”\nDavid Buchko, a spokesman for BMW North America, said he could not comment on the lawsuit.\nHe confirmed that 1997 model BMW vehicles were equipped with a power lock system that enabled persons inside the car to unlock the doors if they had been locked from inside as well, but not if they were locked externally. He said the design was intended to address “a theft-prevention issue.”\n“We didn’t envision the situation where someone would lock somebody in the car from the exterior,” he said, adding that the design of the locking system was changed in 1999.\nAsked if the change was made in response to customer complaints, Buchko said he was not aware of any complaints about the issue.\nThe lawsuit also names the Madera Unified School District as a defendant. Among other things, it alleges that the school failed to notify Graciela’s parents that she did not show up for class that day, as required by district policy.\nA phone call to the school district for comment by NBC News was not returned.\nJanette Fennel, president and founder of KidsAndCars.org, said she could find only one previous incident in the organization’s database of heat-caused car deaths involving children in which a teenager as old as Graciela had died.\nIn that case, a 14-year-old girl, Lindsey Lin, of Bellevue, Wash., died after falling asleep in a car parked outside University Preparatory Academy in Northeast Seattle on May 24, 1999 – a spring day in which unseasonable temperatures reached the low-80s.\nFennel said that parents and siblings often fail to recognize the dangers of leaving someone alone in a vehicle, even when the weather is cool.\n“People don’t understand, we’ve had little kids die when it's 52 out, because with all the glass, the car acts like a greenhouse,” she said. “… It’s not just on hot days.”","url":"https://www.nbcnews.com/news/us-news/no-escape-california-family-sues-bmw-after-teen-dies-locked-n100881"}
