{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:28:54","date_modify":"2018-10-30 18:28:54","date_publish":"2017-01-10 12:34:06","description":"The Crown Prosecution Service (CPS) has held a “public consultation” and issued “revised” guidelines on “hate crimes” and “transphobia”.","filename":"data/vaneerConsumption/NoEvidenceNeededtoReportTransphobicHateCrime.json","image_url":"https://media.breitbart.com/media/2016/06/transgender-rights-pakistan-rally-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_01_10__1540924134.html","title":"‘No Evidence Needed’ to Report ‘Transphobic Hate Crime’","title_page":"‘No Evidence Needed’ to Report ‘Transphobic Hate Crime’","title_rss":"NULL","source_domain":"breitbart.com","text":"The Crown Prosecution Service (CPS) has held a “public consultation” and issued “revised” guidelines on “hate crimes” and “transphobia”, which are likely to result in ever increasing numbers of people being dragged through court for speech crimes.\nAs well as setting out policy on racism, homophobia, and “transphobia”, the new guidelines include the “first public policy statement on Crimes Against Disabled People” to stress the CPS “understand[s] the serious nature of these crimes”.\nThe new guidelines reaffirm the fact that no evidence is needed to bring a criminal complaint against someone for a “hate crime”, as “reporting… is subjective and is based on the perception of the victim”.\n“In order to treat a crime as a hate crime for the purposes of investigation, there is no need for evidence to prove the aggravating element”, the guidelines add. “Hate crimes” receive harsher sentences than other crimes, and “aggravating” factors are often vague, such as the definition of “transphobia”.\nSpeaking to Breitbart London, London Assembly Member and UKIP Education Spokesman David Kurten explained the possible impact of these guidelines.\n“While judges may not actually find the accused guilty, more people may be dragged through the courts for months and years for their opinions and beliefs, and in the process lose their job, their house, their marriage and their kids, as well as being left destitute after fighting a lengthy court battle,” he said.\nThe number of “hate crimes” recorded by the police has grown annually for several years. Six years ago, there were 42,255. In 2014/15, there were 52,528.\nMany reports are now filed in minutes via the police’s True Vision website, which was used by anti-Brexit campaigners to fabricate a “hate crime epidemic” after the referendum.\nOn the transgender issue, the new CPS guidelines claim that “we are aware of the increasing confidence of people to identify” with such labels as “non-gender, non-binary, pan-gender or poly-gender…”\nThe CPS concedes that “the legal framework has yet to acknowledge the rights of gender nonconforming people” but insists they will continue to pursue perceived speech crimes against these groups because it is “in the public interest to prosecute, as is the case with all hate crime”.\nMr. Kurten questioned the confusing and rapidly changing lexicon of “gender politics” used in school and universities, adding:\n“Who would have thought five years ago that it would be politically incorrect to call kids boys and girls, or parents mothers and fathers… Yet these new guidelines make that a potential ‘transphobic hate crime’ if anyone feels ‘perceived hostility’.”\nThe guidelines seem to acknowledge that people may commit such crimes accidentally or out of confusion, but claim that only the “victims’” feelings matter in their deliberations.\n“Derogatory language and disrespect for personal characteristics can be hurtful and unsettling but often incidental. Despite what may be perceived as the low-level nature of such offending, the impact will often be significant and victims need recognition of the harm caused,” they read.\n“While real crimes against people and property should be prosecuted equally regardless of race, religion, gender, ability or sexual orientation, we should not be criminalising opinions which run contrary to the politically correct ‘progressive’ establishment”, Mr. Kurten added. “A free and healthy society does not criminalise opinions; it allows open and rigorous debate.”\n“The CPS’s new policies on hate crime are an attack on freedom of speech and freedom of conscience,” he said.","url":"https://www.breitbart.com/europe/2017/01/10/no-evidence-needed-report-transphobic-hate-crime-new-cps-guidelines/"}
