{"authors":["Associated Press"],"date_download":"2018-10-22 20:02:17","date_modify":"2018-10-22 20:02:17","date_publish":"2016-01-28 00:02:54","description":"NEW ORLEANS (AP) — A stubborn fire that blanketed part of the city in smoke and forced the closure of historic Canal Street is not believed to be the result ...","filename":"data/vaneerConsumption/NoinjuriesasfireclosesNewOrleanshistoricCanalSt.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:788db9269982485e8caed6421d6c7cc6-4vVdYopwYQ7f641721b07a698126-278_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419234_No-injuries-fire-closes-New-Orleans-historic-Canal-St_1540238537.html","title":"No injuries as fire closes New Orleans' historic Canal St.","title_page":"No injuries as fire closes New Orleans' historic Canal St. | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"No injuries as fire closes New Orleans' historic Canal St.\nNEW ORLEANS (AP) — A stubborn fire that blanketed part of the city in smoke and forced the closure of historic Canal Street is not believed to be the result of arson, the city's fire chief said Wednesday.\nThe blaze broke out in a largely empty four-story building and spread to an adjacent building. Flames were no longer visible and smoke had greatly diminished by daybreak, but firefighters kept steady streams of water pouring onto the structures from ladder trucks and from the street. The fire was declared under control shortly before noon.\nMcConnell said his department was not yet ready to release a report on the suspected cause but arson was not suspected. Some lanes of Canal Street, which is located between the city's central business district and the French Quarter, re-opened Wednesday evening and McConnell said streetcar traffic was resuming.\nFirefighters battle a fire on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)\nBut the stability of the structure was being investigated and the damage could result in some minor changes in the route of Mardi Gras season parades that will roll down the famous boulevard over a 12-day period beginning Friday.\n\"That sidewalk, that area of the street will be closed through Mardi Gras,\" McConnell said.\nThe top three floors of the building were empty. Ground-floor businesses, including a cellphone repair shop and a beauty supply store, were closed when the fire was reported about 3:20 a.m., and only one person was in the building at the time, McConnell said. The businesses were heavily damaged and unlikely to reopen anytime soon, he said.\nNo injuries were reported, and no evacuations were ordered. But some nervous residents of an apartment building around the corner decided to get out amid acrid smoke and temperatures in the 40s.\nResident Michael Mallin said fire alarms in the apartment building went off about 3:30 a.m.\n\"They told us it was safe to stay,\" neighbor Kate Otto said. \"We decided we needed to get out.\"\nThe scene is around the corner from the tony Roosevelt Hotel. It also is near upscale apartment buildings and the Orpheum and the Saenger, ornate early 20th century theaters that were restored to their earlier grandeur after Hurricane Katrina.\nBut the fire site itself was a largely unused building on a rundown block. \"This is a stretch of Canal Street that has not yet seen the level of revitalization of the rest of Canal Street,\" said Kurt Weigel, president of the Downtown Development District.\nThe cause of the fire was under investigation.\n____\nAssociated Press Writer Bill Fuller contributed to this report.\nFirefighters battle a blaze on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)\nFirefighters battle a fire on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)","url":"https://www.dailymail.co.uk/wires/ap/article-3419234/No-injuries-fire-closes-New-Orleans-historic-Canal-St.html"}
