{"authors":["John Zmirak"],"date_download":"2018-10-30 18:41:26","date_modify":"2018-10-30 18:41:26","date_publish":"2016-05-11 20:26:43","description":"Our problem isn’t with Paul Ryan's kids’ Catholic school, but with Ryan’s crackpot globalism, which has goaded him into a decade-long alliance with radical, pro-choice Democrats to favor amnesty for illegal aliens.","filename":"data/vaneerConsumption/NoItsNotAntiCatholictoQuestionPaulRyansHypocrisy.json","image_url":"https://media.breitbart.com/media/2016/04/wi/ap_paul-ryan_ap-photo-5-e1462998397975.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_11__1540924886.html","title":"No, It’s Not Anti-Catholic to Question Paul Ryan’s Hypocrisy","title_page":"No, It’s Not Anti-Catholic to Question Paul Ryan’s Hypocrisy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"There’s a tempest brewing in the American Catholic teapot over Julia Hahn’s recent piece here at Breitbart that contrasted Paul Ryan’s education choices for his kids and the immigration choices he wants to impose upon America. I’ve seen people whom I respect get revved up and accuse Hahn and Breitbart of playing the “anti-Catholic card.”\nI’m a lifelong Catholic who went to 12 years of Catholic school (and have written six books defending the Faith). I know that Catholic schools are very important both to the Church and to America. I’m awed at the heroic sacrifices my ancestors in the faith put forth to build that network of schools in the face of (then-genuine) bigotry. My dad went door to door with a can collecting the money to build my Catholic high school. I encourage readers to contribute financially to endangered urban Catholic schools that serve the poor far better than statist public moneypits. I know how urgent that is, because one of my closest friends teaches at such an urban Catholic school, the kind of school that gave us Clarence Thomas.\nBut let’s not act like Social Justice Snowflakes at Oberlin and run around inventing opportunities to claim that we’ve been “microaggressed.” The questions Hahn raised about Ryan are perfectly legitimate, and if we Catholics want to be taken seriously as citizens—instead of preening as an aggrieved minority, which frankly, no one is buying—we need to address such questions as adults.\nConservatives routinely hold liberal politicians’ feet to the fire, when we learn that some Democrat champion of Common Core and rotten teachers’ unions protects his kids from the outcome of his policies by sending them to some elite Quaker or Waldorf academy that costs more than most voters earn each year. It is perfectly fair in principle to do the same to neoconservatives like Paul Ryan, whose kids won’t be subjected to public-school multiculturalism alongside Somali “refugees.” Just because the school in question is Catholic doesn’t mean that he gets a free pass. If you think that it does, you’re thinking like a tribalist Muslim, not a fair-minded, patriotic citizen.\nLet’s remember why Ryan has come under criticism. He said that it is un-American even to consider restricting Islamic immigration into the U.S. Keeping out people because of what they believe is not “who we are,” he said. But no one—not a single person who has spoken up on this issue—wants to keep out Muslims because they deny the Trinity, or pray facing Mecca, or believe in Allah.\nWe want to restrict Islamic mass immigration into America because of the political platform that Muhammad himself taught is built into Islam: A programmatic attempt to conquer the entire world for Islam, using military force and organized persecution, with a single “divinely” revealed objective: that every person on earth either be a Muslim, or a subjugated “dhimmi” who defers to Muslims, pays them a special tax, and keeps his religion quiet.\nIn Muslim-run countries from Pakistan to Saudi Arabia, from Iran to Turkey, Christians can be imprisoned for obeying the words of Jesus that command us to preach the Gospel. In Europe today, radicalized Muslim immigrants and their children live comfortably on generous welfare programs, while attending radical mosques that openly proclaim their goal of imposing sharia on Belgium, France, Italy, Spain, the Netherlands, Germany, Sweden…\nPaul Ryan thinks it’s un-American for us to worry about that, to take any action to defend our nation against such a fate, because it violates some globalist principle of his that treats every human being as an interchangeable taxpayer or laborer. And there’s the irony. The Catholic Church is indeed a global institution, with a mission that’s much more universal than America’s: We are called to convert every soul on earth, through persuasion, good example, and acts of charity, to communion with Jesus Christ in His Church.\nHence the ideal Catholic school, which perfectly followed such a principle, would be tuition-free and equally open to everyone. What better way to evangelize non-Catholics than to welcome them into our schools? In past decades, when we had seemingly bottomless wells of free labor from Catholic sisters and brothers, many Catholic schools worked just this way. But now we can’t afford that, so we have to make realistic, prudent compromises with fiscal facts: Catholic schools must charge tuition and be subsidized by parishes. One perfectly moral way to make such a subsidy work is to offer discounts at parish schools for parishioners who give to Sunday collections. No one—including Julia Hahn—is saying that this is wrong.\nEven though the Catholic Church has a universal mission which our schools are called to serve, we are absolutely justified in favoring parishioners in our schools over needy Muslim refugees who might like to attend those schools tuition-free. Why? Because we have the duty as stewards to preserve the Church’s institutions intact, to reward faithful churchgoers and keep our parish communities strong. If we neglect those institutions, we soon won’t be able to preach the Gospel at all.\nEvery one of those assertions is equally true of America. We are justified in favoring our citizens over foreign nationals who might like to enter America and collect public benefits. It is right for us to demand that newcomers reject the political platform of Islam, which is utterly incompatible with America’s Constitution. We have a duty to keep America’s institutions strong and protect our national community. Those are all implications of the virtue of patriotism, a subject on which St. Thomas Aquinas waxed eloquent. The Catechism of the Catholic Church even teaches that nations may restrict immigration to protect the common good of their citizens.\nSo the question to ask of Speaker Ryan is why he wants to hold a country to standards that the Church doesn’t (and shouldn’t) apply to her own institutions. Our problem isn’t with his kids’ Catholic school, but with Ryan’s crackpot globalism, which has goaded him into a decade-long alliance with radical, pro-choice Democrats to favor amnesty for illegal aliens. It’s not un-Catholic to favor kids from a local parish at a Catholic school. And it’s not un-American to reject new immigrants who favor totalitarian sharia.","url":"https://www.breitbart.com/politics/2016/05/11/no-not-anti-catholic-question-paul-ryans-hypocrisy/"}
