{"authors":["John Nolte"],"date_download":"2018-10-30 18:23:19","date_modify":"2018-10-30 18:23:19","date_publish":"2018-08-10 19:41:26","description":"CNN and its far-left media reporter Oliver Darcy are on a blacklisting rampage against Infowars and Alex Jones.","filename":"data/vaneerConsumption/NolteCNNOpenlyCampaignstoBlacklistInfowars.json","image_url":"https://media.breitbart.com/media/2017/07/Jeff-Zucker-CNN-Dec-11-2016-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_10__1540923799.html","title":"Nolte: CNN Openly Campaigns to Blacklist Infowars","title_page":"Nolte: CNN Openly Campaigns to Blacklist Infowars","title_rss":"NULL","source_domain":"breitbart.com","text":"Far-left CNN is on a blacklisting rampage, which undoubtedly has only begun with Infowars and Alex Jones.\nWhile there is no question there is a perfectly legitimate line of reporting in pressuring behemoth social media companies like Facebook, YouTube, and Twitter to better explain their opaque standards and policies, that is not even close to what the McCarthyite CNN is attempting to do.\nInstead, under the sheep’s clothing of “journalism” and backed by the abusive power of parent company Time-Warner, CNN is relentlessly filing complaints with these social media giants against Infowars, an online outlet that frequently criticizes the anti-Trump network.\nA story that examines how social media giants come up with, apply, and enforce their content rules would be a worthy piece of reporting. But if you look at CNN’s “reporting” and the obsessive social media activity of one of its lead activists, Oliver Darcy, there is only one goal: to pester and shame social media outlets into blacklisting Jones and Infowars.\nIf CNN were sincerely interested in journalism (as opposed to scalping one of its critics), in informing the public (as opposed to silencing someone with whom CNN disagrees), the so-called journalism would be every bit as aggressive in asking Twitter and others why left-wing racists like the New York Times‘s Sarah Jeong and hate-minister Louis Farrakhan are still allowed on these platforms.\nInstead, CNN is aggressively and intentionally singling out Infowars and Infowars only, which proves that this is not a legitimate act of journalism on CNN’s part to do what reporters are supposed to do — discover information and pass it along to the public.\nRather, CNN is just another partisan, left-wing activist looking for an outcome, demanding a critic be disappeared.\nHere is all the proof you need:\nTwitter said it would have taken action against Alex Jones/InfoWars had the content that got them in trouble w/Facebook & YouTube been posted on Twitter. But all of the content that initially led to YouTube/FB taking action is, in fact, posted to Twitterhttps://t.co/WpEZsLjr0i — Oliver Darcy (@oliverdarcy) August 9, 2018\nFWIW, I only had time to watch a sliver of the hundreds of hours of video that InfoWars/Jones have uploaded to Twitter. Most of the InfoWars shows are streamed and archived in their entirety on Twitter's platform. There's probably a lot more there. — Oliver Darcy (@oliverdarcy) August 9, 2018\nI told Twitter Wednesday morning content that prompted other tech companies to take action against InfoWars/Jones was on Twitter. A spox declined to say if Twitter would review. Then @delbius suggested later that such content wasn't on Twitter? Perplexing. https://t.co/WpEZsLjr0i pic.twitter.com/E1cPB0mkvc — Oliver Darcy (@oliverdarcy) August 9, 2018\nA CNN review of InfoWars' and Jones' Twitter accounts found promotion of Sandy Hook / Parkland conspiracies, attacks on individuals based on their gender identity & religion, targeted harassment, videos glorifying violence, and more cc: @jack https://t.co/WpEZsLjr0i — Oliver Darcy (@oliverdarcy) August 9, 2018\nA Twitter exec said yesterday that if the videos that led Facebook + YouTube to take action were on Twitter, Twitter would take action too. Well, guess what? https://t.co/MILNdcg21D https://t.co/tcipADVBBL — Alex Koppelman (@AlexKoppelman) August 9, 2018\nAsk yourself: if this is “journalism,” where is the openly racist Sarah Jeong?\nWhere is Louis Farrakhan?\nHell, where is Antifa, a full-blown left-wing terrorist organization responsible for unspeakable violence and still allowed on Facebook?\nWhat CNN is practicing is full-blown McCarthyism, using its corporate power to bully and emotionally blackmail platforms to blacklist CNN’s critics.\nAnd if you think CNN intends to stop there, if you are counting on any kind of decency from a CNN that remains silent as rape victims are booed, that openly calls for race riots in distressed neighborhoods, that points what looks like a sniper scope at Trump’s Oval Office window, that openly fantasizes about Trump’s assassination, that smears war veterans, that gleefully spreads lies and hoaxes and fake news and conspiracy theories…\nYou have not been paying attention.\nThese are bad people who are losing the argument and their audience. And so, like all bad people who cannot win an honest debate, all they have left is to abuse their waning power, to bully and to scream, “Shut up!”\nI am no Alex Jones fan. But as I have done many times in the past, I am here to defend speech with which I disagree because that is what sincere free speech defenders are supposed to do.\nAnd the only thing blacklisters like CNN do is … blacklist.\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.","url":"https://www.breitbart.com/the-media/2018/08/10/nolte-cnn-openly-campaigns-blacklist-infowars/"}
