{"authors":[],"date_download":"2018-10-22 21:01:26","date_modify":"2018-10-22 21:01:26","date_publish":"2014-06-03 19:29:03","description":"An hour after a teen was found on a Hawaii runway, a nonplussed pilot preparing to depart tells air traffic controllers he will be a bit delayed","filename":"data/vaneerConsumption/NonplussedPilotonTapeTalksofTeenStowawayonHawaiiFlight.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/424851/140503-stowaway-video-1936_-crop_2bc5130d2be6b21b0ffd6514e153e908.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hawaii-stowaway_nonplussed-pilot-tape-talks-teen-stowaway-hawaii-flight-n121581_1540242086.html","title":"Nonplussed Pilot on Tape Talks of Teen Stowaway on Hawaii Flight","title_page":"Nonplussed Pilot on Tape Talks of Teen Stowaway on Hawaii Flight","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAbout an hour after a California teen was discovered on a Hawaii runway in April, a nonplussed pilot preparing to depart tells air traffic controllers he will be a bit delayed because \"a guy is seeming to have stowed away in the landing gear from San Jose to Maui.\"\nThe pilot was referring to 15-year-old Yahya Abdi, a Somali immigrant who ran away from his Santa Clara, California, home, hopped a fence at Mineta San Jose International Airport and climbed into the wheel well of the closest plane. The jet took off a few hours later for a 5 1/2-hour flight to Maui on April 20.\nAbdi improbably survived the flight at 35,000 feet despite low oxygen and freezing temperatures.\nVideo footage from the Maui airport shows him dropping to the tarmac about an hour after the jet landed. But when it was time for that same jet to leave, the pilot, who was a different pilot than the one who had landed the jet there, said security and mechanics were holding him up, according to a 10-minute Federal Aviation Administration audio recording, provided exclusively to The Associated Press in response to a Freedom of Information Act request.\n\"Um, we have a little gate delay here. A guy is seeming to have stowed away in the landing gear from San Jose to Maui, so we have security in there looking for evidence of the guy being up there for more than, you know, ha, five minutes on the ground. So we'll let you know when we're ready to push,\" says the pilot of outbound Hawaiian Airlines Flight 24, heading for Oakland.\n\"All right, 24, have your roger,\" says an air traffic controller, confirming he received and understood the message. \"You need any assistance with that or, er, you guys got it?\"\n\"Nope, plenty of security here, mechanics, it's all good, we just kind of waiting for clearance to go,\" says the pilot, explaining that once the crews agree the plane is undamaged, they'll give him the go-ahead.\nThe controller is calm, routine, in his response, telling the pilot he can back away from the ramp when he's ready, because the tower doesn't have jurisdiction over that part of the airport: \"Roger, thanks, well it will be push back at your discretion.\"\n\"Okey doke, thanks,\" says the pilot.\nThe boy was hospitalized in Hawaii for two weeks, then flown back to California where he was placed in custody of Santa Clara County Child Protective Services. A county spokesman said Monday he cannot disclose the boy's whereabouts.\nAbdi, who lived in Santa Clara with his father, stepmother and siblings, had been unhappy in California and desperately missed his mother, according to those who know his family. School officials said he had been in the U.S. for about four years and speaks English as a second language.\n- Associated Press","url":"https://www.nbcnews.com/storyline/hawaii-stowaway/nonplussed-pilot-tape-talks-teen-stowaway-hawaii-flight-n121581"}
