{"authors":[],"date_download":"2018-10-30 18:47:20","date_modify":"2018-10-30 18:47:20","date_publish":"2016-09-27 15:23:00","description":"Actual Factual Cobb: When will Noonday Creek Trail reach Woodstock?","filename":"data/vaneerConsumption/NoondayCreekTrailconnectingtoWoodstock.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/27/Images/photos.medleyphoto.11536997.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-c_b1dd38f4cbca1564b6cd8ec0b12c9593__1540925240.html","title":"Noonday Creek Trail connecting to Woodstock?","title_page":"Actual Factual Cobb: Noonday Creek Trail connecting to Woodstock?","title_rss":"NULL","source_domain":"ajc.com","text":"Howdy! This is \"Actual Factual Cobb,\" and thus is much better than the rest of the Internet. In this column series, I — Ben Brasch — will keep rootin' for answers and tootin' news about Cobb County from questions you ask until the esteemed AJC fires me upon realizing how much of the newsroom's coffee budget is expended on me.\nReader Laura asks: \"When are they going to build the rest of Noonday Creek Trail north to Cherokee County?\"\nLaura, now goes down in the annals of \"Actual Factual Cobb\" as the first reader to have a question answered. As a reward, you can redeem this column for one hug from me. And I'm, like, a pretty darn good hugger.\nBut back on the trail.\nThe Noonday Creek Trail opened in September 2014 to much fanfare from people with chiseled calf muscles. The 10-foot-wide trails stretches for seven miles from Town Center and ends at Bells Ferry Road Northeast, which is just east of Town Center. As for the financials, the trail cost $11,636,216, according to the Town Center Community Improvement District website.\nThere was always the idea that the trail would eventually jut north to the Cherokee County line and be able to lead right into downtown Woodstock.\nSo Laura's question was why Cobb hasn't done so yet. The short answer is: Priorities.\nRight now, the parks people are working something fierce to make sure the trails around the booming Cumberland area and neighboring Mableton are up to snuff for the expected influx of visitors when the new Atlanta Braves stadium opens along with the accompanying shops, dubbed The Battery.\nPlus, Marietta is also touching up its trails.\nSo your lovely Saturday bike ride to Woodstock will have to wait a bit.\nBut how many bits?\n\"It is part of our long-range plan,\" said Eric Meyer, planning division manager with Cobb DOT. When I asked him what \"long-range\" means, he said that's usually between five and 10 years.\nHe said that this is the basic process once it's been blessed by the bureaucrats: The parks and transportation folks assign the project to an engineer, the engineer designs it by figuring out right-of-way and utilities, and then they put the project out for bid.\nThe stretch between Woodstock and where the Noonday Creek Trail ends today at Bells Ferry is about 6.4 miles, he said.\nFor the big picture, he said that the corridor from the Chattahoochee River National Recreation Area in Cumberland to downtown Woodstock is 27 miles. Of that, 79 percent either exists or is under construction.\nMeyer was a shining example of local government and got right back to me with maps and answers. Thanks!\nPssssst: If you like this, check out my first Actual Factual Cobb about how the cities got their crazy names\nAnother factor in the prioritization, Meyer said: A Noonday trail that leads up to the Cherokee line but doesn't have anything to connect to ain't worth squat.\nCherokee County is still working through money it received from the Atlanta Regional Commission to build the trail south to meet Cobb’s trail.\nSo, we're waiting on our folks to build north and for Cherokee's folks to build south.\nThat’s the skinny, Laura. Thanks for asking.\nI, Ben Brasch, am a reporter with the AJC. To submit “Actual Factual Cobb” questions, contact me at ben.brasch@ajc.com or on Twitter, @ben_brasch, or via the form below.\nLoading...","url":"https://www.ajc.com/news/local/actual-factual-cobb-when-will-noonday-creek-trail-reach-woodstock/ZhwiRubCnr1zAtFcFjgNkN/"}
