{"authors":[],"date_download":"2018-10-23 05:34:56","date_modify":"2018-10-23 05:34:56","date_publish":"2016-03-21 00:00:00","description":"When his mother was turning 90, music critic Lloyd Schwartz wrote poems that put her memories into verse. Composer Mohammed Fairouz set three of the poems to music on the new recording, No Orpheus.","filename":"data/vaneerConsumption/NoOrpheusRevisitsTheDreamsAndPassionsOfAnAgingMother.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=471261515_1540272896.html","title":"'No Orpheus' Revisits The Dreams And Passions Of An Aging Mother","title_page":"'No Orpheus' Revisits The Dreams And Passions Of An Aging Mother : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TERRY GROSS, HOST:\nThis is FRESH AIR. Our classical music critic, Lloyd Schwartz, is also a poet. And among our favorite poems of his are the ones he wrote about his mother as her memory was beginning to fail. Over the years, Lloyd has read several of these on our show. Now three of these poems have been set to music and recorded. We asked Lloyd to read one of these poems and to play the musical setting.\nLLOYD SCHWARTZ, BYLINE: When my mother was turning 90, her short-term memory began to disappear. But her old memories and fantasies remained extremely real. I didn't want to forget what she was telling me. So I started to write down what she was saying. I think that among my own poems, these are the ones most dear to me because they help bring my mother back. I was delighted when the young composer Mohammed Fairouz wanted to set three of these poems to music. They're now on a new recording called \"No Orpheus.\" Like Orpheus, I was trying to bring someone I loved back from the land of the dead. The last poem in this series is in my mother's voice as she tells me about a remarkable dream.\n\"Her Waltz\" - this is my dream. I'm dancing. Do you know how to dance? Do you like to dance? Waltzing - it's like electricity. It hurts when I walk. So I pick up a chair, and I start to waltz. I look in the mirror, and there I am dancing with a chair. I say to the mirror, I'm not so old. But the mirror says, yes, you are. You're old. You're nearly 90 years old. What are you doing waltzing around with a chair? Now, isn't that silly? An old lady... This is my dream. I see myself in the mirror waltzing with a chair. And that's the end of my dream. I once knew how to dance. I once knew how to waltz. And now I shall bid you good night.\nOn this new recording, mezzo-soprano Kate Lindsey brings to life what, to my ears, the music so vividly captures - my mother's imagination, her playfulness, her sense of loss and finally, her innate dignity.\n(SOUNDBITE OF SONG, \"HER WALTZ\")\nKATE LINDSEY: (Singing) This is my dream. I'm dancing. Do you know how to dance? Do you like to dance? Waltzing is like electricity. It hurts when I walk. So I pick up a chair, and I start to waltz. I look in the mirror, and there I am dancing with a chair. I say to the mirror, I'm not so old. But the mirror says, yes, you are. You're old. You're nearly 90 years old. What are you doing waltzing around with a chair? Now, isn't that silly? An old lady... This is my dream. I see myself in the mirror waltzing with a chair. And that's the end of my dream. I once knew how to dance. I once knew how to waltz. And now I shall bid you good night.\nGROSS: Lloyd Schwartz teaches in the Creative Writing, MFA program at the University of Massachusetts Boston. He read his poem \"Her Waltz,\" which was set to music by composer Mohammed Fairouz and sung by mezzo-soprano Kate Lindsey on a new recording on the Naxos label called \"No Orpheus.\" Tomorrow on FRESH AIR, the secret history of cyber war - we talk with journalist Fred Kaplan about his new book, \"Dark Territory,\" which includes the story of how cyber security policy was affected when President Reagan watched the 1983 Matthew Broderick film, \"WarGames.\" We'll also talk about the battle between Apple and the FBI. I hope you'll join us.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=471261515"}
