{"authors":["Kelly Mclaughlin For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 20:33:22","date_modify":"2018-10-22 20:33:22","date_publish":"2016-01-29 02:05:07","description":"Nooshafarian Ravaghi, who taught English as a second language to inmates may have supplied maps to the men before the escaped Orange County Central Men's Jail last Friday.","filename":"data/vaneerConsumption/NooshafarianRavaghiwhotaughtinCaliforniajailaidedviolentinmatesinescape.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2C88300000578-0-image-a-14_1454076563183.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422079_Woman-taught-Southern-California-jail-aided-violent-inmates-escape-kind-relationship-one-men_1540240402.html","title":"Nooshafarian Ravaghi who taught in California jail 'aided violent inmates in escape'","title_page":"Nooshafarian Ravaghi who taught in California jail 'aided violent inmates in escape' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teacher at a maximum-security jail in Southern California has been arrested on suspicion of helping three inmates - including an alleged killer - escape last week.\nOrange County sheriff's Lt Jeff Hallock said Nooshafarian Ravaghi, who taught English as a second language to inmates, may have supplied maps and tools to the men.\nHossein Nayeri, 37, Bac Duong, 43, and Jonathan Tieu, 20, then cut and climbed their way out of Orange County Central Men's Jail last Friday.\nRavaghi, a 44-year-old Lake Forest woman from Rancho Santiago Community College, was arrested on Thursday, and authorities said she had some kind of relationship with one of the men.\nHallock said Nayeri attended several of Ravaghi's classes - the pair are both originally from Iran.\nScroll down for video\nNooshafarian Ravaghi, (left) who taught English as a second language to inmates at Orange County Central Men's Jail was arrested on Thursday. She was close to escapee Hossein Nayeri, 37 (right)\nOfficials believe the men who escaped may be living in a white van that was stolen on Sunday in South LA\n'All we know is that there was some type of relationship that developed between the two as a result of initially (what) was a student-teacher relationship and it developed into a close relationship where she then began providing him information,' Hallock told KABC.\n'She's denying having brought the tools, but what we do know is she provided Google maps, those types of things, to prepare for the escape,' Hallock said.\nThe escape of the three men echoed the June 2015 New York prison escape when convicts Richard Matt and David Sweat went on the run for three weeks after breaking free from a maximum-security Clinton Correctional Facility.\nRavaghi had worked at the jail for six months, according to CNN.\nThe 44-year-old worked as a part-time instructor in the inmate education program, Judy Iannaccone, a spokeswoman for the Rancho Santiago Community College District, said.\nShe began the program in 2014 and passed a background check before her assignment at the jail.\nSouthern California authorities launched a manhunt Saturday after inmates (left to right) Jonathan Tieu, and Bac Duong escaped from jail\nAccording to her website, Ravaghi, who was born in Iran, has authored a multicultural children's book called the 'Noosh Collection.'\nShe settled in California in 1997 and holds two master's degrees, one in French literature and the other in education.\nA former colleague of Ravaghi, who asked not to be identified, told the LA Times Ravaghi had been a 'loner' who rarely interacted with her students outside of the classroom.\n'She was very kind to the students, a good tutor, but she didn't really socialize with the students. She treated them like a teacher does,' the colleague said. 'She seemed to be very ethical.'\nHallock also says the men are believed to be still in California and that one apparently stole a white van on Sunday in South Los Angeles.\nIt was Duong who took what was supposed to be a test drive in a utility van advertised for sale in south Los Angeles on Sunday and then never came back, Hallock added.\nAll three fugitives are believed to have remained together since escaping from the jail and have been living out of the van as they continue to elude a massive manhunt, Hallock told a news conference.\nRavaghi, a Lake Forest woman, had some kind of relationship with one of the men, authorities said. The relationship 'developed between the two as a result of initially (what) was a student-teacher relationship', Orange County sheriff's Lt Jeff Hallock said\nAccording to her website, Ravaghi, who was born in Iran, has authored a multicultural children's book called the 'Noosh Collection'\nAbout ten people have been arrested so far in connection with the breakout, Hollack added.\nThe Google Maps information the teacher provided the three men with included overviews of the jail rooftop and surrounding areas, according to Hallock. He did not say exactly how the information was furnished or when.\nSheriff Sandra Hutchens said the inmates, who have yet to be caught nearly a week after the breakout, could not have sawed through the thick metal that they did with the sort of tools they could have crafted themselves.\n'We don't know what they are, but we know that they made a clean cut,' Hutchens said at a news conference Wednesday. 'It's nothing we think could have occurred with a jail-made shank.'\nThe sheriff said she's certain some of that help came from outside the jail, and investigators have not ruled out that aid also came from the inside.\n'They had to have had help,' Hutchens said.\nA wanted sign is displayed for the reward for information leading to the arrest of the the three escaped inmates from the Orange County Central Men's Jail\nAuthorities with the Orange County Central Jail stand on the top jail floor in Santa Ana, California, on Tuesday\nThe escape of the three men was similar to the escape convicts Richard Matt and David Sweat who broke free from maximum-security Clinton Correctional Facility.\nFormer prison worker Joyce Mitchell was sentenced to seven years in prison after pleading guilty to helping the men escape.\nShe pleaded guilty to providing hacksaw blades and other tools to Matt and Sweat, who broke out of the maximum-security facility on June 6.\nThe pair eluded more than 1,000 searchers who combed the thick woods and bogs of northern New York for much of the next three weeks.\nMatt was killed by a border agent June 26. Sweat was wounded and captured by a state trooper two days later.\nMitchell, who was a sewing teacher at the prison, is said to have had affairs with both men inside the prison and was due to be their getaway driver, but got cold feet and admitted herself to the hospital with a panic attack instead.\nShe confessed that she had performed sex acts on Richard Matt and sent naked photos of herself to David Sweat, then accepted pills from them to murder her husband.\nAs for the men in California, to carry out such an elaborate escape, the men likely were given blueprints or told how the bowels of the jail were laid out, said Kevin Tamez, a managing partner for MPM Group, a firm that consults on prison security, management and infrastructure.\nIt's unclear how jail officials didn't detect anything inside the dorm where the men were housed with about 60 other inmates. Hallock said the jail's policy is to do walk-throughs every hour, and more involved searches are done at random.\nThe jail has revised its headcount procedures because it took so long to discover the men were missing.\nThe changes include requiring deputies to call and confirm that inmates who are in court, getting medical help or otherwise out of the jail are actually where they are supposed to be.\n'It's every sheriff's nightmare,' Hutchens said. 'You never want to have an escape from any jail. They do happen. And you certainly don't want maximum security prisoners who are a danger to the public to get out of your jail. So it's not a good day.'\nThis undated combo photo provided by the Orange County Sheriff's Office shows tattoos and other markings on the body of Duong, one of three inmates who escaped on Friday\nThe vent screen (above) had been cut and removed from the inside of the jail cell where the three men escaped from some time on Friday, January 22\nThe investigation into the escape had led to five arrests by Wednesday and more are expected soon, though sheriff's officials said those in custody did not necessarily have a role in the escape, only that they had some connection to the fugitives.\nNone of those arrested were jail employees, they said.\nThe investigation has centered on a Vietnamese gang in the nearby cities of Westminster and Garden Grove with ties to two of the inmates.\nThe men escaped Friday from the jail after cutting a hole in a metal grate then crawling through plumbing tunnels and onto the roof. They pushed aside barbed wire and rappelled down using a rope made of bed sheets.\n'It's every sheriff's nightmare,' Hutchens said. 'You never want to have an escape from any jail. They do happen. And you certainly don't want maximum security prisoners who are a danger to the public to get out of your jail. So it's not a good day.'\nJonathan Tieu, Bac Duong and Hossein Nayeri had all been awaiting trial for unrelated violent crimes.\nTieu, Duong and Nayeri had all been awaiting trial for unrelated violent crimes.\nNayeri was born in Iran and as a child emigrated to the U.S. with his family. He attended high school in Fresno and then joined the Marines.\nOfficials believe he was probably the mastermind of the escape, Hutchens said, saying Nayeri's sophistication, his military past and a history of fleeing from law enforcement have investigators focusing on his role.\nOn Thursday, authorities announced they had arrested a woman of Iranian descent who taught English at the jail - believed to be Ravaghi - and is suspected of providing help for the escape. Nayeri attended her classes.\nNayeri had no felony record in 2005 when he was charged in a drunken-driving accident that killed his high school friend, Ehsan Tousi, and left Nayeri hospitalized with burns and struggling with depression, according to friends and family.\nWhile free on bail, Nayeri fled but eventually was arrested in Washington and extradited to California in 2009. At his sentencing, friends and family wrote letters to the judge on his behalf, saying that the accident had turned him into a shell of his former self.\nHe hung a photo of Tousi on the wall of his hospital room and cried daily, one friend wrote. A sibling wrote that he stopped calling and spent hours at his friend's gravesite.\nNayeri told the judge he remembered the smell of burning flesh and was screaming his friend's name before he blacked out.\nAbove is pictured the jail cell and vent screen that had been cut, near the floor at center rear, inside of the Central Men's Jail in Santa Ana, California by the three inmates\n'To this day I wish I wouldn't have gained consciousness to see the look on their faces,' Nayeri wrote.\nHe was sentenced to less than a year in county jail and four years of probation, in part because of his lack of felony history.\nA probation officer wrote in his court file that he struggled with substance abuse, depression and feelings of guilt. A psychologist indicated that he had been diagnosed with bipolar disorder with episodes of mania and depression and was taking medication for it, according to court files.\nIn 2011, he was charged with domestic battery, false imprisonment and making criminal threats but the case was dismissed after he pleaded guilty to a lesser misdemeanor. That same year, a woman - one of the friends who wrote the judge on his behalf in 2005 - filed a request for a protective order against him, according to court records.\nHe was still on probation in 2012 when, prosecutors say, he fled during a traffic stop in Orange County and led police on a high-speed chase. Nayeri managed to get away on foot after ditching the car, which had surveillance devices, video footage and GPS trackers inside.\nAbout a week later, prosecutors say, Nayeri and three others kidnapped a medical marijuana distributor, bound him with zip ties and drove him to desert where they believed he had buried a large sum of cash.\nThere, the man was tortured with a blow torch and his penis severed, according to court files.\nPolice soon matched the ditched car to Nayeri and believe the surveillance gear was being used to monitor the victim, said Robert K. Weinberg, a defense attorney who is representing one of Nayeri's co-defendants in that case.\nAs authorities closed in, Nayeri fled to Iran. He was arrested in 2013 in Prague as he tried to travel to Spain to meet his family.\nHe was to go on trial February 23 on charges that include kidnapping, torture and burglary.\nDuong is charged with attempted murder in the November shooting of a man in Santa Ana.\nHe has done several stints in federal prison for burglary and drug charges and is the subject of a 1998 deportation order that authorities have not carried out because Vietnam has not provided the required paperwork to take him back.\nTieu is charged with murder, attempted murder and other crimes in a 2011 gang shooting outside a pool hall in Garden Grove. He was 15 at the time of the shooting and was transferred to the men's jail when he turned 18.\nThe sheriff appeared on television and radio shows in Orange County's Little Saigon earlier this week to ask for help from the Vietnamese community, one of the nation's largest.\nFederal and county officials are offering a combined $200,000 reward for the men's capture.\nThe breakout marks the first jail escape in Orange County since the 1980s, sheriff's officials have said.","url":"https://www.dailymail.co.uk/news/article-3422079/Woman-taught-Southern-California-jail-aided-violent-inmates-escape-kind-relationship-one-men.html"}
