{"authors":["Breitbart Tech"],"date_download":"2018-10-30 21:33:30","date_modify":"2018-10-30 21:33:30","date_publish":"2016-03-31 18:06:11","description":"Robotic systems and unmanned vehicles are playing an ever-growing role in the military, but don't expect to see Terminator-style droids yet.","filename":"data/vaneerConsumption/NoPlansforKillerUSMilitaryRobotsYet.json","image_url":"https://media.breitbart.com/media/2015/07/Terminator-3-terminator-9844151-1280-1024-e1445902339760.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_03_31__1540935210.html","title":"No Plans for Killer US Military Robots… Yet","title_page":"No Plans for Killer US Military Robots... Yet | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Washington (AFP) – Robotic systems and unmanned vehicles are playing an ever-growing role in the US military — but don’t expect to see Terminator-style droids striding across the battlefield just yet.\nA top Pentagon official on Wednesday gave a tantalizing peek into several projects that not long ago were the stuff of science fiction, including missile-dodging satellites, self-flying F-16 fighters and robot naval fleets.\nThough the Pentagon is not planning to build devices that can kill without human input, Deputy Secretary of Defense Robert Work hinted that could change if enemies with fewer qualms create such machines.\n“We might be going up against a competitor that is more willing to delegate authority to machines than we are, and as that competition unfolds we will have to make decisions on how we best can compete,” he said.\nWork, who helps lead Pentagon efforts to ensure the US military keeps its technological edge, described several initiatives, including one dubbed “Loyal Wingman” that would see the Air Force convert an F-16 warplane into a semi-autonomous and unmanned fighter that flies alongside a manned F-35 jet.\n“It is going to happen,” Work said of this and other unmanned systems.\n“I would expect to see unmanned wingmen in the air first, I would expect to see unmanned systems undersea all over the place, I would expect to see unmanned systems on the surface of the sea,” Work told an audience at a discussion in the capital hosted by The Washington Post.\nThe US military has over the past 15 years invested heavily in unmanned drone technology, used to surveil vast parts of the Middle East and Africa and sometimes conduct deadly strikes — though remote human operators decide when to fire.\n– Driverless convoys –\nCommercial tech firms like Google are rushing to develop driverless vehicles, but Work said it would take longer for the military to create autonomous trucks given the challenges of navigating off-road.\n“When the roads become more dangerous we will go off road, and that type of navigation is extremely difficult,” Work said.\nThe US military wants to build driverless convoys to protect against roadside bombs, a low-tech weapon that has killed hundreds of troops in Iraq and Afghanistan.\nScience and technology leaders including British physicist Stephen Hawking fret that the development of weapons with a degree of autonomous decision-making could be feasible within years, not decades.\nEarlier this year, they called for a ban on offensive autonomous weapons that are beyond meaningful human control, warning the world risked sliding into an artificial intelligence arms race and raising alarm over the risks of such weapons falling into the hands of extremists.\n– Micro drones –\nWork’s comments come after Defense Secretary Ash Carter last month lifted the lid on a couple of secret Pentagon projects. Next year’s proposed budget includes $71.4 billion in research and development funds.\nCarter said the secretive Strategic Capabilities Office had created tiny, swarming drones that are built largely from components created by 3D printers.\nThe drones could fly through heavy winds and be launched from the back of a fighter jet moving at Mach 0.9.\nPentagon researchers also are developing small bombs that use cameras and sensors to improve their targeting capabilities.\nOther projects include robot boats and a hyper-velocity gun — known as the electromagnetic rail-gun — that can blast a projectile out at an astonishing 4,500 miles (7,250 kilometers) per hour.\nThe Pentagon is also looking toward the heavens as it tries to figure out future threats — Work said the military worries about satellites being targeted and is developing devices that can dart away from incoming anti-satellite missiles.\nThe Pentagon is also developing artificial intelligence capabilities, such as “deep-learning” machines that can sift mind-boggling amounts of data.\nAlready, the military is tasking these machines to scrutinize the Islamic State group and better understand its organizational structure.\n“Learning machines are going to allow us to get after ISIS as a network and deal them a lasting defeat,” Work said.","url":"https://www.breitbart.com/tech/2016/03/31/no-plans-killer-us-military-robots-yet/"}
