{"authors":[],"date_download":"2018-10-30 18:27:33","date_modify":"2018-10-30 18:27:33","date_publish":"2017-03-16 19:48:00","description":"It’s been 15 months since Thompson abruptly resigned during a city council meeting after a volatile term.","filename":"data/vaneerConsumption/NoregretssaysformerStockbridgemayorThompson.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/16/Images/newsEngin.18105467_MayorComplaint1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_s_b469199082f6f7f36a961001fe918ebb__1540924053.html","title":"'No regrets' says former Stockbridge mayor Thompson","title_page":"'No regrets' says former Stockbridge mayor Thompson","title_rss":"NULL","source_domain":"ajc.com","text":"UPDATE\nFormer Stockbridge Mayor Tim Thompson says he has no regrets about the way he closed the books on his political career.\nIt’s been 15 months since Thompson abruptly resigned during a city council meeting after a volatile term that included the city council asking him to undergo anger management counseling.\nSince his December 2015 resignation, Thompson has focused on his insurance business where he works with his wife and has added three employees, bringing total employment to 10.\nChannel 2's Berndt Petersen Reports\n“Everything’s going great,” Thompson told The Atlanta Journal-Constitution. “Just building my company, enjoying my family and traveling.”\nThompson’s departure left the city without a mayor until voters elected Judy B. Neal last December as Thompson’s successor. He says he occasionally runs into members of the current council but none of the ones with whom he served.\n“Mayor Neal’s a phenomenal person,” Thompson said. “I’m sure she’s doing a great job. I haven’t been to any council meetings.”\nIn fact, Thompson said he steers clear of local politics these days. “I don’t even keep up with it anymore.”\nAny do-overs?\n“No not really. It’s part of your life,”he said. “I had good intentions so I don’t regret anything. “I don’t relish what happened but it is what it is.”\nThe ongoing political soap opera that is Stockbridge government ramped up this week when the mayor abruptly resigned during a city council meeting.\nMayor Tim Thompson’s departure Monday stunned city officials who were considering charging him with creating a hostile work environment. The resignation occured just after council emerged from executive session. It also comes a couple of weeks after the release of a city-sanctioned, 128-day report by an independent investigator into Thompson’s behavior. The report cost $41,000.\nStockbridge City Council member Elton Alexander is accused of trying to get free barbecue from a restaurant owner in exchange for city catering jobs.\nMayor pro tem Alphonso Thomas is serving as acting mayor.\n“It surprised all of us,” City Manager Michael Harris said of Thompson’s resignation. “He didn’t cite any specific reason other than to say he had had enough.”\nWhen asked if the report dealt with Thompson’s behavior, Harris replied “not that I recall.” Harris declined to give details of the report.\nIn an exclusive interview with The Atlanta Journal-Constitution, Thompson said he “resigned voluntarily.” He declined to go into detail.\n“I got my life back now,” said Thompson who had been in office just under two years. “I did my best. I served with honor and dignity. I’m proud of what I was able to do and proud of what I stood for.”\nThompson dismissed reports that he resigned because of his temper, which earned him a censure from the city council in March. Thompson was censured after a string of alleged abusive and threatening behavior that culminated with him threatening to beat up the mayor pro tem. The council also launched the investigation at that time and required him to get anger management counseling.\nThompson’s departure is just the latest in what has become over the past six years a revolving-door of politicians and government administrators in Stockbridge, a Henry County town of just over 27,000. The volatility began in 2009 shortly after retired Army office and political newcomer Lee Stuart ended R.D. “Rudy” Kelly’s nearly four-decade reign as mayor. The city council ousted Stuart three years ago this month, saying he was creating a hostile work environment for city workers among other things.\nThe fireworks have continued ever since.\nDuring the last two months of Mark Alarcon’s mayoral term, he transferred eight city-owned properties to the downtown development authority and forgave $6 million in loans to the authority. Thompason spent the early days of his term trying to retrieve the money and properties. In October 2014, Councilman Richard Steinberg resigned from office, 15 minutes before a public evidentiary hearing concerning whether he should be removed from office.\nStockbridge city council looks to oust one of its members\nIn addition to the upheaval in elected officials,Stockbridge has had six city clerks, five finance directors and five city managers since 2010.\nWhile city officials insist that Thompson’s volatile behavior has made it hard, Thompson called the Stockbridge government “a volatile environment.”\n“I went in on my own terms and left on my own terms,” Thompson, who works in the insurance field, said Wednesday. “I’m happy. My wife’s happy. I’m finished with that. I’ve turned a new page in my life. I hope and pray they (city officials) can move forward.”","url":"https://www.ajc.com/news/local-govt--politics/stockbridge-mayor-his-time-office-regrets/LN17SnxowypsQ8KmQZTzcJ/"}
