{"authors":["Associated Press"],"date_download":"2018-10-23 01:11:57","date_modify":"2018-10-23 01:11:57","date_publish":"2017-03-10 08:54:38","description":"MIAMI (AP) - When Ryan Dempster decided to come out of retirement to pitch in the World Baseball Classic, he struggled at first to reach 80 mph with his...","filename":"data/vaneerConsumption/NoregretsDempstergetsrockedinreturnfromretirement.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194965-1489136081-825_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300442_No-regrets-Dempster-gets-rocked-return-retirement_1540257117.html","title":"No regrets: Dempster gets rocked in return from retirement","title_page":"No regrets: Dempster gets rocked in return from retirement | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MIAMI (AP) - When Ryan Dempster decided to come out of retirement to pitch in the World Baseball Classic, he struggled at first to reach 80 mph with his fastball.\nHe did better in Thursday's WBC opener with Canada, topping out at 91. But against the Dominican Republic, that wasn't enough.\nPitching for the first time since the 2013 World Series with the Boston Red Sox, Dempster allowed four runs in two innings, and Canada lost 9-2 to the defending WBC champions.\nCanada pitcher Ryan Dempster throws during the first inning in a first-round game of the World Baseball Classic against the Dominican Republic, Thursday, March 9, 2017, in Miami. (AP Photo/Lynne Sladky)\nOther than the defeat, the 39-year-old right-hander wasn't sure what kind of toll the game took on him.\n\"Hopefully I'll be able to use my right arm for the things I usually use it for, and not have to rely on my left,\" he said.\nA native of Sechelt, British Columbia, Dempster pitched in the major leagues for 16 years, winning 132 games with five teams, but had never competed in the WBC. Thus his comeback.\n\"People along the way were going, 'Aw, man, what are you doing? You're going to get hurt,'\" he said. \"But it's the challenge of going out there in the WBC and pitching against the best hitters in the world. What more exciting thing to do than that?\"\nHe faced a bunch of the best hitters in the Dominicans, who went 8-0 in the 2013 tournament and might have a better team this year.\n\"Some of their bench players can start on a lot of teams,\" Dempster said. \"I kept waiting for the pitcher to hit. He never hit, and that got really tough.\"\nDempster got through a scoreless first inning despite giving up a leadoff double and a walk.\n\"Very Dempsteresque,\" he said.\nThings turned rocky in the second. Nelson Cruz led off with a double over the center fielder's head and scored on a single by Gregory Polanco. Welington Castillo followed with a two-run homer.\nDempster gave up four runs and six hits before getting out of the inning. Manager Ernie Whitt then removed him from the game so he might be available for Canada's third game this weekend.\n\"He threw the ball fine,\" Whitt said. \"They hit some balls hard, but they got some hits that made it through the infield.\"\nDempster expressed no regrets about his comeback, even if it was less than storybook.\n\"The whole experience was amazing,\" he said. \"I enjoyed every bit of tonight. That's probably the least upset I've been after pitching as poorly as I did in that second inning. I really did soak it all in. I was proud of not being afraid to fail.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4300442/No-regrets-Dempster-gets-rocked-return-retirement.html"}
