{"authors":["Associated Press"],"date_download":"2018-10-23 02:17:07","date_modify":"2018-10-23 02:17:07","date_publish":"2017-04-26 13:15:50","description":"OMAHA, Neb. (AP) - Norfolk Southern delivered a 12 percent increase in first-quarter profit as the railroad hauled 5 percent more coal, shipping containers...","filename":"data/vaneerConsumption/NorfolkSoutherndelivers12percentjumpin1Qprofit.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/17/wire-466327-1493222457-798_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447586_Norfolk-Southern-tops-Street-1Q-forecasts_1540261027.html","title":"Norfolk Southern delivers 12 percent jump in 1Q profit","title_page":"Norfolk Southern delivers 12 percent jump in 1Q profit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"OMAHA, Neb. (AP) - Norfolk Southern delivered a 12 percent increase in first-quarter profit as the railroad hauled 5 percent more coal, shipping containers of goods and other freight.\nThe Norfolk, Virginia-based company said it's first-quarter profit grew to $433 million, or $1.48 per share, over last year's $387 million, or $1.29 per share.\nNorfolk Southern Corp.'s (NSC) results exceeded the $1.35 per share expected by the analysts surveyed by Zacks Investment Research.\nIn this Thursday, Jan. 26, 2017, photo, a Norfolk Southern freight train hauling coal makes it way through downtown Pittsburgh. Norfolk Southern Corp. reports earnings, Wednesday, April 26, 2017. (AP Photo/Gene J. Puskar)\nThe railroad posted revenue of $2.58 billion in the period, which also beat Street forecasts. Eight analysts surveyed by Zacks expected $2.54 billion.\nIn the first quarter, Norfolk Southern said coal revenue jumped 20 percent to $420 million, and revenue from shipments of intermodal containers grew 9 percent to $571 million.\nNorfolk Southern officials said in January that the railroad planned to cut another $100 million of costs this year after trimming $250 million in expenses last year. That's part of a long-term restructuring plan the railroad announced last year to eliminate $650 million in costs by 2020.\nEdward Jones analyst Dan Sherman said the railroad's cost cutting helped offset a $64 million increase in fuel costs during the quarter. He said the results reinforced his decision to recommend buying the stock.\nCEO Jim Squires said he remains committed to the railroad's strategic plan even though rival eastern railroad CSX has announced more aggressive plans to reduce costs because he wants to maintain Norfolk Southern's service levels.\n\"We are watching closely what's happening in the industry with our peer. We are doing many of the same things albeit at a somewhat more measured pace,\" Squires said. \"We will focus on our strategy which revolves around safety, service, productivity and growth.\"\nFor instance, Norfolk Southern stored 150 locomotives last year, and plans to store another 150 this year as it works to boost train lengths and speeds to become more efficient. By comparison, CSX said last week it plans to store about 550 locomotives as it tightens up its train schedules.\nNorfolk Southern shares have risen 8 percent since the beginning of the year, while the Standard & Poor's 500 index has increased almost 7 percent. The stock has increased 28 percent in the last 12 months.\nNorfolk Southern Corp. operates about 20,000 miles of track in 22 states and the District of Columbia.\n_____\nElements of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on NSC at https://www.zacks.com/ap/NSC\n_____\nKeywords: Norfolk Southern, Earnings Report","url":"https://www.dailymail.co.uk/wires/ap/article-4447586/Norfolk-Southern-tops-Street-1Q-forecasts.html"}
