{"authors":["Press Association"],"date_download":"2018-10-22 22:40:46","date_modify":"2018-10-22 22:40:46","date_publish":"2016-01-28 10:49:31","description":"A man abused by a teacher and his headmaster 40 years ago has told how he has never stopped running from the abuse - and even joined the French Foreign Legio...","filename":"data/vaneerConsumption/Norfolkschoolabusevictimihaveneverstoppedrunningfromwhathappened.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-f5e7d937-548c-41c4-b9a9-5ed3761a97cb-4vVdYopwYQ7f641721b07ac16b2f-128_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420718_Norfolk-school-abuse-victim-I-never-stopped-running-happened_1540248046.html","title":"Norfolk school abuse victim: i have never stopped running from what happened","title_page":"Norfolk school abuse victim: i have never stopped running from what happened | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Norfolk school abuse victim: I have never stopped running from what happened\nA man abused by a teacher and his headmaster 40 years ago has told how he has never stopped running from the abuse - and even joined the French Foreign Legion to escape his demons.\nJames Warner, 52, now living in Nottinghamshire, has waived his right to anonymity to tell of his suffering at Sheringham Court school in Norfolk from the age of 12.\nDespite being abused throughout the 1970s, he said he could not find the courage to speak out until 2012 - prompted by the Jimmy Savile abuse claims - and had chosen to never have children of his own for fear he might repeat the abuse.\nJames Warner has spoken out over the abuse he suffered from a teacher and his headmaster 40 years ago\nMr Warner told the Press Association: \"When I was a child, I didn't know they were doing it to anybody else. I felt ashamed and that I wouldn't be believed.\n\"You think everybody can tell - like it's tattooed across your forehead that you're dirty.\"\nOn Wednesday, the school's former housefather Ken Wells, now 78, was jailed for 12 years for a series of sex offences against another boy.\nThat victim came forward in 2014 after seeing Wells convicted of indecently assaulting Mr Warner.\nHeadmaster Bryan Greenhalgh, 65, is serving a life sentence for his part in the abuse.\nMr Warner said the abuse started when he was playing in the woods and Wells took him into some rhododendron bushes.\nThe teacher then began coming to his room drunk at night and it was not long before Greenhalgh began abusing him as well.\nMr Warner said he continues to suffer to this day - he has self-harmed and spent time on a psychiatric ward.\nHe added he had drifted from job to job, including time as a yacht captain, a builder, a chef, a doorman and even joining the French Foreign Legion.\nDespite now being happily married, he and his wife chose never to have children after he told her of the abuse.\n\"It has affected my ability to have children because I was told at the time I would probably go on to abuse myself, I was so afraid of it happening that I chose not to have children and I feel like I have lost out now in a big way,\" he said.\n\"I was running all my life, running away from what happened to me, I was never settled.\n\"It was only very recently that I realised I'm not ashamed any more and hopefully speaking out will help other people come forward, not necessarily just for this case but others as well.\"\nHe said the growing publicity surrounding abuse by people in authority had created a climate in which more victims feel able to come forward.\n\"When it all came out about Jimmy Savile it brought it back into my mind, I started thinking a lot and getting angry,\" he said.\n\"I do believe something good has come out of the Jimmy Savile case, it has brought things out into the open now.\n\"Such massive abuse of trust by people in authority over children has to stop.\"\nWells, of Bracken Dale, Leicester, was found guilty of indecent assault and buggery against a boy under 16 after a trial at Ipswich Crown Court.\nAs well as being jailed, he was also placed on the sex offenders register for life.\nGreenhalgh, 65, previously of Suffield near North Walsham, pleaded guilty to 13 counts of indecent assault and one count of buggery in 2014 and was given a discretionary life sentence at Norwich Crown Court.\nDetective Inspector Andy Coller, who led the investigation, said: \"It has taken an enormous amount of courage for each victim to talk about the abuse, abuse they have had to live with for decades.\n\"It is pleasing that the passing of some 40 years has not hindered the legal process and that Greenhalgh and Wells have both been jailed for these crimes.\n\"Time may make our investigations more complicated, but it will not stop them.\"\nVictims are encouraged to contact the force on 101 or contact Norfolk's Sexual Assault Referral Centre on 0845 4564810.\nFormer Sheringham Court school headmaster Bryan Greenhalgh is serving a life sentence for his part in the abuse (Norfolk Police/PA)","url":"https://www.dailymail.co.uk/wires/pa/article-3420718/Norfolk-school-abuse-victim-I-never-stopped-running-happened.html"}
