{"authors":[],"date_download":"2018-10-22 20:55:29","date_modify":"2018-10-22 20:55:29","date_publish":"2014-06-03 16:39:32","description":"Norovirus might get a bad rap from cruise ship outbreaks, but the nasty gut bug is spread far more often at local restaurants.","filename":"data/vaneerConsumption/NorovirusThinkRestaurantsNotCruiseShipsCDCSays.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482941/140602-norovirus-jms-2029_16e4b0f2640ac5a92befeafde7bd3591.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_norovirus-think-restaurants-not-cruise-ships-cdc-says-n121401_1540241729.html","title":"Norovirus: Think Restaurants, Not Cruise Ships, CDC Says","title_page":"Norovirus: Think Restaurants, Not Cruise Ships, CDC Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Workers who fail to properly wash hands or use gloves and the 1 in 5 who come to work sick with diarrhea and vomiting every year help make norovirus the leading cause of foodborne disease outbreaks in the U.S., according to a new report by the Centers for Disease Control and Prevention.\nHealth officials called for better adherence to hand hygiene rules — and policies that provide paid sick leave for food service workers.\n\"The bottom line is that norovirus is one tough bug,\" CDC Director Tom Frieden told reporters Tuesday. \"Everyone should be able to go out to eat without worrying whether their food is safe.\"\nFoodborne norovirus now accounts for about a quarter of the 20 million annual cases linked to the group of viruses that cause acute gastrointestinal distress and general misery wherever they go. And it accounts for about half of norovirus cases with a single known cause. Between 2009 and 2012, there were 1,008 such outbreaks reported by 43 states, the CDC said.\nOf the non-food norovirus outbreaks, 80 percent occur in nursing home and long-term care settings. Only about 1 percent can be blamed on cruise ships, the CDC estimated.\nWhen CDC officials analyzed all the norovirus outbreaks submitted to the agency’s National Outbreak Reporting System, or NORS, over the four-year period, what they found was less than appetizing. Norovirus is spread through the fecal-oral route, when tiny particles of the virus are transmitted from hands to food, people or surfaces.\nRestaurants were the setting for two-thirds percent of the foodborne outbreaks, followed by banquet and catering sites. Of 520 outbreaks where the cause of the contamination was known, food service workers were the source in 70 percent of them. Workers who touched ready-to-eat foods with bare hands were explicitly identified in more than half of those cases.\nFood was almost always contaminated during preparation and raw food was the problem in 75 percent of cases with a known cause. The most frequently named foods were leafy greens like lettuce, fruits and mollusks.\nRestaurant managers have a duty to make sure workers follow food handling rules — and to put sick leave policies in place that let workers stay home for two days after symptoms subside, Frieden said.\n\"We do know how to stop norovirus from contaminating our food,\" he said.","url":"https://www.nbcnews.com/health/health-news/norovirus-think-restaurants-not-cruise-ships-cdc-says-n121401"}
