{"authors":["John Hayward"],"date_download":"2018-10-30 20:54:46","date_modify":"2018-10-30 20:54:46","date_publish":"2017-03-31 03:55:53","description":"Pyongyang responded with insults to Senator John McCain referring to dictator Kim Jong-un as \"the crazy fat kid that's running North Korea.\"","filename":"data/vaneerConsumption/NorthKoreaAccusesMcCainofBlasphemyforCallingKimJongunCrazyFatKid.json","image_url":"https://media.breitbart.com/media/2017/03/kim-jong-un-city-street-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_03_30__1540932886.html","title":"North Korea Accuses McCain of 'Blasphemy' for Calling Kim Jong-un 'Crazy Fat Kid'","title_page":"North Korea Accuses McCain of 'Blasphemy' for Calling Kim Jong-un 'Crazy Fat Kid'","title_rss":"NULL","source_domain":"breitbart.com","text":"Pyongyang has responded with both insults and threats to Senator John McCain (R-AZ) referring to dictator Kim Jong-un as “the crazy fat kid that’s running North Korea.”\n“He’s not rational,” McCain told MSNBC host Greta van Susteren on March 22nd. “We’re not dealing even with someone like Joseph Stalin, who had a certain rationality to his barbarity.”\nMcCain called on China to control Kim, saying Beijing could “stop North Korea’s economy in a week” if it wanted to.\nNorth Korea’s Foreign Ministry responded that McCain (and his colleague Senator Ted Cruz of Texas, who wants North Korea designated a state sponsor of terrorism) had insulted the “dignity” of the supreme leader.\n“What they uttered to dare hurt the dignity of the supreme leadership of the DPRK is just a manifestation of their worst hostility toward the DPRK’s ideology and social system and its people and a grave provocation little short of declaration of war against it,” the Foreign Ministry said, as transcribed by the UK Independent.\n“The service personnel and people of the DPRK are regarding the dignity of their supreme leadership as their life and soul,” the statement continued:\nThe US must know very well about how they react to any offensive acts against it. As such guys as John McCain and Ted Cruz made a provocation tantamount to a declaration of war against the DPRK, the DPRK will take steps to counter it. They will have to bitterly experience the disastrous consequences to be entailed by their reckless tongue-lashing and then any regret for it will come too late.\nThe Foreign Ministry capped this tirade off with a direct threat, promising that North Korea will “fulfill its sacred mission” to deal a “merciless sledge-hammer blow at those daring to hurt the dignity of the supreme leadership.”\nThe UK Independent adds that a Foreign Ministry spokesman accused McCain of “blasphemy” and described McCain and Cruz as “puppies knowing no fear of the tiger.”\nMcCain did not seem much intimidated by the threat. “What, did they want me to call him a crazy skinny kid?” he asked on Twitter.\nUnfortunately, McCain’s hopes for China to restrain North Korea’s corpulent leader are probably in vain. China banned its Internet users from referring to Kim by nicknames such as “Kim Fatty III” on social media. By the end of 2016, fat jokes about Kim were among the top 10 censored search terms on China’s Weibo service.\nOn Wednesday, The Hill published an op-ed from former CIA director James Woolsey and Dr. Peter Vincent Pry, the chief of staff for the Congressional EMP Commission, warning that North Korea’s threats are not necessarily implausible. The authors said, “false reassurance” was delivered to the American people by claims that North Korea can’t build a miniaturized nuclear warhead or reliable ICBM yet.\nWoolsey and Pry contend that North Korea might already have nuclear ICBM capability, or be very close to it, and they can always find other ways to deliver a nuke to the U.S. mainland, such as hiding it aboard a freighter and sailing it into an American harbor.\nThey also discuss the possibility of North Korea putting a small nuclear warhead aboard a satellite to carry out an electromagnetic pulse weapon attack. In fact, two North Korean satellites already pass over the United States in orbits that would work for an EMP attack.","url":"https://www.breitbart.com/national-security/2017/03/30/n-korea-accuses-mccain-of-blasphemy-for-calling-kim-jong-un-crazy-fat-kid/"}
