{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 01:25:16","date_modify":"2018-10-23 01:25:16","date_publish":"2016-01-28 15:46:51","description":"Washington intelligence has reported increased movement of components and propellant near a missile text site inside the country - ruled by Kim Jong Un (pictured) - in recent weeks.","filename":"data/vaneerConsumption/NorthKoreaisjusttwoweeksawayfromaSPACELAUNCH.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30A6757500000578-0-image-a-72_1453995940787.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421170_North-Korea-just-two-weeks-away-SPACE-LAUNCH-use-technology-basis-inter-continental-missiles-warn-officials_1540257916.html","title":"North Korea is just two weeks away from a SPACE LAUNCH","title_page":"North Korea is just two weeks away from a SPACE LAUNCH | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"North Korea plans to launch a rocket into space within the next fortnight, US officials have claimed.\nWashington intelligence has reported increased movement of components and propellant near a missile text site inside the closed country in recent weeks.\nThey now believe Kim Jong Un will conduct a space launch in the very imminent future.\n'Our concern though is that they do a space-launch but really it's the same technology to develop ICBMs (inter-continental ballistic missiles),' an official told Reuters news on Thursday.\nScroll down for video\nDictator: The news of the possible long-range missile launch comes just days after Kim Jong-un claimed he had weapons capable of obliterating the U.S.\nThe revelation comes just 24 hours after speculation that North Korea was preparing to launch a long-range missile as soon as next week, which itself followed claims by dictator Kim Jong-un that he had weapons capable of obliterating the U.S.\nJapan's Kyodo news agency, citing an unnamed Japanese government official, yesterday alleged there are signs of possible preparations for a missile launch based on analysis of satellite imagery of the North's Tongchang-ri missile test site on its west coast.\nThe government source said a missile launch could occur in about a week at the earliest, Kyodo reported.\nIt is not clear whether both allegations - of a space and missile launch - are related.\nU.N. Security Council members are currently calling for fresh sanctions against North Korea after it conducted its fourth nuclear test on January 6. The country is already under sanctions for its nuclear and missile programmes.\nIt last conducted a long-range rocket launch in late 2012, successfully putting an object into orbit in what is believed by experts to be part of its effort to build an intercontinental ballistic missile (ICBM).\nEarlier this month, North Korea's state news agency KCNA, reported that the leader's scientists 'are in high spirit to detonate H-bombs of hundreds of kilotons and megatons, capable of wiping out the whole territory of the US all at once'.\nKim Jong Un watches a submarine-launched ballistic missile which he claims could deliver a nuclear warhead, however experts claim the footage was faked\nThe declaration came after the pariah state claimed to have tested a hydrogen bomb and released suspect footage of a submarine-launched ballistic missile it claims could deliver such a weapon.\nState television broadcast footage of the test, said to have taken place in December, and boasted about the hermit nation's ballistic missile technology. Pyongyang said it would allow the country to deliver a nuclear warhead.\nExperts have largely dismissed the H-bomb test, saying the yield – around six kilotons – was far too low for a fully-fledged thermonuclear device, which would have been 100 times more powerful.\nThe KCNA commentary said the test 'was neither to 'threaten' anyone nor to 'provoke' someone for a certain purpose'.\nKCNA insisted that the main focus was on providing a 'sure guarantee' of the North's immunity from attack by hostile forces.\nPrime among those forces was the U.S. it said, offering an apocalyptic vision of how it would respond to US aggression.\nOn January 12, the U.S. House of Representatives voted nearly unanimously to pass legislation to broaden sanctions on the North.","url":"https://www.dailymail.co.uk/news/article-3421170/North-Korea-just-two-weeks-away-SPACE-LAUNCH-use-technology-basis-inter-continental-missiles-warn-officials.html"}
