{"authors":[],"date_download":"2018-10-30 18:17:26","date_modify":"2018-10-30 18:17:26","date_publish":"2017-04-18 22:09:00","description":"The once homeless student had had an unblemished record before he snapped a photo of an insructor at a urinal.","filename":"data/vaneerConsumption/NorthGastudentfacesfelonychargeoverbathroomphoto.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/18/Images/newsEngin.18442389_17884584_10212099975555463_2058626925125108427_n.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_georgi_e1256359a856b7856362aeb5ddbfeb62__1540923446.html","title":"North Ga. student faces felony charge over bathroom photo","title_page":"North Ga. student faces felony charge over bathroom photo","title_rss":"NULL","source_domain":"ajc.com","text":"Dante Jamal Harris is in many ways a model student. He graduated from high school with a 3.9 G.P.A., earned a $70,000 scholarship to the University of North Georgia and made last year’s Dean’s List at UNG, all while training to become an officer in the Georgia Army National Guard through the university’s ROTC program.\nNow a junior at UNG, Harris could be expelled, lose his National Guard commission and serve up to six years in prison, because of an embarrassing photo he took and shared with others.\nHarris was homeless before college.\n“My father chose to never meet me, my mother chose to never support me,” Harris wrote in an essay as part of his application to the university in 2014. “I live …with friends and neighbors because my mother decided to put a roof over her boyfriend’s head instead of her own son.”\nHarris maintained an unblemished record at UNG until Nov. 3, 2016. That was the day he saw one of his instructors, Major Richard Neikirk, in the bathroom of the Military Leadership Center on campus. The major was at a urinal but had his shorts pulled below his buttocks.\nAmused by the sight of his professor with his pants down, Harris took a picture. He then texted the picture to three friends, who shared it with hundreds of people on the messaging platform GroupMe. He later shared it with a fourth person, his superior officer in the cadet corps, when she ordered him to.\nHarris is charged with unlawful eavesdropping or surveillance, a felony, and transmission of photography depicting nudity, a misdemeanor. He faces up to six years in prison and a fine of $51,000.\nHe has been arrested and released on bond but has not been indicted. However, the Lumpkin County district attorney may move forward at anytime. On Wednesday, Harris will face a UNG disciplinary panel that will decide whether or not to revoke his scholarship, which pays for his room, meals, tuition, books, uniforms and fees.\nAttorney Jeff Wolff, who represents Harris, said he “is not guilty of what he’s been accused of.”\nHe points to the language of the criminal charges against his client. The felony count necessitates the photograph be taken “in any private place and out of public view.” To Wolff, a urinal in a public bathroom is not a private place. The misdemeanor charge alleges that Harris shared the photo to a social media site, which Wolff said he did not.\nWolff said he was shocked by the major’s behavior.\n“It is beyond me that (Neikirk) thought this was appropriate behavior,” he said.\nWhile he recognizes it would not justify taking and sharing a picture, Wolff believes the major should have known better than to expose himself in a public bathroom where it was likely that young men would enter.\nNeikirk did not respond to attempts to reach him Tuesday.\nAmber Massey took on the role of Harris’s mother after his biological mother kicked him out during his senior year of high school, she said. She helped him get a driver’s license, paid his high school graduation fees and helped him file for SNAP (formerly food stamps). She also posted his $7,500 bond, with help from family members.\nAmber Massey with Dante Harris. (william.robinson@coxinc.com)\n“He needed somebody, and we happened to be available,” Massey said.\nShe admits Harris did something wrong, but she doesn’t think he deserves a felony conviction.\n“He’s worked so hard, and he’s never been given anything,” she said.","url":"https://www.ajc.com/news/local-education/georgia-college-student-faces-charges-for-sharing-bathroom-photo/So4zodSsgq0lGjYhiAZmII/"}
