{"authors":["John Hayward"],"date_download":"2018-10-30 19:33:54","date_modify":"2018-10-30 19:33:54","date_publish":"2016-04-15 21:17:09","description":"Next month, North Korea will convene the first Korean Workers' Party Congress in 36 years. The impending event has been seen by analysts as influencing everything the secretive Communist state does.","filename":"data/vaneerConsumption/NorthKoreaRevealsDetailsofNuclearWeaponsProgram.json","image_url":"https://media.breitbart.com/media/2016/02/Kim-Jong-parade-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_15__1540928034.html","title":"North Korea Reveals Details of Nuclear Weapons Program","title_page":"North Korea Reveals Details of Nuclear Weapons Program","title_rss":"NULL","source_domain":"breitbart.com","text":"Next month, North Korea will convene the first Korean Workers’ Party Congress in 36 years. The impending event has been seen by analysts as influencing everything the secretive Communist state does – an opportunity to refresh the North Korean peoples’ sense of “unity” with their oppressive government and consolidate the power of dictator Kim Jong Un’s cabal of relatively young leaders.\nThe old leaders, perceived as either unduly loyal to Kim’s late father or their own ambitions, have been liquidated by the hundreds in a series of ruthless purges. An analysis at Forbes suggests Kim is a little more execution-happy than a truly secure ruler would be, and recent stories of defections among the few North Koreans trusted to travel overseas have clearly made the regime uncomfortable.\nWith the upcoming Party congress in mind, North Korea has publicly revealed details of its program for developing nuclear-tipped intercontinental ballistic missiles through a series of articles published over the past month.\nThe material published by Pyongyang includes close-up images of ground test activity, which aerospace engineer John Schilling described to Reuters as “almost unprecedented.”\n“The openness suggests that the underlying strategy is as much diplomatic as military: it is important to Pyongyang not only that they have these capabilities, but that we believe they have these capabilities,” said Schilling, echoing many observers who believe North Korea’s recent nuclear moves are intended to both rally its population and impress outside powers.\n“The revelations, pronouncements and ‘tests’ appear to be part of a campaign to establish the narrative that Pyongyang has, or will soon have, a nuclear-armed, long-range missile that could threaten the U.S. mainland,” said Michael Elleman of the International Institute for Strategic Studies. He thought the North Koreans clearly wanted to send the message that their nuclear and ballistic-missile programs would proceed at full speed ahead, in defiance of warnings and sanctions.\nElleman spoke for many skeptics when he said, “Each unveiling, if real, would be part of a structured program aimed at developing the capability. The open question is: How real are these tests?”\nThe question of veracity hangs over every statement North Korea makes, but Reuters describes an “increasing feeling among international arms experts that North Korea’s capability may be more advanced than previously thought.”\nFor example, it might be able to hit the continental United States with an ICBM by the end of this decade. Other claims made by North Korea include developing a nuclear warhead small enough to fit on a ballistic missile, testing long-range solid-fuel rocket engines, and – most dubiously – testing a crude hydrogen bomb.\nOn Wednesday, CNN reported that “U.S. intelligence satellites have spotted signs that North Korea may be preparing for an unprecedented launch of a mobile ballistic missile which could potentially hit portions of the U.S.”\nThe weapon system most likely to be tested, known as the Musudan missile, cannot reach the continental United States, but “could potentially hit Guam and perhaps Shemya Island in the outer reaches of Alaska’s Aleutian chain,” according to American officials.\nHowever, those officials said it was possible North Korea would launch one of two different mobile ballistic missiles, designated Kn-08 or Kn-14, which “would have a longer range and could potentially hit the Pacific Northwest of the United States.” The more accurate Kn-14 is believed to have been displayed at a military parade last year, but its operational capabilities have not yet been demonstrated.\nThe South Korean military also believes another North Korean nuclear test could be in the works.\nEchoing what was said in the Reuters piece about North Korea deliberately revealing details of its nuclear and missile programs, one American official told CNN that Kim Jong-Un “is determined to prove his doubters wrong.”","url":"https://www.breitbart.com/national-security/2016/04/15/north-korea-reveals-details-nuclear-weapons-program/"}
