{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:28:19","date_modify":"2018-10-30 18:28:19","date_publish":"2018-09-11 03:32:43","description":"North Korean Leader Kim Jong-un's new letter to U.S. President Donald Trump has renewed plans for a second meeting between the two leaders.","filename":"data/vaneerConsumption/NorthKoreaLetterRenewsTrumpKimSecondMeetingPlan.json","image_url":"https://media.breitbart.com/media/2018/09/North-Korea-Anniversary-Parade.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_10__1540924099.html","title":"North Korea Letter Renews Trump-Kim Second Meeting Plan","title_page":"North Korea Letter Renews Trump-Kim Second Meeting Plan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new letter from North Korean Leader Kim Jong-un to U.S. President Donald Trump sought to renew plans for a second meeting between the two leaders, and those plans are now in motion, White House Press Secretary Sarah Sanders told reporters Monday.\n“The President has received the letter from Kim Jong-un,” Sanders confirmed when asked during Monday’s press briefing. She characterized it as a “very warm, very positive letter.” The contents, however, will not be released unless Kim agrees.\n“The primary purpose of the letter was to request and look to schedule another meeting with the president, which we are open to and are already in the process of coordinating that,” said Sanders. She pointed to the absence of nuclear arsenal in the recent parade in North Korea and the letter as evidence of progress President Trump has achieved in the relationship with that nation. She said that the administration considers the absence of nuclear arsenal items in their weekend parade as “a sign of good faith.”\nSanders listed the North Korean return of U.S. remains and hostages, the halt of nuclear material and missile testing, and the summit between Kim and Trump as progress in relations between the two nations. “This letter is just further indication of the progress that we hope to continue to make,” she added.\nThe press secretary said the letter from Kim to Trump “certainly showed a commitment to continuing conversations” and “a continued commitment to focus on denuclearization of the Peninsula.”\nAsked if China deserves some of the credit for “some improvement in North Korea’s stance,” Sanders replied, “I think that the president deserves the credit in this process. He’s been the lead voice and the one that put the initial pressure on North Korea.” She added that President Trump has “very publicly expressed his gratitude towards [Chinese] President Xi [Jinping] for the role that they play.” Sanders qualified Trump’s gratitude by saying, “He would have liked to have seen them continue to step up and do more.”\n“We’d still like to see them step up and do more,” Sanders said of China’s part in progress on the denuclearization of the Korean peninsula. “We’re going to continue to hopefully work with President Xi and his team and his administration to continue making progress.”\nAsked if President Trump believes that he needs to negotiate personally with Kim, Sanders said North Korea’s decisions “have to run through Kim Jong-un” and it’s to be expected he would “want to talk to his counterpart in President Trump.” She added, “We think it’s important, and we’re glad that we’re making progress.”\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook","url":"https://www.breitbart.com/politics/2018/09/10/north-korea-letter-renews-trump-kim-second-meeting-plan/"}
