{"authors":["Karen Ruiz For Dailymail.Com"],"date_download":"2018-10-23 03:58:37","date_modify":"2018-10-23 03:58:37","date_publish":"2017-03-16 15:05:21","description":"Mike and Melanie Leitner of North Carolina had placed their daughter Ella's name on the transplant list in November after doctors found the baby had a large mass on her left ventricle.","filename":"data/vaneerConsumption/NorthCarolinababygetsheartmomentsafterparentspray.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54DA7E00000578-0-image-a-17_1489675523224.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320598_North-Carolina-baby-gets-heart-moments-parents-pray_1540267117.html","title":"North Carolina baby gets heart moments after parents pray","title_page":"North Carolina baby gets heart moments after parents pray | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A North Carolina couple was told their baby girl was getting a new heart moments after praying for it at their church.\nMike and Melanie Leitner had placed their daughter Ella's name on the transplant list in November after doctors found the baby had a large mass on her left ventricle, WBTV reported.\nThe mother and father were close to losing hope after they were told Ella's condition had worsened.\nA true miracle: A heart donor match was found for baby Ella after her parents Melanie and Michael Leitner (pictured) prayed for their daughter at church\nHealthy baby: Ella received the transplant and has since turned one year old and has been doing well\nMelanie said her daughter had not breathing well and was 'gray' all the time. Doctors told the parents their daughter may not survive the weekend.\nBut during a church service in Mooresville in January, the congregation took a moment to pray for Ella's new heart.\nWhile the family was on their way home from the service, they received a phone call that turned their despair into hope.\nDoctors had found a donor match for baby Ella.\n'Celine, our other coordinator, called and said we got the offer for the perfect heart for Ella. If this wasn’t a God moment, I don’t know what could be,' Melanie said.\nDr. Gonzalo Wallis from the Levine Children's Hospital's pediatric heart transplant program carries baby Ella\nHappy ending: The baby girl has since turned one and is said to be doing well after her transplant\nThe parents also acknowledged that their baby's new heart meant tragedy for another family.\n'You know that another family has lost their child. And you know that in their darkest moments they were able to make the decision that saved my little girl,' the mother said.\nThe family said baby Ella has recently turned one and is doing well after her transplant.","url":"https://www.dailymail.co.uk/news/article-4320598/North-Carolina-baby-gets-heart-moments-parents-pray.html"}
