{"authors":["Lucy Crossley For Mailonline"],"date_download":"2018-10-23 01:57:42","date_modify":"2018-10-23 01:57:42","date_publish":"2016-01-28 16:26:08","description":"Care worker Angela Hemmings, 59, from Kings Heath, Northampton, has begged Northampton Partnership Homes for a bigger house since July last year.","filename":"data/vaneerConsumption/Northamptonfamilywhoaskedforabiggercouncilhometoldtosleepkidsinbath.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB3C4300000578-0-image-a-17_1453996118843.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421075_Family-six-asked-bigger-council-house-outraged-officials-tell-sleep-grandchildren-bath_1540259862.html","title":"Northampton family who asked for a bigger council home told to sleep kids in bath","title_page":"Northampton family who asked for a bigger council home told to sleep kids in bath | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A grandmother who complained about her family of six's overcrowded council house says she was shocked when officials told her the children could sleep in the bath.\nCare worker Angela Hemmings, 59, also says she was advised to turn the dining room table at in her home in Kings Heath, Northampton, into a makeshift child's bed.\nMs Hemmings, who lives in the two-bedroom terraced house with her daughter Helen Forward, 34, and four grandchildren has begged Northampton Partnership Homes (NPH) - who manage council housing services - for a bigger house since July last year.\nAngela Hemmings, 59, pictured in her bathroom, says she complained about her family of six's overcrowded council home and was told by officials the children could sleep in the bath\nMs Hemmings says her family of six are crammed into two small bedrooms, one pictured, and a box room every night\nThe grandmother lives in the two-bedroom terraced house (pictured) in Kings Heath, Northampton, with her daughter Helen Forward, 34, and four grandchildren\nHowever, she has repeatedly been told she cannot go on the waiting list because her home does not meet the statutory limit for overcrowding set by the Government.\nMs Hemmings also claims she was told by a Northampton Partnership Homes housing officer to 'put a board over the bathtub' to turn it into a bed.\nShe said the officer also told her to do the same with the dining room table to create extra children's beds during a recent assessment of the £110,000 house.\n'Under no circumstances is my daughter or any of my grandchildren sleeping in a bathroom, it just isn't happening,' Ms Hemmings said.\n'When I explained I needed a bigger house, an officer from Northampton Partnership Homes told me \"put a board over the bathtub\". He also suggested using the dining room table.\n'How on earth in this day in age can children be expected to sleep on a table or in a bath tub? It's barbaric. We all work hard but have basically been told \"tough\" by the council.'\nMs Hemmings, who has three grown up children and 17 grandchildren, has been a social housing tenant for nearly 30 years and is asking to be put on the waiting list for a bigger home.\nShe had initially lived there with Ms Forward and her 11-year-old daughter, but last summer her two grandsons, aged five and ten, and her eight-year-old granddaughter came to live with her.\nShe says her family of six are crammed into two small bedrooms and a box room every night, with Ms Hemmings sharing her bedroom with the two boys, who sleep on a bunk bed.\nThe two girls sleep on another bunk bed in the other bedroom, and Ms Forward sleeps in the small box room.\nBut under housing regulations a household is not classed as overcrowded as long as there is a separate room for a couple, a single adult aged 21 or older and two young people of the opposite sex aged 10 or over.\n'I contacted the council in the summer when my three grandchildren came to live with us because I need a bigger house,' Ms Hemmings said.\n'A lady came out to look around my home but she said that we probably wouldn't be able to get anything bigger.\n'She said we had a good solid dining room table so you could put a mattress on that and she said you could put a board on the bath.\nMs Hemmings, pictured in the living room of her home, said she has been asking council workers for a bigger house since July last year\nShe claims council workers also advised her turn the dining room table (pictured) at her home into a makeshift child's bed\nMs Hemmings shares her bedroom (pictured) with her two grandsons, who sleep on a bunk bed\n'I said what happens if someone needs the toilet and she said we could pull the shower curtain out for privacy.\n'She said she knows it's not ideal but we could do it.\n'I couldn't believe my ears, it is ridiculous that the council told me to do that.\n'Putting a child on a table or the bath is abuse, people would be straight around to take the children off me.'\nMs Hemmings, who works in the laundry room at a care home, has lived at her home for 17 years but has been a council tenant for over 25 years.\nShe pays £105-a-week in rent as well as council tax but says she is willing to pay more in order to get a bigger house.\n'I am not asking to jump the queue, I just want to be able to join the queue and be allowed to bid on the bigger properties,' she said.\n'But the council said because of the rules and regulations I am not overcrowded.\n'I don't know if it is the Government rules or not but at the moment it is the council telling me I am not eligible so there is nothing I can do.\n'I love my house, I've lived in it for years and have done it up nicely but I just need a bigger property.\n'It is not fair on the children. They are happy children but the boys shouldn't have to share a bedroom with their gran.\n'They need space and especially as they get older and turn 16, it will become even worse then.'\nUnder housing regulations, a household is not classed as overcrowded as long as there is a separate room for a couple, a single adult aged 21 or older and two young people of the opposite sex aged 10 or over. Ms Hemmings is pictured outside her home\nMs Hemmings's situation was also spoken about as part of a debate on overcrowding at a Northampton Borough Council meeting on Monday.\nBut a Labour motion put to the full council asked the controlling Tory group to do 'what it can to help alleviate overcrowding in homes, including going beyond statutory our duties' was turned down.\nThe council's cabinet member for housing, Councillor Stephen Hibbert, said their housing allocations policy is currently under review anyway\nHe added: 'There are guidelines and as you know we must work within the law.\n'But this is a far more complex issue than it appears.\n'How do you determine allocating a home between a family lacking a bedroom or someone who has to move because of a serious medical condition?'\nNorthampton Partnership Homes is responsible for the management of council housing services in the area.\nThe not-for-profit organisation is wholly owned by the council but has its own Board of Directors.\nA spokesman said they had to enforce the council's housing allocations policy and would not move families unless they met the statutory overcrowding limit.\n'The current housing allocation policy accepts a reasonable preference to households who have been assessed as being statutorily overcrowded,' he said.","url":"https://www.dailymail.co.uk/news/article-3421075/Family-six-asked-bigger-council-house-outraged-officials-tell-sleep-grandchildren-bath.html"}
