{"authors":["John Hayward"],"date_download":"2018-10-30 19:35:12","date_modify":"2018-10-30 19:35:12","date_publish":"2017-04-01 01:38:28","description":"Secretary of Defense James Mattis was asked in London about his 2012 assessment of Iran as the greatest threat facing the U.S.","filename":"data/vaneerConsumption/NorthKoreasRecklessActionsHaveGottoBeStopped.json","image_url":"https://media.breitbart.com/media/2016/08/wi/afp_c764f78d656c235e9ad67f78fff8301b85eefd42-e1473898320207.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_03_31__1540928112.html","title":"North Korea's 'Reckless' Actions Have 'Got to Be Stopped'","title_page":"James Mattis: North Korea's 'Reckless' Actions Have 'Got to Be Stopped'","title_rss":"NULL","source_domain":"breitbart.com","text":"At a news conference in London, Secretary of Defense James Mattis was asked about his 2012 assessment of Iran as the greatest threat facing the United States. He turned to North Korea instead, suggesting Pyongyang has displaced Tehran as top threat in the Trump administration’s reckoning.\nMattis said Iran remains “the primary state sponsor of terrorism,” but, “in the larger scheme of things,” North Korea is more troubling.\n“This is a threat of both rhetoric and growing capability, and we will be working with the international community to address this. We are working diplomatically, including with those that we might be able to enlist in this effort to get North Korea under control. But right now it appears to be going in a very reckless manner. That’s got to be stopped,” Mattis said, as related by Fox News.\nNBC News recalls Secretary of State Rex Tillerson’s comment this month that 20 years of diplomatic efforts to “bring North Korea to a point of de-nuclearization have failed,” so all options are now “on the table.”\nNeither Tillerson nor Mattis went into any details about what those options might be. As analysts routinely point out, North Korea would be extremely difficult to invade, and its conventional arsenal could wreak enormous loss of life and economic damage on South Korea, even if it cannot yet field nuclear-tipped ICBMs.\nThe Hill notes that the Trump administration has been considering further sanctions against Pyongyang, “placing diplomatic and economic pressure specifically focused on Chinese banks conducting business with North Korea.”","url":"https://www.breitbart.com/national-security/2017/03/31/mattis-north-koreas-reckless-actions-have-got-to-be-stopped/"}
