{"authors":[],"date_download":"2018-10-30 19:34:48","date_modify":"2018-10-30 19:34:48","date_publish":"2017-02-21 06:29:33","description":"Pyongyang (AFP) – A North Korean state economic official sought Tuesday to play down the impact of China’s shock announcement that it was","filename":"data/vaneerConsumption/NorthKoreadownplaysimpactofChinacoalban.json","image_url":"https://media.breitbart.com/media/2017/02/wi/afp/21/38f6qr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540928088.html","title":"North Korea downplays impact of China coal ban","title_page":"North Korea downplays impact of China coal ban - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pyongyang (AFP) – A North Korean state economic official sought Tuesday to play down the impact of China’s shock announcement that it was suspending coal imports from the country for the rest of the year.\nThe move, which came shortly after another missile launch by Pyongyang and the assassination of its leader’s half-brother in Kuala Lumpur, would go much further than the latest UN sanctions imposed on the country over its nuclear and missile programmes.\nChina is the North’s sole major ally and by far its biggest trading partner, with coal the biggest component of its purchases -– according to figures from Chinese Customs it imported more than 22 million tonnes last year, worth nearly $1.2 billion.\nIt is a crucial foreign currency-earner for the isolated North.\n“Of course if we can no longer export things that we used to export, it can have some impact on the companies that are directly involved in exports,” Ri Sun-Chol, chief of the economic research institute of the North’s Academy of Social Sciences, told AFP in an interview.\nBut he added: “Direct exports of natural resources have been under great restrictions. So I can’t say that it would have substantial impact on the economy.”","url":"https://www.breitbart.com/news/north-korea-downplays-impact-of-china-coal-ban/"}
