{"authors":["Jay Akbar For Mailonline"],"date_download":"2018-10-23 02:05:53","date_modify":"2018-10-23 02:05:53","date_publish":"2017-04-26 12:57:48","description":"North Korean defectors have become stars in the neighbouring South after appearing on kitsch TV show where they sing, dance and open up about Kim Jong-Un's oppressive regime.","filename":"data/vaneerConsumption/NorthKoreandefectorsarecelebritiesinSouth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F6B1300000578-0-image-a-4_1493206941094.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4421090_From-North-Korean-defectors-minor-celebrities_1540260353.html","title":"North Korean defectors are celebrities in South","title_page":"North Korean defectors are celebrities in South | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Joo Chanyang once sold cigarettes and socks to labourers to raise enough money to escape oppressive North Korea.\nShe then trekked 2,000 miles through China, risking imprisonment and execution, to reach the safety of South Korea.\nBut now Joo is mobbed by fans on the streets Seoul, mingles with celebrities and has has thousands of social media as she is appeared with other North Korean defectors on a kitsch reality TV show, 'Now On My Way To Meet You'.\nFeaturing 15 defectors from Kim Jong-un's brutal regime, they discuss their former lives: from the horrors of public executions and famine to beauty products and North Korea's drinking culture.\nPanelists like Joo became overnight stars in South Korea on the tacky show with gaudy studio by singing, dancing and mocking feared dictator Jong-un.\nCelebrity: Joo Chanyang, above, is one of many North Korean defectors who found fame in South Korea after appearing on reality TV show 'Now On My Way To Meet You'\nI'm a North Korean: Defectors became overnight stars in South Korea on the tacky show with gaudy studio by singing, dancing and mocking feared North Korea dictator Kim Jong-un\nDefectors: Featuring 15 people who fled Jong-un's regime, they discuss their former lives: from horrors of public executions and famine to beauty products and North Korea's drinking culture\nCelebs: Defectors like Choi Joo-Yeon, pictured, are seen as celebrities in South Korea where they are mobbed by fans of the streets of Seoul and have thousands of social media followers\n'The people who appear on this show have become minor celebrities,' said Sokeel Park, research director for Liberty, which helps North Korean refugees settle in the South. 'Not A-list but more C-list. The people who are interested in them are usually older and more conservative.'\nJoo has appeared in more than 100 episodes since she was invited onto the show by in 2012.\nBut despite her new found fame, Joo insists she is just an ordinary person - and not even 'pretty enough' to be on TV.\n'I don't consider myself a celebrity... It's hard to deal with fans,' Joo told The Guardian.\n'I am not pretty or talented enough to be an entertainer, but because of these shows, South Koreans have started to be interested in North Korean people.\n'The young generation still think North Korea is a foreign country. I strongly believe that we are the same people, that it is one nation.'\nLight-hearted: On realty show, defectors - known as 'beauties - discuss everything from the surge in cosmetic surgery to how North Korean men are 'useless' at chatting up women\nCulture shock: In one fun episode defector Minwu, centre, discussed North Korea's drinking culture, using a dinner table to explain how it is rude to finish your drink quickly at the table\nHeartbreak: But in another episode, defector Soo-Ryeon told of how her mother was buried in a blanket on a mountainside because the family were too poor to afford a proper funeral\n'The government is bad, not the people... Not everyone worships Kim Jong-un. With more exposure, people will get to know North Koreans better.'\nJoo's journey to freedom and fame began with a swim across the Tumen River into China, where she was arrested along with 20 more of those who escaped. She was saved by a religious group who reunited her with her family in South Korea.\nAnother star panelists are Ara Kim, who studied drama at college after defecting and Han Seo-hee, who was part of a secret 'elite' music troupe for tyrant Jong-un's father, Kim Jong-Il.\n'I still feel uncomfortable when I have to make people laugh or perform. I'm still wedded to North Korea's stiff style,' said 30-year-old Han.\n'I was worried that a lot of malicious comments might be posted [on the show's website].\n'But when I actually looked, there were a lot of supportive messages, so I think I was right to appear on this show.'\nStar: The show has made stars out of some of its panelists including Ara Kim, above, who studied drama at college after defecting to South Korea\nPhenomenon: The kitsch chat show also sparked a nationwide obsession with so-called 'Defector TV' which includes comedies and dating shows. Pictured: Panelist Choi Joo-Yeon\nFamous: 'The people who appear on this show have become minor celebrities,' said Sokeel Park, one of the producers. Pictured: Joo Chanyang, one of the newfound stars\nOn realty show, defectors - known as 'beauties - discuss everything from the surge in cosmetic surgery to how North Korean men are 'useless' at chatting up women.\nIn one episode, Minwu, a defector, demonstrated how finishing your drink at the dinner table in North Korea is considered rude because alcohol is so expensive.\nIn another, Soo-Ryeon said her mother's body was carted up the side of a mountain by her brother and because they couldn't afford to give her a proper funeral.\n'My mother didn't have a coffin, she was just rolled up in a blanket,' she said.\n'When Kim Il-song died, Kim Jong-il spent billions of dollars to build a memorial for his father so that his body would never decay.\n'This is so wrong and disgusting. My mother worked hard to raise me even when we were too poor to eat.\n'It makes me sad to think that my mother is getting stepped on by random strangers because there's only a sheer level of soil above her body.'\nOpening up: Panelists like Joo, who has appeared on more than 100 episodes, discuss every aspect of their former, which helps connect South Koreans and defectors from the North\nHumble: But Joo, who escaped North Korea by swimming across the Tumen River, insists she is just an ordinary person, adding: 'I don't consider myself a celebrity... It's hard to deal with fans'\nAlthough more than 23,000 North Koreans fled south since the 1990s, many struggle to settle, find themselves alienated socially and often end up doing low-paid jobs.\nShow producer Mr Park claims the show highlights their difficulties and connects North and South Koreans.\n'Many of those who have defected from the North have had trouble settling in South Korea.\n'Appearing on the TV shows has helped them be accepted. There is still a deep suspicion of those who have made their home in the south.'\nMr Park added: 'The shows are a way of showing the people of south Korea what those from North Korea are like.\n'The only film that usually comes out of North Korea shows the leader or his soldiers. 'But the women on the show are ordinary people who have gone through many hardships to escape.'\nSidelined: More than 23,000 North Koreans have defected south since the 1990s, but many find it hard to settle, and often end up in low-paid jobs jobs. Pictured: Panelist Yoo Hyun-joo","url":"https://www.dailymail.co.uk/news/article-4421090/From-North-Korean-defectors-minor-celebrities.html"}
