{"authors":[],"date_download":"2018-10-22 22:26:30","date_modify":"2018-10-22 22:26:30","date_publish":"2014-05-10 15:23:38","description":"A North Korean newspaper clarified that in efforts to protect sovereignty, the country will continue nuclear testing.","filename":"data/vaneerConsumption/NorthKoreaPushesFowardWithNuclearTestingReport.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/434011/140510-kim-jong-un-mn-1130_8bb8bcac0ef6526ade5d8107c4848c54.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_asia_north-korea-pushes-foward-nuclear-testing-report-n102126_1540247190.html","title":"North Korea Pushes Foward With Nuclear Testing: Report","title_page":"North Korea Pushes Foward With Nuclear Testing: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSEOUL — North Korea renewed a threat on Saturday to conduct a nuclear test amid heightened concern that the reclusive state with a stockpile of missiles may set off an atomic device for the fourth time on the path to building a nuclear arsenal.\nNorth Korea's official Rodong Sinmun newspaper said the country was justified in using all available means at its disposal to counter aggressive challenges by the United States and South Korea aimed at stifling its sovereignty.\nNorth Korea clarifies \"its resolute stand that it would take counter-measures including nuclear test to protect the sovereignty and dignity,\" the newspaper said in a commentary carried by the official KCNA news agency.\nThe threat comes days after statements by South Korea's defense minister that preparations for a new test appear to be near completion although analysis by an American thinktank last week suggested a test may not be imminent.\nNorth Korea had stepped up the threat in March to show off its military strength to counter what it said was hostility led by the United States after the U.N Security Council condemned Pyongyang's launch of mid-range missiles into the sea.\n\"We would not rule out a new form of nuclear test for bolstering up our nuclear deterrence,\" it said in March. North Korea is heavily sanctioned by U.N. resolutions adopted beginning in 2006 but has defied pressure to abandon its missile and nuclear programs. It last conducted a nuclear test in February last year.\n— Reuters","url":"https://www.nbcnews.com/news/asia/north-korea-pushes-foward-nuclear-testing-report-n102126"}
