{"authors":["Frances Martel"],"date_download":"2018-10-30 19:16:31","date_modify":"2018-10-30 19:16:31","date_publish":"2018-07-26 17:23:43","description":"Secretary of State Mike Pompeo said North Korea was still producing fissile material despite vowing denuclearization.","filename":"data/vaneerConsumption/NorthKoreaIsStillProducingFissileMaterial.json","image_url":"https://media.breitbart.com/media/2017/09/GettyImages-828726402-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_26__1540926991.html","title":"North Korea Is Still Producing 'Fissile Material'","title_page":"Mike Pompeo: North Korea Is Still Producing 'Fissile Material'","title_rss":"NULL","source_domain":"breitbart.com","text":"Secretary of State Mike Pompeo told the Senate Foreign Relations Committee on Wednesday that the U.S. government had reason to believe North Korea was still producing fissile material despite vowing the complete denuclearization of the Korean peninsula.\nSpeaking at a hearing on President Donald Trump’s recent in-person discussion with communist dictator Kim Jong-un, Pompeo was asked to what extent the North Korean regime appears to be continuing nuclear weapons development. For much of 2017, Kim Jong-un and his government media arm continuously threatened the use of nuclear weapons against the United States and allies like Japan and South Korea. Early this year, however, Kim announced that, due to the “success” of the nation’s military development, his regime would shift its focus away from war and towards economic development.\nIn his meeting with Trump in Singapore on June 12, Kim signed a document along with the American president promising to support the denuclearization of the Korean peninsula, which many observers claimed meant the end of the North Korean nuclear program but skeptics suggested could be interpreted as the removal of American assets from the peninsula, as the United States is a nuclear power.\nIn his remarks Wednesday, Pompeo confirmed that Washington believes North Korean officials “continue to produce fissile material” and that the two sides have an “awful long way to go” before arriving at peace.\n“We are engaged in patient diplomacy, but we will not let this drag out to no end,” Pompeo promised the senators. “I emphasized this position in the productive discussions I had with Vice Chairman Kim Yong-chol.”\n“Our objective remains the final, fully verified denuclearization of North Korea, as agreed to by Chairman Kim Jong-un,” Pompeo confirmed, adding that full implementation of sanctions on the country is necessary to achieve that goal. “We absolutely need every single nation to maintain the enforcement of those sanctions to which every nation is committed. The path ahead is not easy, but our hopes for a safer world – and a brighter future for North Korea – endure,” he concluded.\nPompeo also highlighted one bit of apparent good news that surfaced in the past week: a report from the monitor site 38 North that suggests North Korea is shutting down its Sohae Satellite Launching Station. The report, using satellite images of the facility, notes that key areas of the facility are being dismantled, possibly permanently, limiting North Korea’s ability to fire long-range missiles. The Sohae site was often used for testing intercontinental ballistic missiles (ICBM), which means its shutdown could limit any North Korean ability to hit U.S. territories. It does not necessarily mean, however, that North Korea no longer poses a threat to its neighbors, particularly Japan and South Korea, especially if nuclear material continues to be processed for use.\nPompeo’s assessment that North Korean officials are still processing fissile material is consistent with another recent report, this time from the Diplomat magazine, which suggested that North Korea is still running at least one covert uranium enrichment facility. Uranium must be enriched – have its composition changed so that it is significantly more unstable/fissile than how it is typically found in nature – to be used for nuclear energy or nuclear weapons. That facility, identified as “Kangson” in this month’s report, is believed to be twice as efficient in enriching uranium than the Yongbyon nuclear facility, the nation’s flagship. While Pyongyang has made a spectacle of shutting down parts of Yongbyon, satellite images suggest enrichment activity at the site as recently as a month ago.\nThe South Korean Chosun Ilbo newspaper, citing original sourcing from Radio Free Asia, reported on Thursday that North Korean state propaganda also indicates that the country is not ready to give up its nuclear weapons. Communist Workers’ Party of Korea (WPK) officials are reportedly being told in meetings that “‘nuclear weapons are a precious legacy from the late leaders’ and ‘without them there is death,'” according to an inside source. It remains unclear if civilians are receiving the same indoctrination.\nFollow Frances Martel on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/07/26/pompeo-north-korea-still-producing-fissile-material/"}
