{"authors":["Associated Press"],"date_download":"2018-10-23 03:33:18","date_modify":"2018-10-23 03:33:18","date_publish":"2016-01-28 19:09:02","description":"WASHINGTON (AP) — The U.S. Senate Foreign Relations Committee approved legislation Thursday to tighten sanctions against North Korea following its latest nuc...","filename":"data/vaneerConsumption/NorthKoreasanctionsbillclearsUSSenatecommittee.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421444_US-Senate-committee-approves-North-Korea-sanctions-bill_1540265598.html","title":"North Korea sanctions bill clears US Senate committee","title_page":"North Korea sanctions bill clears US Senate committee | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"North Korea sanctions bill clears US Senate committee\nWASHINGTON (AP) — The U.S. Senate Foreign Relations Committee approved legislation Thursday to tighten sanctions against North Korea following its latest nuclear test explosion.\nThe bipartisan measure expands on legislation that passed the House two weeks ago aimed at denying Pyongyang hard currency for its weapons programs.\nRepublican committee chairman Sen. Bob Corker said Thursday the bill is expected to go to the Senate floor in the second week of February.\nThe legislation would have to be approved by both chambers of Congress to go to President Barack Obama's desk.\n\"The latest nuclear test is a reminder of the failure of current U.S. and international policy to eliminate the threat of North Korea's nuclear program,\" Corker said. He said the bill would \"tighten the web of sanctions\" as part of a policy to denuclearize North Korea and promote human rights.\nNorth Korea already faces wide-ranging sanctions from the United States and under existing U.N. resolutions is prohibited from trading in weapons and importing luxury goods.\nThe new legislation seeks additional sanctions — both mandatory and at the discretion of the president — against the government of North Korean leader Kim Jong Un and those who assist it.\nIt would require the investigation and punishment of those who knowingly import into North Korea any goods or technology regarding weapons of mass destruction; those who engage in human rights abuses, money laundering and counterfeiting that supports the Kim regime; and those who engage in \"cyber-terrorism.\"\nThe bill also bans foreign assistance to any country that provides lethal military equipment to North Korea, and targets Pyongyang's trade in key industrial commodities.\n\"The enactment of this bipartisan legislation would represent the most meaningful and comprehensive response toward addressing the threat that North Korea presents to our national security interests and the security interests of our friends and allies,\" said Democratic Sen. Bob Menendez.\nThe U.N. Security Council is also deliberating how to punish Pyongyang for its Jan. 6 nuclear test. The U.S. is pushing for tougher sanctions, but China, which is North Korea's most important ally, chief trading partner and a key source of economic assistance, appears reluctant to support new penalties.","url":"https://www.dailymail.co.uk/wires/ap/article-3421444/US-Senate-committee-approves-North-Korea-sanctions-bill.html"}
