{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 02:37:21","date_modify":"2018-10-23 02:37:21","date_publish":"2016-01-28 17:30:25","description":"David Curran, 56, was caught attempting to meet a 15-year-old girl for sex in Newcastle city centre by members of vigilante paedophile hunting group Dark Justice after they 'trapped' him online.","filename":"data/vaneerConsumption/NorthumberlandpervertDavidCurranisconfrontedbyvigilantepaedophilehunters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACF7C700000578-0-image-a-30_1454007963186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421343_Dramatic-moment-middle-aged-pervert-confronted-vigilante-paedophile-hunters-thought-meeting-15-year-old-girl_1540262241.html","title":"Northumberland pervert David Curran is confronted by vigilante paedophile hunters","title_page":"Northumberland pervert David Curran is confronted by vigilante paedophile hunters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the dramatic moment a middle-aged pervert was confronted by paedophile hunters when he thought he was meeting a 15-year-old girl for sex.\nDavid Curran had been chatting online to who he thought was a 15-year-old girl but in reality had fallen into a 'trap' set by Dark Justice.\nThe 56-year-old walked away from the Newcastle city-centre meeting but was quickly tracked down by cops, who had been called by the group.\nScroll down for video\nDavid Curran, pictured left and right, admitted trying to meet a child after sexual grooming and was handed a suspended sentence at Newcastle Crown Court\nDuring the conversations, he asked questions about the girls underwear and even sent her a picture of his near naked body with her name scrawled on his chest.\nWhen his home was raided, officers found 1,673 indecent images of children among his porn collection of around 50,000 legal pornographic pictures and movies.\nAt Newcastle Crown Court, Curran, of Warkworth, Northumberland, admitted attempting to meet a child following sexual grooming as well as making and possessing indecent photographs of children.\nProsecutor Jonathan Devlin told the court Curran had called the girl 'sexy', soon after they started chatting in July 2014, even after he was told she was 15.\nMr Devlin said: 'He asked if he could kiss her, asked a number of questions about her underwear, sent images of himself semi-naked and naked but holding his genitals.\n'On one of the images he had written the name 'Becca' on his body.'\nThe court heard within weeks Curran had suggested seeing the girl and they arranged to meet at the Millenium Bridge on Newcastle's quayside.\nCurran was filmed here in Newcastle by Dark Justice after agreeing to meet 'Becca' after talking online\nHe is seen walking away from his accusers claiming he thought the girl was 'pretending to be 15'\nEventually he is seen running across Newcastle's Millennium Bridge being pursued by a member of Dark Justice, pictured centre, blurred\nMr Devlin said: 'He was videoed, wearing the pink shorts described in the chat.\n'He was approached and asked was it appropriate to meet a 15-year-old girl.'\nThe court heard Curran said he was 'sorry' and that his actions were 'role play' before leaving the meeting point and being traced by the police.\nJudge John Milford QC said Curran had 'become isolated from the world' and that said his actions had been 'disturbing'.\nThe judge told Curran: 'You walked straight into a trap which had been set by others on the internet.\n'You have developed, in mid-life, an extremely unhealthy interest in teenage girls, which you were prepared to put into effect.\nCurran was given a 20-month suspended sentence and a sexual harm prevention order at the court, pictured\n'It is fortunate you have been foolish and you were apprehended in this way before any harm could be done to someone such as Rebecca.\n'Immense harm has been done to the subject of the images you had on the computer.'\nCurran was sentenced to 20 months imprisonment, suspended for two years, with supervision, programme requirements, a five year sexual harm prevention order and ten years on the sex offenders register.\nThe judge said far more work could be done to protect public safety if Curran could be treated in the community Anne Richardson, defending, said: 'If he is sent to prison no work will be done with him.\n'He will come out remaining isolated.'\nMiss Richardson said Curran has lived a law abiding life and turned to the internet when things started to 'go wrong' in his personal life.","url":"https://www.dailymail.co.uk/news/article-3421343/Dramatic-moment-middle-aged-pervert-confronted-vigilante-paedophile-hunters-thought-meeting-15-year-old-girl.html"}
