{"authors":["Nuzha Nuseibeh"],"date_download":"2018-10-30 22:31:18","date_modify":"2018-10-30 22:31:18","date_publish":"2014-08-15 14:32:09","description":"As it sometimes does, North Korea fired some rockets into the sea on Thursday. As it happens, though, just as the rockets were being fired, Pope Francis was landing beside that same sea, beginning his visit to South Korea. But the timing, North…","filename":"data/vaneerConsumption/NorthKoreaAccidentallyFiresRocketsTowardsPopeFrancisBlamesThePontiff.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/220730ea-7f62-45a9-800b-6697a92a40fd.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35899-north-korea-accidentally-fires-rockets-towards-pope-francis-blames-the-pontiff_1540938678.html","title":"North Korea \"Accidentally\" Fires Rockets Towards Pope Francis, Blames The Pontiff","title_page":"North Korea \"Accidentally\" Fires Rockets Towards Pope Francis, Blames The Pontiff","title_rss":"NULL","source_domain":"bustle.com","text":"As it sometimes does, North Korea fired some rockets into the sea on Thursday. As it happens, though, just as the rockets were being fired, Pope Francis was landing beside that same sea, beginning his visit to South Korea. But the timing, North Korea said Friday, was purely coincidental — although, they added pointedly, why did he choose then to visit their rival? On the very day they were going to test their rockets?\nOn Thursday morning, Pope Francis landed in South Korea, at an air base in Seoul. It was the beginning of a five-day trip, in which the pontiff was to speak with the relatives of April's ferry disaster victims, and call for peace between the North and South. All that was temporarily overshadowed, though, because just before the Pope landed, North Korea fired three rockets off its east coast. According to Reuters, the rockets flew 135 miles before landing in the sea on either side of Pope Francis. North Korea then launched another two later that day.\nWas this a message, people wondered? Earlier this year, the North fired rockets when President Barack Obama visited Seoul. Could this be a way to deter the Pope before he even starts his trip? Or punishment for his visiting the enemy?\nAbsolutely not, North Korea said Friday. “We don’t know and in fact have no interest at all in why he is traveling to South Korea and what he is going to plot with the South Korean puppets,” Kim In-yong, a North Korean rocket scientist, told the Korean Central News Agency, according to the New York Times.\nFeng Li/Getty Images News/Getty Images\nAccording to various sources, the rockets were either pre-scheduled to be tested on that particular day, or timed specifically in memory of \"the Korean peninsula’s liberation from Japanese occupation on Aug. 15, 1945.\" Either way, nothing to do with Pope Francis and his plans for peace-making. But Kim pointed out that it was strange that the Pope should chose that day — the very day they were going to test their rockets — to arrive in Seoul.\nSaid he, according to the New York Times: “Why of all the days of the year, as numerous as the hairs of a cow, did the pope choose to come to the South on the very day we had planned to test our rockets?”\nTouché, Kim. Touché.","url":"https://www.bustle.com/articles/35899-north-korea-accidentally-fires-rockets-towards-pope-francis-blames-the-pontiff"}
