{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 22:03:21","date_modify":"2018-10-30 22:03:21","date_publish":"2016-10-18 21:06:35","description":"According to a task force report out of Northwestern University, administrators are planning to quadruple the number of safe spaces for black students.","filename":"data/vaneerConsumption/NorthwesterntoQuadrupleSafeSpacesforBlackStudentsAfterComplaints.json","image_url":"https://media.breitbart.com/media/2016/01/south-park-safe-space.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_10_18__1540937001.html","title":"Northwestern to Quadruple Safe Spaces for Black Students After Complaints","title_page":"Northwestern to Quadruple Safe Spaces for Black Students After Complaints | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to a task force report out of Northwestern University, administrators are planning to quadruple the number of safe spaces for black students.\nThe proposal for additional environments for black students came after a 149-page-report on the “Black Student Experience” at Northwestern. The report concluded that black students feel “dissatisfied, exhausted and alienated on campus.” As a result, the report provided 14 recommendations on how the experience for black students could be approved at Northwestern.\nMembers of task force behind Black Student Experience committee hope to see changes soon. https://t.co/ZAkrWgNEow pic.twitter.com/Gq5epH6H2h — Daily Northwestern (@thedailynu) September 22, 2016\nThe recommendations include increasing the black population amongst both the students and faculty, creating an “academic support hub” for black students, increasing the inclusivity of fraternities and sororities, and quadrupling the spaces where exclusively black students can socialize.\nOne finding in the data is the sense of diverse Black identities and experiences that cannot all be encompassed in the Black House alone. So it seems like a good moment to call for the creation of new spaces for Black connection and community building, but ones which are open to student definition and creation. Therefore, in addition to the Black House, the task force recommends three space options for making Northwestern accessible to Black students for social purposes. The guidelines for reserving the spaces should be broadly understood and have clearly articulated policies.\nThe report also suggests that admissions officers at the university should aggressively recruit black students and faculty. To achieve this end, the report suggests that prospective black students should be offered attractive financial-aid packages and black faculty candidates should be offered exciting research opportunities.\nSome students interviewed for the report argued that the predominantly white greek life system dictates the campus culture trends that have they now want reversed. “In fact, some African American/Black students go so far as to blame the predominantly White fraternity and sorority community for campus climate issues.”\nTom Ciccotta is a libertarian who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/social-justice/2016/10/18/northwestern-quadruple-safe-spaces-black-students-complaints/"}
