{"authors":[],"date_download":"2018-10-22 21:54:27","date_modify":"2018-10-22 21:54:27","date_publish":"2014-06-06 05:55:21","description":"\"American citizen Jeffrey Edward Fowle entered the DPRK as a tourist on April 29 and acted in violation of the DPRK law.\"","filename":"data/vaneerConsumption/NorthKoreaDetainsanAmericanTouristforViolatingtheLaw.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/491426/140606-north-korea-flag-3a_91ac4f4ae74af4ec28fb3a088d374ab6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_north-korea-detains-american-tourist-violating-law-n124226_1540245267.html","title":"North Korea Detains an American Tourist for Violating the Law","title_page":"North Korea Detains an American Tourist for Violating the Law","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNorth Korea detained a 56-year-old tourist from Ohio for flouting its laws after entering the isolated kingdom, bringing to three the number of Americans being held by Pyongyang.\n\"American citizen Jeffrey Edward Fowle entered the DPRK as a tourist on April 29 and acted in violation of the DPRK law, contrary to the purpose of tourism during his stay,\" state news agency KCNA reported on Friday, referring to the country's official name, the Democratic People's Republic of Korea.\nThe U.S. Embassy in Beijing confirmed the detention.\nCiting diplomatic sources, Japan's Kyodo News reported that the man was detained after leaving behind a Bible at the hotel where he had been staying.\nA spokesman for the family said, Fowle, who is married with three children, was not on a mission for his church.\nIn April, North Korea announced that it had detained a 24-year-old American while he was being processed to enter the country. He was initially identified as Miller Matthew Todd, and later named as Matthew Miller. Pyongyang said he entered the country on April 10 with a tourist visa, but tore it up and shouted that he wanted asylum. The report said he chose the North \"as a shelter.\"\nNorth Korea has been holding a Korean-American missionary, Kenneth Bae, since November 2012. Bae was sentenced to 15 years of hard labor for what the North says were hostile acts against the state.\nIn November, North Korea detained an 85-year-old American war veteran for more than a month.\nNorth Korea has been pushing to promote tourism as part of efforts to earn badly needed foreign currency, but the country is also extremely sensitive about how visitors act while in the country.\nMerrill Newman later said he was coerced into a reading a videotaped apology for “hostile acts” against the state and thanked all those who had helped him during his time in captivity.\n- Ed Flanagan and F. Brinley Bruton, with The Associated Press and Reuters","url":"https://www.nbcnews.com/news/world/north-korea-detains-american-tourist-violating-law-n124226"}
