{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 23:38:58","date_modify":"2018-10-30 23:38:58","date_publish":"2016-12-06 00:00:00","description":"The Department of Transportation gave Norwegian Air's controversial Irish subsidiary approval to operate in the US.","filename":"data/vaneerConsumption/NorwegianAirInternationalcomingtoAmericawith69tickets.json","image_url":"https://amp.businessinsider.com/images/5845e60be02ba735318b738a-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_norwegian-air-international-america-69-tickets-2016-12_1540942738.html","title":"Norwegian Air International coming to America with $69 tickets","title_page":"    Norwegian Air International coming to America with $69 tickets - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Norwegian Air Boeing 787. Norwegian Air Late Friday, the US Department of Transportation finalized its decision to grant Norwegian Air International approval to operate flights into the US.\nIn April, the Federal Agency granted the Norwegian Air subsidiary tentative permission to enter the market.\n\"This case is among the most novel and complex ever undertaken by the Department,\" The DOT said in its final ruling on the matter.\n\"Regardless of our appreciation of the public policy arguments raised by opponents, we have been advised that the law and our bilateral obligations leave us no avenue to reject this application.\"\nNAI's arrival in America has been the subject of great criticism from airlines and unions representing US-based airline workers.\nNAI is one of several subsidiaries operating under the Norwegian banner. Unlike the rest of Norwegian Air, NAI is based in Dublin instead of in Norway. This, critics say, allows NAI to take advantage of Ireland's employment laws, which are significantly less stringent than Norway's. As a result, they say, NAI could hire lower-cost pilots and cabin crew members from Asia to fly trans-Atlantic routes. Some go as far as calling Norwegian's strategy the aviation equivalent of a cargo ship's with a flag of convenience used to dodge taxes and regulations.\nThe airline currently operates flights into the US using its Norway-registered Norwegian Long-Haul subsidiary with Europe-based pilots and crew.\nNorwegian Air In a statement to the media, AFL-CIO Transportation Trades Department president Edward Wytkind wrote:\n\"Today's decision betrays America's aviation workers by granting a rogue, flag-of-convenience airline a permit to serve the United States. Unless reversed, this decision threatens a generation of U.S. airline jobs and tells foreign airlines that scour the globe for cheap labor and lax employment laws that America is open for business. Clearly, a Norwegian-owned airline that is based in Ireland for the purpose of evading Norway's labor and tax laws, and that will hire crews under Asian contracts, is in violation of these explicit labor protections and should be denied entry into our marketplace.\"\nThe Air Line Pilots Association, a union that represents 54,000 US and Canadian airline pilots echoes the AFL-CIO's aggravation.\n\"We are extremely disappointed by the Department of Transportation's decision to run roughshod over the U.S. Open Skies agreement and allow Norwegian Air International to fly to and from the United States,\" ALPA president Capt. Tim Canoll said in a statement. \"This decision is an affront to fair competition and will ultimately result in the loss of U.S. jobs and, potentially, significant losses for the U.S. international aviation industry.\"\nNorwegian Air Boeing 787-8 interior. Norwegian In light of the DOT's ruling, Norwegian Air announced on Friday that it will ramp up the hiring of American pilots and cabin crew.\n\"In October this year, Norwegian announced it would open its first U.S. pilot base at Fort Lauderdale-Hollywood International Airport,\" Norwegian Group CEO Bjørn Kjos said in a statement. \"Now that we finally have our DOT approval for Norwegian Air International, I'm pleased to announce that we will also be opening a second and third pilot base in the U.S.\"\nThe second and third crew bases will be in the New York and Greater Boston areas, Norwegian Air spokesperson Anders Lindström told Business Insider. The initial group of 25 US pilots destined for the Fort Lauderdale base will be begin training in March to fly the airline's fleet of Boeing 787 Dreamliners.\nOnce the airline's new generation 737MAX 8 aircraft enters service during the middle of 2017, Norwegian is expected to hire another batch of US pilots for the New York and Greater Boston bases.\nAccording to Lindström, all pilots hired for the new US bases are either currently flying for another US airline or are American pilots flying overseas. In addition, Lindström told Business Insider back in April that the airline pays its pilots \"almost exactly\" the same regardless of where they are based.\nAccording to the airline, its New York base will have more than 300 cabin crew by year's end while its Ft. Lauderdale base will have nearly 200.\nIn addition, Norwegian is expected to hire another 150 pilots and cabin crew members in the US during 2017. In 2018, Norwegian is eyeing the possibility of additional pilot and crew bases in Oakland and LAX, Lindström said.\nNorwegian Air CEO Bjorn Kjos in the cockpit of a Boeing Dreamliner. Norwegian With the arrival of the new Boeing 737MAX next year, Norwegian will begin offering $69 tickets to Europe from secondary cities in the Northeastern United States. Norwegian Air CCO Thomas Ramdahl told the Wall Street Journal that the airline intends to set up a base at Stewart International Airport in upstate New York while Bradley International Airport in Hartford is also under consideration.\nNorwegian Air currently operates 118 Boeing 737 and 787 airliners with another 260 Boeing and Airbus jets on order. In 2017, the airline is expected to take delivery of nine 787s, six 737MAXs, and 17 737NG aircraft. Norwegian — which was named the best low-cost airline in Europe by Skytrax for the fourth consecutive year in July — currently operates 450 routes with 150 destination around the world. In addition, Skytrax reviewers also named Norwegian the best long-haul, low-cost airline in the world.","url":"https://www.businessinsider.com/norwegian-air-international-america-69-tickets-2016-12"}
