{"authors":["The Investigative Project On Terrorism","Ipt"],"date_download":"2018-10-30 18:10:46","date_modify":"2018-10-30 18:10:46","date_publish":"2016-07-06 03:27:53","description":"Let's say the Church of Scientology launched a program it said was aimed at creating healthy work environments and bridging family divides.","filename":"data/vaneerConsumption/NoSacredCowsTheWashingtonPostContinuesCarryingCAIRsWater.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-513568270-e1467775663503.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_05__1540923046.html","title":"No Sacred Cows? The Washington Post Continues Carrying CAIR's Water","title_page":"No Sacred Cows? The Washington Post Continues Carrying CAIR's Water | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Let’s say the Church of Scientology launched a program it said was aimed at creating healthy work environments and bridging family divides, even those involving church critics.\nWhat would the news stories read like? After all, there are ever-expanding accounts of former Scientologists who say they were physically abused, or who werecut off from loved ones deemed hostile to the church.\nVirtually any news story about the new program would cover this context in detail. It’s reasonable to expect major news outlets would devote entire stories comparing the new claims to the church’s history. It would be inconceivable to omit that background even if the new program proved to be a smashing success.\nThis is what makes the Washington Post‘s coverage of the Council on American-Islamic Relations (CAIR) so confounding. The newspaper, which rarely hesitates to investigate the backgrounds of politicians, companies and more, has never seen fit to delve into CAIR’s checkered history.\nIndependence Day brought yet another story casting CAIR as a reliable partner in the fight against terrorism and Islamist extremism. CAIR’s Florida chapter, the headline says, “is doing what the government has so far failed to do.” It tells the story of “intervention teams” on alert in South Florida to help cases of radicalized Muslims who might be thinking of committing violence. Some of the seven individuals identified so far have been referred to law enforcement, the story says.\nThere’s no way to know if that assertion is true. It is a claim taken at face value.\nThere’s also no way – short of doing their own independent searches – for readers to know that CAIR itself has direct, court-acknowledged connections to a terrorist group. They don’t know because the Post didn’t mention it in this, or any other story, since the information came to light in 2007.\nFrom its first days, CAIR was a cog in a Hamas-support network called the Palestine Committee, records show. Egypt’s Muslim Brotherhood created the committee to help Hamas “with what it needs of media, money, men and all of that.”\nAt least three original CAIR officials, Nihad Awad, Omar Ahmad and Nabil Sadoun, are on the Palestine Committee’s telephone list. Mousa Abu Marzook, a longtime Hamas political leader, is the first name listed. Ahmad, who sometimes was identified as “Omar Yehya,” also is listed on the Palestine Committee’s executive board.\nEyewitnesses told federal investigators that Hamas and Muslim Brotherhood connections shared by CAIR founders were widely known when the organization was founded.\nBylaws establish that the Muslim Brotherhood executive office created the Palestine Committee “to serve the Palestinian cause on the U.S. front.” A 1991 document repeatedly refers to the Brotherhood’s role directing Palestine Committee activities. Among the instructions that year: “Collecting of donations for the Islamic Resistance Movement [Hamas] from the Ikhwan [Muslim Brotherhood] and others.”\nAnother report from around that time explicitly states that the committee sees its charge as “defending the Islamic cause in Palestine and support for the emerging movement, the Hamas Movement.”\nThis is the mission into which CAIR was born.\nOmar Ahmad, a co-founder and longtime CAIR national chairman, was described as “a leader within the Palestine Committee” in testimony by FBI Special Agent Lara Burns.\nNihad Awad, the only executive director in CAIR’s history, joined Palestine Committee colleagues during a weekend-long emergency meeting in 1993 to discuss ways to “derail” the U.S.-brokered Oslo Accords. The deal was hailed as a potential peace breakthrough and created an autonomous Palestinian Authority.\nThat was unacceptable to the Palestine Committee because it sidelined the Islamists in Hamas, and because it included Palestinian acceptance of Israel’s existence. Concerned that the American public would see them as terror supporters, the group’s officials instructed members never to mention Hamas by name, instead choosing to reverse the spelling and talk about “Samah.” Awad, in this FBI transcript, did just that.\nThe group also discussed creating “a new organization for activism” which might be better received publicly because “we are marked.”\nCAIR was created the following summer, where it promptly appeared on the Palestine Committee’s next meeting agenda.\nThe exhibits described above have never been reported in the Post.\nWhen the Post has written about CAIR’s background, it has been at the most superficial of levels: CAIR minimizes its status as an unindicted co-conspirator in a Texas Hamas-financing trial in which these documents became public record; a “fact-check” which concludes that the unindicted co-conspirator label “is one of those true facts that ultimately gives a false impression.”\nWould the Scientologists receive similar kid-glove treatment? Would a candidate for office?\nThis is not a case of differing perspectives. The documents were seized from the participants and reflect real-time Palestine Committee activities.\nWhile CAIR was never charged, prosecutors made it clear in court filings that they had evidence showing CAIR was part “of the conspiracy” and acted “in furtherance of the conspiracy.”\n“CAIR has been identified by the Government at trial as a participant in an ongoing and ultimately unlawful conspiracy to support a designated terrorist organization, a conspiracy from which CAIR never withdrew,” they wrote.\nThe Post is led by Marty Baron, a man who has demonstrated the tenacity to take on religious organizations as mighty as the Catholic Church when they might be engaged in improper activity. So far, however, that same gritty determination has not been focused on the Islamists who run CAIR, despite their profile and their organization’s checkered history.\nThat is a shame.\nThis article originally appeared at the Investigative Project on Terrorism.","url":"https://www.breitbart.com/national-security/2016/07/05/no-sacred-cows-washington-post-continues-carrying-cairs-water/"}
