{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:39:05","date_modify":"2018-10-30 18:39:05","date_publish":"2016-01-08 15:18:58","description":"Migrant flows from Turkey into Europe have remained constant despite an EU pledge of €3 billion to Turkey and expedited accession talks.","filename":"data/vaneerConsumption/NoSignofTurkeyStemmingMigrantFlowDespiteAccepting3bnPayment.json","image_url":"https://media.breitbart.com/media/2015/12/TURKEY-GREECE-EUROPE-MIGRANTS-coast-guard-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_08__1540924745.html","title":"No Sign of Turkey Stemming Migrant Flow, Despite Accepting €3bn Payment","title_page":"No Sign of Turkey Stemming Migrant Flow, Despite Accepting €3bn Payment | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The flow of migrants from Turkey into Europe has remained constant despite a pledge by the European Union (EU) to hand €3 billion in aid to Ankara, and reviving negotiations on allowing it’s middle eastern neighbour to join the bloc.\nUnited Nations data shows that on average 3,005 people arrived in Greece every day last week, having made the perilous crossing from Turkey across the Aegean Sea. By comparison, during the last week of November the daily average was 2,849, with daily averages of between 3,000 and 3,600 in the intervening weeks.\nThat despite a pledge made by the EU on 29th November to furnish Turkey with €3 billion in aid, intended to improve conditions for Syrian refugees in the country to dissuade them from travelling to Europe, and a host of other concessions including re-opening negotiations on allowing Turkey to join the Union.\nFrans Timmermans, the European Commission’s first vice-president, has announced his intention to travel to Ankara this weekend to discuss the poor results. He insisted that Turkey must live up to its end of the agreement, the Financial Times has reported.\n“We are all committed as part of the joint action plan to bring the figures substantially down. It’s quite clear that over the last couple of weeks the figures have remained relatively high,” Mr Timmermans said at a news conference in Amsterdam with Dutch and EU leaders. “So there’s still a lot of work to do there.”\nHe added: “Our cooperation with Turkish authorities is positive. We will continue discussing ways of improving the effectiveness of their operations.\n“We have seen the first results which are encouraging but we are a long way from being satisfied.”\nHowever, Turkish representatives countered that they have always made it clear that the migrant flow might continue. Ahmet Davutoglu, Turkey’s prime minister, said at the time the deal was signed that he could offer “no guarantees” as the situation would depend on events in Syria.\nGerald Knaus, head of the European Stability Initiative said that it has always been unrealistic to expect the deal to bring down numbers flowing into Europe. “It was obvious to everybody three months ago that it wouldn’t work. Both sides are to blame for that, because they didn’t negotiate seriously,” he said.\nHe added that the only solution, in his opinion, was for Turkey to commit to accepting failed asylum seekers returned to them by Greece.\nTurkey, however, has an incentive to turn a blind eye to the people smuggling trade happening in its ports, as its police force takes hefty bribes from people smugglers to allow the trade to continue.\nIn September, a Syrian doctor turned people smuggler revealed how he made £60,000 a year from the trade after costs – which included occasional $1,000 bribes paid to police turning up at his office.\nAnother, plying his trade in Izmir told of how busloads of migrants would be dropped off in Basmane square, directly on the doorsteps of the smugglers who barter for trade under the gaze of armed policemen. “The police are taken care of,” he said.\nCommission President Jean-Claude Juncker, speaking at the same conference as Timmermans, said he was confident that by summer EU member states would have reached an agreement to set up a common European Border and Coast Guard in a bid to enact greater control, especially in Greece and Italy.\n“We have to save Schengen,” he said. “We cannot go on with this process where day after day another member state is reintroducing border controls.”","url":"https://www.breitbart.com/europe/2016/01/08/no-sign-of-turkey-stemming-migrant-flow-despite-accepting-e3bn-payment/"}
