{"authors":["Abc News"],"date_download":"2018-10-30 00:56:15","date_modify":"2018-10-30 00:56:15","date_publish":"2018-10-29 11:46:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/NotablebetsVegassuffersanotherlosingSunday.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_notable-bets-vegas-suffers-losing-sunday_story_id=58828037_1540860975.html","title":"Notable bets: Vegas suffers another losing Sunday","title_page":"Notable bets: Vegas suffers another losing Sunday - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Notable bets is a regular Monday roundup of wagers -- some sharper than others -- made recently at sportsbooks across the nation.\nIt took awhile for MGM sportsbook director Jeff Stoneback to find a game that his shop came out ahead on as he scrolled through the early NFL results Sunday afternoon. But that's not what stood out most.\n\"It's very unusual to have so many games with the sharps on the same side,\" Stoneback said. \"You don't see that all that often.\"\nIs the betting public getting sharper?\nOdds are against it, but for a second straight Sunday, the Joes held their own with the Pros, delivering another jolt to the hard-luck sportsbooks, which can't ever seem to catch a break. (Note: Nevada sportsbooks have not had a losing month statewide since July 2013.)\nHere are the notable bets from the week that was:\nNFL\n• Email from Caesars Palace at 11:30 a.m. ET Sunday: \"Two-way action is non-existent. We need every underdog on the board, except the Packers. This is the first week where we will need the Rams, barring a large wager. Right now, our biggest needs are the Jets and Giants.\"\n• The Rams, Jets and Giants all failed to cover the spread.\n• \"Worst Sunday of the season so far. Not a bloodbath but a solid loser,\" South Point sportsbook director Tim Fitzgerald said Sunday night.\n• Respected money came in early in the week at MGM on the Green Bay Packers and Chicago Bears. \"We had early money on the Bears during the week from the professionals,\" Stoneback said, \"and then the public was all over the Bears, too. That was not a good game for us.\" Chicago won 24-10 over the Jets and covered the eight-point spread.\n• Last Sunday, when the SuperBook posted its opening lines on the NFL, a bettor placed a $50,000 bet on the Bears -6 vs. the Jets, and $48,000 on the Texans -7 (-120) vs. the Dolphins in the Thursday game. Both were winners.\n• The New Orleans Saints' 30-20 win over the Minnesota Vikings Sunday night sealed a losing day for multiple Nevada sportsbooks. \"We took some money, close to six figures, on the Saints +1.5, +1 and even at -2 today,\" Stoneback said. \"That was another game where the sharps and public were on the same side.\"\n• Running back Todd Gurley's decision not to score a touchdown late in the Rams' 29-27 win over the Packers impacted the point spread and total, and produced mixed results for Las Vegas sportsbooks.\n• The only significant win MGM had out of the eight early kickoffs was the underdog Seattle Seahawks winning outright over the Detroit Lions.\n• \"The Cardinals coming back and winning [over the favored San Francisco 49ers] kind of saved the day for us,\" Randy Blum, SuperBook at Westgate Las Vegas manager, said in an email.\n• In a seemingly risky investment, a bettor this week at the SuperBook put $10 on the Arizona Cardinals to win the Super Bowl at 5,000-1 odds. \"Pretty good payout, but seems somewhat unlikely,\" John Murray, SuperBook at Westgate director of race and sports, said.\nCollege\n• The deep-pocketed customer known as the Duffel Bag Bettor, for his knack of bringing cash to the sportsbooks in a duffel bag, was back in action Saturday, going around Las Vegas placing large wagers on college . At MGM, he bet $120,000 to win $100,000 on Purdue to beat Michigan State and added a $50,000 two-team parlay on Purdue and Clemson to cover against Florida State, according to sportsbook manager Scott Shelton.\nThat was just one book.\nVegas Sports and Information Network radio personality Paul Howard reported that the same bettor at William Hill's sportsbook placed a $100,000 bet on Purdue, a $100,000 two-team parlay on Purdue and Clemson, and a $30,000 three-teamer. And Covers.com reported that the SuperBook also took a \"large five-figure\" bet on Purdue.\nPurdue (-2.5) lost to Michigan State 23-13.\n• Remarkable: A bettor at DraftKings on Saturday parlayed Oregon State (+1,400) and Kansas (+475) on the money line. The $50 bet paid $4,313, after the Beavers erased a 28-point deficit to beat Colorado and the Jayhawks stunned TCU for their third win of the season.\n• Caesars Palace opened Alabama as a 14.5-point favorite at LSU. In May, the South Point sportsbook posted the first line on the game, installing Alabama as a 10-point favorite.\n• Other notable Week 10 CFB opening lines at Caesars Palace:\nPenn State at Michigan -10\nGeorgia -9.5 at Kentucky\nNebraska at Ohio State -21\nOklahoma -10.5 at Texas Tech\nWest Virginia at Texas -2\nNotre Dame -8 at Northwestern\nWorld Series\n• The DraftKings sportsbook in New Jersey, before Game 1 of the World Series, took a $500,000 bet on the Boston Red Sox to beat the Los Angeles Dodgers and win the World Series. The bettor won $325,000 when the Red Sox clinched the World Series with a Game 5 win on Sunday.\n• The Hollywood Casino at Charles Town Races in West Virginia took a $75,000 bet on the Red Sox in Sunday's Game 5.\n• The Saints-Vikings game Sunday night generated 2.5 times more betting handle at MGM than Game 5 of the World Series, which took place at the same time.\n• Studies have shown that people who have bets on sporting events stay tuned longer -- apparently a lot longer, as Friday's 18-inning marathon between the Red Sox and Dodgers showed. The last bets FanDuel accepted on the Game 3 epic were placed at 3:29 a.m. ET Saturday. The game ended at 3:30 a.m.\n• By the time the Dodgers' Max Muncy hit the game-winning home run in the bottom of the 18th, approximately 5,600 bets were placed at FanDuel, 40 percent more than the next most heavily bet game since the sportsbook began operating in August (Yankees-Red Sox, Oct. 9).\nNBA\n• The Houston Rockets entered the weekend at 8-1 odds to win the NBA title, behind the Golden State Warriors (1-3) and Boston Celtics (6-1). Jeff Sherman, who oversees the SuperBook's NBA odds, anticipates moving the Rockets' title odds to 5-1 if Houston acquires Jimmy Butler and thinks his addition would narrow the gap between the Rockets and Warriors somewhat significantly. \"I have Butler worth about 2.5 points to Minnesota,\" Sherman added. \"I think he'd be worth about 1.5 points on a Rockets team, because he'd go from a first option to a second or third option with Houston.\"\n• Three weeks into the season, points, fouls and free throws are all up. Through Friday, NBA games were averaging 225.3 points this season, up from 212.7 last season, and overs were hitting at a near 60-percent clip. Sherman said the totals have increased alongside the scores, and professional bettors are starting to target unders. He pointed to Saturday's Utah-New Orleans game. The total opened at 225 and was bet down all the way to 219. Utah won 132-111.\n• The average over/under total over the past five seasons was 205.8. This season, the lowest total to this point in the season on any game was 204.5, for the Indiana Pacers- Memphis Grizzlies game on Oct. 17.\nOdds and ends\n• College basketball: The season tips off Nov. 6, and Caesars Palace has the early lines on the opening marquee matchups. Kansas is a five-point favorite over Michigan State, and the Duke-Kentucky line opened at pick 'em.\n• NHL: Commissioner Gary Bettman will make a \"major sports betting\" announcement at 11 a.m. ET Monday in New York City.\n• Parlay: A bettor at FanDuel's sportsbook in New Jersey connected on a pair of six-figure parlay payouts Saturday, the book reported.\nThe bets:\n-- $800 10-teamer that paid $187,633.52: Washington State +2.5, California +12, San Jose State -2.5, Tulane +1, Syracuse +2, Notre Dame -22, Mississippi State -1.5, Florida International -3 and the Boston Celtics and Utah Jazz on the moneyline.\n-- $1,200 8-teamer that paid $108,612.93: Washington State +2.5, California +12, San Jose State -2.5, Tulane +1, Syracuse +2, Notre Dame -22, Mississippi State -1.5 and Florida International -3.","url":"https://abcnews.go.com/Sports/notable-bets-vegas-suffers-losing-sunday/story?id=58828037"}
