{"authors":["John Hayward"],"date_download":"2018-10-30 19:30:56","date_modify":"2018-10-30 19:30:56","date_publish":"2016-04-11 04:00:34","description":"Sueddeutsche Zeitung, the German newspaper holding the Panama Papers, announced it will not present all 11.5 million documents to the public.","filename":"data/vaneerConsumption/NotAllPanamaPapersArePublicInterest.json","image_url":"https://media.breitbart.com/media/2016/04/panama-papers-newspaper-headlines-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_10__1540927856.html","title":"Not All 'Panama Papers' Are 'Public Interest'","title_page":"Newspaper Possessing Leaks: Not All 'Panama Papers' Are 'Public Interest'","title_rss":"NULL","source_domain":"breitbart.com","text":"Sueddeutsche Zeitung, the German newspaper, which was initially given the immense trove of stolen “Panama Papers” data from the Mossack Fonseca law firm by an unidentified source, has announced it will not present all 11.5 million documents to the public or law enforcement agencies.\n“That’s because the SZ isn’t the extended arm of prosecutors, or the tax investigators,” said the paper, as reported by the Associated Press.\nThe paper went on to say that “authorities have legal powers to obtain such documents from those suspected of wrongdoing, and in many cases there’s no public interest in revealing companies’ or individuals’ offshore business dealings,” according to the AP.\nAlso noteworthy is Sueddeutsche Zeitung’s insistence that it does not know how the anonymous source came to be in possession of the data. All they would say is that he, or she, was motivated by “a very strong moral impulse” to “make these crimes public.”\nOn the one hand, SZ says there is no “public interest” in revealing all of its documents because no crimes were committed, but on the other hand, it is helping the original source — the only person in the scandal actually known to have committed a crime, as Mossack Fonseca constantly points out — to fulfill a “moral impulse” to prosecute what the source and his or her journalistic partners have decided is a crime, no matter what the laws of the various nations involved say.\nFurther complicating matters from an ethical standpoint, many of the politicians caught in the Panama Papers scandal also believe they have the moral authority to declare legal activity unacceptable, and use government power to punish those who perpetrate it, even though no laws have been broken. The entire “tax avoidance” argument is about politicians and bureaucrats railing against people who use legal measures to shelter their wealth from taxation, which is not the same thing as illegal tax evasion.\nNow we have a number of such politicians caught in their own tax avoidance schemes, shuffling billions of dollars into shell companies created by this Panamanian law firm… and everyone involved cries in unison that nothing they did was technically “illegal.” They are hounded by a data thief, and crusading journalists, who have decided to “bring them to justice” by swaying public opinion, just the way politicians try to marshal public outrage against their own political adversaries and private-sector targets.\nSince this scandal is playing out on a global scale, and so far involves very few Americans (a point SZ emphasized in their comments on the matter), it is tempting to write it off as a problem for other electorates to deal with. That would be a mistake.\nThere is much for Americans to learn, alongside our friends in Western democracies, by pondering the question of who decides what is acceptable, and how that differs from the process of deciding what should be illegal. Should those decisions be made by legislators, executives, bureaucrats, voters, or self-appointed “watchdogs,” who keep their own counsel about what secrets will be exposed, and which will remain hidden?\nAs for the captive citizens of socialist, communist, and authoritarian regimes, it may, but should not, come as a surprise to learn that their leaders are thieves who have been salting away gigantic fortunes in offshore accounts.","url":"https://www.breitbart.com/national-security/2016/04/10/panama-papers-newspaper-says-will-decide-files-disclose/"}
