{"authors":[],"date_download":"2018-10-22 20:37:51","date_modify":"2018-10-22 20:37:51","date_publish":"2014-06-02 08:45:21","description":"The release of Army Sgt. Bowe Bergdahl from captivity in Afghanistan has reignited questions from some over his original disappearance.","filename":"data/vaneerConsumption/NotEveryonesHeroSoldiersQuestionBoweBergdahlsBravery.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/480966/140602-bergdahl-930a_61bfe35d4c67f151c5265e22786e2e86.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_not-everyones-hero-soldiers-question-bowe-bergdahls-bravery-n120051_1540240671.html","title":"Not Everyone's Hero: Soldiers Question Bowe Bergdahl's Bravery","title_page":"Not Everyone's Hero: Soldiers Question Bowe Bergdahl's Bravery","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe release of Army Sgt. Bowe Bergdahl from captivity in Afghanistan has reignited questions from some about the circumstances of the soldier's disappearance five years ago.\nBergdahl was the only American soldier being held in the country until he was exchanged in a swap deal on Saturday for five high-ranking Taliban figures from the Guantanamo Bay detention facility.\nHis freedom was celebrated by his family and the Obama administration. But others — including some members of his own platoon — have reiterated their long-held concerns over the events surrounding his June 2009 disappearance.\nThe 28-year-old sergeant vanished from a military base in Eastern Afghanistan with little more than a compass and a bottle of water. Considerable resources were diverted to try to find the missing man, and several of his fellow soldiers were killed trying to find him.\n\"I was pissed off then and I am even more so now with everything going on,\" former Sgt. Matt Vierkant, a member of Bergdahl's platoon when he went missing, told CNN. \"Bowe Bergdahl deserted during a time of war and his fellow Americans lost their lives searching for him.\"","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/not-everyones-hero-soldiers-question-bowe-bergdahls-bravery-n120051"}
