{"authors":["Associated Press"],"date_download":"2018-10-23 05:56:20","date_modify":"2018-10-23 05:56:20","date_publish":"2016-01-28 21:32:43","description":"CHICAGO (AP) — Investigators did not find enough evidence to charge the son of a disgraced Illinois policeman with financial crimes even though text messages...","filename":"data/vaneerConsumption/NotenoughevidencetochargesonofIllinoispoliceofficer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:9eabb17f6b3643efa051a8b736ed2aba-4PuZeKVXE7cd9005b2c87617cf79-907_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420493_Widow-Illinois-officer-accused-assisting-scheme_1540274180.html","title":"Not enough evidence to charge son of Illinois police officer","title_page":"Not enough evidence to charge son of Illinois police officer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Not enough evidence to charge son of Illinois police officer\nCHICAGO (AP) — Investigators did not find enough evidence to charge the son of a disgraced Illinois policeman with financial crimes even though text messages show the father and son discussing money pilfered from a youth program before the officer killed himself, a police spokesman said Thursday.\nFox Lake police Lt. Charles Joseph Gliniewicz elaborately staged his Sept. 1 suicide to look like he'd been killed in the line of duty because he feared his embezzlement would be uncovered, authorities say. His death triggered a massive, weeks-long manhunt that left the community on edge.\nInvestigators announced two months later that it was a suicide and released details of the embezzlement scheme. The revelation stunned the northern Illinois community where the officer known as \"G.I. Joe\" was regarded as a hero and role model for young people he mentored in the Fox Lake Police Explorer program.\nFILE - In this Sept. 7, 2015 file photo, Donald ¿D.J.¿ Gliniewicz, the son of Fox Lake police Lt. Charles Joseph Gliniewicz, leaves after funeral services for his father at Antioch High School in Antioch, Ill. Authorities later concluded that Gliniewicz staged his September suicide to look like he¿d been killed in the line of duty after embezzling from a youth program. On Thursday, Jan. 28, 2016, authorities said they do not have enough evidence to charge his son with financial crimes even though text messages show the pair discussing money pilfered from a youth program before the officer killed himself. (Patrick Kunzer/ Daily Herald via AP, File) MANDATORY CREDIT, MAGS OUT\nAuthorities released incriminating text and Facebook messages in November showing a frantic Gliniewicz discussing the money and ways he could evade discovery. An official with knowledge of the investigation identified Gliniewicz's wife and one of his sons, an Army soldier stationed in North Carolina, as the recipients of those messages. The official spoke on the condition of anonymity because he was not authorized to discuss the probe publicly.\nThe officers' wife, Melodie Gliniewicz, was indicted Wednesday by a grand jury on felony counts of money laundering and disbursing charitable funds without authority and for personal benefit.\nWith her indictment, the financial investigation is over and no one else is expected to be charged, said Lake County Sheriff's Office spokesman Christopher Covelli.\nInvestigators were not able to prove that the officer's 23-year-old son, Donald \"D.J.\" Gliniewicz, knew until after the fact that the money he was spending had been stolen, Covelli said.\nMelodie Gliniewicz had fiduciary responsibility for the Explorer accounts as a program adviser. D.J. Gliniewicz, who had gone through the program in his youth, did not, Covelli said.\nThe text messages between the officer and his son, an Army specialist with the 82nd Airborne at Fort Bragg, North Carolina, show the older Gliniewicz was lending him several thousand dollars from Explorer accounts for things such as truck repairs and a summer leave trip to Oklahoma. He pleads with his son to return the money.\n\"You'll have to start dumping money into that account or you will be visiting me in JAIL!!,\" he said in a June 25 message. \"The 1600 and the 777 all came from there.\"\nThe investigation could not determine definitively whether the younger Gliniewicz knew before that point that the money was from Explorer funds, Covelli said.\nInvestigators sifted through thousands of pages of financial documents, interviewed witnesses and flew to D.J. Gliniewicz's military post to interview him, Covelli said.\nIn a message sent through a spokesman for the 82nd Airborne, D.J. Gliniewicz declined to comment Thursday. It was not clear whether he had an attorney who could speak on his behalf.\nMelodie Gliniewicz was taken to the county jail Wednesday and released later in the day after posting 10 percent of her $50,000 bond.\n\"Melodie is a victim of her husband's secret action and looks forward to her day in court to show the world her innocence,\" said the law firm Kelleher & Buckley, which is representing her.\nInvestigators found that money from the police explorer's account was used for expenses including more than 400 restaurant charges, personal payments to a Starbucks and a local theater as well as a trip to Hawaii.\nGliniewicz was experienced in staging crime scenes for drills with the youth program. Moments before his death he radioed dispatchers to tell them he was chasing three suspicious men. He left his equipment strewn over a wooded, swampy area leading up to the spot where he shot himself twice, once in his ballistic vest and once in his upper chest.\n___\nAssociated Press Writer Don Babwin contributed to this report.\nFILE - This undated file photo provided by the Fox Lake Police Department shows Lt. Charles Joseph Gliniewicz, who authorities say staged his own death on Sept. 1, 2015, to look like he¿d been killed in the line of duty after embezzling from a youth program. Authorities say they do not have enough evidence to charge Gliniewicz¿s son Donald ¿D.J.¿ Gliniewicz with financial crimes even though text messages show the pair discussing money pilfered from a youth program before the officer killed himself. (Fox Lake Police Department photo via AP, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3420493/Widow-Illinois-officer-accused-assisting-scheme.html"}
