{"authors":["Press Association"],"date_download":"2018-10-23 01:06:30","date_modify":"2018-10-23 01:06:30","date_publish":"2017-03-10 08:48:05","description":"The former world number one has not recovered from the back spasms which saw him withdraw from the Dubai Desert Classic at the start of February.","filename":"data/vaneerConsumption/NotimetableforTigerWoodsreturnashemissesPalmerInvitational.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194917-1489135688-539_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300394_No-timetable-Tiger-Woods-return-misses-Palmer-Invitational_1540256790.html","title":"`No timetable´ for Tiger Woods return as he misses Palmer Invitational","title_page":"`No timetable´ for Tiger Woods return as he misses Palmer Invitational | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tiger Woods admits he has “no timetable” for his return to golf after announcing he will not play in next week’s Arnold Palmer Invitational.\nWoods was keen to play at Bay Hill to honour the late tournament host Palmer, who died last September, but has not recovered from the back spasms which saw him withdraw from the Dubai Desert Classic at the start of February.\nSadly missing the 2017 API. I really wanted to be there. My best wishes to the Palmer family & everyone at Bay Hill. https://t.co/xkbvfohcxA — Tiger Woods (@TigerWoods) March 9, 2017\nIn a statement on his website, Woods wrote: “Unfortunately, due to ongoing rest and rehabilitation on my back, I won’t be able to play in this year’s Arnold Palmer Invitational.\n“I’m especially disappointed because I wanted to be at Bay Hill to help honour Arnold. This is one event I didn’t want to skip.\n“Arnold has meant so much to me and my family; I thought of him as a close friend, and Sam and Charlie (Woods’ children) were both born in the Winnie Palmer Hospital for Women & Babies. He will be greatly missed and can never truly be replaced.\n“Presently, I have no timetable for my return to golf, but my treatments are continuing and going well.”\nWoods insisted he had not been in pain after an opening 77 in Dubai, but pulled out of what was just his third event since August 2015 before the second round.\nHis agent Mark Steinberg said at the time Woods was pleased it was a spasm, rather than the nerve pain caused by a back injury which required three operations in the space of 19 months.\nHowever, a week later Woods also pulled out of the Genesis Open and Honda Classic and the 41-year-old later cancelled his scheduled press conference at the Genesis Open, which benefits his foundation.\nThe former world number one, who won the last of his 14 major titles in 2008, looks increasingly likely to miss the Masters for the third time in the last four years. The year’s first major will be staged at Augusta National from April 6-9.","url":"https://www.dailymail.co.uk/wires/pa/article-4300394/No-timetable-Tiger-Woods-return-misses-Palmer-Invitational.html"}
