{"authors":[],"date_download":"2018-10-22 22:09:31","date_modify":"2018-10-22 22:09:31","date_publish":"2014-05-08 19:10:48","description":"The abduction of nearly 300 Nigerian schoolgirls has highlighted the troubling issue that girls in other countries have limited access to schools.","filename":"data/vaneerConsumption/NotJustNigeriaGirlsEducationThreatenedAcrosstheGlobe.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/431081/140509-girls-education-530a_b224e9be4d682d51f86309e31895eda9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_not-just-nigeria-girls-education-threatened-across-globe-n100646_1540246171.html","title":"Not Just Nigeria: Girls' Education Threatened Across the Globe","title_page":"Not Just Nigeria: Girls' Education Threatened Across the Globe","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe simple act of educating girls has been under attack for years. And not just in Nigeria.\nThe kidnapping of nearly 300 Nigerian schoolgirls last month by Islamist militants has highlighted the troubling reality for young females daring to learn.\nAnd as Western nations pledge to help find Nigeria’s “lost girls,” their plight is raising awareness that in several countries, young girls’ education is in peril, according to a 2014 report from the Global Coalition to Protect Education from Attack.\n“In my travels, I’ve found that many families want to send their daughters to the classroom,” said Lisa Bender, an education specialist at UNICEF. “But they want to feel safe doing that.”\nCountries where girls’ education is threatened share similar threads of violence, poverty and cultural oppression. Here are five countries where girls are fighting to overcome that:\nPakistan\nNow 16, Malala Yousafzai was nearly killed when a Taliban gunman shot her after she boarded a school bus in 2009.\nDespite the worldwide outcry — and Pakistani leaders pledging to support the right to an education — girls and their female teachers in the country continue to be targets of violence.\nThe Taliban still opposes any modern form of education for girls, said Mustafa Qadri, a Pakistan researcher for Amnesty International.\nGirls are at a disadvantage, he said, because the country already spends so little on education, while females face cultural pressure to marry, have children and stay at home.\n\"Countless polls conducted across Pakistan from the lawless tribal areas to the urban heartlands in cities like Lahore indicate that the vast majority of parents want their girls and women to get an education and have full opportunities in the work place and public life,” Qadri told NBC News. \"It is up to the state to enforce the right to an education, protect students and educators from attacks, and bring those responsible for these attacks to justice.\"\nBut that won’t be easy, Qadri added: \"No government of Pakistan at the federal or provincial level has tackled this problem front on.\"\nAfghanistan\nSchools are not immune to the war-fueled violence that has gripped Afghanistan over the past decade. There were at least 1,110 documented attacks at schools — including arson, explosions and suicide bombings — from 2009 to 2012, according to the United Nations.\nMotives for the school attacks have included opposition to “Western teachings,” perceived affiliations with Western groups — and the education of girls.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/not-just-nigeria-girls-education-threatened-across-globe-n100646"}
