{"authors":["Vanessa Rancano","Amita Sharma","Farida Jhabvala Romero"],"date_download":"2018-10-30 22:40:50","date_modify":"2018-10-30 22:40:50","date_publish":"2018-07-27 23:09:25","description":"Inaccurate cost of attendance estimates can throw off students’ budgeting and their financial aid packages.","filename":"data/vaneerConsumption/NotlivinginthedormsGoodluckfiguringoutwhatcollegeisgonnacost.json","image_url":"https://calmatters.org/wp-content/uploads/UCB-photo-e1532709173139.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939250.html","title":"Not living in the dorms? Good luck figuring out what college is gonna cost","title_page":"Not living in the dorms? Good luck figuring out what college is gonna cost | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As newly minted college students get ready to start classes next month, some will find their school’s estimates for costs are way off. If students relied on what colleges report, they’d expect to pay nearly the same amount for food and off-campus housing at Fresno State as at UCLA, even though the two areas have dramatically different housing costs.\n“There doesn’t seem to be an overall rhyme or reason as to how colleges set these allowances,” said Seton Hall University professor Robert Kelchen, who studied college budget estimates nationally. “It was happening basically everywhere, and the concern was greatest in areas with very high living costs.”\nBad estimates can throw off not only students’ budgeting, but also their financial aid packages.\nAny college that gets federal financial aid has to come up with a basic cost of attendance estimate, but schools have a lot of leeway in how they make that calculation. In California, the agency that oversees financial aid programs for the state, the Student Aid Commission, provides an estimate of student costs for food, housing, textbooks, and transportation. It’s a single statewide average, and many schools around the state rely on it.\n“We see colleges in some of the most expensive parts of the state using that number and some colleges in the least expensive parts of the state,” said Debbie Cochrane, vice president of The Institute for College Access and Success.\nSan Francisco State University and Cal State Fullerton, for example, list nearly identical off-campus housing and food costs. “When we looked at that we thought, ‘That doesn’t seem right,’” said Cal State Student Association Executive Director Rob Shorette. When he checked other sources of data, like the Department of Housing and Urban Development, they told a different story about housing costs: Rents in San Francisco are around $1000 a month higher than rents in Fullerton.\nOverestimating costs could result in students taking out more loans than they need, Shorette says, but lowballing costs can be bad for students too. “Underestimating these costs may put them in a predicament where they’re forced to find other ways to meet their financial needs.”\nThese estimates aren’t just misleading, they also determine the maximum amount of financial aid a student can get. (Financial aid is calculated by subtracting your expected family contribution from your school’s total cost of attendance.) Most students don’t get their full cost of attendance paid for with grants, but the cost of attendance estimate also caps student loans.\nSo if a college’s estimate is too low, Kelchen says, “you need to work a lot more in order to pay the bills. But working a lot more means that it’s hard to go to college full time and it may be hard to do well in school.”\nEven within the same city estimates can vary: Cal State LA’s estimate for non-tuition costs is $19,454; UCLA’s is $17,802.\nUC Berkeley and Berkeley City College are less than half a mile apart. But City College estimates students spend about $4,800 more every school year on non-tuition costs than UC Berkeley estimates.\n“It’s really unclear why UC Berkeley students would need so much less, would be spending so much less,” Cochrane says. “I mean in many cases these students are actually roommates.”\nUC’s estimates are based on its own student surveys, done every three years. Some parts of the Berkeley City College budget appear to use the statewide estimate provided by the Student Aid Commission.\nWhen asked about the discrepancy, a UC spokesperson pointed to the fact that UC’s data is newer. The Student Aid Commission’s estimate is based on a survey last conducted more than a decade ago. And while it’s been adjusted annually for inflation, commission administrators raise concerns that the estimate is actually too low because of its age. They’re in the process of conducting a new survey.\nRecent Apartment List data puts the average cost of a one-bedroom apartment in Berkeley at $2,113 a month. To live on the off-campus housing budget UC Berkeley provides, two students would have to share that apartment and wouldn’t have money left over for utilities.\nCochrane and Kelchan agree coming up with estimates is complicated, and it’s hard to know what’s accurate, but both see an incentive to make prices look lower than they are: For schools that provide generous grant aid, raising the price tag would mean shelling out a lot more money. “If they lowball costs, not only does that spare their own institutional aid budgets,” Cochrane said, “but it also makes them look better in the eyes of students and families.”\nCalifornia legislators have been looking for fixes. They introduced at least three bills in the last couple years that took on the issue. Last year, Governor Jerry Brown vetoed one that would have required the CSU to do its own surveys to come up with more accurate cost estimates. In his veto, Brown cited costs and administrative burdens.\nThe California Dream series is a statewide media collaboration of CALmatters, KPBS, KPCC, KQED and Capital Public Radio with support from the Corporation for Public Broadcasting and the James Irvine Foundation.\nVanessa Rancaño | KQED","url":"https://calmatters.org/articles/not-living-in-the-dorms-good-luck-figuring-out-what-college-is-gonna-cost/"}
