{"authors":[],"date_download":"2018-10-30 01:13:24","date_modify":"2018-10-30 01:13:24","date_publish":"2015-05-14 00:00:00","description":null,"filename":"data/vaneerConsumption/NotlettingtheAmtrakcrisistragedygotowaste.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_not_letting_the_amtrak_crisis_tragedy_go_to_waste_1540862004.html","title":"Not letting the Amtrak crisis tragedy go to waste","title_page":"Not letting the Amtrak crisis tragedy go to waste","title_rss":"NULL","source_domain":"americanthinker.com","text":"The corpses are still warm, the surgeries on the injured are underway, the survivors still traumatized, the grief raw but that doesn't stop Democrats from acting like Democrats, never letting a crisis go to waste. Quickly the Democrat vultures have glommed on to the tragedy, gruesomely parlaying the Amtrak derailment to push their spend, spend more agenda and not so subtly blame presumed lack of Amtrak funding-which-caused-the-derailment on…Republicans.\n“I do hope we can keep the accident in mind [during today’s markup],” Rep. Nita Lowey (D-N.Y.) said about the derailed Amtrak train. “Cutting the funding drastically does not help improve the services at Amtrak .” (snip) “We cannot meet tomorrow’s challenges by slashing investments in TIGER, Amtrak and air traffic modernization,” Lowey added. (snip) The House Appropriations Committee advanced the bill in a party-line vote. Rep. David Price (D-N.C.), the ranking member of the Appropriations Subcommittee on Transportation, which produced the bill, said the measure is “totally inadequate.” The measure “does not provide adequate funding to address the capital needs required for safety.” Several Democrats offered amendments that would boost funding to Amtrak, but Republicans blocked the proposals from being wrapped inside the measure. They would have busted spending caps. Rep. Steve Israel (D-N.Y.) said Congress “failed” passengers who traveled on the Amtrak train Tuesday night. “Last night, we failed them. We failed to invest in their safety. We failed to make their safety our priority,” he said. “We are divesting from America in this committee. ... It defies the interests of the American people.”\nWhite House Press Secretary Josh Earnest also dutifully chimed in.\nWhite House press secretary Josh Earnest said investment in upgrades to the rail system's infrastructure remain important to the administration. And President Obama, he said, has long advocated for Amtrak investments that would \"benefit the traveling public.\" But Earnest was quick to note in his press briefing Wednesday that congressional Republicans have blocked such investments in the past. \"Unfortunately we have seen a concerted effort by Republicans for partisan reasons to step in front of those kinds of advancements,\" Earnest said, noting that the cause of the crash is still under investigation, and it's unclear whether infrastructure problems were involved. (snip) Earnest noted Wednesday that whereas the Obama budget proposal includes a nearly billion-dollar increase in funding for Amtrak infrastructure upgrades, \"Republicans are, unfortunately, considering legislation at the committee level that would actually cut funding from Amtrak's budget by, I believe, a quarter of a billion dollars a year,\" Earnest said. He softened his comments, though, by indicating that lawmakers are still in the early stages of the appropriations process. When asked if there was anything more the president could do to press for investment in infrastructure, Earnest said Congress has \"the power of the purse, and so for significant investment in infrastructure, we're going to need to see congressional action.\" \"The president has put forward his own plan that would be fully paid for\" to invest in mass transit, he said. That plan involves closing tax loopholes to generate revenue, an idea he said has some support from Republicans. \"But we haven't seen a lot of movement of this on Capitol Hill,\" Earnest said. \"We're going to continue to try to push it.\"\nLeft unmentioned that while there is yet no definitive explanation for the derailment, a National Transportation Safety Board spokesman stated at a press conference that the train was traveling at twice the authorized speed as it approached a sharp curve and the train engineer was applying the emergency brakes.\nThe engineer has hired a lawyer and is not speaking.\nPresumably the engineer's actions are also the fault of Republicans.","url":"https://www.americanthinker.com/blog/2015/05/not_letting_the_amtrak_crisis_tragedy_go_to_waste.html"}
