{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:12:33","date_modify":"2018-10-30 21:12:33","date_publish":"2015-10-23 12:55:52","description":"ISIS has declared war on the Jewish people, a man from the jihadi group declared in fluent Hebrew.","filename":"data/vaneerConsumption/NotOneJewWillBeLeftInJerusalem.json","image_url":"https://media.breitbart.com/media/2015/10/Screen-Shot-2015-10-23-at-8.53.51-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_23__1540933953.html","title":"'Not One Jew Will Be Left In Jerusalem'","title_page":"ISIS in Hebrew: 'Not One Jew Will Be Left In Jerusalem'","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State has declared war on the Jewish people, a man from the jihadi group declared in fluent Hebrew, in a new video released by the terrorist organization.\nThe threatening message, which appeared on social media Friday morning, was titled, “A message to the Jews, the first enemy of the Muslims.”\n“This is a message to all the Jews, who are the Muslims’ number one enemy,” the masked jihadi says, wearing combat fatigues and holding an automatic weapon.\n“The real war has not begun and everything you have experienced so far has been child’s play — nothing compared to what will happen to you soon enough, inshallah [God willing],” he added, according to a translation by the Times of Israel.\nHe continues, threatening the Jewish people with extermination: “We promise you that soon, not one Jew will be left in Jerusalem or across Israel and we will continue until we eradicate this disease from the world.”\nThe video continues, displaying a map that shows 2 ISIS flags and outlines of its soldiers surrounding Israel’s borders.\n“Look at what has happened to you in a few vehicular and stabbing attacks from our brothers in Palestine,” the terrorist adds. “You lost your minds and started fearing every driver that sped up. You were even scared of every person carrying something in their hand.”\nThe masked militant then asks: “What will happen to you when tens of thousands [of Muslim fighters] will arrive from across the world to slaughter you?”\n“The borders of Sykes-Picot will not protect you, and like we blurred the borders between Syria and Iraq, we will do so between Syria and Jordan and then Syria and Palestine,” he says, referring to the early 20th century agreement following the collapse of the Ottoman Empire.\n“We will advance towards you from everywhere, from the north and the south, from Sinai, from everywhere. We see your crimes every day and we will settle scores,” the terrorist announces.\nThe video concludes with the Muslim holy warrior pulling a knife out of his vest and citing Koranic scripture, before finally promising that Muslims will be victorious over the Jews.\nWatch the video below:","url":"https://www.breitbart.com/national-security/2015/10/23/isis-releases-video-hebrew-not-one-jew-will-left-jerusalem/"}
