{"authors":[],"date_download":"2018-10-30 20:10:28","date_modify":"2018-10-30 20:10:28","date_publish":"2017-03-13 19:55:00","description":"The jewel thief who's stolen about $2 million worth over the last six decades was arrested Monday by the DeKalb County Sheriff’s Fugitive Unit.","filename":"data/vaneerConsumption/Notorious86yearoldjewelthiefDorisPaynearresteddespiteillness.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/11/Images/newsEngin.18056454_dorisx2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_notorious-year-o_f55320ba1b1d235a8f564c97f345f8a4__1540930228.html","title":"Notorious 86-year-old jewel thief Doris Payne arrested despite illness","title_page":"Notorious 86-year-old jewel thief Doris Payne arrested despite illness","title_rss":"NULL","source_domain":"ajc.com","text":"Doris Payne, the jewel thief who's stolen about $2 million worth over the last six decades, was arrested Monday by the DeKalb County Sheriff’s Fugitive Unit.\nThe 86-year-old was wanted on a bench warrant after missing a court date earlier this month.\nShe told The Atlanta Journal-Constitution a few hours after missing the appearance that she’s been ill.\n“I ain’t runnin’,” she said in a phone interview. “Medically, I was not able to go.”\nShe was arrested at her Atlanta home without incident, the sheriff’s office said.\nShe’s been dealing with severe pain, trouble with balance and draining tests related to a lump in her neck. It could be cancer, she said.\nThe hearing was related to a theft charge from a December arrest at Perimeter Mall.\nLast month, she was deemed too ill to stand trial by the judge presiding over a Fulton County case stemming from a missing set of Christian Dior earrings at Phipps Plaza.\nPayne has been open about her habits of theft, which she detailed in a documentary called, “The Life and Crimes of Doris Payne.”\nPlease return to ajc.com for updates.","url":"https://www.ajc.com/news/local/notorious-year-old-jewel-thief-doris-payne-arrested-despite-illness/AH7rqJjygKxgow3SfCMrKJ/"}
