{"authors":[],"date_download":"2018-10-30 17:49:57","date_modify":"2018-10-30 17:49:57","date_publish":"2018-10-30 17:01:00","description":"James “Whitey” Bulger, the infamous Boston gangster convicted in 2013 of participating i...","filename":"data/vaneerConsumption/NotoriousgangsterJamesWhiteyBulgerfounddeadinprison.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Videos/4519136.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_james-whitey-bulger-killed-prison-reports-say__1540921797.html","title":"Notorious gangster James 'Whitey' Bulger found dead in prison","title_page":"Notorious gangster James 'Whitey' Bulger found dead in prison","title_rss":"NULL","source_domain":"ajc.com","text":"James “Whitey” Bulger, the infamous Boston gangster convicted in 2013 of participating in nearly a dozen murders in the 70s and 80s, was found dead Tuesday at a West Virginia prison, according to officials. He was 89.\n>> Read more trending news\nBulger was found dead around 8:30 a.m. Tuesday by staff at USP Hazelton, authorities said. A resuscitation attempt was made, but Bulger was pronounced dead by the Preston County Medical Examiner.\n\"The Federal Bureau of Investigation was notified and an investigation has been initiated,\" officials with the Federal Bureau of Prisons said in a statement. \"No staff or other inmates were injured, and at no time was the public in danger.\"\nBulger was moved last week from a prison in Florida to a transfer facility in Oklahoma City. Earlier this week, he was transferred to USP Hazelton, a high-security prison with an adjacent minimum security satellite camp in Bruceton Mills. On Tuesday, the Federal Bureau of Prisons’ online log listed Bulger as an inmate at USP Hazelton.\nWVNews reported Tuesday that a male inmate was killed overnight at the federal prison, citing the president of a union that represents employees at USP Hazelton.\nBulger was serving a life sentence after being convicted in 2013 of a litany of crimes, including participating in 11 murders. He was one of the FBI's most wanted fugitives for 16 years until his 2011 arrest in Santa Monica, California.\nThe History of Alcatraz Island\nThe Associated Press contributed to this report.","url":"https://www.ajc.com/news/national/james-whitey-bulger-killed-prison-reports-say/vmkOgDahwGYm6MpttYE0UN/"}
