{"authors":["John Hayward"],"date_download":"2018-10-30 21:23:35","date_modify":"2018-10-30 21:23:35","date_publish":"2015-09-18 21:51:54","description":"The 10,000 refugees Obama announced recently, on top of 1,500 already accepted this year, is the beginning of the migration, not the end.","filename":"data/vaneerConsumption/NoTrialDemocratsConvictAmericansofIslamophobia.json","image_url":"https://media.breitbart.com/media/2015/09/AP_250782557912.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_18__1540934615.html","title":"No-Trial Democrats Convict Americans of 'Islamophobia'","title_page":"No-Trial Democrats Convict Americans of 'Islamophobia'","title_rss":"NULL","source_domain":"breitbart.com","text":"Let me be blunt, because the left is trying very hard to prevent us from being blunt— indeed, to keep us from being able to think or communicate clearly at all. Blunt talk is now an act of resistance against power.\nOf course the Democrats are pandering like crazy to Muslims.\nTens of thousands of them are on the way. The existing escalation of Syrian refugees is but an entrée, a taste of things to come. The ten thousand President Obama announced recently, on top of 1,500 already accepted this year, is the beginning of the migration, not the end. The United Nations wants us to accept over triple that number, while a group of influential former senior U.S. officials — some of them with pedigrees in the Obama Administration — is pushing for 100,000 Syrian refugees immediately, with a $2 billion budget for their resettlement, and even that is not presented as the complete satisfaction of America’s “responsibility” toward the migrants.\nThere are at least four million people moving out of Syria right now, with more to come, plus a vast number of refugees and economic migrants from other Middle Eastern countries joining the great push into Europe, many of them equipped with false Syrian documents. The United States government will be heavily pressured by other governments and by lobbyists to accept far more than two or three percent of this population shift.\nPresident Obama will act quickly to lock a high number of refugees into the American system before he leaves office, to make it politically difficult for any Republican successor to interfere with the process.\nDemocrat tacticians are very good at seeing politics as a game of numbers, cobbling together coalitions and collectives that can be satisfied with exercises of government power to produce winning regional and national machines. A heavy pander to an already sizable, coherent bloc of voters that is about to swell by hundreds of thousands — most of them “military-age males,” which means voting-age males — is a no-brainer.\nMeanwhile, the left has worked hard to portray criticism of strict Islamic ideas as a “hate crime,” because they can’t allow their brand to be damaged by orthodox Islam’s indigestible nastiness.\nThe left’s voting blocs are disciplined and activist, and march in-step with the established new business and with green-eyeshade commercial culture.\nWithout a fair-minded media, non-political Americans feel helpless, isolated, and adrift — frightened to speak up and ask if anyone else shares their concerns. The increasingly rabid political correctness movement and its militant “social justice warrior” vanguard is intended to hide the huge popularity of Americans’ quiet opposition to the progressive project, every media-spoken word must be chosen carefully and analyzed for acceptable political content.\nThe left is eager to pay the price demanded by the leaders of the incoming Islamic bloc-vote.\nThe Islamic leaders and their immigrant clients are usually supportive of big government. Their cultural prejudices are temporarily compatible with the left’s, which is why the defense of free speech was instantly and painlessly abandoned by the left in favor of musing about how offending some religious groups shouldn’t be considered protected speech — not when that particular group has demonstrated how seriously and severely it takes offense.\nBesides, the left hates the people who must be muzzled to satisfy the Muslim voting bloc, and it never really gave a damn about the principle of free speech anyway. The left is very interested in controlling speech and silencing dissenters — they only care about freedom of speech as it applies to themselves, or as a rhetorical trope to conceal authoritarian rule. As long as they occasionally talk about how much they love the freedom of speech, they can’t really be totalitarians, right?\nThe confluence of disdain is a huge part of the left’s pander to Muslims. The left’s eager embrace of the “Islamophobia” smear isn’t driven by fear that Americans will shoot or insult nice Muslim immigrants. It is powered by the left’s sincere desire to hate — despite Americans who prefer to govern themselves instead of submitting to progressives’ expertise in Washington.\nSharp Muslim political groups know this and portray their globalist religious movement as an oppressed ethnic minority. They know liberals cannot resist the siren song of a seemingly ethnic group with grievances and a persecution narrative.\n“Islamophobia” also fits neatly into the left’s greatest and most important project: the Nation of Criminals imperative. Normal people think coercive government power should be primarily directed against criminals; therefore, it is important to the left to make normal people view themselves as criminals. So ordinary people must believe their civic society is corrupt, and must be controlled by countless police forces augmented by mobile “social justice warrior” vigilante groups in the media, academia, and the streets.\nEven when there is no specific coercive proposal on the table, any narrative that makes the populace feel guilty and ashamed is useful toward this great project. “Land of the free, home of the brave” is a formula that can be reversed to produce tyranny: the home of the guilty is the land of the controlled and the paranoid. People who live in fear of their neighbors find little value in liberty, greatly preferring security instead.\nThat’s a point worth pondering by those who believe the left’s assault on free expression can be countered by encouraging everyone else to become as hypersensitive as they are. We’ll win some tactical victories that way, but lose the war, because the end result will be that liberty loses in a land of universal paranoia and resentment bleached of confident trust, voluntary cooperation, or loud and peaceful exchange of ideas. A nation where everyone is afraid to criticize everyone else sounds like chaotic totalitarianism/anarchy to me, and anarchy is not fertile soil for freedom.\nThere are some odd details about the story of Ahmed Mohamed, the ninth-grader arrested for bringing a homemade clock mistaken for a bomb into a Texas school.\nIt’s funny how the mainstream media doesn’t seem interested in the background of his father, who turns out to be a local activist who ran for the presidency of Sudan twice. They would certainly dig deep into such details if this was almost any other story about kids bounced out of school for silly zero-tolerance policies towards “weapons,” and even expressions of ideology and religion. None of those stories drew any media or Democrat attention at all, and if they had, you can bet the slightest hint of a set-up would have prompted the full “Joe the Plumber” treatment for the entire family.\nEven leaving the possibility of a set-up aside, there are stages in the Ahmed Mohamed story where the teachers and administrators (a group Democrats normally defend against criticism without question) took steps that were heavy-handed, but not outrageous. What’s an English teacher supposed to do when a kid’s book-sized case makes a beeping noise, contains a mass of wires and circuit boards that does not remotely resemble a “clock” that an American kid would be proud to show? What teacher would be passive when they know inaction amid liberals’ zero-tolerance rules would invite a storm of complaints, TV criticism, even lawsuits and professionals’ punishments, on themselves? Why was the kid oddly resistant to explaining why he built his clock-in-a-case and brought it to school?\nThe kid’s semi-arrest seems foolish and excessive, but the local officials involved did not promulgate the big-government, paranoid, distrusting, zero-tolerance rules that prodded them towards what Americans 20 years ago would have scorned as a clumsy, heavy-handed overreaction?\nWe could second-guess the actions of everyone involved for a long time to come… but the point is that no second-guessing was done at all, and none will be tolerated if it contradicts the Democrats’ political strategy.\nThe same White House and Democrat Party that studiously avoided drawing attention to people murdered by illegal aliens in sanctuary cities swung into action, from coast to coast, in a matter of hours. Instead of a meticulous investigation of the incident and appropriate reprimand for anyone who acted improperly, we got a nationwide political circus.\nPeople who bounced off ideological trampolines to jump to politically-correct conclusions cursed everyone else for jumping to conclusions as they soared through the media air.\nMeanwhile, most of the normal people harangued by the left as “Islamophobes” quickly interpreted the Ahmed Mohamed story as another clumsy overreaction and felt natural sympathy for the student, partly because they know and remember all the other nutty zero-tolerance school crackdowns.\nTheir school officials’ over-reaction was unseemly, clumsy… but now they can rely on their fellow Democrats in the media and online-vigilante vanguards to keep anyone from calling them on it.\nCrude pandering and sledgehammer social-engineering work great for progressives, but only where there is no need to worry about anyone taking umbrage against them.","url":"https://www.breitbart.com/politics/2015/09/18/democrats-convict-america-islamophobia-without-trial/"}
