{"authors":[],"date_download":"2018-10-22 22:03:30","date_modify":"2018-10-22 22:03:30","date_publish":"2014-06-07 23:49:26","description":"Pro-Russian separatists fighting in a disputed section of Ukraine are rejecting peace overtures from that country's new president, Petro Poroshenko.","filename":"data/vaneerConsumption/NoTruceUkrainianRebelsRejectPeacePleasVowtoFightOn.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/494736/140607-ukraine-conflict-1933_c2c2961e1ca845b6cf1c4cb00853be2b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_no-truce-ukrainian-rebels-reject-peace-pleas-vow-fight-n125481_1540245810.html","title":"No Truce: Ukrainian Rebels Reject Peace Pleas, Vow to Fight On","title_page":"No Truce: Ukrainian Rebels Reject Peace Pleas, Vow to Fight On","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSLAVIANSK/LUHANSK Ukraine — Pro-Russian separatists poured scorn on peace overtures from Ukraine's new president Petro Poroshenko on Saturday as fighting rumbled on in the east of the country.\nTaking the oath of office in Kiev, Poroshenko appealed to the rebels to lay down their arms, offering peaceful dialogue and immunity from prosecution to \"those who don't have blood on their hands\".\nBut rebel spokesmen in the self-styled Donetsk People's Republic, which has declared independence from Ukraine and wants to unite with neighboring Russia, told Reuters the fight would continue.\n\"What they really want is one-sided disarmament and for us to surrender. That will never happen,\" said a top separatist official, Fyodor Berezin. \"As long as Ukrainian troops are on our soil, I can see that all Poroshenko wants is subjugation,\" he said by telephone from Donetsk.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/no-truce-ukrainian-rebels-reject-peace-pleas-vow-fight-n125481"}
