{"authors":[],"date_download":"2018-10-22 22:39:50","date_modify":"2018-10-22 22:39:50","date_publish":"2014-05-12 13:26:35","description":"Auto buyers could be the big winners as newly merged Fiat Chrysler Automobiles executes the global strategic plan it outlined last week.","filename":"data/vaneerConsumption/NotYourDadsChryslerFiatMergerBringsExoticCarsStyle.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/435976/140512-140512-maserati-0928_947a0f7b0b8b36624f931cea9de2cc22.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_not-your-dads-chrysler-fiat-merger-brings-exotic-cars-style-n103006_1540247990.html","title":"Not Your Dad's Chrysler: Fiat Merger Brings Exotic Cars, Style","title_page":"Not Your Dad's Chrysler: Fiat Merger Brings Exotic Cars, Style","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThis is certainly not your Dad's Chrysler.\nThe newly merged Fiat Chrysler Automobiles launched a global strategic plan last week targeting every segment from entry-level sedans through SUVs to exotic sports cars.\nRunning through 2018, the plan is designed to sharpen the focus of FCA’s eight key brands, including familiar American names like Chrysler, Dodge, Ram and Jeep, as well as Italian imports such as Fiat, Ferrari, Alfa Romeo and Ferrari. During a day-long session, Fiat Chrysler CEO Sergio Marchionne and his team attempted to sell a vision that they promised would boost worldwide sales from 4.4 million to 7 million, drive margins up to industry benchmark levels, and yield a more than fivefold increase in profits.\nBut it all comes down to getting the products right, senior officials stressed, Chrysler Brand CEO Reid Bigland declaring that, “Vision without execution is hallucination.”\nIn years past, analyst David Sullivan, of AutoPacific, Inc., said he might have thought the new plan was, indeed, a fantasy, “Five years ago,” when Fiat had just rescued Chrysler from bankruptcy with the help of a U.S. government bailout, “I would have laughed. But…I’m confident now.”\nThe plans for the various brands will be costly. Long-struggling Alfa Romeo, which is only now returning to the U.S. after a two-decade absence, will get a $7 billion cash infusion, the brand creating a “skunk works” engineering team with a mandate to “innovate and be revolutionary.” Expect to see eight new products by 2018, the first to roll out by late next year.\nCloser to home, the flagship Chrysler brand expects to double its sales by the end of the business plan, and will get its own product infusion after years of admitted neglect, said its chief executive, Al Gardner. That will include two new crossover-utility vehicles, as well as a new compact sedan, the Chrysler 100, targeting the likes of the Honda Accord, Toyota Corolla and Ford Focus.\nThe Chrysler brand will abandon years of pretensions about being an upscale maker, focusing on the mainstream North American market, though it is promising to offer more elegant designs and lots more features than normally expected in the mid-market products.\nThe Chrysler marque will also get an all-new version of its Town & Country minivan – the first vehicle in that segment to offer a plug-in hybrid powertrain expected to deliver 75 miles to the gallon. The Dodge division, meanwhile, will abandon its Grand Caravan minivan. Known for muscle cars like the newly updated Charger and Challenger models, Dodge will henceforth put its focus exclusively on performance products.\nFCA’s global product plan will depend heavily on the Jeep brand which aims to regain global leadership in the booming SUV market. It is just launching the compact Renegade model which will be the first Jeep currently produces abroad. Production will start in Italy then plants in Brazil and China will be added. After setting a series of sales records, the goal is to boost worldwide Jeep sales from 731,565 sales to a full 1.9 million by 2018.\nExpect to see more updated products – like the Jeep Grand Cherokee replacement – and all new offerings such as the large and luxurious Jeep Grand Wagoneer which will target the likes of the Range Rover.\nCrossovers and more traditional utes will be found throughout the Fiat Chrysler line-up. Even premium luxury maker Maserati will get one. Coming to showrooms next year, the Levante will share the Jeep Grand Cherokee’s underpinnings, get a distinctly Maserati body and interior and borrow a drivetrain from Ferrari.\nMaserati will also get a production version of the widely hailed Alfieri Concept, a coupe show car considered one of the best designs to debut at the Geneva Motor Show earlier this year.\nAt the low end of the Italian line-up, flagship Fiat plans to reduce its dependence on the weak European mainstream car market, putting more emphasis on specialty products like the pint-sized 500 and newer 500L. The maker will start selling its first utility vehicle in the U.S. next year in the form of the 500X.\nIf there’s one FCA brand that needs little tweaking it's Ferrari. The supercar maker has long had a waiting list of customers for products like the quirky FF and striking 458 Italia. But while it plans to roll out at least one new product annually, don’t expect the lines to get any shorter. For the foreseeable future, Ferrari wants to maintain its exclusivity by limiting sales to just 7,000 annually – at prices that have run as high as $1.4 million for the limited-edition “ultracar,” the La Ferrari.\n5 Years After Bankruptcy, Chrysler Aiming at Explosive Global Growth with Italian Partner Fiat\nChildren at the Biggest Risk When the Drunk is Their Drive\nMercedes-Benz Launches B-Class Electric, 1st US Battery Car","url":"https://www.nbcnews.com/business/autos/not-your-dads-chrysler-fiat-merger-brings-exotic-cars-style-n103006"}
