{"authors":["Press Association"],"date_download":"2018-10-22 21:37:41","date_modify":"2018-10-22 21:37:41","date_publish":"2016-01-29 07:17:20","description":"Novak Djokovic admits the first two sets of his Australian Open semi-final victory against Roger Federer were \"flawless\" and the best he has ever played agai...","filename":"data/vaneerConsumption/Novakdjokoviciplayedflawlesstennisforfirsttwosetsofsemifinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-1bd456e3-8e34-4780-8f9d-ff125b524d56-3bmscybNe842cce83474b51d77a0-823_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420955_Novak-Djokovic-I-played-flawless-tennis-two-sets-semi-final_1540244261.html","title":"Novak djokovic: i played flawless tennis for first two sets of semi-final","title_page":"Novak djokovic: i played flawless tennis for first two sets of semi-final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Novak Djokovic: I played flawless tennis for first two sets of semi-final\nNovak Djokovic admits the first two sets of his Australian Open semi-final victory against Roger Federer were \"flawless\" and the best he has ever played against the 17-time major champion.\nDjokovic blew Federer away for the best part of an hour on Rod Laver Arena, handing his opponent just three games on route to a 6-1 6-2 3-6 6-3 win.\nHe made only two unforced errors in the opening set and four more in the second and as Federer was broken twice in each, the crowd were preparing for a demolition of the world number three.\nNovak Djokovic was at his scintillating best in the Australian Open semi-final\nFederer rose to the challenge, however, with some scintillating tennis in the third but it proved no more than a consolation as Djokovic booked his sixth Australian Open final.\nHe will now face either Britain's Andy Murray or Canadian Milos Raonic, who play their semi-final on Friday.\n\"I've had matches where I've played similar tennis. But I think against Roger, these first two sets have been probably the best two sets I've played against him overall I think throughout my career,\" Djokovic said.\n\"When you're playing one of your top rivals, somebody of Roger's resume, of course it requires a lot of focus, determination, and a different preparation for that matchup than most of the other matches.\n\"So that's why I came out with I think a great deal of self-belief and confidence and intensity, concentration.\n\"I played flawless tennis for the first two sets, no doubt about it.\"\nDjokovic now leads Federer for the first time in the pair's career head-to-head, 23-22, and he has beaten the 34-year-old in all of their last four grand slam meetings.\nThe world number one would seal his 11th major title with victory on Sunday but the affection of the fans on Rod Laver Arena remained firmly with his opponent.\nThey gave Federer a standing ovation at the start of the third set to jolt him into action and another at 3-2 when he sealed the break.\n\"He's loved. He's appreciated. He's respected around the world,\" Djokovic said.\n\"For me it's normal in a way. I'm trying obviously to enjoy my time, to do the best that I can with the tennis racket, but also focus on the positive energy rather than negative, rather than getting frustrated for that.\"\nFederer's wait for an 18th major crown continues and despite playing brilliantly against the rest of the field again in Melbourne, it may never end if he keeps running into the Serbian.\nSix years Djokovic's senior, Federer simply may not have the dynamism to oust his rival over five sets - a theory he disagrees with.\n\"I have self-confidence as well, that doesn't fade away very quickly,\" Federer said.\n\"I know it's not easy. I never thought it was easy. But best-of-three, best-of-five, I can run for four or five hours. It's not a problem.\n\"I prove it in practice again in the off-season no sweat. So from that standpoint I'm not worried going into long rallies.\n\"I know you guys make it a different case. I get that because you think I'm old and all that. But it's no problem for me.\"\nFederer certainly showed his class during a magical point at 4-3 in the fourth set, as Djokovic looked to have won the exchange at least twice before the Swiss whipped a backhand pass down the line.\nAsked where it ranked in his best points ever, Federer said with a smile: \"Top hundred...Then I got an unlucky let cord. That calmed me down very quickly again.","url":"https://www.dailymail.co.uk/wires/pa/article-3420955/Novak-Djokovic-I-played-flawless-tennis-two-sets-semi-final.html"}
