{"authors":["John Downes For Mailonline"],"date_download":"2018-10-23 02:21:09","date_modify":"2018-10-23 02:21:09","date_publish":"2016-01-28 17:08:19","description":"Serbian superstar Novak Djokovic is one of the most recognisable sportsmen on the planet having won 10 Grand Slam singles titles... and he has jumped on the hyper-personalised footwear bandwagon.","filename":"data/vaneerConsumption/NovakDjokovicsportspersonalisedadidastrainerswithapictureofhisfacestitchedontothetongueashebeatsRogerFederer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC6FC400000578-0-image-a-5_1454000161274.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3421309_Novak-Djokovic-sports-personalised-adidas-trainers-picture-face-stitched-tongue-beats-Roger-Federer_1540261269.html","title":"Novak Djokovic sports personalised adidas trainers with a picture of his face stitched onto the tongue as he beats Roger Federer","title_page":"Novak Djokovic sports personalised adidas trainers with a picture of his face stitched onto the tongue as he beats Roger Federer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Serbian superstar Novak Djokovic is one of the most recognisable sportsmen on the planet having won 10 Grand Slam singles titles.\nAnd as seems to be protocol for players of such status, the 28-year-old has jumped on the hyper-personalised footwear bandwagon.\nDuring his 6-1, 6-2, 3-6, 6-3 victory over fellow tennis great Roger Federer in the Australian Open semi-final on Thursday, Djokovic was seen sporting some adidas trainers with his own face stitched onto the tongue.\nOn Thursday, Novak Djokovic was seen sporting adidas trainers with his own face stitched into the tongue\nDjokovic pumps his fist as he wins another point on his way to a four-set victory over Roger Federer\nThe steely Belgrade-born maestro blew the Swiss away for the best part of an hour at the Rod Laver Arena in Melbourne.\nAnd he did so wearing his royal blue Barricade Novak Pro kicks, with white stripes and yellow laces, which you can buy online for £60.\nHe will now face either Great Britain's Andy Murray, or Canadian hopeful Milos Raonic, who play their semi-final on Friday.\n'I've had matches where I've played similar tennis,' Djokovic said after the match.\n'But I think against Roger, these first two sets have been probably the best two sets I've played against him overall I think throughout my career.\nThe Serbian star described his tennis in the first two sets of the Australian Open semi-final as 'flawless'\nDjokovic looked in complete control of his forehand on the way to a fine victory at the Rod Laver Arena\n'When you're playing one of your top rivals, somebody of Roger's resume, of course it requires a lot of focus, determination, and a different preparation for that match-up than most of the other matches.\n'So that's why I came out with, I think, a great deal of self-belief and confidence and intensity, concentration.\n'I played flawless tennis for the first two sets, no doubt about it.'","url":"https://www.dailymail.co.uk/sport/tennis/article-3421309/Novak-Djokovic-sports-personalised-adidas-trainers-picture-face-stitched-tongue-beats-Roger-Federer.html"}
