{"authors":["Mike Dickson For Mailonline"],"date_download":"2018-10-22 22:41:23","date_modify":"2018-10-22 22:41:23","date_publish":"2016-01-28 11:00:35","description":"MIKE DICKSON IN MELBOURNE: Defending champion Novak Djokovic beat Roger Federer in four sets as the world No 1 booked his place in the Australian Open final on Thursday.","filename":"data/vaneerConsumption/NovakDjokovicreachessixthAustralianOpenfinalafterbeatingRogerFederer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A8339F00000578-0-image-a-18_1453978028010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3420742_Novak-Djokovic-staves-Roger-Federer-fightback-reach-Australian-Open-final-closes-sixth-Melbourne-title_1540248083.html","title":"Novak Djokovic reaches sixth Australian Open final after beating Roger Federer","title_page":"Novak Djokovic reaches sixth Australian Open final after beating Roger Federer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Novak Djokovic is on course to win his sixth\nNovak Djokovic fought off a furious fightback from Roger Federer to put himself in prime position to win a sixth Australian Open title.\nThe world No 1 is lying in wait for Andy Murray or Milos Raonic after coming through a helter-skelter semi-final to beat the Swiss legend 6-1, 6-2, 3-6, 6-3 in two hours and 19 minutes. It will be his fifth consecutive Grand Slam final.\nDjokovic has only lost once in 171 matches after going two sets up, but he was rattled when Federer uncorked some of his finest vintage to surge back and take a high quality third set before the roof was closed.\nNovak Djokovic produced an impressive display to reach the Australian Open final on Thursday\nDjokovic will appear in his fifth consecutive Grand Slam final against either Andy Murray or Milos Raonic\nThe world No 1 remains on course to win his sixth title in Melbourne\nWorld No 3 Roger Federer had no answer to the Serb's dominance on Rod Laver Arena\nDJOKOVIC RECORD IN MELBOURNE 2005 – 1st round 2007 – 4th round 2009 – Quarter-final 2011 – Winner 2013 – Winner 2015 – Winner 2006 – 1st round 2008 – Winner 2010 – Quarter-final 2012 – Winner 2014 – Quarter-final 2016 – ?\nThat is usually a help for the Swiss but, with the level of the match somewhat dropping at the start of the fourth, the Serb took advantage of a favourable net cord in the seventh game to break for 5-3 and close it out from there.\nAs in their last two meetings at Grand Slams – the finals at Wimbledon and the US Open – Federer was the massive crowd favourite.\nYet, against this calibre of opponent he struggles to produce his necessary best for long enough to win over five sets.\nFederer reaches to return a forehand as he battles to stay in the match with Djokovic\nDjokovic strains every sinew in his attempt to stay on top as the 28-year-old puts in a stunning display\nFederer, a 17-time Grand Slam winner, looks dejected as he wipes his forehead as the match slips away\nDjokovic steamrollered his way to the first set in just 21 minutes, breaking Federer twice to win 6-1\nDjokovic was magnificent in the two opening sets and would surely have swept aside anyone on that kind of form.\nFederer, attacking the net with gusto, managed to rush him out of his rhythm in the third, but the brief break for the roof closure seemed to allow the world No 1 to regroup.\nDjokovic said: 'Definitely I've played an unbelievable first two sets but that's what is necessary against Roger. He's been playing a very high level during this tournament.\nThings didn't get much better for Federer in the second as he was broken twice again before losing 6-2\nDjokovic punished his Swiss opponent for an uncharacteristically high number of unforced errors\nFederer roars with celebration as he produced a spirited fightback to take the third set\n'I knew he was going to be aggressive, mix up the pace and come to the net, but I came out with the right intensity and concentration. I executed everything perfectly.\n'This has been the first Grand Slam I won back in 2008. Each time I come back to this tournament and step on Rod Laver Arena I have this beautiful memory from 2008.\n'Of course, over the years I have been playing some of my best tennis in this tournament and hopefully I can keep on going.'\nDjokovic reacts with disbelief as Federer worked his way back into the match in the fourth set","url":"https://www.dailymail.co.uk/sport/tennis/article-3420742/Novak-Djokovic-staves-Roger-Federer-fightback-reach-Australian-Open-final-closes-sixth-Melbourne-title.html"}
