{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:41:18","date_modify":"2018-10-30 21:41:18","date_publish":"2015-01-14 17:17:36","description":"A former Massachusetts prosecutor, who once secured a civil rights injunction against Mark Wahlberg, says the actor shouldn’t be pardoned for attacking two Asian men in his youth.","filename":"data/vaneerConsumption/NoWahlbergPardonAdmitRacialElement.json","image_url":"https://media.breitbart.com/media/2015/01/Mark-Wahlberg-Youth-Arrest-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_01_14__1540935678.html","title":"No Wahlberg Pardon, Admit 'Racial' Element","title_page":"Prosecutor: No Wahlberg Pardon, Admit 'Racial' Element","title_rss":"NULL","source_domain":"breitbart.com","text":"A former Massachusetts prosecutor, who once secured a civil rights injunction against Mark Wahlberg, says the actor shouldn’t be pardoned for attacking two Asian men in his youth.\nJudith Beals, also a former Massachusetts assistant attorney general, penned her case against the pardon in an article published this week by The Boston Globe, titled Don’t Pardon Mark Wahlberg. While Beals believes in “forgiveness and reconciliation,” she insists his pardon request should be denied because he hasn’t acknowledged the racial element of his crimes.\nHer opinion piece partially reads:\nIn the 13 years I served in the attorney general’s office, I recall only one instance of a defendant violating a civil rights injunction — Mark Wahlberg. His attack on Thanh Lam and Hoa Trinh showed the same tendency toward serial acts of racial violence. The two men had no connection except for the fact that they were both Vietnamese. Wahlberg’s repeated racial epithets revealed an equally racist motivation albeit toward a different class – making clear that bigotry harbors no boundaries. But this time, Wahlberg was even more violent, breaking a five-foot pole over Thanh Lam’s head and punching Hoa Trinh to the ground. For this, he served 45 days in prison.\nShe continued, saying, “That acknowledgement of the crime and that facing of history is absolutely critical in the issuing of a pardon.”\nIn the 1986 case, prosecuted by Beals, Wahlberg and two other “white” friends reportedly attacked three black siblings by throwing rocks at them in a racial slur-laden foot pursuit in Boston’s Dorchester neighborhood.\nA day later, Wahlberg and a larger group of white friends intimidated a group of mostly black fourth-graders, which was only stopped when an adult intervened.\nDue to the nature of his misdeeds, Beals argued that Wahlberg’s status and wealth should not be used as an advantageous means to simply walk away from his past.\nBeals spoke to the Associated Press Tuesday to further elaborate her stance on the request and stated that Wahlberg has chosen to blame his previous behavior on his heavy drug and alcohol use at the time, rather than his racial motivations.\nWahlberg filed his request for a pardon in separate case, in November, asking for a 1988 incident in which he hit a Vietnamese man in the head with a wooden pole while attempting to steal alcohol. He also punched another man in the face while trying to evade police.\nWahlberg subsequently served 45 days in jail for that incident, but has remained out of trouble since.","url":"https://www.breitbart.com/entertainment/2015/01/14/former-prosecutor-no-wahlberg-pardon-until-he-admits-racial-element-of-crimes/"}
