{"authors":["Simon Kent"],"date_download":"2018-10-30 20:35:45","date_modify":"2018-10-30 20:35:45","date_publish":"2015-10-28 16:46:08","description":"Austria will build a fence along its border with EU neighbour Slovenia to help stem the migrant invasion now flooding Europe.","filename":"data/vaneerConsumption/NowAustriaPlansToBuildAfenceToThwartEuropesMarchOfMigrants.json","image_url":"https://media.breitbart.com/media/2015/10/ap_ap-photo1859-wi-1024x7682.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_28__1540931745.html","title":"Now Austria Plans To Build A fence To Thwart Europe's March Of Migrants","title_page":"Now Austria Plans To Build A fence To Thwart Europe's March Of Migrants","title_rss":"NULL","source_domain":"breitbart.com","text":"Austria will build a fence along its border with European Union (EU) neighbour Slovenia to help stem the migrant invasion now flooding Europe, Interior Minister Johanna Mikl-Leitner said today. Both countries are part of the passport-free Schengen zone and remain key transit countries for hundreds of thousands of mostly young, Muslim men trying to reach northern Europe via the Balkans.\nSlovenia, the main entry point into Austria, also said it was ready to build a fence, meaning the two countries will follow Hungary in trying to seal their frontiers, thus threatening to block the land route used by migrants from the Middle East and sub-Saharan Africa now invading Europe.\nAccording to nachrichten news service, Austria’s interior minister, Johanna Mikl-Leitner, told parliament construction of “technical barriers” would begin after about 10 days of planning but gave no exact date for work on the project to begin.\nIn separate comments to the state broadcaster ORF, she spoke of the need for a fence to maintain public order. The defence minister, Gerald Klug, said containers or railings could be set up to “to control the refugees in an orderly way”.\nMikl-Leitner insisted there were no plans “to build a fence around Austria” but with as many as 8,000 migrants entering Austria each day, the southern crossing at Spielfeld, across the border with Slovenia, has been overwhelmed by the crush.\nElsewhere in Europe the story is the same. As Breitbart London has reported, there has been no shortage of warnings that the great migrant surge engulfing Europe is being used as a cover by Islamist groups to smuggle trained fighters into Europe to wage jihad.\nThe only option left for countries along the migrant path to ensure their national security is to build fences and opt for harsher screening measures for arrivals.\nGermany has already tightened its security protocols. Interior Minister Thomas de Maiziere announced today that many of the Afghans pouring into the country will likely be sent back to their homeland after they can be separated from Syrian claimants.\nAt a mini-summit of 11 European leaders on the Balkan route on Sunday, Slovenia and the countries further south on the migration route—Croatia, Serbia, Macedonia and Greece—agreed to set up shelter facilities for a total of 100,000 people, half of them in Greece, as countries struggle to feed, clothe and house the arrivals.\nAt the Sunday summit, Hungarian Prime Minister Viktor Orban said he was “just an observer” at the meeting, saying his country had solved the problem of economic migrants flooding his country and offered to give advice to other countries on how to build fences of their own.\nOn the evidence Austria and Slovenia have taken that advice.","url":"https://www.breitbart.com/europe/2015/10/28/now-austria-plans-build-fence-thwart-europes-march-muslim-migrants/"}
