{"authors":[],"date_download":"2018-10-22 22:53:39","date_modify":"2018-10-22 22:53:39","date_publish":"2016-01-11 04:06:27","description":"Dallas forward Dirk Nowitzki, 37 years old and with more than 1,300 NBA games under his belt, is still the Mavericks' go-to guy. The German veteran scored a ...","filename":"data/vaneerConsumption/NowitzkimakesthedifferenceinMavsNBAwinagainstMinnesota.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z622-56CX32zFKLb7123928b84ca09aa9-416_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393359_Nowitzki-makes-difference-Mavs-NBA-win-against-Minnesota_1540248819.html","title":"Nowitzki makes the difference in Mavs' NBA win against Minnesota","title_page":"Nowitzki makes the difference in Mavs' NBA win against Minnesota | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nowitzki makes the difference in Mavs' NBA win against Minnesota\nDallas forward Dirk Nowitzki, 37 years old and with more than 1,300 NBA games under his belt, is still the Mavericks' go-to guy.\nThe German veteran scored a game-high 29 points on Sunday as the Mavericks edged the Minnesota Timberwolves 93-87 in Minneapolis, taking up the slack on a night when many of his teammates struggled offensively.\n\"He's a guy that's prepared himself for greatness virtually every night,\" Mavericks coach Rick Carlisle said of Nowitzki.\nDirk Nowitzki of the Dallas Mavericks takes a shot during a NBA game at American Airlines Center in Dallas, Texas ©Ronald Martinez (Getty/AFP/File)\n\"One of the things we want to try to do is take some of the burden off of him, but there's nights like tonight where it's unavoidable.\"\nDallas forward Chandler Parsons added 14 points and center Zaza Pachulia scored 13, but it was Nowitzki's scoring touch that made the difference.\nHe hit four of seven three-point attempts, while the rest of the Mavs were a combined two of 13 from beyond the arc.\nNowitzki finished the game 12-for-22 from the floor and pulled down seven rebounds in 31 minutes.\nIt was his fourth straight 20-point effort and his 13th such game this season.\n\"The guys kept coming to me,\" Nowitzki said. \"Defensively, it was a good effort tonight. We didn't have a lot of guys who were shooting the ball especially well, but I thought defensively we kept battling.\"\nSecond-year guard Andrew Wiggins led the Timberwolves with 21 points.\nDallas led by six at halftime and closed out the third quarter with an 18-4 scoring run.\nThe Timberwolves trimmed the deficit to 85-82 late in the fourth quarter, but Nowitzki converted a three-point play with 1:30 remaining, and Dallas held on.\n- Streaking Clippers -\nThe Los Angeles Clippers had to work overtime to stretch their winning streak to nine games with a 114-111 victory over the short-handed New Orleans Pelicans.\nPoint guard Chris Paul scored 25 points with 11 assists and five rebounds for the Clippers, one of seven Los Angeles players to score in double figures.\nThe Pelicans were without top scoring forward Anthony Davis, who was still nursing a sore back two days after diving into the stands after a ball.\nBut they held a 106-105 lead with 2:42 left in overtime before Wesley Johnson and Paul made back-to-back three-pointers to give Los Angeles a five-point lead. Luc Mbah a Moute and Johnson then made three of six free throws to help the Clippers secure the win.\nAlthough he was pleased with the victory, Paul reiterated that the Clippers aren't themselves without Blake Griffin, still sidelined by a torn quadriceps tendon.\n\"We want to continue to try to keep winning games and build our team as much as possible, but this is not our team without (number) 32,\" Paul said.\n- Streaking Cavs -\nLeBron James scored 12 of his 37 points in a 14-0 fourth-quarter run to lead the Cleveland Cavaliers to a 95-85 victory over the Philadelphia 76ers.\nJames added nine assists and seven rebounds for the Cavs, who improved their Eastern Conference leading record to 26-9 with their seventh straight victory.\nCleveland won their fifth straight on the road and their sixth straight over the league-worst 76ers -- who fell to 4-36.\n- Rockets edge Pacers -\nThe Houston Rockets gave up the first six points of overtime, but battled back with three-pointers from Patrick Beverly, Trevor Ariza and Corey Brewer to beat the Indiana Pacers 107-103.\nBrewer's three-pointer with 40.9 seconds left gave the Rockets a 105-103 lead. Houston then forced a miss from the Pacers' Monta Ellis, and Ariza followed up with a breakaway dunk to seal the win, which pulled the Rockets to 19-19 for the season.\nChris Paul of the Los Angeles Clippers, seen in action during a NBA game at Verizon Center in Washington, DC ©Patrick Smith (Getty/AFP/File)\nLeBron James of the Cleveland Cavaliers dunks the ball during their NBA game against the Philadelphia 76ers, at the Wells Fargo Center in Philadelphia, Pennsylvania, on January 10, 2016 ©Mitchell Leff (Getty/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393359/Nowitzki-makes-difference-Mavs-NBA-win-against-Minnesota.html"}
