{"authors":["Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 23:09:52","date_modify":"2018-10-22 23:09:52","date_publish":"2016-01-11 04:59:58","description":"A 'severely malnourished' four-year-old girl is still in hospital receiving treatment almost one month after police removed her from a south New South Wales home and her caregivers.","filename":"data/vaneerConsumption/NowragirlinNSWhospitalamonthafterbeingfoundwithseveremalnutrition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004C43000000578-0-image-a-82_1452488230048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393363_Girl-4-hospital-one-month-home-suffering-severe-malnutrition-man-woman-charged-neglect_1540249792.html","title":"Nowra girl in NSW hospital a month after being found with severe malnutrition","title_page":"Nowra girl in NSW hospital a month after being found with severe malnutrition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A severely malnourished four-year-old girl is still in hospital receiving treatment almost one month after police removed her from her home on the New South Wales south coast.\nHer carers, a 25-year-old woman and a 34-year-old man, were arrested and charged on December 31 in Nowra, on the New South Wales south coast, with failure to provide for a child causing danger of death, according to police.\nOfficers were told about the little girl on December 12 when a member of the community called and said they were concerned.\nThe girl remains in hospital being treated almost a month after she was removed from the home and her one-year-old sister was also removed (stock photo)\nWhen they arrived at the Nowra home that day, police saw the girl was in an alleged emaciated condition.\nThe child was taken to a hospital for treatment and her one-year-old sister was also removed from the home and the man and woman’s care.\nThe man and woman were released on bail with conditions and will appear in court on January 18.\nThe State Crime Command’s Child Abuse Squad is investigating and urges anyone who is worried about a child and the condition they live in to call Crime Stoppers on 1800 333 000.\nThe man and woman were released on conditional bail and will appear at the Nowra Local Court (pictured) on January 18","url":"https://www.dailymail.co.uk/news/article-3393363/Girl-4-hospital-one-month-home-suffering-severe-malnutrition-man-woman-charged-neglect.html"}
