{"authors":["Ryan O'Hare For Mailonline","South West News Service"],"date_download":"2018-10-23 02:16:33","date_modify":"2018-10-23 02:16:33","date_publish":"2016-01-29 16:41:34","description":"Scientists from the Universities of Exeter and Cambridge used sophisticated digital imaging to test just how effective the various camouflage strategies used by animals really are.","filename":"data/vaneerConsumption/NowyouseemenowyoudontScientistscreateapredatorseyeviewcameratoconfirmcamouflagereallyISthebestwayforanimalstostayhidden.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B325AB00000578-0-image-a-92_1454081683910.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422958_Now-don-t-Scientists-create-predator-s-eye-view-camera-confirm-camouflage-really-best-way-animals-stay-hidden_1540260993.html","title":"Now you see me, now you don't! Scientists create a 'predator's-eye-view' camera to confirm camouflage really IS the best way for animals to stay hidden","title_page":"Now you see me, now you don't! Scientists create a 'predator's-eye-view' camera to confirm camouflage really IS the best way for animals to stay hidden | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The findings demonstrate birds and eggs which match the pattern or contrast of their surroundings really do have a better chance of survival\nIt may sound obvious, but when it comes to surviving attacks from predators camouflage really does help animals stay hidden.\nIt has long been assumed animals which are able to match their surroundings reduce their chances of becoming a meal.\nNow, scientists have confirmed this theory but being able to peer through the eyes of predators while studying birds and their eggs from their point of view.\nScroll down for video\nScientists from the Universities of Exeter and Cambridge used sophisticated digital imaging to test just how effective the various camouflage strategies used by animals really are. Pictured is a nightjar, a ground-nesting bird species which camouflages well against the forest's floor\nMany animals have different levels of colour vision to humans, with some having a greater ability to see colours more vividly.\nWhile it may be hard for us to spot ground-nesting birds as they hide in the bush, exactly how other animals see them has not been explored.\nScientists from the Universities of Exeter and Cambridge used sophisticated digital imaging to test just how effective the various camouflage strategies used by animals really are.\nHIDING ADULTS AND THEIR EGGS Scientists used sophisticated digital imaging to test just how effective the various camouflage strategies used by animals really are. They found that birds and eggs in Zambia which matched the pattern or contrast of the surrounding landscape really did have better survival chances. Specially-calibrated cameras and computer models of animal vision enabled the team to view the nests just as the predators might see them. This offered an insight which ranged from the sophisticated colour vision of birds able to see ultraviolet wavelengths, to the relatively poor colour vision of mongooses which can only detect blues and yellows. For those bird species which fled when predators approached, the camouflage and contrast of the eggs' shell was most important. In those species which remained frozen to the spot, the adult's plumage matching the surroundings was critical.\nThey found that birds and eggs in Zambia which matched the pattern or contrast of the surrounding landscape really did have better survival chances.\nThe findings are published in the journal Scientific Reports.\nDr Jolyon Troscianko, a researcher at Exeter's Centre for Ecology and Conservation and lead author on the study, said: 'We know that animal camouflage has evolved over millions of years to help prey evade being seen by predators - it is a classic example of natural selection.\n'Yet although it may seem obvious that blending into your background makes you less likely to be seen, it is surprisingly difficult to test this in a natural setting.\n'This is partly because very well camouflaged animals are, of course, difficult to find in the wild, and also because they tend to keep moving around, meaning the match between their own appearance and their background is constantly changing.\n'In addition, we had determine which predators were eating the nests so that we could take into account their different visual systems.'\nThe study examined ground-nesting birds which keep their eggs in a fixed location throughout a month-long incubation period.\nEgg hunt: Researchers compared both the adult birds, and their eggs, to their chosen backgrounds. Pictured are the camouflaged eggs of a bronze-wing courser, which flees the nest when predators approach\nThe scientists were able to monitor which nests had been found by predators such as vervet monkeys, grey - headed bushshrikes and banded mongooses (pictured left to right)\nResearchers compared both the adult birds, and their eggs, to their chosen backgrounds.\nThey also monitored which nests had been found by predators such as banded mongooses, birds, and vervet monkeys - and even in one case, hungry children.\nSpecially-calibrated digital cameras and computer models of animal vision enabled the team to view the nests just as the predators might see them.\nThis offered an insight which ranged from the sophisticated colour vision of birds able to see ultraviolet wavelengths, to the relatively poor colour vision of mongooses which can only detect blues and yellows.\nThe results showed that for bird species which would flee the nest as predators approached, such as plovers and coursers, the eggs were more likely to survive to hatching if they matched the background more closely to the background when exposed to view by their fleeing parent.\nCamouflage is an invaluable tool for avoiding predators. This photograph appears to show nothing but a barren, snowy landscape. But there are in fact hundreds of sheep in this picture cleverly disguised between the sandy-coloured shrubbery and the snow\nPredators play the hiding game too. This image of a stealthy cheetah shows the animal barely visible in the grass. It's sandy coloured fur and spots breaks up it's outline, helping it to blend into the background\nIn nightjars, however, which conceal their eggs by remaining motionless over them when predators approached, it was the appearance of the adults that was most important for their survival.\nNightjars that matched the background pattern were more likely to save their eggs from being eaten.\nDr Martin Stevens, an associate professor in Sensory and Evolutionary Ecology at Exeter, added: 'Despite such a long history of research, ours is the first study to directly show how the degree of camouflage an individual has, to the eyes of its predators, directly affects the likelihood of it being seen and eaten in the wild.'","url":"https://www.dailymail.co.uk/sciencetech/article-3422958/Now-don-t-Scientists-create-predator-s-eye-view-camera-confirm-camouflage-really-best-way-animals-stay-hidden.html"}
