{"authors":["Penny Starr"],"date_download":"2018-10-30 18:09:12","date_modify":"2018-10-30 18:09:12","date_publish":"2018-07-27 11:50:20","description":"Inside a bar in West Virginia, a group of socialists shared with National Public Radio what the new face of the Democratic Party looks like.","filename":"data/vaneerConsumption/NPRExplainstheNewDemocraticLeftJesusWasaSocialist.json","image_url":"https://media.breitbart.com/media/2016/09/jesus-christ.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_27__1540922952.html","title":"NPR Explains the New Democratic Left: Jesus Was a Socialist","title_page":" NPR Explains the New Democratic Left: Jesus Was a Socialist","title_rss":"NULL","source_domain":"breitbart.com","text":"Inside a bar in West Virginia, a group of socialists gathered to share with the taxpayer-funded leftwing National Public Radio (NPR) what the new face of the Democratic Party looks like.\nFirst up — apparently a rarity among Democratic Socialists of America (DSA) — is the co-founder of the West Virginia chapter.\n“I might be the only one in our little chapter that is a Christian, and it all just fits so perfectly together for me, things that I’ve always thought anyway along with my values morally and religiously,” Kelley Rose said in the NPR article posted on its website.\n“Possibly my mother would want to debate me on this, but if anyone was ever a socialist it was Jesus,” Rose said.\nNPR found 13 socialists in West Virginia and penned a lengthy piece entitled “What You Need To Know About The Democratic Socialists of America.”\nThe news outlet said the group in the bar is “a part of the DSA’s explosive growth nationwide. Membership has grown sevenfold since 2015, from around 6,000 then to 43,000 as of early July.”\nThat represents 43,000 of the more than 200 million registered voters in the United States.\nNPR admits “socialism is still an idea with a lot of Cold War-era baggage for a lot of Americans” but goes on to praise the so-called movement and its new star Alexandria Ocasio-Cortez.\nThe NPR article lays out what these socialists believe, including abolishing capitalism.\n“I think we just need to realize that the end goal is, ultimately, like social control of the means of production,” Joe Cernelli, a founding member of that West Virginia DSA chapter said. “You know we don’t just want to improve capitalism, we will ultimately want to get rid of it.”\n“We see [capitalism] as fundamentally undemocratic,” DSA National Director Maria Svart told NPR and summed up what these socialists want.\n“When it comes right down to it, we believe people need to be able to live a dignified life,” Svart said. “I mean there are certain things that should not be left up to the market.”\n“Let’s say you were negotiating at a bargaining table with workers in a bakery, and the workers said, ‘Look, we want more than a quarter of the bread; we want half of the bread, or we want two-thirds of the bread,’ ” Svart said. “The socialist would say, ‘Actually, we want the bakery. We want to control it all, for all of our benefit.’ ”\nNPR reported:\nBut beyond that, the group advocates for some pretty revolutionary changes to democracy, like abolishing the Senate. The DSA calls it “extremely unrepresentative” for the way it gives both tiny and huge states alike two senators each — the group would like to replace it with a more representative body. The country — and the attitudes of most American voters — are pretty far from this vision, though, so the DSA is willing to pursue policies that fall short of its ultimate goals. Health care is one example — the group backs “Medicare for All” — where the government provides health insurance, but the private sector supplies the doctors and hospitals. But many DSA members would prefer a system where the government employs the doctors themselves.\nAnd to Democratic Socialists, Bernie Sanders is not leftist enough.\n“Svart says, the group sees Sanders as an ‘ally’ while also wanting to go further than he does on many areas,” NPR reported.\nNPR notes that it has been 20 years since a member of DSA held a seat in Congress but predicts Cortez will change that. And it reports her call to abolish Immigration and Customs Enforcement (ICE) had caused more ordinary Democrats to fall in line, showing perhaps the “clout” these new radicals may have.\nThe NPR missive ends with Jonathan Williams, a teacher who showed up at the bar for the socialist gathering for the first time because he still isn’t over Hillary Clinton’s loss to President Donald Trump.\n“That Clintonian view of politics I did find appealing for quite some time,” Williams told NPR. “It took seeing it crushed rather decisively and then all of those gains wiped away in the course of 18 months to realize that maybe that wasn’t working. And rather than telling myself that good things are impossible that it’s not doing any harm to swing for the fences.”\nFollow @PennyStarrDC on Twitter","url":"https://www.breitbart.com/politics/2018/07/27/npr-explains-the-new-democratic-left-jesus-was-a-socialist/"}
