{"authors":[],"date_download":"2018-10-22 20:32:12","date_modify":"2018-10-22 20:32:12","date_publish":"2018-06-26 00:00:00","description":"We asked writers from across public radio to name the one album that's stood out during the first six months of the year.","filename":"data/vaneerConsumption/NPRMusics40FavoriteAlbumsOf2018SoFar.json","image_url":"https://media.npr.org/assets/img/2018/06/25/hsieh-npr-albums-so-far_wide-63664c41a942582346c0596fae58a82ce28f797e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_06_26_622438312_npr-musics-40-favorite-albums-of-2018-so-far-part-1_1540240332.html","title":"NPR Music's 40 Favorite Albums Of 2018 (So Far)","title_page":"NPR Music's 40 Favorite Albums Of 2018 (So Far) : NPR","title_rss":"NULL","source_domain":"npr.org","text":"NPR Music's 40 Favorite Albums Of 2018 (So Far)\nEnlarge this image Angela Hsieh/NPR Angela Hsieh/NPR\nLet's face it: We live in an era dominated by playlists. Whether you listen to one of the chart-defining destinations on Spotify, let YouTube's algorithm be your guide, follow a friend's listening habits or create your own mixtapes, the idea of listening to an entire album in one sitting becomes increasingly quaint by the day. With thousands of great songs available at the tips of our fingers (not to mention that skip button), sitting through anything but an irresistible chorus can feel like a bridge too far. It's almost as if spending 30 minutes with a record requires an irrational attachment bordering on obsession.\nSo, for the moment, we're leaning into obsession. When we surveyed our panel of public radio writers about the best albums of the past six months, we asked them a single question: What is your one favorite album of 2018 so far? We weren't interested in the consensus constructed by second- and third-place votes; there will be plenty of pixels for that in December. Without further ado, let's talk about the passions.\nAlice Bag\nBlueprint (Don Giovanni Records)\nAlice Bag's Blueprint is a lesson in archetypes. In the 1970s, the Chicana L.A. punk pioneer of The Bags proclaimed herself a \"Violence Girl\": a woman who, like certain chrome alloys, becomes only more unbreakable when tempered with fire. On Blueprint, Bag paints complex portraits of nameless (brown by default) individuals with characteristic pith and violence-girl riffs. On \"Invisible,\" a man who drinks too much holds himself together for his daughter and craves invisibility, a state many immigrants inhabit to survive, only to remain invisible to the American public eye. On \"The Sparkling Path,\" Bag alludes to escape by suicide, urging a message of survival beyond the kind of Maslow-diagnosed magical thinking for the oppressed who seek fulfillment beyond a lack of food, water and, most pressing of all, shelter. And on \"77,\" she enlists the help of Kathleen Hanna (Bikini Kill) and Alison Wolfe (Bratmobile) to inhabit the working women of 9 to 5 and tie up their male boss. In other songs, Bag is herself again, defending her blue hair against chismosas on \"Se Cree Joven\" or delivering the starkest gut punch against self-loathing in \"Etched Deep\": \"All that rubbing at the pages / Won't make them white,\" she says to us and to our history. There's no performative Twitter-shock at the plight of brown people on this album. There's only the solemn self-vindication of a woman too long kept in the dark by ostensibly radical punk. \"White justice,\" after all, \"just isn't just.\" — Stefanie Fernández\nStream: Apple / Bandcamp / Spotify\nCourtney Marie Andrews\nMay Your Kindness Remain (Fat Possum Records / Mama Bird Recording Co.)\nThe layers of singer-songwriter Courtney Marie Andrews' May Your Kindness Remain are vast as the music is enchanting. Her sixth record is easy to fall for, with her dusky soprano rising atop an easy-going, yet sultry band. Her groove is reminiscent of Linda Ronstadt, particularly with the way she slides around the spectrum of Americana: country, folk, gospel and something else you can't quite put your finger on. Lyrically, Andrews is in touch with her own loneliness, kindness and empathy and that shines through songs like \"I've Hurt Worse,\" \"May Your Kindness Remain\" and \"Two Cold Nights in Buffalo.\" The inspiration for these songs came from meeting people on her tours and realizing that everyone is suffering from the same types of sadness. May Your Kindness Remain is an accurate, passionate account of facing problems directly and dealing with depression head-on. -- Cindy Howes, Folk Alley & WYEP\nStream: Apple / Bandcamp / Spotify\nGrażyna Bacewicz\nChamber Works (Chandos)\nIn her native Poland, streets are named after Grażyna Bacewicz, but the composer's rigorously constructed music has struggled for attention almost everywhere else. Lately, thanks to the Silesian Quartet (and friends), Bacewicz is getting the recognition she deserves, mainly through recordings like this absorbing album of chamber music composed between 1949 and 1965. A violin virtuoso and a formidable pianist, Bacewicz managed to carve out a career in the turbulent years before and during communist era Poland. During World War II, living in Warsaw, she gave secret concerts, sometimes premiering her own pieces. Bacewicz wrote symphonies, concertos and stage works, but she arguably shined brightest when crafting the intricate musical conversations that unfold within chamber music. The Piano Quintet No. 1, anchored by an aching central slow movement, shifts seamlessly from somber motifs to lyrical folk infusions, including a jaunty oberek. The Second Piano Quintet, more progressive, finds piano and strings separated in muscular arguments while incorporating a palette of colorful sounds and spiky rhythms. Two short, fascinating quartets round out the album — one for four violins that dances and sings, another darker, more experimental one for four cellos. Hopefully, the Silesian Quartet, which has already released an award-winning album of the composer's string quartets, will continue to help drive the Bacewicz bandwagon. -- Tom Huizenga\nStream: Apple / Spotify\nCourtney Barnett\nTell Me How You Really Feel (Mom + Pop)\nWhen Courtney Barnett released her debut album, Sometimes I Sit and Think, and Sometimes I Just Sit, in 2015, she drew legions of fans for her deadpan humor, rapid-fire wordplay and mundane observations set against loud guitars. On her follow-up, Barnett is no less captivating, but the music is darker and angrier, informed in no small part by the collective outrage and convictions of the #MeToo movement. She rages against the status quo on \"I'm Not Your Mother, I'm Not Your Bitch,\" deplores gaslighting on the song \"Crippling Self-Doubt and a General Lack of Confidence\" and offers a few weary words of encouragement on \"Hopefulessness.\" This is also some of Barnett's most melodic work — she sings more than she speaks. The guitars still bite with infectious hooks and the lyrics, more personal and revealing, resonate with deeper emotions. It feels like a timely and natural progression for an artist who has long battled and documented her own existential ennui. On Tell Me You How You Really Feel, Barnett recognizes that she's not alone in this battle and that it's OK to be outraged in outrageous times. -- Robin Hilton\nStream: Apple / Bandcamp / Spotify\nBeach House\n7 (Sub Pop)\nVictoria Legrand and Alex Scully of Beach House described a new kind of freedom in the making of their seventh album. It seems they felt an unwelcome pressure writing and recording in the past, whether that was the constraints of a set studio schedule, or concerns with how their experimentation would translate live. With some adjustments to the creative process, the duo were more liberated this time and the results are stellar. That's not to suggest they re-invented their sound along the way; in fact, they have stayed true to their particular brand of dream-pop, but you can hear confident strides toward mastering their craft. As a music fan reared on '90s-era British indie-rock (Cocteau Twins, Ride, My Bloody Valentine), Beach House have always had an immediate gravitational pull. Peter Kember from Spacemen 3, central to that era in the U.K., took a turn producing this album, and you can hear his fingerprints all over it. \"Dive\" is a good example, as the song builds from a drone-like church organ to a hard-charging anthem. The dynamics and range of feeling throughout this album are really special: intimate one moment and rolling thunder the next. It's also a great album listen, which has become something of a lost art in these days of algorithms and streaming playlists. — Jason Bentley, KCRW\nOver the past decade, Beach House has become synonymous with dream-pop. The duo has consistently written gorgeous music with a hypnotic, almost otherworldly quality that often defies conventional expectation and revels in risk-taking. But by definition, its sound has typically been a little more dream than pop. Album number seven for the Baltimore-based group flips that relationship, but only ever so slightly. And the result is perhaps the band's finest recording to date. 7 is indeed a cover-to-cover listen. When consumed in one sitting, the record's 11 songs will reward the complex palates of longtime fans. But Beach House have also created some truly great standalone tracks here. Songs like \"Lemon Glow,\" \"Dark Spring\" and \"Dive\" standout with their less-than-subtle hooks and a surprising drive. And this being Beach House, they get better with each listen. -- Jerad Walker, opbmusic.org\nStream: Apple / Bandcamp / Spotify\nBlackberry Smoke\nFind A Light (3 Legged Records)\nFor nearly two decades, Georgia's Blackberry Smoke has been a purveyor of the new Southern rock movement, though if you asked its members, they'd likely say they're just a rock and roll band that happens to be from the South. Their sixth album, Find A Light, continues the work ethic that unites the quintet: to always push each other to explore new turf. Charlie Starr, Richard Turner, Brit Turner, Paul Jackson and Brandon Still cook up a sonic stew that displays a Southern Rock musical history lesson. The new album contains hints of the diversity within the genre, from the grungy texture on \"Flesh & Bone\" that recalls Cross Canadian Ragweed, to the sweet Crosby, Stills & Nash harmonies on \"Mother Mountain,\" to the Skynyrd-flavored \"I'll Keep Ramblin.\" There are elements woven in that suggest JJ Cale, Wet Willie, The Allman Brothers and even a bit of Dixie Dregs here, yet Blackberry Smoke makes it all feel cohesive and new. Find A Light pushes the envelope while providing that famous Blackberry Smoke autonomy, delivered with soulful vocals, haunting harmonies and kick-ass songs. -- Jessie Scott, WMOT's Roots Radio\nStream: Apple / Spotify\nBlawan\nWet Will Always Dry (Ternesc)\nBritish producer Jamie Roberts (a.k.a. Blawan) is responsible for two of underground dance music's biggest anthems this decade. \"Getting Me Down,\" his Brandy-powered white label, was voted the No. 1 track of 2011 by global dance hub Resident Advisor, and the following year's \"Why They Hide Their Bodies Under My Garage\" eventually received both a Skrillex bootleg and a ferocious cover by post-punk act Girl Band. The relative ubiquity of the two tunes put Roberts on the brink of stardom, and then ... silence. There would be no updates to Blawan's Discogs page for almost three years. The hiatus was partly due to an illness that landed Roberts in the hospital, but it was also intentional; the Blawan train was moving too fast in the wrong direction. When Roberts reactivated the alias in 2015, the vocal flips and samples of the past were jettisoned in favor of no-frills functional techno. Over the course of four EPs on his own Ternesc label, Roberts honed his craft to the point of perfection. The resolve pays off on Wet Will Always Dry, one of the finest electronic albums of the year and a clear moment of vindication for a musician determined to succeed on his own terms. — Otis Hart\nStream: Apple / Spotify\nBlue Lab Beats\nXover (AllPoints)\nToo often, the jazz mentality in the U.S. operates from a lonely place of insularity. \"This is jazz.\" \"That's not jazz.\" \"Someone call the jazz police!\" This attitude has done the music little service over the years, which helps explain why a teenaged duo from London, a city that celebrates jazz without boundaries, has made the jazz album of 2018. Namali Kwaten (NK-OK) & David Mrakpor (Mr DM) perform as Blue Lab Beats, cooking up genre-ignoring grooves in Kwaten's studio, the Blue Lab. This sonic laboratory also happens to be his bedroom in his parent's home. The Blue Lab birthed a batch of songs that were fiercely fleshed out at Real World Studios with a rotating crew of some of the freshest and most vibrant talents in London. Pianist Ashley Henry brings an elegiac beauty to \"Blue Skies,\" dropping a blues-rich improvisation atop the pulsing beat. Leadoff single \"Pineapple\" showcases the summery guitar work of Mr DM in perfect unison with Moses Boyd's crisp and economical drumming. Rising hip-hop artist Kojey Radical and soul singer Tiana Major 9 offer a meditative rumination on nostalgia on \"Sam Cooke & Marvin Gaye.\" Every track on Xover brims with imagination. — Derek Smith, KMHD\nStream: Apple / Spotify\nThe Breeders\nAll Nerve (4AD)\nBack in the fall, The Breeders announced its return with a rousing, raspy \"Good Morning!\" as if to wake us from a long, 10-year dream, during which there was no new music from this beloved band. The accompanying song, \"Wait In The Car,\" also ushered in exciting, if not improbable, news: After 25 years, the beloved alt-rock band that bore Last Splash had reunited. Kim Deal proclaimed, \"I got business!\" in that first single, and indeed, Deal, with her twin sister Kelley Deal, Josephine Wiggs and drummer Jim MacPherson, had unfinished business to attend to.\nAll Nerve, the fifth full-length album from this once-troubled, but always adored, Dayton, Ohio outfit, arrived in March, and from the very first note, it delivered on the promise of that reunion. Rather than a mere nostalgia trip, All Nerve has the feel of uninterrupted, effortless evolution, with all the signature elements we know and love: quirky and poetic lyrics, tight harmonies, heavy guitars, a bass-heavy rhythm section and some unexpected twists and turns, some even bordering on the atmospheric (\"Spacewoman,\" \"Dawn Making An Effort\"). It comes as no surprise to learn that Courtney Barnett — an artist who owes a debt to The Breeders — guests on the mighty \"Howl At The Summit,\" a standout track with a Zeppelin-worthy riff and beat. In a moment when we are having so many conversations revolving around gender-equality, and feminism, and, yes, waking up, it feels absolutely right to get this sonic reminder of what The Breeders and Kim Deal started more than two decades ago, overcoming odds and sounding so undeniably nervy and strong. — Carmel Holt, WFUV\nStream: Apple / Spotify\nLeon Bridges\nGood Thing (Columbia)\nIn 2015, Leon Bridges released his Grammy-nominated debut album, Coming Home, and instantly garnered comparisons to '60s soul singers. His definitive sound placed him at a fork in the road when re-entering the studio for a follow-up. Would he stick to the throwback sound or would he break new ground? With Good Thing, Bridges not only finds a natural progression of the style that introduced him to thousands of fans worldwide, but he also encapsulates both the past and future of R&B in one album. Much like his loyalty to his home state of Texas, Bridges proves his loyalty to rhythm and blues music with a collection of songs that feel both extremely personal and relatable. The instrumental breaks featuring guitar and saxophone on \"Bad Bad News\" and \"Georgia to Texas\" nod to jazz, while Bridges' vocal delivery on \"Bet Ain't Worth The Hand\" demonstrates his extraordinary range. It's as if he's out to prove he can be anything and everything all at once and still retain his authenticity while doing so – and who wouldn't believe it with an album like this? -- Amy Miller, KXT\nStream: Apple / Spotify\nBrothers Osborne\nPort Saint Joe (Capitol Nashville)\nBrothers Osborne stand out against the backdrop of the contemporary country landscape simply because their basic template is so very different from what anyone else is doing. Guitar-slinging big brother John Osborne and lead-singing T.J. make the most of their idiosyncratic inclinations on their dynamic, immersive sophomore album, Port Saint Joe. At their producer Jay Joyce's suggestion, they escaped Nashville and headed down to his Florida beach house to record a batch of songs that playfully milk familiar forms like country-funk, outlaw anthems and ballads both sentimental and seductive. It proved to be the ideal, low-pressure environment for the brothers to explore the unbounded stylistic and dynamic possibilities of their co-written material. Their arrangements take thrillingly unexpected turns and their band excels at both muscular jamming and creating lacework of subtle syncopation, rippling licks and soft ghost notes. T.J.'s vocal performances are sneaky rather than showy in their impact; he's equally compelling in the roles of soulful brooder, lustful loverman and footloose rabble-rouser. John has plenty of opportunities to stretch out, too. During the blistering rocker \"Shoot Me Straight,\" he skids through biting staccato figures, flashy, Prince-style jazz voicings and full-blown wailing before the track concludes at the six-and-a-half-minute mark. — Jewly Hight\nStream: Apple / Spotify\nBrownout\nFear Of A Brown Planet (Fat Beats)\nAustin Latin-funk powerhouse Brownout is back in the saddle with a new album of songs inspired by legendary hip-hop group Public Enemy. Fear Of A Brown Planet is the latest in a series of Brownout albums on which the band transforms iconic songs from disparate genres into down-and-dirty jams. Before the Public Enemy-inspired album, the band released its clever and undeniably catchy remakes of Black Sabbath's heavy rock anthems. While some bands might tire of covering other artists, Brownout rearranges hit songs as a kind of creative challenge, a musical jumping-off point to explore new sounds and to showcase the power and adaptability of Latin funk. The source material for Fear Of A Brown Planet leans heavily on samples, which makes the deconstruction in these instrumental covers fascinating — because Brownout had to cover the samples, too. Meta, man. — Matt Reilly, KUTX\nStream: Apple / Bandcamp / Spotify","url":"https://www.npr.org/2018/06/26/622438312/npr-musics-40-favorite-albums-of-2018-so-far-part-1"}
