{"authors":["Cara Philbin"],"date_download":"2018-10-23 01:02:16","date_modify":"2018-10-23 01:02:16","date_publish":"2015-03-20 00:00:00","description":"NPR's Steve Inkseep speaks with PM Netanyahu and Chief Palestinian negotiator Saeb Erekat","filename":"data/vaneerConsumption/NPRNewsInterviewsPMNetanyahuandChiefPalestinianNegotiatorSaebErekat.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/about-npr_394270308_npr-news-interviews-pm-netanyahu-and-chief-palestinian-negotiator-saeb-erekat_1540256536.html","title":"NPR News Interviews PM Netanyahu and Chief Palestinian Negotiator Saeb Erekat","title_page":"NPR News Interviews PM Netanyahu and Chief Palestinian Negotiator Saeb Erekat : NPR","title_rss":"NULL","source_domain":"npr.org","text":"NPR News Interviews PM Netanyahu and Chief Palestinian Negotiator Saeb Erekat\nNETANYAHU CLARIFIES CAMPAIGN STATEMENTS ABOUT ARABS AND A PALESTINIAN STATE\nMarch 19, 2015; Washington, D.C. – In separate interviews with NPR Morning Edition host Steve Inskeep, Israeli Prime Minister Benjamin Netanyahu and Chief Palestinian negotiator Saeb Erekat discuss the outcome of Tuesday's election, and the way forward.\nSeveral excerpts follow and an advanced report is available now at the NPR breaking news blog The Two-Way. The full conversations air on Friday, March 20, on Morning Edition (find local stations and broadcast times at npr.org/stations); audio will be available at approximately 8:00AM (ET) on Friday at NPR.org.\nPrime Minister Netanyahu defended his remark earlier this week that Arab voters were heading to the polls \"in droves\", saying: \"I wasn't trying to block anyone from voting. I was trying to mobilize my own forces...I want to tell you that Israel is a democracy and every citizen is automatically registered to vote...Arabs and Jews alike have the right to vote.\"\nNetanyahu, on the possibility of creating a Palestinian state during his tenure as Prime Minister: \"You know, I don't want a one-state solution but I certainly don't want a zero-state solution, a no-state solution, where Israel's very existence would be jeopardized. And that's what the people of Israel overwhelmingly elected me to do.\"\nSaeb Erekat, on the possibility of Netanyahu backing a two-state solution: \"In my opinion, this man was never a two-stater. He is seeking to have the status quo of one state, two systems and this will translate into violence, bloodshed. And that's what we should avoid.\"\nNetanyahu, on whether he's \"a two-stater\": Well, I don't want a single state. And I talked about two states where a demilitarized Palestinian state recognizes the Jewish state, and I stand by that. I haven't retracted my position; I haven't changed it.\"\nOn whether he stands by his previous pledge to cease the removal of settlements, Netanyahu says: \"I'm saying I don't think that's the obstacle for a peace deal. I don't think it ever was.\"\nNetanyahu continues: \"The critical problem we have is not merely where the borders will be but what will be on the other side of the border.\"\nErekat, on his concerns for the future: \"I don't want my son to be a suicide bomber. I don't want my son to be killed. I want my son to be like your sons – I want him to be the musician. I want to export hope for him. I'm warning that Netanyahu's statements and actions are leading to desperation and that desperation will lead to desperate acts. I'm in no position to threat.\"\nFollow the conversation: @MorningEdition\nAll excerpts from the interview must be credited to \"NPR News\". Television usage must include on-screen chyron to \"NPR News\" with NPR Logo. Requests to reuse audio content can be routed through NPR Permissions.\nMorning Edition, the two-hour newsmagazine airing weekdays and hosted by Steve Inskeep in Washington, D.C., and Renee Montagne from NPR West in Culver City, Calif., is public radio's most listened-to program with 13.3 million weekly listeners. For local stations and broadcast times, visit www.NPR.org/stations\nContact\nNPR Media Relations: Cara Philbin\nEmail: mediarelations (at) npr.org","url":"https://www.npr.org/about-npr/394270308/npr-news-interviews-pm-netanyahu-and-chief-palestinian-negotiator-saeb-erekat"}
