{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:30:38","date_modify":"2018-10-30 20:30:38","date_publish":"2016-11-16 16:58:54","description":"Wayne LaPierre stressed that the good news of Clinton's political demise is countered by the reality that George Soros and Michael Bloomberg are still eagerly working to limit the exercise of Second Amendment rights. Moreover, he noted that Barack Obama has spent his time in office filling judicial vacancies with judges who oppose the Second Amendment. | Politics","filename":"data/vaneerConsumption/NRAsWayneLaPierreProGunVotersGaveHillaryaPermanentPoliticalVacation.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-513529696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_16__1540931438.html","title":"NRA's Wayne LaPierre: Pro-Gun Voters Gave Hillary a 'Permanent Political Vacation'","title_page":"NRA's Wayne LaPierre: Pro-Gun Voters Gave Hillary a 'Permanent Political Vacation' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The NRA’s Wayne LaPierre suggests Hillary Clinton ran on platform of “hatred for the Second Amendment” and was placed on “permanent political vacation” by pro-gun voters as a result.\nAccording to The Hill, LaPierre said: “Hillary Clinton made her hatred for the Second Amendment a central issue of this campaign. And as a result of that fatal mistake, she’s on permanent political vacation.”\nBut he stressed that the good news of Clinton’s political demise is countered by the reality that George Soros and Michael Bloomberg are still eagerly working to limit the exercise of Second Amendment rights. Moreover, he noted that Barack Obama has spent his time in office filling judicial vacancies with judges who oppose the Second Amendment. He described such judges as an “infection for which there is no cure” and pointed to President-elect Donald Trump as the one who can diminish the threat such judges pose by spending the next four years filling vacancies with others who are pro-Second Amendment.\nLaPierre issued a call to action, saying:\nThe individual right to carry a firearm in defense of our lives and our families does not and should not end at any state line. I call on Congress and the president-elect to pass national right-to-carry reciprocity as quickly as it can be written and signed.\nBreitbart News reported that LaPierre also focused on gun-free zones; particularly those that keep our men and women in uniform disarmed while on a military base. He called for Trump and Congress to work together to eliminate such zones, saying:\nIt is time, once and for all, to end the absolute fallacy of gun-free zones. Not one American serviceman or woman should be murdered on a military base because the government denied their right to defend themselves with a firearm. We revere the men and women in uniform who defend our freedom, and their rights must be restored immediately.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/11/16/nras-wayne-lapierre-pro-gun-voters-gave-hillary-permanent-political-vacation/"}
