{"authors":["Associated Press"],"date_download":"2018-10-22 22:38:18","date_modify":"2018-10-22 22:38:18","date_publish":"2017-03-10 01:04:07","description":"SYDNEY (AP) - Wests Tigers center Tim Simona has been deregistered by Australia's National Rugby League for a range of gambling-related rule breaches,...","filename":"data/vaneerConsumption/NRLplayerSimonaderegisteredbyleagueovergambling.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299650_NRL-player-Simona-deregistered-league-gambling_1540247898.html","title":"NRL player Simona deregistered by league over gambling","title_page":"NRL player Simona deregistered by league over gambling | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SYDNEY (AP) - Wests Tigers center Tim Simona has been deregistered by Australia's National Rugby League for a range of gambling-related rule breaches, including betting against his team winning and on opposition players scoring against his club.\nThe NRL said Friday that the 25-year-old Simona also lied when interviewed by the NRL's integrity unit, and didn't pass on jersey auction proceeds to charities.\n\"Based on the evidence we have identified it is very hard to imagine that Tim Simona will be registered with the NRL at any time in the future,\" NRL chief executive Todd Greenberg said in a statement.\nThe NRL, which could have banned Simona for life, did not released specific details of Simona's actions. But text messages sent by Simona indicated he knew his behavior was in breach of the rules, Greenberg said.\n\"At the end of the day, he has deliberately flouted the laws of the game for his own gain and there is no place for him in the NRL.\"\nGreenberg said Simona was remorseful and had been dealing with serious personal issues.\nThe investigation into Simona's actions, which also involves New South Wales state police, led to him last month being suspended from playing and training.\nThe Tigers released a statement later Friday saying the club was confident the Simona saga was not a widespread issue.\n\"As a club we pride ourselves on our standards of behavior and after discussions with the NRL, I'm 100 percent confident that this is isolated to Tim Simona,\" Tigers chief executive Justin Pascoe said.","url":"https://www.dailymail.co.uk/wires/ap/article-4299650/NRL-player-Simona-deregistered-league-gambling.html"}
