{"authors":["Emily Crane For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 20:47:36","date_modify":"2018-10-22 20:47:36","date_publish":"2016-01-28 04:05:33","description":"Former Canterbury Bulldogs player, Jacob Loko, was caught by police with five capsules of MDMA at Sydney's Star City Casino last October and pleaded guilty in court on Thursday.","filename":"data/vaneerConsumption/NRLsJacobLokopleadsguiltyafterbeingcaughtwithfiveMDMAinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6997A00000578-0-image-a-18_1453953912012.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420339_NRL-player-Jacob-Loko-pleads-guilty-caught-five-MDMA-capsules-Sydney-s-Star-Casino_1540241256.html","title":"NRL's Jacob Loko pleads guilty after being caught with five MDMA in Sydney","title_page":"NRL's Jacob Loko pleads guilty after being caught with five MDMA in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rugby league player Jacob Loko has been given an 18-month good behaviour bond after pleading guilty to possessing drugs.\nThe 23-year-old was caught with five capsules of MDMA at Sydney's Star City Casino last October.\nLoko, a former Canterbury Bulldogs player, pleaded guilty to one charge of possessing a drug during a brief appearance at Downing Centre Local Court on Thursday.\nScroll down for video\nJacob Loko, a former Canterbury Bulldogs player, pleaded guilty to one charge of possessing a drug during a brief appearance at Downing Centre Local Court on Thursday\nPolice also arrested and charged another man, 22, at the time with supplying ecstasy.\nThe NRL club also launched an investigation alongside police at the time.\n'Whilst contracted to the club until the end of the month, Loko has been told he would not have his contract renewed for 2016,' they said when he was charged.\nThe 23-year-old was caught with five capsules of MDMA at Sydney's Star City Casino last October\nLoko never played first grade for the Bulldogs and hasn't played in the NRL since he played 23 games for the Parramatta Eels (pictured) in 2013\nLoko last year pleaded guilty to high-range drink driving after returning a blood alcohol reading almost four times the legal limit.\nHe was also banned for four games last March after a drunken brawl Manly's Jorge Taufua outside a Sydney bar. He was fined $10,000 and was given 150 community hours.\nLoko never played first grade for the Bulldogs and hasn't played in the NRL since he played 23 games for the Parramatta Eels in 2013.","url":"https://www.dailymail.co.uk/news/article-3420339/NRL-player-Jacob-Loko-pleads-guilty-caught-five-MDMA-capsules-Sydney-s-Star-Casino.html"}
