{"authors":[],"date_download":"2018-10-23 01:06:25","date_modify":"2018-10-23 01:06:25","date_publish":"2016-03-16 00:00:00","description":"The National Security Agency's deputy director tells NPR he expects \"other shoes to drop\" from ex-contractor Edward Snowden's revelations. But \"things have changed a lot\" since the leaks, he says.","filename":"data/vaneerConsumption/NSAFalloutFromSnowdenLeaksIsntOverButInfoIsGettingOld.json","image_url":"https://media.npr.org/assets/img/2016/03/16/ap_792155643537_wide-180439ca612a62edf01d8fb503a563a31d87ce88.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=470579448_1540256785.html","title":"NSA: Fallout From Snowden Leaks Isn't Over, But Info Is Getting Old","title_page":"NSA: Fallout From Snowden Leaks Isn't Over, But Info Is Getting Old  : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nNearly three years ago, Edward Snowden told the world how the National Security Agency tracked information about Americans' phone calls. Today, the fallout from his revelations continues. That's according to the man who ran the agency's investigation into Snowden, Deputy Director Richard Ledgett. NPR's Mary Louise Kelly went to NSA headquarters to speak with him.\nMARY LOUISE KELLY, BYLINE: You have to clear three checkpoints to enter the NSA's hulking headquarters in Maryland, and once you're deep inside, speaking the name Edward Snowden out loud feels risky. It's half-tempting to go with he who must not be named, the way \"Harry Potter\" wizards avoid saying Voldemort. What Snowden did rocketed the secretive spy agency onto front pages around the world, and it's not over yet, says Richard Ledgett.\nRICHARD LEDGETT: There are still some other shoes to drop, I think. There are things that will probably be released that are designed to cause friction between the United States and other countries.\nKELLY: The good news from the NSA's point of view is these documents are getting old, and technology is changing fast.\nLEDGETT: The date of Mr. Snowden's information cutoff date for when he stole that information and disclosed it was June of - or May of 2013. And so things have changed a lot between now and then. The amount that matters from a technical capability sense has decreased over that time.\nKELLY: The less-good news, says Ledgett, is that since 2013, the NSA has watched as about a thousand of its intelligence targets have, quote, \"taken steps to remove themselves from our visibility.\" Pressed for an example, Ledgett offers this.\nLEDGETT: There was a terrorist group that was actually engaged in operational planning directed against the United States and Western Europe that changed the way they communicated, and - because of those disclosures. And they said they were going to do it, and they did it. And we lost track of them.\nKELLY: Ledgett says this happened a year and a half ago. He would not say which European country. Whether you view Snowden as a traitor or a whistleblower hero, there's no denying he shifted the debate over what the government should be allowed to do in the name of national security. The most significant signpost so far of that shift is legislation that Congress passed last year to replace the post-9/11 Patriot Act. The USA Freedom Act only took full effect at the NSA two weeks ago.\nLEDGETT: Personally, I like the new program.\nKELLY: The new program means phone companies, not the NSA, hold bulk phone records. The agency now has to get a court order to see them. Ledgett acknowledges it costs a little more, and it takes a little longer.\nLEDGETT: I think the speed thing is working itself out. Anytime you have a new process, it takes longer the first few times you do it, and you try - you discover things. And so we've been speeding that up as time goes on.\nKELLY: So you wouldn't go back to the way things were under the Patriot Act?\nLEDGETT: I would not.\nKELLY: You would not.\nLEDGETT: No.\nKELLY: Last month, the agency embarked on a sweeping reorganization dubbed NSA21. Richard Ledgett says it will make the agency more nimble by merging cyber offense and defense teams that used to be separate. Combined with the Freedom Act, it means the colossal spying apparatus known as the National Security Agency is in the throes of great change. Mary Louise Kelly, NPR News, Washington.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=470579448"}
