{"authors":["Australian Associated Press"],"date_download":"2018-10-22 21:21:08","date_modify":"2018-10-22 21:21:08","date_publish":"2017-04-26 01:47:17","description":"A man, 65, has been charged for allegedly filming a young girl's private parts using his mobile phone camera during Anzac Day commemorations in Sydney's Hyde Park.","filename":"data/vaneerConsumption/NSWgirlfilmedafterAnzacDaymarchSydneyHydePark.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B7E3400000578-0-image-a-65_1493167601787.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445930_NSW-girl-filmed-Anzac-Day-march-Sydney-Hyde-Park_1540243268.html","title":"NSW girl 'filmed' after Anzac Day march Sydney Hyde Park","title_page":"NSW girl 'filmed' after Anzac Day march Sydney Hyde Park | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man, 65, has been charged for allegedly filming a young girl's private parts using his mobile phone camera during Anzac Day commemorations.\nA woman became suspicious of the man and alerted patrolling police officers after at commemorations in Sydney's Hyde Park on Tuesday afternoon.\nPolice observed the man allegedly using his mobile phone camera to film a young girl.\nA man, 65, has been charged for allegedly filming a young girl's private parts using his mobile phone camera during Anzac Day commemorations (stock image)\nThe Anzac Day commemoration in Sydney on Tuesday is pictured\nThe man was arrested and taken to Day Street Police Station.\nHe was charged with aggravated filming a person's private parts.\nThe 65-year-old man was refused bail to appear in Central Local Court on Wednesday.\nPeople stand near the Cenotaph during the annual Anzac Day dawn service at Martin Place in Sydney\nPeople gather at the Cenotaph to lay wreaths on Anzac Day in Sydney","url":"https://www.dailymail.co.uk/news/article-4445930/NSW-girl-filmed-Anzac-Day-march-Sydney-Hyde-Park.html"}
