{"authors":["Australian Associated Press"],"date_download":"2018-10-23 00:29:08","date_modify":"2018-10-23 00:29:08","date_publish":"2017-03-10 07:00:10","description":"Jordan Duffy, 20, pleaded guilty to supplying three MDMA capsules to 21-year-old Janie Panton Roberts (pictured) the night before her sudden death in Sydney's inner-west in June last year.","filename":"data/vaneerConsumption/NSWmanJordanDuffyfinedovergirlfriendsMDMAdeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21F7BA00000578-0-image-a-11_1489139867171.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300138_NSW-man-fined-girlfriend-s-MDMA-death_1540254548.html","title":"NSW man Jordan Duffy fined over girlfriend's MDMA death","title_page":"NSW man Jordan Duffy fined over girlfriend's MDMA death | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Sydney man has been fined $800 and placed on a 12-month good behaviour bond for supplying the ecstasy pills believed to have killed his girlfriend.\nJordan Duffy, 20, pleaded guilty to supplying three MDMA capsules to 21-year-old Janie Panton Roberts the night before her sudden death at Marrickville, in Sydney's inner-west, in June last year.\nMs Panton Roberts' mother Kerry, who previously asked for Duffy to be jailed, stormed from the Newtown Local Court before the sentence hearing finished.\nJordan Duffy, 20, (left) was fined $800 and placed on a 12-month good behaviour bond for supplying ecstasy pills believed to have killed his girlfriend Janie Panton Roberts, 21 (right)\nJanie Panton Roberts, 21, died in Duffy's arms the morning after taking three ecstasy pills in June 2016\n'[He's] free to roam the streets, free to go partying, free to get another girlfriend while my baby's rotting in the ground,' Ms Roberts said outside court.\nThe court heard Duffy bought the drugs from a work colleague and consumed them with Ms Roberts at a dance party at the Petersham Inn.\nAfterwards Ms Roberts fell ill.\nThe next morning paramedics were called but tragically she died in Duffy's arms before they arrived.\nMagistrate Margaret Quinn said Duffy was not legally responsible for Ms Roberts' death.\n'The decision to take the drugs was made by both Mr Duffy and Ms Panton Roberts,' Ms Quinn said.\n'[He's] free to roam the streets, free to go partying, free to get another girlfriend while my baby's rotting in the ground,' Kerry Panton Roberts (pictured) said outside court\nMs Panton Roberts (pictured) previously asked for Duffy to be jailed. She stormed from the Newtown Local Court before the sentence hearing finished\nMs Panton Roberts' mother Kerry Roberts, who previously asked for Duffy to be jailed, stormed from the Newtown Local Court before the sentence hearing finished\n'(He's) free to roam the streets, free to go partying, free to get another girlfriend while my baby's rotting in the ground,' Ms Roberts said of Duffy (pictured) outside court\n'The decision to take the drugs was made by both Mr Duffy and Ms Panton Roberts,' Magistrate Margaret Quinn said\nMs Quinn said there was no doubt Duffy had suffered and was very remorseful.\nShe accepted his early guilty plea but recorded a conviction despite his lawyer's plea for a discharge with no record.\n'There is no question that supply [of] drugs has to be acknowledged as a terrible crime that hopefully does not have in the future such terrible consequences for anybody else,' Ms Quinn said.\nShe said she saw many young people in her court who went to dance parties and took drugs and that 'it's only where there are terrible outcomes...[that] the spotlight is shone'.\n'They don't know what the drugs are made from... it's only where there are terrible outcomes... [that] the spotlight is shone,' she said.","url":"https://www.dailymail.co.uk/news/article-4300138/NSW-man-fined-girlfriend-s-MDMA-death.html"}
