{"authors":["John Carney For Daily Mail Australia"],"date_download":"2018-10-22 23:27:47","date_modify":"2018-10-22 23:27:47","date_publish":"2016-01-11 06:00:42","description":"A 33-year-old Liverpool man has been charged with the murder of a two-month-old baby girl who had been admitted to Liverpool Hospital in Sydney with serious head and body injuries.","filename":"data/vaneerConsumption/NSWmanbeenchargedwiththemurderofaLiverpoolbabygirl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/2FF6F4B700000578-0-image-a-16_1452493758314.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393413_A-man-charged-murder-two-month-old-baby-girl-died-suffering-head-body-injuries_1540250867.html","title":"NSW man been charged with the murder of a Liverpool baby girl","title_page":"NSW man been charged with the murder of a Liverpool baby girl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A NSW Police investigation into a child abuse case has seen a man charged with the murder of a baby girl.\nPolice were initially involved when a two-month-old girl was admitted to Liverpool Hospital in Sydney with a number of injuries to her head and body last November.\nAfter detectives from the Child Abuse Squad’s Liverpool office and Liverpool Local Area Command investigated the incident a 33-year-old Liverpool man was arrested.\nThe man was taken to Liverpool Police Station where he was charged with assault occasioning actual bodily harm.\nThe two-month-old girl was admitted to Liverpool Hospital (pictured) in Sydney with a number of injuries to her head and body\nAfter further investigation however, two additional offences were added of causing grievous bodily harm to person with intent, and recklessly cause grievous bodily harm.\nBut following the man’s arrest the young girl tragically died as a result of her injuries. The man, who has been in custody on remand, was then charged with the girl’s murder by detectives.\nHe will appear at Campbelltown Local Court on Wednesday on January 13.\nThe Child Abuse Squad is comprised of detectives who are specially trained to investigate crimes against children, including sexual assault, serious physical abuse and serious cases of neglect.\nAnyone with concerns about suspected child abuse or exploitation should call Crime Stoppers on 1800 333 000.","url":"https://www.dailymail.co.uk/news/article-3393413/A-man-charged-murder-two-month-old-baby-girl-died-suffering-head-body-injuries.html"}
