{"authors":["John Carney For Daily Mail Australia"],"date_download":"2018-10-22 23:09:46","date_modify":"2018-10-22 23:09:46","date_publish":"2016-01-11 04:52:40","description":"Australian police have cracked down on ultra-violent bikie gang Satudarah MC that emerged in the country last year and has already established gang chapters across some states.","filename":"data/vaneerConsumption/NSWpoliceraidnewSatudarahbikiegangfromtheNetherlands.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004C82E00000578-0-image-a-22_1452486162700.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393346_Police-raids-arrests-look-stop-ultra-violent-new-bikie-gang-Satudarah-muscling-Australia-Netherlands_1540249786.html","title":"NSW police raid new Satudarah bikie gang from the Netherlands","title_page":"NSW police raid new Satudarah bikie gang from the Netherlands | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian police have cracked down on a violent new bikie gang that emerged in the country last year and has already established gang chapters in several states.\nFounded in the Netherlands in 1990 in the town of Moordrecht, the ultra-violent Satudarah MC soon became one of the most feared bikie gangs in the world.\nThe gang, which has a reputation for extreme violence, is currently not one of the 10 gangs whose members are subject to strict association restrictions under new anti-bikie laws.\nScroll down for video\nNSW Police raided the Satudarah OMCG clubhouse in Bankstown\nThe Daily Telegraph reports that the bikie club members were initially made up of immigrants or children of immigrants from the former Dutch possession Moluccas, which is now known as Indonesia.\nTheir name comes from the phrase 'satu darah' which is translated as 'one blood', and comes from the Indonesian and Malay languages.\nLast year Satudarah reportedly began recruiting members in Adelaide, Brisbane and New South Wales.\nOn its website it lists having chapters all over the world. In Australia its chapters are listed as being in Sydney, Brisbane, Adelaide and northern New South Wales.\nPolice charged four men and dismantled the Sydney chapter of the outlaw motorcycle gang\nSatudarah were founded in the Netherlands in 1990 in the town of Moordrecht\nMemebers were initially made up of immigrants or children of immigrants from the former Dutch possession Moluccas - now known as Indonesia\nIn response to this, on Tuesday New South Wales police charged four men and dismantled the Sydney chapter of the outlaw motorcycle gang.\nA NSW Police statement said that in February 2015, the Gangs Squad’s Strike Force Raptor became aware of attempts by the Satudarah OMCG to start new chapters in NSW.\nAs part of the investigation, a search warrant was executed at the Satudarah OMCG clubhouse in Bankstown on November 5, where they seized methylamphetamine (Ice), and items related to firearm possession.\nThe club house was shut down at this time and remains closed. After the raid police displayed OMCG colours and paraphernalia, such as a shirt that had ‘Satudarah Australia’ on it.\nA shirt that had ‘Satudarah Australia’ on it and other paraphernalia were found in the club house\nPolice Strike Force Raptor found out Satudarah OMCG were starting new chapters in NSW\nThe name of the bikie club is from the phrase 'satu darah' and is translated as 'one blood'\nThe Adelaide Advertiser reported in August that Australian Crime Commission chief executive Chris Dawson said his organisation was aware of the Satudarah outlaw motorcycle gang and its recent presence in some Australian states'.\n'Outlaw motorcycle gangs are not harmless motorcycle clubs. They are well organised criminal gangs causing harm and disruption across our country,' he said.\n'The crime commission is working closely with its law enforcement and regulatory partners to monitor and collect intelligence on outlaw motorcycle gangs, as well as new and emerging trends.'\nThe Strike Force Raptor officers spring into action in Sydney","url":"https://www.dailymail.co.uk/news/article-3393346/Police-raids-arrests-look-stop-ultra-violent-new-bikie-gang-Satudarah-muscling-Australia-Netherlands.html"}
