{"authors":[],"date_download":"2018-10-23 00:56:15","date_modify":"2018-10-23 00:56:15","date_publish":"2015-05-14 00:00:00","description":"Investigators are sifting through the wreckage trying to determine what caused the deadly accident. The NTSB says the train was traveling more than twice the recommended speed for the area.","filename":"data/vaneerConsumption/NTSBInvestigatorsPlanToInterviewEngineerOfDerailedAmtrakTrain.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=406633724_1540256175.html","title":"NTSB Investigators Plan To Interview Engineer Of Derailed Amtrak Train","title_page":"NTSB Investigators Plan To Interview Engineer Of Derailed Amtrak Train : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nHere's one way to get a measure of how severe the Amtrak train derailment was in Philadelphia Tuesday night - 243 people were on board that train. At least seven were killed, and authorities say more than 200 were injured. That means that only a handful of people walked away from that train untouched, and we're going to hear now what the experience was like. NPR's Nathan Rott has the story.\nNATHAN ROTT, BYLINE: Andrew Brenner was on the last of the seven cars on Amtrak's Northeast Regional number 188. He was heading to New York City for his first day on a new job.\nANDREW BRENNER: You know, I had my phone in my hand. I was reading some papers.\nROTT: He had his shoes off as the train pulled out of 30th Street Station in Philadelphia and picked up speed.\nBRENNER: And clearly, we were going pretty fast entering into a curve. And, you know, you're sort of teetering on that edge of we're OK. And then immediately nope, we're not OK, and this is really bad.\nROTT: Brenner says he was thrown out of his seat and around the car.\nBRENNER: You know, I'm like - you know, I'm a big guy - 5'8\" 250 - and I got tossed like nothing.\nROTT: Brenner was one of nearly 250 people on board. One of the lucky ones, he says. No major injuries, no cuts; remarkable given what the train looked like a day later - twisted and turned, cars crushed and lying on their sides. Investigators were able to recover the train's data recorder from that wreckage early Wednesday. From an initial download of the information, they were able to determine that the engineer applied emergency brakes as the train entered that sharp left curve. Here's Robert Sumwalt of the National Transportation Safety Board.\n(SOUNDBITE OF ARCHIVED RECORDING)\nROBERT SUMWALT: Maximum authorized speed through this curve was 50 miles per hour. When the brake application was applied, the train was traveling at approximately 106 miles per hour.\nROTT: And slowed to only 102 miles per hour by the time the data recording stopped and the train derailed - still more than twice the speed allowed for that curve. The question then is why and how the train was moving so fast. Sumwalt says that they'll get some answers as they continue to pour over the data and when they interview the train's engineer.\n(SOUNDBITE OF ARCHIVED RECORDING)\nSUMWALT: This person has gone through a very traumatic event, and we want to give him an opportunity to convalesce for a day or so before we interview him, but that is certainly a high priority for us.\nROTT: And a mystery for others. In an interview with CNN, Philadelphia Mayor Michael Nutter called the engineer reckless and irresponsible.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMAYOR MICHAEL NUTTER: There can be no reasonable, rational explanation for why you're doing 106 on a 50-mile an hour-rated curve.\nROTT: Passenger Andrew Brenner wasn't as fast to put sole blame on the engineer.\nBRENNER: Regardless of whether it was the engineer's fault or Amtrak's or frankly Congress and the government for how little they fund Amtrak - I mean, it's the year 2015. We should have figured out rail travel by now.\nROTT: Investigators are expected to be on the site for the rest of the week. Nathan Rott, NPR News, Philadelphia.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=406633724"}
