{"authors":[],"date_download":"2018-10-23 05:18:34","date_modify":"2018-10-23 05:18:34","date_publish":"2015-03-23 00:00:00","description":"Arms control experts are sounding upbeat Monday at the Carnegie International Nuclear Policy Conference in Washington, D.C., as a deadline approaches on the Iranian nuclear talks.","filename":"data/vaneerConsumption/NuclearExpertsRemainOptimisticAboutIranianNegotiations.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=394906500_1540271914.html","title":"Nuclear Experts Remain Optimistic About Iranian Negotiations","title_page":"Nuclear Experts Remain Optimistic About Iranian Negotiations : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nThis is now crunch time in negotiations over Iran's nuclear program. The U.S. and other world powers are trying to reach the outlines of a deal by the end of this month. In a moment, what the White House chief of staff had to say about a potential deal. But first, NPR's Michele Kelemen reports that arms control experts attending a major conference in Washington are sounding upbeat.\nMICHELE KELEMEN, BYLINE: The new president of the Carnegie Endowment, Bill Burns opened this year's Nuclear Policy Conference with some words of advice on what a good deal with Iran should look like. He's a former top State Department official whose secret meetings with Iran made these negotiations possible.\n(SOUNDBITE OF ARCHIVED RECORDING)\nBILL BURNS: A good deal will close off all the pathways Iran has to a nuclear weapon, whether it's through uranium or plutonium production. It will sharply constrain Iran's nuclear program for a long duration.\nKELEMEN: And it would lead to phase sanctions relief with what Burns calls snapback provisions if Iran violates the deal. Energy Secretary Ernie Moniz, who's taken center stage in these negotiations, says his department and U.S. labs have studied the Iranian fuel cycle and are providing their expertise.\n(SOUNDBITE OF ARCHIVED RECORDING)\nERNIE MONIZ: The analysis is rigorous and central to the discussions because we need to be very clear about what we are getting in technical dimensions of a possible agreement.\nKELEMEN: One key issue is the so-called breakout time - how long it would take for Iran to acquire enough fissile material for one nuclear bomb. Former CIA chief Michael Hayden writes in The Washington Post today that one year is not enough to detect violations and prevent Iran from building a bomb. But experts at the Carnegie Nuclear Policy Conference argue otherwise. Here's Mark Fitzpatrick of the International Institute for Strategic Studies.\nMARK FITZPATRICK: I mean, what can you do in two years that you can't do in one year? You have to detect the breakout, which will happen very quickly. You have to confirm the breakout, which could take a few more weeks. You have to, you know, apply some diplomacy to try to solve it peacefully. And then applying military options can be done overnight. So, yes, I think one year is enough.\nKELEMEN: During a coffee break, Fitzpatrick sounded confident in the ability of the International Atomic Energy Agency to monitor any deal.\nFITZPATRICK: Upbeat about the ability to verify measures, upbeat about the measures that are coming into play, but a little concerned about what the Congress might do that could disrupt diplomacy.\nKELEMEN: Forty-seven Republican senators have already warned Iran in an open letter that any deal might not last beyond the Obama administration. Daryl Kimball, the executive director of the Arms Control Association, says critics need to think about the alternatives.\nDARYL KIMBALL: And we're going to be in a far worse situation if we don't have this agreement in place. We want to have enhanced inspections. Iran is going to be able to break out and produce fissile material for a weapon within weeks, not a year. And the chance of escalation and a conflict - a military conflict will grow exponentially.\nKELEMEN: Kimball says some in Congress want a legitimate oversight role to ensure that the deal is strict enough and sanctions aren't eased to quickly. Some just want to be spoilers, and that worries Joe Cirincione, president of the Ploughshares Fund, which works to reduce nuclear weapons.\nJOE CIRINCIONE: President Obama's political opponents try to block everything he does. But I think the center of the American security establishment is solidly behind the deal as it's been outlined.\nKELEMEN: And he thinks it's close.\nCIRINCIONE: It looks like all sides have agreed to buy the house, and we're just negotiating the closing costs.\nKELEMEN: Michele Kelemen, NPR News, Washington.\n[Editorâs note on May 20, 2016: This report should have stated that Ploughshares Fund is a supporter of NPRâs coverage of nonproliferation and national security issues.]\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=394906500"}
oped with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/03/23/394906500/nuclear-experts-remain-optimistic-about-iranian-negotiations"}
