{"authors":[],"date_download":"2018-10-22 22:31:17","date_modify":"2018-10-22 22:31:17","date_publish":"2014-05-02 12:51:56","description":"“Mr Modi himself is a very controversial figure in Pakistan at all levels,” said Farahnaz Ispahani, a Pakistani politician.","filename":"data/vaneerConsumption/NuclearNeighborsPakistanNervousAboutIndiasLikelyNewLeader.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/413176/140501-pakistan-india-cover1_f14b774d6e9cc3ee470531760767692f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_nuclear-neighbors-pakistan-nervous-about-indias-likely-new-leader-n94431_1540247477.html","title":"Nuclear Neighbors: Pakistan Nervous About India's Likely New Leader","title_page":"Nuclear Neighbors: Pakistan Nervous About India's Likely New Leader","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Islamic Republic of Pakistan is nervously watching as its huge neighbor and fellow nuclear power India gets set to elect a party feared to harbor virulently anti-Muslim views.\nThe Hindu nationalist Bharatiya Janata Party (BJP) and its leader Narendra Modi are widely expected to win when the results of the six-week election that ends on Monday are announced.\nThe fear is that the BJP will take an anti-Islamic turn both within India -- the country has a Muslim population of some 176 million -- and towards its northern neighbor, according to Pakistani politician Farahnaz Ispahani.\n\"He has never come out directly and said this was a tragedy of massive proportions and that the Muslims of Gujurat deserve an apology.\"\n\"It is very clear that if there is another attack like the one on Mumbai, we cannot expect restraint from someone like Narendra Modi,” Ispahani said, referring to the 2008 terrorist strike led by 10 Pakistani men that killed more than 160. The incident heightened tensions between the two countries, with some in India saying the attackers had counted on the support of officials in Pakistan's security services.\nEarlier, a 2001 attack on the Indian parliament that left a dozen dead, which New Delhi blamed on Pakistani militants, almost brought the two nations to the brink of war.","url":"https://www.nbcnews.com/news/world/nuclear-neighbors-pakistan-nervous-about-indias-likely-new-leader-n94431"}
