{"authors":[],"date_download":"2018-10-30 01:22:03","date_modify":"2018-10-30 01:22:03","date_publish":"2015-04-04 00:00:00","description":null,"filename":"data/vaneerConsumption/NuclearBreakoutbyIranandNorthKorea.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_04_nuclear_breakout_by_iran_and_north_korea_1540862523.html","title":"Nuclear Breakout by Iran and North Korea","title_page":"Nuclear Breakout by Iran and North Korea","title_rss":"NULL","source_domain":"americanthinker.com","text":"… we are now facing the unfolding disaster that Obama has wrought. … the US has just given the Iranians a green light to behave as if they have already built their nuclear umbrella. … [T]he US and its partners have just removed all significant obstacles from their path to nuclear capabilities. The Iranians know it. Their proxies know it. Their enemies know it.\n… The surrounding Arab states led by Saudi Arabia are pursuing nuclear weapons.\nDon’t look now, but North Korea is a nuclear power today, with missiles able to strike Japan, and soon Hawaii and California.\nThe Norks got a free pass, because Bill Clinton’s SecState, Madeleine Albright, faked an agreement with Kim Jong-il in 2000, supposedly to stop uranium enrichment and missile development.\nThen the Norks violated it, as everybody knew they would. Today North Korea has nuclear bombs and missiles.\nNaturally, the media celebrated Albright’s “accord” with Kim Jong-il, and said nothing about the North Korean breakout.\nObama is playing the same sucker game in collusion with the mullahs, and the biggest betrayal is against us – against Americans who want our nation and the world to survive. Obama is copying Clinton’s kabuki script, kicking that nuclear can down the road, so that ultimately Republicans will have to deal with it. Then the Democrats will scapegoat the Republicans when they try to deal with the fallout. Bill Clinton had eight years to stop al-Qaeda before 9/11/01, but the media blamed George W. Bush.\nBut the biggest victims of Obama’s surrender are our former allies. America’s nuclear shield protected the world from 1949 on, when Stalin exploded his first bomb. Today, in response to the North Korean threat, Japan is rearming for the first time since World War II. They don’t say if they are building nukes, but the North Koreans won’t take them seriously if they don’t.\nObama just pulled the same stunt with Iran.\nSaudi Arabia and Egypt will now feel forced to get their own nuclear weapons – because we’ve left them exposed to Iran’s nuclear jihad. Israel will cooperate with the Saudis and Egyptians because they face the same enemy.\nObama had a six-year window to stop Iran, using the same strategy that worked against Saddam: a trade embargo and a no-fly zone to render his air force useless. Obama and Val Jarrett wasted six years in secret talks with the mullahs, while lying hundreds of times that “Iran will never get nuclear weapons.”\nUntil the mullahs were past the point of no return.\nThe current agreement is therefore a pure sucker play. It’s for the media only, since the facts are irreversible.\nObama has sacrificed the safety of our former allies, Israel, Saudi Arabia, Egypt, and the rest. They are arming up as fast as possible.\nAmerica’s nuclear umbrella, which kept the peace between the big powers since 1949 – six decades – is now in tatters. Nobody trusts us anymore, and there is no reason they should.\nThe duplicitous U.S. media will celebrate Obama’s surrender as a great victory.\nA new nuclear arms race has already started in the Middle East. It’s anybody’s guess whether ultimately ISIS or al-Qaeda will end up with nukes. The Iranians are just as bad as ISIS, and they are so confident of their path to nuclear weapons that they are sending conventional forces into Syria, Iraq, and Yemen.\nWhen you have nukes, you don’t have to use them. All you have to do is threaten. Your home territory has become invulnerable, and you can just knock off any opposition by conventional means. That’s what Iran is now doing in Yemen, right next to Saudi Arabia, and with the ability to throttle the entrance to the Red Sea.\nIn effect, the United States has given up the effort to prevent nuclear breakout. Armageddon cults like the mullahs now have their weapon of choice.\nObama did not have to do this. He wanted to.\nChances are that he sees this farce as his chance to run for U.N. secretary general. His own glorious future will be bought by the proceeds of surrender.\nNorth Korea is already selling weapons technology to other rogues, including Iran. Iranian officers have been spotted observing nuclear bomb experiments in North Korea. Future rogues no longer have to build their own super-bombs. They can simply import them, which narrows the warning window to months rather than years.\nAll the nations threatened by Iran and North Korea understand these facts.\nHere are some of the consequences.\nThreatened nations will get their own nuclear weapons and delivery vehicles as soon as possible. Pakistan is thought to be the source for Saudi nukes, and the Saudis may simply provide them to Egypt, which has the manpower to protect the vast deserts of Arabia. The Iranians have just taken over the strategic chokepoint of Yemen, and while Arab powers are attacking, they will need boots on the ground to reconquer that territory.\nRogue powers can now attack. Without an American nuclear umbrella, Eastern Europe and the Baltic nations are directly threatened by Putin, who now has nothing to fear. In the Middle East, Iranian troops are already on the march, with the ultimate aim of conquering Mecca and Medina and overthrowing the Saudis, destroying Israel, and killing off the infidels unless they surrender.\nFor three centuries, since the Treaty of Westphalia of 1648, nation-states have controlled territories and societies, guaranteeing safety for their citizens against foreign attack. Today, territory is no longer the name of the game, since rogue states can launch nukes with ICBMs that can reach anywhere in the world. Bulgarian hackers can make Denial of Service attacks against American websites. Borders and territory may lose much of their meaning.\nAnti-missile defenses will improve, but it will be years before defensive technology catches up with nuclear offense.\nThe temptation for pre-emptive strikes with cyber weapons or EMPs is therefore rising fast.\nThe biotechnology revolution is making many new powerful and hard-to-trace molecules that can be used in silent warfare. For example, the MAO-A gene , called “the warrior gene,” produces a protein that directly affects aggressiveness. Molecules can be designed to increase or decrease the expression of MAO-A. Hundreds of other molecules could be used.\nWhile chemical weapons have been prohibited for decades, as soon as decision-makers are forced to decide between total war and insidious molecular weapons, they may well choose molecules. In Syria, Assad has been using chlorine bombs to suffocate and kill civilians. The taboo against these weapons has already been breached. Less murderous but more insidious molecules are now possible.\nWith the breakdown of privacy protections with Web 3.0, there are degrees of warfare that never existed before.\nThe future looks much more unstable. It is the price of Obama’s blind pursuit of personal glory.","url":"https://www.americanthinker.com/articles/2015/04/nuclear_breakout_by_iran_and_north_korea.html"}
