{"authors":["Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 05:51:39","date_modify":"2018-10-23 05:51:39","date_publish":"2017-04-26 17:11:32","description":"Federal authorities are participating in a four-day nuclear attack drill at MetLife stadium in New Jersey.","filename":"data/vaneerConsumption/NuclearattackdrillsheldoutsideofManhattan.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/17/3FA08C8700000578-0-image-a-62_1493222820440.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448128_Nuclear-attack-drills-held-outside-Manhattan_1540273899.html","title":"Nuclear attack drills held outside of Manhattan","title_page":"Nuclear attack drills held outside of Manhattan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As Kim Jong-Un showed off North Korea's military might in a live-artillery drill on Tuesday, federal authorities just outside of New York City were testing their response to a nuclear attack.\nThe drill - called 'Operation Gotham Shield' - practices how federal agencies, local emergency management teams and medics would respond to the hypothetical situation of a 10-kiloton nuclear bomb exploding on the New Jersey side of the Lincoln tunnel.\nOn Tuesday, the second day of the four-day drill, emergency officials gathered at MetLife Stadium in East Rutherford, New Jersey - which would be used as a decontamination and casualty center in such an incident.\nScroll down for video\nFederal and local authorities are holding a four-day drill to practice how to respond to a nuclear attack. Above, ambulances participating in the drill on Tuesday at New Jersey's MetLife stadium\nThe drill - named Operation Gotham Shield - tests how emergency workers would deal with a 10-kiloton bomb being detonated on the New Jersey side of the Lincoln Tunnel\nMetLife stadium would be used as a decontamination and casualty center in the event of such an attack\nAbove, a mobile emergency room is set up during the drill on Tuesday in East Rutherford, New Jersey\nThe drills have been in the works for months, and are also taking place in Washington, DC and Albany, New York\nMedics from Hackensack University Medical Center and about 30 mass care response units participated in the drill, setting up mobile emergency rooms and running through how they would process contaminated patients.\nThe drill was 'notional' - meaning no actors were hired to play sick patients for the exercise.\nMorris County, New Jersey Office of Emergency Management Director Jeffrey Paul explained the drill in a post on Facebook on Tuesday.\nOfficials say the timing of the drills has nothing to do with rising tensions with North Korea\nMedics from Hackensack University Medical Center and about 30 mass care response units participated in the drill, setting up mobile emergency rooms and running through how they would process contaminated patients\nNorth Hudson Regional Fire and Rescue Chief Frank Montagne told NJ.com: 'It's important to see our capabilities and see how far our operations go. We are hopeful that it will never happen, but we have to be prepared.'\nAbove, a look inside a mass casualty ambulance which has room enough for several patients\n'Our challenge today involved arriving at MetLife Stadium, where thousands of people were assembled and (acting) in need of care,' Paul said. 'Our mission was to assess, treat, and evacuate casualties to hospitals and facilities away from the impact site. The training exercise did not involve any real patients. However, we were challenged to exercise our plans, procedures, and equipment to simulate our actions throughout the expanded scenario.'\nNorth Hudson Regional Fire and Rescue Chief Frank Montagne told NJ.com: 'It's important to see our capabilities and see how far our operations go. We are hopeful that it will never happen, but we have to be prepared.'\nThe drill is one of several happening along the eastern seaboard this week, including ones in Washington, DC and Albany, New York.\nConspiracy theorists have been discussing the drill as as 'false flag' operation - masking an impending attack orchestrated by the government.\nA 'false flag' operation is something disguised to look like it was carried out by one group, when it was carried out by another group entirely. For example, some conspiracy theorists believe that the 9/11 attacks were carried out by the U.S. government and pinned on al Qaeda.\nConspiracy theorists also pointed out that similar drills happened just before the 9/11 attacks as well.\nOthers were suspicious about the timing of the drills, which are taking place as tensions continue to rise with North Korea.\nConspiracy theorists have painted the drills as a 'false flag' operation - pointing out that similar drills happened just before the 9/11 attacks as well\nBut officials have said that the drills have been in the works for months and are not in response to any specific threat.\n'Every year we plan a full-scale exercise where we have to pick different scenarios,' NJ State Police Public Information Officer Connolly told the Daily Record. 'There are only so many hurricanes we can do. We have to pick scenarios based on location and the demographics based on the risk of the area.'\nThe drills will continue through Thursday.","url":"https://www.dailymail.co.uk/news/article-4448128/Nuclear-attack-drills-held-outside-Manhattan.html"}
