{"authors":[],"date_download":"2018-10-30 01:05:22","date_modify":"2018-10-30 01:05:22","date_publish":"2015-09-21 00:00:00","description":null,"filename":"data/vaneerConsumption/NuclearfalloutfromthelastRepublicandebate.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_09_nuclear_fallout_from_the_last_republican_debate_1540861522.html","title":"Nuclear fallout from the last Republican debate","title_page":"Nuclear fallout from the last Republican debate","title_rss":"NULL","source_domain":"americanthinker.com","text":"Nuclear fallout from the last Republican debate\nMist from a hypothetical mushroom cloud wafted into the Reagan Library during the second presidential debate. CNN host and interrogator Jake Tapper detonated the 100-megaton question: do the candidates feel comfortable if Donald Trump has his finger on the nuclear codes? The purpose of the question was to evoke the memory of the successful TV ad directed against conservative Barry Goldwater in the 1964 presidential contest. The slickly produced ad featured a little girl picking daisies. She hears a countdown, followed by a nuclear explosion: The ad is considered the most effective, and the most distasteful and dastardly, promotion against a political candidate in American political history. The ad did succeed in smearing Goldwater, depicting him as a war-monger, leading to the election of liberal Democrat Lyndon Johnson, the originator of the Great Society.\nObviously, Tapper's question was designed to stain frontrunner Donald Trump as a modern-day trigger-happy Goldwater, with the secondary target being the ten other candidates. The comparison is a disingenuous cliché, consistent with Democratic Party tactics to discredit the Republican opposition by aping KGB \"active measures\" propaganda against anti-Soviet leaders in the U.S., the \"main adversary.\" Additionally, bringing up the ultimate weapon that endangers the existence of life on Earth was inaccurate and meaningless. In 1964, the issue was U.S.-Soviet superpower confrontation. Today, in the aftermath of the collapse of the USSR, the analogy rings hollow. While fears of rogue states and splinter groups using a nuclear weapon certainly are valid, it is unlikely that the Earth is in danger. If the North Koreans send a missile our way, the U.S. can probably shoot it down and annihilate the perpetrators. Same for Iran, should they develop nuclear weapons to attack Israel. Mutually Assured Destruction, the watchword of the Cold War, is not even remotely possible, thus indirect reference to the anti-Goldwater ad today is meretricious and tawdry. By using nuclear scare-mongering tactics today – to frighten voters to the effect that Trump or Bush or the rest are to be feared – is a desperate salvo from a political party on the edge of irrelevance. I wonder what bully-boy Putin, the leaders of China and Iran, or even the inchoate terrorists from ISIS on down are thinking after hearing the candidates not back off the nuclear question. Perhaps there will be a new sheriff in town – a Republican in the White House.","url":"https://www.americanthinker.com/blog/2015/09/nuclear_fallout_from_the_last_republican_debate.html"}
