{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:37:26","date_modify":"2018-10-30 20:37:26","date_publish":"2016-02-04 05:22:51","description":"A news report is saying that the real number of U.S. ground troops in Iraq is about 800 over the 3,650 figure often cited by Obama administration officials.","filename":"data/vaneerConsumption/NumberofUSTroopsinIraqSeveralHundredoverOfficialFigure.json","image_url":"https://media.breitbart.com/media/2015/02/US-troops-Iraq-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_03__1540931846.html","title":"Number of U.S. Troops in Iraq ‘Several Hundred’ over Official Figure","title_page":"Colonel: Number of U.S. Troops in Iraq ‘Several Hundred’ over Official Figure","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — A spokesperson for the U.S.-led coalition against the Islamic State (ISIS/ISIL) told reporters that he did not dispute a news report saying that the real number of American troops serving on the ground in Iraq is about 800 over the 3,650 figure often cited by Obama administration officials.\nThe news report was published by The Daily Beast.\nU.S. Col. Steve Warren, the spokesman for the anti-ISIS coalition, was questioned about it on Wednesday during a press briefing at the Pentagon.\nWarren did not provide a specific figure for the number of American boots on the ground in Iraq, claiming that overlap created by the rotation of service members in and out of the country is responsible for the overage.\n“In the war against the self-proclaimed Islamic State, there are two ways to count the number of U.S. boots on the ground,” reports the The Daily Beast. “There’s the one that officials admit to. Then there’s the ground truth.”\n“Officially, there are now 3,650 U.S. troops in Iraq, there primarily to help train the Iraqi national army,” it continues. “But in reality, there are already about 4,450 U.S. troops in Iraq… In other words, the total number of forces that Pentagon and Obama administration officials frequently cite in public are wrong.”\nThe Daily Beast points out that the official figure, which is often rounded up to 3,700 by U.S. officials, is short about 800 troops, when compared to the real number of boots on the ground in Iraq.\n“Just to remind everybody, we have 3,700 boots on the ground in Iraq today, and we’re looking to do more,” Secretary of Defense Ashton Carter said on Tuesday.\nCol. Warren said that he believed the cap for U.S. military forces in Iraq is 3,870.\nHowever, he added that it is “fair to say” that there are several hundred more American boots on the ground in Iraq on a day-to-day basis than the cap allows for.\nA reporter asked the spokesman, “What is the actual number, keeping in mind I know that there are some who come and go and whatnot, but what is the actual number of U.S. troops in Iraq right now?”\n“So you’re right… 3,870, I think, is the actual cap for forces assigned here,” the colonel replied. “There are other forces, me for example, who come in on a temporary duty status. That’s a low number.”\n“I don’t think we’re going to dispute what was in The Daily Beast article, but I just don’t have those numbers here,” he added.\nPresident Obama launched the war against ISIS in Iraq, vowing not to place American boots on the ground.\nHowever, the actual number or U.S. service members on the ground shows that the American military footprint is larger than Obama administration officials have admitted and is growing.\n“Only after the number of troops reached the thousands did the administration acknowledge that boots were on the ground, but officials stressed they were not engaged in combat,” notes The Daily Beast. “Then, when Master Sgt. Joshua Wheeler was killed in a firefight last fall, officials said there were instances where troops would be in combat, but they still weren’t engaged in a combat mission.”\n“But it’s become increasingly difficult to keep up that appearance. Last year, U.S. forces assisted as the Iraqi military and an elite counterterrorism unit took back the city of Ramadi from ISIS control,” it adds. “And now, they are eyeing a much larger and more complicated effort to retake the city of Mosul, which ISIS conquered in the summer of 2014.”\nCiting DOD statistics, The Daily Beast also revealed that 6,850 contractors, including 1,100 U.S. citizens, are supporting the American government’s operations in Iraq. The majority of them work for the Department of State.\nThe Daily Beast learned from U.S. Central Command, which is in charge of the military efforts against ISIS, that more than 1,400 contractors are supporting Pentagon operations in Iraq, a nearly six-fold increase from the end of 2014.\nWhen accounting for the 1,100 U.S. citizens working as contractors in Iraq, the real number of Americans involved in the war reaches an estimated 6,000.\nOfficially, there are now 9,800 U.S. troops in Afghanistan, but once specialized and support forces are added to that number, it grows to 12,300, notes the report, citing Pentagon statistics.\nThe Obama administration also refuses to admit it is engaged in combat in Afghanistan, where there are another 10,347 U.S. contractors.","url":"https://www.breitbart.com/politics/2016/02/03/u-s-colonel-real-number-of-american-troops-in-iraq-several-hundreds-over-figure-often-cited-by-obama-administration/"}
