{"authors":["Michael R. Wickline"],"date_download":"2018-10-30 18:36:02","date_modify":"2018-10-30 18:36:02","date_publish":"2017-03-07 00:00:00","description":"The number of state employees whose salaries are at least $100,000 increased by 211 this fiscal year to 2,933 — the largest growth in their ranks in almost a decade.","filename":"data/vaneerConsumption/Numberofstateemployeeswhomakeatleast100000increasestomorethan2900SEARCHLIST.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/07/resized_250499-6cbielema39pbwclr_24-22705_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_19_state-six-figure-salary-list-211__page=2_1540924562.html","title":"Number of state employees who make at least $100,000 increases to more than 2,900 | SEARCH LIST","title_page":"Number of state employees who make at least $100,000 increases to more than 2,900 | SEARCH LIST","title_rss":"NULL","source_domain":"arkansasonline.com","text":"University of Arkansas head football coach Bret Bielema speaks with members of the media on Wednesday, Feb. 1, 2017, inside the Fred W. Smith Center in Fayetteville on the results from National Signing Day. - Photo by David Gottschalk\nThe number of state employees whose salaries are at least $100,000 increased by 211 this fiscal year to 2,933 — the largest growth in their ranks in almost a decade.\nPhoto by Arkansas Democrat-Gazette\nSalaries of top elected officials\nPhoto by Arkansas Democrat-Gazette\nA chart showing the growth in the number of state employees with at least six-figure salaries\nDuring the previous seven fiscal years, such growth ranged from 119 in fiscal 2015 to 164 in fiscal 2011.\nAbout this story Since 2003, the Arkansas Democrat-Gazette has surveyed state agencies and higher-education institutions for information about nonelected employees who make at least $100,000 a year. The surveys initially were done in years of regular legislative sessions and became annual in 2010 when the Legislature began meeting in fiscal sessions. The salary information was obtained in mid-fiscal 2017 under the state Freedom of Information Act by reporter Michael R. Wickline. Brian Fanney, another reporter, placed it in a spreadsheet and helped with verification. The information was updated when the staff learned of position changes but may not reflect all changes.\nMost of the increase in the current fiscal 2017 occurred at the University of Arkansas for Medical Sciences, where the ranks increased by 146 to 1,400. Previously, UAMS’ growth has ranged from 28 in fiscal 2015 to 80 in fiscal 2011.\n“The majority of our growth this year has been in patient care, and this has required us to hire several new physicians and other higher-paid professionals. None of our expansion has involved increased state funding. In fact, our patient care revenue underwrites education and research,” said Leslie Taylor, chief spokesman for UAMS.\n[DATABASE: Search salaries of Arkansas state workers]\nThe number of workers whose salaries are at least $100,000 at two-year and four-year colleges — other than at UAMS — increased by 65 to 1,148 this fiscal year, while the number of six-figure state employees who work at non-higher-education institutions remained flat at 385.\nThese figures are based on the Arkansas Democrat-Gazette’s collection earlier this fiscal year of salary information from more than three dozen repositories of state employee data.\nStarting in 2003, the newspaper began collecting six-figure salary information in concert with regular legislative sessions, which were held in odd-numbered years. In 2010, the data collection became annual when the Legislature began fiscal sessions in even-numbered years.\nThe highest-paid state employee continues to be Bret Bielema, whose salary is $4.1 million a year as the head football coach at the University of Arkansas, Fayetteville. The second-highest-paid state employee is Mike Anderson, whose salary is $2.45 million a year as the head men’s basketball coach at UA-Fayetteville.\n[DATABASE: Search salaries of college/university employees who make $100,000 or more ]\nBielema’s and Anderson’s boss, Athletic Director Jeff Long, makes about $1 million a year. UA Chancellor Joseph Steinmetz is paid $450,000 a year.\nFunding for the 2,933 highest-earning employees comes from a variety of state, federal and private sources, including tuition and fees, hospital billings, athletic department revenue and taxes.\nSen. Larry Teague, a co-chairman of the Legislature’s Joint Budget Committee, said he doesn’t “worry so much” about the growth in UAMS’ $100,000-plus salaried employees because “a lot of those are superstar doctors or whatever, and we need to keep them there.”\n“By far, the bulk of the money they get comes from their practices,” said Teague, a Democrat from Nashville.\nRep. Lane Jean, who is the other co-chairman of the Joint Budget Committee, said he has “some concerns” about UAMS’ 146-employee increase in the six-figure salary ranks.\n“But I mean health care costs in general is a concern throughout this state and the nation. We’ve got to do something to curb it,” said Jean, a Republican from Magnolia.\nJean said the increased number of employees at two-year and four-year colleges largely reflects enrollment growth.\n“Since the other institutions have basically been held flat [in state general revenue funds] for years, they are raising their fees on campus and if they are raising their fees too high, you would think their enrollment would start dropping,” he said. “If the board of directors OKs a fee increase on tuition and activity fees and … if they can continue to operate that way and the schools are OK with it and their enrollment is still healthy, that doesn’t concern me as much as what is happening at UAMS financially.”\nGov. Asa Hutchinson said the colleges and universities have historically maintained a level of independence in Arkansas.\n“Higher education does not have a direct report requirement, so I am unable to exercise the same level of control as I do over other state agencies. Whether there should be greater executive control of higher education is a matter for the legislature to determine,” the Republican governor said in a written statement.\nHutchinson said, “My role in controlling the salary level and number of employees of the state agencies that report directly to me is a function of our hiring freeze,” under which his approval is required for state agencies that he controls to fill vacant positions.\n“The hiring freeze gives my office the ability to review employment decisions and manage the number of state employees as well as their salary levels,” he said.\nWhile the governor doesn’t have direct control of higher-education institutions, he appoints trustees to the universities’ governing boards when terms expire or trustees leave before their terms end. The Legislature and governor set maximum-authorized salaries for state employees through laws, and they grant some agencies the authority to exceed the limits under certain circumstances.\nLast month, Hutchinson signed legislation for the Arkansas Higher Education Coordinating Board to implement a funding formula for two-year and four-year colleges that is based on student success rather than enrollment.\nHe pledged to seek $10 million more in general revenue for public colleges and universities in fiscal 2019, which starts July 1, 2018, “in order to encourage the change in behavior and the change in priorities and reward those that have success.” He has recommended no increase in their $733.5 million general revenue budget in fiscal 2018, which starts July 1.\nUAMS\nThe 146-employee increase in UAMS reflects the growth of its programs that required hiring more faculty and staffing, Taylor said.\nAmong other things, “this fiscal year, we opened new primary care and orthopedic clinics in central Arkansas. We opened a new Internal Medicine Clinic at our Northwest Regional Campus, and we expanded our services for the Marshallese at the Center for Pacific Islander Health,” she said.\n“We opened new family medical centers in Magnolia and Texarkana. And, we are in the process of opening a new primary care clinic at our regional campus in Helena. We continue to work with other hospitals around the state to open new physician residency programs. We also have expanded our affiliation with Baptist Health,” Taylor said.\nThe total number of employees at UAMS increased from 10,943 in fiscal 2016 to 11,134 this fiscal year, she said.\n“We did not grant cost-of-living raises to staff this current year and have not made a decision on [fiscal] 2018. We did give market adjustments to faculty and in some other areas as needed,” Taylor said in an email.\nUAMS’ highest-paid employee is Michiaki Imamura, head of pediatric cardiovascular surgery at Arkansas Children’s Hospital and a professor at UAMS. His salary is $1.072 million this fiscal year.\nUAMS’ second-highest-paid employee is C. Lowry Barnes, chairman of the department of orthopaedic surgery in the College of Medicine and director of the musculoskeletal service line for the clinical enterprise. His salary is $1.031 million this fiscal year.\nUAMS’ budget in fiscal 2017 totals $1.485 billion — up from $1.363 billion in fiscal 2016 — according to Taylor. Patient service revenue at UAMS comprises most of its budget, totaling $1.198 billion in the current fiscal year, while grants and contracts total $119.5 million in the current fiscal year, Taylor said.\nTaylor said UAMS’ other major funding sources in fiscal 2017 include $43.8 million in tuition and fees; $42.7 million in a net state appropriation, after deducting $69.1 million to match federal Medicaid funds out of its state appropriation of $111.8 million; $35.1 million in gifts and auxiliary services such as parking and dining services; and $33.4 million in educational sales and services.\nTaylor said continuing Arkansas’ version of Medicaid expansion is extremely important to UAMS.\nArkansas’ Medicaid expansion covers more than 300,000 low-income Arkansans. The state is paying 5 percent of the cost of the program this year, and its share will gradually increase to 10 percent by 2020 under existing federal law.\n“If that program in its current form were to go away completely without replacement, our most recent estimate is that we would have a $65 million reduction in revenue. However, depending on policy changes at the state and federal level that could change,” Taylor said.\nAsked about the potential impact on UAMS of the U.S. House Republican leaders’ proposal to repeal and replace the federal Patient Protection and Affordable Care Act, she said, “Since the [American Health Care Act] is a work in progress we have not done extensive estimates of its impact.\n“If it were to go forward as is, which seems very unlikely, the projected increase of 14 million uninsured nationally in 2018, which is projected to increase to 24 million by 2026, and the overall decrease in federal support of Medicaid estimated to be $880 billion would certainly have a large negative financial impact in Arkansas and on our already very stressed financial model at UAMS,” she said.\nSTATE AGENCIES\nThose who make at least $100,000 a year and work at state agencies beyond higher-education institutions remained at 385 this fiscal year — the same level as last fiscal year.\nDepartment of Human Services Director Cindy Gillespie, a former aide to then-Massachusetts Gov. Mitt Romney, is the highest-paid at $280,000 a year.\nEducation Commissioner Johnny Key, a former Republican state senator from Mountain Home and associate vice president for university relations at the UA system, is the second-highest-paid. His salary is $233,489.\nNathaniel Smith, director of the state Department of Health, is the third-highest-paid at $219,779.\nThe average salary in the state’s accounting system is now $39,850, and was $39,931 a year at the end of fiscal 2016 on June 30, said Jake Bleed, a spokesman for the state Department of Finance and Administration. The employees in the Arkansas Administrative Statewide Information System largely don’t work at higher-education institutions.\nThese employees aren’t getting a cost-of-living raise this fiscal year.\n“We have not yet determined whether employees will receive merit raises this fiscal year,” Bleed said.\nSo far in fiscal 2017, general revenue collections have lagged behind the forecast, but officials haven’t cut the forecast or budgets.\nHutchinson has proposed a general revenue budget of $5.48 billion in fiscal 2018 for the Legislature to consider in the current session. The budget is a $153 million increase over the current budget with most of the increase targeted for the state Department of Human Services. The Legislature’s Joint Budget Committee will soon consider changes to the governor’s proposed budget. Legislative leaders hope to end the legislative session by March 31, which would be the 82th day of the regular session.\nThe Legislature already has passed Hutchinson’s income tax cut for Arkansans who make less than $21,000 in taxable income, starting Jan. 1, 2019, which is projected to reduce general revenue by $25 million in fiscal 2019 and $50 million in fiscal 2020. The 2015 Legislature passed Hutchinson’s cut in individual income taxes for Arkansans with taxable incomes between $21,000 and $75,000, which is projected to reduce revenue by $100 million this fiscal year.\nThe Legislature and Hutchinson already have enacted legislation to overhaul the state’s pay plan in fiscal 2018. The plan will cover about 25,000 full-time workers, who mostly work at agencies other than higher-education institutions. Officials project that it will cost about $57 million to implement.\nAbout 54 percent of full-time employees will get raises of more than 1 percent each so that their pay will reach the new minimum salaries for their positions, and the rest will get 1 percent raises, according to the state’s personnel administrator, Kay Barnhill. The current pay plan was adopted in 2009, and the labor market has changed dramatically since then, she said.\nSome of the larger raises will be in entry-level positions. The plan overhaul will benefit workers such as family-service workers, program eligibility specialists, registered nurses, residential-care assistants, correctional officers and state troopers, according to state records.\nExecutives at the state’s colleges and universities decide whether to grant raises for their own employees based on available funds.\nThe annual salary for full-time employees at institutions of higher education, not including UAMS, was $51,385 in the fall of 2016 — compared with $50,221 in the fall of 2015 — according to Tara Smith, deputy director at the state Department of Higher Education.\nThe state’s employee salaries totaled $3.039 billion in fiscal 2016 — a decrease from $3.058 billion in the previous fiscal year, Bleed said. He said he doesn’t have an estimate on projected total payroll costs for this fiscal year.\nThe total number of full-time state employees increased from 56,933 at the end of fiscal 2015 to 59,929 at the end of fiscal 2016. The number of higher-education employees increased from 25,129 to 28,419, while those at other state agencies declined from 31,804 to 31,510, he said. However, the increase in higher-education employee numbers is mostly because of a 2015 change in reporting requirements, state officials said.","url":"https://www.arkansasonline.com/news/2017/mar/19/state-six-figure-salary-list-211/?page=2"}
