{"authors":["Steve Doughty","Social Affairs Correspondent For The Daily Mail"],"date_download":"2018-10-22 22:15:01","date_modify":"2018-10-22 22:15:01","date_publish":"2017-03-10 00:25:07","description":"Self-employed workers take only two thirds of the time off taken by full-time employees, according to the estimates published by the Office for National Statistics.","filename":"data/vaneerConsumption/Numberofdaystakenoffsickdropstoanalltimelow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EFDFF00000578-0-image-a-14_1489105483039.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299538_Number-days-taken-sick-drops-time-low_1540246501.html","title":"Number of days taken off sick drops to an all-time low","title_page":"Number of days taken off sick drops to an all-time low | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The number of sick days taken by workers has fallen to a record low – driven by the unwillingness of self-employed people to take time off through sickness or absenteeism.\nNew figures yesterday showed that an average worker took 4.3 days off sick last year, the lowest recorded since official counts began in the early 1990s.\nSelf-employed workers take only two thirds of the time off taken by full-time employees, according to the estimates published by the Office for National Statistics.\nThe ONS report, published the day after Chancellor Philip Hammond provoked a backbench revolt by imposing higher National Insurance payments on 2.5 million solo workers, said that the number of working days lost to sickness has been declining since 2000. It dropped particularly fast in the downturn after 2007.\nNew figures yesterday showed that an average worker took 4.3 days off sick last year (stock photo)\nIt said that alongside self-employed workers, those least likely to be away from work because they are sick were employees in private industry and commerce, non-smokers, men, and people working for smaller businesses.\nPublic sector workers and women are most likely to stay at home, according to the figures.\nThe ONS report said the overall number of days lost to the economy through sickness has stayed roughly the same since 2010 'due to an increasing number of people entering the labour market.'\nBut once the impact of immigration on the figures is removed, they show that workers are more likely to stay at their posts than in the past. A typical worker now takes fewer than two days in 50 off work sick, a sickness rate of 1.9 per cent, compared to more than three days in 50, 3.1 per cent, in 1995.\nIn the mid-1990s a self-employed worker was off sick 2.1 per cent of the time compared to 3.3 per cent for an employee. In 2016 the sickness rate was 2.1 per cent for employees, and just 1.4 per cent for self-employed people.\nThe figures gave further weight to the claims of those yesterday who suggested that Chancellor had unfairly hammered the people who had done most to improve Britain's economic performance and productivity.\nMike Cherry of the Federation of Small Businesses said: 'Going it alone in the business world involves risk and those choosing to be self-employed are putting their all into making it work. They aren't entitled to benefit payments for sickness and absence and simply don't make money if they can't work.\n'In many cases, they are forced to push through and stay on the job, even when they aren't feeling 100 per cent. It is this hard-working group -- the plumbers, builders and hairdressers -- on modest incomes of £45,000 or less who will have to pay a much larger share of their income compared to higher-income self-employed people after the hike in National Insurance Contributions announced in Wednesday's Budget.'\nThe ONS report, published the day after Chancellor Philip Hammond (pictured) provoked a backbench revolt\nJames Gribben of the Association of Independent Professionals and the Self-Employed said: 'I hope the Budget measures do not push self-employed people back into regular jobs. The last thing we want to see is a reversal in the decline of sickness rates.'\nEconomist Ruth Lea of the Arbuthnot Banking Group said: 'I am a self-employed person, and, when you are self-employed, you have to cope with a high level of uncertainty in your life. You do not have holiday pay or sick pay or other benefits. If you don't work your life can be pretty difficult.\n'It is not fair to treat the self-employed in the same way as employed workers.'\nThe ONS figures showed public sector workers have a sickness rate of 2.9 days in 100 compared to 1.7 for workers in private business. Absentee rates among health workers were particularly high, 3.5 per cent in 2016, and the ONS report speculated this could be because health workers are exposed to infection from the public.\nIt added: 'Workers in the private sector are more likely to not be paid for a spell of sickness than those in the public sector.'\nThe most common reasons for sickness absence last year were minor illnesses like colds, cited in nearly a quarter of all sickness absences. Just under a third of absences were because of back pain, and just over one in 10 were a result of reported stress or mental health difficulties.","url":"https://www.dailymail.co.uk/news/article-4299538/Number-days-taken-sick-drops-time-low.html"}
