{"authors":["Ligaya Figueras"],"date_download":"2018-10-30 21:38:02","date_modify":"2018-10-30 21:38:02","date_publish":"2016-02-17 11:43:51","description":"The James Beard Foundation announced the semifinalists of restaurants and chefs in the running for i...","filename":"data/vaneerConsumption/NumerousAtlantachefsrestaurantsinrunningfor2016JamesBeardFo.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_nu_3792b52e03541e67a2ca9e10a6988c43__1540935482.html","title":"Numerous Atlanta chefs, restaurants in running for 2016 James Beard Fo","title_page":"Numerous Atlanta chefs, restaurants in running for 2016 James Beard Fo","title_rss":"NULL","source_domain":"ajc.com","text":"The James Beard Foundation announced the semifinalists of restaurants and chefs in the running for its 2016 culinary awards. Atlanta is well represented this year, with a total of 14 nominations for area restaurants and chefs compared to 13 JBF semifinalist nods in 2015 .\nAmong national awards, Staplehouse, which the Atlanta Journal-Constitution recently awarded three stars, is in the running for Best New Restaurant , and Jarrett Stieber of Eat Me Speak Me is among those chefs under the age of 30 nominated as a Rising Star Chef. Two local bakers, Robert Alexander of The General Muir (and the new TGM Bread ) and Sarah O’Brien of Little Tart, were both nominated in the Outstanding Baker category, while Kimiko Nishimura of Tomo was nominated for Outstanding Pastry Chef. Bacchanalia was once again nominated for Outstanding Service and Ford Fry sees his name in the hat again for Outstanding Restaurateur. In the libations arena, cocktailian haunt Kimball House is in the running for Outstanding Bar and two Atlanta restaurants – Empire State South and Miller Union – are both semifinalists for Outstanding Wine Program.\nLocal names are also accounted for among the 20 chefs nominated for Best Chef: Southeast. They include Billy Allin of Cakes & Ale, Kevin Gillespie of Gunshow, Steven Satterfield of Miller Union and first-time nominee Ryan Smith of Staplehouse.\nA complete list of 2016 semifinalists is online at jamesbeard.org/awards.\nOn March 15, the Foundation will announce the final nominees for all award categories. Winners will be announced at the James Beard Awards Gala, held in Chicago on May 2.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook and following Atlanta Dining on Twitter.\nRead the AJC Fall Dining Guide, Atlanta Around the Clock, here .","url":"https://www.ajc.com/blog/atlanta-restaurants/numerous-atlanta-chefs-restaurants-running-for-2016-james-beard-foundation-awards/8o8HNn091TLI7iV3ocH0oN/"}
