{"authors":[],"date_download":"2018-10-22 22:35:04","date_modify":"2018-10-22 22:35:04","date_publish":"2014-05-09 21:19:28","description":"American nuns have been rebuked yet again by a Vatican official, and now their allies are stepping up to defend them.","filename":"data/vaneerConsumption/NunstoVaticanQuitPickingonOurSisters.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/433166/140509-nuns-bus-1628_48c2c5f4f0d3363e7c03a74a360e3501.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_nuns-vatican-quit-picking-our-sisters-n101856_1540247704.html","title":"Nuns to Vatican: Quit Picking on Our Sisters","title_page":"Nuns to Vatican: Quit Picking on Our Sisters","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwo years after the Vatican accused American nuns of \"radical feminism\" for failing to aggressively promote church views on issues such as abortion and homosexuality, the sisters are facing new heat from Rome—and their allies are leaping to their defense.\n\"They're being treated like children again,\" said Mary Johnson, a former Catholic nun who served for 20 years in the Missionaries of Charity, a group founded by Mother Teresa.\nThe latest rebuke came last week, when German Cardinal Gerhard Müller scolded the main umbrella group of U.S. nuns, the Leadership Conference of Women Religious, in a speech at an annual meeting in Rome. In the remarks, released by the Vatican, the cardinal reprimanded leaders of the LCWR—some of whom were in attendance—for planning to honor a theologian who had been criticized by U.S. bishops. The move \"will be seen as a rather open provocation against the Holy See,\" the cardinal said. \"Not only that, but it further alienates the LCWR from the bishops as well.\"\nCardinal Müller, the Vatican chief of doctrine, didn't name the theologian, but the sisters had recently announced plans to give Sister Elizabeth A. Johnson, a Fordham University theology professor and author of the book Quest for the Living God, a leadership award at a conference this coming August. U.S. bishops have said the book contains \"misrepresentations, ambiguities and errors that bear upon the faith of the Catholic Church.\" The theologian has defended her work, reportedly saying it has been \"thoroughly misunderstood\" and \"consistently misrepresented.\"\nThe Vatican expects the sisters to seek advance approval, the cardinal said, before inviting \"speakers and honorees\" to major events. He also criticized the nuns for inviting a futurist named Barbara Marx Hubbard to a past conference, saying he is \"worried that the uncritical acceptance\" of her theories on evolution shows that \"a de facto movement beyond the Church and sound Christian faith has already occurred.\"\nMary Johnson, the former nun who worked with Mother Teresa and author of the memoir An Unquenchable Thirst, said the remarks were insulting. \"Basically he's accusing the sisters of not following Jesus anymore because they listened to a woman with new ideas,\" she said. \"He goes so far as to imply that these highly educated women—many of whom have advanced theological degrees—listen uncritically. When they invite speakers to their events, they don't just swallow everything whole. They think about it. They discuss it. They discern what may be of value and what’s not.\"\n\"They're being treated like children again.\"\nThe nuns under fire would apparently agree with that. In an internal memo obtained by the Catholic News Service after the Rome meeting, leaders of the LCWR discussed with members their efforts \"to explore new understandings from science and philosophy,\" noting, \"we are exploring these areas of contemporary culture; we are not proposing them. Nor are we using them to replace our firm commitment to the Christological foundation of consecrated life.\"\nThe problem, Mary Johnson said, is that Vatican officials \"are not interested in having sisters explore new areas of thought. They are the defenders of the tradition. They want the sisters to listen to speakers who will just tell them things they already know.\"\nSister Simone Campbell, the executive director of Network, a Catholic social-justice lobbying group in Washington, D.C., questioned the Vatican's motive in releasing the critical comments \"before the sisters even got back from Rome.\" Calling the move \"disrespectful,\" she speculated that it may have been an effort to \"keep the militant far right in our country—who have been advocating to control the sisters—quiet.\"\nSister Simone is perhaps best known for running a \"Nuns on the Bus\" tour across the country in the last presidential election, protesting Republican vice presidential candidate Rep. Paul Ryan's proposed federal budget, which she said would slash funds for social programs for low-income people. Her group has no formal connection to the Vatican.\nThe flap between American nuns and the Vatican began in the spring of 2012, when the Vatican released a deeply critical report on the LCWR. The report acknowledged the \"great contribution\" of nuns in \"institutions of support for the poor,\" but said the sisters had stayed \"silent on the right to life from conception to natural death, a question that is part of the lively public debate about abortion.\" Further, the report said, \"issues of crucial importance to the life of the church and society, such as the church’s Biblical view of family life and human sexuality, are not part of the LCWR agenda in a way that promotes church teaching.\"\nThe Vatican appointed a Seattle archbishop, Peter Sartain, to oversee the American nuns for as long as five years. The sisters of the LCWR fought back, saying the Vatican report contained \"unsubstantiated accusations\" and that it was the result of \"a flawed process that lacked transparency.\" The LCWR reportedly represents around 80 percent of the some 51,000 nuns in America.\n\"All these accusations made against the nuns could also be made against the pope.\"\nIn response to the latest blast from Rome, the LCWR released a statement this week saying a \"positive conversation\" had followed the remarks from Cardinal Müller, noting that the dialogue was \"constructive in its frankness and lack of ambiguity.\" However, the group said, \"During the meeting, it became evident that despite maximum efforts through the years, communication has broken down, and as a result, mistrust has developed.\" Subsequent attempts to \"clarify misperceptions,\" the group said, \"have led to deeper misunderstandings.\"\nNonetheless, the sisters said, \"Passion for all that the church can be deepens our commitment to stay at the table and talk through differences.\" They added, \"We cannot call for peacemaking in Syria, the Middle East, in South Sudan, unless we too sit at tables with people who hold varying views and work patiently and consistently for a genuine meeting of minds and hearts.\"\nThe nuns found a friend this week in German Cardinal Walter Kasper, who reportedly played down the drama in an appearance at Fordham University. According to the Religion News Service, Kasper is seen as a close ally of Pope Francis and reportedly said the Vatican criticism of the nuns was typical of the \"narrower\" view among some officials in Rome and that Catholics in America shouldn’t be too concerned.\nPope Francis himself said last year that the church is too focused on issues such as abortion, gay marriage and contraception. \"I am a son of the church, but it is not necessary to talk about these issues all the time,\" he told the Catholic weekly America Magazine, emphasizing the need for a focus on the poor.\nMary Johnson pointed out that \"all these accusations made against the nuns—emphasizing social justice instead of talking about abortion all the time—could also be made against the pope.\" She had joined the convent as a 19-year-old college student in Texas. She and her fellow sisters wore white saris, as Mother Teresa wore; they refrained from becoming close friends with other nuns and distanced themselves from their families, per the rules. They spent their time helping the poor. She left two decades later, craving intimacy, she has said.\nSister Simone, noting that the Vatican called her group a \"bad influence\" on American sisters two years ago, defended the pope for not leaping to the nuns' defense. \"He's focusing on the big picture, on the global church. In our country, this is an important story, but it's not a global story,\" she said. An attorney who worked with the poor for 18 years in Oakland, California, and the author of the book A Nun on the Bus, Sister Simone has been the executive director of Network for the past decade.\n\"While I find all of this criticism painful, frustrating and shocking, the fact is, we have to keep it in perspective,\" she said. \"Spiritual life teaches us that all things work for the good.\" She added with a laugh, \"That's the annoying thing about spiritual life.\"","url":"https://www.nbcnews.com/news/us-news/nuns-vatican-quit-picking-our-sisters-n101856"}
