{"authors":["Caitlin Cruz"],"date_download":"2018-10-31 01:42:45","date_modify":"2018-10-31 01:42:45","date_publish":"2018-08-28 01:22:56","description":"There's yet another bombshell report detailing supposed misconduct at the hands of the Catholic Church. This time the report is about allegations of child abuse by nuns at a Vermont Catholic orphanage. In an investigation called \"The Ghosts of the…","filename":"data/vaneerConsumption/NunsAtACatholicOrphanageInVermontAbusedChildrenForDecadesAnExplosiveReportSays.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/88d2858b-3139-472a-bbf9-0044bd5a3b0d-getty-52475280.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_nuns-at-a-catholic-orphanage-in-vermont-abused-children-for-decades-explosive-report-says-10256009_1540950165.html","title":"Nuns At A Catholic Orphanage In Vermont Abused Children For Decades, An Explosive Report Says","title_page":"Nuns At A Catholic Orphanage In Vermont Abused Children For Decades, An Explosive Report Says","title_rss":"NULL","source_domain":"bustle.com","text":"There's yet another bombshell report detailing supposed misconduct at the hands of the Catholic Church. This time the report is about allegations of child abuse by nuns at a Vermont Catholic orphanage. In an investigation called \"The Ghosts of the Orphanage,\" BuzzFeed News' Christine Kenneally tracked supposed incidents of child abuse through decades across the country, but the bulk of her reporting focused on one facility in Vermont.\nSt. Joseph’s Catholic Orphanage opened in the mid-1800s and closed in 1974. Kenneally estimated that \"thousands of people\" stayed at the orphanage in the time it was open. When asked for comment, Burlington Diocese Monsignor John McDermott told BuzzFeed News that they take reports of child abuse seriously. \"Please know that the Diocese of Burlington treats allegations of child abuse seriously and procedures are in place for reporting to the proper authorities. While it cannot alter the past, the Diocese is doing everything it can to ensure children are protected,\" McDermott told BuzzFeed News.\nOne of the central characters in Kenneally's reporting is Sally Dale — who lived at the facility from the age of 2 until 23. In a deposition, she described, among other things, the time she supposedly saw a nun push a boy out of a window. She guessed that took place around 1944, according to BuzzFeed News.\nAnd that wasn't all Dale witnessed. Her testimony revealed even more alleged crimes against children. As Kenneally wrote, Dale said a nun told her to get a ball from a firepit and subsequently caught her pants on fire. \"Weeks later, as the nuns pulled blackened skin off her arms and her legs with tweezers and [Dale] cried out in pain, they told her it was happening because she was a real bad girl,\" Kenneally wrote.\nIn her testimony, Dale also recalled a story of a boy who reportedly drowned in Lake Champlain. Kenneally later found a death certificate for a boy named Marvin Willette, whose body was found in the lake.\nDale's allegations are just some of dozens in Kenneally's long and detailed report. For example, one man named Joseph Barquin told a lawyer that in the 1950s a nun at St. Joseph's \"forcefully fondled him, and then she cut him with something very sharp,\" according to Kenneally's reporting.\nWhile Church abuse scandals seem to pop up with increasing regularity, the BuzzFeed News investigation into the Catholic orphanages is particularly damning because of the last month of news about Church abuses.\nLess than two weeks ago, a two-year investigation by a Pennsylvania grand jury was released, accusing more than 300 clergy members across the state of sexual abuse dating back to 1947. (You can read the full report here and watch videos of survivors' stories.)\nOne of the most detailed and far-ranging investigations into a state's dioceses in modern times, the final report is more than 800 pages long. \"This report is our only recourse. We are going to name their names, and describe what they did – both the sex offenders and those who concealed them,\" the introduction to the report read. \"We are going to shine a light on their conduct, because that is what the victims deserve.\"\nAnd in 2003 in the Phoenix diocese, Maricopa County investigated a cover-up of child abuse that led to the indictment of six priests, and the resignation of then-Bishop Thomas O'Brien, according to the Arizona Republic. Maybe most well-known is the Boston Globe's investigation into predator priests in the Boston diocese in January 2002. The list goes on.\nIn response to the latest BuzzFeed News investigation, Vermont Gov. Phil Scott called the allegations \"extremely disturbing, horrific and deeply troubling\" on Monday.\n\"My heart goes out to the many who were harmed, and I support their continued pursuit of justice in the courts,\" Scott said in a statement to BuzzFeed News. \"As a society, the safety and well-being of our children is one of our most critical responsibilities and abuse against children cannot be tolerated under any circumstance.\"","url":"https://www.bustle.com/p/nuns-at-a-catholic-orphanage-in-vermont-abused-children-for-decades-explosive-report-says-10256009"}
