{"authors":["Rebecca Taylor For Mailonline"],"date_download":"2018-10-23 02:28:55","date_modify":"2018-10-23 02:28:55","date_publish":"2017-03-16 13:03:53","description":"GRAPHIC CONTENT: A 27-year-old woman identified as Alejandra Janeth Cuahuteca was hit by a van in the San Mateo Ixtacalco colony of Cuautitlán Izcalli, Mexico in an unexplained attack.","filename":"data/vaneerConsumption/Nurseleftwithspineinjuriesafterdrivermowsherdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5429C500000578-0-image-a-77_1489669771815.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319644_Nurse-left-spine-injuries-driver-mows-down_1540261735.html","title":"Nurse left with spine injuries after driver mows her down","title_page":"Nurse left with spine injuries after driver mows her down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A nurse was intentionally run over by a black van as she walked along a road in an unexplained incident.\nFootage from a surveillance camera shows the woman walking on the road close to a pavement in the San Mateo Ixtacalco colony of Cuautitlán Izcalli, Mexico.\nThe woman, identified by local press in Mexico as Alejandra Janeth Cuahuteca, is knocked over by a black van which approaches her from behind.\nThe woman was walking along the road to see her family when she was followed by a driver in a black van\nThe driver mounted the pavement in order to strike the woman from behind, in an unexplained attack\nThe driver then leaves the scene, with the woman lying on the ground and her belongings strewn across the road\nThe van driver even mounts the pavement in order to knock her to the ground.\nThe driver then continues over her, and the shocking footage shows her being dragged for about five metres under the van along the road.\nThe driver leaves the scene, with Alejandra in a heap on the floor and her belongings strewn on the ground.\nThe woman, named as Alejandra Janeth Cuahuteca was helped by passersby who had been shocked by what they saw\nAlejandra's family now face a huge legal bill, but an appeal to the Mexican government means they will be helped with the massive cost of surgery\nShe is helped by passersby who cannot believe what they have seen.\nAccording to Estado de Mexico and Debate, other pedestrians helped transfer the 27-year-old woman to a hospital, where her family were told her treatment would not be free.\nHer father told the media he did not understand what had prompted his daughter's aggressor, as she is a kind and quiet woman dedicated to her work.\nA complaint has been filed with the Attorney General of the State of Mexico (FGJEM) in Cuautitlán Izcalli for attempted murder.\nAlejandra's injuries included a fractured hip and cervical sprain. A complaint has been made of attempted murder\nThe family has been landed with a bill of between 50,000 and 70,000 pesos and the spine surgery she requires will cost 150,000 pesos, which they do not have.\nThey have requested help from the Governor Eruviel Ávila Villegas, and El Universal reports the government will support her costs.\nA statement said: 'Due to the facts, a file was opened for the crime of felony injury to Alejandra Janeth N, who had a fractured hip and a second degree cervical sprain.\n'Their injuries do no endanger their life but they merit hospitalisation.'","url":"https://www.dailymail.co.uk/news/article-4319644/Nurse-left-spine-injuries-driver-mows-down.html"}
