{"authors":[],"date_download":"2018-10-30 14:31:24","date_modify":"2018-10-30 14:31:24","date_publish":"2015-07-11 00:00:00","description":null,"filename":"data/vaneerConsumption/Nuttysmalltownleftistsfightstoreswithlowerprices.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_nutty_smalltown_leftists_fight_stores_with_lower_prices_1540909884.html","title":"Nutty small-town leftists fight stores with lower prices","title_page":"Nutty small-town leftists fight stores with lower prices","title_rss":"NULL","source_domain":"americanthinker.com","text":"Twenty years ago, Katonah, 45 miles north of New York City in Westchester County, ran Starbucks out of town . Now, many residents and merchants are fighting to block a large CVS Health location, concerned that the national pharmacy chain’s arrival would spell doom not only for the one independent local drugstore but also for shops that sell cosmetics, groceries and other items that CVS stocks.\nI never understand people in small towns who want to ban chain stores because they like the \"local character\" of their mom-and-pop stores. Sure, I think it can be great fun to walk in a downtown area filled with mom-and-pop stores that look quaint. But when I actually go shopping, I am not looking for quaint ; I am looking for lower prices and larger selection. And that is what chain stores have in abundance.\nI doubt they are smart enough to spell \"doom.\" I notice the article didn't say that the greedy local merchants want to \"spell doom\" for competitors, which, of course, is exactly what they want to do.\nCVS has had a small outpost here for months, but the company wants to close it and open one nearly twice the size — 6,928 square feet — in the same shopping center. In an effort to halt the move, the Town Board of Bedford, which encompasses Katonah as well as the hamlets of Bedford and Bedford Hills, is scheduled to hold a hearing on Tuesday at which it may vote on a zoning amendment that would reduce the scale of new stores in the three downtown areas to 4,000 square feet, from 7,500 square feet. The villages of Bronxville and Mamaroneck, also in Westchester, and Sag Harbor, on Long Island, have already adopted similar limits to maintain their small-scale character.\nZoning is a legitimate function of local governments when done correctly. You don't, after all, want factories right next to residential homes. But too often zoning is used to serve political purposes. What these town councils are doing is perpetuating a monopoly of local merchants and denying their customers the choice of larger stores with more convenience.\nNot everyone fears the arrival of a larger CVS. Some residents appreciate the chain, which has two other locations within a few miles, because its stores are open late, and shoppers can slip in after coming home from work. They also appreciate the range of nonpharmaceutical offerings, which allows them to run errands in a single stop.\nIf residents really wanted \"quaint,\" smaller selection at higher prices, these zoning rules would not be needed. Residents simply would not shop at chains, and the chains would fail of their own accord. The fact that the town feels the need to zone these chains out of existence shows that they fear their citizens will like them, and so these councils are consciously acting against the wishes of their own citizens.\nReaders who live in small towns, what do you think? Do you like the idea of nutty, leftist, petty commissarial town councils deciding where your fellow residents should shop, or do you think those residents should have choices in the matter?\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/nutty_smalltown_leftists_fight_stores_with_lower_prices.html"}
