{"authors":[],"date_download":"2018-10-30 20:18:04","date_modify":"2018-10-30 20:18:04","date_publish":"2015-12-17 14:41:47","description":"The owners of an upscale northwest Atlanta menswear store likely had a sense of déjà vu Thursday as they cleaned up the damage caused during a second smash-and-grab burglary in just three months.","filename":"data/vaneerConsumption/NWAtlantamensclothingstoreburglarizedasecondtimein3.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/17/Images/photos.medleyphoto.8500770.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_atlanta-men_eafa66f3b0a65ddbdce3df7797af4fe1__1540930684.html","title":"NW Atlanta men’s clothing store burglarized a second time in 3...","title_page":"NW Atlanta men’s clothing store burglarized a second time in 3...","title_rss":"NULL","source_domain":"ajc.com","text":"The owners of an upscale northwest Atlanta menswear store likely had a sense of déjà vu Thursday as they cleaned up the damage caused during a second smash-and-grab burglary in just three months.\nBurglars smashed out a front window of A Ma Maniere in the 900 block of Marietta Street near 8th Street shortly after 3 a.m. Thursday.\nAtlanta police spokesman Warren Pickard said surveillance video showed three male suspects entering the store and stealing six iPads, several boxes of tennis shoes and the cash register, which contained $700 in cash.\nOn Sept. 7, surveillance video showed seven thieves looting the store of an estimated $15,000 in merchandise after backing a Ford Taurus through the front doors.\nFollowing that incident, the store’s owners installed large concrete posts in the parking lot to keep vehicles from being able to drive through the front of the store.\nIn Thursday’s break-in, the thieves heaved pieces of concrete at the store’s large double-paned front glass window, but were only able to shatter the outer pane of glass.\nThey then broke out a smaller glass window above the front door to gain entry to the store.\nPickard said investigators Thursday “collected blood evidence from the scene which was a result of one of the subjects injuring himself during the entry.”","url":"https://www.ajc.com/news/crime--law/atlanta-men-clothing-store-burglarized-second-time-months/Ge2nT16kNjcwIf34qkKkpL/"}
