{"authors":["Associated Press","Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-23 01:49:09","date_modify":"2018-10-23 01:49:09","date_publish":"2017-03-16 11:59:36","description":"Police responded to a call about a child trapped in snow in Pendleton in Niagara County around 3.40pm on Wednesday. Benjamin Wasik, 10, was taken to a hospital, where he was pronounced dead.","filename":"data/vaneerConsumption/NYboydiesafterbeingtrappedundersnowpile.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/06/3E5A814300000578-0-image-a-123_1489731116192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319874_Police-NY-boy-10-dies-trapped-snow-pile_1540259349.html","title":"NY boy dies after being trapped under snow pile","title_page":"NY boy dies after being trapped under snow pile | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 10-year-old boy died after being trapped under a pile of snow from this week's storm, authorities in western New York say.\nPolice responded to a call about a child trapped in snow in Pendleton in Niagara County around 3.40pm on Wednesday.\nBenjamin Wasik had a snow day and was at his grandfather's farm, and had been playing on a 15ft snow bank, WIVB reports.\nScroll down for video\nBenjamin Wasik, 10, died after being trapped under a pile of snow from this week's storm\nPolice say that Benjamin may have been digging a tunnel in the 15ft snow bank when it collapsed on top of him, WKBW reports.\nBenjamin was taken to Millard Fillmore Suburban Hospital, where he was pronounced dead.\nNiagara County Sheriff James Voutour said at a press conference filmed by WGRZ: 'As Ben's dad and another relative were plowing snow, Benjamin kinda took kindly to a very high pile of snow and decided to climb on it, despite being told before that by his father not to do that.'\n'When his dad didn't see him for a couple of minutes, he started to look around for him,' the sheriff said.\nHe said the boy's parents 'noticed the large snow pile and decided to start checking that. And when they did, they found Ben underneath the snow, in that snow pile.'\nPolice responded to a call about a child trapped in snow in Pendleton around 3.40pm on Wednesday. Benjamin Wasik had been at his grandfather's farm on Aiken Road\nVoutour said: 'Initial reports were that it was a period of about 20 minutes where they were looking for the boy.'\n'We saw evidence that maybe he was digging a tunnel. Without a witness, we don't know when the snow fell or how it fell,' he said.\nVoutour said the snow bank was about 15 feet tall, explaining: 'They were plowing snow and pushing it up against a barn to get it out of the parking lot area.\n'So it was a pretty significant snow bank, and of course would be attractive to a 10-year-old boy to have a lot of fun on.'\nBenjamin was a fourth grader who enjoyed fishing and baseball, the sheriff said.\nVontour said the death was 'accidental by asphyxiation'. An investigation is ongoing.\nPictured is Aiken Road in Pendleton, New York. Police say that Benjamin may have been digging a tunnel in a 15ft snow bank when it collapsed on top of him\nNiagara County Sheriff James Voutour (pictured) said: 'We saw evidence that maybe he was digging a tunnel. Without a witness, we don't know when the snow fell or how it fell'\nThe Starpoint Central School District said in a Thursday statement to WIVB: 'It is with great sadness that we share the news of the tragic, accidental death of Benjamin Wasik, a 4th grade student at Regan Intermediate School.\n'The entire Starpoint community expresses our sincere condolences to the Wasik family and friends.\n'Benjamin will be greatly missed and will always be a part of the Starpoint family.'\nThe school district said 'that appropriate social-emotional support systems will be in place at Starpoint to assist students in the days and weeks ahead'.\nParts of Niagara County received more than two feet of snow from the storm that started Tuesday and lasted into Wednesday.","url":"https://www.dailymail.co.uk/news/article-4319874/Police-NY-boy-10-dies-trapped-snow-pile.html"}
