{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 03:15:35","date_modify":"2018-10-23 03:15:35","date_publish":"2017-03-10 12:40:56","description":"A 40-year-old commuter, Michael Lee (pictured), has been charged with felony assault, misdemeanor assault and felony reckless endangerment.","filename":"data/vaneerConsumption/NYCcommuterkicksaheavilypregnantwomaninthestomach.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E227B0000000578-0-image-a-14_1489145512277.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300834_Commuter-kicks-heavily-pregnant-woman-stomach_1540264535.html","title":"NYC commuter kicks a heavily pregnant woman in the stomach","title_page":"NYC commuter kicks a heavily pregnant woman in the stomach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An eight-month pregnant woman was kicked twice in the stomach in a shocking attack during a fight on a packed New York subway.\nNatasha Rodney was rushed to hospital after the sickening drama, which happened yesterday.\nA 40-year-old commuter, Michael Lee, has been charged with felony assault, misdemeanor assault and felony reckless endangerment.\nMichael Lee, 40, was arrested following the shocking attack on mom-to-be Natasha Rodney\nLee has been charged with felony assault, misdemeanor assault and felony reckless endangerment\nPolice believe Lee bumped into Rodney, 28, on a train bound for the Bronx shortly after 8am.\nRodney reacted by pushing him, it is alleged, knocking him to the floor. He is believed to have then kicked her twice in the stomach in anger.\nLuckily neither Rodney or the baby, a boy due on March 27, appear to have suffered serious harm, but doctors are keeping a close eye on them.\nA vendor outside the station said Lee 'went cooperatively' after his arrest after Rodney was kicked twice\nThe victim's mother, Carol Rodney, said: 'I don't care what argument they had. What if the baby is damaged?'\nThe victim's mother, Carol Rodney, told the New York Daily News: 'How do you kick a pregnant person? She’s due this month. I'm shaking.'\nAnd the grandmother-to-be continued: 'Is he insane? I don’t care what argument they had. What if the baby is damaged? What if, God forbid?'\nLee is scheduled for arraignment today at Manhattan Criminal Court.\nNYPD spokesman Sgt Lee Jones told the New York Post: 'It was a crowded train and the guy bumped into her. She mentioned something to him.'\nThe row became physical, he said, and the man was pushed to the ground. 'He got back up and kicked her twice in the stomach,' Jones stated.\nLee 'went cooperatively', a vendor outside the station said, tell the New York Post: 'There’s no excuse to kick anybody, but especially a pregnant woman. You’re harming two lives at once.'","url":"https://www.dailymail.co.uk/news/article-4300834/Commuter-kicks-heavily-pregnant-woman-stomach.html"}
