{"authors":["Regina F. Graham For Dailymail.Com"],"date_download":"2018-10-23 00:28:55","date_modify":"2018-10-23 00:28:55","date_publish":"2017-03-10 07:03:44","description":"A 25-year-old woman who was struck by a train after fainting and falling onto the subway tracks lost her right leg and arm in the horrific accident, officials said Thursday.","filename":"data/vaneerConsumption/NYCwomanlosesanarmandlegaftershewashitbytrain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E206E0100000578-0-image-a-2_1489128069685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300212_Woman-loses-arm-leg-hit-train_1540254535.html","title":"NYC woman loses an arm and leg after she was hit by train","title_page":"NYC woman loses an arm and leg after she was hit by train | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 25-year-old woman who was struck by a train after fainting and falling onto the subway tracks lost her right leg and arm in the horrific accident, officials said Thursday.\nThe woman, whose name has not been publicly released, is listed in critical but stable condition at Bellevue Hospital following the tragic incident on Wednesday, the New York Daily News reported.\nThe young woman was waiting for a southbound 6 train at the Lexington Avenue and East 51st Street station when witnesses say she was standing near the platform edge when she fainted and fell onto the subway tracks around 1:30pm.\nScroll down for video\nTragic: A 25-year-old woman who was struck by a train after fainting and falling onto the subway tracks lost her right leg and arm in the horrific accident, officials said Thursday.\nThe woman, whose name has not been publicly released, is listed in critical but stable condition at Bellevue Hospital following the tragic incident on Wednesday (scene above)\nThe motorman of the incoming subway train saw her fall and immediately hit the brakes, however, it was unable to stop in time.\nThe woman became trapped underneath the train after being struck by it.\nEmergency workers rescued her from beneath it, and witnesses say she regained consciousness and remained alert.\nA video shared to Facebook outside of the station shows the woman being put on a stretcher by emergency personnel before being wheeled away to be rushed to the hospital in a waiting ambulance.\nAs a result of the tragic accident, the woman lost her right leg below the knee and her right arm below the elbow, according to the Daily News.\nAn NYU student who was riding the 6 train before it was evacuated at the station told the Daily News, 'The firemen were calm. They were trying to pull her out.\n'They were like, 'Ma'am, could you please not move, please try not to move, stay calm.''\nAbout an hour after the incident, regular train service resumed with some delays.","url":"https://www.dailymail.co.uk/news/article-4300212/Woman-loses-arm-leg-hit-train.html"}
