{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 03:58:14","date_modify":"2018-10-23 03:58:14","date_publish":"2017-03-16 14:59:33","description":"Police say Amanda Miner was riding in the back seat of Stefan Hoyte's Infiniti when the off-duty traffic officer lost control of the car and smashed into a barrier on the bridge overnight.","filename":"data/vaneerConsumption/NYPDtrafficcopchargedincrashthatkilledwoman.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E55961D00000578-0-image-a-75_1489681546616.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320556_NYPD-traffic-cop-charged-crash-killed-woman_1540267094.html","title":"NYPD traffic cop charged in crash that killed woman","title_page":"NYPD traffic cop charged in crash that killed woman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An off-duty NYPD traffic cop is facing a string of charges in connection with a deadly crash on the Williamsburg Bridge that killed a student who was celebrating her 21st birthday.\nStefan Hoyte, 26, was drunk when he drove head-on into a barrier while he was travelling from Manhattan to Brooklyn at 3.15am on Thursday morning, police say.\nOne of his passengers, birthday girl Amanda Miner, was thrown from the car on impact and died at the scene.\nVideo recorded by a passing motorist captured the aftermath of the deadly crash, with a large chunk of the mangled 2013 Infiniti rolled into a ball.\nBirthday girl: Amanda Miner, pictured left and right, was killed in an overnight car crash in New York City after celebrating her 21st birthday\nHorrifying impact: This is a screenshot from a video shot by a passing motorist showing the aftermath of the deadly crash on the Williamsburg Bridge\nRipped apart: The 2013 Infiniti was traveling from Manhattan to Brooklyn when it smashed head-on into a barrier on the bridge, splitting the vehicle in two\nEjected: The college student was ejected from the sedan on impact and pronounced dead at the scene on the bridge span\nOfficers say the birthday girl Miner, from Brooklyn, was riding in the back seat and was thrown from the car on impact, suffering fatal injuries.\nThe man driving the car, NYPD traffic enforcement officer Hoyte, and his passenger, fellow off-duty traffic cop Michael Camacho, 24, were taken to Bellevue Hospital, where they were listed in stable condition, reported ABC 7 News.\nPolice say Hoyte was off duty at the time of the crash.\nIt is unclear where the trio were heading at the time of the crash.\n'Before' picture: This photo shows Stefan Hoyte's 2013 Infiniti before Thursday's collision\nBuddy cops: Hoyte (left), the 26-year-old driver of the car and an NYPD traffic officer, was injured along with his colleague and friend, 24-year-old Michael Camacho (right)\nDUI case: Hoyte has been charged with driving while intoxicated, vehicular manslaughter and criminally negligent homicide\nSome of the bridge's Brooklyn-bound lanes remained closed during the morning rush hour, but they has since reopened to traffic.\nAccording to her Facebook page and reporting by multiple news outlets, Amanda Miner was a junior at Lafayette College in Easton, Pennsylvania, majoring in social work.\nMiner's heartbroken mother, Virginia Cabrera-Miner, told the New York Post the 21-year-old was the youngest of her three daughter and she was looking forward to seeing Amanda graduate from college next year.\nPrior to joining the NYPD as a traffic officer, Hoyte had worked as a mechanic for Honda and a clerk at a Pathmark supermarket, according to his social media account.\nHis mother, Jennifer Hoyte, described the 26-year-old to the Post as a 'good son' and a good father to his 5-year-old daughter. She noted that Stefan was not a heavy drinker.\nMichael Camacho is a graduate of Onondaga Community College in upstate New York.\nMiner, who had celebrated her 21st birthday Wednesday night, was ejected from the sedan and was pronounced dead at the scene","url":"https://www.dailymail.co.uk/news/article-4320556/NYPD-traffic-cop-charged-crash-killed-woman.html"}
