{"authors":["Kristy Johnson","Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:14:30","date_modify":"2018-10-22 23:14:30","date_publish":"2017-03-16 06:13:19","description":"Nyssa Large, 28, told the Herald Sun on Thursday that Justin Bieber 'is lovely' after denying she was invited on his Melbourne yacht last weekend in exchange for 'sexual favours'","filename":"data/vaneerConsumption/NyssaLargesaysJustinBieberhasmaturedsomuch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E52370900000578-0-image-a-72_1489645476183.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318968_Busty-Nyssa-Large-describes-Justin-Bieber-lovely_1540250070.html","title":"Nyssa Large says Justin Bieber has 'matured so much'","title_page":"Nyssa Large says Justin Bieber has 'matured so much' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has denied being invited on Justin Bieber's Melbourne yacht in exchange for 'sexual favours', in an interview with KIIS FM on Tuesday.\nAnd on Thursday, socialite Nyssa Large, 28, had nothing but praise for pop's most notorious ladies' man.\n'He's matured so much,' the busty aspiring musician told the Herald Sun, before adding that the 23-year-old 'is lovely'.\nScroll down for video\n'He's matured so much': Busty aspiring musician Nyssa Large, 28, told the Herald Sun on Thursday that Justin Bieber 'is lovely' after denying she was invited on his Melbourne yacht last weekend in exchange for 'sexual favours'\n'He has matured so much since his last tour (in 2015), he seems much more reserved this tour, a little cautious,' said the Melbourne party girl.\n'But he is lovely. He is really good to talk to, you can have a great conversation with him,' added Nyssa, who has also attended parties with Shane Warne.\nThe blonde explained how she and six girls were hand-picked for the cruise on board a luxury yacht, telling the publication: 'We all just sat around and had some drinks'.\nIt was previously reported by The Daily Telegraph that Justin's guests were required to sign non-disclosure agreements and leave behind their phones prior to boarding.\nShe's a Belieber! 'He is really good to talk to, you can have a great conversation with him,' the blonde said\nCasual: 'We all just sat around and had some drinks,' Nyssa said\nThe comments come after Nyssa confirmed to KIIS FM 101.1's Matt and Meshel on Tuesday morning, that she was one of the seven girls hand-picked for the cruise.\nGushing over the 'very polite' Justin, the socialite revealed the two had bonded over their music careers.\nNyssa said the group spent their time talking and playing drinking games such as 'dares,' however, refuted that sexual favours had been a condition of the women coming on board the boat.\nShe made the cut! The comments come shortly after Nyssa confirmed to KIIS FM 101.1's Matt and Meshel on Tuesday morning, that she was one of the seven girls hand-picked for the cruise\nShe's not shy: Nyssa is often seen flaunting her ample cleavage in revealing social media snaps\n'Oh no god no [sexual favours],' Nyssa said.\n'It wasn't even like that he was very polite, he was very respectful. it was just him and his crew and best friends...playing drinking games.'\n'Is he prickly in person?' Meshel asked, citing his recent encounters with fans during his Australian tour.\nHow they met: Nyssa, who is heading to South Korea to compete in the Miss Supertalent Of The World beauty pageant, said it was just by chance that she had first met Justin at a Melbourne nightclub alongside her blogger friend, Roze Cook, in 2015\n'No not at all he was absolutely lovely to us, there was only about seven of us and we just all sat around and had some drinks ...had good conversation,' Nyssa replied.\n'We talked about his concert, what each of us do.'\nNyssa, who is heading to South Korea to compete in the Miss Supertalent Of The World beauty pageant, said it was just by chance that she had first met Justin at a Melbourne nightclub alongside her blogger friend, Roze Cook, in 2015.\nWas this from Bieber's boat? On Monday a photo of Nyssa (centre) on board a yacht with two other beautiful women was uploaded to Instagram\n'I think it is just luck,' Nyssa explained on KIIS FM on Tuesday. 'I think the first time was because I am a singer as well, so there was the same sort of people that we knew with that one.'\nIn 2015, Nyssa and Roze were trolled by Justin's fans after it was revealed they were among the 75 people he followed on Instagram at the time.\nRoze was later accused by Beliebers of being seen leaving Justin's hotel room, a claim to which she responded 'I don't know' when asked by Daily Mail Australia to confirm the report.\n'Oh no god no [sexual favours]': She said the group spent their time talking and playing drinking games such as 'dares'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318968/Busty-Nyssa-Large-describes-Justin-Bieber-lovely.html"}
