{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:36","date_modify":"2018-10-30 19:52:36","date_publish":"2015-10-05 12:50:43","description":"Two days after nine students were shot and killed at Umpqua Community College, The New York Times sucked a bit of the air out of the gun control lobby by admitting that mass shooters aren't acquiring guns in some secretive manner, but are walking into gun stores and passing background checks.","filename":"data/vaneerConsumption/NYTAdmitsMassShootersAreGettingTheirGunsviaBackgroundChecks.json","image_url":"https://media.breitbart.com/media/2015/04/gun-store-background-checks-gun-control-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_05__1540929156.html","title":"NYT Admits Mass Shooters Are Getting Their Guns via Background Checks","title_page":"NYT Admits Mass Shooters Are Getting Their Guns via Background Checks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Two days after nine students were shot and killed at Umpqua Community College, The New York Times sucked a bit of the air out of the gun control lobby by admitting that mass shooters aren’t acquiring guns in some secretive manner, but are walking into gun stores and passing background checks.\nIn fact, the NYT lists Gabby Giffords’ attacker–Jared Loughner–as one of the mass shooters who followed the letter of the law to acquire his weapon.\nGranted, the NYT story is not as enlightening as it could be, as it only reports on a total of 12 mass shooters and alleged mass shooters who bought their guns in stores. Breitbart News has shown that the number who acquired their guns via background checks sits at 25 at the least–that’s 25 of the most infamous attackers of the last eight years.\nSo the NYT is admitting the truth of this by degrees. Yet even this slight admission demonstrates the difficulty of continuing to report as if no one knows how mass shooters get their guns when in fact the clear majority of them actually pass federal background checks to obtain firearms.\nAccording to the NYT, mass shooters and alleged mass shooters who passed background checks for their guns include Chris Harper Mercer (Umpqua Community College), Dylan Roof (Charleston), Army Specialist Ivan Lopez (Fort Hood 2014), Aaron Alexis (DC Navy Yard), Wade M. Page (Wisconsin Sikh temple), James Holmes (Aurora movie theater), One L. Goh (Oikos University), Jared Loughner (Tucson), Nidal Hasan (Fort Hood 2009), and Jiverly Wong (Binghamton). The NYT also includes Vester Lee Flanagan’s (Virginia) double murder as a mass shooting and John Russell Houser’s alleged double murder (Lafayette theater) as a mass shooting as well.\nEven with the NYT’s diminutive report on the number of mass shooters who got their guns via background checks, the point is clear–it is harder to name a mass shooter from the last eight years who did not pass a background check than it is to name one who did. Yet Gabby Giffords, Mark Kelly, Governor Terry McAuliffe (D), and Senator Joe Manchin (D-WV) assure us that expanding the types of gun sales covered by background checks would make us safer.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/05/nyt-admits-mass-shooters-getting-guns-via-background-checks/"}
