{"authors":[],"date_download":"2018-10-30 14:34:57","date_modify":"2018-10-30 14:34:57","date_publish":"2015-08-19 00:00:00","description":null,"filename":"data/vaneerConsumption/NYTcolumnistfaultsNetanyahu.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_nyt_columnist_faults_netanyahu_1540910097.html","title":"NYT columnist faults Netanyahu","title_page":"NYT columnist faults Netanyahu","title_rss":"NULL","source_domain":"americanthinker.com","text":"Cohen’s vituperations have a familiar ring. Back in the 1930s, there also was a world statesman who sounded the alarm against an existential threat – and was also roundly ridiculed for peddling doomsday warnings. His name was Winston Churchill. So Cohen’s tirades have a worthy pedigree – however unintended.\nNY Times columnist Roger Cohen serves up a fiery piece against Prime Minister Benjamin Netanyahu’s “doomsday pitch” on Iran’s threat to Israel and Bibi’s chutzpah of “intervening in American politics” (“ Iran and American Jews ” page A23).\nThere is one point – and only one – in Cohen’s piece that stands up to close examination: American Jews are divided about the Iran nuclear agreement.\nAs for his side, Cohen is definitely in the “pro” column in support of the Iran deal. But he hurts his own cause with loads of vitriol aimed at Netanyahu and Jewish groups that oppose the nuclear deal with Iran. His fulminations are at least as excessive as some of Bibi’s occasional semantic excesses.\nIn addition to going overboard with supposed “doomsday” alarms by Bibi, Cohen also faults Netanyahu’s “habit of intervening in American politics.” No mention of Obama’s habit of intervening in Israeli politics. No mention that the president doesn’t hesitate to use all-out pressure tactics in lobbying American Jewish groups. Cohen just wants to silence Jews with whom he disagrees – like Bibi.\nFor example, he is furious that AIPAC, the American Jewish Committee, the Conference of Presidents of Major Jewish Organizations, and the Anti-Defamation League all have come out against the Iran deal. “This is unsurprising,” Cohen remarks. “They tend to move in lock step with Israel.”\nSo he proceeds to attack Jewish organizations that take a different course from Roger Cohen’s, explaining that “It’s troubling because it’s unclear how representative of American Jews as a whole these organizations are.”\nYet on his side of the divide, Cohen is delighted to find at least one Jewish organization that he can fully embrace – J Street. In his lexicon, J Street gets a kosher seal of approval as “the largest Jewish organization to back Obama’s Iran policy.” Never mind that J Street’s record, regardless of its claim to be “pro-Israel” and “pro-Jewish,” really is on balance “anti-Israel.”\nCohen ends his column by lashing out against Jewish groups that “give airtime to Netanyahu on Iran rather than Obama.”\nJust imagine. In Cohen’s anti-Zionist world, Bibi manages to best Obama in securing airtime for his views.\nTo get to a semblance of reality, Cohen badly needs to attend a White House press conference. That ought to enlighten him that nobody can beat the president of the United States in securing airtime – not even Bibi.\nLeo Rennert is a former White House correspondent and McClatchy Newspapers bureau chief in Washington.","url":"https://www.americanthinker.com/blog/2015/08/nyt_columnist_faults_netanyahu.html"}
