{"authors":[],"date_download":"2018-10-30 14:33:57","date_modify":"2018-10-30 14:33:57","date_publish":"2015-06-13 00:00:00","description":null,"filename":"data/vaneerConsumption/NYTinfullbiasmodeagainstIDF.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_nyt_in_full_bias_mode_against_idf_comments_1540910037.html","title":"NYT in full bias mode against IDF","title_page":"Blog: NYT in full bias mode against IDF","title_rss":"NULL","source_domain":"americanthinker.com","text":"In its June 12 print edition, the New York Times runs an article by Jerusalem bureau chief Jodi Rudoren about an Israeli report, which clears the IDF of criminal tactics leading to civilian deaths during last year’s Gaza war (“Israeli Report Backs Tactics By Military In Gaza War,” page A10). High up in her article – in fact, in the second paragraph – Rudoren writes that the report by Israel’s Military Advocate concludes that no criminal charges or disciplinary action will be taken against those involved in airstrikes that killed four young cousins as they played on a Gaza City beachfront, “an episode that spurred worldwide condemnation.” But while Rudoren puts Israel in the dock with this incident, she takes her sweet time to give readers a more complete picture, including indications of how these children became casualties in Israel’s war with terrorist groups that had fired thousands of rockets on civilian towns in southern... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/06/nyt_in_full_bias_mode_against_idf_comments.html"}
ers of the report interviewed large numbers of soldiers and officers “involved in the planning and execution of the attack.”\nYet while readers now get an inkling about the report’s authors’ diligence in tracking down witnesses, Rudoren still holds up telling readers why the Israeli military chose this particular target.\nIt is not until the ninth paragraph that she finally drips in with a bit of indication of how this target came to be chosen: “The military said the airstrike targeted a compound where naval forces linked to Hamas, the Islamist group that dominates Gaza, had gathered to prepare for ‘military activity’ and that a container of military supplies inside it had been hit by Israel the day before the deadly attack.”\nStill, there’s more to the picture. For that, readers must turn to the tenth paragraph, which finally addresses how and why those four children came to be in the wrong time and in the wrong place.\nHere is Rudoren’s tenth paragraph in toto:\n“Aerial surveillance identified a number of figures entering the compound at a running pace,” the report says. “‘It should be stressed that the figures were not identified at any point during the incident as children.’ It later uses the word ‘tragically’ to describe the outcome, and says, ‘it would not have been possible for the operational entities involved to have identified these figures, via aerial surveillance, as children.”\nAnd there you have it – how the NY Times and Rudoren manage to skew a piece by highlighting the tragic deaths of four Gaza children during last year’s war, but taking their sweet time before letting readers know that aerial surveillance couldn’t possibly have pinpointed four moving potential targets as children around a military compound.\nSince Rudoren attaches great importance to this incident – “an episode that spurred worldwide condemnation” – by giving it second-paragraph position, it behooved her to give readers Israel’s explanation no later than the third paragraph – not to let them wait until the tenth paragraph to finally remove the veil of secrecy on the fact that Israel’s aerial surveillance in selecting targets was not capable of discerning a precise presence of children. In handling Israel’s side of the story, it’s back-of-the-bus treatment in the pages of the Times.\nRudoren and the Times might argue that a full picture of this incident can be gleaned from her article – if readers plow all the way through to the tenth paragraph. Which is, of course, exactly how she shapes her anti-Israel bias – giving major prominence high up in her article to a loss of four children in an incident prompting “worldwide condemnation,” while hiding much farther down Israel’s explanation of how and why this tragedy occurred.\nAh, the twisting, ideological games alleged journalists play.\nLeo Rennert is a former White House correspondent and Washington bureau chief of McClatchy Newspapers.","url":"https://www.americanthinker.com/blog/2015/06/nyt_in_full_bias_mode_against_idf.html"}
