{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 19:14:03","date_modify":"2018-10-30 19:14:03","date_publish":"2016-12-13 00:57:34","description":"The New York Times just hired to cover the Trump White House the Politico reporter busted by WikiLeaks for allowing Clinton campaign chairman John Podesta to vet an article about the candidate. | Media","filename":"data/vaneerConsumption/NYTimesHiringFakeJournalisttoCoverTrumpWhiteHouseEvokesFakeButAccurateHistory.json","image_url":"https://media.breitbart.com/media/2016/12/New-York-Times-Building-e1481585742509.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_12_12__1540926843.html","title":"NY Times Hiring Fake Journalist to Cover Trump White House Evokes 'Fake But Accurate' History","title_page":"NY Times Hiring Fake Journalist to Cover Trump White House Evokes 'Fake But Accurate' History | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The New York Times just hired to cover the Trump White House the Politico reporter busted by WikiLeaks for allowing Clinton campaign chairman John Podesta to vet an article about the candidate.\n“Because I have become a hack I will send u the whole section that pertains to u,” Glenn Thrush emailed John Podesta. “Please don’t share or tell anyone I did this. Tell me if I f—ed up anything.”\nHe surely did in asking a partisan to review his work for accuracy. The request for secrecy in a profession dedicated to transparency indicates he knew as much.\nThe paper’s public editor Liz Spayd recently scolded reporters for venturing into advocacy on social media and wrote that “as The Times begins a period of self-reflection, I hope its editors will think hard about the half of America the paper too seldom covers.” Publisher Arthur O. Sulzberger Jr. urged the journalists in his employ to “report America and the world honestly, without fear or favor, striving always to understand and reflect all political perspectives and life experiences in the stories that we bring to you” in the aftermath of the shocking presidential election results.\nThe hiring of Thrush shows these friendly criticisms fell on deaf ears. Rather than report as the “newspaper of record,” the Times opts to continue as a parochial entity shouting back the prejudices of readers on a tiny island in the northeast that voted by a nearly 9-1 margin for the presidential election’s loser over its winner.\nThe paper’s hiring of a partisan masquerading as a journalist shows an institution reverting to tradition and bucking its present need to speak to a broader audience amid declining circulation and advertising revenue.\nIn 1932, New York Times foreign correspondent Walter Duranty won a Pulitzer Prize by serving as a strongman’s stenographer. He contended “there is no famine” in response to mass starvation in the Ukraine and later wrote of his “conviction that the confessions are true” regarding the condemned in Stalin’s show trials.\nHerb Matthews described Fidel Castro as an anti-Communist democrat to gullible Times readers. “His is a political mind rather than a military one,” Matthews informed. “He has strong ideas of liberty, democracy, social justice, the need to restore the Constitution, to hold elections.” He noted in his series that “there is no Communism to speak of in Fidel Castro’s 26th of July Movement.”\nMore recently, the newspaper embarrassed itself by dubbing phony National Guard documents purporting to show George W. Bush receiving favorable treatment and shirking his responsibilities as “Fake But Accurate.”\nOf course, for every embarrassment the Times counts many examples of solid reporting. But the fact that the embarrassments seem to all stem from an effort to tip the scales in favor of a left-wing cause or character indicates that the message of Sulzberger and Spayd did not go far enough. If reporters representing a monolithic worldview could fairly report on the American landscape in all its diversity, then the periodic journalistic scandals at the Times and elsewhere would appear less periodically. Adding yet another scribe who sees himself as a crusader rather than a chronicler ensures that skeptics remain readers who call the paper on its errors emanating from ideological flattery rather than writers and editors who prevent them from appearing.\nThe hiring of Thrush comes as part of that institutional context and in the midst of a push by the paper to discredit what it calls “fake news,” a phrase broadly used to discredit both wild conspiracy theories spun in the furthest recesses of the internet and legitimate news sources that merely reflect an outlook that differs from the one pervasive in a skyscraper on 8th Avenue. Recent headlines announced: “As Fake News Spreads Lies, More Readers Shrug at the Truth,” “Media’s Next Challenge: Overcoming the Threat of Fake News,” and “The Hoaxes, Fake News and Misinformation We Saw on Election Day.”\nDiscrediting legitimately “fake news” seems a valid undertaking in a profession committed to uncovering the truth. Hiring fake reporters to do so gives lie to the notion that noble motives propel this narrative.","url":"https://www.breitbart.com/the-media/2016/12/12/new-york-times-hires-fake-journalist-during-crusade-against-fake-news/"}
