{"authors":["Associated Press"],"date_download":"2018-10-22 23:37:38","date_modify":"2018-10-22 23:37:38","date_publish":"2017-03-10 03:49:07","description":"DUNEDIN, New Zealand (AP) - Kane Williamson's 16th test century and B.J. Watling's 13th half century guided New Zealand within four runs of South Africa's...","filename":"data/vaneerConsumption/NZ3048atteaonday31sttestvsSouthAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299874_NZ-304-8-tea-day-3-1st-test-vs-South-Africa_1540251458.html","title":"NZ 304-8 at tea on day 3, 1st test vs. South Africa","title_page":"NZ 304-8 at tea on day 3, 1st test vs. South Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DUNEDIN, New Zealand (AP) - Kane Williamson's 16th test century and B.J. Watling's 13th half century guided New Zealand within four runs of South Africa's first innings total with two wickets in hand at tea on Friday on the third day of the first cricket test.\nWilliamson was out for 130, having moved closer to Martin Crowe's New Zealand record of 17 test centuries, as New Zealand made slow progress from 247-5 at lunch to 304-8 at tea in a match delicately poised just past the halfway point. Only 57 runs were added from 26 overs in the afternoon session, mostly with the second new ball.\nNew Zealand was poised to overtake South Africa's first innings of 308 at tea, having taken 108 overs to reach 304 after the Proteas took 122.4 overs to post 308 on a pitch at the University Oval that seemed more suited to survival than shot-making.\nWilliamson's innings occupied six hours and 20 minutes in which he faced 241 balls and hit 18 boundaries. His century had come in 315 minutes from 195 deliveries with 18 fours and he was out when New Zealand was 277-6.\nThe slow pace of scoring continued on his dismissal as Watling took almost three hours to post his 13th test half century. He was bowled by left-arm spinner Keshav Maharaj for 50 with New Zealand 304-8.\nWatling enjoyed a reprieve on 3 when given lbw to Maharaj, only to have the decision overturned when his review showed the ball clearing the stumps. He went on to his third half century in seven test innings against South Africa.\nMitchell Santner took 33 minutes to get off the mark, struck a boundary and was out for 4 when New Zealand was 297.\nNeil Wagner was 4 not out and Trent Boult 0 at tea.\nThe first test in the three test series began to meander a little Friday as neither side set out to grab the advantage. The strong South African bowling attack was able to regularly chip out New Zealand batsmen on a relatively slow and unresponsive wicket while New Zealand was able to match South Africa's total without launching itself towards a clear first innings lead.\nAt tea Maharaj was the best of the South Africa bowlers with 3-82 while Vernon Philander had 2-48 and Morne Morkel, a little down on pace in his first test in more than a year, had 2-56.","url":"https://www.dailymail.co.uk/wires/ap/article-4299874/NZ-304-8-tea-day-3-1st-test-vs-South-Africa.html"}
