{"authors":["Fiona Connor For Daily Mail Australia"],"date_download":"2018-10-22 23:42:10","date_modify":"2018-10-22 23:42:10","date_publish":"2017-03-16 07:37:28","description":"A woman in the South Island of New Zealand has been awarded more than $20,000 in compensation by the ERA after it was found she was a victim of racial abuse by her employer.","filename":"data/vaneerConsumption/NZwomanwhowasraciallyattackedwins20kindamages.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51DCDB00000578-0-image-a-20_1489639160062.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318962_Racially-attacked-woman-wins-20-000-damages_1540251730.html","title":"NZ woman who was racially attacked wins $20k in damages","title_page":"NZ woman who was racially attacked wins $20k in damages | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother-of-eight has been awarded more than $20,000 in compensation after it was found she was a victim of racial abuse by her employer.\nMarsha Whaiapu, from New Zealand's South Island, was called a 'black b****' and a 'baby killer' by her supervisor Peter Powell while she worked at P&W Painters (PWP) as a brush hand from January 2015 until October 2015.\nThe Employment Relations Authority found there was a history of racial abuse within the Oamaru and Christchurch-based company, and determined it had been proved Ms Whaiapu was called the names, she alleged.\nThe company was ordered to pay Marsha Whaiapu compensation of $12,000 for humiliation loss of dignity and injury to her feelings.\nMs Whaiapu told Daily Mail Australia the behaviour of her supervisor made her feel degraded.\n'To start working with this company I was up on a high because it was something I had always wanted to do so my dream had come true but then as time went on the nasty things just started coming out and it really ruined me,' she said.\nERA member Christine Hickey ordered the company to pay Ms Whaiapu $9360 in lost wages, plus five per cent interest on lost wages from May 30 last year and compensation of $12,000 for humiliation, loss of dignity and injury to her feelings.\nMs Hickey told the New Zealand Herald generally she placed little weight on the issue of witness demeanour because it was not a reliable indicator of credibility.\nMarsha Whaiapu was awarded over $20,000 in damages after it was found she was mistreated\n'However, some of Mr Powell's behaviour and comments at the investigation meeting revealed some aspects of his character which make it more likely that certain things he is alleged to have said are correct,' Ms Hickey said.\n'Mr Powell likes to say things that are amusing to him and to see people react to them, even if it affects them negatively. He characterises what he says as banter and humour.'\nPowell had admitted being behind nasty rumours and gossip that may have negatively effected those involved.\nMs Whaiapu told Daily Mail Australia after the incidents she would confront the company's director and manager, Warren Pitches, whenever she felt her manager's comments were inappropriate.\n'My job not only effects myself but it effects my family so I naturally went and confronted my boss on every single thing Pete had said to me,' she said.\nThe 42-year-old said others had launched personal grievances with the same company\n'If I felt bullied, I would speak to speak to Warren about it and he said he would go and deal with these issues but I whenever I would ask Warren if he had spoken to Pete he would say 'It's water under the bridge'' or he would say ''It's between you and Pete, you guys sort that out'' and that's when it hit me that he wouldn't do anything about it.'\nThe mother said the ERA win was positive but doesn't feel like the company will change their attitudes.\n'I was over the moon to win but at the same time for myself it was not about the money and I let that be known in the meeting as well as in the mediation. I just wanted them to do something about what was going on in the company,' Ms Whaiapu said.\nMs Whaiapu has since found a new job she was excited about and wanted to go back to being a strong role model to her children.\n'I am a very hard-worker. I work hard because I feel like I am an example for my children that you don't get things for free, money doesn't grow on trees, so you have to work hard and I do work hard so I will continue to,' she said.","url":"https://www.dailymail.co.uk/news/article-4318962/Racially-attacked-woman-wins-20-000-damages.html"}
