{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:42:26","date_modify":"2018-10-30 19:42:26","date_publish":"2015-01-19 19:41:18","description":"There was no shortage of \"black lives matter\" protests this past weekend as activists in Oakland and Berkeley sought to link their cause to the life of |","filename":"data/vaneerConsumption/OaklandBlackLivesMatterProtestsContinue.json","image_url":"https://media.breitbart.com/media/2015/01/black-lives-matter-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_19__1540928546.html","title":"Oakland #BlackLivesMatter Protests Continue","title_page":"Oakland #BlackLivesMatter Protests Continue | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"There was no shortage of “black lives matter” protests this past weekend as activists in Oakland and Berkeley sought to link their cause to the life of late civil rights activist Martin Luther King, Jr.\nClose to 150 #BlackLivesMatter protesters took to the streets on Sunday to protest what they perceive as injustice committed against African Americans by police forces. Their counterparts in Berkeley touted a similar line in a public forum where they aired grievances of their own about the maltreatment of protesters by the Berkeley police.\nThe protests had started around 7 p.m. on Oakland’s 14th Street and Broadway and by 9 p.m. had dwindled down to about 20 people from the original 150, according to the San Francisco Chronicle. At some points, the protests intensified, with some taunting the police by standing mere inches away from their faces and yelling “You ain’t s—! You motherfu—s think you’re helping, but you’re killing our kids.” A banner proclaiming “gentrification is violence” was also carried throughout the march.\nA similar protest Sunday at an Oakland Walmart store saw a staged “die-in” in the parking lot in order to draw attention to the August 5, 2014 shooting death of 22-year-old John Crawford, who was shot by police in an Ohio Walmart while he held an air rifle he had taken off a store shelf, the Chronicle notes.\nIn Berkeley, a town hall meeting to address the treatment of activists by local police was also held. A woman named Patricia Plumber who spoke at a town hall meeting said the citizens of Berkeley are “intimidated”, “scared”, and “bullied” by police, adding that “it needs to stop,” according to local CBS News affiliate KPIX in San Francisco.\nBerkeley’s embattled Mayor Tom Bates suggested that the protestors themselves bore some of the blame. “What is about their code of conduct?” he asked, according to KPIX.\nA study by Fatal Encounters reveals that between 2013-2015, 853 of those killed by officers in the U.S. were white, 673 were African-American, 305 were Hispanic and 4 were Middle Eastern.\nPhoto: File\nFollow Adelle Nazarian on Twitter: @AdelleNaz.","url":"https://www.breitbart.com/local/2015/01/19/oakland-blacklivesmatter-protests-continue/"}
