{"authors":["Lauren Sharkey"],"date_download":"2018-10-31 01:46:47","date_modify":"2018-10-31 01:46:47","date_publish":"2018-09-14 10:56:47","description":"Although it seems like plus-size brands are everywhere right now, a lot of affordable labels are still lacking in the sizing department. But one high street stalwart has listened to the calls from women across the UK, announcing an addition to its…","filename":"data/vaneerConsumption/OasisHaveANewPlusSizeCollectionItGoesUpToAUKSize26.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/013b1970-2a93-4d36-a725-bac892f9ae62-screen-shot-2018-09-14-at-111104.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_oasis-have-a-new-plus-size-collection-it-goes-up-to-a-uk-size-26-11916694_1540950407.html","title":"Oasis Have A New Plus-Size Collection & It Goes Up To A UK Size 26","title_page":"Oasis Have A New Plus-Size Collection & It Goes Up To A UK Size 26","title_rss":"NULL","source_domain":"bustle.com","text":"Although it seems like plus-size brands are everywhere right now, a lot of affordable labels are still lacking in the sizing department. But one high street stalwart has listened to the calls from women across the UK, announcing an addition to its clothing range. And Oasis' plus-size collection is loud, proud, and full of lots of very stylish pieces.\nIf you're a plus-size shopper, you may have come across the brand's collaboration with Simply Be. Strangely enough, Oasis decided not to sell the plus-size range in its own stores when it was released last year. However, the brand appears to have got the message from unhappy shoppers, releasing its own collection. Oasis Curve will be available from September 23 and features sizes ranging from a UK 18 to UK 26. The offering is set to be a lot bigger in range than the previous Simply Be line and looks to include a lot of leopard print, leather, stand-out stripes, and comfy knitwear.\n\"Dressing as many customers who love the Oasis brand as possible is incredibly close to our heart,\" brand director Sarah Welsh said in a statement. \"We believe that everyone should be able to wear Oasis and feel great in it.\"\n\"We launched an exclusive range with Simply Be last year to great success and are delighted that we have now extended this offer to include more choice, launching on our own website. As always, we will listen, learn from, and respond to our customers' feedback to endeavour to continue to deliver what she wants from Oasis.\"\nAs Welsh mentions, the only downside is that the collection will only be available online. It's unclear why this decision has been made but I've reached out to a spokesperson for the brand to ask why plus sizes will not be offered in store.\nWhile next day delivery options and free returns have paved the way for super easy online ordering, it's still important for people to be able to walk into a store and try before they buy. Here's hoping that Oasis and others are able to offer the collection in store soon enough, allowing all women to have the same shopping experience.\nOne of the models in the campaign, Lauren Nicole, recently spoke to Cosmopolitan about what it's really like to work in the plus-size industry. She explained how there's no real definition of what a plus-size model actually is, adding: \"Sometimes, you'll see curve models and they're a size 12/14 and then sometimes you'll see others who are a size 22. When I started I was a size 16/18 and although no one from the plus-size community said it, at time I felt that I wasn't big enough because I was on the slightly smaller end of the scale.\"\nNicole is now a size 18/20 and admitted to occasionally feeling \"too big.\" However, she told the magazine that it's important for every woman to be represented in the fashion industry. \"I can imagine if I were a size 26/28, it would be frustrating to see a size 16/18 person modelling clothes for my size, because I wouldn't be able to picture what those clothes would actually look like on me,\" she commented.\nIf Oasis (and other brands) are listening, perhaps it's time to show straight and plus-size clothing on models of all sizes. Customers seem to have the same viewpoint. One Instagram comment in response to Oasis' plus-size announcement read: \"Well done. It’s also about using models of different sizes across your range too. We all come in different shapes and sizes.\"\nFans have also asked Oasis for the introduction of tall, petite, and maternity ranges; something which the company has said \"will be passed onto the relevant team for consideration.\"\nAt last, moves are being made to diversify the high street. And long may it continue.","url":"https://www.bustle.com/p/oasis-have-a-new-plus-size-collection-it-goes-up-to-a-uk-size-26-11916694"}
