{"authors":["Associated Press"],"date_download":"2018-10-22 20:42:20","date_modify":"2018-10-22 20:42:20","date_publish":"2016-01-28 02:52:53","description":"PORT-AU-PRINCE, Haiti (AP) — The threat of instability in Haiti prompted the Organization of American States on Wednesday to authorize a special mission to h...","filename":"data/vaneerConsumption/OAStosendspecialmissiontoHaitiamidpoliticalcrisis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:32b4208d899849a78906a95f1a0d6d02-2vdWmEltwXfba0ce28e632302acc-609_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420152_OAS-send-special-mission-Haiti-amid-political-crisis_1540240940.html","title":"OAS to send special mission to Haiti amid political crisis","title_page":"OAS to send special mission to Haiti amid political crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"OAS to send special mission to Haiti amid political crisis\nPORT-AU-PRINCE, Haiti (AP) — The threat of instability in Haiti prompted the Organization of American States on Wednesday to authorize a special mission to help the troubled nation find a way out of a simmering political crisis and set a new date for a runoff election.\nIn Washington, the OAS permanent council reached consensus on sending the mission to Haiti to assist with resolving a stalemate now that elections have been postponed indefinitely and the country's president is due to leave office in 10 days.\nThe regional body, which Haiti belongs to, took up the measure after receiving an urgent request from outgoing President Michel Martelly. The OAS council had only been scheduled to receive a report on Haiti from electoral observers.\nIn this Jan. 22, 2016 photo, a national police officer fires birdshot at demonstrators during a street protest after it was announced that the runoff Jan. 24, presidential election had been postponed, in Port-au-Prince, Haiti. The Provisional Electoral Council in Haiti has postponed the election amid escalating protests by the opposition, which claims the first round was marred by fraud in favor of a government-backed candidate. (AP Photo/Dieu Nalio Chery)\nAntigua Ambassador Ronald Sanders, who holds the rotating chair of the council, raised the specter of \"utter bloodshed\" in Haiti unless a political agreement was reached. He said their intention was to \"not to interfere, but to be helpful.\"\nHaiti's ambassador to the OAS, Bocchit Edmond, said the request was not an invitation to \"meddle\" in Haitian affairs but was intended to help the country avoid \"falling into an institutional vacuum and chaos.\"\nFor days, Haiti's political leaders and others with influence have been working to find a way out of the impasse. Business, religious and civil society leaders have offered possible solutions along with various political factions.\nBut Martelly is scheduled to depart Feb. 7 and political compromise is rare in Haiti. Presidential and legislative runoff elections set for last weekend were called off less than 48 hours before the vote amid a surge of violent protests and deep suspicions of electoral fraud.\nMany Haitians have been growing anxious since elections were aborted in the perennially volatile country.\n\"I'm concerned that there may be killings if the authorities don't get a solution worked out,\" said Reginald Poteau, who has been unemployed since losing his job as a warehouse laborer last year.\nBut hardware store manager Rony Mathieux, whose car windows were smashed during recent violent protests in Port-au-Prince, said he did not like the idea of having foreigners help resolve Haiti's political problems.\n\"I'm a victim of this instability but I believe Haitians finally need to learn how to clean up our own messes,\" he said.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420152/OAS-send-special-mission-Haiti-amid-political-crisis.html"}
