{"authors":["Richard Gonzales"],"date_download":"2018-10-22 21:18:46","date_modify":"2018-10-22 21:18:46","date_publish":"2016-08-31 00:00:00","description":"The president warns that climate change can undermine decades-long conservation efforts. He spoke at an annual summit that brings people together to discuss how to keep Lake Tahoe blue.","filename":"data/vaneerConsumption/ObamaAtLakeTahoePraisesConservationEfforts.json","image_url":"https://media.npr.org/assets/img/2016/08/31/ap_16211242953963_wide-2aa88b1ed71cf17597e8ec43f53dbd653ee95c2b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_08_31_492177267_obama-at-lake-tahoe-praises-conservation-efforts_1540243126.html","title":"Obama At Lake Tahoe Praises Conservation Efforts","title_page":"Obama At Lake Tahoe Praises Conservation Efforts : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Obama At Lake Tahoe Praises Conservation Efforts\nEnlarge this image toggle caption Rich Pedroncelli/AP Rich Pedroncelli/AP\nAgainst the backdrop of the picturesque Lake Tahoe, President Obama said environmental conservation is a key part of fighting the impact of global warming.\nObama spoke on the first of a two-day environmental tour at an annual summit designed to keep the health of Lake Tahoe a priority for the federal government and the states it borders, Nevada and California.\n\"We embrace conservation because healthy and diverse lands and waters help us build resilience to climate change,\" the president said. \"We do it to free more of our communities and plants and animals and species from wildfires, and droughts, and displacement. We do it because when most of the 4.5 million people who come to Lake Tahoe every year are tourists, economies like this one live or die by the health of our natural resources.\"\nThe president then quoted an unnamed former leader of the Washoe Tribe (which has called Lake Tahoe home for thousands of years): \"The health of the land and the health of the people are tied together, and what happens to the land also happens to the people.\"\nLake Tahoe, sometimes called \"the Jewel of the Sierra\", is 22 miles long and 12 miles wide. It contains so much water that if it were emptied it would cover the entire state of California with one foot of water.\nIts stunningly clear, cobalt-blue water is legendary. Mark Twain wrote of the water in his 1872 semi-autobiographical novel, Roughing It.\n\"Down through the transparency of these great depths, the water was not merely transparent, but dazzlingly, brilliantly so,\" he wrote.\nBut development, storm water runoff, pollution, warming water and algae, to name but a handful of factors, have all combined to reduce Tahoe's fabled clarity. In 1968, researchers could see a disk lowered into the water at a depth of 102.4 feet. By 1997, they could see only down to 68 feet.\nThat was the year President Bill Clinton visited to inaugurate the Lake Tahoe Summit, which annually draws national, state, and local leaders, researchers, and residents together to discuss ways to \"Keep Tahoe Blue.\" The federal government has since spent about $2 billion on the health of the lake and the surrounding environment.\nObama announced that the Department of Interior will spend nearly $30 million on wildfire prevention at Tahoe this year.","url":"https://www.npr.org/sections/thetwo-way/2016/08/31/492177267/obama-at-lake-tahoe-praises-conservation-efforts"}
