{"authors":[],"date_download":"2018-10-22 20:37:16","date_modify":"2018-10-22 20:37:16","date_publish":"2016-01-28 02:20:25","description":"President Barack Obama used an event honoring Holocaust heroes to warn of rising anti-Semitism and to stress America's \"unbreakable\" bonds with Israel. \"We m...","filename":"data/vaneerConsumption/ObamawarnsofrisingantiSemitism.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g578-2vdWmEltwXfba0ce28e6322befbe-928_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420307_Obama-warns-rising-anti-Semitism_1540240636.html","title":"Obama warns of rising anti-Semitism","title_page":"Obama warns of rising anti-Semitism | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obama warns of rising anti-Semitism\nPresident Barack Obama used an event honoring Holocaust heroes to warn of rising anti-Semitism and to stress America's \"unbreakable\" bonds with Israel.\n\"We must confront the reality that, around the world, anti-Semitism is on the rise. We cannot deny it,\" Obama said, declaring \"we are all Jews,\" on what was International Holocaust Remembrance Day.\n\"An attack on any faith is an attack on all of our faiths,\" he said as he cited instances of discrimination in Europe, Asia and the United States.\nUS President Barack Obama addresses the Righteous Among the Nations Award Ceremony at the Israeli Embassy January 27, 2016 in Washington, DC ©Brendan Smialowski (AFP)\nObama said that the United States was at the forefront of efforts to combat anti-Semitism and would remain a friend to Israel.\nObama has been at pains to stress close ties with Israel amid a series of rows with the country's government and particularly Prime Minister Benjamin Netanyahu.\nThe pair have sparred publicly over settlement building and the Iran nuclear deal, which Netanyahu fiercely opposed.\n\"America's commitment to Israel’s security remains, now and forever, unshakeable,\" he said in a speech at the Israeli embassy.","url":"https://www.dailymail.co.uk/wires/afp/article-3420307/Obama-warns-rising-anti-Semitism.html"}
