{"authors":["Alicia Lu"],"date_download":"2018-10-30 23:55:06","date_modify":"2018-10-30 23:55:06","date_publish":"2014-08-12 21:29:53","description":"On Monday, the world lost legendary comedian Robin Williams, found dead at the age of 63 in an apparent suicide. The incredibly tragic news was followed by an outpouring of sadness from fans and celebrities alike, including President Obama, who…","filename":"data/vaneerConsumption/ObamasVeryRareStatementOnRobinWilliamsTragicDeathSpokeVolumes.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/152d46b7-d8a1-4bc6-8f44-4118f53f516c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35465-obamas-very-rare-statement-on-robin-williams-tragic-death-spoke-volumes_1540943706.html","title":"Obama's Very Rare Statement On Robin Williams' Tragic Death Spoke Volumes","title_page":"Obama's Very Rare Statement On Robin Williams' Tragic Death Spoke Volumes","title_rss":"NULL","source_domain":"bustle.com","text":"On Monday, the world lost legendary comedian Robin Williams, found dead at the age of 63 in an apparent suicide. The incredibly tragic news was followed by an outpouring of sadness from fans and celebrities alike, including President Obama, who released a rare statement on Robin Williams' passing. The president's words on the late comedian are pretty revealing, since Obama usually reserves his condolences for world leaders.\nBesides symbolically placing Williams in the same ranks as world-famous icons, Obama's statement also sheds light on the president's appreciation of the very best in popular culture. In the statement, Obama said:\nRobin Williams was an airman, a doctor, a genie, a nanny, a president, a professor, a bangarang Peter Pan, and everything in between. But he was one of a kind. He arrived in our lives as an alien — but he ended up touching every element of the human spirit. He made us laugh. He made us cry. He gave his immeasurable talent freely and generously to those who needed it most — from our troops stationed abroad to the marginalized on our own streets. The Obama family offers our condolences to Robin’s family, his friends, and everyone who found their voice and their verse thanks to Robin Williams.\nBesides Williams, Obama has also released public statements about the celebrity deaths of director Harold Ramis and Andy Griffith. Both were visionaries of the film industry, but neither had any ties to larger political or social contexts, like typical honorees of presidential statements. Which suggests the president's tastes lean toward comedy gold (he never released a statement on Elizabeth Taylor, for example, or James Gandolfini). And given Obama's age — 53 — the president's appreciation of these three comedians totally makes sense.\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nThe Andy Griffith Show ran from 1960 to 1968. Obama was born in 1961, and likely grew up watching the antics of Sheriff Andy and his son Opie. And when he was in his midtwenties, Obama might've been just as captivated with Griffith's crime drama Matlock , which ran from 1986 to 1995, when the president was at Harvard Law School and the University of Chicago Law School.\nObama paid tribute to Griffith with the following statement:\nA performer of extraordinary talent, Andy was beloved by generations of fans and revered by entertainers who followed in his footsteps. He brought us characters from Sheriff Andy Taylor to Ben Matlock, and in the process, warmed the hearts of Americans everywhere.\nObama was probably one of those Americans.\nBryan Bedder/Getty Images Entertainment/Getty Images\nGhostbusters came out in 1984, when Obama was 23 and working for the New York Public Interest Research Group, spearheading efforts to reform the New York City subway system. And when Ramis' directorial masterpiece Groundhog Day came out nine years later, it probably blew Obama's mind — just like it did with every other person in the universe.\nObama even paid homage to Caddyshack in the last line of his statement remembering Ramis:\nMichelle and I were saddened to hear of the passing of Harold Ramis, one of America's greatest satirists, and like so many other comedic geniuses, a proud product of Chicago's Second City. When we watched his movies — from Animal House and Caddyshack to Ghostbusters and Groundhog Day — we didn't just laugh until it hurt. We questioned authority. We identified with the outsider. We rooted for the underdog. And through it all, we never lost our faith in happy endings. Our thoughts and prayers are with Harold's wife, Erica, his children and grandchildren, and all those who loved him, who quote his work with abandon, and who hope that he received total consciousness.\nLast but not least, Obama is evidently an avid Williams fan, well-illustrated by his knowledge of the actor's extensive oeuvre.\n\"Robin Williams Was an Airman\"\nCritics have called Williams' performance in Good Morning, Vietnam (1987) his breakout role. Portraying real-life airman Adrian Cronauer, Williams played a DJ assigned to Air Force radio station who shakes things up with his irreverent broadcasts.\n\"A Doctor\"\nWilliams turned on the waterworks for millions of people as unconventional but inspirational doctor Patch Adams, who used humor to treat his patients in the 1998 movie of the same name. Eight years earlier, he played a doctor in the drama Awakenings, about catatonic patients who briefly come back as their normal selves.\n\"A Genie\"\nWho didn't love Aladdin? Nobody who's seen it, that's for sure.\n\"A President\"\nIn the 2006 film Man of the Year, Williams plays a comedian and talk show host, based on Jon Stewart, who decides to run for president. Obviously, Obama was going to love every minute of it.\n\"A Professor\"\nKate Jones on YouTube\nO Captain, my Captain! Arguably the best movie ever made about academia, Dead Poets Society's climactic ending still gives me chills to this day. Williams plays a literature professor who forever changes the lives of a group of students.\n\"A Bangarang Peter Pan\"\nA childhood favorite of mine, Hook was Steven Spielberg's 1991 take on Peter Pan. Williams plays a grown-up version of Peter, who returns to Neverland to not only save his children from Captain Hook but to find his inner child again.\n\"He Arrived in Our Lives as An Alien\"\nWilliams' introduction to American audiences was on the small screen in Mork & Mindy as the alien Mork from Ork. Even back then, it was obvious Williams was one of a kind.","url":"https://www.bustle.com/articles/35465-obamas-very-rare-statement-on-robin-williams-tragic-death-spoke-volumes"}
