{"authors":["Merrit Kennedy"],"date_download":"2018-10-23 05:18:23","date_modify":"2018-10-23 05:18:23","date_publish":"2016-12-01 00:00:00","description":"The future of the rule is extremely uncertain. Even if the Obama administration wins its appeal, the incoming Trump administration has already threatened to scrap the measure.","filename":"data/vaneerConsumption/ObamaAdministrationAppealsJudgesRulingToBlockOvertimePayRule.json","image_url":"https://media.npr.org/assets/img/2016/12/01/ap_16328044806598_wide-d0c2943a374e7113ba525cd2671986fa33aa882b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_12_01_504012412_obama-administration-appeals-judges-ruling-to-block-overtime-pay-rule_1540271903.html","title":"Obama Administration Appeals Judge's Ruling To Block Overtime Pay Rule","title_page":"Obama Administration Appeals Judge's Ruling To Block Overtime Pay Rule : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Obama Administration Appeals Judge's Ruling To Block Overtime Pay Rule\nEnlarge this image toggle caption Ben Margot/AP Ben Margot/AP\nThe Obama administration is challenging a federal judge's decision last month to block the implementation of a new rule that would have made 4 million more Americans eligible for overtime pay.\nThe Department of Labor and its co-defendants filed a notice of appeal at the U.S. District Court for the Eastern District of Texas on Thursday, the same day that the rule was set to take effect before the temporary injunction was issued.\n\"The Labor Department's sweeping overhaul to the overtime rule required employers to pay time-and-a-half to their employees who worked more than 40 hours in a given week and earned less than $47,476 a year,\" The Two-Way reported. \"That salary threshold is about twice what currently allows workers to be exempted from overtime.\"\nTwenty-one states and several industry group sued to block the rule, and U.S. District Judge Amos Mazzant III issued a preliminary injunction on Nov. 22.\nSupporters of the new rule said it was necessary to keep up with inflation and helped low-income workers in a concrete way. As we've reported, the judge's ruling sided with \"plaintiffs who said the new overtime rules would have caused an uptick in government costs in their states and made it mandatory for businesses to pay millions in additional salaries.\"\nNPR's Scott Horsley quoted White House spokesman Josh Earnest as saying the Obama administration isn't giving up:\n\"That injunction was granted to some large businesses and Republican governors who had colluded to try to disrupt the implementation of this rule. And essentially continue to take advantage of more than 4 million of the hardest-working Americans.\"\nThe future of the rule is extremely uncertain. Even if the Obama administration wins its appeal, the incoming Trump administration has already threatened to scrap the measure.","url":"https://www.npr.org/sections/thetwo-way/2016/12/01/504012412/obama-administration-appeals-judges-ruling-to-block-overtime-pay-rule"}
