{"authors":[],"date_download":"2018-10-30 01:15:34","date_modify":"2018-10-30 01:15:34","date_publish":"2017-01-12 00:05:56","description":null,"filename":"data/vaneerConsumption/ObamaIsraelandPalestineItstheIdeologyStupid.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/Barack_Obama_in_Phnom_Penh_talking_to_Benjamin_Netanyahu.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862134.html","title":"Obama, Israel, and Palestine: It’s the Ideology, Stupid!","title_page":"Obama, Israel, and Palestine: It’s the Ideology, Stupid!The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“When the chips are down, I have Israel’s back,” President Obama promised AIPAC. Four years later, in December 2016, no longer needing Jewish votes or dollars, he decided to publicly support the Palestinians. Obama kneecapped Israel, allowing the passage of UN Resolution 2334, declaring that biblical Judea and Samaria (a.k.a. West Bank) and their holy sites, the ancestral homeland where Jews have lived and prayed for 3000 years, are all Palestinian territory. Any Jewish settlement there is illegal and must end.\nObama’s action reversed 44 years of America using its veto to protect Israel from the UN Security Council jackals.\nSeven decades of violent Palestinian rejection of the Jewish state’s right to exist doesn’t matter to Obama.\nHe certainly knows that Palestinian Arabs rejected statehood in 1947, 2000, 2001, and 2008.\nHe knows that the Palestine Liberation Organization (PLO), now headed by Mahmoud Abbas, was founded in 1964 for the purpose of liberating Mandatory Palestine through armed struggle, i.e. eliminating Israel. This was three years before Israel gained Judea and Samaria in a defensive war.\nHe knows that Israel evacuated all of its settlements from Gaza, creating a de facto Palestinian state. It was rewarded with a Hamas terror state, 20,000 rockets and hundreds of terror tunnels.\nAnd he knows that Israel complied with Obama’s demand to stop all settlement building in 2010, but the Palestinians still refused to come to the negotiating table.\nSo why did Obama act in defiance of historical facts and logic?\nIn his autobiography, Dreams from My Father, Obama chooses his father, Barack Hussein Obama, Sr., an avowed anti-colonialist and socialist, as his role model. “It was into my father’s image, the black man, son of Africa, that I’d packed all the attributes I sought in myself.” President Obama has called himself an internationalist devoted to strengthening multilateral organizations like the UN. He embraces a progressive ideology dividing the world into colonizers and colonized, victimizers and victims, powerful and powerless. The weak have an unlimited right to “resist” by any means.\nObama and other postcolonialists blame all inequities in the world on the moral failure of Western civilization — on its nationalism, colonialism, and racism — and argue for political engagement on behalf of the oppressed and exploited. To them, the West is inherently evil while purity and goodness reside in other cultures. They view the world not as poor-against-rich or worker-against-capitalist, but as “people of color” against the “white man.” The goal is social justice for the non-white oppressed. For them, Palestinians are a prime example of “noble people of color” struggling against “Western imperialistic injustices.”\nPostcolonialists’ passion for the “virtuous” Palestinians reigns supreme and all manner of Palestinian behavior (cult of martyrdom, misogyny, homophobia, terrorism, corruption) emanate from Western colonialism and, therefore, is morally justified. They believe Palestinians can’t be expected to behave according to Western standards. This infantilization of the Palestinians is, indeed, a progressive racism of low expectations.\nObama ignores inconvenient facts and history, believing that supporting the Palestinians is synonymous with promoting racial equality and the aspirations of the oppressed. In his Dreams from My Father, Obama, inspired by Franz Fanon, identifies with “the desperation and disorder of the powerless” and understands “how easily they slip into violence and despair.” According to Obama, his goal of a Palestinian state remains unfulfilled because of Israel’s alleged occupation.\nAs for the Jews of Israel, postcolonialists view them as part of the “white” oppressor class, “settler colonialists” and “occupiers” in that portion of the Arab Middle East properly belonging to the embattled, oppressed Palestinians. Obsessive hatred of Israel, therefore, is viewed as “justifiable.”\nSeen through this lens, Obama, like others on the left, holds both Israel and America culpable for what he believes is the long-term oppression of the Palestinians and the occupation of their land. Ironically, though his goal is to create a Palestinian state, his actions at the UN make that more unlikely than ever. This resolution will embolden the Palestinians and their allies to continue to pursue their boycott, divestment and sanctions (BDS) effort, attack Israel in international courts and forums, and demand the creation of a Palestinian state by UN diktat rather than by direct negotiation between the parties. As for Israelis, they are more convinced than ever that the two-state solution has always been a myth.\nThe “chips were down,” and Obama didn’t “have Israel’s back” when he supported Resolution 2334. Some believe this action represents the settling of a score with Prime Minister Netanyahu. But fundamentally, it is Obama’s ideology that explains both his animosity and his ultimate betrayal. A faulty political philosophy, combined with hubris, can lead to disastrous policy and leave a legacy in tatters.","url":"https://spectator.org/obama-israel-and-palestine-its-the-ideology-stupid/"}
