{"authors":["Neil Munro"],"date_download":"2018-10-30 19:10:23","date_modify":"2018-10-30 19:10:23","date_publish":"2015-11-04 18:04:00","description":"Obama's DHS Plans Invite For New Wave of Foreign Professionals","filename":"data/vaneerConsumption/ObamasDHSPlansInviteNewWaveofForeignProfessionals.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-487611432-millennials.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_04__1540926623.html","title":"Obama's DHS Plans Invite New Wave of Foreign Professionals","title_page":"Obama's DHS Plans Invite New Wave of Foreign Professionals","title_rss":"NULL","source_domain":"breitbart.com","text":"The Department of Homeland Security is officially disavowing the agency’s June memo that recommended U.S. employers be allowed to quickly hire legally visiting foreign professionals and foreign graduates and to bench job-seeking American millennials.\nBut agency officials are developing a regulation on a similar topic, said Todd Breasseale, the department’s acting Assistant Secretary for Public Affairs. “The regulation that we ARE working on involves high-skilled foreign workers who are lawfully present,” he added, without explaining how the developing regulation and the June memo are any different.\nThe June memo, he said, “is absolutely not something we are even contemplating.”\nBreasseale’s reference to a new foreign-worker giveaway may refer to a proposed regulation now outlined on a government website, said Ian Smith, a lawyer with the Immigration Reform Law Institute. The announcement “has been up for a few months…. [but] details are nil,” he said.\nThe government’s website says;\nThe Department of Homeland Security (DHS) is proposing to modernize the immigrant visa system by amending its regulations governing the adjustment of status process and employment-based immigration. Through this rule, DHS proposes to allow certain approved Immigrant Petition for Alien Worker (Form I-140) beneficiaries to obtain work authorization, clarify the meaning of portable work authorization, and remove unnecessary restrictions on the ability to change jobs or progress in careers, as well as provide relief to workers facing lengthy adjustment delays.\nThose details are compatible with Option Two in the June DHS memo, which recommended that employers be allowed to hire roughly three million foreign white-collar and blue-collar workers now living legally in the United States. The memo was revealed by Breitbart News.\nThe three million total includes roughly 1.5 million foreign college-graduates, which is almost equal to the 1.8 million Americans who will graduate from four-year colleges each year. In addition, another one million guest-workers and foreign college students annually arrive in the United States. All would be able to get work-permits, if Obama approves the June memo or a similar regulation.\nPressed by Breitbart, Breasseale insisted the pending regulation and the June plan are different.\n“They are wholly separate – in substance, in authority, and in applicability. They simply are not the same thing… [and] we do not discuss the substance of pending regulations publicly until they are published,” he said.\nWhen asked for evidence that the June memo has been sidelined, he evaded. “The fact that it was never acted upon is more than sufficient,” he insisted.\nBut the administration has persistently used the regulatory process to distribute work-permits — dubbed EADs, for Employment Authorization Documents — to increase the inflow of foreign migrants, both white-collar and blue-collar.\nIn 2011, or earlier, Obama decided to let Central American migrants cross the border and get work-permits. Since then, at least 240,000 migrant adults, youths, and children have crossed the border, and only a few thousand have been sent home.\nIn 2011, Obama begins implementing the so-called “Morton Memos,” which have sharply rolled back enforcement of immigration law. By 2015, less than one percent of the roughly 12 million migrants living and working in the United States were being sent home each year by deportations.\nIn June, 2012, Obama claimed he could provide work permits to at least 700,000 younger illegals, via the so-called Deferred Action For Childhood Arrivals program.\nIn February 2014, Obama unilaterally decided to award-work permits to the spouses of the roughly 650,000 H-1B guest-workers who are resident in the United States.\nIn November 2014, Obama announced he would provide work-permits to an additional four million illegals, via the Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA.\nIn May 2015, Obama’s deputies also announced they would give longer-term work-permits to many thousands of foreign students via the Optional Practical Training guest-worker program.\nThese amnesties and give-aways added up to a huge wave of foreign workers. In 2013, Obama allowed 2.1 million new foreign workers to begin working in the United States, just as 4.4 million high-school and college grads began looking for work. That’s two foreign workers for every four four Americans youths or millennials. In 2013, wages stalled, the number of Americans with jobs fell, profits spiked, and so the stock market boomed.\n“The common thread among all the EAD giveaways… [is the claim that] Sec. Johnson [has] absolute discretionary power to give out EADs to whomever he wants,” said Smith.\nThat argument is being used to legally defend Obama’s November amnesty in the Texas lawsuit, Smith said.\n“That is the same argument they’re using in a case of ours called SaveJobsUSA v. DHS, currently before the DC District Court,” he said. His case argues that Obama can’t legally provide work-permits to the spouses of the roughly 90,000 H-1B guest-workers who arrive each year.\n“If we win [on that point], we’ll help Texas, and vice versa,” Smith said.\nBreasseale’s defensive denunciation of the memo is likely linked to the administration’s legal defense in the Texas court case that has frozen Obama’s November 2014 amnesty.\nHe twice insisted that the administration does not intended to mess with the court’s review of the November amnesty.\nDuring the initial hearings, the judge summoned DBS Secretary Jeh Johnson to his court after discovering he had been mislead by Obama’s lawyers.\nThe Texas judge froze Obama’s amnesty, pending a full trial and decision. Obama’s lawyers have appealed the injunction. The appeals court judgement is expected shortly. Most observers expect the appeals court to uphold the injunction that blocks the president’s November 2014 amnesty.\nThe new memo “has nothing to do with the Texas court injunction,” Breasseale said.\n“We’d never undertake any action to violate a court’s order,” he said.\nIf it had not been blocked by the court, Obama’s November amnesty would have provided work-permits to roughly five million illegal immigrants, including many graduates and younger migrants.","url":"https://www.breitbart.com/politics/2015/11/04/obamas-dhs-plans-work-permit-give-away-foreign-professionals/"}
