{"authors":[],"date_download":"2018-10-22 21:47:37","date_modify":"2018-10-22 21:47:37","date_publish":"2014-06-06 13:39:36","description":"The White House said Obama and Putin had had \"an informal conversation\" on the margins of a lunch attended by world leaders.","filename":"data/vaneerConsumption/ObamaandPutinChatonSidelinesofDDayAnniversaryLunch.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/492046/140606-obama-putin-cover-10a_47c7dbf01ed7039e60b3492a47a2c490.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_obama-putin-chat-sidelines-d-day-anniversary-lunch-n124411_1540244857.html","title":"Obama and Putin Chat on Sidelines of D-Day Anniversary Lunch","title_page":"Obama and Putin Chat on Sidelines of D-Day Anniversary Lunch","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama and Russia's President Vladimir Putin met Friday on the sidelines of D-Day anniversary events in France, the first face-to-face contact between the two leaders following months of tension.\nThe commemorations of the 70th anniversary of the D-Day invasion have been closely watched for signs of interaction between the two leaders, who have traded barbs but not seen each other since the Ukraine crisis erupted.\nThe White House said Friday that Obama and Putin had had \"an informal conversation - not a formal bilateral meeting\" on the margins of a lunch attended by world leaders.\nPutin's spokesman Dmitry Peskov said that the two had spoken about the situation in Ukraine and violence in the east, according to The Associated Press.\nPutin and Obama — who has described the relationship between the two as \"businesslike\" - earlier had appeared to avoid each other during a carefully-choreographed group photo of the assembled leaders.\nPutin also shared a moment Friday with Ukraine's president-elect Petro Poroshenko. The animated conversation lasted about a minute, and the men did not shake hands in public.\nRelations between Russia and the U.S. have been strained by Moscow's annexation of the Ukrainian peninsula of Crimea and alleged involvement in violence in the east of the country.\nEarlier this week, Obama and key Western allies met at the G-7 summit in Brussels where the crisis in Ukraine was top of the agenda.\nRussia was excluded from the meeting, marking the first time the nation was not present in 17 years.\nAt the G-7, leaders opened a pathway for Russia to ease tensions in Ukraine and the U.S. president urged Putin to enter talks with Poroshenko.","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/obama-putin-chat-sidelines-d-day-anniversary-lunch-n124411"}
