{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 20:00:28","date_modify":"2018-10-30 20:00:28","date_publish":"2015-01-05 19:31:38","description":"President Obama and daughters Sasha and Malia visited Pearl Jam frontman Eddie Vedder at his house in Kailua on the last day of the first family's two-week Hawaii vacation.","filename":"data/vaneerConsumption/ObamaVisitsPearlJamFrontmanEddieVedder.json","image_url":"https://media.breitbart.com/media/2015/01/Eddie-Vedder-Obama-Reuters-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_05__1540929628.html","title":"Obama Visits Pearl Jam Frontman Eddie Vedder","title_page":"Obama Visits Pearl Jam Frontman Eddie Vedder","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama and daughters Sasha and Malia visited Pearl Jam frontman Eddie Vedder at his house in Kailua on the last day of the first family’s two-week Hawaii vacation.\nAccording to the Associated Press, the President’s Saturday visit with the rocker lasted less than half an hour. Earlier in the day, Obama visited the cemetery where his mother’s father is buried and visited his sister Maya Soetoro-Ng.\nVedder performed in support of Obama at a 2012 re-election campaign stop in Tampa. As Bloomberg notes, Vedder took the opportunity at the event to slam then-Republican presidential nominee Mitt Romney over his infamous 47 percent comment, saying it was “very upsetting to hear a presidential candidate be so easily dismissive of such a ginormous amount of the population.”\nVedder also hasn’t been shy about offering his take on gun control; in 2013, he told the Sydney Morning Herald: “I get so angry that I almost wish bad things on these people [gun rights advocates],” Vedder said. “But I don’t have to because it seems like they happen anyways.”\nPearl Jam’s Vitalogy Foundation contributes to nonprofits in the fields of community health, the environment, and social change, while “carbon mitigation” is listed as a band cause on Pearl Jam’s website.\n“The band allocates a portion of tour profits to invest in various environmental projects that serve to offset or mitigate the carbon dioxide that was released into the atmosphere,” according to the website.\nThe Obamas arrived back in Washington on Sunday but will not be in town long; on Wednesday, the President begins a three-day, three-state tour to talk about the country’s progress in advance of the 2015 State of the Union Address.","url":"https://www.breitbart.com/politics/2015/01/05/obama-hangs-out-with-eddie-vedder-on-last-day-of-hawaii-vacation/"}
