{"authors":[],"date_download":"2018-10-22 23:04:28","date_modify":"2018-10-22 23:04:28","date_publish":"2014-05-13 16:45:38","description":"“The closer we get to the midterm elections, the harder it is to get things done around here,” he said before a meeting with law enforcement officers.","filename":"data/vaneerConsumption/ObamaNarrowWindowLeftForImmigrationReformThisYear.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_21/440036/140513-obama-immigration-jms-1612_53aaec10903d8f1770ce5ef78474c735.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_white-house_obama-narrow-window-left-immigration-reform-year-n104321_1540249468.html","title":"Obama: 'Narrow Window' Left For Immigration Reform This Year","title_page":"Obama: 'Narrow Window' Left For Immigration Reform This Year","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama made yet another pitch for comprehensive immigration reform Tuesday, saying that there’s a “narrow window” of two to three more months for legislative action in the GOP-led House this year.\n“The closer we get to the midterm elections, the harder it is to get things done around here,” he noted in remarks before a meeting with law enforcement officers in Washington D.C.\nObama reiterated that he backs the “core principles” of a bipartisan Senate bill that passed the upper chamber last year but has languished in the House without a vote.\n“We’re not hellbent on making sure that every letter of what’s in the Senate bill is exactly what lands on my desk for a signature,” he said, adding that parts of the legislation – including a path to citizenship for most undocumented immigrants – are crucial.\nSome advocates are still optimistic that House Speaker John Boehner will allow a vote on at least some pieces of immigration legislation.\nThe Ohio Republican said Monday that he “feels strongly” about dealing with reform but acknowledged tough resistance from many in his party who call the law \"amnesty\" that unfairly rewards those who broke the law. And he repeated his often-cited argument that many members of the GOP conference don’t trust the president to enforce any immigration law that is passed, saying he’s “put the ball back in the president’s court.\"","url":"https://www.nbcnews.com/politics/white-house/obama-narrow-window-left-immigration-reform-year-n104321"}
