{"authors":["Staff","Wire Reports"],"date_download":"2018-10-30 19:16:40","date_modify":"2018-10-30 19:16:40","date_publish":"2014-05-07 00:00:00","description":"President Barack Obama, along with several Arkansas dignitaries, toured tornado-damaged areas and visited with residents and responders in Vilonia on Wednesday.","filename":"data/vaneerConsumption/ObamatoursArkansastornadodamage.json","image_url":"https://media.arkansasonline.com/img/photos/2014/05/07/Obama_Hood_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_may_07__1540927000.html","title":"Obama tours Arkansas tornado damage","title_page":"Obama tours Arkansas tornado damage","title_rss":"NULL","source_domain":"arkansasonline.com","text":"President Barack Obama shakes hands with Col. Patrick Rhatigan, Commander, 19th Airlift Wing & Little Rock AFB, and gives him a challenge coin after Obama arrives at Little Rock Air Force Base on Wednesday, May 7, 2014. Obama is visiting with first responders and families affected by the recent tornadoes.\n3:30 p.m. pool update:\nPresident Obama began his remarks at 2:30 p.m. standing at a podium in the middle of a street. The president was flanked by Gov. Mike Beebe, Sen. Mark Pryor, Rep. Tim Griffin and Vilonia Mayor James Firestone.\nThe president, standing in front of a clean slab of a home destroyed by the tornado, began by remarking on his tour of the damage.\n\"Obviously we just had a chance to tour some of the areas that were devastated by last week's tornadoes,\" Obama said.\nHe thanked the workers and volunteers who have been helping clean up the damage as well as Beebe, Pryor, Griffin and Firestone.\n\"They all showed great leadership and were here on the ground in these difficult days,\" Obama said.\nThe president also told those gathered that the federal government would remain in the area helping residents and businesses owners rebuild.\nHe summarized the federal disaster declaration for Faulkner County and other damaged areas and mentioned FEMA director Craig Fugate's visit in the days after the storms.\n\"Here in Vilonia, the recovery process is just beginning,\" Obama said.\n\"Folks here are tough. They look out for each other. That's been clear over this past week,\" he said.\nHe then mentioned one volunteer, 16-year-old Casey Williams, who the president said embodied the spirit of the volunteers who have come to help the town. She was such a determined volunteer that at one point, state troopers even took orders from her, Obama said of Williams.\nHe then mentioned another man whom he spoke with earlier Wednesday. The man told the president: \"We just say a prayer and then get to work,\" the president recalled.\n\"A lot of work remains to be done, but I'm here to remind you that you're not in this alone,\" the president said.\nObama also said that he would be working with Beebe, Griffin and Pryor to come up with a way to help Vilonia with one of Firestone's concerns — the loss of the city's sales-tax base due to the storm.\nThe president closed his remarks by saying that he was inspired by the attitudes of the volunteers, rescue workers and family members of victims that he met Wednesday.\n\"It's a reminder that as important as possessions are, nothing's more important than family,\" the president said.\n\"I could not be more proud of everybody that's participated in this recovery,\" he said.\nObama ended his remarks at 2:35 p.m., and the motorcade departed the subdivision at 2:38 p.m.\nThe president boarded Marine One and it departed at 2:47 p.m.\n— Chad Day/ Arkansas Democrat-Gazette\n3:09 p.m. pool update:\nAt 2:22 p.m., Obama continued on down the street after talking with the men by the trackhoe.\n\"How are you guys?\" the president called to a man and two boys.\n\"Man, it's good to see you sir,\" Daniel Smith said as the president shook his hand. \"We're glad you're here.\"\nThe president talked with Smith and the two boys, Garrison and Gabriel Dority, and asked the boys for their ages. Six and nine, they replied.\nObama laughed as he continued talking with Smith out of the earshot of reporters.\nAt one point, the president could be heard asking Smith: \"Where were you when all this happened?\"\nSmith replied that he was at a newly built shelter at Vilonia High School, where about 300 people sheltered the night of the storm.\nAs the president talked with Smith and the two boys, one of the boys held a white, toy car. The other leaned against the man, and looked up at the president as they talked.\nThe president then asked Smith which house he lived in. Smith gestured down the street where some homes still had walls standing.\n\"You guys are one of those that kind of stayed up,\" the president said.\nSmith wore a maroon shirt with \"Peace, Love and PTA,\" written in yellow on the back.\nThen Obama posed for a picture with Smith and the boys. All four smiled.\n— Chad Day/ Arkansas Democrat-Gazette\n3 p.m. pool update:\nAt 2:14 p.m., the president's motorcade departed from Vilonia City Hall and traveled east on Main Street past more gathered sightseers and residents. The motorcade then turned north on Naylor Road and went to the hard-hit Parkwood Meadow subdivision, where dozens of houses were leveled. The president passed by slabs where homes once stood just a little more than a week ago.\nOut front of one demolished home, an American flag flapped in the wind as workers and construction crews paused from their cleanup to wave at the motorcade. Debris piles — some more than 10 feet high — were heaped on the east side of the road. Most were splintered lumber and metal, and one included a green child's slide and playground equipment.\nObama's motorcade turned into the damaged subdivision and pulled to the end of the cul de sac.\nIn the subdivision, on one side of the street, some homes were largely unblemished. On the other side, most had been wiped clean to their slabs by the massive storm.\nAmong the debris a man stood with two boys leaned against his body as the president passed by in a black SUV.\nAt 2:20 p.m., the president exited the motorcade at the end of the cul de sac along with Gov. Mike Beebe, Sen. Mark Pryor, Rep. Tim Griffin and Vilonia Mayor James Firestone.\nObama stopped and shook hands with Firestone and put his hands on his hips as he listened to the mayor out of earshot of reporters.\nObama — who wore a light-colored button down shirt and khaki pants — then walked down the street between piles of debris and destroyed homes. He then talked with Griffin and both gestured to the damage areas and a pile of mangled lumber and metal.\nThe president then walked down the street with Pryor, Griffin and Beebe listening to Firestone. Obama then broke away from the group and called out to two men in work clothes who stood near a trackhoe amid the debris. “How are you all doing?,” Obama asked the men. He then shook their hands and talked with them. Most of the conversation was out of earshot of reporters, but the president could be heard asking one of the men a question.\n“Is anybody else at the hospital?,” Obama asked.\n“My wife and my son,” the man replied.\nThe president then talked for a few minutes with the men out of earshot of reporters before moving on down the street.\n— Chad Day/ Arkansas Democrat-Gazette\n2:05 p.m. pool update:\nGov. Mike Beebe, Sen. Mark Pryor and U.S. Rep Tim Griffin flew over the damaged areas with President Obama in Marine One. The flight lifted off from Little Rock Air Force Base then traveled over western Pulaski County and Mayflower where there was severe tornado damage. The flight then continued to Vilonia where Obama surveyed the damage from the air before landing. Beebe, Pryor and Griffin then joined the president as he met with first responders in Vilonia City Hall. Obama also met privately with families.\n— Chad Day/ Arkansas Democrat-Gazette (Dignitary information via Beebe spokesman Matt DeCample)\n1:49 p.m. pool update:\nWhile President Obama visited with first responders inside Vilonia City Hall, a group of more than 100 gathered at the nearby Vilonia Fire Station, where rescuers scrambled to aid victims on the night of the April 27 storm. On the night of the storms, the fire station was turned into an operations center where volunteer firefighters from several area agencies gathered briefly and then split up into teams to search the damaged homes and businesses for survivors. At City Hall, that same night, Vilonia Fire Chief Keith Hillman walked from room-to-room, directing rescue crews into the late hours of the morning.\nOn Wednesday at city hall, Obama visited privately with first responders, families affected by the tornado and recovery workers.\nThe presidential motorcade waited outside, about a hundred yards from the gathering of residents on Wednesday, nearly all of whom took pictures with their cell phones. Some carried signs and others waited, leaning on cars and standing in the shade of large trees where a flag flew at half-staff.\n— Chad Day/ Arkansas Democrat-Gazette\n1:19 p.m. pool update:\nMarine One landed at 1:03 p.m. CDT. in a field near Vilonia schools where children and teachers stood outside and cheered.\nThe president departed Marine One at 1:06 p.m. Obama was greeted by a marine in full dress. He saluted and the president talked with staff members. Then he got into a black sport utility vehicle and joined the motorcade.\nPeople gathered all along Main Street in Vilonia, waving to Obama and taking pictures and video with their cameras. Some children held blue Obama-Biden campaign signs near the Vilonia Fire Department as the motorcade passed. Obama arrived around 1:11 p.m. at Vilonia City Hall, where he is scheduled to meet privately with first responders.\n— Chad Day/ Arkansas Democrat-Gazette\nEARLIER:\nJACKSONVILLE — President Barack Obama has arrived at Little Rock Air Force Base ahead of his planned tour of tornado damage in Arkansas.\nAir Force One landed around midday Wednesday. After exiting the plane, Obama greeted Gov. Mike Beebe, U.S. Sen. Mark Pryor, Congressman Tim Griffin and other leaders.\nThe White House says Obama plans to meet with families who were affected by the tornado, first responders and recovery workers.\nWednesday's visit marks Obama's first trip to Arkansas since becoming president. He last visited the state during Beebe's successful campaign for governor in 2006.\nThe president is making the stop in Arkansas while on his way to California, where he will raise money for the Democratic Party and receive an award from a foundation created by movie director Steven Spielberg.\n— The Associated Press","url":"https://www.arkansasonline.com/news/2014/may/07/obama-arrives-arkansas-tornado-damage-tour/"}
