{"authors":[],"date_download":"2018-10-30 14:29:40","date_modify":"2018-10-30 14:29:40","date_publish":"2014-09-22 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaisRoostingAmericasChickens.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_09_obama_is_roosting_americas_chickens_comments_1540909780.html","title":"Obama is Roosting America's Chickens","title_page":"Articles: Obama is Roosting America's Chickens","title_rss":"NULL","source_domain":"americanthinker.com","text":"In the words of Reverend Jeremiah Wright, “America’s chickens are coming home to roost” – but not for the reasons Wright was referring to. Instead, these chickens are the result of Barack Obama’s policies, which are so detrimental to the health, safety, and wellbeing of the American people that now the most innocent and helpless among us are suffering the ramifications of a social experiment run amok. It’s not bad enough that it’s only a matter of time before unknown numbers of people are murdered by a terrorist attack everyone agrees is inevitable. Nor is it horrifying enough that ISIS has threatened to execute random attacks on innocent Americans and kill military personnel while they sleep in their beds. Does the president even care that an illegal teenage assassin from a Mexican drug cartel is at large somewhere in America, and known murderers, sex offenders, and all-around bad guys are running loose in the streets... (Read Full Article)","url":"https://www.americanthinker.com/articles/2014/09/obama_is_roosting_americas_chickens_comments.html"}
n addition to violent gang members and criminals being waved through, individuals with very dangerous communicable diseases are strolling from Latin America directly into the border states.\nAs a result, it’s taken only a few short months for Obama’s chicken-roosting to take the form of thousands of defenseless American children being infected with pathogens shared by hosts who shouldn’t be in this country in the first place.\nFor starters, in 18-plus states, there are children infected with a respiratory virus that makes it hard to breathe. Enterovirus DV-68, which is rare here but common in Latin America, is causing some children to turn blue, requiring hospitalization and intubation.\nAnd still the border remains open.\nAdding insult to injury, there is now a disturbing report out of the border state of Texas that more than 700 infants and 40 employees in El Paso’s Providence Memorial Hospital have been exposed to tuberculosis. The culprit is an anonymous hospital employee, who was probably helping the American economy by doing jobs unemployed Americans would love to do.\nThat’s right – 700 infants swaddled in receiving blankets, lying in hospital bassinets, are the newest victims of an ideology-driven president who has placed the wants and desires of illegal invaders above the welfare of vulnerable newborn babies.\nHospital officials have not identified the female nursery worker who coughed and sneezed all over infants and hospital workers. However, what they are saying is that the exposure took place over the course of one year, and that those exposed to an infection that is often resistant to antibiotics were identified via employment and medical records.\nCarrie Williams, spokeswoman for the Texas Department of State Health service, warned that \"[t]his is an incredibly large exposure investigation, and it involves infants, so it is particularly sensitive.” Carrie did admit that \"[b]abies are more likely than older children and adults to develop life-threatening forms of TB.\"\nAccording to the health authority for El Paso County, Dr. Hector Ocaranza, while sick “unaccompanied minors” and individuals with MDR-TB, malaria, swine flu, and very possibly Ebola continue to stream into our nation, officials are awaiting results from the tests Providence Memorial hospital workers took to determine who contracted an illness that can be fatal if not treated.\nThe parents of the newborns who were exposed to TB have been directed by health officials to have their children screened, which is something many “unaccompanied minors” from Latin America didn’t have to submit to before being relocated all over the United States by an illegal immigrant-friendly Obama administration.\nDownplaying the gravity of needlessly exposing 740 innocent people to a dangerous bacterial lung infection that can lie dormant for years, Barack Obama water carrier Hector Ocaranza reassured the concerned public that despite the president’s careless disregard for the security of the American people, TB, just like Enterovirus 68, although dangerous, is treatable and does not represent a threat to public health.\nIf that’s true, Dr. Ocaranza, why did 740 people require testing?\nNonetheless, as we wait for the next infectious disease outbreak, random ISIS beheadings, or, worse still, a small nuke in a major American city, America continues to be inundated with large numbers of psychopaths and pathogens, all of which are actively assisting in Obama’s roosting of America’s chickens.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2014/09/obama_is_roosting_americas_chickens.html"}
