{"authors":["John Hayward"],"date_download":"2018-10-30 19:57:31","date_modify":"2018-10-30 19:57:31","date_publish":"2015-01-21 17:43:27","description":"\"As a new generation of veterans comes home, we owe them every opportunity to live the American Dream they helped defend,\" said President Obama in his 2015 State of the Union address on Tuesday night. He praised a national campaign organized by First Lady Michelle Obama and Dr. Jill Biden for helping \"nearly 700,000 veterans and military spouses get new jobs,\" asserting that \"already, we've made strides\" to improve life for veterans in America. |","filename":"data/vaneerConsumption/ObamaToutsVAReforminStateoftheUnionbutHeHasNothingtoBragAbout.json","image_url":"https://media.breitbart.com/media/2015/01/AP221984447186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_21__1540929451.html","title":"Obama Touts VA Reform in State of the Union, but He Has Nothing to Brag About","title_page":"Obama Touts VA Reform in State of the Union, but He Has Nothing to Brag About | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“As a new generation of veterans comes home, we owe them every opportunity to live the American Dream they helped defend,” said President Obama in his 2015 State of the Union address on Tuesday night.\nHe praised a national campaign organized by First Lady Michelle Obama and Dr. Jill Biden for helping “nearly 700,000 veterans and military spouses get new jobs,” asserting that “already, we’ve made strides” to improve life for veterans in America.\nIn reality, of course, the Veterans’ Affairs Department nightmare evolved into a massive crisis while Barack Obama was asleep at the wheel, his empty rhetoric from 2008 about reforming the VA long forgotten.\nWhen investigative reporting from CNN blew the problem into a front-page political crisis, Obama spent weeks fidgeting, tap-dancing, concocting excuses, and trying to figure out a way he could avoid conceding the issue was serious by sacking anyone important. Scandal protocols are one of the few responsibilities this President takes seriously, and his standard damage-control technique involves hunkering down and waiting for the news cycle to roll along. Contrary to old Washington wisdom about getting out in front of scandals and marching out fall guys to take the heat, Team Obama seems to believe there is nothing worse that putting blood in the water by giving high officials pink-slip paper cuts. In the end, there was no way to ignore the VA scandal to death, so Secretary Eric Shinseki got the boot, along with a few other officials.\nWe are now expected to forget all that and heap praise upon Barack the Backlog-Slasher. That probably wasn’t the first thought on the minds of anyone standing outside the Phoenix VA clinic, ground zero of the death-list scandal, when Obama’s motorcade blew past en route to a photo op last week, without even slowing down.\nObama’s big accomplishment to date is getting the VA scandal out of the news. The scandal isn’t really over yet. During the Christmas holiday, the New York Times reported on the discovery of documents proving that top VA officials knew about excessive wait times and treatment backlogs long before the secret-death-list scandal exploded in the media. There was a specific directive in place to prevent the creation of secret treatment lists, which suggests authorities knew it was a problem. When a whistleblower reported the Phoenix VA was not in compliance with this directive, she was “pressured by other officials to say that it was compliant.” The Times notes that only after a new Secretary of Veterans’ Affairs was appointed did the department announce it needed an extra 28,000 doctors to satisfy demand: “It has not been said whether these shortfalls were previously discussed at high levels inside the department or the Obama administration.”\nAnd the waste at the expense of veterans continues. Writing at the Arizona Republic in December, Brahm Resnik pronounced himself ready to “throw up” over the lavish perks and benefits showered by lobbyists upon negligent Phoenix VA director Sharon Helman while patients were dying on secret wait lists. As Resnik points out, those lobbyists got the money it took to send Helman and her family on long vacations to Disneyland by soaking up tax dollars through federal contracts. “The Helman kleptocracy is coming to light now after a judge this week upheld her firing by the VA for taking all those freebies without ever disclosing them,” fumed the nauseous reporter. “She was nailed for old-fashioned, beak-dipping, palm-greasing corruption — not for the misconduct we’ve been reporting on for months.”\nBy New Year’s Day, congressional Republicans – who seem uniquely concerned about what the VA system actually does with its money, instead of just calling for budget increases – were investigating the Department’s “admitted mismanagement of construction projects across the country, including an over-budget, billion-dollar hospital in Colorado that was, briefly, abandoned by the contractor,” as reported by Fox News.\nThis particular boondoggle was a $328 million proposal that somehow ballooned to a projected billion dollars in construction costs, but produced only a half-finished structure and a crowd of justifiably angry veterans. “VA construction managers couldn’t lead starving troops to a chow hall,” snarled Rep. Mike Coffman, the combat veteran who represents the district. He alleged that “every major construction project that the VA has right now is hundreds of millions of dollars over-budget and years behind schedule,” and reports from the Government Accountability Office back him up.\nRitual declarations of love for veterans by politicians do not obscure the reality of a titanic government that demands an ever-growing share of our national wealth but does not at all seem to care about its responsibilities to people who put their lives on the line for us, until scandals erupt like volcanoes.","url":"https://www.breitbart.com/national-security/2015/01/21/obama-touts-va-reform-in-state-of-the-union-but-he-has-nothing-to-brag-about/"}
