{"authors":[],"date_download":"2018-10-22 20:40:31","date_modify":"2018-10-22 20:40:31","date_publish":"2014-06-02 18:33:55","description":"Children younger than 13, mostly girls, are crossing the U.S-Mexico border alone in higher numbers this year and causing a humanitarian crisis.","filename":"data/vaneerConsumption/ObamaCallsforGovernmentWideResponseforBorderChildren.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/482171/140602-immigrant-children-border-02_b157c8fce437ccb2c3de2a44096c95d0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_obama-calls-government-wide-response-border-children-n120526_1540240831.html","title":"Obama Calls for Government-Wide Response for Border Children","title_page":"Obama Calls for Government-Wide Response for Border Children","title_rss":"NULL","source_domain":"nbcnews.com","text":"President Barack Obama on Monday declared the flood of children crossing the U.S.-Mexico border alone an “urgent humanitarian situation;” and the agency that handles national disasters has been charged with coordinating a federal response.\nCraig Fugate, head of the Federal Emergency Management Agency that usually deals with hurricanes and other national disasters, was tapped to lead what is essentially an “all hands on deck” effort across federal agencies to deal with the immigrant children arriving without an adult. FEMA is part of the Department of Homeland Security.\nFugate is taking on the issue just as hurricane season is getting under way.\nCecilia Muñoz, White House domestic policy council advisor, said not only are \"substantially more\" children crossing the border, but they are more likely to be girls and more of the children are under the age of 13 than in previous years. Exact numbers of children who have crossed this year were not immediately available.\n\"This is creating an urgent humanitarian situation, which the federal government is moving very swiftly to address,\" Muñoz said.\nThe administration sounded an alarm two weeks ago following a visit to the border by Homeland Security Secretary Jeh Johnson and the opening of an emergency shelter at a military facility in San Antonio. The shelter can hold up to 1,200 children, who must be moved by law within 72 hours from Border Patrol to Health and Human Services.\nPlans already are underway for a second facility to be used at Naval Base Ventura County near Oxnard, California, that would hold 600 more children, said Mark Greenberg, acting assistant secretary for the Administration for Children and Families at the U.S. Department of Health and Human Services. He said they should begin arriving as early as Friday.\nUsually about 6,000 to 8,000 a year, the number of unaccompanied children crossing the border rose to 13,625 in the 2012 fiscal year and was at 24,688 in the fiscal year 2013. Next year’s projections are some 100,000 to 130,000 unaccompanied children will cross illegally.\nThe White House has said violence has been driving the influx of children from mostly Central American countries, but there also has been speculation that immigration reform efforts, deportation relief given young immigrants and word spreading that children are allowed to remain in the country when they arrive here also have been driving the arrivals.\nHowever, Cecilia Muñoz, White House Domestic Policy Council director, said the immigration reform legislation that passed the Senate and the deportation relief do not apply to these children. Most of the children arriving appear to have little knowledge of benefits that may be available for immigrants, she said.\nRep. Henry Cuellar, D-Texas, who had recently called for a one-stop center to handle processing and the needs of the children, said the lower Rio Grande Valley district of Texas is seeing about 300 to 400 young unaccompanied children a day who are jamming the border processing centers and temporary holding areas.\nHe said many of those children arrive with a name of a parent or sponsor and because family units are not held in detention, they are given released on their own recognizance with orders to appear for deportation proceedings, which they may or may not do.","url":"https://www.nbcnews.com/news/latino/obama-calls-government-wide-response-border-children-n120526"}
