{"authors":[],"date_download":"2018-10-30 00:58:00","date_modify":"2018-10-30 00:58:00","date_publish":"2016-01-15 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaTellsaRapeVictimaGunWontProtectHer.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_01_obama_tells_a_rape_victim_a_gun_wont_protect_her_1540861080.html","title":"Obama Tells a Rape Victim a Gun Won't Protect Her","title_page":"Obama Tells a Rape Victim a Gun Won't Protect Her","title_rss":"NULL","source_domain":"americanthinker.com","text":"On May 21, 2006, Kimberly Corban was a 20-year-old student completing her sophomore year at the University of Northern Colorado. She had just finished finals -- summer was on its way. She had her whole life ahead of her.\nLiberals like to talk about women’s rights but among those rights is, or should be, the second right enshrined in the Constitution’s Bill of Rights -- the right to keep and bear arms to protect one’s self. A woman’s body is her own, liberals tell us, and she has the right to choose to have an abortion. But the same liberals would deny women like Kimberly Corban the right to defend her body, and her children, with a firearm against the predators who lurk among us. As the Washington Post reported:\nThen, the unthinkable happened. Around five in the morning, a man broke into her apartment in Greeley, Colo., and, for almost two hours, sexually assaulted her. “I thought, ‘I’m going to die,'” Corban, now 30, told The Washington Post in a phone interview. “There’s no going back from that.” Corban’s story did not exactly have a happy ending -- or, at least, the ending is ever-evolving. Though her assailant is now serving 24 years to life in prison, she struggled with depression, PTSD and stress-related seizures. And, speaking about her experience, she came to realize how important it was for women to have access to guns to protect themselves.\nHer ordeal was likely on the mind of rape survivor Kimberly Corban when she confronted President Obama during his recent town hall on CNN on the subject of gun control and asked:\nAs a survivor of rape and now a mother to two small children, you know it seems like being able to purchase a firearm of my choosing and being able to carry that where me and my family are -- it seems like my basic responsibility as a parent at this point. I have been unspeakably victimized once already and I refused to let that happen again to myself or my kids. So why can’t your administration see that these restrictions that you’re putting to make it harder for me to own a gun or harder for me to take that where I need to be is actually just making my kids and I less safe?\nPresident Obama’s somewhat patronizing response included a pro forma expression of sympathy for her plight, but seemed to suggest to her and all women that guns are too dangerous even to deter or dispatch a rapist. This risk of having a gun in the home far outweighs the protection against a rapist intruder might offer. He seemed to suggest that it was better to risk being raped than to risk an accident in the home:\nThere are always questions as to whether or not having a firearm in the home protects you from that kind of violence…What is true is that you have to be pretty well-trained in order to fire a weapon against someone who is assaulting you and catches you by surprise. What is also true is always that possibility that firearm in the home leads to a tragic accident.\nAs Corban would tell Fox News: “My rapist did not need a gun to complete his sexual assault on me, but I needed a gun to defend myself.” She did not have a gun that fateful day, and President Obama gratuitously told her a gun in her home would be as dangerous as a rapist breaking down the door. It was as if he was saying, guns are dangerous, little lady, so don’t worry your pretty head about it,\nAmanda Collins can identify with Kimberly Corban. Rape victim Collins testified in 2013 before the Colorado state legislature on proposed gun ban legislation As Investor’s Business Daily reported:\nCollins was raped at gunpoint in a University of Nevada-Reno parking garage in October 2007. Nevada law prohibited her from carrying a gun on the campus, but her attacker had one. She was raped 50 feet away from the campus police department office. Her attacker was James Biela, a serial rapist who raped two other women and murdered another. He attacked her at gunpoint in a gun-free zone. At the time of the attack, Collins had a concealed weapons permit but not her firearm due to university policies prohibiting carrying concealed weapons on campus. Just such a gun-free zone policy is why the Aurora, Colo., shooter chose the theater he did. As she ended her compelling testimony, she asked the committee, \"How does rendering me defenseless protect you against a violent crime?\"\nExplain it to her and Kimberly Corban, Mr. President. Your wife and daughters are surrounded by men with guns. Corban and Collins both lived to tell their story. Not so fortunate was New Jersey resident Carol Bowne. If access to firearms were as easy as President Obama insists, Bowne would be alive today. The 39-year-old New Jersey woman with a restraining order against an ex-boyfriend was murdered by that boyfriend while she waited for her application for a gun permit to wind its way through a process that takes at least two months to complete (if the police don't delay the process, which in this case they did). But it wasn’t completed soon enough:\nThe Berlin Township woman got a restraining order against a former boyfriend, installed security cameras and an alarm system to her home and began the months-long process of obtaining a handgun, friends said. But it wasn't enough. Bowne, 39, was stabbed to death in the driveway of her Patton Avenue home on Wednesday night.\nBowne was a victim of domestic violence, She didn’t have a gun in her home. Gun control zealots tells us a gun in the home is dangerous, but then so too is an ex-boyfriend, one Michael Eitel, with a knife. That is why gun rights advocate say that women should own guns because a restraining order is just a piece of paper. Carol Bowne was murdered while waiting for her background check. Her killer didn’t have to wait.\nSo for all you pro-choice liberals ought there fighting for women’s rights, here’s a question for you. How about letting women like Kimberly Corban, Amanda Collins and Carol Bowne exercise their right to choose to protect their bodies and lives with a gun?\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/01/obama_tells_a_rape_victim_a_gun_wont_protect_her.html"}
