{"authors":["John Hayward"],"date_download":"2018-10-30 19:13:35","date_modify":"2018-10-30 19:13:35","date_publish":"2015-06-11 18:13:22","description":"The \"ObamaTrade\"-- Trade in International Services Agreement-- bill being debated in the Senate currently includes a proposal to relax visa requirements for Pakistani nationals, in addition to a number of other provisions that have conservatives up in arms. |","filename":"data/vaneerConsumption/ObamaTradeWhosUpforRelaxingPakistaniVisaRequirements.json","image_url":"https://media.breitbart.com/media/2015/06/Obama-CHA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_11__1540926815.html","title":"ObamaTrade: Who's Up for Relaxing Pakistani Visa Requirements?","title_page":"ObamaTrade: Who's Up for Relaxing Pakistani Visa Requirements? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The “ObamaTrade”– Trade in International Services Agreement– bill being debated in the Senate currently includes a proposal to relax visa requirements for Pakistani nationals, in addition to a number of other provisions that have conservatives up in arms.\nTo be perfectly frank, the early skepticism about the Trade Promotion Authority fast-track bill, which has come to be known among many critics as “ObamaTrade” because of the authority it gives the President, seemed understandable but perhaps a touch overdone. Pro- and anti-free-trade sentiments mixed with partisan animosity on both sides to produce a blizzard of confusion, through which Republican leaders are evidently expected to march and whip President Obama’s Democrat caucus into line for him.\nAs resistance to the bill has mounted, its proponents have taken to making statements that indicate they either have not read it, do not understand it, or are not being honest about what it does. An unappealing hint of Failure Theater began rising from GOP leadership. And then Wikileaks dumped some documents we were not supposed to see on the Internet, and people began finding all sorts of little surprises tucked into the flabby folds of the legislation.\nFor example, Daniel Horowitz at Conservative Review writes:\nOne very disturbing aspect of TISA [the Trade in International Services Agreement] is the document uncovered by WikiLeaks revealing an entire section on immigration, referred to as “Movement of Natural Persons.” This section discusses commitments by the parties not to place undue burdens on visas and singles out face-to-face interviews as an example of “overly burdensome procedures.” [see the footnote on page 7] At a time when we face so many national security problems, why would conservatives trust this president to squelch any visa provision threatening our security? And guess who is a party to TISA? Pakistan! In addition to the massive immigration from Pakistan, we admitted 78,000 Pakistani nationals on some type of visa in 2013. Do we really want to join in an agreement that could loosen restrictions on visas from Pakistan? Guess which other country is a part of TISA? Mexico! For good measure, Turkey is also a party to TISA. What could go wrong?\nHorowitz goes on to deride the notion that a little legalistic firewall installed by Rep. Paul Ryan (R-WI) to prevent the President from working immigration changes into trade deals would thwart His Imperial Majesty King Barack I, to whom the Constitution itself is but the smallest of speed bumps, and the orders of uppity federal judges are as the buzzing of flies. He’s also correct to note that the GOP leadership’s commitment to protecting the border and American citizenship isn’t exactly ironclad.\n“Given the secrecy, Obama’s history of malfeasance, the complexity of these treaties (yes, they are ostensibly treaties), and the growing national security threats, why would any conservative rush into this process under this president? It’s not like there aren’t other urgent issues to deal with this year,” Horowitz concludes.\nThere really is too much secretly packed into this deal to support it. It’s time to hit the brakes and drag this thing before the American people for careful scrutiny. Proponents of the bill are asking for a degree of faith in both Congress and the executive that We the People no longer hold, for very good reasons.","url":"https://www.breitbart.com/politics/2015/06/11/obamatrade-whos-up-for-relaxing-pakistani-visa-requirements/"}
