{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 19:14:27","date_modify":"2018-10-30 19:14:27","date_publish":"2018-08-06 15:25:32","description":"Arne Duncan, who served as Barack Obama’s education secretary, says the American education system \"runs on lies.\"","filename":"data/vaneerConsumption/ObamaEducationChiefArneDuncanAmericanSchoolSystemRunsonLies.json","image_url":"https://media.breitbart.com/media/2018/08/Arne-Duncan-face-nation-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_06__1540926867.html","title":"Obama Education Chief Arne Duncan: American School System ‘Runs on Lies’","title_page":"Obama Education Chief Arne Duncan: American School System ‘Runs on Lies’","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Secretary of Education Arne Duncan writes in his new book that the American education system “runs on lies.”\nThe man who served as Barack Obama’s education secretary for most of the former president’s two terms makes this assertion in How Schools Work, reports CBS News.\nDuring an interview that aired Sunday on Face the Nation, Duncan said, “We say we value education but we never vote on education, we never hold politicians accountable local, state, or national level for getting better results, higher graduation rates, more people graduate from college.”\nDuncan also said the American education system fails to support teachers by paying them fairly for the difficult work they perform.\nThe “toughest lie,” however, the former education chief said, is that “we say we value kids and we’ve raised a generation of young people[,] teens who have been raised on mass shootings and gun violence.”\n“And that simply doesn’t happen in other nations,” he added, emphasizing later, “Children in other nations don’t die like they do here.”\nAsked by host Margaret Brennan if he “made a dent in any of that” when he was education secretary, Duncan said:\nWe had some, you know, real successes. We had some failures but on the success side we put more than a billion dollars into high quality early childhood education, which I think is the best investment we can make. We save more than 300,000 teacher jobs around the country when the economy was really in a very tough spot. We put 40 billion dollars into Pell Grants about going back to taxpayers for a nickel to make college more affordable. So things that we’re very-very proud of but this is not a mission accomplished moment, obviously. I feel a huge sense of urgency. We have to get better, faster as a nation. We’re not top 10 in anything.\nWhen Brennan asked Duncan about the approximately $7 billion he funneled into the School Improvement Grants program that sought to improve the worst-performing schools, she cited a report:\nThe report I want to read you this quote found, “overall across all grades, we found implementing any school improvement grants funded model had no significant impacts on math or reading test scores high school graduation or college and enrollment-enrollment.” Excuse me, that’s a pretty harsh criticism.\n“No, I think investing in our lowest performing schools is some of the hardest and most important work we can do,” Duncan insisted, however. “Margaret, I don’t want to leave any kid behind or say they can’t make it. As a nation we had more than 2,000 dropout factories a few years back. We now have less than eight hundred.”\n“But this sounds like a failing grade from the Department of Education,” Brennan pressed him.\n“Yeah, no, you always [have] to get better faster and again it is a short period of time they measured,” Duncan said. “Our high school graduation rates are all time highs. Those grants were a small piece of that[. T]here are many things that go into that.”\nIn 2013, when parents across the country joined in opposition to the Common Core State Standards, Duncan responded by stating the complaints were coming from “white suburban moms who – all of a sudden – their child isn’t as brilliant as they thought they were, and their school isn’t quite as good as they thought they were.”\nWhen Brennan asked Duncan about his criticism of current Secretary of Education Betsy DeVos, he said DeVos does not understand the concept of proficiency in education.\n“And what exactly is it that you think she is failing to understand or follow through on here?” Brennan inquired. “Because she has kept a number of the Obama administration programs.”\n“It’s interesting you probably saw the news, for me, is this a crazy metaphor that about a week ago her yacht was found adrift, $40 million yacht just out there,” Duncan replied. “And for me that sort of represents where they are in terms of education policy. There isn’t one.”\n“What does her personal wealth have to do with it?” Brennan asked.\n“It-it doesn’t have anything to do of it, it’s just that it-it,” Duncan responded. “Her- the policy is adrift. There’s nothing out there of substance.”\nDuncan was apparently referring to a news report that the DeVos family yacht had been vandalized.\nDuncan ended by saying he hopes the Parkland, Florida, gun control activist students will “lead our nation, where we as adults have failed to take them, and that’s to [a] place free of trauma and free of fear.”","url":"https://www.breitbart.com/politics/2018/08/06/obama-education-chief-duncan-american-school-system-runs-lies/"}
