{"authors":[],"date_download":"2018-10-22 20:34:28","date_modify":"2018-10-22 20:34:28","date_publish":"2014-05-02 16:04:49","description":"Comments come during a joint press conference with German Chancellor Angela Merkel.","filename":"data/vaneerConsumption/ObamaMerkelMoreSanctionsIfRussiaDisruptsElection.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/416476/140502-obama-merkel-mn-1225_6d6954648e6ecf79f773bdff60bbb579.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_obama-merkel-more-sanctions-if-russia-disrupts-election-n95731_1540240468.html","title":"Obama, Merkel: More Sanctions If Russia Disrupts Election","title_page":"Obama, Merkel: More Sanctions If Russia Disrupts Election","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama said Friday that the U.S. and its allies will \"move quickly\" to impose further sanctions against Russia if it disrupts the Ukrainian election later this month, saying that they are prepared to impose penalties on sectors of the Russian economy.\n\"If Russia continues on its current course, we have a range of tools at our disposal, including sanctions that would target certain sectors of the Russian economy, and we have been consulting closely with our European and G7 partners,\" he said during a joint press conference with German Chancellor Angela Merkel.. \"We are stepping up our planning.\"\nMerkel told reporters that further sanctions will be \"unavoidable\" if the situation in Ukraine is not stabilized by the presidential election scheduled for May 25.\n\"We are ready and prepared\" to impose more sweeping sanctions on sectors of the Russian economy, she said.\nThe visit comes as the U.S. and Germany continue to lead the charge in denouncing Russia over Putin’s aggression in Ukraine.\nWhile the U.S. and its allies want to present a united front in condemning Russian actions, the tougher sectoral sanctions against that the Obama administration has floated would have major consequences for Germany and other European nations with greater economic interest in Russia.\nObama acknowledged Friday that some countries in Europe would face harsher retaliation for sanctions and that many are dependent on the flow of energy from Russia. But, noting that energy resources flowed from Russia to the continent even throughout the Cold War, he said that the notion of \"turning off the tap\" of natural gas and oil would be \"unrealistic.\"\nAnd the two nations are also still at odds on National Security Agency eavesdropping – which extended to Merkel’s own cell phone. An effort to negotiate a reform of intelligence gathering practices between both countries has collapsed, the New York Times reported Friday.\nMerkel would not say Friday that trust between the two nations has been restored, although she lauded the \"first steps\" taken to reach agreement on surveillance tactics.\n\"The situation is such that we have a few difficulties yet to overcome,\" she said. \"So this is why there's going to be this cyber dialogue between our two countries and this is also why there needs to be and will have to be more than just business as usual.\"\nSpeaking later at the U.S. Chamber of Commerce, Merkel again noted the \"differences of opinion\" between the two nations on surveillance issues.\n\"I do think that we will not have fully overcome this even after my visit,\" she said.\nNBC's Andrew Rafferty contributed to this report.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/obama-merkel-more-sanctions-if-russia-disrupts-election-n95731"}
