{"authors":[],"date_download":"2018-10-22 21:07:28","date_modify":"2018-10-22 21:07:28","date_publish":"2014-06-04 10:26:55","description":"Obama said he discussed with Poroshenko ways the United States can help train Ukrainian law enforcement and military personnel.","filename":"data/vaneerConsumption/ObamaPraisesUkrainesPoroshenkoPledgesMoreAid.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/486061/140604-obama-0623_767a996368f90bedc4cb2a76b56ef89b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_obama-praises-ukraines-poroshenko-pledges-more-aid-n122086_1540242448.html","title":"Obama Praises Ukraine's Poroshenko, Pledges More Aid","title_page":"Obama Praises Ukraine's Poroshenko, Pledges More Aid","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWARSAW - U.S. President Barack Obama on Wednesday called Ukraine's President-elect Petro Poroshenko a \"wise selection\" to lead the country and pledged more military aid to help address security threats from Russian-backed separatists.\nObama, speaking to reporters after a meeting with Poroshenko in Warsaw, said they discussed the new leader's plan to restore peace, boost economic growth, and reduce energy dependence on Russia.\n\"In my discussions with him today it's clear he understands the hopes and aspirations of the Ukrainian people,\" Obama said.\nObama said he discussed with Poroshenko ways the United States can help train Ukrainian law enforcement and military personnel.\nThe White House said in a statement after the meeting that Obama had approved an additional $23 million in defense security assistance to Ukraine since early March, including $5 million for \"the provision of body armor, night vision goggles, and additional communications equipment.\"","url":"https://www.nbcnews.com/news/world/obama-praises-ukraines-poroshenko-pledges-more-aid-n122086"}
