{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:36:27","date_modify":"2018-10-30 18:36:27","date_publish":"2015-01-11 19:06:21","description":"Obama Pitching Big Government Programs Ahead of SOTU Speech","filename":"data/vaneerConsumption/ObamaPitchingBigGovernmentProgramsAheadofSOTUSpeech.json","image_url":"https://media.breitbart.com/media/2015/01/obama1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_11__1540924587.html","title":"Obama Pitching Big Government Programs Ahead of SOTU Speech","title_page":"Obama Pitching Big Government Programs Ahead of SOTU Speech","title_rss":"NULL","source_domain":"breitbart.com","text":"As the President’s State of the Union speech nears, he is launching trial balloons right and left–mostly left–to see what might prove a hit for his annual night of big policy initiatives. Some of the proposals on deck are cyber security and Internet proposals, two years of “free” community college, and changes in the way people qualify for homeownership.\nThe tactic is a new twist in how presidents roll out their State of the Union proposals. In the past presidents have delivered their proposals only during the speech itself and then spent time drumming up support afterward. But in a change to that formula, Obama is floating his policy proposals ahead of time.\nLast week the President let his “free” college balloon loose, proposing that every American “willing to work for it” can get two years of community college nearly for free.\nBut after his big reveal, even The New York Times pointed out that federal Pell grants already make community college nearly free.\n“Community college is already tuition-free for many students around the country, because the federal Pell grants for low-and middle-income students cover up to $5,730 a year, and some states add their own grants, while the national average for full-time community college tuition and fees is $3,427,” the Times reported on January 9.\nNot content merely with education, Obama has also floated several other ideas.\nOn Friday a White House official said that early this coming week Obama will make a speech at the Federal Trade Commission and will propose executive orders covering identity theft, Internet privacy, and technology and electronic privacy in schools.\nAlso, in the past week, Obama visited Michigan, Arizona and Tennessee, where he announced economic proposals–specifically plans for the auto industry–and policies aimed at making homes more affordable.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2015/01/11/obama-pitching-big-government-programs-ahead-of-sotu-speech/"}
