{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:00:50","date_modify":"2018-10-30 21:00:50","date_publish":"2016-10-19 17:19:45","description":"The president, who appeared with both current U.S. Secretary of Education John King and the former secretary, Arne Duncan, told students, “We live in a global economy,” and that they will be competing for jobs with people not only from the United States, but also from “India and China.” | Politics","filename":"data/vaneerConsumption/ObamaTakesEducationVictoryLapMinorityStudentsTrailWhitesDuetoLegacyofDiscrimination.json","image_url":"https://media.breitbart.com/media/2016/10/GettyImages-615156900.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_19__1540933250.html","title":"Obama Takes Education Victory Lap: Minority Students Trail Whites Due to ‘Legacy of Discrimination’","title_page":"Obama Takes Education Victory Lap: Minority Students Trail Whites Due to ‘Legacy of Discrimination’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama is taking a victory lap, claiming that the country saw “real progress” in education during the eight years he has been in office.\nAt the same time, though, he’s continuing to agitate low-income, minority students by presenting images of them as victims of discrimination by whites and state governments.\nSpeaking at Benjamin Banneker Academic High School in Washington, D.C., Obama told students and teachers:\n[W]hen I took office almost eight years ago, we knew that our education system was falling short when it came to preparing young people like you for that reality. Our public schools had been the envy of the world, but the world caught up. And we started getting outpaced when it came to math and science education. And African American and Latino students, in part because of the legacy of discrimination, too often lagged behind our white classmates – something called the achievement gap that, by one estimate, costs us hundreds of billions of dollars a year. And we were behind other developed countries when it came to the number of young people who were getting a higher education. So I said, when I first came into office, by 2020 I want us to be number one again. I want us to be number one across the board.\nThe president, who appeared with both current U.S. Secretary of Education John King and the former secretary, Arne Duncan, told students, “We live in a global economy,” and that they will be competing for jobs with people not only from the United States, but also from “India and China.”\nObama told students about the “real changes” he has made in education, noting that the federal government now intervenes in the education of “young people, from the time they’re born all the way through until they got a career.”\n“And the good news is that we’ve made real progress,” he said, touting the expansion of the Head Start program and funding for a new federal pre-school program – which was provided in the massive new education bill called the Every Student Succeeds Act (ESSA). In the spirit of “bipartisanship,” Sen. Lamar Alexander (R-TN) and Rep. John Kline (R-MN) urged Republicans in Congress to support the bill and most complied.\n“High-quality early education is one of the best investments we can make, which is why we’ve added over 60,000 children to Head Start,” Obama boasted. “We called for high-quality preschool for every four-year-old in America.”\nObama also touted his Race to the Top (RttT) “competition,” which served as the incentive program for states to adopt the Common Core State standards – the highly controversial and unpopular education reform also intended as a social justice program to close the achievement gap between low-income and middle class students. The president said RttT – which was included in his stimulus bill in 2009 – “inspired states to set higher, better standards so that we could out-teach and out-compete other nations.”\nObama continued that he worked with “private and philanthropic partners” to bring up-to-date technology to high schools as well as “personalized” learning for students – which is heavily reliant on massive personal student data collection.\nThe president also added, “we’re investing more in getting girls and young women and young people of color and low-income students into science and engineering and technology and math.”\nObama praised teachers who “stay up late grading your assignments,” yet still “aren’t paid as much as they should be.”\n“They’re not doing it for the glory,” he said. “They’re doing it because they love you, and they believe in you, and they want to help you succeed.”\nThe president added:\nBy 2020, two out of three job openings require some form of higher education. Now, that doesn’t always mean a four-year college degree, but it does mean – whether it’s a four-year university, or a community college, or some sort of training program – you’ve got to get a little bit more than just what you’re getting in high school.\nObama explained that much factory and office work – which he labeled “repetitive work” and said once required only a high school education – “now is done by machines.”\n“So in order for you to succeed in the marketplace, you’ve got to be able to think creatively; you’ve got to be able to work with a team; you’ve got to be able to work with a machine and figure out how to make it tailored for the specific requirements of your business and your job,” he said. “All those things require some more sophisticated thinking than just sitting there and just doing the same thing over and over again. And that’s why you’ve got to have more than just a high school education.”\nHowever, the president assured students that he has made it easier for them to access “free money for college.”\n“Fill out your FAFSA, the Free Application for Federal Student Aid,” he urged the students.\nObama told students that he has also “reformed the student loan system” and now plans to make community college “free” for all students.\nHe said:\nWhen I came into office, you had tens of billions of dollars that were going to big banks, serving as middlemen for your student loans. We said, well, let’s cut out the banks. Let’s give the money directly to the students so they can afford college and we can make the loans cheaper, and we can expand Pell grants. And now, what we’re trying to do is to push to make two years of community college free for every responsible student all across the country. All across the country.\n“I am really proud of what we’ve accomplished,” Obama said.\nHowever, consistent with Democrat nominee Hillary Clinton’s attacks on state governments in an effort to make federal control of education more appealing, Obama added:\nThere are still too many states that are cutting back on public education. And part of the reason tuition is going up is because states aren’t putting as much money into state education, universities, community colleges as they used to. That’s why, if you’re 18, by the way, you’ve got to vote to make sure that the folks who represent you actually deliver.\n“For too many students in America, zip code still determines how far they’ll go,” Obama continued. “And that’s not acceptable.”\nThe president blamed a lack of success for some students from low-income, minority communities on “just the luck of the draw.”\nThe president said his program, called My Brother’s Keeper, is intended to “help more young people, especially kids of color, get mentorships and the resources and the guidance they need to succeed.” Obama promised to remain involved in the initiative after he leaves office.","url":"https://www.breitbart.com/politics/2016/10/19/obama-black-latino-students-trail-white-students-legacy-discrimination/"}
