{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:13:31","date_modify":"2018-10-30 19:13:31","date_publish":"2015-06-10 17:40:17","description":"A log inside the secret room is kept listing any members who go read the TPP text, but Breitbart News can confirm that the log listing the senators who have actually read what they’re about to vote on is also kept secret from the public. That means Americans have no way of knowing—outside of their members of Congress confirming publicly they’ve visited the room to read the TPP text—whether their members of Congress have any clue what it is they are voting on. |","filename":"data/vaneerConsumption/ObamaTradeSecrecyLogofWhichMembersofCongressActuallyReadBillinSecretRoomAlsoPrivate.json","image_url":"https://media.breitbart.com/media/2015/05/secret-doors-matt-boyle-breitbart.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_10__1540926811.html","title":"ObamaTrade Secrecy: Log of Which Members of Congress Actually Read Bill in Secret Room Also Private","title_page":"ObamaTrade Secrecy: Log of Which Members of Congress Actually Read Bill in Secret Room Also Private | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Congress is being so secretive about Obamatrade that Congressional authorities are not only keeping the text of President Barack Obama’s various trade deals secret, they’re also keeping the log that lists which members of Congress went to go read the Trans Pacific Partnership (TPP) private as well.\nTrade Promotion Authority (TPA), which the House may vote on by the end of this week or perhaps early next week, would fast-track the approval of the TPP and at least two other international trade agreements that President Obama’s administration is working on. Those are the Trade in Services Agreement (TiSA) with 24 separate parties, mostly other countries but also including the European Union, and the Transatlantic Trade and Investment Partnership (T-TIP) deal.\nHouse GOP leadership has been having a difficult time rounding up enough support to pass Obamatrade, and more and more members keep coming out against it. In fact, a spokesman for Rep. Doug Collins (R-GA) confirmed to Breitbart News on Wednesday morning that he is leaning “no” on Obamatrade, and on Tuesday a litany of other members—including Reps. Robert Aderholt (R-AL), Paul Cook (R-CA) and Paul Gosar (R-AZ)—came out against it too.\nTiSA and T-TIP text are not currently available for members of Congress to read, even in a secret room, but TPP text is available for members to read. Only members of Congress are allowed in the room, and in some cases they’re allowed to take certain staffers with enough security clearances. No notes are allowed to be taken out of the room, and members aren’t legally allowed to publicly discuss the specifics of what they’ve seen or read.\nA log inside the secret room is kept listing any members who go read the TPP text, but Breitbart News can confirm that the log listing the senators who have actually read what they’re about to vote on is also kept secret from the public. That means Americans have no way of knowing—outside of their members of Congress confirming publicly they’ve visited the room to read the TPP text—whether their members of Congress have any clue what it is they are voting on.\nBreitbart News confirmed neither the public nor the press are privy to secret logs keeping record of which Senators and Congressmen read the deal.\nAs Breitbart News previously reported, a vote in favor of TPA, which gives the president fast-track authority, is essentially a vote for the TPP and the other two deals because in the past 40 years no trade agreement that received fast track authority has ever been stopped by Congress.\nThe private text from parts of the TPP is being kept in the Sensitive Compartmentalized Information Room for the Senate. The Senate Security Office keeps track of the secret log, according to a senate staffer.\nHowever, Breitbart News called the Senate Security Office, which then directed the call to the Executive Office for the Secretary of the Senate. Eventually the Executive Office for the Secretary of the Senate told Breitbart News all information relevant to senate security practices would not be given to the media or to the public.\nSo – in effect – what this means, is that “we the people” have no way to verify if Senators have actually read the released part of the trade agreement before granting Obama fast-track authority to complete it.\nThe same is expected to be true for members in the House of Representatives.\nBreitbart News spoke with an official from the House Permanent Select Committee on Intelligence, who indicated there is part of the TPP being kept in a secured room for House members to review.\nHowever, according to Jack Langer, spokesperson for committee chairman Rep. Devin Nunes (R-CA), if members of the House of Representatives wish to review the TPP, they must contact the United States Trade Representative.\nBreitbart News followed up with the United States Trade Representative who said it does keep the text available for members of Congress, but that the administration does not keep an official log.\nHowever, as in the Senate, there is a security office within the House that is likely keeping a secret log.\nBreitbart News contacted the House Sergeant of Arms, which oversees House security multiple times for confirmation on whether or not it is keeping a secret log. However, calls and emails were not returned.\nBreitbart News’ Matthew Boyle contributed to this report.","url":"https://www.breitbart.com/politics/2015/06/10/obamatrade-secrecy-log-of-which-members-of-congress-actually-read-bill-in-secret-room-also-private/"}
