{"authors":["Breitbart News"],"date_download":"2018-10-30 19:20:54","date_modify":"2018-10-30 19:20:54","date_publish":"2015-04-01 19:55:45","description":"Sen. Bob Menendez has been charged with using his office to improperly benefit a Florida eye doctor and political donor.","filename":"data/vaneerConsumption/ObamaAdministrationIndictsSenBobMenendez.json","image_url":"https://media.breitbart.com/media/2015/03/bob-menendez-melgen-probe-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_01__1540927254.html","title":"Obama Administration Indicts Sen. Bob Menendez","title_page":"Obama Administration Indicts Sen. Bob Menendez | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — Sen. Bob Menendez, the son of Cuban immigrants who rose to become one of the highest-ranking Hispanic members of Congress, was indicted on corruption charges Wednesday.\nThe New Jersey Democrat, an influential voice on foreign policy, was accused of using his office to improperly benefit a Florida eye doctor and political donor who provided him with trips aboard his luxury jet.\nThe indictment from a federal grand jury in New Jersey charged the senator with 14 counts, including bribery and conspiracy, over his ties to Dr. Salomon Melgen, a wealthy doctor and the politician’s longtime friend.\nMelgen also was charged in the case.\nThe indictment clouds the political future of the top Democrat – and former chairman – of the Senate Foreign Relations Committee who has played a leading role on Capitol Hill on matters involving Iran’s nuclear program and U.S. efforts to improve ties with Cuba.\nMenendez was expected to make a statement later Wednesday in New Jersey.\nThe indictment from a grand jury in his home state was the latest development in a federal investigation that came into public view when federal authorities raided Melgen’s medical offices two years ago. The investigation focused on whether the senator had improperly advocated on Melgen’s behalf, including by intervening in a Medicare billing dispute.\nMenendez has acknowledged that he flew multiple times on Melgen’s private jet to the Dominican Republic and initially failed to properly pay for the trips. Menendez in 2013 agreed to reimburse Melgen $58,500 for the full cost of two flights.\nThe senator’s office later disclosed another flight, from Florida to New Jersey in 2011, and said Menendez had repaid Melgen $11,250 for it.\nLast year, Menendez disclosed that his campaign accounts had paid a law firm $250,000 for legal costs related to investigations by the Justice Department and the Senate Ethics Committee of his ties to Melgen.\nMenendez, the top Democrat on the Senate Foreign Relations Committee, has acknowledged taking actions that could benefit Melgen, among them contacting U.S. health agencies to ask about billing practices and policies. But the lawmaker has said he did nothing wrong and that he and Melgen have been friends for decades.\n“We celebrated holidays together,” he once told reporters. “We have been there for family weddings and sad times like funerals and have given each other birthday, holiday and wedding presents, just as friends do.”\nMelgen came under renewed scrutiny when government data last year showed he had received more in Medicare reimbursements in 2012 than any other doctor in the country.\nMenendez becomes the first sitting U.S. senator to face indictment since then-Sen. Ted Stevens, R-Alaska, in 2008. Stevens was found guilty of concealing gifts from donors on financial disclosure statements, but the Justice Department later dropped the case after admitting that prosecutors failed to turn over evidence that would have been favorable to his defense.\nMenedez joined the Senate in 2006 after serving more than a decade in the House of Representatives.\nA lawyer and former mayor of Union City, New Jersey, Menendez also served in the New Jersey General Assembly and state Senate.","url":"https://www.breitbart.com/politics/2015/04/01/obama-administration-indicts-sen-bob-menendez/"}
