{"authors":["The Associated Press"],"date_download":"2018-10-30 19:15:44","date_modify":"2018-10-30 19:15:44","date_publish":"2016-03-16 00:00:00","description":"WASHINGTON — President Barack Obama nominated appeals court Judge Merrick Garland to the Supreme Court on Wednesday, challenging Republicans to drop their adamant refusal to even consider his choice in an election year.","filename":"data/vaneerConsumption/ObamanominatesJudgeMerrickGarlandtoSupremeCourt.json","image_url":"https://media.arkansasonline.com/img/photos/2016/03/16/Obama_Supreme_Court_Lesn_1_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_mar_16_obama-ive-_c8e9b557e09397e2ce2fcc584ef0e8a0__page=3_1540926944.html","title":"Obama nominates Judge Merrick Garland to Supreme Court","title_page":"Obama nominates Judge Merrick Garland to Supreme Court","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Federal appeals court judge Merrick Garland, right, stands with President Barack Obama as he is introduced as Obama's nominee for the Supreme Court during an announcement in the Rose Garden of the White House, in Washington, Wednesday, March 16, 2016. (AP Photo/Pablo Martinez Monsivais)\nWASHINGTON — President Barack Obama nominated appeals court Judge Merrick Garland to the Supreme Court on Wednesday, challenging Republicans to drop their adamant refusal to even consider his choice in an election year.\nObama called Garland, a longtime jurist and former prosecutor, \"one of America's sharpest legal minds\" and deserving of a full hearing and Senate confirmation vote. Republican leaders, however, have said the vacant high court seat should not be filled until a new president is elected, a stance Senate Majority Leader Mitch McConnell emphasized immediately after the White House announcement.\n[RELATED STORY: Boozman, Cotton denounce president's Supreme Court nomination]\nGarland, 63, is the chief judge for the United States Court of Appeals for the District of Columbia Circuit, a court whose influence over federal policy and national security matters has made it a proving ground for potential Supreme Court justices.\nHe would replace conservative, Justice Antonin Scalia, who died last month.\nObama announced choice at a ceremony in the Rose Garden, with Democratic Senate leaders and allies looking on.\nGarland, who had been passed over before, choked back tears, calling the nomination \"the greatest honor of my life.\" He described his grandparents' flight from anti-Semitism in Eastern Europe and his modest upbringing.\nHe said he viewed a judge's job as a mandate to set aside personal preferences to \"follow the law, not make it.\"\nObama held up Garland as diligent public servant, highlighting his work leading the investigation into the Oklahoma City bombing and prosecutions. He quoted past praise for Garland from Chief Justice John Roberts and Sen. Orrin Hatch. And he said Garland's talent for bringing together \"odd couples\" made him a consensus candidate best poised to become an immediate force on the nation's highest court.\nThe president urged the Republican-led Senate not to let the particularly fierce and partisan political climate quash the nomination of a \"serious man.\"\n\"This is precisely the time when we should play it straight,\" Obama said.\nGarland was confirmed to the D.C. Circuit in 1997 with backing from a majority in both parties, including seven current Republicans senators.\nIn the current climate, Garland remains a tough sell. Republicans control the Senate, which must confirm any nominee, and GOP leaders want to leave the choice to the next president, denying Obama a chance to alter the ideological balance of the court before he leaves office next January. Republicans contend that a confirmation fight in an election year would be too politicized.\nRead Thursday's Arkansas Democrat-Gazette for full coverage.","url":"https://www.arkansasonline.com/news/2016/mar/16/obama-ive-made-my-decision-supreme-court-nominee/?page=3"}
