{"authors":["Associated Press"],"date_download":"2018-10-22 20:46:15","date_modify":"2018-10-22 20:46:15","date_publish":"2016-01-29 03:38:55","description":"BALTIMORE (AP) — President Barack Obama on Thursday promised his most fervent supporters on Capitol Hill the \"Democrats will win in November\" and said it's g...","filename":"data/vaneerConsumption/ObamapromisespartyfaithfulDemocratswillwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:5558e41a958b46fc9c8855089a1556fb-4PuZeKVXE7cd9005b2c87641e8ba-627_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422071_Obama-promises-party-faithful-Democrats-win_1540241175.html","title":"Obama promises party faithful: 'Democrats will win'","title_page":"Obama promises party faithful: 'Democrats will win' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obama promises party faithful: 'Democrats will win'\nBALTIMORE (AP) — President Barack Obama on Thursday promised his most fervent supporters on Capitol Hill the \"Democrats will win in November\" and said it's going to take more than \"phony tough talk and bluster\" to defeat Islamic militants.\nAppearing before House Democrats at a retreat in Baltimore, Obama said the country is \"doing a lot better\" than when he took office, citing progress against Islamic State forces and curbing Iran's nuclear program — as well as lower gas prices, 18 million people gaining health insurance and 5 percent unemployment.\nIn a not-so-veiled shot at GOP presidential front-runner Donald Trump, Obama said the U.S. won't strengthen itself \"by allowing politicians to insult Muslims or pit groups of Americans against each other.\"\nPresident Barack Obama speaks at the House Democratic Issues Conference in Baltimore, Md., Thursday, Jan. 28, 2016. (AP Photo/Pablo Martinez Monsivais)\nObama's defended his global leadership against a chorus of GOP attacks from Trump and other presidential candidates. He said the U.S. and a coalition of more than 60 countries continues \"to hunt down and destroy ISIL, including with nearly 10,000 air strikes.\"\n\"We're not going to build progress with a bunch of phony tough talk and bluster and over-the-top claims that just play into ISIL's hands,\" Obama said. \"That's not keeping America safe.\"\nObama chided Republicans for opposing him at every turn.\n\"Sometimes I get a little frustrated that we don't run back the tapes to what Republicans said back then\" when predicting his policies wouldn't work, Obama said. He noted that his 2012 presidential opponent, Mitt Romney, promised 6 percent unemployment but it has already dropped to 5 percent.\n\"At each juncture, every single one of the steps we took, they said the opposite. Wanted to go in a different direction, claimed that our policies would crush jobs and destroy the economy,\" Obama said. \"Do people remember that?\"\nOn the upcoming elections, Obama promised that \"we will have a Democratic president succeeding me. ... And the reason I can say that with confidence is because we focus on the things that matter in the lives of the American people.\"\nDuring the closed-door back and forth with lawmakers, according to an aide in the room, Obama defended his administration's deportations of migrants from Central America and said bipartisan action was possible on criminal justice reform and in combating opioid abuse. He promised action on Puerto Rico's fiscal crisis.\nEarlier Thursday, Vice President Joe Biden likened the Republican presidential race to a \"gift from the Lord\" for Democrats trying to win control of the House and Senate.\nDemocrats say that if Republicans nominate Trump or Texas Sen. Ted Cruz it could be a windfall in their effort to regain control of the House, where their numbers are the lowest since the Truman administration in the late 1940s.\nStill, the party faces an uphill battle to recapture capture a House majority. Republicans currently outnumber them 246-188.\nDemocrats held the House by a substantial majority when Obama took office and were integral to enacting an economic stimulus bill, Obama's health care rewrite and an ambitious overhaul of financial regulations.\nOn the political front, House Democratic Leader Nancy Pelosi of California announced Thursday that she raised $40 million for House Democrats last year, including $30.4 million for the campaign committee. A prodigious fundraiser, Pelosi held 205 fundraisers in 35 cities.\nPresident Barack Obama, center, is presented a commemorative bowl from Rep. Mark Takai, D- Hawaii, left, and Rep. Robin Lynne Kelly, D-N.Y., right, before speaking at the House Democratic Issues Conference in Baltimore, Md., Thursday, Jan. 28, 2016. (AP Photo/Pablo Martinez Monsivais)\nPresident Barack Obama walks along the Colonnade of the White House in Washington, Thursday, Jan. 28, 2016, before he departs for Baltimore, Md. (AP Photo/Manuel Balce Ceneta)","url":"https://www.dailymail.co.uk/wires/ap/article-3422071/Obama-promises-party-faithful-Democrats-win.html"}
