{"authors":[],"date_download":"2018-10-30 01:07:06","date_modify":"2018-10-30 01:07:06","date_publish":"2015-03-13 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamawhitewashesSelmaignoresLincoln.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_obama_whitewashes_selma_ignores_lincoln__1540861626.html","title":"Obama whitewashes Selma, ignores Lincoln","title_page":"Obama whitewashes Selma, ignores Lincoln","title_rss":"NULL","source_domain":"americanthinker.com","text":"Obama whitewashes Selma, ignores Lincoln\nMr. Obama's political priorities are quite interesting: he is Johnny-on-the-spot regarding Selma when it comes to commemorating the 50th anniversary of the civil rights march, but he specifically declined participation in the recent 150th anniversary of Lincoln's seminal Gettysburg Address. Indeed, this pivotal moment in U.S. history was so important to Mr. Obama that not only did it warrant his absence, but also he deigned only to send Secretary of the Interior Sally Jewell, who by Washington standards is not particularly high on the totem pole.\nAs Mr. Obama has a longstanding pattern of seeing the world through the divisive prism of party, race, class, or gender, one cannot help but wonder if the little \"R\" next to Lincoln's name was not, for him, the deciding factor. As victors often distort history, the uninformed reading Mr. Obama's antics would wrongly assume that Democrats were the abolitionist, anti-slave party rather than Republicans. (As an overwhelming majority of African-Americans consistently vote Democrat, that would, no doubt, be a real head-scratcher for Mr. Lincoln.) In any case, just as the mainstream media cuts Republicans out of their photographs and downplays their physical presence on the Edward Pettus Bridge, Mr. Obama neglects to mention that the barking police dogs' masters – billy club-wielding, tear gas-throwing cops barring the schoolhouse door – were acting at the specific direction of Democratic governor George C. Wallace. À la Brian Williams, Mr. Obama never passes up the opportunity to let the truth get in the way of a whopper of a fish story.","url":"https://www.americanthinker.com/blog/2015/03/obama_whitewashes_selma_ignores_lincoln_.html"}
