{"authors":[],"date_download":"2018-10-22 20:56:33","date_modify":"2018-10-22 20:56:33","date_publish":"2016-01-29 04:50:25","description":"President Barack Obama said the United States would tackle the Islamic State group beyond Iraq and Syria if necessary, as he signaled an increased focus on L...","filename":"data/vaneerConsumption/ObamavowstocounterIslamicStateinLibya.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6jd-3bmscybNe842cce83474b5074097-673_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422185_Obama-vows-counter-Islamic-State-Libya_1540241793.html","title":"Obama vows to counter Islamic State in Libya","title_page":"Obama vows to counter Islamic State in Libya | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obama vows to counter Islamic State in Libya\nPresident Barack Obama said the United States would tackle the Islamic State group beyond Iraq and Syria if necessary, as he signaled an increased focus on Libya.\nAmid fears that a power vacuum in the north African nation has provided fertile ground for Islamic State to grow, Obama convened his National Security Council to discuss the issue.\n\"The President emphasized that the United States will continue to counter ISIL terrorist plotters in any country where it is necessary,\" the White House said following the meeting.\nUS President Barack Obama convened his National Security Council to discuss the power vacuum in Libya which has provided fertile ground for Islamic State to grow ©Brendan Smialowski (AFP)\n\"The President directed his national security team to continue efforts to strengthen governance and support ongoing counterterrorism efforts in Libya and other countries where ISIL has sought to establish a presence.\"\nLibya has been in political turmoil and rocked by violence since the ouster of longtime dictator Moamer Kadhafi in a 2011 revolution.\nIt now has two governments and parliaments, with the recognized authorities based in the eastern city of Tobruk and a militia-backed authority in Tripoli.","url":"https://www.dailymail.co.uk/wires/afp/article-3422185/Obama-vows-counter-Islamic-State-Libya.html"}
