{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:07:27","date_modify":"2018-10-30 18:07:27","date_publish":"2018-09-05 12:32:56","description":"Former President Barack Obama will hold a rally on Saturday in Southern California on Saturday that will feature seven Democrats.","filename":"data/vaneerConsumption/ObamatoRallyforCaliforniaDemocratsin7KeyRaces.json","image_url":"https://media.breitbart.com/media/2018/06/Pelosi-Obama-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2018_09_05__1540922847.html","title":"Obama to Rally for California Democrats in 7 Key Races","title_page":"Obama to Rally for California Democrats in 7 Key Races | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former President Barack Obama will hold a rally on Saturday in Southern California on Saturday that will feature seven Democrats running in key U.S. House districts currently represented by Republicans.\nThe Los Angeles Times reports:\nIn his first major foray on the campaign trail ahead of November’s midterm election, former President Obama will drop into Southern California on Saturday, holding a rally to boost seven Democratic candidates running in competitive House districts across the state. His appearance, one of just a few overtly political events he’s held since leaving the White House, is a sign of the high stakes in this year’s election as Democrats try to wrest back control of the House. It’s also an indication of California’s considerable role in Democrats’ hoped-for path to victory, with all seven Democrats competing in Republican-held districts that supported Hillary Clinton in 2016. Democrats need to capture 23 seats to take back the House. Details of the time and location of the rally have not yet been released. … [T]his weekend’s rally will mark his first stump speech this election season. A spokeswoman for Obama said Saturday’s event was just the beginning of a “focused, strategic” lineup of fall campaign appearances.\nDemocrats have been targeting the seven districts because they are places where Hillary Clinton earned more votes than Trump in the 2016 presidential election.\nHowever, as Breitbart News noted in July, Republicans still have a good chance of defending these seats. In the June 5 primary, total Republican votes outnumbered total Democrat votes in six out of the seven districts.\nAnd in the seventh district, Republican Diane Harkey led her opponent, Mike Levin, in a recent poll. Levin is one of the few Democrats running in competitive districts who has embraced House Minority Leader Nancy Pelosi (D-CA).\nPelosi hopes to return as Speaker of the House if Democrats win a majority in November.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/local/2018/09/05/obama-to-rally-for-california-democrats-in-7-key-races/"}
