{"authors":["Wynton Hall"],"date_download":"2018-10-30 20:48:21","date_modify":"2018-10-30 20:48:21","date_publish":"2015-01-29 15:18:28","description":"The White House announced Thursday morning that President Barack Obama wants Congress to \"fully reverse\" bipartisan sequester spending limits by boosting domestic and defense spending by $70 billion in an effort to \"end the era of manufactured crises and mindless austerity.\"","filename":"data/vaneerConsumption/ObamaWantstoFullyReversetheSequester.json","image_url":"https://media.breitbart.com/media/2014/12/hundred-dollar-bills-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_29__1540932501.html","title":"Obama Wants to 'Fully Reverse' the Sequester","title_page":"White House: Obama Wants to 'Fully Reverse' the Sequester","title_rss":"NULL","source_domain":"breitbart.com","text":"The White House announced Thursday morning that President Barack Obama wants Congress to “fully reverse” bipartisan sequester spending limits by boosting domestic and defense spending by $70 billion in an effort to “end the era of manufactured crises and mindless austerity.”\nThe Associated Press called Obama’s plan a “brazen proposal.”\nThe announcement comes as House Democrats huddle in Philadelphia for their annual retreat.\nObama is expected to release his budget plan on Monday. According to the AP, Obama will ask Congress for a $38 billion increase in defense spending and a domestic spending increase of “a similar amount” that would put Obama’s budget “on track to exceed the levels frozen in place by sequestration by about $70 billion.”\nSenate Majority Leader Mitch McConnell’s deputy chief of staff Don Stewart said Obama’s announcement comes as little surprise.\n“This is not a surprise,” said Stewart. “Previous budgets submitted by the president have purported to reverse the bipartisan spending limits through tax increases that the Congress–even under Democrats–could never accept.”\nSpeaker John Boehner’s spokesperson Cory Fritz agreed.\n“Until he gets serious about solving our long-term spending problem, it’s hard to take him seriously,” said Fritz.\nAccording to the Treasury Department, the U.S. national debt is $18,095,120,088,870.92.","url":"https://www.breitbart.com/politics/2015/01/29/white-house-obama-wants-to-fully-reverse-the-sequester-and-end-mindless-austerity/"}
