{"authors":["Ian Hanchett"],"date_download":"2018-10-30 21:01:04","date_modify":"2018-10-30 21:01:04","date_publish":"2015-05-05 05:10:29","description":"President Obama said that \"too often we ignore\" \"pockets of poverty, lack of opportunity, lack of education\" on Monday's \"Late Show\" on CBS.","filename":"data/vaneerConsumption/ObamaWeIgnorePocketsofPoverty.json","image_url":"https://media.breitbart.com/media/2015/05/Obama-54-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_04__1540933264.html","title":"Obama: 'We Ignore' 'Pockets' of Poverty","title_page":"Obama: 'We Ignore' 'Pockets' of Poverty | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama said that “too often we ignore” “pockets of poverty, lack of opportunity, lack of education” on Monday’s “Late Show” on CBS.\nObama said, “it’s important that now that charges have been brought in Baltimore, that we let due process play itself out. Those officers who have been charged, they deserve, to be represented, and to let the legal system work its way through. We don’t have all the facts yet, and that that’s going to be presented in a court of law. I think it’s also really important to remember that the overwhelming number of police officers are doing an outstanding job, we’re in New York, today, — we’re in New York today, where a young officer lost his life doing his job, and families of officers all across the country every day, they’re wondering ‘is my loved one going to come home?’ And so they’ve got a really tough job.”\nHe continued, “what we also know, though, is that for far too long, for decades, you have a situation in which too many communities don’t have a relationship of trust with the police, and if you just have a handful of police who are not doing the right thing, that makes the job tougher for all the other police officers out there. It creates an environment in the community where they feel as if, rather than being protected and served, they’re the targets of arbitrary arrests or stops, and so our job has to be to rebuild trust, and we put forward a task force made up of police officers, but also young activists who have been protesting in Ferguson, or here in New York. They came up with some terrific recommendations about collecting data on what happens when there’s a shooting involving police, what are we doing in terms of things like body cameras, and so there’s some very practical, concrete things we can do to make the system work better.”\nObama then talked about the broader issue in cities like Baltimore, stating “this is not just a policing problem. What you have are pockets of poverty, lack of opportunity, lack of education, all across this country. And too often we ignore those pockets until something happens, and then we act surprised. We have the TV cameras come in. And essentially, we put the police officers in a really tough spot where we say to them, ‘just contain the problem.’ And so if young African-American men are being shot, but it’s not affecting us, we’ll just kind of paper that over. And part of the message that I’m trying to deliver is, look, you’ve got a [crisis] in these communities that’s been going on for years, where too many young people don’t have hope, they don’t see opportunity, there aren’t enough jobs. We’ve created an approach to drugs that leads to mass incarcerations. So, then you have no father figures in these communities. When those folks get out of prison, they can’t get a job because they’ve got a felony record. So, today part of what I did in New York was to announce some different initiatives around what we’re calling My Brother’s Keepers. How can we send a message to young people of color and minorities, particularly young men, saying ‘your lives do matter, we do care about you, but we’re going to invest in you before you have problems with the police, before there’s the kind of crisis we see in Baltimore. We’re going to make sure you’ve got early childhood education, we’re going to make sure that you have an opportunity to graduate, and go to college, you’ve got mentors, and apprenticeships,’ and that kind of sustained effort, I think, is what we have to see in this country, not just the episodic spasms of interest when something tragic happens.”\nWhen asked how much racism factored into this, the president responded, “[it’s] a residual factor, but also a buildup of our history, and we can’t ignore that. Look, if you have slavery, Jim Crow, discrimination that built up over time, even if our society has made extraordinary strides, and I’m a testament to that…but, it’s built up over time. So, if you have 100 years in which certain communities can only live in certain places, or the men in those communities can only get menial labor, or they can’t start a particular trade because it’s closed to them, or if they’re trying to buy a house or a car, it’s more expensive. And over time that builds up. You know, that results in communities that — where the kids who are born there are not going to have as good of a shot. And we don’t have to sort of accuse everybody of racism today to acknowledge that that’s part of our past, and if we want to get past that, then we’ve got to make a little bit of an extra effort. And I think the vast majority of Americans are willing to do that if it’s done well.” And that the country has made “leaps and bounds” in the area of race relations and police oversight, and part of perception regarding police and race is due to the fact that more information is available and people are aware of incidents they would not have been aware of in the past.\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/05/04/obama-we-ignore-pockets-of-poverty/"}
