{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 00:52:26","date_modify":"2018-10-23 00:52:26","date_publish":"2017-03-16 10:23:33","description":"Former President Barack Obama landed on the tourist island of Tahiti without his family before going to Marlon Brando's privately owned retreat Tetiaroa atoll, where he'll stay for a month.","filename":"data/vaneerConsumption/ObamatravelstoMarlonBrandosprivatePolynesianisland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E536DED00000578-0-image-a-12_1489659782759.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319430_Obama-travels-Marlon-Brando-s-private-Polynesian-island_1540255946.html","title":"Obama travels to Marlon Brando's private Polynesian island","title_page":"Obama travels to Marlon Brando's private Polynesian island | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former President Barack Obama has arrived in French Polynesia where he will spend a month at a luxury resort frequented by Hollywood stars.\nHe landed on the tourist island of Tahiti this week without his family before going to Marlon Brando's privately owned retreat Tetiaroa atoll, which the Oscar-winning actor bought in the 1960s.\nObama then checked into the eco-friendly Brando resort, whose villas boast their own plunge pools and cost between 2,000 euros ($2,150) and 12,300 euros per night.\nIt is unclear if Obama's family will join him for the tropical holiday.\nDaughter Malia is working at an internship in New York while Sasha is in high school in DC at Sidwell Friends, which has a week off for spring break starting March 24.\nFormer President Barack Obama landed on the tourist island of Tahiti without his family before going to Marlon Brando's privately owned retreat Tetiaroa atoll, where he'll stay for a month\nGetting there involves taking a 20 minute flight on the Brando's own private airway, and flying into the resort\nThe Brando is the sole hotel on Tetiaroa, a private atoll of a dozen islets that circle a pristine lagoon 30 miles north of Tahiti\nFrench Polynesia, a French territory in the South Pacific, is made of more than 100 islands and is best known for the French nuclear tests carried out there up to the mid-1990s.\nMarlon Brando first came to Tetiaroa while filming Mutiny on the Bounty, claiming it made him feel 'closer to paradise' - and to his co-star Tarita who he married.\nHe bought the island in 1967, and turned it into his idea of paradise.\nNo political meetings have been announced during Obama's stay, and it is not clear what he plans to do during the sojourn.\nBut the former president and his wife Michelle have signed a bumper book deal with Penguin Random House estimated to be worth as much as $60million.\n'We are absolutely thrilled to continue our publishing partnership with President and Mrs Obama,' the chief executive of Penguin Random House, Markus Dohle, said in a statement.\nA beach of your own: The tiny number of villas on the island means seeing someone else on the beach your villa backs on to is incredibly rare\nA view of the restaurant in the resort named for Marlon Brando, its former owner\nMARLON BRANDO'S TETIARIOA Brando first came to Tetiaroa while filming Mutiny on the Bounty, claiming it made him feel 'closer to paradise' Marlon Brando first came to Tetiaroa while filming Mutiny on the Bounty, claiming it made him feel 'closer to paradise' - and to his co-star Tarita who he married. He bought the island in 1967, and turned it into his idea of paradise. Brando's building was minimal, creating a village of 12 palm-thatched shacks on the islet of Onetahi, which then became a very simple hotel. In fact, some of the researchers on the island still live in the original bungalows. Brando was passionate about preserving Tetiaroa's natural beauty, biodiversity and cultural richness and was determined to find a way in which it could be a centre for research and education and a model of sustainability, deciding to turn it into a luxury eco resort that would mix the latest in green technology, working scientists and unashamed luxury. In 1999 Brando and Richard Bailey, a long-time resident of Tahiti and head of Pacific Beachcomber, began working on the plans for The Brando, as 'an island where innovative new technologies would enable a self-sustaining luxury environment for hotel guests, residents and scientific research' and the resort finally opened its door in 2014.\n'With their words and their leadership, they changed the world, and every day, with the books we publish at Penguin Random House, we strive to do the same.'\nDohle then added: 'Now, we are very much looking forward to working together with President and Mrs Obama to make each of their books global publishing events of unprecedented scope and significance.'\nAs part of the deal Penguin will also donate 1million books in the Obamas' name, a move that might have taken down the price paid in the deal.\nThere is no release date for either of the memoirs.\nNo book deal has ever come close to paying an author that much money, with the closest example being the the $150million James Patterson reportedly received from Hachette in 2009 as part of a 17-book deal.\nObama is known for his tropical holidays, having spend time with Richard Branson in the British Virgin Islands (pictured above)\nThat breaks down to a little less than $10million a book, as opposed to the $30million Barack and Michelle each stand to make in their deal.\nThe amount currently on the table for the Obamas also eclipses the $15million Bill Clinton was paid for his post-White House memoir My Life which was released in 2004, and the $10million deal score by George W. Bush for the 2010 release Decision Points.\nObama is known for his tropical holidays, having spend time with Richard Branson in the British Virgin Islands.\nThe former president was pictured horsing around with the billionaire as he learned to kitesurf, and later seen with Michelle posing with locals and soaking up the sun.\nObama also loves taking trips to Palm Springs, California, where he hits the golf course and treats himself to some desert air.\nA view you'll never tire of: The back door of a villa looks out onto the private pool and lagoon\nA beach of your own: The tiny number of villas on the island means seeing someone else on the beach your villa backs on to is incredibly rare\nThe coast is a mix of white sand beaches and colourful reefs - perfect for snorkelling","url":"https://www.dailymail.co.uk/news/article-4319430/Obama-travels-Marlon-Brando-s-private-Polynesian-island.html"}
