{"authors":[],"date_download":"2018-10-30 14:23:39","date_modify":"2018-10-30 14:23:39","date_publish":"2015-05-09 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaCheapenstheLegacyofOurFallenHeroes.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_05_obama_cheapens_the_legacy_of_our_fallen_heroes_1540909419.html","title":"Obama Cheapens the Legacy of Our Fallen Heroes","title_page":"Obama Cheapens the Legacy of Our Fallen Heroes","title_rss":"NULL","source_domain":"americanthinker.com","text":"Obama Cheapens the Legacy of Our Fallen Heroes\nThey died defending our country. They died that their sons and daughters and loved ones would be safe in their country. They died that their sons and daughters and loved ones rights and privileges as citizens would be preserved -- life, liberty, and the pursuit of happiness. And now Obama is cheapening their sacrifice. By administrative legislation, Obama is attempting to give the most precious right of citizenship -- the right to vote -- to illegals who don’t give a damn about the sacrifices of our fallen heroes. Illegals already have many (and even more) government benefits than citizens. They do vary from state to state but here is a rundown of state and national government overt and de facto benefits for illegals in NY.\nEducation By a 1982 Supreme Court decision, states are required to provide K-12 public education for students without legal immigrant status. SUNY tuition policy states that undocumented aliens who attend New York high schools for at least 2 years and graduate from them may be eligible for the in-state tuition rate. Health Proof of citizenship is required to qualify for Medicaid, unless a woman is pregnant, or the situation is considered an \"emergency.\" New York State law requires that hospitals treat everyone who requires emergency care. This includes patients with emergency mental conditions. Labor Believe it or not, illegal immigrants are eligible for workers' compensation, but not unemployment insurance. Labor standards laws also still apply to illegal aliens, such as the minimum wage, hours of labor, or prevailing wage on public construction projects. Welfare Whether illegal aliens can obtain state benefits is not clear-cut. The short answer appears to be that they are not legally entitled to most benefits, but do in fact receive them. Federal rules generally bar illegal aliens from participation in state and local public benefit programs, unless the benefit is for the treatment of an emergency medical condition, or needs emergency disaster relief or immunization. Otherwise it would seem that illegals do not qualify for additional sate public assistance. But de facto it is an entirely different story. That's because the burden of determining lawful status in the U.S. is on the shoulders of county social services employees who have neither the legal jurisdiction nor the practical ability to determine one's immigration status. Only an immigration official or federal worker whom the Secretary of Homeland Security has so designated has such authorization. Local agencies simply cannot make the determination that someone is an illegal alien. Therefore, the law is usually overlooked and illegal aliens manage to qualify for state and local benefits. Moreover, it is not as if illegals have no impact on the quality of life of U.S. citizens. It is not just that the availability of massive numbers of illegal immigrants depress wages, it is the fact that their sheer numbers keep wages from rising over time and that is the real harm experienced by citizen workers in the low skilled labor market. The above is from a 2008 study by the Center for Immigration Studies. A recent study by Harvard economist George Borjas confirms the above by showing that the high immigration rates just from 1980 to 2000 cut low-skilled workers' wages by 7.4%.The situation has only gotten worse since then. It is not as if “solving” the illegals problem must be done by an ugly mess involving forced busing and dragging people from their homes. The Arizona law enforcing strict penalties on illegals was working as intended -- self-deportation -- until it was gutted by the Supreme court in 2012. But, according to the Heritage Foundation, all Arizona had to do was begin strict enforcement of a 1986 law authorizing penalizing employers of illegals. No jobs magnet, no welfare magnet, no illegals. How hard is that? But now Obama intends to add insult to injury. The Obama administration won‘t even let states ask for proof of citizenship on voter registration forms -- a bald-faced attempt to get the illegal vote. In an amicus brief, the American Civil Rights Union (ACRU) has submitted evidence and arguments to the Supreme Court showing that this is exactly what has been happening: the federal form is failing to keep “non-citizens” off the rolls. The ACRU went on to claim that, in fact, left to itself, the federal voter registration form is causing the problem. The Obama administration is using every administrative ploy/inducement they can get away with to get the illegal vote. And lumping legal immigrants in with illegals under the rubric of “non-citizens” is part of their rhetorical obfuscation. The attempt is to make it seem that initiatives to prevent illegals from voting is a xenophobic assault on legal immigrants. And even the ACRU has been lured into using the term “non-citizens.” It is the illegals that are the problem -- legal immigrants tend to follow the rules. Just as their forefathers fought and died for their rights as citizens, their sons and daughters and descendants had better learn that the fight never ends. In short, that means voting and supporting candidates that put U.S. citizens’ rights and interests first and honor those fallen heroes who died to protect those same rights. By contrast Obama and team act as if they represent international interests and subsume national interest to perceived international interests. Who wants to be a parochial representative of National interests of a deeply flawed nation when one can be an international leader? After all, as we all know, charity begins abroad.","url":"https://www.americanthinker.com/articles/2015/05/obama_cheapens_the_legacy_of_our_fallen_heroes.html"}
