{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:35:16","date_modify":"2018-10-30 21:35:16","date_publish":"2015-05-18 18:09:09","description":"President Obama announced his new @POTUS Twitter account this morning, but avid technology enthusiasts were surprised to see him tweet from an iPhone. |","filename":"data/vaneerConsumption/ObamaTweetsFromiPhoneAfterSayingHeCantHaveOne.json","image_url":"https://media.breitbart.com/media/2014/11/obama-phone-pointing-WH.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_18__1540935316.html","title":"Obama Tweets From iPhone, After Saying He Can’t Have One","title_page":"Obama Tweets From iPhone, After Saying He Can’t Have One | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama announced his new @POTUS Twitter account this morning, but avid technology enthusiasts were surprised to see him tweet from an iPhone.\nWhen he first took office, Obama was widely hailed for being the first president to have a BlackBerry, as a special device was detailed by the Secret Service for security reasons. He never publicly switched to an iPhone.\n“I’m not allowed for security reasons to have an iPhone,” he explained to a group of young people at the White House in December 2013.\nObama also uses an iPad for reading, revealing in a interview with Univision’s Jorge Ramos that he had his own personal tablet.\n“I do have an iPad,” Obama said, adding sarcastically, “I mean, Jorge, I’m the president of the United States, you think I’ve got to go borrow somebody’s computer?”\nIt’s unclear what device the president used for his first tweet – whether he had his own personal iPhone or if he borrowed someone else’s iPhone.\nThe White House later released a photo of the president sending a tweet from his new account.\nHere’s a photo of President Obama sending the very first @POTUS tweet from the Oval Office. pic.twitter.com/EQGmVAlybh — Kori Schulman (@ks44) May 18, 2015\nUpdate:\nA White House official reveals to BuzzFeed reporter Evan Mcmorris-Santoro that the president did not use his personal iPhone to tweet this morning, but rather used an iPhone registered for the use of White House staff.","url":"https://www.breitbart.com/politics/2015/05/18/obama-tweets-from-iphone-after-saying-he-cant-have-one/"}
