{"authors":[],"date_download":"2018-10-30 14:28:56","date_modify":"2018-10-30 14:28:56","date_publish":"2015-01-29 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaselectionminionsdescendonIsrael.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_01_obamas_election_minions_descend_on_israel_comments_1540909736.html","title":"Obama's election minions descend on Israel","title_page":"Blog: Obama's election minions descend on Israel","title_rss":"NULL","source_domain":"americanthinker.com","text":"Barack Obama doesn’t appreciate anyone treating him like he treats everyone else. That’s why the president will not be meeting with Israeli prime minister Bibi Netanyahu when, in response to an invitation from House Speaker John Boehner, he comes to the U.S. to address a joint session of Congress on the threat a nuclear Iran poses to Israel and the world. Petulant child Barack Obama doesn’t take perceived insult well. His response is usually spiteful, and disproportionately so. The president embodies what Robert Kennedy meant when he said, “Don’t get mad; get even.” On more than one occasion Barack Obama has reminded his political adversaries that he won. The president has publicly rebuked congressmen, dressed down Supreme Court justices at a State of the Union address, and scolded reporters, political adversaries, and anyone else he perceives as critical of his one-sided, left-leaning progressive vision. On... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/01/obamas_election_minions_descend_on_israel_comments.html"}
p out of meetings, mock Republicans, and issue threats.\nAnd the ingenious Barack Obama has also been known to display his vindictiveness in more creative ways.\nTake for instance sending non-verbal messages of approval or disapproval with his selective attendance at funerals. If a conservative ally or war hero passes away or a black thug or a border-crossing illegal murders a law enforcement officer, their deaths are ignored. On the other hand, liberal celebrities, civil rights activists, Saudi dictators, communist South African presidents, and any other individuals whose deaths further his liberal agenda are all recognized with effusive condolences.\nBut skipping funerals and bubble-wrapping and sending back to Britain Winston Churchill’s bust pale in comparison to Obama’s vile approach toward Israeli prime minister Bibi Netanyahu.\nCaught on an open mic talking with Nicolas Sarkozy, Obama responded to the former French president, who said he could not stand Netanyahu and called him a liar, by saying, “You're fed up with him, but I have to deal with him every day!”\nThe year prior, Obama had presented Mr. Netanyahu with a list of 13 demands designed to mend fences with Palestine, one of which was for all construction in East Jerusalem be halted. When Bibi balked, the president stood up, announced, “I'm going to the residential wing to have dinner with Michelle and the girls,” and stormed out of the room, leaving the Israeli prime minister sitting alone for over an hour.\nIn 2011, Scott Wilson of the Washington Post described the relationship between Bibi and Barack perfectly when he wrote that “Obama and Netanyahu are allies only by tradition, and their relationship lacks personal warmth and is tested often by their differing political views.”\nIn other words, the relationship is cold, confrontational, and at times openly hostile.\nNetanyahu is offended by Obama’s wanting to negotiate with a nation whose former president, Mahmoud Ahmadinejad, said, “Anybody who recognizes Israel will burn in the fire of the Islamic nation's fury,” and whose Ministry of Defense stated that “[t]he day will come when the Islamic people in the region will destroy Israel and save the world from this Zionist base.”\nThat’s why, when invited by John Boehner to address a problem Barack Obama refuses to deal with, for the safety and well-being of both America and Israel, Netanyahu graciously accepted the invitation to deliver a message to a Congress craving a dose of reality.\nEvidently, Obama is furious that Boehner invited Netanyahu. A White House spokesperson speaking on Mr. Obama’s behalf said that Bibi accepting the invitation is equivalent to spitting in the president’s face.\nIf I may, saying Prime Minister Netanyahu “spat in our face publicly,” referring of course to President Obama’s face, is a dramatic word picture.\nWhen the anonymous spokesperson stressed that “Netanyahu ought to remember that President Obama has a year and a half left to his presidency, and that there will be a price,” it was exactly the kind of nasty Chicago-style threat Barack the community organizer is now known for.\nThen, just a few days after the “price to pay” warning, Obama refused to meet with the Israeli leader. Citing “the proximity to the Israeli election,” National Security Council spokeswoman Bernadette Meehan said:\nAs a matter of long-standing practice and principle…[and]…to avoid the appearance of influencing a democratic election in a foreign country… we do not see heads of state or candidates in close proximity to their elections.\nAnd while that seems like a noble practice, we now come to find out that the “price to pay” may involve the Obama administration doing the exact opposite of “long-standing practice and principle.” In fact, from the looks of things, Barack Obama may be very interested in “influencing a democratic election in a foreign country.”\nAccording to Israeli media outlet Haaretz, the “Anyone but Bibi” V-2015 campaign is being assisted by Harvard-educated Jeremy Bird, Obama’s 2008 and 2012 campaigns’ Organizing for Action deputy national field director. The V-2015 plan is to defeat Bibi by engaging in an Israeli ground operation similar to the one that helped secure Obama a two-term U.S. presidency.\nFlush with American money, Bird and a team of Obama community organizers are working with “One Voice International,” a U.S. State Department-funded grassroots movement whose goal is to “amplif[y] the voice of mainstream Israelis and Palestinians, empowering them to propel their elected representatives toward the two-state solution.”\nCoincidentally, the former COO of Soros Fund Management, Gary Gladstein, sits on the “One Voice” Honorary Board of Advisors.\nThat’s why Barack Obama is undoubtedly anxious to see his nemesis, for repeatedly defying the president’s demands, and for treating the PLO and the soon-to-be-nuclear Iran like nothing more than common terrorists, crushed by a two-state-friendly opponent.\nBottom line: once again, the malicious, spiteful Barack Obama, whose minions have successfully placed in office a leader who intrinsically despises the nation he leads – twice – may be attempting to get his own way by replacing a leader who loves Israel with a leader who does not.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/blog/2015/01/obamas_election_minions_descend_on_israel.html"}
