{"authors":[],"date_download":"2018-10-23 00:13:41","date_modify":"2018-10-23 00:13:41","date_publish":"2016-01-28 13:55:27","description":"US President Barack Obama has called for faster research on the quick-moving Zika virus, which is spread by mosquitoes and has been linked to a rise in birth...","filename":"data/vaneerConsumption/ObamaurgesswiftactiononZikavirus.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7f9zl-2vdWmEltwXfba0ce28e632950fa2-165_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3419396_Obama-urges-swift-action-Zika-virus_1540253621.html","title":"Obama urges swift action on Zika virus","title_page":"Obama urges swift action on Zika virus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obama urges swift action on Zika virus\nUS President Barack Obama has called for faster research on the quick-moving Zika virus, which is spread by mosquitoes and has been linked to a rise in birth defects in Brazil.\nObama on Tuesday urged better diagnostic tests and the development of vaccines and treatments against the virus, which the World Health Organization has said is likely to spread throughout the Americas.\nAs of now, there is no vaccine or medicine to treat Zika virus, and no way to prevent it other than by trying to avoid mosquito bites.\nA lab researcher works with mosquitos on January 25, 2016 in Medellin, Antioquia department, Colombia ©Raul Arboleda (AFP/File)\nObama was briefed on the situation by top science experts in the US government, including the US Centers for Disease Control and Prevention, Health and Human Services, and the National Institutes of Health, according to a White House statement.\nThe CDC also expanded its travel warning for pregnant women and those considering becoming pregnant to avoid 24 areas in Latin America and the Caribbean that have seen cases of Zika virus.\nNow, travelers are advised to postpone visits to the US Virgin Islands and the Dominican Republic, along with Puerto Rico, Barbados, Bolivia, Brazil, Cape Verde, Colombia, Ecuador, El Salvador, French Guiana, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Martinique, Mexico, Panama, Paraguay, Saint Martin, Samoa, Suriname and Venezuela.\n- US under threat -\nThere have not yet been any cases of local transmission of Zika virus within the United States, although infected travelers have returned to the country after visiting other areas.\nHowever, a recent study in The Lancet suggests that Zika virus could reach regions of the United States in which 60 percent of the population lives, or some 200 million Americans.\n\"This highlights the need for NIH and its partners in the public and private sectors to intensify research on Zika virus and to look for new ways to treat the disease and prevent its spread,\" NIH director Francis Collins wrote on his blog.\nZika virus is spread to people primarily through the bite of an infected Aedes species mosquito, according to the CDC.\nSymptoms are usually mild and may include fever, rash, joint pain and conjunctivitis.\nHowever, the virus can pass from a pregnant women to her fetus, and global health authorities are concerned by an apparent link between Zika virus and nearly 4,000 cases of babies born with unusually small heads -- a condition known as microcephaly -- in Brazil.\nCollins stressed that more research is needed to prove if there is any cause-and-effect between the Zika virus and brain defects.\nMeanwhile, experts are also concerned about \"reports in French Polynesia and Brazil of a possible connection between Zika infection and Guillain-Barré syndrome, a mysterious condition in which the immune system attacks part of the peripheral nervous system,\" said the NIH director.\nHe added that US health authorities are \"mobilizing swiftly\" to respond to Zika, and researchers at the National Institute for Allergy and Infectious Diseases are already \"working on vaccine candidates to prevent Zika virus from infecting people.\"\nThe first documented case of human infection with Zika virus was in 1952, according to the World Health Organization.","url":"https://www.dailymail.co.uk/wires/afp/article-3419396/Obama-urges-swift-action-Zika-virus.html"}
