{"authors":[],"date_download":"2018-10-30 00:59:30","date_modify":"2018-10-30 00:59:30","date_publish":"2016-04-15 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaApologyMayFollowKerryHiroshimaVisit.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_04_obama_apology_may_follow_kerry_hiroshima_visit_comments_1540861170.html","title":"Obama Apology May Follow Kerry Hiroshima Visit","title_page":"Articles: Obama Apology May Follow Kerry Hiroshima Visit","title_rss":"NULL","source_domain":"americanthinker.com","text":"On April 11, John Kerry became the first Secretary of State to pay his respects to at Hiroshima’s memorial to those who died when the atomic bomb was dropped on that city on August 6, 1945. That event, and the dropping of a second atomic bomb on the city of Nagasaki on August 9, brought a victorious and rapid end to World War II, and a Japanese surrender 6 days after Nagasaki, saving potentially millions of casualties on both sides if the U.S. had been forced to invade the Japanese home islands. Kerry’s statement during the visit, as reported by CNBC, completely misrepresented the significance of the event, ignored the fact Japan brought tragedy on itself by attacking us at Pearl Harbor, and falsely blamed the instruments of war for the tragedy of war: \"Everyone in the world should see and feel the power of this memorial. It is a stark, harsh, compelling reminder not only of our obligation to end the threat of nuclear weapons, but to rededicate all our effort... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/04/obama_apology_may_follow_kerry_hiroshima_visit_comments.html"}
ult of murderous tyrants’ seeking to extinguish freedom and liberty throughout the world. He forgets the Bataan death march, the rape of Nanking, and what the world would have been like if Japan had won or got the atomic bomb before we did.\nIt is not nuclear weapons that threaten us but rather the tyrants and terrorists that would use them against us. We are not threatened by French, British or Indian nukes. We are threatened by those in the hands of China, Russia, and North Korea. Pakistan’s nukes could be a threat if they fall in the hands of terrorists.\nThe irony here is that Kerry speaks of a world without nuclear weapons even as he engineered a nuclear deal with Iran that almost guarantees inevitable development of nuclear weapons even as it tests ballistic missiles, in violation of U.N. agreements, to deliver them to targets in Israel and eventually Europe and the United States.\nNuclear weapons in the right hands -- ours -- ended World War II. Nuclear weapons prevented another world war for 70 years and won the Cold War for the West. Those who advocated a “nuclear freeze” ignored the fact that weapons do not cause wars but appeasement of tyrants does. World War II ended at Hiroshima and Nagasaki. It began at Munich.\nPresident Obama shares Kerry’s dream of a world without nuclear weapons, ignoring the fact that in the day before Pearl Harbor, as war already raging across Asia and Europe, we lived in such a world. There was no “peace in our time” or security as freedom’s light threatened to be extinguished. In 2009, in a speech in Prague, part of his world apology tour, he talked about the need to get rid of nuclear weapons -- starting with ours:\nFirst, the United States will take concrete steps towards a world without nuclear weapons. To put an end to Cold War thinking, we will reduce the role of nuclear weapons in our national security strategy, and urge others to do the same. Make no mistake: As long as these weapons exist, the United States will maintain a safe, secure and effective arsenal to deter any adversary, and guarantee that defense to our allies -- including the Czech Republic. But we will begin the work of reducing our arsenal.\nHe has kept his word, letting our nuclear arsenal atrophy, drawing the number of nukes in our inventory while refusing to develop replacements and letting our aging missiles rust in their silos. He does indeed dream of a world without nuclear weapons – starting with ours,\nAs Investors Business Daily noted, Obama targeted nuclear weapons, particularly the U.S. arsenal during his 2008 campaign for the White House:\nIn a video made for the group Caucus for Priorities, Obama pledged: “I will set a goal of a world without nuclear weapons. To seek that goal, I will not develop new nuclear weapons; I will seek a global ban on the production of fissile material; and I will negotiate with Russia to take our ICBMs off hair-trigger alert, and to achieve deep cuts in our nuclear arsenals.”\nIt is one campaign promise he has kept.\nKerry’s words stopped just short of an apology for Hiroshima. Judging from his words in that city and by President Obama’s expressed antipathy for nukes, one wonders if a President Obama would have had the courage to drop the bomb, as Harry Truman did, or the foresight to even launch the Manhattan Project which developed it, as President Franklin Roosevelt did. The world would have been a very different place had these two courageous presidents done what they did.\nAs Investor’s Business Daily editorialized in 2011, a presidential apology for Hiroshima might have occurred as early as President Obama’s 2009 visit to Japan, during his world apology tour:\nOne stop on his tour was Prague in August 2009. There he spoke of “America’s commitment to seek the peace and security of a world without nuclear weapons,” ignoring that before 1945 we lived in such a world and it was neither peaceful nor secure. Another stop on the tour was in Japan, where Obama in November 2009 bowed to the emperor, something no American president had ever done. It could have been worse if plans to visit Nagasaki and Hiroshima to apologize for winning the war with the atom bombs had come to pass. A heretofore secret cable dated Sept. 3, 2009, was recently released by WikiLeaks. Sent to Secretary of State Clinton, it reported Japan’s Vice Foreign Minister Mitoji Yabunaka telling U.S. Ambassador John Roos that “the idea of President Obama visiting Hiroshima to apologize for the atomic bombing during World War II is a ‘nonstarter.'”\nSomebody must have broached the idea for it to be shot down so forcefully. This time it could happen when President Obama, always worried about his legacy, visits the upcoming G-7 Conference in Japan. An apology would be a tragedy that ignores to aggression that started World War II and the lives that were saved by its abrupt end.\nOkinawa, where more than 150,000 Japanese and 12,000 Americans died, was a horrific preview of what an invasion of Japan would bring. Japanese resistance ended after the Hiroshima and Nagasaki let Tokyo know there would soon be nothing left to defend.\nNo apology for Hiroshima is necessary and none will be accepted by the American people.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/04/obama_apology_may_follow_kerry_hiroshima_visit.html"}
