{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:28:53","date_modify":"2018-10-30 19:28:53","date_publish":"2016-03-28 20:25:48","description":"With FARC, President Barack Obama once again seeks peace at any price with America's historic enemies while abandoning its allies and friends.","filename":"data/vaneerConsumption/ObamaSurrenderstoColombiasFARCTerroristsinCuba.json","image_url":"https://media.breitbart.com/media/2016/03/Screen-Shot-2016-03-28-at-1.24.45-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_28__1540927733.html","title":"Obama Surrenders to Colombia's FARC Terrorists in Cuba","title_page":"Obama Surrenders to Colombia's FARC Terrorists in Cuba","title_rss":"NULL","source_domain":"breitbart.com","text":"Secretary of State John Kerry met last week in Havana, Cuba with the Revolutionary Armed Forces of Colombia (FARC), which is listed by the State Department as a terror organization and widely recognized as the deadliest and largest Marxist terror group in the world. The Obama administration is encouraging the Colombian government to negotiate with FARC. Thus far, the Cuban-sponsored talks have yielded little but one-way concessions to terror.\nMary Anastasia O’Grady of the Wall Street Journal notes the hypocrisy of the Obama administration fighting the Islamic State terrorists in the Middle East while urging Colombia, a key Latin Ameriacn ally, to surrender to FARC:\nThe meeting produced photos of the Colombian war criminals wearing crisp white guayabera shirts sitting around a large coffee table with the U.S. secretary of state. The FARC wasted no time using the images for propaganda. “We hope that as a consequence, we are recognized as a political force committed to the expansion of democracy and social progress in Colombia,” it announced. Four days later Mr. Kerry was in the Belgian capital to deliver condolences to Prime Minister Charles Michel and pledging never to give in to Islamic State: “We will not rest until we have eliminated your nihilistic beliefs and cowardice from the face of the Earth.” A goodly number of Colombians feel the same way about the FARC. The Castro-backed group has waged an insurgency against the Colombian democracy that has claimed some 220,000 lives. It is one of the largest drug-trafficking cartels in the world. The U.S. State Department lists the FARC as a foreign terrorist organization. Two FARC leaders who met with Mr. Kerry have each been sentenced in a Colombian court, in absentia, to 13 years in prison for recruiting child soldiers, including girls who were used for sex. But the Obama administration says Colombians need to trust the FARC, and let all its members, including its leaders, go unpunished and go into politics in order to secure peace. Would Americans take that deal?\nThe paradox is part of a broader pattern throughout seven years of the Obama administration, in which President Barack Obama seeks peace at any price with America’s historic enemies while abandoning its allies and friends.\nColombia is experiencing what Israel recently experienced in the Iran deal; what Cuban democracy activists felt as Obama reconciled with the regime; what France and Belgium experienced when Obama paid scant attention to Islamic terror attacks; what Ukraine experienced in its futile efforts to resist Russian invasion; what friendly Arab regimes experienced during the Arab Spring; what the Iraqi people saw in Obama’s hasty withdrawal; and what happened Poland and the Czech Republic when Obama abandoned missile defense in the farcical Russian “reset.”\nObama’s appeasement has taken on a particular urgency in Latin America, where he famously embraced the late Venezuelan strongman Hugo Chávez, tolerated an anti-American harangue by Nicaraguan president Daniel Ortega, isolated the legitimate government of Honduras in favor of Chavez-backed, would-be dictator and antisemite Manuel Zelaya; and welcomed left-wing governments throughout the region. Even in his recent visit to Argentina, where a new, more conservative and pro-American government recently took office, Obama emphasized American responsibility for the misdeeds of past regimes, including the “Dirty War” of the late 1970s and early 1980s.\nIn November 2013, Kerry declared at a meeting of the Organization for American States that “the era of the Monroe Doctrine is over.” He cast the Monroe Doctrine as a license for America to intervene in Latin American countries. In fact, it was a warning to meddling European powers not to carry their conflicts to the Western Hemisphere. It was a key to resisting communism and protecting freedom in the region. Yet in Kerry and Obama’s misreading of history, it was a tool of oppression, an imperialist legacy which they believe it is their unique historic mission to undo.\nIn that sense, the Obama administration’s policy toward Latin America is little different from the pro-communist chic once embraced proudly by Bernie Sanders, and with which the Senator from Vermont was confronted at a CNN debate earlier this month. There is no sense of American interests — whether backing up Colombia’s decades-old fight against narcoterrorism or preventing Russia and Iran from expanding their bridgeheads in the region — or American values such as freedom and human rights. There is also no concern whatsoever for the suffering endured by victims of Latin Ameriacn tyrants or terrorists. To Obama, they are all, ultimately, America’s imperialist fodder.\nObama’s surrender will not to be easy to undo. America’s enemies will pocket Obama’s concessions and demand more while they consolidate their power. This is not peacemaking; it is sowing the seeds of crisis and conflict.","url":"https://www.breitbart.com/politics/2016/03/28/obama-surrenders-to-colombias-farc-terrorists-in-cuba/"}
