{"authors":["Associated Press"],"date_download":"2018-10-23 02:04:04","date_modify":"2018-10-23 02:04:04","date_publish":"2016-01-28 16:49:58","description":"Dubbed the White House Cancer Moonshot Task Force, the group will be modest in scope — the White House says the task force is 'advisory only.'","filename":"data/vaneerConsumption/ObamacreatesnewcancertaskforceblessingBidenseffort.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:18a495c521694b71a71e4d05c2224039-2vdWmEltwXfba0ce28e632ac0d45-883_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421135_Obama-creates-new-federal-task-force-cancer_1540260244.html","title":"Obama creates new cancer task force, blessing Biden's effort","title_page":"Obama creates new cancer task force, blessing Biden's effort | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Barack Obama created a new federal task force Thursday to accelerate cancer research, putting Vice President Joe Biden in charge of the drive to streamline government efforts toward a cure.\nDubbed the White House Cancer Moonshot Task Force, the group will be modest in scope — the White House says the task force is 'advisory only.'\nYet its formation gives a formal green light to what until now has been an amorphous effort by the vice president to supercharge cancer research during his final year in office.\n'We're not trying to make incremental change here,' Biden wrote on the blog site Medium.\n'We're trying to get to a quantum leap on the path to a cure.'\nSee updates in the search for a cure for cancer as Obama creates advisory task force\nVice President Joe Biden points at President Barack Obama during the president's State of the Union address to a joint session of Congress on Capitol Hill in Washington. President Barack Obama is creating a new federal task force to accelerate cancer research.\nA presidential memorandum signed by Obama on Thursday says the task force's goal is to double the rate of progress on treatment and prevention, a benchmark Biden first introduced earlier this month in tandem with Obama's State of the Union address.\nThe administration hasn't said exactly how that will be measured, but laid out areas for potential progress including better use of federal dollars to support cancer prevention, treatment and early detection.\nThe Defense Department, the Food and Drug Administration and the National Institutes of Health are among about a dozen federal agencies involved.\nThe task force will submit a report on its findings to Obama at the end of December — just he Obama and Biden leave office.\nSen. Lamar Alexander, R-Tenn., said the Senate health committee he chairs is working on a bipartisan bill to speed development of drugs and medical devices.\nHe said the task force would 'set the stage for the Senate to get a bipartisan result.'\nBiden, who has spent recent months meeting with hundreds of cancer researchers, has put a particular emphasis on eliminating obstacles to collaboration and data-sharing among various cancer centers, doctors and universities.\nIn this Feb. 5, 2013 file photo, then-Delaware Attorney General Beau Biden is seen at the Justice Department in Washington. President Barack Obama is creating a new federal task force to accelerate cancer research. He's tapping Vice President Joe Biden to chair the White House Cancer Moonshot Task Force. Biden's son Beau died of brain cancer last year.\nA key focus for the task force will be identifying bureaucratic and regulatory hurdles that make the government a bottleneck in the research process.\nThe White House-sanctioned effort taps into deeply personal territory for Biden, whose 46-year-old son, former Delaware state Attorney General Beau Biden, died from brain cancer in May.\nThe loss played heavily into Biden's decision not to run for president in 2016, but he instead vowed a 'moonshot' to cure cancer before leaving the White House.\n'I don't claim to be a cancer expert,' Biden said. 'But I do have something to offer when it comes to being a catalyst and bringing folks together.'","url":"https://www.dailymail.co.uk/health/article-3421135/Obama-creates-new-federal-task-force-cancer.html"}
