{"authors":[],"date_download":"2018-10-30 00:54:13","date_modify":"2018-10-30 00:54:13","date_publish":"2016-10-18 16:14:39","description":null,"filename":"data/vaneerConsumption/ObamacareFailsAgain.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/10089497055_69ba47b210_o.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860853.html","title":"Obamacare Fails, Again","title_page":"Obamacare Fails, AgainThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Pennsylvanians shopping on the health care exchange are in for a rude awakening. This week, the state Insurance Department announced premiums for individual plans will increase by an average of 32 percent. The largest hike is for Highmark customers, who will see a 55 percent jump in premiums. Nine companies requested rate increases of more than 10 percent this year, roughly twice the number of double-digit rate hike requests from 2016.\nAs premiums and deductibles continue to climb, enrollment is on the decline. There were 412,347 Pennsylvanians using exchange insurance in March 2016, down from a high of 472,697 in January 2015. The lack of interest from healthy Pennsylvanians is driving insurance companies to the brink.\nWes Venteicher with the Pittsburgh Tribune Review reports, “[Insurance Commissioner] Miller said the final rates followed a back-and-forth in which insurers threatened to abandon the market, which could have left some counties with no insurers selling the plans.” It’s a familiar refrain across the country.\nEarlier this year, the insurance commissioner from Tennessee described the state’s Obamacare exchange as “very near collapse” after approving significant premium hikes, including a 62 percent premium increase for Tennessee’s Blue Cross Blue Shield.\nBut no amount of premium hikes could convince companies like Aetna or UnitedHealthcare to remain in Pennsylvania. Neither could hikes entice Blue Cross Blue Shield of New Mexico, Blue Cross Blue Shield of Minnesota, or Texas’ Scott and White Health Plan to stay put.\nThe exodus of insurance companies from the exchange leaves many counties with one choice and, in the case of Pinal County, Arizona, no choice at all. Government officials have since convinced Blue Cross Blue Shield of Arizona to provide insurance in the county. Back in Pennsylvania, residents in the southeast will have essentially one option since both participating insurers are subsidiaries of Independence Blue Cross.\nWhat’s more, Pennsylvania insurance companies are suing the federal government for “risk corridor” payments. The program was intended to stabilize the exchanges by collecting contributions from profitable insurers and redistributing those payments to insures with significant losses. The problem is: insurers incurred $2.87 billion in qualifying losses, but ended up owing just $362 million in contributions. CMS paid $0.126 on the dollar to insurers — and plans to eventually pay out the rest, but insurers aren’t waiting.\nThe slow death of state exchanges is a vivid example of Obamacare making health care more difficult to access. It’s only a matter of time before the same trend appears for those using the Medicaid expansion.\nGiving more control to regulators and bureaucrats failed. It’s time to pursue health care reforms that empower patients. Government should allow patients to decide which services health plans cover, end the tax bias towards employer-based insurance, and provide genuine cost transparency. With these principles in mind, Americans will finally be able to afford the care they need.","url":"https://spectator.org/obamacare-fails-again/"}
