{"authors":["Associated Press"],"date_download":"2018-10-23 04:27:09","date_modify":"2018-10-23 04:27:09","date_publish":"2016-01-29 20:15:00","description":"WASHINGTON (AP) — President Barack Obama sought to showcase progress on his watch on closing the pay gap for women while keeping up the pressure on business,...","filename":"data/vaneerConsumption/ObamaMoretodotoclosethepaygapforwomenminorities.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422198_US-collect-equal-pay-data-big-employers_1540268829.html","title":"Obama: More to do to close the pay gap for women, minorities","title_page":"Obama: More to do to close the pay gap for women, minorities | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obama: More to do to close the pay gap for women, minorities\nWASHINGTON (AP) — President Barack Obama sought to showcase progress on his watch on closing the pay gap for women while keeping up the pressure on business, Congress and individuals to tackle an issue he said was still far from being solved.\nMarking the seventh anniversary of signing the Lilly Ledbetter Fair Pay Act, Obama said more must be done to get women into high-paying jobs, including those in science, technology, math and engineering. In recent years, the pay disparity has narrowed slightly, but a woman in the U.S. still makes 79 cents to a man's dollar, the White House said.\n\"This will be a long haul,\" Obama said.\nWorking to ferret out abuses of equal pay laws, Obama announced that his administration will expand its collection of data from businesses about what they pay.\nIn 2014 Obama directed the Labor Department to collect data from federal contractors about what they pay employees, sorted by gender, race and ethnicity. The revised proposal will cover all businesses with 100 or more employees, regardless of whether they contract with the government.\nThe Equal Employment Opportunity Commission will collect the data, which the government will use to help identify companies that should be investigated for failing to pay workers fairly, officials said. The first reports from companies will be due in September 2017. The administration estimated that compliance will cost less than $400 per employer the first year and a few hundred dollars per year after that.\nObama, as he often does, invoked his own two daughters to argue that no American parent should have to accept their daughters having less opportunity than their sons. He also called on businesses to ensure women aren't penalized for starting a family and says men have responsibility for parenting, too.\n\"Guys, we're responsible for the family thing, too,\" Obama said. \"They're already doing more work than we are in getting that thing going.\"\nThe president reissued his call to Congress to pass further legislation giving more tools to women to fight pay disparities. Republicans have been skeptical about the legislation out of concern it could encourage frivolous lawsuits, and some Republicans criticized Obama on Friday for sidestepping Congress with the data collection effort.\n\"The way to make meaningful, lasting progress on equal pay for women isn't unilateral presidential action,\" said Sen. Deb Fischer, R-Neb.\nLedbetter, whose name has become synonymous with the equal pay issue, flanked Obama at the White House and said she still hears every day from women who are \"frustrated and angry\" about being paid less. Ledbetter's discovery that she was being paid less than her male counterparts led to a Supreme Court suit and eventually the 2009 legislation bearing her name.\n\"It hurts us, it hurts our families and it hurts our economy,\" Ledbetter said.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422198/US-collect-equal-pay-data-big-employers.html"}
