{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:45:44","date_modify":"2018-10-30 19:45:44","date_publish":"2015-05-01 12:27:14","description":"Breitbart News has confirmed that President Obama's Iran adviser followed pro-regime sites before publicizing the social media account.","filename":"data/vaneerConsumption/ObamasIranAdviserFollowedProRegimeSitesPriortoPublicizingSocialMediaAccount.json","image_url":"https://media.breitbart.com/media/2015/01/Twitter-logo-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_01__1540928744.html","title":"Obama's Iran Adviser Followed Pro-Regime Sites Prior to Publicizing Social Media Account","title_page":"Obama's Iran Adviser Followed Pro-Regime Sites Prior to Publicizing Social Media Account | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart News can now reveal what is believed to be the Twitter page of Sahar Nowrouzzadeh, whom Breitbart News recently uncovered as a former staffer for the pro-Tehran National Iranian American Council (NIAC), a group that has lobbied fiercely against any new sanctions against Iran and in favor of a nuclear deal with the terror regime.\nIn her current position, the 31-year-old Nowrouzzadeh serves as President Obama’s National Security Council director for Iran.\nBreitbart News can establish that a citizen journalist was correct in uncovering Nowrouzzadeh’s Twitter username, @saharnow, while it was still without a profile picture and did not yet display the NSC Iran director’s full name. During that time, before her first tweet on April 15, Ms. Nowrouzzadeh followed a plethora of radical figures and regime propaganda sites before adding her full name and photo to the @saharnow Twitter handle.\nIn late March, Breitbart News was able to confirm that Nowrouzzadeh was employed by NIAC, a pro-regime lobbying organization, before starting her government service. In her high-ranking position, Nowrouzzadeh has sat in on a video conference with President Obama concerning the Iranian nuclear negotiations.\nShe has since “unfollowed” the radical individuals and Iranian propaganda websites, but not before Breitbart News acquired a full list of the accounts.\nIran’s dictator, Ayatollah Khamenei, was among the individuals she had followed and has since removed from her “following” list.\nAmong the 114 people she followed before updating her profile were three high-ranking employees at NIAC, the pro-regime, anti-opposition group at which she was formerly employed. As of April 30, Nowrouzzadeh has unfollowed the NIAC employees, two of whom–Trita Parsi and Reza Marashi–are its top directors.\nShe also followed, and then unfollowed before updating her account, at least four Iranian state-run Twitter feeds that delivered pro-regime propaganda. The first, titled @NuclearTalks, links to Nucleartalks.ir, a pro-regime website based in Iran. Nowrouzzadeh followed another Iranian propaganda Twitter page, titled Meet Iran, which presents Iranian officials in a favorable light. A third Twitter handle, with the username @IranDiplomacy, links to a pro-regime, anti-Western Iranian website. The last, called Iran Nuclear Energy, links to an Iranian-based website that insists Iran’s nuclear program is peaceful.\nNowrouzzadeh followed several academics, including Duke Islamic Studies director Omid Safi, whom Breitbart News recently revealed as an apologist for Palestinian terror groups. She has since unfollowed Safi after creating a more public profile.\nIn the spirit of transparency, Breitbart News will post below all 114 Twitter handles in Nowrouzzadeh’s “following” list prior to the first public tweet from her account:","url":"https://www.breitbart.com/national-security/2015/05/01/obamas-iran-adviser-followed-pro-regime-sites-prior-to-publicizing-social-media-account/"}
