{"authors":["Associated Press"],"date_download":"2018-10-23 04:26:23","date_modify":"2018-10-23 04:26:23","date_publish":"2016-01-29 20:05:38","description":"WASHINGTON (AP) — President Barack Obama will return to Springfield, Illinois, the place where his political career began, to mark the ninth anniversary of h...","filename":"data/vaneerConsumption/ObamatoaddressIllinoisGeneralAssemblynextmonth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:bd9c55903efa4ca6832519d53269856a-3bmscybNe842cce83474b5971f9f-243_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423264_Obama-address-Illinois-General-Assembly-month_1540268783.html","title":"Obama to address Illinois General Assembly next month","title_page":"Obama to address Illinois General Assembly next month | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obama to address Illinois General Assembly next month\nWASHINGTON (AP) — President Barack Obama will return to Springfield, Illinois, the place where his political career began, to mark the ninth anniversary of his entrance into the 2008 presidential race.\nObama plans to address the Illinois General Assembly on Feb. 10, the day after New Hampshire voters go to the polls to begin choosing his successor.\nObama announced in Springfield in February 2007 that he was running for the 2008 Democratic presidential nomination. He was then a first-term U.S. senator.\nFILE - In this Feb. 10, 2007 file photo, U.S. Sen. Barack Obama, D-Ill., waves to spectators as he arrives to announce his candidacy for president of the United States at the Old State Capitol in Springfield, Ill. Obama is returning to Springfield, the place where his political career began, to mark the ninth anniversary of his entrance into the 2008 presidential race,. He plans address to the Illinois General Assembly on Feb. 10, 2016. (AP Photo/Charles Rex Arbogast, File)\nAn email to members of Obama's alumni association says he'll speak to Illinois lawmakers about \"building a better politics.\"\nObama campaigned on a pledge to change the tone in Washington. He recently said he regretted that the situation hadn't improved, but has worsened.","url":"https://www.dailymail.co.uk/wires/ap/article-3423264/Obama-address-Illinois-General-Assembly-month.html"}
