{"authors":[],"date_download":"2018-10-22 21:08:07","date_modify":"2018-10-22 21:08:07","date_publish":"2014-06-04 10:56:55","description":"The president said that under NATO's agreements \"an attack on one is an attack on all.\"","filename":"data/vaneerConsumption/ObamainPolandGivesStaunchDefenseofNATOAlliesEasternEurope.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/486106/140604-obama-poland-7a_2c93d6d1ca3a043a6682b46bfe561fa8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_obama-poland-gives-staunch-defense-nato-allies-eastern-europe-n122096_1540242487.html","title":"Obama in Poland Gives Staunch Defense of NATO Allies, Eastern Europe","title_page":"Obama in Poland Gives Staunch Defense of NATO Allies, Eastern Europe","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"I have come to Warsaw today on behalf of the United States, on behalf of the NATO Alliance, to reaffirm our unwavering commitment to Poland's security,\" Obama told an audience in Castle Square in the Polish capital of Warsaw.\n\"An attack on one is an attack on all...Poland will never stand alone. But not just Poland, Estonia will never stand alone, Latvia will never stand alone, Lithuania will never stand alone,\" he said, referencing the former Soviet nations in the Baltic that are now members of NATO.\n\"These are not just words. They are unbreakable commitments backed by the strongest alliance in the world and by the armed forces of the United States of America - the most powerful military in history.\"\nObama's speech came after the U.S. president met the newly elected Ukrainian President Petro Poroshenko, whose victory he heralded after the meeting as \"an incredible outpouring of democracy in the face of actions by Russia.\"\nHe later flew to Brussels to meet with other European leaders to discuss the Ukraine crisis.\nNATO's allies have been rattled by Russia's annexation of the Ukrainian peninsula of Crimea and alleged involvement in violence in the east of the country.\nRussia has defended its interventions in Ukraine as a means of protecting ethnic Russians beyond its borders. While Ukraine is not part of NATO, there are concerns among other neighboring member states that Russia could take a similar approach elsewhere.\nObama's address in the former Soviet state coincided with the 25th anniversary of the country's Freedom Day, the date it held partially-free elections and emerged from communist rule.\n\"Here we see the strength of free markets and the results of hard reform,\" Obama added. \"Gleaming skyscrapers soaring above this city, superhighways across this country, high-tech hubs and living standards that previous generations of Poles could only imagine.\"\n- Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/obama-poland-gives-staunch-defense-nato-allies-eastern-europe-n122096"}
