{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 22:06:23","date_modify":"2018-10-30 22:06:23","date_publish":"2015-08-27 18:52:08","description":"The Obama administration has absolutely no problem whatsoever of depriving women of necessary health care if it means retribution.","filename":"data/vaneerConsumption/ObamaAdministrationStripsKansasofFederalFamilyPlanningFunding.json","image_url":"https://media.breitbart.com/media/2015/08/youth-protest-planned-parenthood-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_27__1540937183.html","title":"Obama Administration Strips Kansas of Federal ‘Family Planning’ Funding","title_page":"Obama Administration Strips Kansas of Federal ‘Family Planning’ Funding | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Obama administration has stripped Kansas of federal Title X “family planning” funds that would have gone to Planned Parenthood clinics prior to the state defunding the abortion provider last year.\nKansas loses approximately $370,000 annually in federal Title X “family planning” funding that the Planned Parenthood affiliates in Wichita and Hays – and another unaffiliated facility in Dodge City – had been receiving. That was before Kansas passed a bill that directed Title X “family planning” funds to public health departments and hospitals, shifting it away from Planned Parenthood.\nThe abortion giant sued over no longer receiving the funding, but a federal appeals court decided in favor of the state. In May of 2014, Planned Parenthood announced it would close its clinic in Hays, and the unaffiliated facility closed as well.\nAs Breitbart News previously reported, the Obama administration has threatened states attempting to defund Planned Parenthood – by stopping its supply of Medicaid funds – with potential violation of federal law and, ultimately, the cutting off of Medicaid funds to those states.\nKansas passed the nation’s first abortion dismemberment ban earlier this year. A district judge, however, blocked the ban on the grounds that prohibiting the procedure would create an “obstacle” for women who choose to end their pregnancies with brutal dismemberment.\nGov. Sam Brownback (R) also launched an investigation into Planned Parenthood following the release of Center for Medical Progress’ undercover videos exposing the abortion giant’s practices of harvesting the body parts of aborted babies for sale on the open market.\nThe Associated Press reports Kansas Department of Health and Environment (KDHE) acknowledged “the federal government had reduced its funding to Kansas by the amount previously awarded to Planned Parenthood – ‘so there was no additional funding to give to other clinics.’”\nAP further contends:\nThe loss of about $370,000 annually in Title X money that two Planned Parenthood facilities in Wichita and Hays and an unaffiliated clinic in Dodge City had been receiving – none of which paid for abortions – has meant low-income patients are finding it harder to access birth control, cancer screenings and other reproductive health care services, medical providers say. “People have fewer places to go, and for those with limited means that may make utilizing those services even more difficult,” said J’Vonnah Maryman, director for public health at the Sedgwick County Health Department.\nHowever, Live Action News observes:\nIt’s worth pointing out that Kansas is not depriving women of vital reproductive services, as abortion activists will undoubtedly claim. Instead of funding Planned Parenthood, $300,000 will go to local health clinics, and another $300,000 will go towards pregnancy support and adoption counseling. Despite what Planned Parenthood’s defenders claim, women do not need Planned Parenthood to receive health care services — Planned Parenthood’s legitimate health care services like cancer screenings have been slashed anyway — and the only service Planned Parenthood provides that health care clinics do not is abortion.\nRegarding the claim that Planned Parenthood is needed to provide free birth control to women, during a recent segment on One America News’ (OAN) On Point, former Alaska Gov. Sarah Palin asked Rep. Diane Black, who has authored legislation to defund Planned Parenthood in the House, whether a duplication of services is occurring since under Obamacare, women can obtain free contraception.\nBlack responded:\nThere is no reason in this world why we should be giving that kind of money to an organization that really is the biggest abortion provider in the entire country when there are other agencies around – state health departments, county health departments – and by the way, they are having to compete with Planned Parenthood for those dollars. They do a wonderful job. I know this because I’ve been in medicine for a long time. I’ve seen the services. Planned Parenthood got called out several years ago when they declared they did mammograms . . . we saw they didn’t do mammograms . . . Let’s take a look at what Planned Parenthood has. They had a surplus of $127 million last year. Why are we giving them federal dollars when they have a surplus of $127 million? It is ludicrous. There are good [health] services provided for women across this country right in their communities. I’ve been a part of it for a long time, I know it, I see it. No longer, by the way, do we give money to Planned Parenthood in the state of Tennessee. We were able to defund them when I was still in the state senate . . . it should be done all the way across this country.\n“We have to just keep having the American people understand what truly is happening,” Black said. “They’ve been sold a bill of goods, a bunch of lies by the Planned Parenthood [Federation of America] and we have just got to make sure people are seeing the heart and the soul of what’s behind that curtain.”\nThe stripping of funding that once went to Planned Parenthood in Kansas suggests a punishment by the Obama administration.\n“The Obama administration has absolutely no problem whatsoever of depriving women of necessary health care if it means retribution for a state that will no longer fund one of Obama’s biggest political allies,” Live Action News explains.","url":"https://www.breitbart.com/politics/2015/08/27/obama-administration-strips-kansas-of-federal-family-planning-funding/"}
