{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:49:02","date_modify":"2018-10-30 18:49:02","date_publish":"2015-06-02 16:45:34","description":"President Obama weighed in on Bruce Jenner's transformation into Caitlyn Jenner on this month's cover of Vanity Fair, hailing the former Olympian for having the \"courage\" to do so publicly. |","filename":"data/vaneerConsumption/ObamaUsesSocialMediatoPraiseBruceJennersTransition.json","image_url":"https://media.breitbart.com/media/2015/06/bruce-jenner-cover-vanity-fair.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_02__1540925342.html","title":"Obama Uses Social Media to Praise Bruce Jenner's Transition","title_page":"Obama Uses Social Media to Praise Bruce Jenner's Transition | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama weighed in on Bruce Jenner’s transformation into Caitlyn Jenner on this month’s cover of Vanity Fair, hailing the former Olympian for having the “courage” to do so publicly.\nIt takes courage to share your story. https://t.co/Q7wWjV9Rxx — Barack Obama (@BarackObama) June 1, 2015\n“It takes courage to share your story,” the official Barack Obama account tweeted Monday.\nJenner, who came out as transgender in last month’s widely-viewed 20/20 interview with Diane Sawyer, broke the President’s record for being fastest to reach 1 million followers on Twitter on Monday. Jenner accomplished the feat in just four hours, while it had previously taken Obama five.\nThe president also asked followers to share their stories at Obama’s own Organizing for Action website.\nYour story matters in the fight for LGBT rights—share it here: http://t.co/FjAdgfkW0D — Barack Obama (@BarackObama) June 1, 2015\nObama joins other celebrities and family members who have tweeted their support for Jenner since the Vanity Fair cover hit the Internet Monday.","url":"https://www.breitbart.com/entertainment/2015/06/02/obama-uses-social-media-to-praise-bruce-jenners-transition/"}
