{"authors":[],"date_download":"2018-10-22 20:55:08","date_modify":"2018-10-22 20:55:08","date_publish":"2014-06-03 11:23:33","description":"Obama acknowledged that freed Taliban fighters could potentially engage in future activities that would threaten U.S. security but said he was confident the U.S. could go after them if that happens.","filename":"data/vaneerConsumption/ObamaDefendsBergdahlPrisonerSwapMilitaryPromisesProbe.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2016_02/480376/140601-bergdahl-jms-1627_676968e97715c7a5836864bd70755b58.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_obama-defends-bergdahl-prisoner-swap-military-promises-probe-n121016_1540241708.html","title":"Obama Defends Bergdahl Prisoner Swap, Military Promises Probe","title_page":"Obama Defends Bergdahl Prisoner Swap, Military Promises Probe","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama on Tuesday defended his decision to swap five Taliban militants for Army Sgt. Bowe Bergdahl, who apparently walked away from his unit, even as the military promised an inquiry into whether the soldier deserted.\nObama cited a “sacred” obligation not to leave American soldiers behind. Speaking in Poland, he also expressed confidence that the United States could still go after the militants if they pose a future threat to national security.\n“Regardless of the circumstances, whatever those circumstances may turn out to be, we still get an American soldier back if he’s held in captivity,” told reporters in Warsaw. “We don’t condition that.”\nRepublicans in Congress and former members of Bergdahl’s platoon have expressed outrage at the swap and at depictions of Bergdahl, the only American prisoner of war in Afghanistan, as a hero.\nAmerican military officials have told NBC News that Bergdahl, before his capture by the Taliban in June 2009, walked away from his unit without his weapon. He was handed over in exchange for five militants held at Guantanamo Bay, Cuba.\nThe Army is preparing a full, high-level inquiry into the circumstances of Bergdahl’s disappearance and his personal conduct, NBC News learned Tuesday. It will also investigate the circumstances that led to the deaths of six soldiers during the search for Bergdahl.\nThe inquiry would determine whether a formal investigation into possible criminal charges against Bergdahl is warranted. If Bergdahl is found guilty of misconduct, the options for punishment would range from administrative disciplinary action to a court-martial.\nArmy officials told NBC News that the priority is to get Bergdahl back to full health and reunited with his family.\nSgt. Josh Korder, who served in Bergdahl’s platoon, told TODAY that Bergdahl became disillusioned with combat and “just wanted to go on an adventure and walk the mountains of Afghanistan and not have anybody to answer to.”\nKorder has the names of three of his six fallen comrades tattooed on his back.\n“We all served together, and we were all in it together over there, and he broke that bond by leaving us,” he said. Speaking of the militants, he said, “You’re just going to let these guys go for somebody who you’re already saying you know walked away. That’s just not right.”\nBergdahl, 28, was a private first class when he disappeared and was promoted twice in captivity. He is recovering at an American military hospital in Germany, where he is receiving psychological care and evaluation, and will eventually be reunited with his parents, who live in Idaho.\nGen. Martin Dempsey, the chairman of the Joint Chiefs of Staff, said in a post on his Facebook page that the Army “will not look away from misconduct if it occurred.” He said that the circumstances surrounding Bergdahl’s release were unique.\n“This was likely the last, best opportunity to free him,” the general said. “As for the circumstances of his capture, when he is able to provide them, we’ll learn the facts. Like any American, he is innocent until proven guilty.”\nCongressional Republicans have said that Obama skirted the law by failing to give Congress 30 days’ notice before releasing a prisoner from Guantanamo. The five, all high-level Taliban militants, were sent to Qatar.\nAdministration officials, including both the president and Defense Secretary Chuck Hagel, have said that they seized a short window to act because Bergdahl’s health was deteriorating.\nObama also said Tuesday in Poland that Congress had been consulted “for some time” about a possible prisoner exchange.\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/obama-defends-bergdahl-prisoner-swap-military-promises-probe-n121016"}
