{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:28:31","date_modify":"2018-10-30 19:28:31","date_publish":"2016-09-07 12:53:22","description":"Judge Michael W. Fitzgerald halted a BLM plan to open more than 1,500 square miles of federal land in central California to fracking.","filename":"data/vaneerConsumption/ObamaJudgeHaltsNewFrackingonFederalLandinCalifornia.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-462403378.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_07__1540927711.html","title":"Obama Judge Halts New Fracking on Federal Land in California","title_page":"Obama Judge Halts New Fracking on Federal Land in California","title_rss":"NULL","source_domain":"breitbart.com","text":"Judge Michael W. Fitzgerald halted a Bureau of Land Management (BLM) plan to open more than 1,500 square miles of federal land in central California to fracking on Tuesday, saying that more study is needed of the effects on groundwater and endangered species.\nFitzgerald, who was appointed to the bench in 2011 by President Barack Obama, said that the BLM failed to take a “hard look” at the local environmental impacts of fracking, or hydraulic fracturing, in 25% of anticipated wells.\nFracking involves the injection of fluids deep into subsurface rock formations to loosen them and to allow trapped oil and gas to flow freely into wells, where they can be extracted. The practice has revolutionized the American energy industry, and is partly responsible for the U.S. passing Saudi Arabia as the world’s number one oil producer. However, environmentalists have long fought the practice as part of a broader campaign against fossil fuels, blaming fracking for everything from earthquakes to groundwater contamination.\nThe lawsuit against the BLM plan was brought by two environmental groups, the Center for Biological Diversity and Los Padres ForestWatch. The Associated Press reported:\n“This is a huge victory in the fight to protect our water and wildlife from fracking pollution and dangerous drilling,” Brendan Cummings, director of the Center For Biological Diversity, said in a statement. “As California struggles against drought and climate change, we’ve got to end fracking and leave this dirty oil in the ground.” … Catherine Reheis-Boyd, president of the oil-industry group the Western States Petroleum Association, said in response to the decision that “hydraulic fracturing and other well stimulation treatments in California have undergone rigorous analysis and review, culminating in the most stringent environmental standards nationwide.”\nThe region in which fracking would have been allowed was based in the agricultural Central Valley, stretching to portions of the Central Coast and the souther Sierra Nevada.\nKern County, in the Central Valley, is already the top oil-producing county in the nation.\nCalifornia Gov. Jerry Brown has resisted calls to end fracking in the state, partly because of the revenue it generates, through taxation, for the state’s strained coffers. Democratic presidential nominee Hillary Clinton also came under fire during the 2016 primary for refusing to ban fracking outright, as Sen. Bernie Sanders (I-VT) wanted to do.\nJudge Fitzgerald gave the BLM until Sep. 21 to submit arguments as to why he should not issue an injunction against its plan going forward.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/local/2016/09/07/obama-judge-halts-new-fracking-federal-land-california/"}
