{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:16:15","date_modify":"2018-10-30 18:16:15","date_publish":"2015-05-12 17:04:19","description":"“I think the effort to suggest that the poor are sponges and leeches are don’t want to work, are lazy or are undeserving got traction,” Obama said. He blamed the Fox News channel for feeding that narrative. |","filename":"data/vaneerConsumption/ObamaAdmitsThatFoxNewsStoriesAboutObamaphonesMakeMeMad.json","image_url":"https://media.breitbart.com/media/2015/05/obamaz.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_12__1540923375.html","title":"Obama Admits That Fox News Stories About Obamaphones 'Make Me Mad'","title_page":"Obama Admits That Fox News Stories About Obamaphones 'Make Me Mad' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During a panel discussion about poverty, President Obama criticized Fox News for stereotyping poor people as “sponges” or “leeches.”\nPart of the problem, he explained, was that so many people think that the poor are underserving of help from the federal government, causing wealthy people to actually be angry at the poor.\n“I think the effort to suggest that the poor are sponges and leeches are don’t want to work, are lazy or are undeserving got traction,” Obama said.\nHe blamed the Fox News channel for feeding that narrative.\n“It’s still being propagated, I mean, I have to say that if you watch Fox News on a regular basis it is a constant menu,” he explained.\nHe admitted that sometimes the stories reported by Fox News made him frustrated.\n“They will find folks who make me mad, I don’t know where they find them,” he admitted, pointing to an example of someone who “didn’t want to work” and just wanted an “Obamaphone.”\nObama explained that it was more important than ever to change how the media reported on issues of poverty so that people would care about struggling families – eventually forcing politicians to pass legislation to help those in need.\n“It’s a hard process, because that requires a much broader conversation that typically we have on the nightly news,” he said.","url":"https://www.breitbart.com/politics/2015/05/12/obama-admits-that-fox-news-stories-about-obamaphones-make-me-mad/"}
