{"authors":["Charlie Spiering"],"date_download":"2018-10-30 20:21:42","date_modify":"2018-10-30 20:21:42","date_publish":"2015-06-15 16:35:07","description":"According to the New York Post’s Page Six, Prince came to the White House to perform for the Obama family and 500 guests including A-list celebrities such as Russell Wilson, Jon Bon Jovi, James Taylor. |","filename":"data/vaneerConsumption/ObamaHostsSecretPrinceConcertAtTheWhiteHouse.json","image_url":"https://media.breitbart.com/media/2015/06/WH-nite-Getty1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_15__1540930902.html","title":"Obama Hosts Secret Prince Concert At The White House","title_page":"Obama Hosts Secret Prince Concert At The White House | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"If President Obama was disappointed when Democrats handed him a trade defeat on Friday, perhaps he let his worries fade away during an exclusive concert he had at the White House with Prince.\nAccording to the New York Post’s Page Six, Prince came to the White House to perform for the Obama family and 500 guests including A-list celebrities including Russell Wilson, Jon Bon Jovi, James Taylor.\nWilson posted a photo with his girlfriend on Instagram with a #blessed comment:\nDancing at The @WhiteHouse to Prince & Stevie Wonder w/ my lady @Ciara Thanks Mr. President & First Lady! #IsntSheLovely #Blessed A photo posted by Russell Wilson (@dangerusswilson) on Jun 14, 2015 at 10:37am PDT\nStevie Wonder was also there, and sang a “Signed, Sealed, Delivered I’m Yours” duet with Prince. Several of Obama’s staff members were also there, including Former Attorney General Eric Holder, Education Secretary Arne Duncan and National Security Advisor Susan Rice. Rev. Al Sharpton was also at the event, and boasted about it on Twitter.\nLeaving the White House party w/POTUS and FLOTUS. Awesome to see Prince and Stevie Wonder on keyboards together. Unbelievable experience. — Reverend Al Sharpton (@TheRevAl) June 14, 2015\nWhile there were rumors of a Prince visit floating around the White House last week, members of the staff refused to discuss Obama’s weekend plans.\n“Anything this weekend we should know about?” reporters asked White House Press Secretary Josh Earnest on Friday during the White House Press Briefing.\n“No, I don’t have any details about the President’s schedule this weekend,” Earnest replied.\nMichelle Obama leaves for the United Kingdom today together with her mother Marian Robinson and her two teenage daughters, Sasha and Malia.\nAccording to reports, the group plans to have tea with a real prince during their visit. Prince Harry.","url":"https://www.breitbart.com/politics/2015/06/15/obama-hosts-secret-prince-concert-at-the-white-house/"}
