{"authors":[],"date_download":"2018-10-30 14:30:01","date_modify":"2018-10-30 14:30:01","date_publish":"2015-01-30 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamasCubainitiativebackfiresbigtime.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_01_obamas_cuba_initiative_backfires_bigtime_comments_1540909801.html","title":"Obama's Cuba initiative backfires big-time","title_page":"Blog: Obama's Cuba initiative backfires big-time","title_rss":"NULL","source_domain":"americanthinker.com","text":"Raúl Castro knows a sucker when he sees one. Having watched Barack Obama, the world’s worst negotiator, hand concession after concession to the mullahs of Iran, he is going for a big score in the current negotiations over resumption of diplomatic relations, at President Obama’s initiative. Far from being grateful that he has been handed huge plums, he is making ridiculous demands. (And given Obama’s track record, you can’t call them unrealistic.) Alastair Jamieson reports for NBC News: Cuban President Raul Castro has demanded that the United States hand back its Guantanamo Bay military base - an apparent bargaining tool in the restoration of full diplomatic relations between the countries. Castro also asked for a complete lifting of the decades-old trade embargo and for compensation for its effects, saying that without these changes the recent diplomatic thaw \"wouldn't make any sense.\" Anywhere other... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/01/obamas_cuba_initiative_backfires_bigtime_comments.html"}
 be on his knees giving thanks, but instead he is making demands – patently ridiculous ones – as a condition of receiving what he really, really wants. And, as the TV pitchmen say, “wait, there’s more!”\nHe also demanded the U.S. end the transmission of anti-Castro radio and television broadcasts and deliver \"just compensation to our people for the human and economic damage that they're suffered.\"\nWait a minute! For decades, Marxist theorists have claimed that that trade is an evil capitalist mechanism for creating dependencia – turning the proud nations of Latin America into virtual colonies. But now Cuba is implying that the absence of trade with the Yanquis is a huge harm for Cuba, deserving recompense.\nAny sane person would fire back, “OK, you can keep the status quo. Fuggedaboutdit.”\nBut with Obama, you never know…","url":"https://www.americanthinker.com/blog/2015/01/obamas_cuba_initiative_backfires_bigtime.html"}
