{"authors":[],"date_download":"2018-10-30 14:25:56","date_modify":"2018-10-30 14:25:56","date_publish":"2015-07-27 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaAdmonishesAfricaonHomosexuality.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_07_obama_admonishes_africa_on_homosexuality_1540909556.html","title":"Obama Admonishes Africa on Homosexuality","title_page":"Obama Admonishes Africa on Homosexuality","title_rss":"NULL","source_domain":"americanthinker.com","text":"And if the mere awesomeness of his presence fails to change minds, Obama will attempt to humiliate his ideological adversaries into submission by getting in their face .\n“ Son of Kenya ,” Barack Obama, proved once again that his patience with people, nations, and world leaders that disagree with his view of the world registers a big fat zero on the liberal Tolerance Meter. When Obama finds out anyone (other than a Muslim) disagrees with his social policy focus, it becomes his personal mission to convince them otherwise.\nFor example, after Barack ‘LGBTQ’ Obama was specifically asked by the Evangelical Alliance of Kenya to leave his gay pride light show back at the White House, true to form, the self-important agitator disrespected his hosts and brought up the touchy subject of gay rights in Kenya, where homosexuality is illegal.\nFunny, when Bibi Netanyahu came to the U.S. to share a message with Congress that Iran with a nuke is a threat to the world, the Israeli Prime Minister was roundly spurned because the president’s fondness for Iran trumps his alliance with Israel. In other words, if Obama’s opinion differs from yours, he either issues a public slur, as he did to President Kenyatta, or he’ll snub you, as he does every chance he gets to Benjamin Netanyahu.\nHowever, there is one exception to the slur/snub rule. When Obama dropped in to pay his condolences to dead Saudi King Abdullah, while there he neither chastised Sharia law nor brought up stoning or beheading homosexuals.\nYet, on the other hand, for some reason Barack O seems determined to validate homosexuality on a continent that has literally been ravaged by HIV/AIDs and vehemently rejects that lifestyle.\nDuring a 2013 visit to Senegal, a nation where homosexuals end up in jail if they’re lucky and lose their heads if that luck runs out, the president publicly dressed down Macky Sall when he called for Senegal to grant gays equal rights. Sall responded to the Punk from Pennsylvania Avenue by politely informing the patron of eclectic sexual preferences that in Senegal “We are still not ready to decriminalize homosexuality.”\nQuestion: Why is Barack Obama so obsessed with changing anti-sodomy legislation in East African nations? Moreover, what right does Obama have to stick his mole-afflicted nose into African social policy and rule of law?\nWhat is it with this guy? It’s not enough for him to be changing our Constitution and pushing around 320+ million Americans?\nApparently not, because at a joint press conference in Nairobi in one of his typical sanctimonious lectures, Obama felt the need to reprimand the leader of Kenya on gay rights by telling him, “When you start treating people differently not because of any harm they are doing to anybody, but because they are different, that’s the path whereby freedoms begin to erode.”\nHold up right there!\nBarack Obama is sermonizing about paths to eroding freedoms? Isn’t this the president that habitually mistreats people that disagree with him politically or ideologically? Not only that, but in Kenya, a nation that participated in the East African slave trade, the president pushed the gay agenda by – get ready – playing the race card.\nThe president said, “And when a government gets in a habit of people treating people differently, those habits can spread.” Then, to a nation of people in awe of his success as a black man, Obama criticized America and hinted at the mistreatment of blacks during slavery and segregation by saying that “As an African-American, I am painfully aware of what happens when people are treated differently under the law.”\nWithout flinching, Kenyatta pushed back and replied to the wronged world leader:\nThe fact of the matter is Kenya and the U.S. share so many values: common love for democracy, entrepreneurship, value for families — these are some things that we share. But there are some things that we must admit we don’t share. Our culture, our societies don’t accept.\nSo, the alleged “smartest guy in the room” traveled all the way to Kenya where homosexuality is “largely considered to be taboo and repugnant to [the] cultural values and morality,” and felt it was his duty to scold the leadership for none other than anti-sodomy laws.\nMoreover, Obama chose to push homosexuality in Kenya, a country that is 83% Christian and has the fourth-largest HIV epidemic in the world. What kind of instigator does something like that?\nDoes the president know or care that according to UK-based international HIV and AIDs charity AVERT, in Kenya in 2012 an “estimated 1.6 million people were living with HIV, and roughly 57,000 people died from AIDS-related illnesses?”\nIn other words, despite Kenya enduring an extreme HIV epidemic, Obama promoted a sexual proclivity that contributes to the spread of HIV. What next? Barack goes to West Africa and suggests to recovering Ebola victims that refusing to share body fluids is discriminatory? Why not bring some Bavarian Cream donuts to an obesity clinic, or push pot legalization at rehab?\nEither way, in addition to sex workers and intravenous drug abusers, according to AVERT, “HIV prevalence among men who have sex with men (MSM) in Kenya is almost three times that among the general population.”\nThose sorts of statistics may be why President Kenyatta responded to the haughty one by politely stating, “It is very difficult for us to be able to impose on people that which they themselves do not accept.” Then again, refusing to “impose on people that which they themselves do not accept” is probably a hard concept for a despotically-inclined leader like Barack Obama to grasp.\nNonetheless, unlike Barack, Kenyatta stressed, “This is why I repeatedly say for Kenyans today the (gay rights issue) is generally a non-issue. We want to focus on other areas.”\nBut fret not; after Obama is done with his current Admonishing Africa Tour, he will head back to the U.S. where he can focus on other areas too, like decisively eroding freedom, and under U.S. law, treating differently anyone that dares to disagree with him.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2015/07/obama_admonishes_africa_on_homosexuality.html"}
