{"authors":[],"date_download":"2018-10-22 20:49:52","date_modify":"2018-10-22 20:49:52","date_publish":"2014-06-03 09:52:39","description":"The White House said Obama will call on Congress to support a \"European Reassurance Initiative\" of up to $1 billion to increase U.S. military rotations on the continent.","filename":"data/vaneerConsumption/ObamaSaysUSWillBoostMilitaryPresenceinEuropeWarnsRussia.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483241/140603-us-army-poland-6a-cover_fdf2765e16145da5891337094811c8cc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_obama-says-u-s-will-boost-military-presence-europe-warns-n121006_1540241392.html","title":"Obama Says U.S. Will Boost Military Presence in Europe, Warns Russia","title_page":"Obama Says U.S. Will Boost Military Presence in Europe, Warns Russia","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWARSAW - President Barack Obama announced a major initiative to bolster U.S. military activity in support of NATO allies Tuesday as he kicked off a four-day trip to Europe.\nHe urged Congress to support a $1 billion \"European Reassurance Initiative\" and said the White House was reviewing its military presence in the region as a result of Russia's intervention in Ukraine.\nObama also warned Russia it would face more sanctions if it showed further aggression, and called on Moscow to do more to tackled the pro-Russian armed insurgency in eastern Ukraine.\n\"The U.S. will position more equipment in Europe, we will be increasing our exercises with our allies in Europe,\" Obama said at a joint news conference in Warsaw with his Polish counterpart, Bronislaw Komorowski.\n\"We will be stepping up our partnerships with allies including Ukraine, Moldova and Georgia as they build up their own defenses.\"","url":"https://www.nbcnews.com/news/world/obama-says-u-s-will-boost-military-presence-europe-warns-n121006"}
