{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:00:56","date_modify":"2018-10-30 21:00:56","date_publish":"2015-05-04 20:19:13","description":"President Obama spoke at length about the failure of politicians, the media, and Americans to care about changing tough communities and working to change their circumstances. Looking to his future outside of the presidency, Obama made a commitment to continue his work on these issues. |","filename":"data/vaneerConsumption/ObamaLaunchesLegacyNonProfitOddsStackedAgainstYoungMenOfColor.json","image_url":"https://media.breitbart.com/media/2015/05/obama.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_04__1540933256.html","title":"Obama Launches Legacy Non-Profit: Odds Stacked Against Young Men Of Color","title_page":"Obama Launches Legacy Non-Profit: Odds Stacked Against Young Men Of Color | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Speaking in New York City, President Obama told Americans that people of color are suffering in communities that need special attention, and said he’s launching a new non-profit to help them succeed.\n“Some communities have consistently had the odds stacked against them,” he said, referring to the “tragic history” in this country making it more difficult for some to succeed especially for young boys and young men of color.\nObama made his remarks at Lehman College, as he launched a new “My Brother’s Keeper” non-profit dedicated to helping them succeed.\n“By almost every measure, life chances of the average young man of color is worse than his peers,” he said.\nDuring his speech, Obama pointed out that the social status of young men frequently blocked them from escaping their difficult circumstances.\n“Those opportunity gaps begin early, often at birth, and they compound over time, becoming harder and harder to bridge,” he said.\nCiting his own experience, Obama admitted that he was only “lucky” that he was able to succeed in life.\nPointing to children who were growing up in difficult circumstances, Obama said that they were “just as talented as me, just as smart” but pointed out that they didn’t get a chance to succeed.\n“I grew up in an environment that was a little more forgiving,” he acknowledged.\nObama warned Americans against giving up on people in underserved communities simply because of their race or social status.\n“If we feel like, because they don’t look like us or they don’t talk like us or they don’t live in the same neighborhood as us, that they’re different, that they can’t learn, or they don’t deserve better, or if its okay if their schools are run down, or it’s okay if the police are given a mission just to contain them rather than to encourage them, then it’s not surprising that we’re going to lose a lot of them,” he said. “But that’s not the kind of country I want to live in, that’s not what America is about.”\nObama added that the “sense of unfairness” and “powerlessness” in these communities helped fuel the disturbances that occurred in New York City, Ferguson, Missouri, and Baltimore, Maryland.\nPolice unfairness, he explained, become a “catalyst” for protests around the country that stemmed from people’s already difficult lives.\n“In too many places in this country – black boys and black men, latino boys, latino men – they experience being treated differently by law enforcement, in stops, and in arrests and in charges and in incarcerations,” he said.\nObama spoke at length about the failure of politicians, the media, and Americans to care about changing tough communities and working to change their circumstances.\nLooking to his future outside of the presidency, Obama made a commitment to continue his work on these issues.\n“We are in this for the long haul,” he said. “We’re just going to keep on plugging away, and this will remain a mission for me, for Michelle, not just for the rest of my presidency, but for the rest of my life.”","url":"https://www.breitbart.com/politics/2015/05/04/obama-launches-legacy-non-profit-odds-stacked-against-young-men-of-color/"}
