{"authors":[],"date_download":"2018-10-22 22:43:31","date_modify":"2018-10-22 22:43:31","date_publish":"2014-06-10 21:14:12","description":"President Barack Obama on Tuesday said his biggest frustration as president has been the inability to tighten the nation’s gun laws.","filename":"data/vaneerConsumption/ObamaCallsGunViolenceBiggestFrustrationasPresident.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500531/140610-barack-obama-jms-1720_28fbd0b156f0b4ac24ee9b4b14a8022c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_white-house_obama-calls-gun-violence-biggest-frustration-president-n127756_1540248211.html","title":"Obama Calls Gun Violence 'Biggest Frustration' as President","title_page":"Obama Calls Gun Violence 'Biggest Frustration' as President","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama on Tuesday said his biggest frustration during his time in the White House has been the inability to tighten the nation’s gun laws, saying the country needs to do some “soul searching.”\n“My biggest frustration so far is the fact that this society has not been willing to take some basic steps to keep guns out of the hands of people who can do just unbelievable damage,” Obama said during a Tumblr discussion at the White House.\n“We're the only developed country on earth where this happens and it happens now once a week, and it's a one day story. There's no place else like this,” he added.\nObama pushed for comprehensive gun reform, including expanded background checks and a ban on high-capacity magazines, following the 2012 Sandy Hook shooting. But the legislation faced stiff opposition from the influential National Rifle Association and failed to gain traction in Congress.\nThe president said he was “stunned” that nothing was done following the shooting in Newtown, Conn., that took the lives of 20 children and six adults.\nThe discussion with the microblogging website was meant to highlight the steps the president has taken to make college more affordable, but a Tumblr user wrote in asking Obama about his reaction to last week’s shooting at Seattle Pacific University. Tumblr founder David Karp, who moderated the discussion, added that there had also been another school shooting in a suburb of Portland, Oregon earlier Tuesday.\n“Our levels of gun violence are off the charts. There is no advanced, developed country on earth that would put up with this,” Obama said.\nThe president said nothing can be done until the public puts more pressure on lawmakers and outside groups to change current law, and that society needs to do some “soul searching.”\n“This is becoming the norm in ways that, as a parent, are terrifying to me,” Obama said.\n“But right now, it’s not even possible to get even the mildest restrictions through Congress, and we should be ashamed of that.”","url":"https://www.nbcnews.com/politics/white-house/obama-calls-gun-violence-biggest-frustration-president-n127756"}
