{"authors":["The Associated Press"],"date_download":"2018-10-30 18:20:32","date_modify":"2018-10-30 18:20:32","date_publish":"2016-06-24 00:00:00","description":"WASHINGTON — President Barack Obama created the first national monument to gay rights on Friday, designating the site of the Stonewall riots in Manhattan where the modern gay rights movement took root nearly five decades ago.","filename":"data/vaneerConsumption/Obamacreatesfirstnationalmonumenttogayrights.json","image_url":"https://media.arkansasonline.com/img/photos/2016/06/24/Obama_Gay_Rights_Monu_Krem_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jun_24_obama-crea_2c24b887c9d1f4cfc1029b46da9274c1__page=1_1540923632.html","title":"Obama creates first national monument to gay rights","title_page":"Obama creates first national monument to gay rights ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"WASHINGTON — President Barack Obama created the first national monument to gay rights on Friday, designating the site of the Stonewall riots in Manhattan where the modern gay rights movement took root nearly five decades ago.\nThe Stonewall National Monument will be anchored by Christopher Park, a small park just across from the iconic Stonewall Inn tavern, and covers a 7.7-acre swath of Greenwich Village where the uprising took place after police raided the gay bar in 1969. Obama said the monument would \"tell the story of our struggle for LGBT rights\" and of a civil-rights movement that became a part of America.\n\"I believe our national parks should reflect the full story of our country: the richness and diversity and uniquely American spirit that has always defined us,\" Obama said. \"That we are stronger together, that out of many, we are one.\"\nTo herald the designation, a White House video with photos of the monument was to be played at noon Saturday on the billboards in Times Square just as New York's annual pride celebration is getting under way, the White House said. The declaration also comes as advocates celebrate the one-year anniversary Sunday of the Supreme Court decision legalizing gay marriage nationwide.\nRead Saturday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2016/jun/24/obama-creates-first-national-monument-gay-rights/?page=1"}
