{"authors":[],"date_download":"2018-10-30 14:28:44","date_modify":"2018-10-30 14:28:44","date_publish":"2015-07-29 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamacoachesEthiopiaonhonestyandpoliticaldebate.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_obama_coaches_ethiopia_on_honesty_and_political_debate_comments_1540909724.html","title":"Obama coaches Ethiopia on honesty and political debate","title_page":"Blog: Obama coaches Ethiopia on honesty and political debate","title_rss":"NULL","source_domain":"americanthinker.com","text":"Barack “Son of the Soil” Obama wrapped up his “Nudge Africa toward Gay Rights” tour. Next stop: summer vacation in Martha’s Vineyard. Before heading home, Obama shared insights that are not only contradictory, but downright terrifying. It was during a joint news conference with Prime Minister Hailemariam Desalegn, after pushing for peace in civil war-torn South Sudan, that Obama the race-baiter, responsible for stoking the flames of unrest in the U.S., urged Ethiopian leaders to refrain from imposing restrictions on the press and political debate. Obama, who, when it comes to Tea Party activists, Fox News, and conservative talk radio doesn’t exactly practice what he preaches, reminded his hosts that “[w]hen all voices are being heard, when people know they are being included in the political process, that makes a country more successful.” After a question from Darlene Superville about Republican presidential... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/07/obama_coaches_ethiopia_on_honesty_and_political_debate_comments.html"}
ke long for the negotiator to contradict his own advice about the benefits of political discussion.\nAfter an “all voices” soliloquy and after saying that the Iran debacle was a “good deal,” the president immediately exploited Superville’s question to criticize what he referred to as “rhetoric” from the other side. Obama brought up Washington politics and called Huckabee’s comments “part of just a general pattern … that would be considered ridiculous if it weren’t so sad.”\nOn the topic of “voices being heard,” Obama shared with the press corps that “a sitting senator called John Kerry Pontius Pilate,” and because all roads eventually lead back to hypersensitive Obama, the president also shared that another senator (Ted Cruz) who “happens to be running for president suggest[ed] that I’m the leading state sponsor of terrorism.”\nActing more like he was on the campaign trail than addressing issues like civil war and freedom of the press, the hyper-partisan president continued to demean his political adversaries:\nThese are leaders in the Republican Party… there’s been a recognition that these issues are too serious, that issues of war and peace are of such grave concern and consequence that we don't play fast and loose that way. We have robust debates, we look at the facts, there are going to be disagreements. But we just don't fling out ad hominem attacks like that, because it doesn’t help inform the American people.\nIn other words, sound the alarm, use hyperbole to describe Iran’s genocidal intentions towards Israel, call Kerry out as the clown he is, and the predictable Barack Obama will use his bully pulpit to define political debate as “flinging out ad hominem attacks.”\nWhen Obama opined that “rhetoric like this … may be … just an effort to push Mr. Trump out of the headlines but it's not the kind of leadership that is needed for America right now,” the narcissistic attention-seeking president was directly denouncing Huckabee and Cruz.\nThe president then criticized The Donald for his negative comments about John McCain, whose Vietnam War torture and patriotism didn’t particularly impress Barack Obama when he recently defended Vietnam swift boat veteran John Kerry.\nObama claimed that Trump’s boldfaced honesty, which is primarily directed at Obama, “arises out of a culture where those kinds of outrageous attacks have become far too commonplace and get circulated nonstop through the internet and talk radio and news outlets.”\nEven the Ethiopians had to be scratching their heads. Wasn’t this the guy who just urged Ethiopian leaders to refrain from imposing restrictions on the press and to encourage political debate?\nThe Whiney One went on to say that he noticed that those who were upset about Trump’s “outrageous statements” about McCain stay quiet when similar “outrageous statements” are made about the outrageous one doing the whining.\nPeeved that anyone dare criticize his horrendous Iran deal, Obama tore into Republicans, alleging that “[t]he point is we're creating a culture that is not conducive to good policy or good politics. The American people deserve better.”\nPrecisely!\nThe president also hinted that if the 2016 president-elect isn’t an adequate replacement, he might have to overstay his tenure. In a hair-raising admission, the always honest and dignified Barack Obama told his Ethiopian hosts:\nIn 18 months, I'm turning over the keys -- I want to make sure I'm turning over the keys to somebody who is serious about the serious problems the country faces and the world faces. And that requires on both sides, Democrat and Republican, a sense of seriousness and decorum and honesty. And I think that's what the voters expect, as well.\nThat’s when someone, anyone, should have requested a clarification of what Obama means when he says, “I want to make sure I'm turning over the keys to somebody who is serious about the serious problems the country faces and the world faces.”\nHow Mr. Obama plans to “make sure” and what he’ll do if “somebody” doesn’t meet his seriousness measures should give every American nightmares.\nThe president also encouraged Ethiopia to pursue “ethical journalism.” You know what kind of ethical journalism – the kind that Clinton Foundation contributor George Stephanopoulos embodies, or the type of fawning “ethical” professional journalism that gives the guy offering Ethiopia advice a pass. Yeah, that kind of journalism.\nObama shared that the U.S. government is committed to “nurturing” journalists “for democratic discourse” – which in itself is a scary thought – “young journalists,” he said, “to come up and help this country [with the help of the government] understand what’s going on.”\nThen, the guy who nearly bit off chief CBS White House correspondent Major Garrett’s head over a valid question and who just spent an inordinate amount of time complaining about those who suggest he’s made mistakes or has limitations said, “And for us, it's very important to be criticized because we also get feedback to correct our mistakes and limitations.”\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/blog/2015/07/obama_coaches_ethiopia_on_honesty_and_political_debate.html"}
