{"authors":["Bill Chappell","Npr Staff"],"date_download":"2018-10-23 05:47:14","date_modify":"2018-10-23 05:47:14","date_publish":"2016-02-23 00:00:00","description":"The president calls the facility in Cuba \"a stain on our broader record.\" The administration's plan to close the prison isn't expected to go very far in Congress.","filename":"data/vaneerConsumption/ObamaSaysGuantanamoPrisonDoesntHelpUSSecurityItUnderminesIt.json","image_url":"https://media.npr.org/assets/img/2016/02/23/obama_wide-82e6b0bea0c19ad3f474090a5742e68ded011e56.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_02_23_467727993_dod-to-offer-plan-for-closing-guantanamo-prison_1540273634.html","title":"Obama Says Guantanamo Prison Doesn't Help U.S. Security, 'It Undermines It'","title_page":"Obama Says Guantanamo Prison Doesn't Help U.S. Security, 'It Undermines It' : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Obama Says Guantanamo Prison Doesn't Help U.S. Security, 'It Undermines It'\nEnlarge this image toggle caption Mandel Ngan/AFP/Getty Images Mandel Ngan/AFP/Getty Images\nU.S. operation of the Guantanamo Bay military detention center in Cuba is \"contrary to our values\" and is seen as \"a stain on our broader record\" of upholding the highest rules of law, President Obama said Tuesday as he announced plans to close the facility.\nThe administration's proposal is \"not expected to go very far,\" as the Two-Way reported earlier today. Devised by the Pentagon, the plan outlines how a shutdown might work — something that was requested by Congress. But it comes months after lawmakers from both parties approved legislation that prohibits the president from moving detainees onto U.S. soil.\nObama made his case for the plan at a live event at the White House.\n\"For many years it's been clear that the detention center at Guantanamo Bay does not advance our national security,\" he said. \"It undermines it.\"\nYouTube\nThe president added that this wasn't his opinion alone, but one that's shared by military advisers — and he said that the facility provides a recruiting and propaganda tool for terrorist groups such as ISIS and also hurts America's relationships with its allies.\n\"Let us do what is right for America,\" Obama said, seeking to close a chapter in the country's fight against terrorism.\nSeveral times during his speech, Obama invoked his predecessor, President George W. Bush, noting that Bush oversaw the facility's use to house suspected terrorists — and also wanted to close the prison.\n\"I give him credit for that,\" Obama said, calling it \"an honest assessment on his part on his part of what needed to happen.\"\nToward the end of his remarks, the president said, \"I don't want to pass this problem on to the next president, whoever it is. And if as a nation we don't deal with this now, when will we deal with it?\"\nEnlarge this image toggle caption Ben Fox/AP Ben Fox/AP\nResponding to Obama's plan, the American Civil Liberties Union's executive director, Anthony D. Romero, applauded the effort to close Guantanamo — but he added, \"his decision to preserve the Bush-created military commissions is a mistake.\"\nRomero also said that the president's \"continuing embrace of indefinite detention without charge or trial will tarnish his legacy.\"\nMore than a third of the current occupants at the U.S. prison at Guantanamo Bay are now eligible to be transferred to other countries, the White House says.\nAlthough Republican majorities in the House and Senate are not inclined to go along, the Pentagon plan will fulfill an obligation created by Congress for Obama to at least file such a plan and move the onus for action onto Capitol Hill.\n\"The politics of this are tough,\" the president said Tuesday, noting that many Americans remain highly concerned about terrorism — and the prospect of holding terrorists prisoner here in the U.S.\nDefense officials have been surveying sites inside the United States to see how well they might do as the new homes for Guantanamo detainees. There are 46 detainees whom U.S. officials consider too dangerous to release because of the potential threat they might pose, along with 10 others who are either charged or convicted by military commissions. Another 35 detainees held at Guantanamo since the George W. Bush administration are awaiting transfer to other countries.\nThe Pentagon has looked at military and federal prisons in South Carolina, Kansas and Colorado. Its report could include the details of what work each one would require as a potential stateside successor to Guantanamo, but is not expected to pick one over the other.\nNPR's David Welna, who just returned from a week covering military commissions at Guantanamo Bay, has visited two of the sites the Pentagon has considered.\nThe mayor of Leavenworth, Kan., home to a maximum security Army prison, told Welna she is \"absolutely against\" the idea of Guantanamo detainees moving there. Many locals in Canon City, Colo., also oppose the idea of hosting the terror suspects, but as home to a prison complex that includes the well-known federal \"Supermax,\" they know why their area makes sense.\n\"I suppose I would prefer not to have war criminals or war prisoners in our community,\" Canon City Mayor Tony Greer told Welna. \"On the other hand, we are a prison community. And if I were assigned the task from Washington to choose a site, certainly this would be on my short list.\"","url":"https://www.npr.org/sections/thetwo-way/2016/02/23/467727993/dod-to-offer-plan-for-closing-guantanamo-prison"}
