{"authors":["Ben Shapiro"],"date_download":"2018-10-30 19:47:11","date_modify":"2018-10-30 19:47:11","date_publish":"2015-02-24 01:14:02","description":"Obama is perfectly willing to let Iran go nuclear, so long as he delays that eventuality for a short duration.","filename":"data/vaneerConsumption/ObamaDealtoLetIranGoNuclear.json","image_url":"https://media.breitbart.com/media/2015/01/iran-nuclear-reactor-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_23__1540928831.html","title":"Obama Deal to Let Iran Go Nuclear","title_page":"Obama Deal to Let Iran Go Nuclear","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday, the Associated Press revealed details of the pending negotiation between the Obama administration and the Iranian government regarding the Iranian nuclear program. The bottom line: Obama, as his critics have suggested for years, is perfectly willing to let Iran go nuclear, so long as he delays that eventuality for a short duration. The Associated Press reports:\nEdging toward a historic compromise, the U.S. and Iran reported progress Monday on a deal that would clamp down on Tehran’s nuclear activities for at least 10 years but then slowly ease restrictions on programs that could be used to make atomic arms.\nEven Jeffrey Goldberg, Obama’s court Jew at The Atlantic, tweeted that Obama “seems to be edging, over time, to a policy of Iran nuclear containment.” Which means that according to Jeffrey Goldberg, Jeffrey Goldberg is a racist.\nThe agreement itself represents magical thinking of the highest order. Iran insists that it wants no nuclear weaponry, but merely enrichment – an asinine claim, given Iran’s vast access to oil, and an obvious lie, given that Iran would not need to negotiate away its claim to nuclear weapons if it didn’t want to obtain nuclear weapons. Under this deal, however, Obama assumes that the Iranians are telling the truth; as he recently said:\nIf in fact what they claim is true, which is they have no aspiration to get a nuclear weapon, that in fact, according to their Supreme Leader, it would be contrary to their faith to obtain a nuclear weapon. If that is true, there should be the possibility of getting a deal.\nIran wants all restrictions lifted after ten years. Instead, the United States will allow strict controls to be lifted gradually after ten years. But, as the Associated Press points out, “Once the deal expired, Iran could theoretically ramp up enrichment to whatever level it wanted.”\nThe AP points out that Iran could use its current centrifuges to build a nuke. The new deal would leave the vast majority of those centrifuges in place and ease sanctions. Supposedly, Iran would have to “ship out most of the enriched uranium it produced or change it to a form that would be difficult to convert for weapons use.” The AP, which labeled new Iranian President Hassan Rouhani “moderate” — a joke, since Rouhani has called Israel a “wound on the body of the Islamic world” that requires removal — admits that Iran has stalled probes into the monitoring of its nuclear arms program.\nWorst, an earlier report from the AP says that Obama plans to do what he wants without Congressional approval:\nSeveral steps would come immediately through executive action by President Barack Obama, the officials said. Other penalties would be suspended, but not lifted, as Iran demonstrates its compliance with its obligations.\nHere is the problem, as the current negotiations have demonstrated: once Barack Obama has invested his prestige in a series of negotiations, he will never let them break down, even if they break down. Iran will always remain a partner. Iran will always be given a second, third, fourth, and fifth chance. Obama has crafted a catch-22 for the United States by routinely posing a false choice between negotiations and war: he will never allow negotiations to fail because he has said that the only alternative is war.\nAnd so Iran has nothing to fear. They especially have nothing to fear because Obama is relying on Iran to help stymie the growth of ISIS in Iraq. That’s also why Obama seems to care little about Iranian-backed Bashar Assad’s continuing atrocities or the threats of Hezbollah against Israel. Obama has crafted Iran as a counterweight to Israel and Egypt in the region. All Obama asks in return for this kindness to Iran is that the mullahs wait to go nuclear until he leaves office. That’s a great bargain for the Iranian government, and they’re taking it with glee.\nBen Shapiro is Senior Editor-At-Large of Breitbart News and author of the new book, The People vs. Barack Obama: The Criminal Case Against The Obama Administration (Threshold Editions, June 10, 2014). He is also Editor-in-Chief of TruthRevolt.org. Follow Ben Shapiro on Twitter: @benshapiro.","url":"https://www.breitbart.com/national-security/2015/02/23/obama-deal-to-let-iran-go-nuclear/"}
