{"authors":[],"date_download":"2018-10-22 22:37:47","date_modify":"2018-10-22 22:37:47","date_publish":"2014-06-10 16:38:30","description":"Decades after their service and valor, the Puerto Rican U.S. Army regiment known as the \"Borinqueneers\" were awarded the Congressional Gold Medal.","filename":"data/vaneerConsumption/ObamaAwardsBorinqueneersWithCongressionalGoldMedal.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/499941/20140610-borinqueneers-obama-sl-1347_68d528a79b7451c39e6a260affaf1bfa.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_obama-awards-borinqueneers-congressional-gold-medal-n127451_1540247867.html","title":"Obama Awards Borinqueneers With Congressional Gold Medal","title_page":"Obama Awards Borinqueneers With Congressional Gold Medal","title_rss":"NULL","source_domain":"nbcnews.com","text":"WASHINGTON, DC -- A U.S. Army segregated unit composed mainly of soldiers from the island of Puerto Rico distinguished itself in World War I, World War II and Korea. But it was not until Tuesday that these soldiers, most of them no longer living, received one of the nation's highest honors.\nPresident Obama awarded the 65th Infantry Regiment - known as the Borinqueneers for Puerto Rico's native name, Borinquen - the Congressional Gold Medal.\nSign up for breaking news alerts from NBC News\n\"In World War I, they defended the homeland and patrolled the Panama Canal Zone. In World War II, they fought in Europe. In Korea, they fought in mud and snow. They are the 65th Infantry Regiment, U.S. Army,\" said Obama to cheers from the audience.\nIn attendance at the ceremony were a small group of Borinqueneers - Celestino Cordova, Rafael Gomez-Hernandez, Leonardo Martinez, Jose Pickard, Miguel Piñiero, Ramon Rodriguez, Federico Simmons and Arcadio Santiago - who received a standing ovation. Also in attendance were the three Puerto Rican members of Congress - Jose Serrano, Luis Gutierrez and Nydia Velazquez - as well as the the Governor of Puerto Rico, Alejandro Garcia Padilla. Other Latino leaders and legislators included Florida Republican Senator Marco Rubio, who co-sponsored the legislation along with Puerto Rico Resident Commissioner Pedro Pierluisi, a non-voting delegate in Congress.\n\"The signing ceremony served to underscore a broader point, namely that, for generations, from World War I almost a century ago to Afghanistan today, U.S. citizens from Puerto Rico have built a rich and distinguished record of military service,\" said Pierluisi. \"If you visit any U.S. military installation, you will see men and women from Puerto Rico, fighting to keep this nation safe, strong and free,” he added. Puerto Rico is a commonwealth of the United States.\nBy the time fighting had come to a close in Korea, soldiers from the 65th Infantry Regiment had earned 10 Distinguished Service Crosses, about 250 Silver Stars, over 600 Bronze Stars and 3,000 Purple Hearts, noted New Jersey Democratic Senator Robert Menendez, who was an original co-sponsor of the bill to recognize the soldiers.","url":"https://www.nbcnews.com/news/latino/obama-awards-borinqueneers-congressional-gold-medal-n127451"}
