{"authors":["The Associated Press"],"date_download":"2018-10-30 18:07:55","date_modify":"2018-10-30 18:07:55","date_publish":"2014-12-07 10:32:00","description":"WASHINGTON — Veto brinkmanship between congressional Republicans and President Barack Obama was virtually absent in his first six years in office, but it's about to unleash itself on Washington.","filename":"data/vaneerConsumption/ObamaGOPledCongressprepareforvetoshowdowns.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_dec_07_obama-gop-_6605e1c05d7292d65ea44f534ba8b016__page=2_1540922875.html","title":"Obama, GOP-led Congress prepare for veto showdowns","title_page":"Obama, GOP-led Congress prepare for veto showdowns ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"WASHINGTON — Veto brinkmanship between congressional Republicans and President Barack Obama was virtually absent in his first six years in office, but it's about to unleash itself on Washington.\nUntil now, controversial Republican-backed legislation rarely reached the president's desk because Senate Democrats blocked it. Starting in January, however, Republicans will control both the House and Senate, and Obama may have to decide more often whether to sign or veto GOP-crafted bills.\nObama gave lawmakers an early taste of veto politics recently when he forced congressional leaders to drop a proposed package of tax breaks that were popular with many Republican constituents. Some Democrats did support the plan, but liberals and the White House said it tilted too heavily toward corporations, not lower-income workers.\nThe White House also has promised to veto any bills restricting the president's major changes to immigration policies, setting up likely showdowns early next year.\nObama's threats present the type of bind that Republicans may face repeatedly in the next two years. They can agree to many or all of the changes he demands in legislation, or they can let him use his veto and hope Americans will blame him more than them.\nIt's a gamble, especially with critical spending bills Congress soon must address. Some Republicans want to amend these must-pass bills to thwart Obama's bid to protect millions of immigrants, now in the country illegally, from deportation.\nAssuming Obama keeps his veto promise, Republican lawmakers would have to decide whether to drop their demands or let parts of the federal government close for lack of money. GOP leaders say there will be no shutdowns, but they have yet to explain how they can force Obama to back off on immigration.\nThe 2013 partial government shutdown occurred under similar partisan circumstances. Polls show the public blamed congressional Republicans more than the Democratic president.\nIt's unclear how often Obama will face a veto decision. Even in the minority, Democratic senators can use the filibuster, the name for unlimited debate, to block many measures that break strictly along party lines.\nBut some proposals, such as building the Keystone XL pipeline, enjoy significant bipartisan support. They might attract enough Democratic backing to reach 60 Senate votes, overcoming a filibuster and sending the measure to Obama.\nWhite House senior adviser Dan Pfeiffer said if Congress assembles legislation that Obama opposes, the White House will threaten vetoes and \"if Congress decides to pass them anyway, then we'll veto them.\"\n\"We're not going to go out looking for them, but we're not going to run from them either,\" he said.\nShould Obama veto a proposal such as the Keystone project, the question would be whether two-thirds of the Senate and two-thirds of the House would vote to defy him. That's the constitutional threshold for overriding a veto.\nIt will be critical for Republicans to put together veto-proof majorities in the House and Senate. Because any bill would require 60 Senate votes to overcome filibusters, the Senate vote would always be bipartisan and closer to the two-thirds majority needed to override a veto.\nBut the House would be harder, giving House Democratic leader Nancy Pelosi of California greater sway in the end over the outcome of legislation.\nVetoes have existed since George Washington's day, but Obama issued only two fairly minor ones in his first six years as president. His two predecessors also went light on vetoes in their early years.\nDemocrat Bill Clinton vetoed 37 bills, all during his last six years in office, when Republicans controlled the House and Senate. Republican George W. Bush issued no vetoes during his first four-year term. After that he vetoed eight bills when Republicans controlled both congressional chambers and four bills when Democrats held both.\nStarting next month, lawmakers say, veto clashes are inevitable.\n\"You're destined to see it,\" said Sen. Richard Burr, R-N.C.\nLawmakers say veto politics will put pressure on both parties. A veto of any bill that makes it through the Senate will frustrate some Democrats from competitive states, said Sen. Lindsey Graham, R-S.C.. For instance, he said, a Keystone veto \"splashes over on Democrats with a political future.\"\nThroughout the next presidential campaign, Graham said, likely Democratic candidate Hillary Rodham Clinton \"will always have to answer, 'Would you have vetoed that?'\"\nAt the same time, he said, Republicans must find a way to express their anger over Obama's executive actions on immigration without closing the government. \"The politics of dealing with Obama's overreach is tough politics for Republicans,\" Graham said.\nSome Democrats want Obama to use his veto powers on important issues.\n\"The fact that the president, I think, is determined to use the veto pen when necessary will help protect his legacy,\" said Sen. Chris Coons, D-Del.","url":"https://www.arkansasonline.com/news/2014/dec/07/obama-gop-led-congress-prepare-veto-showdowns/?page=2"}
