{"authors":["John Hayward"],"date_download":"2018-10-30 19:44:34","date_modify":"2018-10-30 19:44:34","date_publish":"2015-03-26 17:43:29","description":"Obama's \"revisions\" to the Iranian nuclear deal reportedly include dropping demands for UN inspection of suspected weapons sites.","filename":"data/vaneerConsumption/ObamasLatestConcessiontoIranInspectionDemandsRevisedDown.json","image_url":"https://media.breitbart.com/media/2015/03/Ayatollah-Ali-Khamenei-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_26__1540928674.html","title":"Obama's Latest Concession to Iran: Inspection Demands 'Revised' Down","title_page":"Obama's Latest Concession to Iran: Inspection Demands 'Revised' Down | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Wall Street Journal reports that the Obama administration’s “revisions” to the Iranian nuclear deal include abandoning crucial demands for U.N. inspection of suspected weapons sites that Iran has been resisting for years, even during the toughest of economic sanctions.\nThe WSJ headline says, “Iran Stalls U.N. Probe Into Its Atomic Past,” but this is about the future, too [emphasis added]:\nTalks over Iran’s nuclear program have hit a stumbling block a week before a key deadline because Tehran has failed to cooperate with a United Nations probe into whether it tried to build atomic weapons in the past, say people close to the negotiations. In response, these people say, the U.S. and its diplomatic partners are revising their demands on Iran to address these concerns before they agree to finalize a nuclear deal, which would repeal U.N. sanctions against the country. “Progress has been very limited,” Yukiya Amano, who heads the U.N.’s International Atomic Energy Agency, told The Wall Street Journal this week. “No more new issues” have been addressed.\nThe concessions follow a weekend in which Supreme Leader Ayatollah Ali Khamenei called for “death to America” with complete impunity from the Obama State Department.\nThe matter at issue is not just about shaming the mullahs into admitting they have not fully cooperated with U.N. inspectors in the past. It is vital to maintaining an effective inspection regime in the future, to the extent that this is at all possible [emphasis added]:\nIran’s refusal to implement the IAEA work plan threatens to undermine the prospects for this comprehensive agreement, say diplomats involved in the talks. The ability of the IAEA and global powers to verify whether Iran is abiding by any future deal to prevent it from racing to develop a nuclear weapon depends, in part, on an understanding of its past work, according to these officials. …. The West has accused Iran of conducting weapons-related tests at military sites near Tehran, and having secret government offices dedicated to this work. U.S. intelligence agencies concluded Iran had a dedicated nuclear weapons program, which they believe largely ended in 2003. As a result, the U.S. and its negotiating partners are seeking to get Iran’s upfront approval to implement a scaled-back version of the IAEA’s 2013 agreement with Iran to a 12-step work plan to resolve questions related to possible weaponization work. Mr. Amano said Iran has addressed only one of the 12 areas. The new plan would seek access to some of Iran’s sites and documents believed tied to past weaponization work, known in diplomatic parlance as “possible military dimensions,” or PMD. Under the new plan, Tehran wouldn’t be expected to immediately clarify all the outstanding questions raised by the IAEA in a 2011 report on Iran’s alleged secretive work. A full reckoning of Iran’s past activities would be demanded in later years as part of a nuclear deal that is expected to last at least 15 years.\nThe WSJ also mentions that “key U.S. allies, including Israel and Saudi Arabia, have publicly spoken out against Iran diplomacy.” As of Wednesday, Saudi Arabia is doing a lot more than “speaking out” against Iran; they have plunged into a hot war against Iran’s clients in Yemen. One suspects the level of Arab enthusiasm for giving Tehran nuclear weapons in ten years or less has dipped to an all-time low, while their interest in joining the nuclear arms race is steadily rising.\nFormer U.N. Ambassador John Bolton penned a New York Times op-ed on Thursday, entitled “To Stop Iran’s Bomb, Bomb Iran,” in which he charges that “President Obama’s approach to Iran has brought a bad situation to the brink of catastrophe.” Bolton argues that Iran basically outlasted Obama’s poorly designed, badly enforced sanctions and emerged victorious. From here on in, it is all about Obama dispatching his flacks to generate political cover while he negotiates Western surrender.\n“The Obama administration’s increasingly frantic efforts to reach agreement with Iran have spurred demands for ever-greater concessions from Washington,” writes Bolton, adding:\nSuccessive administrations, Democratic and Republican, worked hard, with varying success, to forestall or terminate efforts to acquire nuclear weapons by states as diverse as South Korea, Taiwan, Argentina, Brazil, and South Africa. Even where civilian nuclear reactors were tolerated, access to the rest of the nuclear fuel cycle was typically avoided. Everyone involved understood why.\n“This gold standard is now everywhere in jeopardy because the President’s policy is empowering Iran,” Bolton continues, then states:\nWhether diplomacy and sanctions would ever have worked against the hard-liners running Iran is unlikely. But abandoning the red line on weapons-grade fuel drawn originally by the Europeans in 2003, and by the United Nations Security Council in several resolutions, has alarmed the Middle East and effectively handed a permit to Iran’s nuclear weapons establishment.\nFrom such a position, Iran is not going to make any concessions that would seriously hinder its ambition to become a nuclear power–and if we are clear about that reality, Bolton sees nothing left to do but pick bombing targets and let fly. “Time is terribly short, but a strike can still succeed,” he argues, describing a few installations whose destruction would set the Iranian nuclear program back by three to five years–possibly enough time for Obama’s hopefully more capable successor to arrange a better deal and/or change the regime in Tehran.\nThe current course will not just mean nuclear mullahs in Tehran; it is going to fill the Middle East with nuclear powers and itchy trigger fingers. The idea that such an environment could lead to lasting detente, such as existed between the U.S. and the Soviet Union, is sheer delusional insanity, not to mention a woeful ignorance of just how shaky detente with the considerably more stable Soviet Union really was. Put fire-breathing doomsday ayatollahs, Israel-hating paranoid dictators, and nervous oil sheikhs in place of the Russians who came this close to pushing The Button a few times, and that history will replay very differently.","url":"https://www.breitbart.com/national-security/2015/03/26/obamas-latest-concession-to-iran-inspection-demands-revised-down/"}
