{"authors":["Noah Beck"],"date_download":"2018-10-30 21:06:28","date_modify":"2018-10-30 21:06:28","date_publish":"2015-07-06 15:27:31","description":"Much has been written about just how bad the proposed Iranian nuclear deal has gotten. This outcome is hardly surprising after Israel’s former ambassador to Washington, Michael Oren, bravely published Ally, his memoir detailing Obama’s hostility towards Israel. But even without Ambassador Michael Oren’s personal testimony, there is overwhelming evidence that – on the issue most important to global security and Israel’s very existence – Obama has been, at best, reckless and, at worst, treasonous. |","filename":"data/vaneerConsumption/ObamaGettingaBadIranDealatAnyPrice.json","image_url":"https://media.breitbart.com/media/2015/07/GettyImages-479559234.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_06__1540933588.html","title":"Obama: Getting a Bad Iran Deal at Any Price","title_page":"Obama: Getting a Bad Iran Deal at Any Price | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Much has been written about just how bad the proposed Iranian nuclear deal has gotten. This outcome is hardly surprising after Israel’s former ambassador to Washington, Michael Oren, bravely published Ally, his memoir detailing Obama’s hostility towards Israel. But even without Ambassador Michael Oren’s personal testimony, there is overwhelming evidence that – on the issue most important to global security and Israel’s very existence – Obama has been, at best, reckless and, at worst, treasonous.\nObama’s administration has shown a breathtaking readiness to cover for a wide range of abuses and violations by the same Iranian regime that seeks international acceptance of its nuclear activities. U.S. Senator Ted Cruz recently alleged that the State Department was illegally delaying the publication of a report on Iranian human rights violations, which was due last February, to avoid adversely affecting the talks with Iran on its nuclear program.\nAccording to a report by the Institute for Science and International Security, a non-proliferation think tank, Iran has violated the current interim nuclear deal, the Joint Plan of Action (JPOA). The president of the institute, David Albright, noted that “When it became clear Iran could not meet its commitment to convert the LEU into uranium dioxide, the United States revised its criteria for Iran meeting its obligations.” Such leniency on a crucial compliance issue suggests that the world powers negotiating with Iran (the “P5+1”) will ignore or explain away Iranian violations of any future agreement over its nuclear program.\nIn another breach of the JPOA, Iran continues trying to acquire nuclear-related materials – some of which would be prohibited under the emerging deal. Reuters reported last May that the Czech government had uncovered an Iranian attempt to purchase a shipment of compressors from a U.S.-owned company based in Prague. These parts can be used to extract enriched uranium directly from the centrifuge cascades. In April, the British Government reportedly informed a UN panel about an illicit Iranian nuclear procurement network involving two firms under sanctions for suspected links to Iran’s nuclear activities. Iran also fed uranium hexafluoride gas into an advanced centrifuge, yet another violation of the JPOA. In April 2014, Reuters reported that Iran’s oil exports were well above the monthly 1 million barrel-per-day limit imposed by the JPOA. If the P5+1 countenanced all of these Iranian violations of the JPOA, why would they be any more forceful when an even stronger Iran violates a permanent nuclear accord?\nThe news outlet Al-Monitor reported that the U.S. State Department is three years late in applying certain sanctions on Iran. The report provides more proof that the State Department is intentionally delaying sanctions on Iran in its quest to close a nuclear deal. The Wall Street Journal reported that the administration has pressured the CIA so that its analysts are now in an “impossible position regarding analysis of Iran’s nuclear program.”\nNot only has the Obama administration ignored Iranian violations, it has also disregarded evidence that sanctions relief will only support Iran’s most dangerous policies. Under Iran’s “moderate” President Rouhani, spending on Iran’s Islamic Revolutionary Guard Corps, the entity tasked with spreading Iranian influence abroad while suppressing dissent at home, has increased by 48%. Iran spends approximately $200 million per year on Hezbollah and up to $15 billion per year to support the Assad regime in Syria. (Apparently the Obama administration sees no contradiction in calling for Assad’s ouster while helping Iran to fund him by removing sanctions.) Former Senior Advisor on Iran at the State Department, Ray Takeyh, has warned that the “massive financial gains from [a sanctions-lifting nuclear] deal would enable [Iran’s] imperial surge.” Iran is now the main power broker in four Arab countries (Lebanon, Yemen, Iraq, and Syria). How much more powerful and aggressive will Iran become when sanctions are lifted and billions of dollars flow into its economy?\nObama has also disregarded his own former Iran and nonproliferation experts, who last month signed on to a letter warning that the emerging Iran deal may “fall short of the administration’s own standard.” Signatories include the White House’s former chief weapons of mass destruction advisor, Gary Samore, the Department of State’s former principal nonproliferation advisor, Robert Einhorn, the former director of the CIA, David Petraeus, the former special advisor on the Persian Gulf, Dennis Ross, and other notable officials and analysts. The letter asserts that the emerging deal will not dismantle Iran’s nuclear infrastructure and outlines the elements of a good deal. These include unlimited inspections, including military sites; strict limits on centrifuge R&D; disclosure of Iran’s past nuclear military work; phased sanctions-lifting that is tied to Iran’s compliance with the deal; and the creation of an effective mechanism to re-impose sanctions automatically in the event of an Iranian violation.\nIran’s breakout time under the emerging deal would be far less than the Obama administration’s estimate of one year, according to one proliferation expert and the former deputy director-general of the International Atomic Energy Agency.\nIn pursuit of this bad deal, Obama has not only covered for Iranian violations and ignored Iran’s continued ballistic missile developments, it has actually offered the Iranian regime nuclear technology. It remains unclear on what basis Obama trusts a regime that, for decades, has been one of the most dangerous on the planet, and an arch foe of the U.S. and its closest Mideast allies.\nIn another shocking example of that misplaced trust, the U.S. is sharing a base in Iraq with Iranian-backed Shiite militias, who have killed American soldiers in the past, despite concerns that doing so puts American soldiers at risk by allowing the militias to spy on U.S. operations at the base.\nThe overwhelming evidence all points to the same troubling question: in the nuclear faceoff between Iran and the West, whose side is Obama on? He may get his “legacy deal,” but it will include nuclear proliferation across the Middle East, an Iranian regime much more able to support terrorism and hegemonic policies, and the far greater prospect of nuclear terrorism and/or doomsday in the world’s most unstable region.\nNoah Beck is the author of The Last Israelis, an apocalyptic novel about Iranian nukes and other geopolitical issues in the Middle East.","url":"https://www.breitbart.com/national-security/2015/07/06/obama-getting-a-bad-iran-deal-at-any-price/"}
