{"authors":["Charlie Spiering"],"date_download":"2018-10-30 17:56:37","date_modify":"2018-10-30 17:56:37","date_publish":"2016-08-05 14:09:48","description":"“ISIL turns out not to be invincible,” Obama said. “They're, in fact, inevitably going to be defeated.” | Politics","filename":"data/vaneerConsumption/ObamaIslamicStateWillBeDefeatedInevitably.json","image_url":"https://media.breitbart.com/media/2016/08/GettyImages-585966410.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_05__1540922197.html","title":"Obama: Islamic State Will Be Defeated ‘Inevitably’","title_page":"Obama: Islamic State Will Be Defeated ‘Inevitably’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama tried to talk down Islamic State terrorism during his press conference at the Pentagon, insisting that it would be defeated “inevitably.”\n“ISIL turns out not to be invincible,” he said. “They’re, in fact, inevitably going to be defeated.”\nObama met with his national security advisers at the Pentagon to discuss his ongoing war against ISIS, citing the importance of freeing Mosul and Raqqah from their control.\nBut he failed to outline any significant changes to his strategy, citing an ongoing commitment to supporting partners on the ground.\n“What we’ve learned from our efforts to defeat al Qaeda is that if we stay on it, our intelligence gets better and we adapt as well,” he said. “And eventually, we will dismantle these networks also.”\nObama pointed out that two years ago, ISIS was making gains and threatening Baghdad, but argued that as a result of his efforts, they had lost territory.\n“Even ISIL’s leaders know they’re going to keep losing,” he said. “In their message to followers, they’re increasingly acknowledging that they may lose Mosul and Raqqah. And ISIL is right. They will lose them.”\nObama urged Americans to “keep our eye on the ball and not panic” in spite of a series of ISIS attacks on civilians around the world.\n“We have to understand that as painful and as tragic as these attacks are that we are going to keep on grinding away, preventing them wherever we can, using a whole government effort to knock down their propaganda, to disrupt their networks, to take their key operatives off the battlefield, and that eventually we will win,” he explained.","url":"https://www.breitbart.com/politics/2016/08/05/obama-islamic-state-will-defeated-inevitably/"}
