{"authors":[],"date_download":"2018-10-30 20:55:19","date_modify":"2018-10-30 20:55:19","date_publish":"2016-09-30 13:52:30","description":"Israeli and Palestinian leaders shook hands and U.S. President Barack Obama gently reminded them of the \"unfinished business of peace\".","filename":"data/vaneerConsumption/ObamaUsesPeresFuneraltoPushIsraeliPalestinianLeaderstoSettleUnfinishedBusiness.json","image_url":"https://media.breitbart.com/media/2016/09/obamaa.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_30__1540932919.html","title":"Obama Uses Peres Funeral to Push Israeli, Palestinian Leaders to Settle 'Unfinished Business'","title_page":"Obama Uses Peres Funeral to Push Israeli, Palestinian Leaders to Settle 'Unfinished Business'","title_rss":"NULL","source_domain":"breitbart.com","text":"(REUTERS) Jerusalem — Israeli and Palestinian leaders shook hands during a brief chat and U.S. President Barack Obama gently reminded them of the “unfinished business of peace” at the funeral Friday of Shimon Peres, the last of a generation of Israel’s founding fathers.\nBut there was no indication that Palestinian President Mahmoud Abbas’s rare visit to Jerusalem and the amiable words he and Israeli Prime Minister Benjamin Netanyahu exchanged would lead to any movement in long-stalled peacemaking.\nPeres, a former president and prime minister who died on Wednesday at the age of 93, shared a Nobel Prize for the interim land-for-peace accords he helped reach with the Palestinians as Israel’s foreign minister in the 1990s.\nLong-hailed abroad and by supporters in Israel as a visionary, Peres was seen by his critics as an overly optimistic dreamer in the harsh realities of the Middle East.\n“I know from my conversations with him, his pursuit of peace was never naive,” Obama said in his eulogy of Peres, who did much in the early part of his 70 years in public life to build up Israel’s powerful military and nuclear weapons capabilities.\nWith divisions deep over Jewish settlement in Israeli-occupied territory that Palestinians seek for a state, as well as other issues, U.S.-sponsored negotiations on a final agreement between the two sides have been frozen since 2014.\nNetanyahu and Abbas have not held face-to-face talks since 2010. Abbas opted to attend Peres’s funeral, making the short drive from nearby Ramallah, in the occupied West Bank, through Israeli military checkpoints.\n“Long time, long time,” Abbas told Netanyahu and the prime minister’s wife Sara, after shaking his hand before the start of the ceremony held in the “Great Leaders of the Nation” section of Mount Herzl cemetery, overlooking a forested valley.\nWelcoming Abbas, as participants recorded the encounter on their mobile phones, Netanyahu said of the Palestinian leader’s attendance: “It’s something that I appreciate very much on behalf of our people and on behalf of us.”\nIn Israel for just a few hours to pay tribute to Peres, Obama said in the eulogy that Abbas’s “presence here is a gesture and a reminder of the unfinished business of peace”. He was the only speaker to acknowledge Abbas’s presence.\nIn Gaza, ruled by the Islamist group Hamas, hundreds of Palestinians rallied after Friday prayers condemning the participation of Palestinian and Arab leaders in the funeral.\nFRONT ROW\nAbbas was given a front-row seat between European Council President Donald Tusk and Hungarian Prime Minister Viktor Orban. Obama briefly greeted the Palestinian leader with a kiss on each cheek before walking down the line to stand next to Netanyahu.\n“Even in the face of terrorist attacks, even after repeated disappointments at the negotiation table, (Peres) insisted that as human beings, Palestinians must be seen as equal in dignity to Jews and must therefore be equal in self-determination,” Obama said in his address.\nU.S. officials have held open the possibility of Obama making another formal effort to get peace negotiations back on the agenda before he leaves office in January, possibly via a U.N. Security Council resolution.\nNetanyahu recalled in his eulogy that he had once argued with Peres, a former leader of the center-left Labour Party, about what was more important for Israel – peace or security.\n“Shimon, you said, ‘Bibi: the best security is peace.’ And I said, ‘without security there can be no peace.'”\n“And you know what our surprise conclusion was? We are both right… The goal is not power. Power is the vehicle. The goal is existence and co-existence,” Netanyahu said.\nPeres, who suffered a stroke two weeks ago, was buried in a Jewish religious ceremony in a plot between two other former prime ministers, Yitzhak Rabin and Yitzhak Shamir. Rabin was assassinated by an ultranationalist Israeli in 1995 over the interim peace deals struck with the late Palestinian leader Yasser Arafat.\n“Gone too soon,” one of Peres’s two sons, Yoni, quoted his father as telling him when asked what he wanted as his epitaph.\nAmos Oz, the celebrated Israeli author and peace campaigner who was a long-time friend of Peres, said in his eulogy it was time to create a Palestinian state alongside Israel. “We must split this house into two apartments,” Oz said. “Where are the brave and wise leaders who will continue his legacy?”","url":"https://www.breitbart.com/middle-east/2016/09/30/obama-uses-peres-funeral-push-israeli-palestinian-leaders-together-settle-unfinished-business/"}
