{"authors":["Philip B. Haney"],"date_download":"2018-10-30 18:11:15","date_modify":"2018-10-30 18:11:15","date_publish":"2016-07-06 13:00:27","description":"Last week I testified before the Senate Judiciary Subcommittee on Oversight, Agency Action, Federal Rights and Federal Courts at a hearing entitled, “Willful Blindness: Consequences of Agency Efforts To Deemphasize Radical Islam in Combating Terrorism.” | National Security","filename":"data/vaneerConsumption/ObamaWhistleblowerTerrorLinkedMuslimGroupsHelpingSetPolicyCostingLives.json","image_url":"https://media.breitbart.com/media/2016/04/wi/afp_aa7f06a8330b07696642533fa94b8dde01ef3bc8-e1467775392936.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_06__1540923075.html","title":"Obama Whistleblower: Terror-Linked Muslim Groups Helping Set Policy, Costing Lives","title_page":"Obama Whistleblower: Terror-Linked Muslim Groups Helping Set Policy, Costing Lives | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Last week I testified before the Senate Judiciary Subcommittee on Oversight, Agency Action, Federal Rights and Federal Courts at a hearing entitled, “Willful Blindness: Consequences of Agency Efforts To Deemphasize Radical Islam in Combating Terrorism.”\nI am a recently retired Customs & Border Protection (CBP) agent. I was named a Founding Member of the Department of Homeland Security (DHS) at its inception on March 01, 2003. During my 12 years serving inside DHS under two administrations, I witnessed a series of events which ultimately prompted me to become a whistleblower, releasing critical documents to Members of Congress as I felt necessary to comply with my oath to the Constitution.\nFirst, in January of 2008, I received what is now known as the “Words Matter Memo,” which was circulated internally by the Civil Rights and Civil Liberties (CRCL) division of DHS. The full title of the document was “Terminology to Define the Terrorists: Recommendations from American Muslims,” and it read in part:\n[T]he experts counseled caution in using terms such as, “jihadist,” “Islamic terrorist,” “Islamist,” and “holy warrior” as grandiose descriptions. Collapsing all terrorist organizations into a single enemy feeds the narrative that al-Qaeda represents Muslims worldwide. We should not concede the terrorists’ claim that they are legitimate adherents of Islam. Therefore, when using the word [Islamic], it may be strategic to emphasize that many so-called “Islamic” terrorist groups twist and exploit the tenets of Islam to justify violence and to serve their own selfish political aims. Regarding jihad, even if it is accurate to reference the term (putting aside polemics on its true nature), it may not be strategic because it glamorizes terrorism, imbues terrorists with religious authority they do not have, and damages relations with Muslims around the globe.\nI submitted a seven-point response listing serious substantive concerns about this memo, but received no response.\nOn November 24, 2008, a decision came down in the Holy Land Foundation (HLF) trial, the largest terror financing case in American history. During that trial, the federal government had established that a number of organizations were appropriately named as unindicted co-conspirators along with HLF, including the Council on American Islamic Relations (CAIR), the Islamic Society of North America (ISNA), and the North American Islamic Trust (NAIT).\nSpecifically, the judge ruled that federal prosecutors had “produced ample evidence to establish the associations of CAIR, ISNA and NAIT with HLF… and with Hamas.” In addition, the judge ruled that that these organizations had direct links to the Muslim Brotherhood, one of the oldest and largest Islamic fundamentalist organizations in the world, founded in 1928 in Egypt to reestablish the Caliphate, whose motto includes “Jihad is our way, and death in the service of Allah is the loftiest of our wishes.”\nI made note of the decision, and explored links between these groups and potential extremist and terrorist activity. But on October 15, 2009, I was ordered by DHS to ‘modify’ linking information in about 820 subject records in the Treasury Enforcement Communications System, or “TECS records” to remove ‘unauthorized references to terrorism.’ I was further ordered not to input any more Memoranda of Information Received, or MOIRs, to create no more TECS records, and to do no further research on the topics I was exploring.\nOn November 5, 2009, at Ft. Hood, Texas, Nidal Hasan shot and killed 13 people, including one who was pregnant, and wounded 32 others, while calling out “Allahu akbar!” meaning “God is great” in Arabic.\nHassan was a U.S. Army major who had exchanged emails with leading al Qaeda figure Anwar Awlaki – which the FBI had seen and decided not to take action – in which he asked whether those attacking fellow U.S. soldiers were martyrs. He had also given a presentation to Army doctors discussing Islam and suicide bombers during which he argued Muslims should be allowed to leave the armed forces as conscientious objectors to avoid “adverse events.” The Pentagon refused for five years to grant victims Purple Hearts, designating the attack “workplace violence.”\nOn January 27-28, 2010 an ‘Inaugural Meeting’ occurred between American Muslim leaders and DHS Secretary Janet Napolitano, hosted by DHS CRCL. The Inaugural Meeting created controversy because it included a number of Islamic fundamentalist individuals and organizations.\nFor instance, the meeting included at least one organization that was named as an unindicted co-conspirator in the 2008 HLF Trial and established to have associations with the now-shuttered HLF and with Hamas, namely ISNA. According to the Investigative Project on Terrorism (IPT), the group’s representative who attended the meeting, Ingrid Mattson, has “an established pattern of minimizing the nature of extremist forms of Islam and rationalizing the actions of Islamist terrorist movements.” Another invited group, the Muslim American Society (MAS), was actually formed as the United States chapter of the Muslim Brotherhood in 1993.\nLikewise, in the Spring of 2010, the Administration convened the Countering Violent Extremism (CVE) Working Group under the authority of the Homeland Security Advisory Council (HSAC), again raising questions because of those named to it.\nThey included Omar Alomari, who once wrote that jihad was “the benign pursuit of personal betterment. It may be applied to physical conflict for Muslims, but only in the arena of Muslims defending themselves when attacked or when attempting to overthrow oppression and occupation,” asserting further that “”Jihad as a holy war is a European invention, spread in the West”; Mohamed Elibiary, who has asserted that it was “inevitable that [the] ‘Caliphate’ returns” and ultimately was let go from the HSAC amid charges he misused classified documents; and Dahlia Mogahed, who has decried “lethal cocktail of liberty and capitalism” and holds that “Islamic terrorism’ is really a contradiction in terms” to mainstream Muslims “because terrorism is not Islamic by definition.”\nSo by the Spring of 2010, we had come to the point that a CBP Officer was literally removing information connecting the dots on individuals with ties to known terror-linked groups from TECS, while the Administration was bringing the same individuals into positions of influence, to help create and implement our counter-terror policy, in the context of actual terror attacks taking place.\nOn August 30, 2011, the DHS Chief Council approved a project I initiated looking into Islamic fundamentalist group Tablighi Jamaat (TJ). On November 15, 2011, I began a temporary duty assignment at the National Targeting Center (NTC). A short time later, I was assigned to the Advanced Targeting Team, where I worked exclusively on the TJ Project, which was quickly upgraded to a global-level case.\nOn March 15, 2012, seven lawyers and three senior executive service (SES) administrators met with management personnel at the NTC to express concern for our focus on TJ, because it is not a designated terrorist group, and therefore the project might be “discriminating” against its members because they are Muslim. On June-July, 2012, the TJ Initiative was ‘taken in another direction,’ (i.e. shut down). The Administration took this action despite the fact that [1] in nine months, we had conducted 1,200 law enforcement actions, [2] I was formally commended for finding 300 individuals with possible connections to terrorism, and [3] 25% of the individuals in Guantanamo Bay had known links to Tablighi Jamaat.\nOn August 22, 2012, The Institute of Islamic Education (IIE) case that today links both the Darul Uloom Al-Islamiya mosque attended by Syed Rizwan Farook and Tashfeen Malik, the San Bernardino shooters, and the Fort Pierce mosque attended by Omar Mateen, the Orlando shooter, was entered into TECS. But once again, on September 21, 2012, all 67 records in the IIE case were completely deleted (not just ‘modified’) from TECS.\nOn September 21, 2014, I was relieved of my service weapon, all access to TECS and other programs was suspended, my Secret Clearance was revoked, and I was sequestered for the last 11 months of my career with no assigned duties.\nOn December 2, 2015, the San Bernardino shootings occurred, and I immediately linked the mosque in San Bernardino to the IIE case (with the 67 deleted records), and to the Tablighi Jamaat case (which was shut down).\nOn June 09, 2016, the Homeland Security Advisory Council Countering Violent Extremism (CVE) Subcommittee issued an Interim Report and Recommendations. The report recommended in part using American English instead of religious, legal and cultural terms like “jihad,” “sharia,” “takfir” or “umma.”\nOn June 12, 2016, the shootings in Orlando occurred, and I linked Omar Mateen’s mosque in Fort Pierce, FL to the IIE & TJ case. And on June 19, 2016, Attorney General Loretta Lynch announced that her Department of Justice would release redacted 9-11 call transcripts for Mr. Mateen.\nThe threat of Islamic terrorism does not just come from a network of armed organizations such as Hamas and ISIS, who are operating ‘over there’ in the Middle East. In fact, branches of the same global network have been established here in America, and they are operating in plain sight, at least to those of us who have been charged with the duty of protecting our country from threats, both foreign and domestic.\nThe threat we face today, which continues growing despite the willful blindness of those who insist on pretending otherwise, is not “violent extremism,” “terrorism,” or even “Jihad” alone, but rather, the historical and universally recognized Islamic strategic goal of implementing Shariah law everywhere in the world, so that no other form of government (including the U.S. Constitution) is able to oppose its influence over the lives of those who must either submit to its authority, become second-class citizens, or perish.\nIgnoring that reality has arguably cost at least the lives of those in Ft. Hood, San Bernardino and Orlando, and will cost many, many more if it is allowed to continue.\nPhilip B. Haney is a recently retired Customs & Border Protection (CBP) agent. He was named a Founding Member of the Department of Homeland Security (DHS) at its inception on March 01, 2003, and is the author of See Something, Say Nothing: A Homeland Security Officer Exposes the Government’s Submission to Jihad (2016).","url":"https://www.breitbart.com/national-security/2016/07/06/willful-blindness/"}
