{"authors":["Keith Griffith For Dailymail.Com"],"date_download":"2018-10-22 20:55:25","date_modify":"2018-10-22 20:55:25","date_publish":"2017-03-16 00:14:12","description":"Obama on Wednesday released his picks for the NCAA men's and women's basketball tournaments, one day before tip-off for the first games on Thursday, picking UNC as the men's champion.","filename":"data/vaneerConsumption/ObamamakesMarchMadnesspredictionsafterTrumpdeclined.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/23/3E4FB9BF00000578-0-image-a-21_1489621764489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318190_Obama-makes-March-Madness-predictions-Trump-declined_1540241725.html","title":"Obama makes March Madness predictions after Trump declined","title_page":"Obama makes March Madness predictions after Trump declined | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"March Madness fans working on their office pool brackets got a last minute assist from former President Barack Obama, after the current office holder declined to participate in the annual college sports tradition.\nObama on Wednesday released his picks for the NCAA men's and women's basketball tournaments, one day before tip-off for the first games on Thursday.\nThe avid basketball fan predicts that Duke University and the University of North Carolina will meet in the men's championship game, something that has never previously happened for the arch-rival college ball powerhouses located a mere 10 miles from each other in central North Carolina.\nObama predicts number six nationally ranked UNC will best number seven Duke in the final.\nObama predicts UNC will best Duke in the men's final. The arch-rivals have never met in an NCAA championship game\nObama made March Madness prediction brackets an annual tradition while he was in the White House (file photo)\nThe former president also predicts the UConn team to best Notre Dame in the NCAA women's basketball championship\nFor the women's tournament, Obama calls number one nationally ranked University of Connecticut to beat number two Notre Dame in the championship game.\nThe former president predicts a few upsets in the men's first round, including number 10 seed VCU over seventh seeded St. Mary's, and 10th seeded Wichita State besting number seven seed Dayton.\nOBAMA'S MARCH MADNESS BRACKET RECORD\nYEAR 2016 2015 2014 2013 2012 2011 2010 2009 OBAMA'S CHAMPION PICK Kansas Kentucky Michigan State Indiana UNC Kansas Kansas UNC ACTUAL CHAMPION Villanova Duke UConn Louisville Kentucky UConn Duke UNC\nDespite Obama's fandom, which made his annual bracket release an anticipated tradition while in the White House, as president he was a middling hand at bracket predictions.\nIn eight years as president, Obama picked the final champion correctly only once: UNC in 2009.\nIf his prediction for them to win is correct again this year, it would be UNC's sixth NCAA championship title.\nObama's annual bracket picks became an annual tradition while he was in the Oval Office, often followed by appearances on ESPN to discuss his picks.\nLast month, ESPN said it approached President Donald Trump about submitting a March Madness bracket, but that the current administration had 'respectfully declined.'","url":"https://www.dailymail.co.uk/news/article-4318190/Obama-makes-March-Madness-predictions-Trump-declined.html"}
