{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:38:01","date_modify":"2018-10-30 20:38:01","date_publish":"2016-11-30 03:13:20","description":"Obama expanded the power of the Joint Special Operations Command to potentially kill terrorists in places beyond the traditional war zones.","filename":"data/vaneerConsumption/ObamaGivesSpecialForcesExpandedPowerIntensifiesWaronSomaliAlShabab.json","image_url":"https://media.breitbart.com/media/2016/05/al-Shabaab-fighters-somolia-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_11_29__1540931881.html","title":"Obama Gives Special Forces ‘Expanded Power’, Intensifies War on Somali Al Shabab","title_page":"Obama Gives Special Forces ‘Expanded Power’, Intensifies War on Somali Al Shabab","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama has expanded the power of the elite Joint Special Operations Command (JSOC) to track, plan, and potentially kill terrorists across the globe in places beyond the traditional war zones of Iraq, Syria, and Libya, The Washington Post (WaPo) has learned.\nThe move comes as the Obama administration expands the legal scope of the U.S. war against al-Qaeda to allow the U.S. military to intensify its efforts against the terrorist group’s Somalia-based affiliate al-Shabaab.\nAccording to The New York Times (NYT):\nThe administration has decided to deem al-Shabaab, the Islamist militant group in Somalia, to be part of the armed conflict that Congress authorized against the perpetrators of the Sept. 11, 2001, terrorist attacks, according to senior American officials. The move is intended to shore up the legal basis for an intensifying campaign of airstrikes and other counterterrorism operations, carried out largely in support of African Union and Somali government forces.\nThe Obama administration is expected to officially notify Congress of its al-Shabaab decision next month in a letter listing global deployments.\n“It is part of the Obama administration’s pattern of relaxing various self-imposed rules for airstrikes against Islamist militants as it tries to help its partner forces in several conflicts,” notes the Times.\nMeanwhile, citing unnamed U.S. officials, WaPo notes that the decision to expand JSOC’s powers is “driven by concerns of a dispersed terrorist threat as Islamic State [ISIS/ISIL] militants are driven from strongholds in Iraq and Syria.”\nJSOC is the U.S. military unit that helped kill al-Qaeda’s former leader Osama bin Laden in a 2011 raid by Navy SEALs.\n“The [new JSOC] missions could occur well beyond the battlefields of places like Iraq, Syria and Libya where Joint Special Operations Command (JSOC) has carried out clandestine operations in the past,” it adds. “When finalized, it will elevate JSOC from being a highly-valued strike tool used by regional military commands to leading a new multi-agency intelligence and action force.”\nThe U.S. military is simultaneously backing ongoing operations to push ISIS out of the terrorist group’s de-facto capitals of Mosul in Iraq and Raqqa in Syria.\nIn the meantime, ISIS and al-Qaeda are operating in dozens of countries outside Iraq and Syria.\nUnder the recently expanded powers, a new JSOC group known as the “Counter-External Operations Task Force” has been formed.\n“It is designed to take JSOC’s targeting model — honed over the last 15 years of conflict — and export it globally to go after terrorist networks plotting attacks against the West,” explains the Post. “The creation of a new JSOC entity this late in the Obama’s tenure is the ‘codification’ of best practices in targeting terrorists outside of conventional conflict zones, according to the officials who spoke on the condition of anonymity to discuss administration deliberations.”\n“It is unclear, however, if the administration of President-elect Donald Trump will keep this and other structures set up by Obama,” it adds. “They include guidelines for counterterrorism operations such as approval by several agencies before a drone strike and ‘near certainty’ that no civilians will be killed.”\nNYT notes that the president-elect will benefit from Obama’s decision to expand America’s war against al-Qaeda to include al-Shabaab.\nAlthough the Pentagon hopes to see the new JSOC unit work in tandem with the CIA, WaPo acknowledges that it is still unclear if the agency is willing to cooperate with JSOC and the Pentagon as a whole.\n“The agency, with its broad contacts overseas, espionage networks and long experience in covert operations still has much greater reach than JSOC,” notes the Post, adding that the CIA has declined to comment on the expanded powers.\n“The new JSOC task force will report to the Pentagon through the U.S. Special Operations Command, or SOCOM, according to U.S. military officials, creating a hybrid command system that can sidestep regional commanders–with their coordination–for the sake of speed,” adds WaPo.\nUltimately, operations by the new task force will have to be approved by the White House and the Pentagon.\nSome former and current U.S. service members have complained that the Obama administration is allowing too many civilian bureaucrats to make decisions about combat operations, placing American troops at risk.\nIn June, The Wall Street Journal (WSJ) reported that Obama’s Pentagon had been expected to intensify its already heavy reliance on U.S. special operations forces, namely SOCOM, as part an effort to overhaul the manner in which America fights its war against terrorism.\n“The new JSOC task force could also offer intelligence, strike recommendations and advice to the militaries and security forces of traditional Western allies, or conduct joint operations, officials said,” points out the Post regarding the recent changes implemented by President Obama. “In other parts of the world, with weak or no governments, JSOC could act unilaterally.”","url":"https://www.breitbart.com/national-security/2016/11/29/report-obama-grants-expanded-power-elite-special-forces-target-terrorists-globally/"}
