{"authors":[],"date_download":"2018-10-30 01:00:02","date_modify":"2018-10-30 01:00:02","date_publish":"2015-06-19 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamasshamefulphonyguncontrolrhetoricinthewakeofCharlestonmassacre.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_obamas_shameful_phony_gun_control_rhetoric_in_the_wake_of_charleston_massacre_comments_1540861202.html","title":"Obama's shameful, phony gun control rhetoric in the wake of Charleston massacre","title_page":"Blog: Obama's shameful, phony gun control rhetoric in the wake of Charleston massacre","title_rss":"NULL","source_domain":"americanthinker.com","text":"If access to firearms were as easy as President Obama insisted in the aftermath of the South Carolina church massacre, Carol Bowne would be alive today. The 39-year-old New Jersey woman with a restraining order against an ex-boyfriend was murdered by that boyfriend while she waited for her application for a gun permit to wind its way through a process that takes at least two months to complete. But it wasn’t completed soon enough: The Berlin Township woman got a restraining order against a former boyfriend, installed security cameras and an alarm system to her home and began the months-long process of obtaining a handgun, friends said. But it wasn't enough. Bowne, 39, was stabbed to death in the driveway of her Patton Avenue home on Wednesday night. Browne was a victim of domestic violence, She didn’t have a gun in her home. Gun control zealots tells us a gun in the home is dangerous, but then so too is an ex-boyfriend, one Michael Eitel, with a knife.... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/06/obamas_shameful_phony_gun_control_rhetoric_in_the_wake_of_charleston_massacre_comments.html"}
econd Amendment rights:\nAccording to news reports, Eitel had previously went to the salon in Somerdale where she worked and broke the windows on Bowne's vehicle…. Bowne then went to Berlin Township police in mid-April to apply for a gun license. According to reports, she went to check on the process — which takes about two months to complete — as recently as this week.\nPresident Obama didn’t have Carol Bowne in mind when, on his way to another fund raiser, he addressed the nation and said the church shooting in Charleston said it was once again time talk about gun violence and easy access to firearms, even though Bowne’s case proves that for potential victims, access is not so easy. Instead he reiterated tired nostrums about gun control with a new, and demonstrably false, twist:\n“Now is the time for mourning and for healing, but let’s be clear,” he declared “At some point, we, as a country, will have to reckon with the fact that this type of mass violence does not happen in other advanced countries. It doesn’t happen in other places with this kind of frequency. And it is in our power to do something about it.”\nLike arming the potential victims perhaps so they can shoot back? It is worth noting that such mass shootings occur at what are designated as or are in effect gun-free zones such as at Sandy Hook and that several mass shootings have either been averted or cut short by the defensives use of a firearm by a private citizen such as at Clackamas Mall in Oregon:\nBefore the tragedy in Connecticut, a shooter at an Oregon shopping mall was stopped by an armed citizen with a concealed carry permit who refused to be a victim, preventing another mass tragedy. In the target-rich environment of the Clackamas Town Center two weeks before Christmas, the shooter managed to kill only two people before killing himself. A far worse tragedy was prevented when he was confronted by a hero named Nick Meli. As the shooter was having difficulty with his weapon, Meli pulled his and took aim, reluctant to fire lest an innocent bystander be hit. But he didn't have to pull the trigger: The shooter fled when confronted, ending his own life before it could be done for him. We will never know how many lives were saved by an armed citizen that day. From Virginia Tech to a movie theater in Aurora, Colo., to a school in Newtown, Conn., such mass shootings are usually in venues declaring themselves gun-free zones. Other mass shootings — from a high school shooting by in Pearl, Miss., to the New Life Church shooting in Colorado Springs, Colo., which took place before the massacre in Aurora — have been cut short when someone retrieved a gun from a car or elsewhere and confronted the shooter.\nThe President who once described ISIS as a “JV” team errs when he claims such mass shootings do not occur in advanced countries, yet another gratuitous slap at an America he seeks to fundamentally transform. Has he forgotten the attack on the offices of the French satirical magazine Charlie Hebdo in Paris, which his administration dismissed as the victims just being in the wrong place at the wrong time?\nThe lives of the four Jews killed in a kosher market in Paris were dismissed by Obama as \"a bunch of folks in a deli\" shot \"randomly\" as they happened to be in the wrong place at the wrong time.\nThere is evil in the world and evil will find the instruments needed to commit its crimes and atrocities. France isn’t the only gun-controlled “advanced” country where heinous violence has occurred, with or without guns. Take Norway, for example:\nHad gun-controlled Norway let citizens carry concealed weapons, lone gunman Andres Brevik would not have been able to shoot 68 unarmed people after setting off a car bomb in the heart of Oslo that killed nine others.\nGuns save lives as well as take them and if Carol Bowne’s gun permit been approved, she might have provided yet another living testimony to that fact. Creating more unarmed potential victims is no the answer to armed evil and the evidence mounts that the only thing that can stop a bad guy with a gun is a good guy with a gun.\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/blog/2015/06/obamas_shameful_phony_gun_control_rhetoric_in_the_wake_of_charleston_massacre.html"}
