{"authors":[],"date_download":"2018-10-22 21:29:37","date_modify":"2018-10-22 21:29:37","date_publish":"2014-06-05 14:34:49","description":"\"I make absolutely no apologies for making sure we get back a young man to his parents,\" Obama told a press conference. \"This is somebody's child.\"","filename":"data/vaneerConsumption/ObamaBergdahlIsSomebodysChildNoApologiesforSwap.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/489571/140605-obama-1032_ced16422a080b4595e8413a6f78159f9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_obama-bergdahl-somebodys-child-no-apologies-swap-n123501_1540243777.html","title":"Obama: Bergdahl 'Is Somebody's Child,' No Apologies for Swap","title_page":"Obama: Bergdahl 'Is Somebody's Child,' No Apologies for Swap","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBRUSSELS - President Barack Obama said he will make \"no apologies\" for trading five Taliban militants for captured Army Sgt. Bowe Bergdahl.\nThe exchange over the weekend for Bergdahl - who was held captive for five years - has been roundly criticized on Capital Hill by lawmakers saying the move amounts to negotiating with terrorists and others furious that Congress was not notified.\nSpeaking in Brussels on Thursday, Obama acknowledged that he is \"never surprised\" by controversies whipped up in Washington.\nHe defended the decision by saying \"we saw an opportunity and we seized it,\" noting that prisoner exchanges are not unique to his administration.\n\"I make absolutely no apologies for making sure we get back a young man to his parents,\" he told a press conference. \"This is somebody's child.\"\nThe president mentioned the letters he gets from parents asking that he makes sure their children going off to war are taken care of, saying that \"as commander in chief of the U.S. Armed Forces, I am responsible for those kids.\"\nWhite House officials have said one of the reasons Congress was not consulted is because Bergdahl's health was deteriorating.\nU.S. Defense Secretary Chuck Hagel reiterated those claims on Thursday, telling BBC news that \"it was our judgement, based on the information that we had, that his life, his health were in peril.\"\n- Chuck Todd and Cassandra Vinograd","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/obama-bergdahl-somebodys-child-no-apologies-swap-n123501"}
