{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:32:31","date_modify":"2018-10-30 20:32:31","date_publish":"2016-01-09 03:56:05","description":"\"Smart Guns\" failed in California and in Maryland in 2014, yet Obama's executive gun control contained an order directing \"further\" use of \"smart guns.\"","filename":"data/vaneerConsumption/ObamasSmartGunsAlreadyFailedinCalifornia.json","image_url":"https://media.breitbart.com/media/2016/01/man-with-Armatix-iP1-smart-gun-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_08__1540931551.html","title":"Obama's 'Smart Guns' Already Failed in California","title_page":"Obama's 'Smart Guns' Already Failed in California | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“Smart Guns” failed in California in March 2014 and in Maryland in May 2014, yet President Obama’s executive gun control contained an order directing the DOD, DOJ, and Homeland Security to explore ways to “further” the use of “smart guns.”\nThe “smart gun” in California and Maryland was the Armatix iP1, which would only fire if in close proximity to a watch that the person shooting the gun was supposed to wear. As Breitbart News previously reported, the iP1 only came in one caliber—.22 lr—and it cost approximately $1,800, which is about $1,325 more than a traditional semiautomatic Glock handgun in 9mm or a Smith & Wessson M&P Shield in .40 caliber.\nSo the “smart gun” cost four times as much as a traditional self-defense handgun, and it was chambered in a caliber too small to be relied on for self-defense.\nSubsequently, the outcry against the gun even being stocked in Newhall, California, at the Oak Tree Gun Club was so great that the store owner pulled the gun before one could be sold. The Washington Post reports that the same thing happened in Maryland. In addition to the cost of the firearm, the diminutive round for self-defense, and the fact that a gun paired with a watch will work for any thief who remembers to steal the watch too, the other negative aspect of “smart guns” was the fear that even a successful one for plinking—and .22 lr is a plinking round—would lead to mandates that everyone had to buy one.\nIn fact, in New Jersey, state lawmakers were looking for a viable “smart gun,” and they were going to mandate it be sold in the state per law.\nSo the “smart gun” failed in California. And one year later—in May 2015—the company that makes iP1 filed for chapter 11-style restructuring in Germany. The lesson learned was that the U.S. market was not any where near ready to support “smart gun” technology.\nBut ComputerWorld reports that “smart gun” developers kept their fingers crossed, hoping for an infusion of cash to counter the lack of cash coming from the free market. And when Obama used his executive orders to direct the DOD, DOJ, and Homeland Security to explore ways to “further” the use of “smart guns” and sponsor “research” into “smart gun technology,” developers started to think they might now have the funds to do what the market has shown no interest in supporting.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/01/08/obamas-smart-guns-already-failed-in-california/"}
