{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 20:08:09","date_modify":"2018-10-30 20:08:09","date_publish":"2016-01-03 08:16:28","description":"President Barack Obama may visit Cuba--and is looking for ways to let the Cuban \"revolution\" interpret human rights norms in convenient ways.","filename":"data/vaneerConsumption/ObamaPlansVisittoCubaWHDefendsRevolution.json","image_url":"https://media.breitbart.com/media/2015/04/ap_barack-obama-raul-castro_ap-photo7-e1450367397640.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_03__1540930089.html","title":"Obama Plans Visit to Cuba, WH Defends 'Revolution'","title_page":"Obama Plans Visit to Cuba, WH Defends 'Revolution' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The White House has confirmed that President Barack Obama may visit Cuba in 2016–and says it is looking for ways to let the Cuban “revolution” interpret human rights norms in ways that allow it to retain power.\nThe Los Angeles Times quotes White House deputy national security adviser Ben Rhodes as saying that the adminisitration views “some degree of change” in Cuba’s human rights practices as potentially “consistent with their revolution.”\nTranslation: the White House will accept cosmetic changes in the Castro regime’s behavior in return for protecting its absolute control of Cuba.\nThis is a similar approach to the one the Obama administration has taken to human rights and democracy in the Muslim world, in which it has accepted the dilution of universal principles of freedom–and America’s own constitutional principles–to protect autocratic and theocratic regimes from the threat of change.\nThe Obama administration initially reached out to the Cuban regime, offering the full normalization of relations in exchange for democratic reform and improvements in human rights in Cuba.\nWhile the U.S. has relaxed restrictions on travel to Cuba, and re-opened the U.S. embassy in Havana (without inviting members of the Cuban opposition), the Castro regime has only increased its demands, while doing nothing–or worse–to advance political reforms.\nAs the Wall Street Journal‘s Mary Anastasia O’Grady notes that “Cuba’s dissidents have been hard hit” since the Obama announced its new policy in late 2014. One Cuban human rights activist told journalists: “There have been no positive changes.”\nThere seems to be no sense in the Obama administration that a presidential visit might be reserved for actual good behavior–that visiting before there are real reforms might simply entrench the regime. Indeed, that seems to be an acceptable outcome for the White House, which is more concerned about assuaging the Cuban regime’s fears of political change than defending the Castros’ victims–at home or abroad–or America’s own values and interests.\nRhodes–who negotiated the deal with Cuba despite having no foreign policy credentials–suggests the real goal is to make sure no Republican successor could undo Obama’s policy.\n¡Viva la Revolucion!","url":"https://www.breitbart.com/politics/2016/01/03/obama-plans-visit-to-cuba-wh-defends-revolution/"}
