{"authors":["Caroline May"],"date_download":"2018-10-30 19:16:52","date_modify":"2018-10-30 19:16:52","date_publish":"2015-06-29 18:23:42","description":"“As we celebrate Independence Day, we welcome over 4,000 new Americans who will be able to enjoy all the rights, privileges and responsibilities of U.S. citizenship,” USCIS Director León Rodríguez said in a statement Monday. |","filename":"data/vaneerConsumption/ObamaAdminCelebratingJuly4ByNaturalizing4000Immigrants.json","image_url":"https://media.breitbart.com/media/2015/04/citizenship-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_29__1540927012.html","title":"Obama Admin. Celebrating July 4 By Naturalizing 4,000 Immigrants","title_page":"Obama Admin. Celebrating July 4 By Naturalizing 4,000 Immigrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Obama administration is welcoming 4,000 new citizens this week as part of its celebration of the Fourth of July.\nU.S. Citizenship and Immigration Services (USCIS) announced Monday that it will be celebrating the nation’s Independence Day with naturalization ceremonies across the country from July 1 to July 4.\n“As we celebrate Independence Day, we welcome over 4,000 new Americans who will be able to enjoy all the rights, privileges and responsibilities of U.S. citizenship,” USCIS Director León Rodríguez said in a statement Monday.\n“From Los Angeles to New York, Miami to Seattle, Indianapolis to Los Alamos, these individuals are showing their full commitment to the freedoms, values and ideals that have inspired Americans since the Declaration of Independence in 1776,” he added.\nThe Obama administration has made a concerted effort in recent months to encourage immigrants to naturalize, notably partnering with immigrant-heavy cities to promote citizenship.\nThis week, naturalization ceremonies will be held in over 40 locations including he New York Public Library, Harold Washington Library Center in Chicago, Seattle Center, the National WWII Museum in New Orleans and the Tower Theater in Miami as well as Virginia’s Mount Vernon and Monticello.\nRush H. Limbaugh, Sr. Courthouse in Cape Girardeau, MO will also host a naturalization ceremony on July 4. The courthouse was named for radio host Rush Limbaugh’s grandfather.","url":"https://www.breitbart.com/politics/2015/06/29/obama-admin-celebrating-july-4-by-naturalizing-4000-immigrants/"}
