{"authors":[],"date_download":"2018-10-22 22:13:00","date_modify":"2018-10-22 22:13:00","date_publish":"2014-05-09 13:07:24","description":"It's less than six months until Election Day, and Democrats are going into full campaign mode.","filename":"data/vaneerConsumption/ObamaMakesHisMidtermPitch.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/431546/obama-jpeg-033af_b6528a9ad41aa8a0dba7e8ba91e2007b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_obama-makes-his-midterm-pitch-n101276_1540246380.html","title":"Obama Makes His Midterm Pitch","title_page":"Obama Makes His Midterm Pitch ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nObama makes his midterm pitch\nNow less than six months until Election Day, we’ve reached the point in the 2014 midterm cycle where everyone has begun to focus on the campaign. And that was especially true of President Obama, who pretty much spent his entire day fundraising for Democrats and making a midterm pitch that was largely devoted to the economy. “We have made enormous progress over the last five-something years. We've created 9.2 million jobs; auto industry has come roaring back; we have reduced our oil imports; we are producing more clean energy than ever before; we have seen college attendance go up; we've seen high school dropouts go down,” he said at a fundraiser for the Democratic National Committee in San Jose, CA. “But for all that we've done … we know that we've got more work to do.” Then the president turned to the Republican opposition. “[T]hey have said no to every proposal that we know could make a difference in the lives of hardworking Americans. They’ve said no to proposals that would rebuild our infrastructure. They’ve said no to proposals that would increase basic research that drives the innovation that has made this region the envy of the world. They have said no to equal pay for equal work.” He added, “They said no to increasing the minimum wage. They’ve said no to helping kids afford college. They even shut down the government and almost created another global financial catastrophe because they wanted to get their way.” The Wall Street Journal writes that the White House wants to focus on contrasting the two parties when it comes to the economy.\nA good week for the NRSC\nYet Obama’s argument comes at the tail end of what has been a good campaign week for Republicans, particularly the folks at the National Republican Senatorial Committee. They got the candidate they wanted in North Carolina’s Senate race -- Thom Tillis -- and avoided him having to spend the next two months in a run off. They also appear to have their favored candidates in Georgia duking it out (David Perdue vs. Jack Kingston) instead of the ones they feared would take off (Paul Broun and Phil Gingrey). Speaking of Tillis, don’t miss this very interesting TV ad that Senate Majority PAC (D) is running against him in North Carolina; the narrator infiltrated Tillis’ victory speech on Tuesday. Talk about taking the campaign tracker video business to another level -- direct to air.\nIs Montana done?\nThere’s one other piece of good news for Senate Republicans: It appears that they are beginning to pull away in Montana’s Senate race. A poll from Hickman Analytics (D) found Rep. Steve Daines (R-MT) leading appointed Sen. John Walsh (D-MT) by double digits, 49%-37%. Yes, it’s just one poll, but it confirms the conventional wisdom that the race might not be competitive in November. As we’ve pointed out before, the BIGGEST development in the GOP prospects to retake the Senate in 2014 was 1) when Sen. Max Baucus (D-MT) decided not to run for re-election, and 2) when former Gov. Brian Schweitzer (D) decided not to run for the seat. Had either of those things NOT happened, Democrats would likely be sitting much prettier in keeping the majority. No other retirement cost them more, arguably.\nRomney calls for raising minimum wage, name-drops 2016 favorites\nRepublican 2012 presidential nominee Mitt Romney appeared on “Morning Joe” this morning, and he made news on two different fronts. First, he advocated for raising the minimum wage. “I think we ought to raise it. Because frankly our party is all about more jobs and better pay, and I think communicating that is important to us,” he said. It’s striking that the Republicans who have recently come out in favor of raising the minimum wage -- Romney, Tim Pawlenty, Rick Santorum -- were the party’s presidential candidates in 2012, and all of them won office in blue states. Second, Romney name-dropped folks he’s watching in 2016, and what was as interesting were the folks he DID NOT name. “I am not running for president in 2016. I’m going to be supporting someone who represents practical conservatives that I think we need. You know some of my favorites: Paul Ryan, of course. I love Paul, we were a great team together. But Chris Christie, and Jeb Bush and Rob Portman. The list is long. Scott Walker. There are a lot of fellows.” Should all of those “practical” Romney conservatives (as he described them) end up not running, then what? Does Romney end up hovering over the 2016 field a la Christie in 2012 or Hillary and Gore in 2004 with the Dems? Perhaps.\nNBC/WSJ poll on most admired first ladies\nBarbara Bush and Hillary Clinton share the title of the most admired first lady of the past 25 years, with current first lady Michelle Obama in a close third, according to the most recent NBC/WSJ poll. With Mother's Day approaching, 27% of respondents picked Barbara Bush as the most admired first lady, an equal percentage chose Hillary Clinton, and 24% selected Michelle Obama. Former first lady Laura Bush was fourth at 17%. But there are striking splits among different subgroups. Democrats narrowly prefer Michelle Obama over Hillary Clinton, 42% to 39%. Republicans prefer Barbara Bush over Laura Bush, 45% to 36%. And independents admire Barbara Bush (28%) and Clinton (27%) the most. Among African-Americans, it’s Michelle Obama at 58% and Hillary Clinton at 30%. Among Latinos, it’s Clinton at 45% and Obama at 29%. And among whites, it’s Barbara Bush (33%), Clinton (24%), Laura Bush (21%), and Obama (18%).\nGOP tries to dent Hillary’s foreign-policy armor\nSpeaking of Hillary Clinton, there is a concerted effort by Republicans to make her secretary of state tenure a liability if she runs in 2016. The latest GOP focus: the Boko Haram group that has kidnapped hundreds of Nigerian girls. As the Daily Beast first reported on Wednesday, “The State Department under Hillary Clinton fought hard against placing the al Qaeda-linked militant group Boko Haram on its official list of foreign terrorist organizations for two years. And now, lawmakers and former U.S. officials are saying that the decision may have hurt the American government's ability to confront the Nigerian group that shocked the world by abducting hundreds of innocent girls.” And Republicans pounced all over this story. Yet the New York Times follows up that the State Department was concerned that putting Boko Haram on the official terrorist list “would generate publicity for the group and help it attract support from other extremists.” So Republicans are clearly trying to nick up Clinton at every opportunity. Then again, is there a potential top-shelf GOP 2016er who has comparable foreign policy and national security experience to Clinton’s?\nMeasure to establish Benghazi committee passes House\nNBC’s Frank Thorp reported that the House on Thursday passed a resolution, 232-186, largely along party lines to establish a select committee on the events surrounding the 2012 terrorist attack in Benghazi. Seven Democrats voted for the measure. The resolution creates a new 12-member committee with seven Republicans and five Democrats, a move Speaker John Boehner hopes will consolidate the four current and ongoing investigations being conducted by other House committees. The measure does not need to pass the Senate. So what happens next? Per Thorp, the House Democratic caucus will meet this morning at 9:00 am ET to discuss whether to boycott the committee. House Republicans will likely appoint their seven members Friday afternoon; Rep Trey Gowdy (R-SC) has already been announced as the Committee's chairman. And the committee will likely not meet until later this month, as the House is in recess next week.\nClose in Connecticut\nIt looks like Connecticut’s likely 2014 gubernatorial race between Gov. Dan Malloy (D) and Tom Foley (R) will be as close as the 2010 Malloy-vs.-Foley race. Per a new Quinnipiac poll, Malloy and Foley are tied at 43%, while Malloy has a 48%-46% approval rating in the state.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/obama-makes-his-midterm-pitch-n101276"}
