{"authors":[],"date_download":"2018-10-30 14:35:15","date_modify":"2018-10-30 14:35:15","date_publish":"2015-03-23 00:00:00","description":null,"filename":"data/vaneerConsumption/ObamaisenragedbyNetanyahuquotingKerry.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_obama_is_enraged__by_netanyahu_quoting_kerry_1540910115.html","title":"Obama is enraged - by Netanyahu quoting Kerry","title_page":"Obama is enraged - by Netanyahu quoting Kerry","title_rss":"NULL","source_domain":"americanthinker.com","text":"Obama is enraged - by Netanyahu quoting Kerry\nAccording to the April 18, 2013 U.K. Telegraph: \"Mr Kerry, the US secretary of state, told the US House of Representatives Foreign Affairs Committee on Wednesday that the 'window' for a two state solution was 'shutting'. 'I think we have some period of time, a year, a year-and-a-half, or two years and it's over,' he said.\"\nAnd what happened two years after Mr. Kerry's prophecy that at the maximum, after two years, the two-state solution is \"over\"? On March 16, 2015, Netanyahu asserted that there won't be a Palestinian state. And then, a funny thing happened. Instead of rejoicing at his secretary of state's powers of clairvoyance and prophecy, President Obama became enraged: \"'We take him [Netanyahu] at his word that it wouldn’t happen during his prime ministership, and so that’s why we’ve got to evaluate what other options are available to make sure that we don’t see a chaotic situation in the region,' Mr. Obama said.\" But why \"evaluate\" \"other options\" regarding Mr. Netanyahu, who, after all, merely confirmed what Mr. Kerry stated two years prior? Shouldn't Mr. Obama rather \"evaluate\" Mr. Kerry? And for that matter, given that Mr. Kerry acted as a mouthpiece of the Obama administration when making his prophetic statement, shouldn't Mr. Obama \"evaluate\" Mr. Obama – giving himself a high mark for being right on what he said, and for embracing Mr. Netanyahu for so precisely confirming Mr. Obama's, and Mr. Kerry's, prediction? Shouldn't Netanyahu's statement be a moment of pride for Mr. Obama? Why isn't Mr. Obama happy?","url":"https://www.americanthinker.com/blog/2015/03/obama_is_enraged__by_netanyahu_quoting_kerry.html"}
