{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:46:21","date_modify":"2018-10-30 21:46:21","date_publish":"2015-02-09 04:14:42","description":"President Obama visited Vox.com to talk about the state of the nation, and the result is cloying graphics and talk of wealth redistribution.","filename":"data/vaneerConsumption/ObamaEndorsesWealthRedistributioninNewVoxInterview.json","image_url":"https://media.breitbart.com/media/2015/01/AP748496654624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_08__1540935981.html","title":"Obama Endorses Wealth Redistribution in New Vox Interview","title_page":"Obama Endorses Wealth Redistribution in New Vox Interview","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama visited Vox.com’s Ezra Klein to talk about the state of the nation, and the result is a video replete with cloying graphics, cutesy mood music, and talk of wealth redistribution.\nThe video appeared on Vox’s Facebook page over the weekend and is called “an excerpt” of Obama’s conversation, which Vox promises will debut on Monday.\nFirst of all, it is clear that the video of the President’s responses to Klein is heavily edited. Whether to cut out dead spaces, to cut Obama’s “uhs” and “ums,” to shorten it as much as possible, or to actually cut out content is hard to say at this point. We’ll need to see the full video interview to say just what was cut.\nThe clip is also full of distracting little graphics. In some cases, icons appearing on screen, in others, news stories appear over the President as he speaks and are quite intrusive.\nBut besides the editing and the annoying graphics, it is important not to lose what the President is actually saying in this clip. In fact, he is endorsing the communist ideal of wealth redistribution.\nAfter Obama rambles a bit about the history of capitalism and business, Klein asks Obama, “Does this put us in a place long-term where redistribution becomes, in a sense, a positive good in and of itself.”\nObama’s reply right off the top? “That’s always been the case.” Clearly Obama feels that government-controlled wealth redistribution has always been a positive good.\nFrom there, Obama went back into his “you didn’t build that” narrative where government is the key to all prosperity and the business sector is an evil that needs to have its freedom seriously curtailed by the iron boot heel of government.\nThis except shows that Obama’s interview will be yet another full-frontal attack on business and an attempt at class warfare.\nNot to be outdone, BuzzFeed has also announced that it will have a little sit down time with Obama coming up on Tuesday.\nOne wonders just when Obama will sit down with a conservative Internet-based outfit?\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2015/02/08/obama-endorses-wealth-redistribution-in-vox-interview/"}
