{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 02:09:59","date_modify":"2018-10-23 02:09:59","date_publish":"2016-01-28 16:58:11","description":"Lindsey M. Adams, 29, from Chicago, met with Dr. Younan Nowzaradan, a Houston-based surgeon specializing in weight loss, to have the sagging layers of skin that hung from her body removed.","filename":"data/vaneerConsumption/ObesewomanhasNINEsurgeriestoremoveexcessskinafterweightloss.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB5F2700000578-0-image-a-132_1453996673776.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421060_My-breasts-belly-button-Obese-woman-shed-140lbs-NINE-surgeries-remove-20lbs-excess-skin-finally-free-obesity_1540260599.html","title":"Obese woman has NINE surgeries to remove excess skin after weight loss","title_page":"Obese woman has NINE surgeries to remove excess skin after weight loss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who struggled with the excess skin left on her body after her 140lb weight loss has undergone nine surgeries to have 20lbs of the unsightly rolls removed.\nOn Wednesday night's episode of TLC series Skin Tight, Lindsey M. Adams, 29, from Chicago, met with Dr. Younan Nowzaradan, a Houston-based surgeon specializing in weight loss, to have the sagging layers of skin that hung from her thighs, arms, and stomach removed.\n'I want to look like what I worked for,' she explained.\nScroll down for video\nAmazing transformation: Lindsey M. Adams, 29, from Chicago, weighed over 300lbs (L) before she shed 140lbs (R) over the course of two and half years\nSecret shame: After her weight loss, Lindsey was left with sagging skin on her stomach that wouldn't go away naturally\nTotally different: Lindsey chronicled her nine skin removal procedures on TLC reality series Skin Tight. Lindsey's stomach is pictured after her surgery\nThe spokesperson and blogger lost 140lbs naturally of the course of two and half years after struggling with obesity for nearly her entire life, chronicling her weight loss journey on her eponymous YouTube channel.\nHowever, after reaching her weight loss goal Lindsey was left with layers of skin that she confused with fat.\n'When I looked at it then, I was naive. I kept thinking that it was fat. Fat rolls like I’d always had. I kept thinking, \"It’s going to go away,\"' she told Madame Noire.\nLindsey explained that the excess skin was her secret shame, noting that she wasn't even comfortable talking about it until she signed up for Skin Tight.\nUnexpected feelings: Lindsey admitted that she wasn't prepared for the process to be 'so emotional and overwhelming'\nStartling discovery: Lindsey, who can be seen standing on the scale, was shocked to learn that she was gaining weight while recovering at her parents' home in Virginia Beach\nMotivated: Lindsey said at the time that her body didn't look like what she expected it to after her surgery (L). Knowing that she didn't want to go back to being obese, she started eating healthier and working out again (R)\n'Because with my breasts down to my belly button and my arms sagging and I can’t even wear a short swimsuit, it was hard,' she recalled. 'I had been a plus-sized fashion blogger for years. But all these great crop-top swimsuits couldn’t be a reality for me.\n'Even the plus-size bloggers who were just big, their skin was tight, so they could wear stuff I couldn’t. So here I am in between getting rid of the morbidly obese girl, but looking like a distorted girl.'\nDuring last night's episode of the show, Lindsey had a total of nine procedures to remove and tighten the flabby skin on her body.\nHowever, while Lindsey was recovering from one of her surgeries at her parents' house in Virginia Beach, she was surprised to be struggling with her emotions.\nHard to handle: Lindsey, who is pictured before and after her weight loss, said the excess skin on her body stopped her from wearing a lot of the clothes she liked\nSharing her story: Lindsey posted photos of her legs before her procedure (L) and six weeks after her second thigh surgery (R) on her Facebook page\nNo definition: Lindsey can be seen pulling on the excess skin on her arm before her life-changing surgery\nFlexing her muscles: After her skin removal surgeries, Lindsey's skin no longer hangs from her bicep\n'This whole process has been so emotional and overwhelming. I wasn't prepared for it,' she explained.\nLindsey, who was about 310lbs when she started her weight loss journey, found herself gaining weight after the skin removal procedures that she so desperately wanted.\nWhen she got on the scale and saw that she weighed 204.8lbs, she realized she needed to get back on track.\n'I've gained weight and I've reverted back to my old ways,' she told the cameras. 'I allowed myself to have comfort foods, but I don't want to become that 300lb person again.\nTotally different: Lindsey shared photos of herself from behind before her weight loss (L) and after (R)\nWhat a difference: Lindsey even suffered from excess skin on her back after her weight loss (L). Her back is pictured after her surgery (R)\nNot as confident: Before her surgery, Lindsey said she couldn't even wear a swimsuit because her breasts were down to her belly button and her arms were sagging (L). Lindsey's torso is pictured after surgery (R)\nNew woman: Lindsey also shared before (L) and after (R) photos of her body from the side\n'I am swollen and I don't look like anything I imagined in my mind. Something needs to change. It is time for me to get back to eating healthy and working out.\n'When I was losing all the weight before I needed motivation. I need that motivation again. I need my friends and support group who were so important to me in Chicago. I have come too far to let all of my hard work go to waste.'\nLindsey managed to get back on track, and she proudly shared photos before and after photos of her body on Facebook following her procedures.","url":"https://www.dailymail.co.uk/femail/article-3421060/My-breasts-belly-button-Obese-woman-shed-140lbs-NINE-surgeries-remove-20lbs-excess-skin-finally-free-obesity.html"}
