{"authors":["Emily Hodgkin For Mailonline"],"date_download":"2018-10-23 01:03:26","date_modify":"2018-10-23 01:03:26","date_publish":"2016-01-29 14:46:53","description":"Jason Sims, 21, from Penzance, Cornwall ate six fast food meals a day while suffering with depression. However after the warning from doctors he overhauled his diet and slimmed to 14 stone.","filename":"data/vaneerConsumption/ObeseJasonSimswhoatesixtakeawaysaDAYloseshalfhisbodyweight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2D38300000578-0-image-a-4_1454077017854.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422631_A-25-stone-man-ate-six-takeaways-DAY-loses-half-body-weight-doctors-warned-just-months-live_1540256606.html","title":"Obese Jason Sims who ate six takeaways a DAY loses half his body weight","title_page":"Obese Jason Sims who ate six takeaways a DAY loses half his body weight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fast-food addict, who was told he would die because of his unhealthy ways, wrote a bucket list before overhauling his lifestyle and losing eleven stone.\nJason Sims, 21, from Penzance, Cornwall, ballooned to 25 stone after gorging on up to six fast food meals a day while suffering with depression.\nHe was warned by medical professionals that his liver was not functioning properly and he would die within six months if he continued to binge on junk food.\nJason Sims, 21, from Penzance, Cornwall who ate up to six fast food meals a day and weighed 25 stone has lost almost half his body weight after doctors warned he could die within six months\nHe even wrote himself a bucket list that involved meeting celebrities and visiting America.\nBut after opening up to his 16-year-old sister Kerry two months later, the shock of what he was doing to his body hit home - and he kick-started his remarkable transformation.\nHe has now slimmed to just 14 stone after swapping junk food for a fresh, healthy diet - and has even started wearing skinny jeans.\nJason, said: 'I was going through a very tricky stage of my life whilst suffering from chronic depression, the difficulty of it led me to comfort eat.\n'At one point I was eating up to five or six fast food meals a day. I was in a really dark place, but eventually my sister found out - there was an explosion of words and then we did something about it.'\nJason says the turning point was being told by his doctor that his liver was not functioning to capacity when his weight reached 25 stone at the end of 2014.\nWhen Jason reached 25 stone, left, doctors warned his liver was not functioning properly. Jason wrote a bucket list that included travelling to America and meeting celebrities like Barry Gibb and Ellen DeGeneres\nHe ditched the fast food for a variety of vegetables, including sweet potatoes, and started going on long brisk walks.\nHe added: 'I was not a fan of the gym, so I preferred to exercise in private, I was also on medication that aided the weight I lost, the rest was all down to diet and hard work.\n'Kerry has helped me a great deal, she has been a rock. She was the one who told my \"you're fat, you need to do something fast\" and then stood by me after I told her what the hospital told me.'\nJason came off his anti-depressants last June and says he's now a completely different person in body and soul.\nHis sister Kerry said: 'It was very scary at the time, but I am so proud of him now - I hardly recognise him sometimes, especially when he comes in wearing skinny jeans, it's just unbelievable.\n'Since we first talked about Jason's problem we have really opened up as brother and sister; to find out my brother, best friend and my port of call could die was a massive shock.'\nHe eventually overhauled his diet and started going on long brisk walks. He now weighs 14 stone and even wears skinny jeans. He credit his sister, Kerry, above, for motivating him through his weight loss journey\nJason is very keen to help others with similar problems and believes he can support and guide people in the right direction.\nHis bucket list that he assembled before his weight lost journey included meeting celebrities like Barry Gibb and Ellen DeGeneres.\nAnother aspiration was to do a skydive, although he discovered he had to weigh less than 16 stone to go through with it.\nHe is now eligible and is planning to do a tandem-dive with Kerry to raise money for different charities.\nKerry is raising money for Multiple sclerosis in memory of her best friend's late grandmother while Jason is jumping for Motor Neurone Disease Association after the condition killed their grandfather.\nJason said he fully intends to maintain his new healthy lifestyle in the future.\nHe said: 'I never used to look in the mirror, now I am so vain I look at least four times a day.\n'I want to build on this now and enter phase two of my transformation.","url":"https://www.dailymail.co.uk/femail/article-3422631/A-25-stone-man-ate-six-takeaways-DAY-loses-half-body-weight-doctors-warned-just-months-live.html"}
