{"authors":["Martha Cliff For Mailonline"],"date_download":"2018-10-23 01:28:00","date_modify":"2018-10-23 01:28:00","date_publish":"2017-03-10 09:42:06","description":"Eva Warne, 23, who lives in Cork, Ireland, ballooned to 18st 4lbs thanks to her habit of Chinese takeaways but after joining a slimming club she has lost seven stone as well as dropping four dress sizes.","filename":"data/vaneerConsumption/Obesewomandrops7stafterbeingcomparedtoarhino.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21FD9800000578-0-image-a-32_1489138923375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300498_Obese-woman-drops-7st-compared-rhino_1540258080.html","title":"Obese woman drops 7st after being compared to a rhino","title_page":"Obese woman drops 7st after being compared to a rhino | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An obese woman has dropped over seven stone after a stranger compared her to a charging rhino after they saw her running to catch a tram.\nEva Warne, 23, who lives in Cork, Ireland, weighed in at 18st 4lbs after her addiction to Chinese takeaways left her piling on the pounds.\nDue to her bulging waistline, Eva struggled to find clothes to fit her size 20 frame and with a BMI of 40 she was classed as obese.\nEva Warne dropped seven stone after strangers compared her to a rhino charging when she was running for a train. Pictured: Eva before weight loss (left) and Eva now (right)\nBut after overhearing someone say she looked like a charging rhino while running for a tram in Manchester, Eva finally found the motivation she needed and lost 7st 4lbs and now wears a slim size 12.\nPre school teacher Eva said: 'I couldn't believe how big I had let myself get, it was humiliating.\n'I was running for a tram in Manchester when I heard a stranger say that I looked like the charging rhino from the film Jumanji.\nEva blames her weight gain on her addiction to Chinese takeaways often eating her mums home cooked meals before ordering a delivery\nThe pre-school teacher says that she struggled to find clothes that fit and even found herself becoming warn out in work\n'I had always felt uncomfortable, I was always the bigger friend and I struggled to find clothes that fit me.\n'But after that incident I was completely mortified and that's when I knew I needed to make a change.'\nEva admits that she had let her habit for ordering Chinese takeaways get out of hand.\nShe continued: 'I had got into some really bad eating habits and I would binge on takeaway most nights.\nShortly after her 21st birthday Eva joined slimming world and two years on is at her goal weight of 11st\nShe says she still enjoys the odd takeaway treat but orders healthier options where she can\n'My mum would cook healthy meals but they would never fill me up and later on in the evening I would order a Chinese or kebab and chips.\n'My size even affected me at work, I was constantly tired from carrying the children in the crèche and I became out of breath while playing with the bigger kids.\n'But after ditching the takeaways the weight soon started to fall off and it felt amazing to finally reach my goal weight of 11 stone.'\nEva admits that for as long as she can remember she had always been bigger than the other girls her age.\nShe says she now feels 'amazing' thanks to her new figure\nShe added: 'When I hit 18 I weighed 15st and then the weight really piled on, over the next two years I gained a further three stone.\n'I was constantly out drinking with friends, and I hit a rough patch and became depressed so started comfort eating, it was a vicious cycle.\n'On my 21st birthday, I had arranged a joint night out with a friends whose birthday was close to mine, but I couldn't find a dress that fit me.\n'I couldn't be stylish like the other girls as I couldn't fit into clothes from Topshop or River Island.\n'I had to shop in the plus size sections in Debenhams and could just about squeeze myself into the biggest sizes in Primark.\n'I felt awful and it really upset me, I let my friend take the limelight all night and I refused to get in any photos.'\nBut after she suffered the cruel jibes from strangers, not long after her 21st birthday, she joined Slimming world.\nEva said: 'I had tried other diets in the past but nothing ever seemed to work.\n'I was really nervous at first but my consultant was really welcoming, and the group meetings really helped as I was no longer struggling by myself.\n'I reached my target weight of 11st 2lbs, which felt amazing.\n'I still enjoy a takeaway as a treat every now and then, but instead of ordering everything off the menu I make healthier choices.'\nEVA'S DIET BEFORE Breakfast - nothing Snacks - cream scone Lunch - toasted sandwich and chips Dinner - Chinese takeaway or kebab and chips Snacks - chocolate","url":"https://www.dailymail.co.uk/femail/article-4300498/Obese-woman-drops-7st-compared-rhino.html"}
