{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 04:06:03","date_modify":"2018-10-23 04:06:03","date_publish":"2017-03-16 15:14:37","description":"James King, 46, from Paducah, Kentucky, documented his weight loss journey on the TLC reality series on My 600lb Life. However, he ended up gaining weight, going from 735lbs to 843lbs.","filename":"data/vaneerConsumption/Obesemanputson158lbsinfourmonthstoweigh843lbs.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54A98800000578-0-image-a-30_1489675214720.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320086_Obese-man-puts-158lbs-four-months-weigh-843lbs_1540267563.html","title":"Obese man puts on 158lbs in four months to weigh 843lbs","title_page":"Obese man puts on 158lbs in four months to weigh 843lbs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A morbidly obese man who weighed nearly 800lbs ended up gaining weight after his father remortgaged his house to help pay for his treatment.\nJames King, 46, from Paducah, Kentucky, documented his weight loss journey on the TLC reality series on My 600lb Life, and while many of the show's participants have lost incredible amounts of weight, he went from 735lbs to 843lbs before getting down to 786lbs.\nAt the start of the episode, the father had been bedridden for three years, and he suffered from an extreme case of cellulitis — a common, yet potentially serious bacterial skin infection that appears as a swollen, red area of skin.\nScroll down for video\nSeeking help: James, 46, from Paducah, Kentucky, documented his weight loss story on Wednesday night's episode of the TLC series My 600lb Life\nUnable to move: At the start of the episode, the father had been bedridden for three years, and he suffered from an extreme case of cellulitis on his legs\nAddiction: James was unable to move his legs, let alone stand, but he refused to stop eating the fast-food that he craved\nJames' overeating spiraled out of control when he was a young teen following the death of his hard-drinking mother, and when he was 20, he started a relationship with his neighbor Lisa.\n'She lived just two houses down from mine, and she was married with four kids, but her husband was very abusive. We started to get closer, and we had an affair,' he explained.\nLisa said the affair really began when she found herself crying on his porch. While James was comforting her, he reached over and kissed her on the cheek.\n'We eventually fell in love with each other. My weight was never a factor. She loved me for who I was, and we would go do things all the time,' James recalled.\nPast traumas: James' overeating spiraled out of control when he was a young teen following the death of his hard-drinking mother\nFalling in love: When he was 20, James started having an affair with Lisa, mother-of-four who was married to an abusive husband\nHowever, Lisa noted that when they started dating, he was still very active and was always riding his ATV and fishing with her children.\nOver the course of their relationship, Lisa got pregnant with their children Austin and then Bayley, but James was unable to raise them because she was still married to her husband at the time.\n'I tried to stay in my kids' lives even though they didn't know I was there father,' he said.\nBy the time he was 30, he weighed 540lbs. Two years later, Lisa separated from her husband, and they were finally able to live as a family.\nOngoing struggle: Lisa and James had two kids, Austin and Bayley, but he was unable to father them because she was still married. By the time he was 30, he weighed 540lbs\nAddiction: Lisa ended up leaving her husband, and while he was happy that they were finally able to be a family, he still continued to eat\nTrapped: James became bedridden after he injured his ankle, and he admitted he wasn't sure if it healed because that was the last time had put weight on it\n'Even though that was a happy time for me, I didn't stop with how much I was eating, so I was still getting bigger,' he noted.\nJames' father Don told the camera that he tried to talk to his son about his weight, but it didn't do any good.\n'I was still getting bigger. But things got worse when I was 42 because I fell, and I was so big, the fire department had to come and get me up,' James said. 'It was one of the lowest moments in my life.\n'And I hurt my ankle really bad, and I had to stay in the bed and rest. But I'm not even sure if it ever healed because that's the last time I put weight on it, and that's when I became bed bound.'\nTeam effort: Lisa had to enlist others to help move James so she could clean him and his bed sheets\nDoting dad: James' father Don remortgaged his home, so he could pay for an ambulance to transport his son to Houston, Texas, to meet with Dr. Younan Nowzaradan\nHelpless: It took a team of firemen to lift James out of bed and into an ambulance\nSerious health concern: When James arrived at the hospital in Houston, he learned that he weighed 735lbs. Dr. Nowzaradan was furious that he hadn't lost any weight\nJames was physically unable to make the journey to Houston to meet with weight loss surgeon Dr. Younan Nowzaradan, so the doctor advised him to lose 150lbs on his own.\nHe was so large that he needed an ambulance to take him on the 13 hour drive, but his insurance company refused to pay for it.\nJames and Lisa set up an online campaign to front the cost, but after that failed, his father selflessly remortgaged his home to pay for the transportation.\nA group of firemen had to help lift James out of his home, and when he arrived in Houston, he learned that he weighed 735lbs.\nDr. Nowzaradan was furious that James barely lost any weight on his own, and he partially blamed Lisa for enabling him.\nJames had to stay in the hospital for a month, and he lost 50lbs before he was allowed to go home. However, he was rushed back to the hospital after he became ill, and it was confirmed that he had congestive heart failure.\nLife-threatening: After he lost 50lbs and left the hospital, he was rushed back because he was suffering from congestive heart failure. However, he still refused to change his diet\nHouse call: Dr. Nowzaradan showed up at James' home after he missed his appointment, and he readmitted him into the hospital because it was clear that he had gained weight\nHeavier than ever: James had put on 158lbs over the course of just four months\nFailure: Although he got down to 786lbs, he still ended up being 51lbs heavier than he was when he first vowed to lose weight\nAlthough he was able to pull through and return home 10 days later, he still didn't change his eating habits, and Lisa continued to get him the fast-food he craved.\nAfter he missed his appointment with the surgeon, Dr. Nowzaradan went to visit him at home, and it was apparent that he had not lost any weight.\nJames was admitted to the hospital for a third time, and it was revealed that he weighed 843lbs, puttiing on a whopping 158lbs in just four months.\nDuring his hospital stay, he was put on a diet of 800 calories per day, and got back down to 786lbs.\nDespite everything he went through, James ended up being 51lbs heavier than he was when he first vowed to lose weight.","url":"https://www.dailymail.co.uk/femail/article-4320086/Obese-man-puts-158lbs-four-months-weigh-843lbs.html"}
