{"authors":["Ben Moshinsky"],"date_download":"2018-10-31 00:16:12","date_modify":"2018-10-31 00:16:12","date_publish":"2016-12-02 00:00:00","description":"The number of people earning more than £150,000 is forecast to grow from 329,000 this year to 469,000 in 2021-22.","filename":"data/vaneerConsumption/OBRreportonadditionalrateoftaxtofundBrexitgap.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_obr-report-on-additional-rate-of-tax-to-fund-brexit-gap-2016-12_1540944972.html","title":"OBR report on additional rate of tax to fund Brexit gap","title_page":"    OBR report on additional rate of tax to fund Brexit gap - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain's Chancellor of the Exchequer Philip Hammond reads through his Autumn Statement as he poses for a photograph in his office in 11 Downing Street, London, Britain November 22, 2016. Reuters/Stefan Rousseau The government is relying on wage increases for top earners as it seeks to balance the books after Brexit.\nAccording to figures from the Office for Budgetary Responsibility, the number of people earning more than £150,000 ($189,452) will grow from 329,000 this year to 469,000 in 2021-22.\nThe proportion of taxpayers paying the top rate will increase from 1.1% to 1.5%, under the forecasts.\nThe government is seeking a 24% increase in income tax receipts during this time, of which half will come from the extra 140,000 people paying the top rate of tax.\nAnother quarter of that rise will be shouldered by higher rate tax payers earning more than £43,000. They will \"rise in number from 4.4 million in 2016-17 to 4.6 million in 2021-21 (from 14.5% to 14.8% of taxpayers),\" the OBR said in figures released last week.\nA lot rides on the government's ability to boost its tax income, with spending set to rise to cushion any potential economic hit from leaving the European Union. The OBR said that growth is set to slow during this parliament as a result of Brexit uncertainty, costing Britain an additional £58.7 billion.\nMeanwhile Chancellor Philip Hammond announced a £23 billion spend on infrastructure and innovation projects during his Autumn statement on November 23.\nBritain's productivity gap is \"shocking,\" the chancellor told the House of Commons at the time, noting that the country lags the USA and Germany by 30 points.","url":"https://www.businessinsider.com/obr-report-on-additional-rate-of-tax-to-fund-brexit-gap-2016-12"}
