{"authors":[],"date_download":"2018-10-22 21:00:54","date_modify":"2018-10-22 21:00:54","date_publish":"2014-05-05 15:33:38","description":"Oculus VR is strongly denying claims that its most famous employee, John Carmack, stole intellectual property from his former employer.","filename":"data/vaneerConsumption/OculusVRSlamsClaimsofIPTheftAsFalseandDisappointing.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_17/395386/140423-facebook-oculus-1138_280c83e2f22b33b2333a1d40932faee9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_video-games_oculus-vr-slams-claims-ip-theft-false-disappointing-n97296_1540242054.html","title":"Oculus VR Slams Claims of IP Theft As 'False' and 'Disappointing'","title_page":"Oculus VR Slams Claims of IP Theft As 'False' and 'Disappointing'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Oculus reignited the fight on Monday, when it sent a statement to media outlets saying it is \"disappointed but not surprised by ZeniMax’s actions and we will prove that all of its claims are false.\"\nOculus also included seven bullet points to \"clarify\" ZeniMax's claims.\n\"There is not a line of ZeniMax code or any of its technology in any Oculus products,\" Oculus said, and the company denied that Carmack took ZeniMax's intellectual property.\nZeniMax -- a Maryland-based firm known for games including \"The Elder Scrolls\" franchise -- declined to comment beyond the statement it made last week, in which the company said it \"will take the necessary action to protect its interests.\"\nIn Oculus' statement on Monday, the company also said ZeniMax \"has never identified any 'stolen' code or technology,\" even though Oculus' source code is publicly available online.\nOculus disputed details of contracts and other items ZeniMax described in its accusation, and made its own claims against ZeniMax.\nAccording to Oculus' statement, ZeniMax pulled plans for a virtual-reality version of \"Doom 3\" -- the famed video-game franchise that Carmack created -- after Oculus refused to hand over an equity stake to ZeniMax over previous claims made in 2012.","url":"https://www.nbcnews.com/tech/video-games/oculus-vr-slams-claims-ip-theft-false-disappointing-n97296"}
