{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-23 00:42:12","date_modify":"2018-10-23 00:42:12","date_publish":"2016-01-11 10:15:43","description":"Speaking at last week's Consumer Electronics Show in Las Vegas, Oculus boss Brendan Iribe (pictured) said: 'We made it as close to the cost of the hardware as possible. The margin is razor-thin.'","filename":"data/vaneerConsumption/OculusbossrendanIribedefendstheRifts600pricetag.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/30074EC000000578-0-image-a-9_1452507230679.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393626_Oculus-boss-defends-Rift-s-600-price-tag-Brendan-Iribe-claims-costs-high-device-expensive-make_1540255332.html","title":"Oculus boss rendan Iribe defends the Rift's $600 price tag","title_page":"Oculus boss rendan Iribe defends the Rift's $600 price tag | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In recent months, price estimates for Facebook's Oculus Rift ranged from the relatively cheap $350 right up to $1,500, so when the official price tag was announced last week, it divided opinion.\nMany were relieved that, at $600, the headset is more than half the most expensive prediction, while others accused the firm for targeting only the high-end of the market.\nNow Oculus' chief executive has defended the headset's price and revealed the company has a 'razor-thin' margin to make the device as affordable as possible.\nScroll down for video\nOculus' chief executive Brendan Iribe (pictured) has defended the headset's price and revealed the company has a 'razor-thin' margin to make the device as affordable as possible\nOculus opened pre-orders for the VR headset on 6 January.\nThe $599 headset will be delivered to the first customers in March, although the first wave sold out on the firm's website in seconds, and was quickly changed to show an April delivery date.\nIt will also require most users to buy a new high-end gaming PC, and experts claim only 1 per cent of machines currently on the market are powerful enough to 'drive' the headset.\nThe Rift will additionally be available in limited locations at select retailers starting in April.\nOCULUS RIFT SPECS The latest design of the Oculus Rift headset is described as 'really lightweight'. It has a built-in strap, and headphones to create a 3D audio effect. The firm has partnered with Microsoft for the gadget, and as a result it will use its Xbox One controller. As part of this partnership, the Rift will be able to stream Xbox One games to the Rift, Microsoft's Phil Spencer recently said. Oculus opened pre-orders for the VR headset on 6 January. The $599 headset will be delivered to the first customers in March, although the first wave sold out on the firm's website in seconds, and was quickly changed to show an April delivery date.\nBundles that include an Oculus Ready PC and a Rift will be available for pre-order in February starting at $1,499.\nSpeaking to The Washington Post at last week's Consumer Electronics Show, Oculus boss Brendan Iribe explained: 'We made it as close to the cost of the hardware as possible. The margin is razor-thin.'\nHe added that, in the first instance, Oculus is looking to break even with sales of the highly-anticipated gadget.\nIt follows on from reports that Samsung's PlayStation VR rival will cost in the region of $800.\nA listing, which appeared to have been posted by accident on Amazon's Canada site, revealed the PlayStation VR will cost $1,125 CAD, which converts to $800 USD or £770.\nThe page was spotted by Forbes, and the price has since been removed.\nSony said in a statement: 'This was an error by Amazon, we haven't announced a price for PlayStation VR.'\nOculus opened pre-orders for the VR headset (pictured) on 6 January. The $599 headset will be delivered to the first customers in March, although the first wave sold out on the firm's website in seconds, and was quickly changed to show an April delivery date\nSpeaking at last week's Consumer Electronics Show, Mr Iribe explained: 'We made [the price] as close to the cost of the hardware as possible. The margin is razor-thin.' He added that, in the first instance, Oculus is looking to break even with sales of the highly-anticipated gadget\nThe latest design of the Oculus Rift headset is described as 'really lightweight'. It has a built-in strap, and headphones to create a 3D audio effect. The firm has partnered with Microsoft for the gadget, and it will use its Xbox One controller (pictured)\nHowever, it is not clear if this means that the posting of the listing was an error, or the price shown on the listing was the mistake the statement refers to.\nElsewhere, the long-term health effects of virtual reality have recently come into question.\nDonning the headset can cause nausea, eyestrain and headaches, for example.\nHeadset makers don't recommend their devices for children, and Samsung and Oculus urge adults to take at least 10-minute breaks every half-hour, and they warn against driving, riding a bike or operating machinery if the user feels odd after a session.\nStanford University professor Jeremy Bailenson told the Wall Street Journal his 15 years of research consistently have shown virtual reality can change how a user thinks and behaves, in part because it is so realistic.\n'We shouldn't fathom this as a media experience; we should fathom it as an experience,' said Professor Bailenson, who also co-founded Strivr Labs, which helps football players relive practice in virtual reality.\nThe latest design of the Oculus Rift headset is described as 'really lightweight'. It has a built-in strap, and headphones to create a 3D audio effect.\nThe firm has partnered with Microsoft for the gadget, and as a result it will use its Xbox One controller.\nAs part of this partnership, the Rift will be able to stream Xbox One games to the Rift, Microsoft's Phil Spencer recently said.","url":"https://www.dailymail.co.uk/sciencetech/article-3393626/Oculus-boss-defends-Rift-s-600-price-tag-Brendan-Iribe-claims-costs-high-device-expensive-make.html"}
