{"authors":[],"date_download":"2018-10-22 21:50:51","date_modify":"2018-10-22 21:50:51","date_publish":"2014-05-08 16:26:20","description":"Finally, a 3-D flight simulator that answers the question, \"What does it feel like to be a bird?\"","filename":"data/vaneerConsumption/OculusRiftFlightSimulatorisFortheBirds.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/429456/flying_913ea1d086a89d59f7b9549ae52c1bd3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_oculus-rift-flight-simulator-birds-n100471_1540245051.html","title":"Oculus Rift Flight Simulator is For the Birds","title_page":"Oculus Rift Flight Simulator is For the Birds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBirdly is looking to change the definition of “flight simulator.”\nThe Zurich-based team created an installation meant to recreate the experience of flying for the Oculus Rift. Unlike, say, Microsoft Flight Simulator, this software wants to capture the feeling of actually moving through the sky like a bird.\nApparently, the 3-D environments created for the Oculus Rift were not immersive enough. This contraption features sensors that record “wing” movements, a fan to simulate headwind, and even an “olfactoric feedback” system that releases different scents depending on the scenery below.\nSince being bought by Facebook in March for $2 billion, Oculus VR’s virtual reality hardware has been used to do everything from drive tanks to walk around the starship from \"Star Trek: Voyager.\"\nBirdly currently runs one simulation, called Red Kite, named after the bird of prey. Perhaps in the future developers will create 3-D programs that let users:\nPlay an incredibly tiring version of “Flappy Bird.” Experience bird-watching from the bird's point of view, because boredom helps build character. Listen to R. Kelly’s “I Believe I Can Fly” ... like it has never been listened to before\nWhile not commercially available, anybody can buy the latest Oculus Rift development kit for $350. Sadly, Birdly is not likely to show up in stores anytime soon.","url":"https://www.nbcnews.com/tech/innovation/oculus-rift-flight-simulator-birds-n100471"}
