{"authors":[],"date_download":"2018-10-22 20:52:12","date_modify":"2018-10-22 20:52:12","date_publish":"2016-01-28 04:50:41","description":"More than 30 OECD countries signed an agreement to share information about multinationals in a push to boost transparency following public anger over large c...","filename":"data/vaneerConsumption/OECDcountriesagreetoshareinfotocombatcorporatetaxavoidance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5ag-2vdWmEltwXfba0ce28e63241702a-428_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420380_OECD-countries-agree-share-info-combat-corporate-tax-avoidance_1540241532.html","title":"OECD countries agree to share info to combat corporate tax avoidance","title_page":"OECD countries agree to share info to combat corporate tax avoidance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"OECD countries agree to share info to combat corporate tax avoidance\nMore than 30 OECD countries signed an agreement to share information about multinationals in a push to boost transparency following public anger over large corporations playing the system to lower their tax bills.\nUnder the new rules, multinationals will have to report country by country how much they make and what they pay in taxes.\nThe move is aimed at stopping firms from using complicated loopholes or moving money across borders to minimise or avoid paying corporate tax.\nUnder the new rules, multinationals will have to report country by country how much they make and what they pay in taxes ©Jean Ayissi (AFP/File)\nThe head of the OECD economic grouping, Angel Gurria, said the agreement was a move towards \"the goal of ensuring that companies pay their fair share of tax\".\n\"Country-by-country reporting will have an immediate impact in boosting international co-operation on tax issues, by enhancing the transparency of multinational enterprises' operations,\" he said in a statement.\nThe exchange of information will start in 2017 and give tax administrations \"a single, global picture\" on the activities of big businesses, he added.\nAustralia, Britain, Chile, France, Japan, Luxembourg, Mexico and Switzerland were among the 31 signatories.\nThe United States had yet to sign up to the accord but would do so in the near future, the OECD said.\nThe proposals are part of a 15-point OECD package agreed by leaders at a G20 summit in Antalya, Turkey in November.\nThe OECD calculates that national governments lose $100-240 billion, or 4-10 percent of global tax revenues, every year because of the tax-minimising schemes of multinationals such as Apple, Facebook and Amazon.","url":"https://www.dailymail.co.uk/wires/afp/article-3420380/OECD-countries-agree-share-info-combat-corporate-tax-avoidance.html"}
