{"authors":[],"date_download":"2018-10-30 21:30:48","date_modify":"2018-10-30 21:30:48","date_publish":"2018-06-19 09:00:00","description":"Court's cake ruling, government's handling of immigrants' children test how we put Christianity into practice","filename":"data/vaneerConsumption/Ofcakesandchildren.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_Top_News_Politics_Stories/2018/06/19/Images/88e0950bb803451c9dc5baf1e67a9b8f.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_cakes-children-and-christ-moral-dilemmas-abound__1540935048.html","title":"Of cakes and children","title_page":"Of cakes and children — our moral dilemmas","title_rss":"NULL","source_domain":"ajc.com","text":"It’s understandable, given what’s happening at our nation’s borders, if you’ve forgotten the Masterpiece Cakeshop decision.\nNews these days seems to come in torrents with many important issues arising every day only to be forgotten because of new outrages.\nWe’d barely been able to digest the Supreme Court decision from earlier this month, when news of immigrant children being separated from their parents at the borders began to overshadow the issue.\nPresident Trump is pushing back against criticism of his administration's decision to prosecute anyone caught trying to cross the border illegally. That decision has forced border officials to separate children from parents.\nIf you need a reminder, the justices decided that if a gay couple asks you to create a cake celebrating their union, you can refuse them if you feel it violates your religious beliefs.\nCakes, children and, thanks now to Attorney General Jeff Sessions’ dim view of Scripture, Christ.\nWhat a mess!\nIf you’re bracing yourself for what’ll come next, join the club.\nBut make no mistake. Neither of these issues is likely to go away anytime soon nor should they be forgotten.\nRELATED | Justices side with Colorado baker on same-sex wedding cake\nWhile the court seized on statements made by members of the Colorado Civil Rights Commission that the majority said had shown hostility toward shop owner Jack Phillips’ religious beliefs, it completely skirted the deeper questions the case raised. What is religious belief? And what exactly does that look like in the public square?\nCraig Washington, a local gay activist, said the decision left him saddened and outraged. He called it a betrayal committed through cowardice.\n“This insidious middle-of-the-road, noncommittal ambivalence is a costly cowardice in the face of a very intentional focused and strategic conspiracy to repeal our rights and once again deem us as less than human,” Washington said. “Practicing discrimination in the name of (all things) religious freedom is the moral equivalent of hypocrisy. Where is that deafening and thunderous repudiation of hate from those who claim to love and believe in loving deities?”\nProtesters gather in front of the Supreme Court building last year on the day the court was scheduled to hear the case Masterpiece Cakeshop v. Colorado Civil Rights Commission in Washington, D.C. OLIVIER DOULIERY / ABACA PRESS / TNS (The Atlanta Journal-Constitution)\nCase Western Reserve University law professor Jonathan Entin said the decision focuses only on the particular facts of this case, “including the fact that the events leading to the filing of the complaint took place several years before the Supreme Court ruled in 2015 that the Constitution protects a right to same-sex marriage and that some members of the Colorado Civil Rights Commission expressed hostility to religion that might have infected the agency’s deliberations.”\nBut on the broader questions relating to the right of businesses to discriminate against gay couples, Entin said Justice Anthony Kennedy left that for future cases in the lower courts and perhaps in the Supreme Court itself.\nNeedless to say, those of us hoping for an end to the controversy didn’t get it.\nRELATED | His reason is questionable, but Gov. Deal did the right thing\nDavid Gowler, chair of Religion at Oxford College of Emory University, agreed.\n“It seems to me that the question involves whether sexual orientation should be seen as a civil right or whether the First Amendment’s ‘free exercise’ of religion takes precedence in this instance,” Gowler said. “If it were a matter of race, for example, the answer is clear: The baker could not discriminate.”\nDavid Gowler, chair of Religion at Oxford College of Emory University, says religious beliefs should not be considered legal justification for discrimination on the basis of race, ethnicity, gender, or sexual orientation. CONTRIBUTED (The Atlanta Journal-Constitution)\nThe religious question at the heart of the court’s bakery decision was whether religious beliefs can be used legally to justify discrimination.\nGowler’s answer?\n“Of course not,” he said. “Religious beliefs should not be considered legal justification for discrimination on the basis of race, ethnicity, gender, or sexual orientation.”\nWe’ll have to wait until another case reaches the court before we get a definitive answer.\nIf and when that happens, Entin said he expects the justices to be more closely divided than the 7-2 decision in the Colorado case.\n“Based on the court’s various opinions, six justices seem open to ruling against bakers in other cases with somewhat different facts,” Entin said. “The devil will be in the details, of course, but all of this strongly suggests that the Supreme Court has not given bakers of wedding cakes license to discriminate. And if that is correct, I think it very unlikely that any other business has gotten a license to discriminate, either.”\nLast Wednesday, in a speech at the Orthodox Union Advocacy Center’s Annual Leadership Mission in Washington, D.C. — a group that co-authored an amicus brief with other religious organizations in support of the baker, Sessions said, “There are plenty of other people who will bake that cake. Give me a break!”\nEven if what Sessions said is true, Entin said his position effectively undercuts all discrimination claims.\n“After all, there are plenty of other people who will hire a person who was rejected or fired on the basis of race or gender, and there are plenty of other people who will sell or rent a house or apartment to someone who was rejected on the basis of race or gender,” he said. “That reasoning suggests that we don’t need to have any civil rights laws.”\nRELATED | Laura Bush, Melania Trump speak out on separation of immigrant children, parents at border\nI guess in Sessions’ eyes, that makes discrimination all right.\nIt is not.\nDiscrimination isn’t just unethical, Gowler said. It’s immoral.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nThat, by the way, would describe what’s happening at our borders.\nGowler points to the Gospel of Matthew in which Jesus declares that giving hospitality to strangers is the same as extending hospitality to Jesus himself to explain.\nThe parable, he said, teaches that God will judge us on our hospitality, how we treat the “least of these” — the hungry, thirsty, stranger/immigrant, sick, ill-clothed, and imprisoned.\n“Since some scholars — incorrectly, in my view — interpret the ‘least of these’ as being Christians, it is important to note that the critical importance of these acts of hospitality is found throughout the teachings of Jesus,” Gowler said. “Hospitality, of course, is not exclusively a Christian virtue. But the dichotomy between the teachings of Jesus and the beliefs of some white evangelical Christians today about immigration is striking.”\nSessions got it wrong, but there is no mistaking what Jesus was teaching in Matthew and some 2,000 other Bible verses that demand protection and justice for those who are poor, oppressed or otherwise considered marginalized.\nIf you’re still having trouble with that, listen, please, to first lady Melania Trump: “We need to be a country that follows all laws, but also a country that governs with heart.”\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/cakes-children-and-christ-moral-dilemmas-abound/wJv2RtLslSVrMOmIfbkzSN/"}
