{"authors":[],"date_download":"2018-10-30 21:54:20","date_modify":"2018-10-30 21:54:20","date_publish":"2016-12-17 13:44:05","description":"An off-duty detective who was Christmas shopping caught a man who is wanted by the FBI for murder. Columbia County sheriff's detective Sgt.","filename":"data/vaneerConsumption/OffdutydetectivecatcheswantedFBIfelonwhileChristmas.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_off-duty-de_98210a345549f8d42de70ec24f99d4e4__1540936460.html","title":"Off-duty detective catches wanted FBI felon while Christmas...","title_page":"Off-duty detective catches wanted FBI felon while Christmas...","title_rss":"NULL","source_domain":"ajc.com","text":"An off-duty detective who was Christmas shopping caught a man who is wanted by the FBI for murder.\nColumbia County sheriff's detective Sgt. Don Meyer was shopping Thursday afternoon at the Lake City Mall when he saw someone whom he recognized from an FBI bulletin as Terrance Davis, 29.\nThe FBI alerted the Sheriff's Office Thursday morning to be on the lookout for Davis because he was wanted for murder in Las Vegas.\n>> Read more trending stories\nThe FBI was searching for Davis, who was believed to be in the Lake City area, the Columbia County Sheriff's Office said in a bulletin.\nMeyer called for assistance and asked undercover personnel from the drug task force to respond as he maintained surveillance of Davis, the Sheriff's Office said. Davis was taken into custody without incident after all the personnel arrived.\nIt is not clear if Davis knew someone in Columbia County or was just traveling through the area, the Sheriff's Office said.\nDavis is being held with no bond at the Columbia County Detention Facility on an out-of-state warrant for murder.\n“Sgt. Meyer's keen eye and the excellent relationship we have with our partnering agencies are responsible for this dangerous felon’s safe capture.” Sheriff Mark Hunter said. “This is a great example of the outstanding work done by your Sheriff’s Office daily.”","url":"https://www.ajc.com/news/crime--law/off-duty-detective-catches-wanted-fbi-felon-while-christmas-shopping/A6EhYtKI98Bulv0ssBwtpL/"}
