{"authors":["Rodney Thrash"],"date_download":"2018-10-30 20:13:49","date_modify":"2018-10-30 20:13:49","date_publish":"2015-03-13 12:10:00","description":"Hundreds of officers have arrived at World Changers Church International for the 1 p.m.","filename":"data/vaneerConsumption/OfficersarriveatsiteofslainFultonofficersfuneral.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/03/13/Images/WPIMAGE_cmgajcnews_2415.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_news_officers-arrive-site-slain-fulton-officer-funeral__1540930429.html","title":"Officers arrive at site of slain Fulton officer's funeral","title_page":"Officers arrive at site of slain Fulton officer's funeral","title_rss":"NULL","source_domain":"ajc.com","text":"Hundreds of officers have arrived at World Changers Church International for the 1 p.m. funeral of a Fulton County police detective shot and killed last week.\nOfficers from around the country were asked to gather at Turner Field at 10 a.m. Friday for an 11 a.m. processional to World Changers Church International on Burdett Road in College Park. Officers started arriving at the church just before noon.\nTerence Avery Green, 48, was on duty March 4 when he was killed in what a Fulton police assistant chief called an ambush-style attack.\nAmanuel Menghesha, the 42-year-old Fairburn man accused of shooting and killing Green, was booked March 5 into the Fulton County jail on murder and aggravated assault charges.\nBurial will follow at Forest Lawn Memorial Gardens in College Park.\nPrevious coverage:\n»Leave condolences for the family of Fulton police Det. Terence Avery Green\n»Photos: Remembering a fallen officer\n»Funeral Friday for Fulton officer killed in the line of duty\n»Memorial fund set up for sons of slain Fulton officer\n»Slain Fulton officer’s mother: It was way too soon for my baby\n»Fulton officer “died doing what he loved: protect and serve”\n»Terence Avery Green: 1966-2015","url":"https://www.ajc.com/blog/news/officers-arrive-site-slain-fulton-officer-funeral/zvphjYijxXSDovVOuBj9iJ/"}
