{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:35:26","date_modify":"2018-10-30 23:35:26","date_publish":"2016-12-06 00:00:00","description":null,"filename":"data/vaneerConsumption/OfficeoftheComptrolleroftheCurrencyproposesfintechcharterrequirements.json","image_url":"https://amp.businessinsider.com/images/5846e777ba6eb66d268b77cd-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_occ-proposes-fintech-charter-requirements-2016-12_1540942526.html","title":"Office of the Comptroller of the Currency proposes fintech charter requirements","title_page":"    Office of the Comptroller of the Currency proposes fintech charter requirements - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nThe Office of the Comptroller of the Currency (OCC) announced that it will begin considering applications from fintech companies to become licensed as \"special purpose\" national banks on Friday.\nSuccessful applicants would be authorized to operate nationally across the US, without the need to gather individual state licenses.\nIn addition, the regulator published an accompanying paper that outlines proposed \"baseline supervisory expectations\" applicants would have to meet to become chartered. The OCC is seeking public feedback on its decision and the accompanying paper until January 15, 2017.\nHere are some of the baseline supervisory expectations the OCC outlined last week:\nHaving a thorough business plan. The OCC will require fintech applicants to detail the exact products or services they will provide over the next three years, and precisely define potential customer bases. Moreover, the regulator demands that the business plans include concrete measures for promoting financial inclusion. Having to define exact products from the start will likely pose a challenge for most fintechs, as these companies tend to develop products iteratively after launch, and the OCC's requirements may hinder their fundamental working culture. The OCC also expects the business plans to include detailed recovery and exit strategies to cover both best- and worst-case scenarios.\nCarefully planned governance structure. The OCC stipulates that a fintech's governance structure should correspond to the risk and complexity of its products and services. And the regulator advocates that a company's board of directors take a prominent and active governance role. This is likely partly a response to high-profile management scandals at fintechs including Lending Club and Zenefits, after which both companies' CEOs were forced to resign.\nSufficient capital and liquidity. The OCC will require applicants to maintain enough capital and liquidity to ensure business continuity across a range of circumstances, though it is prepared to consider the specific requirements on an individual basis. The regulator will demand that fintechs be able to account for variations in interest rates and market conditions. This is likely a push to stop fintechs from relying solely on uncertain VC funding, and to encourage them to focus instead on monetization strategies that will guarantee steady revenue streams.\nCompliance risk management. The regulator will require fintechs to demonstrate that they have a compliance system in place that enables them to meet existing OCC regulations for federal financial institutions. However, the OCC may allow exceptions on a case-by-case basis if a fintech can demonstrate that this will not harm consumers and that the change is essential for its business model to work.","url":"https://www.businessinsider.com/occ-proposes-fintech-charter-requirements-2016-12"}
