{"authors":["Associated Press"],"date_download":"2018-10-22 20:35:44","date_modify":"2018-10-22 20:35:44","date_publish":"2016-01-29 02:22:10","description":"TRENTON, N.J. (AP) — Sonic booms heard and felt along the eastern shoreline were caused by military fighter jets conducting tests, officials said. An F-35C, ...","filename":"data/vaneerConsumption/OfficialFighterjetscausedsonicboomsalongcoast.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421749_Sonic-boom-not-earthquake-caused-shaking-loud-noise_1540240544.html","title":"Official: Fighter jets caused sonic booms along coast","title_page":"Official: Fighter jets caused sonic booms along coast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Official: Fighter jets caused sonic booms along coast\nTRENTON, N.J. (AP) — Sonic booms heard and felt along the eastern shoreline were caused by military fighter jets conducting tests, officials said.\nAn F-35C, which has a top speed of nearly 1,200 mph, and an F-18 from Naval Air Station Patuxent River in Maryland were conducting supersonic testing off the coast Thursday afternoon, according to a Navy spokeswoman.\nResidents reported hearing loud booms and feeling the ground and buildings shake from New Jersey to Long Island. The booms were heard as far away as Connecticut.\nNavy spokeswoman Connie Hempel said supersonic tests flights are done almost daily in the same area but that most sonic booms aren't felt on land. They are conducted offshore in an area called the Test Track, parallel to the coast of the Delmarva Peninsula which is occupied by Delaware, Maryland and Viriginia.\nCertain atmospheric conditions can increase the chance of hearing the booms.\nThursday's tests were done around 1:30 and 2:30 p.m.\nA geophysicist with the U.S. Geological Survey said there were nine total booms. Bruce Presgrave said recordings show they occurred over the span of 90 minutes.","url":"https://www.dailymail.co.uk/wires/ap/article-3421749/Sonic-boom-not-earthquake-caused-shaking-loud-noise.html"}
