{"authors":["Associated Press"],"date_download":"2018-10-22 21:42:43","date_modify":"2018-10-22 21:42:43","date_publish":"2016-01-28 08:34:06","description":"CHICAGO (AP) — The wife of a northern Illinois police officer indicted on charges of helping divert money from a youth program her husband had embezzled from...","filename":"data/vaneerConsumption/OfficialOfficerwifeexchangedtextsaboutfunds.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420134_Wife-Illinois-policeman-exchanged-text-messages-funds_1540244563.html","title":"Official: Officer, wife exchanged texts about funds","title_page":"Official: Officer, wife exchanged texts about funds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Official: Officer, wife exchanged texts about funds\nCHICAGO (AP) — The wife of a northern Illinois police officer indicted on charges of helping divert money from a youth program her husband had embezzled from for years exchanged text messages with him about the program, an official said.\nFox Lake Police Lt. Charles Joseph Gliniewicz killed himself Sept. 1 and staged his suicide to look like a homicide. His widow, Melodie Gliniewicz, 51, was indicted Wednesday on felony counts of money laundering and using charitable funds from the Fox Lake Police Explorer Post he ran. Her attorneys vehemently deny she took part in her husband's scheme.\nIn November, an official with knowledge of the death investigation identified Melodie Gliniewicz as one of the recipients of thousands of pages of incriminating text and Facebook messages Joe Gliniewicz had sent. The official spoke on the condition of anonymity because he was not authorized to discuss the probe publicly.\nBelow are two of the messages the official says they exchanged:\n___\nOn April 14, a worried Gliniewicz and his wife exchange messages about money, a retirement date and whether someone, presumably new village administrator Anne Marrin, had the authority to conduct a review of village finances.\nWife: \"...maybe we need to hide the funds some how.\"\n___\nIn a June 22 message, Gliniewicz informs his wife that he used the Explorer account to pay for a travel expense:","url":"https://www.dailymail.co.uk/wires/ap/article-3420134/Wife-Illinois-policeman-exchanged-text-messages-funds.html"}
