{"authors":["Associated Press"],"date_download":"2018-10-23 05:26:55","date_modify":"2018-10-23 05:26:55","date_publish":"2016-01-11 18:29:37","description":"THE HAGUE, Netherlands (AP) — Police, politicians and intelligence officials from more than 50 countries pledged Monday to intensify the fight against violen...","filename":"data/vaneerConsumption/Officialspledgeclosercooperationintacklingextremists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:468f2b3e222d48c1b9388c56803d2431-48qEJGFphM8d437f0aaf92811791-121_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393658_Officials-discuss-coordinate-fight-against-extremism_1540272415.html","title":"Officials pledge closer cooperation in tackling extremists","title_page":"Officials pledge closer cooperation in tackling extremists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Officials pledge closer cooperation in tackling extremists\nTHE HAGUE, Netherlands (AP) — Police, politicians and intelligence officials from more than 50 countries pledged Monday to intensify the fight against violent extremism by cooperating more closely in tracking foreign fighters, their finances and communications.\n\"We all agree that we need to share information better, smarter and faster,\" Dutch Foreign Minister Bert Koenders said after the meeting at the headquarters of European Union police organization Europol.\n\"Terrorism is like a virus. It adapts,\" he added. \"We have to be quicker than they are.\"\nEuropol director Rob Wainwright listens to a speech at the start of an anti terror conference at the Europol headquarters in The Hague, Netherlands, Monday, Jan. 11, 2016. (AP Photo/Peter Dejong)\nKoenders said that building trust between countries and agencies not always accustomed to swiftly sharing intelligence was a key result of the behind-closed-doors meeting.\nAmong a raft of measures agreed by the delegates were moves to disrupt travel routes used by foreign fighters, in part by updating on a daily basis databases at Interpol and other national and international agencies tracking such extremists and fraudulent documents they use.\nAddressing fears that extremists could be crossing borders amid the current surge in migrants entering Europe, Koenders said agencies need up-to-the-minute information, \"to check the personal data of all persons who cross borders.\"\nThe meeting came two months after the Nov. 13 attacks in Paris, in which extremists took advantage of gaps in European intelligence as they plotted and executed the rampage that killed 130 people.\nSalah Abdeslam and Mohamed Abrini, two fugitives in the Paris attacks, had appeared on a list of suspected Belgian extremists, but the list apparently was never widely shared.\nAuthorities say Abdeslam was able to crisscross Europe, pick up accomplices, rent rooms and cars, and buy detonators from a fireworks shop. He was even stopped by police and released again Nov. 14 because his name had not yet been linked to the attacks, even though he rented apartments in the Paris area and a car under his name.\nAbdelhamid Abaaoud, the suspected planner of the attacks, was among the most wanted men in Europe, but French authorities were seemingly unaware until after Nov. 13 that his first cousin, with whom he was in close contact, was living in the Paris region.\nThe cousin, Hasna Ait Boulahcen, was tapped in an unrelated drug investigation, but it was Moroccan intelligence that pointed French authorities to the apartment in Saint-Denis where the cousins were hiding out with an accomplice. They died in a raid there.\nAhead of the conference, Koenders warned that the extremist organizations are constantly evolving — pointing out that Paris attackers sometimes used computer games consoles to communicate — and law enforcement and intelligence agencies must work together to keep ahead of them.\n\"We have made agreements, but it's very important right now that those who make the agreements and those who do the work build the trust to make sure there's a real-time exchange of information,\" he said.\n___\nAssociated Press Writer Lori Hinnant in Paris contributed to this report.\nFrench Secretary of State for EU affairs Harlem Desir listens to questions of journalists prior to the start of an anti terror conference at the Europol headquarters in The Hague, Netherlands, Monday, Jan. 11, 2016. (AP Photo/Peter Dejong)\nDutch Foreign Affairs Minister Bert Koenders answers questions of journalists prior the start of an anti terror conference at the Europol headquarters in The Hague, Netherlands, Monday, Jan. 11, 2016. (AP Photo/Peter Dejong)","url":"https://www.dailymail.co.uk/wires/ap/article-3393658/Officials-discuss-coordinate-fight-against-extremism.html"}
