{"authors":["Associated Press"],"date_download":"2018-10-23 03:44:22","date_modify":"2018-10-23 03:44:22","date_publish":"2017-03-10 13:29:09","description":"GRAETTINGER, Iowa (AP) - A fire sparked by the derailment of a freight train hauling ethanol through rural northwest Iowa continued to burn strong nearly 15...","filename":"data/vaneerConsumption/OfficialFirestillburninghoursafterIowaderailment.json","image_url":"https://i.dailymail.co.uk/1/2017/03/11/00/wire-198729-1489190955-977_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301292_Fuel-tank-cars-burn-freight-train-derails-Iowa_1540266262.html","title":"Official: Fire still burning hours after Iowa derailment","title_page":"Official: Fire still burning hours after Iowa derailment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GRAETTINGER, Iowa (AP) - A fire sparked by the derailment of a freight train hauling ethanol through rural northwest Iowa continued to burn strong nearly 15 hours later, but appears not to be leaking any significant amounts of ethanol into a creek at the site, an Iowa environmental official said Friday.\n\"There was a pretty big explosion about 45 minutes ago\" at the site of the fire, Iowa Department of Natural Resources field office supervisor Ken Hessenius said around 3:15 p.m. Friday. \"No one can get within about a third of a mile of the fire yet. It's still pretty dangerous there.\"\nThe train derailed and burst into flames around 1 a.m. Friday as it crossed a trestle bridge over Jack Creek that empties into the Des Moines River. It happened near the small community of Graettinger, about 160 miles northwest of Des Moines. Two train crew members escaped unharmed and no injuries have been reported.\nIn this photo made from a video shot and provided by KTIV, several tank cars burn after a freight train, carrying ethanol, derailed around 1 a.m., Friday, March 10, 2017, near the small community of Graettinger in northwestern Iowa. Environmental experts were checking for ethanol leaks after the freight train derailed and burst into flames as it crossed a trestle bridge over a creek that empties into the Des Moines River. (Courtesy of KTIV via AP)\nOfficials expected the fire to burn out by Saturday, allowing investigators and railroad crews to better assess the damage and clean up the area, Hessenius said.\nHe also said it did not appear any significant amounts of ethanol had spilled into the creek after staff from his agency checked downstream. A water sample from the creek hadn't yet been lab tested, but Hessenius said the water appeared uncontaminated after \"a smell test.\"\nOfficials asked residents of three homes - each at least a half-mile from the derailment - to evacuate, the Palo Alto County Sheriff's Office said. Those residents were allowed to return home Friday afternoon after officials determined the fire did not pose a risk to them, the sheriff's office said.\nPalo Alto County emergency management director Mark Hunefeld said at least 27 of 101 cars derailed.\nRailroad personnel were able to unhitch 74 loaded tankers and move them away from the site. Each tanker carries about 25,000 gallons.\nEthanol is water-soluble, will quickly disperse through surface water and can reduce oxygen content to the point of producing fish kills. The threat to drinking water depends on concentration, experts say. The clean-burning fuel additive is an alcohol - often made from corn - that is mixed with gasoline to help meet vehicle emissions standards. It evaporates quickly at room temperature, but more slowly at colder temperatures. The vapors are highly flammable when exposed to an ignition source, such as a flame or spark.\nSasha Forsen, spokeswoman for Green Plains Inc. in Omaha, Nebraska, said the tanks had been filled with ethanol at the company's plant in Superior, Iowa. She declined to say where the shipment was heading.\nRaquel Espinoza, a spokeswoman for Union Pacific, confirmed that the train was operated by that railroad company, and referred questions to the National Transportation Safety Board.\nNTSB spokesman Keith Holloway said agency investigators would be at the derailment site to determine the cause of the accident Friday afternoon. A news release later issued by NTSB said the agency sent a 15-member investigative team to the site - with some team members traveling from Biloxi, Mississippi, where the agency is investigating a Tuesday crash in which a Texas tour bus was hit by a freight train at a crossing, killing four.\nNTSB said initial reports indicated the rail cars that derailed Friday are older, less sturdy tanks. The government has ordered that such tanks be either retrofitted to higher standards or taken out of commission by 2029. The rail tanker standards were changed in 2015.\nThere have been at least seven significant accidents involving trains hauling ethanol since 2006 that released a combined 2 million gallons of the fuel. Among them was a July 2009 accident in Cherry Valley, Illinois, that killed a woman and injured nine people, including two firefighters, when a Canadian National Railway Co. train derailed at a highway crossing and burst into flames.\nRailroads in the U.S. have seen a huge surge in shipments of ethanol over the past two decades, transporting more than 333,000 carloads of the fuel in 2014 compared to fewer than 40,000 carloads in 2000, according to the Association of American Railroads. More recent figures are not yet available, said association spokeswoman Jessica Kahanek.","url":"https://www.dailymail.co.uk/wires/ap/article-4301292/Fuel-tank-cars-burn-freight-train-derails-Iowa.html"}
