{"authors":[],"date_download":"2018-10-22 21:13:25","date_modify":"2018-10-22 21:13:25","date_publish":"2014-05-06 14:15:34","description":"Office Depot posted better-than-expected quarterly profit due to cost-cutting and said it would close 400 stores in the United States over two years.","filename":"data/vaneerConsumption/OfficeDepotClosing400StoresinCostCuttingSharesSoar.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/423146/140506-140506-officedepot-1018_7a63116354039898fd2d8615832e8357.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_office-depot-closing-400-stores-cost-cutting-shares-soar-n98136_1540242805.html","title":"Office Depot Closing 400 Stores in Cost-Cutting, Shares Soar","title_page":"Office Depot Closing 400 Stores in Cost-Cutting, Shares Soar","title_rss":"NULL","source_domain":"nbcnews.com","text":"Office Depot had 1,900 U.S. stores as of March 29. The closure of the 400 stores will start adding to profit in 2015 and is expected to lead to annual run-rate savings of at least $75 million by the end of 2016, Smith said. Office Depot and rival Staples have been struggling with declining sales as shoppers shift their office supply purchases to e-retailers, mass merchants and drugstores.\nStaples said in March that it would close 225 stores in the United States and Canada, about 12 percent of its North American outlets, and the company forecast another quarter of sales declines.\nOffice Depot's North American retail same-store sales fell 3 percent in the first quarter, but that was better than the 4-percent drop in sales in the fourth quarter.\nThe company posted a net loss of $109 million, or 21 cents per share, compared with a net loss of $17 million, or 6 cents per share, a year earlier. But excluding certain items, it earned 7 cents per share on total sales of $4.35 billion. That was better than the analysts' average expectation of a profit of 3 cents per share on sales of $4.28 billion, according to Thomson Reuters I/B/E/S.\n- Reuters","url":"https://www.nbcnews.com/business/consumer/office-depot-closing-400-stores-cost-cutting-shares-soar-n98136"}
