{"authors":[],"date_download":"2018-10-30 14:37:25","date_modify":"2018-10-30 14:37:25","date_publish":"2018-08-21 22:12:00","description":"The East Point police officer accused of sexually assaulting a 15-year-old girl faced similar allega...","filename":"data/vaneerConsumption/Officeraccusedofsexuallyassaultingteenfacedsimilaraccusations.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/08/21/Videos/4465999.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_officer-acc_3608c896e61754e6af07e3373fe00052__1540910245.html","title":"Officer accused of sexually assaulting teen faced similar accusations","title_page":"Officer accused of sexually assaulting teen faced similar accusations ","title_rss":"NULL","source_domain":"ajc.com","text":"The East Point police officer accused of sexually assaulting a 15-year-old girl faced similar allegations involving another teenager seven years ago but was never prosecuted, Channel 2 Action News reported.\nThe Fulton County District Attorney’s Office declined to prosecute Sgt. Richard Gooddine in a 2011 sexual battery and child molestation case, claiming it would not have been in the best interest of the victim, Channel 2 reported. Gooddine maintained his innocence in the case.\nIn an interview with the news station, Fulton District Attorney Paul Howard said the victim, who was also 15 years old at the time, was in counseling and making progress, and prosecutors were concerned that the trial would re-traumatize her.\nNonetheless, Howard maintained such cases are a high priority.\nRELATED: Officer accused of sexually assaulting girl, stalking her at hospital\nGooddine is on paid administrative leave as the GBI investigates sexual assault claims brought against him Monday.\nAttorney Thomas Reynolds believes his 15-year-old client, another girl and two boys were followed from a Waffle House by Gooddine, Channel 2 reported. He said Gooddine approached the group when they stopped at Sykes Park in East Point.\nReynolds said Gooddine let the girl and two boys go, but detained the 15-year-old for violating curfew.\nGooddine allegedly took the girl to the Village Highlands apartment complex and sexually assaulted her. According to Reynolds, Gooddine kept the girl for three hours before taking her home.\nAfter learning of the sexual assault, the victim’s mother took the girl to a nearby hospital, where Reynolds said Gooddine searched for the victim and her mother before he was escorted out of the facility.\nGooddine has not been charged in the recent allegations.","url":"https://www.ajc.com/news/crime--law/officer-accused-sexually-assaulting-teen-faced-similar-accusations-years-ago/fJBYBGa21rWFym6UAXbfpJ/"}
