{"authors":[],"date_download":"2018-10-22 21:42:33","date_modify":"2018-10-22 21:42:33","date_publish":"2014-06-05 22:49:11","description":"A man was killed and three other people were injured when a man walked into a building and opened fire, police and hospital officials said.","filename":"data/vaneerConsumption/OfficialsHailHeroStudentsinSeattlePacificUniversityShooting.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/491391/140605-spu-students-2335_85ecf5bb0e9a2d5833b8ac1aa5d7fe03.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_officials-hail-hero-students-seattle-pacific-university-shooting-n124046_1540244553.html","title":"Officials Hail Hero Students in Seattle Pacific University Shooting","title_page":"Officials Hail Hero Students in Seattle Pacific University Shooting","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nQuick-thinking students jumped on a man who opened fire in a campus building Thursday at Seattle Pacific University, pinning him to the ground before he could reload, shoot and kill more people, police said.\nOne man was killed and three other people were injured, one of them critically, Seattle police said. A suspect, described as a 26-year-old white male who wasn't a student, was in custody.\nThe man was identified by police as Aaron Ybarra. Assistant Police Chief Paul McDonagh said the suspect would be booked for investigation of murder.\nMcDonagh said it appeared that the man — who was armed with a shotgun, a knife and an unspecified number of extra rounds of ammunition — acted alone, but he said officers were following up on the possibility that he may have had an accomplice.\nSusan Gregg, a spokeswoman for Harborview Medical Center, said four people were treated. One - a 19-year-old male - later died, while a woman in her 20s was in critical condition following a five-hour surgery, Gregg said. Of the two others treated, one 24-year-old male was in satisfactory condition while a 22-year-old male was treated and released, she added.\nThe shootings occurred shortly after 3 p.m. (6 p.m. ET) at Otto Miller Hall, the engineering and math building at the private Christian college.\nThe gunman walked into the lobby and fired multiple gunshots, said police Capt. Chris Fowler, the incident commander. When he stopped to reload, a student security guard subdued the man by pepper-spraying him and taking him to the ground, where he was pinned by other students until authorities arrived, Fowler said.\n\"But for the terrific response of the people at Seattle Pacific University, this incident might have been much more tragic,\" McDonagh said. \"The actions of the subject here do not reflect the city of Seattle and of the students of Seattle Pacific University.\"\nWashington Gov. Jay Inslee echoed McDonagh's sentiment, praising the \"students who put themselves in real danger to protect classmates from further violence and to aid and comfort the victims.\"\n\"Those selfless and brave acts should remind us of the indomitable spirit of young people,\" Inslee said in a statement.","url":"https://www.nbcnews.com/news/crime-courts/officials-hail-hero-students-seattle-pacific-university-shooting-n124046"}
