{"authors":[],"date_download":"2018-10-30 14:22:41","date_modify":"2018-10-30 14:22:41","date_publish":"2017-03-08 00:09:00","description":"Jeremy Summers is facing charges in connection with a kidnapping and carjacking in southwest Atlanta.","filename":"data/vaneerConsumption/Officerstopscarjackingafterkidnappedwomanswervesintohislane.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/07/Images/rich-mason.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_officer-sto_8031898e70b53f32a0c4e1b70e67f9ff__1540909361.html","title":"Officer stops carjacking after kidnapped woman swerves into his lane","title_page":"Officer stops carjacking after kidnapped woman swerves into his lane","title_rss":"NULL","source_domain":"ajc.com","text":"One week after a man broke his leg in an alleged kidnapping and carjacking incident, he is in stable condition at the Atlanta Grady Detention Center, officials say.\nHis alleged victims are still processing the attack.\nJeremy Summers in 2000 (Credit: Fulton County Sheriff's Office)\nJeremy Summers, 33, climbed into the back seat of a car as a couple waited for their granddaughter to get her hair braided Feb. 28 on Campbellton Road in southwest Atlanta, Barbara Love told The Atlanta Journal-Constitution.\nShe said she and her husband, Nolan, were in her daughter’s Mazda.\nThey were hanging out about 4 p.m., smoking and playing games on their phones.\n“We weren’t paying any attention to that young man,” she said. “We didn’t see where he came from.”\nAt first, Summers asked to be taken to a train station, but then he pulled out a 9mm pistol, according to a police report.\n“Give me your phones; give me your money,” Summers allegedly told the couple.\nBarbara Love said she stealthily removed her wallet from her purse before handing it, along with her phone, to the man. Nolan Love hid his wallet under his seat before handing over his phone.\nBarbara said Summers next told her to drive.\n“I was really scared,” she said. “I didn’t have a choice but to drive; he had me and my husband at gunpoint.”\nBarbara said Summers had her driving in circles for about an hour. During that time, she saw a few police cars but said she felt like she couldn’t do anything at that point.\n“He was in the left lane and we was in the right lane and I just swerved over. He looked at me and I was like, ‘Help me.’”\nBut when she again saw a marked Atlanta police car, she told herself, “It’s now or never.”\n“He was in the left lane and we was in the right lane and I just swerved over,” Barbara said. “He looked at me and I was like, ‘Help me.’”\nCapt. Richard Mason started after them.\nBarbara said she tried to stop the car but couldn’t get it into park. Nolan took off his seat belt and scuffled long enough with Summers to give Barbara time to get her seat belt off.\nHe put the car in park and they both jumped out, Barbara said.\n“I ran up to the cop and said, ‘He carjacked us and robbed us,’” Barbara said.\nThat’s when Summers jumped in the front seat and drove off, she said. Mason quickly followed while the Loves waited with other police officers who’d arrived to help.\nThe chase ended when Summers ran a red light and hit another car, witness Russell Martin told police.\nSummers swerved to avoid Martin’s car and struck someone else, the police report states. The driver of that car was taken to Grady Memorial Hospital with chest pain.\nPolice charged Summers with kidnapping, armed robbery, hijacking a motor vehicle, aggravated assault, possession of a firearm both in the commission of a felony and by a convicted felon. Other charges included reckless driving, fleeing police and failure to obey traffic signs.\nPolice told the couple they were looking for Summers because he had recently robbed someone else.\nSummers was arrested with more than $1,000 in cash, according to the report.\nBarbara said she and her husband couldn’t think of what they would have done differently, other than pay closer attention to their environment.\n“I’m glad we were safe and it turned out the way it did,” she said. “Keep your doors locked when you’re driving and be aware of your surroundings.”\nIn other news:","url":"https://www.ajc.com/news/crime--law/officer-stops-carjacking-after-kidnapped-woman-swerves-into-his-lane/brUq4LKufgiIZ0nYGLussL/"}
