{"authors":["Rodney Thrash"],"date_download":"2018-10-30 20:10:35","date_modify":"2018-10-30 20:10:35","date_publish":"2015-10-27 10:11:18","description":"Officials on Tuesday were working to determine what caused a minor plant explosion in Bartow County...","filename":"data/vaneerConsumption/OfficialsinvestigatecauseofminorexplosionatGeorgiaPowe.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/27/Images/WPIMAGE_cmgajcnews_3852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_news_update-officials-_bd2f33df16d3f9ad1744a732271151a7__1540930235.html","title":"Officials investigate cause of minor explosion at Georgia Powe","title_page":"UPDATE: Officials investigate cause of minor explosion at Georgia Powe","title_rss":"NULL","source_domain":"ajc.com","text":"Officials on Tuesday were working to determine what caused a minor plant explosion in Bartow County that sent one contractor to a local hospital.\nThe explosion was reported at Georgia Power's Plant Bowen near Cartersville — the scene of an April 2013 blast that caused four minor injuries and sent coal dust into the air, remained unclear.\nIn an emailed statement sent just before 10:40 a.m., Georgia Power spokesman John Kraft said the contractor injured in Tuesday's \"incident\" was performing offline maintenance of electrical equipment at the facility when he experienced burns due to an apparent electrical flash.\nKraft said there was no danger to the public or other employees at the plant. And by 11:13 a.m., all emergency personnel had left the plant and operations had returned to normal, the utility said.\nWhile no one was seriously injured in the 2013 generator explosion that occurred during a maintenance shutdown, the federal Occupational Safety and Health Administration cited Georgia Power for 17 “serious safety violations.”\n\"Fortunately, no one was injured or killed as a result of this explosion,\" said Christi Griffin, director of OSHA's Atlanta-West Area Office after the 2013 incident. \"Our inspection found several serious safety hazards that the company must address immediately to protect its workers. It is a fundamental responsibility of employers to ensure a safe workplace.\"\nOSHA proposed that the company be fined $119,000 for the violations.\nWorker errors, not equipment failure, caused the 2013 explosion, a spokesman for the utility told The Atlanta Journal-Constitution a month after the blast.\nThe workers, the utility said, did not comply with procedures and did not communicate properly.\nGeorgia Power's parent, Atlanta-based Southern Co., brought in a team to review the incident, enhance safety measures and apply those new procedures at all of the natural gas, coal and nuclear plants across its territory.\nThe team included non-company workers and employees from Southern's \"nuclear safety\" division, considered to have the most stringent operational and safety requirements.\nBecause of its size, Plant Bowen routinely ranks as one of the dirtiest coal plants in the nation, The Atlanta Journal-Constitution previously reported. Its four coal-fired units produce 3,200 megawatts of electricity, enough to power 1.75 million residential homes for one year, when operating at full capacity.\nBowen was built and began operating in the 1970s. Environmental groups have pressed for the closure of coal plants, especially older ones, because they often lack pollution controls and require more maintenance.\n—Information from The AJC archives was used in this story.","url":"https://www.ajc.com/blog/news/update-officials-investigate-cause-minor-explosion-georgia-power-plant-bowen/vDqYFQTpHdfxTFPh5WQLcL/"}
