{"authors":["Associated Press"],"date_download":"2018-10-23 03:18:28","date_modify":"2018-10-23 03:18:28","date_publish":"2016-01-28 18:43:20","description":"ACAPULCO, Mexico (AP) — The bullet-ridden bodies of seven men were found early Thursday in the city of Chilpancingo, in southern Mexico. A law enforcement of...","filename":"data/vaneerConsumption/Official7deadinshootingsinsouthernMexicancity.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421349_Official-7-dead-shootings-southern-Mexico-city_1540264708.html","title":"Official: 7 dead in shootings in southern Mexican city","title_page":"Official: 7 dead in shootings in southern Mexican city | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Official: 7 dead in shootings in southern Mexican city\nACAPULCO, Mexico (AP) — The bullet-ridden bodies of seven men were found early Thursday in the city of Chilpancingo, in southern Mexico.\nA law enforcement official says the bodies were found on roadsides in two groups. The official was not authorized to be quoted by name and spoke on condition of anonymity.\nThree bodies were dumped on the side of the main highway that runs through the city. They had been bound and their faces covered before being shot.\nFour more bodies were found in similar circumstances in a rural area on the outskirts of the city, which is capital of Guerrero state, which has been plagued by drug gang turf battles, opium poppy plantations, land disputes, illegal logging and a host of other conflicts.\nThe killings come one day after 3,500 soldiers and police were dispatched to bring order to the area east of Chilpancingo. The operation is based in the city of Chilapa, where two drug gangs have been fighting bloody turf battles for years.","url":"https://www.dailymail.co.uk/wires/ap/article-3421349/Official-7-dead-shootings-southern-Mexico-city.html"}
