{"authors":[],"date_download":"2018-10-22 21:35:30","date_modify":"2018-10-22 21:35:30","date_publish":"2014-06-05 19:35:15","description":"The AP wrote that the White House did not notify senators of the prisoner swap because the Taliban threatened to kill Bergdahl if the news was leaked","filename":"data/vaneerConsumption/OfficialsSparOverReportAboutBergdahlDeathThreat.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/490541/captured_soldier_congress-jpeg-048bd_15e1ee8eb3331610e3d05203a735235d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_officials-spar-over-report-about-bergdahl-death-threat-n123861_1540244130.html","title":"Officials Spar Over Report About Bergdahl Death Threat","title_page":"Officials Spar Over Report About Bergdahl Death Threat","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOfficials are warring over a report about why the White House didn't notify Congress of the release of Sgt. Bowe Bergdahl.\nThe Associated Press reported Thursday that the Obama administration did not notify senators of the prisoner swap because the Taliban threatened to kill Bergdahl if the news was leaked. That report was attributed to three “congressional officials.”\nSeveral Democrats insist that senators were informed of that risk at a classified briefing Wednesday evening. But others – and some top Republicans – dispute the account.\n\"We were told there was credible intelligence that if the news of the discussions had been leaked out over the last month, he would have been killed,” said Sen. Angus King of Maine, an Independent who caucuses with Democrats.\n“The exchange absolutely happened,” added a Democratic Senate aide familiar with the briefing. “It is a fact that senators were informed at the briefing yesterday evening that the U.S. obtained credible information that, if anything about the swap became public, Bergdahl would be killed.”\nSenate Intelligence Committee chair Dianne Feinstein, D-Calif., said she did not hear that reasoning, although she acknowledged she was unable to attend the entire classified meeting.\nBut she expressed concern that potential leaks from classified briefings with top lawmakers were cited as an excuse for the administration’s withholding of information about the swap.\n“We do not leak, and I take great pride in that,” she said.\nSenate Armed Services Ranking Member Jim Inhofe, R-Okla., said flatly that the story doesn’t hold water.\n\"That's absurd,\" Inhofe told NBC News. \"I think it shows that the administration is trying to juggle anything they can to justify a blatant violation of the law.\"\nSen. John McCain, R-Ariz., also disputed the AP report, saying, \"I never heard that.\"\n\"That flies in the face of everything that we know about the value that people like the Taliban place on having prisoners. And to me, from what I know, threatening to kill them is a very unlikely scenario,” McCain said. “It's the same reason why the North Vietnamese kept us alive, because we were high value.\"\nA White House official attributed the source of the information to Qatar, where five Guantanamo detainees were transferred in return for Bergdahl’s release.\n“We are able to say that the Senators were told, separate and apart from Sgt Bergdahl’s apparent deterioration in health, that we had both specific and general indications that Sgt Bergdahl 's recovery -- and potentially his life -- could be jeopardized if the detainee exchange proceedings were disclosed or derailed,” another administration official told NBC News.\nThe framework of the potential prisoner swap was well reported long before the weekend’s release of Bergdahl, publicized as early as a January 2012 story by Rolling Stone’s Michael Hastings. That has led some to question why news of the deal would have prompted such dire threats to Bergdahl’s life before the operation took place.\nNBC’s Kristen Welker and Stacey Klein contributed.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/officials-spar-over-report-about-bergdahl-death-threat-n123861"}
