{"authors":[],"date_download":"2018-10-30 01:20:24","date_modify":"2018-10-30 01:20:24","date_publish":"2014-05-16 19:01:00","description":null,"filename":"data/vaneerConsumption/OfPedalsandPetulance.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/themes/amspec-v1/_img/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862424.html","title":"Of Pedals and Petulance","title_page":"Of Pedals and PetulanceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"I need to make a confession and I realize it won’t make me too popular around here. No, it has nothing to do with my politics, but here goes.\nI ride my bike everywhere.\nIt’s my primary mode of transportation. I ride to work, I ride home, I ride for pleasure, I ride as preference. Neither rain, nor snow, nor sleet, nor hail keeps me out of the saddle.\nTo put things in perspective, I rode to work today, despite the fact that the Washington Area Bicyclists Association postponed their annual “Bike to Work Day” due to lousy weather.\nDon’t get me wrong. I own a car. It just lives in my parents’ garage, outside of Philadelphia. I’ve held a license since I turned sixteen. I just don’t miss the parking tickets, or the traffic, or “running on empty” to the gas station for a $50 fill-up. I traded all that for the fresh air and exercise that comes in the bike lane.\nThat said, I’ve also been bruised and battered. Run off the road and hit by cars. My helmet wears the dings and dents. I’ve coughed up bus exhaust and been flipped the bird. Sometimes I deserved it. You won’t hear me complain…except, perhaps, about the constant complaining. Most of that comes from drivers.\nListen, I get why motorists hate cyclists. We hear you. You’ve made yourselves abundantly clear.\nThe bandwidth devoted to this topic—particularly among conservative opinionists—is extensive. Christopher Caldwell wrote a cover story about the subject last November for the Weekly Standard. My friend Sonny Bunch chimed in at the Washington Free Beacon. Off the top of my head, TAS has covered the “The Alexandria Bike Wars” and “Complete Street Occupiers.” The editor-in-chief of this digital broadsheet denounced the “national movement that is anti-automobile and anti-modernity.”\nFollowing the collective logic (and the transitive property), that means…\n1) I’m slow and/or flaunt the rules of the road;\n2) I’m a danger to myself, and others;\n3) I’m a pompous lib who scolds cops;\n4) I want to #Occupy your roads;*\n5) My true conveyance is self-righteousness;\n6) Anecdotes prove the rules.\nMan, when you put it like that, cyclists are the worst! But that’s quite an archetype to live up to, and I’m not sure I fit the bill.\nHere’s the deal: I’m not going to blow the doors off an automobile on the open road, but on the congested streets of Washington D.C.? I’m getting “there” faster than you on my bike. Drive time in the District is Traffic Armageddon and I made the decision to opt out.\nIf I blend out of the bike lane, and I’m not keeping up with traffic, then I hope you can spare the five seconds it will take me to get out of your way. You know…the same patience you might show at a crosswalk.\nI may run a stop sign or two, but that leads me to my next point. If I’m a danger to myself, that’s my problem. You won’t hear me screaming at suburban Marylanders who venture into the city and wouldn’t recognize a “sharrow” from a school zone. Ditto that for cops. (Let alone cops on bikes.) I recognize the risk, and I accept it.\nWhen I start running down pedestrians at the clip of your average cab driver in This Town I’ll hang up my wheels. Until then, people should probably continue to look both ways for trucks and trains, not two-wheels attached to an aluminum frame.\nAs for the rest? I think Andrew Cuthbert wrote it best “In Defense of Cyclists” for Spacing Vancouver:\n…much of the animosity towards cyclists happens because they are an easy caricature. It’s easy to say that “some low life vegan hipster punk” blew through a stop sign, and to attribute that label to everyone who uses a bike. Lots of different people use bikes. Many cyclists have drivers licenses, and drive cars in addition to cycling. The “cyclist” everyone seems to be mad at, is a fiction. He/she is not a collective.\nThere you have it. Hating bicyclists is lazy. Sort of like driving your car that half-mile to work…which is precisely the sort of snide remark I’d make if I actually fit the avatar everyone complains about.\n*I can assure you, I barely even vote at this point.","url":"https://spectator.org/59255_pedals-and-petulance/"}
