{"authors":[],"date_download":"2018-10-30 01:01:22","date_modify":"2018-10-30 01:01:22","date_publish":"2017-02-03 00:04:52","description":null,"filename":"data/vaneerConsumption/OfProtestsProvocateursandPresidents.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/Trump_inauguration_protest_SF_Jan_20_2017_04.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861282.html","title":"Of Protests, Provocateurs, and Presidents","title_page":"Of Protests, Provocateurs, and PresidentsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Calm down, everybody. Just calm down.\nThe moronic violence at Berkeley Wednesday night was just the latest evidence that behavior in the public square has spun way out of control.\nWorse, both our immediate past president and our current White House resident are acting in ways that encourage, rather than dissuade, the chaos.\nAs a predicate for this discussion, let’s lay out two propositions that, in a free society, should be axiomatic.\nAn important difference exists between civil disobedience and lawless publicity stunt, and a profound difference exists between a protest and a riot. Equally important, a big difference exists between authority and force. In the public square, the job of those in authority is to ensure respectful civic order, not to use unmodulated force — even if the force itself creates havoc — merely to show who’s the boss.\nRelated to those two propositions are the old verities that ends and means must be appropriately balanced (destructive means are rarely justified by supposedly desirable ends), and that straight talk and good manners are not mutually exclusive. It’s also worth considering if a deliberate provocateur is at least partially responsible for the reactions he provokes.\nNow, having possibly overstuffed our topical suitcase, let’s try to sensibly unpack it.\nFirst, consider the evidence that reasonable old behavioral lines have been erased. On Inauguration Day, radicals didn’t merely protest Donald Trump; they got violent, smashed store windows, did the sort of damage that would have justified them getting tear-gassed, arrested, convicted, and locked up for a good, long time. That same weekend, the women’s march in Washington turned into an imbecilic series of R-rated rants, exemplified by actress Ashley Judd yell-blathering about women’s monthly cycles, about blacks “still being shackled… just for being black,” about “feel[ing] Hitler in these streets,” and all sorts of other disjointed, crass, and/or paranoiac effusions.\nIn Mobile, Alabama on Monday, an NAACP rally against local U.S. Sen. Jeff Sessions’ appointment as U.S. Attorney General began with dignity but ended in farce, with 100 protesters conducting a “sit-in” outside of an empty — yes, empty — office, having heard their leader exhort them three times to “literally break the law” specifically in order to be arrested (as 11 of them eventually were). Innocent businesses in the private building were hindered from their work, all in a bizarre effort to paint the courteous and thoughtful Sessions as the second coming of Bull Connor.\nCompared to rioters (which is lowering the bar significantly), these protesters were a model of decorum — but not at all of proportionate response. It was one thing in the 1960s to protest, to the point of arrest, at the very lunch counters that denied people the right to eat there, or to protest the disenfranchisement of well over 90 percent of all southern blacks. It is quite another to seriously inconvenience innocent workers who have nothing to do with one’s complaints, largely over a senator’s stance on voter-ID laws that snare a minuscule number of would-be balloters.\nTo treat every grievance or policy dispute as being worthy of deliberately provoking arrest in the spirit of Rosa Parks or Martin Luther King is to cheapen the legacy and the seriousness of the causes of those civil rights icons.\nJust two days later, the riots erupted at Berkeley, catalyzed by outside agitators whose signs and chants made clear they were only partly objecting to an on-campus speech of semi-alt-right shock-jock Milo Yiannopoulos while using it as an excuse to conduct dangerous temper tantrums against Donald Trump. The obscene mob broke windows, pummeled opponents, set fires dangerously close to buildings and trees, and in general did everything they could to prove how malevolently idiotic (I choose my words carefully) they were capable of being. California being California, police made not a single arrest, even though even one night in the pokey might have sent some of these cowards mewling for their nice, safe home.\nClearly, the riots were outrageous, and should have been more forcibly squelched.\nOn the other hand, why was Yiannopoulos invited to speak in the first place? Of course he has a right to speak, and a duly constituted student group has a right to invite him. But why, pray tell, were the College Republicans hosting him? Does he really represent Republican values? Sure, he says he is against abortion and against leftist speech codes. But so are many thousands of accomplished speakers who don’t feel the need to insult people gratuitously, transgress norms of discourse just for shock value, and find as many different crass ways to refer to genitalia as a ten-year-old trying haplessly to be included in the cool kids’ club.\nThe Berkeley College Republicans who invited such trash, especially knowing that provocateurs do, yes, tend to provoke harmful responses, should grow up and learn the difference between inflaming needless controversy and actually promoting constructive ideas and debate.\nNo, the riots were the fault only of the rioters, and only the rioters should have been punished. (Heavily punished, at that.) But the descent into putridity is the fault of the CRs, and if kids these days still understand rightfully purgative shame, the CRs’ heads should be hanging low for days to come.\nUnfortunately, indeed dangerously for what was once called civil society, Messrs. Obama and Trump have contributed to the unrest. Neither one has any sense of the public decorum once thought essential to the presidency before Bill Clinton left his distinguishing characteristic on the office. Let’s start with Obama, who took all of 10 days before eviscerating the wise tradition that ex-presidents lie low for a considerable period after leaving 1600 Pennsylvania Avenue.\nNot merely content with blasting Trump’s new semi-ban of not-necessarily-(hint-hint)-Muslims, Obama decided to add to the chaos already occurring as protesters snarled numerous airports to the detriment of tens of thousands of innocent flyers.\n“Citizens exercising their constitutional right to assemble, organize, and have their voices heard by their elected officials,” he said, “is exactly what we expect to see when American values are at stake.”\nFine. But Obama offered not a word about the need to “assemble” in a way that doesn’t transgress the rights or reasonable expectations of others, or about doing so “responsibly” — and certainly nothing, even in the wake of the violent protests that accompanied the inauguration, telling protesters specifically to remain peaceful.\nNor, having now seen the violence in Berkeley, has our former Moral-Preener-in-Chief seen fit to comment about that hideous behavior. He can’t stay quiet for more than ten days when a few hundred incoming travelers are delayed in the name of national security, but he can’t be bothered when windows are smashed, streets are blocked, fires are set, and people are beaten, all in the cause of restricting free speech.\nThese are the words and actions — and not for the first time — of a man comfortable with, indeed happy about, civil unrest that suits his purposes. It’s sickening.\nFinally, there is the new guy in the Oval Office. He surrounds himself with people like “strategist” Steve Bannon whose stated goal is to “disrupt” order. While running for president, the new guy frequently incited violence. Rather than letting police handle loud but non-violent protesters, he encouraged his crowds to hit them, “punch him in the face,” have them “carried out on stretcher,” and commit other mayhem. He never walked back those statements.\nAs president, he has further seemed to revel in “disruption.” With the exception of his flawless (and dignified) “roll-out” of the Supreme Court nomination of Neil Gorsuch, Trump has done little to tamp down tensions and much to exacerbate them. And no matter what one thinks of the substance of his executive order on travelers from seven suspect countries (methinks it was slightly overbroad, sloppy, and ill-vetted), the way that he did it was precipitous, confusing, and crisis-toned. It was accompanied without any sign of empathy or public expressions of explanation and reassurance for the tens of millions of Americans who were frightened by its air (if not substance) of authoritarianism.\nHeretofore, almost every president has understood that he must publicly try, even in the midst of political rancor, to maintain a sense of dignity and of an underlying civic unity that transcends immediate squabbles. Trump doesn’t. Every ounce of his being says: “If you’re with me, great; but I’d really sorta enjoy it if you cross me — so I can kick your butt and use you as an example of the terrible things that happen to my enemies.”\nThis isn’t to say we need a national hand-holder like Stuart Smalley in the White House — thank goodness he only beclowns the Senate — but a Biff the Brawler is a dangerous persona for a president to assume. If you scare half the populace, you’re more likely to spur a radicalized minority of the frightened half to self-justify their evil lawlessness.\nAgain, only the rioters are responsible for their riots. But it’s better not to give them an excuse in the first place.\nNo, or course everybody can’t just “get along.” But in a civil society, everybody should at least make the attempt.\nThe Berkeley rioters held up signs saying “This is War.” No, it isn’t. It’s pathetic puerility. The problem is, nobody is answering it with the calm but firm authority that once was the province not just of presidents but of ordinary, commonsense adults.","url":"https://spectator.org/of-protests-provocateurs-and-presidents/"}
