{"authors":["John Hayward"],"date_download":"2018-10-30 20:44:40","date_modify":"2018-10-30 20:44:40","date_publish":"2015-11-12 21:58:45","description":"Terrence J. McNeil of Akron, Ohio, was charged in court with soliciting the murder of U.S. military personnel by leaking names to ISIS.","filename":"data/vaneerConsumption/OhioManArrestedforSupportingISIS.json","image_url":"https://media.breitbart.com/media/2015/03/US-marines-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_12__1540932280.html","title":"Ohio Man Arrested for Supporting ISIS","title_page":"Ohio Man Arrested for Supporting ISIS","title_rss":"NULL","source_domain":"breitbart.com","text":"Twenty-five-year-old Terrence J. McNeil of Akron, Ohio, was charged in federal court on Thursday with soliciting the murder of U.S. military personnel by leaking their names, home addresses, photographs, and other information to the Islamic State (ISIS/ISIL/IS).\nThe Foreign Desk reports that on or around September 24, McNeil used his Tumblr account to post a file for the “Islamic State Hacking Division,” with the sub-heading “Target: United States Military” and “Leak: Addresses of 100 U.S. Military Personnel.” The file contained personal information about American service members.\nMcNeil accompanied this gift to ISIS with the following screed:\nO Brothers in America, know that the jihad against the crusaders is not limited to the lands of the Khilafah, it is a world-wide jihad and their war is not just a war against the Islamic State, it is a war against Islam. … Know that it is wajib for you to kill these kuffar! and now we have made it easy for you by giving you addresses, all you need to do is take the final step, so what are you waiting for? Kill them in their own lands, behead them in their own homes, stab them to death as they walk their streets thinking that they are safe.\nKhilafah means “caliphate,” a reference to the territory occupied by the Islamic State. Wajib means “necessary.” Kuffar is a derogatory term for non-Muslims.\nFox News in Cleveland adds that McNeil accompanied the file with a looping animated .gif image showing “U.S. military members, a handgun, and the words ‘Kill them wherever you find them.'”\nThe charging documents said that McNeil admitted several times on social media to supporting ISIS.\nFBI Special Agent in Charge Stephen D. Anthony said:\nWhile we aggressively defend 1st amendment rights, the individual arrested today went far beyond free speech by reposting names and addresses of 100 U.S. service members, all with the intent to have them killed. We will remain vigilant in our efforts to stop those who wish to support these despicable acts.\nAssistant Attorney General John P. Carlin asserted:\nAccording to the allegations in the complaint, Terrence McNeil solicited the murder of members of our military by disseminating ISIL’s violent rhetoric, circulating detailed U.S. military personnel information, and explicitly calling for the killing of American service members in their homes and communities.\n“ISIL and its followers continue to use social media in an attempt to incite violence around the world, including in the United States,” said Carlin, adding, “The National Security Division’s highest priority is counterterrorism and we will use all of our tools to disrupt threats and acts of violence against our military members and their families.”\nMcNeil was charged at U.S. District Court of the Northern District of Ohio in Akron, and was remanded into the custody of U.S. Marshals, with another hearing set for next week, according to Fox 8.","url":"https://www.breitbart.com/national-security/2015/11/12/ohio-man-arrested-supporting-isis-leaking-military-personnel-information/"}
