{"authors":["Ollie Gillman For Dailymail.Com"],"date_download":"2018-10-23 03:25:52","date_modify":"2018-10-23 03:25:52","date_publish":"2016-01-29 18:18:34","description":"Tara Lambert, 33, from Circleville, Ohio, gave an undercover sheriff's deputy $125 as a down payment to kill Kellie Cooke and now faces up to 11 years in jail.","filename":"data/vaneerConsumption/OhiomodelTaraLambertfoundguiltyoftryingtohirehitmantokillhusbandsexwife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/30/13/30B4AE5B00000578-0-image-a-5_1454160309935.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422981_Ohio-model-guilty-trying-hire-hitman-kill-husband-s-ex-wife-dispose-corpse-using-wood-chipper_1540265152.html","title":"Ohio model Tara Lambert found guilty of trying to hire hitman to kill husband's ex-wife","title_page":"Ohio model Tara Lambert found guilty of trying to hire hitman to kill husband's ex-wife | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former model who tried to hire a hitman to kill her husband's ex-wife has been found guilty of conspiracy to commit murder.\nTara Lambert, 33, gave an undercover sheriff's deputy $125 as a down payment to kill Kellie Cooke, who is the mother of Lambert's two stepdaughters.\nLambert, from Circleville, Ohio, suggested the officer - who she thought was an assassin - use a wood chipper to dispose of Mrs Cooke's corpse.\nScroll down for video\nGuilty: Former model Tara Lambert, 33, tried to hire a hitman to kill her husband's ex-wife, Kellie Cooke\nLambert (in court, left, and in 2011, right) gave an undercover sheriff's deputy $125 as a down payment to kill Mrs Cooke, who is the mother of Lambert's two stepdaughters\nLambert was found guilty of trying to hire an assassin to kill Mrs Cooke (right). She was cleared of trying to do the same to Mrs Cooke's husband, Shawn (left)\nThe former model insisted in court that she had been joking, but a jury found her guilty on Wednesday after just 45 minutes of deliberations, the Columbus Dispatch reported.\nShe could face up to 11 years in jail when she is sentenced in February.\nLambert was cleared of conspiring to murder Mrs Cooke's husband, Shawn, if he was at home when the hitman came to kill his wife.\nThe ex-model, who is married to Brandon Lambert, the father of Mrs Cooke's children, was arrested on July 28 last year after giving the undercover police officer a photograph of Kellie Cooke and a $125 payment to have her killed.\nThe court was told that she also gave the deputy Mrs Cooke's address and a description of her car.\nLambert said she wanted Mrs Cooke's body thrown into a wood chipper, but insisted in court that she had been joking.\nLambert (pictured in court) had drink and drug problems, as well as eating disorders and issues with her body image, a psychologist said\nLambert (pictured in court) suggested the police officer - who she thought was an assassin - use a wood chipper to dispose of Mrs Cooke's corpse\nLambert and Mrs Cooke had been in the midst of a custody battle, the Circleville Herald reported.\nA psychologist told the jury on Tuesday that Lambert was 'developmentally challenged' and said she had drink and drug problems.\nThe 33-year-old also suffers from eating disorders and has issues with her body image, leading to her more than two dozen cosmetic surgeries, the jury was told.\nThe psychologist, Jolie Brams, added that on one occasion, Lambert was told her sweater did not fit so she immediately went to her plastic surgeon for an operation.\nMs Brams said the accused was brought up around violence and was abandoned by her parents as a child.\nLambert's defense attorney James Kingsley said: 'Tara Lambert doesn't know what's appropriate for a situation. She's childlike. Life's a fantasy to her.'\nLambert (pictured in court) and Mrs Cooke (in the background) had been in the midst of a custody battle\nThe former model (left, in court, and right, in a police mugshot) insisted in court that she had been joking\nLambert (pictured in court) could be jailed for 11 years when she is sentenced next month\nAfter the verdict, Lambert was taken into custody. The last thing she said before being led from the courtroom was asking what officials would do with her purse.\nSpeaking after the hearing, Mrs Cooke said her children had not seen their father, Mr Lambert, since August last year. His whereabouts are unknown.\n'We'll heal but we'll never feel secure,' Mrs Cooke said.\nMr Cooke said: 'That woman tried to take away everything that matters to me.\n'This has opened our eyes that there is evil in this world, true evil, and for us, nothing will ever be the same. There's no way it can be.'\n'She had the full intention of my wife being killed, there's no doubt about that,' he told the Pickaway News Journal.","url":"https://www.dailymail.co.uk/news/article-3422981/Ohio-model-guilty-trying-hire-hitman-kill-husband-s-ex-wife-dispose-corpse-using-wood-chipper.html"}
