{"authors":[],"date_download":"2018-10-22 22:52:51","date_modify":"2018-10-22 22:52:51","date_publish":"2014-06-11 02:10:08","description":"Pentagon spokesman Rear Adm. John Kirby said the five American troops were killed Monday \"during a security operation in southern Afghanistan.\"","filename":"data/vaneerConsumption/OhioIllinoisSoldiersAmong5DeadinAirstrike.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500996/140610-aaron-toppen-friendly-fire-jms-2219_00e02ecdf955ec73c18b56bc6cbb1858.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_ohio-illinois-soldiers-among-5-dead-airstrike-n128026_1540248771.html","title":"Ohio, Illinois Soldiers Among 5 Dead in Airstrike","title_page":"Ohio, Illinois Soldiers Among 5 Dead in Airstrike","title_rss":"NULL","source_domain":"nbcnews.com","text":"Justin Helton, 25, had been in Afghanistan about two months and was engaged to be married, she said. He had been in the Army since 2010.\nAs Toppen's family and friends gathered at the home, painted a light blue, his uncle, Jack Winter, described the high school graduate as a caring and funny man who had aspired to a career in the military or law enforcement.\n\"Aaron was predisposed to serve. He was very keen to be in the military,\" Winter said. \"He was quite proud to be there.\"\n\"He was something somewhat rare in youth culture today. ... In a word, I would summarize what he had as 'class,'\" Winter added. \"So rarely now do you see somebody like that who truly does have class who's polite, humble, loyal, who's a kind-hearted soul, generous.\"\nIt was the second death of a loved one for the family this year. Toppen was set to leave for Afghanistan in February, but his gravely ill father died that month and he stayed for the funeral. He deployed in March.\nToppen was a graduate of Lincoln-Way East High in Frankfort, Illinois, and loved the outdoors, especially fishing. Family members at the home — where friends continued to stop by and bring food Tuesday evening — circulated a picture of Toppen as a young child sitting next to his father in a fishing boat.\nMilitary members provided few details of the attack to the family, Winter said.\n\"A military representative came to my sister's home ... and broke her heart,\" Winter said. \"It just tears your world apart. That's the situation my sister is in.\"\nToppen was the youngest of three children.\nThe Taliban claimed responsibility for Monday's ambush in Zabul.\nA Taliban spokesman, Qari Yousef Ahmadi, said a battle took place between foreign troops and Taliban fighters in the Arghandab district, and a \"huge number\" of NATO soldiers were killed or wounded in the fighting. The Taliban often exaggerate their claims.\nThe other three victims have not yet been identified.\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/ohio-illinois-soldiers-among-5-dead-airstrike-n128026"}
