{"authors":["Associated Press"],"date_download":"2018-10-23 02:38:57","date_modify":"2018-10-23 02:38:57","date_publish":"2017-04-26 13:45:49","description":"DAYTON, Ohio (AP) - Police in Ohio are still trying to identify and locate the owner of a pit bull that mauled a man to death.They say no one has come...","filename":"data/vaneerConsumption/Ohiopolicetryingtoidentifyownersofdogthatkilledman.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465209-1493210753-850_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447656_Ohio-police-trying-identify-owners-dog-killed-man_1540262337.html","title":"Ohio police trying to identify owners of dog that killed man","title_page":"Ohio police trying to identify owners of dog that killed man | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DAYTON, Ohio (AP) - Police in Ohio are still trying to identify and locate the owner of a pit bull that mauled a man to death.\nThey say no one has come forward as the caretaker of the dog that police killed early Tuesday in Dayton. Three other dogs were removed from the same residence by animal resource officials.\nPolice say the pit bull broke away from a chain and attacked the man as he screamed for help.\nThis Tuesday, April 25, 2017 photo shows the area where a man was mauled to death by a dog in the alley early Tuesday in Dayton, Ohio. Lt. Mark Ponichtera said police found the man being attacked in an alley. They were able to get the dog to back off, and the man was taken to a hospital, where he died. Police fatally shot the dog, which they say was a pit bull. They were trying to determine its owner. (Ty Greenlees/Dayton Daily News via AP)\nAuthorities identified the victim as 60-year-old Maurice Brown, of Dayton, who was walking in the neighborhood.\nPolice say the property owner is in a nursing home, and it's not clear who lives there. The dog's owner could face charges.\nMontgomery County officials say there are no dog licenses on record for the residence.","url":"https://www.dailymail.co.uk/wires/ap/article-4447656/Ohio-police-trying-identify-owners-dog-killed-man.html"}
