{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:51:30","date_modify":"2018-10-30 21:51:30","date_publish":"2017-03-03 14:25:45","description":"Figures from the Ohio Attorney General Mike DeWine's office show a record of nearly 159,000 concealed carry permits issued in Ohio in 2016.","filename":"data/vaneerConsumption/OhioRecordNumberofConcealedCarryPermitsIssuedin2016.json","image_url":"https://media.breitbart.com/media/2017/03/conceal.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_03__1540936290.html","title":"Ohio: Record Number of Concealed Carry Permits Issued in 2016","title_page":"Ohio: Record Number of Concealed Carry Permits Issued in 2016","title_rss":"NULL","source_domain":"breitbart.com","text":"Figures from the Ohio Attorney General Mike DeWine’s office show a new record of nearly 159,000 concealed carry permits were issued in Ohio in 2016.\nThe record-breaking figures were not wholly unanticipated. On December 20, 2016, Breitbart News reported that Ohio issued 26,000 concealed permits in the third quarter alone, which represented a nearly 60 percent increase over third quarter figures for 2015.\nAccording to Cleveland.com, “County sheriffs issued 117,953 new concealed carry permits and 40,982 renewal permits in 2016.” They also issued 43 “temporary licenses,” bringing the total issuance figure to 158,982. This represents the most permits issued in a single year since concealed carry was enacted in 2004.\nThe Associated Press reports that the previous single year record for Ohio concealed permits “was 145,000 in 2013.”\nDeWine’s report also shows that Ohio concealed carry permit holders now enjoy reciprocity with 36 states.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2017/03/03/ohio-record-number-concealed-carry-permits-issued-2016/"}
