{"authors":["Will Martin"],"date_download":"2018-10-30 23:45:44","date_modify":"2018-10-30 23:45:44","date_publish":"2018-07-17 00:00:00","description":"Relations between the UK and Ireland are strained in the run up to Brexit, with significant friction over the issue of the border.","filename":"data/vaneerConsumption/OilBrexitpreparationsIrelandtoreportedlypullreservesoutofUK.json","image_url":"https://amp.businessinsider.com/images/5b4ded36f205292d008b47ee-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-brexit-ireland-to-reportedly-pull-reserves-out-of-uk-2018-7_1540943144.html","title":"Oil: Brexit preparations, Ireland to reportedly pull reserves out of UK","title_page":"    Oil: Brexit preparations, Ireland to reportedly pull reserves out of UK - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Francois Lenoir\nThe Irish government is reportedly preparing to move hundreds of thousands of tonnes of oil stored in the UK out of the country as it prepares for the possible realities of Brexit.\nAccording to a report from the Irish Sunday Independent, the government of the Republic of Ireland will move as much as 200,000 tonnes of oil — equivalent to around 1.4 million barrels — currently stored in the UK back to Ireland as part of contingency plans for Britain's impending exit from the European Union.\nThe oil, currently held in British refineries, is being repatriated for \"national security reasons,\" it was reported.\n\"We pay for storage there so that will have serious implications for UK refineries who have stored our oil for almost two decades,\" a senior source in the Irish government told the Irish Sunday Independent.\nIreland reportedly stores about 40% of its overseas oil reserves in the UK. The country's nearly 1.5 million tonnes of reserves are stored largely in ports around the island nation but also overseas in the UK as well as in Spain, Denmark, and the Netherlands.\nEU rules mandate that all member states must hold at least 90 days of oil supplies, in case of a global shortage.\nThere are fears that if Britain ends up leaving the EU without a deal in a so-called \"cliff edge\" Brexit, ports in the UK could come to a standstill, meaning that Ireland would be unable to access its oil if needed.\nRelations between the UK and Ireland are already strained in the run up to Brexit, with significant friction between the two countries when it comes to the issue of the land border between Northern Ireland (part of Britain) and the Republic.\nThe UK government has promised to preserve the frictionless border between Northern Ireland and the Republic, meaning there will be no checks or infrastructure.\nHowever, the UK and EU are at an impasse over a so-called \"backstop\" — the fallback arrangement if negotiations over a future trade deal between Britain and EU fail to solve the Irish border question.\nThe EU wants the backstop to involve Northern Ireland staying in the single market and customs union indefinitely after Brexit. However, British Prime Minister Theresa May has described this as unacceptable.","url":"https://www.businessinsider.com/oil-brexit-ireland-to-reportedly-pull-reserves-out-of-uk-2018-7"}
