{"authors":["Gina Heeb"],"date_download":"2018-10-30 23:59:44","date_modify":"2018-10-30 23:59:44","date_publish":"2018-07-13 00:00:00","description":"Crude prices bounced around Friday afternoon following reports that the Trump administration could tap an emergency oil reserve ahead of midterms.","filename":"data/vaneerConsumption/OilfallsafterreportTrumpconsideringtappingemergencyoilreserve.json","image_url":"https://amp.businessinsider.com/images/5b48fcfc4b625630008b4a3f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-price-trump-considering-tapping-emergency-oil-reserve-report-2018-7_1540943984.html","title":"Oil falls after report Trump considering tapping emergency oil reserve","title_page":"    Oil falls after report Trump considering tapping emergency oil reserve - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump speaks in the Roosevelt Room of the White House in Washington, Friday, April 28, 2017, before signing an Executive Order directing the Interior Department to begin review of restrictive drilling policies for the outer-continental shelf. From left are, Vice President Mike Pence, Rep. Don Young, R-Alaska, the president, Sen. Bill Cassidy, R-La., and Commerce Secretary Wilbur Ross. AP Photo/Pablo Martinez Monsivais\nOil prices bounced around Friday afternoon following reports that the Trump administration could tap an emergency oil reserve ahead of the midterm election.\nWest Texas Intermediate fell 0.5% to $70 a barrel at 3:25 p.m. ET. Crude, the international benchmark, rose 0.75% to $75.09.\nThe Trump administration is \"actively considering\" a release from the Strategic Petroleum Reserve, the world's largest oil stockpile, sources told Bloomberg. Options under review range from a 5-million-barrel test sale to a larger release of 30 million barrels.\nThe White House did not respond to an email earlier this week requesting comment on whether the administration is considering a release.\nThe potential release could come ahead of the midterm election in November, where rising prices at the pump could hurt Republicans in competitive races. A release could at least temporarily ease global-supply concerns that have driven energy prices to four-year highs.\nThe SPR is mainly intended to be an emergency stockpile the US can turn to during war or natural disaster. But non-emergency releases can be authorized to respond to minor supply disruptions or to raise federal revenue, according to the Energy Department.\nWTI is up 52% year-over-year.","url":"https://www.businessinsider.com/oil-price-trump-considering-tapping-emergency-oil-reserve-report-2018-7"}
