{"authors":["Laurel Rosenhall","Dan Morain","Julie Cart","Guest Commentary"],"date_download":"2018-10-30 22:51:15","date_modify":"2018-10-30 22:51:15","date_publish":"2016-03-02 08:00:00","description":"A Harvard economist known globally for his work on climate change policy sat in the Sacramento office of the oil industry’s lobbying firm recently, making","filename":"data/vaneerConsumption/Oilgearsupforanotherclimatefight.json","image_url":"https://calmatters.org/wp-content/uploads/gas_station_cc.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939875.html","title":"Oil gears up for another climate fight","title_page":"Oil gears up for another climate fight | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"A Harvard economist known globally for his work on climate change policy sat in the Sacramento office of the oil industry’s lobbying firm recently, making the case that California is fighting global warming the wrong way.\nThe state has a good cap and trade system, Robert Stavins said, but some of its other environmental policies are weakening it. He pointed to a rule known as the low carbon fuel standard, which is supposed to increase production of clean fuels. Environmental advocates consider it a complement to the cap and trade program that makes industry pay for emitting carbon; Stavins had other words.\n“It’s contradictory. It’s counter productive. It’s perverse,” he said. “I would recommend eliminating it.”\nCalifornia’s low carbon fuel policy is shaping up as a major fight this year for the state’s oil industry, an influential behemoth that spent more than $10.9 million lobbying Sacramento last year, more than any other interest group.\n“There’s a storm coming,” biofuels lobbyist Chris Hessler told a roomful of clean energy advocates at a recent conference on low carbon fuels. “If we don’t meet this attack vigorously, we’re all going to be in a lot of trouble.”\nThe oil industry was front and center in the biggest fight to hit the state Capitol last year: a proposal to cut California’s petroleum consumption in half over the next 15 years to slow the pace of climate change. The industry won its battle when lawmakers stripped the oil provision from Senate Bill 350. But California’s larger oil war is far from over, and the newest battle lines are beginning to emerge.\nGov. Jerry Brown is plowing ahead with plans to cut vehicle oil use in half through executive orders and regulations like the low carbon fuel standard. The standard requires producers to cut the carbon intensity of their fuels 10 percent by 2020. To reach the standard, refineries will have to make a blend that uses more alternative fuels – like ethanol – and less oil.\nThe program was adopted in 2009 but was locked in a court battle for years. California regulators prevailed, and took action last year to resume the program. Now producers must start changing the way they formulate their fuel or buy credits if their product is over the limit.\nThat’s led to higher costs for fuel makers, which they are passing on to consumers at a rate of about 4 cents per gallon, according to the California Energy Commission. At that rate, oil companies are paying about $750 million per year for the fuel standard. But the price is likely to keep increasing, the oil industry warns, as it gets tougher to meet the standard that increases over time.\nWhich is where Stavins’ argument comes in. It goes like this: the cleaner fuels required by the low carbon fuel standard will emit less greenhouse gas. That will reduce the need for fuel producers to buy permits in the cap and trade system (which makes industry pay for emitting climate-warming pollution) and create additional emissions by allowing other manufacturers to buy the pollution permits. Less demand will also depress prices on the cap and trade market.\nStavins is the director of Harvard’s Environmental Economics Program and part of the Intergovernmental Panel on Climate Change, a prestigious group of experts who review research for the United Nations. He’s also an advisor to the Western States Petroleum Association, which paid him to make the trip to Sacramento, where he talked with reporters before a day of meetings with lawmakers and business leaders.\nEnvironmental advocates and California clean air regulators reject his view. They say the fuel standard works in harmony with other carbon-reducing programs and it’s an important piece of California’s effort to achieve its climate change goals.\n“One of the major goals of the low carbon fuel standard… is to drive innovation of new and alternative low carbon fuels,” said Stanley Young, spokesman for the California Air Resources Board. “The cap and trade program on its own cannot do that.”\nAlternative fuel producers gathered in a ballroom near the Capitol days after Stavins’ visit to Sacramento. During a presentation on the rising price of low carbon fuel credits, Hessler, the biofuels lobbyist, warned that the program is coming under “political attack.”\nHe defended the fuel standard by saying the regulation limits the price of the credits, and the cost to consumers will be kept down as some fuel producers make money by selling credits to others. He urged conference participants to share his information with California policymakers to counter opposition to the low carbon fuel standard.\n“We’ve got to be ready for this,” Hessler said.\nA fight last year over a low carbon fuel standard in the state of Washington may provide some clues about how things could go down here. There, Democratic Gov. Jay Inslee proposed a low carbon fuel standard but failed to earn enough support for it in the Legislature. The fuel standard became a bargaining chip for Republicans in negotiations about funding for transportation infrastructure.\nHere in California, lawmakers and Gov. Brown are also negotiating a plan to pay for a backlog of repairs to state roads and highways. Brown has pitched spending $36 billion over the next decade with a mix of taxes and other revenue sources. Republican votes are necessary to reach the two-thirds threshold for approving new taxes. So far, Republicans have balked at the plan, with some suggesting that the fuel standard should be included in the negotiations.\n“As we’re having the discussions about transportation funding in general in California, and transportation taxes in particular, this ought to be part of the discussion,” said Assemblyman Jay Obernolte (R-Hesperia).\nIt’s a message echoed by the president of the Western States Petroleum Association, which advocated against the low carbon fuel standard in Washington. Catherine Reheis-Boyd said she wants California lawmakers to “take a very hard look” at the low carbon fuel standard as they consider the future of climate change policies and the desire to repair the state’s roads.\n“All those things interplay,” Reheis-Boyd said. “That’s a big conversation. I think people across the state are willing to have it, and I think we’re at a pivotal point to have it this year.”","url":"https://calmatters.org/articles/oil-gears-up-for-another-climate-fight/"}
