{"authors":["Henning Gloystein"],"date_download":"2018-10-30 23:53:14","date_modify":"2018-10-30 23:53:14","date_publish":"2016-12-05 00:00:00","description":"Both Brent and West Texas Intermediate fell as much as 1% in trade overnight.","filename":"data/vaneerConsumption/OilisslippingastradersgetjitteryovertheplannedOPECcut.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-oil-prices-fall-as-production-creeps-up-ahead-of-announced-2017-output-cut-2016-12_1540943594.html","title":"Oil is slipping as traders get jittery over the planned OPEC cut","title_page":"    Oil prices fall on December 5 on OPEC cut fears and production figures - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Rigging equipment is pictured in a field outside of Sweetwater Texas Thomson Reuters SINGAPORE (Reuters) - Oil prices fell by 1% overnight on Monday as a higher US rig count unsettled markets amid nagging concern that output cuts, planned as part of concerted action between producer club OPEC and Russia, might not be as big as initially anticipated.\nBrent crude futures were trading at $53.89 per barrel at 1.32 GMT (8.32 p.m. ET), down 57 cents, or over 1%, from their last close.\nWest Texas Intermediate (WTI) crude futures were at $51.49 a barrel, down 52 cents, or 1%.\nTraders said price falls were triggered by rising production just after last week's accord between the Organization of the Petroleum Exporting Countries (OPEC) and non-OPEC member Russia to cut output in 2017. The cuts aim to rein in a supply glut that has weighed on markets for over two years.\nMeanwhile, US energy firms extended drilling for new oil production into a seventh month last week, data from energy services firm Baker Hughes showed on Friday.\n\"The U.S. oil rig count continued its rally this week, up by 3 rigs...Since its trough on May 27, 2016, producers have added 161 oil rigs (+51 percent) in the U.S.,\" Goldman Sachs said.\nOverall - accounting for the recent rise in oil drilling, but also for cutbacks earlier this year on low prices - Goldman said \"year-on-year production will decline by 620,000 barrels per day (bpd) in 2016 and increase by 55,000 bpd in 2017\".\nWith U.S. production set to edge up, there are also gnawing concerns that the cuts announced last week by OPEC and Russia might not be as deep as initially anticipated. The planned reductions brought the sharpest weekly crude price rises in years.\nRussia on Friday reported average daily oil production of 11.21 million bpd for November - its highest in almost 30 years.\nAnd while Moscow has agreed to cut its output by 300,000 bpd in early 2017, it said it would do so against November levels. That means that even after a reduction, its output would remain higher than it was at the peak of the oil glut in the first half of 2016.\nJeffrey Halley of brokerage OANDA in Singapore said oil traders were \"nervous (as) Russia's output has hit record levels, meaning their part of the production cut takes them back to what they were producing only quite recently\".\nIn the Middle East, where the deepest OPEC production cuts are expected, there are also signs that production will rise before it gets cut.\nSaudi Arabia and Kuwait are expected to agree this month to resume oil production, with a potential of 300,000 barrels in daily output, from jointly operated oilfields which were shut down between 2014 and 2015 for environmental and technical difficulties.\n(Reporting by Henning Gloystein; Editing by Kenneth Maxwell)","url":"https://www.businessinsider.com/r-oil-prices-fall-as-production-creeps-up-ahead-of-announced-2017-output-cut-2016-12"}
