{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:50:30","date_modify":"2018-10-30 22:50:30","date_publish":"2016-06-01 08:00:00","description":"It’s not often that interest groups call out public officials by their race, but as environmentalists evaluated state lawmakers’ voting records last year,","filename":"data/vaneerConsumption/OilmoneyflowsforblackandLatinoDemocrats.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/oil_drilling-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939830.html","title":"Oil money flows for black and Latino Democrats","title_page":"Oil money flows for black and Latino Democrats | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"It’s not often that interest groups call out public officials by their race, but as environmentalists evaluated state lawmakers’ voting records last year, that is just what they did.\nBlack and Latino Democrats “must do better” to buck the interests of the petroleum industry and help the communities they represent, the California Environmental Justice Alliance wrote in its scorecard. “We cannot sit on the sidelines as communities of color are used as a wedge for the interests of industry lobbyists,” the group said.\nThe report followed a bruising fight that split Democrats over a proposal to slash vehicles’ petroleum use to slow global warming. Business-friendly Democrats – many of them African-Americans and Latinos representing economically depressed regions – sided with the oil industry against the plan, arguing it would hurt working-class Californians by raising the price of gas. They won; the provision was stripped from legislation.\nNow, oil companies are pouring millions of dollars into legislative contests across the state. And the Democrats they most visibly support are black and Latino.\nThe intersection of environmental and ethnic politics reflects a state dominated by Democrats in which 62 percent of the population is non-white. As the Republican party — the traditional industry ally — has shrunk, many business interests have shifted political spending to buoy Democrats. In some contests, all the Democratic candidates are people of color.\nOil’s support for black and Latino Democrats also reflects cultural and economic divides. The economy is booming in coastal areas, where more whites live, while stagnating in heavily Latino regions inland. Though blacks and Latinos historically aligned with the liberal wing of the Democratic Party, the economic divide has created fertile ground for industry arguments about the financial burden of some environmental policies.\n“Big Oil has not been at the top of most Democrats’ friends lists,” said Roger Salazar, a Democratic political consultant. But energy businesses have “been very smart in looking at some of the internal play….They’ve started to figure out that there is a difference between your coastal, liberal, more affluent Democrat and your inland, urban, less affluent Democrat.”\nNot every lawmaker fits the pattern. The Legislature’s Democratic leaders are both Latinos from urban Los Angeles with strong environmental records: Senate leader Kevin de Leon, who carried the bill on petroleum use, and Assembly Speaker Anthony Rendon, who led the California League of Conservation Voters before being elected.\nBut the environmental movement remains largely white, creating an opening for the oil industry to court ethnic communities, said Marce Gutierrez, who heads an ocean conservation group called Azul.\n“When you have a historical failure of the environmental movement to engage meaningfully with Latinos and people of color, you open it up for that sort of thing to happen,” she said.\nHoping to bolster the Legislature’s caucus of moderate Democrats, businesses are pouring millions into advertising campaigns that are not controlled by candidates. Some political committees combine oil money with funds from other interests to support an array of candidates, including white Democrats.\nOne committee, the Coalition to Restore California’s Middle Class, is funded entirely by oil: Chevron, Tesoro, Valero and the California Resources Corporation. The group had spent nearly $2 million as of May 31 — with more spending likely before Tuesday’s primary — to benefit eight candidates. Two are white Republicans; six are Latino or African-American Democrats.\nA representative of the group declined an interview, instead emailing a statement saying it “supports leaders who have protected California jobs and the middle class and share our commitment to policies that help businesses thrive.”\nThe committee has created a series of ads aimed at working-class Californians:\nOne praises Assemblywoman Cheryl Brown (D-San Bernardino) for blocking the petroleum reduction proposed by “fancy-pants politicians.”\nA spot supporting Democrat Cecilia Aguiar-Curry in an agricultural region shows a picnic table brimming with strawberries and grapes and says energy companies “make the clean fuels that bring our food from farm to fork.”\nAn ad for Assemblywoman Nora Campos (D-San Jose), who is challenging an incumbent Democrat for state Senate, touts her work on maternity health care as a Latina hangs onesies on a clothesline.\nAguiar-Curry and Campos are each competing against white men campaigning on their environmental records.\nCampos declined an interview request. Her campaign consultant, Ed McGovern, sent an email decrying the “proliferation of special interest money in politics” and noting that Campos’ main opponent, Sen. Jim Beall (D-San Jose), is benefiting from $500,000 from billionaire environmentalist Tom Steyer.\nBeall said oil companies are trying to oust him because he’s rebuffed their efforts to repeal California’s low-carbon fuel standard that requires cleaner blends.\n“I have to say no to them when they come up with something that hurts people – like dirtier air,” Beall said. “They’re opposing me on my record.”\nAguiar-Curry, the mayor of Winters, said oil companies see that she works to understand both sides in a debate. Her main opponent, Davis mayor Dan Wolk, said the industry is against him because he has promoted renewable energy.\nIn 2014, the Coalition to Restore California’s Middle Class spent $714,000 to help elect two Democrats: Assemblymen Rudy Salas (D-Bakersfield) and Jim Cooper (D-Elk Grove), a Latino and African-American, respectively, from different ends of the Central Valley.\nIt was a good investment: The pair assumed powerful posts last year as chairmen of the moderate Democratic caucus.","url":"https://calmatters.org/articles/oil-money-flows-for-black-and-latino-democrats/"}
