{"authors":["Associated Press"],"date_download":"2018-10-23 04:35:04","date_modify":"2018-10-23 04:35:04","date_publish":"2016-01-11 17:35:26","description":"CAIRO (AP) — Egypt's petroleum minister said Monday the country is \"suffering\" due to fuel subsidies, saying these funds are better diverted to other areas s...","filename":"data/vaneerConsumption/OilministersaysEgyptsufferingfromfuelsubsidies.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394189_Oil-minister-says-Egypt-suffering-fuel-subsidies_1540269304.html","title":"Oil minister says Egypt 'suffering' from fuel subsidies","title_page":"Oil minister says Egypt 'suffering' from fuel subsidies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oil minister says Egypt 'suffering' from fuel subsidies\nCAIRO (AP) — Egypt's petroleum minister said Monday the country is \"suffering\" due to fuel subsidies, saying these funds are better diverted to other areas such as health care and education.\nTarek el-Molla, speaking at a conference in Cairo, showed in a presentation that between July and September 2015, the government paid 42 percent of the cost of 92-octane gasoline, which is used to fuel private vehicles owned by more affluent Egyptians.\nWhile a liter of 92-octane gasoline cost 4.5 Egyptian pounds (57 cents), it sold at 2.6 pounds (33 cents) at the pump, a graph in his presentation showed. El-Molla also highlighted similar disparities in the true cost and selling price of other fuel products.\n\"I meant to show you this graph to let you feel the challenge and how Egypt is suffering from the subsidy,\" el-Molla told the conference. \"Can you believe that all of us coming today at this event in our vehicles and our cars, the government is subsidizing us?\"\nHe said this was the first time he had spoken about the topic this openly.\nPresident Abdel Fattah el-Sissi had cut fuel subsidies in 2014 by more than 70 percent, in a move that caused a public outcry but was welcomed by economists as a necessary step to save public funds for much-needed development projects.\nEl-Molla declined to share a timeline or the government's plans for future fuel subsidy cuts, saying announcing these plans ahead of time could prompt people to hoard gasoline to sell at a higher price later.","url":"https://www.dailymail.co.uk/wires/ap/article-3394189/Oil-minister-says-Egypt-suffering-fuel-subsidies.html"}
