{"authors":["Associated Press"],"date_download":"2018-10-23 01:24:43","date_modify":"2018-10-23 01:24:43","date_publish":"2016-01-28 15:43:53","description":"BAKU, Azerbaijan (AP) — Representatives from the International Monetary Fund and World Bank arrived in Azerbaijan on Thursday to discuss financial support fo...","filename":"data/vaneerConsumption/OilproducerAzerbaijanintalksforinternationalaid.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420775_Oil-producer-Azerbaijan-talks-international-aid_1540257883.html","title":"Oil producer Azerbaijan in talks for international aid","title_page":"Oil producer Azerbaijan in talks for international aid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oil producer Azerbaijan in talks for international aid\nBAKU, Azerbaijan (AP) — Representatives from the International Monetary Fund and World Bank arrived in Azerbaijan on Thursday to discuss financial support for the oil producing country's ailing economy.\nThe ex-Soviet nation in the Caucasus has been hit hard by the sharp drop in prices of its oil and gas exports over the last year.\n\"The World Bank and the IMF are in active dialogue with the government of Azerbaijan, discussing both immediate and longer-term measures in response to the pressure on the local currency and low oil prices,\" said Zaur Rzayev, spokesman for the World Bank's local office. \"The World Bank stands ready to provide necessary assistance to Azerbaijan, including budget support.\"\nThe World Bank is offering $1 billion in financial support, a government official told The Associated Press, while the European Bank for Reconstruction and Development will seek to help the private sector. The official spoke on condition of anonymity because talks were ongoing.\nThe Azerbaijani government played down the importance of the talks.\n\"Our situation is not so pitiful that we've asked someone for a loan in the very short term. Actually, we're providing other countries with loans,\" Finance Minister Samir Sharifov said, adding that \"there are no negotiations about the urgent provision of large funds from the IMF and World Bank.\"\nInstead, Sharifov said the focus was on helping Azerbaijan to diversify away from oil, by far its largest export.\n\"It's about a broad privatization program, the improvement of the business climate, lowering the level of bureaucracy and improving governance,\" he said. \"This is all being done to create a new development model which doesn't depend on oil.\"\nSharifov confirmed Azerbaijan was drastically revising its budget for 2016 to base it around oil at $25 a barrel. The current budget, which was approved in October, assumes oil costing twice as much. A new budget will be presented to parliament in the first week of February, Sharifov said.\nThe sharp fall in the price of oil has led to major devaluations of the Azeri currency, the manat, which has lost half of its value against the dollar in the last 12 months. Azerbaijan's economic problems have recently led to rare protests over the price of bread.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420775/Oil-producer-Azerbaijan-talks-international-aid.html"}
