{"authors":["Nick Cunningham"],"date_download":"2018-10-31 00:36:18","date_modify":"2018-10-31 00:36:18","date_publish":"2018-07-08 00:00:00","description":"Trump, who is scrambling to slow down the oil rally before midterms, often tweets about OPEC and crude prices. But analysts say it's his own policies that are pushing prices up.","filename":"data/vaneerConsumption/OilpricesTrumpcouldbepushingthemhigherthroughIranpolicy.json","image_url":"https://amp.businessinsider.com/images/5b3fbf9749cb8d25008b4c6c-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-prices-trump-could-be-pushing-them-higher-through-iran-policy-2018-7_1540946178.html","title":"Oil prices: Trump could be pushing them higher through Iran policy","title_page":"    Oil prices: Trump could be pushing them higher through Iran policy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Candidate Donald Trump speaks at the 'Stop the Iran Deal' rally in Washington D.C. in September 2015. Susan Walsh/AP\nPresident Trump spent part of his July 4 holiday shouting at OPEC on twitter, demanding lower gasoline prices.\noilprice.com\nThe tweets are coming more frequently these days, an indication of the political peril that Trump feels because of rising gasoline prices. The logic is odd though. Trump wants lower oil prices while at the same time his administration is trying to zero out 2.5 million barrels per day of Iranian oil exports.\n\"It does not occur to the U.S. president that it is Trump himself who is driving prices up through his Iran policy,\" Commerzbank wrote in a note. If the U.S. succeeds in blocking Iran from exporting its oil, OPEC would struggle to offset the missing barrels. \"Perhaps one of the U.S. president's advisors should explain this to him,\" Commerzbank added.\nTrump's advisers are clearly failing at their task, but Iranian officials tried to lend a helping hand by explaining the situation. \"You impose sanctions on major producers, founders of OPEC, and yet you are asking them to reduce the prices?! Since when did you start ordering OPEC!\" Iran's OPEC governor Hossein Kazempour Ardebili said in a statement. \"Your tweets have driven the prices up by at least $10/b. Pls stop it, otherwise it will go even higher!\"\nMeanwhile, the U.S. Congress has revived legislation that would remove the immunity that sovereign nations have from being sued from antitrust violations. The so-called \"NO PEC Act\" would make OPEC subject to antitrust law, allowing the U.S. to go after OPEC for manipulating the oil market. The legislation has floated around Washington for years, typically going nowhere because past presidents have consistently opposed the measure.","url":"https://www.businessinsider.com/oil-prices-trump-could-be-pushing-them-higher-through-iran-policy-2018-7"}
