{"authors":["Irina Slav"],"date_download":"2018-10-31 00:25:30","date_modify":"2018-10-31 00:25:30","date_publish":"2018-07-10 00:00:00","description":"The Iranian government has threatened to close a key chokepoint, according to RT. A closure could cause oil to surge to $250 a barrel, according to one analyst.","filename":"data/vaneerConsumption/Oilpricecouldsurgeto250ifIranclosesStraitofHormoz.json","image_url":"https://amp.businessinsider.com/images/5b44fc4c32245ce24d8b4886-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-price-250-a-barrel-iran-closes-strait-of-hormoz-2018-7_1540945530.html","title":"Oil price could surge to $250 if Iran closes Strait of Hormoz","title_page":"    Oil price could surge to $250 if Iran closes Strait of Hormoz - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Iran's Navy Commander Habibulah Sayari points at a map during a news conference in Tehran December 22, 2011. Iran's navy will launch a 10-day war game in the Strait of Hormuz on Saturday, state television quoted Sayari as saying on Thursday. REUTERS/Hamed Jafarnejad/Fars News Reuters, Fars News\nCrude oil prices could jump as high as US$250 a barrel if Iran goes through with its threat to close the Strait of Hormuz in response to U.S. pressure on oil buyers to cut their Iranian purchases to zero, RT reports, quoting analysts.\nThe most bullish among these analysts was Artem Avinov from online broker TeleTrade, who saw prices skyrocketing to US$250 a barrel if the Strait of Hormuz is blocked, disrupting about 17 million bpd in seaborne oil trade. Avinov, however, added that this course of events is very unlikely, suggesting Iran would instead opt for \"a quick economic or military retaliation, which will lead to the lifting of restrictions.\"\nAnother analyst, from Global FX, said he expected prices to hit US$160 per barrel in the event of a Hormuz blockade, following a warning from the Iranian Revolutionary Guards that they might close the chokepoint as it must be \"for all or for no one,\" as reported by news agency Tasnim.\nExpectations of a sharp increase in international oil prices are only normal in the current geopolitical situation, and yet these expectations tend to be predominantly hypothetical. Few seem to believe that Iran will actually go all the way and—for the first time in history—make good on its threat to close off Hormuz.\nWhat's more, the U.S. Fifth Fleet is stationed right there to ensure the safe passage of oil cargoes from its Arab allies in the Middle East. Any attempt at a blockade would be interpreted as a direct military confrontation. This would certainly push prices higher, but hardly as high as US$250 a barrel.\nFor now, however, prices appear to be stable, with Brent hovering around US$77 a barrel for most of last week, as upward pressure from the Iran sanctions was met and offset by downward pressure from the tariff spat between the United States and China, where everyone now expects China to announce tariffs on crude oil imports.","url":"https://www.businessinsider.com/oil-price-250-a-barrel-iran-closes-strait-of-hormoz-2018-7"}
