{"authors":["Will Martin"],"date_download":"2018-10-30 20:31:33","date_modify":"2018-10-30 20:31:33","date_publish":"2016-12-30 00:00:00","description":"The price of oil is holding close to highs not seen in as long as 18 months on Friday as balance starts to slowly but surely return to the oil market.","filename":"data/vaneerConsumption/OilpricesonFridayDecember30.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-prices-on-friday-december-30-2016-12_1540931493.html","title":"Oil prices on Friday December 30","title_page":"    Oil prices on Friday December 30 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"I Nabil al-Jurani/AP The price of oil is holding close to highs not seen in as long as 18 months on Friday as balance starts to slowly but surely return to the market after being blighted by a huge supply and demand imbalance for more than two years.\nPrices for both major benchmarks are broadly unchanged in trade on Friday, but have gained a little despite a second consecutive week of crude oil inventory builds, with a U.S. Energy Information Administration (EIA) report on Thursday night showing an unexpected rise in crude stocks.\nWest Texas Intermediate crude, the US benchmark, is trading just below $54 per barrel, up less than 0.4% on the day, as of 8.40 a.m. GMT (3.40 a.m. ET).\nHere's the chart (note the black line showing that oil hasn't been this high since July 2015):\nInvesting.com\nBrent crude, the international benchmark, is also hovering close to 18-month highs, climbing above $57 per barrel for the first time since July last year. Here's the chart:\nInvesting.com\nOil prices have gained substantially in recent weeks following the oil producer's cartel OPEC finally agreeing to cut production at a meeting in late November. The cut will be OPEC's first since 2008, and brings to an end a period where member nations have pumped as much oil as they wish.\nThe move is designed to end the huge glut of the world's most important commodity that has helped drive prices down from more than $100 per barrel in mid-2014\nAccording to a poll undertaken by Reuters on Thursday, oil prices will gradually rise toward $60 per barrel by the end of 2017, with further upside capped by a strong dollar, a likely recovery in U.S. oil output and possible non-compliance by OPEC with agreed cuts.","url":"https://www.businessinsider.com/oil-prices-on-friday-december-30-2016-12"}
