{"authors":["Warren Patterson"],"date_download":"2018-10-30 23:12:13","date_modify":"2018-10-30 23:12:13","date_publish":"2018-07-19 00:00:00","description":"There have been mounting oil supply concerns over recent months. But now Saudi Arabia is promising record production and the US is mulling an SPR release. Still, the oil market remains vulnerable to supply shocks.","filename":"data/vaneerConsumption/Oilpriceslookpoisedtoweakenbutmarketstillvulnerabletoshocks.json","image_url":"https://amp.businessinsider.com/images/5b4f81c6f47d3479038b469f-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-prices-look-poised-to-weaken-but-market-still-vulnerable-to-shocks-2018-7_1540941133.html","title":"Oil prices look poised to weaken but market still vulnerable to shocks","title_page":"    Oil prices look poised to weaken but market still vulnerable to shocks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Time to say goodbye to the backwardation?\nOne of the most interesting changes in the oil market has been the ICE Brent forward curve, the front end has flattened considerably, which has seen the backwardation in the prompt spread flip to contango. Trade war concerns do seem to have pulled out a lot of macro money from the oil market, along with the broader risk-off approach across the commodities complex. The flatter curve does now appear to be more aligned with a somewhat weaker physical market. A flatter curve also means that the market becomes less appealing to those speculators who have enjoyed the roll yield, and so the potential for further long liquidation at the front end, keeping the curve under pressure.\nThe same however cannot be said for WTI. While the prompt WTI spread has come in considerably since the start of July, from over $2.50/bbl to just under $1/bbl currently, the curve is still in deep backwardation, with the spot US physical market looking tighter. Inventories in Cushing have fallen to 25.7MMbbls, down from 57.6MMbbls at the same stage last year, and the lowest inventory levels at the WTI delivery hub since 2014. The 360Mbbls/d Syncrude outage in Alberta, Canada will certainly not help, with the facility only expected to be fully operational by September. As of yet, flows from Canada do not seem to have been affected, in fact, Canada exported a record 3.73MMbbls/d the week following the outage. However moving forward, this loss in supply should start to feed through to lower flows into the US. Syncrude recently stated that they will cut supply to buyers by 35% over August.\nING\nUS SPR release? President Trump has put a large amount of pressure on OPEC to increase output, in the hope that this would see domestic gasoline prices edge lower. However, it would appear he has grown frustrated that they are not responding to his 2MMbbls/d increase request. So it seems that he may take matters into his own hands now, with media reports that the US is looking at a release from the Strategic Petroleum Reserve, with anything ranging between 5-30MMbls. In terms of ability to do so, the US sits on a significant amount of SPR, with it totalling 660MMbbls. As the US has become a bigger crude oil producer, net imports of petroleum have fallen significantly, and so the amount of SPR that the US must hold has also fallen. At the moment the US holds around 295 days of import coverage. Under IEA regulations, the US needs to hold just 90 days of import cover, and this includes both private and public inventories. So there is plenty of room for a release, however it may be more effective if the government were to put in place some export restrictions on refined products.","url":"https://www.businessinsider.com/oil-prices-look-poised-to-weaken-but-market-still-vulnerable-to-shocks-2018-7"}
