{"authors":["Eyder Peralta"],"date_download":"2018-10-23 05:19:34","date_modify":"2018-10-23 05:19:34","date_publish":"2015-05-20 00:00:00","description":"A pipeline rupture spilled some 105,000 gallons of crude. Some beaches were evacuated, and it's unclear if they will reopen in time for Memorial Day.","filename":"data/vaneerConsumption/OilSpillNearSantaBarbaraFoulsCaliforniaCoastline.json","image_url":"https://media.npr.org/assets/img/2015/05/20/ap225970812635_wide-211a2c1d2cfd162ad9916edc1dd555deb918434f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_05_20_408176115_oil-spill-off-california-coast-fouls-4-miles-of-coastline_1540271974.html","title":"Oil Spill Near Santa Barbara Fouls California Coastline","title_page":"Oil Spill Near Santa Barbara Fouls California Coastline  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Oil Spill Near Santa Barbara Fouls California Coastline\nEnlarge this image toggle caption Mike Eliason/AP Mike Eliason/AP\nUpdated at 6:49 p.m. ET\nA nine-mile slick of spilled crude has fouled parts of the California coastline near Santa Barbara, officials say.\nMark Crossland, a captain with the California Department of Fish and Wildlife, said some wildlife will likely be affected because of the spill.\nThe Los Angeles Times reports that an underground pipeline ruptured and spilled about 105,000 gallons of crude. The Associated Press says it's unclear how much of that ended up in the ocean, but the Plains All American Pipeline company, which operates the pipeline, says the estimate remains 21,000 gallons. The Times adds:\n\" 'It is horrible,' said Brett Connors, 35, a producer from Santa Monica who said he spotted sea lions swimming in the oil slick. 'You want to jump in there and save them.' \"Federal, state and local authorities arrived at the scene to investigate the cause of the leak and coordinate cleanup efforts, said Alexia Retallack, spokeswoman for the California Office of Spill Prevention and Response. Gov. Jerry Brown was briefed on the incident and is 'monitoring the situation with great concern,' said spokesman Evan Westrup.\"\nNBC News reports that Refugio State Beach was evacuated and authorities issued warnings for another beach.\n\"Officials could not say whether the beaches would be open in time for the holiday weekend,\" NBC reports. \"Campers were forced out of a nearby state park.\"\nUSA Today reports that Plains All American Pipeline, which owns the ruptured pipeline, said it regretted the incident and that it was \"making every effort to limit its environmental impact.\"\nUSA Today adds:\n\"The scenic stretch of coastline about 20 miles northwest of the pricey real estate of Santa Barbara is dotted with state-run beaches that are popular with campers, and the spill comes just a few days before the Memorial Day holiday weekend and subsequent summer camping season begin. \"The stretch of coastline is also home to many oil rigs and drilling operations, and small amounts of tar and seepage show up on beaches, but in much smaller amounts. \"The Coast Guard, county emergency officials and state parks officials had begun cleaning up the spill.\"\nThe Santa Barbara County Office of Emergency Management said it could three days to clean up the spill.","url":"https://www.npr.org/sections/thetwo-way/2015/05/20/408176115/oil-spill-off-california-coast-fouls-4-miles-of-coastline"}
