{"authors":["Will Martin"],"date_download":"2018-10-30 22:46:20","date_modify":"2018-10-30 22:46:20","date_publish":"2016-12-12 00:00:00","description":"Shares in Europe's oil companies took a leg higher on Monday after a deal between OPEC and non-OPEC countries to cut oil production and boost prices.","filename":"data/vaneerConsumption/OilstockssurgeafterOPECandnonOPECstatesagreedeal.json","image_url":"https://amp.businessinsider.com/images/584ed4f2dd08955d558b4824-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_oil-stocks-surge-after-russia-saudi-arabia-deal-2016-12_1540939580.html","title":"Oil stocks surge after OPEC and non-OPEC states agree deal","title_page":"    Oil stocks surge after OPEC and non-OPEC states agree deal - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Stefano Rellandini Shares in companies operating in the oil sector had a great day on Monday, as the price of crude oil surged following the announcement of a historic deal between Saudi Arabia and Russia.\nEarly on Monday, the price of oil jumped more than 5% after the deal between OPEC and non-OPEC countries was announced by Saudi Oil Minister Khalid al-Falih late on Saturday. The deal will cut production with the aim of boosting prices and making production more profitable.\nAt the core of the deal was an agreement between Saudi Arabia, the world's biggest oil producer and a core member of the OPEC group, and Russia, which led a consortium of other non-OPEC countries, to cut production by more than 500,000 barrels a day.\nSaudi Arabia also surprised the market with deeper than expected cuts in its own domestic production, sending oil past $52 a barrel as the market opened. Through the day oil pulled back from its highest levels, but still enjoyed a great Monday.\nThis, in turn, pushed stocks for companies operating in oil, and the broader energy sector, skyward. The STOXX Europe Oil & Gas index, which tracks a broad group of Europe's biggest oil and gas companies, was up 2.5% early in the day, eventually closing 1.5% higher. Here's the chart:\nInvesting.com\nSmaller oil producers, as well as exploration companies are the biggest beneficiaries of oil's rally on Monday, with FTSE 250 oil and gas explorer Tullow Oil climbing almost 9% in the first hour of trade, before pulling back a little as the day progressed. Here is how that looks:\nInvesting.com\nThe relationship between oil stocks and oil is a pretty straightforward one. When the price of oil climbs, it means companies producing the world's most important commodity can make more cash, more easily, which for investors is obviously something that is welcome.\nThat is especially true in the current climate, where subdued oil prices — which remain around half of what they were in mid-2014 — have hurt the finances of pretty much every single oil producer.\nIn the broader European equity markets, it was something of a mixed day, with Britain's FTSE 100 the biggest mover, losing 0.96%, dragged lower by outsourcing firm Capita, which lost 5.6%. Here's the scoreboard across the continent:","url":"https://www.businessinsider.com/oil-stocks-surge-after-russia-saudi-arabia-deal-2016-12"}
