{"authors":["Hannah Al-Othman For Mailoline"],"date_download":"2018-10-23 02:19:32","date_modify":"2018-10-23 02:19:32","date_publish":"2017-03-10 11:25:54","description":"Simpson could be released as early as October after serving just nine years of his 33-year sentence, subject to the result of a parole hearing, which is due to take place in July this year.","filename":"data/vaneerConsumption/OJSimpsonsettocashinbyappearingonrealityTV.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/31DC2F0F00000578-0-image-a-48_1489144295190.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300740_O-J-Simpson-set-cash-appearing-reality-TV_1540261172.html","title":"O.J. Simpson set to cash in by 'appearing on reality TV'","title_page":"O.J. Simpson set to cash in by 'appearing on reality TV' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"O.J. Simpson is set to cash in on his notoriety by appearing on reality TV when he is released from prison this year.\nSimpson could be released as early as October after serving just nine years of his 33-year sentence, subject to the result of a parole hearing, which is due to take place in July this year.\nAccording to TMZ, reality TV production companies are keen to sign Simpson, floating ideas for shows including a televised interview and a documentary.\nO J Simpson stands during sentencing at the Clark County Regional Justice Center in Las Vegas, Nevada\nTMZ 'contacted a number of reality TV production companies, TV agents and platforms where such a show could run', and reported that 'some producers are getting ready to scramble to sign him.'\nThe producers said the show would likely air on Pay-Per-View because broadcasters would face a public backlash if they tried to air the show, and advertisers would be unlikely to pay for slots.\nWhile O.J. remains incarcerated, television shows about him have been big hits, including drama The People v. O.J. Simpson and Oscar-winning documentary O.J.: Made in America.\nCuba Gooding Jr. stars as O.J. in television drama The People v. O.J. Simpson\nOctober 1 is the earliest possible parole date for the 69-year-old former NFL star, and it is expected that a parole board will recommend his release due to his age and the fact that he has been a 'model prisoner' inside.\nThe points-based system in Nevada reflects issues such as gang membership, drug and alcohol abuse and age in assessing parole eligibility.\nSimpson could be released as early as October after serving just nine years of his 33-year sentence\nHe would need less than five points to be considered 'low risk', and will need to win over four of seven commissioners at his parole hearing.\nSince 2008, Simpson has been imprisoned at Lovelock Correctional Center, a medium-security facility in rural Nevada.\nHe was found guilty in 2008 of 12 counts including kidnapping, robbery and assault with a deadly weapon.\nSimpson and armed accomplices robbed memorabilia collectors Alfred Beardsley and Bruce Fromong of Simpson memorabilia in a Las Vegas hotel room in November 2007.\nSimpson, who has claimed that he was unaware that the men with him were armed, alleged the pair had stolen items from him.\nThe conviction was 13 years to the day after Simpson was acquitted of murdering his ex-wife Nicole Brown-Simpson and her friend Ron Goldman in one of the most famous trials in American history.\nO.J. Simpson, pictured, with his ex-wife Nicole Brown-Simpson was found not guilty of killing her at a criminal trial\nAlthough Simpson was found not guilty at the 1995 criminal trial, a civil court jury two years later unanimously found him liable for the wrongful death of and battery against Goldman, and battery against Brown.\nA civil court jury unanimously found Simpson liable for the wrongful death of and battery of Ron Goldman\nSimpson was ordered to pay $33.5million in damages, made up of $8.5 million in compensatory damages to the Goldmans and $25 million in punitive damages to be split between the Goldmans and Nicole's children.\nAn auction of O.J.'s belongings in 1999 raised almost $500,000, which went to the Goldman family, they but could not by law touch his $25,000-a-month pension from the NFL.\nIn 1997, he was evicted from the home where he had lived for 20 years, at 360 North Rockingham Avenue, after defaulting on the mortgage, and he subsequently moved from California to Miami in Florida, one of the few states where a person's home cannot be seized to collect a debt.\nEven in prison he is receiving as much as $300,000 a year from his NFL pension.\nO.J. has already attempted to cash in on his crimes with a book and TV special titled If I Did It.\nOJ Simpson in court listening to testimony by LAPD Detective Tom Lang during his murder trail\nThe book was originally due to be published by ReganBooks, an imprint of HarperCollins, and was set to be promoted via a television special featuring an interview with Simpson on Fox Broadcasting Company.\nO.J.'s co-author has said O.J. confessed to the double murder in the book, and following a public outcry, both the release of the book and the special were cancelled.\nIn 2006, he also starred in his own improv, hidden-camera prank TV show, Juiced, in which he would play a prank on everyday people while secretly filming them and at the end of each prank, before shouting 'You've been Juiced!' at the end.\nJuiced aired on pay-per-view television and was later released on DVD.\nIn 2002, Rolling Stone also reported that Simpson was still making a significant income by signing autographs.","url":"https://www.dailymail.co.uk/news/article-4300740/O-J-Simpson-set-cash-appearing-reality-TV.html"}
