{"authors":["Clemence Michallon For Dailymail.Com"],"date_download":"2018-10-22 21:59:40","date_modify":"2018-10-22 21:59:40","date_publish":"2017-03-10 00:10:09","description":"The 30-year-old (pictured) now works and lives with Patrick McKenna, who was the lead private investigator on her case and also worked for OJ Simpson's defense team during his 1995 trial.","filename":"data/vaneerConsumption/OJSimpsonisinnocentaccordingtoCaseyAnthony.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EBDFE00000578-0-image-a-2_1489103263078.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299338_Casey-Anthony-insists-OJ-Simpson-INNOCENT_1540245580.html","title":"OJ Simpson is innocent according to Casey Anthony","title_page":"OJ Simpson is innocent according to Casey Anthony | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Casey Anthony is insisting OJ Simpson is innocent and has compared her own case to his, saying they had both suffered from 'distorted facts' during their high-profile trials.\nThe 30-year-old is speaking out, five years after being found not guilty of murdering her toddler daughter during a live-cable television trial during which some commentators called her 'America's most hated mother'.\nTwo-year-old Caylee was reported missing in July 2008 by her grandmother. Anthony was arrested the next day. Skeletal remains were found in woods near the Anthony home in December and identified as Caylee's.\nAfter a trial of a month and a half, the jury, who conceded that Anthony had lied to the police, took less than 11 hours to find the mother not guilty of first-degree murder, aggravated manslaughter and aggravated child abuse.\nAnthony now works for Patrick McKenna, who was the lead private investigator on her case, and lives in his South Florida home. McKenna also led investigations for OJ Simpson's defense team during his 1995 trial.\nScroll down for video\nCasey Anthony (pictured last month in West Palm Beach, Florida, posing next to a photo of her daughter) has compared her own case to that of OJ Simpson, saying he is innocent\nThe 30-year-old (pictured in Delray Beach, Florida last month) now works for Patrick McKenna, who was the lead private investigator on her case, and lives in his South Florida home\nAnthony (pictured left in court in 2011) was dramatically acquitted of murdering her two-year-old daughter Caylee (right) after a highly publicized trial in Orlando, Florida\nThe mother, who said she would like to get her private investigator's license one day, told the Associated Press during a series of five interviews that she had reviewed McKenna's notes and emerged convinced of Simpson's innocence, while finding similarities between their two cases.\nYears before Anthony's daughter went missing, Simpson was acquitted of killing his wife and her friend. Anthony, too, was acquitted, and she said both defendants were tried unfairly in the court of public opinion.\n'There are a lot of parallels. And I can empathize at least a little bit with his situation,' Anthony said.\nShe explained how she had done through McKenna's documents and had formed her own opinion on the case.\n'And, I don't like the fact that after all these years - the system worked, and I've gone through Pat's notes, I've gone through Pat's files. I can say, independently - without just being biased because of my connection to the investigator - I can say from what I have researched, the timeline doesn't make sense,' she added.\nThe mother then dismissed two elements the prosecution tried to use against Simpson in the courtroom: a bloody glove and a bloody shoe print found at the scene.\nThe mother (pictured looking at a drawing made by Caylee) said she and Simpson were tried unfairly in the court of public opinion and she could emphasize 'at least a little bit' with him\nIn the same series of interviews, Anthony said she doesn't know if she'd be 'dumb enough' to have another child, fearing that some 'jackass' or 'snot-nosed kid' would say something mean\nAnthony said she saw 'a lot of parallels' between Simpson's case and hers and said she had down her own research and emerged convinced of his innocence\nSimpson was found not guilty in 1995 of murdering his ex-wife Nicole Brown Simpson (left) and Ron Goldman (right) at the end of a high-profile trial\n'OJ's hand was twice the size of the glove even if it was left out in the rain and shrunk,' Anthony said.\n'His hand could have never, under any set of circumstances unless he was 5 years old, would have ever fit in those gloves. There were at least 10 different types of shoes that could've made those same tread marks as those Bruno Magli shoes.'\nMcKenna was the man who unearthed the Mark Fuhrman tapes, in which the Los Angeles cop could be heard using the N-word 41 times during a racist rant - one of the most damning pieces of evidence used against the detective, a key witness of the prosecution.\nAnthony said her own interest with Simpson's case began after she overheard McKenna speak about the case.\n'I had overheard the critiques and criticisms he has received. And every time there is a stupid OJ thing that pops up, half of my DVR is all OJ c**p,' she said.\n'Because he wants to see what's out there, he wants to see what's being said because after all this time he would still be fighting for OJ's innocence.'\nAsked if she felt there was a connection Simpson and herself, Anthony said:' We were both extremely high-profile cases, where there were a lot of distorted facts and things...'\nIn the same series of interviews, Anthony said she doesn't know if she'd be 'dumb enough' to have another child, fearing that some 'jackass' or 'snot-nosed kid' would say something mean to her son or daughter, given her legal history.\nShe insisted that she still had no idea what happened to Caylee, and imagined that if her daughter were still alive, she'd be almost 12 and a 'total badass' who would listen to 'classic rock', play sports and take 'no nonsense'.\nMcKenna (pictured with Anthony last year) was the man who unearthed the racist cop tapes used as key evidence against the prosecution during Simpson's trial\nAnthony's mother Cindy (pitctured right next to her husband George in 2011) reported Caylee missing in July 2008 claiming not to have seen her for a month\nThe 30-year-old says she still does not know how her toddler daughter died. Caylee's skeletal remains were found in 2008 in a wooded area behind the family's house\nIt's been almost nine years since Caylee went missing, and almost six since the circus-like Orlando trial that ended in her mother's acquittal. Anthony now views herself as something of an Alice in Wonderland, with the public as the Red Queen.\n'The queen is proclaiming: \"No, no, sentence first, verdict afterward,'' ' she said. 'I sense and feel to this day that is a direct parallel to what I lived. My sentence was doled out long before there was a verdict. Sentence first, verdict afterward. People found me guilty long before I had my day in court.'\nThe child was supposedly last seen on June 16, 2008; she was first reported missing, by Anthony's mother, on July 15. A day later, Anthony was arrested on charges of child neglect. She told police that Caylee had disappeared with a baby sitter.\nA utility worker working in a wooded area near the Anthony home on December 11 found skeletal remains that were later determined to be Caylee's. Experts would testify that air samples indicated that decaying human remains had been present in Casey Anthony's trunk.\nIn the end, prosecutors proved Casey Anthony was a liar, but convinced the jury of little else. The government failed to establish how Caylee died, and they couldn't find her mother's DNA on the duct tape they said was used to suffocate her. The jury found her not guilty of having killed her daughter.\nStill, the Florida Department of Children and Families concluded that Anthony was responsible for her daughter's death because her 'actions or the lack of actions ... ultimately resulted or contributed in the death of the child.'\nJust this month, former Circuit Judge Belvin Perry Jr, who presided at the trial, theorized that Anthony may have killed Caylee accidentally when she was using chloroform to calm her.\nShe was convicted of four counts of lying to police (though two counts were later dropped), and served about three years in prison while awaiting trial. A thousand people were there to see her released.\nShe admitted she lied to police: about being employed at Universal Studios; about leaving Caylee with a baby sitter; about telling two people, both of them imaginary, that Caylee was missing; about receiving a phone call from Caylee the day before she was reported missing.\nTHE DEATH OF CAYLEE ANTHONY AND THE CASE AGAINST HER MOM Casey Anthony is pictured above during her 2011 trial Caylee was supposedly last seen on June 16, 2008; she was first reported missing by Casey Anthony's mother on July 15. A day later, Casey Anthony was arrested on charges of child neglect. She told police that Caylee had disappeared with a babysitter. A utility worker working in a wooded area near the Anthony home on December 11 found skeletal remains which were later determined to be Caylee's. Experts would testify that air samples indicated that decaying human remains had been present in Casey Anthony's trunk. In the end, prosecutors proved Casey Anthony was a liar, but convinced the jury of little else. The government failed to establish how Caylee died, and they couldn't find her mother's DNA on the duct tape they said was used to suffocate her. After a six week trial, the jury took less than 11 hours to find Anthony not guilty of first-degree murder, aggravated manslaughter and aggravated child abuse. Still, the Florida Department of Children and Families concluded that Anthony was responsible for her daughter's death because her 'actions or the lack of actions... ultimately resulted or contributed in the death of the child'. And last month former Circuit Judge Belvin Perry Jr, who presided at the trial, theorized that Anthony may have killed Caylee accidentally when she was using chloroform to calm her. She was convicted of four counts of lying to police (though two counts were later dropped), and served about three years in prison while awaiting trial. A thousand people were there to see her released.\nAnthony still dreads the supermarket checkout line for fear she'll see photos of her daughter on the cover of tabloid papers. Her bedroom walls are decorated with photos of Caylee and she weeps when she shows off her daughter's colorful, finger-painted artwork.\nStill, she asserts she is happy. For her 31st birthday she plans to go skydiving. She enjoys taking photos, mostly of squirrels and other wildlife. And she loves her investigative work.\n'I love the fact that I have a unique perspective and I get a chance to do for other people what so many others have done for me,' she said. Someday, she said, she'd like to get a private investigator's license and work for a defense team.\nShe talked of working on a DUI manslaughter case where the accused took a plea deal.\n'I look at him and I think this kid almost lost his life for something they can't definitively prove that he did,' she said. 'I've lived it firsthand. I didn't do what I was accused of but I fought for three years. Not just for me, but for my daughter.'\nOccasionally she goes out with friends to area bars and has struck up a few short-lived romantic relationships. When she is out in public, men are attracted to her long, dark locks and petite frame, and often pay for her signature drinks: either a Fat Tire beer or a Jack Daniels and diet coke, with a lime wedge. But news that she is there spreads quickly; people whisper and snap photos, and she retreats to her newly purchased SUV so she can return home, alone.\nAnthony speaks defiantly of her pariah status.\n'I don't give a s**t about what anyone thinks about me, I never will,' she said. 'I'm OK with myself, I sleep pretty good at night.'","url":"https://www.dailymail.co.uk/news/article-4299338/Casey-Anthony-insists-OJ-Simpson-INNOCENT.html"}
