{"authors":[],"date_download":"2018-10-22 21:06:43","date_modify":"2018-10-22 21:06:43","date_publish":"2014-05-05 18:58:42","description":"The governor gave Charles Warner a two-week reprieve but his lawyers have asked an appeals court for a six-month postponement.","filename":"data/vaneerConsumption/OklahomaDeathRowInmateAsksforSixMonthLethalInjectionDelay.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/408261/140429-oklahoma-gurney-tnc-1241_61326bdd2d543922241497f5878ccc29.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_oklahoma-death-row-inmate-asks-six-month-lethal-injection-delay-n97466_1540242403.html","title":"Oklahoma Death Row Inmate Asks for Six-Month Lethal Injection Delay","title_page":"Oklahoma Death Row Inmate Asks for Six-Month Lethal Injection Delay","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe next death-row inmate scheduled for execution in Oklahoma asked a court Monday for a six-month delay while the investigation of a botched lethal injection unfolds.\nCharles Warner was supposed to be put to death April 29 for the rape and murder of an 11-month-old, but his execution was called off amid the chaos over fellow prisoner Clayton Lockett's death hours earlier.\nLockett, a murderer and rapist, appeared to regain consciousness and writhe in pain several minutes after a new cocktail of drugs was administered.\nState officials later disclosed that they couldn't find an injection site on Lockett's arms or legs and so ran a line through his groin, only to have a vein collapse.\n\"lt appears that Mr. Lockett was never fully sedated by the first drug in Oklahoma’s new protocol before the injection of the excruciatingly painful second and third drugs, vecuronium bromide and potassium chloride,\" Warner's lawyers wrote in a petition to the Oklahoma Court of Criminal Appeals.\nThey noted that it could take months before authorities have a clear picture of what went wrong during Lockett's execution and revise the state's protocol.\nGovernor Mary Fallin has said she would extend her two-week stay of execution if necessary, but defense lawyers note she can only postpone it for up to 60 days.\n\"The state lawfully carried out a sentence of death,\" Fallin said in a statement Monday. \"Justice was served.\"\n\"The people of Oklahoma do not have blood on their hands,\" she added.","url":"https://www.nbcnews.com/storyline/lethal-injection/oklahoma-death-row-inmate-asks-six-month-lethal-injection-delay-n97466"}
