{"authors":["Jordan Gass-Poore For Dailymail.Com"],"date_download":"2018-10-22 22:37:52","date_modify":"2018-10-22 22:37:52","date_publish":"2017-03-16 04:19:25","description":"Senator Ralph Shortey, 35, (pictured with Donald Trump Jr) who was a leader in President Trump's campaign faces prostitution charges after he was found in a motel room with a teenage boy.","filename":"data/vaneerConsumption/OklahomaGOPsenatorfoundinamotelroomwithteenboy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E52131800000578-0-image-a-16_1489643217798.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318684_Oklahoma-GOP-senator-motel-room-teen-boy_1540247872.html","title":"Oklahoma GOP senator found in a motel room with teen boy","title_page":"Oklahoma GOP senator found in a motel room with teen boy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shortey is pictured here with Donald Trump Jr. The GOP senator deleted this photo from his Facebook account shortly after news broke that he was found in a motel room with a teen boy\nA married-with-children Oklahoma senator who was a leader in President Donald Trump's primary campaign faces prostitution charges after he was found in a motel room that reeked of 'raw marijuana' with a teenage boy that he offered money for 'sexual stuff', police said.\nState Senator Ralph Shortey, 35, who deleted a picture of himself and Donald Trump Jr from his Facebook page shortly after news of his arrest broke, is an avowed supporter of the president and served as his Oklahoma state chair in the primaries.\nShortey and the unidentified teenager were found together at a Super 8 Motel in Moore, Oklahoma, around 1am on March 9, after an anonymous tip was made to police requesting a welfare check.\nShortey and the teenager, who is 16 or 17 years old, admitted to police they had engaged in electronic conversations 'pertaining to sexual activities in exchange for money', according to a court affidavit.\nThe age of consent in Oklahoma is 16.\nOklahoma Senator Ralph Shortey, 35, (pictured) has been suspended after he was found in a hotel room that reeked of marijuana with a teenage boy that he offered money for 'sexual stuff'\nTheir text messages, going back nearly a year, were recorded on the teenager's Kindle tablet that was confiscated as evidence, police said.\nPolice became involved after being called by the boy's father, who had been contacted by his son's girlfriend, NewsOK reports.\nThe unidentified girl told police that her boyfriend had said he was 'going to get paid tonight', and she feared he might be 'involved in illegal drugs'.\nSo, she told police she watched him get into a white Jeep Grand Cherokee with a man and followed them to the Super 8 Motel.\nPolice said the boy was known to solicit himself sexually on Craigslist and had a history of drug abuse.\nPolice found Shortey and the unidentified boy, who is 16 or 17 years old, at this Super 8 Motel in Moore, Oklahoma, around 1am on March 9\nWhen police arrived at the motel, Shortey told them he was alone in the room, but the teenager eventually came out after officers said they were going to enter with a master key from management.\nAfter confronting them in the room that reportedly smelled of marijuana, police found lotion and an open pack of condoms in a backpack.\nShortey had rented the room for one night on March 8, a front-desk manager said.\n'It says two adults registered,' the manager added.\nWhile Shortey has not been arrested, he was suspended by the state Wednesday for disorderly behavior and has been stripped of practically all of his political privileges.\nCleveland County District Attorney Greg Mashburn said he is awaiting the investigator's final report before pursuing criminal charges.\nShortey may be facing three charges: soliciting prostitution of a minor, prostitution within 1,000 feet of a church and transporting for the purpose of prostitution.\nThe Republican from Oklahoma City was first elected in 2010.\nShortey (center) has been married to his wife, Jennifer, since 2002. They have two children\nOklahoma GOP Chairperson Pam Pollard said in a statement: 'We condemn the actions of Senator Ralph Shortey to the strongest degree.\n'While we believe in the right to a fair trial and that all people deserve their day in court, the accusations against Ralph Shortey are in no way in line with the principles of the Oklahoma Republican Party.'\nEarlier this year Shortey advised former state Representative Dan Kirby during a sexual harassment scandal. Kirby later resigned.\nShortey has been married to his high school sweetheart, Jennifer, since 2002. They have two children.\nBefore beginning his political career, Shortey attended Heartland Baptist Bible College in Oklahoma City in preparation for mission work in Uganda.","url":"https://www.dailymail.co.uk/news/article-4318684/Oklahoma-GOP-senator-motel-room-teen-boy.html"}
