{"authors":[],"date_download":"2018-10-22 21:06:59","date_modify":"2018-10-22 21:06:59","date_publish":"2014-05-05 08:50:48","description":"\"Whoever is responsible for the fire is financially responsible for the damages,\" Fire Chief Eric Harlow said.","filename":"data/vaneerConsumption/OklahomaWildfiresTurnDeadlyDestroyHomes.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/419691/140505-oklahoma-aerial-fire-photos_dba85fce5ccdd2ea024620452dbf992e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_oklahoma-wildfires-turn-deadly-destroy-homes-n96981_1540242419.html","title":"Oklahoma Wildfires Turn Deadly, Destroy Homes","title_page":"Oklahoma Wildfires Turn Deadly, Destroy Homes","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFire crews working to extinguish an Oklahoma wildfire that forced at least a thousand people from their homes battled reignited hot spots on Monday, as forecasters expected the windy and dry weather to intensify on Tuesday, officials said.\nMore than 40 fire departments were deployed to battle the 4,000-acre blaze from the time it was reported on Sunday at 4:26 p.m., according to a statement from the City of Guthrie.\nA 56-year-old man died after he chose not to evacuate his home near Guthrie, the city's Fire Chief Eric Harlow said. At least 36 people were treated for minor injuries, including fatigue, smoke inhalation and dehydration, according to the Oklahoma Emergency Medical Services Authority.\nThe fire was 75 percent contained, but had impacted 6,000 people, Harlow said during a news conference Monday morning. Some hot spots had reignited Monday afternoon and the heavily wooded terrain was challenging firefighters, NBC affiliate KFOR reported.\nTwo Black Hawk helicopters from the Oklahoma National Guard arrived at the scene Monday afternoon to douse the flames from overhead, according KFOR. Oklahoma Forestry Services said it had dispatched specialist wildfire teams to the scene, backed up by bulldozers and fire engines.\nGov. Mary Fallin said in a statement she was considering a statewide burn ban, as well as a declared state of emergency. Only six counties in Oklahoma were under burn bans on Monday afternoon, according to Oklahoma Forestry Services.\nA burn ban makes it illegal to \"set fire to any forest, grassland, crop or any other wildlands, or build a bonfire, campfire or to burn trash,\" according to the OFS.\nWinds gusted at 30 mph on Monday, while temperatures soared to 93 degrees. Greater winds, low humidity and temperatures in the high 90s could plague the state again on Tuesday and Wednesday, according to Weather.com.\n“Fire weather conditions will continue today through Thursday across a large part of western Oklahoma,” the Oklahoma Department of Emergency Management said.","url":"https://www.nbcnews.com/news/us-news/oklahoma-wildfires-turn-deadly-destroy-homes-n96981"}
