{"authors":[],"date_download":"2018-10-22 22:02:41","date_modify":"2018-10-22 22:02:41","date_publish":"2014-05-08 17:17:29","description":"A stay of execution was issued because the state is still investigating the botched lethal injection of Clayton Lockett last month.","filename":"data/vaneerConsumption/OklahomaDelaysNextExecutionforSixMonths.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/408261/140429-oklahoma-gurney-tnc-1241_61326bdd2d543922241497f5878ccc29.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_oklahoma-delays-next-execution-six-months-n100516_1540245761.html","title":"Oklahoma Delays Next Execution for Six Months","title_page":"Oklahoma Delays Next Execution for Six Months","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn Oklahoma court has ordered a six-month delay in the execution of a man who was supposed to be put to death right after the botched lethal injection of Clayton Lockett last month.\nCharles Warner's original execution was called off amid the chaos in the death chamber on April 29, and the governor gave him a two-week reprieve.\nWarner's lawyers demanded more time and in court papers filed Thursday, the state attorney general said he would not object if the court issued a six-month stay of execution.\nThe Oklahoma Court of Criminal Appeals signed off on a stay of execution within hours.\n\"Indeed, if the State is allowed to enforce the ultimate penalty of death, it is incumbent upon this Court to allow the State the time necessary to ensure that the penalty is carried out in a constitutionally sound manner,\" one judge wrote.\nWarner's lawyers said in a statement that they were \"greatly relieved\" by the court's decision.\n\"We await the results of an independent autopsy on Clayton Lockett, and expect full transparency from Oklahoma regarding all findings about what went wrong in Mr. Lockett’s death,\" attorneys Susanna Gattoni and Seth Day wrote.\nGov. Mary Fallin, who objected to execution delays before April 29, has tapped her own public safety commissioner to lead a probe of the execution debacle, which drew international attention and sparked fresh debate over lethal injections.\nLockett, who was sentenced to die for shooting a young woman and ordering her buried alive, appeared to regain consciousness and writhe in pain during his execution — which marked the first time the state was using a new three-drug cocktail, witnesses said.\nThe execution was halted but he died a few minutes later. Prison officials blamed a vein failure, but Lockett's lawyer has suggested the drugs themselves, obtained under a veil of secrecy, might have played a role in the tortuous process.\nWarner, who is on death row for the rape and murder of an 11-month-old baby, was supposed to be put to death two hours after Lockett.\nThe controversy around the lethal injection could also benefit a second death-row prisoner.\nRichard Glossip, who was convicted of orchestrating the killing of a hotel manager he thought was going to fire him, has lost his latest appeal, paving the way for the state to ask the court to set an execution date.\nNormally, Oklahoma would ask for a date 60 days in the future, but in Thursday's filing, state lawyers asked that the court consider the status of the Lockett investigation, suggesting the execution would not happen until much later.\n— Tracy Connor","url":"https://www.nbcnews.com/storyline/lethal-injection/oklahoma-delays-next-execution-six-months-n100516"}
