{"authors":["Joe Wertz"],"date_download":"2018-10-23 00:54:01","date_modify":"2018-10-23 00:54:01","date_publish":"2014-05-30 00:00:00","description":"Four years of crippling drought has withered the agricultural economies of Great Plains states like Oklahoma. The USDA forecasts this year's wheat crop will be half what it would be in a good year.","filename":"data/vaneerConsumption/OklahomasExtremeDroughtHasWheatFarmersBracingForWorst.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2014_05_30_317368805_oklahomas-extreme-drought-has-wheat-farmers-bracing-for-worst_1540256041.html","title":"Oklahoma's Extreme Drought Has Wheat Farmers Bracing For Worst","title_page":"Oklahoma's Extreme Drought Has Wheat Farmers Bracing For Worst : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Oklahoma's Extreme Drought Has Wheat Farmers Bracing For Worst\ntoggle caption Joe Wertz/StateImpact Oklahoma\nRainfall totals in southwest Oklahoma are more than 3 inches below normal. And that means that the wheat crop grown in brothers Fred and Wayne Schmedt's farm is several inches shorter than normal as well.\nLaughter is key to surviving as a farmer here. Fred Schmedt looks out on his field, then down at his legs and laughs at how short the wheat stalks are.\n\"What would you call that, high-shoe-top high?\" he says. \"In a normal year — a really good year — it'd be thigh-high. So we're looking at plants that are 6 to 8 inches tall versus 24 to 30 inches tall.\"\nFour years of extreme drought has withered the agricultural economies of southern Great Plains states like Oklahoma, where farmers are bracing for one of the worst wheat crops in state history.\nEnlarge this image toggle caption Joe Wertz/StateImpact Oaklahoma Joe Wertz/StateImpact Oaklahoma\nWheat is Oklahoma's No. 1 crop. In a good year, Oklahoma produces 120 million to 140 million bushels of wheat. The U.S. Department of Agriculture forecasts this year's crop will be half as big.\nThe economic impact of the annual harvest doesn't end in the field. A bad wheat crop means farmers aren't buying chemicals and equipment, says Jeff Edwards, a wheat expert at Oklahoma State University. And they aren't paying local shops to make repairs. Fewer seasonal workers also means less business for restaurants.\n\"In rural Oklahoma, they make most of their money off the wheat that they bring in,\" Edwards says. \"If they're not bringing in wheat, they're not making money. It's hard for them to keep people employed.\"\nFred Schmedt says he isn't sure if he'll still have work for the \"wheatie,\" a seasonal worker, also known as a \"custom cutter,\" who comes every year to help during the harvest.\n\"The guy that does our combining comes from South Dakota. He's cut our family's wheat since 1973. He sort of needs a job,\" he says.\nA few miles away from the Schmedts' farm, at a grain storage company, you would normally hear trucks coming and going, fertilizer rigs and the whooshing sound of the elevator's giant screw turning as it moves the grain around. But you don't hear any of that.\n\"Just quiet as a mouse around here,\" says Mike Cassidy, who runs the storage company. \"There's not a sound anywhere except the air conditioner running.\"\nCassidy's grandfather built the grain elevator here in 1921. The company employs about 10 people year-round and hires another 10 workers during the harvest. Cassidy says he's not hiring those seasonal workers this year.\nWhile a few farmers will go out of business, others have crop insurance. Cassidy doesn't have that financial lifeline, and while he doesn't think he's going to go under, he's cutting costs, saving money and trying to diversify his business by selling more products, like lumber.\nOne bad sign of the drought's toll is the big, golden hay bales that dot the fields. There shouldn't be so many so early, according to Edwards from Oklahoma State. It's a sign that many farmers have given up on harvesting wheat — they're in salvage mode, just using the stalks to make hay for cattle.\nAnd the state might not even have enough hay, Edwards says. \"It's a big deal for the cattle industry as a whole. The southern Great Plains is the buffer between the cow-calf producer and the feed yard.\"\nRanchers send calves to Oklahoma to fatten up in pastures during the winter. If there's not enough hay, ranchers will have to make other plans. The uncertainty could further push up prices, which are already the highest they've been since the 1980s.","url":"https://www.npr.org/sections/thesalt/2014/05/30/317368805/oklahomas-extreme-drought-has-wheat-farmers-bracing-for-worst"}
