{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:43:28","date_modify":"2018-10-30 18:43:28","date_publish":"2016-02-15 05:26:08","description":"Oklahoma was struck by a 5.1 earthquake on Saturday morning, the third-strongest quake ever recorded in the Sooner State.","filename":"data/vaneerConsumption/OklahomaHitbyThirdStrongestEarthquakeEverRecordedThere.json","image_url":"https://media.breitbart.com/media/2016/02/researcher-graphic-of-oklahoma-earthquakes-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_14__1540925008.html","title":"Oklahoma Hit by Third-Strongest Earthquake Ever Recorded There","title_page":"Oklahoma Hit by Third-Strongest Earthquake Ever Recorded There | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Oklahoma was struck by a 5.1 earthquake on Saturday morning, the third-strongest quake ever recorded in the Sooner State.\nThe quake was centered near the northeastern town of Fairview at 11:07 a.m. and, according to the U.S. Geological Survey, was felt across Arkansas, Iowa, Kansas, Missouri, Nebraska, New Mexico, and Texas. Ten minutes later, a second quake — measured at 3.9 magnitude — struck, and then a third — measuring in at 2.5 — struck at 11:41 a.m.\nThere were no reports of damage or injuries from the series of quakes.\n“We have no reports of damage as of yet, but we did get a good rock n’ roll,” Cheryl Landis with the Major County Sheriff’s Office told CNN.\nUSGS officials say the first quake is one of the strongest on record, third only to a 5.6 temblor that jostled Oklahoma City in November of 2011 and a 5.5 quake that struck near El Reno in 1952.\nCritics of the gas and oil industry say earthquakes have been occurring more frequently in the region due to the growth of the use of fracking as well as disposal wells that inject saltwater into deep underground caverns.\nWhile the USGS did not link the Saturday morning quake to the oil and gas industry, state officials say they have recorded about two-and-a-half earthquakes a day at magnitude 3 or greater. This is a rate 600 times greater than recorded before the year 2008.\nAccording to Fox News, Oklahoma Gov. Mary Fallin recently assigned nearly $1.4 million in state emergency funds to state agencies acting to investigate and to try and reduce the number of earthquakes linked to the wastewater disposal.\nFollow Warner Todd Huston on Twitter @warnerthuston, or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/02/14/oklahoma-hit-by-third-strongest-earthquake-ever-recorded-there/"}
