{"authors":["Rachael Levy"],"date_download":"2018-10-30 21:00:06","date_modify":"2018-10-30 21:00:06","date_publish":"2016-12-23 00:00:00","description":"Olaf Carlson-Wee's Polychain Capital is investing in a new space that few hedge funds venture into.","filename":"data/vaneerConsumption/OlafCarlsonWeesPolychainraisesmoneyfromUnionSquareVentures.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_olaf-carlson-wees-polychain-raises-money-from-union-square-ventures-2016-12_1540933206.html","title":"Olaf Carlson-Wee's Polychain raises money from Union Square Ventures","title_page":"    Olaf Carlson-Wee's Polychain raises money from Union Square Ventures - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Andrew Burton/Getty Images A 27-year-old has raised $10 million for an unusual hedge fund — with the support of venture capitalists like Andreessen Horowitz and Union Square Ventures.\nThe 27-year-old in question is Olaf Carlson-Wee, and he's launching a strategy that invests in cryptocurrencies.\nTo be clear, the $10 million managed by Carlson-Wee's Polychain Capital is peanuts in the hedge fund world. But Polychain's strategy is rare, with few other funds trading in cryptocurrencies. Most hedge funds trade stocks, bonds, and currencies, with variations of different strategies.\nSo what is a cryptocurrency?\nA cryptocurrency is basically a digital, encrypted currency that is decentralized, so no one power oversees its value. Bitcoin is the most famous of cryptocurrencies — nobody knows who created it — and it's divorced from any government. It's considered a secure, private currency, drawing the attention of antigovernment and privacy-minded folks.\nBut it's not the only one — several other cryptocurrencies exist and are being developed.\nTransactions for these currencies are recorded in blockchain, a private and encrypted ledger.\nCarlson-Wee is betting that he can choose the cryptocurrencies that will increase in value — and he expects hundreds of them to enter the market.\n\"The challenge for someone running a hedge fund is how to build a portfolio across that spectrum of risk and how to choose which of the new issues are going to become important and which are not,\" said Brad Burnham, partner at Union Square Ventures, which is investing in the fund.\nOlaf Carlson-Wee. Courtesy of Olaf Carlson-Wee\nPolychain, based in San Francisco, will be small, hiring only a handful of people. And Carlson-Wee is not looking for traditional Wall Street types.\n\"An amateur trader in the cryptocurrency market may have a more relevant background than someone who has had a traditional background on Wall Street,\" Carlson-Wee said.\nCarlson-Wee, a Vassar College grad, wrote his undergrad thesis on bitcoin.\n\"I was immediately enamored and sort of obsessed,\" he said. \"I thought the prospect of [bitcoin] had massive implications.\"\nHe then went to Coinbase, a digital asset exchange, and headed risk, overseeing things like fraud prevention and account security, he said.\nNot only is his background unusual for hedge funds — so is his strategy. For instance, the normal research avenues for common hedge fund trades are unavailable, though there are some parallels.\nQualitative research\nInstead of talking with sell-side researchers or looking at credit agencies (there are none), Carlson-Wee spends his time reading through the white papers that describe the protocols, interviewing the lead developers, and looking at a protocol's machinations in the GitHub repository.\n\"This qualitative research is supplemented by market data such as price and trading volume as well as network data such as transactions per day, dollar value transacted per day, and the estimated cost of a network-scale attack,\" he said.\nHe also embeds himself within the groups that are using the protocols to get a sense of how they are interacting with them, he said.\nPatrick Lux/Getty Images\nThat model is similar to other funds that have launched in the space. MetaStable, another small hedge fund based in San Francisco, launched in 2014 with a handful of employees. The firm manages a few million, said Lucas Ryan, one of MetaStable's staffers.\nIts investors tend to be those who are already sold on blockchain but \"aren't necessary sold that bitcoin has solved all the problems,\" so they are seeking to invest in other cryptocurrencies, Ryan said.\nRyan, who has a programming background, says his job is to evaluate the protocols that people are developing and the problems they are trying to solve.\n\"The market is so immature and requires a high degree of technical understanding to wade through the stuff that isn't bull----,\" Ryan said. \"A lot of stuff I couldn't do if I wasn't a programmer with a cryptography background. There's not, like, a ratings agency for any of these.\"\nStill, like with Polychain's strategy, there are parallels. Ryan meets with protocol developers and tries to get a sense of how serious they are and whether their source coding is legit.\nTo be sure, this world of funds is very young. Until recently, Ryan was working on the fund part time, he said.\nAnd it's unlikely these kinds of funds would grow to be large. Bitcoin, the most popular cryptocurrency, has about a $13.7 billion market cap.\n\"Bitcoin is like 80% of the total market of coins,\" Ryan said. \"It would give someone pause to start a $50 million fund.\"","url":"https://www.businessinsider.com/olaf-carlson-wees-polychain-raises-money-from-union-square-ventures-2016-12"}
