{"authors":["Associated Press"],"date_download":"2018-10-23 04:32:04","date_modify":"2018-10-23 04:32:04","date_publish":"2017-04-26 16:10:55","description":"DETROIT (AP) - Old cars can learn new tricks.For a few hundred dollars, drivers can add new safety technology - like forward collision warning systems or...","filename":"data/vaneerConsumption/OldcarnewtricksAddingsafetytechtoanoldercar.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466045-1493219459-49_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448250_Old-car-new-tricks-Adding-safety-tech-older-car_1540269124.html","title":"Old car, new tricks: Adding safety tech to an older car","title_page":"Old car, new tricks: Adding safety tech to an older car | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DETROIT (AP) - Old cars can learn new tricks.\nFor a few hundred dollars, drivers can add new safety technology - like forward collision warning systems or backup cameras - to older cars.\nCars are lasting longer than ever thanks to improving quality. The average U.S. vehicle is now 11.6 years old, according to the consulting firm IHS Markit.\nFILE - This Wednesday, Oct. 14, 2015, file photo shows a Mobileye camera system that can be installed in your car to monitor speed limits and warn drivers of potential collisions, mounted behind the rearview mirror during a demonstration of the system, in Ann Arbor, Mich. For a few hundred dollars, drivers can add new safety technology, like forward collision warning systems or backup cameras, to older cars. Cars are lasting longer than ever thanks to improving quality. The average U.S. vehicle is now 11.6 years old, according to the consulting firm IHS Markit. (AP Photo/Carlos Osorio, File)\nBut that means millions of car owners are missing out on technology that could potentially save their lives. Forward collision warning systems, for example, can reduce the risk of a crash by 27 percent, according to the Insurance Institute for Highway Safety.\nConsumers have to do the math to decide whether it's better to add aftermarket systems to an older car or save up for a new one. Balance the cost of new safety - which can be hefty - with the increased maintenance older cars usually need. If you don't want an extra camera cluttering up your dashboard, you may want to save up for a new car with built-in systems.\nTo get blind spot monitoring, forward collision warning and lane departure warning on a new, 2017 Altima SL, you have to spend $28,570 for the car and add $3,000 in options.\nFor a fraction of that amount - $500 - you could add an aftermarket forward collision system, backup camera and blind spot detection monitors to an older car. You could also consider a late-model used car. A 2015 Nissan Altima SL with blind spot monitoring, a rearview camera and lane departure warning can be found for less than $20,000, for example.\nBuyers may want to wait on a new car because the cost of safety tech is coming down. Toyota is now offering a $300 package on some vehicles that includes forward collision warning and lane departure warning. Starting with the 2018 model year, all vehicles sold in the U.S. will be required to have backup cameras. And most new cars will have standard automatic emergency braking by 2022.\nShawn Sinclair, an automotive engineer with Consumer Reports magazine, says forward collision warning is the most important feature to consider if you're thinking about adding tech to your car. Even though it won't stop the car from hitting an obstacle - automatic braking isn't available as an aftermarket option - it will warn drivers so they can slow down or maneuver away. Blind spot detection and rear cameras are two others she considers critical.\n\"But at the same time, you have to say, 'Hey I have this 10-year-old car, maybe it's time to turn it in,'\" she said.\nThe quality of aftermarket systems varies considerably. Read reviews or ask a trusted mechanic for recommendations.\nHere are four safety features to consider:\nFORWARD COLLISION WARNING/LANE DEPARTURE WARNING: Sinclair suggests a system from Mobileye, a tech company that also supplies most major automakers. Mobileye's cameras and software can recognize other vehicles, pedestrians, cyclists and even speed limit signs. The system alerts drivers when they leave a lane and when a collision is up to 2.7 seconds away. Sinclair says it costs around $1,000 to buy the system and have it installed by a Mobileye technician.\nThere are many less expensive and easy-to-install dashboard cameras that double as collision warning systems. Garmin's Dash Cam 35 monitors up to 130 feet in front of the vehicle; if the driver is going 30 mph or faster, it will issue audio and visual alerts of impending collisions. The Dash Cam 35 costs $130 on Amazon.com.\nBLIND SPOT DETECTION: Blind spot systems use sensors to monitor the sides of the vehicle and flash an icon to the driver if something is in the way. Sinclair recommends Goshers Blind Spot Detection System, which costs $239. It monitors within 10 feet of the vehicle. Sinclair recommends having a professional install the system; it took her mechanic four hours to do it.\nBACKUP CAMERA: According to government statistics, roughly 250 people are killed each year in backover accidents, many of them children. China's Yada brand makes a weather-proof camera with night vision that attaches to the rear of the car. When the car is in reverse, it sends images wirelessly to a 4.3-inch monitor. Pep Boys sells the system for $129. If you don't want a monitor in your car, Auto Vox has one that displays the image in your rear-view mirror. It's $139 on Amazon.com.\nEMERGENCY ASSISTANCE: Hum, developed by Verizon, works like General Motors' OnStar system. It will automatically call emergency services if the car has been in an accident. It sends alerts to drivers' phones if there's a mechanical problem and lets drivers press a button if they need roadside assistance. Hum works in cars built in 1996 or later. It costs $10 per month; a two-year subscription is required. There are also one-time set-up and activation fees totaling $50.","url":"https://www.dailymail.co.uk/wires/ap/article-4448250/Old-car-new-tricks-Adding-safety-tech-older-car.html"}
