{"authors":[],"date_download":"2018-10-22 22:14:12","date_modify":"2018-10-22 22:14:12","date_publish":"2014-06-09 14:22:03","description":"A new study shows the average age of cars and trucks in America has hit a new all-time high of 11.4 years, up slightly from 11.3 years in 2013.","filename":"data/vaneerConsumption/OldClunkersRuletheRoadsAmericansAreDrivingCarsLonger.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/496436/140609-driving-cars-longer-jsw-1006a_4c6ddad9d9ea757bfc51d83da0dda172.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_old-clunkers-rule-roads-americans-are-driving-cars-longer-n126226_1540246452.html","title":"Old Clunkers Rule the Roads: Americans Are Driving Cars Longer","title_page":"Old Clunkers Rule the Roads: Americans Are Driving Cars Longer","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe great recession may have officially ended a few years ago, but the lingering impact can be seen in the cars and trucks that many Americans drive.\nTheir vehicles are old.\nIn fact, a new study shows the average age of cars and trucks in America has hit a new all-time high of 11.4 years, up slightly from 11.3 years in 2013.\n\"It's obvious many Americans are holding onto their cars longer and that's really accelerated since the recession,\" said Mark Seng with IHS Automotive which analyzed auto registrations in the U.S. on January 1.\nA decade ago, the average vehicle in the U.S. was 9.7 years old according to IHS Automotive.\nNot only is the average vehicle in America getting older, the study found the country also has a record number of vehicles in operation as the total topped 252.7 million, an increase of 3.7 million vehicles from last year.\nSixteen-year-old cars and trucks make up 21.1 percent of vehicles in the U.S. as owners embrace the idea of driving their car well past the 100,000 mile mark.\nHow many of these \"pre-'99\" models are still around?\n53.3 million.\nTo put that into perspective, on average, every state in the country has registered more than one million vehicles that are at least 16 years old.\n\"The fact we still see so many of these old cars and trucks still on the road has surprised me a little bit,\" said Seng. \"Ten years ago I probably wouldn't have imagined we'd see such a large number of cars at least 16 years old still on the road.\"\nThe continued growth in older vehicles explains why after-market auto parts retailers like O'Reilly Auto Parts and AutoZone have done so well in the last few years.\nSeng says the sweet spot for repairing older vehicles used to be when models were 7-10 years old. Now he believes the sweet spot for repairs in between 9 and 12 years of age.\nWhile vehicles in America are ageing, the surge in new model auto sales over the last two years means many people are trading in their old ride for a new one.\nIHS Automotive says 25.1 percent of autos in the U.S. are 1-5 years old, unchanged from last year.\nWith new model auto sales expected to top 16 million this year for the first time since 2007, Seng says the growth in the average age of vehicles is slowing.\n\"Over the next five years, we'll the number of newer models (0-5 years old) on the road jumps by 32 percent,\" said Seng.\nThe surge means the average age of vehicles will tick only slightly higher over the next five years.\n\"We're still going to see a lot of older cars and trucks on the road, but the mix with newer models is definitely changing,\" said Seng.","url":"https://www.nbcnews.com/business/autos/old-clunkers-rule-roads-americans-are-driving-cars-longer-n126226"}
