{"authors":[],"date_download":"2018-10-30 14:28:23","date_modify":"2018-10-30 14:28:23","date_publish":"2017-03-05 12:38:00","description":"The state imploded the old Georgia Archives building in the shadow of the Capitol early Sunday morning.","filename":"data/vaneerConsumption/OldGeorgiaarchivesbuildingimplosionvideo.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/05/Images/030617%20archives%20kdj09.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_watch-old-georgia-archives-building-imploded__1540909703.html","title":"Old Georgia archives building implosion video","title_page":"Old Georgia archives building implosion video","title_rss":"NULL","source_domain":"ajc.com","text":"The state imploded the old Georgia Archives building in the shadow of the Capitol early this morning, and Gov. Nathan Deal was there to watch.\nThe old archives building, nicknamed the White Ice Cube, will make way for a state courts building. Deal has included $105 million to build the new facility in his budget proposal for the upcoming fiscal year, a measure that has already passed the state House.\nMORE: AJC’s Greg Bluestein was there to watch\nRELATED: Watch Dunwoody office building imploded\nPreparation for the implosion began at about 4 a.m.\nWarning signals sounded at about 6:45, Deal spoke in a parking lot behind Liberty Plaza, and 5-year-old Devin Simmons, a Children’s Health Care of Atlanta patient with sickle cell anemia, pulled the plunger to cue the implosion. Explosions rang out at about 7:05 a.m. and the building collapsed in a cloud of dust and debris shortly after.\nThe old archives was built in 1965 on Capitol Avenue. About three decades after it opened, engineers determined that it was sinking due to groundwater and nearby interstate construction. Estimates to repair and refurbish the archives hit $40 million.\nInstead of spending the money, a new archives facility was built near Clayton State University, and the old archives building has been used as a movie set on and off for years.\nGovernors have sought to tear down it down since the move. But lawmakers have been skeptical about spending money on the project.\nLast year they approved a state budget that included Deal’s proposal to borrow $6.5 million for design and site preparation for the new judicial complex.\nWatch: Preparation for the implosion","url":"https://www.ajc.com/news/watch-old-georgia-archives-building-imploded/tCNjYjxwzYc1GozLtywLrI/"}
