{"authors":[],"date_download":"2018-10-30 21:22:50","date_modify":"2018-10-30 21:22:50","date_publish":"2018-07-17 09:00:00","description":"Alpharetta man's childhood home becomes Restaurant Holmes, , an eclectic neighborhood restaurant and bar serving American cuisine in the new Alpharetta City Center.","filename":"data/vaneerConsumption/OldJonesplacebecomesRestaurantHolmesinAlpharetta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/17/Images/newsEngin.22517156_IMG_Group.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_this-l_5664bba052fa48c89511386b15c23877__1540934570.html","title":"Old Jones place becomes Restaurant Holmes in Alpharetta","title_page":"Old Jones place becomes Restaurant Holmes in Alpharetta","title_rss":"NULL","source_domain":"ajc.com","text":"The last time George Jones stepped foot into this old Southern bungalow, someone had bought it and transformed it into a real estate office, and before that, it was a school for children.\nA few days ago, he returned and it was bustling with men and women eating plates of coal-roasted beets, seafood crudo, hand-cut pasta, and wood-fired fish entrees executed by owner and chef Taylor Neary on opening day of Restaurant Holmes, an eclectic neighborhood restaurant and bar serving American cuisine.\nCity officials met with residents this week to unveil plans for the multi-million dollar project in downtown Alpharetta.\nAnd so as you can imagine, this house that Jones’ father built in 1914 after providing materials himself and paying $520 to a builder for labor from his merchant’s salary looked nothing like home anymore. Except for the deep gray paint, the shell was the same, the front door was the same and its four fireplaces stood ready to warm the place.\nBut like George Jones himself, the home had been completely transformed. At 97, Jones was no longer the young boy who played baseball into the night. And the house, now 2,000 square feet of commerce, was hardly the home where the Jones family regularly hosted big Sunday dinners.\nThat’s all fine and dandy with George Jones.\nRELATED | Boomers leaving suburbs for fun in the city\nHe makes his home these days alone in a well-appointed retirement community about a mile from here.\nGrowing up in this place, though, still plays in his mind because, well, sometimes memories are all an old man has.\nHe said he’s enjoyed a good life, with great parents in William and May Jones, and although his three brothers all died at birth, he inherited a large extended family that showed up regularly for dinner, plucked from May’s garden, and the smokehouse in the back. A small pond with large goldfish was in the front yard.\nThere weren’t many families on this stretch of Main Street — just the Joneses, the Olivers who lived directly across the street and Hard Bailey, the African-American blacksmith who lived next door.\n“He was a jovial fellow,” Jones said of Bailey. “Always laughing.”\nGeorge Jones, 97, at the opening of Restaurant Holmes. Before it was a restaurant, the old bungalow was Jones’ childhood home and was built by his father. CONTRIBUTED BY DIANE MAICON (The Atlanta Journal-Constitution)\nJones graduated from Milton High School in 1938 and headed straight to Abraham Baldwin College before transferring to the University of Georgia, where he earned an agriculture degree in 1942, the year his father died.\nUnwilling to wait to be drafted, Jones joined the Marines, served four years in World War II and then married the love of his life, Rachel Conner, in 1947.\nThat was the last year, he said, he lived in this old house. He and his bride moved to Alpharetta, where they raised a daughter, who died suddenly at age 11.\nRELATED | Latest projects starting in Alpharetta City Center\nAfter his mother passed in 1961, he said, he “came back a time or two when it was a real estate office,” but that was it.\nAccording to Cheri Morris, the developer of the new Alpharetta City Center, when she was selected to partner with the city of Alpharetta to develop the land, the house came with the property. Instead of tearing it down, Morris was determined to save it and the ancient oak that stands in the side yard.\nIt was important to her to maintain the character, to honor the history that made Alpharetta Alpharetta. That meant saving historic structures and adapting them to a new life.\nThe Jones house, Morris said, “has great bones. It’s a wonderful, solid house.”\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nShe put the house, with its restoration making it the most expensive building by far on this corner, up for lease and got an immediate response from a half-dozen people.\nTaylor Holmes Neary was first in line. Morris liked that.\nRELATED | Here are the restaurants set to open at Alpharetta City Center this year\n“Everyone who has their business in the city center has a real passion around their business,” Morris said. “Tay is a chef’s chef. He has the excellence that deserves to be housed in this property.”\nNeary, 30, had opened restaurants, but this would be the first one he owned.\nHe hadn’t envisioned operating in an old house, but he could see the potential. It was up to Morris to come up with a plan to preserve the character of the house and at the same time honor Neary’s need for a highly functional restaurant.\nHe’d call it Restaurant Holmes, after a six-generation family name, open to the public seven days a week for lunch and dinner.\nHe wanted it to be eco-friendly. No plastic straws. Include a rooftop machine that’ll turn smoke and grease from the kitchen into a clean water vapor to ensure indoor air quality. Locally sourced produce means beautiful, flavorful food from a menu that’s hyper-seasonal.\nOn July 11, Neary opened for business, and Jones, the only living legacy of what was on the land, was there to take it all in, back once more to break bread in the house his daddy built.\nJones, his taste buds titillated, said he’d be back soon.\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/entertainment/dining/this-life-with-gracie-one-man-home-becomes-another-man-restaurant-holmes/UA1fijp4KAIfElQjOmoE4M/"}
