{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:18:47","date_modify":"2018-10-30 23:18:47","date_publish":"2014-08-13 20:44:03","description":"Week 7 was a big one inside of the Big Brother house. After the double eviction, Zach felt betrayed by Frankie, Nicole had been separated from Hayden, and Christine was left with the power. This far into the Big Brother season, Christine's game has…","filename":"data/vaneerConsumption/OldPhotosofBigBrothersChristineShowThatShesAlwaysHadaGreatSenseofHumor.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/57770150-097b-412f-a122-b66fe7af8eb2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35640-old-photos-of-big-brothers-christine-show-that-shes-always-had-a-great-sense-of-humor_1540941527.html","title":"Old Photos of 'Big Brother's Christine Show That She's Always Had a Great Sense of Humor","title_page":"Old Photos of 'Big Brother's Christine Show That She's Always Had a Great Sense of Humor","title_rss":"NULL","source_domain":"bustle.com","text":"Week 7 was a big one inside of the Big Brother house. After the double eviction, Zach felt betrayed by Frankie, Nicole had been separated from Hayden, and Christine was left with the power. This far into the Big Brother season, Christine's game has been pretty difficult to figure out. Was she or wasn't she loyal to fellow Big Brother houseguest Nicole? Had she actually been loyal to The Detonators/ The Bomb Squad all along? I think that answer was made pretty clear when Christine was given the opportunity to backdoor her friend in the house, Nicole, after The Detonators (and Caleb) convinced her Nicole planned on coming after her if she remained HoH.\nSo we know that inside the house Christine isn't afraid to make moves to further her alliance. But beyond her loyalty to The Detonators, Christine isn't afraid to make personal game moves as well. This was evident when she tried to evict Zach during Week 6, since she had Zach as her target the entire week, causing him to almost go home. But before there was The Bomb Squad, and Zankie, there was just Christine, a barista from Tucson, Ariz. Are you wondering what was Christine like before she entered the Big Brother house? If these photos that Christine's husband Tim — who hilariously documents what it is like to see his wife inside the house — tweeted are any indication, she's always been quite the character.\nFirst, behold Christine at Disney.\nAnd another,\nTim Brecht, Christine's husband, clarifies to a fellow Twitter user that her outfit was a joke, but even if it wasn't, I think I would totally support it... She can really pull off the Disney tourist look, if only there were a fanny pack and Mickey Mouse ears to complete it.\nHere is a picture of the happy couple when they started dating.\nAnd if you really want a throwback picture of Christine, you've got to see Christine a la 1997.\nKeep 'em coming, Tim.\nImages: Sonja Flemming/CBS; Timothy Brecht/Instagram","url":"https://www.bustle.com/articles/35640-old-photos-of-big-brothers-christine-show-that-shes-always-had-a-great-sense-of-humor"}
