{"authors":["Georgia"],"date_download":"2018-10-30 21:18:46","date_modify":"2018-10-30 21:18:46","date_publish":"2018-09-01 01:03:31","description":"DETROIT (AP) - A fiery, old-school eulogist at the funeral of Aretha Franklin fell flat for many in...","filename":"data/vaneerConsumption/OldschooleulogyatArethaFranklinfuneraligniteswrath.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Georgia_Wsbtv/2018/09/01/Images/824879998_Aretha_Franklin_12298_12811181_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional_old-sc_9dc1872a161b2540b169de03de7dc589__1540934326.html","title":"Old-school eulogy at Aretha Franklin funeral ignites wrath","title_page":"Old-school eulogy at Aretha Franklin funeral ignites wrath","title_rss":"NULL","source_domain":"ajc.com","text":"DETROIT (AP) - A fiery, old-school eulogist at the funeral of Aretha Franklin fell flat for many in the crowd and prompted a social media uproar when he declared \"black America has lost its soul,\" black women are incapable of raising sons alone and the Black Lives Matter movement is unfounded in the face of black-on-black crime.\nAnd that was just 26 minutes into the nearly 50 minutes of words provided by the Rev. Jasper Williams Jr. of Salem Baptist Church in Atlanta as Franklin's marathon funeral wound down Friday.\nWilliams, who also eulogized Franklin's father, minister and civil rights activist C.L. Franklin, 34 years ago, was excoriated on Twitter and elsewhere for misogyny, bigotry and the perpetuation of false science on race. He also blamed integration and the civil rights movement for ripping the heart out of black micro-economies that once relied on black-owned small businesses such as grocery stores, hotels and banks.\nAs he wended his way through the need for more African Americans to return to church and more men to return to their families, the heat turned up online, with younger people declaring rhetoric such as that of Williams is why they left their churches to begin with.\nAt one point, Williams asked: \"Where is your soul, black man? As I look in your house, there are no fathers in the home no more.\"\nAs for black women, he preached that \"as proud, beautiful and fine as our black women are, one thing a black woman cannot do, a black woman cannot raise a black boy to be a man.\"\nWilliams described as \"abortion after birth\" the idea of children being raised without a \"provider\" father and a mother as the \"nurturer.\"\nHe negated the Black Lives Matter movement altogether in light of black-on-black crime, falling back on a rhyming pattern of yore:\n\"It amazes me how it is when the police kills one of us we're ready to protest, march, destroy innocent property,\" Williams began. \"We're ready to loot, steal whatever we want, but when we kill 100 of us, nobody says anything, nobody does anything. Black on black crime, we're all doing time, we're locked up in our mind, there's got to be a better way, we must stop this today.\"\nDo black lives matter?\n\"No, black lives do not matter,\" Williams said. \"Black lives will not matter, black lives ought not matter, black lives should not matter, black lives must not matter until black people start respecting black lives and stop killing ourselves.\"\nSocial media critics called his eulogy \"a disaster\" and questioned why he was chosen as the one to honor Franklin.\nTweeter Darrian Broom kept it simple: \"#JasperWilliams, the data doesn't support your ignorance.\"","url":"https://www.ajc.com/news/state--regional/old-school-eulogy-aretha-franklin-funeral-ignites-wrath/DqTxuOPoNx9WbCdF0bEAWO/"}
