{"authors":[],"date_download":"2018-10-30 00:51:09","date_modify":"2018-10-30 00:51:09","date_publish":"2018-06-26 00:26:08","description":null,"filename":"data/vaneerConsumption/OldWhiskyNewMezcalandOtherUnexpectedSpirits.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/1024px-AOC_Bas_armagnac.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860669.html","title":"Old Whisky, New Mezcal, and Other Unexpected Spirits","title_page":"Old Whisky, New Mezcal, and Other Unexpected SpiritsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"A few months back, a friend came to town from Tennessee. His schedule was jammed as was mine, but I was eager to see him. He works in insurance and I inevitably learn a lot when he explains the various fallouts of Obamacare and Trump’s subsequent war against it.\n“I have something from George Dickel to bring you for review,” he added. That was that. Logistics be damned, we were going to meet.\nHe came by my office and pulled from his bag a small of gold from Tullahoma — George Dickel Reserve 17-Year Old Tennessee Whisky (43.5% ABV; 87 proof). There is a whole cockamamie story about how this whisky was a happy accident; some barrels got mis-inventoried or somesuch. I love the folks at Dickel but I am not sure I buy it. That, however, is neither here nor there. This is the longest aged Tennessee whiskey to be found, and you can sip it straight with ease. The deep copper liquor offers notes of corn, white pepper, caramel, apple, and toffee. Wow.\nGeorge Dickel 17-Year is not cheap. A half-sized bottle (375 ml) runs around $75. But for the American whiskey fan, or for friends enjoying a rare meet-up, it is more than worth it.\n***\nBeing a drinks writer has its perks. One never knows when a courier will arrive with an unexpected delivery. On occasion I have shrank back in horror when I opened a box to find dill pickle vodka or a similarly evil concoction. Typically, though, I receive good drinks.\nSo it was that I met the acquaintance of La Luna Mezcal, a new entrant to the American market. The bottle I received is numero 307 from Lot 7, and it weighs in at a whopping 49.56% ABV (99.12 proof).\nLa Luna ($45) is made from cupreata agave harvested in Villa Madero in south central Mexico. Don’t let the water clear appearance fool you, this mezcal is rich with flavor — citrus, salt, and a grassy-herbal taste.\nIs it a good drink, something the spirits adventurer should try? To quote Geoffrey Fermin, the consul in Malcolm Lowry’s famed novel, Under the Volcano, “absolutamente necesario.”\nAnother pleasant over-the-transom surprise was Salute American Vodka, a product of Better Brands Beverage Company of Rochester, New York. This is a “good cause” product — $1 from every bottle sold (at $20 or so) goes to veterans’ charities. Salute also is unabashedly proud of being all-American-made. This vodka is made from wheat and corn, and is very mild with just a little heat going down. Pop it in the freezer and it will grow more viscous and the warmth wanes, leaving lean spirit.\n***\nWhen a colleague departed, he left distributed various items from his office. A half-empty bottle of Comte de Lauvia VSOP Armagnac (40% ABV; 80 proof) may well have been the prize of the lot. Armagnac is not especially easy to find in the United States.\nWith Comte retailing for around $40, I was prepared to be underwhelmed. How surprised I was that Comte VSOP is a very easy and pleasing spirit. I enjoyed a not-small pour of it during the last cool nights of spring, just me, Comte, and a good book. The bottle emptied quickly, but I will be on the look-out for it when I next go spirits shopping.\nKevin R. Kosar is the vice president of policy at the R Street Institute and the author of Whiskey: A Global History and Moonshine: A Global History. He is the editor and founder of AlcoholReviews.com.","url":"https://spectator.org/old-whisky-new-mezcal-and-other-unexpected-spirits/"}
