{"authors":[],"date_download":"2018-10-30 19:17:53","date_modify":"2018-10-30 19:17:53","date_publish":"2016-10-04 23:18:00","description":"The KSU presidency has been vacant since Dan Papp retired in June after an audit found he had received more than $577,000 in retirement pay from the...","filename":"data/vaneerConsumption/OlenssolecandidateforKennesawStatepresident.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/10/03/Images/photos.medleyphoto.11614894.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_olens-_9b76fa043deb8d5c04f2034edea4a753__1540927073.html","title":"Olens sole candidate for Kennesaw State president","title_page":"Olens sole candidate for Kennesaw State president","title_rss":"NULL","source_domain":"ajc.com","text":"The state’s top public college official said Tuesday that Georgia Attorney General Sam Olens’ political background and ties to Cobb County were major factors in him being the lone candidate for president of Kennesaw State University, which the state’s Board of Regents will decide upon next week.\nTypically, when the state is choosing a college president, a search committee is selected, finalists are chosen, a recommendation is made and the board decides. A national search was not conducted for KSU, and there are no immediate plans to search for another candidate.\nUniversity System of Georgia Chancellor Hank Huckaby said earlier he was going to conduct a national search, but believed Olens, who has no experience in higher education management, ought to be considered.\nSome faculty and students have criticized the selection process, which rapidly went from rumor to the board’s Executive and Compensation Committee deciding unanimously to schedule a vote on Olens by the entire board Oct. 12. An online petition against Olens becoming KSU president had more than 6,500 supporters Tuesday, about 800 more than Monday.\nThe KSU presidency has been vacant since Dan Papp retired in June after an audit found he had received more than $577,000 in retirement pay from the university’s foundation without notifying the state’s University System. KSU is one of the fastest-growing schools in the state. Its enrollment, about 33,000, has increased by more than 5,000 students since 2010.\nHuckaby told reporters Tuesday he understood the criticism about the selection process, but said he and other officials carefully deliberated the process before meeting with Olens.\n“Given the special circumstances and that we’re looking to appoint a permanent president of one of our leading universities…we felt that this process was appropriate, particularly given his background,” Huckaby said. “He knows Cobb County so well and he’s been a very dedicated citizen of this community.”\nOlens was a Cobb County commissioner and then its board chairman for more than 11 years before he became attorney general in 2011. He is in his second term.\nOlens met with the committee for more than an hour Tuesday behind closed doors, which is allowed for personnel matters under the state’s open records laws. Huckaby said Olens “did an outstanding job.”\nUnlike most candidate interview sessions, state officials and security stood near the door where the meeting with Olens took place. The attorney general did not make himself available to reporters and could not be reached Tuesday.\nHuckaby released a three-page letter from Olens dated Sept. 28, explaining why he wants the job and why he’s qualified.\n“I would bring unique strengths to KSU: strategic relationships, deep community ties and a deep understanding of the broader context in which KSU exists,” Olens wrote. “Anyone who has worked with me knows that I am not shy about calling it like I see it. But I am not shy about acknowledging what I don’t know and working hard to learn.”\nHuckaby also addressed criticism that Olens is not inclusive because he defended the state’s same-sex marriage ban.\n“If you look at his record, what he’s feelings have been, the way he’s acted, he’s a person that we’re convinced bears no prejudice,” Huckaby said.\nIf the board votes against Olens, interim president Houston Davis would remain in the position until a permanent replacement is approved.","url":"https://www.ajc.com/news/local-education/olens-sole-candidate-for-kennesaw-state-president/46LM0p1Lu2IkMFxNGtxX3O/"}
