{"authors":["Cassie Carpenter For Dailymail.Com"],"date_download":"2018-10-23 00:11:48","date_modify":"2018-10-23 00:11:48","date_publish":"2017-03-10 06:04:57","description":"The 31-year-old fashion maven - who doesn't have a stylist - donned a black blazer, matching skinny trousers, and bedazzled sneakers at Metrograph","filename":"data/vaneerConsumption/OliviaPalermoandhusbandsuitupforNYCpremiere.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E205B6A00000578-0-image-a-118_1489126153584.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300020_Olivia-Palermo-husband-suit-NYC-premiere_1540253508.html","title":"Olivia Palermo and husband suit up for NYC premiere","title_page":"Olivia Palermo and husband suit up for NYC premiere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Olivia Palermo and her handsome husband Johannes Huebl suited up for the Manhattan premiere of Personal Shopper on Thursday night.\nThe 31-year-old fashion maven - who doesn't have a stylist - donned a black blazer, matching skinny trousers, an MCM handbag, and bedazzled sneakers at Metrograph.\nThe City alum rocked a teal choker and sported a sleek middle-parted updo coiffed by Andre J. Davis.\nScroll down for video\nSophisticated: Olivia Palermo and her handsome husband Johannes Huebl suited up for the Manhattan premiere of Personal Shopper on Thursday night\nNot-so-basic black: The 31-year-old fashion maven - who doesn't have a stylist - donned a black blazer, matching skinny trousers, an MCM handbag, and bedazzled sneakers at Metrograph\n'I don't leave the house until I'm fully pulled together': The City alum rocked a teal choker and sported a sleek middle-parted updo coiffed by Andre J. Davis\n'I definitely don't leave the house until I'm fully pulled together,' Olivia told POPSUGAR last year.\n'I start my day fully dressed and ready to go. You never know where the day leaves you. That's how my mother[interior designer Lynn Hutchings] is; I definitely learned from her.'\nPalermo and the 39-year-old German model's sighting came a week after they celebrated her 31st birthday with an elegant, cell phone-free dinner with Polaroid cameras.\nShoe designer Brian Atwood, Tommy Hilfiger creative director Antonella Di Pietro, and Neiman Marcus fashion director Ken Downing were among their fashionable guests.\n'#NoLivePosts': Olivia and the 39-year-old German model's sighting came a week after they celebrated her 31st birthday with an elegant, cell phone-free dinner with Polaroid cameras\nFancy: Shoe designer Brian Atwood, Tommy Hilfiger creative director Antonella Di Pietro, and Neiman Marcus fashion director Ken Downing were among their fashionable guests\n'Sundays': Every single Sunday, 6ft2in Johannes posts a PDA picture, and their third wedding anniversary takes place this June\nFur baby: The inseparable Brooklyn-based couple - who began their romance back in 2008 - have yet to start a family, but they dote on their dog Mr. Butler\nEvery single Sunday, 6ft2in Johannes posts a PDA picture, and their third wedding anniversary takes place this June.\nThe inseparable Brooklyn-based couple - who began their romance back in 2008 - have yet to start a family, but they dote on their dog Mr. Butler.\nCareerwise, the Connecticut-born socialite is Banana Republic's first women's global style ambassador following her Chelsea28 collection with Nordstrom last year.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300020/Olivia-Palermo-husband-suit-NYC-premiere.html"}
