{"authors":["Amanda Williams For Mailonline"],"date_download":"2018-10-23 01:40:32","date_modify":"2018-10-23 01:40:32","date_publish":"2016-01-11 12:51:49","description":"Amelya Lyndsay, 35, was stunned when a routine height and weight measurement test at daughter Olivia’s junior school in Redruth, Cornwall, claimed she was over the recommended BMI limit.","filename":"data/vaneerConsumption/OliviaLyndsaysmotherfuriousafterRedruthschooltellsdaughtersheisoverweight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A668900000578-0-image-a-20_1452518880111.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393835_Fitness-instructor-furious-daughter-11-refused-eat-two-days-primary-school-health-professionals-said-overweight_1540258832.html","title":"Olivia Lyndsay's mother furious after Redruth school tells daughter she is overweight","title_page":"Olivia Lyndsay's mother furious after Redruth school tells daughter she is overweight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fitness instructor mother has hit out at a controversial school child measuring programme after her daughter, 11, was deemed 'overweight' - causing her to refuse food for two days.\nOlivia Lyndsay, who at 5ft 2ins is one of the tallest pupils in her year, was told her BMI was above the recommended limit by health professionals at her primary school.\nHer mother Amelya Lyndsay, 35, was furious after her young daughter was so upset by the results she then refused to eat for two days.\nNow she has spoken out against the National Child Measurement Programme (NCMP), which aims to monitor obesity in children.\nOlivia Lyndsay, who at 5ft 2ins is one of the tallest pupils in her year, was branded over the recommended BMI limit by health professionals at her Primary School. Her mother Amelya Lyndsay, 35, was then left furious after her young daughter was so upset by the results she then refused to eat for two days\nMs Lyndsay, a personal trainer and nutritionist, had to dig out her old university study books to convince her she was perfectly healthy.\n'It is unbelievable how much damage can be done by this program,' she said.\n'We never eat processed foods as I am always really careful of our diets, having a background in nutrition.\n'They never bothered to investigate what my background was, despite staff being aware of what I actually do for a living.'\nOlivia was weighed and measured in her last term before leaving Trewirgie Junior School in Redruth, Cornwall, last year.\nThe National Child Measurement Programme measures the height and weight of children when they start and leave all primary schools to assess obesity levels.\nIt was set up as part of a government strategy to tackle the issue and Olivia's tests were carried out by Cornwall Council's Public Health team.\nHer mother has not revealed Olivia's exact results, but she had a score which was just above the normal BMI range.\n'Olivia is now 158cm tall and was one of the tallest children in her year,' she explained.\n'After receiving the letter she was so distraught, I had to pull out my notes from university to convince her that she has no problem as she refused to eat anything for two days.\n'They need to put something else in place, don't just bring a measuring tape and scales into school to stress children about it.'\nOlivia was weighed and measured in her last term before leaving Trewirgie Junior School (pictured) in Redruth, Cornwall, last year\nBMI FOR CHILDREN EXPLAINED Body mass index (BMI) is a measure of body fat based on height and weight. If you have a BMI above the healthy range you are at raised risk of the serious health problems linked to being overweight, such as type 2 diabetes, heart disease and certain cancers. BMI results are interpreted differently for children and consider weight in relation to height, age and sex. The result is called the child’s BMI centile. Once your child’s BMI centile has been calculated, they will be in one of four categories: Underweight: Below 2nd BMI centile Healthy weight: Between the 2nd and 90th BMI centile Overweight: Between 91st and to 97th BMI centile Obese: At or above 98th BMI centile. This BMI centile category is called 'very overweight' in letters that are sent by the National Child Measurement Programme. Sources: NHS Choices and NIH\nOlivia said: 'I feel quite annoyed about it because it isn't that accurate and it's not that nice, I just felt really bad because I read the letter and was basically being called overweight by the NHS.'\nA spokesperson for the NCMP scheme said: 'The results are sent home in a confidential letter to the parents and not to the child.\n'It is a parent's decision to share the information; we are more than happy to provide advice and support about how to do this in the most supportive way, causing the least distress to the child.\n'NCMP measurements are clinical measurements that a GP would use as an initial assessment of child body mass.\n'The measurements should be used as part of a process to monitor child growth.\n'By sending information to parents they have the opportunity to review and monitor and important aspect of their child's health.\n'The personal letter providing the measurement is sent to parents directly in a confidential envelope enabling parents to choose how and if they would like to discuss the measurements with their child, we offer support to parents through this process.\n'If measurements are not what parents would expect or if measurements are outside the healthy weight range, we recommend having a discussion with a GP or the Cornwall Healthy Weight team to find out more about the measurement and what it might mean for their child's long term health.\n'We listen to feedback from parents and schools and use this to continually improve the way the programme is delivered.\n'The NCMP is one way we can start to tackle unhealthy weight in our children.","url":"https://www.dailymail.co.uk/news/article-3393835/Fitness-instructor-furious-daughter-11-refused-eat-two-days-primary-school-health-professionals-said-overweight.html"}
