{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:43:00","date_modify":"2018-10-30 21:43:00","date_publish":"2016-03-15 06:30:58","description":"Olympic Fencer Ibtihaj Muhammad, who set Twitter ablaze over the weekend\naft...","filename":"data/vaneerConsumption/OlympicfencerIbtihajMuhammadonEllenafterSXSWflap.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/15/Images/WPIMAGE_cmgajcbuzz_9291.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_olympic-fencer-ib_49dcc4c875c1ef466b190d94ed14d524__1540935780.html","title":"Olympic fencer Ibtihaj Muhammad on \"Ellen\" after SXSW flap","title_page":"Olympic fencer Ibtihaj Muhammad on \"Ellen\" after SXSW flap","title_rss":"NULL","source_domain":"ajc.com","text":"Olympic Fencer Ibtihaj Muhammad, who set Twitter ablaze over the weekend after posting that a SXSW volunteer asked her to remove her hijab in order to gain access , showed off her fancy saber skills during a subsequent visit to Ellen DeGeneres' show.\nPhoto Credit: Michael Rozman / Warner Bros.\nThe volunteer was relieved of duty and SXSW organizers apologized. The incident didn't come up during the visit, which instead focused on Muhammad's road to Rio.\n\"I will be this summer be the first Muslim woman to represent Team USA while wearing the hijab,\" she said.\n\"That is fantastic!\" Ellen exclaimed. \"Do you know how important that is?\"\nMuhammad always enjoyed sports and got into fencing in high school.\n\"With each sport my mom always had to alter the uniform for me by adding long sleeves or pants,\" she recalled. The fencing uniform, on the other hand, needed no such changes.\n\"It was always very important for my mom to keep me active,\" Muhammad said. \"She saw how excited I was to be in sports. She wanted me to do that while observing the hijab.\"\nEllen staffer Andy Zenor then gamely suited up for a little fencing action. Guess who won? The episode airs June 13. Here's a clip:","url":"https://www.ajc.com/blog/buzz/olympic-fencer-ibtihaj-muhammad-ellen-after-sxsw-flap/gIaCQii3TVYP92fZGR7uCI/"}
