{"authors":["Associated Press"],"date_download":"2018-10-23 00:03:37","date_modify":"2018-10-23 00:03:37","date_publish":"2017-04-26 09:10:25","description":"TOKYO (AP) - Organizers of the 2020 Tokyo Olympics signed a collaborative agreement with the organizers of the 2019 Rugby World Cup on Wednesday, aiming to...","filename":"data/vaneerConsumption/OlympicsRugbyWorldCuporganizerstocollaborateinJapan.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464681-1493204430-180_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446714_Olympics-Rugby-World-Cup-organizers-collaborate-Japan_1540253017.html","title":"Olympics, Rugby World Cup organizers to collaborate in Japan","title_page":"Olympics, Rugby World Cup organizers to collaborate in Japan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - Organizers of the 2020 Tokyo Olympics signed a collaborative agreement with the organizers of the 2019 Rugby World Cup on Wednesday, aiming to maximize the benefits and impact of the global events.\nThe Rugby World Cup will be staged in Japan as Tokyo is finalizing preparations to host the Summer Games for the first time since 1964.\nThe two organizations will share knowledge and resources in areas including security, transport, venue management, volunteer programs and anti-doping programs.\nTokyo 2020 Olympics CEO Toshiro Muto, right, and President and CEO of the 2019 Rugby World Cup Organizing Committee President and CEO Akira Shimazu show documents signed a collaborative agreement in Tokyo, Wednesday, April 26, 2017. Organizers of the 2020 Olympics signed a collaborative agreement with the organizers of the 2019 Rugby World Cup, aiming to maximize the benefits and impact of the global events. The Rugby World Cup will be staged in Japan as Tokyo is finalizing preparations to host the Summer Games for the first time since 1964. (AP Photo/Eugene Hoshiko)\n\"There are many synergies between the hosting of these two events,\" World Rugby chairman Bill Beaumont said. \"We look forward to working with all parties to deliver on this opportunity.\"\nThe 2019 edition will be the first Rugby World Cup held in Asia.\nThe new Olympic Stadium was originally the centerpiece of the Rugby World Cup but construction delays meant a venue change, with the final now to be played in Yokohama.\nToshiro Muto, chief executive officer of Tokyo organizing committee, and his 2019 counterpart, Akira Shimazu, signed the agreement. Muto said the International Olympic Committee had been pushing his organization to find a way to cooperate with 2019 organizers.\nJapan will be the first country to host both events in consecutive years.\nTokyo 2020 Olympics CEO Toshiro Muto, right, and President and CEO of the 2019 Rugby World Cup Organizing Committee President and CEO Akira Shimazu shake hands after signing a collaborative agreement in Tokyo, Wednesday, April 26, 2017. Organizers of the 2020 Olympics signed a collaborative agreement with the organizers of the 2019 Rugby World Cup, aiming to maximize the benefits and impact of the global events. The Rugby World Cup will be staged in Japan as Tokyo is finalizing preparations to host the Summer Games for the first time since 1964. (AP Photo/Eugene Hoshiko)","url":"https://www.dailymail.co.uk/wires/ap/article-4446714/Olympics-Rugby-World-Cup-organizers-collaborate-Japan.html"}
