{"authors":["Claire Lampen"],"date_download":"2018-10-31 01:47:31","date_modify":"2018-10-31 01:47:31","date_publish":"2018-08-27 18:45:36","description":"I think we all know that couple, the one that seems to fight and break up every couple of months, only to reconcile a week or so later (usually to the confusion and chagrin of their friends). These on-again, off-again cycles frustrate because they…","filename":"data/vaneerConsumption/OnAgainOffAgainRelationshipsDamageMentalHealthANewStudyFinds.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/24/2bc958c6-5e22-43df-a750-7917304f3fb9-offagain.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_on-again-off-again-relationships-damage-mental-health-a-new-study-finds-10233346_1540950451.html","title":"On-Again, Off-Again Relationships Damage Mental Health, A New Study Finds","title_page":"On-Again, Off-Again Relationships Damage Mental Health, A New Study Finds","title_rss":"NULL","source_domain":"bustle.com","text":"I think we all know that couple, the one that seems to fight and break up every couple of months, only to reconcile a week or so later (usually to the confusion and chagrin of their friends). These on-again, off-again cycles frustrate because they obviously don't work together, yet here we are, day in and day out, counseling the parties through yet another catastrophic blowout that's actually about the same old issue, refurbished into a fresh hell. For a fictional but reasonably accurate portrayal of the cycle, please see Ross and Rachel's endless \"we were on a break\" debate.\nAnyway, it's indisputable fact that this wash-rinse-repeat pattern of relationship ruptures is usually maddening for everyone involved. But according to a new study, on-again, off-again relationships can actively damage participants' mental health.\nKale Monk, an assistant professor of human development and family sciences at the University of Missouri, teamed up with researchers at the University of Illinois Champagne Urbana to dissect data from over 500 partnered people. They found that, the more frequently people broke up and got back together, the higher levels of \"psychological distress\" — read: depression and anxiety — they charted. This trend persisted regardless of sexual orientation.\nMonk notes that breaking up only to reunite later isn't always a bad thing, because couples separate for innumerable reasons. Maybe one person has to relocate, making the relationship impractical for a time. Maybe you both took the time apart to honestly reassess what went wrong, and now you both feel prepared to acknowledge your mistakes and do better moving forward. It's when couples do this all the time that they inflict harm on their emotional well-being.\n\"The findings suggest that people who find themselves regularly breaking up and getting back together with their partners need to 'look under the hood' of their relationships to determine what's going on,\" Monk said in a news release. \"If partners are honest about the pattern, they can take the necessary steps to maintain their relationships or safely end them.\"\nAnita Chlipala, a licensed marriage and family therapist and author of First Comes Us: The Busy Couple's Guide to Lasting Love, tells Bustle that people often fall back into relationships for a number of unhealthy reasons. Maybe they believe their partner really changed this time; maybe they want some kind of return on a long-term investment; maybe they think their partner is \"The One\"; maybe this relationship feels comfortable; maybe they simply don't want to be alone or navigate the dating scene. Unless the partner (or both of you) went to therapy or somehow achieved major, behavior-changing insights, Chlipala cautions strongly against reuniting with an ex.\n\"You have to take into consideration the entire relationship, not just the good times,\" she says. \"Don’t fool yourself into thinking that because they give you breadcrumbs of goodness, that your partner just needs time to be like that consistently. If they were capable of that, they’d give it to you already.\" Unless the person has taken demonstrable, sustainable steps toward maintaining a lifestyle or behavioral change for the long haul, stay away.\nHow To End The Cycle\nWhen you love someone, or share some kind of meaningful connection, that can be easier said than done. If you want the relationship to be over once and for all, you need to establish some breakup ground rules. \"To make an off again relationship permanent, set clear boundaries,\" therapist Melanie Shapiro, a licensed independent clinical social worker with the Washington, D.C.-based practice, the Viva Center, tells Bustle. For example, she suggests, ask your partner not to call, email, text, or follow you on social media — and that you reciprocate. Almost certainly, this will be difficult, but remind yourself that you know how the reunion ends. You've lived it already. As Shapiro points out, you can't expect a different outcome if you don't do anything differently.\nBut suppose you have made substantive changes, and your partner has, too — if you've both done the necessary hard self-reflection, been honest with one another about the results, and are willing to work on building a a new relationship from the ground up, Shapiro still recommends guidelines. \"Clearly state what you would like to be different this time,\" she says. Maybe you want your partner to text before bed if they're out late with friends — say it. Maybe you have qualms about one of their friends and would like to talk about your worries — say it. \"It is important to say what you expect and both be on the same page about it — especially if it was an issue in the past.\"\n\"For a relationship to really work, coming clean, being truthful about behavior that happened in the past, while you were 'on' or 'off' is important to share.\"\nYou need to be upfront about past issues, Shapiro says. \"For a relationship to really work, coming clean, being truthful about behavior that happened in the past, while you were 'on' or 'off' is important to share,\" she says. \"Even if the truth is embarrassing or hurtful, being honest creates the foundation for a healthy relationship.\" But you also have to be willing to let the past go: If you're going to return to that stale point of contention in the course of every argument, you're not over it, and things probably won't turn out differently this time around. Be clear, be honest, and then let it go.\nIt bears noting that some on-again, off-again relationships stem from one partner's being trapped — emotionally or financially — by the other. Intimate partner violence is cyclical, after all, and one party's deliberate manipulation of the other makes it hard, sometimes impossible, to leave for good.\nEditor's note: If you or someone you know is experiencing domestic abuse, call 911 or the National Domestic Violence Hotline at 1(800) 799-SAFE (7233) or visit thehotline.org.","url":"https://www.bustle.com/p/on-again-off-again-relationships-damage-mental-health-a-new-study-finds-10233346"}
