{"authors":[],"date_download":"2018-10-30 20:34:40","date_modify":"2018-10-30 20:34:40","date_publish":"2015-10-23 02:00:15","description":"The Georgia Tech student who disappeared after attending a sorority formal and was found beaten and bloodied in a ditch in northeast Atlanta on Monday was not on MARTA when he was attacked, the transit agency stated Thursday.","filename":"data/vaneerConsumption/OncemissingGeorgiaTechstudentnotonMARTAduring.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_agency-once_6f2d9bf9047d48835b80104b9d1a69bb__1540931680.html","title":"Once-missing Georgia Tech student not on MARTA during...","title_page":"Agency: Once-missing Georgia Tech student not on MARTA during...","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia Tech student who disappeared after attending a sorority formal and was found beaten and bloodied in a ditch in northeast Atlanta on Monday was not on MARTA when he was attacked, the transit agency stated Thursday.\n“Based on information received as a result of the ongoing investigation by the Atlanta Police Department, Mr. James Hubert was not on the MARTA system at the time in question,” read the statement released by spokeswoman Alisa Jackson.\nHubert’s mother has said her son left the sorority formal alone and was taking MARTA home when he was “jumped, beaten up, robbed and left for dead.”\nThe agency referred questions to the Atlanta police. Police spokesman Officer Ralph Woolfolk said Thursday night that “an active investigation is still in progress,” but he did not elaborate.\nHubert underwent spine surgery Wednesday and came through “with flying colors,” his mother, Didi, posted on Facebook.\nThe 24-year-old aerospace engineering major was reported missing after he didn’t return home from a Friday night sorority formal in northwest Atlanta. Monday morning, a group of friends using the “Find My iPhone” app discovered him lying on the railroad tracks along DeKalb and Arizona avenues, near the Kirkwood neighborhood.\nHis mother previously described his injuries as including left-side paralysis, blood on the brain, broken ribs, a broken scapula, a punctured lung and four broken vertebrae.\nAuthorities have not discussed the case and what may have happened to Hubert publicly. An Atlanta police spokeswoman said Wednesday that detectives had yet to be able to interview Hubert.","url":"https://www.ajc.com/news/crime--law/agency-once-missing-georgia-tech-student-not-marta-during-attack/0nOG3ihUAD1kEbV5oKSFfN/"}
