{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:23","date_modify":"2018-10-31 00:04:23","date_publish":"2016-07-20 08:00:00","description":"Tens of millions of trees in California have been dying -- withering from drought, bored into by insects or attacked by an organism that has been around","filename":"data/vaneerConsumption/Onceahealthyforestnowabotanicalemergencyroom.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/deadtrees-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944263.html","title":"Once a healthy forest, now a botanical emergency room","title_page":"Once a healthy forest, now a botanical emergency room | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Tens of millions of trees in California have been dying — withering from drought, bored into by insects or attacked by an organism that has been around for a decade but that scientists are only now understanding.\nWest Marin County recently provided a close-up look at the problem for a group of post-graduate students from UC Davis, who examined a devastated forest there.\nThe group was led by Dave Rizzo, a plant pathologist whose lab at UC Davis is spearheading efforts to better understand Sudden Oak Death, an irreversible disease that has killed at least 5 million California trees.\nHe guided students to a bluff above Tomales Bay State Park. While swimmers splashed on the beach below, Rizzo grimly surveyed the scene among the trees.\nWhat was once a densely packed oak and bay laurel forest was now a botanical emergency room. The oaks still standing were “bleeding” – oozing dead tissue — from open wounds in their bark, and slowly dying. Others had already fallen, littering the forest floor with dried and cracked trunks and limbs.\nRizzo said something similar occurred with chestnuts, which once flourished in the United States, and “turned the largest hardwood tree in North America into a shrub. That’s what’s happening here.”\nThe forest, near the town of Inverness, is changing as oaks die and other species move in. Marin County has been called ‘ground zero’ for the disease, where scientists discovered the pathogen in 1995.\nAcross the state, scientists like Rizzo are rushing to respond to the loss of oaks and of pines that, dried from drought, became infested with destructive beetles.\nForest health is only one concern. State officials are worried on multiple fronts.\nHillsides denuded of trees lose their ability to store water. In addition, the bared slopes cannot stabilize soils, elevating the potential for landslides.\nCalifornia’s vast forests provide other benefits, such as absorbing carbon in the atmosphere, thus helping to reduce the greenhouse gases that cause global warming. If trees are absent from significant portions of the state, much greenhouse gas reduction is lost.\nIn addition, dead and dying trees are more fire prone, increasing flammability in an already parched landscape.\nCheck back here as CALmatters prepares a more comprehensive story on the Golden State’s dying trees and the official response to the devastation.\nSee more in our main story about the Golden State’s forest fatalities.","url":"https://calmatters.org/articles/once-a-healthy-forest-now-a-botanical-emergency-room/"}
