{"authors":["Antoinette Siu","Dan Morain","Guest Commentary","Felicia Mello"],"date_download":"2018-10-30 22:29:55","date_modify":"2018-10-30 22:29:55","date_publish":"2018-08-01 01:14:13","description":"California now has more payday lenders than it does McDonald’s. While some states have restricted their operations, California's Legislature keeps burying bills that aim to crack down on predatory lending.","filename":"data/vaneerConsumption/OnceagainCalifornialawmakerswontcrackdownonpaydaylenders.json","image_url":"https://calmatters.org/wp-content/uploads/Payday-lenders_Robbie-Short_002_w.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938595.html","title":"Once again, California lawmakers won't crack down on payday lenders","title_page":"Once again, California lawmakers won't crack down on payday lenders | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When phone bank worker Melissa Mendez, age 26, felt financially squeezed a few months ago—“I was short on cash and needed to pay rent”—she walked into a Cash 1 storefront in Sacramento and took out a payday loan. The annual interest rate: 460 percent.\nThat rate would shock a lot of people. Not Mendez, who once worked behind the counter at an outpost of the lending giant Advance America. She had fielded applications for short-term loans from all sorts of people: seniors needing more money because their Social Security check wasn’t cutting it, people in between jobs and waiting for a first paycheck, and people like herself, lacking enough savings to get to the end of the month.\nUnlike Mendez, many desperate people don’t know what they’re signing on to—often agreeing to aggressive collection practices, inflexible repayment options and exorbitant interest. “They just point at stuff and walk through it really fast,” she said. “A lot of people just see the money and they don’t see the interest rates.”\nIn California, 1 in 20 people a year take out a payday loan, amounting to $2.9 billion annually. Payday lending has grown into a multi-billion-dollar industry, fueled by triple-digit interest rates, steep transaction fees and the pervasiveness of its hundreds of stores across the state.\nOne Cal State study found California now has more payday lenders than it does McDonald’s.\nYet while some states ban payday loan storefronts completely or significantly restrict their operations, California is one of 26 states allowing loans with annual percentage rates higher than 391 percent on loans that must be fully repaid within two weeks. Otherwise, borrowers face collection calls, overdrafting their accounts or even a court order when they default.\nGiven the opportunity to crack down on predatory lending, the California Legislature has buried at least five bills intended to curb the practice. These would have capped interest rates on loans, extended repayment time or offered installment plans to borrowers. Among them:\nAB 3010: Authored in 2018 by Assemblywoman Monique Limón, D-Goleta, it sought to restrict people from taking out more than one payday loan at a time, and proposed creating a database requiring licensed lenders to record their loan transactions. Without the votes, Limón pulled the bill.\nAB 2953: Also authored by Limón in 2018, it aimed to stop lenders from charging more than 36 percent on auto-title loans, also known as pink-slip loans, but failed to secure enough votes to advance in the Senate.\nAB 2500: Authored in 2018 by Assemblyman Ash Kalra, D-San Jose, the bill aimed to cap interest rates at 36 percent for installment loans between $2,500 and $5,000. It died on the Assembly floor.\nSB 365: Authored by Sen. Alan Lowenthal, D-Long Beach, in 2011, the bill proposed creating a payday loan database, but it also languished.\nSB 515: This 2014 bill by Sen. Hannah-Beth Jackson, D-Santa Barbara, aimed to extend the minimum length of a payday loan and require lenders to offer installment plans, as well as develop a database and cap loans at four per year per borrower. It died in committee.\nLimón said this year, as in previous years, the billion-dollar lending industry has gotten its way. Both of her bills faced heavy opposition early on, and she refused to make changes that would have mollified the industry.\nBut this year’s effort was “historic” in that it was the first time bills of this sort passed out of their originating houses, she told CALmatters.\n“We knew this was something that was going to push the envelope, but we felt it was important to introduce this,” Limón said. “So long as there is a problem, I think California will be having a discussion about it.”\nAmong those voting against Limón’s AB 3010 was Assemblyman Kevin Kiley, a Roseville Republican. After questioning the notion of limiting each person to one payday loan, he said creation of a database “seems like quite an undertaking. There’s privacy concerns, apparently issues of reliability, potential liability for the state.”\nOther states have taken firmer steps in recent years to cut down on predatory lending. New York prohibits payday lending through criminal usury statutes, which outlaw loan interest of 25 percent or more. Arkansas’s state constitution caps rates at 17 percent. Most other states that have a ceiling limit lenders to 36 percent.\n“(California) needs to innovate in order to bring in lower prices for consumers,” said Nick Bourke, director of consumer finance at Pew Charitable Trusts, which has studied predatory lending nationwide.\n“Conventional payday loans are not helping them when the problem comes back two weeks later. If credit is going to be part of the solution, the only way is if it’s structured to be installments with affordable rates.”\nBut payday and pink-slip lending companies argue that what might look like predatory is in reality just operators in a risky business protecting themselves from customers happy to take their money but sometimes negligent about paying it back.\nThe California Financial Service Providers Association, the industry group that opposed Kalra’s bill, argued that lowering rates would hurt their profit margins and cause them to throttle back on issuing loans—driving consumers into the hands of unregulated lenders and services. The association represents some of the largest payday lenders in the country, including Advance America.\nAdvance America operates more than 2,000 stores in the U.S. and since 2004 has spent more than $1 million lobbying in California alone. The company did not respond to requests for comment.\n“Investors consider the type of lending our member businesses conduct to be high-risk, resulting in a substantial cost for our members to borrow money that they ultimately lend to consumers,” the trade association wrote. “Additionally, our member businesses are in the communities they service and have significant premise and operating costs. Additionally, labor costs, the cost of underwriting and compliance, the cost of credit reporting, and the cost of defaults, all drive up the price of delivering the product to the consumer.”\nIn California, consumers can take out a payday loan of up to $300—actually only worth $255 when you factor in a $45 fee—that in most cases must be repaid in full in two weeks. But a borrower who can’t make the full payment frequently takes out another loan to keep covering other ongoing costs—and the cycle escalates. In 2016, 83 percent of the 11.5 million payday loans were taken out by a repeat borrower, a practice known as loan stacking.\nThe annual percentage rate, a way of measuring of how much the loan will cost in interest over a year, gives an idea of how much a borrower will end up paying if the loan remains unpaid for one year. So at an annual percentage rate of 460 percent, someone taking out $300 can end up paying back $1,380 in that year, not to mention fees that multiply on each additional loan.\nSo who uses payday loans?\nBecause they don’t require a credit score as prerequisite, they appeal to cash-strapped borrowers who can’t go to a regular bank. Payday lenders require only income and a checking account to hand out these loans.\nState analysis also found payday lender storefronts are concentrated in places with high family poverty.\n“A lot of families in California are suffering from income volatility and lack of emergency savings. California has a very real problem because conventional payday loans are really harming people more than helping people,” Bourke said.\nMore than 60 percent of payday storefronts are located in zip codes with higher family poverty rates than the rest of the state, according to California’s Department of Business Oversight. And nearly half are located where the poverty rate for African-Americans and Latinos is higher than the statewide poverty rate for those groups. Most borrowers make an average annual income between $10,000 to $40,000.\nThe state says the average interest rate for payday loan transactions was 377 percent last year—a slight increase over what it was the previous year. Licensed lenders reported collecting $436.4 million in fees—70 percent of that from borrowers who took out seven or more loans that year.\nOn average, Californians take out a loan of $250, but the often-unaffordable interest rates sometimes corner them into paying a fee to roll into another loan and extend the terms.\nThere are other options if borrowers need quick cash beyond the payday loan amount of $300—but they come with different risks.\nIn 2013, the state created a small-dollar loan program to regulate loans between $300 and $2,500. The state caps interest on those loans between 20 and 30 percent, but any loan above $2,500 is the “real Wild, Wild West,” said Graciela Aponte-Diaz, California policy director at the Center for Responsible Lending, a nonprofit focused on consumer lending.\n“Loans between $2,500 to $5,000 have a 100 percent (annual interest rate). It’s detrimental for families who can’t pay it back, and 40 percent default,” she said.\nThe Center for Responsible Lending this year sponsored the Kalra bill, which unsuccessfully aimed to cap interest rates at 36 percent for installment loans between $2,500 and $5,000. It recently died on the Assembly floor.\n“It has a lot to do with the industry and how much money they’re putting into efforts to killing it,” Aponte-Diaz added. “They hire all the top lobby firms to kill our bills.”","url":"https://calmatters.org/articles/predatory-payday-lending-california/"}
