{"authors":["Kate Galbraith","Dan Morain","Julie Cart","Guest Commentary"],"date_download":"2018-10-30 22:34:14","date_modify":"2018-10-30 22:34:14","date_publish":"2015-07-18 08:00:00","description":"Nearly a decade ago, California policymakers, facing a frightening future of shriveling snow packs and rising seas, created the nation’s most aggressive","filename":"data/vaneerConsumption/OnclimatearoughroadaheadforCalifornia.json","image_url":"https://calmatters.org/wp-content/uploads/Overview-Featured-Image---windmill-e1535556171278.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938854.html","title":"On climate, a rough road ahead for California","title_page":"On climate, a rough road ahead for California | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Nearly a decade ago, California policymakers, facing a frightening future of shriveling snow packs and rising seas, created the nation’s most aggressive program to combat global warming.\nThe 2006 law mandated broad reductions of greenhouse gas emissions by 2020. Now, as the deadline approaches, Gov. Jerry Brown and Democratic lawmakers are intensifying their efforts. They are crafting emissions-reduction targets for 2030 and 2050 that will be far more difficult to meet. One bill seeks to slash petroleum use in vehicles to levels not seen since Lyndon Johnson’s presidency.\nYet as the debate continues, a number of questions remain unanswered. Among them: Will other states or nations follow California in pursuing deep emissions cuts? Will California be able to meet the new targets, and if so, how? What are the total costs and benefits of the programs? How much will the price of gasoline and electricity increase?\nHere’s some of what we do know:\nThe state has emerged as a global leader in fighting climate change, despite producing only about one percent of the world’s greenhouse gas emissions. It has created a dizzying array of programs to cut pollution, from reducing the carbon content of motor fuels to capping emissions at large factories.\nThe 2006 law, Assembly Bill 32, established a goal of cutting the state’s greenhouse gas emission to 1990 levels by 2020. To meet that goal, emissions need to fall by six percent between 2013 (the latest year for which figures are available) and 2020. Brown and other political leaders expect that to happen. However, emissions have fallen only slightly since 2009, when the recession ended.\nAn executive order issued by Brown this spring would reduce greenhouse gas emissions to 40 percent below 1990 levels by 2030. That will be much harder to achieve. Over the 10 years leading up to Brown’s deadline, emissions must fall up to seven times as fast as during the preceding decade. And emissions would have to fall another 40 percentage points by 2050 if a bill currently before the Assembly passes.\nCutting emissions brings costs. To date, consumers in the state have seen an estimated three to five percent rise in electricity rates, and are paying about an extra dime per gallon of gasoline, due to specific climate-related programs. Going forward, a study by a San Francisco consulting group found that deep emissions cuts by 2030 could carry costs of up to $23 billion yearly. That figure could go higher by 2050, according to the group, which did not tally the health benefits of cleaner air or the climate benefits of lower emissions.\nDespite the pioneering policies, emissions have fallen more slowly in the state than in the rest of the nation. Greenhouse gas emissions in California dropped by 7 percent from their peak in 2004 to 2013, compared to 9 percent nationwide over the same period. Reducing emissions is harder here because the state’s economy is already relatively energy-frugal.\nTom Steyer When AB 32 passed, establishing the nation’s first broad plan for cutting greenhouse gas emissions, environmentalists hoped the action would touch off a revolution. The target established by the law was ambitious, especially considering the continuing population and economic growth. It built on an earlier groundbreaking bill to reduce the greenhouse gases in car exhaust.\n“We realized under AB 32 and the car bill, we’re not just talking about polar bears and arctic ice caps but this was real impacts to California,” said Sen. Fran Pavley, D-Agoura Hills, an author of both bills. Melting mountain snows, rising seas, and poor health resulting from warmer temperatures — all resonated with Californians, she said.\nAt a signing ceremony for AB 32 on San Francisco’s Treasure Island, then-Gov. Arnold Schwarzenegger predicted that major nations like Mexico, Brazil, China and India would join the fight against climate change. So would the federal government.\n“Trust me,” Schwarzenegger said to applause, as international flags fluttered behind him in the breeze. “I am convinced of that, that this will happen, because nothing is more important than protecting our planet.”\nChange did not come as swiftly as Pavley and Schwarzenegger had hoped. Democrats and some Republicans in Congress tried to pass a bill that would cap greenhouse gas emissions nationally, but it failed. Pavley’s effort to clean up cars’ tailpipes did eventually become the basis of a national policy. But federal rules on climate change still lack the breadth of California’s. Nations like China and Brazil have also moved slowly, at least until recently.\nBut the state has forged ahead, still hoping to sow inspiration beyond its borders. To stop climate change, the whole world — not just California — must participate. As Brown travels to the Vatican this week and to a major United Nations climate change summit in Paris in December, he will surely argue that if one of the world’s largest economies can slash emissions, others can too.\nA kaleidoscope of programs has arisen to accelerate California’s shift to a clean economy. The broadest and perhaps most controversial of these is a cap-and-trade policy, which subjects the state’s most-polluting companies to a cap on their greenhouse gas emissions and allows them to trade credits to pollute. The California Chamber of Commerce has challenged the legality of a key feature of the program. The state has prevailed so far, but the lawsuit is working its way through an appeal.\nOther policies for cutting greenhouse gas emissions include a requirement for most electricity providers to get 33 percent of their energy from renewable source, such as wind farms and solar arrays by 2020, and a low-carbon fuel standard that requires producers of fuels like gasoline and diesel to make their products 10 percent less carbon-intensive by 2020.\nMany other programs also exist, including goals making buildings more energy efficient, increasing the number of electric vehicles and maximizing the use of public transportation.\nThese rules, arcane and complex, remain largely invisible to Californians. But they result in slightly increased prices, notably at the gas pump, where economists say the cap-and-trade program has added roughly a dime to each gallon since the beginning of this year. Electric bills are also rising. The state’s Public Utilities Commission estimates that electric power rates have increased by three to five percent due to the renewable energy requirements.\n“I wish we could mark on a nice spreadsheet the incremental cost for every regulation,” said Tupper Hull, vice-president of the Western States Petroleum Association.\nIt is difficult to find companies that have left the state specifically because of climate policies, as opposed to California’s broad basket of regulations. But industry groups and their advocates predict this will happen in the future, as policies grow stricter.\n“Energy cost in the state will necessarily rise, and that will create challenges for retaining employment,” said Robert Wyman, Jr., a Los Angeles-based partner at the firm Latham & Watkins, who represents many business clients. He argues that California’s system of interlocking policies has made compliance more expensive than it would be under a single, market-oriented system, like cap-and-trade.\nCalifornia officials do not know how much their climate rules have cost or saved. The Air Resources Board, the state regulatory body that oversees the greenhouse gas reductions, stated in a key document last year that the law’s impact on economic growth remains unknown. Some years earlier, a knot of studies estimated that California’s gross state product could see anywhere from a 1 percent gain to a 2.2 percent decline as a result of AB 32. The models differed in their assumptions, such as how they forecast the pace of technological change.\nProponents of AB 32 say that in addition to cleaning the air, the law has contributed to a vibrant clean-energy industry that is innovating with startling speed. A survey released in December by the Advanced Energy Economy Institute, an environmental organization co-founded by the billionaire and clean-energy activist Tom Steyer, found that employment in the state’s clean-energy sectors like solar and wind, along with nuclear and natural gas electricity generation, rose by five percent over the prior year. Another recent study, funded by the environmental innovation nonprofit Next 10, argues that using less gasoline (as electric and hybrid cars make possible) should free up spending and create jobs.\nMary Nichols, chair of the Air Resources Board, noted in an interview that jobs and investment are increasing in California. “We look at that happening at the same time that the cap and trade program has been in effect and we say, “‘What’s the problem?’” she said.\nMary Nichols\nThe long-term future of California’s greenhouse gas programs lies in two bills that have passed the state Senate and are being evaluated this summer by the Assembly.\nSenate Bill 350 aims at three pieces of the energy puzzle — petroleum, electricity and buildings. It seeks to cut petroleum use in motor vehicles by 50 percent (a very difficult target, analysts agree), boost electric utilities’ reliance on renewable energy to 50 percent, and double the energy efficiency in buildings – all by the year 2030.\nSenate Bill 32 would require the state to reduce greenhouse gas emissions to 80 percent below 1990 levels by mid-century. It would codify into law an executive order issued by Schwarzenegger, a step that helps ensure that the goal is binding. The long-term targets are drawn from international climate science: If large nations cut their emissions that sharply, scientists believe it can limit the world’s warming.\nWhat programs California will use to meet these tougher targets remains uncertain, though Democratic political leaders stress that they will bring more green jobs to the state and reduce unhealthy air pollution.\n“Unless we do something, our economy will be severely damaged,” said state Senate leader Kevin de León, D-Los Angeles, who co-authored SB 350. “The public health of our children will be severely impaired.”\nAn illuminating view came from a study this spring by Energy and Environmental Economics (E3), a San Francisco-based consulting group hired by the state to evaluate future greenhouse gas reductions. To reduce emissions by 26 to 38 percent below 1990 levels by 2030 — a level not quite as ambitious as the 40 percent reduction recently ordered by Brown — the group forecast a range of results, from savings of $8 billion to costs of $23 billion per year. (E3’s projections are in 2012 dollars.) A cut of 33 percent by 2030 could cost about $50 per Californian per year, the study found.\nTo meet those future goals, the model incorporated some technologies only minimally in use today, such as increased reliance on renewable diesel, according to Amber Mahone, director of climate policy analysis at E3. It also assumed that new or expanded regulations would be needed. For example, the analysis factored in more capture of the potent greenhouse gas methane from manure at California’s dairy farms, a sector that, for now, largely falls outside mandatory regulations.\nThe impact of reaching the tougher targets of slashing greenhouse gas emissions to 80 percent below 1990 levels, the E3 study found, could range from a savings of around $15 billion to costs of almost $100 billion yearly, under a scenario in which emissions fall at a steady rate. This projection is highly uncertain, Mahone emphasized.\nOn the human level, modeling by Bloomberg New Energy Finance, an analysis firm, found that the cap-and-trade program could raise gasoline prices by 22 cents a gallon by 2025, though there is an outside chance of prices increasing by as much as 50 cents a gallon, according to Colleen Regan, a senior analyst with the firm for North American power and environmental markets. However, Californians should need less gas as cars become more fuel-efficient or electric.\nMany of these numbers are hazy predictions. What is clear is that meeting long-term targets will be difficult.\nIn the words of a state plan on climate change released last year, “Progressing toward California’s long-term climate goals will require that greenhouse gas reduction rates be significantly accelerated.”\nNot only must the emissions reductions come faster in the future, but the reductions may also be harder. That is evident already. California has not been able to bring down its greenhouse gas emissions as quickly as the nation in recent years, as a comparison between state and federal inventories shows. Indeed, the data hint at difficulties ahead. Gasoline sales are ticking up. Emissions have been largely flat since falling steeply in 2008-9 as the recession hit, though state officials and outside analysts expect that future reductions, brought about by programs just starting to have an impact, will be sufficient to meet or exceed the 2020 goals.\n“On greenhouse gas emissions, California has always been an A student,” said Ashley Lawson, a senior carbon analyst at Thomson Reuters. “So to perform any better, you have to work really, really hard to go from an A to an A plus.” The rest of the country, which is replacing coal-fired power plants with less-polluting natural gas plants, “was able to go from a C to a B, with almost no effort at all,” she said.\nCritics like the Chamber of Commerce say that the drastic emissions measures planned for the future could harm the economy and take away jobs. Supporters counter that past sky-is-falling projections have not come to pass, and that technological innovation is speeding up.\nWhen Schwarzenegger signed AB 32, above the howls of industry groups, electric cars had barely begun to hit the roadways, and a rooftop’s worth of solar panels cost more than a year at a private college. Prices have fallen rapidly since then, and California is getting cleaner.\nThe question for the future is whether it can get clean enough.","url":"https://calmatters.org/articles/california-climate-change-policy-overview/"}
