{"authors":["Kate Galbraith","Guest Commentary","Julie Cart","Meghan Mccarty Carino"],"date_download":"2018-10-30 22:33:33","date_modify":"2018-10-30 22:33:33","date_publish":"2015-12-12 08:00:00","description":"Lawmakers are debating how to find money to fix the state’s deteriorating roads and bridges. But it will be almost impossible to end Californians’ top","filename":"data/vaneerConsumption/Oncrowdedroadstechnologyoffershope.json","image_url":"https://calmatters.org/wp-content/uploads/highway_101_traffic.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938813.html","title":"On crowded roads, technology offers hope","title_page":"On crowded roads, technology offers hope | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Lawmakers are debating how to find money to fix the state’s deteriorating roads and bridges. But it will be almost impossible to end Californians’ top driving headache — congestion.\nMaking roads wider is a traditional solution. But this holds little appeal in California, where land is expensive and and urban corridors are densely packed. Also, for environmental reasons, officials want people to drive less.\nSo future solutions will rely heavily on measures to manage traffic demand and on incentives to encourage Californians to get off the roads and onto public transit or bikes. The emerging revolution in automobile technology, with automated driving features and carpooling apps, will also help.\nRelieving congestion is a high priority for motorists and the state. Delays due to traffic cost the state $20.4 billion each year, according to TRIP, a Washington, DC-based transportation research nonprofit.\nTraffic is most acute in the Los Angeles area. There, commuters lose 80 hours each year — more than three days’ worth — to delays, according to the Texas A&M Transportation Institute. It’s the second-worst snarl for commuters in the country (Washington D.C. ranks first, San Francisco third). Los Angeles and Orange Counties are home to 11 of the 12 most-congested freeway segments in the state, according to the California Department of Transportation (Caltrans).\nThe impact of traffic delays\nIn Los Angeles, local officials recently approved a controversial long-term plan to get people out of their cars. It would repurpose some roadway lanes as part of an effort to add 300 miles of protected bicycle lanes and another 300 miles of transit lanes (some of which could be for the busiest travel times only). One goal is a 20 percent reduction in the average miles driven per capita by 2035. The plan, however, has caused a storm of protest and legal action from opponents who charge that it will make congestion even worse.\nAt the state level, a draft 2040 transportation plan, released this spring, urges improvements in public transit, biking and walking options in order to improve traffic congestion and cut greenhouse gas emissions. Although the overall number of miles driven is projected to increase, models suggest that doubling transit services and speeds could cut the total projected miles driven in California by 6 percent by 2040, according to the plan.\nWith multi-modal development, “we give people other choices than just being stuck on the freeway,” said Joan Sollenberger, statewide manager of transportation planning at Caltrans.\nDoubling the percentage of trips taken by bicycle could cut the number of projected vehicle miles traveled by 0.41 percent by 2040, the report said. And a 5 percent increase in carpool vehicles could cut projected vehicle miles traveled by 2.9 percent, the 2040 draft said.\nCaltrans is also trying to relieve traffic by adding more lanes that are restricted to cars with passengers. Often, those restrictions are being added to existing lanes. The report said the effect of this needs further evaluation.\nThe biggest prospective reduction in vehicle mileage could come from making motorists pay more. Modeling suggests that increasing the cost to operate a car by 16 cents a mile in urban areas and 8 cents a mile in rural areas could cut the number of projected miles driven by 17 percent by 2040, the draft report said.\nHarnessing technology to manage traffic demand – in other words, to change when people drive and how much – is a major focus of the state. Sollenberger of Caltrans can envision a future in which there “may be incentives for people to go buy coffee at the worst hour” of traffic, so they get off the road and delay their trip slightly.\nMobile mapping applications, like Google Maps, serve a similar function for some drivers by providing information on real-time traffic conditions. Tim Lomax of the Texas A&M Transportation Institute says such apps may smooth out rush hour, so that a peak period may be, for example, only three hours and a quarter rather than 3.5 hours.\nCaltrans is investing in technologies, like signs and monitoring, to make trips safer and traffic smoother. On Interstate 80 in the San Francisco Bay Area, one of Northern California’s worst choke points, a pilot project will launch in the spring that includes new electronic signs warning drivers of slowdowns ahead; an alternative, off-freeway route with coordinated signals; and ramp meters on freeway on-ramps to keep traffic flowing smoothly.\nCaltrans says the $79 million project could cut travel times by 10 percent to 15 percent, depending on the distance.\nA similar pilot project is planned for 2017 on a stretch of Interstate 210 in Southern California, in the San Gabriel Valley.\nBut the reality is that congestion is a nearly intractable problem, and with the economy picking up, people are driving more again. One wildcard is automated driving features in cars, and the coming communication between cars and roadways. Cars of the future should be able to automatically stay in their lanes, for example, and detect red light runners in an intersection ahead. Fewer collisions should mean less congestion.\n“My prophecy, perhaps, is that there will be a lot of additional benefits,” Sollenberger of Caltrans said. But, she added, they will take years to arrive.","url":"https://calmatters.org/articles/on-crowded-roads-technology-offers-hope/"}
