{"authors":["Sophie Inge For Mailonline"],"date_download":"2018-10-23 00:57:12","date_modify":"2018-10-23 00:57:12","date_publish":"2017-04-26 10:58:02","description":"Dan from Northern Ireland arrived to see former partner Louise, from Liverpool, in labour, he didn't stay for the actual birth of baby Zen, which left some viewers furious.","filename":"data/vaneerConsumption/OneBornEveryMinuteviewersoutragedatexboyfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9ED9AB00000578-0-image-a-2_1493200671273.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4445448_One-Born-Minute-viewers-outraged_1540256232.html","title":"One Born Every Minute viewers outraged at ex boyfriend","title_page":"One Born Every Minute viewers outraged at ex boyfriend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One Born Every Minute viewers were left outraged after last night's episode saw a 45-year-old mother-to-be left to give birth alone after the baby's father abandons her during labour.\nLouise, from Liverpool, fell pregnant with long-distance lover Dan but the couple split after she revealed she was expecting a child.\nThe latest installment of the Channel 4 maternity ward programme saw Louise and Dan briefly reunite, only for the father-to-be to desert her before their son Zen actually arrived - which left those watching the show furious.\nScroll down for video\nLast night's episode of One Born Every Minute saw Louise, a 45-year-old first-time mum from Liverpool, giving birth to her son Zen without his father Dan by her side\nDan, from Northern Ireland, flew over to watch his former partner give birth...but didn't stay for the main event, much to the chagrin of viewers\nLouise gave birth to little Zen with two friends as birthing partners, despite the fact that her ex partner was staying near the hospital\nIt was revealed that long-haired Dan, who has two children in Northern Ireland with another woman, wasn't prepared to stick around for the birth, despite flying over to see his former girlfriend.\nSeveral viewers took to Twitter express their solidarity with Louise, saying Dan should have taken precautions if he did not want a child.\n@piglet2602 wrote: 'Where's Dan buggering off too? He's hardly a pillar of support!'\nAlthough Dan eventually arrives at the maternity ward to meet his new son, the damage had already been done for many of those watching from home.\n@Vicksy_D wrote: 'Dan needs to buck his ideas up. She told him she wanted a baby. He should of taken precautions if he really didn't want one.'\nIn his defence, Dan revealed to viewers that the couple lived 200 miles apart and their relationship broke down because they argued when they did meet up.\nIn an awkward encounter, Dan tells Louise that he's probably not going to stay for the birth\nAt the show's end, Dan vowed to be the 'best father that I can be' and said he would journey to Liverpool to visit his son as often as possible.\n'I never want the baby to think his daddy doesn't want to be there. He always will be son.' He even hinted that the pair may reunite romantically.\nMeanwhile, Louise concluded that the couple would do the 'best they can' to raise their son.\nLet's do this! Louise grimaces during labour with her baby son Zen\nHard to watch: Louise's friends step in for father Dan...and watch on as Louise reaches the all important crowning","url":"https://www.dailymail.co.uk/femail/article-4445448/One-Born-Minute-viewers-outraged.html"}
