{"authors":["Press Association"],"date_download":"2018-10-22 22:34:04","date_modify":"2018-10-22 22:34:04","date_publish":"2016-01-28 10:41:37","description":"One Direction star Louis Tomlinson has shared the first picture of his newborn son Freddie online. The 24 year old announced the birth at the weekend and tha...","filename":"data/vaneerConsumption/Onedirectionslouistomlinsontweetspictureofsonfreddie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-982e62d1-e8fc-437b-beff-eab2425e65bc-4vVdYopwYQ7f641721b07abfb93e-58_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420505_One-Directions-Louis-Tomlinson-tweets-picture-son-Freddie_1540247644.html","title":"One direction's louis tomlinson tweets picture of son freddie","title_page":"One direction's louis tomlinson tweets picture of son freddie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One Direction's Louis Tomlinson tweets picture of son Freddie\nOne Direction star Louis Tomlinson has shared the first picture of his newborn son Freddie online.\nThe 24 year old announced the birth at the weekend and thanked his 21.3million fans for their support in Twitter posts on Wednesday.\nThe singer posted a black and white photo of him holding his son, accompanied by the words: \"Meet my little lad, Freddie.\"\nA Tweet showing how One Direction star Louis Tomlinson shared the first picture of his newborn son Freddie online.\nHe hinted the child will have his surname, tweeting simply \"Freddie Tommo\" before following it up by saying: \"Thank you so much for the all nice messages.\"\nThe selfie shows the star holding the boy, wearing a striped babygrow, to his bare, tattooed chest.\nOn Saturday Tomlinson said: \"I'm pleased to say my baby son was born yesterday. He is healthy and pretty amazing. I'm very happy.\"\nHe briefly dated Freddie's mother, Los Angeles-based stylist Briana Jungwirth, in May 2015 after he broke up with his long-term girlfriend Eleanor Calder.\nNews of the pregnancy broke in August, although there has never been an official statement.","url":"https://www.dailymail.co.uk/wires/pa/article-3420505/One-Directions-Louis-Tomlinson-tweets-picture-son-Freddie.html"}
