{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:04:51","date_modify":"2018-10-30 20:04:51","date_publish":"2016-08-04 16:00:56","description":"One Eared Stag, located at the corner of Edgewood Avenue and Hurt Street in Inman Park, is chef and...","filename":"data/vaneerConsumption/OneEaredStagmixesitupbehindthebarwiththemedcocktailmenus.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/02/Images/WPIMAGE_cmgajcfoodandmore_9962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_on_93f45b5eac30866c2410bc2b91171cd3__1540929891.html","title":"One Eared Stag mixes it up behind the bar with themed cocktail menus","title_page":"One Eared Stag mixes it up behind the bar with themed cocktail menus","title_rss":"NULL","source_domain":"ajc.com","text":"One Eared Stag, located at the corner of Edgewood Avenue and Hurt Street in Inman Park, is chef and owner Robert Phalen’s restaurant focusing on locally-sourced, seasonal dishes with rare or interesting vegetables and proteins. His culinary creativity and proclivity for bucking food trends have earned him a loyal following at the now five-year-old eatery. While Phalen’s focus has been on his food, the beverage program has become more of an afterthought. Until now.\nBeverage director and floor manager, Mikey Kilbourne came on board last fall after working at Westside stunner Bacchanalia for four years where he did everything from serve to tend bar . Kilbourne is no stranger to the kitchen, however, cooking for his family from a young age before earning his bachelor's degree from the Culinary Institute of America. While attending school, Kilbourne worked externships at two Atlanta institutions, Kyma and Restaurant Eugene . His years within the fine dining world helped him develop a passion for wines, learn to manage a bar and a team and, most importantly, how to craft proper cocktails.\n“I didn’t have a clear vision when I came to One Eared Stag. I wanted to see what was going on before I changed anything. The program really evolved once I arrived,” Kilbourne said. “I focused on putting wines and producers in place I liked from working at Bacchanalia. As for beers, I’m keeping it as local as possible like Robert has done with food, but offering a variety of styles.”\nThe El Desperado cocktail in July included mezcal, cantaloupe agua fresca and guajillo chili tincture. Photo credit: Henri Hollis\nThe cocktails would be the real challenge. Kilbourne knew in order to compete with Atlanta’s cocktail heavyweights, he had to match Phalen’s level of creativity with interesting ingredients.\nLike Phalen, Kilbourne has brought in fresh, local ingredients through his housemade syrups, tinctures and shrubs. He plans to update menus monthly with new, seasonal themes, “I want to keep our cocktail program fresh. When I started thinking about how I would achieve this, I thought why not change it monthly with seasonal themes. This allows us to play with ingredients and introduce guests to spirits they may not have had before.”\nSo far the menus have not been overworked or esoteric. You’re not going to walk in, plop down at the bar and be overwhelmed by a laundry list of wild ingredients like unicorn tears or the essence of Icelandic rainwater.\nFor June, Kilbourne focused on Japanese-inspired cocktails with base spirits like lightly peated whiskies, Asian brandy, sake and shochu paired with the familiar flavors of late of spring, like mint and lemongrass while bringing in the first flavors of summer, like peanuts and plums.\nKilbourne’s Mexican-themed menu in July was full of refreshing escapes from the heat. The El Desperado with mezcal, cantaloupe agua fresca and guajillo chili tincture was smoky and slightly sweet with a little afterburn tickling the throat at the finish.\nThe Lava Surfing available in August includes gin and sherry paired with pineapple and papaya juices. Photo credit: Henri Hollis\nKilbourne has filled the August cocktail menu with tiki-inspired imbibes and tropical spirits like floral gins and rum; including Plantation’s luscious pineapple rum and an OES house blend of Plantation white rum and Niessen rhum Agricole. August further highlights Kilbourne’s culinary background with fresh juice concoctions, syrups and cordials set off by uniquely flavored bitters from Atlanta’s 18.21 Bitters . These ingredients take center stage in the gin and sherry-based cocktail Lava Surfing.\nThe drink contains fresh pineapple and papaya juices and the creamy, rich sugars of demerara syrup. What is wonderful about this cocktail is the combination of the gin, sherry and demerara which seem to form a rum-like base with the juices and their pulp providing a slightly creamy texture. The tart cherry and saffron bitters bind the drink together into a boozy juice we wish Arden’s Garden would bottle.\nWhat could have taken a turn into monthly cocktail menus full of bad puns and boring cliches has to this point been thoroughly researched and thoughtfully executed by Kilbourne and his team. Flavors are familiar and comfortable, making the drinks approachable for guests. Each month brings a new reason to grab a seat at the bar.\nOne Eared Stag, 1029 Edgewood Ave. NE, Atlanta. 404-525-4479, oneearedstagatl.com.\nGo here to read more of our coverage of the Atlanta bar scene\n4 cocktail books to quench your summer reading thirst\nYour handy guide to shooting the ‘hooch\nAria’s revamped cocktail program\nBar hop along the Beltline\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter.","url":"https://www.ajc.com/blog/atlanta-restaurants/one-eared-stag-mixes-behind-the-bar-with-themed-cocktail-menus/cQkhrzvrOFwwBHSRkO8BJP/"}
