{"authors":[],"date_download":"2018-10-22 23:25:10","date_modify":"2018-10-22 23:25:10","date_publish":"2014-09-27 00:00:00","description":"A decade ago, Benjamin Busch was the provisional U.S. military mayor of a town called Jassan, near the Iranian border. On his recent return, he found a far different, sadder, more frustrated place.","filename":"data/vaneerConsumption/OneFormerMarineDocumentsHisReturnToABrokenIraq.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_09_27_351979061_one-former-marine-documents-his-return-to-a-broken-iraq_1540250710.html","title":"One Former Marine Documents His Return To A Broken Iraq","title_page":"One Former Marine Documents His Return To A Broken Iraq : NPR","title_rss":"NULL","source_domain":"npr.org","text":"One Former Marine Documents His Return To A Broken Iraq\nA decade ago, Benjamin Busch was the provisional U.S. military mayor of a town called Jassan, near the Iranian border. On his recent return, he found a far different, sadder, more frustrated place.\nSCOTT SIMON, HOST:\nAs the U.S. returns to action in the skies over Iraq, a U.S. Marine officer who was part of the U.S. invasion and occupation in 2003 writes about his return as a civilian. Benjamin Busch, who was the provisional U.S. military mayor of a mostly Shia town called Jassan near the Iranian border returned as the writer he has become. Benjamin Busch, author of \"Dust To Dust: A Memoir\" and an actor and filmmaker, joins us in our studios in New York. His new article, \"Today Is Better Than Tomorrow\" appears in the current issue of Harper's magazine.\nThanks so much for being with us.\nBENJAMIN BUSCH: Thanks so much for talking with me.\nSIMON: A lot of people who served in Iraq never want to see it again. What made you go back?\nBUSCH: A huge portion of my life was actually spent; almost two years, in that country. And so what I was interested most in was the place I went first. It's been 10 years and I hadn't seen a single report on the town of Jassan. And I just had a natural fascination for what had become of it.\nSIMON: How's the town changed?\nBUSCH: It was really remarkable. When I first saw it, it was just that mound of buildings, this catacomb of homes that had been built defensively around an oasis. And the reason it was a mound was because it was built out of dirt. And over the years, as homes wore down and new homes were built above it, the area became a town built on the towns before it. As soon as we came within sight of that mound, I realized something odd had happened. It was turning gray around its fringes, almost as if it was aging, you know? They surrounded it with new homes. There were very few - these were, you know, a few regime leaders had houses there and the rest were just administrative buildings. And now there were hundreds of these two-story brand-new brick and concrete homes. It completely changed the feeling of the place. The people who lived there used to rub against each other; used to be very close. You could walk across the town in, you know, three minutes.\nAnd on the hill behind these new buildings, the old homes were collapsing as they slowly were abandoned. And at first I thought, these must be new people. They must be people coming from elsewhere and for some reason moving to this very tiny place on the edge of forever. I asked a local policeman, he said no, every single person who has built a house here is from here. That was very strange to see. And you could see the split - the elders, you know, having that great history. All their memories tied up in those small houses made of soil now enjoying the convenience of the new homes, but there was a sadness to all of it.\nSIMON: I was struck by Iraqis who said to you - I think there was one man who said, this is not Iraq anymore because you went to the market and there was nothing from Iraq.\nBUSCH: Yeah. Two things were startling about Iraq. First was our complete disappearance from it. The evidence of us was gone. And the other was that I couldn't really find anything native-born, other than the people. There used to be clothing. There used to be furniture. Most of the things were made within the country itself and now it's just flooded with mostly Chinese goods, which can't be fixed. So all those little mom-and-pop stalls which had repaired things forever were going out of business. The people who had actual manual skills were no longer in demand.\nSIMON: A lot of people with whom you spoke seemed to be mad at the fact that the Americans were ever there and mad that they left when they did.\nBUSCH: Yeah. Everything was very predictable under Saddam, for better or for worse. We of course destroyed all of that. What had functioned we made dysfunctional. What was supposed to be the replacement didn't work. We replaced all of our ambitions with an effort just to return everything back to the way it had been, essentially. But it wasn't restored to the point it had been under Saddam. And they didn't feel the benefits. They didn't feel the sense of security. We never established that.\nSIMON: At the end of your article, you note the rise of ISIS, ISIL, Islamic State, and the fact that they have been executing young Shia men.\nBUSCH: Yeah.\nSIMON: How do you feel about the U.S. mission in Iraq now? Does the U.S. owe Iraq?\nBUSCH: I have a real problem with so much about Iraq; the way it's responded itself as a state, that its army collapsed. That even outnumbering their opponents, they surrender. You know, I twitch in two directions. One of me wishes I were a Marine in Iraq right now because we finally have a clear mission. We finally have a defined enemy that we can all agree is just terrible. And I'm not. I'm a civilian now. And honestly, I don't know that we can train Iraqis to be anything. We keep on talking about, you know, spending more money and more advisors. Iraq is going to need to figure out what it is and then all we can do is support the best answer they come up with.\nSIMON: Benjamin Busch. His article \"Today Is Better Than Tomorrow: A Marine Returns To A Divided Iraq\" appears in the current issue of Harper's magazine. Ben, thanks much for being back with us.\nBUSCH: Thank you, Scott.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/09/27/351979061/one-former-marine-documents-his-return-to-a-broken-iraq"}
