{"authors":["Rosie Taylor Business Reporter For The Daily Mail"],"date_download":"2018-10-22 20:24:42","date_modify":"2018-10-22 20:24:42","date_publish":"2016-01-28 01:15:10","description":"Around one in five UK pensioners spent theirs on a big one-off purchase like a car or a holiday, while more than a quarter paid off debts in the form of loans, credit cards or mortgages.","filename":"data/vaneerConsumption/Oneinfivewhocashedinpensionhavespenteverypenny.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/260ACDEE00000578-0-image-a-8_1453943616672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420235_One-five-cashed-pension-spent-penny-half-400-000-accessed-pension-pots-worth-50billion-April-took-cash_1540239882.html","title":"One in five who cashed in pension have spent every penny","title_page":"One in five who cashed in pension have spent every penny | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two in five saved it, and fewer than one in 10 invested it in property\nOne in five spent theirs on a big one-off purchase like a car or a holiday\nA third of those who spent their cash used it to improve their home\nA third of those who spent their cash used it to improve their home, figures compiled by the Pensions and Lifetime Savings Association – which represents pension providers – revealed\nOne in five people who cashed in their pension under the new freedoms have ‘spent it all’, figures have revealed.\nMore than half of 400,000 over-55s who have accessed pension pots worth £50billion since April took at least some of their savings out as cash.\nOf these, 18 per cent said they spent everything they withdrew, with 19 per cent investing or saving their money and the remainder giving it away or a combination of options.\nA third of those who spent their cash used it to improve their home, figures compiled by the Pensions and Lifetime Savings Association – which represents pension providers – revealed.\nWhen the scheme was first discussed former Pensions Minister Steve Webb suggested pensioners might blow the lot on a Lamborghini.\nAround one in five spent theirs on a big one-off purchase like a car or a holiday, while more than a quarter paid off debts in the form of loans, credit cards or mortgages. Just 3 per cent gave money to their family.\nNearly a quarter of people who invested the cash they withdrew put it in a savings account, with around a fifth choosing to leave it in a current account. Two in five saved it into a cash or shares ISA, and fewer than one in 10 invested it in property.\nFinancial experts warned taking money out of a pension fund could leave retirees worse off than if they kept it invested.\nNathan Long, of Hargreaves Lansdown, warned that record low interest rates in savings accounts meant pensioners could lose out.\nHe said: ‘An awful lot of money seems to have been taken out of pensions to be held as cash.\n‘For many people, the combination of tax on pension withdrawals and low interest rates on cash mean their money may be better left in their pension until needed.’\nThe new freedoms introduced by the Chancellor George Osborne allow over-55s to withdraw their pension pot as cash or use it like a bank account, instead of being forced to buy an annuity which pays an annual income.\nBut critics have warned the freedoms could lead to people spending their savings too quickly and not leaving enough to see them through their retirement.\nLast night, PLSA chief executive Joanne Segars said the figures were proof there was ‘no more normal’ when it came to retirement.\nShe said: ‘Pension freedoms have destroyed the traditional norms leaving a blank canvas for millions of people. This first cohort of savers are effectively pension pioneers – working out how to make the right decision with their savings but at the same time naturally fearful of making a poor decision in uncharted territory.’\nAround one in five spent theirs on a big one-off purchase like a car or a holiday, while more than a quarter paid off debts in the form of loans, credit cards or mortgages\nIndependent pensions expert Alan Higham, who runs Pensionchamp.com, said retirees needed to make sure they fully understood how much state pension they would receive before spending their pension pot.\nHe added: ‘My main worry is that people have spent their pension pot without fully understanding what the state will pay them... People should get a state pension forecast before accessing their private pension.’\nA Treasury spokesperson said: ‘Our pension reforms have given people real freedom and choice over how they access their retirement savings and are proving to be a great success.’","url":"https://www.dailymail.co.uk/news/article-3420235/One-five-cashed-pension-spent-penny-half-400-000-accessed-pension-pots-worth-50billion-April-took-cash.html"}
