{"authors":["Carolyn De Lorenzo"],"date_download":"2018-10-31 01:43:27","date_modify":"2018-10-31 01:43:27","date_publish":"2018-09-14 15:27:07","description":"In order to better understand the mental health of first-year college students throughout the world, the World Health Organization (WHO) conducted a global survey investigating the prevalence of mental health disorders among college freshman. And…","filename":"data/vaneerConsumption/OneInThreeCollegeFreshmanReportMentalHealthDisorderSymptomsANewStudySays.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/72bf3f20-f01c-45e9-aa9d-b809c6c3dddb-getty-129722320.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_one-in-three-college-freshman-report-mental-health-disorder-symptoms-a-new-study-says-11919784_1540950207.html","title":"One In Three College Freshman Report Mental Health Disorder Symptoms, A New Study Says","title_page":"One In Three College Freshman Report Mental Health Disorder Symptoms, A New Study Says","title_rss":"NULL","source_domain":"bustle.com","text":"In order to better understand the mental health of first-year college students throughout the world, the World Health Organization (WHO) conducted a global survey investigating the prevalence of mental health disorders among college freshman. And they found that one in three first year students show signs of mental health distress. The study, published in the Journal of Abnormal Psychology, examines the prevalence of major depression, anxiety disorders, mania, panic disorders, and substance use among college freshman in eight industrialized nations. Researchers found that 35 percent of the 13,984 college students surveyed reported having dealt with one of these disorders at some point in life, while 31 percent reported coping with such challenges within the 12-month period prior to taking the WHO survey.\nAccording to The Guardian, major depression was the most common disorder reported by freshman, while anxiety followed close behind. The average age for onset of these disorders was found to be just 14-years-old. Lead study author Randy Auerbach, a researcher of depression and suicide and Columbia University, told The Guardian that “The rates of the disorders are alarmingly high […] We found that these disorders broadly distributed across the student population, which suggests to us mainly that we need to be doing more to better understand mental health disorders on college campuses.”\nAdam Berry/Getty Images News/Getty Images\nThe American Psychological Association (APA) says that Auerbach and his team authored the study as part of WHO’s World Mental Health College Student Initiative. The initiative surveyed students from 19 colleges in eight countries, including Australia, Belgium, Germany, Mexico, Northern Ireland, South Africa, Spain, and the United States. The APA further reports that despite the prevalence of mental health disorders among young adults, previous research indicates that only 15 to 20 percent of students will seek services to address their mental health concerns. Auerbach told the APA that university counseling centers “are currently working at capacity and counseling centers tend to be cyclical, with students ramping up service use towards the middle of the semester, which often creates a bottleneck.” If students are struggling to find mental health services outside of their school’s counseling center, Auerbach recommends internet-based counseling services that can offer help if local resources aren’t available at a given time.\nThomas Lohnes/Getty Images News/Getty Images\nThe Guardian further reports that many of the college freshman surveyed arrived at school with pre-existing mental health issues. According to the Office of National Statistics in the United Kingdom, there has been an alarming uptick in suicide rates among 15-to 19-year olds in the UK in the past five years though rates are lower than they were in the 1980s, according to The Guardian. According to the APA, further research is needed to determine which types of treatments and interventions work best for different mental health disorders. For instance, internet-based counseling may work well for some students struggling with anxiety or depression, while those struggling with substance use might do best with in-person counseling.\nIf you struggle with depression and anxiety, or any mental health concerns, know that help and treatment are available. Life challenges and major transitions can be hard to juggle, but with support and the right intervention, it is absolutely possible to navigate.","url":"https://www.bustle.com/p/one-in-three-college-freshman-report-mental-health-disorder-symptoms-a-new-study-says-11919784"}
