{"authors":["Rob Stein"],"date_download":"2018-10-22 21:24:23","date_modify":"2018-10-22 21:24:23","date_publish":"2014-12-26 00:00:00","description":"Using an e-reader before trying to nod off may disrupt sleep more than reading a paper book, a study suggests. Scientists suspect the screen's blue light is messing with a sleep-inducing hormone.","filename":"data/vaneerConsumption/OneMoreReasonToReachForAPaperBookBeforeBed.json","image_url":"https://media.npr.org/assets/img/2014/12/24/ipad-night_wide-2e3afc7f394a1b92e6393783c3d72e9aea1a5b47.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2014_12_26_372914271_one-more-reason-to-reach-for-a-paper-book-before-bed_1540243463.html","title":"One More Reason To Reach For A Paper Book Before Bed","title_page":"One More Reason To Reach For A Paper Book Before Bed : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"One More Reason To Reach For A Paper Book Before Bed\nEnlarge this image toggle caption Guido Mieth/Getty Images/Flickr RM Guido Mieth/Getty Images/Flickr RM\nE-readers may make it particularly hard to get a good night's sleep, according to research out this week.\nA study that followed every nightly twitch, turn and snore of 12 volunteers for a couple weeks found that those who read from an iPad before hitting the sack had a harder time falling asleep, spent less time in a crucial phase of sleep, and were less alert the next day.\nThis is cause for concern because sleep disruptions may be associated with a variety of health problems, according to the study's leader, Anne-Marie Chang, who studies sleep and circadian rhythms at the Brigham & Women's Hospital in Boston. \"Sleep deficiency is associated with negative consequences for health,\" including obesity, diabetes, cardiovascular disease, Chang says.\nPrevious research has indicated that exposure to certain types of light seems to disrupt sleep more than others, Chang says. Devices that emit shorter-wavelength, blue light might be especially problematic, she and her team suspected, because it has the greatest effect on the hormone melatonin, which regulates sleep.\n\"We knew that light in the evening affects circadian rhythms and affects sleep and alertness,\" Chang says. \"But we wanted to test if light from light-emitting devices, such as e-readers, which were gaining in popularity, would have the same effect if people were using them to read before bedtime.\"\nSo the researchers asked 12 healthy young people to spend a couple of weeks in a sleep lab. For five nights, they read what they considered to be relaxing material on an iPad for four hours before going to sleep. For another five nights, they read the same kind of material from books made of paper.\nIn the study published in this week's issue of the Proceedings of the National Academy of Sciences, the researchers found that on the nights participants read from iPads, it took longer for them to fall asleep and they spent less time in an important phase of slumber known as rapid eye movement (REM) sleep.\n\"They also reported feeling less sleepy in the evening but more sleepy the following morning,\" Chang says.\nThe team also discovered that the light from the iPad was suppressing and delaying the production of melatonin.\nBased on the findings and others, Chang recommends that if people want to read before bed, they should consider devices that don't emit light — or just pull out an old-fashioned paper book.","url":"https://www.npr.org/sections/health-shots/2014/12/26/372914271/one-more-reason-to-reach-for-a-paper-book-before-bed"}
