{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 01:17:07","date_modify":"2018-10-30 01:17:07","date_publish":"2018-08-13 00:00:00","description":"One Musicfest reunites Atlanta crunk artists for the fall event","filename":"data/vaneerConsumption/OneMusicfestreunitesAtlantacrunkartistsforthefallevent.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/13/Videos/4460911.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_one-musicfest-re_498a33b29bef8a30eeae01cc5fe251a5__1540862227.html","title":"One Musicfest reunites Atlanta crunk artists for the fall event","title_page":"One Musicfest reunites Atlanta crunk artists for the fall event","title_rss":"NULL","source_domain":"ajc.com","text":"In a few weeks, a heady lineup including Nas, Miguel, Big Sean, Jeezy, T.I., George Clinton and Parliament Funkadelic, 2 Chainz (replacing Cardi B), Common, Robert Glasper and many more will descend upon Atlanta’s Central Park for an expanded edition of One Musicfest.\nAlong with the marquee names in rap and R&B, One Musicfest founder Jason “J” Carter has wrangled some of Atlanta’s best-known crunk artists. On Tuesday morning, DJ Nabs, East Side Boyz, Trillville and Kilo Ali hung out for an hour at The Gathering Spot to share their excitement about the upcoming festival.\nAs Carter said from a podium, “Our tagline from day one was ‘unity through music.’ There is power in being able to feed off each other. Why can’t you have George Clinton with 2 Chainz with East Side Boyz? We’ll always go far, far left, bring it back to center and go far, far right.”\nDJ Nabs noted the historical element to portions of the lineup and said he’s excited about making the “ATL Crunk Set” the “most amazing Southern hip-hop show...something that you’ve never seen before.”\nTicket for the Sept. 8-9 event are on sale now. Visit www.onemusicfest.com for more details.","url":"https://www.ajc.com/blog/music/one-musicfest-reunites-atlanta-crunk-artists-for-the-fall-event/RSDhT4n22SBjrEVWM7ITJM/"}
