{"authors":[],"date_download":"2018-10-30 00:51:11","date_modify":"2018-10-30 00:51:11","date_publish":"2018-07-27 00:05:41","description":"t is 10 p.m., I am in a cabin, and sipping my third Negroni from a coffee cup. No, this is not the typical evening. Let me explain.","filename":"data/vaneerConsumption/OneNegroniTwoNegroniThree.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Negroni_cocktail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860671.html","title":"One Negroni, Two Negroni, Three","title_page":"One Negroni, Two Negroni, ThreeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It is 10 p.m., I am in a cabin, and sipping my third Negroni from a coffee cup. No, this is not the typical evening. Let me explain.\nIt was a very good night on the dock. Panfish were plentiful, and a couple of bass also hammered the popper I chucked with my fly rod. To surprise, my stationary rod — a beat-up Okuma spinning combo I got years ago — had not landed a channel catfish, as it had in days before. No, a snapping turtle chomped on the cut bluegill I had put out. I probably have made 100 casts to this corner of the lake. Never had I caught a turtle. And here it was clomping across the board and hissing at me with a hefty circle hook half out its vicious beak.\nAll in all, the night felt like a culmination of my fishing experience at Punderson Lake, 150 acres of beautiful water and cut into the earth by a glacier thousands of years ago. So why not celebrate with a beverage?\nThe beer was gone; likewise the tonic. The only elixirs in the fridge were mostly empty bottles of gin, Campari, and sweet vermouth. I had had gin on ice straight the previous night. A Negroni it was. Again.\nI had consumed more Negroni’s in the past week than I had in the past 20 years. Its a good cocktail, but I found myself more seduced by other classics — Manhattans, martinis, and gin and tonics. I also found myself a little put off by the whole Negroni cult that had cropped up. When “mixologists” began peddling $20 barrel-aged Negroni’s in chic dives a decade back, I was damned if I was going to jump on that bandwagon.\nI might blame my Negroni binge on Richard Read. I had spent a couple weeks in Lakewood, Ohio, and Read’s Griffin Cider House and Gin Bar was steps from my AirBNB. Read, a U.K. transplant, began a cider maker, selling apple and pear drinks to pubs and John Q. Public. He opened his bar in 2015, which initially aimed to feature ciders but now showcases gin cocktails. I had enjoyed a superb martinis, vesper, and aviation cocktail — the latter a pale, cloudy, violet beauty. And Read’s herb-clobbered (basil, rosemary, jasmine pearls) gin and tonic was stellar.\nThen my wife ordered Griffin’s Negroni — and fell for it hook, line, and sinker. So it was that the Campari, gin, and sweet vermouth bottles had made their way to the cabin at Punderson Lake. But we had neglected to pack glasses, or a cocktail shaker for that matter. Cocktails were mixed in a pint glass found in the cupboard and served in beige coffee cups.\nThe Negroni packs quite the punch. It is three types of hooch with a slice of orange peel plopped in it. One Negroni equals three shots — or, it did the way we mixed them. One is more than enough to suit me. I had mixed two, thinking the Mrs. might want one. She did not, possibly because it was getting late. Possibly because she had fled to the bathroom to escape the huge cicada killer wasp that was rattling about the light in the kitchen.\nWaste not want not — two Negronis it would be.\nFinishing those two stiff drinks took time, which I spent killing the wasp and remembering all the fine fishing I had enjoyed the past four days. Bluegills, sunfish, pumpkinseeds, warmouth, catfish, large-mouth bass.… And that turtle. It was the last night at Punderson Lake, and I did not care to haul the bottles back home.\nWhich led me to the third Negroni.\nKevin R. Kosar is the vice president of policy at the R Street Institute and the author of Whiskey: A Global History and Moonshine: A Global History. He is the editor and founder of AlcoholReviews.com.","url":"https://spectator.org/one-negroni-two-negroni-three/"}
