{"authors":[],"date_download":"2018-10-23 01:00:06","date_modify":"2018-10-23 01:00:06","date_publish":"2015-11-23 00:00:00","description":"One of the last four northern white rhinos was euthanized at the San Diego Zoo Sunday. NPR's Kelly McEvers talks to Rick Schwartz, the zoo's global ambassador, about how the species was so decimated and what might be done to save it.","filename":"data/vaneerConsumption/OneOfLast4WhiteRhinosEuthanizedAtSanDiegoZoo.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=457139712_1540256406.html","title":"One Of Last 4 White Rhinos Euthanized At San Diego Zoo","title_page":"One Of Last 4 White Rhinos Euthanized At San Diego Zoo : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nThere are now just three northern white rhinos left in the world. The only one that was in the U.S. died yesterday. The San Diego Zoo announced veterinarians euthanized its white rhino - her name was Nola - after her already fragile health got worse. Nola was 41 years old. Rick Schwartz joins us now to talk about this. He is known as the zoo's global ambassador, and welcome to the show.\nRICK SCHWARTZ: Thank you so much for having me.\nMCEVERS: Yeah. Nola had lived in San Diego since 1989. Can you tell us about her life before that?\nSCHWARTZ: She was at a zoo over in Europe with a few other northern white rhinos. Unfortunately, they were already upwards in age. We were hoping that we might be able to get the opportunity to breed them, but they were just never able to reproduce just because of their age.\nMCEVERS: As we said, there are now only three northern white rhinos left in the world. Where are they?\nSCHWARTZ: Correct. There is a conservancy called Ol Pejeta, which is in Kenya very close to the equator. They are protected by fence. There are guard dogs, and there are armed guards with them 24 hours.\nMCEVERS: So what is it that led to the near extinction of the northern white rhino?\nSCHWARTZ: Well, unfortunately, many cultures believe that the horn of the rhino has medicinal value that can do anything from curing cancer to upping your libido and everything in between, it seems. The reality is, rhino horn is a protein made of keratin, just like your fingernails, just like the hooves of a cow or the hooves of a horse. But unfortunately because there are certain beliefs, currently on the black market, rhino horn is valued greater than cocaine or heroin.\nMCEVERS: And this isn't the only kind of rhino - right? - that's endangered. This is one particular kind.\nSCHWARTZ: Oh, no. They are not the only ones that are endangerd. You know, we have the Sumatran, which I believe - over 30 some of them left, the Javan - just a couple hundred left. We've lost already the western black rhino a few years back. The speed in which these animal species are careening towards extinction is frightening. You know, for us personally, we've lost a family member. We've known her for a long time. She was very personable, and everyone who got to see her was very enamored with her not only because she was 1 of 4 at the time but just her personality in general was very gentle.\nMCEVERS: You said she was gentle. What did she do?\nSCHWARTZ: Well, you know, having worked with animals my entire life, you know, you have an immense respect for an animal that's as large as a pickup truck. You respect the fact that if they even just shift their weight or they step sideways onto your toe, it could be a very bad day for you (laughter).\nSo when I first met Nola, I was a little reserved because, you know, in my experience - I've never been hurt by them, but you do respect something of this size. And the keepers just got right down, gave her a rubdown. You know, rhinos communicate quite a bit through their breathing pattern. And to hear the large exhale and inhale from her lungs as she was greeting her keepers and then allowing me to rub her down and feel the coarseness of her skin and hear her breath like that - she truly was a gentle soul, and she had worked with people for a long time. And she definitely identified each of her keepers through her senses and knew each of them very well.\nMCEVERS: One last-ditch plan that could work to save the northern white rhino is in-vitro fertilization. Can you explain how that would work?\nSCHWARTZ: We have six female southern white rhinos, which are a subspecies of the northern white rhino. We have 12 - or cells that represent 12 individual northern white rhinos. Our goal is to be able to create and let grow, in-vitro, a embryo of those cells from the northern white rhino species and utilize the southern white rhino as a surrogate, hopefully be able to put on the ground, in five or 10 years, live northern white rhinos.\nMCEVERS: What's the likelihood that that's going to work?\nSCHWARTZ: You know, we don't know the odds 'cause it's never been done. The reality is this, though. Like I mentioned the other species of rhinos - the Javan, the Sumatran, the black rhinos, the southern whites - as their numbers are plummeting, the science that we're using now in an attempt to save the northern white rhino can be then duplicated and used to save these species.\nMCEVERS: Rick Schwartz is global ambassador for the San Diego Zoo. We reached him to talk about the death of the zoo's white rhino. Her name was Nola. Thank you so much.\nSCHWARTZ: Thank you so much for having me.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=457139712"}
anscription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/11/23/457139712/one-of-last-4-white-rhinos-euthanized-at-san-diego-zoo"}
