{"authors":["Will Martin"],"date_download":"2018-10-31 00:35:18","date_modify":"2018-10-31 00:35:18","date_publish":"2016-12-01 00:00:00","description":"Agustín Carstens, the governor of the Bank of Mexico will take over as the next general manager of the Bank for International Settlements (BIS) in October 2017.","filename":"data/vaneerConsumption/Oneofglobalfinancesmostimportantinstitutionshasanewboss.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_agustin-carstens-new-boss-of-bank-for-international-settlements-2016-12_1540946118.html","title":"One of global finance’s most important institutions has a new boss","title_page":"    Agustín Carstens to become new manager of Bank for International Settlements - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Agustin Carstens. Reuters Agustín Carstens, the governor of the Bank of Mexico will leave his role and take over as the next general manager of the Bank for International Settlements (BIS) in October 2017, it was announced on Thursday. Carstens will leave his current role in July next year.\nCarstens, who has governed Banxico since 2010, is one of the best-respected economic policymakers on the planet, and has previously been considered for the job of IMF Managing Director, a role eventually given to Christine Lagarde.\nSpeaking about the announcement, Jens Weidmann, the chairman of BIS' board said:\n\"The Board of Directors is delighted to have secured a person of Mr Carstens's remarkable calibre and international experience to be the next BIS General Manager.\n\"He is held in high regard in the central banking and international financial communities and already has a strong relationship with the BIS. A member of the BIS Board since 2011, since 2013 he has successfully chaired the Global Economy Meeting of Governors, assessing developments, risks and opportunities in the world economy and the global financial system, as well as the Economic Consultative Council. The Board looks forward very much to working closely with Mr Carstens in his new role.\"\nThe news was earlier confirmed by Mexico's finance minister Jose Antonio Meade, who told a seminar of the announcement, adding that Carstens new job \"reflects the confidence in his management,\" according to the Financial Times. Meade added that Carstens \"will be 100% in charge for the coming months.\"\nCarstens' appointment is not a huge surprise. In November it was reported that he, and senior ECB policymaker Benoît Cœuré were the leading contenders to replace current chief Jaime Carauna, the former governor of the Bank of Spain.\nThe Bank for International Settlements — often referred to as the \"central bankers' central bank\" — acts as an arbiter for international central banking, and in its own words \"fosters international monetary and financial cooperation.\" The institution also oversees the Basel Accords, the series of recommendations that help govern global banking regulation.\nMexico's peso, which has been under pressure since Donald Trump's election victory, dropped sharply on the announcement, losing more than 1% of its value. Here's how it looks just after 4.30 a.m. GMT (11.30 a.m. ET):","url":"https://www.businessinsider.com/agustin-carstens-new-boss-of-bank-for-international-settlements-2016-12"}
