{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:54:32","date_modify":"2018-10-30 20:54:32","date_publish":"2014-10-21 15:53:00","description":"As millionaires and billionaires continue to push universal background checks and handgun registration in Washington state, their donations for Initiative 594 (I-594) have reached","filename":"data/vaneerConsumption/OnePercentersPushGunControlWarChesttoNearly95MillioninWashingtonState.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_10_21__1540932872.html","title":"One-Percenters Push Gun Control War Chest to 'Nearly $9.5 Million' in Washington State","title_page":"One-Percenters Push Gun Control War Chest to 'Nearly $9.5 Million' in Washington State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As millionaires and billionaires continue to push universal background checks and handgun registration in Washington state, their donations for Initiative 594 (I-594) have reached “nearly $9.5 million.”\nOn August 26, Breitbart News reported that one-percenters were bankrolling I-594.\nAt that point, Bill and Melinda Gates had given $1 million, as had Nicolas Hanauer. Steve and Connie Ballmer had given $580,000 by that point, and Microsoft co-founder Paul Allen had given $500,000.\nSeattle PI reports that the latest large donation, in the amount of $300,000, came from Michael Bloomberg-funded Everytown for Gun Safety. This brings the group’s donations for I-594 to a total of $1.98 million and brings the overall gun control war chest to almost $9.5 million in Washington state.\nOn September 11, Breitbart News reported that I-594–ubiquitously described as an expanded background check bill–will not only eliminate private gun sales throughout the state, but will also force the creation of a handgun registry to be enforceable. The measure will also create a Colorado-like gun control law, where a background check will be required for any “temporary transfer” of a gun to a friend beyond a time period “immediately necessary to prevent [imminent] death or great bodily harm.”\nOne-percenters like Bloomberg, Gates, and Ballmer are funding these laws. The NRA and the Second Amendment Foundation are fighting them tooth and nail.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2014/10/21/one-percenters-push-gun-control-war-chest-to-nearly-9-5-million-in-wash-state/"}
