{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:56:45","date_modify":"2018-10-30 20:56:45","date_publish":"2014-09-11 19:14:52","description":"Initiative-594, the universal background check initiative being bankrolled by millionaires and billionaires in Washington state, will lead to","filename":"data/vaneerConsumption/OnePercentersGunControlWouldMeanHandgunRegistrationforWashingtonState.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Guns/pistol-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_09_11__1540933005.html","title":"One-Percenters' Gun Control Would Mean 'Handgun Registration' for Washington State","title_page":"One-Percenters' Gun Control Would Mean 'Handgun Registration' for Washington State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Initiative-594, the universal background check initiative being bankrolled by millionaires and billionaires in Washington state, will lead to “universal handgun registration” if passed.\nPage 2 of the 18-page initiative opens the door to such registration by “extending the requirement for a background check to apply to all gun sales and transfers within the state.” This means record keeping, and record keeping means the formation of a database to compile the location of all known guns and the names of all known gun owners.\nThe NRA reports: “Every time a handgun is transferred, the person receiving the handgun will have their name added to the government database being maintained by the state Department of Licensing.”\nThe text of I-594 lists slight exceptions to the background check requirements, but they are often tedious. For example, “the temporary transfer of possession of a firearm if such transfer is necessary to prevent imminent death” is allowable without a check. But the transfer can only be done without paperwork granting that “it only lasts as long as immediately necessary to prevent immanent death or great bodily harm.”\nIf the friend to whom the gun was loaned wishes to hold on to it beyond the immediate threat period then he or she, as well as the gun owner, will have to find a Federal Firearms License (FFL) holder and undergo a background check to transfer the gun. This, in turn, will add a new name to the gun owner database.\nWhen Senator Joe Manchin (D-WV) tried unsuccessfully to push universal background checks at the federal level in 2013, Breitbart News argued then that such checks were unenforceable without the creation of a gun registry. What was true for such legislation in Washington, D.C. is also true for I-594 in Washington state.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2014/09/11/one-percenters-gun-control-initiative-means-handgun-registration-for-washington-state/"}
