{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:07:59","date_modify":"2018-10-30 18:07:59","date_publish":"2017-02-16 07:29:39","description":"One of four Republicans on the San Diego City Council stood against a Tuesday move to join the legal action against Trump’s executive order.","filename":"data/vaneerConsumption/OneSanDiegoRepublicanOpposesJoiningExecutiveOrderFight.json","image_url":"https://media.breitbart.com/media/2017/02/trump-executive-order-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_02_15__1540922879.html","title":"One San Diego Republican Opposes Joining Executive Order Fight","title_page":"One San Diego Republican Opposes Joining Executive Order Fight","title_rss":"NULL","source_domain":"breitbart.com","text":"One of four Republicans on the San Diego City Council stood against a Tuesday move to join with the city of Chicago in supporting the state of Washington’s legal action against President Donald Trump’s executive order on immigration.\nChicago asked San Diego to join an amicus curiae brief drafted in support of State of Washington v. Donald J. Trump, et al. and on Tuesday night the council voted to do so, according to the San Diego Union-Tribune.\nThe San Diego City Council consists of four Republicans and five Democrats, of which three Republicans and all five of the Democrats voted in support of supporting the lawsuit. Republican Scott Sherman was the only Republican to vote against.\nThe president’s temporary travel restriction, entitled “Protecting the Nation from Foreign Terrorist Entry into the United States,” focused on seven countries, identified by the Obama administration as sponsors of terrorism or countries whose records could not be trusted, and ordered a 90-day halt to immigration from those countries.\nThe legal action Washington State took against the President’s executive action is currently being litigated in the courts; however, a restraining order has halted implementation of the order as the case is considered.\nOn January 31, San Diego’s Republican Mayor Kevin Faulconer stated:\nI am confident we can strengthen America’s security without shutting America’s doors. Americans deserve an immigration policy that keeps us safe but this temporary ban – which affects children, mothers, innocent families and allies who support our Armed Forces – is not the right direction. We need to identify those who actually pose a threat by instead improving the screening process for immigrants from the countries designated by the intelligence community.\nTuesday’s vote was in a closed session of the council. The Union-Tribune reported that while dozens were able to testify asking council members to join the brief, only two people spoke against it.\nDemocrat Council Member David Alvarez was quoted in the report as saying he was “proud” the city was supporting the lawsuit.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2017/02/15/lone-republican-councilman-refuses-support-washingtons-lawsuit-trump-travel-restriction/"}
