{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:21:28","date_modify":"2018-10-30 21:21:28","date_publish":"2016-02-25 23:58:34","description":"Marco Rubio and John Kasich are fighting for the establishment lane in the Republican primary, and the candidates have argued that foreign policy is a major reason they are better qualified to become the next commander-in-chief of the armed forces. |","filename":"data/vaneerConsumption/OnForeignPolicyJohnKasichsRealismContrastswithMarcoRubiosIdealism.json","image_url":"https://media.breitbart.com/media/2016/02/Kasich-and-Rubio-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_25__1540934488.html","title":"On Foreign Policy, John Kasich’s Realism Contrasts with Marco Rubio’s Idealism","title_page":"On Foreign Policy, John Kasich’s Realism Contrasts with Marco Rubio’s Idealism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Marco Rubio and John Kasich are fighting for the establishment lane in the Republican primary, and the candidates have argued that foreign policy is a major reason they are better qualified to become the next commander-in-chief of the armed forces.\nFor the most part, Rubio aligns himself with the neoconservative wing of the Republican party, a heavily idealist group which insists upon intervention and democracy promotion to advance America’s interests.\nHe supported Hillary Clinton’s war in Libya, which resulted in the Islamic State now developing a strong foothold in the country. When Barack Obama’s “red-line” was crossed in Syria, and the president wanted to target the Assad regime, Rubio disaproved, but only because Obama’s targeting plan was “unbelievably small,” he said. When his colleagues were warning about the threat posed by Muslim Brotherhood-aligned staffers in the Obama Administration, Rubio joined Sen. John McCain, Hillary Clinton, and other neoconservative leaders in castigating his Republican colleagues for drawing attention to the issue.\nWhen it comes to experience, Sen. Rubio points to his seats on the Senate’s Foreign Relations and Intelligence Committees. His critics, however, point to the fact that he’s never been to Iraq, nor does he have any actual education or experience in world affairs, outside of his political positions.\nAs the two candidates fight for the establishment lane of the Republican primary, Kasich’s team has offered evidence that the Ohio Governor’s qualifications to be commander-in-chief far outweigh what Rubio can show for a record.\nTop Kasich staffers tell Breitbart News that the Ohio Governor, after dozens of years studying and working on international issues, and developing relationships with prominent heads-of-state, has garnered a sophisticated understanding of geopolitics.\nThey point to his 18 years on the Armed Services Committee, and the fact that he often challenged the status quo on the committee, demanding that they account for potential wasteful spending.\nJohn Kasich is the realist to Marco Rubio’s idealist.\nKasich laid out his foreign policy vision in a recent speech at the Council on Foreign Relations.\n“American leadership is indispensable to world peace,” but that does not mean the United States needs to lead through force, and can often effectively lead by example, Kasich explained.\n“There are no final answers,” he said in his speech. America should not be looking to solve all the world’s problems, but instead ask, “How do we achieve stability?” he added.\nScholars and experts in international affairs overwhelmingly agree: John Kasich is more qualified than Rubio on foreign policy issues.\nIn a recent survey, Foreign Policy magazine asked hundreds of international relations scholars who they thought would be best suited to “tackle the foreign-policy end of the job.” They preferred Kasich to Rubio, with the Ohio Gov. beating out the Florida Senator 54-6 percent among respondents.\nKasich staffers tell Breitbart News that his national security advisory team is made up of the best and brightest minds, and that this group of experts continues to grow.\nKasich “went to Kuwait during the first Gulf War to visit our troops. He has been to the Middle East several times. He’s met with several international leaders over the years,” A Kasich staffer told Breitbart News.\nThough he now serves as governor, international leaders still maintain contact with Kasich. “The German Ambassador [to the U.S.] traveled to Ohio just last year to meet with him … he watched a basketball game with [UK Prime Minister] David Cameron,” a Kasich staffer told Breitbart News.\n“He not only has the knowledge of who these people are and how they work, but they know he knows them and respects them,” he added. “You better have the understanding that you have to have mutual relationships and respect.”\nRubio and Kasich also agree on several fundamental issues.\nThey both think that the United States needs to take a more proactive role in backing Ukraine against Vladimir Putin’s Russian dictatorship. They agree that Turkey serves as an important NATO ally, and that the U.S. should use its influence to convince Turkey to align with the West. Both Rubio and Kasich are staunch supporters of the State of Israel, seeing the Middle Eastern democracy as the only beacon of freedom in a region filled with terror.\nYet, the candidates remain far apart from an ideological standpoint. Instinctively, Rubio is the Wilsonian Idealist, a man much more likely to initiative force in hopes to advance U.S. interests. Kasich, the Realist, prefers the promotion of stability, and an America that influences the world by leading by example.","url":"https://www.breitbart.com/politics/2016/02/25/on-foreign-policy-john-kasichs-realism-contrasts-marco-rubios-idealism/"}
