{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:42:07","date_modify":"2018-10-30 19:42:07","date_publish":"2015-08-12 15:03:05","description":"BROOKLYN, New York - Supporters of the Iran deal were in short supply at a town hall-style meeting with Rep. Hakeem Jeffries (D-NY) Tuesday night. Four |","filename":"data/vaneerConsumption/Only4ProIranDealActivistsShowupatBrooklynTownHall.json","image_url":"https://media.breitbart.com/media/2015/08/Screen-Shot-2015-08-12-at-7.54.39-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_12__1540928527.html","title":"Only 4 Pro-Iran Deal Activists Show up at Brooklyn Town Hall","title_page":"Only 4 Pro-Iran Deal Activists Show up at Brooklyn Town Hall","title_rss":"NULL","source_domain":"breitbart.com","text":"BROOKLYN, New York – Supporters of the Iran deal were in short supply at a town hall-style meeting with Rep. Hakeem Jeffries (D-NY) Tuesday night.\nFour supporters of the deal stood up during the question-and-answer portion of the evening and held homemade signs aloft urging passage of the deal. But their position in the room prevented those in the back from hearing the speakers on stage.\n“Excuse me, could you please sit down? I can’t see the congressman,” one man asked the protesters.\n“Sit down!” another urged.\nAfter a brief confrontation, the protesters were asked to leave by security. But the incident was a footnote on what was otherwise a strong outpouring of anti-deal sentiment from the Mill Basin community.\nA standing-room-only crowd of hundreds at the Flatbush Jewish Center cheered as Rep. Jeffries, who remains undecided on the deal, called Iran the leading sponsor of terrorism worldwide and vowed to do his part to never allow the country to build a nuclear bomb.\n“Fundamentally, we have to prevent Iran, the leading state sponsor of terror, from ever acquiring nuclear weapons,” Jeffries said. “Everyone believes that the best way to accomplish that is through diplomacy.”\nBut, he cautioned, the deal now before Congress has “several flaws.”\nThe proceedings were interrupted several times by impassioned critics of the deal, who shouted brief sayings like “Stop the deal!” and “This is not a tough decision!”\nAdding to the chorus of anti-deal support was Brooklyn Borough President Eric Adams, who was not at the event but issued a statement handed out to all attendees as they walked through the doors.\n“I support diplomatic efforts to achieve a nuclear deal with Iran that guarantees us and our allies greater safety, but unfortunately this is not the deal which is currently in front of Congress,” Adams said. “As New Yorkers, we know all too well what is at stake.”\nThe loudest cheers of the evening came when Omri Ceren, senior adviser at the Israel Project, called out attendees for focusing attention on the four protesters.\n“This man is an elected official,” Ceren said, pointing to Jeffries. “And this man has a Ph.D in nuclear physics,” he said, pointing to MIT professor Jim Walsh, who spoke briefly about the finer points of the deal earlier in the night.\n“But the camera phones come out for the protesters with the signs?” Ceren said, to enthusiastic applause.\nThe poor turnout of pro-deal supporters in Brooklyn echoed the the poor turnout of pro-deal supporters across the country in Colfax, California, where activists failed to show for a town hall hosted by Rep. Doug LaMalfa (R-CA).\nPresident Barack Obama has called on left-wing groups to organize in support of the deal. The Brooklyn town hall was one of those specifically targeted by pro-Iran deal activists.\nUpdate: Omri Ceren of The Israel Project says that there were two additional activists from MoveOn.org in the audience of hundreds:","url":"https://www.breitbart.com/politics/2015/08/12/only-4-pro-iran-deal-activists-show-up-at-brooklyn-town-hall/"}
