{"authors":["Bill Chappell"],"date_download":"2018-10-23 05:17:20","date_modify":"2018-10-23 05:17:20","date_publish":"2014-06-19 00:00:00","description":"The amount of confidence Americans have in Congress has hit a new low, plummeting from highs in the 1970s and '80s. In the same period, the military has boosted its image.","filename":"data/vaneerConsumption/Only7PercentOfAmericansAreBigFansOfCongress.json","image_url":"https://media.npr.org/assets/img/2014/06/19/congress_ext_wide-38ce4941a45493d4df70383d4d948078706d5f75.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_06_19_323533716_only-7-percent-of-americans-are-big-fans-of-congress_1540271840.html","title":"Only 7 Percent Of Americans Are Big Fans Of Congress","title_page":"Only 7 Percent Of Americans Are Big Fans Of Congress : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Only 7 Percent Of Americans Are Big Fans Of Congress\nEnlarge this image toggle caption Brendan Smialowski/AFP/Getty Images Brendan Smialowski/AFP/Getty Images\nThe amount of confidence Americans have in Congress has hit a new low. Only 7 percent of the people polled by Gallup said they have \"a great deal\" or \"quite a lot\" of confidence in the legislature as an American institution.\nThe rock-bottom level of confidence in Congress \"is not only the lowest on record,\" the polling company says, \"but also the lowest Gallup has recorded for any institution in the 41-year trend. This is also the first time Gallup has ever measured confidence in a major U.S. institution in the single digits.\"\nThe presidency comes off a bit better, with 29 percent of respondents saying they have confidence in it. (For an idea of how Americans see the two main parties in U.S. \"battleground\" states, you can refer to NPR's new poll, out today.)\nThe Gallup poll was conducted by asking more than 1,000 adults around the U.S. if they have \"a great deal, quite a lot, some, or very little\" confidence in various institutions.\nWhile the American public might not have faith in Congress, some institutions are still inspiring confidence — the military leads the way, with 74 percent. Up next is small business, at 62 percent, and the police, with 53 percent.\nThe good showing for the U.S. military continues the gains it's made overall since the early 1980s, when only 50 percent of Americans said they had a high level of confidence in it.\nAnd we'd tell you to take all this news with a grain of salt — but there's a good chance you already have the shaker handy: Gallup says that news on the Internet inspired confidence in only 19 percent of those polled.\nGallup says the margin of sampling error in its poll is plus or minus 4 percentage points.","url":"https://www.npr.org/sections/thetwo-way/2014/06/19/323533716/only-7-percent-of-americans-are-big-fans-of-congress"}
