{"authors":[],"date_download":"2018-10-30 00:51:02","date_modify":"2018-10-30 00:51:02","date_publish":"2018-07-09 00:05:28","description":null,"filename":"data/vaneerConsumption/Only23HourstoRecharge.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Chevy_Volt_2nd_gen_charging_Arlington_08_2017_5215.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860662.html","title":"Only 2.3 Hours to Recharge!","title_page":"Only 2.3 Hours to Recharge!The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"My teeth and gums are particularly sore today.\nI read — and relate with sourness — that GM has achieved the miracle of reducing the charge-up time of the 2019 Chevy Volt to “only” 2.3 hours — assuming you can plug the thing into a 240 Volt “fast” charger.\nIf not, the time to achieve the equivalent of a full tank is only 13 hours.\nThis is taken as progress in a world where that word invariable means regression.\nProgress used to mean or at least be roughly synonymous with improvement.\nThus, it would be considered an improvement if a car cost less, performed better, or imposed fewer hassles on its owner.\nWell, it would by the old standards of language.\nWe are supposed to cheer as “progress” a vehicle that takes literally orders of magnitude longer to recover its capability to move — the thing we expect a car to be able to do above everything else — than a car built 100 years ago took to recover its ability to move. Do the math. Call it two hours. That is 120 minutes.\nAs opposed to the five minutes it takes to gas up a normal — a sane — car.\nHow many times does 5 go into 120?\nTwenty-four times.\nThat’s the best-case scenario, remember.\nIf you do not have access to 240 volts — which most people don’t because it takes special wiring/infrastructure (which costs extra, too) — and have to plug into 120V instead, the recharge time more than quintuples. It takes literally half a day to recharge on household 120V current.\nYou don’t want to do that math.\nThough maybe you should, given the hard push electrics and plug-in hybrids are being given by Uncle Sam. You soon may have no choice about plugging-in.\nAnd paying for it.\nThe car — and then the charge.\nOne of the anvils hanging over the collective heads of the electric car earnest — the starry-eyed fools who see these things as The Future — is the current absence of charge. Not the electricity but the having-to-pay-for it.\nMany of the public charge stations are currently “free” — for now. It is a Tricky Dick (or Slick Willy, if you prefer a more… current reference) means of gulling the gullible into thinking — such a deal!\nAnd none of the public chargers or the electricity piped into your home includes motor fuels taxes, as on gas and diesel.\nWhich of course it will have to at some point because it must. How else will the roads be paid for? If anything, electric cars accelerate wear and tear on roads because they weigh considerably more than their IC-engined counterparts. That fact will probably be factored into the taxes applied to electricity once the electric car thing really gets rolling — assuming it ever does. But without question, at least the equivalent of the current 50-something cents per gallon we pay in addition to paying for each gallon of gasoline or diesel will have to be applied to the kilowatt-hour equivalent of electricity.\nThat math will be unpleasant, too.\nBut there will be plenty of time to figure it all out. Using an abacus, if you like.\nThere’s no hurry.\nAh, progress.\nWe pay more to wait longer and go not as far in cars that cost more.\nAnd they ask me why I drink…","url":"https://spectator.org/only-2-3-hours-to-recharge/"}
