{"authors":["Associated Press"],"date_download":"2018-10-23 01:36:01","date_modify":"2018-10-23 01:36:01","date_publish":"2016-01-29 15:38:04","description":"IN THE DEMILITARIZED ZONE, North Korea (AP) — There is a strange quiet along the northern side of the Demilitarized Zone that divides the two Koreas. Quiet, ...","filename":"data/vaneerConsumption/OnNorthKoreassideofDMZKpoprevealsgrowingtensions.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:04ce7d8cee4c473183571f5cc3859846-3bmscybNe842cce83474b5762b82-87_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422803_On-North-Koreas-DMZ-K-pop-reveals-growing-tensions_1540258561.html","title":"On North Korea's side of DMZ, K-pop reveals growing tensions","title_page":"On North Korea's side of DMZ, K-pop reveals growing tensions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"On North Korea's side of DMZ, K-pop reveals growing tensions\nIN THE DEMILITARIZED ZONE, North Korea (AP) — There is a strange quiet along the northern side of the Demilitarized Zone that divides the two Koreas.\nQuiet, until you listen harder.\nMixed in with magpies flying peacefully overhead and leaves rustling in the freezing wind, the faint melodies of South Korean pop ballads waft through the air, interspersed with spoken commentaries too weak to really follow but strong enough to discern an accent that is decidedly southern.\nFILE - In this Thursday, Jan. 7, 2016, file photo, a South Korean soldier looks through a pair of binoculars near the border village of Panmunjom, that has separated the two Koreas since the Korean War, in Paju, South Korea. Despite heightened tensions since North Korea carried out what it says was its first H-bomb test on Jan. 6, and indications that it¿s now preparing to launch a rocket that is bound to bring an international outcry, there is a strange quiet along the northern side of the Demilitarized Zone that divides the two Koreas. (AP Photo/Lee Jin-man, File)\nThe music has been drifting over the border in retaliation for what North Korea said was its first hydrogen bomb test on Jan. 6. Amid indications that the North is now preparing to launch a rocket that is bound to bring a further international outcry, the odd mixture of calm and almost imperceptible strains of K-pop are an unsettling reminder that, like so many things in this hard-to-read country, appearances can deceive.\nSurrounded by a deeply dug-in and carefully hidden array of troops ready to attack and artillery batteries ready to fire, this is the world's most heavily fortified border. In a strip of land ridden with intermittent skirmishes and swathed in decades-old animosities, the motto of the U.S. troops stationed merely a stone's throw away — \"Ready to Fight Tonight\" — is a fitting testament to the latent volatility of the world's final Cold War flashpoint.\nPerhaps waiting to first find out what kind of response to its nuclear test the United Nations will come up with, the North has so far said hardly a word about the restart of the South's propaganda broadcasts.\nBut flare-ups can be sudden.\nJust a few months ago, the South's decision to restart similar propaganda broadcasts after the death of two South Korean soldiers in a land mine blast so incensed North Korea that it issued an ultimatum to the South that if they weren't stopped, the rock-concert-style banks of speakers on the southern side of the DMZ would be attacked and destroyed, even if that meant going to war. South Korea turned them off.\nA Korean People's Army colonel who on Friday escorted an AP Television News crew around a military outpost on the edge of the DMZ seemed almost sanguine about them.\nBack in the day, he said, the broadcasts used to be a lot louder. He said that since signing up at age 16 he has spent most of his 40 years in the military assigned to various duty postings around the DMZ. Until 2000, the North broadcast its own propaganda right back at the South.\nThe colonel, Jon Nam Su, denied reports in the South that it has started doing that again.\n\"We're not doing that,\" he said. \"But the puppets in the South do what the U.S. wants, and they are saying extremely unreasonable things.\"\nAccess to the DMZ on both the North and South sides is heavily controlled.\nFrom the North, there are only two places where foreigners are allowed to go, so it is hard to independently verify if the North hasn't conducted such broadcasts.\nFrom the outpost where Col. Jon spoke, a concrete bunker perched atop a hill that commands a clear view of the DMZ, it is possible to see guard posts in the South that fly both the South Korean and United Nations' flags.\nThe bunker itself is often used for indoctrination gatherings and tours for foreigners, who are provided with binoculars. A well-worn trail passes below the bunker along the northern edge of the DMZ. North Korean soldiers use it for their patrols.\nAbout 20 kilometers (12 miles) west of the post is the armistice village of Panmunjom, where North and South Korean soldiers are close enough to silently glare at each other at arm's length. But on Friday only a couple of North Korean soldiers stood guard outside the meeting huts that straddle the Military Demarcation line dividing their countries.\nThe line runs down the center of the DMZ, with four kilometers of territory — two in the North and two in the South — serving as a buffer.\nWhen asked about the tensions since the purported H-bomb test, North Korean army Lt. Col. Nam Dong Chol said his country is not afraid of new sanctions from the U.N. Instead, and in line with North Korea's official talking points, he said the time has come to negotiate a peace treaty with the United States.\nHe noted that the armistice, signed in 1953 in one of the barracks at Panmunjom, ended the fighting in the Korean War but left the two sides in a state of conflict that has gone on for more than six decades.\n\"To solve the problem on the Korean Peninsula, we have to replace the armistice agreement, which is now just a scrap of paper, with a peace treaty concluded between us and the United States,\" he said. \"A peace treaty, in itself, would show that both sides trust each other, believe in each other, and respect each other. So, concluding a peace treaty would mean solving the Korean Peninsula problem in a peaceful way.\"\nWith the current standoff between North Korea and most of the world after its fourth nuclear test likely to get worse in the weeks and months ahead, such a solution seems very, very far away.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422803/On-North-Koreas-DMZ-K-pop-reveals-growing-tensions.html"}
