{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:46:20","date_modify":"2018-10-30 22:46:20","date_publish":"2015-10-20 21:41:45","description":"What is California’s Climate Change Plan? For decades, California has been a leader on environmental and climate change policies, including the Zero","filename":"data/vaneerConsumption/OnRampCaliforniasClimateChangePlan.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939580.html","title":"On Ramp - California's Climate Change Plan","title_page":"On Ramp - California's Climate Change Plan | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"What is California’s Climate Change Plan?\nFor decades, California has been a leader on environmental and climate change policies, including the Zero Emission Vehicle Mandate in 1990 and a “Clean Car” bill in 2002 that became a model for the National Fuel Efficiency Standards that President Obama announced in 2012. The California Air Resources Board said recently that 40 years of energy efficiency policies have saved $74 billion in electricity costs, and broader climate policies will, in the future, cut in half the costs and greenhouse gas emissions from passenger vehicles. The impact on global climate change is small, since California produces just 1 percent of the world’s greenhouse gas emissions. But the state’s policies are so far ahead nationally that California expects to meet President Obama’s Clean Power Plan 10 years before the federal deadline.\nTo date, the state’s landmark climate change policy is contained in the California Global Warming Solutions Act signed in 2006 by former Republican Governor Arnold Schwarzenegger. The legislation established a comprehensive program to reduce greenhouse gas emissions to 1990 levels by 2020, representing about a 11% reduction from the levels in 2006. State officials predict today that the state will achieve the emission goals by 2020, although emissions still need to fall by 6 percent to meet the target.\nWith the 2020 goals in sight, Governor Jerry Brown looked ahead to a new set of climate change targets in his inaugural address on January 5, 2015. By 2030, the governor proposed that half of the electricity used in California be from renewable energy sources like solar and wind power; that homes, businesses and factories double their energy efficiency and that fuel used by cars and trucks be cut by up to 50 percent.\n“I envision a wide range of initiatives,” he said. “More distributed power, expanded rooftop solar, micro-grids, an energy imbalance market, battery storage, the full integration of information technology and electrical distribution and millions of electric and low-carbon vehicles. … Taking significant amounts of carbon out of our economy without harming its vibrancy is exactly the sort of challenge at which California excels. This is exciting, it is bold and it is absolutely necessary if we are to have any chance of stopping potentially catastrophic changes to our climate system.”\nOn October 7, 2015, the governor signed Senate Bill 350, the “Clean Energy and Pollution Reduction Act of 2015.” The bill by Senate President Pro Tem Kevin de León (D-Los Angeles) codified Governor Brown’s proposals to get half of the state’s electricity from renewables sources and double the energy efficiency of homes and businesses by 2030. Initially, the bill included the governor’s plan to cut fuel use in motor vehicles in half by 2030, but that provision was stripped due to opposition from moderate Democrats in the state Assembly. Brown said he still intends to achieve the goal by using regulations and executive orders. Meanwhile, environmentalists were glad to see that the bill also described the state’s plan to reduce greenhouse gas emissions by 40 percent below 1990 levels by 2030 and 80 percent below 1990 levels by 2050.\nWhat is the California Global Warming Solutions Act and is it working?\nThe California Global Warming Solutions Act of 2006 established a comprehensive program to reduce greenhouse gas emissions to 1990 levels by 2020. The legislation was signed into law on September 27, 2006 by former Republican Governor Arnold Schwarzenegger. The legislation, Assembly Bill 32 (AB32), was authored by then-Assemblywoman Fran Pavley (D-Agoura Hills) and then-Assembly Speaker Fabian Nuñez (D-Los Angeles).\nAB32 directed the California Air Resources Board (CARB) to establish the regulations and programs that would achieve the 2020 emission reduction goals. There are three major components of CARB’s plan:\nA “cap-and-trade” program in which the state sets a limit on how much greenhouse gas a business can emit. Companies can participate in an auction where they can buy or sell permits for greenhouse gas emissions.\nA requirement that one third of the electricity used in California will come from renewable energy sources by 2020. (That figure was increased in 2015 to 50 percent by 2030.)\nA requirement that companies reduce the carbon intensity in gas and diesel fuel by 10 percent by 2020.\nIn 2010, opponents of AB 32 qualified a ballot measure that would suspend the policy until California’s unemployment rate fell below 5.5 percent for four consecutive quarters. The measure, Proposition 23, was rejected by voters 62 percent to 38 percent. Californians still show strong support for the policy. A poll in July 2015 by the Public Policy Institute of California found 69 percent support the goals of AB 32.\nIs it working? It would be an impressive feat, considering that about 10 million more people are expected to live in California in 2020 compared to 1990. The most recent figures available from 2013 indicate that California is still six percent above the 2020 emission goals, down from 11 percent when AB32 passed in 2006. Significantly, emissions have fallen only slightly since the recession ended in 2009. And ironically, national greenhouse gas emissions have fallen more rapidly nationally than in California from 2004 to 2013. Authorities say that is partly because California was already far more energy frugal.\nWhat is the cost? Good question. Consumers have seen an estimated three to five percent increase in electricity costs and they are paying about a dime more for gas because of the state’s climate policies. State officials say the costs are balanced by the savings from better health and the revenue from new companies and jobs inspired by the policy changes. The state’s official description of the costs and benefits has evolved, however.\nThe first climate change “Scoping Plan” issued by CARB in 2008 said AB32 would mean: “Increased economic production of $33 billion; increased overall gross state product of $7 billion; increased overall personal income by $16 billion; increased per capita income of $200; increased jobs by more than 100,000.” In contrast, the most recent Scoping Plan update in 2014 said: “the net impact of AB 32, even after full implementation, is estimated to be small in relation to the $2 trillion California economy. … As California emerges from the recession, the overall impact of AB 32 remains unclear, and many questions remain unanswered.”\nWhat is “Cap-and-Trade” and will it last?\nThe state’s “cap-and-trade” program was launched in 2013 as a market-based tool to set a price on pollution, or carbon. In the program, the state sets a limit — or cap — on the amount of greenhouse gas that can be emitted by about 600 facilities in California including food processors, paper mills, cement manufacturers and electricity providers. The program was extended in early 2015 to include transportation fuels, raising the cost of gasoline in California by an estimated 10 cents.\nCompanies above the state’s cap, which is lowered each year, can reduce their emissions or purchase credits from companies operating below the cap. The credits can be purchased at an auction held by the state several times each year that is closed to the public and press, or traded among companies. The program is intended to give companies a financial incentive to reduce emissions as well as the flexibility to exceed the cap.\nIn addition to purchasing credits, companies can also purchase “offsets” — environmental projects to reduce greenhouse gas emissions such as preserving forestland, capturing methane from pigs and cows and destroying chlorofluorocarbons that might otherwise deplete the ozone layer. Offsets are controversial, however, partly because 80 percent of those approved by the state are outside of California.\nMoney generated by the auctions is intended to be spent on projects that help reduce greenhouse gas emissions. Between 2012 and 2014, the cap-and-trade program generated more than more than $969 million for the state from nine auctions. From 2014 to 2016, the program is expected to generate $3.4 billion. The state’s plan for a high speed rail system will get an increasing amount starting at about $250 million, even though the environmental benefit of the proposed train has been controversial. More of the money is committed to disadvantaged communities and affordable housing. About half the money is still a matter of debate in the Capitol.\nThe money and the cap-and-trade program has been challenged in court by the California Chamber of Commerce on grounds that it represents an illegal tax because it was imposed by CARB, not the Legislature. The Air Resources Board, in its filings, contends that the money is neither a tax nor a fee, but rather the “byproduct” of a regulatory system “designed to reduce emissions, not to raise money.” The case is now on appeal after the chamber lost a decision in Superior Court.\nState regulators believe that cap and trade will eventually account for about one-fifth of California’s overall emissions cuts. For now, though, officials can’t say how much the system is furthering the state’s environmental goals. As of 2013, the most recent data available, overall emissions in the state dropped just 0.3 percent compared with the year before.\nWhat is the state renewable energy policy?\nIn 2015, Governor Brown signed a bill (SB 350) that says California will get half of its electricity from renewable sources like solar and wind power by 2030. It’s an ambitious goal, but it continues an increasingly aggressive policy that started back in 2002 when the state said it would get 20 percent of its electricity from renewables by 2017. All three of the state’s major utilities say they have already achieved that goal. In 2006, Assembly Bill 32 increased the goal to 33 percent of electricity from renewables by 2020. Utilities are hopeful about reaching that goal but it is not yet guaranteed.\nToday, about a third of the state’s renewable power comes from wind and about a quarter comes from geothermal sources like natural hot springs. In coming years, however, solar energy is expected to increase substantially. By 2020, the state public utilities commission predicts that solar will contribute more than 40 percent of the state’s renewable power.\nAs California moves toward its 2030 goal, one of the greatest challenges is that renewable sources like wind and solar are variable according to weather and the time of day. Authorities are hoping to develop new ways to store power and to encourage consumers to use electricity at times when it is most available. It’s an aggressive policy, but other states and nations have done even more. Denmark gets more than 40 percent of its electricity from renewables today and hopes to go fully renewable by 2050. Hawaii plans to be 100 percent renewables by 2045 and Vermont is aiming at 75 percent by 2032.\nAs for cost, California already has some of the most expensive electricity in the nation — about 35 percent more costly than Nevada next door. The California Public Utilities Commission estimates that rates in California have risen about three to five percent due to the renewable requirement so far. They have not estimated how much the increase to 50 percent of renewables will cost consumers.\nWhat is the Low Carbon Fuel Standard?\nThe LCFS was adopted in 2009 as the California Air Resources Board sought to achieve AB 32’s goal of reducing greenhouse gas emissions to 1990 levels by 2020. Transportation accounts for 40 percent of greenhouse gas emissions in California.\nThe LCFS regulation, which became effective in 2011 and was updated in 2015, is a rule designed to reduce greenhouse gas emissions associated with the lifecycle of transportation fuels used in California. The lifecycle of a fuel includes the emissions associated with producing, transporting, distributing, and using the fuel. The lifecycle is sometimes referred to as “well to wheels.” The regulation reduces lifecycle greenhouse gas emissions by assessing a “carbon intensity” score to each transportation fuel based on that fuel’s lifecycle assessment. The state’s goal is to reduce the carbon intensity of the state’s fuels by 10 percent by 2020.\nThe regulation applies primarily to producers and importers of gasoline and diesel. Each regulated company is required to assess the carbon intensity of the fuels it produces and determine whether its inventory is above or below the state’s target. Those above the target can purchase credits; those below the target will generate credits they can sell.\nThe policy is expected to encourage greater use of alternatives to gasoline and diesel such as biofuels, natural gas and electricity. A 2015 study by the International Council on Clean Transportation said low-carbon fuels could replace a quarter of the gasoline and diesel used by 2030. Another study by the Environmental Defense Fund and the American Lung Association predicted that by 2025 California’s fuel policies will save $8.3 billion and prevent 880 premature deaths associated with pollution related health costs.\nHow can the state cut fuel use in half by 2030?\nAlthough the goal of cutting fuel use in half by 2030 was rejected by the state Assembly in 2015, Governor Brown said he still plans to achieve it through regulations and executive orders. Many policies already in place are expected to substantially reduce the state’s use of gasoline and diesel, perhaps approaching the governor’s goal.\nOne of the biggest impacts will come from the increase in the federal fuel efficiency standards announced by President Obama in 2012. The new standards mean that cars and light trucks sold in the model year 2025 will need to get 54.5 miles per gallon, though the real number is more like 40 miles per gallon. The program is expected to save consumers the equivalent of about $1 per gallon, reduce greenhouse gas emissions and cut U.S. fuel consumption by about 2 million barrels of gasoline per day.\nThe state’s Low Carbon Fuel Standard is also expected to encourage motorists to use more alternatives to gasoline such as biofuel, natural gas and electricity. A 2015 study from UC Davis said the use of alternative fuels is about 7 percent today and it could triple in the next 10 years.\nCalifornia is also moving aggressively toward a goal of 1.5 million electric cars on the road by 2025, a goal established by Governor Brown in a 2012 executive order. In the first half of 2015, about 16,900 all-electric cars were sold in California, comprising 1.7 percent of all new-car sales, according to IHS Automotive; hybrids and plug-in hybrids made up another 5.5 percent and 1.2 percent of new-car sales in the first half of the year. California is already home to about half of the nation’s plug-in hybrids and about 46 percent of plug-in electric vehicles. That’s partly due to the state’s Clean Vehicle Rebate Program, which has already provided more than $240 million in subsidies since 2010 to about 114,000 people who have bought or leased electric of hybrid vehicles. Senate Bill 350, the landmark climate change bill that Brown signed in 2015, also seeks to accelerate the electrification of cars by directing the state’s major utility companies to add new charging stations throughout the state.\nFinally, a number of recent policies aim to reduce VMT — vehicle miles traveled — by encouraging greater use of public transit, bicycles, telecommuting and high density housing. Under Senate Bill 375 — the “Sustainable Communities and Climate Protect Act of 2008” — the Air Resources Board established regional greenhouse gas emission goals and local authorities are required to submit a plan for meeting the goals largely by policies that reduce VMT. The most notable example of the local policy is the controversial decision by the Los Angeles City Council in September 2015 to add hundreds of miles of bicycle and bus-only lanes, much of it by reducing lanes now available to cars.\nHow will the state increase energy efficiency in homes, businesses and factories?\nSenate Bill 350, signed by the governor in September 2015, included a major provision that requires buildings, homes and factories to double their energy efficiency by 2030. As the Natural Resources Defense Council reported, that will save enough electricity for 5 trillion cups of coffee per year and enough natural gas for 13 billion showers. In other words, California’s electricity use in 2030 will be 10 percent lower than it was in 2014.\nThe legislation begins a process in which the California Public Utilities Commission is ordered to conduct a public process with input from stakeholders that will establish a set of annual targets for energy efficiency savings and demand reduction by January 2017. The policy is expected to create incentives for home and building owners to increase efficiency with improvements like better insulation and windows, new appliances and smart technologies to manage energy use.\nProponents say the changes will create a savings for consumers but there is little information available about the projected cost of the improvements or the incentives that might be provided. Skeptics have also raised concern about whether the policy will increase the cost of housing in California, which is already more than double the national average.","url":"https://calmatters.org/articles/on-ramp-californias-climate-change-planwhat_is_the_california_global_warming_solutions_act_and_is_it_working/"}
