{"authors":["Will Martin"],"date_download":"2018-10-30 22:33:47","date_modify":"2018-10-30 22:33:47","date_publish":"2016-12-13 00:00:00","description":"A clear trend is emerging in the London property market. Prices are finally on their way down.","filename":"data/vaneerConsumption/ONSHousePriceIndexforOctober2016.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ons-house-price-index-london-property-prices-are-falling-2016-12_1540938827.html","title":"ONS House Price Index for October 2016","title_page":"    ONS House Price Index for October 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Neil Hall A clear trend is emerging in the London property market. Prices are finally on their way down.\nThe latest UK House Price Index from the Office for National Statistics — released on Tuesday morning — showed that in October, prices in the capital fell by 1.2% from the previous month, with the average house in the capital now worth £474,475.\nThat is still over £150,000 higher than the average price anywhere else in the UK, but October's fall is another data point in what appears to be the start of a downward trend for the capital's ridiculously inflated market.\nThe average price of a home in the capital is now just £2,000 more than it was in May. Before that house prices had generally risen by about £5,000 per month for nearly two years, but that growth seems to have almost totally stopped, and it is a sign that prices are on their way down.\nHere is the ONS' chart showing how little London property values have increased in the last six months:\nOffice for National Statistics\nFalling prices have been telegraphed for a long time. As early as October 2015, Deutsche Bank called the top of London's runaway housing market in a blisteringly pessimistic note sent to clients. In August this year, a report from estate agent Haart showed that the economic shock of the UK's vote to leave the European Union helped slice just over £30,000 off the average London property price.\nOther evidence of a coming drop in London property prices came earlier in December from London estate agent Portico. Portico said that transaction volumes, or the number of homes being bought and sold in the capital, are \"critically low\" — almost 50% lower than this time last year. That could be a bad sign.\nOther estate agents have also warned that a central London slowdown will spread to the rest of the capital. Analysis from Knight Frank in November said a \"slowdown in prices which has been evident in central London over the past 12 months will spread to the wider region, with Greater London prices down marginally in 2017.\"\nProperty prices are increasingly depending on the battle between political uncertainty and low interest rates. The more political uncertainty there is, the longer interest rates will stay low and the easier it becomes to borrow money to buy a house. But high political uncertainty also makes buying a house in London less appealing for those who want to invest from abroad or for those looking for a second property.\nThe ONS' report also showed that nationally, property prices grew just 0.1% between September and October to £216,674. That represented a 6.9% rise from the same time in 2015.","url":"https://www.businessinsider.com/ons-house-price-index-london-property-prices-are-falling-2016-12"}
