{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:29:18","date_modify":"2018-10-30 23:29:18","date_publish":"2016-12-07 00:00:00","description":"The ONS admits a 'processing error' meant it underestimated the UK's third quarter trade deficit by £6 billion.","filename":"data/vaneerConsumption/ONSunderestimatesUKsQ3tradedeficitby6billionduetoprocessingerror.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ons-underestimates-uk-trade-deficit-processing-error-2016-12_1540942158.html","title":"ONS underestimates UK's Q3 trade deficit by £6 billion due to 'processing error'","title_page":"    ONS underestimates UK's Q3 trade deficit by £6 billion due to 'processing error' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The ONS admit Britain spent £6 billion more importing goods in the third quarter than it first thought. Stefan Rousseau PA Wire/PA Images LONDON — The Office for National Statistics (ONS) admits it calculated the UK's trade deficit wrong.\nThe ONS discovered a \"processing error\" related to the trade in \"erratic\" goods, which includes gold, silver, precious stones, aircrafts, and ships.\nTrade deficit estimates for 2015 and the first half of 2016 have been revised as a result of the discovery. It means that Britain was actually £10 billion better off over the period, thanks to a £6.7 billion upgrade to the balance of trade in 2015 and a £3.3 billion improvement in the first two-quarters of 2016.\nHowever, the majority of this accounting gain has already been wiped out by a serious deterioration in Britain's third quarter trading numbers.\nThe ONS added £6 billion to the deficit as part of its revisions, saying that Britain's trade deficit in the three months to September was actually £17 billion, rather than an earlier estimate of £11 billion. The £6 billion writedown is the biggest quarterly revision.\nTrade deficit measures the difference between the value of what Britain exports and what it imports. It is important as a measure of the health of the economy in a global context. Countries want to run a trade surplus — exporting more than they import — otherwise they are forced to borrow money to pay for imports.\nThe ONS apologised for the accounting error and played down the significance of the revisions, saying in a statement: \"Because the 'erratics' series is volatile, a total trade series that excludes erratics may provide a better guide to the emerging trade picture. We will therefore include a total trade in goods and services excluding erratics series in the next release.\"\nHistorical GDP growth figures are not impacted by the revisions to the trade deficit.","url":"https://www.businessinsider.com/ons-underestimates-uk-trade-deficit-processing-error-2016-12"}
