{"authors":["Julie Cart","Dan Morain"],"date_download":"2018-10-30 22:48:23","date_modify":"2018-10-30 22:48:23","date_publish":"2018-06-27 22:02:52","description":"California's cap-and-trade program is under threat by the withdrawal of Ontario from the bi-national carbon-trading market.","filename":"data/vaneerConsumption/OntarioreadytopulloutofCaliforniascarbonmarket.json","image_url":"https://calmatters.org/wp-content/uploads/smokestacks-e1530125973167.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939703.html","title":"Ontario ready to pull out of California's carbon market","title_page":"Cap-and-trade: Ontario ready to pull out of California's carbon market","title_rss":"NULL","source_domain":"calmatters.org","text":"The agreement that linked the Canadian province of Ontario with California and Quebec in one of the world’s largest emissions trading markets was announced with much fanfare in 2017.\nAt last, it seemed, Gov. Jerry Brown’s vision of global neighbors sharing a carbon market—and lofty goals to green the planet—was launched.\n“We’re on the side of science,” the California governor said at the time, “We’re on the side of reality.”\nSometimes reality bites.\nThe news of Ontario’s impending withdrawal from the bi-national cap-and-trade program, after less than a year of partnership, has landed with a thud. The retreat of California’s largest emissions trading partner is a function of politics as much as policy, but the sting to the state’s ambitions is no less felt.\nThe incoming premier of Ontario, Doug Ford, said he will move quickly to decouple the province from the trading program, calling a carbon tax a bad deal for Canadians.\nAs an indicator of wider interest in cap-and-trade programs, so central to California’s greenhouse gas reduction ambitions, Ontario’s defection is not ideal. It awkwardly comes just a couple of months before California is set to showcase its cap-and-trade program when it hosts an international climate summit in San Francisco. And as Brown continues to shop the alliance to other states and countries—and faces questions about its effectiveness at home—the development could cause potential partners to balk.\nBut it would be a mistake to view Ford’s decision as a referendum on cap and trade, according to Katelyn Roedner Sutter, a senior climate policy analyst for the Environmental Defense Fund.\n“This decision was a political one, not a reaction to the performance of the cap-and-trade program,” she said. “What will matter to other subnational governments interested in joining California and Quebec is the ongoing success of these two jurisdictions in reducing emissions and growing their economies—not what Ontario chose to do as a result of its own internal politics.”\nIn the short term, the damage to the market appears minimal.\nTraders said the pullout briefly unsettled the market, in which companies buy and sell carbon credits to offset emissions. But quick action by officials to suspended transfers with Ontario helped stabilize prices.\nThat leaves just one Canadian province, Quebec, still partnering with California. And Ontario’s market share was much larger than Quebec’s. Still, observers say that a slimmed-down emissions market can withstand Ontario’s departure.\nIn fact, the market has already shrugged off Ontario’s exit, said Chris Busch, research director at Energy Innovation, a San Francisco-based clean energy think tank.\n“(California’s) economy is large enough, and our government is large enough to manage the program,” he said. “It’s a bump in the road and not a big long-term problem.”\nFord’s unambiguous promise to dismantle the province’s cap-and-trade program may have helped to calm traders’ fears ahead of the pullout, at least offering certainty. The Premier-elect will be sworn in on Friday and said in a press release that he would make good on his vow.\n“I made a promise to the people that we would take immediate action to scrap the cap-and-trade carbon tax and bring their gas prices down,” the statement read. Ford said that his cabinet’s first action would be to begin the process to repeal Ontario’s emissions trading system.\nAlthough Ontario’s intent leave is clear, nothing is going to happen fast. Repealing the cap and trade system requires parliamentary action. And the timetable to untangle Ontario from the emissions trading market is less certain. There doesn’t appear to be an identified mechanism to de-link a trading partner.\n“There’s no defined process,” said Lisa DeMarco, an energy lawyer in Toronto who has clients trading in the market. “I’d love to tell you that I understand it— this is what I do for a living.”\nThe international agreement says that any party wishing to withdraw should “endeavor to give 12 months notice” and should likewise try to withdraw at the end of a compliance period, which in this case would be in 2021.\nBut the document offers no details as to how that complicated pact becomes undone. There has been no explanation as to why the decoupling process is not more explicitly laid out. An air board spokesman did not respond to a question about it.\nRajinder Sahota, who oversees cap and trade for California’s Air Resources Board, addressed the pullout at a recent meeting, but offered few details. She said that state officials “are continuing to engage with the current elected and appointed officials in Ontario.”\n“Serious financial markets care about what happens when things don’t go as planned,” said Danny Cullenward, an energy economist and a member of the Independent Emissions Market Advisory Committee charged with reviewing the mechanics of cap and trade.\n“From organized stock exchanges to international derivatives markets, the private sector lives on binder-length contracts governing what happens when deals go south. If carbon market links are going to become serious and deep, markets need clear rules that apply in sickness and in health.”\nAt least one aspect of the pullout is settled. Ontario has notified California that it will not participate in the next auction scheduled for August 14.\nOntario joined the emissions market in 2017 and has raised more than $2 billion from the quarterly auctions. The fate of that money and investments by Canadian firms covered by the cap-and-trade program is unknown. It is also not clear how long Canadian companies operating in Ontario will be required to comply with the program.\n“We don’t know if they are stranded assets or not,” DeMarco said. “We’re waiting for a transition plan. We just don’t know what the government intends to do to shut down the cap-and-trade program in an orderly way.\n“It’s not a great market signal but certainly California’s market existed on its own before Quebec joined, then the two of them existed before Ontario joined.”\nAnother question will be the impact of Ontario’s exit on what some see as a glut of allowances on the market in California, leading to less incentive to reduce real emissions.\nOntario’s market was a net source of demand for allowances, Busch said, and its departure could exacerbate the problem.","url":"https://calmatters.org/articles/california-cap-and-trade-ontario-canada/"}
