{"authors":[],"date_download":"2018-10-22 22:56:09","date_modify":"2018-10-22 22:56:09","date_publish":"2014-06-11 14:20:38","description":"A battle between two worldwide liquor companies is being waged over who can label their drink as following authentic Tennessee style whiskey.","filename":"data/vaneerConsumption/OntheRocksMajorLiquorMakersWageWhiskeyWarinTennessee.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/501791/140611-jack-daniels-whiskey-928_b2eccacff0ffeae837a60ec24df18dbc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_rocks-major-liquor-makers-wage-whiskey-war-tennessee-n128376_1540248969.html","title":"On the Rocks: Major Liquor Makers Wage Whiskey War in Tennessee","title_page":"On the Rocks: Major Liquor Makers Wage Whiskey War in Tennessee","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTo many, Tennessee means whiskey. But inside the state, the question is: What does Tennessee whiskey mean?\nA battle between two worldwide liquor companies — owners of rival brands Jack Daniel's and smaller rival George Dickel — is being waged over who has the right to label their drink as following authentic Tennessee style. It's among the epicurean battles being waged around the world over what food and drink should carry special status as local and unique.\nSign up for top Business news delivered direct to your inbox.\nBritish-based liquor conglomerate Diageo PLC opened a heated legislative fight earlier this year seeking to overturn the state's newly established legal definition for Tennessee whiskey that has been championed by Jack Daniel's, which is owned by Louisville, Kentucky-based Brown-Forman Corp. Among the new rules are requirements that whiskey must be aged in new, charred oak barrels in Tennessee and filtered through maple charcoal prior to aging.\nJack Daniel's whiskey is made and aged in Tennessee. Diageo's George Dickel whiskey is also made in Tennessee but stored in neighboring Kentucky.\nOn Tuesday in a separate but related case, the Diageo subsidiary George Dickel came out on top when state attorneys in Nashville abruptly dropped a complaint that Dickel had violated a state statute prohibiting the aging of Tennessee-made whiskey outside its borders. Dickel had challenged the statute in federal court, claiming it violated laws on free interstate commerce.\nThe calm is likely to be short-lived, however. State lawmakers this summer are expected to return to the struggle of crafting the legal definition of Tennessee whiskey, whose history and lore is entwined in the state's identity as much as lobsters in Maine and crab cakes in Maryland.\nThe two distilleries located just 15 miles apart in southern Tennessee are hardly equals in the marketplace, with Jack Daniel's outselling Dickel by a ratio of 88 cases to one.\n--- The Associated Press","url":"https://www.nbcnews.com/business/business-news/rocks-major-liquor-makers-wage-whiskey-war-tennessee-n128376"}
