{"authors":[],"date_download":"2018-10-30 20:33:56","date_modify":"2018-10-30 20:33:56","date_publish":"2014-08-04 20:33:41","description":"Georgia legislators are finally starting work on a long-term plan to maintain and expand the state’s network of roads, bridges and transit systems.","filename":"data/vaneerConsumption/OntheroadagaintowardaGeorgiatransportationplan.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_the-road-again-toward-georgia-transportation-plan__1540931636.html","title":"On the road again toward a Georgia transportation plan?","title_page":"On the road again toward a Georgia transportation plan?","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia legislators are finally starting work on a long-term plan to maintain and expand the state’s network of roads, bridges and transit systems.\nState lawmakers, who were stung by voters’ resounding defeat of a regional transportation sales tax in 2012, have been leery of proposing any sweeping solutions to address Georgia’s traffic woes.\nBut now they’re ready to pursue a “Plan B,” fearful that Georgia is falling further and further behind on transportation upgrades that attract jobs.\nA legislative study committee will meet for the first time Tuesday. Then a series of meetings will be held between now and the end of October, after which the committee is expected to make recommendations in November that will likely be a springboard for legislation for the 2015 General Assembly.\n“Probably one of the biggest challenges we face when we are trying to attract new employers to Georgia is traffic congestion in metro Atlanta,” said Michael Sullivan, president of the American Council of Engineering Companies of Georgia and chairman of the Georgia Transportation Alliance, who will speak to the committee.\nSubscribers may read the full story on our premium website, MyAJC.com.","url":"https://www.ajc.com/news/the-road-again-toward-georgia-transportation-plan/NGYYBqQIggtYSGspt1CTjM/"}
