{"authors":["Abc News","More Kelsey"],"date_download":"2018-10-30 00:52:07","date_modify":"2018-10-30 00:52:07","date_publish":"2018-10-28 07:12:32","description":"Trump on Saturday said an armed guard could have helped prevent the carnage.","filename":"data/vaneerConsumption/OnTrumpssayingPittsburghsynagogueneededarmedguardWheredowestopCityofficial.json","image_url":"https://s.abcnews.com/images/US/synagogue-7-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_trumps-synagogue-n_4a6b40911433ceb2ec90e6acff364aa6_story_id=58803241_1540860727.html","title":"On Trump's saying Pittsburgh synagogue needed armed guard, 'Where do we stop?': City official","title_page":"On Trump's saying Pittsburgh synagogue needed armed guard, 'Where do we stop?': City official - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"On the day after a gunman killed 11 people in a Pittsburgh synagogue, city officials responded to President Donald Trump's suggesting that the house of worship should have had armed guards.\nInterested in Pittsburgh Synagogue Shooting? Add Pittsburgh Synagogue Shooting as an interest to stay up to date on the latest Pittsburgh Synagogue Shooting news, video, and analysis from ABC News. Add Interest\nPittsburgh City Council member Erica Strassburger told ABC News \"This Week\" Co-Anchor Martha Raddatz that although an armed guard \"could have saved lives\" at the synagogue, putting guns in the hands of more people isn't the answer to violence in the U.S.\n\"If you think about it ... yesterday it was at a synagogue, it might be at a school, but the next time it could be at a grocery store or at a public market,\" said Strassburger, who represents the neighborhood where the shooting occurred. \"Where do we stop with arming our entire society and feeling as if we can’t be safe anywhere? I just don’t see that as the answer.\"\nCity Council member Corey O’Connor, who also represents the Squirrel Hill neighborhood where the massacre happened, agreed that having armed guards at every venue isn’t a solution.\n“That’s not the community we want,\" O'Connor told Raddatz. \"We don’t want people having armed guards at every door you walk into.”\nPittsburgh Mayor Bill Peduto also responded to the president's remark about the need for armed guards, saying at a press conference Sunday that what's needed instead is to make sure people \"looking to express hatred through murder\" don't have access to guns.\nJeff Swensen/Getty Images\n\"We're dealing with an irrational behavior,\" Peduto said at the news conference. \"We shouldn’t be trying to find ways to minimize the dangers that occur from irrational behavior. We should be working to eliminate irrational behavior in the empowerment of people who would seek to cause this type of carnage from continuing.\"\nThe mayor continued, \"I think the approach that we need to be looking at is how we take the guns, which is the common denominator of every mass shooting in America, out of the hands of those that are looking to express hatred through murder.\"\nPresident Trump on Saturday strongly condemned the shooting in Pittsburgh as \"evil.\"\nEarly in the day, just a few hours after the shooting, the president said, \"It’s presumed that this is a case where if they had an armed guard inside, they might have been able to stop him immediately ... Maybe nobody would have been killed except for him. So it’s a very, very difficult situation.\"\nWhen a reporter asked if all synagogues and churches should have armed guards, Trump said, \"I hate to think of it that way ... It’s certainly an option.\"\nThe president has also in the past called for arming teachers as a way to prevent school shootings.\nAfter a shooting at Marjory Stoneman Douglas High School in Florida in February killed 17, Trump told a conservative conference, \"When we declare our schools gun-free zones it just puts our students in far more danger.\"\nSteph Chambers/Pittsburgh Post-Gazette via AP\nArming staff at the school would be \"a major deterrent,\" he said.\nThe massacre at the Tree of Life synagogue in Pittsburgh on Saturday killed 11 people and injured at least six more, including four police officers who responded to the gunfire.\nThe suspect, 46-year-old Robert Bowers, who has been arrested and charged, had allegedly posted anti-Semitic and anti-immigrant messages on social media, including one post that said, “Jews are the children of Satan.”","url":"https://abcnews.go.com/Politics/trumps-synagogue-needed-armed-guard-stop-arming-society/story?id=58803241"}
