{"authors":["Associated Press"],"date_download":"2018-10-23 01:56:04","date_modify":"2018-10-23 01:56:04","date_publish":"2017-03-10 10:24:43","description":"BEIJING (AP) - China assesses all applications for trademarks equally in a transparent process, a top Chinese regulator said Friday, after Beijing awarded...","filename":"data/vaneerConsumption/OnTrumptrademarksChinasaysittreatsapplicantsequally.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300726_On-Trump-trademarks-China-says-treats-applicants-equally_1540259764.html","title":"On Trump trademarks, China says it treats applicants equally","title_page":"On Trump trademarks, China says it treats applicants equally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - China assesses all applications for trademarks equally in a transparent process, a top Chinese regulator said Friday, after Beijing awarded U.S. President Donald Trump preliminary approval for a trove of trademarks in a move that has drawn scrutiny.\nThe process by which Trump and a related company were granted provisional approval for 38 trademarks \"strictly conforms\" to Chinese regulations, said Zhang Mao, chief of China's State Administration for Industry and Commerce.\nCritics fear foreign governments might gain leverage from Trump's global portfolio of brands. Democrats in Congress were critical of Trump after The Associated Press reported Wednesday that the potentially valuable trademarks had been granted, raising questions of conflict of interest.\n\"All domestic and international applications are evaluated uniformly,\" said Zhang, whose administration oversees the country's trademark office. He was speaking at a news conference on the sidelines of China's annual session of its ceremonial national parliament.\nThe recent provisional approval of Trump's trademarks came at a pace that some experts view as unusually quick.\nZhang said the office receives more than 3 million applications every year, but they are moving at a scheduled pace. \"We have to work overtime to examine them. We're proceeding at the planned rate,\" Zhang said. \"Our system is widely transparent about every step of the process.\"\nDemocrats in Congress have been pushing Trump to sever financial ties with his global businesses to avoid potential violations of the emoluments clause of the U.S. Constitution, which bars federal officials from accepting anything of value from foreign governments unless approved by Congress.\nThe monopoly right to a successful brand in a market like China can be worth huge sums. Former top ethics lawyers from the administrations of Barack Obama and George W. Bush say any special treatment from Beijing in awarding Trump intellectual property protection would violate the Constitution.\nDrawing on public records from the Trademark Office of the State Administration for Industry and Commerce, the AP compiled a detailed list of 49 trademarks Trump's lawyers applied for in 2016, even as he railed against China on the campaign trail. On Feb. 22, seven of those marks were rejected, though public records do not indicate why. China granted preliminary approval for 38 marks on Feb. 27 and March 6. Four applications are pending.\n___\nAssociated Press researcher Yu Bing contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4300726/On-Trump-trademarks-China-says-treats-applicants-equally.html"}
