{"authors":["Associated Press"],"date_download":"2018-10-23 01:59:39","date_modify":"2018-10-23 01:59:39","date_publish":"2017-04-26 12:45:52","description":"VANCOUVER, British Columbia (AP) - Serena Williams says she was taking a personal photo of her progressing pregnancy on Snapchat when she accidentally...","filename":"data/vaneerConsumption/OopsSerenaWilliamsmadepregnancypublicbyaccident.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-465003-1493207751-689_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447468_Oops-Serena-Williams-pregnancy-public-accident_1540259979.html","title":"Oops! Serena Williams made pregnancy public by accident","title_page":"Oops! Serena Williams made pregnancy public by accident | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"VANCOUVER, British Columbia (AP) - Serena Williams says she was taking a personal photo of her progressing pregnancy on Snapchat when she accidentally pressed the wrong button and made the post public.\nThe photo of the tennis superstar in a one piece bathing suit was captioned \"20 weeks.\" Despite the lack of information, it immediately made headlines around the world last week. Her publicist later confirmed the pregnancy to The Associated Press.\nWilliams told Gayle King at the TED2017 Conference in Vancouver on Tuesday night that the mishap wasn't a big deal because she planned to share the news shortly.\nFILE - In this Jan. 28, 2017, file photo, Serena Williams reacts after defeating her sister Venus during their women's singles final at the Australian Open tennis championships in Melbourne, Australia. Williams said on April 25, 2017, at the TED2017 Conference in Vancouver, British Columbia, that she was taking a personal photo of her progressing pregnancy on Snapchat when she accidentally pressed the wrong button and made the post public last week. (AP Photo/Kin Cheung, File)\nWilliams says she plans to return to the court after becoming a mom, adding, \"my baby is going to be in the stands, hopefully cheering for me and not crying too much.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4447468/Oops-Serena-Williams-pregnancy-public-accident.html"}
