{"authors":[],"date_download":"2018-10-30 20:37:21","date_modify":"2018-10-30 20:37:21","date_publish":"2015-04-03 21:58:13","description":"A man apparently masquerading as a DEA agent almost was forced to explain himself to the real police when he pulled over an off-duty Doraville cop at noon Friday.","filename":"data/vaneerConsumption/OopsFakecoppullsoverrealDoravillecopintrafficstopruse.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_oops-fake-cop-pulls-ov_a8b86be4e258fd6ba6284dd1b280028e__1540931841.html","title":"Oops: Fake cop pulls over real Doraville cop in traffic stop ruse","title_page":"Oops: Fake cop pulls over real Doraville cop in traffic stop ruse","title_rss":"NULL","source_domain":"ajc.com","text":"A man apparently masquerading as a DEA agent almost was forced to explain himself to the real police when he pulled over an off-duty Doraville cop at noon Friday.\nThe “impersonator” escaped the off-duty officer but Doraville police contacted surrounding agencies and an officer recalled seeing a car and suspect that matched the description, said Doraville Officer Gene Callaway.\nThat identification resulted in a “solid arrest” of the man at 9:30 p.m. for impersonating a police officer, Callaway said.\nDoraville plans to release a photo of the man to the public “in hopes others who could have been stopped by the suspect will come forward and let Doraville know,” Callaway said.\nThe off-duty officer said the man flashed green and white LED lights on the dashboard of his Dodge Charger while the officer and his daughter were on Homeland Drive near Ga 141 to pull him over, prompting the suspicious officer to call Doraville Police, Callaway said.\nThe Charger driver approached and flashed a “realistic” DEA ID badge. The off-duty officer said he was having a patrol unit come out to check the man’s credentials, Callaway said. That prompted the man to say he had to check on something in his car and then to speed off, Callaway said.\nThe masquerader was wearing a DEA shirt, a thigh holster with silver-frame handgun — possibly .45-caliber — that had a pearl grip and wearing black oval sunglasses and a badge on the left side of his belt that had “U.S.” engraved on it.\nHis Charger is described as being a silver 2008 to 2010 model, in good shape with dark tinted windows, alloy rims and four to six green and white LED lights mounted on the dashboard.","url":"https://www.ajc.com/news/oops-fake-cop-pulls-over-real-doraville-cop-traffic-stop-ruse/qdJhJtTosy4uxVsjsDWaNI/"}
