{"authors":["Logan Churchwell"],"date_download":"2018-10-30 20:45:25","date_modify":"2018-10-30 20:45:25","date_publish":"2016-05-25 14:45:26","description":"OPEC leadership has made plain that the price of oil is far too low to encourage investment and supply the global market.","filename":"data/vaneerConsumption/OPECChiefOilisNowTooCheap.json","image_url":"https://media.breitbart.com/media/2016/05/AP_16145347303872.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_05_25__1540932325.html","title":"OPEC Chief: Oil is Now Too Cheap","title_page":"OPEC Chief: Oil is Now Too Cheap","title_rss":"NULL","source_domain":"breitbart.com","text":"Leading up to a crucial meeting for the global cartel next week, OPEC leadership has made plain that the price of oil is far too low to encourage investment and supply the global market in the longer term. The comments follow a variety of indicators beginning to signal a larger recovery.\nMohammed bin Saleh al-Sada, Qatari energy minister and current President of the Organisation for Petroleum Exporting Countries, told the Associated Press on Tuesday that the global market “badly need[s]” the price of Brent Crude to reach $65 per barrel to keep abreast of emerging demand as producers face a variety of natural and man-made threats to infrastructure. The minister expressed overall optimism for the market, however.\n“The oil market is recovering slowly but steadily. Luckily, the fundamentals show it is heading in the right direction,” bin Saleh al-Sada said, according to a Bloomberg report.\nOPEC leadership has made clear its concern of being able to meet global demands if the commodity’s price were to remain largely unchanged in the years ahead. The minister noted that a “fair price” must be achieved “to secure the energy supply” necessary to avoid future price shocks, benefitting large and small companies alike in the short term, but harming independent producers once prices naturally re-adjust.\nUpstream and down, large nations are reporting pinches in supply. OPEC as a whole is now operating at its lowest level of spare capacity since 2008, according to the Houston Chronicle. Market analysts are predicting another 20 percent reduction in stock amid violence in Nigeria and Libya as extraction and pipeline disruptions continue to proliferate. Outside of the cartel, large scale wildfires across Canada have led to shortages of roughly 1 million barrels a day as they threatened oil sands facilities. A previous Breitbart Texas report noted how planners in India have been forced to choose between consuming potable water and domestic refining as a drought continues to linger.\nMember nations of OPEC have become so insistent on implementing production caps that they are now calling for like-minded outsiders to participate in the Vienna summit as well. Venezuela’s call for ringer negotiators has not been summarily dismissed by the OPEC brass to date.\nThe previous Breitbart Texas report also notes that a looming threat toward a global agreement to slowly improve oil prices lies with an emboldened Iran. Fresh data further demonstrating how the Islamic regime continues to shatter production benchmarks ahead of schedule are released almost daily. South Korea and China are proving to be happy customers of the Ayatollahs’ oil fields in record amounts, according to the Houston Chronicle. The South Koreans are now importing 240,000 barrels a day alone.\nIran’s success has inspired the regime to resist calls for caps even as Saudi Arabia extols support for the international effort. The Saudi precondition that a unanimous OPEC establish limits is emblematic of their tough choice between gradual price increases or ceding more market share to American shale drillers.\nLogan Churchwell is a founding member of the Breitbart Texas team. You can follow him on Twitter @LCChurchwell","url":"https://www.breitbart.com/border/2016/05/25/opec-chief-oil-now-cheap/"}
