{"authors":["Marita Noon"],"date_download":"2018-10-30 20:45:30","date_modify":"2018-10-30 20:45:30","date_publish":"2016-10-12 17:24:40","description":"At the end of September, the Organization of Petroleum Exporting Countries (OPEC) surprised the markets by agreeing to a production cut. As soon as the 14-nation deal was announced, oil prices jumped more than five percent to some of the highest levels since the crash two years ago. | Politics","filename":"data/vaneerConsumption/OPECAgreestoProductionDecreasePricesIncrease.json","image_url":"https://media.breitbart.com/media/2016/10/wi/afp/10/33n9fs1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_12__1540932330.html","title":"OPEC Agrees to Production Decrease, Prices Increase","title_page":"OPEC Agrees to Production Decrease, Prices Increase | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At the end of September, the Organization of Petroleum Exporting Countries (OPEC) surprised the markets by agreeing to a production cut. As soon as the 14-nation deal was announced, oil prices jumped more than five percent to some of the highest levels since the crash two years ago.\nThe proposed output cap represents a shift in the “pump-at-will policy,” as Bloomberg called it, “the group adopted in 2014 at the instigation of Saudi Arabia.”\nMany analysts see that the Saudi gamble, aimed at putting American producers out of business, as a failure. While U.S. oil production decreased from last year’s highs and bankruptcies are up, the industry has become more efficient and the cost of extracting oil from shale is continuing to come down—resulting in the sixth straight week of an increased rig count and the 15th without a decrease. Wall Street Journal (WSJ) reports: “Many oil producers believe drilling in some U.S. regions can be profitable even with oil prices in their current range of $40 to $50 a barrel.”\nAdditionally, U.S. crude stockpiles have fallen for the fifth consecutive week—as have crude imports. American drivers are consuming more gasoline than ever. Exploration budgets, due to the low oil prices, have been slashed with the predicted result of lower production in the next few years. It appears that demand is catching up with production and prices have been creeping up since February’s lows. Phil Flynn, senior market analyst with the PRICE Futures Group explains: “While supply is still at a historically high level for this time of year, strong U.S. demand and rising U.S. exports are cutting down the glut.”\nMeanwhile, the social costs of low-priced oil have been high for OPEC members—hitting Saudi Arabia especially hard. The cartel’s biggest producer has lost billions of dollars of revenue, which has resulted in a 20 percent pay cut for its ministers, reductions in financial benefits for government employees, and an increase in fees and fines, and cuts in subsidies, for all in the kingdom. Fear that the loss of the coddled lifestyle could throw the country into chaos, according to industry veteran and consultant Allen Brooks, likely convinced Saudi Arabian officials to moderate their position.\nIran, OPECs other majordomo, has, due to sanctions, gotten used to austerity and is now seeing its economic pressures easing and its oil exports increasing. It, therefore, heading into the OPEC meeting, appeared to be rejecting the Saudi output offer and dashed hopes of a compromise to cut crude production. The Financial Times quotes one Gulf OPEC delegate as saying: “All producers are hurting.”\nThe surprise came on Wednesday, September 28, when, after two years of failed attempts at an agreement and months of dialogue leading up to the meeting, “Saudi Arabia agreed to take on the bulk of OPEC’s proposed cuts,” wrote the WSJ. The headline from the New York Times read: “OPEC agrees to cut production, sending oil prices soaring.”\nThe proposed cuts are moderate in reality, only 1-2 percent of the 14-nation cartel’s 33.2 million barrels a day of production and they represent less than 1 percent of total global production. Yet, the announcement buoyed markets and added power to the previously mentioned price momentum. According to CNN Money, the agreement offers “powerful symbolism.”\nWhile the price of oil received a bounce from the news that has given the industry cautious optimism, it is not expected to have a big impact on the price of gasoline. Oil prices are now expected to stay near $50 a barrel through the end of the year and below $60 a barrel through 2017—which will likely mean an increase of a few cents a gallon at the pump. Julian Jessop, chief global economist at Capital Economic, in CNN Money, called the situation “a period of ‘Goldilocks’ oil prices”—low enough to help consumer spending and “high enough to keep major producers afloat.”\nThe slight bump in prices the proposed deal adds to the upward trend is enough to send some producers back into the oil field and encourage another burst of drilling. That increased production will have a self-leveling effect on prices. As prices go up, production increases. As more oil enters the already-glutted market, prices come down.\nAdditionally, the OPEC agreement is only a plan. It isn’t finalized. That could happen in Vienna in November if, and it is a big if, the members can agree on who will make the cuts, when the cuts will go into effect, how long they will last, and how they will be enforced. While all 14 countries—and non-OPEC producers such as the U.S. and Russia—will benefit from higher prices, no one wants to be the one taking the cut. Iran, Libya, and Nigeria are all trying to increase production that has been stifled due to sanctions or conflict. Plus, as WSJ reports: “OPEC has a long history of agreeing to production cuts, only to have the pact collapse when countries change their minds.” CNN Money adds: “cartel members also have a tendency to overshoot production quotas.”\nSo, while the OPEC announcement is “not a game-changing move that will send oil prices shooting back up towards the $100 a barrel level,” as The Guardian reported, it is big news that brightens prospects for the energy industry while keeping things just right for consumers.\nThe author of Energy Freedom, Marita Noon serves as the executive director for Energy Makes America Great Inc., and the companion educational organization, the Citizens’ Alliance for Responsible Energy (CARE). She hosts a weekly radio program: America’s Voice for Energy—which expands on the content of her weekly column. Follow her @EnergyRabbit.","url":"https://www.breitbart.com/politics/2016/10/12/opec-agrees-production-decrease-prices-increase-just-right/"}
