{"authors":["Breitbart Texas"],"date_download":"2018-10-30 21:24:22","date_modify":"2018-10-30 21:24:22","date_publish":"2015-03-12 21:54:41","description":"Editor's Note: This article was authored by and submitted to Breitbart Texas by Bill Frazer, CPA.","filename":"data/vaneerConsumption/OpEdNegotiationsBehindClosedDoorsResultinSurpriseDealinHoustonPensionContract.json","image_url":"https://media.breitbart.com/media/2015/03/Parker-Pension-Deal-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_03_12__1540934662.html","title":"Op-Ed: Negotiations Behind Closed Doors Result in Surprise Deal in Houston Pension Contract","title_page":"Op-Ed: Negotiations Behind Closed Doors Result in Surprise Deal in Houston Pension Contract","title_rss":"NULL","source_domain":"breitbart.com","text":"Editor’s Note: This article was authored by and submitted to Breitbart Texas by Bill Frazer, CPA.\nLast Friday’s announcement of a “Pension Deal” by Mayor Parker took everyone by surprise. Naturally, whenever anyone negotiates a deal in total secrecy without input from other elected city officials, the result will be surprising. After reviewing the 3-page agreement that took “months” to negotiate, it’s clear the taxpayers of Houston were not represented.\nUnfortunately, the City’s top financial officer, the City Controller, has been totally silent on this issue and, apparently was absent during the negotiations. The Controller is supposed to represent the taxpayers; not the Mayor, not the unions, not the City Council, but the taxpayers.\nThe fact is, this agreement contains absolutely nothing for Houston’s taxpayers, the people our elected officials are sworn to serve. Nobody at the table was looking out for them.\nIn short, the Mayor gets to borrow more money to cover budget shortfalls caused primarily by excessive pension costs. The Firefighters get an 8.5% guaranteed return on their $77 million loan to the City, at a time when 5-year municipal debt is trading under 1.5%.\nThe Firefighters get a tax break on receipt of unpaid sick leave which could possibly be the source of funds for their gratuitous 3% “extra” contribution to the plan. The Firefighter union bosses get the benefit of total blackout by the City to lobby or otherwise negotiate a better deal with the State Legislature. And, finally, the union bosses got the City to agree that the entire matter will not appear on the City Council Agenda this year.\nSome candidates running for citywide office this November will attempt to tout that they’ve miraculously “solved” our Pension Crisis by borrowing more money. This is truly kicking the can down the road. They get a present day “benefit” in return for a very large future cost when they won’t be in office to have to deal with it anymore.\nTaxpayers, on the other hand, get to pay more in pension costs in the future. They get to pick up the tab for excessive interest costs during the loan period, and perhaps the worst of all, this creates no new revenue to fix roads and aging infrastructure.\nEven more disheartening for taxpayers, is the fact that after years of fighting so hard to regain local control of our pensions, the Mayor “gave up” and agreed to drop two pending lawsuits that would have significantly moved the ball forward on regaining local control. Control still rests with the legislative body in Austin and not with the Taxpayers of Houston who are footing the bill and dealing with service cuts as a result of excessive costs.\nI believe that Houston must gain local control over its pensions and be able to craft very fair retirement plans for all city employees. Those plans will be developed carefully through open and honest debate, and if I’m elected City Controller, the taxpayers will have a clear and experienced financial professional fighting for them.\nEditor’s note: Bill Frazer is a candidate for Houston City Controller. He has been a CPA for over 35 years and has been a Chief Financial Officer for a major company negotiating billions of dollars of financial transactions as well as several family-owned companies. He has firsthand experience in negotiating and structuring these types of complex agreements.","url":"https://www.breitbart.com/border/2015/03/12/op-ed-negotiations-behind-closed-doors-result-in-surprise-deal-in-houston-pension-contract/"}
