{"authors":["John Hayward"],"date_download":"2018-10-30 20:50:09","date_modify":"2018-10-30 20:50:09","date_publish":"2015-01-14 03:56:16","description":"Writing at the Washington Post, Lindsey Kaufman pens a critique of a trend that sounds absolutely horrifying: the rise of the \"Open Office.\"","filename":"data/vaneerConsumption/OpenOfficesCollectivistTheoryRuinsIndustrialDesign.json","image_url":"https://media.breitbart.com/media/2015/01/silicon-valley-open-workspace-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_13__1540932609.html","title":"Open Offices: Collectivist Theory Ruins Industrial Design","title_page":"Open Offices: Collectivist Theory Ruins Industrial Design | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Writing at the Washington Post, Lindsey Kaufman pens a witty critique of a trend that sounds absolutely horrifying: the rise of the “open office.” I haven’t experienced such a work environment personally, but I’m not sure my good humor would survive it as well as Kaufman’s has:\nA year ago, my boss announced that our large New York ad agency would be moving to an open office. After nine years as a senior writer, I was forced to trade in my private office for a seat at a long, shared table. It felt like my boss had ripped off my clothes and left me standing in my skivvies. Our new, modern Tribeca office was beautifully airy, and yet remarkably oppressive. Nothing was private. On the first day, I took my seat at the table assigned to our creative department, next to a nice woman who I suspect was an air horn in a former life. All day, there was constant shuffling, yelling, and laughing, along with loud music piped through a PA system. As an excessive water drinker, I feared my co-workers were tallying my frequent bathroom trips. At day’s end, I bid adieu to the 12 pairs of eyes I felt judging my 5:04 p.m. departure time. I beelined to the Beats store to purchase their best noise-cancelling headphones in an unmistakably visible neon blue. Despite its obvious problems, the open-office model has continued to encroach on workers across the country. Now, about 70 percent of U.S. offices have no or low partitions, according to the International Facility Management Association. Silicon Valley has been the leader in bringing down the dividers. Google, Yahoo, eBay, Goldman Sachs and American Express are all adherents. Facebook CEO Mark Zuckerberg enlisted famed architect Frank Gehry to design the largest open floor plan in the world, housing nearly 3,000 engineers. And as a businessman, Michael Bloomberg was an early adopter of the open-space trend, saying it promoted transparency and fairness. He famously carried the model into city hall when he became mayor of New York, making “the Bullpen” a symbol of open communication and accessibility to the city’s chief.\nI’m not sure what I’d do after a day of being expected to complete focused, creative work in an open office filled with non-stop distractions and perpetual invasions of privacy, but I think it would involve smashing furniture, grinding my teeth hard enough to require dental surgery, and bubbling over with the kind of laughter that makes people smile nervously and back away slowly.\nAs Kaufman goes on to observe, the benefits perceived by management from an open office design are obvious—cheaper to set up, more people crammed into less space, and greater ability to monitor what employees are doing. The latter seems especially important to some managers in an age of chronic Internet-fueled goldbricking—it’s faster and easier to get nothing done than ever before!—but studies have found the reality defies this simple formula of “less privacy = more work.” Open offices tend to be less productive, because employees are constantly distracted by noise pollution and random social interaction. The hypothetical benefits from easier productive interaction turned out to be illusory as well. It’s really not that helpful to have your co-workers seated in a ten-foot radius with no intervening barriers, as opposed to using intercom systems or walking over to their offices for collaboration.\nKaufman describes her personal journey through open office purgatory, including the entirely common sense observation that people forced to work in close no-barriers proximity to each other pass around viruses more readily:\nThe New Yorker, in a review of research on this nouveau workplace design, determined that the benefits in building camaraderie simply mask the negative effects on work performance. While employees feel like they’re part of a laid-back, innovative enterprise, the environment ultimately damages workers’ attention spans, productivity, creative thinking, and satisfaction. Furthermore, a sense of privacy boosts job performance, while the opposite can cause feelings of helplessness. In addition to the distractions, my colleagues and I have been more vulnerable to illness. Last flu season took down a succession of my co-workers like dominoes. As the new space intended, I’ve formed interesting, unexpected bonds with my cohorts. But my personal performance at work has hit an all-time low. Each day, my associates and I are seated at a table staring at each other, having an ongoing 12-person conversation from 9 a.m. to 5 p.m. It’s like being in middle school with a bunch of adults. Those who have worked in private offices for decades have proven to be the most vociferous and rowdy. They haven’t had to consider how their loud habits affect others, so they shout ideas at each other across the table and rehash jokes of yore. As a result, I can only work effectively during times when no one else is around, or if I isolate myself in one of the small, constantly sought-after, glass-windowed meeting rooms around the perimeter.\nShe winds up with a game effort to make suggestions for improving the open office concept, but her ideas amount to the negation of the concept: more privacy, stricter rules against unnecessarily disturbing fellow employees, less noise pollution, etc. You can get all those benefits far more easily with old-fashioned offices and cubicles.\nIt seems odd that anyone would need careful study to conclude that the negative effects from loss of privacy would far outweigh the benefits of ostensibly easier cooperation… unless, of course, one has a tendency to under-value privacy and over-rate cooperation. An unpleasant aroma of collectivist ideology hangs over the whole concept. It’s fair enough for management to say “an office without barriers is cheaper, so that’s what we’re going to do, no matter the consequences”—it might be rough on the people who work in the resulting Thunderdome, but it’s straightforward and honest. As soon as we get into intellectual rationalizations based on phantom promises of increased productivity, however, the whole thing starts sounding less like a rational business plan, and more like a dorm room bull session, driven more by post-industrial ideology than industrial psychology.\nIt’s collectivism in action, and like every other elaborate social theory, it’s filled with unexpected consequences resulting from faulty assumptions about human nature. Of course people generate a lot of inadvertent noise and distract each other when there are no privacy barriers. Of course they feel uncomfortable in an environment where they are explicitly distrusted and treated like the inhabitants of a panopticon prison. Rather than dealing individually with workers who abuse their privacy and don’t complete projects because they spend too much time fooling around on Facebook, open office designers treat everyone as a potential loafer in need of monitoring. People are expected to sacrifice their individual habits (such as music) for the good of a collective whole. They’re also supposed to make do without the individual dignity provided by even the modest privacy of a small cubicle, as if such privacy is a luxury to be reserved for the highest levels, not frittered away on worker drones.\nOpen communication is great, but like many other social assets, it’s best when achieved voluntarily. Compulsory, constant openness, achieved through the total erasure of privacy, tarnishes a good thing by making it mandatory. A certain degree of individual trust is vital to any productive and dignified relationship. That’s true both in society at large and within the walls of an office complex.","url":"https://www.breitbart.com/politics/2015/01/13/open-offices-collectivist-theory-ruins-industrial-design/"}
