{"authors":["Expert Perspectives","Dan Morain","Ben Christopher","Laurel Rosenhall"],"date_download":"2018-10-30 22:36:17","date_modify":"2018-10-30 22:36:17","date_publish":"2015-07-18 08:00:00","description":"Renewable energy technologies have made outstanding progress in the last decade.  Solar panels and wind turbines have become massively more efficient. In","filename":"data/vaneerConsumption/OpinionIsthefutureofelectricitygenerationreallydistributed.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/pge-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938977.html","title":"Opinion: Is the future of electricity generation really distributed?","title_page":"Opinion: Is the future of electricity generation really distributed? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Renewable energy technologies have made outstanding progress in the last decade. Solar panels and wind turbines have become massively more efficient. In many locations, some forms of renewable energy are cost competitive. And yet…just as these exciting changes are taking place, many advocates are shifting their focus to an issue disconnected from the fundamental environmental goals: distributed generation.\nInstead of seeking the most affordable way to scale up renewables, many of the loudest voices in the renewables movement are talking about “home energy independence”, “empowering the consumer”, and rejecting “government-created monopolies”. In practice, this means residential solar PV.\nI’m sorry, but count me among the people who get no special thrill from making our own shoes, roasting our own coffee, or generating our own electricity. I don’t think my house should be energy independent any more than it should be food independent or clothing independent. Advanced economies around the world have gotten to be advanced economies by taking advantage of economies of scale, not by encouraging every household to be self-sufficient.\nCompared to grid-scale renewables – large wind and solar farms — distributed solar has some advantages. It generates onsite, avoiding the line losses from grid-generated electricity that are typically 7%-9%. And it occupies your rooftop, so the real estate cost is essentially zero. In some cases it can delay costly grid upgrades by reducing the amount of power that needs to be sent over the wires.\nBut distributed generation also has some serious drawbacks, primarily that it costs a lot more per kilowatt-hour than grid-scale solar, about twice as much these days. The scale economies sacrificed with small systems on roofs of different sizes, shapes, and orientations are a big disadvantage compared to solar farms that have 10,000 to 100,000 times more capacity than a typical residential installation.\nWhile precisely targeted small-scale distributed generation could reduce grid upgrades, in practice systems are installed wherever homeowners choose. They can actually destabilize distribution circuits when they inject too much power back into the grid, a serious concern in Hawaii, where 12% of houses now have rooftop solar. A typical residential system pumps more than one-third of its generation into the grid, which also lessens the advantage from reduced line losses and delayed grid upgrades.\nHow do these pros and cons sort out? Right now, residential solar loses to grid scale. But that could change as solar, and storage, technology progresses. In the meantime, homeowners shouldn’t be prevented from installing solar; they just shouldn’t be given special incentives. We need to recognize that DG’s role in the electricity future is uncertain and locking in on this (or any other) technology is unwise.\nThen how should we decide whether to go with DG renewables or grid-scale technologies? We shouldn’t decide. We should design incentives that reflect the real benefits and costs of each type of system and then let them battle it out. This has two big advantages. First, it reduces political battles among policymakers loyal to one technology over another. Second, it pushes all alternative technologies to keep innovating and lowering costs.\nDesigning such science-based incentives isn’t easy, requiring detailed examination of each of the costs and benefits. It won’t be possible to nail down each factor exactly, and it will cause some heated debates, but at least we will then be arguing about the right issues. We can’t make good electricity and environmental policy if we don’t carefully study what each technology brings to the table.\nIf DG solar with incentives that reflect its true benefits wins, that will be great, because we will know we’ve got the least-cost approach to reducing the environmental damage of electricity generation. If it sputters, that will be fine too, because it will indicate that there are other less-expensive ways to achieve our goals. Either way, it’s time for incentives that are truly calibrated to costs and benefits, not to achieving penetration of one low-carbon technology over another.\nSeverin Borenstein is E.T. Grether Professor of Business Administration and Public Policy at the Haas School of Business and a Research Associate of the Energy Institute at Haas.","url":"https://calmatters.org/articles/opinion-is-the-future-of-electricity-generation-really-distributed/"}
