{"authors":["Expert Perspectives","Guest Commentary"],"date_download":"2018-10-30 22:34:43","date_modify":"2018-10-30 22:34:43","date_publish":"2015-11-22 08:00:00","description":"Of late, the minimum wage battle in California appears to be never-ending. No sooner did California increase its minimum wage to $9 per hour in 2013","filename":"data/vaneerConsumption/OpinionIncreasingminimumwageiswrongtooltoalleviatepoverty.json","image_url":"https://calmatters.org/wp-content/uploads/strawberry_picking.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938883.html","title":"Opinion: Increasing minimum wage is wrong tool to alleviate poverty","title_page":"Opinion: Increasing minimum wage is wrong tool to alleviate poverty | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Of late, the minimum wage battle in California appears to be never-ending. No sooner did California increase its minimum wage to $9 per hour in 2013 (slated to increase to $10 per hour in January 2016), did some legislators attempt to accelerate and further increase the minimum wage. More recently, San Francisco Mayor Ed Lee and Oakland Mayor Libby Schaaf have proposed a statewide 2016 ballot measure to increase the minimum wage to $15 per hour.\nBut these efforts to consistently increase the minimum wage have one glaring problem: the minimum wage isn’t an efficient policy tool to achieve its primary goal of reducing poverty.\nThe inefficiency of the minimum wage stems directly from who are working minimum wage jobs in California. First, based on the Census Bureau’s Current Population Survey, in 2014, almost one-third of hourly workers making $9 per hour live in households with family income above the federal poverty line; moreover, 79 percent were ages 25 or younger (i.e. individuals who are just entering the labor force). And lastly, 73 percent of Californian hourly workers making $9 per hour (or less) didn’t have a college degree, suggesting a majority of minimum wage workers are, in fact, lower skilled.\nCoupled with economic theory about price floors (of which the minimum wage is an example), the demographics of minimum wage workers belie the policy tool’s inefficiency. While a price floor set below the market equilibrium doesn’t affect the market, minimum wage proponents argue that the market equilibrium is too low, hence requiring a minimum wage above the price demanded by the market. However, when price floors are set above the market equilibrium, the market creates a surplus of the good (in this case, labor). There are more workers trying to get jobs than there are employers willing to employ.\nIt’s not that the minimum wage helps the 65 percent of minimum wage workers who live below the federal poverty line. Rather it only helps those who can either a) find a minimum wage job or b) maintain their minimum wage job. As the minimum wage increases, employers are presented with viable substitutes for minimum wage labor, which makes finding or maintaining minimum wage employment more difficult for the very individuals the minimum wage is meant to help. In the short-term, as minimum wage increases close the gap between the price of lower skilled labor and higher skilled labor, employers turn to higher skilled alternatives. The reason is straightforward; first, higher skilled individuals would be more willing to take the position at the elevated pay and second, if employers have to pay higher skilled prices, they would rather have higher skilled labor. This only benefits the 27 percent of minimum wage workers who have a college degree. In the long term, as labor costs rise and technology advances, employers seek to automate the duties of minimum wage labor eliminating the jobs entirely. What is beneficial for some in the short term becomes detrimental for all in the long term.\nThe economic theory behind the minimum wage is indisputable and straightforward, but economists still remain divided on its actual market distortions for one simple reason: minimum wage laws are implemented over long periods of time, which makes isolating the true economic and dis-employment effects of increasing the minimum wage extremely difficult. Nonetheless, the anecdotal evidence – such as Seattle losing 500 restaurant jobs since enacting a $15 per hour minimum wage even while the rest of Washington State gained 5,600 such jobs – conforms with the economic theory.\nLuckily, however, the minimum wage isn’t the only tool available to address poverty. The creation and expansion of a state earned income tax credit (EITC) – a refundable tax credit for the working poor – would help those in poverty while introducing fewer and less harmful market distortions. While minimum wage increases help everyone earning the minimum wage regardless of need, an EITC targets those who specifically require government intervention to correct a market failure. On top of the targeted nature of credit, studies show that the EITC not only encourages work (both among those who previously were not working and those who have been employed), but also is a transitory program, meaning EITC recipients tend to become active self-sustaining market participants.\nAddressing poverty is a necessary responsibility of California’s government, but it must use tools that efficiently and effectively impact the lives of the poor. The minimum wage, despite the rhetoric, just yields too many troubling consequences to be either efficient or effective.\nHoover Institution research fellow Carson Bruno studies California’s political and policy landscape. Follow him on Twitter @CarsonJFBruno.","url":"https://calmatters.org/articles/opinion-increasing-minimum-wage/"}
