{"authors":["Expert Perspectives","Guest Commentary","Julie Cart"],"date_download":"2018-10-30 22:36:15","date_modify":"2018-10-30 22:36:15","date_publish":"2015-07-18 08:00:00","description":"Ever since I moved from Central Pennsylvania, where my car would be buried in the snow for the better part of the winter, to Central California with","filename":"data/vaneerConsumption/OpinionArewelosingourtoptalentsinCentralCaliforniaduetoextremeweather.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/centralvalley-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938975.html","title":"Opinion: Are we losing our top talents in Central California due to extreme weather?","title_page":"Opinion: Are we losing our top talents in Central California due to extreme weather? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Ever since I moved from Central Pennsylvania, where my car would be buried in the snow for the better part of the winter, to Central California with summer heat waves, the question I’ve been asked most often is “did the weather influence your decision to relocate to Fresno?” Having studied how climate change impacts residential location choices for a couple of years, I find that more skilled people are likely to be sensitive to extreme weather as they tend to be more mobile. So I would probably say, “Yes, the warmer winter is nice but not the extremely hot summer.”\nThe frequency and intensity of extreme weather events continue to increase under climate change. According to the 2014 National Climate Assessment report, heat waves and droughts are projected to be more frequent and intense in the West and Southwest of the U.S in the future. In 2014, the United States Department of Agriculture (USDA) declared 27 out of 58 counties in California as primary disaster areas due to severe drought, including all eight counties in San Joaquin Valley (SJV). Drought directly affects agricultural productions and food prices in California, but that’s only the tip of the iceberg. The impacts could be much larger if we think about rippling effects in the regional economy.\nIf basic living conditions, such as weather and air quality are unpleasant, most people are likely to “vote with their feet” and relocate to a different place, assuming they are mobile and could find jobs somewhere else. In the valley, air pollution is one of the pressing issues due to the valley’s topography and sources, such as pollutants and nitrogen oxide emissions from I-5 and Highway 99, diesel-burning locomotives, tractors, irrigation pumps, wood-burning stoves and fireplaces.\nAir pollution could be further exacerbated by heat waves and droughts (EPA, 2011). According to the USDA, the net domestic migration rate between 2012 and 2013 remains negative for all 8 counties in SJV ranging from 1.5% (Kern County) to 16.2% (Kings County). As the skilled likely have more job opporutnities somewhere else and are generally more mobile, they may leave the valley, causing skill loss for local businesses and a brain drain as a result of the extremely hot weather.\nWhat would be the economic impacts and consequences in the future under climate-induced migration? If climate change continues, the local economy and business in Fresno, for example, will be negatively affected by skill loss and shifts in the labor pool. The local real estate market is likely to experience a decrease in housing demand, followed by declining housing prices if the drought continues and climate extremes and air pollution keep the skilled away. To retain human capital, greater emphasis should be given to community and regional development strategies that aim to provide amenities and improve quality of living, in addition to the long-term climate change mitigation and adaptation plans. Hopefully, the talented will soon no longer have to choose between the quality of living and a satisfying career in Central California.\nQin Fan is an Assistant Professor, Department of Economics, Craig School of Business, California State University, Fresno.","url":"https://calmatters.org/articles/opinion-are-we-losing-our-top-talents-in-central-california-due-to-extreme-weather/"}
