{"authors":["Expert Perspectives","Guest Commentary"],"date_download":"2018-10-30 22:34:59","date_modify":"2018-10-30 22:34:59","date_publish":"2015-11-22 08:00:00","description":"With wages stagnant, inequality growing, and Washington, D.C., gridlocked, states and cities are taking matters into their own hands by raising the","filename":"data/vaneerConsumption/OpinionWhyCaliforniashouldfollowitscitiestoahigherminimumwage.json","image_url":"https://calmatters.org/wp-content/uploads/manuel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938899.html","title":"Opinion: Why California should follow its cities to a higher minimum wage","title_page":"Opinion: Why California should follow its cities to a higher minimum wage | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"With wages stagnant, inequality growing, and Washington, D.C., gridlocked, states and cities are taking matters into their own hands by raising the minimum wage. Before 2012, only five local governments in the United States had their own minimum wage laws; now about 30 do. At the forefront are 15 California cities and counties, the largest of which, Los Angeles, decided earlier this year to set a target of $15 an hour by 2020.\nThe local push to raise the minimum wage is easy to understand: the federal minimum wage has failed to grow with the economy and, adjusted for national inflation, is now 30 percent below its high water mark in 1968. California has tried to make up by increasing its own minimum, including a hike to $10 an hour slated for the coming year – but even that will be nearly 20 percent below the 1968 minimum wage once higher housing and other costs are accounted for in the Golden State.\nShould the state now follow its cities and consider more wage hikes going forward? Concerns about inequality are one driver for action: in terms of income disparity, California was ranked squarely in the middle of the states in 1969 but it is now the fourth most unequal state in the nation. But is also the case that the public is quite sympathetic to the argument that no one working full-time should find themselves and their family living below the federal poverty line.\nSo how high can (or should) we go? Advocates argue that while $13 or $15 an hour seems like a big increase, it’s not a lot in California’s major cities, where rapid gentrification and rising housing costs are chasing out many working and middle-class residents. And despite some continuing debates, economists have generally established that the modest federal and state increases of the past 20 years did mostly what they were designed to do: raise workers’ earnings with no measurable effect on overall employment.\nReinforcing that academic message: a survey of actual business in Los Angeles County by the Los Angeles Economic Development Corporation (LAEDC). When asked how they might respond to a countywide ordinance patterned after the $15 policy adopted by the city, none said that it was “very likely” that they would cut minimum wage employees, reduce their hours, or shut or move their businesses; loosening the criteria to “likely” category, 6 percent said they might cut back workers and only 2 percent said that they would cut back hours but none thought that they would close or move. Repeat: none.\nOf course, there is also clearly some point at which the minimum wage can get too high, inducing employers to lay off workers or replace them with technology. It’s also true that employers, facing higher wage costs, can become pickier about who they hire. That could lead to better matches – and higher productivity – but it could also create challenges for teens, the long-term unemployed, or individuals with criminal records seeking to reintegrate into labor markets and local communities.\nMoreover, the existing body of research and even those employer responses can only tell us so much about the impact of the bigger and broader increases being contemplated now, particularly increases that would cover lower wage areas of the state, like the Central Valley. Prospective studies by UC Berkeley researchers for Los Angeles and other California cities have suggested that when phased in over time, the benefits of raising the minimum wage are likely to outweigh the costs. But even the Berkeley researchers warn that there is uncertainty in predicting the future, especially when considering wage levels that have not been tried to date.\nSo as the state moves ahead, it should learn from local experiments where legislators are adopting not just higher wages but also glide paths that give businesses several years to adjust, often with some differentiation in speed depending on firm size. And everyone in this debate should be clear that raising the minimum wage is not a silver bullet for our challenges of inequality: we also need to address the lack of affordable housing, unequal access to quality education, and a state fiscal system that leads to unsteady public investments.\nBut the debate about the state minimum wage needs to begin now. We have been here before: my own work in this arena began when I worked with community groups supporting what eventually became a 27 percent increase in the minimum wage in 1988. Business representative predicted disaster but the result was a nearly $2 billion transfer in income to those previously working below the new minimum and no noticeable effects on employment, including on the retail industry many thought might be most vulnerable. The wage can be raised, the sky will not fall, and we will do better if we keep our deliberation rooted in a positive and data-based discourse about the real costs and benefits.\nManuel Pastor is Professor of Sociology and the director of the Program for Environmental and Regional Equity at the University of Southern California. His latest book is Equity, Growth, and Community: What the Nation Can Learn From America’s Metropolitan Regions.","url":"https://calmatters.org/articles/the-coming-minimum-wage-debate-in-california/"}
