{"authors":["Maureen Downey"],"date_download":"2018-10-30 14:10:30","date_modify":"2018-10-30 14:10:30","date_publish":"2018-10-30 10:37:37","description":"The leader of a charter school in Fulton County says state-authorized charters deserve more state funding and help to find and pay for buildings.","filename":"data/vaneerConsumption/OpinionFiximbalanceinstatecharterschoolfunding.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/10/30/Images/charterart%20(1).JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_get-schooled_opinion-f_2bb82d8cfc3bb9c60d2260db92682de0__1540908630.html","title":"Opinion: Fix imbalance in state charter school funding","title_page":"Fulton charter school leader urges more state dollars for facilities.","title_rss":"NULL","source_domain":"ajc.com","text":"I am just back from Barcelona where my son is studying abroad with Georgia Tech at the Universitat Autónoma de Barcelona. I am returning to lots of education news including the pending departure of the Fulton superintendent and the release of the state College and Career Ready Performance Index scores that schools celebrate – I have a dozen emails from schools touting jumps -- but that parents seem to ignore.\nAnd I came back to a lot of guest column submissions. Here is one from Richardean Golden Anderson, superintendent of the Fulton Leadership Academy, about the Legislature’s approval of increased funding for state-approved charters.\nThe Fulton Leadership Academy is an all-male middle and high school that opened in 2010 with Anderson as superintendent. After outgrowing space in a church on Old Fairburn Road, the school moved to Washington Road before settling in its current location in East Point.\nThe school enrolls more than 350 boys and graduated its first class in 2017. In its most recent report card, the Governor’s Office of Student Achievement assigned the school a C grade. (GOSA assigns A-F letter grades based on school performance, state tests, the make-up of the student body, and the graduation rate.)\nBy Richardean Golden Anderson\nMore than 300 young men of color will now have access to a higher-quality and more equitable educational option as a result of a state bill recently signed into law by Gov. Nathan Deal. As Superintendent of Fulton Leadership Academy, I’m grateful that state lawmakers passed House Bill 787 during the last legislative session and the bill recently became law. HB 787 increases state supplemental funding for state-authorized charter schools and is crucial to the future success of our school.\nFulton Leadership Academy is unique because it is a single-gender public charter school working to prepare young men of color for success in college and beyond. As a result of the new law, our school can better fulfill that mission, and our students will finally have the resources they deserve in the classroom. For the first time, we’re able to provide every high school student with a computer.\nThis critical access will help more of our students gain the skills they need to succeed in our global economy and provide additional opportunities to support our STEM (Science, Technology, Engineering and Math) focus and unique aviation theme. Our school is also able to purchase additional books, magazines and literacy resources to help ensure our students are reading on grade-level and have the ability to process complex information.\nIn the past, our school was unable to pay for these much-needed resources because our total funding was more than 30 percent below traditional public schools in our area. As a result, academic achievement sometimes suffered.\nOur previous funding levels also made it difficult to attract and retain high-quality teachers because we were unable to offer them salaries that were competitive with nearby metro Atlanta school districts.\nRichardean Golden Anderson\nThankfully, our board was able to provide teachers with a 3 percent pay increase this school year as a result of funding from HB 787. This funding increase puts Fulton Leadership Academy on par with the pay offered at area school districts and will help us attract the best and brightest educators to the classroom.\nWe also plan to devote a portion of HB 787 funding to the formal creation of a program to ensure as many of our students as possible graduate. Last year, 100 percent of our seniors received a high school diploma. We want to build on that record by establishing a program that will ensure there are similar results in the future.\nFulton Leadership Academy believes the ability to provide additional resources in the classroom, hire more high-quality educators and create a formalized pathway to graduation, will make a huge difference in our school’s academic achievement and the ultimate success of our students.\nOne of our only remaining challenges is the high cost of facilities rental and maintenance. Unlike many district public schools, state-authorized charter schools like Fulton Leadership Academy have to pay rental costs out of the funding we receive from the state and federal government. As a result, a funding gap remains because many district schools can put nearly all of the state and local dollars they receive into the classroom.\nTo assist with these facilities costs and direct more dollars to students, we call on the state Legislature to fund House Bill 430, which was approved during the 2017 legislative session. The bill would not cover all of our facilities needs, but it would provide every public charter school in Georgia with a $100,000 facilities grant. This funding is also crucial because unlike many district schools, state charter schools are unable to receive SPLOST dollars for building construction and improvements.\nWe also believe state lawmakers should draft legislation that would make unused state facilities available to state charter schools. Now, charter schools that are authorized by local school districts can locate in unused district facilities. We believe allowing state charter schools to do the same would help put all of Georgia’s public schools on equal financial footing.\nWhile there is still work to do to ensure complete funding equity, I’m thankful and encouraged that a bipartisan group of state lawmakers in the Georgia General Assembly recognized the important role that state charter schools play in Georgia’s overall educational system. The funding they approved in HB 787 will have long-lasting effects on the lives of Fulton Leadership Academy students and the tens of thousands of students enrolled in state-authorized charter schools throughout Georgia.","url":"https://www.ajc.com/blog/get-schooled/opinion-fix-imbalance-state-charter-school-funding/tNebF1SO6mirOjrN1b7LjP/"}
