{"authors":[],"date_download":"2018-10-23 03:26:13","date_modify":"2018-10-23 03:26:13","date_publish":"2016-01-29 18:20:39","description":"A UN-led push to chart a way out of Syria's tangled civil war got off to a shaky start Friday, with only representatives of Bashar al-Assad's regime attendin...","filename":"data/vaneerConsumption/OppositionabsentasSyriapeacetalksstart.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i3mc-3bmscybNe842cce83474b58b06a0-874_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423249_Opposition-absent-Syria-peace-talks-start_1540265173.html","title":"Opposition absent as Syria 'peace talks' start","title_page":"Opposition absent as Syria 'peace talks' start | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Opposition absent as Syria 'peace talks' start\nA UN-led push to chart a way out of Syria's tangled civil war got off to a shaky start Friday, with only representatives of Bashar al-Assad's regime attending the first day of supposed peace talks in Switzerland.\nThe main umbrella body representing the myriad opposition and rebel groups in the five-year-old conflict were refusing to take part at the start of what are meant to be six months of intra-Syrian negotiations in Geneva.\nA member of this group, the High Negotiations Committee (HNC), told AFP however that a small, low-level team of three spokesmen were en route for Geneva where they might meet with UN envoy Staffan de Mistura.\nA rebel fighter looks up from his hiding spot in the rebel-controlled area of Arbeen, on the outskirts of the Syrian capital, Damascus on January 29, 2016 ©Amer Almohibany (AFP)\n\"The media delegation... might meet with de Mistura, with the Americans, but the programme is not clear yet,\" Fuad Aliko said. \"But not as negotiators.\"\nNeither de Mistura nor Syria's UN ambassador Bashar al-Jaafari commented to reporters as they began discussions inside Geneva's Palais des Nations, the European UN headquarters.\nThe talks, backed by all the external powers embroiled in the war, are the biggest push yet to end a conflict that has killed more than 260,000 people and facilitated the meteoric rise of the extremist Islamic State (IS) group.\nThe highly complex conflict, which has been raging for almost five years, has also destabilised the already restive Middle East and drawn in not only regional powers like Saudi Arabia, Iran and Turkey but also the United States and Russia.\nIt has also forced millions of Syrians from their homes, many of them into neighbouring states and further afield, causing a major political headache for the European Union which received more than one million migrants in 2015.\nDe Mistura issued an emotional video message on Thursday to Syrians both inside and outside the country saying that after previous failures, this new effort \"cannot fail\".\n- 'Historic opportunity' -\nThe Geneva negotiations, if they happen properly, would not be face-to-face between the regime and its opponents. Instead they are \"proximity talks\" where go-betweens shuttle between the different participants.\nThey are part of an ambitious plan launched in Vienna in November by a raft of key actors including Russia, the United States, Gulf states, Iran and Turkey that foresees elections within 18 months.\nDespite Western pressure, the HNC umbrella group has been refusing to show up in Switzerland before an agreement is reached on aid reaching hundreds of thousands of people stuck in besieged towns.\nThe US State Department said Thursday these demands were \"legitimate\" but called on the opposition to take part in what it called \"an historic opportunity.\"\n\"And we still believe they should do so without preconditions,\" spokesman Mark Toner said. \"We believe these demands, while legitimate, shouldn't keep the talks from moving forward.\"\nThe HNC, which engaged in a fourth day of talks in Riyadh on whether to attend, has also asked for \"clarifications\" after the UN issued invitations to other opposition figures.\nDe Mistura reportedly issued individual invitations to a list of figures opposed to the regime but who are thought to have closer ties to Moscow and have limited influence on the ground.\nRanda Kassis, a member of that list, told AFP in Geneva on Friday that despite the uncertainty on who would attend, \"something has to start. We have to think of the Syrian people.\"\nThe HNC and its Saudi and Turkish backers have also objected to the participation of Syrian Kurdish groups that have made key advances against IS in northern Syria in recent months.\nRussia, however, which has helped the regime of President Assad make inroads against rebels with air strikes since September, says Kurdish involvement is essential.\n- 'Inflexible' Assad -\nFrance-based Middle East analyst Agnes Levallois said the opposition was growing increasingly frustrated that the question of Assad's fate, a key stumbling block in previous talks, was being put off.\n\"Assad is feeling stronger and stronger so is being inflexible,\" she said.\nIranian President Hassan Rouhani, whose Shiite country also backs Assad and is at daggers drawn with Sunni regional rival Saudi Arabia, said during a visit to Paris on Thursday that the process would take time.\n\"We hope that these talks will succeed as soon as possible. But I would be surprised if they succeed very quickly because in Syria there are groups who are at war with the central government and also amongst themselves,\" French media quoted him as saying.\n\"There is interference in the internal affairs of Syria,\" he added.\nUN Syria envoy Staffan De Mistura has met the Syrian government delegation at the start of peace talks ©Fabrice Coffrini (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3423249/Opposition-absent-Syria-peace-talks-start.html"}
