{"authors":[],"date_download":"2018-10-30 20:30:09","date_modify":"2018-10-30 20:30:09","date_publish":"2015-11-25 14:43:31","description":"Buckhead Coalition, headed by former Atlanta Mayor Sam Massell has come out against plan for bike lanes along part of Peachtree Road in Buckhead","filename":"data/vaneerConsumption/OpposednowbyBuckheadCoalition.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_buckhead-coaliti_3fb170de6226406f747fb8c7936f1b4d__1540931409.html","title":"Opposed now by Buckhead Coalition","title_page":"Peachtree Road Bicycle Lanes: Opposed now by Buckhead Coalition","title_rss":"NULL","source_domain":"ajc.com","text":"The Buckhead Coalition has come out against a controversial plan to put bike lanes along part of Peachtree Road in Buckhead.\nSam Massell, president of the Buckhead Coalition and former Atlanta mayor, said the organization has generally been in favor of bike-friendly projects and is a long-time supporter of Atlanta Bicycle Coalition and PEDS (bicycle and pedestrian advocacy organizations, respectively, that are proponents of the Peachtree Road Diet plan).\nBut not in this case. Not on Peachtree Road. Not now, said Massell.\n\"We’re willing to take another look in a few years,\" Massell said. \"But now, the sentiment among our members and by the public at large in Buckhead is that 63 percent oppose it. And that’s overwhelming.\"\nThe Buckhead Coalition is a small but influential nonprofit coalition made up of 100 chief executive officers of major area firms.\nMassell sent a letter to the Georgia Department of Transportation Commissioner Russell McMurry explaining the coalition's position on the plan. Click here to view it: Letter to Commissioner McMurry, GDoT @ November 19, 2015\nThe fight is shaping up to be an epic one, the likes of which has not been seen in metro Atlanta since the idea to build an outer Perimeter called the Northern Arc was defeated.\nMassell, 88, should know. He's a lifelong Atlanta resident who served as mayor from 1970 to 1974.\nHe said the brewing battle over Peachtree Road reminds him of the furor that erupted in the 1970s over the proposed Presidential Parkway, which wound up becoming Freedom Park after area residents opposed plans for a limited access highway. It's also reminiscent of the flap over the construction of Ga. 400 which tore the community apart, he said.\n\"With Ga. 400 through Buckhead, it took nine years before neighborhood people would speak to me on the street,\" Massell recalled. \"We had supported that. It was just terrible, that fight. And that’s what they are facing now. It’s interesting that it’s gotten that heated.\"\nWell-heeled residents of Buckhead, many of whom have political clout, have already been knocking on the governor's door.\nThere's also a clear generational divide emerging that is interesting to note - many who support the plan are under age 30, while those opposing it tend to be older, Massell said.\nMassell said that there has been a \"flutter of emails and telephone calls and threats,\" from both sides of the debate going out to Atlanta City Council members, Buckhead Community Improvement District members and other influential community leaders.\nAt the last public open house about the issue, on Oct. 29, more than 400 people showed up. According to GDOT, that's one of the highest turnouts ever recorded for a public hearing.\nClick here to see a GDOT presentation about the project. Peachtree Road Transformation Project_7_14_2015","url":"https://www.ajc.com/news/local/buckhead-coalition-opposes-peachtree-road-bike-lanes/Q6OwBAlrQyquxqak1Du3qI/"}
