{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-23 04:01:47","date_modify":"2018-10-23 04:01:47","date_publish":"2016-01-29 19:30:19","description":"On Saturday - a day after her big day - the star took to Instagram to show off a gift from her Tony Award-winning pal Daryl Roth.","filename":"data/vaneerConsumption/OprahWinfreysentbreadforherbirthdayafterWeightWatcherscommercial.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/30/23/30BCBCA200000578-0-image-a-9_1454198254102.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423331_Birthday-hike-Oprah-Winfrey-celebrates-turning-62-crowd-sunrise-hill-climb_1540267307.html","title":"Oprah Winfrey sent bread for her birthday after Weight Watchers commercial","title_page":"Oprah Winfrey sent bread for her birthday after Weight Watchers commercial | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"What to get the woman who has everything? Easy seven grain, lots of seven grain.\nOprah Winfrey has reveald her favourite gift after her 62nd birthday and it is not a fancy car or jewellery - it is bread.\nOn Saturday - a day after her big day - the star took to Instagram to show off a gift from her Tony Award-winning pal Daryl Roth.\nScroll down for video\n'I love bread!' On Saturday, Oprah Winfrey reveald her favourite gift after her 62nd birthday the previous day and it is not a fancy car or jewellery - it is bread\nA makeup-free Oprah could not hide her excitement after opening a big box of bread.\nThe now-62-year-old wrote: 'Favorite birthday gift.. 7 loaves of freshly baked 7 grain! Thank you my friend @daryl_roth. #ilovebread.'\nWhile it may seem like a weird, the talk show host is a big fan of the food as revealed in her recent Weight Watchers commercial in which she could not stop saying 'I love bread'.\nBut the gift is not going to ruin the star's diet completely, as she made sure to make her special day all about health.\nEveryone gets flowers! The star was inundated with blooms for her big day on Friday\nHmmmm: However, the talk show host seemed a little confused by the multi-coloured roses she recieved\nThe star, who celebrated her 62nd birthday on Friday, went on a hill hike with a rather large group of friends but that wasn't all as her five canine pals each sent her a bouquet of flowers with a little help from her longtime partner Stedman Graham, 64.\nShe posted three shots of her exercise efforts - one with her pals - all looking rather triumphant after their exertions.\nThe other picture was of the stunning view she got to take in at the break of day.\nA third photo was of Oprah herself, dressed in a grey T-shirt and hooded top.\nHappy birthday to me! Oprah made her day about bhealth and went in for some exercise to herald her 62nd year on Friday\nBrought her OWN crowd: She posted three shots of her exercise efforts - one with her pals - all looking rather triumphant after their exertions\nHow sweet: Oprah shared a picture of the flower bouquets given her by her five dogs - with a little help from longtime partner Stedman Graham\nShe had completed her hiking ensemble with a pair of pale grey trousers.\nOprah captioned the shot: 'What a great way to celebrate. Grateful for the sunrise hike from #ownpack!'\nThe former chat show host was surrounded by colleagues who worked at her company, who were all wearing T-shirts with the slogan.\nOprah also shared a cute picture of her five dogs each with a pretty flower bouquet in front of them.\n'Every year Stedman sends birthday flowers from our fur-children,' Oprah wrote in the caption. 'This year they presented themselves.'\nImpressive: The other picture was of the stunning view she got to take in at the break of day\nIt is no surprise Oprah should choose to embrace her birthday in this way - she is currently on a Weight Watchers plan and has so far lost 26lbs on the eating regime.\nShe has also been joined in her efforts by her close friend Gayle King.\nUnfortunately it appeared her gal pal had not made it to the morning walk.\nNot there: Gayle King revealed she got snowed in while staying in New York\nStaying on track: Also a Weight Watchers devotee alongside Oprah, she revealed her changes in eating while flying\nGayle then posted a shot of the menu available saying: 'Flying cross country BEFORE @weightwatchers beef quesadilla & roll 14 points now quinoa 6 points!'\nShe was returning to LA from a trip to New York, and posted pictures from First Class of her efforts to stay true to the eating plan while in flight.\nShe uploaded one shot of a dish of nuts and talked about how she was trying to save calories.\nGayle then posted a shot of the menu available saying: 'Flying cross country BEFORE @weightwatchers beef quesadilla & roll 14 points now quinoa 6 points!'\n'Going out to dinner in LA saving points for THAT!'\nMeanwhile Oprah revealed on Wednesday in a private Q&A with Weight Watchers company members she was at her 'wits end' as she tried and triumphed in conquering her love of potato chips.\nAccording to People, she described how she has been 'controlled' by potatoes for much of her life.\nIn it together: The pair have been following the eating regime for a while - Oprah has lost 26lbs on the plan - they are seen here in June 2012 at the AT&T Performing Arts Center in Dallas, Texas\nStill going: Oprah brought her longtime beau, businessman Stedman Graham, as her date to The Oscars on February 22, 2015\nOprah, who owns just under 6.4m shares of the company, added: 'I had tried everything.'\n'I have been controlled by potatoes for 40 years,' she said, according to the website. 'Any kind of fried potato, baked potato, scalloped potato – oh my god.'\nBut in spite of her Achilles heel, Oprah was through the moon to admit she was recently able to limit herself to just 10 potato chips.\nAchilles' heel: The 62-year-old, photographed in Melbourne in December 2015, admitted to a nearly lifelong weakness for potatoes in a chat with company directors this week\n'I actually was traveling the other day and opened a 5 oz. bag of crinkle cut, black pepper potato chips and I counted out 10 chips...And I ate the 10 and I savored every one. And I put the bag away.'\nShe also took the opportunity to explain the shame she felt being unable to fit into older articles of clothing as she addressed the concern.\n'None of those people had stood in their closets with three different sizes to try on on the floor, where the waistline didn't fit and the arms didn't fit, and the hips didn't fit, and you can't get it zipped, and felt that shame and that humiliation of \"Wow, I can't believe I'm in this position again,\"' she said.\nOprah posted the ad online Tuesday to her nearly 31million Twitter followers and shares of New York-based Weight Watchers International Inc rose 21 per cent from $11.49 to $13.44 between 1pm and 3pm during afternoon trading.\nMajor accomplishment: The talk show star, in New York in October 2015, owns just under $6.4million in shares in Weight Watchers","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423331/Birthday-hike-Oprah-Winfrey-celebrates-turning-62-crowd-sunrise-hill-climb.html"}
