{"authors":["Matt Turner","Andy Kiersz"],"date_download":"2018-10-31 00:16:01","date_modify":"2018-10-31 00:16:01","date_publish":"2016-12-02 00:00:00","description":"According to a survey by Wall Street recruiting firm Options Group, total compensation for the street will rise X%.","filename":"data/vaneerConsumption/OptionsGroupsurveyonEuropebonuses.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_options-group-survey-on-europe-bonuses-2016-11_1540944961.html","title":"Options Group survey on Europe bonuses","title_page":"    Options Group survey on Europe bonuses - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Essygie / Flickr, CC Foreign exchange trading is where it is at in Europe.\nThat's according to an annual survey by Wall Street recruiting firm Options Group, which takes in the views of the top 25% of performers at the top 10 firms in each business line.\nForeign exchange traders in Europe will see the biggest increase in their compensation, according to the survey, with a 5% increase on average.\nTraders expect a 7% increase, while FX researchers expect a 5% increase, and sales staff a 3% increase.\nIt has been a busy year for those in the FX business. Banks had a trading bonanza in the aftermath of the Brexit vote, with JPMorgan and Morgan Stanley both recording record volumes.\nElsewhere in the fixed income business, those in rates sales, trading and research expect a 4% increase, while those in credit expect a 10% drop.\nIt's a grim picture in equities business, with those in cash equities expecting a 12% drop in their bonus, and those in equity derivatives expecting a 11% drop. Investment bankers expect an 8% drop meanwhile.\nThe survey takes in the views of the top 25% of performers at the top 10 firms in each business line. They are asked what they expect to earn for 2016, which includes their base salary through 2016 and the bonus paid out in early 2017 for work through 2016.\nThat means there are some caveats to the numbers, which only take in the views of the top performers, and could be overly optimistic or pessimistic on bonus payouts. The numbers also don't reflect activity following the election of Donald Trump, as the survey research was conducted prior to the US election.\nHere is the breakdown of total compensation expectations for investment bank staff in Europe, the Middle East and Africa from Option Group's survey:","url":"https://www.businessinsider.com/options-group-survey-on-europe-bonuses-2016-11"}
