{"authors":[],"date_download":"2018-10-30 00:59:02","date_modify":"2018-10-30 00:59:02","date_publish":"2015-06-30 08:00:00","description":null,"filename":"data/vaneerConsumption/OpticCleansing.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/06/Screen20Shot202015-06-2920at207.42.3720PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861142.html","title":"Optic Cleansing","title_page":"Optic CleansingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"I’ve never owned a Rebel flag, T-shirt, bumper sticker, or key-chain. No decals, no coffee mug. None. Never will. I’m not keen on capitol displays of the flag. I don’t like, and even hate, some of the connotations and connections. But I do like some of them, and it seems to me that much of the huff is reckless.\nSeveral years ago, some of us were discussing a good quote from Robert E. Lee, and one of the folks at the table spoke dismissively of the man as a slave owner and slavery defender. The same went for Stonewall Jackson, though his chief of staff, R. L. Dabney, and Confederate chaplain, E.M. Bounds got a little respect.\nIn the midst of this conversation, I suggested that the Confederacy was not all about slavery, and I offered this analogy: Suppose that Mexico, which has stricter abortion laws than we do, finally has all they can take of the slaughter of unborn innocents north of the border. They mass troops for invasion, and the U.S. mobilizes forces at the border to meet the incursion.\nAt the time of our discussion, I’d been out of the Army Reserve for half a dozen years, but I imagined a call to join my infantry unit at the Rio Grande. Would I go and bear arms against people with whom I sympathized on this issue, in effect defending the horrendous status quo imposed upon the U.S. by the Roe v. Wade decision? The answer was yes, since, as terrible as our law was, it was our business to sort it out, not theirs.\nFrom what I read, that concern played in the minds of many who took up arms in Virginia against the Union. Indeed, that sentiment was abroad in the Southern Baptist Convention when it broke with the northern Baptists over who and who couldn’t serve as a missionary to far regions. (The offspring of slave-holding families couldn’t qualify for support to put their lives on the line to preach the gospel in foreign lands.) The Southerners’ objection was more “Who do you think you are?” than “Hmmm. Love me some slavery.” Of course, our SBC leaders were wrong about slavery. Of course, the institution of slavery in the South (with plenty of Northern economic cooperation in its establishment) was morally inexcusable. But, again, that’s not all the story.\nI’m told that one of my maternal great grandfathers was a Union general, and the portion of East Tennessee where my father was born never seceded. I don’t have Deep South roots. And, of course, I’m glad that the Union won. I thank God for the Emancipation Proclamation, the Underground Railroad… Brown vs. Board of Education… and the Civil Rights Act of 1964. So do the vast majority of Southerners. But some of the righteously indignant folks need to cool their judgmental jets a bit.\nI submit that for many today, the Confederate flag is a statement of regional defiance, not against the abolitionist movement, but against what we might call Northernism, as manifested among cultural elites in the Northeast Corridor, the Beltway, Chicago, and the Left Coast. Though Southerners hear that they aren’t much unless they have an Ivy League degree, many are quite happy with a B.A. from North Greenville College in Tigerville, South Carolina. And though Mayor Rahm Emanuel may declare Chick-fil-A unfit for morally advanced Chicago, Bible Belters are pleased to march right past the demonstrators on Same-Sex-Kiss Day to buy their grilled nuggets. Though national rankings for “livability” put pot-smoking Boulder, Colorado, miles above Arkadelphia, Arkansas, most of these Arkansans wouldn’t think of trading places to raise their kids.\nIf you think that the glorification or reinstatement of slavery is the subtext when Lynyrd Skynyrd and Alabama feature the Stars and Bars on an album cover or when Charlie Daniels sings “The South’s Gonna Do It Again,” you’re deficient at cultural hermeneutics. Yes, Halloween has pagan roots, but if the governor wants to drop bite-sized Snickers into the bag of a trick-or-treater dressed like Chewbacca, we don’t have to consign him to the occult, even if he announced that the goodies would be forthcoming on Thursday, a day named in honor of Thor. And Halloween Samhain ceremonies by a few nutcase Wiccans doesn’t change that.\nI think some critics are missing the rogue/rascal/freebird motif in official and semi-official iconography. When Tennesseans sing Rocky Top, they’re not commending murderous moonshiners; when Arkansans sing Arkansas Traveler, they’re not glorifying Ozark slackers; when Australians sing Waltzing Matilda, they’re not sanctifying suicidal poachers. Similarly, the denizens of [Oakland] Raider Nation are not suggesting that boats out of San Francisco harbor should be boarded by cutthroat pirates; and if a biker wants to hoist a Harley flag at the Sturgis, South Dakota, mid-summer rally, he’s not calling for a replay of the 1947 Hollister riot or for more Altamont work by Hell’s Angels.\nThough born and raised in the South, all the way through grad school, I had a Michigander mom, and I lived for two decades in Yankee territory, including 17 years in the Windy City. We love the Upper Midwest, but constant rehearsal of the self-congratulatory and South-defaming Chicago canon (e.g., Richard Wright’s Black Boy; the Emmitt Till story) wore thin. Apparently, it helped the “Second City” (which resented the arrogance of New Yorkers) to look down upon knuckle-dragging rustics, whether in Mississippi or in “Cheesehead” Wisconsin.\nThe city library’s annual “One Book, One Chicago” program would rather select Arthur Miller’s The Crucible (defaming religious zealots) and Harper Lee’s To Kill a Mockingbird (with Atticus Finch standing against a culture populated by the likes of vile yet pitiful Bob and Mayella Ewell), than, say, Boss, Mike Royko’s unflattering biography of despotic mayor Richard Daley, Sr., or even Upton Sinclair’s 1906 treatment of the Chicago meatpacking industry, The Jungle. (I was reminded of a South Park episode where environmentally acute Prius drivers were immersed in an atmosphere of “smug.”)\nNot long after I arrived in Chicagoland in 1975, to teach at the suburban Wheaton College, I was surprised to see neo-Nazis marching in support of Marquette Park whites who were resisting black homeownership in their neighborhood. The same Chicago-based Nazis traveled up to the northern suburb of Skokie, where thousands of Holocaust Jews had settled. These swastika-emblazoned brown shirts showed up as fools in the comedy, Blues Brothers, led by actor Henry Gibson, but in real life, the head was Frank Collin (Chicago born and educated), who broke with another American Nazi, Matt Koehl (Milwaukee born and educated), successor to American Nazi founder, George Lincoln Rockwell (Illinois born and New Jersey, Maine, and Rhode Island educated). None of them hailed from Selma or Meridian or Mayberry — the Southern points being: “Quit strutting, Yankees,” and “We’ll take our problems over yours any day.”\nA few years ago, I was asked to submit a “Christ and Culture” essay to a Festschrift for a wonderful professor taken from us untimely by cancer. Having been struck repeatedly by the Chicagoans’ relative indifference to a smile or greeting and by their reluctance to say thank you for a door held or a dropped pen retrieved, I decided to write on “the virtue of friendliness.” One of the editors was leery, for it hadn’t made the classic lists (e.g., with justice and temperance), but I persisted, and he acquiesced, admitting that, just maybe his New England upbringing gave him a blind spot. Indeed.\nOf course, we’re told that Southern friendliness is superficial and that Northern amiability comes slower, but that it’s genuine. I think that’s moonshine. Southerners are just as congenial as Northerners deep down, but you don’t have to put up with superficial insularity in the meantime.\nThe other day, a church history colleague was talking about the great revivals of religion in the Northern and Southern armies, with Dwight Moody figuring prominently in the former, and the latter captured in J. William Jones’s Christ in the Camp. The prof made an interesting observation about the spiritual outcomes of the Civil War. He speculated that the genuinely laudable victory of the northern abolitionist perspective encouraged a sort of moral triumphalism, which morphed into the “social gospel,” which grievously damaged the northern denominations. Meanwhile, the chastened Southerners withdrew into a more private religion, focusing more on evangelism and piety. They clung to their Bibles, preached the Word, and issued their “altar calls.” Of course, humiliated as they were, some found it evilly comforting to posit and hold someone lower than themselves down the ladder, hence their mistreatment of blacks well into the 20th century. But soul-winning was ever before them, and souls they won, leading them to surpass their northern brothers in vitality.\nThough disparaged for their “backward” theological ways, including their devotion to biblical inerrancy, a male pastorate, traditional marriage, etc., they’ve stayed the course, even as some conservative evangelical schools in the North began trading their doctrinal birthright for a mess of politically correct pottage. So yes, there is an element of defiance as we fly, if you will, the scorned flag of biblical conservatism. It’s not the Confederate Battle Flag, but it’s annoying, even appalling, just the same. Perhaps, someone can fashion a new “rebel flag” to capture this spirit. “Don’t Tread On Me” has been taken. Maybe, “Hey, Y’all. Get Off Your High Horse.” (Perhaps we can help by reminding you that sainted, New York suffragettes Susan B. Anthony and Elizabeth Cady Stanton played the race card to champion the 19th Amendment, saying it would help to add a bunch of white women to the voter rolls to counter the number of black votes granted by the 15th Amendment.)\nThe lords of culture may celebrate Miramax’s Pulp Fiction with Oscars, Golden Globes, and such, and scoff at little Fireproof by Sherwood Pictures, but we know with whom we’d prefer to stand in the Judgment. The world may count Woodstock iconic and the Grand Ole Opry moronic, but you won’t find patrons of the latter engaged in coed skinning dipping in the Cumberland between shows.\nOn a weekend break from Pentagon duty (yes, in the “Union Army”), I drove up to Gettysburg to walk the fabled battlefield. Reading the inscription on the High Water Mark of the Confederacy monument near the Bloody Angle, I gave thanks that the Union had prevailed. But when I walked the near mile up from Seminary Ridge to Cemetery Ridge, I felt great tenderness for the Rebels cut down like wheat on Pickett’s Charge so far from home. These weren’t ISIS marauders storming Tikrit or Waffen-SS troops thundering into Poland. They were undeniably addled and culpable defenders of slavery (as well as of their home turf), but they were laboring under the same delusion that had afflicted such slaveholders George Washington, Thomas Jefferson, and Patrick Henry.\nThese men who fell at Gettysburg weren’t “white trash.” That’s what the Rebel flag says. Indeed, it proclaims that contemporary Southern culture isn’t trash either, and it proudly “flies” Duck Dynasty, Jeff Foxworthy, and Andy Griffith, whatever the editorial board of the New York Review of Books may think. Of course, there are many more refined expressions of Southern ideals, such as the work of the Vanderbilt “Agrarians,” who bemoaned the depersonalizing industrialization of the urban North.\nThat doesn’t mean we’re insular. Southerners have a wide range of cultural tastes. We grew up singing as much from the oeuvres of the Beatles and Beach Boys as Stephen Foster and Hee Haw. We buy box sets of 24 and Downton Abbey like the folks in Boston. We’re more likely to read our kids Little House on the Prairie than Uncle Remus.\nIt runs the other direction, too. Southern culture has wide appeal beyond Dixie. One day in New York, I was surprised to discover that two yarmulke-wearing Orthodox Jewish twenty-somethings from Brooklyn, computer nerds with whom we’d been working on a website, had just attended a Larry the Cable Guy “concert.” And then there was my Yankee neighbor, a Peace Corps vet and maven of corporate buyouts and restructuring, who’d married a self-proclaimed “Brahmin” from India. His favorite album was the sound tract from O Brother, Where Art Thou?, featuring “I’ll Fly Away,” “You Are My Sunshine,” and a bunch of other “redneck” music.\nOkay, so what if you grant that neither Confederate soldiers nor the Charlie Daniels Band are trash. But the flag is still offensive to many. Yes, but we have to be careful about deploying the Universal Solvent (“I’m offended”). There’s no virtue per se in being offended or in catering to everyone else’s offense. Premature deployment of this phrase can cut short serious discussion, including the tracing of implications, which can be quite extensive and alarming when one sets about to rid the land of bad vibes. (By the way, how can those who decry the “offensive and divisive” Confederate flag remain silent when the gay rainbow is projected on the White House façade?)\nFortunately, the flag haters are waking up to the implications of their program of Confederacy cleansing. What about the Johnny Reb statuary on courthouse squares or Fort Benning, named for a Confederate general? Unfortunately, they’re trying to finesse the awkwardness by saying it’s a part of the region’s history (and, by the way, a wonderful opportunity to teach the children how awful these people were). But where are the statues of those who distinguished themselves as lynch-mob leaders, serial rapists, and town drunks? They’re a part of the region’s history, too. The obvious answer is that the statue is meant to honor the soldiers and not just record their existence. So the question remains, are they so devoid of honor or freighted with dishonor that their images should be scrubbed from the public square?\nSo yes, we may well continue to marginalize and minimize those who fought for the South, but we must resist the push to demonize them. That plays into the hands of those who despise “Southernality” itself.","url":"https://spectator.org/63295_optic-cleansing/"}
