{"authors":[],"date_download":"2018-10-22 21:55:51","date_modify":"2018-10-22 21:55:51","date_publish":"2017-03-16 00:00:00","description":"Making contraceptives available over the counter is safe, a review of research finds, and could lead to fewer unplanned pregnancies in both teens and adult women.","filename":"data/vaneerConsumption/OralContraceptionWouldBeSafeToOfferWithoutAPrescriptionPhysiciansSayShots.json","image_url":"https://media.npr.org/assets/img/2017/03/16/contraceptive-pills-1_wide-25b06f0f04bf37696dde9acd3b15a1e6531b916a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=520268440_1540245351.html","title":"Oral Contraception Would Be Safe To Offer Without A Prescription, Physicians Say : Shots","title_page":"Oral Contraception Would Be Safe To Offer Without A Prescription, Physicians Say : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nA new study suggests that birth control pills be made available nationwide over the counter and that teenagers could safely and effectively use oral contraceptives without a prescription. The study builds on more than a decade of medical research. NPR's Rebecca Hersher reports.\nREBECCA HERSHER, BYLINE: Fewer American women are getting pregnant without meaning to these days. Lucia DiVenere is with the American College of Obstetricians and Gynecologists.\nLUCIA DIVENERE: Right now we are at a 30-year low in unintended pregnancies. We have the lowest rate of abortion since Roe and the lowest rate of teen pregnancies.\nHERSHER: Access to contraceptives is a big part of that, and nearly five years ago, DiVenere's organization announced they believed the time had come to make oral contraceptives even more easily available with over-the-counter sales. Since then, California and Oregon have passed laws allowing pharmacists to distribute the pill. In Oregon, the law applies differently to adults and to adolescents. If you're under 18, you still need a prescription to get the pill for the first time. A new study suggests the science doesn't back that up.\nKRISHNA UPADHY: Birth control pills are generally safer in teenagers than in older women because teenagers tend to have fewer other health problems in general compared to older women.\nHERSHER: Krishna Upadhy specializes in adolescent medicine at Johns Hopkins. She led the study which reviewed dozens of research papers and regulatory documents and says there are very few risk factors for adolescents taking the pill. And unlike some over-the-counter meds, you can't overdose on the pill, she says. In fact...\nUPADHY: The most concerning thing that would happen is if someone doesn't take it correctly - that they could become pregnant when they don't want to.\nHERSHER: One concern that critics have raised is that increased access to birth control could lead teenagers to have more sex or that taking the pill could lead them to stop using condoms, risking sexually transmitted diseases. Upadhy says there's no evidence of that in her study.\nUPADHY: Teens and other women decide to have sex based on a number of factors, and access to contraception doesn't increase their risk of having more sex or riskier sex.\nHERSHER: Of course the entire issue is still hypothetical. The FDA has not approved any birth control pills for sale over the counter and cannot confirm or deny whether it's currently considering any applications to do so. Rebecca Hersher, NPR News.\n(SOUNDBITE OF MUSIC)\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=520268440"}
