{"authors":["Caitlin White"],"date_download":"2018-10-30 22:22:49","date_modify":"2018-10-30 22:22:49","date_publish":"2014-08-15 19:54:19","description":"The Netflix hit Orange is the New Black may be an amazing show, but it doesn't get it all correct — at least not according to the real Alex Vause. She's about to set the record straight: Piper Kerman's former friend and lover IRL, Cleary Wolters, is…","filename":"data/vaneerConsumption/OrangeIstheNewBlacksAlexIsWritingaMemoirInRealLife.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7bf8a381-1362-4aee-8f0f-20309c941e8a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35976-orange-is-the-new-blacks-alex-is-writing-a-memoir-in-real-life_1540938169.html","title":"'Orange Is the New Black's Alex Is Writing a Memoir... In Real Life","title_page":"'Orange Is the New Black's Alex Is Writing a Memoir... In Real Life","title_rss":"NULL","source_domain":"bustle.com","text":"The Netflix hit Orange is the New Black may be an amazing show, but it doesn't get it all correct — at least not according to the real Alex Vause. She's about to set the record straight: Piper Kerman's former friend and lover IRL, Cleary Wolters, is writing a memoir called Out of the Orange in which she'll get a chance to tell her side of the story, The Hollywood Reporter wrote Friday.\nThe real Alex Vause has already said that she has some bones to pick with the retelling — which is based on Piper Kerman's memoir of the same name — in an April issue of Vanity Fair. Wolters told the magazine, \"I was not Piper’s first, and I certainly did not seduce her.\" In fact, she says that she and Kerman were \"friends with benefits,\" and were never even girlfriends. Kerman disagreed, writing into the magazine:\nIf Cleary believes we were never girlfriends, that is startling news to me, though it’s certainly not the first time she has surprised me.\nI could stop here because this already shows what a great memoir this is going to be, but there's so much more.\nKerman herself said during an interview with NPR's Fresh Air that the show has taken liberties, as it is fiction, and that she and Wolters weren't even in the same prison together, except for when they were both scheduled to testify in a trial. The story loosely resembles the first episode of the show's second season, starring Laura Prepon as Alex and Taylor Schilling as Piper.\nStill, even though the show is fictional, Wolters' true story seems like it'll be juicy. In the Fresh Air interview, Kerman teased what really happened by saying this about meeting up with Wolters during their times in prison: \"Truth is much stranger than fiction when it comes to the criminal justice system.\"\nAlex Vause is a fan favorite character on the show. When rumors circulated that she would only be appearing on one episode during season two, fans were extremely disappointed, convincing show creators to bring Alex back full-time in season three. And though the Alex Vause on Netflix isn't the Cleary Wolters of real life, her character does make us excited to read Wolters' real-life story. Even her statement to The Hollywood Reporter has me bouncing around in my seat:\nAlex [the character] and Piper have inspired me to tell my whole story — an unbelievable saga that takes place all over the world: Africa, Europe, Asia, and the U.S. both in prison and out. . . . I think people may be surprised at what happened to me after I turned myself in — and where my life is now.\nThere are so many things we need to know about the real Alex Vause, but these are the top five:\n1. How does Wolters feel about Kerman now?\nIn the show, Alex and Piper seem to come to an understanding, and it's clear that at the very least, their love was real at one point in time. Because Wolters has already said that the show misrepresented their relationship, how does she really feel about the real Piper?\n2. Did Wolters really turn in Piper?\nBecause this was a pretty big deal — and we want to hear Wolters' side of it. Just how was the real Alex Vause found and arrested, and was it really her that led police to Piper Kerman? In the Vanity Fair interview, she brushes the question off saying everyone snitched on everyone, but let's get some details.\n3. Related, How did that whole testifying thing really go down?\nAfter the first episode of season two, no matter how much I loved Alex, I was basically going all Pennsatucky on her.\nThat was cold, Alex. And because we know from both Wolters and Kerman that they were together for the trial, what really happened?\n4. What was her life pre-Piper?\nI can't help it; I'm infatuated with Alex Vause. She's impossibly cool, and it seems like she had been living this life for way longer than just when she met Piper.\nHow did she get involved? Why did she? What was her life like? Did she involve any other girlfriends in the drug trafficking? What was her role in this whole scheme? This is all completely must-know from the memoir.\n5. If she wasn't in prison with Piper, what was her jail experience like?\nWe know she wasn't surrounded with Red, Taystee, or Sophia, so who were the people she met in jail? What was it really like there? Did she get into any trouble with the cook like Piper did? Was she on laundry duty? Tell me everything.\nThe memoir is set to be released May 2015 by HarperCollins subsidiary HarperOne, and hopefully we'll have all of our questions answered.\nImage: Netflix, Giphy (3)","url":"https://www.bustle.com/articles/35976-orange-is-the-new-blacks-alex-is-writing-a-memoir-in-real-life"}
