{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-23 02:43:58","date_modify":"2018-10-23 02:43:58","date_publish":"2016-01-29 17:24:15","description":"Japik the orangutan was rescued by International Animal Rescue in Borneo after two years of misery. She is between four and five years old had been chained up on a narrow wooden plank.","filename":"data/vaneerConsumption/OrangutaninBorneoisfreedafterbeingchainedupfortwoyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3F2BA00000578-0-image-a-16_1454082888256.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423073_Orangutan-Borneo-rescued-International-Animal-Rescue-chained-two-years_1540262638.html","title":"Orangutan in Borneo is freed after being chained up for two years","title_page":"Orangutan in Borneo is freed after being chained up for two years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A special appeal has been launched to help her recovery\nAn orangutan in Borneo that was found chained up on a narrow wooden plank surrounded by rubbish has been rescued after two years of misery and neglect.\nHer rescuers found Japik, who is between four and five years old, soaking wet and shivering on the plank, desperately trying to shelter from the rain under an old jacket.\nAlan Knight, Chief Executive of International Animal Rescue, said: 'It was pouring with rain when our team arrived on the scene and at first they couldn't see Japik.\nChained up: An orangutan in Borneo that was found chained up on a narrow wooden plank surrounded by rubbish has been rescued after two years of misery and neglect.\nAbandoned: It was pouring with rain when the International Animal Rescue team arrived on the scene and at first they couldn't see Japik\nUnloved: Her rescuers found Japik, who is between four and five years old, soaking wet and shivering on the plank, desperately trying to shelter from the rain under an old jacket\n'They spotted what they thought was a pile of old rags on the plank but then, when they saw it moving, they knew they had found her.\n'As our video shows, the poor orangutan couldn't escape from the rain and was cold and drenched by the time we reached her.\n'What a miserable existence for any animal, to be trapped on a wooden plank, unable to display any natural behaviour and completely exposed to the burning sun and the driving rain.\n'The chain was so short that she could only move a couple of feet on either side of the tree. Her owner may never have intended to make her suffer but suffer she certainly did.'\nJapik was rescued from Balai Pinang Vilage, Simpang Hulu District, Ketapang Regency, West Kalimantan (Indonesian Borneo.)\nHer owner admitted that he had got Japik from his brother who had bought her from a hunter. Japik's mother was almost certainly killed by the hunter before her baby was captured and sold as a pet.\nUnhapppy: 'The chain was so short that she could only move a couple of feet on either side of the tree. Her owner may never have intended to make her suffer but suffer she certainly did'\nIllegal pet: Japik was rescued from Balai Pinang Vilage, Simpang Hulu District, Ketapang Regency, West Kalimantan (Indonesian Borneo)\nBy the time she was rescued Japik's owner had known for some time that it was illegal to keep an orangutan as a pet but initially he hadn't known who to contact to surrender her.\nThen eventually he had been told about IAR's orangutan rescue and rehabilitation centre in Ketapang and contacted the team. He said that on one occasion a man had called at his house and offered him $150 for Japik but he had refused to sell her.\nKnight continues: 'Japik is yet another orangutan in a long line that our team has rescued recently. In many cases the treatment they receive as people's pets is the result of ignorance rather than a deliberate act of cruelty.\n'However the outcome for the animals is the same. The orangutans we rescue have generally been fed a completely unsuitable diet and are suffering from a range of illnesses as a result. Plus they have been kept in terrible conditions, chained up like Japik or caged for years on end.\nSafe: 'Japik is yet another orangutan in a long line that our team has rescued recently. In many cases the treatment they receive as people's pets is the result of ignorance rather than a deliberate act of cruelty'\nCut free: 'I'm so relieved that Japik is now in the care of our veterinary team who will do everything they can to restore her to health\n'Some are also suffering from severe psychological damage as a result of the trauma of being captured and kept in captivity.\n'I'm so relieved that Japik is now in the care of our veterinary team who will do everything they can to restore her to health.\n'While she is in quarantine she will undergo numerous checks and tests to ensure she is free from disease before she is introduced to any of the other orangutans and her rehabilitation can begin in earnest.\n'We're extremely grateful to everyone who supports our work so generously and gives us the means to help and heal orangutans like Japik.\nWe have launched a special appeal to help her on the road to recovery and if we exceed our target any excess funds will be used to help the many more orangutans like Japik still in need of our help.'","url":"https://www.dailymail.co.uk/news/article-3423073/Orangutan-Borneo-rescued-International-Animal-Rescue-chained-two-years.html"}
