{"authors":["Associated Press"],"date_download":"2018-10-22 20:43:38","date_modify":"2018-10-22 20:43:38","date_publish":"2016-01-29 03:02:45","description":"SANTA ANA, Calif. (AP) — A woman who taught English classes at a Southern California jail was arrested Thursday on suspicion of helping three inmates — inclu...","filename":"data/vaneerConsumption/OrangeCountyjailteacherarrestedforhelping3escape.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:71aaba6ff0ae4abc9d7b8333fdad44a2-2vdWmEltwXfba0ce28e632f5d2cb-194_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420624_Sheriff-3-broke-California-jail-mustve-help_1540241018.html","title":"Orange County jail teacher arrested for helping 3 escape","title_page":"Orange County jail teacher arrested for helping 3 escape | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Orange County jail teacher arrested for helping 3 escape\nSANTA ANA, Calif. (AP) — A woman who taught English classes at a Southern California jail was arrested Thursday on suspicion of helping three inmates — including an alleged killer — escape the lockup, and the men are believed to be riding around in a stolen van.\nNooshafarin Ravaghi, 44, of Lake Forest, was arrested nearly a week after the men — one an alleged killer — cut their way through steel bars, climbed through plumbing tunnels, made their way to the roof, cut razor wire and, using rope made of braided bedsheets, rappelled four stories to freedom from the roof of the Orange County Central Men's Jail. The escape on Jan. 22 wasn't noticed for 16 hours.\nIt was the first escape from the maximum-security lockup in more than 20 years.\nThis undated photo provided by the Orange County Sheriff's Department shows Nooshafarin Ravaghi. Ravaghi, 44, who taught English classes at Central Men's Jail in Santa Ana, Calif., was was arrested Thursday, Jan. 28, 2016, on suspicion of helping three inmates escape the lockup. She was arrested nearly a week after the men ¿ one an alleged killer ¿ cut their way out of the jail and rappelled down an outside wall last Friday. (Orange County Sheriff's Department via AP)\nRavaghi was taken into custody about an hour before the arrest was announced Thursday afternoon and remained jailed. It was unclear whether she had an attorney.\nRavaghi had worked since 2014 as a part-time instructor of English as a second language in the inmate education program operated by the Rancho Santiago Community College District, the school said in a statement.\nOne of her students was Hossein Nayeri, 37, the alleged mastermind of the escape, who was awaiting trial on charges that he kidnapped and tortured a marijuana dispensary owner — finally cutting off his penis — in a bid to learn where he might have cached money.\n\"There was some type of relationship that developed between the two\" that was close, Hallock said, but he didn't know whether it was a romance.\nRavaghi denied supplied any tools to the inmates, but investigators suspect she provided Google maps that potentially could have helped the inmates plan their route after fleeing the jail, Hallock said.\nAccording to a personal website that sells children's books designed by Ravaghi under the name \"the Noosha Collection,\" she was born, like Nayeri, in Iran.\nShe traveled in Europe and Asia as a child and attended college in Tehran before coming to California in 1997, where she got a masters' degree in education and began teaching English to non-native speakers.\nShe had undergone a sheriff's background check before beginning her assignment in the jail, and the college is working closely with sheriff's officials to provide anything they need, the school's statement said.\nHallock said investigators believe he and the others — alleged killer Bac Duong, 43, and Jonathan Tieu, 20 — are living in a white GMC Savana van that was stolen on Saturday in southern Los Angeles.\nDuong apparently stole the vehicle from someone after responding to a sales ad and taking it for a test drive, Hallock said. \"They may be driving around and potentially living in the back\" of the van, he said.\nHallock said the ongoing manhunt has led to about 10 arrests so far in connection with the escape, with several other arrests made in connection with unrelated arrest warrants or probation violations. None of those arrests were of jail employees.\nThe investigation has centered on a Vietnamese gang in the nearby cities of Westminster and Garden Grove with ties to two of the inmates.\n___\nThis story has been corrected to show that the van was stolen on Saturday, not Sunday.\n___\nJablon reported from Los Angeles. Associated Press writers Amanda Lee Myers and Andrew Dalton also contributed to this story from Los Angeles.\nA wanted sign is displayed for the The reward for information leading to the arrest of the the three escaped inmates from the Orange County Central Men's Jail on Tuesday, Jan. 26, 2016, in Santa Ana, Calif. Hossein Nayeri, Jonathan Tieu and Bac Duong are believed to be dangerous and all were awaiting trial for separate violent felonies, authorities said. (Paul Rodriguez/The Orange County Register via AP) MAGS OUT; LOS ANGELES TIMES OUT; MANDATORY CREDIT\nAuthorities with the Orange County Central Jail stand on the top jail floor in Santa Ana, Tuesday, Jan. 26, 2016. Three inmates, including a man suspected of a killing, cut through metal, crawled through plumbing tunnels, climbed a roof and rappelled down four stories to freedom last week using ropes made from bedsheets. The sheriff's department has been slow to add more rooftop security cameras at the jail despite a grand jury's recommendations for eight years straight, according to a report Monday. (AP Photo/Nick Ut)\nThis undated combo photo provided by the Orange County Sheriff's Office shows tattoos and other markings on the body Bac Duong, one of three inmates who escaped Friday, Jan. 22, 2016, from the county's Central Men's Jail in Santa Ana, Calif. Orange County Sheriff Sandra Hutchens said Wednesday that several arrests have been made in the investigation, but the inmates themselves have not been captured. (Orange County Sheriff's Office via AP)\nThis undated photo provided by the Orange County Sheriff's Office shows Bac Duong, one of three inmates who escaped Friday, Jan. 22, 2016, from the county's Central Men's Jail in Santa Ana, Calif. Orange County Sheriff Sandra Hutchens said Wednesday that some arrests have been made in the investigation, but the inmates themselves have not been captured. (Orange County Sheriff's Office via AP)\nCORRECTS DAY TO SATURDAY, JAN. 23- This undated photo provided by the Orange County Sheriff's Office shows a 2008 White GMC Savana utility van that authorities believe three escaped inmates from Orange County, Calif., stole from South Los Angeles on Saturday, Jan. 23, 2016, following their jailbreak Friday. Sheriff's Lt. Jeff Hallock said Nooshafarian Ravaghi, a 44-year-old woman who taught English as a second language to inmates, was arrested Thursday on suspicion of helping three inmates escape the lockup. (Orange County Sheriff's Office via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420624/Sheriff-3-broke-California-jail-mustve-help.html"}
