{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:33:36","date_modify":"2018-10-30 22:33:36","date_publish":"2014-08-15 12:15:41","description":"The thing about Orange is the New Black is that most of us really only care about the women (and the correctional officers) that are trying to make a living at Litchfield Prison. However, despite that, Orange is the New Black not only follows their…","filename":"data/vaneerConsumption/OrangeistheNewBlackAddsMikeBirbigliainaSecretRoleThatMightHaveNothingtoDoWithLitchfield.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/86439f6f-16c4-4265-ad95-82783db0aa86.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35894-orange-is-the-new-black-adds-mike-birbiglia-in-a-secret-role-that-might-have-nothing_1540938816.html","title":"'Orange is the New Black' Adds Mike Birbiglia in a Secret Role That Might Have Nothing to Do With Litchfield","title_page":"'Orange is the New Black' Adds Mike Birbiglia in a Secret Role That Might Have Nothing to Do With Litchfield","title_rss":"NULL","source_domain":"bustle.com","text":"The thing about Orange is the New Black is that most of us really only care about the women (and the correctional officers) that are trying to make a living at Litchfield Prison. However, despite that, Orange is the New Black not only follows their lives but also the lives of Piper Chapman's friends and family outside the prison walls. Of course, basically everyone hates her ex-fiancé Larry Bloom and her ex-best friend Polly Harper is right up there with him ever since the two of them hooked up behind Piper's back and tried to get her blessing on their unholy union. Now that comedian Mike Birbiglia is joining Orange is the New Black in a role that we have absolutely no information about, am I the only one who thinks this is the perfect opportunity for Netflix to try and make the outside world seem more interesting?\nSince Piper is the main character, it makes sense that we've met, essentially, her entire family and even gone with her to her grandmother's funeral. Larry, who was the most important person to Piper before Alex Vause walked back into her life, has had his family fleshed out a lot as well, especially considering his father was Piper's lawyer up until season 2. However, Piper's once-best friend Polly has gotten no development whatsoever. She was Pete Harper's wife, she's now Larry's girlfriend, she's Finn Harper's mother, and she was Piper's best friend. We don't even know what her maiden name is, let alone if she has any living family.\nStephen Lovekin/Getty Images Entertainment/Getty Images\nJust as we'll probably get to dive into George \"Pornstache\" Mendez's past thanks to the casting of Mary Steenburgen as Pornstache's mother, Birbiglia's role could enable us to learn more about Polly and why we should care about her as anything other than the worst friend that Piper has ever had. For someone who was so integral to Piper's life outside of Litchfield, Polly has gotten very little personal screen time or development. In fact, from the start of the show, it's been hard to understand why she was even Piper's best friend to begin with.\nBirbiglia is too young to play one of Maria Dizzia's parents, but maybe Polly has a brother that we haven't seen until now, who could come to town to support her during her divorce from Pete and her continued relationship with Larry. Maybe he, like the audience, thinks this is a terrible idea that needs to stop right now. Maybe he'll call Polly out on what a bad friend she's been to Piper, whose story he's been following in the papers and on the radio thanks to Larry. Maybe he'll actually give us a person outside of Litchfield that we can actually like and sympathize with.\nBrad Barket/Getty Images Entertainment/Getty Images\nIt might be a stretch, but at this point the only reason there aren't more Polly Harper haters is because we don't really know Polly well enough to hate her. Season 3 could be Orange is the New Black's chance to change that before people lose interest in the outside-the-prison scenes entirely and they're forced to write Larry, Polly, and Piper's relatives off the show except for flashbacks and furloughs.\nImage: Getty Images","url":"https://www.bustle.com/articles/35894-orange-is-the-new-black-adds-mike-birbiglia-in-a-secret-role-that-might-have-nothing"}
