{"authors":["Scott Neuman"],"date_download":"2018-10-22 21:39:01","date_modify":"2018-10-22 21:39:01","date_publish":"2014-06-11 00:00:00","description":"Authorities say Jared Michael Padgett stole an \"AR-15-type\" rifle that was locked up in his home, as well as a semi-automatic handgun and nine magazines of ammunition.","filename":"data/vaneerConsumption/OregonSchoolShooterWas15YearOldStudentPoliceSay.json","image_url":"https://media.npr.org/assets/img/2014/06/11/ap4157028873_wide-d88f027aa7a9ed42055f95b72d50936a05d61c5a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_06_11_321028751_oregon-school-shooter-was-15-year-old-student-police-say_1540244341.html","title":"Oregon School Shooter Was 15-Year-Old Student, Police Say","title_page":"Oregon School Shooter Was 15-Year-Old Student, Police Say : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Oregon School Shooter Was 15-Year-Old Student, Police Say\nEnlarge this image toggle caption Rick Bowmer/AP Rick Bowmer/AP\nPolice have identified the gunman who killed a student and wounded a teacher at an Oregon high school before fatally shooting himself Tuesday. Jared Michael Padgett, 15, was armed with an \"AR-15-type\" rifle, a semi-automatic handgun, a large knife and several magazines of ammunition, authorities say.\nTuesday's shooting took place in a gym that was detached from the main building at Reynolds High School in the Portland suburb of Troutdale.\nThe weapons used by Padgett were owned by his family and had been locked up; however, the shooter \"defeated the security\" to gain access to them, according to Troutdale Police Chief Scott Anderson. He said Padgett was carrying nine loaded magazines and that the weapons were concealed in a guitar case and duffel bag when the shooter arrived on campus.\nAnderson said an autopsy confirmed that Padgett died of a self-inflicted gunshot wound after exchanging gunfire with police.\nTeacher Todd Rispler, who was grazed in the hip during the assault, was able to get to the school's office and initiate the lockdown procedure, Anderson said.\nAuthorities said they did not know of any link between the shooter and the student he killed, who has been identified as Emilio Hoffman, 14.\nUpdate at 8:00 p.m. ET\nTroutdale Sgt. Carey Kaer is quoted by The Oregonian as saying that Hoffman was simply in the wrong place at the wrong time:\nThe newspaper says Padgett shot Hoffman twice in the chest with the rifle. Dr. Larry Lewman, deputy state medical examiner, says the victim died at the scene.","url":"https://www.npr.org/sections/thetwo-way/2014/06/11/321028751/oregon-school-shooter-was-15-year-old-student-police-say"}
