{"authors":["Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-22 21:37:30","date_modify":"2018-10-22 21:37:30","date_publish":"2016-01-29 07:20:47","description":"A teen who says she was present when FBI agents shot and an Oregon occupier maintains that his killing was unjustified even after reviewing video showing the armed man reaching for his pocket.","filename":"data/vaneerConsumption/OregonoccupierLaVoyFinicumsfamilyclaimsfootageshowsFBIexecution.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/02/03/03/30D523A100000578-0-image-a-33_1454471662551.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421369_Authorities-working-clear-remaining-protesters-Oregon-occupation_1540244250.html","title":"Oregon occupier LaVoy Finicum's family claims footage shows 'FBI execution'","title_page":"Oregon occupier LaVoy Finicum's family claims footage shows 'FBI execution'  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The family of a man shot and killed by FBI agents on January 26 after participating in the occupation of an Oregon wildlife refuge claims footage of the slaying and witness accounts indicate the man was shot while his hands were in the air.\nThe FBI, which released footage of the killing of Robert LaVoy Finicum last week, said the man was armed and that the footage shows him lowering his hands and reaching for a pocket containing a gun before he was shot.\n'What we believe the video shows is that LaVoy was being fired upon before he even got out of the truck,' family wrote in a statement published by the Oregonian.\nThe truck on the left was the one driven by Finicum and which Sharp claims she was sitting in\nFinicum can be seen standing to the left of the white truck wearing a hat and flanked by two FBI officers\nFinicum falls to the ground after being hit by FBI gunfire. Officials claimed Finicum was reaching for a pocket containing a gun\nIn the statement, the family claimed it had reviewed the footage together with two witnesses and that they believe the vehicle Finicum was traveling in was hit by gunfire before he got out.\nOf the FBI claim that the video shows Finicum reaching for a pocket, the family wrote:\n'Why he lowered his hands and reached for his side at one point is because he had already been shot, and he was reaching toward the area where he had been hit as an involuntary physical reflex.'\n'It is our position that he was cornered like a helpless animal, with nowhere else to turn, and executed in cold blood,' the statement concluded.\nThe statement also alleged that Finicum was denied medical attention.\nVictoria Sharp, one of the witnesses cited by Finicum's family, agreed with the view that the man's killing was unjustified even after reviewing video of the event.\n'I'm saying that the video does not show that he's reaching for something,' Sharp said Tuesday after a CNN reporter showed her the FBI footage.\nSharp, 18, said she was inside a white truck driven by Finicum that was intercepted by an FBI roadblock after a high-speed pursuit.\nVictoria Sharp claims she witnessed Finicum's slaying and that he did not try to reach for his gun\nVideo released January 28 shows the truck attempting to avoid the roadblock by swerving into the left-hand snowbank, narrowly missing an FBI officer on foot, and getting stuck.\nSeconds later, Finicum, 54, can be seen exiting the vehicle and walk around in the snow with his hands in the air.\nThen, the aerial video shows Finicum lowering his hands and making repeated motions toward his the left side of his body before he falls to the ground.\nSharp, 18, told Reuters that Finicum was armed, but that she did not see him reaching for his gun before he was shot.\n'I'm not sure if [Finicum wore] a hip holster or a leg holster, but I know the gun was holstered and he did not touch it. He had his hands in the air,' she told Reuters before reviewing the FBI video.\n'He stepped out, and he started walking, with his hands in the air. And they actually didn't shoot him immediately. It took, I'm guessing, they didn't shoot him for maybe 15 seconds,' she said.\nSlain occupier Robert LaVoy Finicum and wife Jeanette in an undated photograph\nRobert LaVoy Finicum, 54, was shot dead by FBI on January 26 after a high-speed pursuit\n'He started walking out on the snow and he was shouting. He was saying, 'if you're going to shoot me, then just shoot me'.'\nIn an interview with CNN published Tuesday, a reporter showed Sharp the FBI video and asked for her comment.\n'OK, he was running through snow and it does not look like he is reaching to me. He's trying to keep his balance. He's running, I remember it. He didn't reach for anything,' Sharp told CNN after watching the video.\nThe FBI has not made any comments on Finicum's family's or Sharp's version of events.\nThe agency has not confirmed that Sharp was actually in the truck driven by Finicum, although it said a woman was present who was not arrested and will not be named.\nFinicum was a rancher from Arizona who acted as a spokesman for the occupiers at the Malheur National Wildlife Refuge in Oregon.\nGreg Bretzing, special agent in charge of the FBI's Portland office told reporters at an January 28 news conference in Burns, Oregon, that, while the video showing Finicum's death was potentially upsetting, it was released 'in the interest of transparency.'\nThe occupation began when leader Ammon Bundy and at least a dozen followers took over a small cluster of buildings at the refuge on Jan. 2, in a flare-up in the so-called Sagebrush Rebellion, a decades-old conflict over federal control of millions of acres in the West.\nPolice and federal agents kept their distance from the site, 30 miles from Burns, a small rural town in Oregon's rural southeast, in an effort to avoid a violent confrontation.\nBut on January 26, Bundy and his leadership team left the refuge to speak at a community meeting in John Day, Oregon, and were stopped by law enforcement. The stop led to Finicum's fatal shooting and the arrest of Bundy, along with four others.\nReactions to the takeover by Burns residents have ranged from sympathy for two imprisoned local ranchers whose plight began the protest, to dismay at the armed occupation by individuals seen as outsiders.","url":"https://www.dailymail.co.uk/news/article-3421369/Authorities-working-clear-remaining-protesters-Oregon-occupation.html"}
