{"authors":[],"date_download":"2018-10-22 21:10:44","date_modify":"2018-10-22 21:10:44","date_publish":"2014-05-06 12:13:16","description":"It's not in his job description as governor, but Oregon's John Kitzhaber may have saved a woman's life on Monday.","filename":"data/vaneerConsumption/OregonGovernorPerformsCPRHelpsSaveUnconsciousWoman.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/422671/140506-john-kitzhaber-jsw-809a_4cb52baf9ecfcc09f1b9bbd6fc2d54ca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_oregon-governor-performs-cpr-helps-save-unconscious-woman-n97971_1540242644.html","title":"Oregon Governor Performs CPR, Helps Save Unconscious Woman","title_page":"Oregon Governor Performs CPR, Helps Save Unconscious Woman","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt's not in his job description as governor, but Oregon's John Kitzhaber may have saved someone's life on Monday.\nKitzhaber, a former emergency room doctor, spotted an unconscious woman in downtown Portland around 5 p.m. and performed CPR until paramedics arrived, NBC affiliate KGW reported.\nHe was on his way to dinner when he noticed the woman on the ground, and a person attempting to help her. He told his driver to pull over and ordered his security detail to call paramedics, then \"jumped out of the vehicle\" to rush to the woman's aid, chief spokeswoman Nkenge Harmon Johnson said in an email to The Oregonian.\nThe woman — who wasn't identified — wasn't breathing and may have overdosed on drugs, KGW said. Kitzhaber gave her CPR until paramedics arrived minutes later and used a defibrillator that restarted her heart, Lt. Rich Chatman of the Portland Fire Bureau told The Oregonian.\nShe was taken to the hospital and is expected to survive, the governor's office said.","url":"https://www.nbcnews.com/news/us-news/oregon-governor-performs-cpr-helps-save-unconscious-woman-n97971"}
