{"authors":[],"date_download":"2018-10-22 22:43:39","date_modify":"2018-10-22 22:43:39","date_publish":"2014-06-10 15:55:03","description":"The shooting was reported at Reynolds High School in Troutdale, east of Portland. One student died, as well as the shooter.","filename":"data/vaneerConsumption/OregonHighSchoolShootingLeavesTwoDeadPolice.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/500026/140610-troutdale-reynolds-shooting-1418_5f7cf2b667e742db0ad4b39dff1aa6e4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_oregon-high-school-shooting-leaves-two-dead-police-n127401_1540248219.html","title":"Oregon High School Shooting Leaves Two Dead: Police","title_page":"Oregon High School Shooting Leaves Two Dead: Police","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA shooter opened fire at a suburban Portland, Oregon, high school Tuesday morning, killing a 14-year-old freshman, authorities said.\nThe gunman also died, and Troutdale Police Chief Scott Anderson told an afternoon news conference that he had been tentatively identified but his name would not be released until authorities were 100 percent certain.\nAnderson also would not say how the gunman died, only that his department was waiting for details from the medical examiner's office. Anderson would not describe the weapon used except to say that it was a rifle.\n\"This is a tragedy that's not supposed to happen in any school or to any child,\" Anderson said.\nPolice say the situation at Reynolds High School in Troutdale was \"stabilized\" within an hour after initial calls came in at 8:07 a.m. (11:07 a.m. ET), just as the school day was beginning.\nAnderson identified the student who was killed as Emilio Hoffman, 14. He said Hoffman was killed in a boys locker room in the building housing the school's gym.\nHe said Hoffman's parents were \"devastated\" by the news.\nAnderson expressed appreciation for physical education teacher Todd Rispler, who despite being wounded was able to get to a school office and initiate lockdown procedures.\nSign up for breaking news alerts from NBC News\nA student told NBC station KGW of Portland that he heard two gunshots and then saw the gunman, who was not wearing a mask, chasing Rispler down a hall. Rispler said he was grazed on his hip but was OK.\n\"I was really scared, and I wanted to get with my family,\" the student said.\nJunior Jacob Saldana, 16, told NBC News that almost immediately after he got to school, a receptionist told him there was a lockdown and pulled him to a supply closet where a few other students and about six or seven other administrators were taking shelter. One of them was Rispler, who Saldana said was bleeding from his wound.\n\"He was kind of traumatized and very quiet. He was walking it off,\" said Jacob. \"He was very strong about it.\"\nJacob said that when cops showed up at the closet where he and the others were holed up, they had to prove themselves to the scared group.\nAn officer \"slid his card under the door, and we all got out, and they lined us up. Then they told us to run through the parking lot,\" said Jacob, who described the entire episode as \"surreal.\"\nLinda Florence, superintendent of the Reynolds School District, called it \"a very tragic day, one that I had hoped would never, ever be part of my experience.\"\nDuring the shooting, a number of emergency vehicles surrounded the school, and the facility was placed on lockdown. SWAT teams moved from room to room to take students out safely.\nAnderson stressed that this was a \"lone gunman\" but did note that, unrelated to the shooting, \"during the evacuation process, a gun was found on one person.\" That person was taken into custody.\nOne student who was reunited with his mom felt relief and said, \"It feels good to be back with her.\" He said there was chaos in his classroom after the lockdown was announced over the intercom.\n\"No one knew what was going on,\" he said. \"We all went to the back of the classroom.\"\nTroutdale Mayor Doug Daoust said reports of gunfire were called in as the teachers and students were arriving to start the school day.\n\"This has been a very unsettling day for our precious city,\" said Daoust. \"I'm very impressed with how the police handled this whole operation. I think going through a dry run a few months ago helped.\"\nStudents have final exams Tuesday and Wednesday, the last days of the school year, and some had yet to arrive at school for the morning.\nTroutdale is a suburb of about 16,000 people east of Portland on the banks of the Columbia River. Reynolds High is one of the state's largest schools, with more than 2,600 students.\n\"This shouldn't happen in Troutdale,\" Max Maydew, a grandfather of two Reynolds students, told The Oregonian. \"You don't expect something like that to happen in your hometown.\"\nAccording to the pro-gun control group Everytown for Gun Safety, which says it has recorded every gun incident at schools in recent years, the Oregon attack is the 74th involving guns in schools since 20 pupils and six adults were killed at Sandy Hook Elementary School in Newtown, Conn., in December 2012.\nAt an event Monday at the White House, President Barack Obama said he was frustrated that \"this society has not been willing to take some basic steps to keep guns out of the hands of people who can do just unbelievable damage.\"\nWe're the only developed country on Earth where this happens,\" the president said. \"And it happens now once a week.\"\nM. Alex Johnson and Shawna Thomas of NBC News contributed to this report.","url":"https://www.nbcnews.com/news/us-news/oregon-high-school-shooting-leaves-two-dead-police-n127401"}
