{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:06:33","date_modify":"2018-10-30 21:06:33","date_publish":"2015-07-10 06:51:39","description":"SANTA CLARA, California -- Former Israeli Ambassador to the U.S. Michael Oren recently addressed a packed crowd at the Jewish Community Center (JCC) in Santa Clara where he discussed his latest book Ally: My Journey Across the American-Israeli Divide and the damaged U.S.-Israel relationship under President Barack Obama's leadership. |","filename":"data/vaneerConsumption/OrenIrantheMajorObstacleinUSIsraelRelationsUnderObama.json","image_url":"https://media.breitbart.com/media/2015/06/Michael-Oren-IsraelinUSA-Flickr-CC-Cropped.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_09__1540933594.html","title":"Oren: Iran the Major Obstacle in U.S.-Israel Relations Under Obama","title_page":"Oren: Iran the Major Obstacle in U.S.-Israel Relations Under Obama | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SANTA CLARA, California — Former Israeli Ambassador to the U.S. Michael Oren recently addressed a packed crowd at the Jewish Community Center (JCC) in Santa Clara where he discussed his latest book Ally: My Journey Across the American-Israeli Divide and the damaged U.S.-Israel relationship under President Barack Obama’s leadership.\nThe straw that broke the camel’s back, he suggested, is the Iranian nuclear issue.\n“Ally” is one of the most beautiful words in the Hebrew and English language, Oren began. But that bond has been eroded and deeply damaged.\nAmong the issues dividing the two, Oren said, are the peace process, the issue of settlements, the status of Jerusalem, weapons sales to Arab nations, “and most profoundly today, we are divided over the Iranian nuclear deal.”\nIsraelis share a common irritation at what is perceived as Obama’s mishandling of the Iranian nuclear agreement by making countless concessions, ultimately placing Israel in a very dangerous security situation.\nShould Iran acquire nuclear weapons, nearly every Arab nation in the region will also acquire these arms, he said. “The Middle East as we know it is coming apart!” Oren exclaimed.\n“Iran is the world’s leading state-sponsor of terrorism and Iran has killed more Americans than any other entity other than al Qaeda and they are actively seeking to destroy Jews and Israelis throughout the world,” he added.\nIran has called for “death to America” and “death to Israel,” using the epithets of “Great Satan” and “Little Satan” to describe the two democracies consecutively on a near daily basis, he explained. “Obama has said Iran is a rational country, even though it’s antisemitic… We [Israel] think Iran is an irrational country and if it says it wants to destroy us, it means it.”\nOren noted that when Netanyahu moved into his office as Prime Minister of Israel, the first thing he did was hang a picture of Churchill on his wall. In contrast, the first thing Obama did when he took over the Oval Office was return a Churchill bust to England.\n“Two completely different world views,” Oren reiterated.\nOren pointed out that Netanyahu has repeatedly stated that Israel will stand alone if it must. “And Israel has a right, the duty and capability to defend itself.”\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook","url":"https://www.breitbart.com/national-security/2015/07/09/oren-iran-the-major-obstacle-in-u-s-israel-relations-under-obama/"}
