{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:26:21","date_modify":"2018-10-30 20:26:21","date_publish":"2017-03-23 03:07:18","description":"More than 48 survivors and families of deceased victims of the June 12, 2016 attack on the Orlando Pulse nightclub are suing the gunman's employer and wife in federal court. | Politics","filename":"data/vaneerConsumption/OrlandoPulseSurvivorsFamiliesSueGunmansEmployerWife.json","image_url":"https://media.breitbart.com/media/2016/06/wi/afp_caac94335e6f119a64715fd3af92ccd389ef1bf0-6.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_22__1540931181.html","title":"Orlando Pulse Survivors, Families Sue Gunman's Employer, Wife","title_page":"Orlando Pulse Survivors, Families Sue Gunman's Employer, Wife | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"More than 48 survivors and families of deceased victims of the June 12, 2016 attack on the Orlando Pulse nightclub are suing the gunman’s employer and wife in federal court.\nThe lawsuit was filed Wednesday in South Florida.\nAccording to the Associated Press, personal injury attorney Antonio Romanucci claims, “[Omar] Mateen’s employer, international security company G4S, knew he was mentally unstable yet allowed him to carry a gun in his job as a security guard. Mateen had a firearm license through his job.”\nRomanucci added, “Mateen gave out so many warnings that someone should have reined this guy in. They should have said, ‘You are not stable. You shouldn’t have a weapon.'”\nRomanucci also claims Mateen’s wife, Noor Salman, knew the Pulse attack was going to take place but did not report it. He said, “Rather than warn authorities, she kept it a secret and acted as his accomplice.”\nNeither G4S’s spokeswoman nor Salman’s attorney would comment to the AP about the lawsuit.\nFamilies of the December 14, 2012, Sandy Hook Elementary attack filed a suit against the maker of the AR-15 the Sandy Hooker attacker used to kill teachers and school children. However, the lawsuit was dismissed because of the Protection of Law Commerce in Arms Act (2005). That act shields gun manufacturers from frivolous suits against firearms legally made and legally sold.\nThe AR-15 used in Sandy Hook was legally sold to Nancy Lanza, the attacker’s mother. The attacker then stole the gun and used it in the heinous attack on the school.\nThe guns on the Pulse attacker were also legally made and sold; the gunman passed a background check for both, and a waiting period. So the suit in Florida is directed at an employer and spouse. But UCLA law professor Adam Winkler said the suit will still be “very challenging.” He said, “Victims of gun violence are looking for second-best options and that is what this is.”\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2017/03/22/orlando-pulse-survivors-families-sue-gunmans-employer-wife/"}
