{"authors":["John Nolte"],"date_download":"2018-10-30 21:48:24","date_modify":"2018-10-30 21:48:24","date_publish":"2015-01-21 15:20:59","description":"Oscar-winning director Barry Levinson opens a Variety op-ed about \"Selma's\" Oscar snub by defaming America: \"Are we a racist country? Yes,\" Levinson |","filename":"data/vaneerConsumption/OscarWinnerBarryLevinsonDoesntCastBlackActorsCallsAmericaRacist.json","image_url":"https://media.breitbart.com/media/2015/01/9.-Barry-Levinson-43.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_01_21__1540936104.html","title":"Oscar-Winner Barry Levinson Doesn't Cast Black Actors; Calls America Racist","title_page":"Oscar-Winner Barry Levinson Doesn't Cast Black Actors; Calls America Racist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Oscar-winning director Barry Levinson opens a Variety op-ed about “Selma’s” Oscar snub by defaming America: “Are we a racist country? Yes,” Levinson writes. He does throw America a bone by saying we are getting better, yet offers no proof to back up his smear. If, however, one wanted to prove Hollywood is racist, the left-wing director’s own films could be easily introduced as a devastating Exhibit A.\nDespite being an A-List director in a business swimming in superb black actors and actresses most directors would crawl over glass to work with, a serious look at Levinson’s resume reveals a director who appears to go out of his way to work only with white people.\nBelow is a list of more than two-dozen films directed by Levinson over the last 37 years. Except for casting the great Samuel L. Jackson in the wretched “Sphere,” a girlfriend role in “Liberty Heights,” and the best friend role in “Good Morning Vietnam,” I could not find a single black star cast in a single top role. In fact, it’s shocking how few black actors Levinson has cast in any role.\nHell, five years before the Selma March, John Ford made “Sergeant Rutledge.” In the decades since Selma, Levinson has never once centered a film around a black star. Not once.\nBarry Levinson trashing America as racist is like water complaining about wet.\n2015 Rock the Kasbah\n2014 The Humbling\n2012 The Bay\n2010 You Don’t Know Jack\n2008 What Just Happened\n2006 Man of the Year\n2004 Envy\n2001 Bandits\n2000 An Everlasting Piece\n1999 Liberty Heights\n1998 Sphere (small role for Queen Latifah)\n1997 Wag the Dog\n1996 Sleepers\n1994 Disclosure\n1994 Jimmy Hollywood\n1992 Toys (Small roles for LL Cool J and Jamie Foxx)\n1991 Bugsy\n1990 Avalon\n1988 Rain Man\n1987 Good Morning, Vietnam\n1987 Tin Men\n1985 Young Sherlock Holmes\n1984 The Natural\n1982 Diner\n1978 Peeping Times\nHow does an A-list, Oscar-winning director with a post-Civil Rights four decade career and 25 films under his belt avoid working with the wealth of incredible black actors available to him: Denzel Washington, Angela Bassett, Keith David, Will Smith, Terence Howard, Morgan Freeman, Eddie Murphy, Cuba Gooding, Jr., Danny Glover, Wesley Snipes, James Earl Jones, Kaye Diggs. Kerry Washington, Halle Berry, Ving Rhames, Louis Gossett, Jr., Richard Pryor, Whoopi Goldberg, Charles S. Dutton, Jeffrey Wright, Ossie Davis, Ruby Dee, Don Cheadle, Laurence Fishburne, Dennis Haysbert, Delroy Lindo, Alfre Woodard, Howard Rollins, Blair Underwood, Mario Van Peebles, Michael Clarke Duncan, Ice Cube, Gabrielle Union, Nia Long, Rosario Dawson, Jennifer Hudson, Viola Davis, CCH Pounder, Pam Grier, or Thandie Newton?\nI’m surprised Levinson was once willing to cast a guy named Lewis Black.\nOver the last five years, including this year, the Academy has awarded 10 of the 100 possible Best Actor/Actress slots to black actors. That’s a 10% rate, only a little below the 12.6% (averaged over 5 years) of blacks who make up the American population. That’s science.\nAs far as doing similar math with Levinson’s casting choices, I’m pretty sure zero times zero equals zero.\nThis post has been updated to satisfy the nit-pickers who don’t know the difference between a “top role” and a small speaking role.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/01/21/barry-levinson-doesnt-cast-black-actors-calls-america-racist/"}
