{"authors":[],"date_download":"2018-10-22 22:58:12","date_modify":"2018-10-22 22:58:12","date_publish":"2014-05-13 07:24:19","description":"The Oscar Pistorius trial judge will decide Wednesday if the double-amputee runner should have a psychiatric test for a possible anxiety disorder.","filename":"data/vaneerConsumption/OscarPistoriusTrialJudgetoRuleonPsychiatricEvaluation.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437996/140513-pistorius-330a_bff545805602dab62a0f08fdec7bbb31.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_pistorius-trial_oscar-pistorius-trial-judge-rule-psychiatric-evaluation-n103861_1540249092.html","title":"Oscar Pistorius Trial Judge to Rule on Psychiatric Evaluation","title_page":"Oscar Pistorius Trial Judge to Rule on Psychiatric Evaluation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe judge in Oscar Pistorius's murder trial will decide Wednesday whether the double-amputee runner should be placed under psychiatric evaluation after a defense witness testified that he had an anxiety disorder.\nProsecutor Gerrie Nel asked Tuesday that the trial be adjourned for a study of Pistorius' mental health following testimony by a psychiatrist who said the Olympian's anxiety could have shaped the way he responded to perceived threats.\nNel claimed that Merryll Vorster's evidence suggested lawyers were preparing a possible defense based on a mental condition. He asked the judge to have Pistorius receive an independent assessment at a state hospital.\nDefense lawyer Barry Roux objected to request, calling it as “a ruse” and pointing out that other witnesses had yet to be called to give evidence on the subject.\nAfter hearing Vorster give evidence for a second day on Tuesday, Judge Thokozile Masipa adjourned the trial and said she would rule on Nel's request the following morning.\nPistorius claims he killed girlfriend Reeva Steenkamp by mistake last year, fearing that there was an intruder in his home when he shot through a closed toilet door early on Feb. 14, 2013. The prosecution says he killed her intentionally after an argument.\nVorster on Tuesday testified that she believed Pistorius suffered from “general anxiety disorder” – a condition she said affects between one and six percent of adults.\nShe said the anxiety did not prevent Pistorius from achieving sporting success, but noted that Pistorius's sexual relationships appeared to be quite short.\n\"He did function socially, but not optimally,\" she said.\nCross-examining Vorster, Nel asked why none of Pistorius’ family or friends knew the athlete suffered from the problem. Vorster replied that Pistorius himself was unaware he had anxiety disorder before he shot Steenkamp.\nShe said Pistorius’s fear of crime – and the athlete’s plans to move to Johannesburg to find a more secure house – was higher than “the average South African.”\nThe trial continues.\n-Alastair Jamieson","url":"https://www.nbcnews.com/storyline/pistorius-trial/oscar-pistorius-trial-judge-rule-psychiatric-evaluation-n103861"}
