{"authors":["Associated Press","Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 03:46:58","date_modify":"2018-10-23 03:46:58","date_publish":"2016-01-28 19:30:29","description":"The Academy Awards has unveiled a diverse line-up of presenters following the #OscarsSoWhite controversy and calls to boycott the ceremony.","filename":"data/vaneerConsumption/Oscars2016unveilWhoopiGoldbergKevinHartandPharrellWilliamsaspresenters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD71F100000578-0-image-a-40_1454016680003.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/usshowbiz_article-3421473_Hart-Del-Toro-Goldberg-Oscar-presenters_1540266418.html","title":"Oscars 2016 unveil Whoopi Goldberg, Kevin Hart and Pharrell Williams as presenters","title_page":"Oscars 2016 unveil Whoopi Goldberg, Kevin Hart and Pharrell Williams as presenters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Academy Awards has unveiled a diverse line-up of presenters following the #OscarsSoWhite controversy and calls to boycott the ceremony.\nWhoopi Goldberg, Kevin Hart, Pharrell Williams, The Weeknd and Benicio Del Toro were all among the first 11 names released on Thursday.\nNo boycott: Whoopi Goldberg will be among this year's presenters at the Academy Awards\nHappy: Kevin Hart and Pharrell Williams were also among the first 11 presenters announced\nThey'll join Tina Fey, Ryan Gosling, Lady Gaga, Sam Smith, Charlize Theron, and nine-year-old Jacob Tremblay handing out gongs at the Dolby Theatre in Hollywood on February 28.\n'Each of these artists brings a wonderfully distinctive element to the Oscars stage,' show producers David Hill and Reginald Hudlin said.\n'Together they represent the many thrilling ways stories can be shared about the human experience, and we’re honored they will be part of the celebration.'\nThe list will be seen by some as damage control in the wake of the Oscar race controversy, in which - for the second year running - all 20 acting nominees are white.\nFirst up: The Weeknd, who will also perform on the night will too present, as will the only Latino on the list so far Benicio Del Toro\nSpike Lee, Will Smith and his wife Jada Pinkett have all already boycotted the ceremony, and almost everyone else has submitted their two cents on the issue.\nBut Whoopi, one of the named presenters, insisted the blame lies not with the voting Academy, but with the film-makers.\n'Even if you fill the Academy with black and Latino and Asian members, if there's no one on the screen to vote for, you're not going to get the outcome that you want,' she said recently on her daytime talk show, The View.\nHey girls: Ryan Gosling, pictured here at the 2007 ceremony with his sister Mandi (L) and mother Donna, is on the list\nOn stage: Lady Gaga, a nominee for Best Song, will also present, as will Charlize Theron\n'You need directors and producers who will say, \"Hey, what about so and so?\" They need to be aware that the picture is not complete.'\n'You wanna boycott something? Don't go see the movies that don't have your representation. That's the boycott you want,' she continued. 'To me, we have this conversation every year. It p*sses me off.'\nThe 60-year-old - who has hosted the show four times - also pointed another flaw in the Academy discrimination argument: The person who won the 1991 Best Supporting Actress for her role in Ghost was black.\n'I won once,' she said. 'So it can't be that racist.'\nPharrell, The Weeknd and Lady Gaga - who are all nominated for Best Original Song - will also each perform on the night.\nWriting's on the wall: Nine-year-old Jacob Tremblay is set to melt hearts again, while Sam Smith is the third of the dual performer/presenters","url":"https://www.dailymail.co.uk/usshowbiz/article-3421473/Hart-Del-Toro-Goldberg-Oscar-presenters.html"}
