{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 05:00:08","date_modify":"2018-10-23 05:00:08","date_publish":"2016-01-11 18:14:17","description":"The Paralympic champion has been on bail awaiting a new sentence since last month, after South African judges found him guilty of murder, overturning his previous conviction of culpable homicide.","filename":"data/vaneerConsumption/OscarPistoriusfilestoappealmurderconvictioninblowtoReevaSteenkampfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DECFD00000578-0-image-a-8_1452540930894.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394367_Oscar-Pistorius-files-appeal-murder-conviction_1540270808.html","title":"Oscar Pistorius files to appeal murder conviction in blow to Reeva Steenkamp family","title_page":"Oscar Pistorius files to appeal murder conviction in blow to Reeva Steenkamp family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oscar Pistorius has today filed to appeal his murder conviction for shooting dead his girlfriend Reeva Steenkamp.\nThe Paralympic champion has been on bail awaiting a new sentence since last month, after South African judges found him guilty of murder, overturning his previous conviction of the lesser charge - culpable homicide.\nThe double-amputee killed Steenkamp, a model and law graduate, in the early hours of Valentine's Day, saying he mistook her for an intruder when he shot four times through the door of his bedroom toilet in 2013.\nScroll down for video\nOscar Pistorius has today filed to appeal his murder conviction for shooting dead his girlfriend Reeva Steenkamp\nSouth African Paralympic athlete Oscar Pistorius cries while the verdict is being read during the verdict in his murder trial\nUnder the new conviction for murder, Pistorius, 29, faces a minimum 15-year jail term that may be reduced due to time already spent in jail and the fact that he is a first-time offender.\nA lawyer on Pistroius' legal team, Andrew Fawcett, said: 'We have lodged an application for leave to appeal to the Constitutional Court.'\nPistorius was released from jail in October last year to live under house arrest at his uncle's property in Pretoria after serving one year of his five-year prison sentence for culpable homicide - the equivalent of manslaughter.\nBut Supreme Court of Appeal (SCA) judges last month described his testimony at his trial in 2014 as 'untruthful' and delivered a damning indictment of the original verdict.\nThe double-amputee (right) killed Steenkamp (left), a model and law graduate\nLegal papers filed at the Constitutional Court on Monday by Pistorius's lawyers contended that the SCA had 'acted unlawfully and unconstitutionally' by rejecting factual findings of the original verdict.\nThey also accused the SCA of making 'errors of law' over the principle of 'dolus eventualis' - awareness of the likely outcome of an action - which has been at the crux of the long-running case.\nPistorius was last seen in public at his bail hearing on December 8 in Pretoria High Court, after which he was fitted with an electronic monitoring tag.\nUnder his bail conditions, he is allowed to leave his uncle's house at set times with official permission, and not travel further than 20km (12 miles).\n'The application has been served on the director of public prosecutions,' Fawcett said.\n'They will now indicate when they will be opposing the application and what the grounds of opposition will be.\n'Then we wait for the Constitutional Court to make a ruling on whether or not they will hear the appeal.'\nPistorius denied killing Steenkamp in a rage and, during his dramatic trial, sobbed and occasionally vomited in the dock as details of his lover's death were examined in excruciating detail.\nSome legal experts have dismissed his chances of success at the Constitutional Court.\n'He is wasting his time. It is certainly not a constitutional matter,' Tyrone Maseko, a Johannesburg attorney told AFP. 'If he ever succeeds, then I will know there is no justice in this country.'\nPistorius shot Steenkamp at the peak of his fame, and has since lost his glittering sports career, lucrative contracts and status as a global role model for the disabled\nReeva Steenkamp's mother June is comforted in court as she listens to the ruling convicting Pistorius of murder\nPistorius shot Steenkamp at the peak of his fame, and has since lost his glittering sports career, lucrative contracts and status as a global role model for the disabled.\nHer family welcomed his murder conviction and has described his Constitutional Court appeal as a 'delaying tactic' to keep him out of jail.","url":"https://www.dailymail.co.uk/news/article-3394367/Oscar-Pistorius-files-appeal-murder-conviction.html"}
