{"authors":[],"date_download":"2018-10-30 01:10:53","date_modify":"2018-10-30 01:10:53","date_publish":"2018-10-29 02:25:00","description":"A basic question confronts voters each Election Day: What kind of country do you want for yourself and your children?","filename":"data/vaneerConsumption/OTHERSSAYElectionsandjobs.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_29_others-say-elections-and-jobs__page=1_1540861853.html","title":"OTHERS SAY Elections and jobs","title_page":"OTHERS SAY Elections and jobs","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A basic question confronts voters each Election Day: What kind of country do you want for yourself and your children?\nThe open-ended wording invites many responses. But for this election, at this moment a decade removed from the Great Recession, here’s an answer: Voters want more job opportunities for all—and they want more responsible, responsive government. Put another way, Americans want to live in a country where everyone can afford to pay the bills, including taxes.\nThese are not esoteric whims. They are the building blocks of a prosperous, caring society.\nOur concern during the years of recovery following the 2007-09 financial crisis has been growth too poky to make up for the lost years and to pay for everyone’s future needs. The stock market came back, but average U.S. economic growth until 2016 was a sleepy 2 percent. That’s not good enough. The U.S. nearly fell back into recession in late 2015. On the other side of the ledger—the government spending side—Medicare and Social Security remain on perilous paths toward insolvency in 2026 and 2034, respectively.\nThe positive news is that the American economy is dynamic and efficient, capable of great reaction time. Give employers incentives to bet on their future business success and they’ll go for it: They’ll hire, expand operations, seek out new markets, buy new equipment. That’s happening. America is booming, and the reason is tax reform and business deregulation driven by President\nDonald Trump and the Republican-led Congress. They’ve given employers reasons to invest.\nThe economy is growing at 4 percent. Unemployment is at 3.7 percent, the lowest since 1969. The jobless figures for African-Americans and Hispanics are near record lows.\nWe recognize the Republican-backed tax cuts don’t come free of charge. If surging employment and business growth don’t generate enough new federal revenue, the cost over a decade could reach $1.5 trillion. Still, it represents an important investment in the country’s present and future. The tax code was outdated.\nIdeally, Congress also would have found ways to control federal spending and reform Social Security and Medicare to not exacerbate the nation’s $21 trillion of debt. There are ways to do so, such as limiting benefits to the wealthy, without hurting vulnerable people. The country still needs to rescue those programs.\nBut Republicans had a window in which to cut taxes to spur growth. It was the right move because without a robust economy, the country goes backward, not forward. Without significant job growth, Social Security and Medicare will begin to run short of funding. More years of 2 percent growth would doom America to mediocre employment levels, with no good possibility of ever collecting enough new revenue to curb the debt.\nSo what kind of country do you want? One that provides the maximum number of jobs. That’s important to remember on Election Day.","url":"https://www.arkansasonline.com/news/2018/oct/29/others-say-elections-and-jobs/?page=1"}
