{"authors":["Christine Distasio"],"date_download":"2018-10-30 22:46:22","date_modify":"2018-10-30 22:46:22","date_publish":"2014-08-14 19:18:46","description":"As if we needed more to love about ABC's Once Upon A Time . On Thursday, Entertainment Weekly revealed a first-look at OUAT Season 3's gag reel and it's amazing. Have you ever wondered what Snow White channeling Jack Sparrow would look like? Well,…","filename":"data/vaneerConsumption/OUATSeason3GagReelHasPrinceCharmingsBlueSteelSoYouKnowItsGoodVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c457698a-4948-4a11-ab70-0364ab5e53f1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35794-ouat-season-3-gag-reel-has-prince-charmings-blue-steel-so-you-know-its-good_1540939582.html","title":"'OUAT' Season 3' Gag Reel Has Prince Charming's Blue Steel So You Know It's Good - VIDEO","title_page":"'OUAT' Season 3' Gag Reel Has Prince Charming's Blue Steel So You Know It's Good — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"As if we needed more to love about ABC's Once Upon A Time . On Thursday, Entertainment Weekly revealed a first-look at OUAT Season 3's gag reel and it's amazing. Have you ever wondered what Snow White channeling Jack Sparrow would look like? Well, you'll see it now — along with a handful of other hilarious behind the scenes moments with OUAT's cast. It's welcome break from all of that OUAT Season 4 Frozen storyline news fans have been scrambling for since the Season 3 finale. Frozen is great and everything, but OUAT was already great before Ed Kitsis and Adam Horowitz introduced Elsa, Anna, and Kristoff to Storybrooke. And this gag reel absolutely proves it.\nPersonally, I love a good gag reel and for a show that's steeped in fantasy even when it's taking place in the \"real world,\" it's fun to see OUAT's actors break character while in-character. The 40-second first-look is worth the watch if only for Josh Dallas as Prince Charming's runway-worthy blue steel. I know, 40 seconds doesn't sound like a lot of time, but it is — the clip gives fans a little something from every OUAT star, even villain Zelena.\nSo, if you're feeling a little Frozen fatigued or are in a rut waiting for OUAT Season 4 to premiere on Sept. 28, watch Season 3's gag reel here for a healthy dose of Storybrooke magic.\nImage: ABC","url":"https://www.bustle.com/articles/35794-ouat-season-3-gag-reel-has-prince-charmings-blue-steel-so-you-know-its-good"}
