{"authors":["Press Association"],"date_download":"2018-10-23 05:37:47","date_modify":"2018-10-23 05:37:47","date_publish":"2017-03-10 15:18:06","description":"Their place in history is already secure after becoming the first non-league team since 1914 to reach the quarter-finals of the competition.","filename":"data/vaneerConsumption/OurchancesareoneinathousandbutwecanstunArsenalsaysLincolnboss.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196647-1489159091-870_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4301664_Our-chances-one-thousand-stun-Arsenal-says-Lincoln-boss_1540273067.html","title":"Our chances are one in a thousand but we can stun Arsenal, says Lincoln boss","title_page":"Our chances are one in a thousand but we can stun Arsenal, says Lincoln boss | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Danny Cowley knows Lincoln’s FA Cup fairytale may come to an end at Arsenal on Saturday, but believes whatever the outcome everyone at the club will be better for the experience.\nThe National League leaders have captured the imagination with a run which started in the fourth-qualifying round against Guiseley.\nThe Imps upset Sky Bet Championship side Ipswich following a third-round replay and then Brighton ahead of beating Premier League Burnley 1-0 at Turf Moor.\nDanny Cowley, right\nLincoln’s place in history is already secure after becoming the first non-league team since 1914 to reach the quarter-finals of the world’s oldest knockout competition.\nAnd Cowley feels the lessons he, his assistant manager, brother Nicky, and their entire squad will have learned over the course of eight ties will prove hugely beneficial.\n“We are going to try to learn loads, because that is the best thing this FA Cup journey has given us,” Cowley said.\n“We have had the opportunity to pit our wits against the very best, the opportunity to be involved in really big games. We are determined to come out better from this experience.\n“We respect that, sooner or later, we will be old news, fish and chip paper, but that is fine by us as long as when the dust does settle we have learnt from the experience, that we are better managers and better people as a consequence of it.\n“If we can play at our very best under all of the scrutiny of playing against world-class players, in front of 60,000 people at a fantastic stadium, then we will be better individually and collectively, so that is what we will be aiming to do.”\nWhile being realistic over the prospect of his team upsetting the Gunners at the Emirates Stadium, where the Imps are set to bring some 9,000 supporters, Cowley is determined not to let the occasion get to his side.\n“We understand that the chance is probably one in a thousand, but we will go there with the belief that this can be the one time,” said Cowley, whose squad trained at West Ham on Friday.\nSo we have arrived for training at West Hams academy. pic.twitter.com/j4IRGlqNnJ — Lincoln City FC (@LincolnCity_FC) March 10, 2017\n“We will go there with a game plan and try to execute it. I would never do the disservice to my players to tell them to wake up on Saturday morning and just enjoy the day. We are professional people, we work every day for this, it is our lives.\n“We have to put emotion to one side and will have clear minds on Saturday morning.”\nArsenal come into the cup tie on the back of 5-1 home trashing by Bayern Munich as they crashed out of the Champions League and left manager Arsene Wenger facing more questions over his future.\nWhile the Gunners were being taken apart on Tuesday night, Lincoln saw off Braintree 4-0 to keep themselves on course for promotion.\nDanny Cowley\nDespite all of the clamour surrounding their FA Cup heroics, Cowley will not lose sight of the bigger picture.\n“The goal (this season) was to to get this wonderful football club back into the Football League,” he said.\n“The job has become tougher because of the journey we have had in the FA Cup, and also our run in the FA Trophy. You don’t get marathon runners celebrating at the 20-mile mark do you?\n“We are three-quarters of the way through the season and we have achieved nothing yet, that is the reality of it.”","url":"https://www.dailymail.co.uk/wires/pa/article-4301664/Our-chances-one-thousand-stun-Arsenal-says-Lincoln-boss.html"}
