{"authors":["Frances Martel"],"date_download":"2018-10-30 19:25:54","date_modify":"2018-10-30 19:25:54","date_publish":"2015-11-19 19:38:51","description":"A report states the nephews of Venezuelan President Maduro claimed the drugs for which they were arrested belonged to the nation's # 2 man.","filename":"data/vaneerConsumption/OurDrugsBelongtoNations2.json","image_url":"https://media.breitbart.com/media/2015/01/Diosdado-Cabello-Venezuela-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_19__1540927554.html","title":"Our Drugs Belong to Nation's #2","title_page":"Venezuelan President's Sons: Our Drugs Belong to Nation's #2","title_rss":"NULL","source_domain":"breitbart.com","text":"An extensive report in Miami’s El Nuevo Herald claims that the nephews of Venezuelan President Nicolás Maduro, arrested for attempting to traffic 800 kilograms of cocaine into New York, have claimed the drugs belonged to the nation’s second-in-command, National Assembly President Diosdado Cabello.\nAccording to the Herald, Franqui Francisco Flores de Freitas and Efrain Antonio Campo Flores, both nephews of Venezuelan First Lady and legislative candidate Cilia Flores, have been extremely cooperative with American Drug Enforcement Administration (DEA) officials following their arrest in Haiti last week. The Herald cites a number of government sources familiar with the investigation as stating they have been willing to trade information with authorities on their attempted drug smuggling. One of them, the report claims, cried on the flight out of Haiti to New York.\nThe two allegedly claimed Diosdado Cabello was the owner of the drugs they were trying to sell upon being arrested initially. They later changed their story and claimed they were trying to sell the cocaine on behalf of Tarek El Aissami, the governor of Venezuela’s Aragua state and head of the nation’s Islamic Relations.\nAmerican authorities are investigating Both Cabello and El Aissami for being involved in the cocaine trade. Specifically, several high-profile witnesses have accused Cabello of being the head of the Cartel de los Soles, one of Latin America’s largest cocaine smuggling rings. The cartel is so named because it is believed to be run by members of the Venezuelan military, who sport a sun medallion on their uniforms. Reportedly, El Aissami is deeply involved in the trade, as well, though he is most prominently known as the official responsible for Venezuela’s cozy relationship with the Iranian regime and Syrian dictator Bashar al-Assad.\nThe Herald goes on to claim that the Flores nephews implicated Venezuelan judge Walter Jacob Gavidia in the drug trade; Gavidia is the son of Cilia Flores–and their cousin.\n“There have already been a number of arrest orders released in their case,” according to a source speaking to the Herald. “There are more people involved in this case.”\nSpanish newspaper ABC has published a separate report on the Flores cousins case based on inside sources who name yet another government official allegedly involved in the cocaine trade: Carlos Erick Malpica Flores, the head of the state petroleum company, PDVSA. Malpica Flores is also a nephew of the first family and cousin to the suspects. ABC claims the DEA had already been building a case against PDVSA officials for using the company to launder money from the drug trade.","url":"https://www.breitbart.com/national-security/2015/11/19/venezuelan-presidents-sons-our-cocaine-belongs-to-nations-2/"}
