{"authors":["Associated Press"],"date_download":"2018-10-23 04:31:50","date_modify":"2018-10-23 04:31:50","date_publish":"2017-04-26 16:06:01","description":"VATICAN CITY (AP) - The soap opera at the ancient Knights of Malta religious order took on new drama Wednesday as its ousted leader returned to Rome on the...","filename":"data/vaneerConsumption/OustedMalteseknightreturnsindefianceofpopeswishes.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467365-1493232969-353_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448240_Ousted-Maltese-knight-returns-defiance-popes-wishes_1540269110.html","title":"Ousted Maltese knight returns in defiance of pope's wishes","title_page":"Ousted Maltese knight returns in defiance of pope's wishes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"VATICAN CITY (AP) - The soap opera at the ancient Knights of Malta religious order took on new drama Wednesday as its ousted leader returned to Rome on the eve of the election for his successor in defiance of the pope's wishes.\nFra' Matthew Festing, whom Pope Francis effectively ousted as grand master in January, is technically eligible to be re-elected during Saturday's vote. But he told fellow knights he merely wants to cast his ballot.\nIn an April 15 letter, Francis' delegate running the order, Archbishop Angelo Becciu, had specifically told Festing to stay away from Rome, saying his presence at the election \"would reopen wounds and prevent the event from taking place in an atmosphere of peace and harmony.\"\nFaithful take snapshots of Pope Francis as he arrives for his weekly general audience in St. Peter square at the Vatican, Wednesday, April 26, 2017. (AP Photo/Andrew Medichini)\nBut Festing told the order he planned to vote, and two knights told The Associated Press he was back in Rome on Wednesday.\nThe developments added new drama to the Knights of Malta saga, which erupted in December after Festing ordered his foreign minister, Albrecht von Boeselager, to resign. Boeselager's stated crime was that condoms had been distributed by the Knights of Malta's humanitarian branch in Myanmar under his watch. Church teaching forbids artificial contraception.\nThe Vatican got involved after Boeselager complained, launching what became a very public spat between Festing and Francis. While ostensibly about the internal affairs of the order, the battle laid bare the conservative criticism of Francis, given that Festing had been backed by Cardinal Raymond Burke, a leading conservative critic of the pope.\nFesting, though, lost.\nFrancis asked him to resign, ordered Boeselager to be reinstated and appointed Becciu as his envoy to help run the order until a new grand master could be elected.\nThe Vatican takeover was a raw display of papal power and put into question the Knights' fiercely guarded sovereign status. Francis added to the impression of heavy-handedness by inviting more than a dozen senior knights to a pre-vote huddle Wednesday evening at the Vatican hotel where he lives.\nThe order's leadership has recommended that the 56 knights eligible to cast ballots Saturday elect a temporary \"lieutenant\" to run the order for one year, rather than the life term of a grand master. That will give the order time to reform its constitutions to broaden the pool of eligible future grand masters. Currently, the rules limit the pool to \"professed knights\" - who take religious vows of poverty, obedience and chastity - who hail from noble lineage.\nCurrently, 12 men fit the bill, but many of them are in their 80s.\nThe Knights of Malta is an ancient lay Catholic religious order that runs hospitals and clinics around the world. It counts 3,500 members and 100,000 staff and volunteers who lend first aid in war zones, natural disasters and conflict areas; members also make regular pilgrimages bringing the sick to Catholic shrines.","url":"https://www.dailymail.co.uk/wires/ap/article-4448240/Ousted-Maltese-knight-returns-defiance-popes-wishes.html"}
