{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 18:20:01","date_modify":"2018-10-30 18:20:01","date_publish":"2016-09-14 12:33:39","description":"Included in Obama's proposal is a plan to bring in a “significantly higher” number of Syrian refugees in FY 2017 than the 11,503 who have arrived in FY 2016 as of Wednesday. The Obama administration set a goal of 10,000 this year, and has already exceeded that number with more than two weeks to go in this fiscal year. | Politics","filename":"data/vaneerConsumption/OutgoingObamaPlanstoIncreaseRefugeesbyTwentyNinePercentNextYear.json","image_url":"https://media.breitbart.com/media/2016/09/GettyImages-599454060.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_14__1540923601.html","title":"Outgoing Obama Plans to Increase Refugees by Twenty-Nine Percent Next Year","title_page":"Outgoing Obama Plans to Increase Refugees by Twenty-Nine Percent Next Year | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama tells Congress that he wants to increase the number of refugees resettled in the United States by 29 percent, to 110,000, in Fiscal Year 2017. That’s up from the approved ceiling of 85,000 for Fiscal Year 2016, and would be an increase of 25,000 refugees in one year.\nIncluded in Obama’s proposal is a plan to bring in a “significantly higher” number of Syrian refugees in FY 2017 than the 11,503 who have arrived in FY 2016 as of Wednesday. The Obama administration set a goal of 10,000 this year, and has already exceeded that number with more than two weeks to go in this fiscal year.\nIn the previous four years, only 2,300 Syrians had been resettled in the United States.\nMore than 99 percent of the Syrians resettled in the United States to date are Muslims, though more than ten percent of Syrian refugees overseas are Christians.\nObama’s plans to more than quadruple the number of Syrian refugees brought into the country last year required the rapid acceleration of the security and medical vetting process, something that critics say has likely already allowed a number of ISIS sympathizing terrorists to slip into the country under the guise of Syrian refugee.\nThose security concerns were highlighted by the arrest on Tuesday of three Syrians who entered Germany as refugees on terrorism charges, as CNN reported.\nWith two weeks left in FY 2016, 77,961 refugees have been resettled in the U.S., but if resettlement continues during the last two weeks of September at the accelerated pace of the last few months, the final FY 2016 number is likely to exceed the 85,000 ceiling.\n“Obama is irrelevant here,” Ann Corcoran, who has been writing about the issue at Refugee Resettlement Watch since 2007, tells Breitbart News.\n“Obama would be all too happy if we looked like Europe. The only surprise with the announcement for 110,000 is that he didn’t go for the whole 200,000 as he exits the White House. I expect many of his friends at the UN next week won’t be happy that he didn’t go all the way,” she says.\n“What matters now is how much funding the Republican Congress will give him,” Corcoran continues.\nRepublicans in Congress and in state legislatures around the country reacted negatively to the Obama administration determination.\n“I came in two years ago for President Obamas unconstitutional amnesty and since then and since the congresses abdicated it’s role President Obama has expanded his authority at every opportunity in this case to increase the refugee immigration without the voters consent,” Rep. Dave Brat (R-VA) tells Breitbart News.\nPresident Obama, Brat says, is “moving around Congress intentionally and allowing folks to come in to the country who have not been vetted when Isis has declared that they intend to use this program to infiltrate our country, so this should be truly stunning news but unfortunate it is just more of the same unconstitutional illegal behavior by the president of the United States.”\n“We must remain compassionate toward refugees, but we also need to make sure that we use common sense,” House Judiciary Committee Chairman Bob Goodlatte (R-VA) told Politico.\n“Unfortunately, President Obama unilaterally increases the number of refugees resettled in the United States each year and gives little thought as to how it will impact local communities.”\nSen. Jeff Sessions (R-AL), a close adviser to Republican presidential candidate Donald Trump, blasted the plan as well.\n“In addition to the very serious national security implications and the initial resettlement costs, admitting 110,000 refugees will result in an enormous long-term financial burden on the taxpayers,” Sessions told Politico.\nPolitico’s headline on the story says “Obama’s new refugee goal sets off GOP fury.”\nBut Virginia’s Brat has a different take.\n“I wish this news did ignite GOP fury,” Brat tells Breitbart News in an exclusive interview.\n“But over the past two years Congress has done little to fight back against Obama’s over reach, while at the same time our leading presidential candidate has made this the centerpiece of a campaign that is now gaining increasing momentum with the American people,” Brat adds:\nThe American people are always generous but we know that we can help 12 refugees in safe zones in their own home region for the cost of one refugee here in the United States and the welfare cost of just the federal level are now about $37,000 per person plus $26,000 per year at the state and local for education for two kids and so tell me who has run that by the voter and that is the source of citizen cynicism\n“It is on the Republicans,” Refugee Resettlement Watch’s Corcoran notes.\n“Refugees per head are very costly to permanently resettle in American towns and cities so it depends on Congress and how many tax dollars they will throw to the Dept. of State and Health and Human Services in a Continuing Resolution battle shaping up,” Corcoran says, adding:\nAlso, we expect both Senator Jeff Sessions and Rep. Bob Goodlatte to hold legally required hearings within the next two weeks on Obama’s plan. Perhaps they could address alternative solutions like safe zones in the Middle East and Africa where refugees could be kept in safety and comfort close to home. Such forward thinking ideas might begin to lay the ground work for a reform effort after a new President is elected. In the meantime, the Congress should drastically cut or defund completely the program until a new President is in place.\nRepublican state legislators also criticized Obama’s plan.\n“Our capacity to absorb ever-increasing numbers of refugees amidst ever-decreasing confidence in the resettlement program itself is cause for alarm,” Tennessee State Senate Majority Leader Mark Norris (R-Collierville) tells Breitbart News.\nNorris championed the resolution that passed the Tennessee General Assembly this year authorizing the state to sue the federal government on Tenth Amendment grounds for the continued resettlement of refugees in the Volunteer State. Tennessee has withdrawn from the federal refugee resettlement program.\n“Our humanitarian concerns must not outweigh common sense. Whether this makes any sense is in doubt,” Norris adds.\nBut the State Department appears oblivious to the well founded security, public health, and economic concerns surrounding the refugees resettled in the United States.\n“While the vast majority of Syrians would prefer to return home when the conflict ends, it is clear that some remain extremely vulnerable in their countries of asylum and would benefit from resettlement,” the 82 page document from the State Department says.\nRepublicans in Congress, reacted negatively to the Obama administration determination.\n“We must remain compassionate toward refugees, but we also need to make sure that we use common sense,” House Judiciary Committee Chairman Bob Goodlatte (R-VA) told Politico.\n“Unfortunately, President Obama unilaterally increases the number of refugees resettled in the United States each year and gives little thought as to how it will impact local communities.”\nSen. Jeff Sessions (R-AL), a close adviser to Republican presidential candidate Donald Trump, blasted the plan as well.\n“In addition to the very serious national security implications and the initial resettlement costs, admitting 110,000 refugees will result in an enormous long-term financial burden on the taxpayers,” Sessions told Politico.\nThe Obama administration’s plan to increase the number of refugees resettled in the United States by 25,000 in FY 2017, which begins on October 1, comes as Congress has yet again failed to prepare a budget under the traditional “regular order” of building the next year’s budget up through a series of committee hearings throughout the year.\nInstead, Congress continues to operate in the crisis-driven “continuing resolution” mode, in which the previous year’s budget is simply extended into the following fiscal year for a number of months until a final budget can be agreed upon.\nUnder such an approach, Congress accepts an incremental approach to increasing budgets each year and fails to exercise its constitutional authority to determine the federal government’s spending.\n“Congress needs to remember why the statutory consultation provisions of the Refugee Act of 1980were included,” an attorney familiar with the refugee resettlement program tells Breitbart News:\nThe bill that passed was a compromise between the competing interests of control as between Congress and the President. Flexibility in refugee admission policies was granted in exchange for consultation with Congress as it was understood and explained during various committee hearings. To this end, during deliberation of what became the 1980 law, Congress was assured by the Attorney General that they retained the power to “block” a President’s refugee resettlement plan with what amounted to an “implicit veto power.” Even the State Department agreed to the compromise of including a statutory consultation. Congress’ understanding of their retained power was stated clearly in the several committee hearing reports – “The bill establishes what ‘consultation’ with Congress means, thereby exerting Congressional control over each group of refugees admitted to the United States.” Add to all of this, that Congress at that time went to great lengths to assure representatives from state and local governments that they would not be saddled with the costs of the federal government’s refugee resettlement program. This is why they authorized covering state costs for each refugee for three full years. But as with many federal programs and co-opted state governments (Republican and Democrat), Congress reneged several years after the 1980 law was passed and pushed these costs onto state and local governments in direct contradiction to the “noble” goals professed by the bill’s proponents.\nSpeaker of the House Paul Ryan (R-WI) and Senate Majority Leader Mitch McConnell (R-KY) met with President Obama on Monday to discuss the FY 2017 budget. The most likely scenario to be accomplished between now and the start of the new fiscal year on October 1 is the passage by Congress and signing by Obama of a continuing resolution that would extend last year’s budget spending rates from October 1 to December 9.","url":"https://www.breitbart.com/politics/2016/09/14/outgoing-obama-plans-to-increase-refugees-by-twenty-nine-percent-next-year/"}
