{"authors":[],"date_download":"2018-10-22 21:41:46","date_modify":"2018-10-22 21:41:46","date_publish":"2014-05-07 22:02:36","description":"A team of astronomers using supercomputers has created the most realistic simulation of our universe ever.","filename":"data/vaneerConsumption/OutofThisWorldVirtualUniverseLooksLiketheRealThing.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/427581/universe_372416a7f802cfc296fdbbc2179a88d3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_out-world-virtual-universe-looks-real-thing-n99791_1540244506.html","title":"Out of This World! Virtual Universe Looks Like the Real Thing","title_page":"Out of This World! Virtual Universe Looks Like the Real Thing","title_rss":"NULL","source_domain":"nbcnews.com","text":"It doesn't attempt to recreate our universe exactly, but is limited to a cube large enough (millions of light years across) to contain all the expected features. And while you won't find the Milky Way, you might find a galaxy very much like it — as indeed the astronomers did when they looked closely. That the simulation lines up so well with the universe as we've observed is very promising.\nBut the simulation goes so deep you'd need a few different degrees to get the most of it. The invisible web of dark matter and energy tying the universe together is recreated to the best of our knowledge, and the elements that make up stars and planets can be observed forming and coalescing.\nIf astronomers wanted to know, for instance, what would happen if a certain constant were a little higher, or if early helium concentrations were a little lower, all they have to do is adjust a few settings — and then wait while the supercomputers work up a brand-new universe based on those principles.\nThe video is fascinating and beautiful, and no doubt this line of research, enabled by today's powerful supercomputers, will only improve and become more important. The paper describing the simulation was published in the May 8 issue of the journal Nature.","url":"https://www.nbcnews.com/science/science-news/out-world-virtual-universe-looks-real-thing-n99791"}
