{"authors":["Lydia Emmanouilidou","Patricia Gentile","President","North Shore Community College"],"date_download":"2018-10-23 01:00:24","date_modify":"2018-10-23 01:00:24","date_publish":"2016-11-06 00:00:00","description":"Miles from public transportation, many students at this community college didn't have a way to get to class. That is, until the school decided to partner with the ride-hailing company, Uber.","filename":"data/vaneerConsumption/OutOfOptionsThisSchoolGotUberToPickUpItsStudents.json","image_url":"https://media.npr.org/assets/img/2016/11/02/matos-pic1-toned_wide-52c3fde5efe472a4e03bed619ff929db785dac03.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ed_2016_11_06_499601212_out-of-options-this-school-got-uber-to-pick-up-its-students_1540256424.html","title":"Out Of Options, This School Got Uber To Pick Up Its Students","title_page":"Out Of Options, This School Got Uber To Pick Up Its Students : NPR Ed : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Out Of Options, This School Got Uber To Pick Up Its Students\nEnlarge this image toggle caption Lydia Emmanouilidou/WGBH Lydia Emmanouilidou/WGBH\nWhen Patricia Gentile was settling in as the new president of North Shore Community College in Massachusetts — about twenty miles north of Boston — she remembers looking out her window and seeing something strange.\n\"All of these cars rolling up, and tons of folks getting in and out,\" Gentile says, thinking about that January day a couple years ago.\n\"So I asked my assistant, 'What's going on down there?' \"\nTurns out that's where students were picked up and dropped off, but Gentile wondered why there were just so many cars.\n\"And that's how I found out that this campus was not accommodated by public transportation.\"\nThe closest option? A bus stop at a mall about four miles away. Once you arrive there, though, getting the rest of the way is up to you.\nThe campus is in a pretty isolated area, so \"not walkable or bikeable\" according to Gentile.\n\"Because we have such a significant number of middle-income and lower-income students, having public transportation makes the difference between coming to college or not.\"\nPresident Gentile is baffled by the idea that her students can get to the mall, but not to school, and she's in good company.\n\"Students really are leaving because of seemingly non-academic reasons like transportation,\" says Melinda Karp, Assistant Director of the Community College Research Center at Columbia University's Teacher's College.\n\"They're balancing work and school, they're balancing family, and they're commuters,\" but when colleges provide the kinds of support systems that can \"make life feasible,\" Karp says, students are more likely to stay in school.\nIn the end, having public transportation ... is essential for our students to be able to get here.\"\nSearching for options, Gentile first turned to the Massachusetts Bay Transportation Authority, requesting that a nearby bus route be extended to the campus. But the agency needed proof of ridership — numbers Gentile didn't have yet.\n\"We did some studies and, at one point, somebody recommended that we talk to Uber to see what could be done,\" Gentile says.\nAnd so that's what they did. Under a pilot program, students can request discounted rides from three select nearby public transit locations, including another mall, this one about five miles away from campus.\nFor students like 22-year-old Dania Matos, that mall is the closest they can get to the campus using public transportation. Having a service that bridges that five-mile gap, Matos says, has been a \"lifesaver.\"\n\"Before this program ... I was just gonna do day by day,\" she says. \"And it would've just been figuring out if I could find a friend, or taking a regular Uber which would have cost a lot more than this does.\"\nThe school will pay the first $10 of each ride. That leaves about $3 for Matos to pay out of pocket each way.\nTo cover students' costs, North Shore set aside about $40,000 in this year's budget, an amount Gentile calls a \"pretty good bargain.\"\nBut she's playing the long game. She plans to bring the data collected from the Uber pilot to the transit authority to prove there's enough demand to justify adding bus service to the campus.\n\"In the end, having public transportation ... is essential for our students to be able to get here.\"\nShe says she's also been fielding calls from other colleges, two- and four-year in New England and beyond, interested in finding out how they can go about setting up Uber partnerships of their own.","url":"https://www.npr.org/sections/ed/2016/11/06/499601212/out-of-options-this-school-got-uber-to-pick-up-its-students"}
