{"authors":["Wynton Hall"],"date_download":"2018-10-30 18:10:26","date_modify":"2018-10-30 18:10:26","date_publish":"2015-02-02 16:38:25","description":"A Super Bowl ad for Jeep Renegade SUVs sparked outrage, as \"This Land is Your Land\" played with scenes of China in the background.","filename":"data/vaneerConsumption/OutrageEruptsoverThisLandisYourLandJeepSuperBowlAd.json","image_url":"https://media.breitbart.com/media/2015/02/Jeep-Flag-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_02_02__1540923026.html","title":"Outrage Erupts over 'This Land is Your Land' Jeep Super Bowl Ad","title_page":"Outrage Erupts over 'This Land is Your Land' Jeep Super Bowl Ad | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Super Bowl ad for Jeep Renegade SUVs met a heated backlash Sunday night as outraged Americans took to social media to blast the company for flashing scenes of the Great Wall of China and other far-flung places around the globe as “This Land is Your Land” played in the background.\n“What kind of globalist bullshit is this?” wrote one YouTube commenter.\n“Who is in the advertising department?” asked another YouTube commenter. “Fire them. This is an American song. AMERICAN.”\nTwitter issued a similarly harsh rebuke.\n“I am now boycotting Jeep because of this commercial,” wrote one Twitter user.\n“I think Jeep may have shit the bed with that last commercial,” wrote another. “‘My land is…Afghanistan…’?”\nIn the beginning of the 90-second ad, the lines “from California to the New York Island/from the Redwood Forest/to the Gulf Stream waters” are interspersed with American images to match. Yet as the ad progresses, scenes from across the globe appear. “The world is a gift,” the ad concludes. “Play responsibly.”\nInterestingly, “This Land is Your Land” was written by far-left progressive Woody Guthrie in 1940 and recorded in 1944 as a sarcastic protest to “God Bless America,” reports National Public Radio (NPR). Originally, Guthrie’s song included the verse:\nThere was a big high wall there that tried to stop me. The sign was painted, said ‘Private Property.’ But on the backside, it didn’t say nothing. This land was made for you and me.\nJeep, which is owned by Italian manufacturer Fiat, has yet to issue a statement about the social media reaction.","url":"https://www.breitbart.com/entertainment/2015/02/02/outrage-erupts-over-this-land-is-your-land-jeep-super-bowl-ad/"}
