{"authors":["Press Association"],"date_download":"2018-10-23 00:08:50","date_modify":"2018-10-23 00:08:50","date_publish":"2016-01-29 12:49:21","description":"Furious campaigners have vowed to fight the \"outrageous\" decision to keep a statue of British colonialist Cecil Rhodes on the front of an Oxford University c...","filename":"data/vaneerConsumption/outrageoverdecisiontokeepcecilrhodesstatueatoxfordcollege.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-2c8ae533-8d20-4936-9d0a-d40d76b41a6c-4PuZeKVXE7cd9005b2c8769fa656-383_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422232_Cecil-Rhodes-statue-remain-Oxford-college_1540253330.html","title":"'outrage' over decision to keep cecil rhodes statue at oxford college","title_page":"'outrage' over decision to keep cecil rhodes statue at oxford college | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Outrage' over decision to keep Cecil Rhodes statue at Oxford college\nFurious campaigners have vowed to fight the \"outrageous\" decision to keep a statue of British colonialist Cecil Rhodes on the front of an Oxford University college.\nThe governing body of Oriel College said it decided after \"careful consideration\" to keep the statue despite a campaign by student activists who claimed it represented racism and oppression.\nThe college said it received an \"enormous amount of input\" when it consulted on whether to keep the statue, including a petition by campaign group Rhodes Must Fall, signed by more than 2,000 people.\nOriel College, Oxford\nThe Daily Telegraph reported that donors had threatened to withdraw gifts and bequests worth more than £100 million if it was removed.\nBut an Oriel spokesman insisted the financial implications were \"not even a major factor\" in the decision.\nIn a statement, the group Rhodes Must Fall said: \"This recent move is outrageous, dishonest, and cynical.\n\"This is not over. We will be redoubling our efforts and meeting over the weekend to discuss our next actions.\" The group added: \"The struggle continues.\"\nNtokozo Qwabe, Rhodes Scholar who has campaigned to remove the statue, wrote on his Facebook page: \"The decision by Oriel College to unilaterally reverse its public commitments on Rhodes, without any consultation, basically reminds us that black lives are cheap at Oxford.\n\"Oriel has basically said: f*** all the black people. Who cares about black lives & the concerns of BME (black and minority ethnic) Oxford students anyways?\"\nA spokesman for the college said: \"The overwhelming message we have received has been in support of the statue remaining in place, for a variety of reasons.\n\"The college's governing body has decided that the statue should remain in place and that the college will seek to provide a clear historical context to explain why it is there.\"\nRhodes served as prime minister of the British Empire's Cape Colony, including South Africa, in the early 1890s and has been linked to apartheid-style policies.\nA Rhodes legacy fund provides scholarships for overseas students, but some students argue the statue should be taken down because he was a racist.\nThe Daily Telegraph said £1.5m in donations had already been cancelled, and the college feared more wealthy donors could walk.\nCollege leaders admitted the controversy surrounding the statue had shone a light on the low numbers of black and ethnic minority students admitted, and the issue of discrimination on campus.\nA spokesman said: \"The campaign to remove Oriel's statue of Rhodes has highlighted other challenges in relation to the experience and representation of black and minority ethnic students and staff at Oxford.\n\"Oriel takes these very seriously and, as previously announced, is taking substantive steps to address them.\"\nAnd he said the statue was \"an important reminder of the complexity of history and of the legacies of colonialism still felt today\".\nOriel College will seek expert opinion on how to give context to the statue and a nearby plaque to Rhodes, which they will also keep in place.\nRhodes was a student at Oxford and a member of Oriel College in the 1870s. He left money to the college on his death in 1902.\nScholarships in his name have so far been awarded to more than 8,000 overseas students.\nThe college has distanced itself from his views, saying in a statement last month: \"Rhodes was also a 19th-century colonialist whose values and world view stand in absolute contrast to the ethos of the scholarship programme today, and to the values of a modern university.\"\nThe decision comes after the University of Cape Town last year decided to remove a similar statue of the man, following a student protest.\nA spokesman for Oriel College told the Press Association: \"The financial implications were absolutely not the overriding consideration - not even a major factor in the decision that was made.\"\nAsked whether Oxford graduate David Cameron backed Oriel's decision, a Downing Street spokesman said: \"I think he would welcome the fact that this was the university making a decision.","url":"https://www.dailymail.co.uk/wires/pa/article-3422232/Cecil-Rhodes-statue-remain-Oxford-college.html"}
