{"authors":["William Bigelow"],"date_download":"2018-10-30 21:20:40","date_modify":"2018-10-30 21:20:40","date_publish":"2015-07-16 15:44:04","description":"The Internet sears with outrage over ESPN’s bestowal of the Arthur Ashe Courage Award on the Athlete Formerly Known as Bruce Jenner rather than giving it to Lauren Hill","filename":"data/vaneerConsumption/OutrageoverESPNGivingBruceJennerCourageAwardoverLaurenHill.json","image_url":"https://media.breitbart.com/media/2015/04/ap_lauren-hill_ap-photo-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_07_16__1540934440.html","title":"Outrage over ESPN Giving Bruce Jenner 'Courage' Award over Lauren Hill","title_page":"Outrage over ESPN Giving Bruce Jenner 'Courage' Award over Lauren Hill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Internet sears with outrage over ESPN’s bestowal of the Arthur Ashe Courage Award on the Athlete Formerly Known as Bruce Jenner rather than giving it to Lauren Hill, the utterly courageous 19-year-old woman who battled inoperable brain cancer while playing basketball for Mount St. Joseph’s.\nBefore she died in April, Hill had achieved a dream of her own, scoring the first and last basket when Mount St. Joseph’s defeated Hiram College 66-55 on November 2014. The courageous young woman, knowing she wouldn’t survive, decided to use her notoriety to raise money for cancer research; by last November, she had raised $1 million for DIPC Cancer Research.\nCincinnati Bengals defensive tackle Devon Still, whose 4-year-old daughter was battling cancer, tweeted:\nCongrats Lauren Hill on raising 1 million dollars for DIPG Cancer research! Using your battle to raise awareness n money is an inspiration! — Devon Still (@Dev_Still71) December 30, 2014\nAccording to ESPN, Hill’s courage was superseded by Jenner’s decision to become a woman. ESPN announced on June 1 that it was honoring Jenner with the Ashe Award, and only belatedly announced on July 14 that it would offer a small tribute to Hill at the ESPY Awards. A producer for the program admitted that she and her staff, rather than any wider voting process, selected the former Olympian for the honor. On Wednesday, the resultant fury was exhibited on Twitter:\nHow the hell does Bruce/Caitlyn Jenner get the Arthur Ashe Courage Award over Lauren Hill?! Our society is a JOKE. — Dylan Loberg (@dloberg22) July 16, 2015\nTouching tribute to Lauren Hill. Makes the Caitlyn Courage “ratings grab” look even more pathetic !! — John Dennis (@JohnDennisWEEI) July 16, 2015\nThe Los Angeles Times reported that a possible reason for the honoring of Jenner derived from a deal between ABC and Jenner. ABC televised the ESPYs and Jenner had granted an exclusive interview to ABC’s Diane Sawyer in April regarding the gender transition Jenner was undergoing. The interview grabbed huge ratings.","url":"https://www.breitbart.com/sports/2015/07/16/outrage-over-espn-giving-bruce-jenner-courage-award-over-lauren-hill/"}
