{"authors":["Breitbart London"],"date_download":"2018-10-30 20:44:15","date_modify":"2018-10-30 20:44:15","date_publish":"2017-04-10 11:38:46","description":"THE HAGUE, Netherlands (AP) — The eurozone's top official said \"fatigue may have played a role\" for comments he made last month that unleashed a storm of | London / Europe","filename":"data/vaneerConsumption/OutrageAfterEurozoneTopOfficialAccusesSouthernEuropeNationsofWastingMoneyonLiquorandWomen.json","image_url":"https://media.breitbart.com/media/2016/06/Eurogroup-President-and-Dutch-Finance-Minister-Jeroen-Dijsselbloem-rings-the-bell-prior-to-a-meeting-of-Eurogroup-ministers-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_10__1540932255.html","title":"Outrage After Eurozone Top Official Accuses Southern Europe Nations of Wasting Money on 'Liquor and Women'","title_page":"Outrage After Eurozone Top Official Accuses Southern Europe Nations of Wasting Money on 'Liquor and Women'","title_rss":"NULL","source_domain":"breitbart.com","text":"THE HAGUE, Netherlands (AP) — The eurozone’s top official said “fatigue may have played a role” for comments he made last month that unleashed a storm of criticism across southern Europe.\nIn an interview with Dutch newspaper De Volkskrant, published Monday, Jeroen Dijsselbloem said the scale of the backlash made it look like “I committed a war crime.”\nDijsselbloem, who chairs meetings of the eurozone’s 19 finance ministers, has been under fire from countries in southern Europe over an interview last month with German paper Frankfurter Allgemeine Zeitung in which he said: “I cannot spend all my money on liquor and women and then ask for your support.”\nThe comment stoked widespread criticism across southern Europe as it was seen as a direct reference to them requiring state bailouts from primarily richer countries in northern Europe. Many politicians, including Portuguese Prime Minister Antonio Costa, called for Dijsselbloem’s resignation.\nDijsselbloem said tiredness may have played a part in his comments, which came three days after Dutch national elections in which his Labor Party slumped to a large loss of seats in Parliament’s lower house.\nDijsselbloem added that his comment “was my way of expressing that solidarity is not charity,” but denied that it was aimed specifically at southern European nations.\n“The anger at the interview is anger at eight years of crisis policy,” Dijsselbloem said.\nThe Dutch finance minister’s term as president of the Eurogroup ends next January but Dijsselbloem’s leadership could end earlier if, as seems likely, his Labor Party is not included in the next ruling Dutch coalition.\nDijsselbloem said that whether he leads the eurozone or somebody else, the problems facing Europe’s single currency will remain.\nHe said the tough austerity measures “are there for problems that still exist: Weak banks, high debt, uncompetitive businesses. Then you can say: ‘We’ve had enough of it, get rid of Dijsselbloem,’ but the next day everything remains the same.”","url":"https://www.breitbart.com/europe/2017/04/10/outrage-eurozone-top-official-accuses-southern-europe-nations-wasting-money-liquor-women/"}
