{"authors":[],"date_download":"2018-10-30 20:50:08","date_modify":"2018-10-30 20:50:08","date_publish":"2018-09-17 00:00:00","description":"AJC columnist Bill Torpy on how rich, poor, black, white, old and young Atlantans have united in opposition to the Atlanta Gulch development proposal.","filename":"data/vaneerConsumption/OutrageoverAtlantaGulchdealcrossesallboundaries.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/17/Videos/4485245.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-gulc_b0ed322804f96c34caa328d35bd6bf94__1540932608.html","title":"Outrage over Atlanta Gulch deal crosses all boundaries","title_page":"Outrage over Atlanta Gulch deal crosses all boundaries | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"A familiar but amplified voice boomed through Atlanta’s City Hall atrium as I walked toward City Council chambers on Monday.\n“Don’t sell the city down the drain!” it bellowed.\nEntering the chambers, I could see Derrick Boazman, a former councilman/rabble rouser at the podium. Boazman, first up for citizen comment, was setting the stage for a three-hour public harangue.\nIt was a grand spectacle of noisy democracy, in which dozens of folks ambled up to the mic and voiced concerns about issues dear to them, wrapping their arguments around the monstrosity that is the Gulch Giveaway. Say what you will about the $1.75 billion (with a B!) tax subsidy, opposition to the plan has united Atlantans like few other controversies.\nFrom Bankhead to Buckhead, rich, poor, black, white, old, young, educated, clueless — they came to tell council members why the Gulch deal is a real stinkeroo.\nThe Gulch is that 40-acre hole downtown where trains run, homeless people sleep and Falcons fans party. In the past year, the city, the state, Norfolk Southern and others have negotiated with a Los Angeles firm called CIM Group for the developer to build a massive, $5 billion Oz-like mini-city in the shadow of our tax-subsidized sports stadiums.\nBut that will only happen if the city and state agree to give up to $1.75 billion (again, with a B!) in future sales and property taxes to build that gleaming development and turn it all over, including the new streets, to CIM. Forget Karl Marx, corporate socialism is the thing.\nMayor Keisha Lance Bottoms, taking the Gulch torch from her predecessor, Hizzoner, recently waged a desperate attempt to win over eight willing council members. She called out members at a committee meeting, on a radio show and in phone conversations. She even got a legal opinion to get Councilman Ivory Young to vote from his hospital bed. Finally, the mayor was forced to delay the vote Monday morning after not garnering the magic eight.\nBut the meeting was set and the public came to speak. So they did.\nThe concerns were many: Gentrification is pushing out poor folks and the Gulch money could be put to better use. Crime is rampant but there is not enough money for cops. Schools are hurting and … You get the drift.\nA line of ladies belonging to Concerned Citizens United — said to be “5,000 strong” — told tales of terror on the streets of Buckhead in the form of carjackings, robberies, burglaries and theft.\nThe Gulch in Atlanta on Sept. 27, 2017. The site is a possible location for Amazon’s second headquarters should the company choose Atlanta as the host city. (CASEY SYKES / AJC FILE)\nOne speaker ticked off the crimes occurring and displayed an alarm she wears around her neck in anticipation of the inevitable attack.\nAnother resident, Ann Walsh, told of being in the Buckhead Target last month when a group of teens rolled up in electric scooters and ran through the aisles shouting, “What the (bleep) are ya gonna do about it?”\n“The city is failing its citizens in a spectacular fashion,” Walsh told the council. “This mayor should be ashamed of herself for trying to shove a $2 billion boondoggle Gulch deal down our collective throats rather than addressing public safety, crime and APD (manpower) deficiencies.”\n(Crime is anecdotal and psychological. If you are the one getting robbed, crime is out of control. Citywide, the crime rate is flat from last year. But in Buckhead’s Zone 2, it’s up 14 percent.)\nWalsh challenged the council by using the hooligans’ words, “What the F are you going to do about it?”\nA rendering from developer CIM Group shows a new plaza within the redeveloped Gulch. (CIM GROUP)\nFollowing Walsh was Collette Haywood, a resident from the impoverished Vine City neighborhood just west of the new Mercedes Benz Stadium.\n“I want to speak to the people from Buckhead,” she said. “You say you have 5,000 (members). Now you have 5,001.”\nHaywood said she and her daughter’s family are taking in several members of a family who lost their apartment because of gentrification.\nShe spoke of “giving away so many tax incentives to millionaires” at the expense of schools and parks. She pointed to the crowd in the chambers and referenced the women’s marches that sprang up after Donald Trump was elected president.\n“If I were you, I’d be frightened,” she told the council. “You have a group of angry moms and grandmothers paying attention.”\nAtlanta City Council members, including Andrea Boone (right) and Joyce Sheperd, attended a recent committee work session to study the Gulch deal. BOB ANDRES / BANDRES@AJC.COM\nJim Martin, an engineer and leader of Neighborhood Planning Unit D in northwest Atlanta, argued that subsidized development will siphon off businesses from elsewhere in the city at the expense of taxpayers.\nMartin noted Atlanta’s leaders frequent sense of urgency when trying to get deals done: “I am fortunate to live in a city where once-in-a-lifetime opportunities come along every three to five years.”\nFormer Invest Atlanta board member Julian Bene, a frequent critic of such deals, called this latest one “shameful” and the epitome of raw greed. He said this is not the time to negotiate for a better deal. It’s time to run away.\nLike previous speakers, Bene said Atlanta is hot and development is flowing to the city anyway. He asked, why give away future billions (with a B!) in taxes for development that’s already coming?\n“This scheme does not bring any additional jobs other than the posse of lawyers you have out there,” he said.\nAtlanta City Councilman Amir Farokhi is one of eight co-sponsors of legislation seeking an independent review of the deal terms for the redevelopment of downtown’s Gulch. BOB ANDRES / BANDRES@AJC.COM\nDeborah Scott, a former city worker now heading the community group Georgia STAND-UP, said the City Council, with seven new members, has finally grown a spine.\n“Guess what? The Nod Squad is over,” she said, referring to a council that was long considered compliant to Kasim Reed’s wishes. “We are proud of you for standing up.”\n“Take care of your people,” she added. “You are public servants, not servants of developers.”\nLt. Stephen Zygaj, leader of the Atlanta Police Department’s union, mentioned the Gulch and other big-ticket tax giveaways, such as the Hawks’ arena and the Falcons’ sports dome.\nHe spoke of the department’s chronic manpower shortage and low starting pay, adding that he has a strategy to help the city boost recruitment for the department.\n“Tell ‘em you’re eligible for food stamps.”","url":"https://www.ajc.com/news/local/torpy-large-gulch-giveaway-wonder-equal-opportunity-outrage/IfZas35mGe4eGbAhgBY4KJ/"}
