{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 18:31:44","date_modify":"2018-10-30 18:31:44","date_publish":"2018-06-17 09:06:43","description":"A thousand Muslims in the southern French city of Nice took to the street to pray on Friday following the end of the Islamic month of Ramadan, in defiance of the country's laws.","filename":"data/vaneerConsumption/OutrageasaThousandMuslimsPrayinFrenchStreetFollowingEndofRamadan.json","image_url":"https://media.breitbart.com/media/2018/06/estrosi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_17__1540924304.html","title":"Outrage as a Thousand Muslims Pray in French Street Following End of Ramadan","title_page":"Outrage as a Thousand Muslims Pray in French Street Following End of Ramadan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A thousand Muslims in the southern French city of Nice took to the street to pray on Friday following the end of the Islamic month of Ramadan, in defiance of the country’s laws.\nThe open-air prayer, which took place at around 6 a.m. at the Ariane quarter of Nice, was condemned by Mayor Christian Estrosi of the conservative Republicans who took to Twitter to post a picture of the incident.\nJe condamne avec la plus grande fermeté les prières de rue qui sont organisées à l’Ariane depuis 6h ce matin. Les lois de la République doivent être respectées partout. pic.twitter.com/fxwCgF5T5Z — Christian Estrosi (@cestrosi) June 15, 2018\nIn two separate posts, Mayor Estrosi slammed the street prayer, saying: “I condemn with the utmost firmness the street prayers which have been held at the Ariane since 6 a.m. this morning. The laws of the Republic must be respected everywhere.”\nEstrosi noted that the group had used loudspeakers to attract worshipers to the area and said: “Even if # AidElFitr is an important moment for Muslims, nothing can justify street prayers and thus disturb public order.”\nBreitbart London spoke to Philippe Vardon, vice-president of the Provence-Alpes-Côte d’Azur branch of the Rassemblement National (RN) led by former presidential candidate Marine Le Pen, who slammed both the worshippers and Mayor Estrosi who he said constantly works with the Union des Organisations Islamiques de France (UOIF), who he claimed were behind the incident.\n“Since 10 years ago, when he was elected, Christian Estrosi has played a dangerous game with the Union des Organisations Islamiques de France (UOIF) which is the Muslim Brotherhood’s representation in France,” Vardon said.\n“Expecting votes from the Muslim community, he gave this group some places, owned by the town, for their mosques, and even directly gave public money to their youth association!” he added.\n“Estrosi is just losing control,” he said. “Estrosi thinks he controls them but it looks like it could be the opposite.”\nEarlier this year Estrosi lost a court battle after he raised concerns about the foreign funding of the En-Nour mosque in the city back in January of 2017, claiming that Saudi money was flowing into the mosque. In May of this year, Estrosi’s case was thrown out by the prosecutor, who said no illegal acts having taken place.\nStreet prayer protest https://t.co/LsPaLbHp0I — Breitbart London (@BreitbartLondon) March 24, 2017\nStreet prayers have become a major issue in various areas of France as Muslims demand more space to conduct their prayers. In the Paris suburb of Clichy, local Muslims were kicked out of a building they had illegally made into a mosque and prayed on the street each Friday for months in protest of the eviction.\nIn the city of Orléans in April of this year, police were forced to address continued street prayers outside of the Ibn-Badis Mosque when angry residents of the area complained to the city government with the city’s deputy mayor promising to post officers in the area to stop the practice.","url":"https://www.breitbart.com/europe/2018/06/17/outrage-thousand-muslims-pray-french-street-ramadan/"}
