{"authors":["Peter Over"],"date_download":"2018-10-22 21:43:40","date_modify":"2018-10-22 21:43:40","date_publish":"2014-08-22 00:00:00","description":"A U.S. Senate seat is up for grabs in Iowa, and the GOP has opened 11 field offices statewide. But there's also a new team working the state, the Virginia-based group Americans for Prosperity.","filename":"data/vaneerConsumption/OutsideGroupMirrorsSuccessfulStrategiesOfPoliticalParties.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2014_08_22_342354175_outside-group-mirrors-successful-strategies-of-political-parties_1540244620.html","title":"Outside Group Mirrors Successful Strategies Of Political Parties","title_page":"Outside Group Mirrors Successful Strategies Of Political Parties : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Outside Group Mirrors Successful Strategies Of Political Parties\nThis is a big political year in Iowa. A U.S. Senate seat is up for grabs, and the Republican Party has opened 11 field offices statewide. But there's also a new team working the state — the Virginia-based group Americans for Prosperity.\nAlong with other nonprofit groups affiliated with libertarian billionaires David and Charles Koch, AFP is campaigning against the Iowa Democrats' Senate candidate, Rep. Bruce Braley.\nIt looks a lot like what a political party would do.\nAmericans for Prosperity made its reputation in 2010 and 2012 as it aired thousands of TV ads attacking Democratic candidates.\nThis election, AFP is adding a new element by mobilizing the grass roots: It has paid staff at work in 33 states.\nAt this month's state fair in Des Moines, AFP Iowa was drumming up support by offering sweepstakes prizes — a television and four iPads, said state deputy director Drew Klein. AFP added the entrants' names to its database.\nKlein, an Iowa native, said the goal is to get Iowans engaged. AFP calls on members to lobby state lawmakers when the Legislature is in session. He said that now, as the election season heats up, \"Those are also the people that are helping us knock on doors and make phone calls across the state right now.\"\nIf that sounds like what a political party does — well, it is. AFP Iowa has been building its grass-roots network for more than a year. It now has six field offices.\nBut AFP is not a political party. It's a 501(c)(4) social welfare organization, limited by federal tax law in its ability to engage in electoral politics.\nKlein has a ready answer when people ask which candidates his group supports: \"We're a nonpartisan organization. We don't have a dog in that fight. What we do want to make sure that we do is, we want to hold people accountable for the things that they've done. And so in that sense, we're certainly happy to highlight Congressman Braley's record.\"\nIn February, AFP Iowa set out to visit all 99 counties in what it called the Big Government Braley tour.\nThen came the waves of TV ads, beginning in January and never letting up. Most came from national AFP, others from Freedom Partners Chamber of Commerce and Concerned Veterans for America. Those groups too are in the Koch network.\nAt the Republican victory office in Urbandale, Iowa, Jeff Patch emphasizes the distance between AFP and the party.\n\"That is completely separate from what we're doing,\" he said. \"We think it can complement our efforts, but we're not able to coordinate with them, and I think they're a savvy enough group that they know what they're doing.\"\nAnd savvy enough to stay on TV this summer, when the state party has been toiling to refill its depleted bank account.\nBraley's allies are hitting back. Senate Majority PAC, the biggest spender, runs ads tying Republican candidate Joni Ernst to the Koch brothers.\nBut there's one big difference between Senate Majority PAC and AFP. Senate Majority PAC is a superPAC, and superPACs must disclose their donors. AFP, as a social welfare organization, does not have to reveal its donors' names. Nor do Concerned Veterans, also a social welfare group; Freedom Partners, a tax-exempt business association; or any of the other Koch-affiliated groups.\nTim Phillips, president of national Americans for Prosperity, says it differs from a political party in that it pushes issues rather than candidates. On the other hand, he says, they are similar in that \"we seek to build a long-term infrastructure, with full-time staff, with strong local knowledge, that goes out and recruits volunteer activists from all walks of life, to help deliver our message and set the tone in a community or in the state.\"\nElection law professor Daniel Tokaji at Ohio State University co-authored a book, The New Soft Money, about the rise of nonparty groups.\nTokaji recalls his conversations with political consultants: \"The overriding theme was that the state and local parties are just not the important players that they used to be in federal elections. On some occasions, we got laughs or chuckles when we even mentioned state or local parties.\"\nHe says the outside groups have begun doing what state parties used to do — especially the TV advertising.\nThe Koch network is going even further in Iowa and some other states as it organizes its own legions of activists.","url":"https://www.npr.org/sections/itsallpolitics/2014/08/22/342354175/outside-group-mirrors-successful-strategies-of-political-parties"}
