{"authors":["Associated Press"],"date_download":"2018-10-22 23:15:53","date_modify":"2018-10-22 23:15:53","date_publish":"2016-01-11 05:12:25","description":"WASHINGTON (AP) — Alex Ovechkin reached a career milestone at a rapid pace and in signature fashion. Ovechkin scored his 500th and 501st goals to become the ...","filename":"data/vaneerConsumption/OvechkinscoresNos500and501CapsroutSenators.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:dd795b55a1ab4cdfadc2c5f083e1df37-48qEJGFphM8d437f0aaf9209fb70-860_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393304_Ovechkin-scores-500th-501st-goals-Caps-rout-Senators_1540250153.html","title":"Ovechkin scores Nos. 500 and 501, Caps rout Senators","title_page":"Ovechkin scores Nos. 500 and 501, Caps rout Senators | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ovechkin scores Nos. 500 and 501, Caps rout Senators\nWASHINGTON (AP) — Alex Ovechkin reached a career milestone at a rapid pace and in signature fashion.\nOvechkin scored his 500th and 501st goals to become the 43rd NHL player to reach the mark and the Washington Capitals beat the Ottawa Senators 7-1 on Sunday night.\nThe landmark score was vintage Ovechkin. Posted up just beyond the left hashes during a power play, he fielded a feed from Jason Chimera and then whizzed a shot past the head of goalie Andrew Hammond just under the crossbar for a 5-1 lead.\nWashington Capitals left wing Alex Ovechkin (8), of Russia, acknowledges the fans in celebration as he comes back out of the box to a standing ovation after Ovechkin scored his 500th career NHL goal during the second period of a hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nThe Washington bench cleared and teammates mobbed Ovechkin. He got an extended standing ovation and took a saluting skate around the rink, acknowledging the cheering crowd that included his parents. He later drew another roar while waving to fans from the bench.\n\"It was a special moment, in front of fans ... my teammates, my parents,\" Ovechkin said. \"It's huge. It's pretty cool. It's a history moment.\"\nDuring his 11 NHL seasons, the Russian winger has earned a spirited reputation for celebrating goals by him and his teammates. This time, the Washington players were eager to pay tribute to him.\n\"As a player sitting on the bench, I got goosebumps,\" Nicklas Backstrom said. \"It's an amazing feeling. That came up naturally for us to celebrate with him. It's a big moment for him and the city of Washington.\"\nAt 801 games, the Russian winger is the fifth-fastest player to 500 goals, trailing only Hall of Famers Wayne Gretzky (575 games), Mario Lemieux (605), Mike Bossy (647) and Brett Hull (693). The 30-year-old Ovechkin has 26 goals this season, including five over his past three games, and is the NHL leader in career goals by a Russian-born player.\n\"I think when one person has success, it reflects on everybody,\" Capitals coach Barry Trotz said. \"It was a moment that was a great for the team to share. I think we all shared that moment.\"\nOvechkin added No. 501 midway through third, beating a defender with a sweeping deke at the top of the zone before smacking a shot past Hammond for the 7-1 advantage.\nOvechkin was the first overall pick in the 2004 draft by Washington. He's been named an All-Star in each of his 11 seasons and was voted a captain for this year's All-Star game. He's won three straight Richard Trophies as the league's leading goal scorer and five overall. He's also won three Hart Trophies as league MVP.\nWashington has won four straight overall and 10 consecutive home games.\nJustin Williams, T.J. Oshie, Zach Sill, Dmitry Orlov and Tom Wilson also scored for Washington. Chimera and Nicklas Backstrom each had three assists, and Philipp Grubauer made 32 saves.\nMike Hoffman had Ottawa's lone goal, and Hammond stopped 29 of 36 shots.\nWilliams put Washington on the board 8:07 into the first, and Oshie scored on a power play later in the period.\nHoffman cut the deficit to 2-1 early in the second period, but Sill, Orlov and Ovechkin scored later in the second and then Wilson and Ovechkin had goals in the third.\nOttawa coach Dave Cameron was ready for the Senators to put this one in the past.\n\"They have to have the ability to let it go and not beat themselves up over it,\" Cameron said. \"Can they? Well, that's an individual thing.\"\nIt's a different task for Ovechkin and the Capitals. This was a historic night, and Ovechkin saw this as something he and the Capitals accomplished together.\n\"It is really hard to score in this league right now, system-wise,\" Ovechkin said. \"Without my teammates' help, without the system, how we play, it is very hard to do.\"\nNOTES: Trotz said before the game that injured defensemen John Carlson and Brooks Orpik, both on injured reserve, might skate at the team's next practice on Tuesday. ... Michael Latta was a scratch for Washington with an upper-body injury. ... Ottawa goalie Craig Anderson did not play but in his next game, he'll try for his 200th career victory. ... Hoffman's second-period goal was the 50th in his career.\nThe Washington Capitals left wing Alex Ovechkin, (8), of Russia, leaps in the air in celebration after scoring his 500th career NHL goal during the second period of a hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nThe Washington Capitals swarm the ice around left wing Alex Ovechkin, of Russia, center, in celebration after Ovechkin scored his 500th career NHL goal during the second period of a hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nThe Washington Capitals swarm the ice around left wing Alex Ovechkin, of Russia, in celebration after Ovechkin scored his 500th career NHL goal during the second period of a hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nOttawa Senators goalie Andrew Hammond (30) saves the puck from going in the goal on a play by Washington Capitals left wing Alex Ovechkin (8), of Russia, during the second period of a NHL hockey game in at the Verizon Center in Washington, Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nWashington Capitals left wing Alex Ovechkin (8) follows through as he scores his 500th career goal during the second period of a NHL hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)","url":"https://www.dailymail.co.uk/wires/ap/article-3393304/Ovechkin-scores-500th-501st-goals-Caps-rout-Senators.html"}
