{"authors":["Associated Press"],"date_download":"2018-10-23 00:00:31","date_modify":"2018-10-23 00:00:31","date_publish":"2016-01-11 08:06:23","description":"WASHINGTON (AP) — Washington's Alex Ovechkin became the 43rd NHL player to reach the milestone of 500 career goals, as he netted twice in the Capitals' 7-1 r...","filename":"data/vaneerConsumption/Ovechkinreaches500goalmilestoneasCapitalsroutOttawa.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:0486ec58f6c6464ebb2bddb595cdc78e-56CX32zFKLb7123928b84cc32974-627_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393518_Ovechkin-reaches-500-goal-milestone-Capitals-rout-Ottawa_1540252831.html","title":"Ovechkin reaches 500 goal milestone as Capitals rout Ottawa","title_page":"Ovechkin reaches 500 goal milestone as Capitals rout Ottawa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ovechkin reaches 500 goal milestone as Capitals rout Ottawa\nWASHINGTON (AP) — Washington's Alex Ovechkin became the 43rd NHL player to reach the milestone of 500 career goals, as he netted twice in the Capitals' 7-1 rout of Ottawa on Sunday.\nThe Russian was mobbed by his teammates, and he got a standing ovation as he skated around the rink, acknowledging the cheers from the crowd, which included his parents.\n\"It was a special moment, in front of fans ... my teammates, my parents,\" Ovechkin said. \"It's huge. It's pretty cool. It's a history moment.\"\nWashington Capitals left wing Alex Ovechkin (8) follows through as he scores his 500th career goal during the second period of a NHL hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nThe Capitals moved a whopping 18 points clear in the Metropolitan Division, ahead of a group of six teams separated by just six points, including New Jersey, which improved its standing by beating Minnesota.\nChicago moved within four points of the Central Division lead by defeating Colorado and notching a seventh straight win.\nOvechkin reached the 500 mark in vintage fashion, scoring from just beyond the left hash marks during a second-period power play to give the Capitals a 5-1 lead.\nAt 801 games, the Russian winger is the fifth-fastest player to 500 goals, trailing only Hall of Famers Wayne Gretzky (575 games), Mario Lemieux (605), Mike Bossy (647) and Brett Hull (693). The 30-year-old Ovechkin has 26 goals this season, including five over his past three games, and is the NHL leader in career goals by a Russian-born player.\nJustin Williams, T.J. Oshie, Zach Sill, Dmitry Orlov and Tom Wilson also scored for Washington, which has won 10 successive home games.\nMike Hoffman had Ottawa's lone goal.\nChicago's Patrick Kane and Marian Hossa each scored two goals to lead the Blackhawks past Colorado 6-3.\nJonathan Toews had a goal and two assists and Brandon Mashinter scored his second career goal for the Blackhawks, who have won 18 of 23 home games in regulation time.\nMatt Duchene had two goals and an assist, and Nathan McKinnon also scored for Colorado.\nNew Jersey's Jon Merrill put the Devils ahead in the third period with his first goal of the season and the visitors hung on to beat Minnesota 2-1.\nAdam Henrique scored for New Jersey 1:21 into the third period, but Minnesota's Zach Parise tied it up less than 2 minutes later. That score was Parise's first against his former team.\nMerrill broke the tie 6:26 into the third and goaltender Corey Schneider made 10 saves in the final period.\nFlorida pushed its winning streak out to a franchise record 12 games by winning 2-1 at Edmonton, with Jaromir Jagr and Jonathan Huberdeau scoring in the first period.\nDetroit notched a fifth straight win as Riley Sheahan scored with 3:44 remaining to give the Red Wings a 2-1 victory against Anaheim.\nBuffalo ended a six-game losing sequence thanks to Sam Reinhart's first career hat trick in a 4-2 win at Winnipeg.\nThe Washington Capitals left wing Alex Ovechkin, (8), of Russia, leaps in the air in celebration after scoring his 500th career NHL goal during the second period of a hockey game against the Ottawa Senators in Washington, D.C., Sunday, Jan. 10, 2016. (AP Photo/Jacquelyn Martin)\nFans and players celebrate after Washington Capitals left wing Alex Ovechkin, left, of Russia, scored his 501st career goal, during the third period of an NHL hockey game in Washington on Sunday, Jan. 10, 2016. The Capitals won 7-1, with Ovechkin scoring his 500th and 501st career goals. With Ovechkin are T.J. Oshie (77), Nicklas Backstrom (19), Karl Alzner (27) and Matt Niskanen (2). (AP Photo/Jacquelyn Martin)","url":"https://www.dailymail.co.uk/wires/ap/article-3393518/Ovechkin-reaches-500-goal-milestone-Capitals-rout-Ottawa.html"}
