{"authors":[],"date_download":"2018-10-22 22:46:37","date_modify":"2018-10-22 22:46:37","date_publish":"2016-01-11 03:46:27","description":"Washington Capitals superstar Alex Ovechkin joined the NHL's 500 goal club, becoming the first Russian-born player to reach the milestone. Ovechkin's 500th N...","filename":"data/vaneerConsumption/OvechkinbecomesfirstRussiantoscore500NHLgoals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5r0-3bWLCvS3pZb5eb4fce05c5fd384a-141_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393315_Ovechkin-Russian-score-500-NHL-goals_1540248397.html","title":"Ovechkin becomes first Russian to score 500 NHL goals","title_page":"Ovechkin becomes first Russian to score 500 NHL goals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ovechkin becomes first Russian to score 500 NHL goals\nWashington Capitals superstar Alex Ovechkin joined the NHL's 500 goal club, becoming the first Russian-born player to reach the milestone.\nOvechkin's 500th NHL goal came on a powerplay against the Ottawa Senators on Sunday with 3:41 left in the second period, and he added his 501st in the third to wrap up the Capitals' 7-1 victory.\n\"It's a great feeling, obviously, to do it in front of our fans,\" Ovechkin said. \"Mom and dad are here. Celebrating. Everybody jumping. Yeah! It was a very special moment.\"\nAlex Ovechkin (No. 8) of the Washington Capitals celebrates his 500th career NHL goal in the second period against the Ottawa Senators, at the Verizon Center in Washington, DC, on January 10, 2016 ©Drew Hallowell (Getty/AFP)\nOvechkin became the 43rd player in NHL history to score 500 goals, and the fifth-fastest to reach the milestone, doing so in his 801st game.\nOvechkin's snapshot from the top of the left faceoff circle beat Ottawa goaltender Andrew Hammond on the glove side to give the Capitals a commanding 5-1 lead.\nThe 30-year-old Capitals left winger celebrated with a left fist pump and was then mobbed by his teammates who came off bench while the crowd at the Verizon Center arena gave their hero a standing ovation.\n\"I was surprised,\" Ovechkin said of his teammates' instant celebration, but added teammate Jason Chimera told him they had planned it.\n\"I'm sure everyone is going to remember that moment,\" he said. \"It's history.\"\nOnly four other players -- Wayne Gretzky in 575 games, Mario Lemieux (605), Mike Bossy (647) and Brett Hull (693) -- have reached 500 goals quicker.\nThat's caused some to wonder if Ovechkin could ever catch Gretzky as the league's all-time goal leader with 894.\nOvechkin had already notched one milestone this season, when his 484th career goal on November 19 saw him surpass Sergei Fedorov for most goals by a Russian in the NHL.\nSince entering the NHL in 2005-06, Ovechkin has posted 150 more goals and 50 more points than any other player.\nHe ranks first in the Capitals' 42-year history in goals (501), points (934), power-play goals (185), game-winning goals (85) and overtime goals (16).\nCapitals coach Barry Trotz said this week that he thought Ovechkin was more nervous about passing Fedorov than he was about reaching 500.\n\"He's going to score a lot more than 500 goals, I'm pretty sure on that,\" Trotz said.\nOvechkin has achieved numerous individual milestones but is still seeking team success as he has yet to win an Olympic medal with Russia or a Stanley Cup with his Capitals.\nWashington has lost in the Conference semi-finals two out of the past five seasons. They lost in the Conference quarter-finals in 2012-13, failed to reach the postseason in 2013-14 and were bounced in the second round last season.\nAlex Ovechkin of the Washington Capitals arrives on the red carpet before the NHL Awards, at MGM Grand Garden Arena in Las Vegas, Nevada, in June 2015 ©Bruce Bennett (Getty/AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3393315/Ovechkin-Russian-score-500-NHL-goals.html"}
