{"authors":[],"date_download":"2018-10-22 23:23:41","date_modify":"2018-10-22 23:23:41","date_publish":"2014-09-20 00:00:00","description":"Now that Scotland has voted to stay in the U.K., attention is turning to another separatist movement. Emboldened by the peaceful Scottish referendum, Catalans are planning a vote in November.","filename":"data/vaneerConsumption/OverSpainsObjectionsCataloniaPlansReferendumOnIndependence.json","image_url":"https://media.npr.org/assets/img/2014/09/19/455717190_wide-b8e526a1027b7971ca2f8034731f08650559cc86.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=349904266_1540250621.html","title":"Over Spain's Objections, Catalonia Plans Referendum On Independence","title_page":"Over Spain's Objections, Catalonia Plans Referendum On Independence : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nNow that Scotland's voted to stay in the U.K., we turn to another separatist movement in Europe. The northeast Spanish region of Catalonia plans to hold its own independence vote in November, but the Spanish government is trying to stop it. From the Catalan capital Barcelona, Lauren Frayer reports.\nLAUREN FRAYER, BYLINE: At a windswept castle overlooking Barcelona, tourists watch as Catalan troops ready their weapons.\n(SOUNDBITE OF PATRIOTIC MUSIC)\nFRAYER: The band strikes up a nationalist tune. Troops aim their cannons and muskets.\n(SOUNDBITE OF WAR REENACTMENT)\nELOI MATEO: (Speaking Catalan).\nUNIDENTIFIED MAN: (Speaking Catalan).\nMATEO: (Speaking Catalan).\nUNIDENTIFIED MAN: (Speaking Catalan).\nMATEO: (Speaking Catalan).\nUNIDENTIFIED MAN: (Speaking Catalan).\nMATEO: (Speaking Catalan).\nUNIDENTIFIED MAN: (Speaking Catalan).\nMATEO: Yeah, I don't have any ammunition. It's all...\nFRAYER: This is not a real battle, though it once was.\nMATEO: We are reenacting the Succession War.\nFRAYER: Every weekend for tourists, Eloi Mateo and his troops reenact the moment in 1714 when Catalonia lost a war with Spain. It's been 300 years, but many Catalans say they still feel occupied by a foreign power.\nMATEO: We had a language. We had laws. We had - all in Catalan, by the way. With the fall of Barcelona, we lost all we had. And we're reenacting that because we have to remember.\nFRAYER: Emboldened by Scotland's peaceful referendum, many Catalans want to do more than remember. They want to vote on independence now, too.\n(SOUNDBITE OF CHANTING)\nFRAYER: As Scotland's results became known Friday morning, Catalans began streaming down town, rallying outside their regional parliament. Joan Molina was among them.\nJOAN MOLINA: For sure, people cannot deny Catalan nation of our right of self-determination.\nFRAYER: Inside, lawmakers approved rules for a November 9 vote, which would violate the Spanish Constitution says legal expert Xavier Arbos.\nXAVIER ARBOS: The Spanish Constitution doesn't allow a referendum on self-determination. The Spanish Constitution establishes that the unity of Spain is indivisible.\nFRAYER: Spain's constitutional court is likely to strike down Catalonia's referendum plans as early as next week. The Spanish government, determined to maintain the unity of Spain, says it will do whatever it takes to enforce the constitution. And Catalan President Artur Mas says he won't back down.\nPRESIDENT ARTUR MAS: If in Madrid they think that only using the legal frameworks they can stop the political will of the maturity of the Catalan people, they are wrong. It's a big mistake.\nFRAYER: Spanish police could conceivably be ordered to seize ballot boxes or prevent voters from entering polling stations. That could lead to a direct confrontation between campaigners for Catalan independence and the Spanish authorities. For NPR News, I'm Lauren Frayer in Barcelona.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=349904266"}
