{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 20:32:17","date_modify":"2018-10-30 20:32:17","date_publish":"2016-10-18 11:00:00","description":"Since May over 700 Christians have been the subject of attacks in German asylum homes with the majority of the perpetrators being Muslim.","filename":"data/vaneerConsumption/Over700ChristiansAttackedinGermanAsylumHomesinRecentMonths.json","image_url":"https://media.breitbart.com/media/2016/10/rsz_gettyimages-509565568.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_10_18__1540931537.html","title":"Over 700 Christians Attacked in German Asylum Homes in Recent Months","title_page":"Over 700 Christians Attacked in German Asylum Homes in Recent Months","title_rss":"NULL","source_domain":"breitbart.com","text":"The charity Open Doors claims that since May over 700 Christians have been the subject of attacks in German asylum homes with the majority of the perpetrators being Muslim.\nIn most German asylum homes the vast majority of the residents come from Muslim backgrounds and the attitudes of many towards Christians, women, homosexuals, and other religious minorities have led to threats, intimidation, and violence on a large scale.\nChristian charity Open Doors, along with Action for persecuted Christians and those in Need (AVC), European Community Mission (EMG), and Central Council of Oriental Christians in Germany (ZOCD), have released a report on Monday detailing the crimes against Christians with 743 individual cases of threats or violence since May alone.\nAccording to the report, 617 — or 83 per cent — of the cases reported included multiple assaults. Almost half of victims, 314, claim they have received death threats from fellow migrants.\nIn addition, 416 said they had been physically assaulted and 44 said they had been sexually assaulted.\nAn overwhelming majority — 91 per cent — of the perpetrators of the attacks were Muslim. In a shocking 205 cases, the attackers were not only Muslims but were guards at asylum homes – individuals paid to protect the migrants in their care.\nGermany has struggled to attract vetted asylum home guards needed at this unprecedented scale, as Breitbart London reported earlier this year, often hiring unqualified migrants. In several cases, the Christians were attacked but received no protection from asylum center staff.\nOne Iranian migrant reported seeing graffiti on the wall of an asylum home which read: “It is time to cut off the heads of all Christians”.\nAll the charities involved have once again lobbied lawmakers to ensure the safety of Christians in asylum homes.\nChairman and chief executive of Open Doors Germany Markus Rode said: “Our history teaches us never again to ignore oppression and discrimination against minorities in favour of the perpetrators. Therefore, our appeal goes first to the Chancellor: act here and not let this issue be only to left the provinces.”","url":"https://www.breitbart.com/europe/2016/10/18/700-christians-attacked-german-asylum-homes/"}
