{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 01:25:09","date_modify":"2018-10-23 01:25:09","date_publish":"2016-01-29 15:16:36","description":"Joni Edelman, 41, weighs 210lbs, and her husband is in better shape - but she says that doesn't mean their sex life suffers. They are 'madly in love', she added, and the subject of weight never comes up","filename":"data/vaneerConsumption/OverweightJoniEdelmandetailsthegreatsexlifeshehaswithherthinhusband.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/16/30A2F1D600000578-0-image-a-14_1453911306037.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3419328_My-stomach-roll-never-way-good-time-210lb-woman-details-great-sex-life-husband-hit-suggestions-curves-prevent-getting-intimate_1540257909.html","title":"Overweight Joni Edelman details the great sex life she has with her thin husband","title_page":"Overweight Joni Edelman details the great sex life she has with her thin husband | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"However, she added, they are 'madly in love' and the subject of weight never comes up\nThe mother-of-five from California also noted that people seem to think she should feel 'lucky' for finding a man who isn't turned off by her weight\nShe explained that people seem to have a problem understanding that they have regular 'human sex' and get confused by the mechanics\nJoni Edelman, 41, weighs 210lbs, and her husband is in better shape - but she says that doesn't mean their sex life suffers\nOne overweight woman is tired of people assuming she doesn't have a good sex life because she is bigger than her husband, when in actuality, they totally have the hots for each other.\nJoni Edelman, 41, says that people seem to assume that she and her husband have trouble in the bedroom, or else think Joni should feel 'lucky' for having a husband who is still attracted to her even though she weighs 210lbs.\nBut in an essay for Ravishly, the mother-of-five from Central California explains that neither of those things is the case. They have a great sex life - and their difference in size isn't even a factor.\nScroll down for video\nYou tell 'em, sister! Joni Edelman said she and her 'skinny' husband have a great sex life - and it's not a fetish or something she should feel 'lucky' about\nThe questions that Joni imagines people ask in their heads are not flattering - and not relevant, either.\n'What about the SEX? Oh my God. Do you guys have sex?' she imagines people thinking about her relationship. 'Do fat people even have sex at all? Does your husband even WANT to have sex with you? Can he even get an erection?'\nAnd she's not just imagining it. The writer recalled one time when an evening news producer got in touch about featuring her in a segment about heavy women and relationships.\nThough he presented it as a piece about body positivity, his leading questions suggested otherwise. He asked about her 'skinny' husband and their 'mixed weight' relationship, and Joni, needless to say, opted not to participate after all.\n'Even though it is an anatomical truth that my husband is, in fact, smaller than me, it certainly doesn’t warrant an entire half-hour program,' she said.\nNot an anomaly: Once, a TV producer wanted to do a segment on their 'mixed-weight' relationship, like it was something incredibly abnormal\n'The fact that anyone thinks that the love/sex habits of a fat woman and her skinny counterpart are television worthy only reinforces the perception that the life of a fat person is so obscure, so completely outlandish, that the world would need a docu-drama to understand it.'\nBut Joni said that she - and her active sex life with her 'thin' husband - are not an anomaly. And they do, truly, have a lot of sex.\nUnfortunately, though, insisting that they have a fulfilling sex life - and one that isn't driven by a fetish on her husband's part - seems to open Joni up to even more questions.\n'Can you be on top? If you are, do you crush him? If you do it doggy style, can he get over your giant bulbous a**?' she wrote. 'Do you need a crane? Can his penis find your vagina? Can YOU find your vagina?\n'What is it LIKE to have sex when you are so FAT?'\nThe fact of the matter is, she explained, it's just regular sex. They both orgasm, they both give and receive oral sex, and the issue of weight never even really comes up.\nGet over it: She said that their difference in weight is never an issue between them - though it seems to be for other people\n'There is a penis and a vagina,' she carefully explained to any confused readers. 'The penis goes INSIDE the vagina and then there is some motion (usually in and out) and other stuff (kissing, etc.), and then orgasms happen. For both parties, even.\n'We have sex in the positions people have sex in. Except not with anything suspended, not because I’m too fat for sex hammocks, but because I am just straight terrified of heights.'\n'I don’t feel a shroud of shame over my jiggling parts,' she said. 'I don’t feel so paralyzingly embarrassed that I can’t enjoy myself and find joy in him enjoying himself.'\nShe also jokingly added: 'My stomach roll may be in the way sometimes, but it's never in the way of a good time.'\nWhat's more, she went on, she is more than just her weight - and so is her husband. Which is why she feels secure in the fact that she they are 'madly in love', and she is not just 'lucky' to have found a man who is attracted to her in spite of her size.","url":"https://www.dailymail.co.uk/femail/article-3419328/My-stomach-roll-never-way-good-time-210lb-woman-details-great-sex-life-husband-hit-suggestions-curves-prevent-getting-intimate.html"}
