{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:07:39","date_modify":"2018-10-30 20:07:39","date_publish":"2015-04-19 15:41:44","description":"In what is being reported as the greatest migrant sea disaster of all time, some 700 Africans are suspected dead after a fishing boat packed with migrants |","filename":"data/vaneerConsumption/Over700AfricanMigrantsFearedDeadinCatastrophicSeaDisaster.json","image_url":"https://media.breitbart.com/media/2015/04/african-migrants-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_19__1540930059.html","title":"Over 700 African Migrants Feared Dead in Catastrophic Sea Disaster","title_page":"Over 700 African Migrants Feared Dead in Catastrophic Sea Disaster | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In what is being reported as the greatest migrant sea disaster of all time, some 700 Africans are suspected dead after a fishing boat packed with migrants capsized last night about 60 miles north of Libya in an attempt to make the crossing to Italy.\nSunday morning’s tragedy has brought the death toll of migrants who have drowned in the waters between Libya and Italy to some 1,500 since the beginning of 2015. The Strait of Sicily is fast becoming what one source described as “a migrant graveyard.”\nA massive rescue operation involving aircraft and ships from the Italian Navy, the Coast Guard, and fishing vessels is expected to continue through Sunday evening, but so far only 29 survivors have been reported, picked up during the night by a conscripted Portuguese merchant ship, the King Jacob. Twenty four bodies have also been recovered by emergency vehicles, but officials expect the number of casualties to reach at least 700.\nOne unconfirmed theory that has been advanced by the Coast Guard holds that when the merchant ship drew near to the failing migrant vessel, the passengers all moved to one side of the vessel, causing it to capsize.\nThe bodies of hundreds of victims of the shipwreck will almost certainly never be recovered. According to rescuers at the scene, the stretch of sea where the shipwreck occurred is far too deep to allow for the intervention of divers. The only way to carry out the recovery operation of remains would through the use of robots and unmanned submarines, which officials say would be economically unsustainable.\nCoast Guard spokesman Filippo Marini said that the water temperature in the Strait of Sicily, the channel of the Mediterranean Sea separating Italy from North Africa, is around 62º Fahrenheit, so “if someone is still in the sea there is the possibility that he can stay alive, if he has something to cling to and can be found in time.”\nOne of the survivors of the tragedy, an Eritrean migrant, reported that more than 700 people were on board the 65-foot barge whereas other credible sources report that there were over a thousand people aboard. The Coast Guard said that the boat was capable of carrying several hundred people but was “overloaded with migrants.”\nRecriminations have already begun regarding responsibility for the disaster as well as for dealing with the escalating problem of African migrants, which is reaching epidemic proportions.\nCarlotta Sami, spokesperson for the UN Refugee Agency (UNHCR), said that if the estimates for this latest tragedy are confirmed, the number of deaths in the Mediterranean over the last ten days “will come to more than a thousand.”\nThis could well be “one of the greatest tragedies ever in the Mediterranean,” Sami said.\n“Today’s incident is a catastrophe of enormous proportions that confirms the need for European intervention to put adequate means of relief in the field,” she said.\nOverfilled boats are leaving regularly from Libya, Sami said, but when they sound an alert for help, “Italian rescuers take too long to reach them.”\nFederica Mogherini, an Italian politician who serves as High Representative of the European Union for Foreign Affairs and Security Policy, said that what happened “is unacceptable” and insisted that now “is the time for the EU to address these tragedies without delay.” What is needed is for all 28 member states to share in responsibilities that “for too long has been left only to the countries of the South,” she said.\nTomorrow the issue will put to debate before the EU foreign council.\nAfter his midday prayer of the Regina Caeli Sunday, Pope Francis expressed his “deepest sorrow” and assured his prayer for the victims and for their families. He also launched a “heartfelt appeal” to the international community to act decisively and promptly, to prevent such tragedies from ever occurring again.\n“These are men and women like us, our brothers and sisters seeking a better life, hungry, persecuted, injured, exploited, victims of wars,” he said, before inviting all to join in prayer for them.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2015/04/19/over-700-african-migrants-feared-dead-in-catastrophic-sea-disaster/"}
