{"authors":[],"date_download":"2018-10-30 14:07:32","date_modify":"2018-10-30 14:07:32","date_publish":"2018-10-30 12:37:00","description":"Authorities are working to right an overturned tractor-trailer that is blocking a busy I-285 off-ram...","filename":"data/vaneerConsumption/OverturnedtractortrailerclosesI285rampinDeKalbCounty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/103018_overturned%20truck%202.JPEG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_overturned-tra_cd267b27ece028b8c9a46aa23e19eaa9__1540908452.html","title":"Overturned tractor-trailer closes I-285 ramp in DeKalb County","title_page":"Overturned tractor-trailer closes I-285 ramp in DeKalb County","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities are working to right an overturned tractor-trailer that is blocking a busy I-285 off-ramp in DeKalb County.\nThe wreck on the northbound ramp to Peachtree Industrial Boulevard has impacted I-285 West traffic since before 6:15 a.m. Tuesday, according to the WSB 24-hour Traffic Center. The ramp is shut down and one northbound lane of Peachtree Industrial Boulevard is closed at 8:15 a.m.\n“Big Outer Loop delays there,” traffic reporter Mark Arum said.\nWatch: Overturned tractor trailer on NB Peachtree Industrial Boulevard has I-285 NB ramp onto PIB shut down - https://t.co/PBMPTqwR7w #Atlanta #DeKalbCounty pic.twitter.com/MEsRICCDzv — John Spink (@johnjspink) October 30, 2018\nThe tractor-trailer was coming off I-285 onto the ramp when the truck swerved and tipped over, Doraville police told AJC.com. The driver was injured and taken to Northside Hospital for treatment.\nHe is expected to be charged with failure to maintain lane, police said. No other vehicles were involved in the crash.\nA wrecker clears an overturned tractor-trailer from the I-285 West ramp to Peachtree Industrial Boulevard. The truck tipped over about 6:15 a.m. Tuesday and blocked the ramp for several hours. JOHN SPINK / JSPINK@AJC.COM\nThe scene was beginning to clear at 8:22 a.m. However, the ramp was still blocked and delays remained.\nTRAVEL ADVISORY: Dekalb Co.: Overturned Tractor Trailer Crash Clearing: I-285/wb (outer loop) ramp to Peachtree Industrial Blvd/nb; ramp is still blocked; wreckers on scene; delays; https://t.co/RuPa64SzPC; #ATLtraffic pic.twitter.com/fHMTnmkvgl — Triple Team Traffic (@WSBTraffic) October 30, 2018\nThe truck was hauling large rolls of paper at the time of the crash, authorities said.\nWe have an Atlanta Journal-Constitution photographer on scene working to learn more.\n—Please return to AJC.com for updates.\nIn other news:","url":"https://www.ajc.com/news/traffic/overturned-tractor-trailer-blocks-285-ramp-dekalb-county/ZtnFrM0Fs8XASQliaq3vaJ/"}
