{"authors":["Sara Tan"],"date_download":"2018-10-30 23:30:04","date_modify":"2018-10-30 23:30:04","date_publish":"2014-08-13 18:00:02","description":"In today's most depressing news, a new study has found that over half of pre-teens (12 to 14 year olds) wear makeup every day. What's more is that 17 percent of them refuse to leave the house without any makeup on. To make matters even worse, these…","filename":"data/vaneerConsumption/OverHalfofPreteensWearMakeupEveryday10NoMakeupCelebsTheyShouldLookUpTo.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/9/5d134b7f-07fa-45a9-823b-dbaa7bbf4705-getty-611810206.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35611-over-half-of-pre-teens-wear-makeup-everyday-10-nomakeup-celebs-they-should-look-up-to_1540942204.html","title":"Over Half of Pre-teens Wear Makeup Everyday - 10 #NoMakeup Celebs They Should Look Up To","title_page":"Over Half of Pre-teens Wear Makeup Everyday — 10 #NoMakeup Celebs They Should Look Up To","title_rss":"NULL","source_domain":"bustle.com","text":"In today's most depressing news, a new study has found that over half of pre-teens (12 to 14 year olds) wear makeup every day. What's more is that 17 percent of them refuse to leave the house without any makeup on. To make matters even worse, these youngins are developing bad skincare habits with over 63 percent of them going to bed without removing their makeup at least once a week — 38 percent \"forget to take it off\" and 36 percent are just \"too tired.\" Gasps and sighs all around.\nBut wait, the findings go on. The research, which was conducted by skincare line Simple, concluded that pre-teens are so obsessed with makeup and how they look that 45 percent of them will retouch their face throughout the day. Despite caking it on, 81 percent of the young women (er, girls? they're still girls, right?) say that having \"clear and healthy skin\" was extremely important to them.\nUnfortunately for these preteens, their actions conflict their desire for glowing skin. The findings suggest they don't fully understand the repercussions of wearing too much makeup at such a young age (when they definitely don't need it!), as well as not taking care of their skin.\nA spokesperson for Simple told the Daily Mail, \"Applying too much makeup from as young as 12 years old without first using skincare products can cause sensitive skin to become dry and irritated. Applying layers of makeup will only serve to block pores, create and harbor more bacteria and inevitably, lead to greater skincare problems as well as confidence and self-esteem issues.\"\nWhile it's evident that celebrities and the media are creating these high standards for picture perfect skin, I think it's important for these young girls to realize that at their age, it's more than completely OK to skip the foundation and show off their blemishes — it's normal! Here are 10 #NoMakeup celebs who would totally agree.\n1. AnnaLynne McCord\nAnnaLynneMcCord/Twitter\n2. Jennifer Lopez\nJenniferLopez/Instagram\n3. Kelly Osbourne\nKellyOsbourne/Instagram\n4. Rihanna\nRihanna/Instagram\n5. Gwyneth Paltrow\nGwynethPaltrow/Instagram\n6. Adele\nAdele/Twitter\n7. Lorde\nlordemusic/Instagram\n8. Beyonce\nbeyonce/Instagram\n9. Jennifer Aniston\nMrChrisMcMillan/Instagram\n10. Bar Rafaeli\nBarRafaeli/Instagram\nImages: AnnaLynneMcCord/Twitter, JenniferLopez/Instagram, KellyOsbourne/Instagram, Rihanna/Instagram, GwynethPaltrow/Instagram, Adele/Twitter, lordemusic/Instagram, beyonce/Instagram, MrChrisMcMillan/Instagram, BarRafaeli/Instagram","url":"https://www.bustle.com/articles/35611-over-half-of-pre-teens-wear-makeup-everyday-10-nomakeup-celebs-they-should-look-up-to"}
