{"authors":[],"date_download":"2018-10-22 20:31:08","date_modify":"2018-10-22 20:31:08","date_publish":"2014-05-02 05:25:47","description":"The next steps include adding new partners, experts and assets to an already massive and wide-ranging international search operation.","filename":"data/vaneerConsumption/OweIttotheFamiliesSearchforJetMayTakeUptoaYear.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_35/257101/140317-malaysia-jet-10a_62c2099a537fc49714f0694b368be4d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_owe-it-families-search-jet-may-take-year-n95376_1540240268.html","title":"'Owe It to the Families': Search for Jet May Take Up to a Year","title_page":"'Owe It to the Families': Search for Jet May Take Up to a Year","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt could take a year to find the remains of Flight MH370, the head of the search effort said on Friday.\n\"We’re totally committed ... to find MH370, and I’m confident -- with an effective search -- we will eventually find the aircraft,” said Angus Houston, the head of the team looking for the plane off Australia's west coast. \"We owe it to the families and I think we owe it to the flying public around the world.\"\nSpeaking at a press conference in Kuala Lumpur, Houston injected a note of caution despite his pledge.\n\"I'm still hopeful that the Bluefin work we do between now and end of May might still find something,\" he said in reference to the U.S. Navy's Bluefin 21 robotic submarine that has been scouring the search area. \"I must say the chances of finding something -- the probability is lower than it was when we started the search.\"\nMalaysia's acting transport minister also said he was convinced the missing Boeing 777 would be found.","url":"https://www.nbcnews.com/storyline/missing-jet/owe-it-families-search-jet-may-take-year-n95376"}
