{"authors":["Brenton Garen At Dailymail.Com"],"date_download":"2018-10-23 01:52:54","date_modify":"2018-10-23 01:52:54","date_publish":"2016-01-28 16:25:06","description":"Wilson’s mind was far from promoting Zoolander 2 as he was spotted riding a quirky aqua bike through the streets of Paris on Thursday.","filename":"data/vaneerConsumption/OwenWilsonrideswbikeinParisashetakesabreakfrompromotingZoolander2.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB079A00000578-0-image-a-10_1453993324982.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421133_Owen-Wilson-rides-odd-bike-Paris-takes-break-promoting-premiere-Zoolander-2-February-12_1540259574.html","title":"Owen Wilson rides w bike in Paris as he takes a break from promoting Zoolander 2","title_page":"Owen Wilson rides w bike in Paris as he takes a break from promoting Zoolander 2 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His latest film Zoolander 2 premieres in two weeks.\nBut walking the red carpet was far from Owen Wilson’s mind as he enjoyed a bike ride through the streets of Paris on Thursday.\nThe 47-year-old managed to keep his balance on a quirky aqua bicycle as he took a break from promoting the Zoolander sequel, which will be released in the UK/US on February 12.\nScroll down for video\nNice wheels: Owen Wilson’s mind was far from promoting his new film Zoolander 2 as he enjoyed a bike ride through the streets of Paris on Thursday\nThe Zoolander star looked to be in full concentration mode as he rode in a casual outfit.\nHe wore an unzipped tan jacket over a dark blue t-shirt that paired with dark blue jeans.\nWilson wore a dark blue trucker cap with a large blue and red stripe across the front. His famed glossy blonde locks draped shaggy to his shoulders.\nFull concentration: The 47-year-old kept his hands on the handlebars at all times while in his casual outfit\nThe Wedding Crashers vet kept both hands firmly on the handles as he rode past a truck.\nThe actor, who brings the Zoolander sequel to screens 15 years after the original hit film was released in 2001, looked to be in comfortable riding footwear in brown leather shoes as he pedaled.\nIn one photo he stopped to talk to a man on a similar styled bike.\nFriends? The Wedding Crashers star stops to talk with a man after riding past a large truck\nZoolander 2 sees Wilson’s character Hansel McDonald reunited with Derek Zoolander (Ben Stiller) as they are called on by Interpol agent Melanie Valentina (Penelope Cruz) to save the world from evil mastermind Jacobim Mugatu (Will Ferrell).\nThe Marley & Me star also has two other films set to be released this year.\nHe will co-star alongside Zach Galifianakis, Kristen Wiig and Jason Sudeikis in the comedy Masterminds, which is scheduled for release in September.\nThey're back! Twelve years after the original Zoolander, Wilson returns to the hit comedy alongside Ben Stiller\nReunited! Zoolander 2 sees Wilson’s character Hansel McDonald reunited with Derek Zoolander; they're seen here on set in Rome in April 2015\nWilson’s character encourages a night guard (Galifianakis) at an armored car company in the Southern U.S. to organize one of the biggest bank heists in American history.\nIn November, Wilson will appear in Bastards that stars Ed Helms and J.K. Simmons.\nIn this comedy he and his fraternal twin hit the road in order to find their allegedly deceased father after learning their mother had been lying to them for years.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421133/Owen-Wilson-rides-odd-bike-Paris-takes-break-promoting-premiere-Zoolander-2-February-12.html"}
