{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 01:42:16","date_modify":"2018-10-23 01:42:16","date_publish":"2017-04-26 12:13:26","description":"Owen Nichol (pictured), 19, from Taunton in Somerset, kicked cows in the face and shouted, 'Come on you f****** t***' before stamping on a newborn calf seven times.","filename":"data/vaneerConsumption/OwenNicholwhoSTAMPEDonanewborncalfsparedjailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F4F0700000578-0-image-a-23_1493205511724.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447070_Thug-19-STAMPED-newborn-calf-spared-jailed_1540258936.html","title":"Owen Nichol who STAMPED on a newborn calf spared jailed","title_page":"Owen Nichol who STAMPED on a newborn calf spared jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Owen Nichol, 19, from Taunton in Somerset, kicked cows in the face and shouted, 'Come on you f****** t***' before stamping on a newborn calf seven times\nA farm apprentice, who stamped on a newborn calf and beat its mother, has been spared jail.\nOwen Nichol, 19, from Taunton in Somerset, kicked cows in the face and shouted, 'Come on you f****** t***' before stamping on a newborn calf seven times.\nThe abuse was captured on a covert camera placed in a barn by the charity Animal Equality.\nNichol was given a 12-week prison sentence - suspended for one year - today at Taunton Magistrates' Court after admitting two charges of causing unnecessary suffering to animals at an earlier hearing.\nChair of the bench Jeff Collingwood previously said it was the worst case of animal abuse he had seen in his 23 years as a magistrate and warned Nichol he may face jail.\nDuring a four-minute clip, Nichol is seen kicking and punching a cow that had just given birth and slamming a gate on it.\nAt one point, the part-time stockman tells the animal: 'I f****** hate you you little c***,' before slamming it on the ground, bashing it against a wall and stamping on it.\nNichol admitted two charges of causing unnecessary suffering to the animals contrary to the Animal Welfare Act 2006.\nProsecuting for the RSPCA, Lindi Meyer told the court, at a hearing earlier this month, that the abuse came to light after Animal Equality placed a covert camera in a barn.\nScroll down for video\nThe footage, recorded between 9am and 9.30am on December 8 last year, was later passed to the RSPCA.\nMs Meyer said: 'The footage shows acts of violence against the cows and calves.\n'He (Nichols) is continuously swearing at the cows. He gives a heavy kick to one of the new mothers.\n'He kicks her full in the face and throws her newborn calf away from her.\n'He kicks and stamps on one calf seven times. The violence was unprovoked and totally unnecessary.'\nNichols was filmed repeatedly assaulting and hurling abuse at the cow and newborn calf\nA photo provided by animal charity Animal Equality showing dead calves at Pyrlands farm\nPictured is a lame cow at Pyrlands farm, where Owen Nichol was filmed hitting and kicking them\nMs Meyer said the calves in the footage ranged between newborn and two days old.\nIn a report for the RSPCA, a vet said the cows would have suffered 'considerable pain and distress' from Nichol's abuse.\nThe vet described the case as 'the worst example of abusive behaviour' he had seen in a 35-year career.\nNichols was working at the farm for a year as part of his apprenticeship, the court heard.\nPictured is the moment Nichol repeatedly slams the gate into the helpless animal\nPictured is Nichol stamping on the little calf at the farm. He was caught on camera\nAt one point, the part-time stockman tells the animal: 'I f****** hate you you little c***' and told it to lay down\nPictured is a cow with pressure sores at Pyrlands farm after Nichol launched his attack\nIn interviews, Nichol told officers he 'just flipped' and the violence was not related to the cows and calves.\nHe added his grandmother had been in hospital with pneumonia and he had separated from his girlfriend months earlier.\nNichol, who has a flock of sheep, said he had 'very little sleep' as he had been working for his father as well as nights at the farm.\nChair of the bench Jeff Collingwood said it was the worst case of animal cruelty he had seen in his twenty-three years as a magistrate.\nNichol, who has a flock of sheep, said he had 'very little sleep' as he had been working for his father as well as nights at the farm. He is pictured leaving court this afternoon\nA photo provided by animal charity Animal Equality showing a cow in ankle hobbles at Pyrlands farm\nThe court heard Nichol was dismissed from the farm when the footage was released. He has no previous convictions.\nChairman of the bench, Dr Peter Reed, said: 'The offence was deliberate and sustained.\n'It involved kicks, stamping, hitting including to the head, and shouting at the animals.\n'We believe these animals did suffer a relatively high level of suffering, for a short period. The vet described it as the worst case of abuse he had seen in 35 years.'\nOwen Nichol, 19, from Taunton in Somerset, kicked cows in the face and shouted, 'Come on you f****** t***' before stamping on a newborn calf seven times\nNichol had been warned he could be put behind bars with his actions - but was spared jail at Taunton Magistrates' Court.\nDr Reed said: 'You were working beyond your capabilities. You were working unsupervised, doing long shifts and were sleep deprived. You had limited training, and co-operated with the inspector.'\nNichol was sentenced to 12 weeks jail, suspended for one year, and told to undertake a rehabilitation activity for 30 days and 150 hours unpaid work.\nHe was disqualified for two years from owning, keeping or participating in keeping any animal farmed for commercial purposes, including arranging transport or dealing.\nIt will be 12 months before Nichol can challenge it.\nA victim surcharge £115 was imposed, as well as a £300 contribution to costs of prosecution.\nDr Toni Shephard, Animal Equality's UK Director, said: 'We are extremely disappointed that this dairy farm worker has not been sent to prison for the disgusting attacks on vulnerable cows and calves revealed by our investigation.\n'A suspended sentence is wholly inadequate punishment for these disturbing acts of cruelty.'\nShe added: 'This case highlights the dangerous lack of oversight and complete absence of independent, unannounced inspections which leave all farmed animals at risk of abuse and suffering.\n'Without our investigation, this worker would still be beating those poor animals today.'","url":"https://www.dailymail.co.uk/news/article-4447070/Thug-19-STAMPED-newborn-calf-spared-jailed.html"}
