{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:24:28","date_modify":"2018-10-30 22:24:28","date_publish":"2014-08-15 19:37:23","description":"In honor of, well, Friday, I present you \"Owls Wrapped In Towels.\" Anyone who owns a cat is well-acquainted with the fine art of the kitty burrito: that is, rolling your furry friend up in a blanket or towel in order to soothe it, calm it down, or…","filename":"data/vaneerConsumption/OwlsinTowelsAretheCutestThingYoullSeeAllDay.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f683af49-f921-4613-839a-43bcc545feb9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35989-owls-in-towels-are-the-cutest-thing-youll-see-all-day_1540938268.html","title":"Owls in Towels Are the Cutest Thing You’ll See All Day","title_page":"Owls in Towels Are the Cutest Thing You’ll See All Day","title_rss":"NULL","source_domain":"bustle.com","text":"In honor of, well, Friday, I present you \"Owls Wrapped In Towels.\" Anyone who owns a cat is well-acquainted with the fine art of the kitty burrito: that is, rolling your furry friend up in a blanket or towel in order to soothe it, calm it down, or make it easier to administer medicine. Cats, after all, are squirmy, and when they don’t want to do something … well, let’s just say they’re not afraid to make it known. It’s not exactly unexpected that the burrito technique can also be quite effective when applied to other animals — but it is unexpectedly cute.\nGizmodo’s Factually blog gets the credit for digging this one up out of the archives, but I’m glad they did. Seriously, you guys — owls in towels are so. Stinkin’. Cute. According to the University of Minnesota’s Raptor Center Clinic (and yes, it's actually called the Raptor Center. Clever girl!), one of the ways veterinarians keep track of the health of the owls they take care of is weight. Back in 2012, the clinic saw 15 Northern saw-whet owls admitted due to traumatic injuries, mostly due to the birds having collided with things like windows. Many had head and internal injuries, and one of them ended up with a fractured pelvis, poor thing. In order to weigh the adorable but occasionally ornery birds, the vets did the burrito thing, stuck ‘em on the scale, and took the measurements needed to check up on them.\nThis video from the Vermont Institute of Natural Sciences gives you a pretty good idea of how the process works:\nVINSWildlife on YouTube\nAre you melting yet? Because I sure am. Awwwwwwww!\nOf course, tiny owls aren’t the only ones that get burritoed from time to time; as this post from the Museum of Life and Science details, the technique even works on birds as big as barred owls. It's probably a little more complicated to pull off, but it's still cute.\nFor more cuteness, head on over to the University of Minnesota’s Health Talk blog. It’s worth it. I promise. Happy Friday, everyone!\nImage: Ken Janes/Flickr","url":"https://www.bustle.com/articles/35989-owls-in-towels-are-the-cutest-thing-youll-see-all-day"}
