{"authors":["Brandon Riddle"],"date_download":"2018-10-30 14:28:41","date_modify":"2018-10-30 14:28:41","date_publish":"2016-05-30 00:00:00","description":"The new owner of District Fare says the sandwich shop and specialty store in Little Rock’s Hillcrest neighborhood will be part of his new restaurant project across the street.","filename":"data/vaneerConsumption/OwnerDistrictFarepartofplansforrestaurantprojectinLittleRocksHillcrestneighborhood.json","image_url":"https://media.arkansasonline.com/img/photos/2016/05/30/Screen_Shot_2016-05-30_at_6.56.35_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_28__1540909721.html","title":"Owner: District Fare part of plans for restaurant project in Little Rock's Hillcrest neighborhood","title_page":"Owner: District Fare part of plans for restaurant project in Little Rock's Hillcrest neighborhood","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The former location of Helmich Auto Service at Kavanaugh Boulevard and Beechwood Street in Little Rock. - Photo by Gavin Lesnick\nThe new owner of District Fare says the sandwich shop and specialty store in Little Rock’s Hillcrest neighborhood will be part of his new restaurant project across the street.\nDaniel Bryant, who also owns Little Rock's Big Whiskey's, The Hillcrest Fountain and Sauce(d), told the Arkansas Democrat-Gazette on Tuesday that the District Fare purchase is “an early piece of the puzzle.”\nBryant previously said he would be developing the former Helmich’s Auto Service, 2712 Kavanaugh Blvd., and the property behind it into a casual restaurant. Early plans have called for it to feature burgers, a soda fountain and full bar.\n“We’re busy getting settled in [at District Fare] and having a good time bringing new things to the menu and meat case,” he said. “You’ll see some activity at the former Helmich’s station in a month or so.”\nAn opening for the yet-to-be-named restaurant at the former service station is tentatively set for the first half of 2019.\n“We’ll have more news this fall,” Bryant said.\nHelmich Auto Service closed in May 2016 after 60 years in business.\nThe Kavanaugh Boulevard property last sold for $450,000 to Little Gidding LLC on May 26, 2016. The adjoining site to its north sold for $280,000 on March 16, 2017 to the same company, according to records with the Pulaski County assessor’s office.","url":"https://www.arkansasonline.com/news/2018/aug/28/owner-district-fare-part-plans-restaurant-project-/"}
