{"authors":[],"date_download":"2018-10-30 18:43:20","date_modify":"2018-10-30 18:43:20","date_publish":"2016-09-27 18:21:00","description":"Hefty fines loom for the owners of the rundown iconic Spaghetti Junction tower after they declined to resolve a series of code violations Tuesday morning.","filename":"data/vaneerConsumption/OwnersoficonicSpaghettiJunctiontowerfacethousandsinfines.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/08/Images/photos.medleyphoto.11293259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_owners-clash-fac_e5f6f12b7dd33ad7383df45a84b0e7ce__1540925000.html","title":"Owners of iconic Spaghetti Junction tower face thousands in fines","title_page":"Owners of iconic Spaghetti Junction tower face thousands in fines","title_rss":"NULL","source_domain":"ajc.com","text":"Hefty fines loom for the owners of the rundown iconic Spaghetti Junction tower after they declined to resolve a series of code violations Tuesday morning.\nA few hours of off-and-on negotiations between the owners and a DeKalb County prosecutor failed, leading Judge Hollie Manheimer to schedule a trial for Oct. 11 on the 34 code violations charged to the owners of the 15-story former hotel and condo building. The owners face as much as $34,000 in fines if found guilty of the violations at the structure, which has been vacant several years and is seen by some as emblematic of the problems of blight troubling the county.\nThe reason the owners couldn't resolve the issue became clear before the hearing even started: the men can't agree which of them is liable for the broken windows, overgrown grass and general ramshackle appearance of the former Presidential Hotel.\nWhen approached by a reporter in the hall, co-owner Vincent Lu pointed to co-owner Habib Osta.\n\"He's been in charge,\" Lu said.\nOsta, who was standing in the courtroom doorway, turned and walked away.\nApproached a few minutes later, Osta motioned toward Lu.\n\"Talk to the major owner,\" Osta said. \"Vincent Lu, he's the major owner.\"\n»Related: Actual Factual DeKalb: What's with the rundown tower at Spaghetti Junction?\nClashes between the pair are nothing new. Disagreement with them led to an unpaid Georgia Power bill in 2012, when the tower was The Presidential Boutique Condotel. Residents were later driven from their homes. Some people still own condos there, though they can't use them.\nThe condition has deteriorated, drawing criticism from onlookers, including county Commissioner Nancy Jester, who represents the area and has called the building a danger and an eyesore at the \"front door\" of DeKalb at I-285 and I-85.\nOn Tuesday, the owners sat down for negotiations with Wystan Getz, a senior assistant solicitor, who attempted to forge an agreement between them and the county on clean up at the site.\n“Who wants to be responsible for what violations?” the solicitor finally asked sternly. “Y'all need to figure this stuff out. If you’re going to say, 'This is not me, this is not me,' I don’t want to listen to that.”\nWhen no agreement could be reached, Getz told the owners DeKalb County would seek the maximum fine against them.\n\"There’s obviously differences of opinion,\" Manheimer said, \"which is why we’re going to try the case.”","url":"https://www.ajc.com/news/local/owners-clash-face-fines-over-iconic-blighted-spaghetti-junction-tower/EY71C0b6S41pGi9VlR7wpL/"}
