{"authors":["Alanna Bennett"],"date_download":"2018-10-30 22:43:13","date_modify":"2018-10-30 22:43:13","date_publish":"2014-08-14 20:10:17","description":"It's time for the annual addition of hip phrases from modern vernacular into the Oxford English Dictionary. Are you ready? Last year it was \"Selfie\" and \"Twerk,\" brought to popularity in part due to the efforts of people like Kim Kardashian and…","filename":"data/vaneerConsumption/OxfordEnglishDictionaryDefinitionofBingeWatchLacksGrittyRealities.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/246bbe74-2a04-41a1-9a8e-3c1fe58d95c5.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35806-oxford-english-dictionary-definition-of-binge-watch-lacks-gritty-realities_1540939393.html","title":"Oxford English Dictionary Definition of \"Binge-Watch\" Lacks Gritty Realities","title_page":"Oxford English Dictionary Definition of \"Binge-Watch\" Lacks Gritty Realities","title_rss":"NULL","source_domain":"bustle.com","text":"It's time for the annual addition of hip phrases from modern vernacular into the Oxford English Dictionary. Are you ready? Last year it was \"Selfie\" and \"Twerk,\" brought to popularity in part due to the efforts of people like Kim Kardashian and Miley Cyrus. This year, one of the new official words hasn't been brought forth by celebrity efforts, though — it's been brought forth by you. \"Binge-watch\" has been added to the Oxford English Dictionary. Hallelujah?\n\"Binge-watch,\" \"FML,\" \"SMH,\" \"douchebaggery,\" \"clickbait,\" and \"YOLO\" have all joined the illustrious pages of the world's fanciest English dictionary. All of those are great contenders, to be sure, but my eye focused in pretty quickly on \"binge-watch.\" The reasons for this are obvious: Binge-watching is an activity I hold very near and dear to my heart. Which is why I immediately set out to find out how these Oxford peeps would be defining it.\nReports on the exact definition of any of the \"new\" words were frustratingly vague — but I did find this definition on Oxford Dictionaries, and I can't imagine the official one will be much different:\nVERB\n[WITH OBJECT]INFORMAL\nWatch multiple episodes of (a television programme) in rapid succession, typically by means of DVDs or digital streaming: 'you can binge-watch the entire season with this set'\nOrigin\n1990s: on the pattern of binge-drink, binge-eat.\nLike many dictionary definitions, though, something is missing here. This doesn't capture the true spirit of binge-watching. And so we, as citizens of the world, must fill in the gaps.\nSo here's some of what was missing:\nThe Mise-En-Scene\nThis definition includes absolutely no mention of pajamas. This makes sense — it's the Oxford English Dictionary, I suspect they enjoy keeping a certain air of class around the proceedings even as they add \"YOLO\" to their pages. But pajamas, or at the very least the comfiest clothes you have at your disposal — are a key part of the binge-watch.\nThe commitment\nIt takes a certain amount of dedication to commit to so many hours in front of a single show. Do you know how long Buffy the Vampire Slayer is? Friday Night Lights? Or even just to finish one season of House Of Cards? They're well worth the time, but you gotta show some respect for the hustle.\nThe sore butts\nIt is imperative to shift lounging positions at least once an episode. Only noobs risk bedsores.\nThe judgmental gaze of the outside world\n\"Oh, hey roommate. Yes, this is the fourteen episode of The Fosters I've watched this fine Saturday. No, I don't know why.\"\nSome people are just not built to understand the glory of bingeing an ABC Family drama.\nThe deep dread of realizing you have to pee\nI am by far the most bitter about my regular bodily functions when I'm neck-deep in Scandal.\nThe snacks\nOne cannot binge without sustenance. I would be hard dollars that Grubhub and Seamless owe big chunks of their business to Netflix binges.\nThe eye-strain\nWhether it's drying out your contacts or having so stow away your phone after looking at too many screens for too many hours, we gotta acknowledge how annoyed our eyes get.\nWanting to binge a show that's not on Netflix\nWe all have our ways. But it can be a bummer.\nImage: Grizzlybomb; Tumblr; NoCookie; Tumblr","url":"https://www.bustle.com/articles/35806-oxford-english-dictionary-definition-of-binge-watch-lacks-gritty-realities"}
