{"authors":["Andy Sims","Press Association"],"date_download":"2018-10-23 02:14:41","date_modify":"2018-10-23 02:14:41","date_publish":"2016-01-11 14:08:50","description":"The 23-year-old striker failed to make the breakthrough at West Brom but proved he is a star in the making with two superb goals to help sink Swansea 3-2 in the shock of the third round.","filename":"data/vaneerConsumption/OxfordheroKemarRoofewantstofollowJamieVardyintothebigtimeafterhisFACupheroicsagainstSwanseaonSunday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/2FFB9C2B00000578-0-image-a-66_1452520933839.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393931_Oxford-hero-Kemar-Roofe-wants-follow-Jaime-Vardy-big-time-following-FA-Cup-heroics-against-Swansea_1540260881.html","title":"Oxford hero Kemar Roofe wants to follow Jamie Vardy into the big time after his FA Cup heroics against Swansea on Sunday","title_page":"Oxford hero Kemar Roofe wants to follow Jamie Vardy into the big time after his FA Cup heroics against Swansea on Sunday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The 28-year-old was named player of the month for October & November\nOxford's FA Cup hero Kemar Roofe wants to follow Jamie Vardy's route to the big time.\nThe 23-year-old striker failed to make the breakthrough at West Brom but proved he is a star in the making with two superb goals to help sink Swansea 3-2 in the shock of the third round.\nRoofe left The Hawthorns to join League Two Oxford last summer after a successful loan spell and has now scored 15 goals this season.\nKemar Roofe (left) was the hero for Oxford as he scored twice to knock Swansea out of the FA Cup\nRoofe (right) seen celebrating his strike wants to follow Jamie Vardy into the big time\nThe striker took both his goals superbly on Sunday and will be looking for more of the same in the next round\nAnd he admits Leicester forward Vardy's rise through the divisions to become the Premier League's top scorer is driving him on.\n\"Of course, Jamie Vardy started lower and he's got the record of scoring in the Premier League,\" said Roofe. \"It can be done given the time and given the chance.\n\"I've been given a chance and I believe I'm showing it now, even against the Premier League boys.\n\"The only chance we are going to get to play against the Premier League boys is the FA Cup and the League Cup. So it's a chance for us to show what we can do.\nVardy who began his career in the lower leagues is having a season to remember and has 15 goals so far\nThe Leicester hero broke Ruud Van Nistelrooy's record by scoring in 11 consecutive Premier League games\n\"I never got a chance at West Brom. I put in the performances in the under-21s and trained hard, but just didn't get the chance. I got on the bench but never got a few minutes.\n\"I believe I should have had a chance. I did as much as I could. It's down to being given a chance and giving the young players the opportunity.\"\nJefferson Montero had put Swansea ahead with a rare piece of Premier League quality but Liam Sercombe levelled for Oxford from the penalty spot.\nRoofe then stole the show in the second half with a superb curled effort and a fine breakaway goal before Bafetimbi Gomis pulled one back.\nSwans boss Alan Curtis made 10 changes for the clash with Wednesday's crucial meeting with relegation rivals Sunderland in mind.\nHe said: \"I think this will affect the confidence levels now, but once Wednesday comes around we will be ready and it will probably be a completely different set of players.\n\"So it does not affect the team, but it does affect the club and the supporters. It was an opportunity for those players but now it is about dusting them down.","url":"https://www.dailymail.co.uk/sport/football/article-3393931/Oxford-hero-Kemar-Roofe-wants-follow-Jaime-Vardy-big-time-following-FA-Cup-heroics-against-Swansea.html"}
