{"authors":["Associated Press"],"date_download":"2018-10-23 02:32:48","date_modify":"2018-10-23 02:32:48","date_publish":"2016-01-29 17:09:07","description":"LONDON (AP) — An Oxford University college says it will not remove a statue of 19th-century politician Cecil Rhodes that has sparked protests from students w...","filename":"data/vaneerConsumption/OxfordcollegedecidestokeepcontestedCecilRhodesstatue.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422531_Oxford-college-decides-contested-Cecil-Rhodes-statue_1540261968.html","title":"Oxford college decides to keep contested Cecil Rhodes statue","title_page":"Oxford college decides to keep contested Cecil Rhodes statue | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oxford college decides to keep contested Cecil Rhodes statue\nLONDON (AP) — An Oxford University college says it will not remove a statue of 19th-century politician Cecil Rhodes that has sparked protests from students who call it an emblem of imperialism and racism.\nThe governing body of Oriel College said that after \"careful consideration\" it had decided to keep the statue, but would add \"a clear historical context to explain why it is there.\"\nIt said the debate had been a reminder \"of the complexity of history and of the legacies of colonialism still felt today.\"\nProtest group Rhodes Must Fall, which wanted the statue removed, said Friday that it would continue the fight.\n\"We will be redoubling our efforts and meeting over the weekend to discuss our next actions,\" the group said in a statement.\nRhodes was a politician and proponent of British imperial expansion who served as prime minister of the Cape Colony in southern Africa and founded the De Beers diamond-mining company.\nHe gave his name to the nation of Rhodesia, now Zimbabwe. He left money to Oxford on his death in 1902 and created the Rhodes Scholarship program for foreign students.","url":"https://www.dailymail.co.uk/wires/ap/article-3422531/Oxford-college-decides-contested-Cecil-Rhodes-statue.html"}
