{"authors":[],"date_download":"2018-10-30 21:28:16","date_modify":"2018-10-30 21:28:16","date_publish":"2018-06-21 09:00:00","description":"Our increasingly frenetic society demands we do more to cultivate deeper learning","filename":"data/vaneerConsumption/OxfordEmoryprofessorinspiringdeeperlearning.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/21/Images/newsEngin.22339920_0101801-16AB-F051-X3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_health_cultivati_254e58c91e749ddbd1af3ee298aaedd1__1540934896.html","title":"Oxford Emory professor inspiring deeper learning","title_page":"Oxford Emory professor inspiring deeper learning","title_rss":"NULL","source_domain":"ajc.com","text":"The education of Patricia Owen-Smith’s students begins with moments of silence at the start of every class.\nInstead of whipping out their cellphones and pencils, they wait until the professor retrieves her singing bowl, pings it three times and altogether they settle into the silence — one of several contemplative practices Owen-Smith believes helps facilitate deep learning.\nThose who happen to glance into her classroom at Oxford College of Emory University might wonder instead whether her students have fallen into a deep sleep.\nBut the opposite is true.\n“I feel so at peace,” Myra Chao, one of her students, said recently. “Any anxiety I had melts away, and all these separate pieces of myself come together.”\nOwen-Smith, a professor of psychology and women’s, gender and sexuality studies, stumbled upon the approach some 10 years ago, but the journey began in the 1980s when she introduced her students to in-service learning.\n“I started to notice that students were having these epiphanies in which the core ingredient of the course started to make sense,” she said. “They could put a name on what they were actually seeing in the community beyond the campus gates.”\nFor example, if she were teaching students about the significance of attachment issues in childhood, they could actually see those play out while they worked in a day care center.\nRELATED | Mindfulness: Learning to live in moment at school, at home\nAnd so it struck her that students seem to learn the most while their hearts were being touched.\nThat work led Owen-Smith to being named a Carnegie Scholar in 2000. That’s when she became more and more aware of how higher education often marginalizes affective development in learning.\nGradually people in the contemplative movement began reaching out. After attending several conferences, workshops, and courses on contemplative practices, Owen-Smith began introducing the approach to her students.\nAt first, she set aside a few minutes at the start of each class for students to listen to soft music but soon discovered sitting in silence with no music seemed to be even more effective.\nThere’s nothing novel about this. Approaches to still the mind and cultivate attention have been around for centuries. Scientists like Albert Einstein and technologists like Google’s Chade-Meng Tan have brought meditation into medicine and business, and for at least the past decade, Owen-Smith along with other educators have been doing the same at colleges and universities.\nWhile there is some debate about whether including contemplative practices — silence, meditation, mindfulness — is worth the time it takes away from covering course materials, Owen-Smith said there has never been a time when it was more needed than right now.\nRates of anxiety and depression have skyrocketed in the past few decades.\nRELATED | National and local deaths bring attention to suicide concerns\nA 2017 survey conducted by the American College Health Association found that almost 40 percent of students reported feeling so depressed in the prior year that they found it difficult to function. Sixty-one percent of students reported experiencing overwhelming anxiety in the same time period.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nThat anxiety and tension is so intense Owen-Smith has felt it flow from students in her classroom.\nWhen she first introduced the approach to her students, it was purely for selfish reasons.\n“I realized I was answering the last email in the last seconds before I entered class,” she said. “I felt like I was going into class hyperventilating.”\nShe asked herself: “How can I keep teaching like this and more importantly teach with integrity with that kind of tension?”\nThe short answer was she couldn’t. Of course, it didn’t help that in addition to her own stress, students were bringing with them an enormous amount of pain. Some related to coursework, but a lot of it was due to family trouble and their own personal relationships.\n“I tried to slow myself down and I tried to slow the classroom down as much as possible,” she said.\nWith another school year behind her, I wondered if giving her students time to be still and quiet helps.\nChao, a 19-year-old rising junior, provided the answer.\nPatricia Owen-Smith (left) with student Myra Chao. Owen-Smith, a professor of psychology and women’s, gender and sexuality studies at Oxford College of Emory University, begins all her classes with a moment of silence. Chao has come to embrace the effects of contemplative practices. GRACIE BONDS STAPLES / GSTAPLES@AJC.COM (The Atlanta Journal-Constitution)\nAt first, she admits, she had a lot of questions. Chief among them was what was the point?\nShe discovered contemplative practice was about far more than sitting in silence. It taught her how to feel whole, to connect to her surroundings.\nRELATED | More children learn meditation to relax, focus\nChao said she’s even witnessing changes in fellow students who are in Owen-Smith’s classes and who used to be uncomfortable being alone with their thoughts.\n“Before this, if I were silent, I’d be thinking of projects I have to do, is my boyfriend angry at me,” she said. “Now my mind is completely empty. I don’t think about anything.”\nAchieving that kind of stillness and awareness, Owen-Smith said, takes practice, but she’s living proof it can be done.\nBefore contemplative practices, her love of teaching had started to wane. Students were anxious, and this anxiety and tension interfered with the important tasks of teaching and learning.\nThat soon changed. Now she feels a moral mandate to do this work in her classroom.\n“As teachers, we have to do more than teach our disciplines,” she said. “I think we need to help our students learn how to be in the world, and equip them with the skills they need to be in the 21st century. We need peacemakers. We need listeners. We need compassionate human beings. We need loving human beings now more than ever.”\nIf contemplative practice can get us there, who can be against it?\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/health/cultivating-deeper-learning-through-stillness-meditation/luUc6XOiZNkpI6tDTyhhSK/"}
