{"authors":["Thomas Burrows For Mailonline"],"date_download":"2018-10-23 02:56:14","date_modify":"2018-10-23 02:56:14","date_publish":"2016-01-28 18:15:19","description":"Oxford University has been accused of 'humiliating' students after sending round a list of second-year Chemistry undergraduates who had failed their exams.","filename":"data/vaneerConsumption/OxfordUniversitysendsroundlistofstudentswhofailedexams.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/03D0499A00000514-0-image-a-7_1454004640997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421450_Oxford-University-accidentally-sends-round-list-second-year-undergraduates-ve-failed-exams_1540263374.html","title":"Oxford University sends round list of students who failed exams","title_page":"Oxford University sends round list of students who failed exams | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oxford University has been accused of 'humiliating' students after sending round a list of undergraduates who had failed their exams.\nThe university's chemistry department sent out two separate documents to second-year undergraduates in the past three months, which included the name of every student, their college, and their results.\nFurious students said the blunder amounted to a 'breach of privacy' and showed 'serious incompetence'.\nOxford university has now apologised for the 'unfortunate mistake' and insisted 'steps had been taken' to ensure it did not happen again.\nOxford University accidentally sent round a list of second year undergraduates who failed their exams\nOxford university has now apologised for the 'unfortunate mistake' which left students feeling 'humiliated'\nThe first list of exam results was sent out to all 189 second-year chemistry students in October and the second was published in January, revealing the unlucky 14 who had failed some of their first-year exams.\nIt has angered and upset Oxford students at the institution where exam stress and the daunting workload is well documented.\nEdmund Little, a second-year Chemistry student at Corpus Christi College, told the Daily Telegraph: 'An Oxford Chemistry degree can be really tough, and it is very humiliating and upsetting for somebody to go through the stress of revising for an exam, only to have the fact that they have failed broadcast across the whole student body.\n'I'm glad the Department has now apologised, and hope that this never happens again.\n'I'm sure this was just an administrative error, but it is still really disappointing, and suggests serious incompetence.'\nJosh Blunsden, a second-year Chemistry student, added: 'Regardless of whether it was intentional or not, it shouldn't have happened.\n'Obviously there will be people who didn't want it to be public knowledge how many exams they failed.'\nAn Oxford University spokesman said: 'This was an unfortunate mistake and we have apologised to all affected.\n'The Department of Chemistry have already taken steps to improve their processes so that similar mistakes are avoided in future.'\nIn 2014, results of under-performing and grades were listed in a spreadsheet document and sent to students at University College (pictured)\nThis is not the first time the university has made this mistake.\nIn 2014, results of under-performing and grades were listed in a spreadsheet document and sent to students.\nThe embarrassing leak revealed the names of the worst performing undergraduates in pre-Christmas exams, known as 'collections', at University College.\nAlmost 50 who achieved a 2:2 grade or below in the Michaelmas collections - including nine studying law and six engineering - had their result sent to fellow students.\nWhen the error was discovered, college staff sent a second e-mail asking students if they would 'please delete the e-mail previously sent out as it contained inaccuracies'.","url":"https://www.dailymail.co.uk/news/article-3421450/Oxford-University-accidentally-sends-round-list-second-year-undergraduates-ve-failed-exams.html"}
