{"authors":[],"date_download":"2018-10-22 22:47:41","date_modify":"2018-10-22 22:47:41","date_publish":"2016-01-11 03:56:27","description":"A dramatic missed field goal saw the Seattle Seahawks edge past the Minnesota Vikings as the Green Pay Packers demolished the Washington Redskins on a pulsat...","filename":"data/vaneerConsumption/PackersSeahawksadvanceinNFLplayoffs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5mq-56CX32zFKLb7123928b84c9f1e24-678_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393252_Packers-Seahawks-advance-NFL-playoffs_1540248461.html","title":"Packers, Seahawks advance in NFL playoffs","title_page":"Packers, Seahawks advance in NFL playoffs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Packers, Seahawks advance in NFL playoffs\nA dramatic missed field goal saw the Seattle Seahawks edge past the Minnesota Vikings as the Green Pay Packers demolished the Washington Redskins on a pulsating day of NFL wild card action playoff.\nThe story of the day came in Minneapolis, where Vikings kicker Blair Walsh fluffed an easy 27-yard field goal attempt with 26 seconds left on the clock to allow Seattle to cling on for a nail-biting 10-9 victory.\nWalsh's miss was the final act of an icy afternoon in Minnesota, where sub-zero temperatures before kick-off made the game the third coldest match in NFL history.\nGreen Bay Packers quarterback Aaron Rodgers passes as teammate Bryan Bulaga blocks against Washington Redskins defensive end Jason Hatcher during their game at FedExField on January 10, 2016 ©Rob Carr (Getty/AFP)\nThe mercury plunged minus six degrees Fahrenheit (minus 21 Celsius) before the game. The coldest match ever recorded was the 1967 \"Ice Bowl\" between the Dallas Cowboys and the Green Bay Packers, where the temperature was minus 13 at kickoff.\n\"I can tell you this: It's my fault. I don't care if you give me a watermelon (to kick), I should be able to put that through,\" Walsh said afterwards. \"I'm the only one who didn't do my job there. That's on me.\"\nVikings coach Mike Zimmer was in no mood to sugarcoat the miss for Walsh.\n\"It's a chip shot, he's gotta make it,\" Zimmer said, insisting that his team had done enough for victory.\n\"I've probably never been more proud of a football team than I am of this team,\" he said.\nThe Seahawks, runners-up in last season's Super Bowl and champions two years ago, now advance to a meeting with the National Conference number one seeded Carolina Panthers next week.\nSeattle coach Pete Carroll paid tribute to his team's never-say-die approach.\n\"This was really a survival game for both teams,\" Carroll said. \"It was an amazing defensive effort on both sides; it was one of those all-day jobs.\"\nAdded Seahawks cornerback Richard Sherman: \"The football gods were with us today.\"\n- Packers back in synch -\nIn Washington, the Redskins' unlikely run to the postseason came to an abrupt end as Aaron Rodgers and Green Bay rediscovered their best form to clinch a convincing 35-18 victory.\nRedskins quarterback Kirk Cousins was sacked six times as the Packers roared back from 11-0 down to overpower the home side at FedExField.\nRodgers made 21 of 36 for 210 yards and two touchdowns while the Packers also made yardage on their running game.\n\"We just needed a game like this to get our mojo back and get our confidence going,\" said Rodgers, who had been under close scrutiny during his team's regular-season offensive struggles.\nGreen Bay head coach Mike McCarthy said the display should end discussion of the Packers' offensive weaknesses.\n\"When you get in the playoffs you don't have to talk about the regular season anymore,\" he said.\nRunning backs Eddie Lacy and James Starks both crossed for touchdowns as the Packers booked a visit to Phoenix next Saturday to face the Arizona Cardinals.\nThe win in the NFC first-round game means the Packers will have a chance to avenge their humiliating 38-3 defeat to the Cardinals on December 27.\n\"There's not too many times you have the opportunity to go back and have a re-do,\" McCarthy said. \"We're looking forward to it.\"\nMinnesota Vikings' Teddy Bridgewater communicates at the line of scrimmage during the game against the Seattle Seahawks at TCFBank Stadium on January 10, 2016 ©Hannah Foslien (Getty/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393252/Packers-Seahawks-advance-NFL-playoffs.html"}
