{"authors":[],"date_download":"2018-10-23 01:06:54","date_modify":"2018-10-23 01:06:54","date_publish":"2015-12-16 00:00:00","description":"A political action committee backing Chris Christie is using mobile check-ins at campaign events for all GOP candidates, gathering data that one strategist calls a \"building block\" of modern politics.","filename":"data/vaneerConsumption/PACSupportingChristieScoopsUpVoterDataAcrossNewHampshire.json","image_url":"https://media.npr.org/assets/img/2015/12/16/ap_191272887001_wide-962cf28cfd8c3a410c686507b20248ed361b74ab.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=459936083_1540256814.html","title":"PAC Supporting Christie Scoops Up Voter Data Across New Hampshire","title_page":"PAC Supporting Christie Scoops Up Voter Data Across New Hampshire : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nSomething pretty interesting is happening at campaign events in New Hampshire as people have been checking in online at events with GOP presidential candidate Chris Christie. They've been clicking ads that ask for some personal data. But it's not Christie's campaign asking. It is a political action committee trolling for information on potential voters. Here's NPR's Scott Detrow.\nSCOTT DETROW, BYLINE: When people want to see political candidates in person, they usually need to show up early.\nKURT LUIDHARDT: And then while they're waiting, they're on their mobile phones. And a lot of them are on Facebook looking at what their friends and other folks are saying on Facebook.\nDETROW: That's Kurt Luidhardt, who runs digital operations for a PAC called America Leads, which backs New Jersey Gov. Chris Christie. The political action committee has been running geographically targeted Facebook ads for months now in New Hampshire. The ads ask people to check in for rallies or town halls.\nLUIDHARDT: Every Republican candidate who has an event in New Hampshire we will do this for.\nDETROW: The ads show up on the phones of people within a mile of the event in question, telling them, event check-in is now available. Click on the ad, and it takes you to a screen asking for your name, email, ZIP code and which Republican candidate you support.\nDAVE CARNEY: I haven't heard of that being done.\nDETROW: Dave Carney is a New Hampshire-based Republican political operative.\nCARNEY: That's kind of - I'm not sure the gain is worth the pain in terms of getting caught, basically being disingenuous, trolling those supporters.\nDETROW: Carney says, yeah, a lot of campaigns are using geographically targeted ads these days but not like this. Luidhardt and America Leads say everything is above board, that the ads identify themselves as from the PAC.\nLUIDHARDT: I think it's very similar to taking a survey outside of an event just asking people where they stand on the campaign. And we aren't misrepresenting ourselves or who we are.\nDETROW: Regardless, America Leads says it's gotten information about thousands of likely New Hampshire voters this way. It takes that data, names, emails and who people are supporting, and adds it to its big list of information about eligible voters. Republican digital strategist Patrick Ruffini says that voter information is a fundamental building block of modern politics, which allows campaigns to create a list of their most likely supporters.\nPATRICK RUFFINI: And prioritize them for outreach based on how likely they are to vote, whether or not they might support you, and different other sorts of characteristics.\nDETROW: That's why most campaigns do everything they can to find out more information about these voters, including calling them, knocking on their doors, and buying data. In a field where five other candidates are within about three points of Chris Christie in the latest New Hampshire polls, the PAC clearly feels like every piece of data it can gather is worthwhile. Scott Detrow, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=459936083"}
