{"authors":["Press Association"],"date_download":"2018-10-23 01:32:05","date_modify":"2018-10-23 01:32:05","date_publish":"2017-03-16 11:38:09","description":"The 54-year-old Brit played an integral role in Mercedes´ domination in Formula One in recent times.","filename":"data/vaneerConsumption/PaddyLowereturnstoWilliamsaschieftechnicalofficer.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-228053-1489664293-207_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319782_Paddy-Lowe-returns-Williams-chief-technical-officer_1540258325.html","title":"Paddy Lowe returns to Williams as chief technical officer","title_page":"Paddy Lowe returns to Williams as chief technical officer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Mercedes executive director Paddy Lowe has been appointed chief technical officer at Williams, where he will also take a shareholding in the company.\nThe 54-year-old Brit, who began his career in the sport at Williams, returns to take responsibility for the engineering operation at the team’s Grove headquarters, while he also joins the board of directors and becomes a shareholder for the Williams Group.\nLowe played an integral role in Mercedes’ domination in Formula One in recent times, culminating in a hat-trick of successive constructor and driver titles before leaving the German constructor – to make way for James Allison – and being placed on gardening leave in January.\nWe are pleased to announce the appointment of Paddy Lowe as Chief Technical Officer for the Williams Group#Williams40 #WeAreRacing pic.twitter.com/wchfp0o7qv — WILLIAMS RACING (@WilliamsRacing) March 16, 2017\nLowe, who joined Mercedes in 2013, was highly tipped for this leading role at Williams after chief technical officer Pat Symonds parted company with the British team last year.\nLowe said: “It is a huge honour to return in this leadership position and to have the opportunity to become a shareholder. I am extremely motivated to play my part in bringing success back to the team.\n“The vision for the future set out by the Williams board is powerful and has compelled me to join an organisation committed to building on its unique legacy and to reaching the pinnacle of Formula One once again.”\nThe move marks Lowe’s second career at Williams following a six-year stint as a control systems engineer with the team from 1987 before a 20-year spell at McLaren prior to his Mercedes move.\nPaddy Lowe\n“I’ve always had a deep respect for Williams – my first team in Formula One,” Lowe added.\n“I’m looking forward to this exciting new phase to my career working with (deputy team principal) Claire (Williams), (group CEO) Mike (O’Driscoll) and (chairman of the board) Nick (Rose) and with the rest of this great team – especially (Sir) Frank (Williams) himself, who is one of the most committed ‘racers’ I know.”\nDuring his 29 years in the sport, Lowe has contributed to a massive 158 race wins, seven drivers’ championship titles and five constructors’ titles.\nClaire Williams said: “I am delighted that the team is welcoming Paddy back to Williams in the role of chief technical officer.\nClaire Williams\n“Having someone of Paddy’s calibre and engineering competence is not only a morale boost for everyone at Williams but I know it will also significantly support our efforts to return this team back to the front of the grid.\n“Our ambitions at Williams are unwavering, we want to win races and championships, but to do that you need the best talent in the business.\n“In Paddy we believe we have just that, as well as a leader who will drive change. This is a game changer for us and once again makes us extremely excited about this team’s future.”","url":"https://www.dailymail.co.uk/wires/pa/article-4319782/Paddy-Lowe-returns-Williams-chief-technical-officer.html"}
