{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:04:12","date_modify":"2018-10-22 22:04:12","date_publish":"2017-04-26 03:24:07","description":"The 46-year-old Top Chef host showed off her ample cleavage in the full-length number..","filename":"data/vaneerConsumption/PadmaLakshmipourscurvesintorosethemedstraplessgown.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BCF7C00000578-0-image-a-73_1493173398806.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446120_Padma-Lakshmi-pours-curves-rose-themed-strapless-gown_1540245852.html","title":"Padma Lakshmi pours curves into rose-themed strapless gown","title_page":"Padma Lakshmi pours curves into rose-themed strapless gown | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cookbook author and host of TV's Top Chef Padma Lakshmi put her best assets on show as she arrived at the TIME 100 gala on Tuesday night in New York.\nThe 46-year-old showed off her ample cleavage in a strapless gown.\nThe full-length number featured pink roses and rosebuds.\nScroll down for video\nPretty gown: : Cookbook author and host of TV's Top Chef Padma Lakshmi put her best assets on show as she arrived at the TIME 100 gala on Tuesday night in New York\nPadma's gown had panels at the waist and hips before falling to the floor in a full skirt.\nThe Indian-born beauty wore her long dark hair loose with a center parting.\nShe accessorized with a blue ribbon ACLU badge.\nGorgeous: The 46-year-old Indian-born beauty showed off her ample cleavage in the strapless gown that featured pink roses and rosebuds\nMade up: Padma wore her long hair loose with a center parting and added black mascara to her lashes and some glossy pink color to her lips\nThe Top Chef host rubbed shoulders with a roomful of celebrities at the annual event that celebrates TIME magazine's list of influential people.\nOther guests included Ryan Reynolds and Blake Lively, Viola Davis, Leslie Jones, Margot Robbie and Megyn Kelly.\nShe was clearly excited at meeting filmmaker Barry Jenkins as she shared a selfie to Instagram showing herself with the director of the Oscar Best Picture Moonlight.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446120/Padma-Lakshmi-pours-curves-rose-themed-strapless-gown.html"}
