{"authors":["Chris Cutmore For Mailonline"],"date_download":"2018-10-23 00:10:19","date_modify":"2018-10-23 00:10:19","date_publish":"2017-04-26 09:34:31","description":"Padraig Harrington has revealed he held clear-the-air talks with Sergio Garcia after calling the Masters champion a 'very sore loser' in the wake of the latter's victory at Augusta National.","filename":"data/vaneerConsumption/PadraigHarringtonandSergioGarciaendfeud.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F984E7400000578-0-image-a-8_1493195615120.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-4446808_Padraig-Harrington-Sergio-Garcia-end-feud_1540253419.html","title":"Padraig Harrington and Sergio Garcia end feud","title_page":"Padraig Harrington and Sergio Garcia end feud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Padraig Harrington has revealed he held clear-the-air talks with Sergio Garcia after calling the Masters champion a 'very sore loser' in the wake of the Spaniard's victory at Augusta National.\nThe duo have endured a frosty relationship for years despite being Ryder Cup team-mates, and their enmity resurfaced earlier this month with Harrington's stinging criticism of the Spaniard, despite his first major win.\nYet Harrington claimed that his relationship with Garcia was now 'the best it has ever been' and 'in a great place' after their meeting, which is rumoured to have happened at Rory McIlroy's wedding to Erica Stoll in Ireland last Saturday.\nPadraig Harrington spoke at an Open Championship media day in Ireland on Tuesday\nHe revealed that his relationship with old rival Sergio Garcia has improved\n'Sergio and I are on a much better footing,' the 45-year-old Irishman said on Tuesday in quotes reported by the BBC.\n'We've had a chat, because obviously clearly there was a bit of an elephant in the room about what I said.\n'We have decided that we will look, going forward, at our similarities and the good in each of us rather than any other way. So we are in a great place. So if anything, it's worked out for the better.'\nGarcia was celebrating the finest week of his career after winning the Masters but received a reminder of some of his less glorious moments with Harrington's acerbic comments. The Irishman's win at the 2007 Open at Carnoustie following a play-off duel between the rivals was the nadir of their relationship, but their rivalry stretches back to an argument at the Seve Trophy in 2003 between Harrington and Garcia's idol Jose Maria Olazabal.\nHarrington told Irish radio earlier this month that they still only speak to each other 'through gritted teeth' and hit out at Garcia's past behaviour, including spitting in a hole, throwing golf clubs and shoes, and also accused him of not working hard enough on his game.\nGarcia has been on a victory tour since winning the green jacket at Augusta earlier this month\nHis latest stop came at the Bernabeu on Sunday ahead of Real Madrid's match with Barcelona\nBut the timing of Harrington's comments, made on Irish radio, rankled with many as Garcia was finally basking in his first major success at the age of 37. It is thought that Harrington's comments could even hurt his bid to be Ryder Cup captain in future.\nBut Harrington, speaking at an R&A day to promote The Open at Birkdale, where he won the second of his three majors in 2008, appeared to admit that the timing of his words was ill-judged and praised Garcia for his attitude when they spoke.\n'It was something that needed to be done straight away and the opportunity came up straight away,' he said.\n'I've got to say, Sergio made it very easy. He was exceptionally good about it. He already was well informed, which was nice. That he looked into the deal of it and he understood what I was actually saying.'","url":"https://www.dailymail.co.uk/sport/golf/article-4446808/Padraig-Harrington-Sergio-Garcia-end-feud.html"}
