{"authors":["Associated Press"],"date_download":"2018-10-23 00:23:24","date_modify":"2018-10-23 00:23:24","date_publish":"2017-03-10 06:44:10","description":"ISLAMABAD (AP) - Pakistan's parliament is set to debate a bill next week that would legalize trials before military courts for another two years, a measure...","filename":"data/vaneerConsumption/Pakistanassemblytolegalizetrialsbeforemilitarycourts.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300162_Pakistan-assembly-legalize-trials-military-courts_1540254204.html","title":"Pakistan assembly to legalize trials before military courts","title_page":"Pakistan assembly to legalize trials before military courts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISLAMABAD (AP) - Pakistan's parliament is set to debate a bill next week that would legalize trials before military courts for another two years, a measure human rights activists say negates the basic principles of justice and denies those on trial the chance for a fair defense.\nThe bill, designed to combat terrorism, was presented before the lower house of parliament Friday by law minister Zahid Hamid.\nPrime Minister Nawaz Sharif's government was expected to fast-track the draft before lawmakers amid indications the National Assembly - the lower house of parliament - would unanimously back the constitutional amendment.\nAll parties except for slain Prime Minister Benazir Bhutto's Pakistan People's Party agreed on the government proposed draft.\nA member of the PPP, the main opposition party, said her party had suggestions that should be incorporated in the draft. Azra Fazal said the bill was not acceptable unless debated and improved. The session was adjourned until Monday when the debate would take place.\nThe proposed amendment authorizes the military to try any suspect on terrorism-related charges.\nBarrister Zafarullah Khan, adviser to the prime minister on law and human rights, said there was a consensus between all the political parties that under extraordinary circumstances \"we have to set military courts.\" But, he said, there are some small differences on certain points.\nA similar amendment was adopted in 2015, allowing military courts to carry out trials of suspected militants under a two-year mandate, which expired in January.\nThat measure came after a December 2014 Taliban attack at a school in the northwestern city of Peshawar, which killed 154 people, mostly schoolchildren. The assault also prompted Pakistan to lift its moratorium on the death penalty. Since then, more than 400 convicts have been executed, though most were not linked to terrorism-related cases.\nAlong with military trials, Pakistani forces have carried out several military operations against militants in lawless tribal regions bordering Afghanistan, including a major push that began in mid-2014 in North Waziristan, a militant base.\nMilitants in Pakistan have killed tens of thousands of people over the years, seeking to overthrow the government and install their own harsh brand of Islamic law.\nLast month, authorities expanded the powers of the paramilitary Rangers to include the eastern Punjab province. Previously, the force could only pursue and arrest suspects in the provinces of Sindh and Baluchistan, as well as in the northwest.\nRights groups have consistently criticized the military courts, which had a total of 274 cases referred to them over the past two years. During that time, the courts sentenced 161 people to death.\n\"They don't meet the internationally accepted principles of justice. These courts don't give the suspects the right to select a lawyer,\" Zohra Yusuf, who heads the independent Human Rights Commission of Pakistan, told The Associated Press.\nThe trials are conducted by army officers - not lawyers - who lack proper legal background and experience, she said. The trials are held behind closed doors and suspects' families often learn about the rulings against their kin through the media.\nInstead of relying on military courts to be judge, jury and executioner, Yusuf appealed to authorities to reform the country's judicial system.","url":"https://www.dailymail.co.uk/wires/ap/article-4300162/Pakistan-assembly-legalize-trials-military-courts.html"}
