{"authors":["Associated Press"],"date_download":"2018-10-23 04:35:13","date_modify":"2018-10-23 04:35:13","date_publish":"2016-01-11 17:40:57","description":"ISLAMABAD (AP) — Four countries __ Afghanistan, Pakistan, China and the United States __ were cloistered away late into the night Monday trying to lay a foun...","filename":"data/vaneerConsumption/PakistanAfghanistanChinaUSseekroadmaptopeace.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:300044e0e5624871825640be10cfa351-3WAQP5SaQH704788ebcf7e1643d2-368_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393391_Pakistan-Afghanistan-China-US-seek-roadmap-peace_1540269313.html","title":"Pakistan, Afghanistan, China, US seek roadmap to peace","title_page":"Pakistan, Afghanistan, China, US seek roadmap to peace | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pakistan, Afghanistan, China, US seek roadmap to peace\nISLAMABAD (AP) — Four countries __ Afghanistan, Pakistan, China and the United States __ were cloistered away late into the night Monday trying to lay a foundation they hope will eventually lead to peace talks between the Afghan government and Taliban fighters. But in the end, the biggest decision that appeared to be reached was to meet again.\nStill an Afghan official, who was in the meeting but did not want to be identified because he is not authorized to speak to the media, said, \"some good progress\" was made during what turned out to be a marathon session.\nThe Taliban were not invited to the talks and a Taliban official, in a rare face-to-face meeting with The Associated Press, said there would be no direct talks with the Afghan government without first talking to the United States.\nIn this photo released by Associated Press of Pakistan, Afghanistan Deputy Foreign Minister, Hekmat Khalil Karzai, right, shakes hands with Sartaj Aziz, adviser to the Pakistani prime minister on foreign affairs, prior to meeting of delegates from Pakistan, Afghanistan, China and United States who hope to lay the roadmap for peace talks with the Taliban, in Islamabad, Pakistan, Monday, Jan. 11, 2016. The meeting comes as battlefield losses in Afghanistan are mounting and entire swaths of the country that cost hundreds of U.S.-led coalition and Afghan military lives to secure slip back into Taliban hands. Richard Olson, U.S. Special Representative for Afghanistan and Pakistan is seen at left. (Associated Press of Pakistan via AP)\nThe final communique, however, seemed to rule that out.\n\"The participants emphasized the immediate need for direct talks between representatives of the Government of Afghanistan and representatives from Taliban groups in a peace process that aims to preserve Afghanistan's unity, sovereignty and territorial integrity,\" said the communique.\nA small breakaway Taliban group said Monday it was ready for talks. The faction, which emerged following the revelation last year that the Taliban leader and founder Mullah Mohammed Omar had died two years ago, is believed to be relatively small and its absence from the battlefield is unlikely to be a game changer.\nThe Taliban have stepped up attacks across the country and while they have been unable to hold urban centers, the religious militia has operated in rural areas, often dispensing justice and challenging the government's authority. Afghan security forces have taken heavy casualties, particularly since the withdrawal of NATO-led forces from Afghanistan last year. They complain bitterly about inadequate supplies and still rely heavily on U.S. airpower.\nThe presence of the U.S. and China together at the table reflects the urgency of getting talks started. China has historically close ties with Pakistan and while there were four countries represented at Monday's talks, Pakistan — which is often accused of harboring Taliban leaders, including the fierce Haqqani group, a U.S.-declared terrorist group — is seen as the key to getting the largest contingent of Taliban fighters to the table.\nImtiaz Gul, whose Center for Research and Security Studies has delved deeply into the Afghan conflict and Pakistan's decades-old involvement, says Pakistan has significant leverage with the Taliban, led by Omar's replacement Mullah Akhtar Mansoor.\nMilitants in both countries are allied, and getting rid of the Haqqanis, for example, could unleash a violent backlash inside Pakistan where the army has been fighting for several years to defeat a coalition of militant groups largely based in its border areas with Afghanistan, Gul said.\nThat battle has been brutal with thousands of Pakistani soldiers killed and wounded and thousands more Pakistani civilians killed in deadly retaliatory suicide attacks by the militants.\nGul said last month's trip by Pakistan's army chief Gen. Raheel Sharif, who travelled to Afghanistan unaccompanied by the country's powerful ISI intelligence agency, long considered the force behind the Taliban, was a signal the military was ready to move away from past practices and center future policy decisions only at the army headquarters.\nChanges won't come quickly, says Gul, \"but important for us is to turn the page (from supporting militants) and I think Gen. Raheel Sharif has turned that page.\"\nThough the Taliban were not invited to Monday's talks, a senior Taliban official, who spoke on condition of anonymity fearing exposure and capture, told the AP that two Taliban delegates, currently headquartered in Qatar, will meet \"soon\" with China's representatives. The meeting, which will also include Pakistan, is to be held in Islamabad, said the official.\nStill, there seems little to no chance for early peace talks between the Taliban and the Afghan government.\nThe Taliban, struggling to consolidate their leadership council following Omar's death, have drawn their line in the sand: no official talks with Kabul on a peaceful end to their protracted and bloody war until direct talks can be held with the United States.\n\"We want talks with the Americans first because we consider them a direct party,\" the Taliban official said in a face-to-face interview with the AP.\nThe Taliban want recognition of their Qatar office under the banner of the Islamic Emirate of Afghanistan, the name they used when they ruled Afghanistan until they were ousted by the U.S.-led coalition in 2001. They also want the United Nations to remove the Taliban from its wanted list and they want their prisoners released from Afghan jails.\nAfghan President Ashraf Ghani wants no part in giving the Taliban official recognition.\nMaulvi Shazada Shaeid, a representative on Afghanistan's High Peace Council, tasked with seeking peace with the Taliban, said the distance between the two sides is vast, holding out little hope for peace.\n\"In the current situation, it is not possible to bring peace,\" he said.\n___\nAssociated Press writer Mirwais Khan in Kandahar, Afghanistan contributed to this report.\nIn this photo released by Associated Press of Pakistan, delegates from Pakistan, Afghanistan, China and United States attend a meeting hoping to lay the roadmap for peace talks with the Taliban, at the foreign ministry in Islamabad, Pakistan, Monday, Jan. 11, 2016. The meeting comes as battlefield losses in Afghanistan are mounting and entire swaths of the country that cost hundreds of U.S.-led coalition and Afghan military lives to secure slip back into Taliban hands. Taliban representatives have not been invited to the talks. (Associated Press of Pakistan via AP)\nPakistani police officers stand at a checkpoint outside the Foreign Ministry where a conference for Afghan peace process is going on, Monday, Jan. 11, 2016 in Islamabad, Pakistan. A key gathering opened on Monday in the Pakistani capital of Islamabad in which four major countries - Afghanistan, Pakistan, China and the United States - hope to lay the roadmap to peace for the war-shattered Afghan nation. (AP Photo/Anjum Naveed)\nA car carrying Chinese diplomats arrives at Foreign Ministry in Islamabad, Pakistan, Monday, Jan. 11, 2016. A key gathering opened on Monday in the Pakistani capital of Islamabad in which four major countries - Afghanistan, Pakistan, China and the United States - hope to lay the roadmap to peace for the war-shattered Afghan nation. (AP Photo/B.K. Bangash)\nPakistani police officers stand at a checkpoint outside the Foreign Ministry where a conference for Afghan peace process is going on, Monday, Jan. 11, 2016 in Islamabad, Pakistan. A key gathering opened on Monday in the Pakistani capital of Islamabad in which four major countries - Afghanistan, Pakistan, China and the United States - hope to lay the roadmap to peace for the war-shattered Afghan nation. (AP Photo/Anjum Naveed)\nFILE - In this April 20, 2015, file photo provided by Pakistan's Press Information Department, Chinese President Xi Jinping, left, shakes hands with Pakistan's army chief Gen. Raheel Sharif, at Nur Khan airbase in Islamabad, Pakistan. Pakistan, Afghanistan, China and the United States are meeting Monday, Jan. 11, 2016, in the Pakistani capital of Islamabad to craft out a roadmap for peace to end an increasingly bloody and protracted Afghan war. But warring sides are miles apart, say analysts and protagonists. The Taliban are not invited to Monday¿s talks. (Press Information Department via AP, File)\nFILE - In this Dec. 9, 2013, file photo, U.S. Defense Secretary Chuck Hagel, left, shakes hands with Pakistani army chief Gen. Raheel Sharif after a meeting in Rawalpindi, Pakistan. Afghanistan, Pakistan, China and the United States are meeting Monday, Jan. 11, 2016, in the Pakistani capital of Islamabad to craft out a roadmap for peace to end an increasingly bloody and protracted Afghan war. But warring sides are miles apart, say analysts and protagonists. The Taliban are not invited to Monday¿s talks. (AP Photo/ Mark Wilson, Pool, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3393391/Pakistan-Afghanistan-China-US-seek-roadmap-peace.html"}
