{"authors":[],"date_download":"2018-10-23 03:44:50","date_modify":"2018-10-23 03:44:50","date_publish":"2016-01-11 16:32:00","description":"Pakistan Monday hosted four-country talks aimed at luring the Afghan Taliban back to the negotiating table with the Kabul government, even as the insurgents ...","filename":"data/vaneerConsumption/PakistanhostsfourwaytalkstoreviveAfghanpeaceprocess.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5lh-48qEJGFphM8d437f0aaf926f477a-650_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393268_Pakistan-host-four-way-talks-revive-Afghan-peace-process_1540266290.html","title":"Pakistan hosts four-way talks to revive Afghan peace process","title_page":"Pakistan hosts four-way talks to revive Afghan peace process | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pakistan hosts four-way talks to revive Afghan peace process\nPakistan Monday hosted four-country talks aimed at luring the Afghan Taliban back to the negotiating table with the Kabul government, even as the insurgents wage an unprecedented winter campaign of violence.\nThe talks in Islamabad, announced in December, came as the Taliban's insurgency intensifies, particularly in the country's south, testing the capacity of Afghanistan's overstretched military and placing pressure on Pakistan to rein in its one-time proxies.\nThe delegations were led by Afghan Deputy Foreign Minister Hekmat Khalil Karzai, Pakistan's Foreign Secretary Aizaz Ahmad Chaudhry, US special representative for Afghanistan and Pakistan ambassador Richard Olson and China's special envoy for Afghanistan ambassador Deng Xijun.\nA damaged vehicle near the site of a suicide car bomb attack at a French restaurant in Kabul on January 2, 2016 ©Wakil Kohsar (AFP/File)\n\"The participants emphasised the immediate need for direct talks between representatives of the government of Afghanistan and representatives from Taliban groups in a peace process that aims to preserve Afghanistan's unity, sovereignty and territorial integrity,\" a joint statement said after the meeting.\n\"The group would hold discussions on a roadmap at its next meeting to be held on 18th January 2016 in Kabul,\" it said.\nSome analysts hope the added presence of China and the United States may help overcome mistrust between Kabul and Islamabad, though it remains unclear when the Taliban themselves will return to the negotiating table.\nThey are not part of this week's talks.\n\"The primary objective of the reconciliation process is to create conditions to bring the Taliban groups to the negotiation table and offer them incentives that can persuade them to move away from using violence,\" said Sartaj Aziz, Pakistan's top foreign affairs official, as he opened the talks.\nThe so-called \"roadmap\" talks are meant to lay the groundwork for direct dialogue between the Afghan government and the Islamist group, whose bloody insurgency shows no signs of abating more than 14 years after they were ousted from power by a US-led coalition.\nPakistan was among three countries that recognised the Taliban's 1996-2001 regime and it is widely seen as wielding influence over them today.\nAziz cautioned against \"unrealistic targets and deadlines\" and hinted it was unlikely major breakthroughs would be announced soon.\n\"Keeping in view the sensitive nature of the group's work, it should be our endeavour to keep the work of this group out of media glare, as much as possible,\" he said.\nShuja Nawaz, director of the Atlantic Council's South Asia Center, said the discussions gave \"cautious hope\" that peace negotiations can soon begin again in earnest.\n- Taliban infighting -\nA first round of dialogue with the Taliban themselves was held in July but collapsed after the group belatedly confirmed their leader Mullah Omar was dead.\nThe news sparked infighting between senior Taliban leaders and the group's new chief Mullah Akhtar Mansour, which in turn led to the creation of a new faction headed by Mohamed Rasool in November.\nMansour himself was shot and wounded near the Pakistani city of Quetta in December, apparently by one of his own men, according to sources with the group.\nA senior Taliban source from Mansour's faction told AFP that Pakistan had been in touch with Taliban leaders, but the group was waiting to see whether their rivals from Rasool's faction were also likely to attend future talks.\n\"As far as I know, the Taliban leadership is willing to attend any such meeting in future but we will also see which other Afghan group or a Taliban splinter group will be invited for these proposed peace talks,\" he said.\nRahimullah Yousufzai, an expert on the group, termed the talks an \"important development\", adding the presence of the US and China provided extra weight.\nBut he cautioned: \"The Taliban have not yet showed their willingness to talk. They said their first priority is to end their differences. In my opinion the splinter Rasool group will come but the presence of Mansour's group is very important, so let us wait to see how they react.\"\nBut despite the internal rifts and the onset of winter, when the Taliban traditionally break off fighting, the insurgents are still staging brazen attacks.\nIn September they briefly seized the northern provincial capital of Kunduz, and in recent weeks they have seized large swathes of the key opium-rich district of Sangin in the southern province of Helmand, their traditional stronghold.\nObservers say the intensifying fighting highlights a push by the militants to gain greater concessions during any future direct talks.","url":"https://www.dailymail.co.uk/wires/afp/article-3393268/Pakistan-host-four-way-talks-revive-Afghan-peace-process.html"}
