{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 19:02:58","date_modify":"2018-10-30 19:02:58","date_publish":"2016-03-16 08:27:47","description":"A Pakistan conference of religious groups and political parties called the government to retract an “un-Islamic” law that protects female violence victims","filename":"data/vaneerConsumption/PakistaniMuslimConferenceDenouncesNewLawProtectingWomenasUnIslamic.json","image_url":"https://media.breitbart.com/media/2015/01/Female-Madrassa_Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_16__1540926178.html","title":"Pakistani Muslim Conference Denounces New Law Protecting Women as ‘Un-Islamic’","title_page":"Pakistani Muslim Conference Denounces New Law Protecting Women as ‘Un-Islamic’","title_rss":"NULL","source_domain":"breitbart.com","text":"A conference of religious groups and political parties convened by an Islamic political party in Pakistan has called on the government to retract an “un-Islamic” law that gives wide-ranging protection to female victims of violence.\nThe Women’s Protection Act was passed by Pakistan’s largest province of Punjab in February to provide legal protection to women from domestic, psychological and sexual violence. Provisions of the act include a toll-free abuse reporting hotline, the establishment of women’s shelters and district-level panels to investigate reports of abuse. The new law also requires the use of GPS bracelets to keep track of offenders.\nJamaat-e-Islami, Pakistan’s oldest Islamic party, gathered more than 35 religious parties and groups Tuesday to unite behind an appeal that the Pakistani government retract the law, claiming that it violates the Qur’an and opposes both Islam and the Pakistani constitution.\nThe Qur’an provides for the rights of husbands to beat their wives if they find them to be disobedient, offering divine sanction for what Pakistan’s new law condemns as domestic abuse.\nMen have authority over women because Allah has made the one superior to the other, and because they spend their wealth to maintain them. Good women are obedient. They guard their unseen parts because Allah has guarded them. As for those from whom you fear disobedience, admonish them and send them to beds apart and beat them. (Qur’an 4:34)\nThe group said that the un-Islamic law is part of a campaign by the West to destroy the family system in Pakistan. “This controversial law to protect women was promulgated to accomplish the West’s agenda to destroy the family system in Pakistan,” reads the joint declaration from the conference.\nAccording to a 2011 report, Pakistan is the third most dangerous country in the world for women, following Afghanistan and Congo. The report, released by the Thomson Reuters Foundation, cited cultural, tribal and religious practices harmful to women, including acid attacks, child and forced marriage and punishment or retribution by stoning or other physical abuse.\nMore than 1,000 women and girls are victims of “honor killings” every year, according to Pakistan’s Human Rights Commission, and 90% of women in Pakistan suffer from domestic violence.\nEarlier this month, the Council of Islamic Ideology (CII), which advises the government on the compatibility of laws with Islam, stated that the new law criminalizing violence against women was “un-Islamic.”\n“The whole law is wrong,” said Muhammad Khan Sherani, the head of CII, who cited verses from the Qur’an to reveal the law’s incompatibility with Islamic teaching.\nIn 2013, some 5,800 cases of violence against women were reported in Punjab province alone, according to the Aurat Foundation, a women’s rights advocacy group.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2016/03/16/pakistani-muslim-conference-denounces-new-law-protecting-women-as-un-islamic/"}
