{"authors":["John Hayward"],"date_download":"2018-10-30 17:59:56","date_modify":"2018-10-30 17:59:56","date_publish":"2015-05-02 01:02:19","description":"\"According to media reports, the food items in relief aid sent by Pakistan to Nepal included beef content (beef masala) in the food packets. Eating beef is prohibited in Hindu religion. Nepal is a majority-Hindu nation.\"","filename":"data/vaneerConsumption/PakistanAccidentallySendsBeeftoHinduSurvivorsofQuake.json","image_url":"https://media.breitbart.com/media/2015/05/Hindu-Woman-Prays-before-Cows-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_01__1540922396.html","title":"Pakistan Accidentally Sends Beef to Hindu Survivors of Quake","title_page":"Pakistan Accidentally Sends Beef to Hindu Survivors of Quake","title_rss":"NULL","source_domain":"breitbart.com","text":"The Times of India relates an awkward mistake in Pakistan’s much-needed, and generally much-appreciated, relief assistance to survivors of the earthquake in Nepal: “According to media reports, the food items in relief aid sent by Pakistan to Nepal included beef content (beef masala) in the food packets. Eating beef is prohibited in Hindu religion. Nepal is a majority-Hindu nation.”\nAs the Pakistani foreign office pointed out, the Meals Ready to Eat (MREs) it shipped to Nepal were clearly labeled as to their content, in both English and Urdu, so the danger of a Nepalese Hindu survivor accidentally chowing down on beef masala was very slim. Pakistan’s National Disaster Management Authority evidently keeps a stock of MREs ready for disaster sites across Asia, and beef is only problematic in areas with large Hindu populations, such as India and Nepal.\nIt seems clear enough that the beef shipment was a simple mistake, but the Indian media still gave Pakistan a hard time over it. Here, for example, is how India’s Mail Today reported the incident:\nA day after Mail Today broke the story about Pakistan sending food packets containing ‘beef masala’ to earthquake-hit Nepal as part of its aid package, Islamabad tried hard to save face amid severe criticism on the social media(@Mail_Today#BeefRelief). Initially, the Pakistan government sought to pass the buck and said its Air Force was responsible for distributing the food packets and, hence, the government wasn’t at fault. Later in the day, it retracted the statement and said the food packets clearly mentioned the contents in English as well as in Urdu, and left it for the people to choose whether they wanted to eat it. Even after repeated attempts, Pakistan’s National Disaster Management Authority (NDMA) spokesperson Ahmed Kamal did not answer any calls or messages by Mail Today.\nMail Today relates calls from some Nepalese for Pakistan to apologize for sending the forbidden food — one official from an Indian relief agency went as far as advising the government of Nepal to “contemplate serious action against Pakistan.”\nThis caused Pakistani hackles to rise. “If beef masala was really sent to Nepal, it may have been out of negligence,” said a spokesman for the National Disaster Management Authority. “But making it controversial is like the proverb ‘making a mountain out of a molehill.'”\nA spokeswoman for the Pakistani foreign office added that the Nepalese found their MREs such an effective means of feeding earthquake survivors that they promptly requested another plane full of them, as swiftly as possible… hold the beef masala, please.\n“We appeal to Pakistan’s government to not ignore the cultural and religious sentiments of Nepal,” said health minister Khagraj Adhikari. “People should think about our religious and cultural sentiments before sending such food packets.”","url":"https://www.breitbart.com/national-security/2015/05/01/pakistan-accidentally-sends-beef-to-hindu-survivors-of-nepal-quake/"}
