{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 19:01:13","date_modify":"2018-10-30 19:01:13","date_publish":"2015-03-16 12:21:49","description":"Taliban attack on two Christian churches in Lahore and other acts of violence in Pakistan are exacerbated by a lack of police presence.","filename":"data/vaneerConsumption/PakistaniPoliceWereInaBarWatchingCricketDuringTalibanChurchAttack.json","image_url":"https://media.breitbart.com/media/2015/03/Pakistan-police-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_16__1540926073.html","title":"Pakistani Police Were 'In a Bar Watching Cricket' During Taliban Church Attack","title_page":"Pakistani Police Were 'In a Bar Watching Cricket' During Taliban Church Attack | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pakistani Christians have long protested the lack of government protection from terrorist attacks and random, unsubstantiated accusations of blasphemy. Sunday’s Taliban attack on two Christian churches in Lahore resulted in the death of at least 14 people, with many dozens wounded. Again, a lack of police presence seems to be a contributing factor in the violence.\nFather Bernardo Cervellera, the director of AsiaNews, told Vatican Radio Sunday that both Catholics and Protestants have continually complained of the lack of security on the part of the government of Punjab, where there have been repeated “violence and attacks on churches and mosques on the part of the Taliban.”\nAccording to witnesses Sunday morning, “some of the policemen who were supposed to be guarding these churches, were in a bar watching a cricket match instead.”\nThe priest said that the government of Pakistan has always been “ambiguous towards the Taliban.” On the one hand, he said, “it has always protected them and given them shelter and refuge,” mainly in northern Pakistan, and at the same time, Pakistan is supposedly allied with the international community to combat terrorism.\nCervellera also said that “the Taliban have spread throughout the land because during all these years they have managed to create some 20,000-25,000 Koranic schools that teach fundamentalist Islam,” and as a result, “there are fundamentalists everywhere,” who fight against both Christians and Shiites.\nHe said that the Pakistani Taliban had been emboldened by the successes of ISIS elsewhere. “It seems to me,” he said, “that the Pakistani Taliban, now are emulating the actions of the self-styled Islamic State.”\nOne risk, he said, is the extension of the Islamic State to Pakistan, but a perhaps greater risk is that “of alliances.”\n“The Islamic State is funded by certain Gulf countries and therefore has unlimited financial resources,” he said, “and this leads many terrorist groups, many groups of Islamic fundamentalists, to declare an alliance with them in order to procure funds, weapons and so forth.”\nCervellera said that the recent wave of Islamic fundamentalism in Pakistan shows no sign of abating, and many Christians wind up in jail because of trumped up charges of blasphemy against the Koran or against Mohammed. Often, he said, “they suffer a summary execution inside the prisons, because many times the prison guards themselves are paid to take them out.”\nChristians make up roughly 2 percent of Pakistan’s more than 182 million people and have been the targets of “increasingly intense and deadly violence in recent years.”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/national-security/2015/03/16/pakistani-police-were-in-a-bar-watching-cricket-during-taliban-church-attack/"}
