{"authors":["Simon Jones For Mailonline"],"date_download":"2018-10-23 05:10:14","date_modify":"2018-10-23 05:10:14","date_publish":"2017-04-26 16:44:57","description":"The 23-year-old holding midfielder has been impressing while on loan at Belgian side Zulte Waregem from Lille. Hull City were keen on him in January, but had an £11million bid rebuffed.","filename":"data/vaneerConsumption/PalaceeyeingmoveforexFranceU20starSoualihoMeite.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA09B6600000578-0-image-a-74_1493221340288.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4448302_Palace-eyeing-ex-France-U20-star-Soualiho-Meite_1540271414.html","title":"Palace eyeing move for ex-France U20 star Soualiho Meite","title_page":"Palace eyeing move for ex-France U20 star Soualiho Meite | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crystal Palace are monitoring former France U20 international midfielder Soualiho Meite.\nThe 23-year-old holding player has been impressing while on loan at Belgian side Zulte Waregem from Lille.\nHull City were keen on him in January and were rebuffed in a £11million offer but Meite has also drawn attention from the likes of Borussia Dortmund and Monaco.\nFrenchman Soualiho Meite has impressed on loan at Belgian side Zulte Waregem this season\nMeite (right) is on loan from Lille, and a number of Premier League clubs are interested in him\nStoke and Sunderland have also checked his progress this season.\nPalace manager Sam Allardyce is looking to strengthen his midfield amid concerns over the future of Yohan Cabaye and James McArthur.\nCabaye has starred in central midfield in recent weeks but has been linked with a move to Marseille in the summer, while James McArthur has struggled to regain his place in the side after recovering from a back injury.","url":"https://www.dailymail.co.uk/sport/football/article-4448302/Palace-eyeing-ex-France-U20-star-Soualiho-Meite.html"}
