{"authors":[],"date_download":"2018-10-23 03:26:31","date_modify":"2018-10-23 03:26:31","date_publish":"2016-01-29 18:21:03","description":"Palestinian officials are waging a new campaign at the United Nations to revive peace prospects, with the starting point possibly a Security Council resoluti...","filename":"data/vaneerConsumption/PalestiniansagainappealtoUNtorevivepeaceprocess.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i4d4-4PuZeKVXE7cd9005b2c876d14d16-958_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423250_Palestinians-appeal-UN-revive-peace-process_1540265191.html","title":"Palestinians again appeal to UN to revive peace process","title_page":"Palestinians again appeal to UN to revive peace process | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Palestinians again appeal to UN to revive peace process\nPalestinian officials are waging a new campaign at the United Nations to revive peace prospects, with the starting point possibly a Security Council resolution condemning Israeli settlements, the Palestinian envoy said Friday.\nAmbassador Riyad Mansour rejected the suggestion that prospects for progress were slim because of the US election campaign, which could make Washington more reluctant to put pressure on Israel to compromise.\n\"We will not accept that the year 2016 is a year when we cannot do anything,\" Mansour told reporters.\nRiyad H. Mansour, Permanent Observer of the State of Palestine to the United Nations, addresses the meeting on the situation in the Middle East and Palestine January 26, 2016 at the UN in New York ©UN Photo/Loey Felipe (United Nations/AFP/File)\n\"We have to open some doors to keep the hope alive and keep the two-state solution alive.\"\nMansour said the success of the Iran nuclear deal and progress on the Syrian peace track highlighted the need for a \"collective approach\" to solving the Israeli-Palestinian conflict.\nThe ongoing violence on the ground is likely to worsen if nothing is done, he said, adding that the situation in August and September will be \"much, much worse than what we see now.\"\nA wave of Palestinian knife, gun and car-ramming attacks since October 1 has killed 25 Israelis, according to an AFP count.\nOver the same period, 159 Palestinians have been killed by Israeli forces, most while carrying out attacks and others during clashes and demonstrations.\nThe Palestinian ambassador recently met with the envoys from the permanent Security Council members -- Britain, China, France, Russia and the United States -- to discuss the way forward.\nMansour declined to give details of the talks, including whether the United States, which as Israel's ally has blocked UN action, was open to a Security Council role in reviving the peace process.\nThe Palestinian envoy suggested that a resolution condemning Israel's expansion of Jewish settlements could be a first step, but he stressed that there should be a broader plan.\nThis could include the creation of an international support group, the deployment of observers to trouble spots or the convening of an international peace conference.\n\"The signal has to come from the Security Council,\" he said.\nThe United States used its veto in 2011 to block a UN resolution condemning Israeli settlements, and it has rejected a UN role in the peace process.","url":"https://www.dailymail.co.uk/wires/afp/article-3423250/Palestinians-appeal-UN-revive-peace-process.html"}
