{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 21:12:47","date_modify":"2018-10-30 21:12:47","date_publish":"2017-04-03 19:51:11","description":"The Palestinian Fatah movement’s student body issued a call for violence on April 17, when the PA marks its annual “Prisoner’s Day.”","filename":"data/vaneerConsumption/PalestinianFatahPartyCallsforTerrorismonPrisonersDay.json","image_url":"https://media.breitbart.com/media/2017/03/palestinian.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_03__1540933967.html","title":"Palestinian Fatah Party Calls for Terrorism on 'Prisoner's Day'","title_page":"Palestinian Fatah Party Calls for Terrorism on 'Prisoner's Day'","title_rss":"NULL","source_domain":"breitbart.com","text":"The student body of Palestinian Authority President Mahmoud Abbas’s Fatah movement issued a call for violence on April 17 to mark the Palestinian Authority’s annual “Prisoner’s Day.”\nThe student movement Shabiba issued online calls for students to “turn April 17, 2017 into a fire that will burn the occupiers and burn the land like an inferno” and “escalate the confrontation with the occupier.”\nA post on Fatah’s official Facebook page posted on March 29 said:\nLet us turn April 17, 2017, into a fire that will burn the occupiers and burn the land like an inferno under the feet of the tyrants, and let’s escalate the popular resistance everywhere. Therefore, we call on our brave students and the masses of our people to escalate the confrontation with the occupier at all the places of confrontation.\nShabiba promoted the murder of Israelis by evoking past terror attacks in which 16 Israelis were killed.\nA post by Shabiba translated by the NGO Palestinian Media Watch reads:\nWe hold the Nazi occupation gang responsible for what will happen. We warn against taking any steps of oppression against our brave prisoners. We declare in a clear manner that splits the sky: Fatah and its Shabiba are committed to a promise. We will not hesitate to burn the land under the feet of the tyrants if [Israel] harms the prisoners. Whoever wants to test us should remember the Wadi Al-Haramiya operation, the Ein Arik operation, and the hundreds of heroic operations that were carried out by Fatah members and the fighters of our people.\nThe Wadi Al-Haramiya and Ein Arik “operations” were two terror attacks in 2002 in which 16 Israelis were killed.\nThe posts by Fatah and its student movement continue an ongoing trend in which PA President Mahmoud Abbas expresses a willingness to compromise and negotiate with Israel in official statements and in English while his party promotes violence and glorifies terrorists on its social media pages.\nThe Facebook posts were accompanied by pictures of Marwan Barghouti, former leader of the Tanzim movement that was responsible for numerous terror attacks. Barghouti, an architect of the deadly Second Palestinian Intifada, is serving five life sentences in an Israeli prison.\nA logo accompanying the posts shows a map of the entire State of Israel in the colors of the Palestinian flag, contradicting the official PA position that it negotiates on the basis of the 1967 borders.\nIsrael has consistently stated that incitement coming from the top echelons of the PA leadership is largely responsible for a wave of terror attacks that started in October 2015 and lasted almost a year.","url":"https://www.breitbart.com/middle-east/2017/04/03/palestinian-fatah-party-calls-for-terrorism-on-prisoners-day/"}
