{"authors":[],"date_download":"2018-10-23 05:11:19","date_modify":"2018-10-23 05:11:19","date_publish":"2017-03-16 16:13:14","description":"Palestinian leader Mahmoud Abbas said Thursday he hopes recent meetings with US President Donald Trump's team lead to \"peace\" between Israelis and...","filename":"data/vaneerConsumption/PalestinianleaderAbbassaysTrumpbringshopeforpeace.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/16/wire-229391-1489680797-848_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320868_Palestinian-leader-Abbas-says-Trump-brings-hope-peace_1540271479.html","title":"Palestinian leader Abbas says Trump brings hope for 'peace'","title_page":"Palestinian leader Abbas says Trump brings hope for 'peace' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Palestinian leader Mahmud Abbas, after meeting Bosnia's President Mladen Ivanic (L) in the West Bank city of Ramallah on March 16, 2017, says he hopes contacts with Donald Trump's team lead to Israeli-Palestinian peace\nPalestinian leader Mahmoud Abbas said Thursday he hopes recent meetings with US President Donald Trump's team lead to \"peace\" between Israelis and Palestinians.\nTrump called the Palestinian president on March 10 for the first time since his inauguration, inviting him to the White House.\n\"We'll decide on (the date of) this meeting as quickly as possible,\" Abbas told a press conference at his presidential complex in the occupied West Bank.\nAbbas welcomed the visits to Ramallah of several US officials, including CIA chief Mike Pompeo in mid-February and Trump's special representative for international negotiations, Jason Greenblatt, whom he met on Tuesday.\n\"We have exchanged many ideas,\" Abbas said. \"Our hope is that those contacts result in the end in a peace that is led by the United States and the international community.\"\nThe next major diplomatic rendezvous for the Palestinians is March 29, when the heads of states of the Arab League will meet in Jordan.\n\"All the eyes of the Arab states will be turned toward the capitals of the world, especially Washington to see what can be done by this administration (American) who said it wants to reach peace,\" said Abbas after receiving Bosnian President Mladen Ivanic.","url":"https://www.dailymail.co.uk/wires/afp/article-4320868/Palestinian-leader-Abbas-says-Trump-brings-hope-peace.html"}
