{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:05:24","date_modify":"2018-10-30 21:05:24","date_publish":"2016-02-02 13:49:12","description":"TEL AVIV - The Palestinian Authority slammed Israel's decision to expand the prayer section of the Western Wall to accommodate egalitarian services, with |","filename":"data/vaneerConsumption/PalestinianAuthorityJewsHavenoConnectiontoWesternWall.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-472313110.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_02_02__1540933524.html","title":"Palestinian Authority: Jews Have no Connection to Western Wall","title_page":"Palestinian Authority: Jews Have no Connection to Western Wall","title_rss":"NULL","source_domain":"breitbart.com","text":"The PA further claimed that the move marked another “dangerous scheme” by Israel’s government to change the status quo on the Temple Mount.\nIsrael’s landmark decision marks a turning point for Jewish pluralism, allowing women to read from the Torah at Judaism’s holiest site – a measure that Orthodox groups vociferously opposed.\nPalestinian Minister for Wakf and Religious Affairs, Sheikh Yusef Edais, said he opposed the decision to “allocate a mixed prayer section for Jewish men and women” at the Western Wall, which he referred to by its Islamic name, al-Buraq.\nEdais claimed that the expanded prayer plaza is an inseparable part of the al-Aqsa Mosque and is Muslim-owned property.\nIsrael’s “dangerous schemes against Jerusalem, including ongoing intervention in the affairs of the Haram Al-Sharif (Temple Mount), massive excavations beneath al-Aqsa Mosque under the pretext of searching for ostensible monuments, and intensive settlement plans in the city are part of an attempt to change the status quo at the Haram Al-Sharif,” Edais said.\nAccording to the Jerusalem Post, Edais further accused Israel of “Judaizing” Jerusalem and isolating it from surrounding Arab communities.\n“Al-Aqsa Mosque is part of the faith of the Muslims and belongs only to Muslims,” Edais said. “This includes all its structures, yards, walls, and gates. The Jews have no connection to it whatsoever. This offensive against Jerusalem is aimed at consolidating the occupation in it and turning it into a Jewish city by falsifying its history and displacing its original residents.”\nSheikh Muhammad Hussein, the Grand Mufti of Jerusalem, also condemned the move.\nHussein said in a statement that the prayer space adjacent to the Western Wall is “the property of the Islamic Waqf, taken by the Israeli occupation in 1967.”\nHe described the decision as a “brutal attack on the Waqf and additional evidence of the Israeli aggression against Muslim holy places in an attempt to Judaize Jerusalem.”","url":"https://www.breitbart.com/middle-east/2016/02/02/palestinian-authority-jews-have-no-connection-to-western-wall/"}
