{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:43:02","date_modify":"2018-10-30 18:43:02","date_publish":"2016-03-29 16:07:13","description":"Palestinian Authority Security officers tore out the beard of a Muslim cleric over his criticism of the PA, according to Hizb ut-Tahrir.","filename":"data/vaneerConsumption/PalestinianAuthorityOfficersTearOutBeardofMuslimClericforBashingPA.json","image_url":"https://media.breitbart.com/media/2016/03/mon.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_03_29__1540924982.html","title":"Palestinian Authority Officers Tear Out Beard of Muslim Cleric for Bashing PA","title_page":"Palestinian Authority Officers Tear Out Beard of Muslim Cleric for Bashing PA","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Palestinian Authority Security officers tore out the beard of a Muslim cleric over his criticism of the PA, according to Hizb ut-Tahrir (Party of Liberation), a radical Islamist group which seeks to re-establish the “Islamic Caliphate.”\nThe group said that Sheikh Yunis Raba’a, from Dahiryah near the West Bank city of Hebron, was arrested Friday by officers of the PA’s Preventive Security Force after he condemned the PA for agreeing to hand over a monastery in Hebron to the Russian Orthodox Church Outside Russia (ROCOR), the Jerusalem Post reported.\nThe dispute dates back a century to the 1917 Russian Revolution. The Russian Orthodox Church split into the Communist Red Church in Moscow and the exiled White Church in New York. The Russian Orthodox Church’s extensive land-holdings in Israel have since been contested.\nHebron residents claim that the monastery is Muslim property and have criticized the PA for the handover.\nHizb ut-Tahrir charged the PA of “giving up Palestine” and condemned it for pursuing security coordination with Israel. It said that the actions of the PA security forces “remind us of Abu Ghraib and Guantanamo prisons, the ripping of the Koran, and the infidels who work towards degrading Muslims and prophet Muhammad.”\nReferring to the arrest of Raba’a, a Hizb ut-Tahrir spokesman said that PA security officers “attacked him and forced him into their car. One of them grabbed him by the beard, which he was wearing following the example of Prophet Muhammad. This criminal coward plucked out the beard of the sheik, throwing the hair under his feet while his hands were handcuffed by the criminals.”\nIn 1997, Patriarch of Moscow Alexei II and late PLO leader Yasser Arafat attempted to visit the ROCOR-held Abraham’s Oak Holy Trinity Monastery. Clergymen at the site barred them from entering.\nTwo weeks later, Palestinian Authority police officers arrived and evicted the ROCOR clergy by “assaulting and cursing priests and nuns.” The PA subsequently turned over the property to the rival Russian Patriarch in Moscow, the ROC.","url":"https://www.breitbart.com/middle-east/2016/03/29/palestinian-authority-officers-rip-out-beard-of-muslim-cleric-for-bashing-pa/"}
