{"authors":[],"date_download":"2018-10-22 21:37:06","date_modify":"2018-10-22 21:37:06","date_publish":"2016-01-28 08:25:52","description":"A Palestinian teen stabbed and seriously wounded an Israeli man at a petrol station outside a West Bank settlement before being apprehended, police said Thur...","filename":"data/vaneerConsumption/PalestinianseriouslywoundsIsraeliinWestBankstabbing.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g6e6-4vVdYopwYQ7f641721b07aac6fd6-114_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420530_Palestinian-seriously-wounds-Israeli-West-Bank-stabbing_1540244226.html","title":"Palestinian seriously wounds Israeli in West Bank stabbing","title_page":"Palestinian seriously wounds Israeli in West Bank stabbing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Palestinian seriously wounds Israeli in West Bank stabbing\nA Palestinian teen stabbed and seriously wounded an Israeli man at a petrol station outside a West Bank settlement before being apprehended, police said Thursday.\nThe 17-year-old Palestinian male from Bir Nabala, a village south of Ramallah, stabbed the ultra-Orthodox Israeli Jew twice in the back near the Givat Zeev settlement on Wednesday night and then fled.\nBystanders pursued the stabber, who meanwhile discarded the knife, and subdued him until police arrived at the scene and arrested him, a police statement read.\nIsraeli soldiers stand guard at a checkpoint near the settlement of Beit Horon in the West Bank, a short distance from the Givat Zeev settlement where a Palestinian teen stabbed and seriously wounded an Israeli man ©Ahmad Gharabli (AFP)\nMagen David Adom medics evacuated the Israeli to Shaare Zedek hospital in Jerusalem in serious condition, where he was being treated. The Palestinian was taken to Hadassah hospital in Jerusalem with light wounds.\nGivat Zeev is a short distance from Beit Horon, where on Monday two Palestinians stabbed an Israeli woman to death and wounded another before being shot dead by a security guard.\nPrime Minister Benjamin Netanyahu told the army following Monday's attack to submit a \"comprehensive plan\" to better ensure the security of settlements.\nA wave of Palestinian knife, gun and car-ramming attacks since October 1 has killed 25 Israelis, as well as an American and an Eritrean, according to an AFP count.","url":"https://www.dailymail.co.uk/wires/afp/article-3420530/Palestinian-seriously-wounds-Israeli-West-Bank-stabbing.html"}
