{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 17:55:29","date_modify":"2018-10-30 17:55:29","date_publish":"2015-10-06 04:41:26","description":"Over the weekend, Palestinian terrorists murdered Jewish men and women and attempted to kill infants.","filename":"data/vaneerConsumption/PalestinianLeadersIncitementTriggersTerrorGroupThreats.json","image_url":"https://media.breitbart.com/media/2015/08/Mahmoud-Abbas-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_05__1540922129.html","title":"Palestinian Leader's Incitement Triggers Terror Group Threats","title_page":"Palestinian Leader's Incitement Triggers Terror Group Threats","title_rss":"NULL","source_domain":"breitbart.com","text":"Over the weekend, Palestinian terrorists ran wild within the State of Israel and the Palestinian territories, murdering Jewish men and women and attempting to kill infants. Yet, Palestinian Authority head Mahmoud Abbas has refused to condemn this violence, instead blaming Israel for defending itself.\nAbbas has riled up Palestinian society by claiming that Israel’s Jews are supposedly “desecrating” the Al Aqsa mosque in Jerusalem without evidence.\nNow, Palestinian Islamic Jihad (PIJ), an Iran-backed terrorist group formed in the 80s with the expressed goal of destroying the State of Israel, has threatened to deploy suicide bombers throughout Israel and the Palestinian-controlled territories, leading to fears that another Palestinian terror campaign—such as the first and second intifadas—is fast approaching.\nThe terrorist group posted a video to YouTube late Sunday that showed an Islamic Jihad fighter readying himself to carry out a suicide attack on a bus while disguised as a member of the Israeli Defense Forces (IDF). The video shows clips of what appears to be the production of a suicide device, which the Times of Israel notes was commonplace during the Second Intifada.\nMoreover, PIJ claimed credit for a Palestinian terror attack on Saturday, when Muhannad Halabi, 19, killed two Israeli men in Jerusalem, while stabbing a woman and her baby in the process.\n“Halabi, 19, is a member of Islamic Jihad,” a spokesman for PIJ told AFP.\nThe attack was praised throughout Palestinian society.\nHamas, the militant Islamist group that rules the Gaza Strip, called the unprovoked slaughter “a heroic act of resistance.”\nThe Palestinian Authority (PA), which is supposedly the “moderate” faction of Palestinian leadership, called on the world to intervene and stop Israel from killing proven terrorists. PA spokesman Ihab Bseiso said through the official Palestinian news agency Wafa that Ramallah condemns “the killing of two young men” who were responsible for killing Jews “in occupied Jerusalem and the series of incursions into cities and villages in the West Bank.”\nIsrael is attempting to respond to the terror attacks by escalating the IDF’s presence throughout Jerusalem. Recognizing that Palestinian Imams tend to incite their congregations in mosques during prayers, Israeli authorities have temporarily restricted Muslim prayer at the Temple Mount only to males over 50 and females of all ages.","url":"https://www.breitbart.com/national-security/2015/10/05/palestinian-leaders-incitement-terror-group-calls-suicide-bombers/"}
