{"authors":[],"date_download":"2018-10-30 01:15:06","date_modify":"2018-10-30 01:15:06","date_publish":"2016-08-29 00:22:42","description":null,"filename":"data/vaneerConsumption/PalestinianParentsSendingChildrentoCampKilltheJew.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Fire.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862106.html","title":"Palestinian Parents Sending Children to Camp Kill the Jew","title_page":"Palestinian Parents Sending Children to Camp Kill the JewThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It’s August. Camp has ended — that rite of summer for millions of American children. Swimming, hiking, campfire sing-alongs and S’mores, drama skits, lanyard-making, new friends and creating lifelong memories.\nPalestinian summer camps have also just ended, but their children have very different experiences to share and memories to hold dear.\nThis year’s theme for Hamas summer camps, attended by tens of thousands of children in Gaza, was the “Al-Quds (Jerusalem) Intifada.”\nThe primary focus of these summer camps is to indoctrinate young children with radical jihadist ideology and to prepare them for martyrdom (suicide) operations. A “counselor” explains, “The goal of these camps is to instill the spirit of Jihad and of fighting in these cubs.” Ibrahim Al-Madhoun, a columnist for the Hamas Al-Risalah, wrote, “These camps will lay the foundations for building a broad popular army.”\nTo that end, at Palestinian summer camp, young children learned to fire machine guns, crawl through tunnels and beneath barbed wire, handle rocket launchers and plant mines. They were taught kidnapping techniques for capturing Israeli soldiers and even had fun shooting at images of Israeli Prime Minister Netanyahu.\nBecause the summer camp theme was Jerusalem Intifada, which is the name for the wave of knifing attacks that Israeli civilians have faced since last fall, the children were also taught how to use knives as murder weapons.\nThe names of the summer camps reflect the Al-Quds Intifada theme: One is called the “Knife Camp,” another, “Soldiers of Al-Quds.”\nSummer camps in the disputed territories (aka West Bank) are often named for terrorist “martyrs” whom the children are taught to venerate as role models — terrorists like Dalal Mughrabi who, in 1978, killed 15 Israeli civilians and wounded over 60, and Abu Jihad, deputy to Yasser Arafat who headed the PLO terror organization’s military wing and planned many deadly attacks against Israeli civilians, including the 1978 killing of 37 civilians, 12 of them children.\nAccording to Israeli Palestinian journalist Khaled Abu Toameh, the families are not hesitant to send their children to be trained as future jihadis and express pride in having their children taught how to use various types of weapons.\nOf course, Palestinian campers do participate in drama production, but not “Tales of the Arabian Nights” or “Sinbad the Sailor.” As part of the closing ceremony at a Palestinian summer camp, children performed a play whose message was that Palestinian prisoners were being killed in cold blood by Israelis. Some children played the role of Israeli jailers and others the role of the murdered Palestinians.\nIncitement and violence are taught side by side with swimming and soccer. The indoctrination is comparable to Hitler’s youth groups. Children as young as five learn that Israelis are the greatest evil on earth and come to see jihad against the Jews as the path to martyrdom in the name of Allah.\nThis is a far cry from the cooperation, compromise, tolerance and respect for others that American summer camps hope to instill in their campers — values that emphasize the importance of working out problems rather than resorting to violence. Only a Palestinian summer camp would take an impressionable child and mold him into a murderer.\nThere is no way to describe these Palestinian summer camps other than human rights abuse against children, robbing them of their childhood, inciting them to glorify conflict, violence and death.\nPalestinian summer camps train children to be the next generation of Muslim terrorists. International human rights organizations know the truth, but turn a blind eye.","url":"https://spectator.org/palestinian-parents-sending-children-to-camp-kill-the-jew/"}
