{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:23:11","date_modify":"2018-10-30 20:23:11","date_publish":"2016-05-21 10:30:04","description":"The Bahraini daily Al-Watan published a column condemning the \"despicable\" stabbing attacks on unarmed Israelis by Palestinians.","filename":"data/vaneerConsumption/PalestiniansStabbingUnarmedIsraelisDespicable.json","image_url":"https://media.breitbart.com/media/2016/05/stabb.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_21__1540930991.html","title":"Palestinians Stabbing Unarmed Israelis Despicable","title_page":"Bahraini Journalist: Palestinians Stabbing Unarmed Israelis Despicable","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The Bahraini daily Al-Watan published a column condemning the “despicable” stabbing attacks on unarmed Israelis by Palestinians, saying they only fuel hatred toward Muslims and Arabs.\nThe columnist Farid Ahmad Hassan begins by citing three recent instances of stabbing attacks within a two day period in different places around the world. The first occurred in a nightclub in Thailand, the second in a German train station, and the third occurred when Palestinian youths stabbed two elderly Israeli women in the back in the West Bank.\nHassan dismisses the first as an alcohol-related incident. In the second case, witnesses claimed to have heard the attacker cry out “Allahu Akbar” before stabbing three people and killing one. In other words, Hassan writes, it was “a premeditated terror attack.”\nThe only rational explanation for the third incident, according to Hassan, is despair that the plight of the Palestinians will never change.\nHowever, he contends, the act of killing a defenseless civilian is unjustifiable.\n“From a moral point of view, the use of cold weapons is seen as cowardly because the person attacked has no way to defend himself. Even if [the victim] is not attacked from the back, and no matter what the justifications [for the act], it is a despicable act that should be opposed.”\nHassan maintains that not only will stabbing innocents never lead to victory, it will have the adverse effect of “supplying the enemies of the Arabs and of Islam with an excuse to intensify their hatred of all Arabs and Muslims.”\nHassan’s article was translated from Arabic into English by the Middle East Media Research Institute.","url":"https://www.breitbart.com/middle-east/2016/05/21/bahraini-journalist-palestinians-stabbing-unarmed-israelis-despicable-provokes-hatred-arabs-muslims/"}
