{"authors":[],"date_download":"2018-10-30 21:19:03","date_modify":"2018-10-30 21:19:03","date_publish":"2015-12-14 15:03:55","description":"A Palestinian terrorist drove a car into Israelis at a Jerusalem bus stop on Monday injuring eight people before being shot dead","filename":"data/vaneerConsumption/PalestinianTerroristRamsCarIntoJerusalemBusStopShotDeadPolice.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-14-at-14.50.36.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_12_14__1540934343.html","title":"Palestinian Terrorist Rams Car Into Jerusalem Bus Stop, Shot Dead: Police","title_page":"Palestinian Terrorist Rams Car Into Jerusalem Bus Stop, Shot Dead: Police","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM (AFP) – A Palestinian attacker drove a car into Israelis at a Jerusalem bus stop on Monday (pictured) injuring eight people before being shot dead, police and rescue services said.\n“Terrorist attack at the entrance of Jerusalem minutes ago,” police spokesman Micky Rosenfeld tweeted. “Terrorist drove vehicle into bus stop at entrance of city. Terrorist shot at scene.”\nPolice later confirmed the Palestinian assailant, a 21-year-old from east Jerusalem, had died, while Israel’s medical services said none of the victims’ injuries were life-threatening.\nAccording to police, the attacker also had an axe inside the car.\nImages of the scene online showed a car rammed into a bus stop on the sidewalk near the western entrance to the city.\nSince October 1, almost daily attacks by Palestinians and clashes with Israeli soldiers have killed 117 on the Palestinian side, 17 Israelis, an American and an Eritrean.\nOver half the Palestinians killed have been attackers, while others have been shot dead by Israeli security forces during clashes.\nOn Sunday, a 16-year-old Palestinian girl was shot dead after allegedly trying to carry out a stabbing attack near the Israeli settlement of Kiryat Arba in the occupied West Bank.","url":"https://www.breitbart.com/middle-east/2015/12/14/palestinian-terrorist-rams-car-into-jerusalem-bus-stop-shot-dead-police/"}
