{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:16:59","date_modify":"2018-10-30 21:16:59","date_publish":"2015-11-30 14:14:42","description":"The PA Minister of Women's Affairs has praised Palestinian women's \"uniqueness\" because they rejoice at news of the death of their sons.","filename":"data/vaneerConsumption/PalestinianMinisterOurWomenAreDifferentFromOthersTheyRejoiceWhenTheirSonsDie.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_11_30__1540934219.html","title":"Palestinian Minister: Our Women Are Different From Others; They Rejoice When Their Sons Die","title_page":"Palestinian Minister: Our Women Are Different From Others; They Rejoice When Their Sons Die | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The Palestinian Authority (PA) Minister of Women’s Affairs, Haifa Al-Agha, praised Palestinian women’s “uniqueness” when compared with other women around the world because they rejoice when they receive news of the death of their sons, Palestinian Media Watch (PMW) reported.\nAn article in Palestinian official daily Al Hayat Al Jadida stated that, “[PA] Minister of Women’s Affairs Haifa Al-Agha… noted the Palestinian woman’s uniqueness, which differentiates her from the women of the world, as [only] she receives the news of her son’s Martyrdom with cries of joy.”\nThe PA condones the notion of martyrdom (shahada – death for Allah) as the highest ideal and praises mothers who do not weep for their sons when they die but rather express “cries of joy.”\nThe latest round of Palestinian terror on Israeli citizens has seen many Palestinian terrorists killed as they stabbed or attempted to stab Israelis. The official PA tows a party line that includes “worshipping the blood of a martyr.”\nThe newspaper reported that Minister Al-Agha is working towards forcing Israel to implement UN Security Council resolution 1325, which guarantees protection of women and children during conflict.\nThe minister added that Palestinian women are noteworthy not only because they celebrate death but also because they take part in the jihad.\n“The Palestinian girls and women have proven their ability to contribute to their homeland, and that they have a significant presence in the field and battle arenas,” said Al-Agha.\nThe recent wave of violence has seen many examples of mothers expressing joy at their son’s death, in addition to expressing the belief that their son is in heaven with 72 virgins, as per Islamic belief.","url":"https://www.breitbart.com/middle-east/2015/11/30/palestinian-minister-our-women-are-different-from-others-they-rejoice-when-their-sons-die/"}
