{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:15:14","date_modify":"2018-10-30 21:15:14","date_publish":"2015-12-17 10:09:56","description":"Hamas leader Khaled Mashaal praised the recent outbreak of Palestinian terror attacks on Israelis, calling the stabbers \"the most exalted... of people,\"","filename":"data/vaneerConsumption/PalestinianStabbersAreTheMostExaltedNoblestOfPeoplePeaceIsFutileTheOnlyWayIsJihadAndBlood.json","image_url":"https://media.breitbart.com/media/2015/01/Khaled-Mashaal-Hamas-ap.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_12_17__1540934114.html","title":"Palestinian Stabbers Are ‘The Most Exalted, Noblest Of People;' 'Peace Is Futile, The Only Way Is Jihad And Blood'","title_page":"Hamas Leader: Palestinian Stabbers Are ‘The Most Exalted, Noblest Of People;' 'Peace Is Futile, The Only Way Is Jihad And Blood'","title_rss":"NULL","source_domain":"breitbart.com","text":"Hamas leader Khaled Mashaal praised the recent outbreak of Palestinian terror attacks on Israelis, calling the stabbers “the most exalted, noblest of people,” and said that Palestinians have come to realize that the peace process is futile and that only the path of “Jihad, sacrifice, and blood” will defeat Israel.\nSpeaking at a forum in the Malaysian capital of Kuala Lumpur last week, Mashaal said, “The Palestinians have reached the realization that negotiations with the (Israelis) are useless, the so-called peace process is futile. There is no peace. Only the path of Jihad, sacrifice, and blood (will bear fruit).”\nMashaal was heading a delegation of senior Hamas officials to meet with counterparts from the Malaysian government. Mashaal, who lives in exile in Qatar, also warned his audience that diplomatic channels, including the UN, would never bring Israel to its knees and that weapons and violence were the only viable alternatives.\n“Our rights will not be restored through the UN Security Council but by means of recruitment. Two thousand verbal ‘rockets’ do not compare to a single rocket made of iron. The children and youth of the West Bank have absorbed the message.\n“Weapons like Kalashnikovs or missiles are not at hand, but there are knives and cars with which to run over the enemies,” he said. “By God, after the knives used by the people of the West Bank and Jerusalem, can anyone possibly have an excuse to abandon the path of jihad? Nobody can have such an excuse.”\nHe praised the stabbers for being martyrs. “The young man who puts his life on the line and his heroic sister, with nothing but a knife at hand, are justified and Allah accepts them. This is up to Allah, but he accepts their Jihad and their martydom. By God, they are the most exalted and the noblest of people.”","url":"https://www.breitbart.com/middle-east/2015/12/17/hamas-leader-palestinian-stabbers-are-the-most-exalted-noblest-of-people-peace-is-futile-the-only-way-is-jihad-and-blood/"}
