{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:16:56","date_modify":"2018-10-30 21:16:56","date_publish":"2015-11-26 18:02:49","description":"The newly formed \"Ahmad Manasrah Football Tournament\" ​is named after ​a 13-year-old terrorist who stabbed and wounded two people.","filename":"data/vaneerConsumption/PalestinianSoccerGameNamedAfterTeenageTerrorist.json","image_url":"https://media.breitbart.com/media/2015/10/ap_ap-photo1729-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_11_26__1540934216.html","title":"Palestinian Soccer Game Named After Teenage Terrorist","title_page":"Palestinian Soccer Game Named After Teenage Terrorist","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The newly formed “Ahmad Manasrah Football Tournament” ​is named after ​a 13-year-old terrorist who stabbed and critically wounded two people aged 21 and 13 in Jerusalem last month, Palestinian Media Watch reported.\nPMW ​found out about the event’s name through an article published on Monday in Al-Hayat a​l-Jadida, an official newspaper of the Palestinian Authority (PA).\nThe terrorist was killed while fleeing the scene ​of the attack, ​while his accomplice, 15-year-old Hassan Manasrah, was shot and wounded by Israeli police​. He was treated at an Israeli hospital.\nThe soccer tournament​’s name is in​ keeping with the PA​’s ​policy of naming events, institutions​ ​and roads after terrorists. At least 25 schools have been named after terrorists, in addition to dozens of sporting events and summer camps. According to PMW, the PA glorifies the terrorists, holding them up as role models in hopes of inspiring their peers to carry out similar acts of terror.\nAccording to PMW: “Attacking Israelis brings honor and fame, and youth are drawn by this temptation.”\nAs Breibart Jerusalem reported, the PA recently named a road after ​Muhammad Halabi​,​ who instigated the current wave of violence when he stabbed and ​killed two Israelis in Jerusalem. PMW reported that a youth center in Jenin also named a football tournament after him.\nNot one of the Palestinian attack​s​ ​on Israelis over the last two months​ -​ which have left 23 dead and many more wounded -​ has ​been condemned by any PA official, including President Mahmoud Abbas. Last month​,​ Abbas went on PA television and implicitly endorsed the murders, claiming that they were in defense of ​Muslim holy sites.\n“The Palestinian side did not attack and did not do anything against the Israelis. If they [Israelis] think that the [Palestinian] people in Jerusalem are protecting themselves, that is our right. We have to protect our holy sites.”","url":"https://www.breitbart.com/middle-east/2015/11/26/palestinian-soccer-tournament-named-teenage-terrorist/"}
