{"authors":["Associated Press"],"date_download":"2018-10-23 01:34:01","date_modify":"2018-10-23 01:34:01","date_publish":"2016-01-11 12:37:54","description":"RAMALLAH, West Bank (AP) — The condition of a Palestinian journalist on a 48-day hunger strike in an Israeli jail is deteriorating, the man's wife and a Pale...","filename":"data/vaneerConsumption/PalestinianonhungerstrikeinIsraelincriticalcondition.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393639_Palestinian-hunger-strike-Israel-critical-condition_1540258441.html","title":"Palestinian on hunger strike in Israel in critical condition","title_page":"Palestinian on hunger strike in Israel in critical condition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Palestinian on hunger strike in Israel in critical condition\nRAMALLAH, West Bank (AP) — The condition of a Palestinian journalist on a 48-day hunger strike in an Israeli jail is deteriorating, the man's wife and a Palestinian official said Monday.\nMohammed al-Qeq is protesting his six-month sentence without trial or charge, under a measure called administrative detention. Israel's internal security agency Shin Bet said al-Qeq was arrested in connection with his alleged involvement in \"terror activities\" linked to the Islamic militant group Hamas.\n\"Al-Qeq is in critical condition after 48 days in hunger strike and his life is at risk,\" said Issa Qaraqe, the Palestinian minister of prisoner affairs.\nAl-Qeq is being monitored in an Israeli hospital, according to Israel's prison service, which would not comment on his condition. His wife, Faihaa al-Qeq, said Israel \"accused him of incitement.\"\nAl-Qeq, 33, works as a correspondent for the Saudi channel Al-Majd and also appears as an analyst on channels linked to Hamas. Israel has arrested him in the past for his activities with Hamas' student organization. He was arrested Nov. 21.\nPalestinian prisoners have used hunger strikes before to draw attention to their detention without trial or charges. Al-Qeq is the first journalist to do so.\nFearing that a fasting detainee's death could spark violence, Israel has at times acceded to hunger strikers' demands by agreeing to release them at the end of their terms of detention. Israel sometimes extends the administrative detention of suspects.\nA contentious law passed last year allows Israel to force-feed a hunger striker if his life is in danger, even if the prisoner refuses. Israel's medical establishment has protested the law, and there are no known instances of a prisoner being force-fed.\nAlso Monday, the Israeli military said forces shot and wounded a knife-wielding Palestinian who the military said attempted to stab a soldier in the West Bank, the latest in a four month-long wave of Israeli-Palestinian violence that is roiling the region.","url":"https://www.dailymail.co.uk/wires/ap/article-3393639/Palestinian-hunger-strike-Israel-critical-condition.html"}
