{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:11:05","date_modify":"2018-10-30 21:11:05","date_publish":"2015-11-20 21:25:07","description":"The 2-year-old son of a Palestinian official asked for a “machine gun and a rifle, so that I will defeat Israel and the Zionists.”","filename":"data/vaneerConsumption/PalestinianToddlerRequestsMachineGuntoDefeatIsraelandtheZionists.json","image_url":"https://media.breitbart.com/media/2015/11/Reuters-Beit-Hanoun-village-in-northern-Gaza-crying-child-with-gun.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_11_20__1540933865.html","title":"Palestinian Toddler Requests 'Machine Gun' to 'Defeat Israel and the Zionists'","title_page":"Palestinian Toddler Requests 'Machine Gun' to 'Defeat Israel and the Zionists' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The 2-year-old son of a Palestinian official made his father proud when on Palestinian Authority television, he requested that Pops purchase a “machine gun and a rifle, so that I will defeat Israel and the Zionists.”\nTawfiq Tirawi, an official with Fatah–the Palestinian faction presided over by Palestinian Authority President Mahmoud Abbas–was overjoyed upon hearing his toddler son’s request, which came in the form of a Palestinian song that calls for the killing of “Zionists.”\nThe song expresses the “sense of belonging to the homeland,” Tirawi explained, in remarks captured by Palestinian Media Watch.\nIn a translation provided by the Middle East watchdog group, the Palestinian official said:\nThe Palestinian by nature and education feels a sense of belonging to the land and the homeland. Listen, my son is two years and ten months old. Yesterday, he sang to his mother: “Escort the Martyr to his wedding.” He doesn’t know the meaning of this song (i.e., the Islamic belief that Martyrs marry 72 Virgins in Paradise). Today his mother told me that he sang: “Daddy, buy me a machine gun and a rifle, so that I will defeat Israel and the Zionists.” A boy who is not yet three! A Palestinian grows up with a feeling of belonging to the land, the homeland, and the people.\nThe lyrics to the children’s song, which has become popular among Palestinians in both the West Bank and Gaza, read:\nDaddy gave me a present, a machine gun and a rifle. When I am a big boy, I will join the Liberation Army. The army of Al-Qassam (Hamas), Which has taught us how to defend our homeland. Our homeland is precious, precious. We [are] victorious, victorious over America and Israel.\nThe Palestinian Authority (PA), which some claim to be a “moderate” faction when compared to Palestinian terror group Hamas, is known to incite terror and hatred of Jews, often calling for the overthrow of Israel. The PA also compensates the families of suicide bombers, and sometimes names streets and government buildings after jihadi terrorists.\nPA President Mahmoud Abbas has continued to fan the flames of violence amid the ongoing Palestinian terror campaign against Israeli Jews, which some have called the “knife intifada,”\n“Each drop of blood that was spilled in Jerusalem is pure blood as long as it’s for the sake of Allah. Every martyr will be in heaven and every wounded person will be rewarded by Allah’s will,” Palestinian Authority President Mahmoud Abbas said in September, adding that Palestinians’ “hands are with who are protecting Al-Aqsa mosque.”","url":"https://www.breitbart.com/middle-east/2015/11/20/palestinian-toddler-requests-machine-gun-defeat-israel-zionists/"}
