{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:00:28","date_modify":"2018-10-30 18:00:28","date_publish":"2018-07-12 22:52:30","description":"In her response to Sacha Baron Cohen, Sarah Palin slammed CBS for the \"unethical and perverted deception you’ve perpetrated on the public.\"","filename":"data/vaneerConsumption/PalinSlamsSachaBaronCohensPatheticResponseDemandsCBSDecideWhichVetsGroupsWillReceiveShowsProfits.json","image_url":"https://media.breitbart.com/media/2018/07/Palinslamscohen1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_07_12__1540922428.html","title":"Palin Slams Sacha Baron Cohen's 'Pathetic' Response, Demands CBS Decide Which Vets Groups Will Receive Show's Profits","title_page":"Palin Slams Sacha Baron Cohen's 'Pathetic' Response, Demands CBS Decide Which Vets Groups Will Receive Show's Profits","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Alaska Governor Sarah Palin slammed what appeared to be a response from British comedian Sacha Baron Cohen, who’s on the defensive after apparently posing as a disabled military veteran for a prank interview.\n“Another list of unfunny lies, this time typewritten for all to see; a pathetic attempt to punk not just my daughter and me again, but now the public,” Palin wrote on Facebook Thursday. “Thank God people are wise to Hollywood’s BS & said, ‘Enough.’”\nPalin was responding to a tweet sent from the Twitter account of “Billy Wayne Ruddick,” the fictional character Cohan plays in his upcoming Showtime series Who Is America.\n“It was I that interviewed you,” Ruddick’s note reads. “I did not say I was a war vet. I was in the service — not military, but United Parcel.”\nCohen, disguised as the disabled veteran character Ruddick, interviewed Palin as part of his Showtime series.\n“His disguise was basically a caricature of a conservative middle class Trump voter. He was asking her absurd, racist, homophobic, and sexist questions that were all meant to mock Trump voters as a bunch of ignorant and offensive kooks,” a source close to Palin with knowledge of the interview told Breitbart News.\nThe message in the Ruddick tweet says the former Republican vice presidential candidate has been “hit by a bullshit grenade” and is “bleedin’ fake news.”\nIn her response to Cohan Thursday, Palin demanded CBS Corp., which owns Showtime, to “discuss which Vets organizations will receive the show’s profits.”\n“CBS/Showtime: want me to share more about the unethical and perverted deception you’ve perpetrated on the public?” Palin wrote. “No one in your organization(s) have the balls to return my calls or provide their real names; would be nice now so we may discuss which Vets organizations will receive the show’s profits.”\nCohen’s Showtime series premieres on July 15.\nFollow Jerome Hudson on Twitter @jeromeehudson","url":"https://www.breitbart.com/entertainment/2018/07/12/palin-slams-sacha-baron-cohens-pathetic-response-demands-cbs-decide-which-vets-groups-will-receive-shows-profits/"}
