{"authors":["Naomi Ackerman For Mailonline"],"date_download":"2018-10-22 23:02:33","date_modify":"2018-10-22 23:02:33","date_publish":"2017-03-10 01:55:15","description":"Pamela Anderson, 49, looked sensational as she opted to leave her toned and slender legs clad in just a pair of tights for her visit to WikiLeaks founder Julian Assange on Thursday.","filename":"data/vaneerConsumption/PamelaAndersonwearsjustajumpertoseeJulianAssange.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EF2F100000578-0-image-a-75_1489105658499.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299494_Pamela-Anderson-wears-just-jumper-Julian-Assange_1540249353.html","title":"Pamela Anderson wears just a jumper to see Julian Assange","title_page":"Pamela Anderson wears just a jumper to see Julian Assange | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was revealed last year that Pamela Anderson has reportedly formed a romance with fugitive Julian Assange.\nThe former Baywatch actress has often frequented the Ecuadorean Embassy where the Australian national has been living to avoid extradition since June 2012.\nThe 49-year-old star looked sensational as she opted to leave her toned and slender legs clad in just a pair of tights for her visit to the cloistered WikiLeaks founder on Thursday evening.\nScroll down for video\nSexy: Pamela Anderson, 49, looked sensational as she opted to leave her toned and slender legs clad in just a pair of tights for her visit to the cloistered WikiLeaks founder on Thursday\nPamela arrived at the Knightsbridge Embassy - for the second time in two months - carrying a gorgeous black leather handbag and clad in a large tan overcoat.\nBut the stunning exercise fan left her coat hanging open to reveal her slender waist and toned stomach in just a poloneck jumper.\nWearing her gleaming blonde tresses in choppy layers around her shoulders, Pamela smiled for cameras and looked radiant and happy in a flawless face of makeup as she strode to see her friend.\nSporting bright red nails and daring lipstick to match, the star appeared not to have brought sustenance to her rumoured beau on this occasion.\nStunning: Pamela arrived at the Knightsbridge Embassy - for the second time in two months - carrying a gorgeous black leather handbag and clad in a large tan overcoat\nComposed: Wearing her gleaming blonde tresses in choppy layers around her shoulders, Pamela smiled for cameras and looked radiant and happy in a flawless face of makeup\nThe blonde bombshell arrived at her rumoured beau's guarded door in February with artisan vegan cheeseburgers from popular health-conscious chain Mildreds, after she had visited the fugitive last December with a bag full of upscale groceries from Whole Foods.\nAssange fears extradition to the US due to his perceived role in publishing secret American documents, a crime that could be punishable with the death penalty.\nAnd the former Playboy pin-up, who appeared on Strictly Come Dancing over Christmas, was first spotted at his official residence in September 2014.\nTheir initial meeting was set up for Anderson to try to persuade Assange to back her new foundation, which supports women who are victims of sexual abuse.\nLong time friend: The former Playboy pin-up, who appeared on Strictly Come Dancing over Christmas, was first spotted at Assange's residence in September 2014\nNo food: The star appeared not to have brought sustenance to her rumoured beau on this occasion\nShedding a light on her visits, the star hinted at a possible romantic relationship with Assange in an interview on The Kyle and Jackie O Show last month - but speculation has yet to be confirmed by either.\nShe said: 'I've spent more time talking to Julian than all of my ex-husband combined!' exclaimed the star, who has been married four times to three different people.\n'It was never the intention to become romantic,' she said diplomatically. 'It was just to join forces to do something important.'\nAnd for the long-term house-bound journalist, a visit from a beautiful actress may be a break from a somewhat lonely existence.\nTo break up the monotony, however, Assange does have his now-famous Embassy Cat (@EmbassyCat) to keep him company.\nThe cat, who lives in the embassy and seems to enjoy dressing up, has a Twitter bio which says he lives with Mr Assange and is 'interested in counter-purrveillance'.\nHousebound: For the long-term house-bound journalist, a visit from a beautiful actress may be a break from a somewhat lonely existence\nCounter Purrveillance: Though Assange does have his now-famous Embassy Cat (@EmbassyCat) to keep him company\nIt was not the first engagement of the evening for the Canadian-American actress.\nPamela had appeared on The Nightly Show with John Bishop earlier in the evening, dressed in a beautiful white short-sleeved dress complete with matching white flower decoration in her hair, which she wore pulled back from her face in an elegant up do.\nThe outfit fully displayed the age-defying star's bronzed legs and svelte figure as she posed on the talk show sofa.\nFlirty: Pamela had appeared on The Nightly Show with John Bishop earlier in the evening, dressed in a beautiful white short-sleeved dress\nLooking poised and elegant as she discussed her friendship with Assange as well as her Playboy history and activist causes.\nThe tone of the interview was flirty. John jokingly inquired about any secrets or information Assange may have passed to the actress, to which Pamela laughingly replied: 'I'm the least of anyone's worries.'\nAt this point John, aware of the star's good looks, said: 'I don't know – my wife's not going to be too pleased!'\nFascinated: Looking poised and elegant as she discussed her friendship with Assange as well as her Playboy history and activist causes","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299494/Pamela-Anderson-wears-just-jumper-Julian-Assange.html"}
