{"authors":["Associated Press"],"date_download":"2018-10-22 20:24:12","date_modify":"2018-10-22 20:24:12","date_publish":"2016-01-28 01:10:30","description":"WASHINGTON (AP) — A U.N. panel recommended Wednesday that cargo shipments of rechargeable lithium batteries be banned from passenger airliners because the ba...","filename":"data/vaneerConsumption/Panelproposesbanonairshipmentsofbatteries.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:75ff92880ceb4e5c9e4b4b06e5d179eb-2vdWmEltwXfba0ce28e632248d0a-461_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420088_Panel-proposes-ban-air-shipments-batteries_1540239852.html","title":"Panel proposes ban on air shipments of batteries","title_page":"Panel proposes ban on air shipments of batteries | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Panel proposes ban on air shipments of batteries\nWASHINGTON (AP) — A U.N. panel recommended Wednesday that cargo shipments of rechargeable lithium batteries be banned from passenger airliners because the batteries can create fires capable of destroying planes, according to aviation officials familiar with the decision.\nThe International Civilian Aviation Organization's air navigation commission, the agency's highest technical body, also proposed that the ban be lifted if new packaging can be developed that provides an acceptable level of safety.\nFinal approval from the ICAO top-level council is still needed. The council is scheduled to take up the matter in late February.\nFILE - This file frame grab from video, provided by the Federal Aviation Administration (FAA) shows a test at the FAAs technical center in Atlantic City, N.J. last April, where a cargo container was packed with 5,000 rechargeable lithium-ion batteries. Officials say Jan. 27, 2016, a U.N. aviation panel is recommending a ban on shipping rechargeable batteries as cargo on passenger airliners because the batteries can create fires capable of destroying planes. (AP Photo/FAA, File)\nThe officials spoke on condition that they were not named because they weren't authorized to speak publicly.\nLithium-ion batteries are used power everything from cellphones and laptops to hybrid and all-electric cars. About 5.4 billion lithium-ion cells were manufactured worldwide in 2014. A battery is made up of two or more cells.\nMost batteries are transported on cargo ships, but about 30 percent are shipped by air.\nFederal Aviation Administration tests show a single damaged or defective battery can experience uncontrolled temperature increases known as thermal runaway. The overheating can spread throughout a shipment. It's not unusual for tens of thousands batteries to shipped in a single cargo container in the belly of a plane.\nIn FAA tests, the overheating batteries have released explosive gases that, when ignited, have blown the doors off cargo containers and sent boxes of batteries hurling through the air before becoming engulfed in flames.\nEngineers from FAA's technical center told a public meeting last year that the explosions are forceful enough to knock the interior panels off cargo compartment walls. That would allow halon, the fire suppression agent used in airliners, to escape, leaving nothing to prevent fires from spreading unchecked, they said.\nAviation safety experts believe at least three cargo planes have been destroyed by lithium battery fires since 2006. Four pilots died in those accidents.\nThe proposed ban doesn't apply to cargo planes despite efforts by the International Federation of Air Line Pilot Associations to include cargo operations.\nA trade association for the rechargeable battery industry didn't immediately respond to a request for comment.\nLast March, an organization that represents aircraft manufacturers — including the world's two largest, Boeing and Airbus — submitted a position paper to ICAO stating that airliners aren't designed to withstand lithium battery fires and that continuing to accept battery shipments is \"an unacceptable risk.\"\nSix months later the U.S. decided to back a ban. \"We believe the risk is immediate and urgent,\" Angela Stubblefield, a Federal Aviation Administration hazardous materials safety official, said at a public meeting on Oct. 8\nProponents of a ban say any battery can experience thermal runaway if it has even a slight defect, is subject to extreme temperatures like when being left on a hot runway in the sun, or is damaged when a package is dropped or knocked about.\nIn late October, an ICAO panel on the transport of dangerous goods voted 11-7 against a ban. The United States, Russia, Brazil, China and Spain, as well as organizations representing airline pilots and aircraft manufacturers, voted in favor of the ban. The Netherlands, Canada, France, Germany, Australia, Italy, United Arab Emirates, South Korea, Japan and the United Kingdom, as well as the airline trade group, voted against it.\nHowever, in early December another ICAO panel on aircraft safety voted to recommend a ban. With two different panel recommendations, ICAO council members representing Brazil, the U.S. and Russia requested earlier this month that a navigation commission, which is a step above the panels, craft a recommendation on a ban.\nAviation officials interviewed by The Associated Press said they couldn't predict whether the council, which has 36 members, will ultimately agree to a ban.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420088/Panel-proposes-ban-air-shipments-batteries.html"}
