{"authors":[],"date_download":"2018-10-22 20:54:54","date_modify":"2018-10-22 20:54:54","date_publish":"2014-06-03 15:46:54","description":"Panera's new food policy makes customers feel less guilty about eating calories there.","filename":"data/vaneerConsumption/PaneraSwearsOffArtificialIngredients.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/484426/panerabread_3176466f2ab0d51ead8babd349439e14.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_panera-swears-artificial-ingredients-n121336_1540241694.html","title":"Panera Swears Off Artificial Ingredients","title_page":"Panera Swears Off Artificial Ingredients","title_rss":"NULL","source_domain":"nbcnews.com","text":"The unveiling of Panera's sweeping \"Food Policy\" underscores how positioning foods as natural has become a marketing advantage, regardless of whether it brings any nutritional benefits. Part of the attraction for customers is that they feel better about what they're eating, sometimes because they don't feel as guilty about how many calories they're consuming.\nHowever, Panera isn't swearing off genetically modified ingredients, another issue that is gaining attention in certain circles. Unlike Chipotle, which says its menu will soon be free of GMOs, Panera uses too many different ingredients to be able to make that claim.\nAs for the rest of its menu, Panera says it's about halfway through the removal of artificial ingredients. It's still looking for ways to removes the artificial colors used in its bakery icings, for instance, and is testing a smoked ham in select markets that doesn't use artificial preservatives.\nPanera's new policy also states the chain's commitment to \"transparency,\" meaning it will make it easy for people to see the ingredients and nutritional content of its food. It also says it will work to have a \"positive impact\" on the food system, such as by supporting North American suppliers whenever possible.\nLast year, Panera's sales rose 2.6 percent at company-owned locations open at least a year. That was down from 6.5 percent in 2012 and 4.9 percent in 2011.\nThis year, the St. Louis-based company is forecasting sales growth of 2 percent to 3.5 percent.\n-The Associated Press","url":"https://www.nbcnews.com/business/consumer/panera-swears-artificial-ingredients-n121336"}
