{"authors":["Associated Press"],"date_download":"2018-10-22 20:37:45","date_modify":"2018-10-22 20:37:45","date_publish":"2016-01-29 02:30:56","description":"CHICAGO (AP) — A jury at a federal civil trial Thursday awarded $1,500 each to two panhandlers who took one of the nation's largest sheriff's offices to cour...","filename":"data/vaneerConsumption/PanhandlerswinincourtoversheriffsofficeinChicago.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:71018b6e67e542249772b727ebe1040e-4PuZeKVXE7cd9005b2c876399987-633_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422004_Panhandlers-win-court-sheriffs-office-Chicago_1540240665.html","title":"Panhandlers win in court over sheriff's office in Chicago","title_page":"Panhandlers win in court over sheriff's office in Chicago | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Panhandlers win in court over sheriff's office in Chicago\nCHICAGO (AP) — A jury at a federal civil trial Thursday awarded $1,500 each to two panhandlers who took one of the nation's largest sheriff's offices to court for violating their constitutional right to ask passers-by for money.\nJurors returned after just four hours of deliberations with a finding that the failure of the Cook County Sheriff's Office to train deputies on panhandler rights led its deputies to order Kim Pindak, 63, and Sam Phillips, 57, to stop begging on Daley Plaza, a busy public square in downtown Chicago. Pindak and Phillips said the deputies' actions violated their free-speech rights under the First Amendment.\nThe panhandlers' lawyers said securing a finding that departments must ensure staff understand panhandlers' rights — not money — was why they chose to litigate the case for nearly six years. The $3,000 award was also more than they expected to win.\nKim Pindak stands outside Chicago¿s federal courthouse after the first day of testimony in a civil lawsuit involving him and and other panhandlers Monday, Jan. 25, 2016, in Chicago. He and another panhandler brought a suit that alleges they lost up to $10 a day because authorities bar them from begging in Daley Plaza, a popular public square in the city. The trial that started today is a rare instance of jurors being asked to decide the issue of panhandlers' rights. (AP Photo/Michael Tarm)\n\"It's wonderful that two people who panhandle to make ends meet can come to court and hold accountable the sheriff of one of the largest counties in the nation,\" lead plaintiff attorney Adele Nicholas said outside court after the jury's decision.\nA lawyer representing the sheriff's department, Anthony Zecchin, referred during closing arguments Thursday to Pindak's talent at chess, alleging several times that his 2010 lawsuit was primarily a money-making scheme.\nThe attorney told jurors: \"You're just pawns being manipulated by Mr. Pindak.\"\nSpeaking outside court after the decision, Pindak said he plans to spend most of the $1,500 on necessities, including clothes and shoes.\n\"And I might get a chess book or two,\" he said.\nThe next step, Nicholas said, would be asking the presiding judge in Chicago, U.S. District Judge Rebecca Pallmeyer, to issue an injunction ordering Sheriff Tom Dart to train staff properly.\nWhile jurors' decision went against the sheriff's department as a whole, they did find in favor of Sheriff's Deputy Laverne Nance, concluding he didn't violate the men's rights as an individual officer.\nA brief statement released by the sheriff's department said that \"it strives to treat everyone it encounters with dignity and respect, which it did in this case.\"\nPhillips, who said he started panhandling 10 years ago after losing his job as a butcher, said he can make as much as $8,000 annually begging five hours a day, five days a week. He said he typically holds up a sign that reads, \"I'm Just Hungry.\"\nPindak said he studied pre-med in college for several years in his 20s before mental illness sent his life into a tailspin.\nOn the witness stand, he told jurors he's occasionally handed a $20 bill but often makes just several dollars a day.\nDuring cross-examination, Zecchin also repeatedly asked Pindak about chess, suggesting his ability to think several moves ahead led him to sue.\nPindak denied that, answering he'd always been good at chess but not at life.\n\"I'm not a mastermind,\" he said.\n___\nFollow Michael Tarm on Twitter at http://twitter.com/mtarm\nA man panhandles on the street Monday, Jan. 25, 2016, in Chicago. A lawsuit brought by panhandlers who say they lose up to $10 a day because authorities bar them from a popular public square in Chicago is set to go to trial. The trial that starts Monday in Chicago federal court is a rare instance of jurors being asked to decide the issue of panhandlers' rights. (AP Photo/M. Spencer Green)\nA man, right, panhandles on the street Monday, Jan. 25, 2016, in Chicago. A lawsuit brought by panhandlers who say they lose up to $10 a day because authorities bar them from a popular public square in Chicago is set to go to trial. The trial that starts Monday in Chicago federal court is a rare instance of jurors being asked to decide the issue of panhandlers' rights. (AP Photo/M. Spencer Green)\nA man, center, panhandles on the street Monday, Jan. 25, 2016, in Chicago. A lawsuit brought by panhandlers who say they lose up to $10 a day because authorities bar them from a popular public square in Chicago is set to go to trial. The trial that starts Monday in Chicago federal court is a rare instance of jurors being asked to decide the issue of panhandlers' rights. (AP Photo/M. Spencer Green)","url":"https://www.dailymail.co.uk/wires/ap/article-3422004/Panhandlers-win-court-sheriffs-office-Chicago.html"}
