{"authors":["Associated Press","Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-23 00:40:01","date_modify":"2018-10-23 00:40:01","date_publish":"2017-03-16 10:09:15","description":"The body of the four-year-old female panther was found Tuesday on a rural road east of Immokalee in Collier County, the Florida Fish and Wildlife Conservation Commission reports.","filename":"data/vaneerConsumption/PanthercubfounddeadinFloridaafterbeinghitbyacar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/22/3E589D2B00000578-0-image-a-16_1489704596317.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319508_Panther-cub-dead-Florida-apparent-vehicle-strike_1540255201.html","title":"Panther cub found dead in Florida after being hit by a car","title_page":"Panther cub found dead in Florida after being hit by a car | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Florida panther has been found dead after apparently being hit by a vehicle in the southwest part of the state, according to authorities.\nThe body of the four-year-old female panther was found Tuesday on a rural road east of Immokalee in Collier County, the Florida Fish and Wildlife Conservation Commission reports.\nThe remains were to undergo a necropsy.\nA Florida panther has been found dead from an apparent vehicle strike in southwest Florida, according to authorities (stock)\nA two-month-old panther killed by a vehicle in Collier County was found earlier this month, the FWC says.\nThat panther was discovered on March 9, and its body was collected on Monday, the Naples Daily News reports.\nThe body of the four-year-old female panther was found Tuesday on a rural road east of Immokalee in Collier County (stock)\nA total of eight Florida panthers have been found dead in 2017, with six road fatalities.\nOne panther's cause of death was listed as unknown.\nAnother panther's cause of death was what's known intraspecific aggression - panthers killing each other, according to the Naples Daily News.\nFlorida panthers once roamed the entire Southeast.\nThe FWC said on Monday: 'Over the past few decades, the panther population has grown significantly.\nThere were only 20 to 30 adult panthers in the 1970s.\n'Today, the Florida Fish and Wildlife Conservation Commission (FWC) estimates the population at 120 to 230 animals.\n'As the population grows, the chance for interaction between panthers and humans also increases – which can be bad for both people and panthers.\n'At one time, reports of panther sightings were rare. Today, panthers are being seen with increasing frequency, particularly in Collier County.\n'In addition to sightings, there has been an increase in panthers killing pets and livestock.'\nThe agency said: 'Reports of dangerous encounters with panthers are very rare in Florida. However, panthers are large, powerful predators, and people should use caution if they see one.'","url":"https://www.dailymail.co.uk/news/article-4319508/Panther-cub-dead-Florida-apparent-vehicle-strike.html"}
