{"authors":["Associated Press"],"date_download":"2018-10-22 23:44:05","date_modify":"2018-10-22 23:44:05","date_publish":"2016-01-11 07:06:36","description":"EDMONTON, Alberta (AP) — Win a dozen games in a row and it doesn't matter much if a few aren't pretty. Jaromir Jagr and Jonathan Huberdeau scored in the firs...","filename":"data/vaneerConsumption/Panthersextendwinstreakto12beatOilers21.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393425_Panthers-extend-win-streak-12-beat-Oilers-2-1_1540251845.html","title":"Panthers extend win streak to 12, beat Oilers 2-1","title_page":"Panthers extend win streak to 12, beat Oilers 2-1 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Panthers extend win streak to 12, beat Oilers 2-1\nEDMONTON, Alberta (AP) — Win a dozen games in a row and it doesn't matter much if a few aren't pretty.\nJaromir Jagr and Jonathan Huberdeau scored in the first period, Al Montoya made 24 saves and the Florida Panthers beat the Edmonton Oilers 2-1 Sunday night to extend their franchise-record winning streak to 12 games.\nFlorida hasn't lost since Dec. 12 while climbing to the top of the Atlantic Division with 56 points. The Panthers won this one despite putting just 14 shots on goal.\n\"It was a grinder-type game and we did what we had to do to win,\" Panthers center Nick Bjugstad said. \"We didn't necessarily play well, but you're going to have those games where you don't feel the greatest but you have to sneak them out.\"\nMark Letestu scored for Edmonton and the Oilers lost their second straight. Cam Talbot made 12 saves.\nJagr scored on Florida's first shot 3:22 in, capitalizing after defenseman Darnell Nurse's turnover. The 44-year-old Jagr lost his handle on the puck while attempting a deke but it still managed to go through Talbot's legs for his 15th goal.\n\"The home run mistakes, those have to be eliminated from our game,\" Oilers coach Todd McLellan said. \"The mistake that Darnell made, they have to be eliminated. That's an individual mistake that has to be out of the game.\"\nAbout 3 minutes later, Edmonton's Taylor Hall picked the corner to beat Montoya, but a replay showed the Oilers were offside and the goal was overturned.\n\"We knew with this winning streak that they hadn't been giving up much and had been defending well and getting good goaltending,\" Letestu said. \"When you win 12 in a row, a lot of things are going well. To have one of our goals taken back, it was tough.\"\nAt 7:04, Huberdeau took a feed from behind the net and chipped the puck over Talbot's shoulder.\nEdmonton got a goal back with 7:28 remaining in the first off some hard work by its third line. Letestu got his sixth goal after the group dug the puck out of the corner and worked it to the center in front of the crease.\nThe Oilers had the bulk of the chances for the remainder of the game, but couldn't find the equalizer.\n\"They're not pretty every single night,\" Montoya said. \"You've got to find different ways to win. Tonight, we found another way to win.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393425/Panthers-extend-win-streak-12-beat-Oilers-2-1.html"}
