{"authors":["Corey Charlton For Mailonline"],"date_download":"2018-10-22 22:01:31","date_modify":"2018-10-22 22:01:31","date_publish":"2016-01-28 09:42:25","description":"Matthew Iovane has dismissed accusations there are inconsistencies in his claim he and girlfriend Michelle Clemens were attacked while trekking through Papua New Guinea.","filename":"data/vaneerConsumption/PapuaNewGuineafuryovercouplewhofearedtheywouldbeeatenbycannibals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A7FD9F00000578-0-image-a-21_1453974097639.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420625_Locals-fury-couple-feared-eaten-cannibals-tied-mutilated-trek-Papua-New-Guinea-doubts-cast-story_1540245691.html","title":"Papua New Guinea fury over couple who 'feared they would be eaten by cannibals'","title_page":"Papua New Guinea fury over couple who 'feared they would be eaten by cannibals' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Furious locals in Papua New Guinea have cast doubts on a British man's claims he and his US girlfriend were tied up and attacked by hostile tribesmen during a remote jungle trek.\nMatthew Iovane thought he would be 'eaten by cannibals' when he and American Michelle Clemens were tied up, stripped naked and beaten during the ordeal.\nBut police have now begun looking at the pair's story, which occurred while they walked the country's famous Kokoda Trail.\nScroll down for video\nA trekking guide in Papua New Guinea has cast doubts on the claims of Matthew Iovane and Michelle Clemens, who claimed they were tied up, stripped naked and attacked while walking the country's famous Kokoda Trail\nDuring their ordeal, Mr Iovane, 31, said he was shackled to a tree while Miss Clemens, also 31, was repeatedly attacked and had her fingers sliced open.\nHe said they had no idea why they had been targeted – and the only thing they could understand their captors saying was 'kill you'.\nAnd the couple only finally managed to escape while they were being force-marched through the jungle and ran naked back to safety.\nIn the days following the attack, police confirmed the pair were stripped of their belongings including mobile phones, shoes, backpacks and 15,000 kina (£3,500) in cash.\nThey added Mr Iovane was tied to a tree while Miss Clemens was repeatedly attacked before three of her fingers were chopped.\nIn an apparent backtrack, Dominic Kakas, constabulary chief superintendent of the Royal Papua New Guinea, now says: 'We are doing our own checks on what we have been provided,' ABC reported.\n'We are now trying to re-establish the facts and what has happened.'\nMr Iovane (pictured) is from Shoreditch, London, and in 2008 appeared on the reality TV show Shipwrecked\nLocals, furious at being labelled 'cannibals' and the damage the story may have caused to the country's vital tourism industry, have also begun making their own inquiries.\nCharlie Lynn, an experienced Australian outdoorsman who operates a trekking business along the remote 60mile trail, questioned key aspects of the couple's story.\nIt was only after an hour-long ordeal that the two said they were either freed or escaped, and claimed they had made a desperate dash through the jungle to safety at a nearby village.\nMr Iovane, from Shoreditch, London, had claimed his t-shirt was used to blindfold him during the attack and the pair were virtually stripped naked.\nBut in a blog on his website, Mr Lynn said the couple were photographed boarding a rescue helicopter after the attack.\nIn this image, they were allegedly wearing the same clothes as they wore into the jungle, according Alfie Jack and George Kavanato, two drivers who saw the couple prior to the trip.\nHe wrote: This begs the question as to how the clothing they were wearing on the helicopter at Alola village miraculously reappeared after their semi-naked trek from Templeton’s Crossing when, according to their own account, all their possessions had been stolen.'\nMr Lynn - who has walked the Kokoda Trail 79 times - also said the two would have suffered terrible cuts to their feet had they made the 15 km journey they claimed they had.\nHe wrote: 'This would have been a difficult and painful trek for semi-naked expatriates without shoes.\n'Their feet would have been seriously lacerated during the 8 – 12 hours it would have taken them to complete it under the conditions they described.'\nFurthermore, he rubbished details Mr Iovane provided about the rugged jungle environment, where he had claimed the couple lived like 'Tarzan and Jane' in the days prior to the attack.\nDanger: The pair thought they might be eaten after they were tied up and threatened by the tribe (file photo)\nThe Kokoda Trail (pictured) is a stunning 60mile jungle trek that takes travellers from Kokoda to Port Moresby, passing by remote villages and famous Second World War battlesites\nMr Iovane had originally told The Sun: 'The first five days were among the most amazing of our lives.\n'We lived like Tarzan and Jane on nuts packed into our rucksacks and bananas, papaya, wild spinach and exotic ‘tree tomatoes’ found only in this jungle.'\nBut Mr Lynn said fruit and nuts do not grow wild along the jungle trails - they are only available when sold by villagers located near the track.\nAnd he also dismissed their suggestion they encountered a pack of wild dogs during their terrifying journey through the jungle to safety.\nHe wrote: 'There are no wild dogs on the Kokoda Trail because there is nothing for them to eat. There are small dogs in villages along the trail which are kept as domestic pets.'\nMr Iovane could not be reached for comment, though he discounted Mr Lynn's investigation when contacted by News.com.au.\nHe told the website: 'He is trying to clearly protect his business. The truth is on the global news and from the police officials describing what happened. Charlie is merely a blogger looking to create skepticism to protect his business - maybe try looking at the evidence from the police.'","url":"https://www.dailymail.co.uk/news/article-3420625/Locals-fury-couple-feared-eaten-cannibals-tied-mutilated-trek-Papua-New-Guinea-doubts-cast-story.html"}
