{"authors":["Rohan Banerjee For Mailonline"],"date_download":"2018-10-22 22:09:52","date_modify":"2018-10-22 22:09:52","date_publish":"2016-01-28 09:54:46","description":"Chelsea defender Papy Djilobodji says he does not know why he hasn't been given a chance in the first-team at Stamford Bridge. The 27-year-old is currently out on loan at Bundesliga side Werder Bremen.","filename":"data/vaneerConsumption/PapyDjilobodjicantexplainChelseaexittoWerderBremen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/306D8A2B00000578-0-image-a-21_1453974025075.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420621_Papy-Djilobodji-t-explain-Chelsea-exit-insists-gave-sent-loan-Werder-Bremen_1540246192.html","title":"Papy Djilobodji can't explain Chelsea exit to Werder Bremen","title_page":"Papy Djilobodji can't explain Chelsea exit to Werder Bremen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Now at Werder Bremen, Djilobodji can't explain his lack of opportunities\nHe made just one appearance for the Blues before being sent out on loan\nChelsea defender Papy Djilobodji says he does not know why he hasn't been given a chance in the first-team at Stamford Bridge.\nThe 27-year-old, signed from Nantes for £3million at the start of the season, made just one appearance for the Blues before being shipped out on loan to Werder Bremen earlier this month.\nAsked about his lack of game time, Djilobodji told German newspaper Bild: 'Really I do not know. I gave everything.'\nChelsea signed Senegal international defender Papy Djilobodji from Nantes at the start of the season\nThe 27-year-old made just one first-team appearance for the Blues before being loaned to Werder Bremen\nThe Senegal international signed a four-year contract upon his arrival at Chelsea, though Jose Mourinho, who was manager at the time, admitted that the deal was not down to him, but rather one of his scouts.\nMourinho said: 'It was not my choice. It was the choice of someone I trust completely, which is the same. I don't know every player. My job doesn't allow me to travel and spend hours watching players.'\nThe Portuguese boss added: 'In some moments of the market, under certain circumstances, there are moments when you have to trust or not the people you work with.\n'In my case, I trust because the same person who told me Djilbodji can be a good squad player was the same person who told me (Kurt) Zouma can be a fantastic player for us. Obviously I trust him.'\nDjilbodji's single appearance for Chelsea came as a substitute in September's Capital One Cup win over Walsall,\nChelsea finished the 2014-15 season as Premier League champions, but have struggled to defend their title.\nFormer Chelsea manager Jose Mourinho was sacked following a catastrophic downturn in form\nMourinho was sacked in December after losing nine out of 16 league games. Guus Hiddink was then appointed interim head coach and tasked with lifting the club up the table.","url":"https://www.dailymail.co.uk/sport/football/article-3420621/Papy-Djilobodji-t-explain-Chelsea-exit-insists-gave-sent-loan-Werder-Bremen.html"}
