{"authors":["Fionn Hargreaves For Mailonline"],"date_download":"2018-10-23 03:59:14","date_modify":"2018-10-23 03:59:14","date_publish":"2017-03-10 13:58:34","description":"Pictures of the tiny bird were captured in Rajasthan, India, by amateur photographer Nitin Dua. The parakeet grabs the tail of the lizard, which is longer than her entire body.","filename":"data/vaneerConsumption/Parakeetgrabslizardinattempttostopiteatingchicks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22C0F300000578-0-image-a-22_1489150337226.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301360_Parakeet-grabs-lizard-attempt-stop-eating-chicks_1540267154.html","title":"Parakeet grabs lizard in attempt to stop it eating chicks","title_page":"Parakeet grabs lizard in attempt to stop it eating chicks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From head to tail, the tallest of its species only measure 18 inches.\nBut a mother's instinct helped a parakeet battle a monitor lizard three times its size in a desperate attempt to save its chicks.\nThe reptile, whose species can grow up to nine feet long, can be seen clambering into the bird's nest.\nA mother parakeet battled a monitor lizard three times her size in a bid to stop the reptile crawling into the nest and eating its chicks\nThe tiny mother bird is pictured grabbing onto the hungry lizard's long tail, refusing to give up without a fight.\nThe real-life angry bird almost succeeded in protecting her babies, forcing the lizard to hang on to the tree branch nest for dear life after being unexpectedly yanked away.\nBut sadly, the heart-in-the-throat struggle did not have a happy ending for the parakeet family and ended with the huge monitor lizard breaking into the nest.\nThe photographs were captured in Rajasthan, India, by amateur Nitin Dua, 43. Pictured, the parakeet watches the lizard crawling into its nest\nThe parakeet clings onto the lizard's tail and puts up a good fight as it tries to drag it out of the hole\nEven though the bird almost succeeded in saving its chicks, but is flicked off the lizard's tail at the last moment\nAmateur photographer Nitin Dua, from Faridabad, India, captured the images in Keoladeo Ghana National Park in Bharatpur, Rajasthan.\nThe married father-of-one, 43, said: 'We were probably about eight metres away from the action.\n'The parakeet's young ones were hatching in its nest, and the monitor lizard was trying to get in to get to the chicks.\nFather-of-one Nitin Dua said: 'We were probably about eight metres away from the action'\nThe photographer said he was routing for the parakeet to win against the lizard. He said: 'It seemed nature had already scripted their fate'\n'The mother parakeet kept trying to pull the monitor lizard out, and her partner was also there at the scene.\n'But the mother was the one doing most of the fighting. All the way through we were routing for the parakeets and were hoping and praying that they would prevail.\n'But it seemed nature had already scripted their fate.\nThe lizard's tail was longer than the parakeet's entire body. When the bird let go, the lizard snuggled into the nest to eat the chicks\n'Despite the efforts of the mother, this pair's struggle sadly seemed to be a one-way fight, and the lizard got the better of the parakeet.\n'The lizard snuggled inside the nest and then all the action ended.'\nNitin had been taking a walk through the Park with friends on a sunny mid-afternoon in December 2015 when they stumbled across the fight.\nAnd the dad-of-one was sad to see the brave fight put up by the stunning green bird was not enough to stave off the powerful lizard for good.\nNitin said: 'I'm very passionate about photography, and I'd say this is probably one of the best picture sequences I've ever shot'\nAfter a few minutes of the plucky mum pulling at the lizard's tail - which was longer than herself - and persistently pecking and squeaking at the invader, the reptile finally reached the precious chicks.\nParakeets and monitor lizards are just a couple of the incredible animal species Nitin has had the pleasure of capturing in the wild.\nThe amateur photographer has been developing his skills in for the last six years, focusing on the vast array of wildlife in and around his home region of Haryana.\nAnd he said he is extremely proud to have caught such a tense moment on camera.\nNitin said: 'I'm very passionate about photography, and I'd say this is probably one of the best picture sequences I've ever shot.\n'I have had a lot of appreciation about it from people, which has been great.'","url":"https://www.dailymail.co.uk/news/article-4301360/Parakeet-grabs-lizard-attempt-stop-eating-chicks.html"}
