{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 20:19:07","date_modify":"2018-10-30 20:19:07","date_publish":"2015-10-20 21:43:18","description":"Parents across Tennessee are taking on the state's political and educational establishment over Islam-centric seventh grade standards.","filename":"data/vaneerConsumption/ParentRebellionBrewinginTennesseeOverIslamCentricEducationalStandards.json","image_url":"https://media.breitbart.com/media/2015/06/Screen-Shot-2015-06-04-at-8.39.30-AM-e1434201276839.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_20__1540930747.html","title":"Parent Rebellion Brewing in Tennessee Over Islam-Centric Educational Standards","title_page":"Parent Rebellion Brewing in Tennessee Over Islam-Centric Educational Standards | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Parents across Tennessee are taking on the state’s political and educational establishment, aiming to get rid of the recently implemented Islam-centric seventh grade Social Studies standards.\nA group of parents in White County, about 100 miles east of Nashville, are taking the fight to the seven publicly elected county school board members in that county who approved the purchase of the new Islam-centric textbook that elaborates on those standards, myWorld History and Geography: The Middle Ages to Exploration of the Americas, published by Pearson Education.\nA similar grassroots rebellion between 1999 and 2002 prevented the state’s establishment Republican Governor, Don Sundquist, from imposing a state income tax on Tennesseans. In 2014, that prohibition was made permanent in an amendment to the state’s constitution approved overwhelmingly at the ballot box by voters.\nThe current uprising pits Tennessee parents against Republican Governor Bill Haslam, the Tennessee Department of Education, the large and powerful multinational textbook publisher Pearson Education, the state’s educational bureaucrats, unaccountable local county school directors, and their far too compliant local school boards.\nThe involvement of Pearson Education is particularly controversial since its parent corporation, London based Pearson PLC, is partially owned by the Libyan Investment Authority. With 3 percent of Pearson’s outstanding stock, the Libyan Investment Authority is one of its largest shareholders.\nThe Washington Times recently reported there is a financial connection between the Libyan Investment Authority and the Council on American-Islamic Relations:\nAccording to the Financial Times, the Libyan Investment Authority was founded by Muammar Gaddafi’s son, Seif al-Islam; more than five Gaddafi family members own shares. The Council on Islamic Relations (CAIR, a recently designated terrorist organization by the United Arab Emirates), Turkey, Saudi Arabia, and the Muslim Brotherhood invested in Pearson Education through the Libyan Investment Authority.\nCAIR has inserted itself into the Tennessee seventh grade Social Studies standards political battle, even though barely 1 percent of the state’s population self-identifies as Muslim. The group has publicly criticized the state legislator who has introduced legislation to prohibit the teaching of religious doctrine prior to the tenth grade in Tennessee.\nA number of Tennessee parents also claim that CAIR has provided supplementary materials used by some Tennessee school districts to support the new seventh grade standards.\nOne reason for CAIR’s interest in Tennessee is that it has the highest percentage of Evangelical Christians of any state in its population, according to a recent Pew Research Poll on religion in America. As a result, Tennessee may be the “tip of the spear” in attempts to crush public opposition to Islamization.\nCAIR co-founder and executive director Nihad Awad, “a known Hamas supporter,” has publicly “reject[ed] Israel’s right to exist.”\nAs Breitbart News reported previously:\nEven in the face of the Islamic State’s rampaging terror and slaughter, Awad called the Jewish state the biggest threat to world peace and security. Breitbart News reported he once publicly declared his support of the “Hamas movement.” Hamas, the radical Islamic group, is a United States designated terrorist organization. CAIR was charged as an unindicted co-conspirator in the largest terrorism-financing case in U.S history, the Holy Land Foundation trial. Before launching CAIR, Awad served as PR director for the Islamic Association for Palestine (IAP), an organization identified by the U.S. government as an arm of the Palestinian Committee, a Hamas support network created by the Muslim Brotherhood. A 2001 Immigration and Naturalization Service memo documented IAP’s support for Hamas and the “facts strongly suggest” that IAP was a part of Hamas’ propaganda machine, according to the Investigative Project on Terrorism (IPT).\nParents from across the county and the state will be gathering at Tuesday night’s town hall in Sparta, Tennessee sponsored by the group, White County Citizens Against Islamic Indoctrination, “to continue efforts to inform and engage the community about the pro-Islamic textbooks and materials being forced upon teachers and students by the White County School Board.”\nIn a press release, the group said:\nSchool board members, including Chairman Edd Cantrell and Vice Chairman Gary Sparkman, have ignored parents’ objections to the textbooks and materials and refused to remove them or restrict their use in classrooms. Seventh grade social studies textbooks in White County contain nearly 50 pages devoted to a sugar coated view of Islam and the “Islamic World” while barely mentioning Christianity. The School Board has also violated at least 14 of their own policies and procedures in connection with conducting school board business and may have violated state laws concerning public access tomaterials used in the classrooms in White County. . . . “The School Board has adopted the textbooks and materials in a shroud of secrecy and misrepresentation and have attempted to hide what is happening in our classrooms concerning the promotion of Islam and limited mentions of Christianity,” [Chairman] Anthony Wright pointed out. “We plan to expose what is happening and call the community to action since the values promoted by the School Board members in our classrooms do NOT reflect the values of our community nor do they follow the laws of the land.” Bryan Wright, who recently attended a School Board meeting to object to the materials, explained that “the schools should teach any aspect of religion with a focus on fairness, balance and TRUTH; that is not happening with respect to the Islamic Indoctrination being presented in White County thanks to our own elected officials.” “The fault is not the teachers who are being forced to use these materials; it is the fault of the school board that unanimously approved them and who should be held accountable for that terrible decision,” Bryan Wright noted. Overton County, Tennessee has adopted a set of supplemental materials to provide a fair and balanced teaching of social studies and religion but the White County School Board has refused to accept any alternative to the textbooks and materials they adopted despite significant and growing parental objections.\nThe Tennessean reported the group “expects hundreds of people” at Tuesday night’s town hall:\nThe new group, White County Citizens Against Islamic Indoctrination, joins others in the state concerned about pro-Islamic bias in middle school social studies classes. The group claims a seventh grade social studies textbook unfairly represents major world religions. They also claim the White County school board has been unresponsive to their concerns. “We have no problem with teaching world history. We have no problem with world religion. We want it to be fair and balanced and accurate,” said Anthony Wright, chairman of White County Citizens Against Islamic Indoctrination. Tennessee sixth and seventh grade students learn about the rise, spread and impact of major world religions on societies in social studies classes. Students learn about Islamic civilization in seventh grade. White County Schools, a small district with one middle school, uses “My World History and Geography: The Middle Ages to the Exploration of the Americas” in seventh grade social studies classes. “It doesn’t report 9/11, ISIS. It doesn’t talk about any Islamic group,” Wright said, referring to the textbook. Middle school students learn about the Islamic civilization up to the 1500s, according to state standards. Wright also claimed the book explained how to convert to Islam, but not to Christianity. “All it takes is one seventh-grader to go home and recite the five pillars of Islam, then go to a school with a bomb in their backpack and blow up 10 kids,” Wright said. Muslim converts technically recite the Shahada to profess their new faith. The Shahada is the first pillar of Islam. “We don’t want that book taught. There’s other books available,” Wright said. School districts select and approve textbooks from a state-approved list. Other school districts, for example, use “Discovering our Past, A History of the World.” Superintendent Sandra Crouch said she was advised by legal counsel not to comment. “Our teachers do not teach religious doctrine at all. We simply teach world history according to the state department of education standards,” said school board chairman Edd Cantrell.\nIn a letter to the school board sent on Monday by James R. Omer, the Nashville attorney who represents the White County parents group, also demanded that the board make the new textbook and all related materials available for public inspection. Incredibly, the White County School district has refused to make either the new textbook or supporting materials available for public review.\nThe letter, addressed to the seven school members by name—Chairman Edd Cantrell, Vice Chairman Gary Sparkman, Jayson McDonald, Richard McBride, Kenneth Robinson, Janet Webb, and Roy Whited—presented a compelling argument:\nOur clients are, by this letter, documenting your numerous violations of White County School Board policies and, if the violations enumerated herein are not remedied promptly, they will seek any and all legal remedies, including writs of mandamus and ouster. They are considering other legal action as well, to include legal accountability for violation of state and federal law. Our investigation reveals that you have consistently been notified of the above violation and this, when combined with violation of the following sections of pertinent statute, Tenn. Code. Ann. § 49-2-301(b)(1), establishes the intentional lack of transparency which is not only illegal, but ignores the essence of your legal obligations and discharge of your duties.\nIn the letter, the parents group charges that:\nDuring your August Board Meeting, you and the White County Board established a textbook review committee consisting of various board members and administrators and appointed Mr. [Bryan] Wright as an adviser to that committee. Regrettably, the Board only involved Mr. Wright in one meeting and refused others entry to the committee meeting in violation of Board Policy B-7 and TCA §8-44-102(b). . . . “White County citizens are extremely angered by the approval of the 7th Grade textbook, “My World History and Geography: The Middle Ages to the Exploration of the Americas”and your actions and inactions have violated not only legislated laws, but the very Constitution of the State of Tennessee. Compare your actions with White County Board Policy A-1, wherein you mention your humble deference to that great document … our Constitution.”\nThe parents group tells the White County School Board “you have not only violated state, federal and local law, but you have lost touch with the very source of your authority to whom you owe the highest level of service: the Electorate, which you so aptly refer in the attached exhibit. It is easy to become comfortable within the bureaucracy and in a hurry to reach ‘rational’ decision when a more complicated, democratic movement is afoot.”\nIn addition to “adding policies which address the lack of transparency and website deficiencies,” the group demands the White County School Board pass the following resolutions:\n– The White County School Board will select textbooks that promote the basic democratic values of our state and national heritage, our republican form of government, and the principles of federalism. We will oppose the selection of textbooks that contain historical inaccuracies or omissions of world religions which could lead to religious bias. – White County Schools will not discipline or discourage Teachers, Principals and School Personnel “for reporting inaccuracies or errors or potentially inflammatory material in textbooks or other educational materials to supervisors, elected officials, or parents or guardians; prohibits requiring a teacher or other educator to agree not to report inaccuracies or errors or potentially inflammatory material in textbooks or other educational materials, as a condition of employment” as in accordance with Tennessee Law, Public Chapter 165 enacted on July 1, 2015. – White County Schools will include on their website; a copy of social studies state standards, a summary of the basic content of the instruction, a statement of a parent’s right to review the materials, and information describing a parent’s opportunity to participate in the review of social studies textbooks and supplemental materials. Parents may also request to remove their child from the instruction without retribution or penalty and the process for doing so will also be found on the White County Schools website and/or made available upon parental request. – Statewide Assessments, or end of course exams, often drive curriculum decisions. Therefore, Statewide Assessment and end of the course exams should be reviewed by teachers, parents and taxpayers, or school boards prior to administration of exam to confirm students are not being tested on their knowledge of any religion.\n“The biggest concern is the textbook is telling things that are untrue and is providing a false example of Islam,” Ed Butler, a member of the White County parents group, told WWTN Radio’s Dan Mandis on Tuesday.\n“Islam is presented as matter of fact,” in the Pearson textbook, Butler said. “For example, on page 79 of the textbook, it reads ‘Mohammad said he worships the same God as Christians and Jews. Mohammad respects those religions.’ But that’s not how we see it. Allah is not the same God worshipped by Christians and Jews,” Butler added.\n“The White County School Board is restricting information flow to parents, and not allowing us to speak at public board meetings,” Butler added.\n“Bryan Wright was going to be part of the textbook review process, but he was only allowed in one meeting. Other parents were not allowed in those textbook review meetings.”\n“It dumfounds me why they – the White County School Board—would not listen to the citizens of White County and to the right thing,” Butler told WWTN’s Mandis.\nMandis asked Butler what the next step is if the White County School Board continues to ignore your group.\n“The Citizens of White County would demand their resignations immediately,” Butler responded.\nButler noted that there is virtual unanimity from the White County parents of children in the seventh grade there who are being forced to use the Pearson textbook.\n“There are about 300 seventh grade students in White County. We have about 300 concerned parents in our group. That’s about every parent of a White County seventh grader,” Butler told WWTN’s Mandis.\nThe Tennessee parent rebellion is not limited to White County. In addition to nearby Overton County, uprisings are developing in Rutherford , Maury, and Williamson Counties as well.\nLast week in Williamson County, the affluent Nashville suburb, school board member Dr. Beth Burgos, one of several Common Core opponents swept into office in 2014, “proposed a resolution about the teaching of religion, particularly Islam, pertaining to sixth and seventh grade students.”\n“Williamson County parents and taxpayers have expressed concerns that some social studies textbooks and supplemental materials in use in Tennessee classrooms contain a pro-Islamic/anti-Judeo Christian bias,” she wrote in the resolution. “Therefore, we the Williamson County School Board encourage the state to develop social studies standards that reflect Tennessee’s commitment to public education. We know that the standards serve as the basic for statewide assessments, curriculum frameworks and instructional materials, but methods of instructional delivery must remain the responsibility of local educators.” She requested the following actions: that the state revise and clarify the social study standards; textbooks or supplemental instructional materials in Tennessee classrooms reflect a balanced and equitable perspective; supplemental instructional materials should be unbiased; the textbooks and material should be made available to parents and taxpayers. She also requested that, “no students shall ever be required as a qualification for graduation or statewide assessment to be tested on their knowledge of any religion.”\nBut Tim Gaddis, Williamson County assistant superintendent “said the textbooks treat all religion fairly and no religion is pushed on any student.”\nThis claim, however, is belied by the Breitbart News report that 10 of 75 learning objectives in the 7th Grade Social Studies standards (13 percent) deal with the tenets and history of Islam, while only 1 of 72 learning objectives in the 6th Grade Social Studies (1 percent) address the history of Christianity.\nNot all Williamson County School Board members support Dr. Burgo’s resolution, and its outcome remains in doubt.\nAs the Williamson Herald reported:\n“You can’t go by the number of pages that each religion gets [in the Pearson textbook]. We have problems with getting enough bus drivers or substitute teachers. It’s crazy to fool around with this,” [School Board member Bobby Hullett said.] Anne McGraw, 4th District, also weighed in on the matter. “I’ve talked to a lot of people, and it never came in any regard,” McGraw said.\n….\nThe resolution, if approved, will be forwarded to the state legislature. Dr. Mike Looney and Chairman Gary Anderson, 5th District, will review the resolution and decide whether it should go forward. It has also not been reviewed by legal counsel, Anderson said. Other board members such as McGraw said they would not sign the resolution and cannot support it.\nTennessee has 95 counties and approximately 140 distinct school districts.\nNot all 140 districts have adopted and purchased the Pearson textbook, but all are subject to the new Islamic-centric standards.\n“The Pearson text was only adopted by 30 of the 140 districts [in Tennessee]. McGraw Hill grabbed the rest of the market share,” Pearson Education’s Southern Regional Director, Dominic Chavez, tells Breitbart News.\nIf Tennessee’s recent past is any indication of how this political controversy will unfold, this grassroots parent rebellion is likely to spread to all 95 of the state’s counties, and to do so very soon.","url":"https://www.breitbart.com/politics/2015/10/20/parent-rebellion-brewing-tennessee-islam-centric-educational-standards/"}
