{"authors":["Assemblyman Tim Donnelly"],"date_download":"2018-10-30 22:02:30","date_modify":"2018-10-30 22:02:30","date_publish":"2017-03-29 11:44:26","description":"Parents of students at a North Hollywood middle school are livid after being informed that their school is now \"too white\" and must suffer.","filename":"data/vaneerConsumption/ParentsOutragedoverBudgetCutsatSchoolforBeingTooWhite.json","image_url":"https://media.breitbart.com/media/2017/03/Walter-Reed-Middle-School-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_03_29__1540936950.html","title":"Parents Outraged over Budget Cuts at School for Being 'Too White'","title_page":"Parents Outraged over Budget Cuts at School for Being 'Too White' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Parents of students at a North Hollywood middle school are livid after being informed that their school is suffering disproportionate budget cuts that could force layoffs and increase class sizes simply because the school has too high a population of white students.\nKABC, the local ABC News affiliate in Los Angeles, reports that an obscure court decision limits funds for schools with a higher white student count, i.e. where the white student percentage is above 30 percent. As a direct result of that decision, Walter Reed Middle School will lose more funding than other schools in the Los Angeles Unified School District (LAUSD).\nAccording to the KABC story, the district sent a letter to parents, noting that “the highly regarded middle school had been above the [racial] percentage for the past couple years.”\nAccording to the Los Angeles Daily News, Walter Reed Middle School is one of nine schools facing cuts because the non-white population has dipped below 70%. According to LAUSD’s spokeswoman, Barbara Jones, the following schools are also in jeopardy of being cut for having too high a proportion of white students:\n3rd Street Elementary (Hancock Park)\nBroadway Elementary (Venice)\nDahlia Heights Elementary (Eagle Rock)\nKnollwood Preparatory Academy Elementary (Granada Hills)\nPlainview Academic Charter Academy (Tujunga)\nStonehurst Avenue Elementary (Sun Valley)\nEmerson Community Charter (Westwood)\nGrant High (Valley Glen)\nThe decision follows a 1978 Los Angeles Superior Court-ordered desegregation program, under which LAUSD schools with large minority populations receive more funding when the proportion of white students stays below 30 percent. Schools that do not keep the “white student count” under 30% have their budgets cut.\n“If total enrollment doesn’t change, that could mean cutting five teaching positions and one counselor position,” Sandra Gephart Fontana, instructional director for Local District East, told the Daily News. “Most LAUSD schools do qualify as predominantly Hispanic, black, Asian or non-Anglo,” she said.\nParents are upset over the 2017 impact of a decision made over 40 years ago — a decision that is now harming some of the very minority students it was intended to help.\n“When your class sizes are getting larger and you’re taking resources away from students, I mean as parents, you do want your kid to go out to college,” one parent, Rosemary Estrada told KABC.\nThe rationale for the cuts — “too many white students” — has added insult to injury.\nTim Donnelly is a former California State Assemblyman and author, who’s doing a book tour for his new book: Patriot Not Politician: Win or Go Homeless.\nFaceBook: https://www.facebook.com/tim.donnelly.12/\nTwitter: @PatriotNotPol","url":"https://www.breitbart.com/local/2017/03/29/layoffs-due-to-too-many-white-students-outrages-parents-at-north-hollywood-school/"}
