{"authors":["Emma Glanfield For Mailonline"],"date_download":"2018-10-22 23:10:24","date_modify":"2018-10-22 23:10:24","date_publish":"2016-01-28 11:50:36","description":"The parents of 16-year-old Sophie Murray, from Accrington, Lancashire, who died after taking the Pill, are now calling on pharmaceutical firms to make women more aware of contraception risks.","filename":"data/vaneerConsumption/ParentsofSophieMurraywhodiedfromtakingthePillcallondrugsfirms.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30AA1D3F00000578-0-image-a-25_1453981949256.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420772_Parents-girl-16-died-rare-blood-clot-taking-Pill-call-drugs-firms-make-women-aware-risks_1540249824.html","title":"Parents of Sophie Murray who died from taking the Pill call on drugs firms","title_page":"Parents of Sophie Murray who died from taking the Pill call on drugs firms | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manufacturer of Sophie's Pill gave condolences but said warnings in place\nThe pair said: 'No parent in the world should have to bury their own child'\nHer parents are now calling on pharmaceutical firms to make more of risks\nSophie Murray, from Accrington, Lancashire, had been taking the Pill for eight months when she started to complain of breathing difficulties and chest pains following a family trip to Gran Canaria\nThe parents of a 16-year-old girl who died from a rare blood clot after taking the Pill are calling on pharmaceutical companies to make women more aware of the risks of oral contraception.\nSophie Murray, from Accrington, Lancashire, had been taking the Pill for eight months when she started to complain of breathing difficulties and chest pains following a trip to Gran Canaria.\nThe 'happy and healthy' schoolgirl died after 'suffering a fit' on November 8 last year, with doctors ruling her death was the result of a pulmonary embolism caused by deep vein thrombosis (DVT).\nAn inquest at Blackburn Coroners Court last week that she developed DVT after returning from Gran Canaria, with her contraceptive pill deemed to be a contributory factor in her death.\nHer parents, Billy and Shelly, are now calling on manufacturers and doctors to issue clearer warnings as they said they were previously unaware the Pill had potential side-effects involving flights abroad.\nSpeaking from the family's terraced home, Sophie's stepfather Billy Dearden said he believes the flight triggered a reaction as she had been on the Pill - without prior issue - for a number of months.\nThe 39-year-old painter and decorator said: 'If not [the flight] then why has it not happened straight away when she started taking it?\n'[The risks] should be made aware to all women using the Pill and especially youngsters. A lot of mothers do put their daughters on the Pill because of their cycle and they should be made aware that it can happen to healthy young girls as well.\n'We don't want anyone to have to go through what we've gone through.\n'No parent in the world should have to bury their own child.'\nSophie's mother Shelley Crichton, who works with adults with learning difficulties, said she was happy for her daughter to go on the Pill in a bid to help control her heavy period cycles.\nShe said: 'Sophie developed really early and did have really bad pains in her stomach and her cycles were really heavy. There must be loads of girls like that.\n'They should be given a bigger leaflet with bigger writing and clearer information for the Pill and doctors should stress to you to read it.'\nSophie's parents, Billy and Shelly (pictured), are now calling on manufacturers and doctors to issue clearer warnings as they said they were previously unaware the Pill had potential side-effects involving flights abroad\nSophie had been taking the Pill for eight months when she started to complain of breathing difficulties and chest pains following a family trip to Gran Canaria. She died after 'suffering a fit' on November 8 last year\nOnly six out of every 10,000 women on the contraceptive pill develop DVT, compared to only two in 10,000 without the pill, and Sophie's inquest was told that fatalities are 'extremely rare'.\nBayer which produces Microgynon, the type of Pill which Sophie was taking, offered its condolences to her family but said it had complied with regulations to update packaging information.\nRISKS ON WOMEN TAKING THE PILL Like most contraceptives, there are pros and cons to taking the Pill, with most doctors agreeing the benefits outweigh the risks. It been shown to protect against ovarian cancer, and cancer of the womb lining, as well as pelvic inflammatory disease - a major cause of infertility in women. It can also shorten a woman's periods and make them less painful, as well as provide relief from the symptoms of endometriosis and PCOS. However, research suggests the drugs slightly increase the risk of breast, cervical and liver cancer, as well as strokes, heart attack and blood clots. Bleeding in between periods, mood swings and headaches are other commonly-cited side effects. It can also increase blood pressure. Only six out of every 10,000 women on the contraceptive pill develop DVT, compared to only two in 10,000 without the pill. Fatalities as a result of the Pill are deemed to be 'extremely rare'. Natika Halil, chief executive of the Family Planning Association, said: 'For most women the benefits outweigh the risks but it’s really important to talk through the benefits and risks with a doctor or nurse.'\nA spokesman said: 'At this sad time, our thoughts are with Sophie's family.\n'Bayer takes the safety of its products very seriously and continuously reviews the safety profiles of its products.\n'Bayer has also complied with regulations to update the product information provided on the combined hormonal contraceptives (CHCs), including the package leaflet, to help women make informed decisions about their choice of contraception together with their healthcare professionals.'\nThe pharmaceutical firm also said the 'slightly increased' risk of developing blood clots for women taking the oral contraceptive pill was well-known and clearly stated on all information leaflets.\nThe spokesman added: 'Microgynon is considered effective and overall, has a favourable benefit-risk profile when used appropriately.\n'Risk of blood clots is slightly increased for women taking CHCs when compared with non-users.\n'This is a well-known class effect of all CHCs as is clearly stated in the patient information leaflet of CHCs. The risk however of blood clots in a woman taking a CHC is smaller than the risk of clots associated with pregnancy.'\nSophie had been prescribed the 'common' Microgynon pill for around eight months prior to her death in a bid to regulate her heavy periods.\nWhen she returned to the UK from the family holiday to Gran Canaria, she visited her doctors four times after complaining of aches, breathing problems and tightness in her chest.\nShe was eventually prescribed an inhaler following tests, however her mother says after using it for a week it 'wasn't doing anything at all' and she was given a different inhaler on November 5.\nThree days later she woke up saying she couldn't breathe and shortly after had a 'fit' and her 'lips turned blue'. She was rushed to hospital but passed away later that day.\nThe 'happy and healthy' schoolgirl (pictured with her younger brother Dominic, developed DVT after a return flight from Gran Canaria, with her oral contraceptive pill deemed to be a contributory factor in her death\nSophie's mother Shelley Crichton (pictured together above) said she was happy for her daughter to go on the Pill in a bid to help control her heavy period cycles but wants more warnings on oral contraception packets\nHer devastated parents are now coming to terms with the loss of their 'loyal, friendly, strong-minded and ambitious' daughter, who was studying for her GCSEs at Accrington Academy.\nShe was looking forward to studying A Levels before training to become a paramedic.\nMs Crichton said there are 'no words to describe' the loss of their daughter, who was a sister to 12-year-old Dominic, and said she 'had her head screwed on' with 'everything to live for'.\nShe added: 'Your kids are part of you. They are you. Dominic has been really strong. Whenever he sees me upset he comes and gives me a hug.\n'Sometimes I just don't want to get out of bed in the morning because it's a longer day.\n'I've always been a worrier anyway but I'm worrying and panicking more and more.'\nShe described Sophie as a 'typical teenage girl' who enjoyed music, dancing, exercise DVDs and socialising with friends.\n'We had lots of fun, she really enjoyed it and liked the sun, getting a tan and going shopping,' she recalled.\nMr Dearden added: 'She knuckled down and knew what she had to do. She wasn't one of these kids that hangs around on street corners. She knew what she had to do and was dedicated.\n'She had the drive and ambition of someone a lot older. We are trying to focus on one thing at a time, each day at a time.\n'On that day Shelley lost a lot of herself as well as Sophie.\n'It's left her a shell of her former self. It's left a hole in all our lives. Her brother, step-sister and step-brother all miss her terribly and still get sad.'\nSophie Murray is pictured on a family holiday with her mother Shelley and her younger brother Dominic, 12\nSophie (wearing black vest) is pictured with her stepbrother Lynk Dearden and stepsister Lexy Dearden\nThe couple, who spoke from the living room of their terraced home, are now planning on redecorating – after beginning the process just before Sophie passed away.\nThe walls of the room are stripped bare and it is sparsely decorated except for a large picture of their beloved daughter propped on a side table.\nMs Crichton said: 'Sophie felt the living room was really cold and not comfy. This year I was going to [redecorate it] anyway but what happened has just prompted me to get it done sooner rather than later.\n'It's getting the motivation and energy to go back to work and trying to do all these thing that Sophie wanted.\n'It's quite difficult to focus on one thing at once. She chose the sofa she wanted from DFS and I had to order that because I was worried about it getting discontinued.","url":"https://www.dailymail.co.uk/news/article-3420772/Parents-girl-16-died-rare-blood-clot-taking-Pill-call-drugs-firms-make-women-aware-risks.html"}
