{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:42:17","date_modify":"2018-10-30 22:42:17","date_publish":"2016-04-20 08:00:00","description":null,"filename":"data/vaneerConsumption/Parentsguidetofindingtherightschool.json","image_url":"https://calmatters.org/wp-content/uploads/ParentCollage.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939337.html","title":"Parent's guide to finding the right school","title_page":"Parent's guide to finding the right school | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Finding the right school for your child can be a daunting task. One family may want small class sizes and strong test scores while another places a high priority on arts and science programs. Others may prefer bilingual — or even trilingual — schools to gain a linguistic advantage or simply so their kids can talk to abuela or po po. Four families throughout California shared the lessons learned from their journeys in search of the right public school for their children. Sometimes they had to let go of their top choice. Sometimes they had to endure several rounds of enrollment. Other times, they were surprised to find that the best fit turned out to be their neighborhood school. There are lots of popular online school comparison tools to check out like GreatSchools.org. And California public schools produce report cards each year showing how many teachers are credentialed, average staff salaries, student achievement scores, suspension rates and the general condition of the school’s facilities. But there’s nothing like visiting a school, talking to teachers and other parents to find out if it’s an environment that will foster your child’s love of learning. While parents keep searching, school comparisons will soon be changing in California. This year, the state will redesign its system for evaluating public school performance to include more than just test scores. Gone is the three-digit Academic Performance Index based solely on math and English test results crafted during the No Child Left Behind era. The State Board of Education is looking at graduation rates, how fast English learners gain proficiency and other indicators to comply with a new federal law.\nWhat that new system will look like (one mockup uses a color spectrum of red to blue to indicate improvement) and whether schools will even be ranked remains fuzzy and politically charged. Teacher unions are concerned that evaluating a school based on test scores will lead to a slippery slope for teacher evaluations. And civil justice groups want to include measures of school climate in an effort to drive down suspension and expulsion rates that have been linked to the school-to-prison pipeline.\nUltimately, Fresno Unified School District Superintendent Mike Hanson says even if parents don’t get one number, they are sophisticated enough to find the things that are important to them. Fresno is among a group of urban school districts known as CORE districts pushing the envelope on measuring social-emotional growth, which can include how students handle conflict and manage their emotions.\n“Every kid is different. Parents know that very very well. And they look for different things in different schools for different kids,” Hanson said. “We all have a great deal of choice in our districts because parents want to have it.”\nNeighborhood schools can be wonderful\nMahasin Abuwi Aleem and E. Harith Aleem of Oakland Children: Aadam, 9; Isa, 6; Aasiya, 18 months. Hometown: Oakland, Lake Merritt School: Cleveland Elementary School Priorities: Diversity, test scores, curriculum and veteran teachers Experience: Despite tirelessly researching and enrolling what she thought were the best schools to fit her sons’ personalities, Aleem found structure and support just blocks away in her neighborhood school. Advice: Use online search tools, ask friends and acquaintances, and consider the family’s budget. “We’re priced out of Oakland,” Aleem said. “Potentially it would just make more sense to go somewhere a little bit cheaper where the incomes aren’t significantly less, which we think is the Sacramento area.”\nMahasin Abuwi Aleem, a graduate student, and her husband, a parks and recreation supervisor, conducted extensive research in Oakland for their sons, 9-year-old Aadam now in third grade and 6-year-old Isa in first grade. They also have a 14-month-old girl Aasiya.\nInstead of settling for their neighborhood school, she sent Aadam to a Waldorf-inspired charter school for creative learning and Isa to a Spanish dual-immersion program to foster his quick grasp of language. But the charter school was brand new and Isa’s teachers sent him home with a note for chewing pencils rather than finding out if he was intimidated or bored.\nBoth ended up at Cleveland Elementary School, their neighborhood school, where they are thriving.\n“We enrolled in our neighborhood public school and it was wonderful,” Aleem said. “It’s like four blocks from where we live, it’s really diverse, the kids for the most part are well behaved, veteran teachers and the parent population is very kind.”\nThe bilingual edge\nJen and Joe Ward of Los Angeles Children: Audrey 8; Olivia, 6 School: Aldama Elementary School Hometown: Los Angeles, Highland Park Priorities: Community, bilingual education, parent engagement Experience: The Wards let go of their top choice school and followed their instincts for a bilingual school with an inviting community feel. Advice: Visit schools and do your research but follow your gut and don’t overthink. “I got overwhelmed with excitement and got carried away,” said Jen Ward.\nIn Southern California, high test scores weren’t as important to Jen Ward as following her instinct for an inviting community and a desire for her oldest daughter, Audrey, to learn Spanish. The family in the Los Angeles neighborhood of Highland Park toured a mix of charter and neighborhood schools and was placed on a waitlist for their top pick. When school started, Ward started Audrey at a school with strong test scores but quickly realized it lacked warmth.\nDuring the first week, Ward received a call from Aldama Elementary School notifying her of an opening. She learned how the students spend half the day in English and half in Spanish. She was especially pleased to see how teachers went after grants for cognitive math instruction for their students.\n“I went down the street. It was just love. I pulled Audrey out immediately,” Ward, 41, said. “Two weeks later I got the call that I had gotten into the school I wanted and I turned it down.”\nAudrey’s younger sister, Olivia, is now at Aldama too.\nHigher expectations for Latinos and African-Americans\nLuis Sanchez and Maria Brenes of Los Angeles Children: Emiliano, 5; Alegria, 3 School: Arroyo Seco Museum Science Magnet School Hometown: Los Angeles, El Sereno Priorities: Elementary and middle school, culture of higher expectations for African Americans and Latinos, positive discipline and school climate Experience: A social equity advocate, Sanchez wanted a place where his son would be instilled with an expectation to attend college. After touring charter, magnet and traditional schools, they went with a K-8 program so Emiliano wouldn’t have to change schools in middle school. Advice: Get recommendations from friends and coworkers, visit schools. “The belief system you put out there and the belief system teachers have are critical to building the confidence of young people at a young age,” said Sanchez.\nBut Aldama was cut from Luis Sanchez’s list when he and his wife, Maria, scouted schools for their 5-year-old son Emilino. Even though the dual language program was attractive, they felt the neighborhood had been gentrifying and wasn’t sure their son’s needs would be a priority.\nSanchez, 41, a social equity advocate who works with the Alliance for Boys and Men of Color, applied and enrolled Emilino in kindergarten at Arroyo Seco Museum Science Magnet School in the Los Angeles neighborhood of Highland Park. The magnet school with 92 percent Latino students and 82 percent qualifying for free or reduced priced meals was on their short list because the K-8 school will allow Emilino to stay in one school longer.\n“It was more of a seamless transition that didn’t require us to figure out a middle school option. In my view, it’s truly hard to find a middle school in LAUSD,” said Sanchez, who drives five miles from their home in El Sereno to drop off Emilino.\nThey knew friends and colleagues who sent their children to Arroyo Seco. They felt it had a strong school culture that would teach their son about conflict resolution as a young Latino. The school was ranked 9 out of 10 under the Academic Performance Index in 2013. Under the first year of the California Assessment of Student Performance and Progress test using Common Core learning, 40 percent of students met math proficiency and 50 percent met English proficiency.\nSanchez said it’s imperative that schools instill a higher expectation of learning from African American and Latino students.\n“School culture and school climate is critical to me,” Sanchez said. “Part of it is how schools navigate kids of color … in terms of how they treat conflict and handle the energy (of students). It’s interesting because my life is reflective of the work I’m advocating on.”\nPersistence pays off\nHeather Barrett and Johan Almqvist of San Francisco Children: Olivia, 7; Magnus, 2 Hometown: San Francisco, Richmond District School: George Peabody Elementary Priorities: Skilled teachers, supportive community, test scores, late school start time Experience: Barrett and Almqvist rolled the dice on San Francisco’s angst-inducing enrollment process and have come to praise their daughter’s teachers for helping Olivia to excel academically. Advice: Get recommendations from friends and acquaintances, stay determined through the enrollment process and trust teachers. “Teachers are incredibly smart,” said Barrett. “Not that they weren’t when I was growing up but I feel they’re teaching at a higher level. Their game is stronger now and our kid has benefited enormously.”\nIn Northern California, San Francisco’s enrollment process has instilled terror in many parents — so much so that wealthy families have been known to move or send their children to private school.\nHeather Barrett, a strategy director in the advertising industry, and her husband Johan Almqvist, an international sales director in the publishing industry, credit persistence and determination for getting their 7-year-old daughter, Olivia, into George Peabody Elementary in San Francisco’s Inner Richmond neighborhood.\nThe district has a goal of integrating students of different race and socioeconomic backgrounds, but Barrett says it does so without considering the families. Parents identify their preferred schools but the district also factors in demographic information such as the mother’s educational attainment in assigning a school. A student could be assigned to a school miles away from home or to one that is underperforming. In Olivia’s case, Barrett and her husband went through three rounds of the application process just for kindergarten.\n“There is something going on that is incredibly opaque where the system appears to force school choices without thought about commute,” Barrett said. “So there’s an incredible amount of angst when your child turns 5.”\nStill, Barrett said she has been impressed with her daughter’s teachers and appreciates being in a community with resources to support teachers. In turn, the teachers have helped Olivia surpass her parents’ expectations, particularly as California schools adapt to new Common Core curriculum that emphasizes getting students ready for four-year college programs or ready for the workforce by the time they graduate high school.\n“The quality of the teaching is so strong, it defied my mental concept of what was possible,” Barrett said.","url":"https://calmatters.org/articles/parents-guide-to-finding-the-perfect-school/"}
