{"authors":["Kelly Schremph"],"date_download":"2018-10-30 22:43:12","date_modify":"2018-10-30 22:43:12","date_publish":"2014-08-14 20:12:21","description":"Some TV relationships are meant to last a lifetime: Monica and Chandler, Luke and Lorelai, Cory and Topanga, Lucy and Ricky. These couples encapsulated the true essence of real love, giving all of us hope that we too will one day find our Chandler…","filename":"data/vaneerConsumption/ParenthoodSeason6RymberShouldBreakUpForGoodThisTime.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ab550a22-1535-400a-949d-193eb9fe6ebd.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35721-parenthood-season-6-rymber-should-break-up-for-good-this-time_1540939392.html","title":"'Parenthood' Season 6 & Rymber Should Break Up For Good This Time","title_page":"'Parenthood' Season 6 & Rymber Should Break Up For Good This Time","title_rss":"NULL","source_domain":"bustle.com","text":"Some TV relationships are meant to last a lifetime: Monica and Chandler, Luke and Lorelai, Cory and Topanga, Lucy and Ricky. These couples encapsulated the true essence of real love, giving all of us hope that we too will one day find our Chandler Bings of the world. But then there are other TV couples who, despite their deep love for each other, really should not end up together. Those who love each other to an almost unhealthy level. Unfortunately, Parenthood ’s Ryan and Amber love story falls into that category.\nI know there are some hardcore Rymber fans out there, but I am definitely not one of them. I'm sorry. Please don't hate me. Yes, I admit that there’s a lot of love between these two. But it's also come with a ton of heartache and tears — mostly from Amber’s direction. (Speaking of which, someone needs to create a Best Crier category for the Emmys and give it to Mae Whitman because no one’s tears can break your heart faster than this girl’s.) Amber’s suffered enough because of this relationship and deserves a chance to be happy, which is something I honestly don’t believe Ryan can give to her.\nThere's just one problem with that: Amber might be pregnant, which will leave Rymber's relationship at a bit of a crossroads in Parenthood 's sixth season, depending on how that story arc all plays out. But I’m here to say that no matter what, these two should definitely be dunzo regardless of the outcome. And here’s why:\nThey’ve Had More Bad Times Than Good Times\nGranted, this show pretty much prides itself on making us weep each and every week, but no other character has shed more tears than Amber Holt (Kristina is a close second). And her sadness has mostly been due to one of two people: her father and Ryan. Throughout their entire relationship, Ryan has been the main source of Amber’s unhappiness. I mean, I’m no love expert or anything, but isn’t the person you’re dating with supposed to make you feel better and not worse? Ryan has driven her car while under the influence of alcohol; he’s gotten into bar fights with guys from Amber's job; he keeps his feelings all bottled up and refuses to fully let Amber in. This is not the foundation of a healthy relationship, let alone of two people who may be having a baby together. Back away slowly, everyone, because this relationship is toxic.\nRyan Proposed on a Whim\nIn life, it’s great to be spontaneous with some decisions — like taking a road trip or going skinny-dipping with friends in your next-door neighbor’s swimming pool (not speaking from my own experience or anything… ). Being impulsive is fun and encouraged, but not when it comes to big decisions like marriage. Ryan had just gotten back from his latest tour in Afghanistan and decided to pop the question out of nowhere. Can this be seen as romantic? Yes, absolutely. But a romantic gesture is not equivalent to a smart decision. You haven’t spent time with each other face-to-face for a while, but yes, jumping into a life-long commitment sounds like a great idea.\nEven Ryan Knows They Shouldn’t Be Together\nI can’t begin to imagine what soldiers of war go through, but some — like Ryan — have a hard time readjusting to society afterward. Your priorities change and everyday life seems a bit trivial. Ryan recognized that trait in himself, which is what made him decide to re-enlist and break things off with Amber for good. Their relationship wasn’t something he was ready for, and that’s okay. I’m just worried that this injury of his will make them both fall right back into each other's arms, completely ignoring why they ended things in the first place. All of the old issues are still there and a continuation of this relationship will only lead to further heartache down the road. Let’s just hope they remember that come next season.\nAs sad as it may be, it's for the best if these two say goodbye for good.\nImages: Jordin Althaus/NBC; buzzfeed; nbcparenthood/Tumblr; parenthood-gifs/Tumblr; fuckyeahamberandryan/Tumblr","url":"https://www.bustle.com/articles/35721-parenthood-season-6-rymber-should-break-up-for-good-this-time"}
