{"authors":[],"date_download":"2018-10-22 23:29:01","date_modify":"2018-10-22 23:29:01","date_publish":"2016-01-29 11:20:26","description":"The French government, Agence France-Presse (AFP) and Le Monde newspaper on Friday demanded that Burundi immediately free a French journalist and a British p...","filename":"data/vaneerConsumption/ParisdemandsimmediatereleaseofFrenchBritishjournalistsinBurundi.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h8zo-3bmscybNe842cce83474b54d559e-1_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422595_Paris-demands-immediate-release-French-British-journalists-Burundi_1540250941.html","title":"Paris demands 'immediate' release of French, British journalists in Burundi","title_page":"Paris demands 'immediate' release of French, British journalists in Burundi | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paris demands 'immediate' release of French, British journalists in Burundi\nThe French government, Agence France-Presse (AFP) and Le Monde newspaper on Friday demanded that Burundi immediately free a French journalist and a British photographer arrested while reporting in the volatile central African nation.\n\"We were concerned to learn of the arrests of French journalist Jean-Philippe Remy and British photographer Philip Moore,\" Fabius said in a statement.\n\"I call on Burundi's authorities to proceed with their immediate release. Diplomatic procedures are underway.\"\nFrench Foreign minister Laurent Fabius called on Burundi to release an arrested French journalist and British photographer ©Frederick Florin (AFP/File)\nThe two men were covering the crisis triggered in April last year by President Pierre Nkurunziza's decision to run for a controversial third term in office.\nHis quest to remain in power sparked weeks of street protests, a failed coup, frequent killings and a nascent rebellion.\nThe government has cracked down on the media, forcing independent outlets to shut down and driving some journalists into exile.\nRemy, a correspondent for Le Monde newspaper has won several awards, including the 2013 Prix Bayeux-Calvados for his coverage of the war in Syria.\nMoore, a freelance photographer, has frequently worked for AFP, Le Monde and other international publications, winning widespread acclaim for his photographs of conflicts in eastern Democratic Republic of Congo as well as Libya, Somalia and Syria.\nLe Monde demanded the release of the two men, who it said were arrested on Thursday afternoon while meeting with government opponents.\nAFP chairman Emmanuel Hoog said the reporters \"were arrested while carrying out their mission to inform\" and demanded they \"be released as soon as possible.\"\nHoog recalled that AFP's correspondent in Burundi, Esdras Ndikumana, who also worked for Radio France Internationale (RFI), was forced into exile after being arrested and beaten by government forces in August 2015.\n\"This new serious incident, after that suffered by our correspondent Esdras Ndikumana, indicates the extreme difficulty in reporting on the Burundi situation and the permanent threats to journalists' security,\" added Hoog.\nLe Monde said Remy had entered the country on January 19, and Moore on January 21.\n\"Both had visas and were only doing their job by meeting all parties involved in the tensions in Burundi,\" said the paper.\nBurundi has been in crisis since April when President Pierre Nkurunziza ran for a controversial third term, sparking street protests, a failed coup, regular killings and a nascent rebellion ©Griff Tapper (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422595/Paris-demands-immediate-release-French-British-journalists-Burundi.html"}
