{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:29:25","date_modify":"2018-10-30 21:29:25","date_publish":"2015-02-03 21:28:53","description":"Conrad Hilton, the younger brother of hotel heiress Paris Hilton, was arrested in Los Angeles Tuesday for acting out on a trans-Atlantic flight back in July, 2014. |","filename":"data/vaneerConsumption/ParisHiltonsBrotherJailedforTransAtlanticFreakoutCallsAirlinerEmployeesFkingPeasants.json","image_url":"https://media.breitbart.com/media/2015/02/conrad-hilton-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_02_03__1540934965.html","title":"Paris Hilton’s Brother Jailed for Trans-Atlantic Freakout: Calls Airliner Employees ‘F–king Peasants’","title_page":"Paris Hilton's Brother Jailed for Trans-Atlantic Freakout: Calls Airliner Employees 'F--king Peasants' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Conrad Hilton, the younger brother of hotel heiress Paris Hilton, was arrested in Los Angeles Tuesday for acting out on a trans-Atlantic flight back in July, 2014.\nAccording to multiple witness accounts, Hilton, 20, became enraged while aboard the aircraft at some point after it departed from London.\nWitnesses told officials the 20-year-old grabbed a flight attendant by the shirt and said, “I could get you all fired in 5 minutes. I know your boss! My father will pay this out. He has done it before. Dad paid $300k last time.”\nHe is also accused of punching the plane’s bulkhead right near an airline attendant, and terrorizing the flight’s children.\nAt some during his tirade, Hilton was reportedly heard yelling the following statements, according to TMZ:\n…If you wanna square up to me bro, then bring it and I will f–king fight you. …I am going to f–king kill you. …I will f–king rip through you. …I will f–king own anyone in this flight; they are f–king peasants…\nWitnesses also reported smelling the odor of marijuana, which Hilton is suspected of smoking in the plane’s restroom.\nAfter the meltdown, he reportedly fell asleep, whereafter the captain authorized crew members to restrain him to his seat with handcuffs for the remainder of the flight.\nAccording to documents, also obtained by TMZ, Hilton admitted to taking a sleeping pill before and later bragged that he had “buried” airline employees:\nI told all of them I could get all of their jobs taken away in less than 30 seconds.\nHilton’s attorney, Robert Shapiro, reportedly blames the behavior on a sleeping pill, which he says his client took before the flight.","url":"https://www.breitbart.com/entertainment/2015/02/03/paris-hiltons-brother-jailed-for-trans-atlantic-freakout-airliner-employees-are-f-king-peasants/"}
