{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 00:22:13","date_modify":"2018-10-23 00:22:13","date_publish":"2017-03-16 09:30:25","description":"The socialite, 36, is already pining after her romantic break with boyfriend Chris Zylka and shared a slew of intimate snaps from their trip where she posed in a plunging black swimsuit and pretty pink cover up.","filename":"data/vaneerConsumption/ParisHiltoncutssexyfigureduringromanticMexicobreak.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E529ADC00000578-0-image-a-30_1489654287628.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319304_Paris-Hilton-cuts-sexy-figure-romantic-Mexico-break_1540254133.html","title":"Paris Hilton cuts sexy figure during romantic Mexico break","title_page":"Paris Hilton cuts sexy figure during romantic Mexico break | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's just touched down in LA following her romantic trip to Mexico.\nBut Paris Hilton is already pining after her glorious break with new boyfriend Chris Zylka, 31.\nTaking to Instagram on Thursday morning, the socialite, 36, shared a slew of intimate shots from her time away and looked just incredible as she posed in front of the sea in a plunging black swimsuit and pretty pink cover up.\nScroll down for video\nBeach goddess! Paris Hilton, 36, looked incredible as she relaxed in the sunshine during romantic break with boyfriend Chris Zylka in Mexico\nParis posed in her elegant kimono in a flirtatious manner, dropping it off one shoulder as she soaked up the Mexican sunshine.\nShe shielded her eyes from the rays with a stylish pair of cat eye sunglasses and chose to wear her blonde tresses in tight braids to keep them back from her face as she sunbathed.\nThe model added an intricately embellished headpiece to her locks and made sure to put her enviable pins on display in other shots that saw her relaxing by her private pool on the beach edge.\nAnd clearly enjoying the view, Paris gushed to her 6.7million followers: 'Life is Beautiful in #Paradise.'\nPucker up! The Stars Are Blind singer couldn't resist planting a passionate kiss on her new beau in one Instagram snap\n'Life is beautiful in paradise': The Simple Life star has just touched down back in the UK but she's already pining after her idyllic trip\nSoaking up the sun: Paris flirted with the camera as she bared her shoulder in a flirting manner while modelling her pretty pink cover up\nGiving fans an insight into her new relationship too, Paris included several photos of herself and her new beau Chris in her recent upload.\nShe had sent her followers into a frenzy after branding Chris her 'Valentine' last month and now Paris has credited her partner for making her 'happy'.\nAlongside a photo of the Stars Are Blind singer and Chris cuddling up together on the sand, Paris wrote: 'And there's this guy and the way he laughs makes me smile.\n'The way he talks gives me butterflies. And everything about him makes me happy...'\nIn another post, the smitten Simple Life star could be seen planting a passionate kiss on her boyfriend.\nPutting her pins on display: The model wasn't afraid to flash the flesh in her plunging black swimsuit that she teamed with an intricate head piece\n'And there's this guy...': Paris was spotted gushing about boyfriend Chris on Instagram and credited him for making her happy\nChris had been engaged to DVF brand ambassador Hanna Beth Merjos in April 2014, but they called it off less than a year later and split in early 2015.\nParis has also been set to wed on two previous occasions. She was also engaged to Greek shipping heir Pairs Latsis from May to October 2005 and was engaged in 2002 to fashion model Jason Shaw before their split in 2003.\nNow Paris is besotted with Chris and the couple had ventured to an exclusive beachfront, nature-centred resort for their loved-up holiday.\nIt offers organic food, an holistic wellness spa and daily yoga with prices starting at $1,200 per person, per night.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319304/Paris-Hilton-cuts-sexy-figure-romantic-Mexico-break.html"}
