{"authors":["Nick Hallett"],"date_download":"2018-10-30 17:53:35","date_modify":"2018-10-30 17:53:35","date_publish":"2017-02-22 12:49:29","description":"Paris and the surrounding region lost 1.5 million tourists on 2016 as visitors, especially from the Far East, stay away due to ongoing terror fears.","filename":"data/vaneerConsumption/ParisTourismFalls15Millionin2016afterTerrorFears.json","image_url":"https://media.breitbart.com/media/2016/07/FRANCE-ATTACKS-SECURITY-EIFFEL-TOWER.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_22__1540922015.html","title":"Paris Tourism Falls 1.5 Million in 2016 after Terror Fears","title_page":"Paris Tourism Falls 1.5 Million in 2016 after Terror Fears","title_rss":"NULL","source_domain":"breitbart.com","text":"Paris and the surrounding region lost 1.5 million tourists on 2016 as visitors, especially from the Far East, stay away due to ongoing terror fears.\nAccording to the Comité Regional du Tourisme, the Paris Ile-de-France region also lost 1.3 billion euros in tourist income, while the number of nights spent by foreign visitors in the region’s hotels also fell by 10.8 per cent.\nSome sights in particular “have suffered deeply from the lack of tourists and cancellations by school groups”, the committee says, including the Arc de triomphe which saw a 24 per cent drop in visitors.\nThe Louvre museum, which earlier this month was subject to an attack from a machete wielding man shouting “Allahu Akbar”, also saw a 13.3 per cent drop last year.\nThe fears have even hit Disneyland Paris, which saw a 9.5 per cent drop in foreign visitors.\nThis month has seen a series of disturbances in Paris’s suburbs, with one coachload of Korean tourists robbed when men climbed aboard their coach, shouting threats.\nOne witness described the incident as “ten minutes of horror”, revealing that one of the men threatened the tourists with an object “resembling a glass bottle”.\nThe disturbances began after a black youth was allegedly raped with a police truncheon while being arrested. Evenings of rioting spread through the suburbs, with cars torched, windows smashed and shops looted. At times, police appeared to have completely lost control of the situation.\nThe South Korean government has now warned nationals from visiting Paris as tourists, in a move which will cause further damage to France’s ailing tourism industry.\nThe city also announced this month it was building an eight-foot tall bullet-proof glass wall around the Eiffel Tower, with visitors forced to enter through new security check points.\nParis suffered one of the worst terror attacks in recent European history in November 2015, when 130 were killed in a series of bombings and shootings across the city.\nThose attacks came just months after Islamists stormed the offices of satirical magazine Charlie Hebdo and murdered several staff, including the editor.","url":"https://www.breitbart.com/europe/2017/02/22/paris-tourism-falls-1-5-million-2016-terror-fears/"}
