{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 23:25:29","date_modify":"2018-10-22 23:25:29","date_publish":"2017-03-16 06:43:42","description":"The 36-year-old socialite held hands with new boyfriend Chris Zylka on Wednesday as they arrived back in Los Angeles after a romantic Mexico getaway.","filename":"data/vaneerConsumption/ParisHiltonandChrisZylkaholdhandsatLAX.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E51FCFD00000578-0-image-a-109_1489646414222.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319022_Paris-Hilton-beau-Chris-Zylka-hold-hands-LAX_1540250729.html","title":"Paris Hilton and Chris Zylka hold hands at LAX","title_page":"Paris Hilton and Chris Zylka hold hands at LAX | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paris Hilton held hands with new boyfriend Chris Zylka on Wednesday as they arrived back in Los Angeles after a romantic Mexico getaway.\nThe 36-year-old socialite smiled while clasping Chris, 31, at Los Angeles International Airport.\nParis opted for the casual chic look with a grey scoop neck T-shirt with a Pentax camera graphic, black leggings and thick black boots.\nSmitten smile: Paris Hilton held hands with boyfriend Chris Zylka as they arrived in Los Angeles on Wednesday after a romantic getaway at a resort in Mexico\nShe completed her look with a khaki green jacket and black cap and carried a Sprayground B-52 Bomber Wings backpack.\nThe Simple Life star accessorized with sunglasses and stud earrings.\nParis had her long blonde hair gathered in two loosely braided ponytails.\nChris kept it simple in an all-black ensemble that included a plain baggy sweatshirt, skinny pants and sneakers.\nLook of love: Chris beamed while clasping hands with Paris at the airport\nCasual style: Paris and Chris kept it casual for their trip from Mexico\nClassic look: The former model did the classic chin on shoulder pose at the airport while carrying a Sprayground B-52 Bomber Wings backpack\nHe also sported a backward black NYPD cap.\nParis also took to Instagram on Wednesday to share snaps from their stay in Tulum.\nChris and Paris in one series of photo gazed lovingly at each other and kissed on a deck near gorgeous green and blue water.\nMexican getaway: The socialite shared photos on Instagram from her getaway in Tulum\nCool pool: Paris cooled off in a pool in another snap shared on Instagram\n'The most beautiful view is the one I share with you...,' Paris wrote in the caption for her nearly 7 million followers.\nShe also posted photos of herself soaking up the sun in a black bathing suit with a pink coverup and standing in a pool.\n'Life is Beautiful in #Paradise,' Paris wrote in the caption.\nBeautiful view: Chris and Paris looked at each over lovingly in another photo\nTender moment: The Simple Life star also shared a snap of her and Chris kissing\nParis and Chris were spotted bike riding Monday along the streets of Tulum.\nThey stayed at an exclusive beachfront nature-centered resort that offers organic food, holistic wellness spa and daily yoga with prices starting at $1,200 per person, per night.\nParis sent her fans into a frenzy last month when she posted a photo of her and Chris on April 19 captioned: 'My Valentine'.\nSoaking it up: Paris soaked up sun near palm trees and gorgeous green and blue water\nOcean breeze: The blonde beauty called the place 'Paradise'\nShe has since posted numerous photos of her and Chris including a set of selfies earlier this month with the caption: 'Home is where you are'.\nChris was engaged to DVF brand ambassador Hanna Beth Merjos in April 2014, but they called it off and broke up in early 2015.\nParis was previously engaged to Greek shipping heir Paris Latsis from May to October 2005 and was engaged in 2002 to fashion model Jason Shaw before their split in early 2003.\nFormerly engaged: Paris is shown in June 2005 in London with former fiance Paris Latsis\nThe great-granddaughter of Hilton Hotels founder Conrad Hilton rose to fame on the Fox reality series The Simple Life co-starring then-friend Nicole Richie.\nA sex tape of Paris and then-boyfriend Rick Salomon, 49, was leaked just weeks before the December 2003 premiere of The Simple Life.\nParis began her modeling career as a teenager and has since become a successful international DJ.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319022/Paris-Hilton-beau-Chris-Zylka-hold-hands-LAX.html"}
