{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 00:12:38","date_modify":"2018-10-23 00:12:38","date_publish":"2016-01-11 08:55:20","description":"Abdelhamid Abaaoud was the ringleader of the terror cell which killed 130 people in November. French investigators have since discovered he travelled to the UK last year","filename":"data/vaneerConsumption/ParisterrorattacksmastermindAbdelhamidAbaaoudcameintoBritainbyferry.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3006715D00000578-0-image-a-11_1452502192564.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393550_Paris-terror-attacks-mastermind-Abdelhamid-Abaaoud-came-Britain-ferry_1540253558.html","title":"Paris terror attacks mastermind Abdelhamid Abaaoud came into Britain by ferry","title_page":"Paris terror attacks mastermind Abdelhamid Abaaoud came into Britain by ferry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fresh fears have been raised over border controls at Britain's ferry ports after it emerged an ISIS terrorist behind the Paris attacks travelled into the UK through Dover last year.\nAbdelhamid Abaaoud was the ringleader of the terror cell which slaughtered 130 people in the French capital in November. He was later killed in a police raid on his hideout.\nFrench investigators have since discovered he travelled to the UK earlier last year and had photos of British landmarks on his mobile phone.\nThe apparent ease with which the ISIS commander was allowed to enter the UK - despite being the subject of an arrest warrant by Belgian authorities - has led to further criticism of Britain's border guards and security services.\nAbdelhamid Abaaoud, who orchestrated the terror attacks in Paris last November, travelled to Britain earlier in the year and met with fellow extremists, it emerged today\nShadow Home Secretary Andy Burnham told The Guardian: 'It would appear extremists perceive the ferry border to be a weak link.\n'The home secretary [Theresa May] must conduct an urgent review of border security at ferry terminals and provide urgent reassurance that passports are being properly checked on exit and arrival in the UK.'\nAbaaoud is understood to have entered Britain through the port of Dover in Kent, although dates of his arrival and departure have not been given.\nIt is believed he met several jihadists in London and Birmingham, but it is unclear whether the photos on his phone were part of plans for an attack.\nDuring the attacks in Paris in November, Abaaoud killed up to 20 people in cafes and bars with an automatic rifle before making his way to the Bataclan concert hall, where he directed the murders of a further 89 men and women.\nCCTV images emerged this weekend of him calmly making his way around the city while the carnage unfolded.\nIt came after CCTV footage was revealed of Abaaoud calmly travelling around Paris during the attacks\nHe had been the subject of an arrest warrant issued by Belgium, where in July last year he was sentenced in absentia to 20 years in prison for recruiting jihadists to fight in Syria.\nThe 28-year-old of Moroccan origin had in the past boasted of evading police in Europe, and taunted European authorities from what was assumed to be an ISIS base in Syria.\nHe also bragged about escaping from Europe after Belgian police shot dead two of his fellow jihadists in the eastern town of Verviers as they broke up a cell planning attacks on security personnel last year.\nAbaaoud had first popped up on the radar of Belgian security forces after featuring in an ISIS video released in 2014, laughing as he drove a car which dragged mutilated bodies behind it.\nIt emerged last week that least five Islamic extremists either on police bail or subject to a ban prohibiting them from leaving the country have managed to flee Britain to join ISIS in the last 20 months.\nAbaaoud's travel into Britain through the Dover port (pictured) has raised further questions about UK borders\nIt has also been revealed that the masked executioner believed to be the 'new Jihadi John' escaped from Britain despite being on bail for suspected terror offences. He is thought to have used the same route through Dover.\nSiddartha Dhar - believed to be the killer in ISIS's latest video - was arrested in September 2014 on suspicion of encouraging terrorism as a member of the banned al-Muhajiroun group.\nWithin two days of his arrest, the 32-year-old skipped bail and fled to Syria after boarding a Paris-bound coach at Victoria bus station in London with his pregnant wife and four children.\nSurrey’s police and crime commissioner Kevin Hurley has also spoken of fears that the so-called 'Jungle' migrant camp in Calais is home to ISIS extremists.\nMr Hurley, a former head of counter-terrorism at City of London police, told regional news programme Inside Out: 'The fact is, we have absolutely no idea who is there because it’s completely unpoliced. It is precisely the sort of place I would hide if I was a jihadist – in plain sight.'","url":"https://www.dailymail.co.uk/news/article-3393550/Paris-terror-attacks-mastermind-Abdelhamid-Abaaoud-came-Britain-ferry.html"}
