{"authors":["Domenico Montanaro"],"date_download":"2018-10-23 05:17:02","date_modify":"2018-10-23 05:17:02","date_publish":"2015-12-01 00:00:00","description":"The U.S. and China are the world's two largest polluters, but the will to do something about climate change is lower in both than in the rest of the world. In the U.S., there's a party split.","filename":"data/vaneerConsumption/ParisClimateTalksFaceAFamiliarHurdleAmericanPolitics.json","image_url":"https://media.npr.org/assets/img/2015/12/01/ap_706366090542_wide-17e4eaf82d4b8d615c790861e5a1db3353e32e84.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_12_01_457939497_paris-climate-talks-face-a-familiar-hurdle-american-politics_1540271822.html","title":"Paris Climate Talks Face A Familiar Hurdle - American Politics","title_page":"Paris Climate Talks Face A Familiar Hurdle — American Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Paris Climate Talks Face A Familiar Hurdle — American Politics\nEnlarge this image toggle caption David Goldman/AP David Goldman/AP\nPresident Obama struck an optimistic tone Tuesday on the second day of the Paris climate talks. But he also touched on the domestic political difficulty in a country still heavily reliant on coal — and when it comes to dealing with Republicans on the issue.\n\"Everybody else is taking climate change really seriously,\" Obama said. \"They think it's a really big problem. It spans political parties. You travel around Europe and you talk to leaders of governments and the opposition, and they are arguing about a whole bunch of things. One thing they're not arguing about is whether the science of climate change is real and whether or not we have to do something about it.\"\nBut there is a strong segment of the U.S. political culture that is intent on having that debate. And with Republicans controlling both chambers of Congress, there isn't much chance that anything this president presents — a climate change treaty or otherwise — will pass.\nTake his efforts to limit carbon emissions through the Environmental Protection Agency, or put a price on carbon. \"Obviously, I'm not under any illusion that this Congress will impose something like that,\" Obama said in Paris.\nIn the U.S., opinions on climate change are sharply divided along party lines. Republicans don't see it as a very serious problem or one that will affect them personally. But, above all, it comes down to a matter of priorities — the environment versus the economy and personal financial situations.\nThe politics are not just difficult in the U.S. It's even more complicated in China. That matters because the U.S. and China are the world's largest polluters, and a lasting, meaningful agreement with China is one of the keys to success for Obama in Paris.\nA very serious problem?\nPeople in both the U.S. and China don't think climate change is that serious a problem, at least as it relates to the rest of the world.\nIn the U.S., 45 percent of Americans say it is, which is below the global median of 54 percent, according to a Pew Research Center survey conducted from March to May of this year of people in 40 countries and more than 45,000 telephone and face-to-face interviews.\nIn China, it's way lower — just 18 percent of Chinese said they think it's a very serious problem. That's the lowest of all 40 countries surveyed. Here's the rub: It's not like people in China don't think climate change is harming people now — 49 percent said so. That's a higher percentage than Americans (41 percent).\nShould the U.S. pursue a Paris deal limiting greenhouse gas emissions?\nWhen it comes to Paris specifically, Americans overwhelmingly support action, but again, below the levels of other countries — 69 percent said they support limiting greenhouse gas emissions as part of a deal, but about a quarter oppose that.\nFor context, the median of all other countries was 78 percent in support. And that 24 percent opposition in the U.S. was second only to Turkey (26 percent).\nIs climate change hurting people now?\nAmericans don't think so, and other countries are pretty split on it, too. In the U.S., 41 percent think it is, while a majority (51 percent) of the rest of the world does.\nDomenico Montanaro/NPR/CBS News/New York Times poll, conducted Nov. 18-22, 2015, margin of error plus or minus 4 percentage points\nWill climate change hurt me personally?\nAmericans are not very concerned that it will it. Just 30 percent say so, while 40 percent globally believe it will.\nHow does some of this break down between Democrats and Republicans?\nUnsurprisingly, there's a big split along party lines in the U.S. For example:\n-- Very serious problem? While 68 percent of Democrats see climate change as a very serious problem, just 1 in 5 Republicans does.\n-- Harming people now? More than half of Democrats see climate change as harming people now, and only a quarter of Republicans do.\n-- Limit greenhouse gas emissions? While 82 percent of Democrats support limiting greenhouse gas emissions, Republicans are split, with 50 percent in support.\nA CBS News poll out Monday also bore out similar splits:\n-- Causing serious impact now? Sixty-eight percent of Democrats said global warming is causing a serious impact now, and just 29 percent of Republicans said so. In fact, the plurality of Republicans — 1 in 3 — said it won't have a serious impact at all.\n-- Caused by humans? Seventy-two percent of Democrats think it's caused by human activity; 60 percent of Republicans think either it is caused mostly by natural patterns or that global warming does not exist.\ntoggle caption Domenico Montanaro/NPR/CBS News/New York Times poll, conducted Nov. 18-22, 2015, margin of error plus or minus 4 percentage points\nMatter of priorities\nThe most telling question, though, may have been this one from CBS News, which asked which is more important — stimulating the economy or protecting the environment?\nTo that, a majority of Democrats (54 percent) said the environment; a majority of Republicans (50 percent) said the economy.","url":"https://www.npr.org/2015/12/01/457939497/paris-climate-talks-face-a-familiar-hurdle-american-politics"}
