{"authors":["Allyson Koerner"],"date_download":"2018-10-31 01:44:56","date_modify":"2018-10-31 01:44:56","date_publish":"2018-08-27 20:40:21","description":"Fans won't be getting a Hilton wedding this year. Paris Hilton and Chris Zylka pushed their wedding back until next year, Hilton confirmed to People. Originally, the couple was hoping to get married this year and possibly even on Nov. 11, 2018, but…","filename":"data/vaneerConsumption/ParisHiltonChrisZylkasWeddingGotPushedBackForATotallyUnderstandableReason.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/2f06d012-dd12-42d4-a335-d3995d8d5d2f-getty-655261778.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_paris-hilton-chris-zylkas-wedding-got-pushed-back-for-a-totally-understandable-reason-10254705_1540950296.html","title":"Paris Hilton & Chris Zylka's Wedding Got Pushed Back For A Totally Understandable Reason","title_page":"Paris Hilton & Chris Zylka's Wedding Got Pushed Back For A Totally Understandable Reason","title_rss":"NULL","source_domain":"bustle.com","text":"Fans won't be getting a Hilton wedding this year. Paris Hilton and Chris Zylka pushed their wedding back until next year, Hilton confirmed to People. Originally, the couple was hoping to get married this year and possibly even on Nov. 11, 2018, but now they aren't for a reason that's both understandable and relatable.\nIn the interview with People, Hilton explained,\n\"I want to be able to be relaxed, not stressed out and not having to rush off to a different country the next day. I want to be able to go directly from my wedding to my honeymoon and with my schedule [right now] that would be impossible.\"\nPlanning a wedding is stressful enough, so no wonder they want to take their time and ensure they aren't exhausted before, during, and after their special time. As Hilton said, \"We’re both just working so much and decided it would be much better just to push it to next year. With all the planning I want it to be perfect and you can’t rush something like this.\"\nOn Aug. 15, E! News reported Hilton and Zylka's wedding was being pushed. A source also told the publication Hilton had her \"heart set on\" Nov. 11 of this year for their nuptials. \"That was her dream date,\" the source claimed. \"But there's just too much to do and between her work and travel schedule, not enough time to do it. She is dead set on getting married so the wedding will happen. Just not as quickly as she had hoped. As of now, it's looking like a spring wedding instead.\"\nChristopher Polk/Getty Images Entertainment/Getty Images\nHilton told People that Nov. 11 was never their official wedding date, but an idea Zylka came up with. \"The 11/11 thing was never a set date,\" she explained. \"It was just, 11/11 is something I love because I always say, '11:11, make a wish for good luck.' So Chris was like, 'Oh let’s do it on 11/11. That's such a special number for you.'\"\nThe former reality star agreed with Zylka, but they didn't realize until they looked at their schedules that it wouldn't work. Hilton explained, \"Then this summer we were looking at our schedules and I was like, 'Oh my goodness we are both working nonstop until like New Year's.'\"\nIn January, Hilton and Zylka got engaged after two years together. At the time of their engagement, Hilton told People, \"I am so excited to be engaged to the love of my life and my best friend. I have never felt so happy, safe and loved. He is perfect for me in every way and showed me that fairytales really do exist!\"\nZylka echoed Hilton's sentiment and told the outlet, \"Paris is the most beautiful and incredible woman both inside and out. I feel like the luckiest man in the world to be marrying my dream girl. I can’t wait to spend the rest of our lives together.\"\nThey seem to be head over heels in love with another, so they should absolutely make their wedding as perfect as can be, even if that means pushing the date to next year.","url":"https://www.bustle.com/p/paris-hilton-chris-zylkas-wedding-got-pushed-back-for-a-totally-understandable-reason-10254705"}
