{"authors":["Fionn Hargreaves For Mailonline"],"date_download":"2018-10-23 00:11:41","date_modify":"2018-10-23 00:11:41","date_publish":"2017-03-10 06:00:48","description":"Police in Seoul threw gas at protesters who supported deposed president Park, who was accused of corruption charges and could face jail. The group tried to breach the court.","filename":"data/vaneerConsumption/ParkGeunhyeimpeachmentsparkspoliceclashesinSeoul.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21D77C00000578-0-image-a-25_1489136763031.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300076_S-Korean-court-throws-president-office-2-dead-protest_1540253501.html","title":"Park Geun-hye impeachment sparks police clashes in Seoul","title_page":"Park Geun-hye impeachment sparks police clashes in Seoul | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two protesters were killed during violent clashes with police after a South Korean Court removed President Park Geun-hye from office.\nOfficers threw gas at hundreds of Park's supporters as they tried to breach a police blockade in front of the constitutional court in Seoul today.\nOne elderly man was taken to hospital with a head injury and the second death is being investigated.\nScroll down for video\nTwo protesters were killed during a demonstration in Seoul after President Park Geun-hey was removed from office. Police threw gas at the crowds, who were trying to reach the constitutional court in the capital\nShocking pictures show supporters of the former president getting into scuffles with police, who formed a human shield to keep the agitators from the court.\nA protester is pepper sprayed in a clash with police. He is holding up a large measure of rope and has a South Korean flat attached to his backpack\nWhile some people stood right in front of the police barricade, one man in a red cap tried to pick a fight with two police officers.\nSpectators and fellow demonstrators stood and took pictures of the man as he fought with the police.\nOfficers also pepper-sprayed pro-Park protesters, who recoiled as they tried to press through the police line.\nDemonstrators started hitting buses in the area with large poles as frightened members of the public stood on top of the vehicles and looked on.\nPolice in riot gear sat on the roof of a bus and deflected the protesters' poles.\nPark is the first democratically elected leader of South Korea to be ousted and was impeached because of a corruption scandal.\nThe court's acting chief judge, Lee Jung-mi, said Park had violated the constitution and law 'throughout her term', and despite the objections of parliament and the press, she had concealed the truth and cracked down on critics.\nPro-Park protesters faced off against police in the city centre. The police formed a barricade stopping demonstrators from reaching the constitutional court, where President Park was impeached\nPictured, the police clash with protesters and spray them to keep the crowds at bay. President Park was removed from office over allegations of corruption and could now face jail as she no longer has presidential immunity\n'The removal of the claimee from office is overwhelmingly to the benefit of the protection of the constitution. ... We remove President Park Geun-hye from office,' Lee told the hearing.\nA presidential election will be held within 60 days.\nPark, 65, no longer has immunity as president, and could now face criminal charges over bribery, extortion and abuse of power in connection with allegations of conspiring with her friend, Choi Soon-sil.\nProtesters smashed a police bus window at the rally. Park is the first democratically elected leader of South Korea to be ousted and was impeached because of a corruption scandal\nOne elderly man was taken to hospital with a head injury and the second death is being investigated. Pictured, police cordoned off a blood-stained area of pavement\nPark was stripped of her powers after parliament voted to impeach her but has remained in the president's official compound, the Blue House.\nA spokesman said on Friday she would leave and return to her private home in Seoul.\nPark was accused of colluding with her friend, Choi and a former presidential aide, both of whom have been on trial, to pressure big businesses to donate to two foundations set up to back her policy initiatives.\nThe court said Park had 'completely hidden the fact of (Choi's) interference with state affairs'.\nPark was also accused of soliciting bribes from the head of the Samsung Group for government favours, including backing a merger of two Samsung affiliates in 2015 that was seen as supporting the succession of control over the country's largest 'chaebol' conglomerate.\nA group of police stand on a bus with an injured member of the public during the protests. More than 70 per cent of the public supported Park's impeachment\nDemonstrators also used large poles to batter a bus. Police in riot gear sit on top of the bus and try to ward the public away. Park is accused of colluding with her friend and soliciting bribes from the head of the Samsung Group\nSamsung Group leader Jay Y. Lee has been accused of bribery and embezzlement in connection with the scandal and is in detention. His trial began on Thursday.\nHe and Samsung have denied wrongdoing.\nWhile Park's supporters clashed with police outside the court, elsewhere in the city people welcomed her ouster.\nA recent poll showed more than 70 percent supported her impeachment.\nPark was stripped of her powers after parliament voted to impeach her but has remained in the president's official compound, the Blue House. A spokesman said on Friday she would leave and return to her private home in Seoul\nPictured, protesters tried to get at police on top of buses by yanking them with poles. Other members of the public also stood on the buses and recorded the clash\nAn injured supporter of Park was strapped to a table after protests against the politician's impeachment became violent. Police blocked the main thoroughfare in the capital today\nPolice blocked the main thoroughfare running through downtown Seoul in anticipation of bigger protests.\nProsecutors have named Park as an accomplice in two court cases linked to the scandal, suggesting she is likely to be investigated and could face legal proceedings.\nParamedics give first-aid treatment to a protester near the constitutional court. It is believed that the protester died later in a hospital\nPrime Minister Hwang Kyo-ahn was appointed acting president and will remain in that post until the election. If Hwang resigns, as some media have speculated he may to run for president, the finance minister will take over as acting president.\nThe U.S. State Department said it would continue to work with the acting president and whoever becomes the next president.\nRelations with China and the United States could dominate the coming presidential campaign, after South Korea this month deployed the U.S. THAAD missile defence system in response to North Korea's stepped up missile and nuclear tests.\nChina has vociferously protested against the deployment, fearing its sophisticated radar could see into its own missile deployments.\nNorth Korean state media denounced Park as a criminal.\n'She had one more year left as 'president' but, now she's been ousted, she will be investigated as a common criminal,' the North's state KCNA news agency said.","url":"https://www.dailymail.co.uk/news/article-4300076/S-Korean-court-throws-president-office-2-dead-protest.html"}
