{"authors":["Associated Press"],"date_download":"2018-10-23 02:13:36","date_modify":"2018-10-23 02:13:36","date_publish":"2017-03-10 11:14:28","description":"SEOUL, South Korea (AP) - A South Korean court ruling that formally ended Park Geun-hye's presidency Friday has also stripped her of all the privileges she...","filename":"data/vaneerConsumption/Parkstrippedofrighttobeburiednexttodictatorfather.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195537-1489144472-309_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300872_Park-stripped-right-buried-dictator-father_1540260816.html","title":"Park stripped of right to be buried next to dictator father","title_page":"Park stripped of right to be buried next to dictator father | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - A South Korean court ruling that formally ended Park Geun-hye's presidency Friday has also stripped her of all the privileges she could have enjoyed as a former head of state, including the right to be buried alongside her late dictator father at a national cemetery.\nHer father, Park Chung-hee, continues to divide South Korea because he ruthlessly suppressed civic rights, though supporters say he spearheaded South Korea's dramatic economic rise during his 18-year rule. The senior Park, who was gunned down by his spy chief in 1979, is buried at Seoul's national cemetery with his wife, former first lady Yuk Young-soo, who was killed in an assassination attempt on Park in 1974.\nThe daughter returned as leader to her childhood home, the presidential Blue House, in early 2013 largely thanks to public nostalgia for her father. But the 65-year-old now must vacate her presidential residence because the Constitutional Court upheld her December parliamentary impeachment over a corruption scandal that has already sent many of her associates to jail.\nA supporter of South Korean President Park Geun-hye holds up her portrait during a rally opposing her impeachment in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nAs a former president, Park can no longer exercise presidential immunity from prosecution and will likely face investigation.\nBecause she was ousted before her term ended, Park also loses a monthly pension, estimated by local media at 12 million won (about $10,000); a state-provided office; and free medical, telecommunication and other services, according to South Korean law.\nPark will still get bodyguards, according to the law.","url":"https://www.dailymail.co.uk/wires/ap/article-4300872/Park-stripped-right-buried-dictator-father.html"}
