{"authors":["Arkansas Online"],"date_download":"2018-10-30 19:16:06","date_modify":"2018-10-30 19:16:06","date_publish":"2015-05-04 07:25:00","description":"A 40-year-old parolee from Sherwood is accused of trying to rob a woman of her purse outside Park Plaza Mall and then holding up two people outside a Little Rock movie theater.","filename":"data/vaneerConsumption/ParoleechargedinrobberyatLittleRockmall.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_may_04_parolee-charged-robbery-little-rock-mall__page=1_1540926966.html","title":"Parolee charged in robbery at Little Rock mall","title_page":"Parolee charged in robbery at Little Rock mall","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A 40-year-old parolee from Sherwood is accused of trying to rob a woman of her purse outside Park Plaza Mall and then holding up two people outside a Little Rock movie theater.\nBrian Hughes faces charges including two counts of aggravated robbery, two counts of theft of property and one count each of robbery and fleeing.\nThe Little Rock Police Department said Hughes and an unidentified woman attempted to rob the woman outside the mall about 12:40 p.m. Sunday, but the victim resisted and was able to keep her possessions.\n\"These same suspects then went to the Breckenridge area and successfully robbed two people\" at gunpoint, police spokesman Lt. Sidney Allen said in an email. \"Officers located the suspect vehicle and a pursuit ensued. Officers were able to take the male suspect into custody, but did not locate the white female.\"\nDonald and Barbra McCrorry told police they were sitting in their vehicle outside the United Artists Breckenridge Stadium 12 movie theater at 1200 Breckenridge Drive about 1 p.m. when Hughes and the unknown woman approached them, according to a Little Rock Police Department report.\nHughes pointed a handgun at Donald McCrorry's chest and took his wallet out of his front pants pocket, and the woman took Barbra McCrorry's wallet and purse, the report states.\nHughes and the unknown woman took the McCrorrys' wallets, a purse, debit cards and cellphones, valued at more than $1,100, police said.\nHughes and the woman left the theater in a purple Chrysler PT Cruiser that did not have a back windshield, the report states.\nHughes remained in the Pulaski County jail Monday after bail on the latest charges was set at $75,000 in a hearing Monday morning. A public defender representing Hughes at the video appearance had asked for a lower bail, noting that he is enrolled in a college program to become a youth mentor/minister and is \"already missing his finals.\"\nIn addition to the new charges, Hughes was also being jailed on a parole hold.\nOnline records Monday morning showed Hughes' parole — which was to run through 2022 — had been revoked.\nPulaski County court records show Hughes was sentenced to 10 years in prison in 2012 after pleading guilty to two counts of theft of property.","url":"https://www.arkansasonline.com/news/2015/may/04/parolee-charged-robbery-little-rock-mall/?page=1"}
