{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 00:46:30","date_modify":"2018-10-23 00:46:30","date_publish":"2017-04-26 10:42:40","description":"Addressing hundreds at a ceremony at Paris police headquarters, Etienne Cardiles spoke of his 'extreme pain' at the death of his partner Xavier Jugele.","filename":"data/vaneerConsumption/PartnerstributetogayofficerkilledinParisattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EC41C00000578-0-image-a-63_1493199664009.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446944_Partner-s-tribute-gay-officer-killed-Paris-attack_1540255590.html","title":"Partner's tribute to gay officer killed in Paris attack","title_page":"Partner's tribute to gay officer killed in Paris attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a heartbroken partner of a gay Paris policeman murdered by an ISIS fanatic delivered a tearful eulogy in front of Emmanuel Macron and Marine Le Pen.\nEtienne Cardiles said his partner Xavier Jugele had 'lived like a star and left like a star' as he spoke of his 'extreme pain' at the death of the 37-year-old.\nJugele was shot dead on Thursday while on duty on the Champs Elysees, three days before the first round of France's presidential election.\nAddressing hundreds of mourners at a ceremony at Paris police headquarters, Cardiles spoke of his 'silent suffering' after the death of the officer, who had campaigned for gay rights within the police force.\nEtienne Cardiles (pictured), the heartbroken partner of a gay Paris policeman murdered by an ISIS fanatic, delivered a tearful eulogy in front of Emmanuel Macron and Marine Le Pen\nEtienne Cardiles said his partner Xavier Jugele had 'lived like a star and left like a star' as he spoke of his 'extreme pain' at the death of the 37-year-old. Police colleagues (pictured) watched on during the touching eulogy\nAddressing hundreds of mourners at a ceremony at Paris police headquarters, Cardiles spoke of his 'silent suffering' after the death of the officer, who had campaigned for gay rights within the police force\nAnd he said he felt 'no hatred', in the moving eulogy at a remembrance ceremony led by President Francois Hollande and attended by French presidential hopefuls Macron and Le Pen.\nXavier Jugele, 37, was shot dead on Thursday while on duty on the famous Champs Elysees avenue, three days before the first round of France's presidential election.\nISIS claimed the killing by 39-year-old Karim Cheurfi, who was shot dead by police in a gun battle. Two other officers were injured in the attack.\nAddressing hundreds of mourners at a ceremony at Paris police headquarters, Jugele's partner Etienne Cardiles spoke of his 'extreme pain' at the death of the officer, who had campaigned for gay rights within the police force.\n'This pain makes me feel closer to your comrades who suffer in silence like you and me,' he said in a trembling voice, describing Jugele as a cinema and theatre buff who lived 'a life of joy and huge smiles'.\nEchoing the words of the husband of one of the victims of the November 2015 Paris attacks, Cardiles said the killer would 'not have my hatred'.\nHe said he felt 'no hatred', in the moving eulogy at a remembrance ceremony led by President Francois Hollande (front)\nMarine Le Pen was among those who attended the touching ceremony yesterday\n'I have no hatred, Xavier, because it is not like you and does not fit with what made your heart beat nor what made you a guardian of the peace,' he said.\nJugele was the fifth policeman slain by jihadists in attacks that have claimed more than 230 lives across France since January 2015. Hollande posthumously made him a knight of the Legion d'Honneur, one of France's highest honours.\nShortly after Jugele's death it emerged that he had been among the first responders at the Bataclan theatre in Paris on November 13, 2015, where IS gunmen massacred 90 concertgoers.\nHe returned to the venue a year later when it reopened for a concert by British star Sting, telling a BBC interviewer he wanted 'to celebrate life and say 'no' to terrorism'.\nHollande, who leaves office next month, appealed to the country's next leader to show 'constancy, perseverance and coherence in the fight (against extremists), rather than escalation and divisiveness.'\nFar-right presidential candidate Marine Le Pen and her pro-EU centrist rival Emmanuel Macron, whom Hollande has endorsed, both attended the ceremony for Jugele.\nLe Pen last week seized on the Champs Elysees attack as a vindication of her hardline stance on security and Islamic fundamentalism.\n'Let us remain dignified and defend the peace,' Cardiles urged.","url":"https://www.dailymail.co.uk/news/article-4446944/Partner-s-tribute-gay-officer-killed-Paris-attack.html"}
