{"authors":["Peter Hitchens"],"date_download":"2018-10-23 04:25:20","date_modify":"2018-10-23 04:25:20","date_publish":"2016-01-11 17:31:03","description":"The book is in many ways a clever and moving portrait of a strange, unexplored subculture... of undoubtedly good causes adopted for the advancement of a wicked and dangerous purpose.","filename":"data/vaneerConsumption/PartyAnimalsMyFamilyAndOtherCommunistsreviewHottotrotConfessionsofayoungradical.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300AFDA600000578-0-image-a-8_1452533078257.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3394289_Party-Animals-Family-Communists-review-Hot-trot-Confessions-young-radical_1540268720.html","title":"Party Animals: My Family And Other Communists review - Hot to trot: Confessions of a young radical","title_page":"Party Animals: My Family And Other Communists review - Hot to trot: Confessions of a young radical | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Party Animals: My Family And Other Communists\nDavid Aaronovitch\nRating:\nRevolutionaries are both terrible and pathetic. Having been one, I should know. Utopia appeals especially to people who don’t fit in with the normal daily world, the socially awkward, the hopelessly unfashionable, the too- clever-by-half.\nBut, weird and ill-sorted as they are, such people can and do become monsters, especially when the world dives unexpectedly into the chaos of war or slump.\nLeon Trotsky was the key organiser of the coup d’état that began 70 years of Soviet communist tyranny, and later the commander of vast revolutionary armies, changing the world for the worse and for ever\nIn the last days of peace in 1914, you might have seen a myopic, wild-haired young man eking out a single cup of coffee for hours in Vienna’s Café Central, engaging in spluttering arguments with others like him, furiously scribbling or equally furiously glaring at some dense volume. How absurd and marginal he would have seemed.\nBut a few years later, the same young man, one Leon Trotsky, was the key organiser of the coup d’état that began 70 years of Soviet communist tyranny, and later the commander of vast revolutionary armies, changing the world for the worse and for ever.\nIt is impossible to work out how many deaths he was responsible for.\nThat is why David Aaronovitch’s strange, sad memoir of a communist upbringing in London is worth reading.\nIf things had turned out differently, the forgotten, peculiar people in the world he describes might have mattered a lot.\nThe Kremlin certainly valued them, and not just because some of them spied for Moscow (though some of them did).\nIn the end, they wanted to overthrow the old conservative, Christian, unregulated England. And now that task has been achieved without the aid of Red Army tanks but through a hundred institutions quietly infiltrated by the Left, it’s worth wondering what part they played in it.\nIT'S A FACT! In June 1920, Vladimir Lenin told British communists that they should support the Labour Party ‘in the same way as the rope supports a hanged man’.\nSomeone thought they were important.\nEvery few weeks the KGB would hand bundles of used fivers in shopping bags to a Communist Party official called Reuben Falber on Barons Court Tube station in London.\nHe stashed them in the loft of his Golders Green bungalow. Aaronovitch airily dismisses this interesting handout, vehemently denied at the time, as ‘a small amount’.\nSome of the money went on founding a magazine called Marxism Today, which, hilariously but rather interestingly, became the Blairites’ favourite publication.\nThis subsidy, sometimes reaching £100,000 a year when that was a lot of money, carried on arriving long after British communists condemned the Soviet invasion of Czechoslovakia. Perhaps the Kremlin didn’t think they really meant it.\nIn the last days of peace in 1914, you might have seen a myopic, wild-haired young man eking out a single cup of coffee for hours in Vienna’s Café Central. Above, Leon Trotsky in 1898\nAnd even now, what has happened to them? Do they perhaps still exercise influence? Well, look at David Aaronovitch. He attained early fame by being part of a University Challenge team that leadenly answered every question with the name of a revolutionary hero.\nHe is to this day a BBC favourite. He writes that he was ‘told’ in 1987 by an unnamed BBC person that it would be better to leave the party, not because it was in itself a bad idea to be in it, but in case the Right-wing press found out. And so he did.\nSince then he has also become a prominent columnist on The Times and was for years an important media supporter of the Blair Government and its wars.\nHe now recognises he was fooled over Iraq, but he still seems keen on intervening in other people’s countries, also an old communist habit.\nDavid (I know him slightly) is clearly marked by his strange and rather upsetting upbringing, and his parents’ disastrous marriage.\nHis father’s repeated infidelity to his mother is dealt with in often painful detail, and there is an alarming suggestion that his father treated him brutally at one point.\nDavid Aaronovitch attained early fame by being part of a University Challenge team that leadenly answered every question with the name of a revolutionary hero\nSome of the book is so sad and distressing that I am amazed he has revealed these deeply personal things in his memoir.\nIt is in many ways a clever and moving portrait of a strange, unexplored subculture, of dedicated self-education by desperately poor young men, of undoubtedly good causes adopted for the advancement of a wicked and dangerous purpose.\nAnd it confirms in many ways that sexual revolution – seldom mentioned, always pursued – is a driving force on the British Left. He records one ancient comrade reminiscing happily that the Communist Party was ‘a feast of sex. You’ve no idea!\nWe were hippies before it was even thought of. I never s****ed around so much in my life. The party was full of charming, charming women’.","url":"https://www.dailymail.co.uk/debate/article-3394289/Party-Animals-Family-Communists-review-Hot-trot-Confessions-young-radical.html"}
