{"authors":["Mailonline Reporter"],"date_download":"2018-10-22 22:04:02","date_modify":"2018-10-22 22:04:02","date_publish":"2016-01-29 08:47:48","description":"The 28-year-old looked a little too worse for wear to conceal her choice to go completely underwear-free, suffering a triple overexposure in the street outside as she left Steam & Rye on Thursday night.","filename":"data/vaneerConsumption/PascalCraymersuffersashockingtriplewardrobefailatKellyBrooksbar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B0B01C00000578-0-image-a-30_1454057540506.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422359_Pascal-Craymer-suffers-shocking-triple-wardrobe-fail-super-plunging-thigh-split-maxi-lets-hang-wild-night_1540245842.html","title":"Pascal Craymer suffers a shocking triple wardrobe fail at Kelly Brook's bar","title_page":"Pascal Craymer suffers a shocking triple wardrobe fail at Kelly Brook's bar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's not known for modesty, but Pascal Craymer was asking for trouble in a super-plunging double thigh split dress on Thursday night.\nHit by a strong wind on the way out of Kelly Brook's London Steam And Rye bar party, the former TOWIE star was caught letting it all hang out of the daring silk dress.\nThe 28-year-old looked a little too worse for wear to conceal her choice to go completely underwear-free, suffering a triple overexposure in the street outside.\nScroll down for video\nOverexposure: Pascal Craymer suffered a triple wardrobe malfunction on Thursday night as she left London's Steam And Rye bar party in a daring dress\nCheeky Pascal didn't seem to mind through, disregarding the wardrobe malfunction, she smiled boldly and posed with little effort to conceal her modesty.\nIt was a hard dress to negotiate after all. With a slinky panel in the front and a neckline that dipped right to her waistband, Pascal had not made life easy for herself, especially going commando.\nOf course, she'd made a dignified entrance to the event, having the best intentions for a glamorous appearance alongside pals including Jess Impiazzi and Jess Hayes.\nCheeky: The former TOWIE star proved that she had gone commando when she left her dress and ran into the wind\nOoops! The reality TV face showed off way too much as she went completely underwear free in a hard-to-negotiate dress\nShocker: It was a shocking misjudgment on the glamour front\nIt had been a meeting of reality minds at the second anniversary of Kelly Brook's bar, with The Ex On The Beach star and Love Island winner battling to ensure all eyes were on them.\nImpizzazi looked super sexy in a bustier-style top, while the Hayes went equally raunchy in a flesh-flashing mesh number.\nThe former, who found fame starring in the second season of the MTV dating show, showed off her incredibly trim figure in the saucy ensemble.\nHer skin-tight top clung to her taut abs before boosting her extremely ample assets to perfection - permitting a generous glimpse at her cleavage.\nHard to negotiate: The dress was difficult enough to manage, even with some underwear\nGlamour girl: She flicked about her hair extensions to leave her neckline bare\nPoser: She had the best of intentions when she arrived, proud to pose in the street\nEasy does it: Even as she cut angles for the cameras, she was close to popping out of the dress\nYikes: Pascal was smiling despite the unfortunate wardrobe incident in front of the lens\nParing down the look, the stunning reality starlet, who counts Simon Webb and Rogan O'Connor as exes, added thoroughly ripped jeans to the ensemble while boosting her height with pointed heels.\nShe pulled her hair into an elaborate Nineties style look with a half-high ponytail pulling the curled tresses off her face while the rest tumbled over her shoulders.\nJess Hayes, the winner of last year's revival of Love Island, wore a risque leotard with a mesh insert at the front, which exhibited the fact that she opted to forego a bra for the evening.\nTo enhance the sexy nature of the look, she tucked the leotard into a sexy leather pencil skirt which matched her leather clutch bag - emblazoned with white writing reading 'Yeah'.\nBusty ladies: Jess Impiazzi (left) and her pal Jess Hayes (right) were battling to ensure all eyes were on them as they arrived for the same event that night\nStunner: Jess, who found fame starring in the second season of the MTV dating show, showed off her incredibly trim figure in the saucy ensemble\nBraless: Jess, the winner of last year's revival of Love Island, wore a risque leotard with a mesh insert at the front, which exhibited the fact that she opted to forego a bra for the evening\nHer trademark bright red locks were worn in lustrous bouncy curls, while she coordinated her vampish lipstick to her crimson locks.\nAnother Ex On The Beach star attended the event, as Anita Kaushik, who formerly dated Geordie Shore star Gaz Beadle, turned out in a highly-sophisticated white, two-piece.\nKelly Brook who co-owns the London venue, looked incredible in a black semi-sheer lace dress which had a skater skirt style.\nShe teamed the number with a pair of black tights and wore a pair of high heeled court shoes, in order to give herself some extra inches in the height department.\nModel good looks: Another Ex On The Beach star attended the event, as Anita Kaushik, who formerly dated Geordie Shore star Gaz Beadle, turned out in a highly-sophisticated white, two-piece\nCo-stars: Jess and Anita starred together in Ex On The Beach together\nLet the good times roll: Kelly Brook looked like she was ready to seriously let her hair down when she arrived at the second birthday party of Steam And Rye bar on Thursday night\nLetting her hair down: The 36-year-old, who co-owns the London venue, looked incredible in a black semi-sheer lace dress which had a skater skirt style at the circus-themed bash\nWith her brunette locks worn in curls which cascaded down past her shoulders, the stunner, who is dating her kick-boxing instructor, Jeremy Parisi, wore blinging diamond earrings.\nEnjoying the circus themed bash, Kelly posed with a man dressed as a ringleader as she had fun on the night.\nThree days before, Kelly marked the exact birth date of the bar when she tweeted: 'Happy 2nd Birthday @steamandrye.'\nBusty: Jess put on an extremely display in her bustier which she tucked into ripped jeans\nShe also wrote on Instagram: '2 years ago we had a Dream this week we celebrate that Dream becoming a Reality @steamandrye Happy 2nd Birthday Steam and Rye #OffTheRails.'\nActing as the perfect promo for the venue, she also posted a picture of one amazing cocktail she was enjoying on the night.\nServed in a camera lens, she captioned the black and white image with the words: 'Love this!!! #Nofilter Cocktail served in the Lens Cap With a Polaroid Taken at Your Table :))).'\nNew look: Little Mix star Jade Thirlwall showed off her edgy streaked hair (right) as she posed with a pal","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422359/Pascal-Craymer-suffers-shocking-triple-wardrobe-fail-super-plunging-thigh-split-maxi-lets-hang-wild-night.html"}
