{"authors":["John Hayward"],"date_download":"2018-10-30 19:37:43","date_modify":"2018-10-30 19:37:43","date_publish":"2016-02-04 04:44:46","description":"An airliner owned by Dubai-based Daallo Airlines was forced to make an emergency landing just minutes after taking off from Mogadishu, Somalia.","filename":"data/vaneerConsumption/PassengerSuckedfromPlaneAfterExplosionoverSomalia.json","image_url":"https://media.breitbart.com/media/2016/02/hole-in-plane-Daallo-Airlines-Somalia-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_03__1540928263.html","title":"Passenger Sucked from Plane After Explosion over Somalia","title_page":"Passenger Sucked from Plane After Explosion over Somalia","title_rss":"NULL","source_domain":"breitbart.com","text":"An airliner owned by Dubai-based Daallo Airlines was forced to make an emergency landing just minutes after taking off from Mogadishu, Somalia, on Tuesday, after an explosion blew a hole in the fuselage.\nHorrifying reports say a 55-year-old male passenger was sucked out of the plane after the blast, his body later recovered by ground search teams. This individual appears to be the only fatality from the incident. The pilots were able to land safely at Mogadishu Airport, and the other 74 passengers disembarked safely, with a few minor injuries reported.\nReuters reports investigators believe the explosion was probably caused by a bomb. A U.S. source indicated there was no conclusive evidence as of yet, and no group has taken responsibility for the blast. Suspicion naturally fell upon al-Shabaab, Somalia’s premiere Islamist terror group, an affiliate of al-Qaeda.\nFox News cites passengers saying the explosion occurred at roughly 11,000 feet. The Serbian pilot of the plane was quoted by Serbian media saying he believed it was a bomb going off, adding that nothing like it had ever happened during his flight career.\nAnother witness to the incident was passenger Awale Kullane, who is Somalia’s deputy ambassador to the United Nations and was taking the flight to Djibouti for a diplomatic conference. He said he heard a “loud noise” and saw nothing but smoke for a few moments. When the smoke cleared, he saw that “quite a chunk” of the plane was missing.\nKullane also believed the explosion was from a bomb of some type, as did several aviation and security experts quoted in media accounts. John Goglia, formerly with the American National Transportation Safety Board, pointed out that a pressurization blowout would not have created the soot marks seen on the aircraft’s skin, and the relatively low altitude of the plane at the time of the explosion made such a blowout unlikely.\nAnother possibility, mentioned by the UK Guardian, would be an oxygen bottle exploding. The damage to the interior of the plane did not appear consistent with such an event, and experts noted oxygen bottles normally catch on fire during mishaps, rather than exploding with the force necessary to punch a hole in the fuselage.","url":"https://www.breitbart.com/national-security/2016/02/03/passenger-sucked-from-plane-after-explosion-over-somalia/"}
