{"authors":[],"date_download":"2018-10-23 00:54:08","date_modify":"2018-10-23 00:54:08","date_publish":"2017-03-29 00:00:00","description":"The Aurora Australis is a display of neon green lights that dance across the southern skies. A plane took off from New Zealand to get a special view.","filename":"data/vaneerConsumption/PassengersTakeFlightToViewSouthernLights.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=521884266_1540256048.html","title":"Passengers Take Flight To View Southern Lights","title_page":"Passengers Take Flight To View Southern Lights : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nSo last year, Ian Griffin, an astronomer in Dunedin, New Zealand, was able to catch a ride on the NASA SOFIA. It's a Boeing 747 airplane with an observatory on board.\nIAN GRIFFIN: And on that flight it had an absolutely amazing view of the aurora australis.\nRACHEL MARTIN, HOST:\nThe aurora australis, neon green lights that dance across the southern skies.\nGRIFFIN: So when I landed at the end of that flight, I thought, oh, my gosh, that was the most (unintelligible) thing I've ever seen. Wouldn't it be cool to try and organize a charter flight?\nGREENE: And that is exactly what he did. He chartered a plane and sold the window seats - since you can't exactly see much from the aisle. He sold out in five days, even though there was not even a guarantee the lights would be visible in March.\nMARTIN: Last week, 134 lucky passengers took off. And they paid a pretty good chunk of change to do so. Nick Wong was one of them.\nNICK WONG: Some of my friends laughed at me and said that for that kind of money, you could actually fly to Finland and watch the northern lights. (Laughter). And I kind of thought, yeah, that's actually quite true. At the same time, I've never heard of anything like this happening before down here.\nGREENE: So was it worth it for Ian the astronomer? Of course it was.\nGRIFFIN: As we approached the southern limit of our flight, which was two-thirds of the way to the south pole, out of the windows we saw extraordinary displays of pulsating, auroral glows in the sky. And it was absolutely mesmerizing.\nMARTIN: And for Nick...\nWONG: Brilliant, absolutely amazing. I think it surpassed all my expectations.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=521884266"}
