{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 22:23:44","date_modify":"2018-10-30 22:23:44","date_publish":"2016-12-14 00:00:00","description":"A female passenger was removed by police from Delta Air Lines Flight 2083.","filename":"data/vaneerConsumption/PassengerdraggedoffaDeltaflightbypolice.json","image_url":"https://amp.businessinsider.com/images/583c857eba6eb637008b66c2-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_passenger-dragged-off-delta-flight-detroit-police-2016-12_1540938224.html","title":"Passenger dragged off a Delta flight by police","title_page":"    Passenger dragged off a Delta flight by police - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"YouTube/Rene DeLambert On Monday, a female passenger was forcibly removed from a Delta Air Lines flight at Detroit Wayne County Airport.\nThe incident, which took place onboard Flight 2083 around 8am local time, was filmed by a fellow passenger and posted to YouTube by travel blogger Rene DeLambert.\nThe passenger in question is shown, in the cellphone footage, being dragged down the aisle from the back of the plane by several members of law enforcement.\nAt the same time, fellow passengers can be heard laughing in the background while the pilot makes preflight announcements.\nAccording to DeLambert, one of his blog's readers who was on the flight said the passenger boarded the aircraft by bypassing the gate agent. The reader added that the passenger was tackled by police after refusing to comply with orders to deplane.\nAccording to Detroit Metropolitan Airport, the woman was arrested as a result of the incident and charges are pending.\nIn a statement to Business Insider, Delta Air Lines wrote:\n\"Delta flight 2083 DTW to SAN incurred a slight departure delay due to a passenger not complying with boarding and baggage check procedures. The passenger was removed by local law enforcement and the flight was able to continue without further incident.\"\nThe Detroit Metropolitan Airport issued a statement in regards to the incident on Monday:\n\"At approximately 8 this morning, Delta Air Lines contacted Detroit Metropolitan Airport's police department requesting assistance with a passenger who would not comply with boarding and baggage check procedures at a McNamara Terminal gate. When officers arrived, Delta Air Lines stated the woman could not remain on board. Despite repeated requests by officers, the woman refused to leave the aircraft and had to be removed. She was arrested and charges are pending.\"\nThe flight, bound for San Diego, made an on-time departure after the incident.","url":"https://www.businessinsider.com/passenger-dragged-off-delta-flight-detroit-police-2016-12"}
