{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:48:13","date_modify":"2018-10-30 18:48:13","date_publish":"2016-07-08 14:35:38","description":"An Iowa Civil Rights Commission (CRC) brochure titled “A Public Accommodations Provider’s Guide to Iowa Law,” interprets a 2007 state law according to the Obama administration’s recent gender fluid ideology decrees. | Politics","filename":"data/vaneerConsumption/PastorIowaIsClaimingAuthorityoverChurchsTeachingofChristianSexuality.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-465422462.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_08__1540925293.html","title":"Pastor: Iowa Is Claiming Authority over Church’s Teaching of Christian Sexuality","title_page":"Pastor: Iowa Is Claiming Authority over Church’s Teaching of Christian Sexuality | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An Iowa church is challenging the state over its interpretation of a law regarding sexual orientation and gender identity that the church’s pastor says violates his right under the First Amendment to teach a Christian approach to sexuality.\nAn Iowa Civil Rights Commission (CRC) brochure titled “A Public Accommodations Provider’s Guide to Iowa Law,” interprets a 2007 state law according to the Obama administration’s recent gender fluid ideology decrees.\nPastor Cary Gordon of Cornerstone World Outreach says the law makes the state a “self-appointed pope of all churches.”\n“As it reads, according to their interpretation of the Iowa code, if you discuss anything out of the Scripture that relates to sexuality or marriage … you’re not in compliance with the law and you can be sort of treated like a criminal,” Gordon said, according to the Daily Signal. “It’s fundamentally wrong and I can’t comply with that. I’ve taken an oath to the Lord Jesus Christ, and I obey the Bible above all men. … I have to obey God, and that puts me in a precarious position.”\n“Effective July 1, 2007, the Iowa Civil Rights Act (Iowa Code Chapter 216) was expanded to add sexual orientation and gender identity to the list of protected classes,” states the brochure. “It is now ILLEGAL in Iowa to discriminate against a person because of his/her sexual orientation or gender identity.”\nIllegal activity, according to the CRC, includes “harassment,” which is defined in part as the “intentional use of names and pronouns inconsistent with a person’s presented gender.”\nThe brochure further reads:\nThe new law does require…that individuals are permitted to access those restrooms in accordance with their gender identity, rather than their assigned sex at birth. And, just as non-transgender individuals are entitled to use a restroom appropriate to their gender identity without having to provide documentation or respond to invasive requests, transgender individuals must also be allowed to use a gender-identity appropriate restroom without being harassed or questioned.\nAt issue is when a church is considered a “place of public accommodation.”\nThe CRC describes “places of public accommodation” in which individuals must be permitted to access bathrooms according to “their gender identity, rather than their assigned sex at birth.” Regarding churches, the brochure states that for some purposes churches are “places of public accommodation.”\nAccording to the brochure:\nIowa law provides that these protections do not apply to religious institutions with respect to any religion-based qualifications when such qualifications are related to a bona fide religious purpose. [sic] Where qualifications are not related to a bona fide religious purpose, churches are still subject to the law’s provisions. (e.g. a child care facility operated at a church or a church service open to the public).\nIn answering the question of “What is NOT a public accommodation?” the CRC says, “Any private club or other place which is distinctly private by its nature. However, if it offers some services, facilities, or goods to the general public, it will be treated as a public accommodation for those services.”\nGordon, who has been senior pastor of his nondenominational church for over 21 years, says the law demonstrates “flagrant disrespect for the first Amendment of the Constitution, where the state retains the power to correct or control what I say and teach out of the Bible.”\nFirst Liberty Institute, a religious freedom legal defense group that represents Gordon’s church, says, according to the brochure, churches are places of public accommodation and will not generally be exempt from the law. In its case summary, First Liberty notes:\nThe CRC claims that if churches express biblical views on sexuality and this causes people to feel “unwelcome” due to their sexual orientation or gender identity, it qualifies as “harassment” and “discrimination.” Through this interpretation of the law, churches could be prosecuted by the government for giving sermons expressing scriptural beliefs about God’s design for human sexuality. The CRC’s brochure also indicates that the government has the authority to force churches to allow men in women’s restrooms.\nIn a “demand letter” sent to the Iowa CRC on behalf of Gordon’s church, First Liberty writes the brochure “expressly states that the Commission will enforce Iowa Code Chapter 216 against churches and other religious institutions,” and requests that CRC “retract this position immediately…”\nFirst Liberty continues:\nAlthough Iowa Code § 216.7(2)(a) provides a religious exemption, as drafted, the exemption is unconstitutional. Further, the Commission’s express intent to target churches singularly for enforcement, as stated in the Brochure, is an egregious constitutional violation. The only text in the entire Brochure that is underlined and italicized is the limitation that a bona fide religious institution must act according to a “bona fide religious purpose.” Such emphasis highlights the Commission’s intention to not only heavily scrutinize the validity and sincerity religious doctrines of our client and other religious institutions, but also the very legitimacy of the church as a religious body.\n“This is a clear case of the state violating the sanctity of the church,” says Chelsey Youman, Chief of Staff & Counsel for First Liberty Institute. “It should send chills down the spine of every congregation in Iowa.”\n“The State of Iowa claims it has the power to regulate what churches can teach about human sexuality and how they operate their facilities,” Youman adds. “The government has absolutely no authority to force a church to violate its religious beliefs. This is a massive violation of the First Amendment.”\nThe enforcement of gender ideology on Americans has drawn the concern of many in the health professions.\nIn June, more than 60 leaders concerned about the mental health of American children signed onto an open letter that asserted the Obama administration’s transgender bathroom decree for schools – steeped in the ideology of gender fluidity – is “putting the nation’s children at risk.”\n“This controversial and reckless government overreach increases the risk for our children’s safety and privacy in deference to an un-tethered notion of rights,” the letter states. “This policy rejects the scientific reality of every person’s biological sex. To force all Americans to comply with such an extreme and faulty premise – that every person’s sex is “assigned” to them, rather than simply identified at birth – is beyond the pale.”\nThe signers of the open letter write that radical progressives promoting the gender fluid policy for young people are “distorting the law” against a flood of opposition from “the overwhelming majority of Americans.”\nThe American College of Pediatricians has asserted that gender ideology is harmful to children and that by promoting gender fluidity, government officials are complicit in masking serious mental health issues in children.\nThe College states:\nNo one is born with a gender. Everyone is born with a biological sex. Gender (an awareness and sense of oneself as male or female) is a sociological and psychological concept; not an objective biological one… A person’s belief that he or she is something they are not is, at best, a sign of confused thinking. When an otherwise healthy biological boy believes he is a girl, or an otherwise healthy biological girl believes she is a boy, an objective psychological problem exists that lies in the mind not the body, and it should be treated as such. These children suffer from gender dysphoria. Gender dysphoria (GD), formerly listed as Gender Identity Disorder (GID), is a recognized mental disorder in the most recent edition of the Diagnostic and Statistical Manual of the American Psychiatric Association (DSM-V)…\n“According to the DSM-V, as many as 98% of gender confused boys and 88% of gender confused girls eventually accept their biological sex after naturally passing through puberty,” the College asserts. “Conditioning children into believing that a lifetime of chemical and surgical impersonation of the opposite sex is normal and healthful is child abuse.”","url":"https://www.breitbart.com/politics/2016/07/08/pastor-state-is-claiming-authority-over-churchs-teaching-of-christian-sexuality/"}
