{"authors":[],"date_download":"2018-10-30 21:15:10","date_modify":"2018-10-30 21:15:10","date_publish":"2018-09-01 16:27:00","description":"The Rev. Jasper Williams Jr. is used to controversy.","filename":"data/vaneerConsumption/PastorwhodeliveredArethaFranklinscontrovers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/01/Videos/4474295.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_pastor-who-deliv_44e8bb02b037abaead3b032c75fc6002__1540934110.html","title":"Pastor who delivered Aretha Franklin’s controvers","title_page":"AJC EXCLUSIVE: Pastor who delivered Aretha Franklin’s controvers","title_rss":"NULL","source_domain":"ajc.com","text":"The Rev. Jasper Williams Jr. is used to controversy.\nHaving been a pastor for more than five decades and a community leader, he knows not everyone will agree with what he says.\n“I know it’s controversial,” the Atlanta pastor said in an exclusive interview with The Atlanta Journal-Constitution on Saturday, the day after delivering the eulogy for the Queen of Soul, Aretha Franklin, at her funeral service in Detroit.\n“When you’re criticized as much as I’ve been, you don’t let it get to you,” said Williams, who also eulogized Aretha Franklin’s father, the Rev. C.L. Franklin, in 1984. “I know where my heart and head are, and I’m willing to explain and talk about it.”\nWilliams, pastor emeritus of Salem Bible Church in Atlanta, has been sharply criticized for his eulogy that touched on black-on-black crime, single black women raising sons and what needs to happen in the black community to move forward.\nRelated: Meet the pastor who will deliver Aretha Franklin’s eulogy\nHis comments were blasted by many on social media, some of whom described it as insulting during a day set aside to honor Franklin.\nTeresa Fry Brown, the Bandy Professor of Preaching at Emory University’s Candler School of Theology, critiqued the service on her Facebook page.\nShe said she was “pained” watching parts of the service and the comments made by several individuals who seemed to make it more about themselves than Franklin.\nRelated: Aretha Franklin used her voice for social justice\nIn the post, which had been shared more than 400 times by Saturday morning, she never mentions anyone by name and makes clear she doesn’t know the wishes of Franklin or her family. However, Fry Brown spoke out as someone who teaches homiletics — the art of preaching or writing sermons — and as someone who has sat on the front row dressed in black.\nSometimes pastors “can do more wounding with sermons than healing,” she said in an interview. “I don’t think people should leave a sermon hemorrhaging ... other people probably got excited about it. I did not.”\n“Eulogies are not let me get this off my chest speeches,” Fry Brown wrote on Facebook. “Eulogies are not let me see what dirt I can share on the family or the deceased. Eulogies are not personal soap boxes. Eulogies are not star events. Eulogies are not throw rocks or eviscerating folk proclamations masquerading as deep prophetic pronouncements.”\nI need people to know that this eulogy was not reflective of God nor was it honoring to #arethafranklin nor did it offer comfort to the bereaved or give hope for tomorrow. It was, in fact, trash. And as long as we don’t boldly call this out we are complicit. https://t.co/7Roe1wnt8u — Rozella Haydée White (@rozellahw) August 31, 2018\nAretha Franklin was a mother of four black boys, two of them she had as a teenager. She was all set to bail Angela Davis out of jail. Raised money for the CRM. This eulogy is disrespectful to her legacy. I’m upset. #ArethaHomegoing — Bené (@beneviera) August 31, 2018\nAs for the issues he raised about the African-American community, Williams said in a telephone interview, “Dr. (Martin Luther) King brought us through the wilderness, but we haven’t taken ourselves to the promised land.”\nWilliams, 76, who has known the Franklin family for decades, said he started working on the eulogy shortly before the talented singer, composer and musician died of pancreatic cancer on Aug. 16. She had specifically asked that Williams do the honor.\nHe titled it “Aretha/the Queen of Soul.”\nHis aim was to associate her title as the “Queen of Soul” and the word “soul” to Scripture, starting with Genesis 2:7.\nGod formed man from the dust of the land “and man became a living soul.”\n“I was establishing how God had ordained Aretha the ‘Queen of Soul,’ and the biblical connection,” he said.\n“I saw what is happening in black America today that is really leading us to lose our soul, so to speak,” he said.\nAnd the “queen is not being served well.”\nRelated: Jasper Williams seeks prayers as he delivers Aretha Franklin’s eulogy\nInstead of being “with each other, we’re turning against each other,” he said.\n“The only way to turn black America around in terms of culture is that the problem must be addressed in the home and it starts with parenting. Good parenting,” he said.\nHe said that’s why he mentioned her father and his parenting.\nThe Rev. Franklin in later years raised his children as he traveled the world and ran an influential ministry.\nFor that “there had to be deficits,” Williams said.\n“One parenting skill he exercised was to make sure his daughter, Aretha, was firmly grounded.”\nRelated: Aretha Franklin’s funeral will be star-studded event\nAretha Franklin, who was known as an outspoken voice during the civil rights movement, also raised four sons.\nFry Brown, the professor of preaching, noted in her Facebook post: “When will we stop the constant utilization and understanding of Black women as singers, dancers, comforters, cooks, cleaners and wombs on one hand and the scapegoating, castigating, and demonizing of Black women as the ignorant, hapless, dangerous, useless, conniving sole agents of the demise destruction and death of all Black men on the other?”\nWilliams said he was also focusing on the time restrictions and recognizes that he may not have “had time to explain” more to those listening.\nFry Brown also noted in her Facebook post: “Everybody has a bad preach day sometime. Everyone has had missteps.”\nWhile not necessarily agreeing the eulogy was the right moment, there were those who said that the issues brought up by Williams are worthy of further discussion.\nThe Rev. Gerald Durley, pastor emeritus at Providence Missionary Baptist Church, said Williams did what he had to do from a prophetic point of view.\n“He’s seen what’s going on in the black community. He’s seen, in some instances, the crime, the breakup of the family and the political issues we’re facing. I think he wanted to speak to them. The timing of him doing it? He’s the only one who can address that from the timing, the venue and the occasion.”\nDurley said that Williams and his sons, who are both pastors, have done a lot in the community and a lot to help black women, so he doesn’t think he meant to bash them or young people.\nWhile what Williams said and where he said it can be jarring, “I believe that when someone with prophetic witness comes forward – it might be weeks, or months or years later – people will say, ‘This is what he was trying to say in terms of possibly giving hope and waking people up to say, let’s get that soul back.’ ”\nIn his comments on Saturday, Williams said, “The members of my church know my heart and that’s what I really care about.”\nHe said he plans to be at the Atlanta church on Baker Road on Sunday, but he won’t be preaching.","url":"https://www.ajc.com/lifestyles/pastor-who-delivered-aretha-franklin-eulogy-speaks-out/KimHBADreWU3yVu5gLydzK/"}
