{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:05:14","date_modify":"2018-10-30 22:05:14","date_publish":"2018-06-25 17:33:49","description":"A patriotic Sikh trader who received abuse for flying the St George’s flag outside his shop in support for England at the World Cup.","filename":"data/vaneerConsumption/PatrioticSikhShopkeeperAbusedforFlyingEnglandFlag.json","image_url":"https://media.breitbart.com/media/2018/06/GettyImages-88202440.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_25__1540937114.html","title":"Patriotic Sikh Shopkeeper Abused for Flying England Flag","title_page":"Patriotic Sikh Shopkeeper Abused for Flying England Flag","title_rss":"NULL","source_domain":"breitbart.com","text":"A patriotic Sikh trader who received abuse for flying the St George’s flag outside his shop in support for England at the World Cup has defiantly promised not to back down.\nThe shopkeeper and heating and plumbing professional, whose premises are in Ilford, received an anonymous, handwritten letter written in broken English insulting him for backing England, claiming it is wrong as he is of Indian descent.\nThe shop manager said he loves the World Cup and slammed the person behind the letter, claiming it was from someone who does not “enjoy being part of the English culture”.\nThe letter, seen by the Ilford Recorder, said the shop should be flying a foreign flag instead and that if neo-Nazi groups saw his patriotic display they would “kick you back to India without your trousers on”.\n“You should always look at back ground were [sic] you came from…” the letter added, directing the comment at “Indian people”.\nHowever, the businessman said the letter only made him want to fly the English flag even more proudly.\n‘Blasphemy’: Pubs Remove Saudi Flag from World Cup Bunting https://t.co/CKdgFcR1aa — Breitbart London (@BreitbartLondon) June 7, 2018\n“We are a family business that my father started over 30 years ago,” he told the local press. “He has lived in this country for around 40 years and we love this country otherwise we wouldn’t be here.\n“Supporting England during the football is enjoyable and all part of the fun – and some people seem to think it is wrong for us to do because we are Indian?”\nThe shop manager, who has not been named, claims another business on the same street has also been sent an abusive letter for flying England flags.\nWhile the abuse has not deterred him, the businessman said it has taken some of the fun out of the World Cup festivities for him.\n“It is shocking how backward minded people think that by supporting the country you live in you will be dishonouring our religion or insulting India,” he added. “These are the wrong people, not the ones who enjoy being part of the English culture.”\nDavid Landau, a senior caseworker at the charity Redbridge Equalities and Community Council, said abuse of this form needed to be reported.\n“This is a rather unusual situation but abuse is abuse and if someone is abused for putting up England flags this is wrong,” he said. “It shouldn’t be happening and racism needs to be condemned.”","url":"https://www.breitbart.com/europe/2018/06/25/sikh-shopkeeper-abused-flying-england-flag/"}
