{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:19:50","date_modify":"2018-10-30 21:19:50","date_publish":"2015-10-13 16:42:16","description":"Twin sisters at a North Texas middle school got the surprise of their young lives when they stumbled into trouble for wearing front-zip hoodies with patriotic U.S. Air Force logos. District officials said that the oversized emblems violated the school's dress-code policy. |","filename":"data/vaneerConsumption/PatrioticAirForceLogoViolatesTexasSchoolDistrictsDressCode.json","image_url":"https://media.breitbart.com/media/2015/10/Screen-Shot-2015-10-13-at-11.40.33-AM-e1444754492306.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540934390.html","title":"Patriotic Air Force Logo Violates Texas School District's Dress Code","title_page":"Patriotic Air Force Logo Violates Texas School District's Dress Code","title_rss":"NULL","source_domain":"breitbart.com","text":"Twin sisters at a North Texas middle school got the surprise of their young lives when they stumbled into trouble for wearing front-zip hoodies with patriotic U.S. Air Force logos. District officials said that the oversized emblems violated the school’s dress-code policy.\nLast Wednesday, Kaidence and Abigail Rolen, wore these patriotic sweatshirts to Aubrey Middle School in Denton County. The Air Force logo consumes most of the hoodie’s back panel, violating a size requirement. If the 11-year-olds wear the sweatshirts again, they may face detention or even suspension. The girls’ father, Phillip Rolen, called it “political correctness gone amok.”\nRolen, a disabled Iraq War Air Force veteran, calls his a very patriotic family. “My wife and I met in the Air Force. The girls were born on an Air Force base.”\nKaidence, told the Denton Record-Chronicle she was admonished both times she wore the sweatshirt because it was out of dress code compliance. She said that the second time, she was asked to put it in her locker. Kaidence said: “It made me feel a little sad and a little bit mad at the same time.”\nRolen said he phoned the middle school principal, Karen Wright, who initially told him an exception could be made. The Denton news outlet noted that Wright asked the girls to bring the jackets to school so she could see them. Later, she said the Air Force logo was fine, just too large for the district’s strict dress code.\n“The district has a blanket policy doesn’t allow administrators to make commonsense exceptions to rules that I think most Texans would agree are absolutely superfluous,” Rolen told KTVT 11 (CBS).\nMany schools do. According to the American Civil Liberties Union (ACLU), school districts nationwide implemented dress codes over 40 years ago to increase their emphasis on academics, disperse gang activity, and reduce pressures stemming from socioeconomic status.\nAubrey ISD superintendent Debby Sanders clarified the specific issue to KXAS 5 (NBC) in a statement: “Students are allowed to wear solid color ‘hoodies’ that have logos (including military logos) that are smaller than 1 1/2-inch by 1 1/2-inch. Students are welcome to wear outerwear that may have larger logos to and from school, on the bus, to games and after-school activities, but they must be left in lockers during the school day.”\nSanders maintained the district’s decade old dress code compliance was at the heart of the matter, not patriotism. She stated: “Aubrey ISD wholeheartedly supports the men and women who currently serve and have served our nation in military service.” She emphasized that the school has a student dress code to follow “just as our military personnel are expected to wear uniforms.”\nShe added that dress codes “instill pride, discipline and levels the playing field for students to allow them to focus on learning.”\nMoreover, each school year, Aubrey ISD families sign their district’s dress code agreement, which appears in the Student Code of Conduct handbook. It defines acceptable clothing and notes the consequences for breaking the policy.\nLast week, an Oregon middle school suspended an 8th grader for wearing a “traditional soldier memorial” T-shirt. In September, Dallas ISD punished a high school student for wearing an American flag T-shirt tucked away beneath a zipped solid colored hoodie, although following further examination, school administrators authorized Old Glory to appear on clothing.\nThe Rolen family intends to fight against the dress code and the twins will continue to wear their sweatshirts even if it results in disciplinary action, or changing schools.\n“I’m just not going to raise my kids where they’re going to tip-toe around their patriotism and their civics,” Rolens told KXAS 5. “We don’t disagree with dress codes. It’s a matter of civics and it’s a matter of patriotism.”\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/politics/2015/10/13/patriotic-air-force-logo-violates-texas-school-districts-dress-code/"}
