{"authors":["Joey Millar For Mailonline"],"date_download":"2018-10-22 23:16:31","date_modify":"2018-10-22 23:16:31","date_publish":"2016-01-28 11:58:00","description":"Unable to pay, the Morecambe resident says her debt has spiralled over the past four years to more than £18,000 because of collection fees. She claims she only sent 'the odd text' while abroad with family","filename":"data/vaneerConsumption/PatriciaCardwellracksup3200billforusingheriPhoneinLanzarote.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9D34F00000578-0-image-a-20_1453981768015.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420678_Huge-3-200-holiday-phone-bill-grandmother-lose-home_1540250191.html","title":"Patricia Cardwell racks up £3,200 bill for using her iPhone in Lanzarote","title_page":"Patricia Cardwell racks up £3,200 bill for using her iPhone in Lanzarote | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Children's carer claims she only sent 'the odd text' while abroad\nMorecambe gran can't sleep due to worrying about her debts\nA confused grandmother claims she could be left homeless and bankrupt after racking up a staggering £3,200 bill for using her mobile phone on a family getaway.\nUnable to pay, Patricia Cardwell, 52, claims her debts have spiralled over the past four years to more than £18,000.\nThe Morecambe resident said she received the huge phone bill after she left her iPhone's data roaming function on while on a two week sunshine trip to Lanzarote in 2010.\nAccording to Patricia, she only used the phone to send a couple of text messages and was unaware that she was amassing such a huge bill during the break.\nPatricia (pictured on holiday with her phone on the table, left, and with a pile of bills, right) says she cannot sleep due to the stress of her impending bankruptcy\nHowever, a spokesperson for Orange, now called EE, said a roaming charge cap would have been in place at the time and Patricia would have needed to manually over-ride it to receive such a large charge.\nI've been desperately down in the dumps and I can barely sleep. I'm only 52 but I look and feel at least 60 Patricia Cardwell\nNow the mother to Lee, 32, Scott, 30, Kenneth, 28, Paul, 26 and daughter Catherine, 18, is set to be declared bankrupt next month due to a combination of different debts and could be left on the street when she is kicked out of her home of 18 years.\nShe said: 'I've had no advice or help from anyone. This whole ordeal has been completely unreal. It's like kicking a dog when it's down.\n'I've been desperately down in the dumps and I can barely sleep. I'm only 52 but I look and feel at least 60.\n'It's been a particularly rough time recently because my mum who lives next door has been diagnosed with lung cancer and I'm always round there looking after her.'\nPatricia said she barely used her phone while on the two-week holiday with her husband, elderly parents and daughter.\nShe claimed: 'I may have sent the odd text from Lanzarote but I hardly used it at all.\n'I tried to pay as much as I could but I eventually got a letter from a debt collection company who said I owed them a further £15,000 in collection fees.\n'This company shouldn't be allowed to do this. They are exploiting me and my position because they know I've got nowhere else to turn to.'\nPatricia may lose her £140,000-valued home in Morecambe due to her £18,000 debt\nPatricia said she barely used her phone while on the two-week holiday with her husband, parents and daughter\nPatricia said debt collectors BW Legal were desperate to take her home, valued at around £140,000 - although she did admit she had incurred some other unrelated bills.\nShe said: 'I think the debt collection company will just do anything possible to get their hands on my house.\n'My parents haven't got the sort of money to help me out and I wouldn't want to burden them by asking anyway.'\nCITIZENS ADVICE ON BANKRUPTCY If you have no money to pay back your debts or have so little that it will take you years, bankruptcy might be one of the options available to you. If you're made bankrupt you don't have to deal with the people you owe money to yourself - a public official called the official receiver takes control of your money and property, and deals with your creditors. However may be sold and used towards paying your debts, such as your house or car. Most types of debt are written off when you're discharged from bankruptcy, normally after a year. Contact the Citizen's Advice Bureau for more information about bankruptcy.\nA spokesperson for EE told MailOnline that Patricia's debt with them remained at around £3,200. The said they were not responsible for BW Legal or the subsequent collection fees and claimed her other debts were unrelated to the initial roaming charge.\nThey added that their own collection agents did not issue a bankruptcy order and that it was impossible she would loser her home as a direct result of their bill.","url":"https://www.dailymail.co.uk/news/article-3420678/Huge-3-200-holiday-phone-bill-grandmother-lose-home.html"}
