{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:14:45","date_modify":"2018-10-30 19:14:45","date_publish":"2015-06-11 15:36:16","description":"In an appearance Thursday on Fox and Friends, Ryan criticized Breitbart News and other conservative media including the highly influential Drudge Report, which have revealed the immigration and climate change provisions within President Obama’s trade agenda. |","filename":"data/vaneerConsumption/PaulRyanUnchainedLashesOutAtBreitbartDrudgeDontBelieveEverythingYouReadOntheInternet.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-466939435.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_11__1540926885.html","title":"Paul Ryan Unchained: Lashes Out At Breitbart, Drudge, ‘Don’t Believe Everything You Read On the Internet’","title_page":"Paul Ryan Unchained: Lashes Out At Breitbart, Drudge, ‘Don’t Believe Everything You Read On the Internet’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"You know you’re losing when you’re reduced to attacking the Internet.\nHouse Ways and Means Committee chairman Rep. Paul Ryan (R-WI) is now attacking the Web, proving he shouldn’t be trusted by Republican members of Congress to tell the truth about controversial trade legislation.\nIn an appearance Thursday on Fox and Friends, Ryan criticized Breitbart News and other conservative media including the highly influential Drudge Report, which have revealed the immigration and climate change provisions within President Obama’s trade agenda.\n“Let’s talk about trade. Very odd situation – the president is fighting without Nancy Pelosi, without Steny Hoyer, with republicans to get his trade authority passed through. You’ve already discovered through Breitbart and others that there were some provisions in there for climate change, provisions in there for immigration,” Brian Kilmeade asked. “You’ve looked to knock that out and push this forward. Where are you at with trade authority? And are you questioning your own support of it?”\nRyan responded by attacking Breitbart News and others on the internet, like the Drudge Report, which has been hammered his support of Obamatrade as well.\nLook, first of all, don’t believe everything you read on the internet, Brian. just let me give you a little tip there. Second of all, this is why we need to pass Trade Promotion Authority. What we have in Trade Promotion Authority is a prevention of any immigration changes, of any climate change legislation going into a trade agreement. So by passing Trade Promotion Authority, we’re putting congress in the driver’s seat which is transparency. We need to see the documents, the country needs to see these trade agreements—60 days. Oh, and you cannot put any immigration in here and you can’t put any climate change in a trade agreement. So, this is why we want to pass Trade Promotion Authority, so we can determine the outcome of these trade agreements not what’s happening out there right now. That’s why we’re asserting power and control here. Look a broken clock is right twice a day. The president is actually supporting trade, which is what Republicans are in favor of and that’s why we are where we are.\nThe hosts weren’t convinced. “One of the things on the internet – so you can tell us whether or not it’s true. So, for the most part everybody on Capitol Hill is in the dark … you don’t really know what’s in it yet, because you haven’t seen it, so it’s hard to support it one way or another?” Ryan was asked.\n“No, no, no,” Ryan replied.\nThere’s a lot of confusion. Trade Promotion Authority—what we’re voting on this week—is a process. It’s not a trade agreement. It’s a procedure for how you consider trade agreement. The Transpacific Partnership – it doesn’t exist yet. The reason we can’t see it yet is because it hasn’t been negotiated yet – it doesn’t exist yet. It’s been negotiated for years. Bush started these negotiations.\n“So you’re voting on an idea tomorrow?” Doocy asked him.\n“No we’re voting on a procedure,” Ryan said. “How does Congress consider trade agreements? Then in the fall, probably in the fall, we’ll consider a trade agreement—which hasn’t been completed yet. That’s why we don’t know what’s in it because it doesn’t exist yet.”\nMeanwhile, Rep. Michael Burgess (R-TX) became the latest member of Congress to validate the existence of trade deal text in a secret room during a question-and-answer with Ryan at Wednesday’s House Rules Committee. Several others have confirmed the room exists and that the text is inside, including even Sen. Ted Cruz (R-TX)—who stands with Ryan and Obama in support of Obamatrade.\nRyan’s decision to say there is no trade deal yet is an obvious fabrication because roughly 800 pages of Trans Pacific Partnership (TPP) are ready for review on Capitol Hill. As for the other two trade deals Obamatrade would definitely fast-track—the Transatlantic Trade and Investment Partnership (T-TIP) and the Trade in Services Agreement (TiSA)—the text of those are not available for members of Congress. President Obama could publicly release the TPP text now, but he and Ryan don’t want the public to see it before Congress votes on fast-track.\nWhen fast track has been granted in the past by Congress, no trade deals have ever been stopped by Congress as it hands over the power to the president to finish all negotiations, and all Congress gets in the end is an up or down vote with no amendments. It also lowers the vote thresholds in the Senate from 60 to 51, decimating the filibuster.","url":"https://www.breitbart.com/politics/2015/06/11/paul-ryan-unchained-lashes-out-at-breitbart-drudge-dont-believe-everything-you-read-on-the-internet/"}
