{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:08:51","date_modify":"2018-10-30 18:08:51","date_publish":"2015-10-22 00:23:39","description":"Paul Ryan’s spokesperson attempted to “clear a few things up” about one of Ryan’s conditions for running for Speaker of the House.","filename":"data/vaneerConsumption/PaulRyanWillingtoKeepJeffersonianRule.json","image_url":"https://media.breitbart.com/media/2015/10/Thomas-Jefferson-L-and-Paul-Ryan-AP-Photos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_21__1540922931.html","title":"Paul Ryan Willing to Keep Jeffersonian Rule","title_page":"Huelskamp: Paul Ryan Willing to Keep Jeffersonian Rule","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Paul Ryan’s (R-WI) spokesperson, Brendan Buck, attempted to “clear a few things up” over backlash from conservatives about one of Ryan’s conditions for running for Speaker of the House, which reportedly would have repealed a rule put into place by Founding Father and President Thomas Jefferson. Rep. Tim Huelskamp (R-KS), however, is viewing Buck’s clarification as Ryan’s demand being withdrawn.\nHuelskamp posted on Twitter in response to Buck’s attempt to clear the air: “‪@BrendanBuck‪ First demand withdrawn. Thomas Jefferson would be relieved. #speaker.”\nThe National Review noted that Ryan – among a list of demands to run for Speaker of the House – wanted to repeal the motion to vacate the chair, the procedure used by Rep. Mark Meadows and the House Freedom Caucus to oust Rep. John Boehner (R-OH).\nThe procedure to vacate the chair was put into place by Founding Father and President Thomas Jefferson, according to the National Review.\nAfter backlash to Ryan’s demand, Buck responded in a series of three posts on Twitter:\nHey folks. Allow me to clear a few things up. Ryan is not proposing to eliminate the motion to vacate. It should exist. The process for how it can be used, however, should be changed. Open to different approaches. Also, he is supportive of rules changes. He just wants those rules to be written as an entire conference, as they affect everyone.\nAmericans for Limited Government President Rick Manning reacted to Buck’s tweets to Breitbart News, saying, “Representative Ryan and those leaking on his behalf have repeatedly made it clear that he will only serve as Speaker if he is anointed. Attempts to walk back this arrogance is a sure sign that he has likely overplayed his hand.”\nConservative members of the House responded to Ryan’s position, saying doing away with that rule would be “a non-starter” and calling Ryan’s demand’s “unreasonable.”","url":"https://www.breitbart.com/politics/2015/10/21/huelskamp-paul-ryan-willing-to-keep-jeffersonian-rule-on-speakership-if-congress-neuters-it/"}
