{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-23 04:22:20","date_modify":"2018-10-23 04:22:20","date_publish":"2017-04-26 16:04:31","description":"Daisy Payne, 94, of Brighton, Sussex lost £600 she was planning to use to pay bills and buy shopping when she realised someone had stolen her cash.","filename":"data/vaneerConsumption/PaulHollywooddonatestodistraughtpensioner.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0445700000578-0-image-a-51_1493218955108.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448222_Paul-Hollywood-donates-distraught-pensioner_1540268540.html","title":"Paul Hollywood donates to 'distraught' pensioner","title_page":"Paul Hollywood donates to 'distraught' pensioner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Great British Bake Off judge Paul Hollywood donated money to a 94-year-old pensioner who had £600 of her pension stolen while shopping.\nPaul, 51, was so enraged when he heard Daisy Payne, of Brighton, East Sussex, had been robbed he immediately donated to a collection set up for her.\nShop owner Hayley Hobdell, who set up the collection, said: 'He told me he was really angry when he heard what happened to Daisy and wanted to help.\nDaisy Payne, pictured, had £600 stolen when she was out shopping in Brighton recently\nThe 94-year-old pensioner was distraught when she discovered her money was missing\n'I couldn't not believe it when I heard him on the phone. His voice is very distinct.\n'He has been ever so kind and we are so grateful.'\nThe collection has so far raised £1,000. Police are investigating the theft.\nThe Great British Bake Off judge has contacted fundraisers looking to help the pensioner.\nMrs Payne said she was 'distraught' when a thief made off with money she had earmarked for paying bills on April 6 in Brighton, East Sussex.\nMs Payne was mugged as she walked along Whitehawk Road in Brighton, pictured\nThe purse that was stolen contained Mrs Payne's pension, which she had just collected at the nearby Post Office.\nMs Hobdell said: 'It was the day after she appeared on TV news. We had a phone call at the shop, but he didn't identify himself. I recognised his voice because it is quite distinctive.\n'He gave me his email address and I realised who it was. I was in shock.\n'It has been incredible to see that something so small has escalated and that is down to who Daisy is. It has been quite an emotional and amazing story.'\nBake Off star Paul Hollywood donated cash to an appeal to refund the Brighton pensioner\nMrs Hobdell added she had spoken to the TV reporters, who confirmed that Mr Hollywood had been in touch with them too.\nThe baker, who is set to return to The Great British Bake Off when it debuts on Channel 4, has even expressed a desire to meet Mrs Payne at some point in the future.\nMrs Payne said: 'I am very grateful that he has offered to help. People have been so kind.\n'I feel like I am becoming a bit famous myself. I hope the person who stole from me reads this. I would like to give them a piece of my mind.'\nSussex Police confirmed they were still investigating the theft and that no arrests have currently been made.\nA spokeswoman for Paul Hollywood confirmed he had reached out to fundraisers to help Mrs Payne.\nShe said: 'Paul was saddened to read Daisy's story and admired her courage.'","url":"https://www.dailymail.co.uk/news/article-4448222/Paul-Hollywood-donates-distraught-pensioner.html"}
