{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:01:38","date_modify":"2018-10-22 23:01:38","date_publish":"2017-03-10 01:49:40","description":"Paula Patton, 41, put on a brave face as she was dunked in a huge water tank while filming a drowning scene for her new television project titled Somewhere Between on Thursday","filename":"data/vaneerConsumption/PaulaPattonefilmsSomewhereBetweenscenesinCanada.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F04B700000578-0-image-a-11_1489106476913.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299582_Paula-Patton-braves-freezing-temperatures-filming_1540249298.html","title":"Paula Pattone films Somewhere Between scenes in Canada","title_page":"Paula Pattone films Somewhere Between scenes in Canada | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's hard at work on set in Canada despite ongoing troubles at home.\nAnd Paula Patton, 41, put on a brave face as she was dunked in a huge water tank while filming a drowning scene for her new television project titled Somewhere Between on Thursday.\nThe 41-year-old actress looked wet and cold while filming in Maple Ridge, British Columbia in almost freezing temperatures.\nSerious actress: Paula Patton, 41, put on a brave face as she was dunked in a huge water tank while filming a drowning scene for her new television project titled Somewhere Between on Thursday\nWith the weather a chilly 40 degrees outside, the crew had the water in the tank at 92 degrees with Paula falling into the water while filming.\nPaula was dressed in jeans and a loose dark jacket for the shoot.\nShe had her wet hair loose around her shoulders, but slicked back from the water.\nThe actress appeared to be wearing no makeup as she went through the specifics of the scene, getting dunked over and over.\nCold Canadian winters: The 41-year-old actress looked wet and cold while filming in jeans and a jacket in Maple Ridge, British Columbia in almost freezing temperatures\nAt least the water is warm: With the weather a chilly 40 degrees outside, the crew had the water in the tank at 92 degrees with Paula falling into the water while filming\nShe climbed up the ladder each time before her whole body was plunged into the water.\nThe trip comes just hours after an explosive phone conversation revealed her son with Robin Thicke was trying to avoid his custodial visits 'like the plague'.\nIn an audio clip obtained by TMZ of a call made to 911 by Patton and the child's nanny, the pair ask police to intervene and 'enforce a restraining order' because Julian, six, was 'crying and praying to the angels' at the thought of the visit.\nThe trip comes just hours after an explosive phone conversation revealed her son Julian (pictured above in January) with Robin Thicke was trying to avoid his custodial visits 'like the plague'.\nMother-son bonding; Paula and Julian looked happy together while running errands in Malibu in May 2016\nThe 76-second recording features a female complainant, understood to be Julian’s nanny, requesting police assistance after the child allegedly expressed reluctance to go to a local park with his father, 39.\nFurthermore Thicke, currently in a relationship with model April Love Geary, is understood to have breached a restraining order by entering a Malibu park to collect Julian while his ex-wife was still present.\n‘We have a restraining order,’ she informs the operator. ‘The person is within distance of the restraining order so is in violation of it currently… it is agreed upon that he will not come to the park until we are gone, and then he comes.\nJulian spends time with his dad, Robin and his girlfriend April Love Geary on March 7\n‘This child is literally begging me and everyone else to call 911. That’s how much he does not want to go.\n'He’s six years old, and literally every time he has these visits, the night before, the day before, he’s crying, he's praying to angels, he’s trying to avoid it like the plague. It needs to end.’\nThicke is now understood to have reached an agreement with his actress ex-wife regarding custody of Julian, their only child, two-years after their acrimonious divorce.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299582/Paula-Patton-braves-freezing-temperatures-filming.html"}
