{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-22 23:04:36","date_modify":"2018-10-22 23:04:36","date_publish":"2016-01-28 11:39:49","description":"The battle was filmed by Caltech (screengrab pictured) and details what happened when the actor threw down the challenge to the theoretical physicist.","filename":"data/vaneerConsumption/PaulRuddchallengesStephenHawkingtoagameofquantumchess.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30AA152C00000578-0-image-a-2_1453981673051.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420669_Stephen-Hawking-takes-Ant-Man-s-Paul-Rudd-game-quantum-chess-designed-help-explain-complex-physics_1540249476.html","title":"Paul Rudd challenges Stephen Hawking to a game of quantum chess","title_page":"Paul Rudd challenges Stephen Hawking to a game of quantum chess | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It helps to explain the basis of quantum theory which underpins the paradox facing\nWhat happens when a Hollywood superhero clashes with a world-renowned theoretical physicist? An epic game of quantum chess.\nWhile a regular game of chess may not set most people on the edge of their seat, pitching Ant-Man actor Paul Rudd against Professor Stephen Hawking, while adding quantum physics to the mix, raises the tempo.\nThe battle was filmed by Caltech and details what happened when Rudd threw down the challenge to the theoretical physicist.\nScroll down for video\nQuantum chess: A new video from Caltech (grab pictured) details the epic battle which ensued when Paul Rudd threw down the gauntlet to Professor Hawking and challenged him to a game of quantum chess\nWith a smattering of movie lines and references, from Bill and Ted to the Matrix, the tongue-in-cheek video explains the complex concepts in the world of the very small, and promises that 'Anyone can quantum'.\nThere's even a cameo from Bill S. Preston Esq, aka Alex Winter, telling the Keanu voice: 'Shut up Ted.'\nThe video helps to explain the basis of quantum theory which underpins the paradox facing Schroedinger's cat.\nRudd calls the physicist on the phone for the challenge, explaining his experience of the quantum world as Ant-Man in the hit action movie.\nPaul Rudd calls the physicist on the phone for the challenge, explaining his experience of the quantum world as Ant-Man in the hit action movie. Professor Stephen Hawking (left) is shown facing off against Rudd (right)\nWith the help of the Keanu Reeves-style narrator, the video explains the complex concepts which govern the subatomic world, including superposition and collapsing wave functions, using the pieces\nWHAT IS QUANTUM CHESS? The premise of the game is that each of the chess is 'endowed with quantum powers'. The video explains the concepts that govern the subatomic world, including superposition and collapsing wave functions, using pieces. For instance, the queen is able to make all possible moves available to it at once, but there is a chance the piece doesn't move at all. When the opponent attacks one of the potential positions the queen could have moved to, it forces her to reveal herself. This demonstrates how subatomic particles, such as an electron, can be seen to occupy multiple positions at once, but as soon as they are observed, their wave function collapses and they are forced into one, giving away their location. At a crucial juncture in the game, while Hawking has Rudd in checkmate, the actor relies on superposition. As the king is able to occupy two positions at once it forces Hawking to choose one, the hope is that when the wave function collapses, it will occupy the square he hasn't chosen. With just two pieces left the actor invokes another quantum trick to get out of a sticky situation: entanglement. Both pieces effectively occupy the same position at the same time and their properties are linked, despite their relative distance.\nIn the film, Ant-Man's suit enables him to shrink himself to the size of an ant by reducing the volume of the atoms in his body.\nProfessor Hawking answers the challenge: 'Okay punk. You're on. I shall crush you like an ant, man.'\nThe premise of the game is that each of the chess pieces is 'endowed with quantum powers'.\nWith the help of the Keanu Reeves-style narrator, the video explains the complex concepts which govern the subatomic world, including superposition and collapsing wave functions, using the pieces.\nFor instance, when it comes to its turn, the queen is able to make all possible moves available to it at once, but there is an equal chance that the piece doesn't move at all.\nWhen the opponent attacks one of the potential positions the queen could have moved to, it forces her to reveal her 'real' position.\nThis demonstrates how subatomic particles, such as an electron, can be seen to occupy multiple positions at once, but as soon as they are observed, their wave function collapses and they are forced into one, giving away their location.\nRudd said: 'I don't understand any of this,' before reaching for his copy of Quantum Physics for Babies.\nThe game was played on 12 January and was released as part of the Institute for Quantum Information's Quantum Summit event, which was a celebration of the life and theories of legendary physicist Richard Feynman.\nIt shows a stream of celebrities and renowned figures trash-talking and commenting on the game in play, including Barack Obama, Neil deGrasse Tyson and Pope Francis.\nRudd starred in Marvel movie Ant-Man. The premise of the film is that Ant-Man's suit (pictured) enables him to shrink himself to the size of an ant by reducing the volume of the atoms in his body\nQUANTUM ENTANGLEMENT In quantum physics, entangled particles remain connected so that actions performed by one affects the behaviour of the other, even if they are separated by huge distances. This means if you measure a property, such as spin, for one of the entangled pair, the spin of the other will be the opposite, even if the two are far apart. Entanglement takes place when a part of particles interact physically. For instance, a laser beam fired through a certain type of crystal can cause individual light particles to be split into pairs of entangled photons. The theory that so riled Einstein is also referred to as 'spooky action at a distance'. Einstein wasn't happy with theory, because it suggested that information could travel faster than light.\nAt a crucial juncture in the game, while Hawking has Rudd in checkmate, the actor relies on superposition.\nAs the king is able to occupy two positions at once it forces Hawking to choose one, the hope is that when the wave function collapses, it will occupy the square he hasn't chosen. And Hawking made the wrong choice.\nThe game goes on to a gruelling marathon, with Hawking again backing Rudd into a corner.\nWith just two pieces left the actor invokes another quantum trick to get out of a sticky situation: entanglement.\nBoth pieces effectively occupying the same position at the same time and their properties are linked, despite their relative physical distance.\nProfessor Hawking makes the wrong move and Rudd wins the game of quantum chess.\nThe game was originally dreamt up by US graduate student Chris Cantwell, who started developing the game as part of a project in 2014.\nBut he said that he ultimately 'threw the game together in one month' as part of a final project.\nHowever, the game attracted the attention of Spyridon Michalaki, a researcher at CalTech.\nWriting on his blog, Cantwell describes the origins of the chess project: 'As a game, which I threw together in one month for a final project, it was playable but certainly not fun. It wasn't even reminiscent of Chess.\nBut explaining the communicative value, he adds: 'Quantum Chess is a game that allows players to interact with a quantum world, in a way that has never been possible before.\n'It seeks to make quantum phenomena accessible to everyone, and in doing so demystify the quantum world.'","url":"https://www.dailymail.co.uk/sciencetech/article-3420669/Stephen-Hawking-takes-Ant-Man-s-Paul-Rudd-game-quantum-chess-designed-help-explain-complex-physics.html"}
