{"authors":["Joshua Caplan"],"date_download":"2018-10-30 20:35:36","date_modify":"2018-10-30 20:35:36","date_publish":"2018-10-30 18:06:55","description":"House Speaker Paul Ryan (R-WI) claimed on Tuesday that President Donald Trump cannot end birthright citizenship with an executive order.","filename":"data/vaneerConsumption/PaulRyanTrumpCannotEndBirthrightCitizenshipwithExecOrder.json","image_url":"https://media.breitbart.com/media/2018/06/donald-trump-paul-ryan-AFPGetty-images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/immigration_2018_10_30_paul_9d54b852414046e5b3be6d35b1c133d6__1540931736.html","title":"Paul Ryan: Trump Cannot End Birthright Citizenship with Exec Order","title_page":"Paul Ryan: Trump Cannot End Birthright Citizenship with Exec Order","title_rss":"NULL","source_domain":"breitbart.com","text":"House Speaker Paul Ryan (R-WI) claimed on Tuesday that President Donald Trump cannot end birthright citizenship with an executive order. The outgoing Republican leader made the remarks during a radio interview with Lexington, Kentucky area radio station WVLK.\nHe was responding to reports that the president is preparing to use executive powers to revoke the so-called constitutional right to citizenship.\nWith seven days to go before the midterm elections, President Trump teased the order to Axios on HBO. The remark comes after the administration announced Monday it was dispatching thousands of active-duty troops to the border, and President Trump said he’d set up tent cities to house asylum seekers.\nPresident Trump has long called for an end to birthright citizenship, as have many conservatives. An executive order would spark a legal battle about whether the president has the unilateral ability to declare that children born in the U.S. to those living here illegally aren’t citizens.\nAsked about the legality of such an executive order, President Trump said, “they’re saying I can do it just with an executive order.” He added that “we’re the only country in the world where a person comes in and has a baby, and the baby is essentially a citizen of the United States.”\nThe president told Axios reporter Jonathan Swan that White House lawyers are reviewing his proposal. It’s unclear how quickly he would act and the White House did not provide further details.\nA person familiar with the internal White House debate said the topic of birthright citizenship had come up inside the West Wing at various times over at least the last year, but has some internal detractors. White House lawyers have debated the topic, and expect to work with the Justice Department’s Office of Legal Counsel to develop a legal justification for the action. It is one of many immigration changes being discussed including asylum law changes, and barring the migrant caravan from entering the country.\nHowever, administration officials said there would likely be no decisions until after the midterms, due in part to the president’s trip to Pittsburgh Tuesday to meet with victims of the deadly synagogue shooting.\nJon Feere, a senior adviser at Immigration and Customs Enforcement, is among those who has long argued that that the president could limit the citizenship clause through executive action.\n“A president could direct his agencies to fall in line with his interpretation of the Supreme Court’s rulings, which are arguably limited to children of permanently domiciled immigrants (the court has never squarely ruled on children born to tourists or illegal aliens). He could direct his agencies to issue Social Security numbers and passports only to newborns who have at least one parent who is a citizen or permanently domiciled immigrant,” he wrote in 2015 in an op-ed in the Hill.\nTrump voiced his theory that birthright citizenship could be stripped during his campaign, when he described it as a “magnet for illegal immigration.” During a 2015 campaign stop in Florida, he said: “The birthright citizenship – the anchor baby – birthright citizenship, it’s over, not going to happen.”\nThe Citizenship Clause of the 14th Amendment states: “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside.”\nThe amendment was passed by Congress in 1866 during the period of Reconstruction after the Civil War. It was ratified in 1868 by three-fourths of the states. By extending citizenship to those born in the U.S., the amendment nullified an 1857 Supreme Court decision (Dred Scott v. Sandford), which ruled that those descended from slaves could not be citizens.\nRepublicans in Congress continue introducing bills to end birthright citizenship, including legislation this session from Rep. Steve King (R-IA), who has almost 50 co-sponsors in the House.\nKing said he had not discussed the issue with the president at any length in recent months, but that it had come up “in passing” several times in group discussions. The conservative congressman said he hadn’t personally considered birthright citizenship to be part of the caravan issue and applauded the president for connecting the issues.\n“Sending this message out, it’s another component of saying to the caravan: Don’t come in here. Some are pregnant, no doubt,” King said.\nSen. Lindsey Graham (R-SC), now a close ally of the president, also tweeted his support for ending birthright citizenship and said he would introduce his own legislation on the issue, calling the law a “magnet for illegal immigration.”\n“This policy is a magnet for illegal immigration, out of the mainstream of the developed world, and needs to come to an end,” Graham said.\nThe Associated Press contributed to this report.","url":"https://www.breitbart.com/immigration/2018/10/30/paul-ryan-president-trump-cannot-end-birthright-citizenship-with-executive-order/amp/"}
