{"authors":["Julia Hahn"],"date_download":"2018-10-30 19:03:31","date_modify":"2018-10-30 19:03:31","date_publish":"2016-02-15 16:55:07","description":"In a remarkable interview with popular Fox Business anchor Maria Bartiromo, House Speaker Paul Ryan declined multiple times to answer whether he would, as Speaker of the House, allow legislation to proceed curbing the rapid growth of America's foreign-born population. |","filename":"data/vaneerConsumption/PaulRyanWereNotGoingToBeTalkingAboutVisaCaps.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-507982746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_15__1540926211.html","title":"Paul Ryan: 'We're Not Going To Be Talking About Visa Caps'","title_page":"Paul Ryan: 'We're Not Going To Be Talking About Visa Caps' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a remarkable interview with popular Fox Business anchor Maria Bartiromo, House Speaker Paul Ryan declined multiple times to answer whether he would, as Speaker of the House, allow legislation to proceed curbing the rapid growth of America’s foreign-born population.\nNinety-two percent of GOP voters want immigration frozen or slashed, according to Pew polling data.\nRyan eventually admitted the he would not bring up legislation desired by the overwhelming majority of his Party: “We’re not going to be talking about visa caps in our agenda,” Ryan declared.\nAs Breitbart News has previously documented, Ryan has devoted much of his career to preserving and expanding mass migration into the United States— a key part of the GOP establishment policy platform.\nRyan’s admission is significant as it means that the leader of the Republican Party in Congress has all but announced that the will of GOP voters on the signature issue of 2016 will not be part of the Republican agenda.\nBartiromo’s recent questioning on immigration has distinguished her from most other corporate media pundits, and provides a stark contrast from the questioning at last night’s CBS Republican debate. For instance, Byron York described Bartiromo’s question at the last GOP debate as the most “substantive, focused, and important question” on immigration question asked thus far in the presidential campaign.\nOn today’s program of Sunday Morning Futures, Bartiromo told Ryan: “Let me start with national security as it relates to immigration… One of the biggest issues this election cycle has been immigration. And we know that every year the U.S. issues one million green cards to immigrants. And yet polls show– they continue to show– that voters think that’s too many, that immigrants are taking American jobs at a time that this economy is not producing enough jobs. Would you support legislation to cap the number of immigrants and green cards issued?”\nRyan replied by saying that, “we’re not going to put immigration reform, other than securing the border, in our national security agenda. We think a key component of national security is actually securing the border. And so that will be a component of that, but what you’re asking is something different than that.”\nRyan’s suggestion that visa curbs have no role in a national security discussion is peculiar given that the 9/11 hijackers all arrived on visas. Indeed, virtually all foreign-born Muslim terrorists charged or identified inside the United States since 9/11 have been invited into the country through one of multiple visa programs as part of America’s vast annual importation of foreigners through the legal immigration system.\nFor instance: San Bernardino attacker Tashfeen Malik arrived on a fiancé visa, and her husband Syed Farook was the U.S. born child of Pakistani immigrants. The Boston bombers’ immigrated from Chechnya and were given political asylum to permanently resettle within the United States: the younger Tsarnaev brother became a naturalized U.S. citizen on September 11th, 2012 and the elder Tsarnaev brother had a pending application for U.S. citizenship.\nThe Senate’s Immigration Subcommittee released a list of numerous foreign-born terrorists operating inside the United States, and all of them were here on visas—many, in fact, were approved for green cards and citizenship.\nBorder security would have virtually no impact on the numbers of Muslims entering the United States each year; instead, Congress would have to reduce the quarter million visas (temporary and permanent) distributed annually to Muslim migrants. GOP frontrunner Donald Trump has called for a “timeout” on all Muslim immigration.\nInstead of answering Bartiromo’s question, Ryan lapsed into a talking point similar to one used by Sen. Rubio: “I’ve always supported moving from what people call a chain-migration system to an economic based immigration system,” Ryan said.\nAn “economic based” system is typically code for giving employers more foreign workers in lieu of Americans. As Ryan has previously said in 2013, “We want an economic based immigration system where… labor and supply and demand can meet each other.”\nThe phrase “labor supply and demand can meet each other,” is a centerpiece of open borders philosophy. Under this global one-world theory, any willing employer should be able to hire any willing worker regardless of what country they live in. Under this theory, there is no limitation whatsoever to the amount of labor that can be imported into the country and, thus, there is no preference given to American citizens for jobs.\nBartiromo pushed Ryan again: “Right, and you’ve been very vocal in terms of the path to citizenship, in terms of securing the border, and I feel like this is one of the central or fundamental issues of the country, right? How do you know and who is allowed to live in this country, work in this country, participate in our democracy? So given the pushback from voters and even from the candidates in terms of the number of green cards issued, would you not put a cap on the number of green cards issued?”\nRyan again would not say whether he would curb visa issuances, and then sought to change the subject by delivering a speech on poverty in the United States. Ryan admitted there were “tens of millions of American citizens who are abled-bodied adults who are not working,” but repeated his call for admitting more foreign workers: “Should we be giving green cards out based on who you’re related to? Or should we be giving green cards based on what you contribute to the American economy? I would argue that we should be giving more green cards out based on what you contribute to the economy.”\nBartiromo pushed again, highlighting that Ryan’s argument about poverty in many ways makes the case that visa issuances should be curbed. Bartiromo said:\nRight, but isn’t this issue central to that? Because Americans do not have the jobs that they need to have partly because you’ve got foreigners coming in taking their jobs. So that’s the central issue really that I’m asking you. Do we want to keep open borders the way we have, or do we want to have some level of caps? So again, would you propose legislation that lowers the number of green cards issued?\nRyan seemed to stumble: “Uh, ah, look, I’m not going to get into the detail of what caps– I think we should have a cap on green cards, of course. And I think we should change the way we give green cards so that we have economic based visas. Let Congress do its job and work its will on where those caps and how those caps should be adjusted and set, but of course we should have a cap, but, look, none of this works if we don’t have a secure border.”\nRyan concluded by admitting that his Republican agenda will not address visa caps: “we’re going to be offering a bold specific pro-growth agenda, to grow this economy, get people from welfare to work. And make sure that we have a secure country, so that’s why we’re not going to be talking about visa caps in our agenda and promising what we’re going to do if we have a Republican President. We’re going to be talking about how to grow the economy, how to get people from welfare to work, and secure the border, secure this country.”\nPrior to Ryan’s election as House Speaker, Brietbart News reported that a Ryan Speakership would ensure that the immigration priorities desired by the Republican electorate would not see the light of day in Congress. Breitbart wrote in October of 2015, that a Ryan Speakership would mean:\nHouse conservatives would have as much, if not more, to fear from Ryan as Pelosi in terms of striking a deal to advance amnesty and immigration-expansions on the House floor. It would also mean that conservative lawmakers will be blocked from any attempt to advance legislative campaigns to curb immigration or to coordinate any public messaging designed to give voice to the concerns of working class Americans whose schoolhouses, jobsites and emergency rooms have been transformed by massive immigration. For instance, Congressman Brian Babin recently offered legislation to halt all refugee resettlement… Such a bill might never be brought to the floor under a Ryan Speakership. Nor would a plethora of enforcement ideas developed by anti-amnesty lawmakers including Mo Brooks, Steve King, Dave Brat, [Louie] Gohmert, Duncan Hunter, John Fleming and Marsha Blackburn.\nUnder current federal policy, the U.S. provides more green cards to immigrants each month than South Carolina issues high school diplomas each year, according to a new chart issued by the Senate Immigration Subcommittee.\nWhen George W. Bush came to office in 2000, the foreign-born population was 31.1 million. By the time he left it was 38 million. Today, it is over 42.4 million.\nHowever, Republicans including Paul Ryan and Marco Rubio have sought to expand immigration levels beyond all known historical precedent. Marco Rubio’s 2013 immigration bill would have tripled green card issuances over the course of the next decade– permanently resettling a population of immigrants that is seven times larger than the population of South Carolina.\nIn a letter hand-delivered to every Congressional lawmaker last month, Dave Brat and Jeff Sessions explained that the expanded immigration agenda of Party elites’ undermines and sabotages the interests of the Republican electorate:\nNinety-two percent of GOP voters oppose this immigration growth, Pew reports. A microscopic 7 percent of GOP voters say they’d like to see more immigration. And yet party elites continue pushing for more—with no recognition of, let alone concern for, its impact on workers… How can it be possible that the demands of 92 percent of our electorate are not merely ignored, but sabotaged?\nIn the last Republican Presidential debate she moderated, Bartiromo asked Rubio, “Why are you so interested in opening up borders to foreigners when American workers have a hard enough time finding work?” Rubio dodged and declined to answer.","url":"https://www.breitbart.com/politics/2016/02/15/paul-ryan-were-not-going-to-be-talking-about-visa-caps/"}
