{"authors":["Ian Ladyman For Mailonline"],"date_download":"2018-10-23 03:14:26","date_modify":"2018-10-23 03:14:26","date_publish":"2017-04-26 14:39:39","description":"Manchester United manager Jose Mourinho revealed on Wednesday afternoon that the French international has not recovered from a hamstring injury and will not face rivals City.","filename":"data/vaneerConsumption/PaulPogbainjuryManchesterUnitedstaroutofderby.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F95383500000578-0-image-a-14_1493213945507.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447886_Man-Utd-news-Paul-Pogba-Manchester-derby_1540264466.html","title":"Paul Pogba injury: Manchester United star out of derby","title_page":"Paul Pogba injury: Manchester United star out of derby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paul Pogba is out of tomorrow night's Manchester derby.\nManchester United manager Jose Mourinho revealed on Wednesday afternoon that the French international midfielder has not received from a hamstring injury and will not face rivals City at the Etihad Stadium on Thursday.\nUnited travel across town knowing that a win would take them above their neighbours for the first time since August and in to prime position for a top four place in the Premier League.\nPaul Pogba is set to miss the Manchester derby at the Etihad Stadium through injury\nThe France international arrived for training at Carrington on Tuesday morning in his Mercedes\nBut Mourinho will be without a host of players, including Pogba, Zlatan Ibrahimovic, Chris Smalling, Phil Jones, Marcos Rojo and Juan Mata.\nThe United manager said 'Pogba? No. Only Valencia (can play).\n'We go with what we have, we fight with what we have.\n'I trust the boys. The boys are ready.'\nUnited won in the league at Burnley at the weekend without key players and afterwards Mourinho challenged stars such as Smalling and Jones to try and push through the pain.\nPaul Pogba will miss the Manchester derby at the Etihad Stadium on Thursday through injury\nCentre-back duo Chris Smalling and Phil Jones are both still missing for United's Etihad trip\nUNITED'S INJURY LIST Zlatan Ibrahimovic (knee) Marcos Rojo (knee) Juan Mata (groin) Chris Smalling (knee) Phil Jones (toe) Paul Pogba (hamstring)\nBut neither defender has made it.\nMeanwhile Mourinho has said he won't be able to talk about Ibrahimovic's future until the Swedish striker has recovered from knee surgery on his serious ligament injury.\nHe added: 'The immediate future is a big surgery and a long time out.\n'He is a strong guy, mentally very strong.\n'I have told him he has fought all his life since he was born and I don't see that will change.\n'I don't know about the future and I don't care. I just want this difficult surgery to go well.\nMourinho has refused to be drawn on the future of Zlatan Ibrahimovic until he has had surgery\n'The next stage of his career will be whatever it is he wants. That's much more important than myself and what I want.\n'I want players to be happy and to choose their futures.\n'That's what will happen here. Before the surgery it's a waste of time to talk about what's next.'\nMourinho will attempt to beat his old rival Pep Guardiola for only the fifth time in 19 attempts tomorrow night and only the second time away from home.\nBut the Portuguese dismissed suggestions that supremacy in Manchester is all that matters.\n'It means nothing,' he said.\n'If we finish fifth and they are sixth then we are above them but it means nothing.\n'If they finish third and we are fourth then it means a lot.'","url":"https://www.dailymail.co.uk/sport/football/article-4447886/Man-Utd-news-Paul-Pogba-Manchester-derby.html"}
