{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:30:58","date_modify":"2018-10-22 20:30:58","date_publish":"2016-01-29 02:00:05","description":"The musician died of multiple organ failure and septic shock on Thursday, his friend and publicist Cynthia Bowman confirmed to the San Francisco Chronicle.","filename":"data/vaneerConsumption/PaulKantnerdeadaged74daysafterJeffersonAirplaneguitaristsufferedheartattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE878C00000578-0-image-a-13_1454035125597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422057_Jefferson-Airplane-founder-guitarist-Paul-Kantner-dies-aged-74-following-heart-attack_1540240258.html","title":"Paul Kantner dead aged 74, days after Jefferson Airplane guitarist suffered heart attack","title_page":"Paul Kantner dead aged 74, days after Jefferson Airplane guitarist suffered heart attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paul Kantner, who was a founding member and the guitarist for Jefferson Airplane, has died at the age of 74.\nThe musician died of multiple organ failure and septic shock on Thursday, his friend and publicist Cynthia Bowman confirmed to the San Francisco Chronicle.\nAccording to the publication, Kantner had suffered a heart attack days before his death.\nScroll down for video\nTragic loss: Paul Kantner, who was a founding member and the guitarist for Jefferson Airplane, has died at the age of 74. He is pictured here in July 2015\nHe had allegedly been battling several health problems in recent years, including suffering a heart attack in March 2015.\nJefferson Airplane is best known for the hits Somebody To Love and White Rabbit, and formed in San Francisco in 1965.\nHe founded the band along with lead singer Marty Balin as they went on to play the three most famous Amerian Rock Festivals: Monterey (1967), Woodstock (1969) and Altamont (1969).\nMoving and grooving: Kanter - pictured in 1978 - and lead singer Marty Balin founded the band as they went on to play three most famous Amerian Rock Festivals: Monterey (1967), Woodstock (1969) and Altamont (1969)\nThey had a highly successful career as a band together culminating with an induction into the Rock And Roll Hall Of Fame in 1996.\nLater on while Jefferson Airplane was in the process of disbanding, Kanter and singer Grace Slick broke off to release concept album Blows Against The Empire in 1970, which also happened to be the first use of the name Jefferson Starship.\nDespite several line-up changes, Jefferson Starship is still a band today as Kanter continued to tour with the band until his death.\nLegendary: Jefferson Airplane was an active band from 1965 to 1972 with reunions in 1989 and 1996. Their biggest hits were Somebody To Love and White Rabbit\nJefferson Airplane is set to receive the 2016 Grammy Lifetime Achievement Award just a few weeks from now.\nPresident and CEO of The Recording Academy, Neil Portnow released a statement about Kanter's passing as he wrote: 'Paul was a key architect in the development of what became known as the San Francisco Sound.'\nHe concluded: 'The music community has lost a true icon, and we share our deepest condolences with Paul's family and friends, and with those who had the privilege of collaborating with him.'\nNew groove: While Jefferson Airplane was disbanding, Kanter worked on a concept album titled Blows Against The Empire in 1970, which eventually turned into Jefferson Starship\nMembers of The Doors - who formed the same year - paid their respects to Kantner on the band's official Facebook page on Thursday.\n'Our condolences go out to the friends, family and fans of Paul Kantner of Jefferson Airplane on the news of his passing,' the tribute read\n'Music would not be the same without the sounds of The Doors and Jefferson Airplane, which both contributed so heavily to the signature sound of the 60s and 70s. They often shared the same bill. Celebrate them with this article of the bands’ shows together in England in 1968.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422057/Jefferson-Airplane-founder-guitarist-Paul-Kantner-dies-aged-74-following-heart-attack.html"}
