{"authors":["Keith Griffith For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 20:59:48","date_modify":"2018-10-22 20:59:48","date_publish":"2017-03-16 00:24:16","description":"His health care plan under assault from all sides, House Speaker Paul Ryan reversed course on Wednesday, suggesting that the plan would have to change to garner enough support in the House.","filename":"data/vaneerConsumption/PaulRyanacknowledgeshealthbillchangesmaydelayvote.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E4FB98E00000578-0-image-a-51_1489629671796.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318436_GOP-leaders-acknowledge-health-bill-changes-delay-vote_1540241988.html","title":"Paul Ryan acknowledges health bill changes, may delay vote","title_page":"Paul Ryan acknowledges health bill changes, may delay vote | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His health care plan under assault from all sides, House Speaker Paul Ryan reversed course on Wednesday, suggesting that the plan would have to change to garner enough support in the House and hinting at a delay in a vote.\nAfter a private meeting with GOP lawmakers, the Wisconsin Republican told reporters that he was open to changing the health care bill after a harsh report from the non-partisan Congressional Budget Office this week concluded that the plan would strip 24 million people of coverage in a decade.\n'Now that we have our score, we can make some necessary refinements and improvements to the bill,' Ryan said, referring to the CBO report. 'This is by the way the legislative process.'\nGOP leadership acknowledged that changes could delay a vote scheduled for next week.\nThat's a significant departure from Ryan's earlier commitments to send the bill to the Senate as-is next week, and further muddies the waters for the Obamacare revision plan that has come under fire from both right-wing Republicans and Democrats.\nScroll down for video\nHouse Speaker Paul Ryan spoke to reporters after a closed-door meeting of GOP lawmakers on Wednesday, admitting his health plan would need 'some necessary refinements'\nThe health proposal got a brutal critique from the non-partisan Congressional Budget Office this week, which determined it would strip coverage from 24 million over a decade\nVice President Mike Pence is seen entering the private meeting of GOP lawmakers on Wednesday to urge his party's Congressmen to pass the health proposal\nThe proposed measure would strike down much of former President Barack Obama's 2010 overhaul and reduce the federal role, including financing, for health care consumers, and is opposed uniformly by Democrats and met with skepticism by some Republicans who fear it doesn't go far enough.\nVice President Mike Pence also spoke at the private all-hands meeting of House GOP lawmakers, urged the rank-and-file Congressmen to rally behind the legislation.\n'It's our job to get it out of here and get it to the Senate,' Pence told the Republicans, according to Rep. Dennis Ross, R-Fla.\nThat would let President Donald Trump pressure 'Democrats in these red states to come on board,' Ross said, referring to Republican-leaning states where several Democratic senators face re-election next year.\nTrump urged lawmakers to back the bill in remarks later Wednesday in Nashville, Tennessee.\n'The House legislation does so much for you,' Trump said at a campaign-style rally. 'It gives the states Medicaid flexibility and some of the states will take over the health care.'\n'We will arbitrate, get together, and get something done,' Trump said.\nThe health bill faces a significant test on Thursday, as it heads to the powerful House Budget Committee for approval.\n'We will arbitrate, get together, and get something done,' Trump said of the Republican health plan at a campaign-style rally in Nashville, Tennessee on Wednesday evening\nMeanwhile, health secretary Tom Price was using phone calls to lobby Republican governors, some of whom oppose the bill's phase out of Obama's expansion of Medicaid to 11 million additional lower-income Americans.\nAmid the maneuvering, a government report said more than 12 million people have signed up for coverage this year under the very statute that President Donald Trump and congressional Republicans want to repeal.\nWith Democrats uniformly opposing the Republican bill, that figure underscored the potential political impact of the GOP's next move.\nKEY PROVISIONS OF GOP HEALTH PROPOSAL The bill would abolish the requirement that Americans buy coverage by eliminating the tax fine on violators.\nIt would end subsidies that help low-income people with high insurance premiums the most and replace them with tax credits that are bigger for older people.\nIt would cut Medicaid, repeal the law's tax increases on higher earning Americans.\nIt would allow 30 percent higher premiums for consumers who let coverage lapse, as an incentive for healthy people to retain coverage.\nThough Pence met repeatedly Wednesday with House Republicans, GOP rebels still abounded. Conservatives were unhappy the measure doesn't erase enough of Obama's law while at the other end of the party's spectrum, Republican moderates were upset that the Republican bill would strip millions of health coverage.\n'Oh heck, yes,' said one conservative leader, Representative Jim Jordan, R-Ohio, asked if the GOP legislation needed changes to win his support.\nRight-wing Republicans feel the plan's proposed tax credits to help people pay medical costs are to generous, while party moderates feel they're too stingy.\nHardliners also want to end Obama's expansion of Medicaid to 11 million additional low-income people next year, not 2020 as the Republican bill proposes.\nIn a new complication, Sen. Charles Grassley, R-Iowa, said the measure lacked the votes to pass in the Senate, where Republicans hold a precarious 52-48 majority. That left House moderates angry over being asked to take a politically risky vote for legislation that seems likely to be significantly altered.\nModerates 'don't like the idea of taking a vote in the House that may go nowhere in the Senate,' said Rep. Charlie Dent, R-Pa.\nEarlier in the day, Pence told House conservatives that the administration was open to changes.\n'He gave us a lot of hope,' said Rep. Mark Walker, R-N.C., leader of the group that met with Pence.\nGOP support became scarcer when the nonpartisan Congressional Budget Office found this week that the legislation would push 24 million Americans off coverage in a decade and shift out-of-pocket costs toward lower income, older people.\nThat's 4 million more than the 20 million who've gained either Medicaid or insurance coverage under Obama's law.\nHundreds of conservative activists rallied outside the Capitol in sub-freezing weather to call on congressional leaders and Trump to abandon the GOP bill and fully repeal Obama's law. The rally was organized by FreedomWorks, a conservative group backed by the billionaire Koch brothers.","url":"https://www.dailymail.co.uk/news/article-4318436/GOP-leaders-acknowledge-health-bill-changes-delay-vote.html"}
