{"authors":[],"date_download":"2018-10-30 21:13:42","date_modify":"2018-10-30 21:13:42","date_publish":"2018-07-31 14:19:00","description":"Paul Manafort trial: When does it start, what is he accused of, how is Trump involved?","filename":"data/vaneerConsumption/PaulManaforttrialWhendoesitstartwhatisheaccusedof.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/03/22/Videos/3960629.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_paul-manafort_780eb71a03f05aaf379bc87f12c2aaf6__1540934022.html","title":"Paul Manafort trial: When does it start, what is he accused of?","title_page":"Paul Manafort trial: When does it start, what is he accused of?","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump’s former campaign chairman Paul Manafort will go on trial Tuesday in Alexandria, Virginia. The trial is the first stemming from the investigation by special counsel Robert Mueller, who was appointed to look into alleged Russia’s interference in the 2016 election.\nThirty-five witnesses are set to be called, according to prosecutors, one is Manafort's former partner, Rick Gates. Gates, who along with Manafort was accused of falsifying loan paperwork and lying to the government, has made a deal with Mueller’s office.\nHere’s what you need to know about the case.\nWho is Paul Manafort?\nManafort, 69, was hired by Donald Trump's campaign to secure delegate votes at the 2016 Republican Convention. He was hired in March of 2016 and served on the campaign until August of 2016. While he was hired to get delegate votes, Manafort became chairman of Trump’s campaign after the former head of the campaign, Corey Lewandowski, was fired in June 2016.\nHere’s what we know about Manafort:\nManafort worked for former Presidents Ronald Reagan and George H. W. Bush.\nHe was the chairman of Donald Trump’s campaign but resigned in August 2016 after revelations surfaced about his work on behalf of former Ukrainian President Viktor Yanukovych. Yanukovych was a supporter of Russian President Vladimir Putin.\nAccording to The Associated Press, Manafort “helped a pro-Russian governing party in Ukraine secretly route at least $2.2 million in payments to two prominent Washington lobbying firms in 2012, and did so in a way that effectively obscured the foreign political party's efforts to influence U.S. policy.” All U.S. lobbyists must declare publicly if they represent any foreign leaders or political parties.\nThe New York Times reported that Manafort spoke to Russian intelligence officials last year via telephone calls that were monitored by U.S. intelligence agencies. Manafort has denied that he spoke with the Russians.\nManafort has also been linked to handwritten ledgers that list cash payments of $12.7 million in Manafort’s name.\nAccording to Politico, legal complaints filed by representatives of Russian billionaire Oleg Deripaska in the Cayman Islands in 2014 claimed Deripaska gave Manafort $19 million to invest in a Ukrainian TV company. After the venture failed, Manafort took the money, the complaint claims, and did not pay Deripaska back.\nTrump hired Manafort's lobbying firm to help the Trump Organization.\nCNN reported that federal investigators wiretapped Manafort both before and after the 2016 election.\nFederal investigators executed a “no-knock warrant” at Manafort's home in northern Virginia on July 26, 2017. Manafort had met with the Senate intelligence committee the day before.\nWhat is Manafort accused of doing?\nManafort is facing charges of bank fraud and conspiracy to commit bank fraud, along with charges of “subscribing to false United States individual income tax returns and failure to file reports of foreign bank and financial accounts.\"\nHow much time could he serve if convicted?\nManafort faces 18 counts in the trial with a maximum sentence of up to 305 years in prison. Prosecutors are asking for 8 to 10 years if Manafort is convicted.\nWhat did the indictment say?\nAccording to prosecutors, Manafort and his partner, Rick Gates, made more than $30 million in income overseas working for former Ukrainian president Viktor Yanukovych. The two did not pay taxes on the income, calling the money loans from offshore foreign entities. They used the money to refinance their U.S. real estate holdings.\nIn 2014, Yanukovych fled to Russia after an uprising in Ukraine. With their funds drying up, Manafort and Gates used the real estate holdings as collateral for more than $20 million in loans from financial institutions. The loans were secured, prosecutors say, by inflating their incomes and not disclosing debt.\nThey then funneled money to bank accounts in Cyprus, the Grenadines and Seychelles. The did not disclose those transfers of money, according to the indictment.\nWho is Rick Gates?\nGates met Manafort when the two worked for Manafort’s political consulting firms, Davis Manafort Partners Inc and DMP International. Here’s how Gates is involved, according to the indictment:\nThe indictment said Gates would pass on instructions to the lobbyists from Manafort who communicated with Yanukovych. Gates would also fly to Moscow to meet with Oleg Deripaska, a Russian billionaire, who did business with Manafort.\nGates took over the company's affairs in Eastern Europe two years ago, according to The New York Times.\nGates helped start Pericles, a private equity fund. The fund was set up to buy companies in Russia and Eastern Europe.\nGates was one of the organizers of the Trump’s inauguration.\nHe joined the political action committee America First Policies in January. It is a PAC that pushes the president’s agenda. He left the PAC in March.\nAs of two weeks ago, Gates was helping with the closeout of the inauguration committee's campaign account, according to the Associated Press.\nWhen does the trial start?\nThe trial is taking place in Alexandria on Tuesday at the Eastern District Courthouse. It’s expected to last no longer than three weeks. T.S. Ellis is the presiding judge. A second trial on additional charges is set to begin in September.\nSee also:","url":"https://www.ajc.com/news/national/paul-manafort-trial-when-does-start-what-accused/bfUysxvlq0ptZDEnQGeZrL/"}
