{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:43:24","date_modify":"2018-10-31 01:43:24","date_publish":"2018-09-14 15:28:34","description":"Another major development in the special counsel investigation occurred on Friday as Paul Manafort pleaded guilty on two counts filed by Robert Mueller's team. After fighting the charges for nearly a year, he's now decided to make a deal with…","filename":"data/vaneerConsumption/PaulManafortPleadsGuiltyBecomingTheFifthTrumpCampaignStafferToDoSo.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/6b475be0-9085-476e-87d8-a399f85dfbf0-getty-925372754.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_paul-manafort-pleads-guilty-becoming-the-fifth-trump-campaign-staffer-to-do-so-11917842_1540950204.html","title":"Paul Manafort Pleads Guilty, Becoming The Fifth Trump Campaign Staffer To Do So","title_page":"Paul Manafort Pleads Guilty, Becoming The Fifth Trump Campaign Staffer To Do So","title_rss":"NULL","source_domain":"bustle.com","text":"Another major development in the special counsel investigation occurred on Friday as Paul Manafort pleaded guilty on two counts filed by Robert Mueller's team. After fighting the charges for nearly a year, he's now decided to make a deal with federal prosecutors, agreeing to the guilty pleas in return for getting many of his charges dropped, according to court documents filed in a D.C. court on Friday.\nAccording to CNN's on-air reporting, Manafort's guilty plea includes an agreement to cooperate with the Justice Department in their investigation. The exact details about how he will cooperate as part of that agreement, including what exact topic that would be about, are still unclear, however.\nManafort, who is President Donald Trump's former campaign chairman, was already convicted of eight counts of financial crimes in a Virginia court in August, but he's also been awaiting trial in a federal court for seven other charges coming from the Mueller probe. Hours before his pretrial hearing on Friday, news broke that prosecutors had agreed to drop five of those charges (for lobbying violations and money laundering) in return for a guilty plea on two counts: conspiracy and obstruction of justice. CNN reports that Manafort appears to have admitted to prosecutors that he's guilty on the five other counts even though he'll no longer be charged for them.\nAt his pretrial hearing on Friday, Manafort did indeed plead guilty to those two remaining charges, which involve scheming to take millions of dollars from Ukrainians and launder it so that he wouldn't have to pay taxes. \"Manafort cheated the United States out of over $15 million in taxes,\" the court documents read.\nIn addition to the obvious benefit of getting charges dropped in order to reduce sentencing, CNN reports that pleading guilty will allow Manafort to sidestep what would have been \"a second grueling, expensive, politically explosive three-week-or-longer trial.\" He'll save money on legal fees and avoid drawing even more attention to himself and his family.\nManafort may have other reasons not to fear pleading guilty. Eight people currently and formerly working around Trump told Politico that they believe that the president will use his power to pardon Manafort of all convictions. In an interview with the magazine on Wednesday, Trump lawyer Rudy Giuliani said he didn't not believe that Manafort pleading guilty to any of Mueller's charges would change Trump's decision about whether or not to pardon him for his other convictions.\nFor his part, Trump has spoken very warmly of his former campaign chairman recently. \"I feel very badly for Paul Manafort and his wonderful family,\" he tweeted on Aug. 22. \"'Justice' took a 12 year old tax case, among other things, applied tremendous pressure on him and, unlike Michael Cohen, he refused to 'break' — make up stories in order to get a 'deal.' Such respect for a brave man!\"\nManafort's jury will begin to be selected on Monday and he will go on trial next week in Washington D.C. He still faces trial for 10 counts that remain undecided from the Virginia case, as well. CNN reports that prosecutors will make new filings for that case in about a week.","url":"https://www.bustle.com/p/paul-manafort-pleads-guilty-becoming-the-fifth-trump-campaign-staffer-to-do-so-11917842"}
