{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 01:00:16","date_modify":"2018-10-23 01:00:16","date_publish":"2017-03-10 08:31:28","description":"The baker (pictured) earned £200,000 for each Bake Off series at the BBC. But he is believed to be receiving £400,000 to be the frontman when the show moves to Channel 4 this year.","filename":"data/vaneerConsumption/PaulHollywoodisnowworth10millionthankstoBakeOff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/195EDA1D000005DC-0-image-a-19_1489133890005.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300282_Paul-Hollywood-worth-10million-thanks-Bake-Off_1540256416.html","title":"Paul Hollywood is now worth £10million thanks to Bake Off","title_page":"Paul Hollywood is now worth £10million thanks to Bake Off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paul Hollywood's stock seems to be rising just as quick as his dough - after it was revealed he is now worth £10million.\nThe master baker has built up his mass fortune thanks to several television and book deals.\nIt comes as the 51-year-old prepares to front the next series of the Great British Bake Off, after agreeing a six-figure deal to follow the show from BBC to Channel 4.\nThe judge earned an estimated £200,000 for each Great British Bake Off series at the BBC.\nPaul Hollywood's stock seems to be rising just as quick as his dough - after it was revealed he is now worth £10million\nDespite the Liverpudlian's best efforts, however, he still lags behind his former co-judge Mary Berry, 81, who's personal wealth is estimated at about £15million\nBut he is believed to be receiving £400,000 to be the frontman when the show moves to Channel 4 this year – or £1.2million over three years.\nAccording to The Sun, Hollywood has nearly £8.8million of assets in the company HJP Media LLP and £1.2million in another company called Paul Hollywood Limited.\nDespite the Liverpudlian's best efforts, however, he still lags behind his former co-judge Mary Berry, 81, who's personal wealth is estimated at about £15million.\nMeanwhile, the show's former hosts Mel Giedroyc and Sue Perkins are thought to be worth about £5million and £6million, respectively.\nUnlike Hollywood Berry, Perkins and Giedroyc chose not to follow the show to Channel 4.\nHollywood's decision to do so does not mean he has quit the BBC for good. He has accepted terms on a six-figure contract for a new show, believed to be about cars.\nThe show's former hosts Mel Giedroyc (right) and Sue Perkins (left) are thought to be worth about £4million and £5million, respectively\nSpeaking at the BBC Good Food Show in Birmingham on Friday, he acknowledged he received 'a bit of stick' for staying on Bake Off, but said he loves being a judge.\nHollywood, who was born in Merseyside, has followed the family baking tradition.\nWith a grandfather who was head baker at the Adelphi Hotel in Liverpool, a young Hollywood worked at his father's bakery in York.\nInspired by the hard-won success of his father, who had a chain of bakeries, he later became a baker at hotels around Britain including the Dorchester in London.\nON THE RISE: BAKE-OFF EARNERS Paul Hollywood - £10million Mary Berry - £15million Sue Giedroyc - £4million Sue Perkins - £5million Nadiya Hussain - £1million\nHe stayed there for six years after falling in love with both the island and future wife Alexandra.\nIn 1999, after returning to the UK, he co-hosted digital channel Taste's Use Your Loaf alongside TV chef James Martin, who went on to present Saturday Kitchen.\nHollywood also gained a reputation as an authority on bread making with his best-selling cookery book 100 Great Breads.\nBut despite his TV appearance Hollywood was still a relative unknown.\nThat all changed in 2010 when the launch of the Great British Bake Off made him a household name. The show became a national favourite and Hollywood's chemistry with Mary Berry was seen as one of the main reasons for its success.\nOn the back of this, he set out to conquer the US with The American Baking Competition - with Marcela Valladolid at his side as co-judge.\nHowever, the show was cancelled after one series and also led to marriage trouble for Hollywood, after he embarked on an alleged affair with Valladolid.\nHe and wife Alexandra are now reconciled. They share a teenage son, Josh.","url":"https://www.dailymail.co.uk/news/article-4300282/Paul-Hollywood-worth-10million-thanks-Bake-Off.html"}
