{"authors":[],"date_download":"2018-10-30 21:08:10","date_modify":"2018-10-30 21:08:10","date_publish":"2018-08-21 20:29:00","description":"A Virginia jury has found Paul Manafort, President Donald Trump’s former campaign manager, gui...","filename":"data/vaneerConsumption/PaulManafortguiltyon8chargesinbankfraudconspiracytrialmis.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/08/21/Videos/4465919.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_jury-reaches-_37a40f11fd4a0b1646a52182b80def9b__1540933690.html","title":"Paul Manafort guilty on 8 charges in bank fraud, conspiracy trial; mis","title_page":"Paul Manafort guilty on 8 charges in bank fraud, conspiracy trial; mis","title_rss":"NULL","source_domain":"ajc.com","text":"A Virginia jury has found Paul Manafort, President Donald Trump’s former campaign manager, guilty on eight charges, but could not reach a consensus on 10 other counts in Manafort’s bank fraud and conspiracy trial, according to The Associated Press.\n>> Read more trending news\nThe judge in the case declared a mistrial on those 10 counts.\nFormer Trump campaign chairman Paul Manafort guilty of 8 charges; mistrial declared on 10 others. https://t.co/Wtd7DXxu7y — The Associated Press (@AP) August 21, 2018\nThe jury found Manafort guilty of five counts of tax fraud, two charges of bank fraud and a charge of hiding foreign bank accounts, according to multiple news outlets.\nTrump, saying he felt bad for Manafort, weighed in on the verdict calling it a “witch hunt” and a “disgrace.”\nHe also said Manafort’s conviction “has nothing to do with Russian collusion,” the AP reported.\nBREAKING: Trump says Manafort conviction `has nothing to do with Russian collusion,' calls it `a disgrace' — The Associated Press (@AP) August 21, 2018\nThere’s no sentencing date, yet, but Manafort is facing 80 years in prison on the 8 guilty counts, CNN reported.\nProsecutors have until the end of August to make a decision on the 10 counts that jurors could not reach a decision on which resulted in the mistrial.\nManafort was charged with 18 counts of bank fraud and conspiracy to commit bank fraud, as well as filing false income tax forms and failing to file foreign bank account reports.\nJurors deliberated for five days before returning a partial verdict Tuesday.\n>> Related: Who is Paul Manafort, the man indicted in Robert Mueller’s Russian investigation?\nThey heard 11 days of testimony from more than two dozen witnesses, including Manafort’s longtime business partner and former Trump campaign aide Rick Gates, according to Reuters.\nEarlier Tuesday, jurors has asked how to handle the case if they were unable to come to consensus on one of the 18 charges. Judge T.S. Ellis ordered them to continue deliberating but added that he might accept a partial verdict, if no consensus could be reached.\nProsecutors said Manafort hid at least $16 million in income from the IRS between 2010 and 2014 by disguising the money he earned advising politicians in Ukraine as loans and hiding it in foreign banks. Then, after his money in Ukraine dried up, they allege he defrauded banks by lying about his income on loan applications and concealing other financial information, such as mortgages.\nThe cash supported Manafort’s extravagant lifestyle, prosecutors said, funding real estate purchases in New York and Virginia and the purchase of luxury items, including a $15,000 jacket made of ostrich skin, Reuters reported.\nThe defense tried to pin the blame for Manafort’s financial mistakes on Gates, who was indicted alongside Manafort in October. Gates pleaded guilty in February to charges of making false statements and conspiring against the United States and agreed to work with prosecutors.\nManafort’s attorneys did not call any witnesses to testify in his defense. He did not take the stand.\n>> Related: Mueller investigation: DOJ OK’d probe into alleged collusion between Manafort, Russians\nManafort’s trial was the first prompted by special counsel Robert Mueller’s investigation into Russian meddling in the 2016 presidential election, although the case didn’t touch on allegations of interference. It was during the special counsel’s investigation that Mueller’s legal team said it discovered that Manafort had hidden millions of dollars that he had received in exchange for work he did for former Ukrainian President Viktor Yanukovych, a supporter of Russian President Vladimir Putin.\nManafort is expected to face a second trial on additional charges in September.\nThe Associated Press contributed to this report.","url":"https://www.ajc.com/news/national/jury-reaches-verdict-paul-manafort-bank-fraud-conspiracy-trial/RUGWnJBprFyUzp2PxDV7OL/"}
