{"authors":["Luke Augustus For Mailonline"],"date_download":"2018-10-23 02:48:44","date_modify":"2018-10-23 02:48:44","date_publish":"2016-01-28 17:55:15","description":"Leigh head coach Paul Rowley has dropped a bombshell on the eve of the new season by announcing his resignation.","filename":"data/vaneerConsumption/PaulRowleyresignsasLeighCenturionsheadcoachduetopersonalreasons.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC656900000578-0-image-a-5_1454002880163.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyleague_article-3421276_Paul-Rowley-resigns-Leigh-Centurions-head-coach-personal-reasons_1540262924.html","title":"Paul Rowley resigns as Leigh Centurions head coach due to personal reasons","title_page":"Paul Rowley resigns as Leigh Centurions head coach due to personal reasons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leigh head coach Paul Rowley has dropped a bombshell on the eve of the new season by announcing his resignation.\nRowley, 40, a former Leigh and England hooker who has been on the club's backroom staff since 2008, cited personal reasons for his decision to quit, just 10 days before the Centurions' opening Championship fixture.\n'It is with a heavy heart I have decided to resign of coach of Leigh Centurions,' he said in a short statement on TotalRLcom.\nLeigh Centurions head coach Paul Rowley has resigned from his role with immediate effect on Thurdsday\n'My reasons for leaving are personal and I will not comment further in public or in private.\n'I thank the players for everything they have given me and the club. My only regret is that I will not be there this year to lead them once more.'\nLeigh confirmed their board of directors received notification in writing of Rowley's resignation.\nClub owner Derek Beaumont said: 'It's a very sad day for Leigh Centurions and it is certainly not something that we wanted or expected to happen.\n'It is still sinking in and I would have preferred time to pass but inevitable media pressure requires the club to respond officially in order to remove any speculation.\n'Whilst we are extremely disappointed and shocked we wish Paul Rowley well and I hope our fans will do the same. He is a proud, passionate man and deserves the utmost respect which he will always receive from me personally.'","url":"https://www.dailymail.co.uk/sport/rugbyleague/article-3421276/Paul-Rowley-resigns-Leigh-Centurions-head-coach-personal-reasons.html"}
