{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:08:36","date_modify":"2018-10-30 18:08:36","date_publish":"2016-05-16 03:19:35","description":"Republican Paul Nehlen, who is challenging Speaker of the House Paul Ryan in Wisconsin's First Congressional District primary, joined Breitbart News Sunday on SiriusXM, telling Breitbart News' Washington political editor Matthew Boyle that it's \"shocking\" Ryan hasn't endorsed the presumptive Republican nominee Donald Trump. | Politics","filename":"data/vaneerConsumption/PaulNehlenChallengesPaulRyanDangerousToDenytheWillofVoters.json","image_url":"https://media.breitbart.com/media/2016/05/AP_16130792937589.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_15__1540922916.html","title":"Paul Nehlen Challenges Paul Ryan: 'Dangerous' To Deny 'the Will of Voters'","title_page":"Paul Nehlen Challenges Paul Ryan: 'Dangerous' To Deny 'the Will of Voters' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Republican Paul Nehlen, who is challenging Speaker of the House Paul Ryan in Wisconsin’s First Congressional District primary, joined Breitbart News Sunday on SiriusXM, telling Breitbart News’ Washington political editor Matthew Boyle that it’s “shocking” Ryan hasn’t endorsed the presumptive Republican nominee Donald Trump.\n“It’s pretty shocking,” Nehlen told Boyle. “It’s dangerous in the Republic that we have for the highest Republican elected official to deny what’s going on — the will of voters. I mean he’s just not listening to the voters.”\n“But, we’ve seen that from Paul Ryan before as shocking as it is, it’s in his DNA,” Nehlen charged. “Immigration and border security are two separate issues, but Paul Ryan has taken the wrong side on both of those in fact.”\nNehlen, a businessman, is reportedly aligned with Trump on many issues and recently gained support from former Alaska Gov. Sarah Palin.\n“This man is a hard-working guy, so in touch with the people,” Palin previously stated. “Paul Ryan and his ilk … They feel so threatened at this point that their power, their prestige, their purse will be adversely affected by the change that is coming with Trump and with someone like Paul Nehlen, that they’re not thinking straight right now.”\nNehlen said the reason he’s talking to Boyle is because of the Trans Pacific Partnership (TPP) trade deal that’s currently awaiting approval from Congress. The TPP is a trade pact between 11 Asian countries with the United States.\n“Paul Ryan is the mercenary champion of Hillary Clinton’s — this is Hillary Clinton’s. This came out of the State Department,” Nehlen said of the TPP. “This Trans Pacific Partnership is going to export our jobs. It’s going to import foreign workers to replace Americans and our jobs,” adding it’s “also [a] loss of sovereignty.”\n“It’s real shocking the that Paul Ryan…they suggest I’m against free trade,” Nehlen defended. “I embrace free trade [but] 5,500 pages of this Trans Pacific Partnership is anything but free trade. It is creating a captive market for Paul Ryan’s campaign contributors. Eighty-three percent of his campaign contributions came outside of Wisconsin’s first district.”\n“One in five Janesville residents can’t put food on their table,” Nehlen stated, expressing what he believes is wrong in Ryan’s hometown. “The First District is hurting. This is the Speaker’s district. Paul Ryan’s never won Janesville. In fact, he’s lost Janesville twice in one year,” Nehlen said, saying he lost it during the congressional race and when he was Mitt Romney’s Vice President in 2012.\n“We’re just flabbergasted here in Wisconsin when we see him pulling for things like Puerto Rico…[to] create a moral hazard for American tax payers when in fact, he’s ignoring our border security situation,” Nehlen said.\nNehlen said he has first hand experience with speaking to individuals at the border who can help him address the immigration problem in Washington, D.C.\nWhomever elected, which I certainly hope it’s our Republican, is going to have somebody standing there that says, ‘I’ve been to all nine sectors of the southern border and I can tell you unequivocally that I’ve spoken to the people [who] are actually where the rubber meets the road, the sheriffs, the deputies…I will be able to give my first hand thoughts, my first hand recommendations for what can be done, who to talk to down there, so that we do this right.\nWisconsin’s First Congressional District primary is on August 9th.","url":"https://www.breitbart.com/politics/2016/05/15/paul-nehlen-challenges-paul-ryan-dangerous-highest-ranking-republican-deny-will-voters/"}
