{"authors":["Martha Kelner For The Daily Mail"],"date_download":"2018-10-23 03:51:40","date_modify":"2018-10-23 03:51:40","date_publish":"2016-01-11 16:48:34","description":"Paula Radcliffe has hit out at UK Athletics after the governing body made a stunning call for all world records to be wiped from the books in an effort to regain public trust in the stricken sport.","filename":"data/vaneerConsumption/PaulaRadcliffehitsoutatproposaltowipeallworldrecordsIworkedhardanddiditcleanlytheywouldbecheatingmetwice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/0062FD0900000258-0-image-a-47_1452530742342.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-3394227_Paula-Radcliffe-hits-UK-Athletics-aim-start-clean-era-wiping-previous-records-Innocent-athletes-suffered-hands-drug-cheats_1540266700.html","title":"Paula Radcliffe hits out at proposal to wipe all world records: 'I worked hard and did it cleanly... they would be cheating me twice'","title_page":"Paula Radcliffe hits out at proposal to wipe all world records: 'I worked hard and did it cleanly... they would be cheating me twice' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UKA chief Ed Warner has said organisation is willing to rip up record book\nUK Athletics have released a manifesto in bid to clean up the sport\nSays innocent athletes should not suffer at hands of drug cheats\nPaula Radcliffe has hit out at UK Athletics after the governing body made a stunning call for all world records to be wiped from the books in an effort to regain public trust in the stricken sport.\nRadcliffe, the women’s marathon world record-holder, said the remarkable suggestion of expunging all existing records would feel like she was being ‘cheated by the spectre of doping twice over’.\nThe suggestion was made as part of a UKA report to herald an era of ‘clean athletics’ and also recommends athletes guilty of serious doping offences should be banned for life.\nPaula Radcliffe has criticised proposals by UK Athletics to wipe out previous records and start afresh\nRadcliffe said the plan would see innocent athletes suffer at the hands of doping cheats\nThe 42-year-old, whose 2hr 15min 25sec marathon world record has stood since 2003, did support the idea of athletes who are caught cheating, like Linford Christie, having all their previous marks annulled.\n‘If you make the decision to cheat you are forfeiting the right to everything which went before in your career,’ she said.\nUKA’s ‘manifesto for clean athletics’ made 14 proposals to clean up track and field and win back public trust, including life bans for those caught doping. Radcliffe said although most represented ‘a step in the right direction’, wiping all current world records would besmirch the name of clean athletes.\n‘I know I worked incredibly hard for my world record and did it cleanly,’ she said. ‘When you make a sweeping suggestion like that you will be punishing innocent athletes.\n‘Those are the same athletes who will have also had to compete against athletes who were cheating during their career. They are being cheated by the spectre of doping twice over and it’s so unfair.’\nRadcliffe’s world record, set at the London Marathon, is regarded as one of the finest in the sport and the crowning glory of an incredible career. But the UKA suggestion would see this wiped, along with Usain Bolt’s 9.58sec 100m and 19.19 200m records. It is a proposal that has not been properly thought through, according to Radcliffe.\nJonathan Edwards' triple jump record from 1995 could be wiped out of the history books by new proposals\n‘If you’re going to do that you’d have to wipe all national records, junior records, everything and I don’t think UKA properly thought about that,’ she said, ‘Niels (De Vos, UKA chief executive) consulted me about this report.\n‘I told him it’s a bit arbitrary to draw a line and say everything that comes after is clean. If people are caught doping then everything prior to that should be wiped away even if no evidence is found that they were cheating at the time. But don’t tar everyone with the same brush.’\nRadcliffe said she preferred the idea of hand-picking the most suspicious world records, such as Florence Griffith-Joyner’s absurdly good 100m and 200m times, and investigating further.\n‘If they think there are dodgy world records then find evidence to prove it and we can start moving forward,’ she said. ‘But just because some have that shadow over them you shouldn’t wipe everything away.’\nRadcliffe takes umbrage at some of the whistleblowers being portrayed as heroes. Russian marathon runner Liliya Shobukhova and her agent Andrey Baranov were praised after they went to the IAAF ethics commission to expose senior Russian Athletics and IAAF officials for extorting €450,000 (£336,000) from her.\nColin Jackson's 60m hurdles record from March 1994 could also be erased if UK Athletics do wipe out results\nUK Athletics chairman Ed Warner has called on athletics to 'face up to the scale of the problem'\n‘I get angry every time I hear Shobukhova described as an innocent or a victim because she and Baranov were cheats who were trying to buy their way out of having to serve their suspension,’ said Radcliffe. She also took a nuanced view of Vitaly Stepanov, the former employee of the Russian Anti-Doping Agency, who exposed systematic doping in the country, and his wife Yuliya, a former 800m runner, who doped during her career before blowing the whistle.\n‘Vitaly is a genuine whistleblower who made huge steps forward and deserves all the praise,’ said Radcliffe. ‘Yuliya was a cheat to begin with who got caught. There’s some credibility in what she did but she probably wouldn’t have if she hadn’t got caught.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-3394227/Paula-Radcliffe-hits-UK-Athletics-aim-start-clean-era-wiping-previous-records-Innocent-athletes-suffered-hands-drug-cheats.html"}
