{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 01:24:15","date_modify":"2018-10-23 01:24:15","date_publish":"2016-01-11 12:25:36","description":"He's wowing fans on the BBC's adaptation of War and Peace. But Paul Dano was impressing attendees at the Golden Globes awards on Sunday, where he cut a modern - and dapper - figure.","filename":"data/vaneerConsumption/PaulDanocutsadapperfigureasheattendsGoldenGlobesafterpartywithglamgirlfriendZoeKarzan.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A152700000578-0-image-a-64_1452515055041.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393766_Paul-Dano-cuts-dapper-figure-attends-Golden-Globes-afterparty-glam-girlfriend-Zoe-Karzan_1540257855.html","title":"Paul Dano cuts a dapper figure as he attends Golden Globes afterparty with glam girlfriend Zoe Karzan","title_page":"Paul Dano cuts a dapper figure as he attends Golden Globes afterparty with glam girlfriend Zoe Karzan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is currently wowing fans on the BBC's adaptation of War and Peace.\nBut actor Paul Dano was impressing attendees at the Golden Globes awards on Sunday, where he cut a modern - and dapper - figure.\nThe rising star attended the annual ceremony in a sharo-suited tuxedo with equally-glam girlfriend Zoe Karzan.\nScroll down for video\nModern man about town: Paul Dano impressed attendees at the Golden Globes awards on Sunday, where he cut a modern - and dapper - figure\nThe 31 year-old, from New York city, impressed onlookers in his navy blue ensemble which also consisted of satin lapels.\nHe capped the look with a crisp, white shirt and a silk bow tie.\nLooking distinctly more suave and fresh-faced than his TV alter-ego, Pierre Bezukhov, he certainly seemed on good form as he posed with his blonde partner.\nSee full Golden Globes coverage on red carpet and after party fashion\nCute couple: Joined by girlfriend Zoe Karzan, the 31 year-old from New York city scrubbed up very well\nIn character: Paul on-set of War and Peace with Tuppence Middleton and acclaimed star Tom Burke\nOpting for a simple aesthetic, she sported a floor-length white and cream number with semi-sheer detail for added statement.\nThe 32 year-old - who's hit movies include The Savages, Revolutionary Road and It's Complicated - wore her hair in a severe bob and went without excessive accessories, instead brandishing understated diamonds.\nShe capped the look with a rigid clutch bag for a truly synchronised style.\nLess is more: Opting for a simple aesthetic, Zoe sported a floor-length white and cream number with semi-sheer detail for added statement\nRecognise him? Paul's impressive CV boasts a host of hit movies, including Beach Boys biopic Love and Mercy, Looper and Little Miss Sunshine\nTaking to Twitter, the screen star said: 'Huge thanks to my friend @leithclark for dressing me in this beautiful @MIUMIUofficial gown & @CHANEL jewels'.\nMeanwhile, Paul's impressive CV boasts a host of hit movies, including Beach Boys biopic Love and Mercy, Looper and Little Miss Sunshine.\nHe will nest star in Swiss Army Knife opposite Daniel Radcliffe Daniel Radcliffe and Mary Elizabeth Winstead, plus Okya with Jake Gyllenhaal and Tilda Swinton.\nGlam: Taking to Twitter, the screen star said: 'Huge thanks to my friend @leithclark for dressing me in this beautiful @MIUMIUofficial gown & @CHANEL jewels'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393766/Paul-Dano-cuts-dapper-figure-attends-Golden-Globes-afterparty-glam-girlfriend-Zoe-Karzan.html"}
