{"authors":["Clemmie Moodie For The Daily Mail"],"date_download":"2018-10-22 22:38:09","date_modify":"2018-10-22 22:38:09","date_publish":"2017-03-10 01:02:51","description":"When Paul Hollywood announced he was taking the dough and joining Channel 4, many questioned his motives.","filename":"data/vaneerConsumption/PaulHollywoodisrevealedtobeworthacool10million.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F26AD00000578-0-image-a-170_1489109461549.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299624_Paul-Hollywood-revealed-worth-cool-10-million_1540247889.html","title":"Paul Hollywood is revealed to be worth a cool £10 million","title_page":"Paul Hollywood is revealed to be worth a cool £10 million | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When Paul Hollywood announced he was taking the dough and joining Channel 4, many questioned his motives.\nBut no-one can be left in any doubt now about the Great British Bake Off star’s decision to leave the BBC – for latest accounts show the 51-year-old is worth a staggering £10 million.\nCompanies House records show the popular Liverpudlian has £8.8 million in a new company and a further £1.2 million in his other, long-standing firm.\nScroll down for video\nRaking it in: Paul Hollywood's\nIt is a remarkable turnaround for a man who has previously been forced to fold two companies, owning thousands of pounds.\nThe baker, who will be fronting Channel 4’s big budget Bake Off when it airs this summer, set-up his new enterprise HJP Media LLP in March 2015 to channel earnings from his television appearances, books and other solo projects.\nHis company, Paul Hollywood Limited, and the cook himself are the named shareholders in the new business, meaning all the money belongs to him.\nMuch of it is held in investments, but the accounts mark a major change in fortune for the presenter who has been dogged previously by financial problems.\nBake off greats: Paul and Mary Berry judged the hit BBC show since 2010\nLast year it was revealed that his bread making enterprise, Paul Hollywood Artisan Bread, which he set-up in 2007, had folded after being unable to pay creditors, including EDF and HM Revenue and Customs, any of its £60,000 debts.\nThe business made expensive loaves including a £15 Roquefort and almond sourdough which were stocked by Harrods.\nPrior to that, in 2003, he liquidated his company Hollywood Bread.\nLiquidators were appointed with the company having racked-up debts of £262,000 when it was dissolved in December 2005.\nLast Christmas: Paul joined Mel, Sue and Mary Berry on the Great British Bake Off on BBC1 for the final time in December\nBut off the back of Bake Off’s success – particularly following its move from BBC2 to BBC1 three years ago - the presenter has successfully turned around his finances.\nFollowing Channel 4’s £75 million takeover of the hit cooking show, his earning power is again set for another substantial boost.\nWhilst Hollywood was rumoured be earning around £150,000 a year from the BBC, in addition to income from his baking books, he is now rumoured to be picking up an annual pay cheque of £400,000 - working out at £1.2 million for the three-year deal.\nHis previous co-host, Mary Berry, declined to move to Channel 4, as did presenters Sue Perkins and Mel Giedroyc.\nIn their statement at the time the presenting duo, who have hosted all seven series of the BBC baking show, said that they had opted against ‘going with the dough’, and would instead step down at the end of the current run.\nCommercial success: Paul's success on Bake Off led to commercial ventures such as cookbooks and cookware\nIn December, Hollywood hinted that the broadcaster had doubled his wages, and in November he and his wife, Alexandra, and son, Josh, moved into a £1.45 million country mansion.\nHe said: ‘Would you work across the road? If you could double your wages, by going across the road to a rival, would you?\n‘I haven’t murdered anyone. But I think the Yorkshire Ripper got less press than I did.’\nAsked to reveal his salary at the BBC Mr Hollywood said he wasn’t able to, but told The Times he was paid less than £500,000 for seven years on the show.\n‘I’d be happy for the BBC to release the figure to say how much I paid, but I can’t do that.’","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299624/Paul-Hollywood-revealed-worth-cool-10-million.html"}
