{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:02:17","date_modify":"2018-10-30 21:02:17","date_publish":"2016-03-01 21:02:42","description":"The two top Republicans in Congress criticized GOP frontrunner Donald Trump on Tuesday for not denouncing white supremacists and an endorsement from David Duke. |","filename":"data/vaneerConsumption/PaulRyanMitchMcConnellRepublicanPartyCondemnsDavidDukeandKKK.json","image_url":"https://media.breitbart.com/media/2016/03/Paul-Ryan-CNN-KKK.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_01__1540933337.html","title":"Paul Ryan, Mitch McConnell: Republican Party Condemns David Duke and KKK","title_page":"Paul Ryan, Mitch McConnell: Republican Party Condemns David Duke and KKK | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The two top Republicans in Congress criticized GOP frontrunner Donald Trump on Tuesday for not denouncing white supremacists and an endorsement from David Duke.\n“If a person wants to be the nominee of the Republican Party, there can be no evasion and no games. They must reject any group or cause that is built on bigotry. This party does not prey on people’s prejudices,” Speaker of the House Rep. Paul Ryan (R-WI) told the press on Capitol Hill.\nSenate Majority Leader Mitch McConnell stated, “Senate Republicans condemn David Duke, the KKK, and his racism.”\n“There has been a lot of talk in the last 24 hours about one of our presidential candidates and his seeming ambivalence about David Duke and the KKK, so let me make it perfectly clear,” McConnell declared. “That is not the view of Republicans who have been elected to the United States Senate, and I condemn his views in the most forceful way.”\nAccording to CNN, Trump declined to disavow his endorsement from Duke, a former grand wizard of the Ku Klux Klan, during an interview on Sunday. Trump later said he had a faulty earpiece and couldn’t clearly hear the question.\nTrump previously disavowed Duke’s endorsement during a press conference on Friday in Fort Worth, Texas when New Jersey Gov. Chris Christie endorsed Trump.\nA reporter asked Friday, “How do you feel about the recent endorsement from David Duke?”\n“I didn’t even know he endorsed me,” Trump responded. “I disavow, okay?”\nRyan did say he would support whoever the Republican Party nominee is, and will preside over the GOP convention in July.","url":"https://www.breitbart.com/politics/2016/03/01/3194661/"}
