{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:47:25","date_modify":"2018-10-30 19:47:25","date_publish":"2016-05-28 19:41:02","description":"Speaker of the House Paul Ryan joined nationally syndicated conservative talk radio host Larry Kudlow earlier this week, sounding similar on various policy stances to presumptive Republican nominee Donald Trump. | Politics","filename":"data/vaneerConsumption/PaulRyanEchoesDonaldTrumponEnergyTradeAmericaNeedsSmartTradeAgreements.json","image_url":"https://media.breitbart.com/media/2015/10/donald-trump-and-Paul-Ryan-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_28__1540928845.html","title":"Paul Ryan Echoes Donald Trump on Energy, Trade: America Needs 'Smart Trade Agreements'","title_page":"Paul Ryan Echoes Donald Trump on Energy, Trade: America Needs 'Smart Trade Agreements' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Speaker of the House Paul Ryan joined nationally syndicated conservative talk radio host Larry Kudlow earlier this week, sounding similar on various policy stances to presumptive Republican nominee Donald Trump.\nKudlow said Ryan seemed to be on the same page as Trump on energy policy following Trump’s speech in North Dakota on Thursday.\n“Donald and I have been talking the last few weeks about all of these ideas and we’re making sure we get on the same page on principles and then the policies that come from those principles and those are very productive talks that are happening,” Ryan told Kudlow.\nKudlow and Ryan suggested that issues like tax reform and deregulation are areas all Republicans can unify around. “You seem so close on these key pro-growth policy principles,” Kudlow commented.\n“What we’re trying to do is actually unify around common principles and policies so we’re a unified force going into the fall,” Ryan responded. “I find it interesting that the Democrats are really kind of ripping each other apart when we’re woking on doing what is needed to actually unify.”\n“We want it to be real and authentic and that means agreeing on common principles and the policies that come from there,” Ryan added.\nRyan also talked tougher on trade deals, saying they have reworked laws that were out of date and discussed the need to make sure trade laws work best for America.\nOn trade agreements, Ryan said the “rhetoric seems so far apart, but the substance really isn’t.”\n“It is in our interest to get other countries to agree to play by our rules,” he added. “If we can get them to agree to our kinds of rules so that we along with our allies are writing the rules of the global economy for the 21st century, that’s in our interest.”\nHe said it “helps us show China that you’re not going to write the rules that benefit you,” adding, “smart trade agreements” happen when America writes the rules.","url":"https://www.breitbart.com/politics/2016/05/28/paul-ryan-echos-donald-trump-energy-trade-america-needs-smart-trade-agreements/"}
