{"authors":["Associated Press"],"date_download":"2018-10-23 03:42:54","date_modify":"2018-10-23 03:42:54","date_publish":"2017-04-26 15:15:50","description":"Patrolman Michael Tousignant, 36, was off-duty when Mashantucket Pequot Tribal Police say he struck the attendant in the face because the 'water was too cold' at Foxwoods Casino in CT.","filename":"data/vaneerConsumption/Pawtucketofficerchargedwithpunchingbathroomattendant.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/20/3FA184AD00000578-0-image-a-4_1493235074873.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448024_Officer-charged-punching-casino-bathroom-attendant_1540266174.html","title":"Pawtucket officer charged with punching bathroom attendant","title_page":"Pawtucket officer charged with punching bathroom attendant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Rhode Island police officer charged with punching a 73-year-old casino bathroom attendant because 'the water was too cold' is seeking to avoid prison.\nPawtucket officer Michael Tousignant, 36, was charged with assaulting an elderly person.\nAuthorities say Tousignant was off-duty at the Foxwoods Resort Casino in Connecticut on April 1 when he complained to the attendant and then 'smacked him.'\n36-year-old Pawtucket officer Michael Tousignant was charged with assaulting an elderly person who in this case was a 73-year-old bathroom attendant at Foxwoods Casino, pictured\n'He said the water was too cold, and then he turned around and smacked the guy,' Tribal Police Chief William Dittman said.\nTousignant then left the bathroom, Dittman said, and his friends were overheard saying, 'Let's get out of here.'\nHe was charged by Mashantucket Pequot Tribal Police Department. The attendant was left with a bloody nose and facial injuries.\nTousignant is charged with assaulting an elderly person, which is a Class A misdemeanor in Connecticut which carries a one-year prison sentence.\nWhile being booked, he said that he had served in the military and had been with Pawtucket police for 10 years, according to The Providence Journal.\nHe applied for a court program that would let him avoid a criminal conviction and prison. It's unclear if he has an attorney.\nPawtucket police say Tousignant is on administrative duty and under investigation.","url":"https://www.dailymail.co.uk/news/article-4448024/Officer-charged-punching-casino-bathroom-attendant.html"}
