{"authors":["Press Association"],"date_download":"2018-10-23 01:17:53","date_modify":"2018-10-23 01:17:53","date_publish":"2016-01-11 11:58:04","description":"A crisis in the number of new teachers is largely the result of the Government's pay policy, according to the country's largest teaching union. A 1% cap enfo...","filename":"data/vaneerConsumption/Paycapiscausingteacherrecruitmentcrisisunionwarns.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-4054ebb0-953d-45a8-83f5-49d8fe425d71-56CX32zFKLb7123928b84ce3fa40-557_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393416_Pay-cap-causing-teacher-recruitment-crisis-union-warns_1540257473.html","title":"Pay cap is causing teacher recruitment crisis, union warns","title_page":"Pay cap is causing teacher recruitment crisis, union warns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pay cap is causing teacher recruitment crisis, union warns\nA crisis in the number of new teachers is largely the result of the Government's pay policy, according to the country's largest teaching union.\nA 1% cap enforced on teachers' pay over the last five years is putting off newcomers to the profession, the NASUWT warned.\nAnd measures that allow flexibility over teachers' pay risk creating a situation akin to the \"wild west'\" across an education system riven by \"chaos, confusion, unfairness and discrimination\", the union said.\nChris Keates said teachers' pay and conditions of service were linked to the provision of high quality education\nOver three-quarters of teachers have \"seriously considered leaving the profession\" in the last year as increased workloads affect their health and wellbeing, it claimed.\nThe staffing crisis threatens to hit teaching standards across the country, the union told Education Secretary Nicky Morgan, who it accused of being \"in denial\" of the problems facing teacher supply.\nIt also alleged the Department for Education had used \"misinformation\" about vacancy levels to justify proposals.\nThe NASUWT said it had carried out a \"forensic analysis\" of the Government's submission on teachers' pay to the School Teachers' Review Body for England and Wales, concluding it had relied on \"a series of anecdotes and assertions\".\nGeneral Secretary Chris Keates said: \"The Review Body cannot ignore the NASUWT's detailed evidence which demonstrates clearly that Government policies on teachers' pay are a major contributory factor to the current crisis in teacher recruitment and retention.\n\"A report by Incomes Data Research, commissioned by the NASUWT, confirms that teaching 'appears relatively unattractive in terms of earnings when compared to other graduate occupations'.\n\"The NASUWT's prediction that the introduction by the Government of more and more flexibility and discretion at school level over teachers' pay would lead to a situation akin to the 'wild west' across schools, has proved to be correct.\n\"Confusion, discrimination and unfairness are now rife. Well over three-quarters of teachers report they have seriously considered leaving the profession in the last twelve months.\"\nMs Keates added: \"Teachers' pay and conditions of service are inextricably linked to the provision of high quality education.\n\"Failure to ensure that teachers are recognised and rewarded as highly skilled professionals, coupled with year-on-year pay cuts has fuelled the teacher supply crisis.\n\"Children and young people are now facing the consequences of policies which are driving teachers out of, and deterring them from entering, the profession.\"\nIn a letter to Dr Patricia Rice, head of the STRB, last October, Ms Morgan said she had submitted evidence that there was a \" strong case for continued pay restraint in the public sector\".\nShe wrote: \"My evidence will provide a detailed account of the teacher labour market based on the latest recruitment and retention data and will contend that the recent pay reforms mean that schools are now best placed to decide how pay awards can be targeted to meet their specific local recruitment and retention needs.\"\nA DfE spokeswoman said: \"As part of our drive for educational excellence everywhere this Government is working with schools across the country to make sure they have the brilliant teachers they need to make sure every child gets the start in life they deserve.\n\"Unlike those who are constantly claiming there is a crisis and scaremongering, this Government has worked with the profession to raise the status of teaching and is attracting the best and brightest to a career in the classroom, with the result that record highly-qualified graduates and experienced career changers are now teaching in our schools.","url":"https://www.dailymail.co.uk/wires/pa/article-3393416/Pay-cap-causing-teacher-recruitment-crisis-union-warns.html"}
