{"authors":[],"date_download":"2018-10-31 00:07:37","date_modify":"2018-10-31 00:07:37","date_publish":"2016-11-18 00:00:00","description":"Retirement benefits now eat up 20% of city’s general fund revenue. Touted cost controls won’t have real impact for decades.","filename":"data/vaneerConsumption/PayingforpublicretireeshasnevercostLAtaxpayersmoreAndthatsafterpensionreform.json","image_url":"https://www.trbimg.com/img-581bc030/turbine/la-art-for-california-pension-legal-story-2016-013/600","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944457.html","title":"Paying for public retirees has never cost L.A. taxpayers more. And that's after pension reform","title_page":"Paying for public retirees has never cost L.A. taxpayers more. And that’s after pension reform - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"Retirement benefits now eat up 20% of city’s general fund revenue. Touted cost controls won't have real impact for decades.\nLos Angeles officials often boast about how they stemmed the rising cost of employee pensions, an expense that has hobbled cash-strapped cities throughout California. Former Mayor Antonio Villaraigosa said changes he oversaw in 2011 and 2012, which included lower pensions for new employees and higher retirement contributions from city workers, were “the most far-reaching effort in the nation.” Mayor Eric Garcetti echoed that assertion this year, saying L.A. had “done the most pension reform in the country of any big city.” This series is a partnership of Yet the numbers tell a story jarringly at odds with the political rhetoric, a Times analysis found. Today, Los Angeles taxpayers are underwriting retirement benefits that are among the nation’s most generous — at a cost that has never been higher. The city’s general fund payments for pensions and retiree healthcare reached $1.04 billion last year, eating up more than 20% of operating revenue — compared with less than 5% in 2002. L.A.’s vaunted pension reforms have not cut the city’s pension costs; at best, they have modestly slowed their rate of growth. Since the changes took effect, general fund contributions to the retirement system have grown an average of $66.6 million a year — roughly twice as fast as all other spending controlled by the mayor and City Council. City budget analysts say the increases will slow over the next five years, to $36.1 million annually. Even so, retirement costs would continue to consume roughly 20% of operating revenue. The effects can be measured in services forgone and civic ambitions deferred. With the money put into its pension funds over the last two years alone — nearly $2 billion — the city could have fixed every one of its broken sidewalks, built or leased housing for more than 25,000 homeless people or restored 11 miles of the concrete-clad Los Angeles River to a natural state. The Pension Gap: Read the story L.A.’s pension burden, while severe by national standards, is not unusual for California. Six of the state’s 10 largest cities — Los Angeles, San Diego, San Jose, Sacramento, Oakland and Bakersfield — devoted more than 15% of their general fund budgets to pensions and retiree healthcare during the 2015 fiscal year, The Times found. San Jose contributed the greatest share — almost 28%. Those cities face a common obstacle: In California, a stream of court rulings over the last half-century have shielded public employees from cuts to their retirement plans, restricting cost-saving measures to new hires. Those reductions take decades to be fully reflected in a municipality’s bottom line. L.A.’s taxpayers are also paying the price for questionable decisions made years ago. The city’s annual pension bill has effectively been doubled by the need to pay down debt to the retirement funds created by years of benefit enhancements and overly optimistic financial projections. The resulting shortfall is estimated by independent analysts at more than $20 billion. City officials today continue to use the same bullish accounting, raising doubts about elected leaders’ claims to have lightened the pension burden for future taxpayers. Garcetti, who exercises direct influence over the city’s retirement policy through his appointments to the pension funds’ boards of trustees, declined to be interviewed for this story. ADVERTISEMENT His spokeswoman, Connie Llanos, said the mayor had negotiated labor contracts that slowed the increase in workers’ salaries — a key determinant of pension costs — and in some cases scaled back future employees’ pensions. “We’ve held strong on our commitment to get our finances in order and secured strong and fiscally responsible labor deals with our employees that hold the line on raises and secure pension and salary reforms, saving the city billions,” Llanos said in a statement. City Administrative Officer Miguel Santana, L.A.’s top budget official, said the city has been hamstrung by legal limits on the reach of reforms and previous public officials’ financial decisions. “It’s not a management problem. It’s a math problem,” Santana said. “We’re the case study of having done all the hard things governments have done to manage our pensions. At the same time, we’re still saddled with this huge obligation,” he said. “This is a national, systemic issue, and there really isn’t a simple way out.”\nversion=\"1.0\" encoding=\"utf-8\"? 8000000000 Total GF LAFPP GF contribution LACERS GF contribution ’20 ’15 ’10 ’05 ’01 Sources: City budget officials, LACERS and LAFPP actuarial reports. Times analysis by Peter Jamison Lorena Elebee / @latimesgraphics Budget squeeze City contributions to the Los Angeles City Employees Retirement System and Los Angeles Fire and Police Pensions fund have steadily increased, and now eat up one out of every five dollars of the city's operating revenue. Projected Projected total general-fund revenue: $6.1 billion General-fund contributions Police/fire Other In 2015, 20.17% of general-fund dollars went to fund retirement. Projected contributions are expected to remain in the 20% range. $3.1 billion $5.2 billion Does not include Department of Water and Power. City of Los Angeles general-fund revenue\n‘A Hole They Dug’ After 33 years with the Los Angeles Police Department — much of it in the Special Investigation Section, a controversial surveillance squad whose exploits inspired the 1993 Hollywood thriller “Extreme Justice” — John Tortorici looked forward to his retirement in 2002. His neighbor was less upbeat. “He was a self-employed computer guy,” said Tortorici, a former detective whose pension was $109,232 last year, according to city records. “He said: ‘I have nothing. I don’t have a pension. I’m going to have to sell this house when I retire.” Eventually, Tortorici said, the man moved to Arizona. A 71-year-old native of the San Fernando Valley, Tortorici said he feels no embarrassment over his pension. “What I’m getting, I’m entitled to,” he said. “The city said, ‘We’re going to take care of you.’ I expect it to do that.” Yet he doubts that L.A. can sustain such largesse for future generations. “It’s a hole they dug for themselves, years ago, not knowing,” Tortorici said over coffee near his home in Newbury Park. “We can’t afford to do the way we’re doing it now.” No retirement plan better illustrates the lingering consequences of past financial choices than the Los Angeles Fire and Police Pensions fund. Since the 1960s the fund’s benefits have been amended five times, creating a kind of fossil record of the gradual enlargement of public-safety pensions. The high-water mark came in 2001 with the retirement plan known as Tier 5. Modeled on a deal state legislators approved in 1999 for California Highway Patrol officers, Tier 5 allowed public safety workers to retire at age 50 with up to 90% of their salaries, including cost-of-living increases of up to 3% a year. The fund’s previous plans had capped pensions at 70% of final salary. Tier 5 was opened to existing police and fire employees as well as new hires. As a result, workers with decades of service were allowed to migrate to the new plan en masse, retroactively taking advantage of its generous provisions. American public safety workers have historically enjoyed sturdy retirement benefits in recognition of their willingness to risk life and limb. Even against that backdrop, however, L.A. is an outlier. For the last 15 years, the police and fire fund’s average pension payments have been among the highest of any state or municipal plan in the country, according to an annual survey by the Center for Retirement Research at Boston College, the Center for State and Local Government Excellence and the National Assn. of State Retirement Administrators. version=\"1.0\" encoding=\"utf-8\"? Sources: City budget officials, LACERS and LAFPP actuarial reports. Graphics reporting by Peter Jamison Lorena Elebee / @latimesgraphics Sharing the pain Pension and retiree healthcare payments (including pension obligation bonds) as a percentage of general-fund revenue in California’s largest cities (2014-15): 0 5 10 15 20 25 30 27.86% 20.70 19.30 17.38 19.46 13.11 20.78 12.15 11.62 8.13 San Diego figures are budgeted rather than actual. San Jose Oakland Los Angeles Bakersfield San Diego Sacramento Anaheim Fresno Long Beach San Francisco In 2014 — the survey’s most recent year of complete data — the fund’s average pension of $62,964 exceeded those for New York City firefighters ($60,136), New York City police officers ($44,133) and Chicago police officers ($49,535), among others. Members of the Los Angeles City Employees Retirement System, which covers most workers outside the police and fire departments, received an average pension of $40,871. (A third L.A. pension fund, for employees of the Department of Water and Power, is funded by water and electricity sales, not tax dollars.) Corina Lee, who sits on the board of the union representing LAPD officers, said the 2001 benefit expansion was needed to stop the departure of officers for agencies, such as the California Highway Patrol, with more attractive pension plans. “We had to do something to retain our men and women, and to recruit men and women from across the country,” Lee said. Public employee unions and their allies on the political left have come under frequent criticism for their role in governments’ pension problems. But the circumstances of Tier 5’s creation belie a simple narrative of Democrats abetting Big Labor avarice. The campaign for the 2001 ballot measure that established the new pension plan was led by then-Mayor Richard Riordan, a Republican and former venture capitalist. In a recent interview, Riordan, now 86, said he based his support on the city pension funds’ reports of a combined $2.2-billion surplus. He said it was a mistake. “Back then, our pension funds were tremendous. We didn’t owe anything. Putting this in seemed like an easy thing to do,” he said. “With hindsight, we shouldn’t have done it.” Others also failed to question the assumptions behind Tier 5. City budget analysts projected, incorrectly, that administrative changes to the pension fund written into the initiative would not only offset the cost of richer pensions, but actually save money. The ballot measure passed with 72% of the vote. Three years after police officers and firefighters began enrolling in Tier 5, the city pension funds’ surplus had turned into a $4.3-billion deficit. Within a decade, that deficit had grown to $9.5 billion, as retirement costs continued to climb while the pension funds’ investments lost money.\nMarianna Black, a retired librarian, collects a $58,935 pension and lives in a rent-controlled apartment in Mid-Wilshire. (Christina House / For The Times) Limits of Reform L.A.’s deficits were part of a nationwide decline in the health of pension plans whose investment holdings were pummeled by the dot-com and housing busts. Some public officials took dramatic action. Rhode Island suspended cost-of-living increases to retirees’ pensions and shifted investment risk to employees through 401(k)-style retirement plans. Marianna Black worried that such sweeping changes might be coming to L.A. Black, 74, retired in 2002 after working as a city librarian for 35 years. She collects a $58,935 pension and lives in a rent-controlled apartment in Mid-Wilshire. “If they took away my pension I’d be out on the street,” Black said. “I need it for rent, for groceries, for everything.” In California — at least for now — she has no cause for concern. Under the so-called California Rule, which originated in a 1955 state Supreme Court ruling striking down efforts to raise city employees’ retirement contributions in Long Beach, governments cannot make changes to a pension plan that diminish its value for active or retired workers. Judges have forbidden even changes that leave untouched the benefits workers have already accrued, ruling that public employees are entitled for their working lives to whatever pension terms were in place on their first day on the job. By contrast, private-sector pension systems may modify their plans moving forward so long as they preserve accrued benefits. For retired government employees — who in the city of L.A. do not receive Social Security benefits — that legal precedent is a vital safeguard in an ever-more-expensive state. (Among other things, the California Rule prevents Rhode Island-style suspensions of cost-of-living increases.) Are Public Pension Benefits Excessive? State Workers Say 'No' Listen to a report by Capital Public Radio. Read the story Yet it presents a challenge to cities seeking to reduce their pension burdens, limiting cuts to the pension plans of workers hired after changes are adopted. “It’s going to take about 30 years for that to matter,” said Jean-Pierre Aubry, associate director for state and local research at the Center for Retirement Research at Boston College. “That’s a trickle.” In 2011, Los Angeles modified its pension plans for newly hired police and firefighters, striking a deal with unions that reduced the minimum pension available after 20 years of service and sought to eliminate “pension spiking,” in which employees contrive to earn unusually large salaries during their final year of work to secure a higher pension. But because those already on the job could keep the plans they had, the changes’ impact so far has been slight. Nineteen out of every 20 active and retired employees covered by the police and fire pension system are unaffected by the reforms, according to the system’s most recent valuation report. After several years of negotiation, city officials and labor leaders agreed late last year to a new retirement plan for civilian workers that cut maximum pensions and increased workers’ contribution rates to 7% of their paychecks from 6%, among other changes. City budget officials say it is too early to measure the effects of those changes. The city has achieved greater savings through a deal struck with its workers to contribute part of their pay toward their future healthcare costs. Until 2011, those costs were picked up entirely by taxpayers. Civilian workers agreed to contribute 4% of their paychecks toward retiree healthcare, while police officers and firefighters could either pay 2% or have their retiree health subsidies frozen at the rate offered in 2010. The contributions have saved $380.4 million since they went into effect, city budget officials say, or an average of $76.1 million a year. (The changes were legal because courts have not interpreted the California Rule as protecting active public employees’ retiree health benefits.) ADVERTISEMENT Politicians elsewhere have been less wary of bucking the California Rule, but their example is not encouraging. San Jose city officials in 2012 gave its workers a choice between accepting less generous pension benefits or pitching in more of their own pay. “We started with the math,” said former San Jose Mayor Chuck Reed. “If you’re going to have an impact quickly, you have to do something about current employees.” San Jose’s pension reforms were approved by 69% of voters in a June 2012 ballot measure. Within 18 months, however, a Santa Clara County Superior Court judge struck down key provisions of the measure as a violation of workers’ vested pension rights. The San Jose City Council ultimately renegotiated the package of changes so that it did not affect current employees’ pension plans. Critics of the California Rule glimpsed an opening for change in August, when a state appellate court ruled that active public employees’ pensions could be trimmed as long as the cuts were “reasonable.” The ruling is on appeal to the state Supreme Court.\n‘Fix the numbers’ Public pension funds, like their private-sector counterparts, live and die by the success of their investment portfolios. In many years, the return on those investments — typically a mix of securities dominated by stocks— provides half or more of a retirement system’s revenue. The rest comes in the form of annual contributions from employees and taxpayers. In many cities and states, including L.A., workers’ contributions are a fixed percentage of their paychecks. That means taxpayers are called on to fill the gap when investment income falls short. That call has come more and more frequently amid the economic tumult of the last 15 years. version=\"1.0\" encoding=\"utf-8\"? Sources: City budget officials, LACERS and LAFPP actuarial reports. Graphics reporting by Peter Jamison Lorena Elebee / @latimesgraphics Danger zone Corporate pension funds that have less than 80% of the money needed to cover the obligations of future retirees are considered vulnerable and subject to additional federal regulations. L.A. is in that danger zone. 60 80 100 120% Total Funded Ratio, 6.5% DR ’15 ’10 ’05 ’01 78% Danger zone Pensions and retiree healthcare, LACERS and LAFPP combined. City estimate of funded ratio for pension and retiree health funds Defenders of the status quo say public pension systems are enduring a temporary setback because of America’s worst recession in 80 years. But a growing number of finance experts and economists argue that public pension funds (and, by extension, taxpayers) have been victims of bad planning as well as bad luck. Public-pension managers, they assert, have been over-optimistic in projecting investment returns over the last 25 years. Those bright economic forecasts gave governments license both to lower their contributions and expand benefits — and have forestalled a realistic reckoning with how much money is needed to meet pension promises, some say. “We are not meeting these actuarial assumptions about investment rates of return,” said Leyne Milstein, finance director for the city of Sacramento, which participates in the California Public Employees’ Retirement System, or CalPERS, and has seen its pension costs rise because of sagging investment returns. “We can’t just keep plugging our fingers in our ears and saying, ‘La, la, la,’ because this isn’t going to go away and we’re not going to earn our way out of it.” The Los Angeles City Employees Retirement System’s average rate of return during the last 15 years has been 6.5%, compared with predicted returns ranging from 7.5% to 8%. Over the same period the Fire and Police Pension funds’ average return has been 6.34%, compared with projections of 7.5% to 8.5%. For the fiscal year that ended in June, the pension funds’ investment returns were 0.5% and 0.61%, respectively. As a result, city officials estimated they were $8.9 billion behind on what they should have saved for workers’ and retirees’ future benefits at the end of the 2015 fiscal year. Yet even that sobering assessment continues to rely on a bullish forecast for the pension funds’ investment returns. Analysts for Moody’s Investors Service, applying more conservative valuation methods similar to those used in the private sector, calculate that L.A.’s pension funds’ combined shortfall last year was $21.36 billion. Garcetti’s spokeswoman said the mayor believed, based on the advice of his appointed trustees on the retirement boards, that the funds’ return-rate assumptions are appropriate. Support our public service journalism Become a Los Angeles Times subscriber today to support collaborations like this one. Start getting full access to our signature journalism for just 99 cents for the first four weeks. Paul Krekorian, chairman of the L.A. City Council’s Budget and Finance Committee, said it would be “absurd” for city officials to use more conservative methods for calculating their annual contributions. Despite recent funding shortfalls, he said, over long periods the performance of the pension system’s investments has met or surpassed expectations. “We need to all be committed to sustaining the stability of our pension funds,” Krekorian said. “But I think the sky-is-falling prediction that I’ve heard from some critics is way overblown.” Jeremy Gold, a New York-based actuary, said public officials won't be able to deal effectively with rising pension costs until they recognize their true size. That would mean using more realistic accounting methods, he said, that allow for the risk that pension funds’ investments could lose money or earn less than expected. And it would likely entail either further pension cuts or heftier taxpayer contributions to bridge retirement systems' funding gaps, he said. “How much you do of one versus the other is essentially a political argument,” Gold said. “But until you fix the numbers, if you think you’ve fixed the problem, you’re just fooling yourself.”\nCredits: Andrea Roberson and Sean Greene. Graphics by Lorena Iñiguez Elebee.\nCalifornia's Pension Crisis: Coming next in the series In cities across California, the growing costs of pensions have led to some creative financing. Are such strategies making the situation better or worse? Sign up for our Essential Politics newsletter to receive the next installment in your inbox Privacy policy","url":"http://www.latimes.com/projects/la-me-pension-squeeze/"}
