{"authors":[],"date_download":"2018-10-30 18:30:51","date_modify":"2018-10-30 18:30:51","date_publish":"2017-02-28 18:41:00","description":"The DeKalb County Commission approved a $1.3 billion budget that spends on water billing and blight but lacks funding for police pay raises.","filename":"data/vaneerConsumption/PayraisesforDeKalbpoliceandfirefightersputonhold.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/28/Images/IMG_0324_3446x2157.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_p_6ff93ca4fbf0742fb7810aa844b33bb3__1540924251.html","title":"Pay raises for DeKalb police and firefighters put on hold","title_page":"DeKalb Commission passes $1.3B budget for 2017 without pay raises","title_rss":"NULL","source_domain":"ajc.com","text":"The DeKalb County Board of Commissioners passed a $1.3 billion annual budget Tuesday that excludes pay raises for police and firefighters but spends money to correct water billing inaccuracies and reduce blight.\nAbout 50 disappointed police officers looked on as the commission voted 6-1 to defer the 20 percent pay increase proposal.\nThey’ve been seeking the raise, which would cost $30 million, as a way to improve public safety by preventing officers from leaving for better-paying departments.\nCommissioners said they need time to more thoroughly review pay and benefits after approving 4 percent raises for all county employees last year. The board plans to reconsider base pay raises, shift differentials and hazard bonuses in the coming months.\n“There’s rarely enough resources to meet the needs of everyone we serve,” said DeKalb CEO Mike Thurmond. “We all agree that something must be done.”\nPolice officers said they wanted immediate financial help.\n“It’s critical. We’re continuing to lose officers,” said Jeff Wiggs, president of the DeKalb Fraternal Order of Police. “Money talks when it comes to any profession.”\nThe budget includes $1.5 million for short-term efforts to correct extreme water bills. The funding will pay for an ongoing audit, training customer service representatives, hiring mediators for dispute resolution, paying overtime and other items.\nAnother $2.6 million in existing funds will be redirected for litter removal and drainage cleaning efforts.\nIn addition, the commission backed Thurmond’s proposal to spend $250,000 to fight unemployment. The money will be used for a six-week summer training program for about 155 people between the ages of 14 and 24.\nThe commission approved the overall budget on a 5-2 vote.\nCommissioners Greg Adams, Steve Bradshaw, Kathie Gannon, Larry Johnson and Mereda Davis Johnson voted in favor of the budget while Commissioners Nancy Jester and Jeff Rader were opposed.\nPlease read the full story on MyAJC.com.","url":"https://www.ajc.com/news/local-govt--politics/pay-raises-for-dekalb-police-and-firefighters-put-hold/e5XFluwiQ7qxOjyof0H4SJ/"}
