{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:27:56","date_modify":"2018-10-30 22:27:56","date_publish":"2016-12-13 00:00:00","description":"A short seller has published a blog targeting the company, sending the share price down over 30%.","filename":"data/vaneerConsumption/PaysafesharescollapseonDecember12afterashortsellerblognote.json","image_url":"https://amp.businessinsider.com/images/584ff1d3dd0895cb558b4a70-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_paysafe-shares-collapse-december-12-short-seller-report-2016-12_1540938476.html","title":"Paysafe shares collapse on December 12 after a short seller blog note","title_page":"    Paysafe shares collapse on December 12 after a short seller blog note - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"LONDON — Shares in payment processing company Paysafe collapsed over 30% on Tuesday morning after a short seller claimed in a report that the company was at risk of being investigated by the regulator.\nPaysafe shares collapsed 32% between 11.00 a.m. GMT (6.00 a.m. ET) and 11.45 a.m. GMT (6.45 a.m. ET), but managed to recover some ground shortly after. Here is how shares look an hour later at close to 12.45 a.m. GMT (7.45 a.m. ET): Investing.com The slump came after a blog post was published by short seller Spotlight Research accusing the company of breaking the law through operations in Asia with partner Bet365 that it claims facilitate online gambling. Gambling in China is illegal. Bet365 did not respond to Business Insider's request for comment.\nSpotlight makes clear in its blog post that it is \"shorting\" Paysafe. This is where traders and hedge funds effectively bet that a stock price will fall.\nPaysafe said in a statement to the market:\n\"Paysafe Group is aware of a report published this morning by an organisation called Spotlight Research, which has disclosed a potential short interest benefiting from any weakness in Paysafe's share price.\n\"Paysafe confirms that all material information in the report is either factually inaccurate or has been previously disclosed.\n\"The Group has a history of significant, transparent disclosure to the market, publishing two prospectuses in 2015 and being subject to substantial additional scrutiny through a full UKLA listing process as part of its move to the Main Market of the London Stock Exchange.\n\"Having reiterated its upgraded guidance for the current financial year on 8 November 2016, the Company's business continues to perform well and management is next scheduled to update the market on 12 January 2017.\"\nPaysafe is a payment processor, handling payments on behalf of third parties, and operates online wallets under the brands Neteller and Skrill.\nBarclays said in a note last week that Paysafe \"continues to stubbornly trade at an unjustifiable discount to the sector\" in part due to the \"concern around the Bet365 exposure in China.\" However, the bank dismissed this as \"noise\", giving the stock an \"overweight\" rating.\nAnalysts at Macquarie said in a note on Monday initiating coverage of the stock: \"Paysafe's risk has fallen significantly over the last few years. Paysafe's exposure to high-risk Asian gateway revenue has reduced to about 13% in H1 2016 from 29% a year ago and it is not a contributor to growth.\"\nAggressive research and reports have become a popular tactic among short sellers in recent years. London-listed insurance company Quindell was targeted by Gotham Research in 2014, wiping £1 billion off its market value.","url":"https://www.businessinsider.com/paysafe-shares-collapse-december-12-short-seller-report-2016-12"}
