{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:35:14","date_modify":"2018-10-30 20:35:14","date_publish":"2016-12-29 00:00:00","description":null,"filename":"data/vaneerConsumption/Paytmwants5milliondigitalmerchants.json","image_url":"https://amp.businessinsider.com/images/562e8317bd86ef1d5d8b9a5b-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_paytm-wants-5-million-digital-merchants-2016-12_1540931714.html","title":"Paytm wants 5 million digital merchants","title_page":"    Paytm wants 5 million digital merchants - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII This story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nPaytm, a leader in India's mobile-wallet market, plans to have 5 million merchants make and accept digital payments in 2017 by adding new features and services, according to Money Control.\nThe company also plans to work with sales and distribution companies to get them to accept Paytm from merchant partners — this would not only give merchants another use case for the wallet, but would give Paytm a complete hold of the distribution pipeline.\nThese new initiatives could significantly broaden Paytm's addressable audience, and give it further opportunity to grow following major shifts in the Indian payments industry as a result of demonetization where the government removed 500- and 1,000-rupee notes from circulation in November.\nPaytm has seen rapid growth.\nShortly after demonetization, consumers began to look for alternative payment methods. Paytm was able to capitalize on that search — the wallet posted 1,000% growth in money added to the mobile wallet, a 300% rise in app downloads, and an increase from three transactions per user per week to 18 over a three-weeks period. The wallet has since gained over 20 million new users. Paytm has faced security and technical hurdles, which could have stymied interest, but has introduced new features to better protect consumers and recapture those it may have lost, which will likely keep interest high.\nMerchants are likely interested in following suit so they can capture a share of payment volume. Paytm hopes to more than triple the number of merchant users it has — the company currently has 1.5 million merchant users, however in 2017 it expects this number to hit 5 million. Attracting a larger share of merchants is significant for Paytm to keep a hold of its large market share. With more merchant users, consumers get more locations to use the payment option. And at the same time this allows Paytm to capture payment volume from merchants when they purchase goods from distributors. This would help Paytm capture a share of nearly all aspects of the Indian payments ecosystem.","url":"https://www.businessinsider.com/paytm-wants-5-million-digital-merchants-2016-12"}
