{"authors":["John Worthen"],"date_download":"2018-10-30 20:01:36","date_modify":"2018-10-30 20:01:36","date_publish":"2015-03-20 02:19:00","description":"PINE BLUFF -- A new ordinance approved by the Pine Bluff City Council this week requires all new hires for the city to live within the city limits as a way to keep shopping and tax dollars local.","filename":"data/vaneerConsumption/PBpassesordinancemakingnewhiresliveincitylimits.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_mar_20__1540929696.html","title":"PB passes ordinance making new hires live in city limits","title_page":"PB passes ordinance making new hires live in city limits","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Correction: The city of Little Rock requires only a few top administrators to live within city limits. This article about a residency ordinance in Pine Bluff incorrectly described the city’s practice.\nPINE BLUFF -- A new ordinance approved by the Pine Bluff City Council this week requires all new hires for the city to live within the city limits as a way to keep shopping and tax dollars local.\nAlderman Steven Mays drafted the residency ordinance, which the council passed Monday night in a 5-3 vote. Mays wrote in the ordinance that \"the city is a large employer, and the wages of its employees are funded by taxes, much of which is generated by the activities and transactions of city residents.\"\nThe ordinance further states that \"the injection of city employees as new residents, who are paid a living wage on a regular basis, must result in increased economic activity, which consequently increases tax collections.\"\nMays also wrote in the ordinance that \"relations between the community and public safety personnel is critical to preventing and solving crime ... and the security and health of the populace. Requiring that public safety employees live in the city is a reasonable measure to promote the public peace.\"\nAcross the state, residency requirements vary for city employees. There are no residency requirements in Conway, Fayetteville, Fort Smith or North Little Rock. However, Little Rock does require city workers to live within the city's boundaries.\nPine Bluff already had required city workers to live within a 12-mile radius, but many aldermen said people employed by the city should live there.\nUnder the new law, new hires will have 30 days to establish residency. The law takes effect next month. The 12-mile residency requirement will be nullified at that time.\nAlderman Thelma Walker said it boils down to showing loyalty to the city.\n\"When you live in a city, you take greater pride in what goes on there, and the work that you do there,\" Walker said. \"It's also important that people pay taxes locally and contribute to the school districts and fire and police departments. There is no reason why anyone who works for the city should live outside the city.\"\nAldermen Bill Brumett and Charles Boyd, who voted against the ordinance, said the city is setting a bad precedent. Brumett urged keeping the 12-mile rule, while Boyd said the city has no business telling workers where they can and cannot live.\nPine Bluff Mayor Debe Hollingsworth said Tuesday that she is still deciding whether to veto the ordinance, saying \"the city has much bigger things to focus on than where workers live.\"\nThe mayor added: \"This affects someone's basic rights ... and we could lose quality job applicants because of it. I think this is just an effort on the part of some aldermen to keep their names in the paper.\"\nState Desk on 03/20/2015","url":"https://www.arkansasonline.com/news/2015/mar/20/pb-passes-ordinance-making-new-hires-li/"}
