{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:37:48","date_modify":"2018-10-30 19:37:48","date_publish":"2015-06-24 22:25:27","description":"The producers of genealogy series Finding Your Roots violated PBS editorial standards when they omitted information about Ben Affleck's slave-owning ancestors from the actor's recent segment on the program, the public TV station said Wednesday. |","filename":"data/vaneerConsumption/PBSBenAfflecksFindingYourRootsEpisodeViolatedEditorialStandardsFourthSeasonDelayed.json","image_url":"https://media.breitbart.com/media/2015/04/ben-affleck-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_24__1540928268.html","title":"PBS: Ben Affleck's 'Finding Your Roots' Episode Violated Editorial Standards, Fourth Season Delayed","title_page":"PBS: Ben Affleck's 'Finding Your Roots' Episode Violated Editorial Standards, Fourth Season Delayed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The producers of genealogy series Finding Your Roots violated PBS editorial standards when they omitted information about Ben Affleck’s slave-owning ancestors from the actor’s recent segment on the program, the public TV station said Wednesday.\nThe scheduling of the third season of Finding Your Roots has been postponed until PBS and Washington, D.C. affiliate WETA can be guaranteed improved editorial oversight of the series going forward, PBS said.\nPBS also said that it will not commit to a fourth season of the program “until we are satisfied that the editorial standards of the series have been successfully raised to a level in which we have confidence.”\nThe public television network will remove Affleck’s episode from all forms of distribution.\nPBS launched an internal review of its editorial process after hacked Sony emails revealed that Finding Your Roots host and producer Henry Louis Gates Jr. had asked Sony CEO Michael Lynton for advice on editing out sensitive information about Ben Affleck’s ancestors from the actor’s recent segment on the show. Several of Affleck’s ancestors reportedly owned slaves in Georgia in the mid-1800s.\n“Here’s my dilemma,” Gates wrote Lynton in a July 2014 email. “Confidentially, for the first time, one of our guests has asked us to edit out something about one of his ancestors — the fact that he owned slaves. Now, four or five of our guests this season descend from slave owners, including Ken Burns. We’ve never had anyone ever try to censor or edit what we found. He’s a megastar. What do we do?”\nPBS said it first learned of Affleck’s request after the media reported on the hacked emails on April 17.\nIn a statement, Gates thanked PBS for its “thoughtful internal review” and apologized for “putting PBS and its member stations in the position of having to defend the integrity of their programming:”\nThroughout my many years of producing genealogy documentaries, I have always operated with rigorous ethical standards. Even so, we have been working with PBS and WETA to create new guidelines to increase transparency going forward. My career has been dedicated to improving race relations and intercultural understanding in our country. We are very excited about the third season of Finding Your Roots and look forward to uncovering and sharing many more incredible ancestral stories with our viewers.\n“Editorial integrity is essential to PBS,” added PBS Programming executive Beth Hoppe. “As a mission-driven media enterprise, we know that earning and keeping the trust of the American public are our most important priorities.”\nShortly after news of the editorial omission broke in April, Affleck apologized for asking Gates and the show’s producers to edit the sensitive information from his segment.\n“I didn’t want any television show about my family to include a guy who owned slaves. I was embarrassed. The very thought left a bad taste in my mouth,” Affleck wrote in a Facebook post. “I regret my initial thoughts that the issue of slavery not be included in the story. We deserve neither credit nor blame for our ancestors and the degree of interest in this story suggests that we are, as a nation, still grappling with the terrible legacy of slavery.”","url":"https://www.breitbart.com/entertainment/2015/06/24/pbs-ben-afflecks-finding-your-roots-episode-violated-editorial-standards-fourth-season-delayed/"}
