{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 01:37:36","date_modify":"2018-10-23 01:37:36","date_publish":"2017-03-16 11:44:06","description":"The video, filmed by the driver in Camden in September, allegedly shows the PC Joshua Savage launching the angry confrontation while a colleague watches.","filename":"data/vaneerConsumption/PCJoshuaSavagechargedwithassaultandcriminaldamage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53D77D00000578-0-image-a-50_1489664634416.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319758_Police-officer-charged-film-smashing-windscreen_1540258656.html","title":"PC Joshua Savage charged with assault and criminal damage","title_page":"PC Joshua Savage charged with assault and criminal damage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A police officer accused of attacking a suspect's car in an incident caught on film has been charged with assault and criminal damage.\nPC Joshua Savage is facing prosecution after footage appeared to show him smashing a car windscreen during a stop and search - before sawing it with a blade.\nThe dramatic video, filmed by the driver on September 16 and viewed thousands of times online, allegedly shows the officer launching the angry confrontation while a colleague watches.\nPC Joshua Savage is facing prosecution over this footage of a stop and search he carried out in Camden, north-west London\nWhen the man refuses to leave his Ford Fiesta in Camden, north-west London, the Metropolitan Police officer can be heard saying 'Get out of the car', adding: 'You're not allowed to drive it.'\nHis conduct was investigated after a member of the public complained to the Independent Police Complaints Commission (IPCC), which referred its conclusions to prosecutors in February 2017.\nThe watchdog said the Crown Prosecution Service authorised charges of common assault, possession of a bladed article, criminal damage and threatening behaviour against Savage on Tuesday.\nPC Savage repeatedly asks the driver to jump out of the car but he refuses to do so\nOnce the windscreen is smashed the officer pulls out an object and begins cutting the section of the glass screen out\nThe Met Police said the officer remained on restricted duties and a misconduct review would take place following the conclusion of criminal proceedings.\nSavage will appear at Westminster Magistrates' Court on April 20.","url":"https://www.dailymail.co.uk/news/article-4319758/Police-officer-charged-film-smashing-windscreen.html"}
