{"authors":["John Hayward"],"date_download":"2018-10-30 18:20:03","date_modify":"2018-10-30 18:20:03","date_publish":"2015-11-09 17:50:07","description":"The president of the University of Missouri, Tim Wolfe, is forced to resign over his allegedly inadequate response to racist incidents.","filename":"data/vaneerConsumption/PCRunsWildCampusActivistsDemandSensitivityResignationsCollectaScalpatUniversityofMissouri.json","image_url":"https://media.breitbart.com/media/2015/11/Mizzou-prez-Tim-Wolf-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540923603.html","title":"P.C. Runs Wild: Campus Activists Demand Sensitivity Resignations, Collect a Scalp at University of Missouri","title_page":"P.C. Runs Wild: Campus Activists Demand Sensitivity Resignations, Collect a Scalp at University of Missouri | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The president of the University of Missouri, Tim Wolfe, is out, forced to resign by protests over his allegedly inadequate response to racist incidents on campus.\nIn a similar, but much more bizarre, incident at Yale, student activists are demanding the resignation of professors who dared to argue with them about their demand for safe-space protection from hypothetical Halloween costumes. The wheels are coming off the American university system, at a time of skyrocketing tuition costs.\nThe University of Missouri president lost a power struggle with students, with the decisive blow coming when the university football team “drew national attention to the campus protests by announcing during the weekend that they would not participate in team activities until Wolfe was removed,” as Fox News reports. The team acted in solidarity with a student named Jonathan Butler, who was staging a hunger strike:\n“It is my belief that we stopped listening to each other,” Wolfe said during his statement. “We didn’t respond or react. We got frustrated with each other and we forced individuals like Jonathan Butler to take immediate action, unusual steps to affect change. This is not – I repeat, not – the way change should come about. Change comes from listening, learning, caring and conversation and we have top respect each other enough to stop yelling at each other and quit intimidating each other. “Unfortunately this has not happened,” Wolfe said. The protests began after the student government president, who is black, said in September that people in a passing pickup truck shouted racial slurs at him. In early October, members of a black student organization said slurs were hurled at them by an apparently drunken white student. Recently, a swastika drawn in human feces was found in a dormitory bathroom. More recently, two trucks flying Confederate flags drove past a site where 150 students had gathered to protest on Sunday, a move some saw as an attempt at intimidation. One of the participants, Abigail Hollis, a black undergraduate, said the campus is “unhealthy and unsafe for us.” “The way white students are treated is in stark contrast to the way black students and other marginalized students are treated, and it’s time to stop that,” Hollis said. “It’s 2015.”\nThis is less about specific allegations of unsatisfactory performance by Wolfe, and more like an avalanche of grievances that rolled into politically-correct fascist territory, complete with impromptu show trials:\nThe Concerned Student 1950 group, which draws its name from the year the university accepted its first black student, had demanded, among other things, that Wolfe “acknowledge his white male privilege,” that he be removed immediately, and that the school adopt a mandatory racial-awareness program and hire more black faculty and staff. The Columbia Daily Tribune reported that Wolfe was confronted outside a fundraising event in Kansas City Friday night by protesters who asked him to define systemic oppression. According to video of the encounter posted on Twitter, Wolfe responded that the students may not like his answer before saying, “Systematic oppression is because you don’t believe that you have the equal opportunity for success —” That statement provoked anger from the protesters, one of whom asked “Did you just blame us for systematic oppression, Tim Wolfe?” as the president walked away.\nAt least Wolfe’s critics can point to some incidents they think he should have handled better, even if they’re rather vague about exactly what he should have done, and display a creepy enthusiasm for forcing him to admit to thoughtcrimes. At Yale, there was no actual incident behind the student activist rampage. They want scalps because they don’t think the professors were sympathetic enough to their demands for protection from “offensive” Halloween costumes people might wear.\n“Students called for the resignation of Associate Master of Silliman College Erika Christakis after she responded to an email from the school’s Intercultural Affairs Council asking students to be thoughtful about the cultural implications of their Halloween costumes,” reports campus watchog group FIRE. “According to The Washington Post, students are also calling for the resignation of her husband, Master of Silliman College, Nicholas Christakis, who defended her statement.”\nFIRE provided video of students angrily confronting Nicholas Christakis and screaming obscenities at him, ordering him to “be quiet” so they could lecture him:\nIronically, Christakis was on campus that day to speak at a conference on free-speech issues in higher education. The student mob is essentially demanding punishment for professors who dared to oppose their drive for “safe space” controls on free expression.\nErika Christakis’ “offensive” email included the following unacceptable passages:\nI don’t wish to trivialize genuine concerns about cultural and personal representation, and other challenges to our lived experience in a plural community. I know that many decent people have proposed guidelines on Halloween costumes from a spirit of avoiding hurt and offense. I laud those goals, in theory, as most of us do. But in practice, I wonder if we should reflect more transparently, as a community, on the consequences of an institutional (which is to say: bureaucratic and administrative) exercise of implied control over college students. […] Is there no room anymore for a child or young person to be a little bit obnoxious… a little bit inappropriate or provocative or, yes, offensive? American universities were once a safe space not only for maturation but also for a certain regressive, or even transgressive, experience; increasingly, it seems, they have become places of censure and prohibition.\nOrder must be maintained on campus. The students who verbally assaulted Christakis should have been expelled immediately, with their parents left to contemplate the loss of thousands of dollars in tuition spent on kids who clearly weren’t ready for higher education, or even productive spaces in polite society. The University of Missouri is not setting a good precedent by giving their campus activists a scalp.\nAmong other things, this sort of campus chaos is interfering with the ability of serious students to get an education, while absorbing enormous resources, and making it difficult to detect or deal with serious problems. On the contrary, the exact wrong lessons about using mob tactics to extract satisfaction for “grievances” are being taught.\nSteven Hayward recalls a better solution to campus activism at PowerLine, recalling how acting president Sam Hayakawa dealt with protests at San Francisco State University in 1969:\nHayakawa quickly showed that he was made of sterner stuff than his witless predecessors in the president’s chair. He drew nationwide publicity when he climbed onto a sound truck from which protestors were shouting obscenities through a microphone, knocked a protestor to the ground who stood in his way (Hayakawa weighed only 145 pounds), and ripped out the wiring of the sound equipment, which the protestors were unable to repair. On another occasion Hayakawa brought a bullhorn to the protest, and shouted back at demonstrators. He also did not hesitate to call in police in large numbers to arrest protestors who disrupted classes. “In a democratic society,” Hayakawa said in justifying his recourse to the police, “the police are there for the protection of our liberties. It is in a totalitarian society that police take away our liberties.” He took activists at their word that their demands were “non-negotiable,” and refused to negotiate. A star was born, and he would serve as a complement to Reagan’s tough approach to campus troubles. Like Reagan, he referred to campus protestors as a “gang of goons and neo-Nazis,” and criticized the hypocrisy of campus liberals who expressed sympathy for the extremism of black radicals. Hayakawa attacked “the intellectually slovenly habit, now popular among whites as well as blacks, of denouncing as racist those who oppose or are critical of any Negro tactic or demand. We have a standing obligation to the 17,500 or more students—white, black, yellow, red and brown—who are not on strike and have every right to expect continuation of their education.”\nThe grim truth of campus totalitarianism is that fascism is fun. It’s exhilarating to be part of an angry mob, and social media makes it easier than ever. There’s a huge rush to crushing enemies, silencing dissent, and winning tangible victories against established order. If these tactics keep working, we’ll get more of them, and the students trying to get a real education will be left to wonder why no one has any consideration left over for them.","url":"https://www.breitbart.com/politics/2015/11/09/p-c-runs-wild-campus-activists-demand-sensitivity-resignations-collect-scalp-university-missouri/"}
