{"authors":["Stacy Liberatore For Dailymail.Com"],"date_download":"2018-10-23 03:03:40","date_modify":"2018-10-23 03:03:40","date_publish":"2016-01-28 18:16:14","description":"Nielsen revealed there are just four hours during the day when activity is high on Tinder. From 5pm to 9pm are the best times to login. But between 8pm and 9pm is prime time to find a potential match.","filename":"data/vaneerConsumption/PeakhoursfordatingappslikeTinderrevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACC28A00000578-0-image-a-43_1454004288808.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421321_9pm-triggers-swiping-frenzy-Tinder-OK-Cupid-users-prefer-message-morning-Peak-hours-dating-apps-revealed_1540263820.html","title":"Peak hours for dating apps like Tinder revealed","title_page":"Peak hours for dating apps like Tinder revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tinder users are most active between 9 and 10pm, while OK Cupid users go online between 8-10am, researchers have found.\nNielsen has release data showing there are just four hours during the day when activity is high in the app.\nThey also found Facebook Messenger activity is highest from morning until 2pm, which is when Snapchat takes over the share of minutes.\nWHAT DID NIELSEN'S DATA REVEAL Tinder users begin searching and swiping around 5pm and activity increase until the prime-time hour of 8pm to 9pm, but plummets at 10pm. Against what others may think, finding a late night meet-up on Tinder might not be so easy. The data shows activity in the app is at its lowest from 2am to 5am and doesn't pick up until the late afternoon. If you are a morning person you might want to check out OkCupid, which is booming with activity from 8am to 10am. Throughout different parts of the day, OKCupid seems to have more activity than Tinder, including a few hours in the afternoon, early and late evening.\nTinder users begin searching and swiping around 5pm and activity increase until the prime time hour of 8pm to 9pm, but then plummets at 10pm, reported the Huffington Post\n'To start our investigation, we looked at trends across OkCupid (OKC) and Tinder, two popular dating apps that were launched eight years apart and have somewhat different approaches to online dating,' Nielson said.\n'For example, OKC tends to draw a morning crowd that seems to spend time checking matches and messages when they get up and right before bed.\n'At 6 p.m. (normalized for panelists’ local time), there’s an inflection point where Tinderers start to use their app more than their OKC counterparts. 10 p.m.-11 p.m. gets the most usage time for both apps.'\nSince online dating has become so popular, Nielsen believes understanding when dating apps are being flooded with potential matches or when no one is checking them may actually help users find love.\nNielsen tracks smartphone data from about 9,000 panelists as part of its Electronic Mobile Measurement program..\nThis data provides information about the US consumer to companies that market to mobile device users.\nDespite what others may think, finding a late night meet-up on Tinder might not be so easy.\nThe data shows activity in the app is at its lowest from 2am to 5am and doesn't pick up until the late afternoon.\nIf you are a morning person you might want to check out OkCupid, which is booming with activity from 8am to 10am.\nThroughout different parts of the day OKCupid seems to have more activity than Tinder, including a few hours in the afternoon, early and late evening.\n'When we look at unique audience, we see that a larger percentage of all OKC users sign in both in the morning and night,' a Nielsen statement said.\nSince online dating has become so popular, Nielsen believes understanding when dating apps are being flooded with potential matches or when no one is checking them may actually help users find love. Nielsen tracks smartphone data from about 9,000 panelists as part of its Electronic Mobile Measurement program\n'On Tinder, the user's likelihood to check in between noon and midnight is mostly flat at about 40 percent.'\nNielsen explained there are about 40 percent unique Tinder users who are swiping various times from noon to midnight.\nMost singles want to be where the action is and Nielsen's data shows that at 9pm there is an audience of about 51.64 percent.\nAnd the second rush hour, 4pm-5pm, has 60.61 percent of the audience.\nAgainst what others may think, finding a late night meet-up on Tinder (left) might not be so easy. The data shows activity in the app is at its lowest from 2 am to 5 am and doesn't pick up until the late afternoon. Throughout different parts of the day OKCupid (right) seems to have more activity than Tinder\nAfter analyzing dating app activity, Nielsen move on to other communication apps – Facebook Messenger, Snapchat and brought Tinder over.\nResearchers found Facebook Messenger activity is the highest of the three from morning until 2pm, which is when Snapchat takes over the share of minutes.\nAs Nielsen showed in its dating app researcher, Tinder doesn’t hit prime time until 8pm.\nResearchers found more than 20 percent of the Facebook Messenger, Snapchat and Tinder app users check in at least once in each hour block of the day.\nAfter analyzing dating app activity, Nielsen move on to other communication apps – Facebook Messenger, Snapchat and brought Tinder over. Researchers found Facebook Messenger activity is the highest of the three from morning until 2pm, which is when Snapchat takes over the share of minutes\nBut Snapchat leads in share of users, as 60 percent or more open the app at least once during most hours of the day.\nResearchers looked at other apps that blur the lines between social networking, communication and messaging.\nFacebook Messenger give way a touch earlier than Twitter and Instagram, and Tumblr’s share of minutes doesn’t decline until later in the night.\nAs Nielsen showed in its dating app researcher, Tinder doesn’t hit prime time until 8pm. Researchers found more than 20 percent of the Facebook Messenger, Snapchat and Tinder app users check in at least once in each hour block of the day.\nWith focusing on an audience perspective, Facebook’s products attract a higher share of their active users this month through the middle of the day.\n'Email apps follow very similar trends throughout the day, with the exception of a regular spike in Microsoft Outlook minutes in the afternoon.\n'And our frequent email activity reveals just how embedded this technology is in mobile user's lives.'\nEmail apps follow a similar trend throughout the day, with the exception of regular spike in Microsoft Outlooks in the early afternoon. The share of unique audience is higher than 20% at all hours of the night, and can climb as high as 65%, which means users are checking their email at least ones each of those hours\nThe share of unique audience is higher than 20% at all hours of the night, and can climb as high as 65%.\nThat means more than half of users check their email at least once each of those hours.\n‘Having direct insight into which channels are most traversed and when can help communicate a message at the right place and right time,’ according to a statement from Nielsen.","url":"https://www.dailymail.co.uk/sciencetech/article-3421321/9pm-triggers-swiping-frenzy-Tinder-OK-Cupid-users-prefer-message-morning-Peak-hours-dating-apps-revealed.html"}
