{"authors":["Sean Moran"],"date_download":"2018-10-30 19:58:13","date_modify":"2018-10-30 19:58:13","date_publish":"2018-08-14 20:33:36","description":"A Pearl Jam poster for Sen. Jon Tester features a dead President Donald Trump and an American bald eagle eating the remains of his corpse.","filename":"data/vaneerConsumption/PearlJamPosterPromotingJonTesterFeaturesDeadDonaldTrump.json","image_url":"https://media.breitbart.com/media/2018/08/Pearl-Jam-Poster-Dead-Trump.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_14__1540929493.html","title":"Pearl Jam Poster Promoting Jon Tester Features Dead Donald Trump","title_page":"Pearl Jam Poster Promoting Jon Tester Features Dead Donald Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Pearl Jam poster for a get-out-the-vote concert on Monday promoting Sen. Jon Tester (D-MT) features a dead President Donald Trump and an American bald eagle eating the remains of his corpse. Matt Rosendale’s Senate campaign called the poster “reprehensible.”\nA poster which is promoting a Monday get-out-the-vote concert promoting Sen. Tester depicts the skeletal remains of President Trump, as well as Sen. Tester and Montana state auditor Matt Rosendale.\nA spokesman for Matt Rosendale decried the poster in a statement to Breitbart News, saying, “Once again, Jon Tester has shown he will stand with the far-left over Montanans. This poster from Pearl Jam is disgusting and reprehensible. It depicts a dead President Trump and a burning White House. It’s time for Jon Tester to denounce this act of violence and blatant display of extremism.”\nThe poster, which was a collaboration between Pearl Jam bassist Jeff Ament and Bobby Draws Skullz, depicts an apocalyptic Washington, D.C., with the Washington Monument and Lincoln Memorial decayed and on fire. In the center of the poster is the skeleton of President Trump, with his hair intact, reaching for a briefcase emblazoned with the communist hammer and sickle, while an eagle feeds on his carcass.\nOver the White House, Sen. Tester is cheerfully flying over President Trump’s dead body on a tractor with clouds that spell out, “vote.”\nMontana Senate Republican candidate Matt Rosendale is depicted with a lobster claw and waving a flag that says, “Maryland.”\nAment is a “proud” supporter of Sen. Tester; the two have been friends for years, and Pearl Jam frequently comes to Montana to hold get-out-the-vote campaigns for Sen. Tester’s re-election campaigns.\nAment said that he meant to hold the concert on Monday to promote Sen. Tester.\n“It will be as close to it as we can possibly get without it being a Jon Tester campaign rally,” Ament said.\nA letter from Ament appears to be the source for the ideas behind the poster. The letter reads:\nD.C. Burning Tester Evel Knievel on Tractor…\nOver The Cesspool Below\nRussian Money, Golf courses, Hookers?\nMaryland Matt Stars N Strips As Flames\nY’all Know The Deal, We’re at a Tipping Point, And Its Time For Action.\nJon Tester is the Real Deal, and Nobody cares More About our Country And Especially Montana.\nSo Here We Are…\nThis was a Fun Collab With One Of My Favorite Artists, Bobby Draws Skulls.\nHe Killed It!\n-Jeff Ament\nSen. Jon Tester’s campaign did not respond to a request for comment from local Montana radio station KGVO.","url":"https://www.breitbart.com/politics/2018/08/14/pearl-jam-poster-promoting-jon-tester-features-dead-donald-trump/"}
