{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:49:53","date_modify":"2018-10-30 18:49:53","date_publish":"2015-04-17 16:14:56","description":"The American College of Pediatricians has urged health care providers to educate women about the link between abortion and breast cancer.","filename":"data/vaneerConsumption/PediatriciansWarnofAbortionBreastCancerLink.json","image_url":"https://media.breitbart.com/media/2015/02/pregnant-woman-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_17__1540925393.html","title":"Pediatricians Warn of Abortion-Breast Cancer Link","title_page":"Pediatricians Warn of Abortion-Breast Cancer Link | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a press release last week, the American College of Pediatricians urged health care providers to educate young women about the strong link between abortion and breast cancer.\nIn 2013, Dr. Rebecca Johnson, a cancer specialist at Seattle Children’s Hospital, released results of a study that demonstrated that the number of advanced breast cancer cases has increased among younger women, aged 25-39 years. After an analysis of 34 years worth of data from many countries, Johnson and her colleagues found that induced abortion was likely a causal–not correlational–risk factor for the development of breast cancer.\nThe pediatricians group also revisits the fact that studies from China, India, and Romania show incidence of breast cancer increasing as the number of abortions increase, with a “dose effect” demonstrating “an increasing risk of breast cancer with each subsequent abortion.”\nRecent College President Dr. Den Trumbull states, “When one considers the normal anatomy and physiology of the breast it becomes clear that this link is causal, not merely correlational.”\nThough the data show that abortion prior to 32 weeks of pregnancy by itself is a risk factor for breast cancer because abortion interferes with the maturation of breast cells, the medical community and the main stream media have largely ignored the issue.\nFor example, a brief article about Johnson’s study at Yahoo.com mentioned that advanced breast cancer cases have “increased slightly among young women,” but the article did not discuss the link to abortion. Instead, it stated the outcome raised “many questions about possible reasons even as the disease remains uncommon in women younger than 40.”\nDespite the overwhelming evidence, as recently as February, pro-abortion Dr. David Grimes, writing at the Huffington Post, argues that foes of abortion are wrong. Mocking the pro-life community, Grimes snipes:\nThe theory that abortion increases a woman’s risk of breast cancer was debunked long ago. Why then does the claim still appear from bumper stickers to Crisis Pregnancy Centers to the Internet? Some zealots claim that “The single most avoidable risk factor for breast cancer is … elective abortion.” Indeed, one abortion foe alleges an international conspiracy of silence.\nMaintaining that poor research methodology is responsible for the same results reached by a multitude of studies, Grimes states that “recall bias” is the culprit in leading researchers to conclude that abortion and breast cancer are significantly linked. The bias, he says, occurs when healthy women in breast cancer studies are not willing to disclose abortions to researchers, leading to an underreporting of abortion among healthy controls and, consequently, a false association between abortion and breast cancer.\nGrimes attempts to bolster his argument with the statement, “The world’s medical community has examined the evidence and concurred that no relationship exists,” and cites that groups such as the World Health Organization, the American College of Obstetricians and Gynecologists agree with him while the American Association of Pro-Life Obstetricians and Gynecologists, and the Catholic Medical Association do not.\n“To claim a link today reflects either a lack of understanding of medical research or intentional misrepresentation of it for ideological purposes,” Grimes concludes. “While the former excuse may be forgiven, the latter should not be.”\nIn a statement to Breitbart News, however, American College of Pediatricians board member Dr. Jane Anderson asserted, “Induced abortion, prior to 32 weeks gestation, increases the risk of breast cancer in women, especially if that abortion occurs before a woman has experienced a full term pregnancy.”\nAnderson maintains that the increased estrogen levels in the early stages of pregnancy prepare the breasts for breast-feeding, as the milk-producing cells rapidly multiply.\n“If an abortion occurs prior to 32 weeks, these cells are, in a sense, left in a state of suspended animation, ready to rapidly proliferate,” she explains, adding:\nThe cells are then much more susceptible to carcinogens and are more likely to develop cancer. Once a woman’s pregnancy passes the 32 week mark, most cells have matured and are more resistant to the development of cancer, which is why a full term pregnancy decreases a woman’s risk of breast cancer.\nAnderson further observes that 57 of 73 studies worldwide demonstrate a strong association between induced abortion and increased risk of breast cancer.\nRegarding Grimes’ assertion that recall bias as the methodological flaw in the abortion-breast cancer link studies, Anderson states the researchers in a Swedish study used by Grimes to prove no link exists actually found no statistically significant difference between the responses of women with and without breast cancer regarding acknowledgment of prior abortions.\n“Dr. Grimes is ignoring all the studies from around the world that do document a relationship between abortion prior to 32 weeks and an increased risk of breast cancer,” Anderson asserts. “Women in America have the right to informed consent. An increased risk of breast cancer is definitely one of the morbidities that should be acknowledged and discussed. This is especially true in the case of women contemplating the abortion of their first child prior to 32 weeks gestation.”\nDr. Jane Orient, executive director of the Association of American Physicians and Surgeons (AAPS), agrees.\n“If a woman has had abortions she should consider having mammograms at a young age, since some of these women will already have an aggressive breast cancer,” she said.\n“Additionally, a link exists between hormonal contraception and breast cancer,” Orient added. “The World Health Organization declared forms of birth control pills and estrogen replacement therapy as Group I carcinogens–and it makes biological sense. Many women stopped taking hormone replacement therapy because of the known risk.”\nLike Anderson, Orient is horrified that young women in the United States are not given informed consent regarding abortion and the link to breast cancer.\n“It’s outrageous–women should be told about the very real consequences,” she asserts. “This is a completely elective procedure–women are not going to die if they don’t have an abortion.”","url":"https://www.breitbart.com/politics/2015/04/17/pediatricians-warn-of-abortion-breast-cancer-link/"}
