{"authors":["Gavin Mccafferty","Press Association"],"date_download":"2018-10-23 04:14:44","date_modify":"2018-10-23 04:14:44","date_publish":"2017-03-16 15:28:07","description":"New Rangers manager Pedro Caixinha is still assessing a list of candidates for an assistant but says Kenny Miller will focus on playing. The forward will be allowed to focus on the playing side.","filename":"data/vaneerConsumption/PedroCaixinhaseekinglocalknowledgeforcoachingteam.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55033800000578-0-image-a-110_1489677687013.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320672_Pedro-Caixinha-seeking-local-knowledge-coaching-team_1540268084.html","title":"Pedro Caixinha seeking local knowledge for coaching team","title_page":"Pedro Caixinha seeking local knowledge for coaching team | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New Rangers manager Pedro Caixinha is still assessing a list of candidates for an assistant but says Kenny Miller will focus on playing.\nMiller was reported to be among the potential candidates as Caixinha looks for an addition to his long-standing backroom team.\nBut Caixinha - who confirmed goalkeeping coach Jim Stewart had left the club - said Miller was not on his list.\nNew Rangers manager Pedro Caixinha is looking forward to being in the dugout on Saturday\nThe Portuguese boss is yet to make a final decision on the make-up of his coaching staff\nThe Portuguese manager revealed he had spoken to vice-captain Miller along with skipper Lee Wallace and Andy Halliday in a meeting with senior players.\nHe added: 'Kenny spoke to me for one more minute and he told me something I already knew, that he was doing something part-time with the Under 20s.\n'Okay, perfect, all the time that is not colliding with our work, I am very glad that you keep doing that work. But I also know that he wants to still play.'\nMiller's contract expires at the end of the season but the 37-year-old wants a new one.\nCaixinha has called on the experience of Kenny Miller but he will focus now on the playing side\nThe 46-year-old has enjoyed a full week of preparations ahead of his opening game at Ibrox\nRangers fixtures March 18 Hamilton (H) April 1 Motherwell (H) April 5 Kilmarnock (A) April 9 Aberdeen (A) April 15 Partick Thistle (H)\n'My focus is firmly on being a player for as long as I can,' Miller said. 'You're a long time retired so I'm firmly focused on the game at the weekend and continuing my duties as a player until the end of the season and hopefully beyond.\n'I don't feel ready to hang the boots up yet, I still feel like I have a lot to offer on the field at the moment. It would definitely have to involve still being a player.\n'As long as I'm performing and contributing, which I feel I am at the moment, I still want to be considered a player first.'\nOn his new coaching colleague, Caixinha added: 'I'm about to assess that situation. We have a list of candidates. We are going to start the assessment as soon as possible.\n'We are going to have someone that can give me that knowledge, someone that is really linked with the history and tradition of this club and how big it is to represent this club.'\nCaixinha holds a scarf aloft as he is unveiled to the media at Ibrox on Monday morning","url":"https://www.dailymail.co.uk/sport/football/article-4320672/Pedro-Caixinha-seeking-local-knowledge-coaching-team.html"}
