{"authors":["Associated Press"],"date_download":"2018-10-23 01:41:22","date_modify":"2018-10-23 01:41:22","date_publish":"2016-01-29 15:41:49","description":"BALTIMORE (AP) — Top House Democrat Nancy Pelosi is praising Vermont Sen. Bernie Sanders for getting more young people \"interested in the political process\" ...","filename":"data/vaneerConsumption/PelosipraisesBernieSandersforenergizingyoungvoters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:1177cb6e010246e0a25d2a75511b2094-3bmscybNe842cce83474b576fbd9-66_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423003_Pelosi-praises-Bernie-Sanders-energizing-young-voters_1540258882.html","title":"Pelosi praises Bernie Sanders for energizing young voters","title_page":"Pelosi praises Bernie Sanders for energizing young voters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pelosi praises Bernie Sanders for energizing young voters\nBALTIMORE (AP) — Top House Democrat Nancy Pelosi is praising Vermont Sen. Bernie Sanders for getting more young people \"interested in the political process\" as he mounts a surprisingly strong race for the Democratic presidential nomination.\nThe California congresswoman says that \"history will record that Bernie Sanders' candidacy has had a very wholesome effect.\"\nPelosi spoke as House Democrats are closing out a team-building conference aimed at building unity and sharpening the party's message heading into the November elections.\nPeople reach out to shake hands with Democratic presidential candidate Sen. Bernie Sanders, I-Vt., during a campaign rally at the Sondheim Center on Thursday, Jan. 28, 2016, in Fairfield, Iowa. (AP Photo/Evan Vucci)\nShe was responding to a question about whether Sanders' candidacy will hurt Democrats' chances this election.\nPelosi has steered clear of endorsing a candidate in the party's three-way primary but is regarded as a supporter of Hillary Clinton.","url":"https://www.dailymail.co.uk/wires/ap/article-3423003/Pelosi-praises-Bernie-Sanders-energizing-young-voters.html"}
