{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:37:29","date_modify":"2018-10-30 21:37:29","date_publish":"2016-10-28 19:19:51","description":"BENSALEM, Pennsylvania — “We call on the FBI to immediately release all the email pertinent to their reopened investigation, the American people have the right to know,” Republican vice presidential nominee Gov. Mike Pence declared to a packed crowd of around 2,000 people in a Pennsylvania warehouse Friday.","filename":"data/vaneerConsumption/PenceWeCallontheFBItoImmediatelyReleaseEmailsPertinenttoReopeningofClintonInvestigation.json","image_url":"https://media.breitbart.com/media/2016/10/wi/ap/27/333g3gb-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_28__1540935449.html","title":"Pence: We Call on the FBI to Immediately Release Emails Pertinent to Reopening of Clinton Investigation","title_page":"Pence: We Call on the FBI to Immediately Release Emails Pertinent to Reopening of Clinton Investigation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"BENSALEM, Pennsylvania — “We call on the FBI to immediately release all the email pertinent to their reopened investigation, the American people have the right to know,” Republican vice presidential nominee Gov. Mike Pence declared to a packed crowd of around 2,000 people in a Pennsylvania warehouse Friday.\nPence was speaking to the FBI’s decision to relaunch it’s investigation into Democratic presidential nominee Hillary Clinton’s mishandling of classified information during her time as Secretary of State following the discovery of additional “pertinent” emails.\nThe crowd erupted with booming cheers as Pence made the call for the release of the emails that caused the reopening of the case.\nGov. @mike_pence \"we call on the FBI to immediately release all the email pertinent to their reopened investigation\" of Hillary Clinton pic.twitter.com/7x44yGKTNT — Michelle Moons (@MichelleDiana) October 28, 2016\n“Truth is a force of nature,” said Pence as he has many times before. The truth eventually comes out.\nShouts of “lock her up,” “drain the swamp,” and “USA, USA, USA” rang out exuberantly from the crowd.\nFBI Director James Comey revealed the reopening of the investigation in a letter to members of congress. News of the letter broke as both Pence and Clinton were on planes without access to wifi.\nClinton used a private server to send and receive classified information as was revealed in the initial investigation into her use of the non-government server. When Comey announced the close of the investigation he acknowledged mishandling of classified information, but that it didn’t meet the threshold for prosecution.\nBreitbart News previously reported that the FBI was never provided with the 13 mobile devices used to transmit Clinton’s emails. A laptop with the entire Clinton email archive was also never provided – the excuse being that it was lost in the mail – and a USB drive with the same archive was also never provided.\n“I am writing to inform you that the investigative team briefed by on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation,” read a portion of the letter from Comey to members of congress.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/10/28/pence-call-fbi-immediately-release-emails-pertinent-reopening-clinton-investigation/"}
