{"authors":["Sharnaz Shahid For Mailonline"],"date_download":"2018-10-23 00:19:43","date_modify":"2018-10-23 00:19:43","date_publish":"2016-01-28 14:09:12","description":"The 41-year-old looked absolutely incredible as she attended a special screening of a new documentary, entitled Soy Uno Entre Cien Mil, in Madrid, on Thursday.","filename":"data/vaneerConsumption/PenelopeCruzstandsoutinbohemianinspirednumberinMadrid.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AAAA7D00000578-0-image-a-4_1453989540851.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421006_Penelope-Cruz-shows-style-credentials-bohemian-inspired-number-sheer-netting-panels-attends-documentary-screening-Madrid_1540253983.html","title":"Penelope Cruz stands out in bohemian-inspired number in Madrid","title_page":"Penelope Cruz stands out in bohemian-inspired number in Madrid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When it comes to putting her best fashionable foot forward, she rarely takes a step in the wrong direction.\nWith Thursday afternoon proving no different, Penelope Cruz looked absolutely incredible as she attended a special screening of a new documentary, entitled Soy Uno Entre Cien Mil, in Madrid.\nThe 41-year-old - who is preparing for at least three movie releases this year - showed off her style credentials in a bohemian-inspired number, which boasted black lace panels and rushed floral pleats.\nScroll down for video\nCentre of attention: Penelope Cruz looked absolutely incredible as she attended a special screening of a new documentary, entitled Soy Uno Entre Cien Mil, in Madrid, on Thursday\nHer eye-catching ensemble also featured a plunging neckline and a clinched waistline, highlighting her fabulous curves and lithe frame perfectly.\nWhen it came to her beauty, Penelope wore her long brunette tresses in voluminous blow-dried waves while enhancing her complexion with bronzed cheeks, smokey eyes and matted lips.\nShe glammed up her look even further with a silver statement watch, a pair of delicate stud earrings and black leather boots.\nPreened to perfection: The 41-year-old showed off her style credentials in a bohemian-inspired number, which boasted black lace panels and rushed floral pleats\nAttention to detail: When it came to her beauty, Penelope wore her long brunette tresses in voluminous blow-dried waves while enhancing her complexion with bronzed cheeks, smokey eyes and matted lips\nStyle star: Her eye-catching ensemble also featured a plunging neckline and a clinched waistline, highlighting her fabulous curves and lithe frame perfectly\nThe starlet - who is married to fellow actor Javier Bardem – will soon be on the big-screen in films, including The Queen of Spain, The Brother's Grimsby and Zoolander 2.\nThe latter will see Penelope join a slew of additional A-list talent such as Ben Stiller, Kristen Wiig, Will Ferrell, Ben Stiller and more.\nThe Spanish actress is also preparing for the worldwide release of Ma Ma, in which she plays a woman fighting breast cancer.\nPopular: The starlet - who is married to fellow actor Javier Bardem – will soon be on the big-screen in films, including The Queen of Spain, The Brother's Grimsby and Zoolander 2\nNot alone: As she headed to the screening, the actress was surrounded by her entourage\nTalking to radio show, Cadena Ser, last year Penelope revealed that taking on the role was incredibly important to her.\nShe said: 'This is one of the most wonderful characters that I will ever be offered to play. I fell in love with the story of this woman, who is like a goddess, a sage.'\nPenelope plays Magda in the movie, a gutsy unemployed teacher with a young son who faces her cancer diagnosis with optimism and courage.\nThe Hollywood stunner also produced the film, in what is only her second turn as a producer following her debut in 2012 movie Twice Born.\nMeanwhile... The Spanish actress is also preparing for the worldwide release of Ma Ma, in which she plays a woman fighting breast cancer","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421006/Penelope-Cruz-shows-style-credentials-bohemian-inspired-number-sheer-netting-panels-attends-documentary-screening-Madrid.html"}
