{"authors":[],"date_download":"2018-10-30 20:33:32","date_modify":"2018-10-30 20:33:32","date_publish":"2015-11-06 20:16:38","description":"A Pennsylvania inmate has been charged in the rapes and slayings of a mother and daughter in Cobb County nearly 30 years ago, authorities announced Friday.","filename":"data/vaneerConsumption/Pennsylvaniainmatechargedin86rapekillingofCobbmom.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/06/Videos/4600333189001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_pennsylvania-inm_59f8af1e8ff7dd954a4d97461a6bbb1f__1540931612.html","title":"Pennsylvania inmate charged in ‘86 rape, killing of Cobb mom,...","title_page":"Pennsylvania inmate charged in ‘86 rape, killing of Cobb mom,...","title_rss":"NULL","source_domain":"ajc.com","text":"A Pennsylvania inmate has been charged in the rapes and slayings of a mother and daughter in Cobb County nearly 30 years ago, authorities announced Friday.\nRonald E. Lyles, now 60, is accused of killing Sharon Brady and her 13-year-old daughter, Samantha, who were found dead in their apartment on Cole Street in Marietta on Sept. 12, 1986.\nThe case was so shocking that then-Gov. Joe Frank Harris announced a $2,000 reward for information leading to an arrest the double-slaying.\nAuthorities used advanced forensic DNA testing to tie Lyles to the murders, Marietta Police Chief Dan Flynn and Cobb County District Attorney Vic Reynolds said in a joint announcement. Lyles lived in the same apartment complex as Brady, 41, and her daughter.\nBrady’s 3-year-old daughter at the time was also in the apartment but was unharmed.\nLyles is currently serving a nine-year prison term for aggravated assault in Pennsylvania. He is in the process of being extradited to Cobb County to face charges.\nReynolds said lyles was a suspect at the time of the killings, but a case could not be developed then. The prosecutor said he hopes the arrest will bring a degree of closure to the case.\nBrady’s surviving daughter, now in her 30s, has been informed of the developments, Reynolds said.\nWayne Kennedy, a retired Marietta Police Department commander who investigated the case, said it still haunts him.\n“It stayed with me for 30 years,” Kennedy said at a news conference Friday. “It’s a case you’ll never forget.”\nThe case was resurrected after Cobb’s newly-formed Cold Case Unit received a U.S. Justice Department grant that paid for DNA testing of preserved evidence samples from the 1986 crime scene.\nLyles is charged with two counts of murder, two counts of rape, two counts of aggravated assault and one count of burglary in the Brady killings.\nAnyone with information about any unsolved murder or sex crime in Cobb County can provide information anonymously. The Cold Case Unit tipline number is 770-528-3032 and the email is coldcase@cobbcounty.org.","url":"https://www.ajc.com/news/local/pennsylvania-inmate-charged-rape-killing-cobb-mom-daughter/aMUvhqABvRbD7on7lFV1KO/"}
