{"authors":["Associated Press","Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 02:16:00","date_modify":"2018-10-23 02:16:00","date_publish":"2016-01-29 16:36:12","description":"A Pennsylvania couple was robbed at gunpoint and bound with duct tape, and their house was set ablaze. Now their adult daughter is missing, too.","filename":"data/vaneerConsumption/Pennsylvaniacouplerobbedatgunpointhomesetablazedaughtermissing.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4FA2F00000578-0-image-a-72_1454096266724.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422935_Couple-robbed-gunpoint-bound-tape-daughter-missing_1540260960.html","title":"Pennsylvania couple robbed at gunpoint, home set ablaze; daughter missing","title_page":"Pennsylvania couple robbed at gunpoint, home set ablaze; daughter missing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Pennsylvania couple was robbed at gunpoint and bound with duct tape, and their house was set ablaze. Now their adult daughter is missing, too.\nBrian Vroman and Michael Houseweart, of Canton, are accused of breaking into 71-year-old Gary and 66-year-old Linda Inch's home early Wednesday near Montoursville, about 90 miles north of Harrisburg.\nThe two 27 year olds were arraigned Thursday morning on 43 charges including attempted homicide and arson.\nScroll down for video\nMichael Houseweart and Brian Vroman, both 27, were arrested Wednesday after allegedly breaking into Houseweart's girlfriend's parents home to rob the couple and set their home on fire\nGary and Linda Inch were woken up by two men in ski masks before 3am on Wednesday. Linda, 66, was able to escape the burning house and get firemen to help rescue her husband, 71\nFirefighters were able to quickly put out the blaze, but it's estimated that the house sustained about $200,000 in heat and water damage\nPolice in Lycoming County say they are concerned about the couple's 33-year-old daughter, Michelle, who had a relationship with Houseweart and hasn't been seen since Tuesday.\nPolice are now looking for the couple's daughter, Michelle Inch, who has been missing since Tuesday. The 33 year old had been in a relationship with Houseweart\nHer car was found abandoned by a set of train tracks on Thursday in Canton, and calls to her cellphone aren't going through. Police say she had been staying with her parents when she went missing.\nHouseweart's brother-in-law told police that before the robbery, he complained about his girlfriend exchanging messages with an ex-boyfriend over Facebook, and remarked that he felt like burning someone's house down.\nThe day before the incident, both the Inches and their daughter reported about checks being stolen, according to WNEP. Those checks were later written out and cashed by Houseweart in Canton.\nLinda Inch says she and her husband were woken up early Wednesday morning before 3am by two men wearing ski masks and armed with a rifle.\nAfter being bound with the duct tape, she says the two men started wandering around the house collecting valuable items including a flat-screen TV, $116 in cash, a poker set and two cellphones.\nThey then doused the home in gasoline and started a fire in lower level before fleeing the scene.\nPolice say Linda Inch freed herself and ran to neighbors for help. Firefighters broke down the door of the burning house and rescued Gary Inch, who was taken to the hospital for smoke inhalation. He was reported as being in a serious condition on Thursday at LeHigh Valley Hospital Center in Allentown.\nAccording to court documents, both suspects were captured on surveillance just 90 minutes before the home invasion buying duct tape and gloves at a Walmart in Montoursville. Police added that they believe Houseweart was planning to flee to Florida.\nHosueweart's brother-in-law told police that he complained about Michelle's conversations on Facebook with an ex-boyfriend. The woman's car was found abandoned by a set of railroad tracks in Canton after the fire\nOn Thursday, police executed search warrants on Houseweart's home and Vroman's car, finding ski masks and a poker set matching the description of items used and stolen in the robbery\nWhen police executed search warrants on Houseweart's home and Vroman's car on Thursday, they found ski masks and a poker set matching the description of those used and stolen in the invasion.\nAnyone with information on missing Michelle Inch's whereabouts is being asked to call police at 570-368-5700.\nAccording to Penn Live, Houseweart was not married, had two children and was self-employed at his own construction business. His criminal record includes an arrest for unlawful use of a computer.\nVroman was single, living with his parents and working a job delivering newspapers. He was convicted in 2010 on a charge of resisting arrest.","url":"https://www.dailymail.co.uk/news/article-3422935/Couple-robbed-gunpoint-bound-tape-daughter-missing.html"}
