{"authors":["Izzy Ferris For The Daily Mail"],"date_download":"2018-10-23 02:37:58","date_modify":"2018-10-23 02:37:58","date_publish":"2016-01-29 17:13:15","description":"The 44-year-old model said she had recently found herself becoming ‘some sort of strange devil,’ but felt she was a ‘bit young’ to be going through the menopause.","filename":"data/vaneerConsumption/PennyLancasterwearsaredBRACELETonherperiod.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4448E00000578-0-image-a-29_1454087506988.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3423098_Penny-Lancaster-makes-toe-curling-confession-lets-husband-Rod-Stewart-know-s-period-wearing-red-BRACELET_1540262278.html","title":"Penny Lancaster wears a red BRACELET on her period","title_page":"Penny Lancaster wears a red BRACELET on her period | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most women will confess to being a little more difficult to deal with at certain points of the month.\nBut Penny Lancaster has admitted she has a novel way of letting her husband know she is on her period – by wearing a red bracelet.\nThe 44-year-old model said she had recently found herself becoming 'some sort of strange devil,' but felt she was a 'bit young' to be going through the menopause.\nInstead, the mother-of-two puts it down to Premenstrual Syndrome (PMS), which she claims 'can get more extreme,' with age.\nSpeaking on This Morning, Penny Lancaster admitted she has a novel way of letting her husband know she is on her period - by wearing a red bracelet\nIn a bid to prevent her rock star husband, Rod Stewart, 71, from bothering her while she is on her period, Miss Lancaster admits tying a 'little bit' of red cotton around her wrist.\nSpeaking on ITV's Loose Women, she explained: 'If I say to my husband 'look, I know there's a lot of decisions to be made, we've just moved house and there's a lot of things going on, but don't ask me right now because I've got my period,' two hours later he'll come to me 'look darling about that thing, I don't agree'.'\nShe said she will then hold up her wrist, showing Stewart the cotton band and pointing to it.\n'You go like that so you don't have to keep explaining it,' she added.\nShe joked that the simple red band 'warns the men that it's that time of the month'.\nWhen asked how she had come up with the idea she said: 'It was just like 'how can I raise that red flag, emergency emergency'.'\nDiscussing the menopause with her fellow panellists, Miss Lancaster said that in the past few months she had found herself acting out of character.\nIn a bid to prevent her rock star husband, Rod Stewart, 71, right, from bothering her while she is on her period, Miss Lancaster admits tying a 'little bit' of red cotton around her wrist\nWhen asked how she had come up with the idea she said: 'It was just like 'how can I raise that red flag, emergency emergency''\nSpeaking on ITV's Loose Women, she explained: 'If I say to my husband 'look, I know there's a lot of decisions to be made, we've just moved house and there's a lot of things going on, but don't ask me right now because I've got my period,' two hours later he'll come to me 'look darling about that thing, I don't agree'\nShe told them: 'In general I'm a very easy-going person and I like to keep the boat afloat, make sure everyone is happy and organised.\n'But the last six months, I've been having the odd little time where when I've asked the kids twice to do something and they haven't listened I've had to go 'will you listen to me, mummy's talking,' and I've thought 'where did that come from?'.\n'It's like I've been taken over by some sort of strange devil and it's very uncharacteristic of myself.'\nShe said that she didn't know if she had been 'overthinking' her symptoms but said she had thought about going to the doctor for blood tests, despite being a 'bit young' for the menopause.\nShe added: 'It could be perimenopausal but also the PMS can get more extreme, the side-effects.'\nDiscussing the impact of the menopause on marriages, Miss Lancaster said she was lucky that her and her husband spent enough time together to be open and honest with one another about problems they were experiencing.\nBut she admitted that if this was not the case she would happily attend counselling alongside Stewart to help them both deal with the effects of the menopause.","url":"https://www.dailymail.co.uk/femail/article-3423098/Penny-Lancaster-makes-toe-curling-confession-lets-husband-Rod-Stewart-know-s-period-wearing-red-BRACELET.html"}
