{"authors":["Emma Cueto"],"date_download":"2018-10-30 22:46:28","date_modify":"2018-10-30 22:46:28","date_publish":"2014-08-14 18:56:50","description":"No matter what kind of wedding you're having — whether it be big, small, religious, secular, whatever — every bride deserves to feel beautiful. Which can become difficult if your local bridal shop refuses to let you buy a dress. But that's exactly…","filename":"data/vaneerConsumption/PennsylvaniasWWBridalBoutiqueTurnsAwayASameSexCoupleLookingForGowns.json","image_url":"https://imgix.bustle.com/rehost/2016/11/10/94ad3ca5-80fb-4d4c-bc2e-76c3c230e589.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35797-pennsylvanias-ww-bridal-boutique-turns-away-a-same-sex-couple-looking-for-gowns_1540939588.html","title":"Pennsylvania's W.W. Bridal Boutique Turns Away A Same-Sex Couple Looking For Gowns","title_page":"Pennsylvania's W.W. Bridal Boutique Turns Away A Same-Sex Couple Looking For Gowns","title_rss":"NULL","source_domain":"bustle.com","text":"No matter what kind of wedding you're having — whether it be big, small, religious, secular, whatever — every bride deserves to feel beautiful. Which can become difficult if your local bridal shop refuses to let you buy a dress. But that's exactly what happened to one young couple in Pennsylvania when they were turned away from Bloomsburg's W.W. Bridal Boutique after the store learned they were having a same-sex wedding.\nThe couple, who prefer not to use their names, posted on Facebook that after trying to schedule an appointment at the boutique, the store told them that W.W. Bridal Boutique \"would not be able to schedule an appointment for us because they currently do not service same sex couples and it’s just not something they do.\" Even worse, this type of discrimination is apparently legal — although Pennsylvania is one of the states that currently allows gay marriage, there is no law that prohibits discrimination based on a person's sexual orientation.\nThe bridal shop owners told local press, “We feel we have to answer to God for what we do. And providing those two girls dresses for a sanctified marriage would break God’s law.”\nSo that's delightful. It's not nearly as bad as that time when a pastor canceled a funeral for a gay man, but it still taps into the same problem: people using their religiously based opposition to gay marriage as grounds for discrimination against gay people.\nWhile I do understand people having their own interpretations of the Bible, nowhere in Scripture does it say that conducting a business transaction with gay people is a sin, or that God forbids anyone to assist gay people in getting married. After all, 18 percent of married women cheat on their spouses, which is the Bible also says is a sin. Is God going to get upset you sold those women a wedding dress, too? Because theologically, the same logic applies.\nIn other words: Maybe you believe gay marriage is a sin. Sure, fine, whatever. Can you believe it quietly without being awful to your fellow humans? Seriously.\nThe bridal boutique in question has, naturally, been getting a lot of negative attention and some retaliatory online reveiws, but they don't seem inclined to change their position any time soon. Not that the happy couple would probably want to spend their money there at this point anyway.\nThe Bloomberg city council is planning a meeting for next week to discuss ways they might prevent such discrimination from happening in the future.\nMeanwhile, let's hope that the happy couple at the heart of all this finds a much less bigoted place to shop for wedding gowns, and that they both get the wedding of their dreams in dresses that make them feel gorgeous.","url":"https://www.bustle.com/articles/35797-pennsylvanias-ww-bridal-boutique-turns-away-a-same-sex-couple-looking-for-gowns"}
