{"authors":["Lydia Willgress For Mailonline"],"date_download":"2018-10-23 01:41:38","date_modify":"2018-10-23 01:41:38","date_publish":"2016-01-29 15:41:57","description":"The motorist was driving on the Pennsylvania Turnpike near Pittsburgh on Tuesday when his lorry plunged into a gully at the side of the road. Images show him being pulled from the big rig by a group.","filename":"data/vaneerConsumption/PennsylvaniaTurnpikestrangersformahumanchaintosavedriverslife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B2FAA500000578-0-image-a-94_1454081984676.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422923_Eight-strangers-form-human-chain-pull-driver-smoking-big-rig-overturned-icy-Pennsylvania-road_1540258898.html","title":"Pennsylvania Turnpike strangers form a human chain to save driver's life","title_page":"Pennsylvania Turnpike strangers form a human chain to save driver's life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Driver was injured but is not in a serious condition and thanked the group\nHelpers said they were forced to negotiate diesel and a smoking engine\nA truck driver survived a crash after a group of strangers formed a human chain in the snow and pulled him from his destroyed vehicle.\nThe motorist was driving on the Pennsylvania Turnpike near Pittsburgh on Tuesday when his lorry plunged into a gully at the side of the road.\nPhotographs showed eight people pulling the driver, who has not been named, up the icy bank moments after the crash.\nA truck driver survived a crash after a group of strangers formed a 'human chain' in the snow and pulled him from his destroyed vehicle\nHelpers said they were forced to negotiate puddles of diesel and the lorry's smoking engine.\nThe truck driver was injured but he is not thought to be in a serious condition.\nWitness Arlyn Satanek pulled up in his vehicle and was initially concerned about making sure other people were safe from arriving traffic.\nThe 39-year-old told MailOnline he made his way to the truck after seeing people run towards it\nHe said: 'I remember thinking: \"There's a driver in that truck and I don't know if he's dead or alive, so I need to get down there and help too\".\n'I got out of my truck and began walking toward the demolished rig. It struck me how dangerous the scene was for everyone who was trying to help.\nThe motorist was driving on the Pennsylvania Turnpike near Pittsburgh on Tuesday when his lorry plunged into a gully at the side of the road\nA wider shot shows the severity of the crash, which left diesel and debris all over the snow-covered road\n'It was a tough task [to get the driver out] because the hillside was covered in debris... broken trees and chunks of metal.\n'Me and two other guys were down the hill with the driver helping him walk. As we were making little progress getting him to the top of the hill, I then looked up to the top of the hillside and noticed that a human chain was forming.\n'I didn't hear anyone say a word like, \"hey I have a plan, let's link together and pull the driver up\". In fact, it seemed spontaneous, natural, and instinctive.'\nMr Satanek, from Uniontown, Pennsylvania, said the driver, whose clothes were left shredded, was tended to by rescue crews following the crash and has since thanked the group.","url":"https://www.dailymail.co.uk/news/article-3422923/Eight-strangers-form-human-chain-pull-driver-smoking-big-rig-overturned-icy-Pennsylvania-road.html"}
