{"authors":["Hannah Al-Othman For Mailoline"],"date_download":"2018-10-23 05:36:59","date_modify":"2018-10-23 05:36:59","date_publish":"2017-03-16 16:26:10","description":"The Joint Service Provider acknowledged that workers would be watching the tournament at work, but warned that engineers would be 'closely monitoring bandwidth consumption'.","filename":"data/vaneerConsumption/PentagontellsstaffnottowatchMarchMadnessgames.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E558C5100000578-0-image-a-11_1489681471523.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320878_Pentagon-tells-staff-not-watch-March-Madness-games_1540273019.html","title":"Pentagon tells staff not to watch March Madness games","title_page":"Pentagon tells staff not to watch March Madness games | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Defense Department has cautioned its staff not to stream March Madness games on Pentagon computers, warning that the network could be overwhelmed.\n'March Madness is officially upon us,' the Joint Service Provider (JSP), which handles IT services for the Pentagon, said in the email.\nThe unclassified communication was sent to employees at the Department of Defense, and later obtained by CBS News.\nThe Defense Department has cautioned its staff not to stream March Madness games on Pentagon computers\nThe JSP acknowledged that staff would be watching the tournament at work, but warned that engineers would be 'closely monitoring bandwidth consumption'.\n'Your JSP support team acknowledges and appreciates that college basketball fans within the DoD are excited to cheer on their favorite teams, update brackets, and otherwise obsess over the Big Dance', the email continues.\n'In preparation for the event, JSP engineers will closely monitor bandwidth consumption and server availability to handle additional network strain as best as they can.\n'However, it is important to remember that we share a single network and visiting non-mission essential websites degrades network performance for everyone.'\nThe 64-team tournament gets underway on Thursday and will run until early April\nA Pentagon official confirmed that the email was authentic.\nThe email warned that watching sports could compromise the Pentagon's operations.\n'Please keep in mind; if you're streaming video to watch your favorite player shooting free throws, you're consuming network resources that could be served to support the Warfighter,' the email said.\nThe 64-team tournament gets underway on Thursday and will run until early April.","url":"https://www.dailymail.co.uk/news/article-4320878/Pentagon-tells-staff-not-watch-March-Madness-games.html"}
