{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:32:10","date_modify":"2018-10-30 20:32:10","date_publish":"2016-07-26 00:24:28","description":"Complaints from journalists have prompted the Pentagon to remove a Law of War clause that suggests journalists may be considered combatants.","filename":"data/vaneerConsumption/PentagonRevisesLawofWarManualtoforSuggestionJournalistsAreCombatants.json","image_url":"https://media.breitbart.com/media/2016/04/us-troops-in-iraq-file-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_25__1540931530.html","title":"Pentagon Revises Law of War Manual to for Suggestion Journalists Are Combatants","title_page":"Pentagon Revises Law of War Manual to for Suggestion Journalists Are Combatants","title_rss":"NULL","source_domain":"breitbart.com","text":"Complaints from news organizations have prompted the Pentagon to remove a Law of War manual clause that suggests journalists could be considered combatants.\nNews outlets “argued the rules would endanger media workers,” reports the Washington Post (WaPo).\nIn a statement released Friday, U.S. Department of Defense (DoD) General Counsel Jennifer O’Connor said:\nAfter the manual’s release last year, DoD lawyers heard concerns brought forward by media organizations and engaged in a productive, thoughtful dialogue with journalists that helped us improve the manual and communicate more clearly the department’s support for the protection of journalists under the law of war. The department’s mission is to defend the very freedoms that journalists exercise. We have learned a lot during this process, and the department and the manual are better off for the experience.\nPrior to the changes, the current version of the Pentagon’s Law of War manual released in June 2015, which provides guidelines for DOD personnel and members of the U.S. military, stated that journalists are generally seen as civilians.\nHowever, it added that journalists may also be considered “members of the armed forces, persons authorized to accompany the armed forces, or unprivileged belligerents.”\nThe Post notes:\nThat assertion prompted concern from an array of media groups, including The Washington Post, which held discussions with Pentagon officials to explain their objections. The suggestion was seen as increasing danger faced by journalists who are already putting themselves at risk as they cover conflicts, either independently or embedded with military forces. [An] “unprivileged belligerent” might be detained without charges or trial, as are the prisoners at Guantanamo Bay. Following the 2003 invasion of Iraq, the U.S. military detained journalists and held them for long periods without charge.\nPentagon officials updated some sections of the 2015 manual in response to the concerns expressed by the media groups.\nThe revised section states that “in general, journalists are civilians and are protected as such under the law of war.”\nWaPo explains:\nAt the same time, the revised version retains some ability for U.S. military to alter its treatment of media personnel based on their actions. “Civilian journalists and journalists authorized to accompany the armed forces should not take any action adversely affecting their status as civilians if they wish to retain protection as a civilian,” the manual said. That would include, the manual said, publicizing information intended to produce an artillery attack on an enemy target.\nIn the DoD statement announcing the changes to the manual, Pentagon Press Secretary Peter Cook, who helped to broker engagement with media groups, said:\nThe Department of Defense is a learning institution. We appreciate the willingness of journalists to constructively share their concerns with the department’s lawyers. The changes to the manual reflect the department’s concerted effort to address those concerns and clarify specific language.\nThe updated guidelines were well received by the Committee to Protect Journalists (CPJ), which advocates for media rights.\n“This affirmation of journalists’ right to report armed conflicts freely and from all sides is especially welcome at a time when governments, militias, and insurgent forces around the world are routinely flouting the laws of war,” Frank Smyth, a senior adviser at CPJ, declared in a statement.","url":"https://www.breitbart.com/national-security/2016/07/25/pentagon-removes-law-war-manual-clause-suggesting-journalists-combatants/"}
