{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:34:49","date_modify":"2018-10-30 20:34:49","date_publish":"2016-05-05 00:56:24","description":"The U.S.-backed Kurdish Democratic Union Party (PYD) is aligned with the Kurdistan Workers Party (PKK), Ashton Carter told a Senate panel.","filename":"data/vaneerConsumption/PentagonChiefUSBackedSyrianKurdsAlignedwithTerrorGroupPKK.json","image_url":"https://media.breitbart.com/media/2016/05/pkk-supporter-rally-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_0_ab86c7b6f56b2272301accbd43691970__1540931689.html","title":"Pentagon Chief: U.S.-Backed Syrian Kurds Aligned with Terror Group PKK","title_page":"Pentagon Chief: U.S.-Backed Syrian Kurds Aligned with Terror Group PKK | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S.-backed Kurdish Democratic Union Party (PYD) in northern Syria is aligned with the Kurdistan Workers Party (PKK), a terrorist organization, Secretary of Defense Ashton Carter told a Senate panel, echoing Turkey’s position on the relationship between the two groups.\nHowever, hours later, the U.S. Department of State reiterated that the Obama administration does not consider the PYD or its armed wing, the People’s Protection Units (YPG), to be terrorist organizations.\nTurkish President Recep Tayyip Erdoğan lambasted the Obama administration for making “contradictory statements” on the Syrian Kurds, reports Daily Sabah, a pro-government publication in Turkey.\n“Yes,” replied Secretary Carter when Sen. Lindsey Graham (R-SC) asked whether he believed the Syrian Kurds are “aligned or at least have substantial ties to the PKK.”\nCarter noted that the PKK has been deemed a terrorist group by Turkey and the United States. He also acknowledged that it is “not at all” surprising that Turkey is “upset” with the United States for providing military assistance to the Syrian Kurds, adding that the Obama administration has “extensive consultations” with the Turks over the issue.\n“I just got back from Turkey. They’re not okay with this. They think this is the dumbest idea in the world, and I agree with them,” declared Graham. “So if you’re wondering why Turkey is a little upset, we’re arming people inside of Syria aligned with a terrorist group that’s fighting the Turkish government,” he later added.\nBreitbart News asked the Pentagon whether it considers the PYD and YPG groups to be terrorists by association given that Carter believes the two groups are aligned with the PKK.\n“As we have said in the past, the PKK is a designated foreign terrorist organization, and we stand with our NATO ally Turkey and condemn attacks by any terrorist against Turkey, including attacks by both [the Islamic State] ISIL and the PKK in the past few days,” responded U.S. Maj. Adrian Rankine-Galloway, a Pentagon spokesman.\nTurkey has maintained that both the PYD and YPG are the communist separatist PKK’s Syrian offshoots.\nIn February, Turkish President Recep Tayyip Erdoğan accused the YPG of carrying out a terrorist attack in Ankara that killed 28 people, adding at the time that he was planning to share his thoughts on the matter with President Obama.\nOn April 28, hours after Carter’s testimony, a reporter asked State Department spokesman John Kirby about the “mixed messages” the Obama administration is sending regarding the three Kurdish groups: PYD, YPG, and PKK.\nDuring a press briefing, Kirby fielded a few questions dealing with Carter’s exchange with Sen. Graham earlier that day.\nThe reporter stressed, “So can you say, again, that the YPG is not linked to the PKK?”\nKirby did not address the question directly, saying, “YPG’s not a designated foreign terrorist organization. PKK is. Nothing’s changed about that.”\nDaily Sabah reports that Erdoğan voiced frustration over the the Obama administration’s “puzzling stance on the PKK’s Syrian affiliates,” namely the PYD and the YPG.\nThe Turkish news outlet adds:\nCommenting on American officials’ indecisive statements in Istanbul on Saturday, President Recep Tayyip Erdoğan accused the U.S. of double standards on terrorism. The PKK is recognized as a terrorist organization, while its Syrian affiliates receive both political and military support from Turkey’s NATO ally. Erdoğan also stressed that U.S. officials say one thing at bilateral meetings and appear to say another at other times.\nTurkey “could do more” to assist the U.S.-led coalition fight against the Islamic State (ISIS/ISIL), conceded Sen. Graham during the Senate Armed Services Committee hearing on April 28.\nU.S. NATO ally Turkey is part of the anti-ISIS alliance. However, the country is threatened by steps the PYD-led Syrian Kurds taking towards autonomy.\nTurkey, which is reportedly facing an increase in PKK-linked terrorist attacks, is alarmed that changes among the Kurdish population in neighboring Syria could fuel separatism among Turkish Kurds.","url":"https://www.breitbart.com/national-security/2016/05/04/pentagon-chief-syrian-kurds-aligned-terror-group-pkk/amp/"}
