{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:32:24","date_modify":"2018-10-30 20:32:24","date_publish":"2016-01-28 14:56:43","description":"Department of Defense (DOD) experts will support the Department of Health and Human Services (HHS) in its fight against the mosquito-borne Zika virus in the Americas.","filename":"data/vaneerConsumption/PentagonTakesRoleinCombatingZikaVirusintheAmericas.json","image_url":"https://media.breitbart.com/media/2016/01/GettyImages-95894036.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_28__1540931544.html","title":"Pentagon Takes Role in Combating Zika Virus in the Americas","title_page":"Pentagon Takes Role in Combating Zika Virus in the Americas","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — Department of Defense (DOD) experts will support the Department of Health and Human Services (HHS) in its fight against the mosquito-borne Zika virus in the Americas, Pentagon press secretary Peter Cook told reporters.\nOn the heels of Cook’s comments, General Dr. Margaret Chan, director of the World Health Organization (WHO), warned that the virus, which has been linked to a wave of birth defects in Latin America, “is now spreading explosively” in “23 countries and territories” across the Americas, noting that “the level of alarm is extremely high” during a press briefing Thursday.\nDr Chan: Last year, [#ZikaVirus] was detected in the Americas, where it is now spreading explosively #Zika #EB138 — WHO (@WHO) January 28, 2016\nDr Chan: As of today, [#Zika] cases have been reported in 23 countries and territories in the region #ZikaVirus #EB138 — WHO (@WHO) January 28, 2016\nOn Wednesday, Pentagon press secretary Peter Cook told reporters that the Pentagon has been asked to assist HHS in assembling experts and stakeholders, particularly in the area of research.\n“My understanding is we’ve been asked – and, again, the deputy secretary was at the White House yesterday – we’ve been asked to support Health and Human Services in their efforts to convene experts and stakeholders, specifically in the research area,” the DOD press secretary told reporters Wednesday.\n“This is an area where the DOD has done some research in the past, and I think some of that expertise will be brought to this effort, and we’ll be supporting HHS in whatever way we can,” added Cook.\nAsked whether the Pentagon’s participation in the fight would resemble the U.S. military’s role in containing the Ebola virus in Africa, the press secretary responded, “I don’t think anyone is talking about that kind of role at this particular time. So this is a support role, again, sharing our research knowledge as much as anything else, with the folks at HHS.”\nPresident Obama, along with public health and national security officials, convened in the White House Situation Room Tuesday to discuss battle plans to protect Americans and prevent the spread of the disease in the U.S.\nDeputy Defense Secretary Bob Work, the No. 2 at the Pentagon, as well as leaders from HHS, CDC, and the National Institutes of Health (NIH) participated in the White House meeting.\nDue to its alarming link to a neurological disorder known as microcephaly, which makes it especially dangerous for pregnant women and their babies, the Zika virus has raised concerns in the Americas.\nIn Brazil, where the first confirmed infection was detected, the disease has been linked to a skyrocketing number of cases of microcephaly, a rare birth defect in which babies are born with smaller heads than normal and often have developmental problems.\nThere is no vaccine or preventing drug to combat the virus, notes U.S. Centers for Disease Control and Prevention (CDC).\nAlthough the disease has not reached the continental United States, save through travelers to affected areas, it has been detected in Puerto Rico, a U.S. territory, CDC points out.\nNevertheless, the CDC warns:\nWith the recent outbreaks in the Americas, the number of Zika virus disease cases among travelers visiting or returning to the United States likely will increase. These imported cases may result in local spread of the virus in some areas of the continental United States, meaning these imported cases may result in human-to-mosquito-to-human spread of the virus.\nIn May 2015, the first local transmission of Zika was identified in Brazil.\n“Local transmission means that mosquitoes in Mexico have been infected with Zika virus, spreading it to people,” explains CDC.\nBy the middle of this month, local transmission had spread to at least 14 countries or territories in the Americas, including to United States southern neighbor Mexico.\n“Further spread to other countries in the region is likely,” adds CDC. “Local transmission of Zika virus has not been documented in the continental United States. However, Zika virus infections have been reported in travelers returning to the United States.”\nBoth legal and illegal travelers to the U.S. from countries where mosquitos carry the virus could potentially bring the disease to this country.\nCDC has issued a travel alert for people traveling to territories and countries where the Zika virus is active: Brazil, Colombia, El Salvador, French Guiana, Guatemala, Haiti, Honduras, Martinique, Mexico, Panama, Paraguay, Suriname, Venezuela and Puerto Rico.\n“Zika virus is spread to people through mosquito bites. The most common symptoms of Zika virus disease are fever, rash, joint pain, and conjunctivitis (red eyes),” explains CDC. “The illness is usually mild with symptoms lasting from several days to a week. Severe disease requiring hospitalization is uncommon.”","url":"https://www.breitbart.com/national-security/2016/01/28/pentagon-to-assist-hhs-in-combating-zika-virus-in-the-americas/"}
