{"authors":[],"date_download":"2018-10-22 20:35:01","date_modify":"2018-10-22 20:35:01","date_publish":"2016-01-28 01:55:44","description":"The Pentagon on Wednesday said it had selected Lieutenant General John \"Mick\" Nicholson to lead international forces in Afghanistan, amid a fraught security ...","filename":"data/vaneerConsumption/PentagonannouncespickforUScommanderinAfghanistan.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g55o-4vVdYopwYQ7f641721b07a74baf5-556_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420277_Pentagon-announces-pick-US-commander-Afghanistan_1540240501.html","title":"Pentagon announces pick for US commander in Afghanistan","title_page":"Pentagon announces pick for US commander in Afghanistan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pentagon announces pick for US commander in Afghanistan\nThe Pentagon on Wednesday said it had selected Lieutenant General John \"Mick\" Nicholson to lead international forces in Afghanistan, amid a fraught security situation in the war-torn nation.\nNicholson would replace General John Campbell, who has been in the role for 18 months. He still needs to be confirmed for the position by the US Senate.\n\"He knows what it means to lead a responsive and nimble force, and how to build the capacity of our partners to respond to immediate and long-term threats and remain adaptable to confront evolving challenges,\" Defense Secretary Ashton Carter said in a statement.\nJust over a year ago the US and NATO-led mission in Afghanistan transitioned into an Afghan operation, with allied nations assisting in training local forces to tackle the Taliban ©Wakil Kohsar (AFP)\nJust over one year ago, the US and NATO-led mission in Afghanistan transitioned into an Afghan operation, with allied nations assisting in training and equipping local forces to tackle Taliban and other groups.\nSince then, the Taliban have dealt some stinging blows to Afghan forces, including a short-lived takeover of the northern city of Kunduz.\nFurther complicating the fragile security situation is the emergence of Islamic State jihadists in parts of the country. They are trying to establish a base in Nangarhar province in eastern Afghanistan, near the Pakistan border.","url":"https://www.dailymail.co.uk/wires/afp/article-3420277/Pentagon-announces-pick-US-commander-Afghanistan.html"}
