{"authors":["Ezra Dulis"],"date_download":"2018-10-30 18:46:30","date_modify":"2018-10-30 18:46:30","date_publish":"2014-12-27 09:19:38","description":"According to People, the two celebs performed the \"hands up, don't shoot\" sign from protests over the death of Ferguson teen Michael Brown.","filename":"data/vaneerConsumption/PeopleMagBeyoncJayZShareHandsUpDontShootPhotofromLavishIcelandVacation.json","image_url":"https://media.breitbart.com/media/2014/12/beyonce-jay-z-snowmobiles.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2014_12_27__1540925190.html","title":"People Mag: Beyoncé, Jay Z Share 'Hands Up Don't Shoot' Photo from Lavish Iceland Vacation","title_page":"People Mag: Beyoncé, Jay Z Share 'Hands Up Don't Shoot' Photo from Lavish Iceland Vacation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Something odd may have happened on Beyoncé and Jay Z’s latest vacation. It’s nothing new for the power couple to take extravagant trips, but according to People magazine, photos from the luxurious week might show the two taking a moment to get political.\nAccording to author Tamara Fowler, the two chart toppers performed the “hands up, don’t shoot” gesture popularized in protests over the death of Ferguson teenager Michael Brown as they celebrated Jay Z’s 45th birthday in Iceland.\nThe couple celebrated with champagne in the snow and a helicopter ride. According to the local news outlets, the pair stayed at Iceland’s ritzy The Trophy Lodge, which is billed as a “private luxury resort and spa” that is “fit for a king.” Bey posted even more photos on her website, showing the pair relaxing in the famous Blue Lagoon geothermal spa and participating in a little social activism by posing in the “Hands Up, Don’t Shoot” gesture from the Ferguson protests.\nThis appears to be the photo in question:\nIn context to the other photos shared from the trip, this seems just as likely an exercise in mere thrill-seeking as a political statement.\nAnother photo shared to Instagram the same day shows the couple raising their hands and signing the logo of Jay Z’s record label Roc-a-Fella, as they often do. Self-promoting context aside, the photo is not included in the People article or the spread at Beyoncé’s website.\nA photo posted by Beyoncé (@beyonce) on Dec 12, 2014 at 8:06pm PST\nGranted, the two celebrities aren’t shy about political expression. In 2013, they traveled to Cuba for their fifth wedding anniversary, and Jay Z cut a track attacking the trip’s critics. Beyoncé has spoken up about women’s issues this year, penning an op-ed about “equal pay and equal respect” for both sexes and silhouetting herself against a giant projection of the word “feminist” during her MTV Video Music Awards performance.\nHowever, the context of this particular photo doesn’t seem political at all—and if it is, it’s a terrible idea. The whole concept of the “hands up, don’t shoot,” “black lives matter,” and “I can’t breathe” protests are to illustrate the burden of racial profiling by making life inconvenient and uncomfortable for America’s privileged, middle-class whites. To stuff a nod to that cause in the middle of photos depicting snow-dunked champagne bottles, waterfalls, hot springs, ice sculptures, snowmobiles, and helicopters—that’s entirely self-defeating and tone deaf.\nAn email to Beyoncé’s publicist received no response before the time of this publication.","url":"https://www.breitbart.com/entertainment/2014/12/27/people-mag-beyonce-jay-z-share-hands-up-dont-shoot-photo-from-lavish-iceland-vacation/"}
