{"authors":["Mariella Mosthof"],"date_download":"2018-10-31 01:52:05","date_modify":"2018-10-31 01:52:05","date_publish":"2018-09-13 20:58:08","description":"A recent survey commissioned by Sleepopolis, a mattress review site, and conducted by OnePoll analyzed the behavioral habits of over 2,000 Americans based on whether or not they make the bed in the morning, and the survey bears good news for…","filename":"data/vaneerConsumption/PeopleWhoMakeTheirBedInTheMorningHaveMoreSexANewSurveyFinds.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/690371ee-c839-45f0-af18-82a688f77b64-zaeh_bustle_aug2015-361.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_people-who-make-their-bed-in-the-morning-have-more-sex-a-new-survey-finds-11912548_1540950725.html","title":"People Who Make Their Bed In The Morning Have More Sex, A New Survey Finds","title_page":"People Who Make Their Bed In The Morning Have More Sex, A New Survey Finds","title_rss":"NULL","source_domain":"bustle.com","text":"A recent survey commissioned by Sleepopolis, a mattress review site, and conducted by OnePoll analyzed the behavioral habits of over 2,000 Americans based on whether or not they make the bed in the morning, and the survey bears good news for neat-freak spectral demons: people who make the bed are more likely to believe in ghosts! But also, people who make the bed have more sex, according to the survey, getting it on an average of three times per week, compared with people who don't make the bed and average sex just twice a week.\nIn fact, people read a lot into their partners based on their bed-making habits and the survey actually found pretty predictable lifestyle patterns amongst bed makers and non-bed makers. Forty-two percent of people who make their beds said that having a partner makes them more likely do so, and a third of people said it would be a turn-off if a potential partner didn't make their bed in the morning.\nIt's pretty obvious that things like being a morning person, waking up earlier, and being a generally energetic human with time for things like exercise, eating well, and cooking for pleasure lend themselves to also being a bed maker. But, interestingly, the survey found that both bed makers and non-bed makers get the same (crappy) amount of sleep. Both camps averaged just six and a half hours of sleep a night, but bed makers tend to wake up an average of 16 minutes earlier and without the help of an alarm. They also tend to get in more naps, but non-bed makers nap for longer periods of time when they do manage to get one in. Here's what else you can expect to coincide with your bed making habits.\nYour Film & TV Preferences\nPeople who don't make the bed in the morning are more likely to spend time watching movies and TV, and they gravitate toward comedy. People who do make the bed are more into soothing shows (House Hunters was a big one for this set) and romantic movies.\nYour Peak Hours Of Productivity\nPeople who don't make the bed in the morning are more likely to identify as introverts, be night owls, and hit snooze before waking up, which makes sense if you think about it. You're more likely to get alone time for your productivity at night, and, of course, staying up late encourages a few extra hits of the snooze button in the morning, which leaves less time for making the bed!\nYour Interpersonal Habits\nPeople who don't make the bed in the morning are more likely to have broken a promise while people who do make the bed are more likely to describe themselves as \"high maintenance.\" Probably the anxiety that comes along with feeling high strung is what leads bed makers to put extra pressure on themselves to keep promises, while non-bed makers are a little more forgiving of themselves. Also keeping in line with non-bed makers' tendency toward introversion is the fact that they're less likely to have three or more close friends.\nYour Sleep Disorders\nPeople who make the bed in the morning are more likely to be sleep walkers, but people who don't make the bed are more likely to snore.\nUltimately, whether you're diligent about making the bed in the morning or you don't see the point in it, there's one thing everyone can definitely agree upon: ghosts are real and people who don't make the bed are wrong.","url":"https://www.bustle.com/p/people-who-make-their-bed-in-the-morning-have-more-sex-a-new-survey-finds-11912548"}
