{"authors":["Press Association"],"date_download":"2018-10-23 00:41:05","date_modify":"2018-10-23 00:41:05","date_publish":"2017-03-16 10:13:08","description":"The Spaniard has won 61 of his 100 matches in European competition.","filename":"data/vaneerConsumption/PepGuardiolasChampionsLeaguemanagerialcareerinnumbers.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227631-1489659191-256_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319516_Pep-Guardiola-s-Champions-League-managerial-career-numbers_1540255265.html","title":"Pep Guardiola´s Champions League managerial career in numbers","title_page":"Pep Guardiola´s Champions League managerial career in numbers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pep Guardiola took charge of his 100th European match on Wednesday night and, despite seeing his Manchester City exit the Champions League after losing to Monaco, is the most successful coach in UEFA club competition at this stage of his career.\nGuardiola: \"We will improve but this competition is so demanding. Sometimes we have to be special and be lucky. Tonight we were not.\" #UCL pic.twitter.com/9FHiXsN842 — UEFA Champions League (@ChampionsLeague) March 15, 2017\nThe former Barcelona and Bayern Munich boss has won 61 matches, drawn 23 and lost 16 in bringing up his European milestone, eclipsing the previous best record of Louis van Gaal (61 wins, 22 draws, 17 defeats).\nHere, we look at Guardiola’s Champions League record as a manager in numbers:\n(Sean Dempsey/PA)\n2\nTimes Guardiola has won the tournament (with Barcelona).\n100\nGuardiola’s percentage of advancing from last 16 before this season, winning seven out of seven ties with Barca and Bayern before going on to reach at least the semi-finals on each occasion.\n0\nMatches Guardiola had lost to French opposition before Wednesday night’s 3-1 defeat in Monte Carlo.\nFT | 🔴 3-1 (6-6) 🔵\nCity exit the Champions League on away goals following defeat in Monaco. #monacovcity #mcfc pic.twitter.com/0X0SDIbL0q — Manchester City (@ManCity) March 15, 2017\n1\nNumber of last-16 matches Guardiola had lost before Monaco defeat, out of 15.\n67\nCombined total of goals scored by both teams in the eight last-16 ties involving Guardiola sides (47 goals for; 20 against) – an average of over four goals per game.\n6\nThe amount of goals Monaco scored in the two legs against City is the most a Guardiola side has conceded in any knockout-stage tie in the Champions League.","url":"https://www.dailymail.co.uk/wires/pa/article-4319516/Pep-Guardiola-s-Champions-League-managerial-career-numbers.html"}
