{"authors":["Press Association"],"date_download":"2018-10-23 03:49:37","date_modify":"2018-10-23 03:49:37","date_publish":"2017-04-26 15:29:09","description":"The Spain international was forced off after just 23 minutes of Sunday´s FA Cup semi-final loss to Arsenal.","filename":"data/vaneerConsumption/PepGuardiolasaysDavidSilvaisamajordoubtforManchesterderby.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465763-1493216957-349_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448100_Pep-Guardiola-says-David-Silva-major-doubt-Manchester-derby_1540266577.html","title":"Pep Guardiola says David Silva is a major doubt for Manchester derby","title_page":"Pep Guardiola says David Silva is a major doubt for Manchester derby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester City playmaker David Silva is a major doubt for Thursday’s derby against Manchester United at the Etihad Stadium, manager Pep Guardiola has said.\nThe Spain international was forced off after just 23 minutes of Sunday’s FA Cup semi-final loss to Arsenal with a hamstring injury, having been hit hard by tackle from Gabriel moments earlier.\nStriker Sergio Aguero has a better chance of featuring despite suffering a knock in the same game, while only match-fitness is now holding fellow forward Gabriel Jesus back.\nGuardiola has been speaking about the Manchester derby. Silva is a major doubt #mcfc pic.twitter.com/wtRHtvBJYU — Andy Hampson (@andyhampson) April 26, 2017\nJesus, who scored three goals in four starts after joining the club in January, has been out since breaking a bone in his foot in February.\nGuardiola said: “David Silva is a real, real doubt, I don’t know if he will be ready to play after what happened in the first minutes in the semi-final of the FA Cup.\n“Gabriel has no pain at all, so is ready but has had three months out, so his physical condition is not optimal.\nGuardiola on Jesus: He has no pain at all, so he is ready, but has had three months out #mcfc — Andy Hampson (@andyhampson) April 26, 2017\n“Sergio is much better. Today he makes a short part of the training session, tomorrow we will wait (and see).”\nThe stakes are high in the third Manchester derby meeting of the season, with Champions League qualification points on the line.\nCity, fourth in the Premier League, are just a point ahead of their arch-rivals, who have not lost in the competition since October, in a tight battle.\n#PEP: They are good. Good rival, good quality and a long run in the Premier League without defeat. #cityvutd — Manchester City (@ManCity) April 26, 2017\nGuardiola said: “They are good, good rivals, good quality, in good form. They’ve had big series without defeat in the Premier League. They have a lot of quality, history. We’re looking forward to the game.”\nThe September derby at Old Trafford was hyped to an extraordinary level for a regular league fixture, with a lot of the attention focusing on the managers.\nGuardiola and opposite number Jose Mourinho have a long-standing and bitter rivalry having clashed repeatedly during their times in charge of Barcelona and Real Madrid respectively.\nBoth have conspicuously avoided fanning any flames since arriving in Manchester last summer, and they have also managed to avoid each other away from their two games.\nPep Guardiola and Jose Mourinho (Martin Rickett/PA)\nAsked if there had been any other occasions when he had seen Mourinho, Guardiola said: “No. We are neighbours, but no. I didn’t find him.”\nHe suggested the relationship between the pair was also, at least, courteous.\nHe said: “When we see each other – ‘hi-hi’.”\nCity have so far beaten only Arsenal of their top-four rivals at home this season, but Guardiola does not think anything should be read into that.\nHe said: “We should analyse game by game what happened. The results are a fact but the way we play every game we should talk about. We have six games left, four at the Etihad, so our qualification for the Champions League depends on our games at home.\n“Psychologically it is not (important). Sometimes you win, sometimes you lose against the good teams, but it is an important three points to qualify for the Champions League. That is the most important thing.”","url":"https://www.dailymail.co.uk/wires/pa/article-4448100/Pep-Guardiola-says-David-Silva-major-doubt-Manchester-derby.html"}
