{"authors":["Jack Gaughan For Mailonline"],"date_download":"2018-10-23 04:13:37","date_modify":"2018-10-23 04:13:37","date_publish":"2017-04-26 15:54:45","description":"Pep Guardiola has told Maurico Pochettino to breathe easy as Manchester City will not pursue interest in Dele Alli. But the Spaniard admits Alli is 'one of the most fantastic players.'","filename":"data/vaneerConsumption/PepGuardiolainsistsManCitydontwantDeleAlli.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F816D6E00000578-0-image-a-57_1493217957997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4448154_Pep-Guardiola-insists-Man-City-don-t-want-Dele-Alli_1540268017.html","title":"Pep Guardiola insists Man City don't want Dele Alli","title_page":"Pep Guardiola insists Man City don't want Dele Alli | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pep Guardiola has told Maurico Pochettino to breathe easy as Manchester City will not pursue interest in Dele Alli.\nFormer Barcelona midfielder Xavi allegedly claimed this week that City would attempt to lure Alli away from Tottenham this summer.\nSpurs would demand an astronomical fee for the midfielder, who Guardiola is a confirmed admirer of.\nDele Alli is not a target for Manchester City, manager Pep Guardiola has confirmed\nGuardiola does want to sign English talent - and has interest in full backs Danny Rose and Kyle Walker - but a move for Alli is not on the cards.\n'Mauricio Pochettino has to stay calm - Dele Alli will be his player next season,' Guardiola told Sky Sports. 'I am pretty sure about that. We don't want him.\n'He is a fantastic player, good, new, English footballer. He's a fighter. He's good. He's someone who attacks the box and is one of the most fantastic players I have ever seen in my life.\n'But Manchester City doesn't want Dele Alli.'\nGuardiola has reassured Tottenham boss Mauricio Pochettino that he doesn't want to sign Alli\nPochettino reacted furiously to comments attributed to Xavi, who he regards as an ‘enemy’ given his history with Espanyol.\n‘He's in a period when he loves to talk, he's in Doha and listen, he was Barcelona player, he's my enemy,’ the Argentine said.\n‘He tried to destroy our focus to win because he hates me because he's Barcelona - player, fans, you know.\n‘I know him very well, I played against him a lot and when I was a manager (at Espanyol).’\nSportsMail has been told by sources close to Xavi that the quotes attributed to him regarding Dele Alli are fabricated. Spokesman Fernando Solanas said: ‘Xavi didn’t give any interview about Dele Alli.\n'He thinks he is a great player but he has not spoken to Guardiola about him and even if he had would not have made their conversation public.’","url":"https://www.dailymail.co.uk/sport/football/article-4448154/Pep-Guardiola-insists-Man-City-don-t-want-Dele-Alli.html"}
