{"authors":["Robert Cottingham For Mailonline"],"date_download":"2018-10-23 02:23:39","date_modify":"2018-10-23 02:23:39","date_publish":"2017-03-10 11:27:58","description":"Manchester City manager Pep Guardiola has been named the Premier League Manager of the Month for February after three wins in their three matches.","filename":"data/vaneerConsumption/PepGuardiolanamedPremierLeagueManageroftheMonth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E226B9800000578-0-image-a-26_1489145454429.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-4300884_Pep-Guardiola-named-Premier-League-Manager-Month_1540261419.html","title":"Pep Guardiola named Premier League Manager of the Month","title_page":"Pep Guardiola named Premier League Manager of the Month | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pep Guardiola has been named the Premier League Manager of the Month for February after three wins in three matches, but he doesn't exactly appear ecstatic with the award.\nPosing with the gong, Guardiola couldn't muster a smile despite being recognised for his side's performances last month.\nGuardiola could be forgiven for the glum expression however, as his side struggled to a goalless draw at home to Stoke City on Wednesday night.\nManchester City boss Pep Guardiola looking less than delighted with the February award\nManchester City only played three matches in February due to FA Cup and Champions League commitments but emerged with a 100 percent record, scoring eight goals and conceding just once.\nCity beat West Ham 4-0 at the London Stadium, won 2-1 at home to Swansea and beat Bournemouth 2-0 away from home.\nGuardiola celebrates Gabriel Jesus's late winning goal during his side's 2-1 win over Swansea\nThe Spaniard was selected for the award ahead off Chelsea boss Antonio Conte, Manchester United's Jose Mourinho and West Brom's Tony Pulis - whose teams all won twice but drew once in February.\nGuardiola's side currently sit third in the Premier League table, ten points off table-toppers Chelsea and behind second-placed Tottenham only on goal difference.\nCity draw at home to Stoke City was understandably overshadowed by Guardiola's former club Barcelona and their remarkable Champions League last-16 comeback against Paris Saint-Germain the same night.","url":"https://www.dailymail.co.uk/sport/article-4300884/Pep-Guardiola-named-Premier-League-Manager-Month.html"}
