{"authors":["Associated Press","Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-23 04:49:39","date_modify":"2018-10-23 04:49:39","date_publish":"2016-01-29 20:33:58","description":"The opening of the 'Kola House' in Manhattan comes at a time when Americans are cutting back on soda consumption. It will feature cuisine 'inspired by the kola nut'.","filename":"data/vaneerConsumption/PepsiplanstoopenahipsterbarcalledKolaHouseinNewYorkCity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/23/30B5B26500000578-0-image-a-3_1454109183610.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423280_Pepsi-plans-open-hipster-bar-lounge-restaurant-called-Kola-House-New-York-City-make-soda-cool_1540270179.html","title":"Pepsi plans to open a hipster bar called 'Kola House' in New York City","title_page":"Pepsi plans to open a hipster bar called 'Kola House' in New York City | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PepsiCo's quest to make soda edgy has brought it to New York City.\nThere, it will open its own restaurant with cuisine 'inspired by the exploration of the kola nut'.\nThe opening of the 'Kola House' in Manhattan, scheduled for this spring, comes at a time when Americans are cutting back on soda consumption.\nWhether an 'experiential lounge' in New York does anything to transform PepsiCo's image remains to be seen.\nScroll down for video\nNew restaurant: PepsiCo is going to open a restaurant called 'Kola House' in Manhattan in the spring. A drawing of how how the venue will look is seen here\nSeth Kaufman, chief marketing officer for PepsiCo's North American Beverages, said in a statement: 'We wanted to create a modern hub for consumers to share social and immersive experiences that were anchored in the exploration of our cola's artisanal craft and flavor.\n'The Kola House represents a new space for us to support our consumer-first approach to drive authenticity and innovation around our beverage offerings and ideals.'\nKaufman told the New York Times: 'This isn't a pop-up. This is something much bigger than that.'\nPepsiCo said in a Friday press release that 'Kola House' will be in the Meatpacking District.\nThe company promised in the release: 'A full artisanal menu from a rising resident executive chef will also offer specialty plates inspired by the kola nut.'\nPepsi and other drinks made by PepsiCo will be served at the restaurant, and the Pepsi logo 'will be subtly included in the space'.\nPepsiCo's head of design Mauro Porcini told the New York Times: 'Consumers will love your brand because your brand enables you to have the experience, but they don’t want to have the brand in their face.\n'It needs to be very subtle, elegant, sophisticated.'\nPepsiCo has said the restaurant will be in the Meatpacking District (seen in a file photo)\nCoca-Cola Co. and PepsiCo Inc. have been attempting to reframe soda as a more premium product\nA 'cocktail curator' named Alex Ott will develop specialty drinks.\nPorcini told the New York Times: 'We call him \"alchemist\", not \"mixologist\". Don't call Alex a mixologist.'\nPepsiCo said in the release: 'Kola House will also include a modular series at key events in pop culture that will replicate the experience of the flagship location, with local themes and ties woven into the food, beverage and designs.\n'The first of the modular locations will open as an exclusive VIP space in San Francisco during Super Bowl 50, at Pier 70 – a collaboration between Pepsi and DIRECTV announced last month.'\nAccording to the New York Times, San Francisco menu items will include 'kola sliders, made with wagyu beef and caramelized onions, and beef tartare with caviar and kola truffle aioli.'\nCoca-Cola Co. and PepsiCo Inc. have been attempting to reframe soda as something more premium. That has included glass bottles and mini-cans with a bigger price tag.\nPepsiCo introduced a 'craft soda' called Caleb's, named after the inventor of Pepsi.","url":"https://www.dailymail.co.uk/news/article-3423280/Pepsi-plans-open-hipster-bar-lounge-restaurant-called-Kola-House-New-York-City-make-soda-cool.html"}
