{"authors":["Aishwarya Venugopal"],"date_download":"2018-10-31 00:25:33","date_modify":"2018-10-31 00:25:33","date_publish":"2018-07-10 00:00:00","description":"PepsiCo beat on the top and bottom lines. Strong sales in its Frito-Lay unit in North America helped offset weak beverage demand.","filename":"data/vaneerConsumption/PepsiCobeatsasFritoLaysalessurge.json","image_url":"https://amp.businessinsider.com/images/5a74884eaf61d8841b8b4a30-960-480.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pepsico-earnings-beat-frito-lay-sales-surge-2018-7_1540945533.html","title":"PepsiCo beats as Frito-Lay sales surge","title_page":"    PepsiCo earnings beat as Frito-Lay sales surge - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"YouTube/Pepsi\n(Reuters) - PepsiCo Inc reported second-quarter revenue and profit that topped Wall Street estimates as higher sales in its Frito-Lay unit in North America helped offset sluggish demand for beverages.\nPepsi's beverages unit that makes carbonated soft drinks has been struggling to reverse a four-quarter decline in sales as consumer taste shifts to low-calorie and low-sugar alternatives.\nSales in its North America beverage unit fell about 1 percent to $5.19 billion in the quarter, the company said, but narrowly beat market expectations.\nTo overcome weak soda sales, Pepsi has been focusing on growing its snacks business by experimenting with new flavors, healthier methods of preparation and packaging designs.\nThese efforts led to a 4.3 percent rise in sales at its Frito-Lay division that makes Cheetos and Doritos tortilla chips.\nNet income attributable to the company fell to $1.82 billion, in the second quarter ended June 16, from $2.11 billion, a year ago, mainly due to higher costs for transportation and raw materials.\nExcluding one-time items, the company earned $1.61 per share, beating analysts' average estimate of $1.52 per share.\nTotal revenue rose 2.4 percent to $16.09 billion, edging past analysts' average estimate of $16.04 billion, according to Thomson Reuters I/B/E/S.\nShares of the beverage and snack company were marginally up about 1 percent in premarket trading on Tuesday.\nThe company's shares have declined about 10 percent this year, steeper than bigger rival Coca Cola's 3.2 percent drop.\n(Reporting by Aishwarya Venugopal in Bengaluru; Editing by Arun Koyyur)","url":"https://www.businessinsider.com/pepsico-earnings-beat-frito-lay-sales-surge-2018-7"}
