{"authors":["Ian Hanchett"],"date_download":"2018-10-30 21:18:12","date_modify":"2018-10-30 21:18:12","date_publish":"2017-02-23 04:54:16","description":"During Wednesday's Democratic Leadership Debate on CNN, DNC Chair candidate former Labor Secretary Tom Perez declared, \"the DNC's a black hole, and we | Video","filename":"data/vaneerConsumption/PerezWeHaveACrisisofConfidenceBecauseTheDNCsaBlackHole.json","image_url":"https://media.breitbart.com/media/2017/02/Perez-222-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_02_22__1540934292.html","title":"Perez: We Have 'A Crisis of Confidence' Because 'The DNC's a Black Hole'","title_page":"Perez: We Have 'A Crisis of Confidence' Because 'The DNC's a Black Hole' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During Wednesday’s Democratic Leadership Debate on CNN, DNC Chair candidate former Labor Secretary Tom Perez declared, “the DNC’s a black hole, and we have a crisis of confidence because it is.”\nPerez responded to a question on his comments that the Democratic primary was rigged, and his subsequent walk back of them by saying, “Hillary Clinton won the Democratic primary. Hillary Clinton also won the popular vote. At the same time, because of the absence of transparency in the Democratic primary, there was a crisis of trust that ensued. And what we need in the chair of the Democratic Party is to make sure that in fact, and in perception, every single day, you are fair and neutral. That’s why when you asked question before about primaries, you have to let the primary process go. If I were the chair — if I have the privilege of winning, for instance, one of the things I would recommend would be that we set the primary debate schedule long in advance of when we know who the candidates are. We have to do everything to make sure we are fair and transparent. And it’s not only in how we set the primary process, the DNC’s a black hole, and we have a crisis of confidence because it is.”\nAsked a second time if the primary was rigged, Perez answered, “Again, the process, because of the absence of transparency, that created that crisis of relevance, and it created the distrust that people didn’t trust the outcome.”\nWhen asked a third time, Perez responded, “We have to do everything in a transparent fashion, and when you do that, you earn trust.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2017/02/22/perez-we-have-a-crisis-of-confidence-because-the-dncs-a-black-hole/"}
