{"authors":[],"date_download":"2018-10-30 14:08:25","date_modify":"2018-10-30 14:08:25","date_publish":"2018-10-30 00:00:00","description":"A limited liability company led by Charles H. \"Chip\" Murphy III has obtained a Little Rock permit to build a new two-story office on Kavanaugh Boulevard to house the Murphy Group, Murphy confirmed Monday.","filename":"data/vaneerConsumption/PermitOKdfornewtwostoryofficeonKavanaughBoulevardinLittleRocksHeightsneighborhood.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/Screen_Shot_2018-10-30_at_8.35.21_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540908505.html","title":"Permit OK'd for new two-story office on Kavanaugh Boulevard in Little Rock's Heights neighborhood","title_page":"Permit OK'd for new two-story office on Kavanaugh Boulevard in Little Rock's Heights neighborhood","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The former building at 5615 Kavanaugh Blvd. is shown in this photo from the Pulaski County assessor's office. The structure was recently torn down.\nA limited liability company led by Charles H. \"Chip\" Murphy III has obtained a Little Rock permit to build a new two-story office on Kavanaugh Boulevard to house the Murphy Group, Murphy confirmed Monday.\nThe $1 million project at 5615 Kavanaugh Blvd. comes after Catta LLC purchased the property earlier this year for $515,000 from William Keith Robertson and Emily Katherine Robertson, who owned a longtime beauty salon on the site.\nThe previous building on the property, built as a residence in 1920 and home for years to a doctor's office, was torn down recently.\nIn an interview, Murphy said problems associated with the previous building were considered too extensive to mount a restoration so the decision was made to build a new one. The design of the two-story building incorporates elements, such as antique bricks and a residential appearance, to allow it to blend into the surrounding Pulaski Heights neighborhood, he said.\nThe Murphy Group had rented space in the previous building for the past 16 years and will move into the new one when it is completed, likely by next fall, Murphy said. He also said he expects to consolidate some related entities in the building.\n-- Noel Oman\nAcxiom spinoff reports $20.6M profit\nLiveRamp, a spinoff of Acxiom after much of Acxiom was sold to Interpublic Group this year, on Monday reported fiscal second-quarter net income of $20.6 million.\nThat compares with a net loss of $3.3 million in the same period a year ago.\nLiveRamp had earnings per share of 27 cents for the period that ended Sept. 30. Revenue was $64.8 million for the quarter, compared with $54 million for the same period last year.\nThe company added more than 25 direct customers during the second fiscal quarter, bringing its total direct customer count to about 650, an increase of more than 30 percent compared with the same period last year.\nNew York-based Interpublic Group paid $2.3 billion for the Acxiom Marketing Solutions business this year. What was left of Acxiom was LiveRamp, which has its headquarters in San Francisco.\nLiveRamp trades under the RAMP ticker symbol on the New York Stock Exchange.\nAcxiom's stock stopped trading on Oct. 1.\n-- David Smith\nSoybeans change course for Vietnam\nA ship carrying U.S. soybeans changed destination from China to Vietnam on Saturday as exporters found new buyers for American supplies amid an escalating trade war.\nBulk carrier Audacity left Seattle on Oct. 21 for Qingdao, China, with 69,244 metric tons of soybeans, according to U.S. Department of Agriculture inspection data and vessel data compiled by Bloomberg. After six days, it changed course to Phu My, Vietnam, the data show. The Louis Dreyfus Co., an international grain merchant, didn't immediately respond to an email seeking comment.\nU.S. soybean trade with China has plunged amid back-and-forth tariffs. Meanwhile, Vietnam's imports of U.S. soy have risen 93 percent this year, USDA data show.\n-- Bloomberg News\n'Digital services tax' proposed in U.K.\nThe head of Britain's treasury has proposed a new tax targeting tech giants such as Google, Facebook and Amazon, in what he described as a necessary evolution of the corporate tax system in the digital age.\n\"The rules have simply not kept pace with changing business models,\" said Philip Hammond, chancellor of the exchequer, in a budget address to Parliament on Monday. \"And it is clearly not sustainable or fair that digital platform businesses can generate substantial value in the U.K. without paying tax here in respect of that business.\"\nHammond said his proposed \"digital services tax\" would apply to \"established tech giants\" rather than startup companies and would take shape as a narrow tax on revenue generated in Britain for tech platform business models.\nSearch engines, social media networks and marketplaces were the types of digital platforms that Hammond said have changed society for the better. But he said they also challenge the fairness of the tax system.\nAmazon and Facebook declined to comment. Alphabet did not immediately respond to a request for comment. (Amazon founder Jeff Bezos owns The Washington Post.)\n-- The Washington Post\nRuling: Hog-suit gag order went too far\nRALEIGH, N.C. -- A federal appeals court panel says a trial judge went too far with a gag order that forbids lawyers or virtually anyone with knowledge of conditions at North Carolina hog operations from sharing information with reporters or on social media.\nThe 4th U.S. Circuit Court of Appeals in Richmond, Va., ruled Monday that judges overseeing lawsuits in the Carolinas, Maryland, Virginia and West Virginia can issue gag orders only as a last resort. The ruling was sought by farm and journalism groups, including The Associated Press.\nPork giant Smithfield Foods challenged a North Carolina federal judge barring involved parties and \"all potential witnesses\" from discussing dozens of lawsuits claiming industrial-scale hog farms create unreasonable nuisances.\nJuries in the first three trials hit Smithfield with verdicts totaling nearly $550 million.\n-- The Associated Press\nAutomaker rethinks Ram's Mexico move\nExecutives with Fiat Chrysler Automobiles say it may keep making heavy-duty Ram pickups in Mexico, reconsidering a move President Donald Trump has repeatedly touted as validation for his America-first policies.\nChief Executive Officer Mike Manley told Reuters in an interview that the company could continue to build the big trucks at a plant in Saltillo, plus start assembling them at a factory north of Detroit. He said the additional output may be needed to continue gaining market share.\nTrump has repeatedly lauded Fiat Chrysler's plan and pointed to it as evidence that companies are moving production to the U.S. from Mexico because of his administration's trade, tax and regulatory policies. While the company appears to be carrying on with plans to invest $1 billion and add 2,500 new jobs at the truck plant outside Detroit, that expansion may no longer be made at the expense of the Saltillo factory.\n\"Before we make big industrial moves, we're going to look at current market and economic decisions,\" Mike Keegan, a Fiat Chrysler spokesman, said by phone Monday.\nThe company trails Ford and General Motors in full-size truck sales, though the Ram pickup has outsold GM's Chevrolet Silverado each of the past two months.\n-- Bloomberg News\nBusiness on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/hcb-2-16-1-kavanaugh-office-building-pe/"}
