{"authors":["Rachael Levy"],"date_download":"2018-10-30 22:34:03","date_modify":"2018-10-30 22:34:03","date_publish":"2016-12-13 00:00:00","description":"Perry Capital co-founder Paul Leff is investing in Svetlana Lee's Varna Capital, a small New York-based hedge fund.","filename":"data/vaneerConsumption/PerryCapitalsPaulLeffbacksSvetlanaLeesVarnaCapital.json","image_url":"https://amp.businessinsider.com/images/58502705a1a45ed2008b57d6-320-160.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_perry-capitals-paul-leff-backs-svetlana-lees-varna-capital-2016-12_1540938843.html","title":"Perry Capital's Paul Leff backs Svetlana Lee's Varna Capital","title_page":"    Perry Capital's Paul Leff backs Svetlana Lee's Varna Capital - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Svetlana Lee A small hedge fund that is having a knockout year just gained the backing of a big-name investor.\nSvetlana Lee's $25 million fund, New York-based Varna Capital, is receiving an investment from Paul Leff, cofounder of Perry Capital.\n\"Svet is going to do fantastic,\" Leff told Business Insider in a phone interview. \"She is a very, very good investor. I'm hoping this is going to be a long-term relationship.\"\nLeff declined to say how much money he was investing with Varna, which runs a long-short equity special situations strategy.\nLeff, a minority owner in the Oakland Raiders, left Perry Capital in 2014. He has since been managing his own money within a family office.\nPerry Capital is an iconic name in the hedge fund industry, with a 28-year run that ended this year when the firm announced it would shut down after suffering poor performance and management changes.\nLeff knows Lee from the late 1990s and early 2000s when Lee worked as an analyst at Perry. Lee later worked at Seth Klarman's Baupost Group and David Einhorn's Greenlight Capital before launching Varna Capital in 2008.\nVarna is up about 34.4% net of fees through the end of November, bolstered by a knockout November. Varna gained about 16% on the back of President-elect Trump's win.\n\"We are in a good place now,\" Lee said.\nThe fund was already having a good year before the election, but Trump's win bumped performance.\n\"I owned a number of companies in coal mining and industrials that were suffering from regulation that was put in place by the Obama administration that I thought was unlikely to continue to be implemented in its current form, regardless of who won the election,\" she said. \"It just so happened that when Trump won the election, he was very clear that deregulation was going to be part of his presidency.\"\nU.S. President-elect Donald Trump speaks at the USA Thank You Tour event at the Iowa Events Center in Des Moines, Iowa, U.S., December 8, 2016. REUTERS/Shannon Stapleton Lee had long positions in Arch Coal, a coal producer which recently emerged from bankruptcy, and EnPro, which makes parts for chemical plants and pipelines, she said.\nA position in Fannie Mae and Freddie Mac, meanwhile, was the biggest winner for Varna in November, she said. The stocks got a big bump after Trump's election, with his Treasury secretary pick Steven Mnuchin supporting privatizing the mortgage giants.\n\"At the end of the day, I like to invest in US-based small cap companies,\" she added. \"A lot of the things that the incoming president is talking about favor US based smaller companies via deregulation.\"\nHer investments would have also worked if Democratic candidate Hillary Clinton won, she said.\n\"I didn't know for sure who would be the president, but there were certain areas I stayed out of, namely healthcare,\" she said, adding that such stocks would have had a much more binary reaction.\nLee is also one of the few women who run hedge funds, and Varna has been around since 2008.\n\"I've had my ups and downs on the business side more so than the portfolio side,\" Lee said.\nOne of the firm's seed investors, FRM Holdings Group, left the seeding business after it was aquired by Man Group in 2012, for instance.\nPerformance has also been rocky in the past, with 20% plus losses in 2011 and 2015. Still, the firm has also posted strong returns, notably in 2009, 2010 and 2013.","url":"https://www.businessinsider.com/perry-capitals-paul-leff-backs-svetlana-lees-varna-capital-2016-12"}
