{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-22 21:19:07","date_modify":"2018-10-22 21:19:07","date_publish":"2017-04-26 01:33:03","description":"The Little Mix star was spotted cheering on her man during Arsenal's FA cup semi-final clash against Man City on Sunday and feeling inspired, Perrie has since been showing off her own footballing skills.","filename":"data/vaneerConsumption/PerrieEdwardsshowsofffootballskillsonSnapchat.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B6C4600000578-0-image-a-21_1493166471358.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446002_Perrie-Edwards-impresses-Arsenal-beau-ball-skills_1540243147.html","title":"Perrie Edwards shows off football skills on Snapchat","title_page":"Perrie Edwards shows off football skills on Snapchat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She had been itching to get home to see her beau while away on tour.\nAnd since touching back down in the UK, Perrie Edwards and her boyfriend Alex Oxlade-Chamberlain have been pretty much inseparable.\nThe Little Mix star was spotted cheering on her man during Arsenal's FA cup semi-final clash against Man City on Sunday and feeling inspired, Perrie has since been showing off her own footballing skills.\nScroll down for video\nAnything he can do! Perrie Edwards gave boyfriend Alex Oxlade-Chamberlain a run for his money by demonstrating her footballing skills on Snapchat\nAlex had filmed Perrie on Snapchat to capture his girlfriend's attempts at kicking a ball around and was left impressed when she managed to successfully pass the ball back and forth with him.\nWitnessing the singer's powerful kick, he crooned in response: 'Unbelievable.'\nAlex guided Perrie through the motions and told her: 'Touch with the right and kick with the left,' before adding his approval with a simple: 'Nice.'\nThe sporting star could then be heard telling Perrie 'not to worry about her shoes' as she hesitantly booted the ball with her feet clad in sparkling white trainers.\n'Show me what you got... focus,' he told her, before Perrie hit back: 'I am focusing babe, you make it look easy.'\n'Show me what you got': Arsenal player Alex filmed Perrie having a kick about while giving her some tips on her ball skills\nMaybe not quite a pro: Although, Perrie voiced her concerns about mucking up her sparkling white trainers and grew frustrated after not being able to do more than a few keepy uppies\nEgged on by her beau: Perrie had snapped back at Alex telling her to 'focus' by remarking 'I am focusing babe, you make it look easy'\nLeft impressed: Still Alex seemed bowled over by her attempts and was seen gushing about Perrie on social media, before joking she was an 'anger child' after she was caught booting the ball back at her beau\nGetting annoyed at herself for not being able to do more than a couple of keepy uppies, Perrie grunted as she booted the ball back at her beau.\nAlex, meanwhile, was left amused by her frustrated display and branded Perrie an 'anger child' while captioning the clip with a crying with laughter emoji.\nThe couple's latest appearance together comes after Perrie had gone along to see Alex in action as he took to the pitch during Arsenal's semi-final victory against Man City on Sunday.\nHis team secured themselves a place in the final at Wembley thanks to their 2-1 win and Perrie was seen celebrating in the stands as she referred to Alex as her 'man of the match' on Snapchat.\n'My man of the match': The Little Mix star's footballing session appeared to be inspired by her going along to see Alex in action in Arsenal's recent semi-final clash against Man City\nAnd while doing so, she couldn't resist applying one of the social media apps' filters for the match which saw her face adorned with Arsenal inspired face paint.\nPerrie has spent the last few months pining after her man while touring alongside Little Mix as they supported Ariana Grande on her Dangerous Woman tour in the US.\nTaking to Instagram, the starlet confessed she was missing Alex while overseas and shared a cute picture of the pair kissing with her fans.\nShe gushed alongside it: 'Apologies for this extra af, cheese on toast post.... But s*** I miss him toooo much!'\nKiss, kiss: Perrie had been pining after her man while away on tour over in the US and shared this shot of the duo sharing a smooch to Instagram, along with the caption: 'S*** I miss him toooo much!'\nAlex and Perrie were first romantically linked in December when the footballer was spotted cheering on Perrie from the audience at The X Factor final.\nShe had performed live with Little Mix on the the show.\nHer relationship with Alex comes over a year after she split with her ex-fiance Zayn Malik.\nThe pair had dated for four years and the former One Direction star had popped the question to Perrie, before splitting with her in August 2015.\nHe is now dating model Gigi Hadid.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446002/Perrie-Edwards-impresses-Arsenal-beau-ball-skills.html"}
