{"authors":["Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 20:27:48","date_modify":"2018-10-22 20:27:48","date_publish":"2016-01-29 01:45:20","description":"Kim Tucci, 26, announced on Friday that she has given birth to quintuplets, welcoming a son, Keith, and four daughters - Ali, Penelope, Tiffany and Beatrix - into their family.","filename":"data/vaneerConsumption/PerthmumKimTuccigivesbirthtoquintupletsinjustTWOminutes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE71A900000578-0-image-a-19_1454033421518.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422020_Perth-mum-Kim-Tucci-gives-birth-quintuplets-just-TWO-minutes_1540240068.html","title":"Perth mum Kim Tucci gives birth to quintuplets in just TWO minutes","title_page":"Perth mum Kim Tucci gives birth to quintuplets in just TWO minutes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mrs Tucci is sharing the highs and lows and large eating habits on her blog that has more than 123,000 followers\nA Perth mum has given birth to quintuplets - one boy and four girls - in just two minutes.\nKim Tucci, 26, announced on Friday that she and her husband Vaughn Tucci have welcomed five new children to their growing brood - a son, Keith, and four daughters - Ali, Penelope, Tiffany and Beatrix, according to Woman's Day.\nShe was just 30 weeks along when she went into labour at King Edward Memorial Hospital.\nMrs Tucci, who has a nine-year-old son from a previous marriage and two daughters with her husband Vaughn, fell naturally pregnant with quintuplets while trying for a boy with her husband and has been documenting the highs and lows of her pregnancy since receiving the news.\nScroll down for video\nParty of five: Perth mum Kim Tucci, 26, (pictured) have given birth to her quintuplets in just two minutes at King Edward Memorial Hospital\nSurprised by five: Mrs Tucci announced on Friday that she and her husband Vaughn Tucci have welcomed five new children to their growing brood - a son, Keith, and four daughters - Ali, Penelope, Tiffany and Beatrix\nMrs Tucci wrote about her struggles with back pain, 12 bathroom trips a night and consuming the recommended 6,000 calories a day to feed her five babies.\n‘I'm struggling to eat and force feed myself leaving me with reflux for hours,’ she wrote on her blog Surprised With Five.\n‘I can't tolerate a lot of dairy and I can't keep protein drinks down, I'm starting to lose weight when I really need to be gaining it.’\nHer online posts about dealing with pain, nausea, changes to her body and going to the bathroom 12 times a night, has amassed a following of more than 123,000 people – most of them mums who share their own personal stories.\n‘It's getting harder as each day passes to push through the pain, every part of my body aches and sleeping is becoming very painful,’ she said.\n‘No amount of pillows are helping support my back and belly. Sometime I get so upset that I just want to throw my hands up and give in!’\nMiracle babies: Mrs Tucci, who has a nine-year-old son from a previous marriage and two daughters with her husband Vaughn, fell naturally pregnant with quintuplets while trying for a boy with her husband\nSharing the love: The mum of eight has been documenting the highs and lows of her pregnancy in her blog since learning the shocking news\n‘I have a lot of stretch marks now, dealing with such a huge change in my body is hard. My husband always reminds me I should wear my stripes with pride and that I should be proud of them and what my body has achieved.’\nIs it all worth it?\n‘Yes!!!! I will keep pushing through,’ Mrs Tucci exclaims.\nAt 24 weeks along, photographer Erin Elizabeth took photos of the expecting mum to commemorate her journey.\nThe images became a hit on Mrs Tucci's website and Ms Elizabeth's social media.\nMrs Tucci has been admitted to the hospital on a few occasions for minor issues but all five of the children – four girls and one boy – are healthy.\nEating for five: Mrs Tucci wrote on her blog that she was having a hard time eating 6,000 calories a day to meet the recommended calorie intake for quintuplet pregnancies\nMrs Tucci and her husband began trying for their third and final child together last year with the hope of having a son to complete their family.\nAfter finding out in July that Mrs Tucci was pregnant, the couple was ecstatic to be told by their doctor that they were having twins.\n'I WAS SO EXCITED!! TWINS!!! I was excited at the possibility of twins but absolutely nothing on this earth could have prepared me for what happened next,’ Mrs Tucci said.\nWhen she asked to use another sonogram machine so she could have a clearer view of the babies, her world was turned upside-down when the doctor found five separate heart beats.\nAn early photo posted to Mrs Tucci's blog when she was just 11 weeks along but her size can be compared to a mother who is almost at the end of her pregnancy\nMrs Tucci asked to take a second sonogram to see her babies better and doctors were shocked to find out that instead of two heartbeats, there were five\n'My legs start [sic] to shake uncontrollably and all I can do is laugh.. The sonographer then told me the term for 5 is QUINTUPLETS!!' she continued.\n'I called my husband from the ultrasound room but I don't think he believed me at first. He quickly drove down. I could see the excitement in his face he told me \" We can do this\".'\nMrs Tucci said it has started to kick in what a big change this will be for her family.\n‘I have only just really embraced this pregnancy and what it will mean for my family, the last few days has been a reality check that it's all really happening!’","url":"https://www.dailymail.co.uk/femail/article-3422020/Perth-mum-Kim-Tucci-gives-birth-quintuplets-just-TWO-minutes.html"}
