{"authors":["Peter Devlin For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-23 01:16:57","date_modify":"2018-10-23 01:16:57","date_publish":"2017-03-16 11:10:57","description":"Nurse and mother-of-two Michelle Allison Fernandez, 43, stabbed her ex-husband Mark Fernandez twice at the Shelley park foreshore in October 2015.","filename":"data/vaneerConsumption/Perthwomanstabbedexhusbandinfrontoftheirkids.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5339A900000578-0-image-a-9_1489659487583.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319570_Perth-nurse-stabbed-ex-husband-kids_1540257417.html","title":"Perth woman stabbed ex-husband in front of their kids","title_page":"Perth woman stabbed ex-husband in front of their kids | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A nurse who stabbed her ex-husband with a knife in front of one of their children near a busy Perth playground has been jailed for more than five years.\nMichelle Allison Fernandez, 43, stabbed Mark Fernandez twice at the Shelley park foreshore in October 2015, the WA District Court heard on Thursday.\nThe mother-of-two was found guilty by a jury of causing grievous bodily harm, but insists she did not bring the knife and is not guilty of the crime.\nMichelle Allison Fernandez, 43, (centre) stabbed Mark Fernandez twice at the Shelley park foreshore in October 2015, the WA District Court heard on Thursday\nA nurse who stabbed her ex-husband with a knife in front of one of their children near a busy Perth playground has been jailed for more than five years\nJudge Michael Bowden accepted Fernandez did not form the intention to stab the victim until shortly before it happened.\n'It was traumatic, it was a brutal attack, it occurred in a public park and in essence in the middle of the day,' he said.\n'There were other people, children as well, present at that park.'\nMr Fernandez suffered a 15cm wound to his bowel and a 10cm laceration to his chest, as well as injuries to his hands.\n'If medical intervention had not have occurred it was very likely that the victim would have died,' Judge Bowden said.\nMr Fernandez spent 28 days in hospital, was confined to a wheelchair for four months, needed 105 stitches to his chest and abdomen, and 138 stitches to other parts of his body.\nJudge Bowden noted Fernandez had no prior record, had a supportive family, and was highly thought of by workmates and friends, who described her as calm, generous and trustworthy.\nThe knife used in the attack against Mark Fernandez\n'It's not in dispute, and it's confirmed by the references and evidence given at the trial, that you're highly competent in your profession,' he said.\n'You're caring, compassionate and very professional in your work as a clinical nurse.'\nJudge Bowden also noted Fernandez was unlikely to reoffend, but said she had traumatised the victim.\nFernandez was sentenced to five-and-a-half years in jail and must serve three-and-a-half years behind bars before she can be eligible for parole.","url":"https://www.dailymail.co.uk/news/article-4319570/Perth-nurse-stabbed-ex-husband-kids.html"}
