{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 00:18:59","date_modify":"2018-10-23 00:18:59","date_publish":"2016-01-11 09:21:45","description":"The snorkeller named Dirk was filmed exploring the seabed in Cape Peron in Perth, Western Australia, after he put his arm inside an underwater cave and an octopus latched on.","filename":"data/vaneerConsumption/PerthsnorkellerhasaVERYcloseencounterwithanoctopus.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3006794800000578-0-image-a-6_1452502372578.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393556_Sucker-Snorkeller-close-encounter-octopus-latches-arm-refuses-let-go_1540253939.html","title":"Perth snorkeller has a VERY close encounter with an octopus","title_page":"Perth snorkeller has a VERY close encounter with an octopus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The mollusc held on for a few minutes and travelled up man's arm\nAn octopus latched on with mighty strength and refused to let go\nThe man came across an underwater cave and put his arm inside\nSnorkeller was exploring seabed while on the lookout for lobster\nA snorkeller on the lookout for spiny lobster got quite the surprise when another creature took a liking to him and became a little too attached.\nThe man named Dirk was filmed exploring the seabed in Cape Peron, a headland at Rockingham, at the southern end of Cockburn Sound in Perth, Western Australia.\nHe explained that he was searching for spiny lobster - also known as rock lobster - as they are particularly common in Australasia.\nStuck on you: The octopus latched on to Dirk's arm after he placed it inside an underwater cave\nWe shall not be moved: Dirk said it was quite a surprise when the mollusc held on with all its strength\nAfter coming across a small underwater cave, Dirk could not help but put his arm inside and have a feel around for something alive.\nIt is at this point that an octopus latched onto his arm with all its strength - something that Dirk described as a surprise.\nThe video maker then captured the mollusc clinging onto the snorkeller's arm and refusing to let go.\nThe snorkeller explained how he attempted to remove the octopus for a couple of minutes and had several unsuccessful attempts at trying to pull it off.\nExploring: The octopus latched onto Dirk's lower arm before heading towards his shoulder\nHe said that when he did finally have some luck that the octopus moved over onto his other arm and held on tight.\nThe footage shows the majestic creature latched onto Dirk's arm with its suckers, as the snorkeller travels through the water.\nIt holds onto his lower arm before heading towards his shoulder and later moving back down again.\nHe explained that he was eventually able to remove the creature with a little probing and that it escaped to the grass on the seabed.","url":"https://www.dailymail.co.uk/news/article-3393556/Sucker-Snorkeller-close-encounter-octopus-latches-arm-refuses-let-go.html"}
