{"authors":["Bryant Hevesi For Daily Mail Australia"],"date_download":"2018-10-23 04:21:55","date_modify":"2018-10-23 04:21:55","date_publish":"2017-04-26 16:01:48","description":"Sydney and Melbourne's skyrocketing house prices show no signs of pulling back any time soon but over in Perth it's a different story, where prices have fallen by up to 40 per cent in some suburbs.","filename":"data/vaneerConsumption/Perthspropertyslumppostalessonforeastcoast.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3FA0051200000578-0-image-a-29_1493214589505.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447554_Perth-s-property-slump-post-lesson-east-coast_1540268515.html","title":"Perth's property slump post 'a lesson' for east coast","title_page":"Perth's property slump post 'a lesson' for east coast   | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sydney and Melbourne's skyrocketing house prices show no signs of pulling back any time soon, but over in Perth it's a different story.\nHome owners in the West Australian capital are battling to pay their over inflated mortgages with house prices in free fall.\nProperty was in high demand in Perth in 2007 and again in 2012 thanks to the mining boom, leading to strong price growth.\nBut now prices have dropped by double-digit percentages in some suburbs, with warnings Sydney and Melbourne could experience a similar fate in the next few years.\nThis dilapidated home, in the Sydney suburb of Rozelle, went on sale in April with a staggering price guide of $1.25 million\nIn the Sydney suburb of Ryde, this home shocked investors when it recently sold for $2.35 million, $450,000 more than the asking price\nIn Glen Waverley, south-east Melbourne, this three-bedroom home is currently for sale with an asking price of $1.2 million\nAlso in Glen Waverley, this luxurious five-bedroom home is up for auction in the coming days. House prices in Melbourne have jumped by 15.2 per cent in the past 12 months\n'There's probably a lesson for Sydney and Melbourne today of perhaps what's coming after the market turns,' Perth property valuer Gavin Hegney told the ABC's 7.30 program.\nHe said West Australia was once 'infallible' and 'really booming' but times have dramatically changed.\nIn Mandurah, south Perth, some people have seen the price of their properties fall by a staggering 40 per cent in a decade.\nDaniel Johnston, 35, purchased an investment property in the suburb for $580,000 in 2007 but now it is only worth $350,000.\nFor sale by transparent negotiation, this home is located in the Perth suburb of Mosman Park. Western Australia has experienced sluggish growth in house prices in recent times\nWhile house prices in some Perth suburbs have fallen by 40 per cent, this four-bedroom Mosman Park home has an asking price of about $1 million\nThis two-bedroom brick home in Ryde, Sydney sold for $1.46 million in February\nIn the Sydney suburb of Castle Hill, this five bedroom home is on the market with a price guide of $2.495 million to $2.695 million, more than double the city's median house price\n'We thought it might slow, the property price, but never expected the drop that Mandurah has had. It's nearly halved,' Mr Johnston told 7.30.\nHe is fearful he will lose his family home because he is struggling to pay back the $500,000 mortgage on the investment.\nWest Australian Lifeline financial counsellor Jenny Cecil said there has been a surge in the number of people reaching out for help.\nMandurah, Perth, resident Daniel Johnston (pictured) said his investment property has fallen from $580,000 to $350,000 in a decade\nLifeline financial counsellor Jenny Cecil said there has been a surge in the number of people reaching out for help in Western Australia\n''They've been unemployed possibly eight to 12 months, so when they do come to see us it's sometimes difficult to offer options or arrangements to repay debt,' she said.\nIn the past 12 months, Sydney house prices have risen by 13.1 per cent and in Melbourne they have jumped by 15.2 per cent in the same period.\nThe median Sydney house price now stands at $1.15 million, while in Melbourne it is $843,674.","url":"https://www.dailymail.co.uk/news/article-4447554/Perth-s-property-slump-post-lesson-east-coast.html"}
