{"authors":["Martin Robinson For Mailonline"],"date_download":"2018-10-23 05:10:57","date_modify":"2018-10-23 05:10:57","date_publish":"2017-03-16 16:08:55","description":"Miss McCollum, 24, from Northern Ireland, and Melissa Reid, also 24, from Glasgow, were jailed in Peru in 2013 for attempting to smuggle cocaine worth £1.5million out of the country to Spain.","filename":"data/vaneerConsumption/PeruTwodrugsmuleMelissaMcCollumfliesintoEngland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E555AD700000578-0-image-a-15_1489680480779.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320774_Peru-Two-drugs-mule-Melissa-McCollum-flies-England_1540271457.html","title":"Peru Two drugs mule Melissa McCollum flies into England","title_page":"Peru Two drugs mule Melissa McCollum flies into England | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Peru Two jailbird Michaella McCollum has landed in England for talks to get her own prime time show and become an 'all action TV star', MailOnline can reveal today.\nMiss McCollum, 24, from Northern Ireland, and Melissa Reid, also 24, from Glasgow, were jailed in 2013 for attempting to smuggle cocaine worth £1.5million out of South America to Spain.\nThe friends are said to be in 'advanced talks' to turn their reputation from convicted criminals to reality TV stars by appearing on the Channel 5 show, which has a 'pairs' theme this year.\nMiss McCollum flew into Liverpool John Lennon Airport this morning before checking into a boutique hotel in the city where she will also discuss plans for a TV show interviewing prisoners including death row inmates and extremists.\nA source close to her told MailOnline that she could meet TV executives on Merseyside before 'spending a few days with friends'.\nFresh start: Peru Two drugs mule Michaella McCollum is in Liverpool amid rumours she is trying to launch a reality TV career\nFlying visit: Miss McCollum flew into Liverpool John Lennon Airport this morning (pictured) from Belfast\nRelaxation: Miss McCollum checked into a boutique hotel in the city where she will also meet with friends this weekend\nThe friend said: 'Michaella is in Liverpool finalising negotiations for her prime time documentary series delving into unsolved or unusual crime cases around the world\n'She has been inundated with offers for her own TV shows but this will see her travel around the world interviewing suspected death row inmates to extremists and people proclaiming their innocence.\nCaught: Michaella McCollum (left) with their suitcases after they drugs bust with fellow Briton Melissa Reid (right)\n'It's a massive opportunity for Michaella and will propel her into the prime time TV spotlight and become Ireland's first TV action woman'.\nShe is also said to be keen to get on to Big Brother.\nMiss Reid was not with her but although she is less keen on the limelight, but producers are believed to want to sign them for the show as a pair.\nWhile the pair denied talks were underway, a source told The Sun earlier this month: 'Michaella has made no secret of her dream to become a reality TV star.\n'She's spent the last six months trying to build up her profile and her image. Big Brother has been chatting to her about getting her on the next series of the show.\n'Her accomplice Melissa is less excited by the whole showbiz world but, because of the pairs theme, producers think they would be the ideal signing.'\nThe British duo were jailed in Peru in 2013 for attempting to smuggle cocaine worth £1.5million out of the country to Spain.\nThey travelled to South America to carry out the smuggling plot after hatching the criminal plan in the Balearic island of Ibiza.\nIn jail they slept on concrete bunks and used a hole in the floor as a lavatory for three years.\nThree years later they were released and arrived back in Britain last summer.\nIn the dock: Michaella McCollum, left, from Northern Ireland, and Melissa Reid, right, from Glasgow, were jailed in Peru in 2013 for attempting to smuggle cocaine worth £1.5million out of the country to Spain\nEvidence: These food packages crammed with the class A drug was found in their luggage\nMcCollum, pictured handcuffed as she arrives for a court hearing, in Lima, Peru, on December 17, 2013\nMichaella McCollum has been enjoying her time out of jail and last month was snapped in a revealing green swimsuit sitting on the sand and paddling in the surf in Spain.\nDespite the part Spain played in her trafficking plot, it appears to be a favourite destination for her after new pictures emerged of her enjoying time on the beach in Malaga.\nShe was spotted on a balcony in her home city, drinking and speaking on the phone, before coming down to street level.\nBut while trying to rebuild her life, and cash in on her notoriety, McCollum is believed to have alienated a lot of locals and provoked the ire of dissident republicans.\nOne republican source told MailOnline: 'People are not happy with her... If she wants to show genuine remorse she should not be flaunting herself by arranging photoshoots.\n'Dungannon is well known as a hotbed of republicanism. And people are not happy with her.\n'People were prepared to give her a fair crack of the whip and let her start again, but all she is a self-confessed drug dealer and drug carrier.\n'She is prostituting herself about the place with these photoshoots and it is getting the attention of the wrong people as far as she is concerned.\n'She had the audacity to put up a picture on her Facebook page paying tribute to the Loughghall Martyrs, making herself out to be some sort of republican.\n'That didn't go down well and it hasn't been forgotten and people aren't happy with her at all.'\nThe 'Loughghall Martyrs' is a term used by republicans to commemorate eight IRA men shot dead by the security forces in the Co Armagh village of Loughghall in 1988 in an ambush.\n'She is profiting from ill-gotten goods and extending her time in the limelight by continuing to associate herself with er recent paste.\n'People are beginning to get sick of her.'\nTime off: Michaella McCollum has been enjoying her time out of jail and last month was snapped in a revealing green swimsuit sitting on the sand and paddling in the surf in Spain\nFighting back: In one Instagram post, McCollum wrote: 'Life is so much simpler when you stop explaining yourself to people and just do what works for you' in the face of criticism in Belfast\nHaving fun: The 24-year-old Micahella, from County Tyrone, Northern Ireland, has been enjoying her new-found freedom after being jailed four years ago\nThe source did not rule that she could be under direct threat of attack from dissident republicans. He said: 'I wouldn't know.'\nDungannon has always had the reputation of being a centre of mainstream and now dissident republican politics and terror groups.\nHe added, 'She is prostituting in the media yet her only claim to fame is being a drug dealer and smuggler.\n'I know people were 'ripping' [angry] when she put that picture up of the Loughghall Martyrs.'\nShe and Reid had each been sentenced to six years and eight months in jail after admitting to trying to smuggle cocaine out of the country.\nThe pair, who initially protested their innocence, were found in possession of 11kg of cocaine hidden inside food packets in their luggage as they prepared to board a flight from Lima to Madrid.\nMcCollum was released on parole last March after serving less than half of her sentence but was initially required to stay in Peru, where she carried out voluntary work.\nReid was released from prison in June last year, flying back to Scotland shortly afterwards.\nSpeaking previously about her experience in Lima's Ancon 2 prison, McCollum described how she shared a cell with seven other prisoners including Reid.","url":"https://www.dailymail.co.uk/news/article-4320774/Peru-Two-drugs-mule-Melissa-McCollum-flies-England.html"}
