{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:33:00","date_modify":"2018-10-30 20:33:00","date_publish":"2016-01-22 02:53:39","description":"Kurdistan Regional Government (KRG) Peshmerga forces have rejected a recent report accusing them of burning and destroying Arab homes in northern Iraq.","filename":"data/vaneerConsumption/PeshmergaRefutesClaimsofKurdsRazingArabVillages.json","image_url":"https://media.breitbart.com/media/2015/11/Peshmerga-sinjar-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_21__1540931580.html","title":"Peshmerga Refutes Claims of Kurds Razing Arab Villages","title_page":"Peshmerga Refutes Claims of Kurds Razing Arab Villages","title_rss":"NULL","source_domain":"breitbart.com","text":"Kurdistan Regional Government (KRG) Peshmerga forces have rejected a recent report by human rights NGO Amnesty International, accusing them of burning and destroying Arab homes in northern Iraq, as baseless, Rudaw reports.\n“Peshmerga forces from the Kurdistan Regional Government (KRG) and Kurdish militias in northern Iraq have bulldozed, blown up and burned down thousands of homes in an apparent effort to uproot Arab communities in revenge for their perceived support for the so-called Islamic State (IS) [ISIS/ISIL],” said the Amnesty report published Wednesday.\nJabar Yawar, chief of staff of the Peshmerga Ministry, responded to the report on Wednesday via Rudaw TV.\n“These reports are single-sourced. They’ve given one side the chance to talk and not the other. Amnesty never reached out to us or ask us anything for this report,” he declared.\n“If they had visited we’d have given them solid evidence to show their accusation has no basis,” he continued. “These accusations are made by people linked to ISIS. They accuse us because they lost their territory in the fight against ISIS.”\nYawar went on to say there is no evidence that the Peshmerga forces have destroyed the Arab villages in northern Iraq.\n“The whole world knows we are dealing with a terrorist group that aims destroy wherever they go,” he explained. “The main reason behind the destruction of these areas is ISIS landmines. They booby-trapped homes, roads… even animals and dead bodies.”\nHe added that U.S.-led coalition airstrikes have destroyed 3,000 ISIS bases in areas where civilians reside.\n“Kurdistan Region has welcomed more than 1.8 million refugees of Arab brothers… These destructions are an outcome of war and have no political purpose,” pointed out Yawar.\nAmnesty International said its report, titled, Banished and Dispossessed: Forced Displacement and Deliberate Destruction in Northern Iraq, “is based on field investigation in 13 villages and towns and testimony gathered from more than 100 eyewitnesses and victims of forced displacement.”\n“It is corroborated by satellite imagery revealing evidence of widespread destruction carried out by Peshmerga forces, or in some cases Yezidi militias and Kurdish armed groups from Syria and Turkey operating in coordination with the Peshmerga,” it adds.\nThe human rights NGO accused the Peshmerga of preventing Arab residents from returning to their homes.\n“KRG forces appear to be spearheading a concerted campaign to forcibly displace Arab communities by destroying entire villages in areas they have recaptured from IS in northern Iraq. The forced displacement of civilians and the deliberate destruction of homes and property without military justification, may amount to war crimes,” said Donatella Rovera, Amnesty International’s Senior Crisis Response Advisor.\nRovera reportedly carried out the field investigation in northern Iraq.\n“Tens of thousands of Arab civilians who were forced to flee their homes because of fighting are now struggling to survive in makeshift camps in desperate conditions. Many have lost their livelihoods and all their possessions and with their homes destroyed, they have nothing to return to. By barring the displaced from returning to their villages and destroying their homes KRG forces are further exacerbating their suffering,” added the Amnesty International official.","url":"https://www.breitbart.com/national-security/2016/01/21/peshmerga-refutes-amnesty-report-of-kurds-razing-arab-villages-in-northern-iraq/"}
