{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 01:08:48","date_modify":"2018-10-23 01:08:48","date_publish":"2016-01-29 14:54:15","description":"Michael and Kellie Bloomfield took their six-year-old British bulldog Kitch to the Vets4Pets practice in Croydon, but claim he died needlessly while getting his nails clipped.","filename":"data/vaneerConsumption/Petbulldogdiedofaheartattackafteratightmuzzlewasputonhim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2BED700000578-0-image-a-133_1454076579354.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422690_Pet-bulldog-died-heart-attack-tight-muzzle-vet-manicure_1540256928.html","title":"Pet bulldog 'died of a heart attack after a tight muzzle was put on him'","title_page":"Pet bulldog 'died of a heart attack after a tight muzzle was put on him' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple claim their beloved family dog died needlessly after being restrained at Vets4Pets in Croydon - while getting his nails clipped.\nMichael and Kellie Bloomfield took their British bulldog Kitch to their local vets to get his nails trimmed.\nBut the couple say Kitch was given a restraint that was too small for his face and restricted his mouth, making it difficult for the dog to breathe.\nThe six-year-old British bulldog was named after Millwall legend Barry Kitchener. Vets4Pets in Croydon has promised a detailed investigation into Kitch's death\nMother-of-three Kellie, 39, said: 'They got about four or five muzzles out that didn't fit him but they decided to put this long, tube one on him, the kind you'd put on a greyhound.\n'The vet cut another nail and that started bleeding. By the time he had cleared the blood up, I wanted him to stop and he took the muzzle off him.\n'My dog's tongue was blue and I said to them 'you've killed my dog'.\n'I'm a lifeguard and I know that means he had a lack of oxygen. He needs to breathe through his mouth.\n'It's diabolical and I am devastated. He was my baby and part of our family. I was totally numb.'\nThe Bloomfield's said the assistant at Vets 4 Pets in Croydon, south London, then took the dog out of the room and when she returned told the couple Kitch, named after Lord Kitchener, had died of a heart attack.\nMichael and Kellie Bloomfield (pictured) claim Kitch the dog died because vets put a muzzle on him that was 'too tight'\nMichael, 57, then came to meet Kellie and was also told the same by the vet.\nThe couple have asked for an independent autopsy with another vet on Kitch's body and they expect to hear results in the next month.\nMichael, a HGV driver, said: 'It's unbelievable. Kellie was hysterical. She witnessed it all.\n'I spoke to a member of staff at the vets and she's come down on the side of the vet and the assistant and said there was no excess force used.\n'If he was struggling you shouldn't do it.\n'I said if you went for a manicure would you expect to come out dead. It was just one clip.'\nSpecial needs nurse Kellie, added: 'It should've only taken a minute. But I was in there for about five minutes but it felt like forever.\n'The assistant said he had weed on him but it must have been the fluid coming out of him as he had died. He was stone cold dead.'\nThe couple named their dog after Millwall legend Barry Kitchener. The dog was attacked several years ago by two other dogs, leaving him anxious in stressful situations.\nA spokeswoman from Vets 4 Pets said: 'We were upset to learn of the sudden death of Kitch during a visit to the vet on Tuesday and offer our sincere condolences to his family.\n'We have promised a detailed investigation including an independent post mortem examination so that we can provide a full explanation to Kitch's family.'\nThe family, who have three children, made headlines last year when football-mad Michael named their newborn son 'Bermondsey Millwall Den' after his favourite club.","url":"https://www.dailymail.co.uk/news/article-3422690/Pet-bulldog-died-heart-attack-tight-muzzle-vet-manicure.html"}
