{"authors":["Patrick Watson","Mauldin Economics"],"date_download":"2018-10-30 22:59:06","date_modify":"2018-10-30 22:59:06","date_publish":"2018-07-25 00:00:00","description":"Basic pet care is a consumer staple like food and electricity. And it's growing — Americans are estimated to spend $72.1 billion on pets this year. Pet care ETF's are emerging and could be able to weather a recession.","filename":"data/vaneerConsumption/Petcareisarecessionproofindustry.json","image_url":"https://amp.businessinsider.com/images/5b58b73080eb3519008b4583-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pet-care-is-a-recession-proof-industry-2018-7_1540940346.html","title":"Pet care is a recession-proof industry","title_page":"    Pet care is a recession-proof industry - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Adam Pretty/Getty Images\nAmericans may be bitterly divided on everything else, but we all agree on one thing: We love our dogs. Our cats, too, plus a few other companion species. We've made them part of the family.\nI think this is good. My pets give back far more than I deserve. But even if you're the rare person who doesn't like dogs or cats, there's an important investment point here. It might even give you a profit.\nAt some point—maybe soon—this already-slow economy is going to weaken into recession. When that happens, people will have to cut spending. You want to be invested in the things they won't sacrifice.\nAnd no matter how tough life gets, millions of Americans won't sacrifice caring for their pets.\nA Growing Staple\nA couple of years ago, I said we were replacing children with pets. That was partly a joke and partly true. People are having fewer children, but our caring instinct remains. Many of us fulfill it with our pets.\nSome of us overdo it.\nA July 4 New York Times article, The Secret Price of Pets, described the increasingly baroque ways in which some Americans care for their animal companions. You can now take your dog to a spa for massage and hot oil treatments, get him a personal chef, and maybe cosmetic surgery.\nIf you have the money to afford those things, be my guest. You're helping stimulate the economy and create jobs. But I'm pretty sure the dogs don't care. They just want food and hugs.\nWhile these excesses will diminish in the next recession, the number of pets won't. Nor will their owners' commitment to them.\nIn other words, basic pet care is a consumer staple like food and electricity. And unlike some other staple categories, it's growing. The American Pet Products Association estimates we will spend $72.1 billion on our pets this year, up almost 30% from five years ago. Ditto in many other countries.\nThat sounds like a good investment opportunity… but grabbing it isn't so easy.\nFinding Exposure\nAbout 40% of that pet spending is for pet food. Most of it goes to large consumer-goods makers like General Mills (GIS), which earlier this year acquired Blue Buffalo Pet Products for $8 billion. J.M. Smucker (SJM) bought Ainsworth Pet Nutrition for $1.7 billion.\nThe absorption of these industry leaders into larger conglomerates makes it harder to get direct pet-care exposure. A bunch of smaller public companies sell pet-related goods, but they tend to be volatile. You would need to buy many different stocks to get wise diversification.\nI mentioned this problem last year and wished for a pet care ETF. Now we have one and may get another.\nGabelli Pet Parents NextShares (PETZC), an actively managed ETF, launched on June 19.\nProShares has filed the paperwork for a ProShares Pet Care ETF. It is not yet publicly available.\nThe Gabelli ETF has attracted only about $1 million in assets so far. I hope Gabelli gives it a marketing push because I think it will do well over time. The portfolio includes some of those conglomerates I mentioned but is mostly pet-care companies. Here is a summary from Gabelli's fund fact sheet.\nMauldin Economics\nSide Benefits\nWhether you invest in pet care or not, I highly recommend having at least one pet.\nWill pets make money for you? Not directly, unless you find the next Grumpy Cat. But they can help in other ways.\nThe US Centers for Disease Control and Prevention says pets can lower your blood pressure, cholesterol and triglyceride levels. Studies have shown dementia patients are less anxious when there is a pet in the home. For elderly shut-ins, walking the dog can be great exercise.\nSimilarly, WebMD reported on a study of stockbrokers with high blood pressure. Those who adopted a cat or dog had lower blood pressure readings in stressful situations than people without pets.\nMedical problems generate additional expenses and affect your decision-making ability. Neither will enhance your net worth. Pets are a relatively inexpensive way to keep yourself healthier… and probably happier, too. Which is the whole point of having money, right?","url":"https://www.businessinsider.com/pet-care-is-a-recession-proof-industry-2018-7"}
