{"authors":["Bianca Soldani","Jessica Aquilina For Daily Mail Australia"],"date_download":"2018-10-22 21:54:49","date_modify":"2018-10-22 21:54:49","date_publish":"2016-01-28 09:23:10","description":"The long-serving My Kitchen Rules judge was sporting a sky-high quiff styled into his newly shaved Mohawk hairstyle as he attended the Brisbane launch of the reality show.","filename":"data/vaneerConsumption/PeteEvanssportsaskyhighquiffatBrisbaneMyKitchenRuleslaunch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/06/30A5020D00000578-0-image-a-4_1453962616440.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420362_Pete-Evans-sports-sky-high-quiff-Brisbane-Kitchen-Rules-launch_1540245289.html","title":"Pete Evans sports a sky-high quiff at Brisbane My Kitchen Rules launch","title_page":"Pete Evans sports a sky-high quiff at Brisbane My Kitchen Rules launch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He may be known for his poignant critiques and dedication to the Paleo way, but it wasn't Pete Evans' culinary prowess that had heads turning on Thursday night.\nThe long-serving My Kitchen Rules judge was sporting a sky-high quiff styled into his newly shaved Mohawk hairstyle as he attended the Brisbane launch of the reality show.\nThe 43-year-old celebrity chef was accompanied by fellow Seven stars Manu Feildel and Colin Fassnidge at the soriee.\nScroll down for video\nHair-raising show! Pete Evans sports a sky-high quiff at Brisbane My Kitchen Rules launch\nPete was looking smart in a pressed navy shirt which he teamed with jeans and brown shoes.\nHe also carried a number of bags including a garment bag, a bright pink enviro-bag and a backpack as he made his way into the event.\nCommenting on his co-star's avant-guard 'do last week, Manu told Daily Mail Australia he thought Pete was copying Nick Kyrgios' look.\n'He's trying to be like the Australian tennis player - Nick Kyrgios - he has the same hair,' the French chef joked.\nSo many bags: Pete carried a garment bag, a bright pink enviro-bag and a backpack as he walked into the event\nNew do! The celebrity chef has been flaunting his new mohawk style all over his social media\nThumbs up! Pete with one of his kids getting ready for a surf\nApart from his striking new do, Pete spoke about his body transformation in regards to living a paleo lifestyle.\n'I didn't loose too much weight, it wasn't too much of a weight loss it was more of a weight distribution,' he told the Daily Mail Australia at the MKR launch.\n'That's what happens when you adopt this way of life, you change how your body looks and how your body functions.\n'I lost a few kilos but nothing major, it just changes your appearance because your inflammation goes and the fat turns into muscle.'\nPete will return to his position as a judge for the new series which he insisted was 'more intense' than any other.\n'We have probably the most powerful season that we have ever had,' he teased, describing the teams as 'dynamic' .\n'(They're) the best I've seen. It's more tense than any other series.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420362/Pete-Evans-sports-sky-high-quiff-Brisbane-Kitchen-Rules-launch.html"}
