{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:49:45","date_modify":"2018-10-30 18:49:45","date_publish":"2018-09-13 20:16:40","description":"Tech entrepreneur Peter Thiel argued that groupthink is a major issue on college campuses during an interview with Dave Rubin this week.","filename":"data/vaneerConsumption/PeterThielGroupthinkonCollegeCampusesIsaMajorIssue.json","image_url":"https://media.breitbart.com/media/2017/01/wi/afp/25/3r9839a-e1525803573508.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_09_13__1540925385.html","title":"Peter Thiel: Groupthink on College Campuses Is a Major Issue","title_page":"Peter Thiel: Groupthink on College Campuses Is a Major Issue | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tech entrepreneur Peter Thiel argued that groupthink is a major issue on college campuses during an interview with Dave Rubin this week.\nDuring an interview with Dave Rubin, Peter Thiel spoke about the current intellectual culture on college campuses.\nThiel cited a theory by one of his college professors, who argued that humans have a tendency to form their views on the basis of the views of those in their community. “One of the professors I studied under at Stanford is René Girard, he’s a cultural critic, philosopher, literary theorist, brilliant guy,” he continued. “He had this mimetic theory that people imitate each other, they copy each other, they are much more prone to fashion… One of the metaphors he had for a lot of the sort of more politically incorrect professors at Stanford was that they all thought they were in the French resistance but if they had lived in Vichy France they would all have been collaborators.”\n“The self-understanding is that they are super courageous independent thinkers, that they would have been in the resistance in France, but if you ask them what the views are that they have, its the same views of everyone around them,” Thiel explained.\n“If everyone always has the same views, it can mean one of two things,” he added. “It can mean you reached the absolute truth or you have a sort of incredible conformity.”\nThiel ended by taking a shot at the sincerity of some of the members of the “resistance” movement. “I think there are people who have sincere views even if they are in the overwhelming majority…If you are speaking out against President Trump in a small town in Alabama, I tend to think that’s a sincere person. If you are in San Francisco or Manhattan and you are part of the ‘resistance’ I suspect that there is something very different going on,” he finished.","url":"https://www.breitbart.com/tech/2018/09/13/peter-thiel-groupthink-on-college-campuses-is-a-major-issue/"}
