{"authors":[],"date_download":"2018-10-30 19:36:00","date_modify":"2018-10-30 19:36:00","date_publish":"2018-07-03 18:00:00","description":"Theater review: Serenbe Playhouse’s ‘Peter Pan’ sequel is soaring and fun; show runs through Aug. 26","filename":"data/vaneerConsumption/PeterPansequelatSerenbePlayhouse.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/03/Images/newsEngin.22136091_070618-peter-pan_1-U42306855250veb-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_95087491fd08190c4e8bb0a601a05100__1540928160.html","title":"'Peter Pan' sequel at Serenbe Playhouse","title_page":"Theater review: 'Peter Pan' sequel at Serenbe Playhouse","title_rss":"NULL","source_domain":"ajc.com","text":"When last we checked in on J.M. Barrie’s “Peter Pan,” Captain Hook had been banished to a watery grave, Wendy Darling and her brothers had returned to London to grow up, and Peter and the Lost Boys were enjoying a state of perpetually arrested development in Neverland.\nBut playwright Roger Q. Mason and composer-lyricist Ella Grace, creators of Serenbe Playhouse’s splendid new summer show for families and children, have other ideas.\nIn their world premiere musical, Captain Hook’s ship is wedged in a gushing stream deep in the forest of the Serenbe community. The Jolly Roger serves as both headquarters for Peter Pan (Aaron Schilling) and landing pad for Tinker Bell (Alexandria Joy), who comes flying in to narrate the tale.\nAlexandria Joy and Aaron Schilling star in “Peter Pan: A World Premiere Musical Pirate Adventure” at Serenbe Playhouse through Aug. 26. CONTRIBUTED BY BREEANNE CLOWDUS (For the AJC)\nTinker Bell informs us that Hook (Jeremy Gee) has “crawled his way out of the crocodile.” Knowing that a showdown between the youthful protagonist and his nemesis is imminent, Tink takes on the role of peacemaker, an act of diplomacy that requires no small amount of magic and miracle.\nDirected by Michael Alvarez, “Peter Pan: A World Premiere Musical Pirate Adventure” is a clever, well-written and wonderfully conceived sequel to Barrie’s original. Before they can settle their grievances, Peter and Hook have to deal with their emotional baggage. Or as Hook tells Peter, “Adults can’t just fly away from their problems.”\nIn a series of songs about Neverland, wish-making, diversity, believing in yourself and the future, and finding a home, the story moves along nicely toward its epic showdown.\nThe first number feels almost improvised, as if it sprang organically from the goings-on. Next thing you know, the actors are singing and dancing like Broadway stars. (Bubba Carr contributes the lively and engaging choreography, Montgomery Davis the bristling fight scenes.)\nPeter accidentally dispatches the Lost Boys to an inanimate state, and eventually we discover that Hook’s problems started with his mother. Though he wanted to be a dancer, all he got was disapproval.\nThree agile company members — Destiny Freeman, Cullen Gray and Karley Rene — double as Lost Boys and Pirates; the women are especially strong. Schilling is not the most charismatic or puckish of Peter Pans. But Joy is luminous as Tinker Bell, and Gee is excellent as the irascible Hook. The number in which Hook reveals his inner dancing queen is hysterical.\nIf you are familiar with Serenbe Playhouse’s work, the site-specific “Peter Pan” may remind you of last season’s “Macbeth,” which was staged on a boulder by a creek, and “Robin Hood,” which also employed aerial elements.\nThough nature provides the perfect environment, scenic designer Scott Sargent seamlessly incorporates a facsimile of the Jolly Roger, and Alan Yeong’s costumes are eye-catching and fun without being unnecessarily showy.\nClues about the story are placed along the path to the stage: A sign tells us that a darling little cottage in the woods is The Wendy House, which “the Lost Boys built for Wendy on the day that she and John and Michael first arrived in Neverland.” Another signpost points the way to the Indian Camp, stating that the Lost Boys and the Indians were “fierce enemies until Peter saved Tiger Lily from the Pirates.” These plot points from the various tellings of “Peter Pan” (play, novel, Broadway musical) lay the foundation for Mason and Grace’s delightful follow-up.\nIn nine seasons, Serenbe Playhouse has achieved a stellar track record as a producer of work for children and families. This buoyant musical comedy is no exception.\nTHEATER REVIEW\n“Peter Pan: A World Premiere Musical Pirate Adventure”\nThrough Aug. 26. 11 a.m. Thursdays-Saturdays; 2 p.m. Sundays. $13-$30. Serenbe Playhouse, 10767 Serenbe Lane, Chattahoochee Hills. 770-463-1110, serenbeplayhouse.com.\nBottom line: Creative team tinkers well with Peter Pan and Tinker Bell.","url":"https://www.ajc.com/entertainment/arts--theater/review-serenbe-playhouse-peter-pan-sequel-soaring-and-fun/t9mx9I0AGdgNKobwA1JjPK/"}
