{"authors":["John Hayward"],"date_download":"2018-10-30 21:47:45","date_modify":"2018-10-30 21:47:45","date_publish":"2016-05-24 14:53:28","description":"Peter Schweizer appeared on Breitbart News Daily to discuss the FBI probe into Virginia Gov. Terry McAuliffe, a longtime Clinton operative.","filename":"data/vaneerConsumption/PeterSchweizeronMcAuliffeScandalPeoplePuttingHugeAmountsofMoneyInClintonsPocketsHadStrongRichTiesWithOppressiveForces.json","image_url":"https://media.breitbart.com/media/2015/02/terry-mcauliffe-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2016_05_24__1540936065.html","title":"Peter Schweizer on McAuliffe Scandal: People Putting ‘Huge Amounts of Money’ In Clintons’ Pockets Had ‘Strong, Rich Ties With Oppressive Forces’","title_page":"Peter Schweizer on McAuliffe Scandal: People Putting ‘Huge Amounts of Money’ In Clintons’ Pockets Had ‘Strong, Rich Ties With Oppressive Forces’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart News Senior Editor Peter Schweizer, author of Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich, appeared on Tuesday’s Breitbart News Daily to discuss the FBI investigation into Virginia Governor Terry McAuliffe, a longtime operative of the Clintons.\nSirius XM host Stephen K. Bannon noted that McAuliffe is far from the only dubious character in the Clintons’ orbit. Schweizer found “enormous irony” that Bill Clinton roundly denounced the first President Bush for not dealing more harshly with exactly the sort of people who would later pour millions of dollars into the Clintons’ coffers.\nFor example, Bill Clinton said that Bush was not aggressive enough when dealing with the regime in China after Tiananmen Square, referring to that regime as the “Butchers of Beijing” for their human-rights violations.\n“Flash forward to today, during Hillary’s tenure as secretary of state, but also where they’re getting their sources of money and speaking fees in the Clinton Foundation; it is directly with those who do business with butchers around the world,” said Schweizer. He continued:\nWhether that is warlords in Africa, whether that is oppressive forces operating in South America, they receive huge sums of money and partner with the very companies that put these butchers into power because, of course, you make a lot more money partnering with a butcher than you do with a democratically-elected government in the Third World.\nBannon wondered what sort of message the Clintons’ dealings were sending to the rest of the world, especially since the McAuliffe investigation is the first real sign of U.S. government action against the Clinton Machine’s corruption.\nSchweizer pointed to the persecution of Christians and human-rights violations in Africa, for example Sudan, where “you have massive oppression of Christians, where you have a civil war going on.”\n“Hillary Clinton’s policy in sub-Saharan Africa and Sudan, particularly, was terrible,” he declared, adding:\nAnd when you wonder why – why was there no action taken that was effective in that area – all you need to do is follow the money, and look at commercial ties. You find that guys like Joe Wilson, a close Clinton friend and adviser, he had business deals with warlords in South Sudan, through this company called Jarch Capital. And what did Jarch Capital say? They say that they invest in, quote-unquote, “sovereignty changes.” That’s exactly their language.\n“What do they mean by sovereignty changes? They mean that they partner with warlords,” said Schweizer, and explained, “They give those warlords money, to help them take power, seize power in a country, and in exchange, Jarch Capital gets the mining concessions, or gets land deals from those very same warlords.”\n“So how do you explain that Hillary Clinton had such a horrible record when it came to policies in Rwanda, or South Sudan, or other parts of Africa?” he asked. “You follow the money, and you find that the people putting huge amounts of money in their pockets, and in the pockets of their friends, have strong, very rich, indeed, commercial ties, with those oppressive forces.”\nSchweizer observed:\nIt’s straight out of 19th-century colonialism, Steve. This is the sort of thing that went on with the great empires of Europe when they were cutting up Africa. And yet, the “progressive” Clintons, so to speak, are endorsing and carrying out policies that are very much like the 19th century.\nAs for the McAuliffe investigation, Schweizer said it has “far more to do with the fact that he is somebody who was on the board of the Clinton Foundation, who was also on the board of the Clinton Global Initiative, who was a major conduit of funds – foreign and domestic – to the Clintons.” He concluded, “It has a lot more to do with that than it does with the fact that he’s the governor of Virginia.”\nHe also found the timing of the McAuliffe investigation “absolutely fascinating.”\n“This investigation has been going on for a year. That is precisely the same time that the FBI launched their investigation, not just of the server, but of the Clinton Foundation in general,” he said, referring to the secret email server Hillary Clinton employed while secretary of state.\nBannon added a hat tip to Schweizer by pointing out that Clinton Cash was also released about four weeks before the FBI investigation began, putting years of research on the Clinton’s financial dealings into the public domain.\n“We like to think that the two are connected, and the areas of investigation hit on the exact point that we reported on in Clinton Cash, which is that money flows to the Clintons in exchange for official favors,” Schweizer agreed.\n“I think that the leak Terry McAuliffe is under investigation is only the beginning, and I have always believed that the email investigation is important, but really that is just an ancillary to the larger question of the Clintons getting paid off,” he said.\nBannon promised that the new film documentary based on Clinton Cash would introduce audiences to the “bad guys” who have been pouring money into the Clinton machine, and they are “the most evil people on the face of this planet.” He also predicted that the McAuliffe investigation would lead to criminal charges, and was the first of many forthcoming investigations into the Clinton network.\n“It’s going to be interesting to see how this plays out,” said Schweizer.\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/radio/2016/05/24/peter-schweizer-people-putting-huge-amounts-money-clintons-pockets-strong-rich-ties-oppressive-forces/"}
