{"authors":["Nina Kahn"],"date_download":"2018-10-31 01:48:42","date_modify":"2018-10-31 01:48:42","date_publish":"2018-09-13 22:21:19","description":"Right now, millions of people are evacuating their homes in anticipation of Hurricane Florence, the Category 2 storm that's just beginning its frightful journey through the southeastern U.S. And as if having to flee from your home wasn't scary…","filename":"data/vaneerConsumption/PetFriendlyHurricaneFlorenceReliefCentersOtherResourcesForPetOwners.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/b2f455ae-c8e3-48eb-afe8-8c1045df20e1-getty-502928966.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_pet-friendly-hurricane-florence-relief-centers-other-resources-for-pet-owners-11913777_1540950522.html","title":"Pet-Friendly Hurricane Florence Relief Centers & Other Resources For Pet-Owners","title_page":"Pet-Friendly Hurricane Florence Relief Centers & Other Resources For Pet-Owners","title_rss":"NULL","source_domain":"bustle.com","text":"Right now, millions of people are evacuating their homes in anticipation of Hurricane Florence, the Category 2 storm that's just beginning its frightful journey through the southeastern U.S. And as if having to flee from your home wasn't scary enough, many individuals also share their homes with animal companions — meaning they're also scrambling to find Hurricane Florence relief centers that accept pets. If you have animals, then you know they're undoubtedly part of the family, and leaving them behind is never an option. It's vital to prepare yourself for how to handle an emergency situation like this one while keeping them in mind. And in cases like this, finding evacuation centers that are open to pets is absolutely crucial. Thankfully, there are a lot of resources to help people find pet-friendly relief centers that will accept all members of the family — including the furry ones.\nFlorence is currently descending upon the Carolinas, bringing pouring rainstorms and forceful hurricane winds that are expected to last through Saturday, according to CNN. If you're located in the Carolinas, here are some resources to help you find a pet-friendly refuge:\nSpencer Platt/Getty Images News/Getty Images\nGiven that the storm is expected to rage throughout multiple states, there are going to be countless people looking for relief centers that will accept their beloved animals outside of the Carolinas, too. Here are some lists that provide helpful information about pet-friendly shelters for multiple states:\nBringFido, a pet travel and lifestyle company, has a running list of pet friendly evacuation shelters for Hurricane Florence that they will be reportedly be updating continuously as they receive more information. The site currently hosts extensive, separate lists of locations for the Carolinas, Georgia, and Virginia along with relevant contact information and other details.\nAnother helpful resource is PetFriendlyTravel.com, which also has an extensive list of pet friendly emergency evacuation shelters. This page isn't specific to Hurricane Florence, so it lists resources for almost every state in the US — but that said, it has updated it with many that are specific the current crisis, so be sure to search for those specifically.\nAnother resource to check is Red Rover, which lists pet-friendly resources for Hurricane Florence evacuees in North and South Carolina as well as Virginia. It provides contact information for each location and, when possible, notes whether or not the location is at capacity.\nMatt Cardy/Getty Images News/Getty Images\nAs you look for a pet-friendly evacuation shelter, keep in mind that there are some things most shelters will require of anyone coming in with their animal. Be sure to be prepared with the following information to ensure you and your animal get to safety as quickly as possible:\nMany shelters require current vaccination records and other relevant veterinary information on your pet. If you have access to these items, keep them with you.\nIf you have access to these items, keep them with you. You are responsible for all necessary pet care items. Most shelters will not provide anything to help with the care or feeding of your animal, so be sure to stock up on food, necessary medications, toys, doggy bags, or anything else you'll need to keep your animal healthy.\nMost shelters will not provide anything to help with the care or feeding of your animal, so be sure to stock up on food, necessary medications, toys, doggy bags, or anything else you'll need to keep your animal healthy. You'll be expected to stay with your animal at all times and are fully responsible for them. Your animal should always be by your side (that's for their safety, too). Make sure you have all the necessary leashes or carriers you need to transport your animals safely from place to place.\nAnd remember, regardless of the emergency, never leave your animal behind to suffer. Everyone deserves safety, including our furry family members, so do whatever it takes to find a safe place for yourself and your animal, and make sure to stay with them at all times.","url":"https://www.bustle.com/p/pet-friendly-hurricane-florence-relief-centers-other-resources-for-pet-owners-11913777"}
