{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:24","date_modify":"2018-10-30 21:07:24","date_publish":"2017-03-07 15:00:11","description":"A new petition calls for McGill University in Canada to expel a student union leader who urged Twitter followers to “punch a Zionist”.","filename":"data/vaneerConsumption/PetitionUrgesMcGillUToExpelStudentWhoSaidPunchAZionist.json","image_url":"https://media.breitbart.com/media/2017/02/McGill.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_07__1540933644.html","title":"Petition Urges McGill U To Expel Student Who Said 'Punch A Zionist'","title_page":"Petition Urges McGill U To Expel Student Who Said 'Punch A Zionist'","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A petition calling for McGill University to expel a student union leader who urged Twitter followers to “punch a Zionist” has received nearly 2,000 signatures, the Algemeiner reported.\n“We the undersigned call upon McGill University to immediately expel student leader Igor Sadikov for the incitement of violence,” the petition read, saying that the third-year political science major was in clear violation of McGill’s “code of conduct.”\nThe “MoveOn” petition will be presented to McGill President Suzanne Fortier ahead of a vote by the Society of McGill University legislative council this Thursday on a motion to remove Sadikov from his remaining student government posts, the report said.\nSadikov, a Boycott, Divestment and Sanctions (BDS) movement activist, denied he is anti-Semitic.\n“This tweet was not an attack against Jewish students, but on the adherents of a political philosophy,” he told the National Post when the story first came to light last month.\nThe petition includes signatories from Canada, the U.S., UK and South America, and comments such as: “No donations will be given” to McGill if Sadikov is not expelled and “How would McGill react if it was ‘punch a Muslim?’”\nPro-Israel students said the tweet added fuel to the fire of widespread anti-Israel sentiment already prevalent on McGill’s campus.\n“This is clear incitement to violence, which should not be tolerated on the part of any student, let alone a student politician,” Amanda Hohmann of B’nai Brith Canada’s League for Human Rights said in a statement after the tweet emerged.\nThe Algemeiner ranked McGill fourth on its 2016 list of the “40 Worst Colleges for Jewish Students” in North America.","url":"https://www.breitbart.com/middle-east/2017/03/07/petition-urges-mcgill-u-to-expel-student-leader-who-called-for-twitter-followers-to-punch-a-zionist/"}
