{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:49:41","date_modify":"2018-10-30 21:49:41","date_publish":"2015-07-13 19:22:44","description":"Amid moves to ban Confederate flags and remove statues of Confederate leaders, a petition to rename VA's Jefferson Davis Highway has launched.","filename":"data/vaneerConsumption/PetitionLaunchedtoRenameVirginiasJeffersonDavisHighway.json","image_url":"https://media.breitbart.com/media/2015/07/Jefferson-Davis-Highway-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_13__1540936181.html","title":"Petition Launched to Rename Virginia's Jefferson Davis Highway","title_page":"Petition Launched to Rename Virginia's Jefferson Davis Highway | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Amid moves around the country to banish Confederate flags from public view and remove statues of Confederate leaders from prominent places, an online petition to rename Virginia’s Jefferson Davis Highway has been launched.\nA statue of Davis, the Kentucky-born president of the Confederate States of America, has already been targeted for removal from his birth state’s capitol rotunda by Senate Majority Leader Mitch McConnell (R-KY) and Kentucky GOP gubernatorial candidate Matt Bevin.\nRegarding the Jefferson Davis Highway, the road winds from Northern Virginia southward “to the North Carolina line.” My Fox DC reports that it was originally “planned as a transcontinental highway that would begin in Washington, D.C., pass through many southern states, and end in San Diego.”\nThe Jefferson Davis Highway was created in the 1920s and sponsored by the Daughters of the Confederacy. Signatures for the petition to change the name are being gathered on Change.org, where visitors are told to “Stop Memorializing a Slave Owner and White Supremacist: Rename Jefferson Davis Highway.”\nOn June 23, Breitbart News reported that Virginia Governor Terry McAuliffe (D) had already undertaken the process of ending the issuance of “divisive and hurtful” license plate tags bearing the Confederate battle flag logo.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/07/13/petition-launched-to-rename-virginias-jefferson-davis-highway/"}
