{"authors":["Staff Reports"],"date_download":"2018-10-30 21:05:35","date_modify":"2018-10-30 21:05:35","date_publish":"2016-12-31 02:05:00","description":"UPDATE: Michael Vick will attend ceremony at Georgia Dome\nThe Falcons have invited former play...","filename":"data/vaneerConsumption/PetitionseekstokeepMichaelVickawayfromGeorgiaDomeSunday.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/31/Images/newsEngin.17301648_FALCONS-SAINTS-CC32.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_petition-se_89e9318da99fa32402f7618c302a0638__1540933535.html","title":"Petition seeks to keep Michael Vick away from Georgia Dome Sunday","title_page":"Petition seeks to keep Michael Vick away from Georgia Dome Sunday","title_rss":"NULL","source_domain":"ajc.com","text":"UPDATE: Michael Vick will attend ceremony at Georgia Dome\nThe Falcons have invited former players to take part in a ceremony at Sunday’s game against the Saints, the last regular-season game to be played in the Georgia Dome.\nBut some people feel former quarterback Michael Vick should not be welcome.\nA petition on Change.org is seeking to have the team revoke its invitation to Vick, who pleaded guilty in a federal dogfighting investigation in August of 2007.\nAs of Friday night, the petition had 18,554 supporters.\n“By inviting Michael Vick to participate in a ceremony on Sunday, the Falcons are honoring a convicted dogfighter who profited from cruelty to animals for years,” the page reads. “Please sign this petition and let the Falcons know that NFL fans do not support Vick and do not condone his actions.”\nVick was suspended from the NFL for a violation of the league’s personal-conduct policy, served 21 months in prison and two months in home confinement, and was cut by the Falcons.\nThe team acknowledged that there will be a ceremony, but has not released a list of the invited players.","url":"https://www.ajc.com/sports/football/petition-seeks-keep-michael-vick-away-from-georgia-dome-sunday/uUiNWOQGDI2smVMNVwbwWK/"}
