{"authors":["George Odling For Mailonline"],"date_download":"2018-10-23 02:10:16","date_modify":"2018-10-23 02:10:16","date_publish":"2016-01-29 16:28:38","description":"Pets Corner staff around the country will be given the training, which is the first of its kind in the UK. Staff from the store in Marple, Stockport, said they would not hesitate to give a dog the kiss of life.","filename":"data/vaneerConsumption/PetsCornerworkersarebeingtaughthowtoperformCPRoncatsanddogs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B203E200000578-0-image-a-208_1454082280604.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422993_Pets-Corner-workers-taught-perform-CPR-cats-dogs_1540260616.html","title":"Pets Corner workers are being taught how to perform CPR on cats and dogs","title_page":"Pets Corner workers are being taught how to perform CPR on cats and dogs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pet shop workers are learning how to give dogs the 'kiss of life' in a pioneering first aid course.\nStaff from Pets Corner are being taught CPR for cats and canines, along with how to save choking and poisoned animals and those injured in road accidents and fights.\nThe day-long session is the first ever 'pet and human first aid training course' in the country, the company said. It is being given to 600 employees across the UK this month, including the branch in Marple, Stockport .\nHalf a day is devoted to human first aid, while the second half focuses specifically on injured and suffering animals.\nAbout 600 Pets Corner staff members will be taught how to give the kiss of life to cats and dogs\nEmma Harrison, 28, works at the store in Marple, Stockport and will be the first member of staff to take the training next Tuesday.\nShe said: 'I think it is very important, especially to know what you are doing in case there is an accident in the store or if there is a customer who wants to know what to do.'\nMs Harrison said she would not hesitate to perform mouth-to-mouth first aid on a dog or cat if she had to.\nShe said: 'If it is going to save the dog’s life that’s something I would do, yes.\n'I am the first member of staff to be taking the training on Tuesday so everyone is very jealous.'\nEmma Harrison, pictured with Tim Richmond, will be one of the first members of staff to take the training, and said she would not hesitate to perform the kiss of life on a dog if it would save the animal's life\nLucy Ross, head of training at Pets Corner, said: 'At Pets Corner we have always strived to apply a genuine and ethical approach to everything we do and this includes having the best trained staff in the industry.\n'As well as our human customers we also welcome animals into our stores including hosting a regular 'Puppy Hour' session at each of our shops every Saturday - so it makes sense that our staff's first aid knowledge extends beyond the standard expectations.\n'It's our mission to provide all of our staff with the tools and knowledge they need to feel confident in helping both pets and people and for our customers to always be in safe hands when they visit any of our shops.'\nThe company, which has over 100 stores nationwide, teamed up with First Aid Support Training and The Canine First Aid Company to develop the specially-tailored course.","url":"https://www.dailymail.co.uk/news/article-3422993/Pets-Corner-workers-taught-perform-CPR-cats-dogs.html"}
