{"authors":["Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-23 01:56:40","date_modify":"2018-10-23 01:56:40","date_publish":"2017-03-10 10:29:08","description":"Real Housewives of Melbourne's Pettifleur Berenger, 52, and Lydia Schiavello, 47, flaunted their figures in glamorous frocks, at a VAMFF runway show, in Melbourne on Thursday.","filename":"data/vaneerConsumption/PettifleurBerengerandLydiaSchiavelloflauntfigures.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22983C00000578-0-image-a-91_1489146222952.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300578_Bachelor-s-Laurina-Fleur-leads-arrivals-VAMFF-show_1540259800.html","title":"Pettifleur Berenger and Lydia Schiavello flaunt figures","title_page":"Pettifleur Berenger and Lydia Schiavello flaunt figures | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They've become household names since becoming cast on the Real Housewives of Melbourne.\nAnd Pettifleur Berenger, 52, and Lydia Schiavello, 47, enjoyed the perks of stardom, at the VAMFF runway show in Melbourne on Thursday.\nThe glamorous stars flaunted their figures in neutral-hued frocks that flashed just a hint of skin.\nStar privileges! RHOM' Pettifleur Berenger (left) 52, and Lydia Schiavello (right) 47, flaunted their figures in glamorous frocks, as they attended a VAMFF runway show, in Melbourne on Thursday\nPettifleur, 52, highlighted her lean figure in a white floor-length frock.\nA plunging neckline revealed her delicate decolletage and offered just a hint of cleavage, while stitching under the bust accentuated her trim waist.\nNude open-toed heels and sparkling rings worked as stylish accessories.\nStyling her fair tresses sleek and in a centre part, the Sri Lanka-born star added a pop of colour with a matte burgundy lip.\nWhite on the mark: Sri Lanka-born Pettifleur highlighted her lean figure in a floor-length frock with a plunging neckline\nWorking it: Lydia flaunted her curves in a nude knee-length frock that featured black lace detailing\nLydia, 47, flaunted her curves in a nude knee-length frock that featured black lace detailing.\nPatent nude open-toed heels, a pastel pink leather clutch and layers of jewellery tied in with the glamorous look.\nLydia's dark locks framed her face and shoulders in loose curls, complemented with a dewy complexion, defined brows, a false set of lashes and a nude lip.\nSay cheese: The ladies posed for a photo on the media wall with a member of the Private Liaison's team\nMingling: Pettifleur and Lydia engaged with the crowd at the fashion festival\nCatch ups: No doubt the women had plenty to discuss, with the Real Housewives of Sydney having recently premiered\nAlso in attendance at the event was former Bachelor babe Laurina Fleure.\nThe 33-year-old showed off not only her figure, but her new beau Nicholas Agnew, at the Private Liaison's runway show.\nThe brunette stunned in a pink body-con frock that clung to her enviable frame.\nTickled pink! Ex Bachelor star Laurina Fleure, 33, flaunted her svelte frame in a body-con dress, alongside beau Nicholas Agnew\nKeeping accessories to a minimum, Laurina elongated her frame with a pair of nude strappy heels.\nStyling her locks in relaxed waves, the personality paired back her makeup palette with a dewy complexion, defined brows, lashings of mascara and a nude lip.\nBeau Nicholas, a 40-year-old Greek businessman, cut a low-key figure in a slim-fitting white T-shirt, teamed with distressed skinny leg jeans.\nTaupe suede boots and a statement watch worked as accessories.\nSporting a bronzed complexion, defined brows and a small amount of stubble, Nicholas styled his tresses into a voluminous do.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300578/Bachelor-s-Laurina-Fleur-leads-arrivals-VAMFF-show.html"}
