{"authors":["Caroline May"],"date_download":"2018-10-30 22:05:10","date_modify":"2018-10-30 22:05:10","date_publish":"2016-04-26 19:14:52","description":"Millennials are officially America’s largest living generation, according to a Pew Research Center analysis of new data from the U.S. Census Bureau. | Politics","filename":"data/vaneerConsumption/PewMillennialsNowLargestLivingGeneration.json","image_url":"https://media.breitbart.com/media/2014/12/Millennials-e1419997541106.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_26__1540937110.html","title":"Pew: Millennials Now Largest Living Generation","title_page":"Pew: Millennials Now Largest Living Generation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Millennials are officially America’s largest living generation, according to a Pew Research Center analysis of new data from the U.S. Census Bureau.\nFueled by immigration from abroad, the population of 18-34 year-olds in the U.S. has continued to grow, reaching 75.4 million in 2015.\nMeanwhile the population of Baby Boomers, or the previous largest living generation, is on the decline as deaths in that 51-69 year-old age range have outpaced new arrivals to the U.S. In 2015 Baby Boomers numbered 74.9 million people.\n“The Millennial generation continues to grow as young immigrants expand its ranks,” Pew’s report reads. “Boomers – whose generation was defined by the boom in U.S. births following World War II – are older and their numbers shrinking as the number of deaths among them exceeds the number of older immigrants arriving in the country.”\nAccording to Pew, Generation X, or people ages 35-50 years-old, are projected to surpass the population of Baby Boomers by 2028.\nAs Pew’s report indicates, the population of Millennials are expected to continue to grow for the next two decades.\n“With immigration adding more numbers to its group than any other, the Millennial population is projected to peak in 2036 at 81.1 million,” Pew reports. “Thereafter the oldest Millennial will be at least 56 years of age and mortality is projected to outweigh net immigration. By 2050 there will be a projected 79.2 million Millennials.”\nGeneration X, meanwhile is expected to continue growing and reach its highest point in 2018 at 65.8 million. Baby Boomers, now on the decline, peaked in 1999 at 78.8 million, will diminish to 16.8 million by 2050, according to Pew.","url":"https://www.breitbart.com/politics/2016/04/26/pew-millennials-now-largest-living-generation/"}
