{"authors":[],"date_download":"2018-10-30 14:22:15","date_modify":"2018-10-30 14:22:15","date_publish":"2016-03-19 00:00:00","description":null,"filename":"data/vaneerConsumption/PewsowndatashowsUSontrackforMuslimmajoritypopulationby2050.json","image_url":"https://www.americanthinker.com/images/bucket/2016-03/196274.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_03_pews_own_data_shows_us_ontrack_for_muslim_majority_population_by_2050_comments_1540909335.html","title":"Pew's own data shows U.S. on-track for Muslim majority population by 2050","title_page":"Blog: Pew's own data shows U.S. on-track for Muslim majority population by 2050","title_rss":"NULL","source_domain":"americanthinker.com","text":"Back in December, the Pew Research Center released an updated study of their Muslim population projections for the United States. Pew has provided three primary estimates of the Muslim proportion of the U.S. population. In 2007, it was 0.4%, increasing to 0.9% in 2014. The 2015 update was 1.0%. According to the updated study in question, Pew projected that despite the Muslim proportion of the American population increasing by 2.5 fold from 0.4% to 1.0% in just 8 years between 2007 and 2015, the Muslim proportion would only increase further by 2.1 fold up to 2.1% by the year 2050 (i.e., over the next 35 years). This goes along with a prediction by Pew back in early 2011 that the U.S. Muslim population would only reach 1.7% of the general population by 2030. This should sound bizarre, and when Pew's own data are plotted, it looks even more absurd. Perhaps the exponential rate of growth over the past eight years will suddenly tail off and effectively end within the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/03/pews_own_data_shows_us_ontrack_for_muslim_majority_population_by_2050_comments.html"}
n the U.S., since we are analyzing just limited polling data, rather than verified census data – all because “the U.S. Census Bureau does not collect data on religious affiliation in its demographic surveys or decennial census. Public Law 94-521 prohibits us from asking a question on religious affiliation on a mandatory basis.”","url":"https://www.americanthinker.com/blog/2016/03/pews_own_data_shows_us_ontrack_for_muslim_majority_population_by_2050.html"}
