{"authors":["John Pudner"],"date_download":"2018-10-30 19:56:01","date_modify":"2018-10-30 19:56:01","date_publish":"2016-02-08 14:17:00","description":"It has been 15 years since a team compiled fewer passing yards in a Super Bowl — and 41 years since a team had fewer passing yards and won the Super Bowl. But in a defensive struggle, Peyton Manning avoided the miscues of his adversary that led to the difference in the game. |","filename":"data/vaneerConsumption/PeytonManningCompilesFewestPassingYardsofAnyWinningSBQBSinceTerryBradshaw.json","image_url":"https://media.breitbart.com/media/2016/02/ap_ap-photo-508.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_02_08__1540929361.html","title":"Peyton Manning Compiles Fewest Passing Yards of Any Winning SB QB Since Terry Bradshaw","title_page":"Peyton Manning Compiles Fewest Passing Yards of Any Winning SB QB Since Terry Bradshaw | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"It has been 15 years since a team compiled fewer passing yards in a Super Bowl — and 41 years since a team had fewer passing yards and won the Super Bowl. But in a defensive struggle, Peyton Manning avoided the miscues of his adversary that led to the difference in the game.\nHere are the only teams in Super Bowl history to pass for fewer net yards than the Broncos did on Sunday (for those of you used to college football, in the pros sacks are counted as negative passing yards, while in college they are counted as negative rushing yards).\nSuper Bowl Team Year Passing Yds Result Denver 2016 104 W NY Giants 2001 86 L Denver 1990 103 L Miami 1983 80 L Denver 1978 35 L Pittsburgh 1975 84 W Minnesota 1975 102 L Miami 1974 63 W Miami 1973 69 W Washington 1973 87 L Dallas 1971 100 W\nPeyton Manning passed for just 141 yards and was sacked five times for a negative 37 yards to finish with a net 104 passing yards. The more mobile Cam Newton passed for 268 yards — but lost 64 yards on sacks — two of which resulted in touchdowns to provide the final 24-10 margin.\nThe Giants’ Kerry Collins managed only 86 yards passing against a Ravens defense that played as relentless as the Broncos did Sunday. The Ravens won that game 34-7, with only their kick off team allowing a score in 2001.\nThe last quarterback to win with so few yards passing was Terry Bradshaw, who completed nine of just 14 passes and let Franco Harris and Rocky Bleier and the Steel Curtain beat the Vikings 16-6, with only a blocked punt putting Minnesota on the board (the Vikings could not even make the 10-yard extra point).\nBob Griese went 14 of 18 total in back two back Super Bowls — instead handing off to the Dolphins’ Larry Csonka to win in 1973 and 1974. The only undefeated team also goes down in history as the only team to pass for fewer than 70 yards in a Super Bowl except for the same Dolphins the next year — and they won both games.","url":"https://www.breitbart.com/sports/2016/02/08/2968873/"}
