{"authors":[],"date_download":"2018-10-22 22:59:21","date_modify":"2018-10-22 22:59:21","date_publish":"2014-06-11 17:06:47","description":"Security researcher Brian Krebs reports that thousands of credit and debit card numbers were stolen from P.F. Chang's locations across the country.","filename":"data/vaneerConsumption/PFChangsInvestigatingMajorCreditCardBreach.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/502541/pfchangs_81450d9163769717f60e1d55fab06600.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_p-f-changs-investigating-major-credit-card-breach-n128576_1540249161.html","title":"P.F. Chang's 'Investigating' Major Credit Card Breach","title_page":"P.F. Chang's 'Investigating' Major Credit Card Breach","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nP.F. Chang’s is “currently investigating” claims that thousands of credit and debit card numbers had been stolen from restaurant locations across the country.\nBanks first noticed the breach when thousands of stolen credit and debit cards reportedly appeared on the same online black market where million of stolen Target cards were sold last year, according to security researcher Brian Krebs.\nSign up for top Technology news delivered direct to your inbox.\nThe cards were reportedly taken from P.F. Chang’s locations between March 2014 and May 19, 2014.\nA spokesperson for the Scottsdale-based national restaurant chain did not confirm the security breach.\n\"P.F. Chang's takes these matters very seriously and is currently investigating the situation, working with the authorities to learn more,\" the company said in a statement. \"We will provide an update as soon as we have additional information.\"\nIf confirmed, it would not be nearly as bad as the Target breach, which could have affected up to 110 million people. It would, however, be the largest theft since more than 200,000 cards stolen from national chain Sally Beauty were put up for sale in March.","url":"https://www.nbcnews.com/tech/security/p-f-changs-investigating-major-credit-card-breach-n128576"}
