{"authors":[],"date_download":"2018-10-22 22:16:24","date_modify":"2018-10-22 22:16:24","date_publish":"2014-05-09 16:03:01","description":"P&G took detergent off the shelves after it accidentally placed Neo-Nazi code numbers on its packaging.","filename":"data/vaneerConsumption/PGDetergentPulledinGermanyOverNeoNaziCodeFoundOnPackages.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/432146/ariel_e8adbe6f7584e348448db01c0931dc33.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_p-g-detergent-pulled-germany-over-neo-nazi-code-found-n101526_1540246584.html","title":"P&G Detergent Pulled in Germany Over Neo-Nazi Code Found On Packages","title_page":"P&G Detergent Pulled in Germany Over Neo-Nazi Code Found On Packages","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDetergent manufacturer Procter & Gamble has prompted anger in Germany after unintentionally placing a neo-Nazi code on promotional packages for Ariel washing powder.\nOutraged shoppers have posted pictures online of Ariel boxes featuring a large number \"88\" on a white soccer jersey.\nThe use of Nazi slogans in public is banned in Germany, which neo-Nazis often try to circumvent by using codes. They use \"88\" to represent the phrase \"Heil Hitler,\" because \"H\" is the eighth letter of the alphabet. Similarly, \"18\" is used to stand for \"A.H.\" or Adolf Hitler.\nProcter & Gamble acknowledged Friday that the number was \"unintentionally ambiguous.\" Spokeswoman Melanie Schnitzler said the company has stopped shipping the offending powder, as well as a liquid detergent that was being promoted as \"Ariel 18.\"\n\"We very much regret if there are any false associations and distance ourselves clearly from any far-right ideology,\" company spokeswoman Gabi Hassig said in a statement.\nThe company said that the number \"88\" was intended to show how many washes consumers could do with one package, 5 more than the usual 83. The same goes for the \"18\" that appeared on bottles of Ariel.\n- The Associated Press","url":"https://www.nbcnews.com/business/consumer/p-g-detergent-pulled-germany-over-neo-nazi-code-found-n101526"}
