{"authors":[],"date_download":"2018-10-30 14:07:17","date_modify":"2018-10-30 14:07:17","date_publish":"2018-10-30 00:05:17","description":null,"filename":"data/vaneerConsumption/PharmaceuticalIndustryPaysPriceforAllianceWithObamaAdministration.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/Barack_Obama_with_Health_and_Human_Services_Secretary_Sylvia_Mathews_Burwell_2015.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908437.html","title":"Pharmaceutical Industry Pays Price for Alliance With Obama Administration","title_page":"Pharmaceutical Industry Pays Price for Alliance With Obama AdministrationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"For years America’s drugmakers relied on Republicans to protect them. Democrats led the campaign for price controls and other restrictions. So the Pharmaceutical Research and Manufacturers of America, or PhRMA, the major industry association, worked closely with the GOP to protect its members from regulation.\nIn 1993, the Clintons launched their plan to nationalize the health care system. They treated major medical providers, and especially drugmakers, as enemies. Unsurprisingly, those attacked fought back, working closely with the GOP. On substance, the bureaucratic nightmare of a plan deserved to fail. More practically, by creating powerful enemies, the Clinton administration helped ensure its program’s failure.\nA decade later, when George W. Bush and the Republican Congress approved the budget-busting Medicare drug benefit—while making no effort to pay for it — they prohibited the Department of Health and Human Services from using its leverage to force down pharmaceutical prices. Despite sharp criticism at the time, the industry’s case was solid. Although the temptation to cut prices is strong, Uncle Sam’s dominant role in paying for elder drugs is artificial. Moreover, in a system where drug research depends on private profits, price controls inevitably cut investment in new medicines.\nHowever, when Barack Obama won the presidency, PhRMA switched sides. President Obama learned from the Clintons’ failure. His administration made a deal with all of the major industry players. The American Medical Association, American Hospital Association, and American Insurance Association all backed the Obama proposal. The reason was simple: by forcing Americans (while providing taxpayer subsidies) to purchase more policies, Uncle Sam would in turn hike demand for physician and hospital services. Increased regulation would be costly, but still would yield increased profits.\nAmerica’s big pill pushers made a similar calculation. PhRMA and the administration made a complex deal, which included industry contributions, estimated at $80 billion (mostly narrow Medicaid and Medicare discounts). But overall the pharmaceutical industry did well. In exchange, the administration promised no Medicare negotiation (“noninterference”), no reimportation of lower-priced drugs from other nations, no Medicare Part D rebates, and no change in Medicare Part B. John McDonough, who advised Sen. Ted Kennedy on health care, complained: “There was nothing in the deal that was a structural reform of the industry. They were first in line; they were on the winning side; they got a good deal that they could live with and they stuck to it.”\nFormer Rep. Billy Tauzin, who headed PhRMA at the time, justified the industry position: “If we were not at the table, it would be likely we would become the meal.” However, drugmakers did more than protect themselves. They made patients and taxpayers the meal instead. The industry spent lavishly to promote the Obama plan, coordinating with the administration while contributing $150 million in advertising. As such, the pill merchants made themselves accomplices, assisting the Obama administration in imposing its Rube Goldberg plan on the American people. Mission accomplished, as George W. Bush might have said.\nAlas, plans did not work out as planned. Obamacare’s roll-out was a mess. The perverse incentives encouraged insurers to shift more drug costs onto patients. Democrats lost control of Congress, allowing the GOP to chip away at Obama’s complicated system. In 2015, the Obama administration flouted the industry agreement, taking aim at patent protection for biologics and proposing discounts for Medicare.\nDrugmakers might have been shocked at being tossed under the bus, but the Democrats never pretended to be satisfied by Obamacare. Noted Rep. Sander Levin, who chaired the House Ways and Means Committee at the time: “I think those of us who worked hard for ACA never thought it was the last word. It was something that we had to build on. And prescription medicine is now one of the building blocks that isn’t in place yet.”\nThe lesson should be clear. Observed the Wall Street Journal: “In this double-cross lies a warning for the next CEOs and lobbyists who are deluded enough to trust Washington liberals.” So much for staying off the menu: “Everyone still got devoured eventually. Business does better when it unites to fight destructive legislation.”\nUnfortunately for drugmakers, the Obama administration’s perfidy might not be the worst. In 2016, Donald Trump got elected. He might end the pharmaceutical industry’s sweet deal.\nThe president is no fan of the pill pushers, who, he complained, were “getting away with murder.” He campaigned against drug producers and criticized high drug prices. And has promised to bring them down. So far the president’s proposed program is short on regulations. But if it falls short on results, he might consider more forceful means.\nIndeed, the New York Times recently reported that the industry is now war-gaming its nightmare scenario: the Democrats retake control of the House and work to turn President Trump’s designs into law. GOP health care lobbyist John E. McManus observed: “As the midterm elections approach, a feeling of foreboding has settled over the pharmaceutical industry.” Drugmakers fear the approach of “a perfect storm in 2019.”\nDemocrats have a lot of options, starting with Medicare pressing to lower prices, though a number of other policies could achieve the same objective. Rep. Jan Schakowsky, a liberal Illinois Democrat, threatened: “Despite their army of lobbyists, drug companies should be very, very worried. Drug costs will be one of the first things on our agenda” if her party gains control.\nIf the House turns into a political chamber of horrors, Big Pharma plans to rely on the Senate. But that may prove to be a weak reed. Sen. Orrin Hatch, who chairs the Finance Committee, is retiring. Replacing him is likely to be Sen. Chuck Grassley, a more populist legislator from Iowa, a Plains state which is no friend of big business. No surprise, then, that drugmakers are taking no chances. So far the pharmaceutical industry has contributed $12 million to candidates in both parties, 60 percent of that to Republicans. (The industry also spent $267 million on lobbying in 2017 and 2018.)\nPrice controls are bad no matter who proposes and imposes them. However, Obamacare, by expanding federal control over the health care system, made greater federal restrictions almost inevitable. In short: PhRMA set the stage for its own defeat. The only question that remained was when and where price controls would be imposed.\nThus, the GOP should not go out of its way to protect an industry which sold its soul, and the American health care system, for mess of pottage. Indeed, the appropriate response if PhRMA and its members come calling is to suggest that they get in touch with their old friends, Barack, Nancy, and Harry. The pill pushers should ask that trio to set everything right.\nAs tempting as it is to protect the industry, since price controls and other government regulations create extensive collateral damage, it also is important for businesses that collaborate to pay a high price for their treachery. Especially when their actions result in economy-wide harm, as in the case of Obamacare.\nAmericans are going to suffer under Obamacare for years to come. Unfortunately, repeal appears to be a long-shot, as does serious reform, which nevertheless should remain a priority for GOP lawmakers. In the meantime, no industry which helped the Obama administration nationalize the medical system should escape the consequences of doing so. If the big pill pushers come calling on Capitol Hill in the new year begging for relief, Republican legislators should turn a deaf ear. The industry deserves everything the president promised to give them.\nDoug Bandow is a Senior Fellow at the Cato Institute. A former Special Assistant to President Ronald Reagan, he is author of The Politics of Envy: Statism as Theology.","url":"https://spectator.org/pharmaceutical-industry-pays-price-for-alliance-with-obama-administration/"}
