{"authors":["Raheem Kassam"],"date_download":"2018-10-30 21:16:46","date_modify":"2018-10-30 21:16:46","date_publish":"2015-10-26 11:18:16","description":"According to the Hollywood Reporter, fame-deprived Pharrell Williams – who performed his best work as part of the funk-rap band No One Ever Really Dies (N.E.R.D) – used his platform at MTV’s European Music Awards (EMAs) in Milan last night to urge European nations to “let them in”.","filename":"data/vaneerConsumption/PharrellWilliamsTellsEuropeToLetAllTheMigrantsIn.json","image_url":"https://media.breitbart.com/media/2015/10/imrs.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_26__1540934206.html","title":"Pharrell Williams Tells Europe To Let All The Migrants In","title_page":"HAPPY: Pharrell Williams Tells Europe To Let All The Migrants In","title_rss":"NULL","source_domain":"breitbart.com","text":"According to the Hollywood Reporter, fame-deprived Pharrell Williams – who performed his best work as part of the funk-rap band No One Ever Really Dies (N.E.R.D) – used his platform at MTV’s European Music Awards (EMAs) in Milan last night to urge European nations to “let them in”. He was of course referring to Europe’s migrant crisis, a topic on which I’ve no doubt a 42-year-old, Virginia-born hip-hop producer is an expert.\nPharrell Williams closed out the ceremonies with a performance of “Freedom,” dedicated to the refugee crisis in Europe. The crowds in both the Piazza Duomo and Mediolanum sang along with their fists pumped in the air.\nHow cute. I wonder how many migrants Mr. Williams has welcomed into his Hollywood mansion, to share in the spoils of his $80 million net worth? 500? 1000? No, come on, it must be 5000. Surely someone as magnanimous as “Skateboard P“ isn’t just asking the lowly populations of Europe to shoulder the blame? The people that are, in a lot of cases, less wealthy than the migrants paying up to $10,000 a time to cross the Mediterranean. But I’m sure Mr. Skateboard’s geopolitical advisors had filled him in on that point already.\nHe started the song with a new refrain of “Let them in!” “Freedom is something you’re born with,” he continued. “No one has to give it to you.”\nWhile it is refreshing to hear a Hollywood liberal (he is of course supporting Hillary Clinton in the U.S. elections) admit that government is not the progenitor of freedom, I’m afraid he makes a fairly basic error: many migrants aren’t looking for freedom, they’re looking for a free ride.\nThese two things aren’t the same, as even the most left-wing of aid agencies discovered recently, when they found that “most of [the migrants in Calais] haven’t any valid reason… they want to go [to the UK] to get money, a better economic situation…”\nThousands of fans in the Piazza Duomo held up a a massive “Freedom” flag made from flags of nations from all over the world, kicking off the MTV Freedom campaign. The global network has partnered with UNICEF, aiming to raise awareness and donations in support of the current refugee crisis in Europe (freedom.mtvema.com).\nBrilliant. A $6.2 billion U.S. company sets up a website asking for ordinary Europeans to donate to an already well (taxpayer) funded organisation – UNICEF – which wants more economic migrants settled in their already crowded towns and cities.\nThankfully, it also looks like MTV’s tugging on the heart strings, with Pharrell in tow, didn’t quite work as they had hoped.\nOnly 339 of their 1.1 million Twitter followers backed the hashtag and retweeted their call to arms. Compared with say, 30,000+ retweets for their messages about Justin Bieber, Skrillex, and 5 Seconds of Summer, this is pretty paltry.","url":"https://www.breitbart.com/europe/2015/10/26/kanye-west-baby-name-advisor-pharrell-williams-tells-europe-to-let-all-the-migrants-in-no-thanks/"}
