{"authors":[],"date_download":"2018-10-30 14:08:37","date_modify":"2018-10-30 14:08:37","date_publish":"2018-10-30 13:18:00","description":"Pharrell Williams is threatening to sue the president unless organizers of President Donald Trump&rs...","filename":"data/vaneerConsumption/PharrellWilliamsthreatenstosueTrumpoveruseofHapp.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Videos/4518930.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_pharrell-will_1ab6bec6c42c6381c209cde67ccb5a85__1540908517.html","title":"Pharrell Williams threatens to sue Trump over use of ‘Happ","title_page":"Pharrell Williams threatens to sue  Trump over use of ‘Happ","title_rss":"NULL","source_domain":"ajc.com","text":"Pharrell Williams is threatening to sue the president unless organizers of President Donald Trump’s rallies stop using his song “Happy.”\nThe singer’s attorney sent a cease and desist letter to the president to stop playing his song, according to CNN.\nIt was played hours after a deadly shooting at a Pittsburgh synagogue left 11 dead, CNN reported.\n>> Read more trending news\nHoward King wrote, according to CNN:\n“On the day of the mass murder of 11 human beings at the hands of a deranged ‘nationalist,’ you played the song ‘Happy’ to a crowd at a political event in Indiana. There was nothing ‘happy’ about the tragedy inflicted upon our country on Saturday and no permission was granted for your use of this song for this purpose.”\nPresident Donald Trump speaks at the 91st Annual Future Farmers of America Convention and Expo at Bankers Life Fieldhouse in Indianapolis, Saturday, Oct. 27, 2018. (AP Photo/Andrew Harnik)\nKing alleges that the use of the song without the consent of Williams goes against copyright and trademark.\n“Pharrell has not, and will not, grant you permission to publicly perform or otherwise broadcast or disseminate any of his music,” King wrote in the letter, Time reported.\nTrump and his administration have also received letters from other groups including The Rolling Stones, Steven Tyler and Adele, CNN reported.","url":"https://www.ajc.com/entertainment/pharrell-williams-threatens-sue-trump-over-use-happy-rally-after-synagogue-massacre/1ntncG69Z4Txmxwe06GCrK/"}
