{"authors":[],"date_download":"2018-10-23 03:26:07","date_modify":"2018-10-23 03:26:07","date_publish":"2016-01-29 18:20:26","description":"US swim star Michael Phelps, hopeful of adding to his record of 22 Olympic medals in August at Rio, showed off his fitness at a college basketball game by st...","filename":"data/vaneerConsumption/Phelpsstripsasfreethrowdistraction.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i4rs-4PuZeKVXE7cd9005b2c876d1242c-628_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423248_Phelps-strips-free-throw-distraction_1540265167.html","title":"Phelps strips as free throw distraction","title_page":"Phelps strips as free throw distraction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Phelps strips as free throw distraction\nUS swim star Michael Phelps, hopeful of adding to his record of 22 Olympic medals in August at Rio, showed off his fitness at a college basketball game by stripping down to his swimsuit.\nThe 30-year-old American, whose record haul of 18 gold medals includes a one-Games record of eight at the 2008 Beijing Olympics, appeared Thursday night at a home game of Arizona State University, where he is training for his next Olympic bid.\nWith 6:13 elapsed in the second half and Oregon State's Stephen Thompson going to the free throw line, students behind the baseline near the basket wheeled out a black curtain known as the Curtain of Distraction, hoping to break the concentration of opposing free throw shooters.\nMichael Phelps waves to the crowd after winning the 200 Meter Butterfly finals at the AT&T Winter National Championships at the Weyerhaeuser King County Aquatic Center on December 5, 2015 in Federal Way, Washington ©Otto Greule Jr (Getty/AFP/File)\nClowns and men dressed as babies have emerged from the curtain before, but this time the unveiling revealed Phelps between two shirtless students.\nPhelps, wearing a yellow swim cap and gold medals around his neck, quickly removed his warm-up outfit to reveal his physique, clad only in a gold swimsuit.\nPhelps danced and flexed his muscles to huge cheers from the crowd as Thompson missed both free throws in what eventually turned out to be an 86-68 Arizona State victory.\n\"We just killed it!!!!\" Phelps posted on Twitter.\nArizona State coach Bobby Hurley was happy to have help from an Olympic champion, even one not known for basketball skills.\n\"He made a major contribution to the game. It was one of the highlights of the night for sure,\" said Hurley, dismissing any notion of impropriety by the display.","url":"https://www.dailymail.co.uk/wires/afp/article-3423248/Phelps-strips-free-throw-distraction.html"}
