{"authors":["Graham Poll For The Daily Mail"],"date_download":"2018-10-22 23:44:51","date_modify":"2018-10-22 23:44:51","date_publish":"2016-01-28 12:53:23","description":"GRAHAM POLL: If everything that a referee says to you that you don't like, you put in the media, then maybe a referee should do the same. Kids might not idolise these players so much.","filename":"data/vaneerConsumption/PhilJagielkashouldnthaveruntomediatocallMartinAtkinsonarrogantGrahamPollsays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30A47E7B00000578-0-image-a-36_1453985542185.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420897_Phil-Jagielka-shouldn-t-run-media-called-Martin-Atkinson-arrogant-Come-players-grow-bit_1540251891.html","title":"Phil Jagielka shouldn't have run to media to call Martin Atkinson arrogant, Graham Poll says","title_page":"Phil Jagielka shouldn't have run to media to call Martin Atkinson arrogant, Graham Poll says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"I know Martin Atkinson and I would describe him as one of the least arrogant men I have ever met.\nHowever, if you read the comments that are attributed to Martin then you can understand why Phil Jagielka, who I know and respect, felt he was dealt with in quite an arrogant and off-hand manner.\nBut what really annoys me is that referees take so much nasty abuse and comments from players and when one might have said something which was perceived as arrogant, a player chooses to run to the media and tell all.\nPhil Jagielka (second left) looks on as Sergio Aguero scores Manchester City's winner against Everton\nLeon Osman protests to referee Martin Atkinson during the Capital One Cup semi-final second leg\nPlayers don't need to be kind about referees but what they need to be is a little more even-handed.\nIf everything that a referee says to you that you don't like, you put in the media, then maybe a referee should do the same. Kids who are listening to these things then might not idolise these people so much.\nIt came out that Mark Clattenburg said 'you've changed' to Adam Lallana, who wasn't happy about it. Wow. And now Martin Atkinson.\nYou think, 'come on guys, these are the two top referees in the country that are going to the Euros, they are good referees'.\nIf they make a comment I just think players: grow up a bit. Come on.","url":"https://www.dailymail.co.uk/sport/football/article-3420897/Phil-Jagielka-shouldn-t-run-media-called-Martin-Atkinson-arrogant-Come-players-grow-bit.html"}
