{"authors":["Ryan Smith For Mailonline"],"date_download":"2018-10-23 04:23:10","date_modify":"2018-10-23 04:23:10","date_publish":"2017-03-16 15:47:19","description":"She's raising three beautiful children - Harry, seven; Bell, five, and two-year-old Chester - with her husband of a decade, Dan Baldwin.","filename":"data/vaneerConsumption/PhillipSchofieldjokesaboutHollyhavingmorebabies.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E55740C00000578-0-image-a-135_1489682942237.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320626_Phillip-Schofield-jokes-Holly-having-babies_1540268590.html","title":"Phillip Schofield jokes about Holly having more babies","title_page":"Phillip Schofield jokes about Holly having more babies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's raising three beautiful children - Harry, seven; Bell, five, and two-year-old Chester - with her husband of a decade, Dan Baldwin.\nBut on Thursday morning, her This Morning co-host Phillip Schofield joked that he's taken extreme measures to ensure that she'll never take maternity leave again.\nAs the pair interviewed guest Abbey Clancy about her family plans, Phillip quipped: 'I won’t let Holly have any more children because she has time off the show.\nScroll down for video\nSnip decision: Phillip Schofield joked that he gave Holly Willoughby's husband Dan Baldwin a vasectomy on Thursday's broadcast of ITV show This Morning\n'I snuck in [to her house] one night and gave Dan the snip - he still doesn't realise!'\nHis playful jab prompted Holly to burst into a fit of giggles - which appeared to be theme of her morning, as minutes earlier she struggled to stop laughing.\nThings started to unravel for the blonde beauty half an hour into the live broadcast, when she mistakenly read from Phillip's cue card during a preview segment.\nStay! Phil joked that he didn't want his co-presenter to take anymore time away from the show\nLoved up: The blonde beauty has three children with her husband of a decade, Dan Baldwin\nThe giggles: Holly was also seen descending into a fit of giggles after reading the wrong cues\nOops! Phil looked at Holly in mock horror as she realised her repeated error on the live show\n'Did you get bored of what I was saying?' asked an incredulous Phil, who joked as he returned to his cue card: 'Let's see if she lets me finish this one.'\nWith Holly already laughing her way through their camera time, it was then her turn to introduce glamour model Abbey onto the show.\nBut she soon ended up reading over Phil's lines once again, prompting her to descend into a bout of uncontrollable laughter.\nCant stop, won't stop: While Holly tried to keep things professional, the laughs kept on coming\nI give up! She eventually fell back into the studio couch and embraced the bout of laughter\nOne-woman show: Phil joked that she could read all of his cue cards, if she felt so inclined\n'I don't know what's happened to me,' she said, as she slumped back into the studio couch while Phil laughed at her. 'I'm so sorry!'\n'Do you wanna do the whole thing?' Phil asked Holly. 'Why don't you do the whole thing? It's fine. I don't get paid by the word... You carry on.'\nIt took for Britain's Next Top Model host Abbey to cut in on the impromptu merriment, as she asked them to stop making her laugh.\n'I can't laugh because of me wisdom tooth,' explained Liverpudlian mother-of-two, who's married to Stoke City striker Pete Crouch. 'It's swollen and it's hurting, so stop making me laugh!'\nWisdom: Guest Abbey Clancy cut in to reveal that their impromptu moment of merriment was actually causing her pain, as she'd just had her wisdom tooth removed","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320626/Phillip-Schofield-jokes-Holly-having-babies.html"}
