{"authors":[],"date_download":"2018-10-22 20:55:17","date_modify":"2018-10-22 20:55:17","date_publish":"2016-01-28 05:05:25","description":"Tributes in the basketball-crazy Philippines flowed on Thursday for Carlos \"The Big Difference\" Loyzaga, a two-time Olympian widely regarded as the nation's ...","filename":"data/vaneerConsumption/PhilippinesgreatestbasketballplayerLoyzagadies.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5p2-4vVdYopwYQ7f641721b07a8e2d84-615_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420382_Philippines-greatest-player-Loyzaga-dies_1540241717.html","title":"Philippines' greatest basketball player Loyzaga dies","title_page":"Philippines' greatest basketball player Loyzaga dies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Philippines' greatest basketball player Loyzaga dies\nTributes in the basketball-crazy Philippines flowed on Thursday for Carlos \"The Big Difference\" Loyzaga, a two-time Olympian widely regarded as the nation's greatest player who died aged 85.\nLoyzaga, who was part of the team that won the bronze medal at the 1954 Rio de Janeiro world championships in the Philippines' best finish at any international basketball tournament, died at a Manila hospital on Wednesday.\n\"He was a legend,\" said Joey Romasanta, spokesman for the Philippine Olympic Committee which led the basketball-crazy nation's tributes for the Filipino great.\nThe Philippines reached the finals of the last two FIBA Asia championships, losing to Iran in 2013 and to China in 2015, and qualified for the FIBA World Cup in Spain in 2014, finishing in 21st place ©Cristina Quicler (AFP/File)\n\"We were very fortunate to have had somebody like him play basketball for our team.\"\nAt a time when large chunks of the globe were still learning to play the game, the swift-footed, 1.91-metre (6ft 3in) do-it-all centre was putting his young nation, a former US colony, on the basketball map.\n\"The Big Difference\", so named because of his importance to the team, averaged 15.7 points at the 1956 Melbourne Olympics, and 10.6 points per game at the 1952 Olympics in Helsinki.\nHe also made the All Stars team of best players at the 1954 world championships.\nWith Loyzaga as anchor, the Philippines completely dominated Asian basketball, winning four straight Asian Games gold medals between 1951 and 1962.\nThey also won two Asian Basketball championships, now known as FIBA Asia championship, in 1960 and 1963. He then coached the nation to victory in 1967.\n\"Just got word that 'The Big Difference' Caloy Loyzaga just passed. We will be 4ever grateful & honored. RIP #Legend,\" tweeted former national team coach Vincent \"Chot\" Reyes.\nThe professional Philippine Basketball Association league paid tribute to Loyzaga late Wednesday with a moment of silence and a short video presentation at half-time of the 2016 Philippine Cup finals' game five.\nLoyzaga had been in delicate health since suffering a stroke in 2011.\nHis retirement in 1964, to pursue a brief coaching career, ushered in the Philippines' long decline in the sport, now dominated in Asia by China and Iran.\nHowever they have enjoyed a mini-revival in recent years, helped by the aggressive scouting of US-based players with Filipino parentage and the naturalisation of ex-National Basketball Association big man Andray Blatche.\nThe Philippines reached the finals of the last two FIBA Asia championships, losing to Iran in 2013 and to China in 2015.\nThey also qualified for the FIBA World Cup in Spain in 2014, finishing in 21st place.","url":"https://www.dailymail.co.uk/wires/afp/article-3420382/Philippines-greatest-player-Loyzaga-dies.html"}
