{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:51:37","date_modify":"2018-10-30 18:51:37","date_publish":"2016-05-17 16:56:05","description":"Thursday on Fox News, Phil Robertson weighed in on the presidential election and discussed why he will vote for Donald Trump in November.","filename":"data/vaneerConsumption/PhilRobertsonAmericasProblemsAreSpiritualNotPolitical.json","image_url":"https://media.breitbart.com/media/2016/05/Phil-Robertson-RLC-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_05_17__1540925497.html","title":"Phil Robertson: America's Problems Are 'Spiritual,' Not 'Political'","title_page":"Phil Robertson: America's Problems Are 'Spiritual,' Not 'Political' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Phil Robertson, star of the upcoming documentary Torchbearer, joined Fox News’s Sean Hannity on Thursday to weigh in on the presidential election and discuss why he will be voting for GOP frontrunner Donald Trump in November.\n“Sean, I’ve been watching you and a lot of guys like you,” Robertson told the Fox News host. “Ya’ll are what I call political warriors. In my case, my view of it is a little different than yours is.”\n“I’m more into the spiritual part,” the Duck Dynasty star explained. “The issue in America, in my opinion, is much larger than presidents, prime ministers, kings. The issue before us, in my opinion, is a spiritual one. In other words, I don’t think it’s a political fix. Politicians can help.”\nRobertson said he had initially backed Texas Sen. Ted Cruz, because he is a “strict Constitutionalist” and a “Jesus man” who would use religious values to guide his policy decisions.\n“But that’s gone, and they’re out,” he added:\nMy hope is that Donald Trump — I know he has a lot of common sense … So I have hope. But you gotta remember something: All men, Sean, are like grass — and all their glory, like the flowers of the field. The grass withers, the flowers fall, but the word of the Lord stands forever. We have a spiritual problem in America, Sean, that’s the crux of the matter.\nRobertson said his upcoming film Torchbearer — directed by Breitbart Executive Chairman Stephen K. Bannon and written by Breitbart Senior West Coast Editor Rebecca Mansour — deals “precisely” with America’s spiritual issues:\nWhat’s happened is, as these empires rise, they remove God as their anchor. They let men determine what’s right, what’s wrong, what’s good, what’s evil, and how much your life is worth. The documentary looks at a historical account, going all the way back thousands of years, and it’s always the same: Once you remove God, then the carnage starts.\nWatch Robertson’s appearance on Hannity above and the trailer for Torchbearer below:\nFollow Daniel Nussbaum on Twitter: @dznussbaum.","url":"https://www.breitbart.com/entertainment/2016/05/17/phil-robertson-americas-problems-spiritual/"}
