{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-22 23:13:21","date_modify":"2018-10-22 23:13:21","date_publish":"2017-03-16 06:04:16","description":"Rep. Gary Alejano's complaint alleged that the Philippine president Duterte committed bribery and corruption, violated the constitution and betrayed the public trust with his actions.","filename":"data/vaneerConsumption/PhilippinelawmakertoimpeachDuterteoverdrugfight.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E52894400000578-0-image-a-124_1489677065204.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318998_Philippine-lawmaker-seeks-impeach-Duterte_1540250001.html","title":"Philippine lawmaker to impeach Duterte over drug fight","title_page":"Philippine lawmaker to impeach Duterte over drug fight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Philippine politician has filed an impeachment complaint against President Rodrigo Duterte over the the thousands of deaths caused by his drug crackdown.\nRep. Gary Alejano's complaint alleged that Duterte committed bribery and corruption, violated the constitution and betrayed the public trust with his actions.\nThe bid, which addressed the crackdown that has sparked extrajudicial killings, faces an uphill battle because Duterte's allies hold an overwhelming majority in Congress.\nA Philippine politician has filed an impeachment complaint against President Rodrigo Duterte (pictured) over the the thousands of deaths caused by his drug crackdown\nMembers of the Philippine National Police (PNP) operatives walks along a street during their anti-drug operations in metro Manila on Thursday\nMembers of the PDEA inspect suspected drug pushers and users during their anti-drug operations on Thursday\nThe impeachment, filed at the House of Representatives, also covers Duerte's failure to declare huge bank deposits as required by law.\n'We are of the firm belief that President Duterte is unfit to hold the highest office of the land and that impeachment is the legal and constitutional remedy to this situation,' said Alejano.\nAlthough opposition lawmakers lack the numbers to impeach Duterte, Alejano said there was a need to stop his 'excesses and crimes.'\nA vote of a third of the House's more than 290 members is needed to send the complaint to the Senate for trial. More than 260 of House members belong to a pro-Duterte bloc.\n'We understand that in terms of numbers we face an uphill battle,' he said. 'But precisely, the battle for impeachment must be fought both inside and outside the halls of Congress,' adding public pressure should sway lawmakers to vote rightfully.\nMembers of the Philippine Drug Enforcement Agency (PDEA) and Philippine National Police (PNP) operatives meet during their anti-drug operations in Quezon city, Philippines\nAlejano cited the 8,000 deaths of drug suspects under the crackdown to underscore the urgency of the first impeachment attempt in Duterte's presidency\n'Our role is merely to be the gate-openers for those who want to be a part of this historic and moral crusade,' Alejano said.\nAlejano cited the 8,000 deaths of drug suspects under the crackdown to underscore the urgency of the first impeachment attempt in Duterte's presidency. Other opposition politicians have backed calls for such a move.\nHouse Speaker Pantaleon Alvarez, a Duterte ally, called the impeachment bid 'stupid,' saying it was based on fabricated allegations.\n'They are not even in the league of Don Quixote so this impeachment won't fly. It will crash like a rudderless plane flown by witless pilots,' government Solicitor-General Jose Calida said.\nAlejano, a former marine officer who was accused of involvement in a failed coup attempt several years ago, denied his complaint was part of an extra-constitutional attempt to unseat Duterte\nAlejano echoed rights activists' label of Duterte as a 'cheerleader' for encouraging the 'summary executions' of drug suspects in violation of their rights to life and due process\nPresidential spokesman Ernesto Abella suggested the impeachment bid and opposition criticism were possible efforts to destabilize the Duterte administration.\nAlejano, a former marine officer who was accused of involvement in a failed coup attempt several years ago, denied his complaint was part of an extra-constitutional attempt to unseat Duterte.\nIn his complaint, Alejano echoed rights activists' label of Duterte as a 'cheerleader' for encouraging the 'summary executions' of drug suspects in violation of their rights to life and due process.\nHe cited the president's repeated threats to kill drug lords and order to law enforcers and civilians to shoot drug suspects if they fight back.\nHe also mentioned the Senate testimony of a retired police officer and a former militiaman who said they were members of a death squad under Duterte when he was a southern mayor.\nSuspected drug pushers and users sit beside tombs during the PDEA operatives' anti-drug operations inside the cemetery\nHe cited the president's repeated threats to kill drug lords and order to law enforcers and civilians to shoot drug suspects if they fight back\nMembers of the PDEA stand on guard during their anti-drug operation\nThe two separately testified they were involved in hundreds of killings of drug suspects and political opponents of Duterte in Davao city.\nDuterte has denied he condoned extrajudicial killings. He has not responded in detail to the two men's allegations.\nAlejano's complaint also cited accusations by opposition Senator Antonio Trillanes IV, who accused Duterte of failing to declare more than 2 billion pesos ($40 million) in bank deposits as required by law. Duterte has denied any wrongdoing.\nIn November 2000, the House sent impeachment charges for largescale corruption against then-President Joseph Estrada to the Senate for trial for the first time in Philippine history.\nProsecutors walked out of the trial two months later due to an impasse over evidence, sparking massive protests that forced Estrada to leave the presidential palace.","url":"https://www.dailymail.co.uk/news/article-4318998/Philippine-lawmaker-seeks-impeach-Duterte.html"}
