{"authors":["Associated Press"],"date_download":"2018-10-22 20:56:27","date_modify":"2018-10-22 20:56:27","date_publish":"2016-01-28 05:19:17","description":"MANILA, Philippines (AP) — The Philippine economy grew 5.8 percent in 2015, short of even lowered government expectations after being hampered by a weak worl...","filename":"data/vaneerConsumption/Philippinegrowthshortoftargetat58percentin2015.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420297_Philippine-growth-short-target-5-8-percent-2015_1540241787.html","title":"Philippine growth short of target at 5.8 percent in 2015","title_page":"Philippine growth short of target at 5.8 percent in 2015 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Philippine growth short of target at 5.8 percent in 2015\nMANILA, Philippines (AP) — The Philippine economy grew 5.8 percent in 2015, short of even lowered government expectations after being hampered by a weak world economy, El Nino and slow government spending in the first half of the year.\nThe government initially forecast growth of 7-8 percent for 2015 but later lowered its projection to 6-6.5 percent.\n\"Though this is lower than what we targeted for the year, this growth is respectable given the difficult external environment,\" Economic Planning Secretary Arsenio Balisacan said Thursday.\nThe Philippines has been one of the fastest growing economies in Asia for several years. Despite increased government efforts to raise living standards, the country of more than 100 million still faces considerable challenges including its vulnerability to typhoons and other natural disasters, poverty, corruption and poor infrastructure.\nThe economy expanded 6.3 percent in the last quarter of the year, the fastest for 2015. It was up from 6.1 percent the previous quarter but down from 6.6 percent in the same period of 2014.\nBalisacan said growth has averaged 6.2 percent in the past six years, which is the best performance since the late 1970s. The growth has not been due to unsustainable borrowings like in the 1970s and short-lived portfolio capital but fueled by investments that create jobs and increase incomes, he said.\nHe said last year's growth was driven by much stronger domestic demand and government spending that grew 9.4 percent compared to the previous year's 1.7 percent. Growth in public and private investments more than doubled, primarily led by public construction.\nService industries were also robust, growing 6.7 percent in 2015 from 5.9 percent in 2014. Industry expanded 6.0 percent while agriculture grew a tepid 0.2 percent.\nFinance Secretary Cesar Purisima said the Philippines was well-positioned to withstand turbulence in financial markets caused by uncertainty about the strength of the global economy.","url":"https://www.dailymail.co.uk/wires/ap/article-3420297/Philippine-growth-short-target-5-8-percent-2015.html"}
