{"authors":[],"date_download":"2018-10-30 19:51:56","date_modify":"2018-10-30 19:51:56","date_publish":"2016-11-01 23:30:47","description":"The Atlanta Hawks and the city have come to terms on a deal that includes public funds to renovate P...","filename":"data/vaneerConsumption/PhilipsArenatoget1925millionfacelift.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/01/Images/newsEngin.16658186_110216-philips-ba05.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_p_026f4018f220943cc36d213b43600cc2__1540929116.html","title":"Philips Arena to get $192.5 million facelift","title_page":"Philips Arena to get $192.5 million facelift","title_rss":"NULL","source_domain":"ajc.com","text":"The Atlanta Hawks and the city have come to terms on a deal that includes public funds to renovate Philips Arena, a move that could keep the NBA franchise downtown through 2046.\nThe $192.5 million agreement extends the Hawks lease by 18 years and calls for taxpayers to pay $142.5 million, or about three-quarters, to upgrade the arena, with the Hawks to contribute $50 million. The Tuesday announcement comes almost exactly three years after the Braves unveiled plans to leave Turner Field for a new suburban ballpark in Cobb County, which will open next year, and as construction continues on a new stadium for the Falcons.\nMayor Kasim Reed said no tax hike or general fund dollars will be used to pay the city’s share of the Philips deal. The bulk will come from an extension of the city’s rental car tax, which state lawmakers approved earlier this year.\nPhilips construction will take place mostly during the Hawks’ offseason, with completion expected in time for the 2018-2019 season, the 50th anniversary season of the Hawks’ move from St. Louis, team CEO Steve Koonin said.\nReed said the deal will help seed redevelopment in the area of Centennial Olympic Park and the Gulch, the vast tangle of parking lots and rail lines that sits below Philips and stretches to Five Points.\nTony Ressler said Hawks ownership has shown its commitment to the city by the signing of a top caliber coach and free agents and its drive to win a championship. He said the team will be a contributor to downtown’s revitalization.\n“We are utterly committed to the city of Atlanta and its downtown area, and I believe this agreement will create a world-class Philips Arena,” Ressler said.\nPublic funding of pro sports facilities is controversial, as critics say those dollars would be better spent elsewhere.\nA deal to overhaul Philips would be the fifth pro sports stadium or practice facility project to receive public funding from a metro Atlanta jurisdiction in the past few years. The others are the Mercedes-Benz Stadium and SunTrust Park, as well as the training facilities of the Hawks and Atlanta United.\nSeparately, Georgia State University plans to convert Turner Field into a football stadium, with private development partners planning housing, retail, restaurants and green space around The Ted.\nThe Turner Field sale will play a crucial role in the funding of Philips’ renovation, with $12.5 million of the $30 million sale to be included in the city’s share. About $110 million will come from the car rental tax.\nThe remaining $20 million from the city will come from a series of expected future sales of smaller tracts of city land.\nKennesaw State University economist J.C. Bradbury pushed back on the assertion that metro Atlantans won’t feel pain from the Philips deal. He said car rentals by local residents far outnumber those of visitors so it is a tax on Atlantans.\n“The notion that there is not an increased burden on taxpayers is totally incorrect,” he said. “The majority of people who rent cars live in the metro area.”\nAdditionally, on Election Day, city leaders will ask residents to approve new sales taxes to expand MARTA transit and improve roads and bridges.\nBradbury, who studies stadium deals, said city leaders often tout economic development as the motivator for giving public money to sports teams. But he said there is no evidence that the investment helps anyone but the teams.\nHe said he also is concerned that proceeds from the sale of Turner Field is not staying in the neighborhood, but being transferred several blocks away where it won’t benefit nearby residents.\nState. Sen. Vincent Fort, D-Atlanta, a frequent critic of Reed, called the Philips deal “a story of misguided priorities.”\n“It’s long overdue for the people of city of Atlanta to get some benefit from subsidizing billionaires,” he said.\nRessler has said a Philips makeover is essential for the team. The arena’s configuration, with a bank of suites along one side and disjointed corridors, is a major problem for fan experience and also for revenue generation. The suites farthest from the floor have been poor sellers.\nReed said the renovation plans call for suites to be positioned throughout the arena. Hawks officials said other upgrades include more connectivity so fans can better navigate around the arena.\nKoonin said improved food will be a top priority, and “we will make this the most video-centric arena in the country” with the latest wireless technology.\nThe Hawks have among the lowest ticket prices in the NBA. Koonin said prices will increase in some sections but others will remain about the same.\nThe fan experience outside the arena also is critical. The Atlanta Journal-Constitution previously reported the Hawks and city were in talks about a potential entertainment district around Philips, including on Gulch property. The team has also considered partnerships or an arrangement with Turner Broadcasting about having a role in CNN Center, which fans see as a gateway to the arena.\nRessler publicly has not gone so far as to outline a vision, only to say that the team wants to be a catalyst for downtown redevelopment. Ressler said his brother, global real estate executive Richard Ressler, a partner with CIM Group, has spent significant time talking to Reed about ways to aid in downtown’s redevelopment.\n“We as the Atlanta Hawks have tried our best to participate as well and will participate in the redevelopment in some way to the best of our ability,” Tony Ressler said.\nReed cited upcoming renovations to Centennial Olympic Park, redevelopment of Underground Atlanta, the new Falcons stadium as evidence of downtown’s resurgence.\nReed said the city will work with the Hawks and other private sector partners “to transform the Gulch area, and we believe a $1.5 billion investment is possible over the next 20 years.” But it appears there is no public guarantee of Gulch redevelopment as part of the Philips deal.\nPhilips is owned by the Atlanta Fulton County Recreation Authority, but it is operated by the Hawks.\nPhilips and surrounding infrastructure upgrades originally cost $213 million to develop in the late 1990s. That included about $150 million in bonds backed by stadium revenue. Rental car taxes paid for infrastructure improvements, not stadium construction.\nOperating revenue pays annual debt service of about $11.9 million, according to bond documents obtained by the AJC. The recreation authority refinanced the $124.5 million in bond debt in 2010. The bond debt is scheduled to be paid off in 2028.\nAfter retirement of the revenue bonds in 2028, the Hawks will pay an annual lease of $5.9 million through 2046. Ongoing capital and maintenance costs will be covered by a future ticket surcharge.\nReed told reporters the Hawks would have to pay the city a $200 million “break up fee” if the team leaves the arena before the end of the lease.\nA.J. Robinson, president of downtown business group Central Atlanta Progress, praised the deal, saying the arena has long needed an overhaul and should be included in any downtown renaissance.\n“It’s great Philips is not being left out of the mix,” Robinson said.","url":"https://www.ajc.com/news/local-govt--politics/philips-arena-get-192-million-facelift/p0pmAXHuT9TXdTwYq9USwO/"}
