{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 01:49:48","date_modify":"2018-10-23 01:49:48","date_publish":"2017-03-16 12:01:19","description":"The Chancellor put on a brave face and smiled for the cameras as he welcomed US Treasury Secretary Steven Mnuchin for talks at 11 Downing Street.","filename":"data/vaneerConsumption/PhilipHammondmeetsStevenMnuchinafterBudgetshame.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53290C00000578-0-image-a-19_1489665036582.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319788_Smiling-Hammond-meets-counterpart-Budget-shame_1540259388.html","title":"Philip Hammond meets Steven Mnuchin after Budget shame","title_page":"Philip Hammond meets Steven Mnuchin after Budget shame | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Philip Hammond was meeting US Treasury Secretary Steven Mnuchin in No11 today\nPhilip Hammond was attempting to get on with business as usual today despite his abject climbdown over the Budget tax raid.\nThe Chancellor put on a brave face and smiled for the cameras as he welcomed US Treasury Secretary Steven Mnuchin for talks at 11 Downing Street.\nThe two men are due to discuss the Trump administration's economic plans - and potentially the prospects for an early Transatlantic trade deal after Brexit.\nBut despite the brave face, Mr Hammond is under intense pressure after his humiliating volte-face over hiking national insurance for the self-employed.\nRelations with the PM have plunged to a new low after Theresa May forced Mr Hammond into dropping the key Budget measure.\nMrs May told the Chancellor his hike to Class 4 National Insurance, which smashed a Tory manifesto pledge, had to be scrapped at a tense 8am meeting yesterday.\nMr Hammond made the embarrassing announcement in a letter to MPs shortly before Mrs May took Prime Minister's Questions - easily fending off a weak response from Jeremy Corbyn.\nIt leaves him struggling to fill a £2billion hole in his spending plans, with warnings that workers face more austerity.\nThere is speculation he could opt to crack down on the use of 'service companies' by well-paid contractors, or cut back pensions relief for high earners.\nThe row has laid bare the growing friction between the holders of the two most important roles in government, with the PM taking the opportunity to stamp her authority.\nMrs May's aides are believed to have been particularly infuriated by briefing to Sunday papers from 'friends' of the Chancellor, complaining of 'economic illiteracy' in No10 and saying they had been pressing for the Budget to raise more money.\nAccording to The Times, Mrs May's team warned the Treasury before the fateful package was announced that raising NI for the self-employed was a 'bad idea'.\nThe Chancellor put on a brave face as he greeted his counterpart despite the embarrassing volte face on hiking national insurance for the self-employed\nThe two men are expected to discuss the Trump administration's economic plans - and potentially the prospects for an early Transatlantic trade deal after Brexit\n'No 10 said don't do it, but Philip wouldn't listen,' a ministerial source said.\nThe screeching U-turn has dealt a massive blow to the standing of the Chancellor, who previously held a reputation in Westminster as a safe pair of hands.\nHe is now facing questions about his future in the role.\nMr Hammond tried to shore up his position today by pleading for the public to keep 'faith' in him, saying the climbdown showed he could be 'trusted'.\nAfter delivering his Budget a week ago, Mr Hammond was accused of lying and breaching the Tory manifesto by placing the £2billion tax raid at the heart of his Budget.\nHe appeared to confess to MPs yesterday that he had not realised there could be a conflict with the manifesto until he saw it mentioned by journalists.","url":"https://www.dailymail.co.uk/news/article-4319788/Smiling-Hammond-meets-counterpart-Budget-shame.html"}
