{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:51:34","date_modify":"2018-10-30 18:51:34","date_publish":"2016-05-11 17:08:33","description":"On Wednesday's episode of Breitbart News Daily on SiriusXM Patriot Channel 125, Duck Dynasty's Duck Commander Phil Robertson joined Breitbart Executive Chairman and host Stephen K. Bannon for a candid discussion about their latest film, Torchbearer, which is set to be screened at the Cannes Film Festival next month. | Entertainment","filename":"data/vaneerConsumption/PhilRobertsononTorchbearerImaManWhoDoesntShedManyTearsButMakingThisFilmWasOverwhelming.json","image_url":"https://media.breitbart.com/media/2016/05/Phil-Robertson-Torchbearer-Auschwitz-Citizens-United-Glittering-Steel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_05_11__1540925494.html","title":"Phil Robertson on ‘Torchbearer’: I'm a Man Who Doesn't 'Shed Many Tears,’ But Making This Film Was ‘Overwhelming’","title_page":"Phil Robertson on ‘Torchbearer’: I'm a Man Who Doesn't 'Shed Many Tears,’ But Making This Film Was ‘Overwhelming’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday’s episode of Breitbart News Daily on SiriusXM Patriot Channel 125, Duck Dynasty’s Duck Commander Phil Robertson joined Breitbart Executive Chairman and host Stephen K. Bannon for a candid discussion about their latest film, Torchbearer, which is set to be screened at the Cannes Film Festival next month.\nTorchbearer — directed by Bannon; produced by Citizens United’s David Bossie; and written by Bannon, Robertson’s nephew Zach Dasher, and Breitbart Senior West Coast Editor Rebecca Mansour — examines what happens to Western civilized societies when God is completely cut out from all spheres of public life. Robertson serves as narrator and tour guide.\n“If you look around, the frustration you see coming out of America, in my opinion, is primarily being fueled by the depravity [that] has become mainstream,” Robertson told Bannon, whom he playfully called ‘Mr. Director’ several times throughout the interview. “Murder is mainstream, we slaughter our own children. We priss around and parade our perversion; it’s being done in front of our very eyes. Depravity, literally. And I never thought I’d see it in my lifetime. But it has literally become mainstream.”\nHe continued:\nThat script I read that y’all sent me — what happens when you remove God, if there’s not a firm conviction of the God of creation in the minds of human beings — Jefferson said it best in the Declaration of Independence: our rights come from God. He also said “God who gave us a life gave us liberty.” And then he asked a rhetorical question. Can the liberties of a nation be thought secure when we’ve removed our only firm basis, a conviction in the minds of people that these liberties are the gifts of God. He says you violate them, Thomas Jefferson said that, and His wrath is coming. So we’re swimming in a sea of depravity. And I think this movie would at least shed a little light on exactly what our Founding Fathers warned us about. I’ve read these Founding Fathers, Mr. Director, carefully, and I’ve studied what they said. They repeatedly warned us about the day we have now come upon and are seeing in our society. John Adams said: “When people forget God, tyrants forge their chains.” And it just goes on and on. It’s impossible to govern the world without God and the Bible. So here we are, so I think maybe hopefully, through this movie, this documentary, we’ll change the hearts of some people. That’s my goal.”\nBannon said the production had visited the Coliseum in Rome, French Revolution sites in Paris, the beaches of Normandy and the Auschwitz concentration camp in Poland to gain a better understanding of the potential for the downfall of civilized societies: “What was the difference in actually going there and seeing these places in the flesh?” Bannon asked.\n“Well, it was eerily breathtaking,” Robertson replied. “I’m a guy, I guess being in my emotional make-up, I don’s shed many tears over anything actually. But in the making of this film, when I was in those places that you just mentioned — Auschwitz, and where the French Revolution took place, and those ruins where I thought about the Romans and how they slaughtered our brothers and sisters on a scale of what ISIS is currently doing — and I’m telling you the truth that it was actually overwhelming. When I stood on Mar’s Hill where the Apostle Paul gave that speech and introduced Christianity to the Greeks, when I stood there… it was the most overwhelming feeling I’ve experienced in my life on the Earth in the last 70 years. So just the making of it, what can I say? It really touched me, I can tell you that.”\n“Do you believe — now that you’ve taken a year to really study these Bible verses, study history at a much deeper level, go to Europe, film, come back here and film — I know we’re at an inflection point, but do you think for your fellow countrymen and particularly people of religious belief, [do you believe] that there is time to turn this around?” Bannon asked.\nRobertson said:\nI’m convinced, because of our ability to be able to repent — most people, when you say the two words ‘sin’ or ‘repentance,’ they just shudder. And the reason they do is because of the power of the Evil One which [claims[ there is no such thing as good or evil. And these humans that run the country — once they start determining right and wrong, good and evil and what your life is worth — we just find ourself reeling back. I think there is hope, because the great thing that God has allowed for human beings is, we do and we can repent of our wickedness and turn to Him. So basically, I’m calling [on] the United States of America, beginning with the government — they need to just repent, turn back to God and heed the warnings of our Founding Fathers. I think there is a chance. I don’t think there will be a chance with people like Hillary Clinton on the other side, or Bernie Sanders. We’d just go further down into the abyss. But I don’t know about Donald Trump, he seems to be the one that people have elected — actually since I’ve never seen him in any kind of political office and neither has anyone else — my hope is, maybe he will take a stand on what’s right. I have not lost hope, Mr. Director. That’s why I do what I do around here.\nBannon revealed that the film would screen at the Cannes Film Festival in France next week and debut at the Republican National Convention in Cleveland this summer.\n“Thank you for taking a year out of your life to do [this film],” Bannon concluded the interview.\n“We might as well carry the banner on and try to get men to just do two things — I know it’s a shocker for America — but I’m hoping we will just begin to love God and love our neighbor,” Robertson signed off. “I don’t think we’re asking for too much here, do you?”\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:\nWatch the film’s trailer above.","url":"https://www.breitbart.com/entertainment/2016/05/11/phil-robertson-on-torchbearer-im-a-man-who-doesnt-shed-many-tears-but-making-this-film-was-overwhelming/"}
