{"authors":[],"date_download":"2018-10-22 22:44:54","date_modify":"2018-10-22 22:44:54","date_publish":"2017-03-16 04:38:13","description":"Philippine President Rodrigo Duterte's ruling party stripped a dozen lawmakers of congressional leadership posts for voting against the death penalty, which...","filename":"data/vaneerConsumption/Philippinelawmakerspunishedforopposingdeathpenalty.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/04/wire-226351-1489639096-15_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318844_Philippine-lawmakers-punished-opposing-death-penalty_1540248294.html","title":"Philippine lawmakers punished for opposing death penalty","title_page":"Philippine lawmakers punished for opposing death penalty | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ex-president Gloria Arroyo is one of 12 Philippines lawmakers stripped of their posts for voting against the death penalty\nPhilippine President Rodrigo Duterte's ruling party stripped a dozen lawmakers of congressional leadership posts for voting against the death penalty, which critics warned Thursday was part of a \"dangerous slide towards authoritarianism\".\nIn a rare move local media dubbed a \"purge\", ex-president Gloria Arroyo was on Wednesday dumped as deputy speaker of the House of Representatives and 11 legislators -- all members of Duterte's ruling coalition -- lost committee chair positions.\nThis fulfilled a threat by the House of Representatives' speaker to punish anyone who voted against a bill this month to introduce the death penalty for drug-related crimes.\n\"Kicking out the 'No' voters from House leadership positions betrays the administration´s intolerance to dissent, a disturbing indicator of a dangerous slide towards authoritarianism,\" the rival Liberal Party said in a statement on Thursday.\nThe Liberal Party cited the arrest last month of Senator Leila de Lima, one of its senior members and a top Duterte critic, on drug trafficking charges as another example of government intimidation.\nHowever house speaker Pantaleon Alvarez had previously insisted his threat to punish dissenting lawmakers was because the death penalty was a firm position of Duterte's ruling coalition and not open to a conscience vote.\nDuterte's aides had also rejected charges that De Lima was the victim of political persecution, insisting the drug trafficking charges against the former human rights commissioner were valid.\nDuterte is aiming for the death penalty to be re-introduced by May, as he views it as a vital part of his controversial campaign to eliminate illegal drugs in society.\nSince Duterte took office in the middle of last year, about 7,000 people have been killed in a crackdown on crime, prompting accusations by rights groups that the president could be overseeing a crime against humanity.\nAn overwhelming majority of lawmakers in the lower house passed the bill, which allows for the death penalty for drug related crimes.\nHowever even some who voted for it said they did so because they did not want to lose funding and other benefits the president or his congressional allies can dole out.\nThe Senate, in which Duterte's coalition has a majority, is expected to vote on the issue in the coming months.\nAfter the death penalty, one of Duterte's top legislative priorities is a bill to lower the age of criminal responsibility from 15 to nine.\nDuterte has said the criminal age of responsibility must be lowered because drug traffickers are using children to peddle their wares.\nCritics have warned the death penalty and criminal child bills are part of a major step backwards for human rights in the Philippines.\nThe Philippines abolished the death penalty in 2006, when Arroyo was president.","url":"https://www.dailymail.co.uk/wires/afp/article-4318844/Philippine-lawmakers-punished-opposing-death-penalty.html"}
