{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 01:08:00","date_modify":"2018-10-23 01:08:00","date_publish":"2016-01-28 15:20:38","description":"Despite his myriad of achievements, Phil Collins, 64, hit the self destruct button in 2008 when he turned to alcohol after divorcing his third wife, Orianne Cevey.","filename":"data/vaneerConsumption/PhilCollinsdiscusseshisbattlewithalcoholismashespicturedatBBCstudios.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB01C800000578-0-image-a-37_1453991927216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421086_There-massive-hole-life-Phil-Collins-reveals-turned-alcohol-s-spotted-looking-frail-walking-stick-outside-BBC-studios_1540256880.html","title":"Phil Collins discusses his battle with alcoholism as he's pictured at BBC studios","title_page":"Phil Collins discusses his battle with alcoholism as he's pictured at BBC studios | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's one of the most successful solo artists of all time having sold 150 million albums worldwide, as well as shifting a similar number with his band Genesis.\nBut despite his myriad of achievements, Phil Collins, 64, hit the self destruct button in 2008 when he turned to alcohol after divorcing his third wife, Orianne Cevey.\nShe relocated to Miami with the couple's two sons Nicholas, 10, and Matthew, 14, leaving Collins alone in the Swiss town of Féchy.\nScroll down for video\nOn the mend: Despite his myriad of achievements, Phil Collins, 64, hit the self destruct button in 2008 when he turned to alcohol after divorcing his third wife, Orianne Cevey\nIn his prime: Collins in his heyday at the US leg of the 1985 Live Aid concert in Philadelphia\nUnable to seek solace in the instrument with which he made his name due to spinal cord damage, Collins turned to the bottle.\nIn an interview with The Times' Will Hodgkinson, the In The Air Tonight singer confessed: 'There was a massive hole in my life, which I filled with a lot of drinking.'\n'At eleven in the morning I would put the television on, watch the cricket, and open a bottle of wine. And then I would drink vodka, and that doesn’t agree with your pancreas.'\nFrail: While he is in a far better place today than he was in the late noughties, he's still a far cry from the long-haired healthy looking Collins of yesteryear\nBack on the radio: He was most recently pictured arriving at the BBC Breakfast studios in Manchester on Thursday morning\nSuch was the destructive path he was on that a Swiss doctor asked if he had his 'papers in order'.\nWhile it was the absence of his family that put him on his downward spiral, it was the thought of his worried sons which prompted him to conquer his demons.\nHe said: 'With the drinking I saw that my kids got worried. I was taking pills for one thing or another, then I’d fall down the stairs. Now I’ve given up and family life is so much better.'\nCollins now resides in Jennifer Lopez's $33 million former house in Miami and is a hands on father, regularly taking the boys to school.\nDressed down: Sporting a brown cap, a checked shirt underneath a black leather jacket, light denim jeans and a pair of black shoes\nEasy does it: He tentatively exited a silver Mercedes with the aid of a sturdy black walking stick\nAnd it was their desire for him to write songs and play live again which has prompted him to buy a piano.\nWhile he's in a far better place today than he was in the late noughties, he's still a far cry from the long-haired healthy looking Collins of yesteryear.\nThe musician now appears frail as he continues to recover from back surgery.\nHe was most recently pictured arriving at the BBC Breakfast studios in Manchester on Thursday morning.\nThe pop legend sported a brown cap, a checked shirt underneath a black leather jacket, light denim jeans and a pair of black shoes.\nPositive sign: Sporting rugged white stubble and a pair of glasses, Collins waved at photographers and flashed a thumbs up\nIn demand: Still proving to be quite the draw, Collins signed autographs for fans queuing up at the studio's entrance\nHe tentatively exited a silver Mercedes with the aid of a sturdy black walking stick. Sporting rugged white stubble and a pair of glasses, Collins waved at photographers and flashed a thumbs up as he ambled along.\nStill proving to be quite the draw, Collins signed autographs for fans queuing up at the studio's entrance.\nAnd the star's publicist believes he is making good progress, telling the Express: 'His health is just fine… He is recovering well from back surgery, but also from a broken bone in his ankle, hence the stick.\n'But he should make a 100 per cent recovery on both counts.'\nPhil revealed last October that he woke up one morning and couldn't move his right foot.\nThrough the wars: The drummer and singer has a history with back problems, with the 2007 Genesis reunion tour leaving him with a dislocated vertebra in his neck that caused nerve damage in his hands\n'I had an MRI and my back and hips were just shot,' he told Rolling Stone. 'The doctor had to go in there, work on the sciatic nerve and take my back apart and unscramble the mess.'\nThe drummer and singer has a history with back problems, with the 2007 Genesis reunion tour leaving him with a dislocated vertebra in his neck that caused nerve damage in his hands, which left him unable to play the drums, although he has since been told he should be able to return to the kit.\n'After this surgery, though, the doctor said to me that my vital signs were all there. He said to me, \"If you want to play drums again, all you have to do is practice\"' he explained.\nPhil's last new material was released in 2002, the album Testify, with the accompanying tour tellingly titled the First Farewell Tour, but he has explained he's now ready to record a new solo LP and head out on the road again.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421086/There-massive-hole-life-Phil-Collins-reveals-turned-alcohol-s-spotted-looking-frail-walking-stick-outside-BBC-studios.html"}
