{"authors":["John Hayward"],"date_download":"2018-10-30 20:39:14","date_modify":"2018-10-30 20:39:14","date_publish":"2018-07-09 23:03:38","description":"On Monday, Philippine bishops called for three days of fasting and prayer in response to Duterte’s remarks.","filename":"data/vaneerConsumption/PhilippineBishopsCallforThreeDayFastAfterDuterteSaysGodIsaStupidSonofaBitch.json","image_url":"https://media.breitbart.com/media/2018/06/wi/ap/25/364886_philippines-duterte-10004-rodrigo-duterte-in-tuesday-11-2018-file-photo-e1531177291966.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_09__1540931954.html","title":"Philippine Bishops Call for Three-Day Fast After Duterte Says God Is a 'Stupid Son of a Bitch'","title_page":"Philippine Bishops Call for Three-Day Fast After Duterte Says God Is a 'Stupid Son of a Bitch'","title_rss":"NULL","source_domain":"breitbart.com","text":"The uneasy relationship between the Catholic Church and Philippine President Rodrigo Duterte took a turn for the worse two weeks ago when the notoriously foul-mouthed Duterte referred to God as a “stupid son of a bitch.”\nOn Monday, the association of Philippine bishops called for three days of fasting and prayer in response to not only Duterte’s remarks but also the extreme violence of his drug war.\nDuterte was in the midst of a televised speech on June 26 in Davao, the city he once presided over as mayor, when he veered into theology and questioned God’s wisdom for evicting Adam and Eve from Eden. He portrayed the fall from Eden as a setup job that left mankind saddled with the burden of original sin for all eternity.\n“You created something perfect and then you think of an event that would tempt and destroy the quality of your work,” Duterte railed at the Almighty.\n“You weren’t born yet, but now you have original sin,” he told his audience. “What kind of religion is that? I can’t accept it.”\n“Who is this stupid God? This son of a bitch is then really stupid,” he concluded.\nDuterte flings a lot of insults around during his speeches, but he usually comes up just short of insulting God (“Just short” meaning he once referred to Pope Francis as a “son of a whore” for causing traffic jams when he visited Manila). Duterte’s electorate is over 85 percent Roman Catholic, so he might have finally discovered the limit of their willingness to indulge his spicy rhetoric.\nArchbishop Socrates Villegas issued a statement to his Lingayen Dagupan archdiocese a few days after Duterte’s speech:\nThrough social media, you have been sadly exposed to the cursing, threats and shaming by the President of our country. Choose to love him nevertheless, but stay in the truth of our faith. Be firm in faith. He must have received so much rejection and hurts in the past that he blurts out so much hatred and angst now. If he had been loved much, he would be giving so much of that love too. He could be a victim of his scarred past and his wounded background. Pray for him with compassion. We pray for his healing and for God’s forgiveness on him but we must rebuke his errors about our Christian faith. He is a person in authority and some of you might get confused when you hear him. To pray for him is not enough. We must serve you the truth as we pray for him. I am writing this to defend you from the gross errors that you have been hearing. If I keep quiet you might be misled. God gave you to us, your priests in Lingayen Dagupan, as our children. It is our duty to teach you. Some of you might ignore me or even rebuke me; but that will not stop me from teaching those among you who sincerely ask for guidance. I cannot stop serving you the truth. You have heard the President attack our Christian beliefs. The story of creation is being taunted repeatedly. You have been hearing him curse God. God has been called insulting names–words we always told you not to say or even write. You are even being challenged to leave this Church of your birth, the Church of your grandparents.\nDuterte responded by explaining to Catholics that he thinks their God is stupid while he holds the intelligence of his God in very high esteem, which did not help the situation much. He accused his critics of violating the barrier between Church and State by responding to him, although he evidently does not think any such barrier prevents the head of state from going after a particular church and encouraging its members to pick a different faith – an attack he launched in the middle of the opening speech for an information technology summit, not a theological event.\nDuterte capped off his defense by offering to resign immediately if anyone can provide photographic evidence that God exists, possibly confusing the Christian God with certain other deities who have been known to pose for selfies.\nWhen Catholic bishops called for fasting and prayer on Monday, they were responding not only to Duterte’s “God is stupid” speech but everything he has said since then, and the full range of his attacks on the Church – verbal assaults some have blamed for recent acts of murderous violence against priests.\nThe message from the Catholic Bishops Conference of the Philippines carefully avoided calling Duterte out by name, but it’s perfectly obvious who they are referring to:\nTo those who arrogantly regard themselves as wise in their own estimation and the Christian faith as nonsense, those who blaspheme our God as stupid, Saint Paul’s words are to the point: “For the stupidity of God is wiser than human wisdom, and the weakness of God is stronger than human strength.”\nThe bishops called for a day of prayer on July 16 followed by three days of fasting and prayer to ask for “God’s mercy and justice on those who have blasphemed God’s holy name, those who slander and bear false witness and those who commit murder or justify murder as a means for fighting criminality.”\nThe latter was a reference to Duterte’s war on drugs, which the Church has denounced in the past as a “reign of terror in many places of the poor.”\nThe Philippine Council of Evangelical Churches (PCEC) also stated that it was “immensely offended” by Duterte’s remarks.\n“PCEC finds it completely inappropriate for our nation’s President to derisively curse at the God of the Christian faith, who is deeply worshipped not only by a majority of Filipinos but also by a vast number of people from all over the world,” the evangelical organization said.\n“History teaches us that religious intolerance can lead to animosity and violent conflict. PCEC, therefore, denounces insulting another person’s religion, which sadly, the President has on several occasions demonstrated,” the council added.\nFor his part, Duterte misses no opportunity to hector the Catholic Church over sexual abuse by priests. Over the weekend, he claimed he stopped being Catholic and created his own much smarter God after he and some classmates were “fondled” during confession in their youth.\nAs can be seen from their statements in response, Catholic and Protestant leaders are not only bothered by Duterte’s insulting language but the fact that he used a public event to encourage Catholics to abandon their religion. Conversely, whatever the details of his personal relationship with Catholicism, some of Duterte’s animosity toward the Church is clearly due to its position as a political opponent of his drug war policies. It should be noted that Duterte’s popularity with Filipino voters has survived quite a few controversial policies and outrageous statements.","url":"https://www.breitbart.com/national-security/2018/07/09/philippine-bishops-call-three-day-fast-duterte-says-god-stupid-son-bitch/"}
