{"authors":["Frances Martel"],"date_download":"2018-10-30 20:39:31","date_modify":"2018-10-30 20:39:31","date_publish":"2016-08-26 01:40:37","description":"Philippine President Rodrigo Duterte has warned Beijing to abstain from any physical invasion of disputed territories in the South China Sea.","filename":"data/vaneerConsumption/PhilippinessDutertetoChinaIfYouInvadeUsItWillBeBloody.json","image_url":"https://media.breitbart.com/media/2016/08/philippines-taiwan-march-against-china-aggression-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_25__1540931971.html","title":"Philippines's Duterte to China: If You Invade Us, 'It Will Be Bloody'","title_page":"Philippines's Duterte to China: If You Invade Us, 'It Will Be Bloody' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Philippine President Rodrigo Duterte, who has saved some of his most reserved public language for China, has warned Beijing to abstain from any physical invasion of disputed territories in the South China Sea or “it will be bloody” for both parties.\n“I would walk the extra mile to ask for peace for everybody,” Duterte said Wednesday during a speech to the 2nd Infantry Division of the Philippine Army, “But I am sure and I guarantee to them that if they invade us, it will be bloody and we will not give it to them easily.\n“There will come a time that they have to do some reckoning about this,” he added, while assuring Chinese listeners that he had no plans to “raise hell now” about their territorial disputes.\nDuterte has used the word “bloody” to describe his political policies often, but his tone on China has been notably tame compared to that towards domestic rivals. On the South China Sea issues, Duterte has explicitly said the Philippines is “not ready to go to war” and repeatedly asked China to “talk.” He has also vowed to personally retake disputed territories “riding a jet-ski,” risking his own life, before sending a Philippine soldier into war with the Chinese juggernaut. “I would stake that claim, and if they want to [kill me], you know, I have the ambition of being the hero, too,” he said in April.\nChina claims the Paracel and Spratly Islands and the Scarborough Shoal in the South China Sea, claimed by Vietnam and the Philippines. The total territory Beijing claims is sovereign Chinese waters includes territory also belonging to Taiwan, Brunei, Malaysia, and Indonesia. In July, the Permanent Court of Arbitration found against China in the case Philippines v. China, brought to the international tribunal before Duterte’s tenure. China has vowed to ignore the verdict and as stipulated the Philippines must also ignore it as a precondition to bilateral talks regarding the territorial dispute. The Philippines has rejected this condition.\nChina has, however, kept its language regarding the verdict uncritical of Duterte, instead loudly blaming Japan and the United States for conspiring to embarrass China at the Hague.\nDuterte preempted his comments warning China with assurances that he did not think the situation would get so severe. “I hope China is dealing with us in good faith. They seem to be conciliatory. We’re not insisting on arbitral judgment,” he said, according to the Philippine Star. He cited China attempting to earn his goodwill by offering to invest in building drug rehabilitation facilities to help his government combat the nation’s pervasive drug problem, the eradication of which formed the cornerstone of the Duterte presidential campaign.\nDuring the speech, Duterte also advised soldiers to always “smell good” and “put on fragrant cologne.” “You should be fragrant and attractive. For the females, put lipstick,” he added.\nManila has expressed an interest in scheduling a personal meeting between Duterte and his Chinese counterpart in Beijing before the end of the year.”Yes, yes, this is something that we would like to push through,” Foreign Affairs Secretary Perfecto Yasay Jr. said this week on CNN Philippines when asked about a trip to China. Duterte will be visiting Brunei, a claimant nation in the South China Sea, in September.","url":"https://www.breitbart.com/national-security/2016/08/25/duterte-to-china-if-you-invade-it-will-be-bloody/"}
