{"authors":["Shravanth Vijayakumar"],"date_download":"2018-10-22 22:35:36","date_modify":"2018-10-22 22:35:36","date_publish":"2016-01-29 09:45:08","description":"Everton have struggled for consistency in the Premier League this season and are currently 12th in the table after 23 games, having failed to win their last five league games.","filename":"data/vaneerConsumption/PhilJagielkabelievesFACupruncanmakeEvertonsseasonafterCapitalOneCupsemifinalknockoutbyManchesterCity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30AC4A9100000578-0-image-a-10_1454060697758.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422454_Phil-Jagielka-believes-FA-Cup-run-make-Everton-s-season-Capital-One-Cup-semi-final-knock-Manchester-City_1540247736.html","title":"Phil Jagielka believes FA Cup run can make Everton's season after Capital One Cup semi-final knock-out by Manchester City","title_page":"Phil Jagielka believes FA Cup run can make Everton's season after Capital One Cup semi-final knock-out by Manchester City | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Travel to League Two Carlisle in fourth round on Sunday afternoon\nEverton were beaten in Capital One Cup semi-final by Manchester City\nEverton captain Phil Jagielka hopes the FA Cup can 'make' the club's season after the heartbreak in the League Cup semi-final at the hands of Manchester City.\nEverton have struggled for consistency in the Premier League this season and are currently 12th in the table after 23 games, having failed to win their last five league games.\nRoberto Martinez's side head to fourth tier side Carlisle United on Sunday for a fourth round FA Cup tie and Jagielka said they need to give the supporters something to cheer about after their latest setback.\nPhil Jagielka believes that the FA Cup can 'make' Everton's season after their Capital One Cup semi final loss\nThe Toffees captain played as Roberto Martinez's fell to a 4-3 aggregate defeat to Manchester City\n'We have another cup game at the weekend and so we have got to try and put some sort of run together to give them something to get their teeth into for the remainder of the season,' the England international told British media.\n'It is important that we get our heads up. The role of all of the senior people around the dressing room is to get everyone back up, it's another decent distance for them to go.\n'I wouldn't say the FA Cup can save the season but it can make the season.\n'Things aren't going so well in the league so a good run in the FA Cup can make things a lot happier, similar to what the League Cup has done but there is only one way to do and it's going to Carlisle and getting a good result.'\nEverton have not won any silverware since lifting the FA Cup in 1995.\nSergio Aguero scored the decisive third goal for City as they ran out 3-1 winners at the Etihad stadium","url":"https://www.dailymail.co.uk/sport/football/article-3422454/Phil-Jagielka-believes-FA-Cup-run-make-Everton-s-season-Capital-One-Cup-semi-final-knock-Manchester-City.html"}
