{"authors":["Philip Martin"],"date_download":"2018-10-30 17:52:01","date_modify":"2018-10-30 17:52:01","date_publish":"2018-10-30 04:30:00","description":"Let me tell you a story.","filename":"data/vaneerConsumption/PHILIPMARTINThescariestsadstoryIknow.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_the-scariest-sad-story-i-know-20181030__page=1_1540921921.html","title":"PHILIP MARTIN: The scariest sad story I know","title_page":"PHILIP MARTIN: The scariest sad story I know","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Let me tell you a story.\nI don't know that it's true. I only know we all believed it long ago in the wayback, when our parents let us run wild in the streets, sometimes even after dark.\nTwo boys, who were about our age but who we didn't know because they went to a different school, had been teasing this old man for weeks. Nothing too sophisticated, just the old run-up-and-ring-his-doorbell-then-run-off-to-hide-in-the-bushes-to-watch-him-sputter-and-cuss gag.\nWhile he was a really good cusser, the old man couldn't move around very well, he couldn't chase them, and even if he caught them he wouldn't know their names or where they lived.\nHe was just an old man. They had English Racers and PF Flyers.\nIt always worked the same way. From the safety of the bushes around the corner, they heard him groaning to his feet, lifting and placing his walker, shuffling across the floor and opening the door to nothing but a clear Carolina sky. Then he'd fill that sky up with purple curses and complaints: Why, he wanted to know, couldn't the children leave an old man alone to die in peace?\nThen one day, right around Halloween, the old man decided he'd put up with enough. He pulled a chair over to the door and waited all day with a shotgun in his lap. He had made his calculations. He was without long to live. He was not afraid of prison, and hated his tormentors so. He waited all night to hear childish giggles and the quick squeak of sneakers on his porch. In what he reckoned was the moment just before a finger touched the doorbell, he jerked the trigger and blasted a hole through the world.\nA young woman screamed--the warm blood of her children, the old man's grandchildren, greased the porch.\nIt was a surprise visit; one version of the story had it that they had come to take the old man back to live with them in a big house in the country.\nYou might call that story an urban legend. I'm sure it's not true. Yet as pat and predictably horrible as it seems now, it had its hold over us then. It instructed us that playful cruelty could have consequences, and that some of these consequences were unforeseeable. It led us to understand there were adults in the world who weren't like our mothers and fathers. It reminded us we lived in a world where the slaughter of innocents was a possibility.\nThese days, the freedom we were allowed seems remarkable; we hardly ever come across unaccompanied children on our evening walks through the neighborhood. As grade schoolers, we ranged for miles, slipping off the air base (sometimes under a fence) to roam the town in childish gangs, to cross the railroad tracks and plunge down streets where no one we knew lived.\nOn Halloween, we stayed out later and extended our territory.\nWe were for the most part good kids, brought up to say \"sir\" and \"ma'am\" even when dressed as little monsters. We had no tricks in our repertoire, but then no one ever refused us plunder. We always returned home with bags heavy with Black Cow and Zero bars, popcorn balls and wads of taffy twisted in orange wax paper.\nStill, there were stoops we would not approach, houses too dark or odd to chance. Even though some of our classmates lived there, we stayed out of the local trailer park, not for any reason we could understand but because our parents told us that we mustn't go.\nFinally we'd pad off to our cool rooms in flannel nightclothes, with a secret cache of Slo Pokes or Sugar Babies in finger-reach beneath our beds. And through our open windows autumn-bitten air would blow, waving our cowboy curtains. Moonlight would soak us and we'd settle ourselves into a gray pool of drowse, a little stomach-sick and exhausted and excited. We were such brave and fearless children.\nIt cannot be that way any more, largely because we fearless children have grown up to imagine monsters everywhere, to despair of the world gone wrong.\nIt hardly matters that what killed the Halloween we used to know was a rumor, a myth, a story just like the ones that used to frighten us as children. Cases of strangers harming children by slipping razor blades into apples or otherwise tampering with candy are even rarer than cases of attempted voter fraud--no cases of strangers killing or permanently injuring children this way have been proven. (A deranged father did once try to poison his own son with a potassium cyanide-laced Pixy Stix.)\nStill, what has or hasn't happened makes no difference so long as we can imagine it happening. That's why you don't see kids playing outside without a parent in sight. That's why we're so afraid of people we imagine different from ourselves.\nWhen the ancient mapmakers came to the margins of the known world, they sometimes scrawled a legend on the blank territories: Where Monsters Be. These days we imagine that behind every door lies an uncharted and unknowable country, a potential tangle of hurt and rage, seething in the darkness and waiting for the squeak of sneakers on its porch.\nAnd that is the scariest sad story that I know.\n------------v------------\nPhilip Martin is a columnist and critic for the Arkansas Democrat-Gazette. Email him at pmartin@arkansasonline.com and read his blog at blooddirtandangels.com.\nEditorial on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/the-scariest-sad-story-i-know-20181030/?page=1"}
