{"authors":[],"date_download":"2018-10-22 21:06:53","date_modify":"2018-10-22 21:06:53","date_publish":"2014-05-05 22:59:19","description":"The annual spring tradition is in jeopardy for hundreds of students at South Philadelphia High School.","filename":"data/vaneerConsumption/PhillySchoolTurnstotheTroopsAfterHalfareIneligibleforProm.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/422016/140505-philly-prom-john-russino-1943_04fa6c2984acd27aac758d628fe9530a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_philly-school-turns-troops-after-half-are-ineligible-prom-n97711_1540242413.html","title":"Philly School Turns to the Troops After Half are Ineligible for Prom","title_page":"Philly School Turns to the Troops After Half are Ineligible for Prom","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n- From NBC Philadelphia\nThe high school prom experience is a rite of passage for American teens. The dance, the corsage and the limos carrying gussied up teens in fancy dresses and tuxedos are moments best captured on social media.\nThe annual spring tradition is in jeopardy for hundreds of students at South Philadelphia High School. Last month, counselor Pierre LaRocco and principal Otis Hackney III informed the nearly 500 junior and senior students that half of them were not eligible for prom this year because they cut class too many times. The notification was a follow up from a September assembly which outlined the eligibility process for prom.\n\"They thought we weren't serious,\" said LaRocco. \"Men and women overseas are fighting for your freedom and your using that freedom to walk around the hallways.\"\nAdara Jones, 17, didn't realize she had 23 \"cuts.\" She and her friends were frantic when they learned they were not able to attend prom.\nThe administration realized they had a situation on their hands. The principal and guidance counselor brainstormed how to make attending prom possible without giving away the opportunity to those who didn't earn it. They came up with a way for students to earn back their prom night.\nThey brought in the troops. Well, not exactly. Students have until May 9 to create a care box for 2012 South Philadelphia High School graduate John Russino's unit serving in Afghanistan. As of Monday, the school has received 10 packages.","url":"https://www.nbcnews.com/news/us-news/philly-school-turns-troops-after-half-are-ineligible-prom-n97711"}
