{"authors":["Lucy Mapstone","Dan Cain For Mailonline"],"date_download":"2018-10-23 00:14:37","date_modify":"2018-10-23 00:14:37","date_publish":"2016-01-29 12:59:34","description":"Phil Collins, 64, has confirmed he is back with his third wife Orianne Cevey, just six years after the singer paid out £25 million in a divorce settlement.","filename":"data/vaneerConsumption/PhilCollinsrevealsheslivingwiththirdwifeOrianneCeveyagain.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B5634D00000578-0-image-a-2_1454102992200.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422698_Against-odds-Phil-Collins-reveals-s-living-wife-Orianne-six-years-paying-25-million-record-breaking-divorce-settlement_1540253677.html","title":"Phil Collins reveals he's living with third wife Orianne Cevey again","title_page":"Phil Collins reveals he's living with third wife Orianne Cevey again | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is not clear if Orianne is currently married to Mejjati\nThey had a child together in 2011\nCollins paid her £25 million in their divorce, which was Britain's largest ever settlement at the time\nThey have been living together in Miami for the past six months\nBut the 64-year-old has confirmed he and his ex are back together\nPhil Collins has sensationally revealed that he is back with his third wife Orianne Cevey, six years after paying her £25million in their divorce - at the time Britain's biggest ever settlement.\nThe reunion comes after their highly-publicised divorce in 2008 - and after Orianne married investment banker Charles Mejjati.\nThe 64-year-old rocker has admitted that he is surprised 'nobody has noticed' his reconciliation with Orianne, 42, after living with her for six months in Miami.\nThe Swiss translator, philanthropist and jewellery designer was left using a wheelchair after she was partially paralysed due to complications with a 2014 surgery to treat a slipped disc in her neck, but she is now walking again after rehabilitation.\nScroll down for video\nRekindled romance: Phil Collins, 64, has confirmed he is back with his third wife Orianne, just six years after their divorce ended in him paying her a £25 million settlement - pictured in 2003\nSpeaking to Billboard, he said: 'I'm back with my third wife - I haven't really talked about it. We've been together for a while, and nobody's noticed.'\nCollins moved back to America last year from his home in Switzerland to be closer to the couple's two sons - Matthew, 14, and Nicholas, 10 - after problems with alcoholism, which stemmed from the divorce.\nThe pair tied the knot in 1999 in a lavish three-day ceremony that cost £300,000, and included guests such as Elton John and Eric Clapton.\nThey bought racing driver Jackie Stewart's old house in Bugnins, near Geneva, for an estimated £20million before announcing their split in 2006. They later divorced in 2008.\nThe Collins' welcomed their two sons during their marriage, expanding Phil's family: he was previously married twice before and has spent a staggering £42million on his divorces.\nIt's no secret: The 64-year-old seemed surprised that 'nobody has noticed' they had reconciled after living with her for the past six months in Miami\nFrom his first marriage to drama student Andrea Bertorelli in 1975 - which ended in 1980 - he has son Simon Collins, and he also adopted his wife's daughter Joely.\nWith his second wife Jill Tavelman, he had daughter Lily Collins - a well-known Hollywood actress and model. He and Jill tied the knot in 1984 after meeting in 1980, but they divorced in 1996.\nMeanwhile, Collins' huge divorce payout to his third wife Orianne was the biggest in Britain at the time, topping the £24.3 million that was awarded to Heather Mills in her split from Sir Paul McCartney.\nIt wasn't the first time the former Genesis star, who is now sober and in much better health, had made a big pay out to an ex-wife.\nThe star paid second wife Jill £17 million after allegedly finishing their relationship by fax in 1994.\nHappy together again: The Genesis rocker married Swiss translator Orianne in 1999 in a lavish £300,000 ceremony - they have two sons together, Matthew, 14, and Nicholas, 10\nBetter: Orianne was left partially paralysed in 2014 following an operation on a slipped disc - it was later discovered she has Brown-Séquard syndrome. Following rehabilitation, she is walking again - pictured with her youngest son Andrea in Miami last week\nIn the time between their divorce and reunion last year, both moved on with other partners: Collins famously dated US news anchor Dana Tyler but they split in 2015 after four years together.\nOrianne also remarried and, according to the rocker, the reason she moved with sons Nicholas and Matthew to Miami is because her new husband Charles didn't like living in Switzerland.\nIn March 2011, Orianne welcomed a son called Andrea Ryan Kylian with Charles - their first together, her third.\nSpeaking to The Daily Mail in 2014, and discussing his brush with death with acute pancreatitis - caused by his heavy drinking - he said of Orianne and their sons: 'We had a fantastic little set-up. I was living in Switzerland, ten minutes away from the kids.\n'Used to pick 'em up all the time, used to go round for dinner with the ex-wife,' he added, candidly.\nRemarried: Phil and Orianne's reunion comes after she married another man, investment banker Charles Mejjati, with whom she lived in Miami - pictured in 2010\n'And she'd remarried, which was fine. We got on, me and the husband. But he didn't like Switzerland, so they moved to Miami.\n'And, really, retiring - well, not working - and not having the kids, I guess left a big void.'\nIt is not known if Orianne and Mejjati are still married.\nCollins remained close to his former spouse over the years, not just personally but professionally, working together on their charity organisation.\nThey founded The Little Dreams Foundation in 2000 in Switzerland and, now based in Florida, its mission statement is to 'fulfill the dreams of young aspiring talents without financial means to achieve their goals'.\nMeanwhile, at the end of 2014, Orianne was left paralysed after an operation to treat a slipped disc in her neck.\nClose knit: Orianne was close to Phil's daughter Lily Collins from his second married - pictured in 2003\nIn February 2015, she filed a criminal complaint following the surgery in a hospital in Switzerland.\nWHAT IS BROWN-SEQUARD SYNDROME? Brown-Séquard syndrome is a rare spinal disorder hat results from an injury to one side of the spinal cord. A lesion occurs because the spinal cord has been damaged rather than being completely severed. Symptoms include: Paralysis on the side where damage has occurred\nLessened sensation on the other side\nThere is paralysis of the voluntary muscles (those that are controlled at will, such as arms and legs) below the level of the lesion\nLoss of sensation at the level of the lesion Symptoms of Brown-Séquard syndrome usually appear after an affected individual experiences a trauma to the neck or back. Sensations that tend to be lost first are pain and temperature - often below the area of the trauma. There may also be loss of bladder and bowel control. Paralysis tends to occur on the same side as the injury - and may be permanent if diagnosis is delayed. But people with the condition generally have a good chance of recovering a large measure of function. More than 90 per cent of those affected recover bladder and bowel control, and the ability to walk. Source: National Organisation for Rare Disorders\nSpeaking to Swiss website, Le Matin at the time, she said: 'On December 16 I had an operation for a slipped disc in my neck.\n'Afterwards, I woke up paralysed. I had absolutely no feeling in my whole body, from my head to the tips of my toes.'\nIt all began when Orianne, who has a black belt in mixed martial arts, skis, and played tennis and golf, had persistent pain in her shoulder and neck.\nShe left Miami for Switzerland because of the 'standard of care' offered in the country.\n'We have the best doctors here,' she added. 'It was the best solution. I thought I was in good hands.'\nThe disc was removed and replaced with a prosthetic and three days later she was told she could go home. But not everything went to plan and she awoke unable to feel anything and started to panic.\nAn MRI scan revealed she had Brown-Sequard syndrome - a rare spinal disorder that results from an injury to one side of the spinal cord.\nHowever, following rehabilitation, she is now walking again with the help of a cane, and has been spotted on several occasions recently on her feet.\nMeanwhile, in a recent interview with The Times' Will Hodgkinson, the In The Air Tonight singer opened up about the effect the split from Orianne had on him, and how it led to him drowning his sorrows by hitting the bottle.\nHe confessed: 'There was a massive hole in my life, which I filled with a lot of drinking.'\n'At eleven in the morning I would put the television on, watch the cricket, and open a bottle of wine. And then I would drink vodka, and that doesn't agree with your pancreas.'\nSuch was the destructive path he was on that a Swiss doctor asked if he had his 'papers in order'.\nWhile it was the absence of his family that put him on his downward spiral, it was the thought of his worried sons which prompted him to conquer his demons.\nOn the mend: He was most recently pictured arriving at the BBC Breakfast studios in Manchester on Thursday morning with the aid of a walking stick\nHe said: 'With the drinking I saw that my kids got worried. I was taking pills for one thing or another, then I'd fall down the stairs. Now I've given up and family life is so much better.'\nMeanwhile, Collins' daughter Lily, 26, has built a successful career in her own right having starred in The Blind Side, Abduction and Mirror Mirror as well as being a Lancome Ambassador.\nIn an interview with You magazine she said: 'When I was younger I saw that this business came with pros and cons.\n'You need to have the ability to show and share as much as you feel comfortable with, but at a certain point – such as with the paparazzi – your life can get infiltrated.\n'What I learned from my family is that if this is truly what you love to do, everything has a cost.'\nThe musician - last seen in Manchester arriving at the BBC Breakfast studios on Thursday - now appears frail as he continues to recover from back surgery, and is now walking with the help of a walking stick.\nDespite his costly divorces, Collins - who has had a successful career in the music industry spanning over four decades - is thought to be worth around £175 million.\nSuccess: Lily Collins, 26, has built a successful career in her own right having starred in The Blind Side, Abduction and Mirror Mirror as well as being a Lancome Ambassador - pictured in Los Angeles on Wednesday\nHe got his first big break in August 1970 when he was recruited as English rock band Genesis' replacement drummer, following the departure of John Mayhew - the third musician to take up the position.\nSinger Peter Gabriel left the band in August 1975 and meant Collins was promoted to lead vocalist during the production of the group's seventh studio album, entitled A Trick of the Tail.\nThe band were to become a trio in 1977 - comprising Collins, Tony Banks and Mike Rutherford - before beginning a hiatus in December 1978.\nCollins continued to make music and embarked on a solo career, releasing his first album, entitled Face Value, in February 1981 which subsequently charted at No.1 in seven countries. He attributed his divorce from his first wife - Andrea Bertorelli - as his main influence.\nHe followed the success of his debut record with a second album, entitled Hello, I Must Be Going!, which was released in November 1982 - it reached No.2 in the UK.\nFive became three: The band became a trio in 1977, following the departures of Peter Gabriel and Steve Hackett. Collins is pictured with Mike Rutherford and Tony Banks\nDecade-spanning career: Collins plays with Genesis at MIAMI's Joe Robbie Stadium in 1992 as the band kick off their first tour in five years\nCollins released his most successful album, Diamond-certified No Jacket Required, which reached No. 1 in U.S. in the summer of 1985 and went on to win five Grammy Awards.\nAt the time, he was still part of Genesis and the band continued to sporadically record and release music.\nAfter a five-year break, Genesis reunited to record Collins’ last studio album with the group - We Can’t Dance – in 1991. He left five years later to concentrate on his solo album.\nFast-forward ten years and Genesis embarked on a mammoth tour, entitled Turn It On Again: The Tour, which saw them play gigs all over Europe and North America.\nOne of his most notable achievements to date is his induction to the Rock and Roll Hall of Fame as a member of Genesis in New York in March 2010. A year later, he confirmed he was retiring from music to focus on family life.\nHowever, he couldn’t keep away from the studio for log as he signed a new record deal last year. Warner Music Group agreed to produce remastered versions of his eight solo albums with the addition of previously unreleased music.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422698/Against-odds-Phil-Collins-reveals-s-living-wife-Orianne-six-years-paying-25-million-record-breaking-divorce-settlement.html"}
