{"authors":["Chris Summers For Mailonline"],"date_download":"2018-10-23 03:28:14","date_modify":"2018-10-23 03:28:14","date_publish":"2017-04-26 14:49:55","description":"A fitness-conscious robber has been caught on camera preparing for a raid on a donut shop in Philadelphia by doing a few stretches in the parking lot.","filename":"data/vaneerConsumption/PhillyrobberdoesstretchesbeforeDunkinDonutsraid.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3FA00B0100000578-0-image-a-48_1493214781496.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447488_Robber-caught-camera-doing-stretches_1540265294.html","title":"Philly robber does stretches before Dunkin' Donuts raid","title_page":"Philly robber does stretches before Dunkin' Donuts raid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fitness-conscious robber has been caught on camera preparing for a raid on a donut shop by doing a few stretches in the parking lot.\nThe thief, who knew he needed to be in good shape if he was going to vault over the counter, can be seen bending over, stretching out his legs and doing some waist stretches.\nWith his little warm-up over the criminal, wearing a black hooded sweatshirt, black pants, black sneakers, ski mask and latex glove, strolls into the Dunkin' Donuts branch in Philadelphia.\nThe robber turns up in the parking lot just before 7am and starts to do some stretches\nTo unsuspecting observers he probably looked like a jogger warming up before going on an early morning run\nHe then pulls out a gun and leaps over the counter as a shop assistant serves customers.\nStaff back away as he places a plastic bag on the ground and orders them to fill it with cash. He tells them: 'You have 20 seconds to give me the money from the registers.'\nThe robbery took place just before 7am on Saturday in North Broad Street.\nThe mystery man, who is described as black and almost six feet tall, got away with $334 in cash.","url":"https://www.dailymail.co.uk/news/article-4447488/Robber-caught-camera-doing-stretches.html"}
