{"authors":["Alina Selyukh"],"date_download":"2018-10-22 21:22:13","date_modify":"2018-10-22 21:22:13","date_publish":"2016-09-29 00:00:00","description":"Regulators have voted to expand cellphone alerts to 360 characters from the previous cutoff at 90 and to begin including clickable URLs and phone numbers over the next year or so. But no photos yet.","filename":"data/vaneerConsumption/PhoneEmergencyAlertsWillBeginIncludingLinksPhoneNumbers.json","image_url":"https://media.npr.org/assets/img/2016/09/29/ap_16263575894872_wide-533c5bef0b7f825c5474c1fae4f8ff844925505b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_alltechconsidered_2016_09_29_495916037_phone-emergency-alerts-will-begin-including-links-phone-numbers_1540243333.html","title":"Phone Emergency Alerts Will Begin Including Links, Phone Numbers","title_page":"Phone Emergency Alerts Will Begin Including Links, Phone Numbers : All Tech Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Phone Emergency Alerts Will Begin Including Links, Phone Numbers\nEnlarge this image toggle caption AP AP\nSince their launch in 2012, cellphone emergency alerts have become a frequent tool for public safety officials to alert people to missing children, warn them of impending weather calamities or notify them of dangers specific to the local community.\nBut the alerts have also been criticized for their shortcomings — restricted to only 90 characters of plain text, they can't carry images and have a hit-or-miss record of landing on the phones of exactly the people meant to receive the messages. The flaws were recently showcased by the alert in New York City that raised concerns about racial profiling as it solicited help in the search of a bombing suspect by sharing his name and age but then sending people to \"media\" for a photo.\nThe Federal Communications Commission has now voted to quadruple the maximum length of the alert to 360 characters and begin including clickable hyperlinks and phone numbers in the alerts, including Amber alerts. The phone carriers will be allowed to include the URLs and numbers within about a month and required to do so in about a year.\nThe rules for now still won't allow for photos to be directly included in the messages, but the FCC is reviewing the possibility for the future. The order approved on Thursday does, however, push for alerts to be delivered more precisely to specific areas and requires support of alerts in Spanish as well as English.\nThe reason the change isn't as easy as, say, texting an image to a friend is that it's a different kind of process. Phone carriers pick up the alerts initiated by local, state or national authorities through a special computer network facilitated by the Federal Emergency Management Agency. The alerts then go out on a separate slice of airwaves than regular calls or texts — to ensure their delivery but also not to overwhelm the networks.\nThe phone companies, which highlight that they've participated in the program voluntarily, have warned that given the lack of existing standards for the new features, the interactive elements may create more confusion (for instance for older phones that don't recognize links), overwhelm responders' websites and cause network congestion. The carriers had argued for more time to prepare for more multimedia in alerts.\nThe FCC's order also creates a new class of emergency alerts. Previously, there were three: (1) imminent threat (for example, severe weather or another emergency); (2) Amber alerts (for abducted children); (3) presidential messages during a national emergency (this has never been used).\nThe new addition will be a public safety message, defined by FCC officials as \"essential public safety advisories that prescribe one or more actions likely to save lives or safeguard property.\" These would be, for instance, notices of emergency shelter locations or orders to boil water before consumption.\nThis kind of use of cellphone emergency alerts has grown since their launch in 2012. As All Tech has reported before, so far this year, nonfederal authorities have already sent as many wireless emergency messages as in all the previous three years combined. More than 21,000 phone alerts have been sent since the launch, according to the FCC.\nMany alerts are weather related, but they've also been used to urge people to \"shelter in place\" during active shooter situations or to evacuate during brush fires. Beyond images of missing children or suspects, the links could allow officials to share maps or other evacuation or safety instructions.\n\"When technology gives us the opportunity to save lives, to increase public safety,\" FCC Chairman Tom Wheeler said, \"shame on us if we don't seize on that opportunity.\"","url":"https://www.npr.org/sections/alltechconsidered/2016/09/29/495916037/phone-emergency-alerts-will-begin-including-links-phone-numbers"}
