{"authors":[],"date_download":"2018-10-30 21:05:29","date_modify":"2018-10-30 21:05:29","date_publish":"2018-08-27 00:00:00","description":"Photos of UGA fans at Jacksonville Landing through the years, before the annual UGA-Florida football game.","filename":"data/vaneerConsumption/PhotosUGAfansatJacksonvilleLandingthroughtheyears.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/27/Images/110213%20uga%20football%20CC9.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_photos-uga-fans-jacksonville-landing-through-the-years__1540933529.html","title":"Photos: UGA fans at Jacksonville Landing through the years","title_page":"Photos: UGA fans at Jacksonville Landing through the years","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 24\nCURTIS COMPTON / AJC/Atlanta Journal Constitution Jacksonville Landing, the scene of this weekend's mass shooting, is a familiar spot for UGA fans. Here's how the entertainment district lights up each year for the annual UGA-Florida football game, when fans of both teams hobnob in the main courtyard. In 2013, Georgia fanTommy Moore, 31, Athens, found himself surrounded by Florida Gators fans.\n2 / 24\nBob Andres/bandres@ajc.com Fans gather at the Jacksonville Landing in Jacksonville on the eve of the Georgia Florida football game in 2012.\n3 / 24\nHYOSUB SHIN / AJC/hshin@ajc.com Lee Jordan (foreground) and Al Jordan cheer for the Bulldogs Oct. 30, 2015 on the eve of the Georgia-Florida game.\n4 / 24\nBrant Sanderlin/bsanderlin@ajc.com The party gets started at the Jacksonville Landing on October 29, 2010.\n5 / 24\nBrant Sanderlin Jeremy Johnson waves a Georgia Flag at the Jacksonville Landing on Halloween night, 2009.\n6 / 24\nBrant Sanderlin Georgia fans party at the Jacksonville Landing Friday night Oct. 28, 2016.\n7 / 24\nBob Andres/bandres@ajc.com Unidentified Georgia fans check out an Uga wannabe at the Jacksonville Landing in 2012.\n8 / 24\nBRANT SANDERLIN / BSANDERLIN@AJ/bsanderlin@ajc.com UGA and Florida fans party at the Jacksonville Landing Oct. 31, 2014.\n9 / 24\nJason Getz / AJC/jgetz@ajc.com University of Florida fans Marcy Guider, left, of Atlanta, and Grindl Howell, of Lithia Springs, second from left, do the Gator Chomp to University of Georgia fans including Dexter Conaway, of Hazlehurst, Ga., right, as they dance at The Jacksonville Landing on Nov. 1, 2013.\n10 / 24\nJason Getz / AJC/jgetz@ajc.com University of Georgia fans Michael, right, and Morgan Kingsley, of Roswell, dance as Michael wears a fake baby inspired by the movie, the Hangover, at The Jacksonville Landing in 2013.\n11 / 24\nJason Getz / AJC/jgetz@ajc.com University of Florida and University of Georgia fans do a soul train line dance at The Jacksonville Landing in 2013.\n12 / 24\nBrant Sanderlin Brandon Brooks from Athens, Ga. dances with University of Florida senior Jennifer School at the Jacksonville Landing in 2009.\n13 / 24\nJENNI GIRTMAN/AJC University of Florida and University of Georgia fans congregate at Jacksonville's Landing on Friday, Oct. 31, 2003.\n14 / 24\nBEN GRAY/AJC Staff Bulldogs fan Linnea Johnson of Taylorsville dances to 'Sweet Home Alabama' at the Jacksonville Landing in 2003.\n15 / 24\nBrant Sanderlin/bsanderlin@ajc.com Evan Lukenda from Atlanta parties in his Halloween costume at the Jacksonville Landing on Oct. 29, 2010.\n16 / 24\nBob Andres/bandres@ajc.com Georgia and Florida fans join together in a Conga line to the music of a DJ at the Landing in 2012.\n17 / 24\nAndres / Compton/bandres@ajc.com Georgia fans celebrate in advance of Saturday's Georgia Florida football game at The Landing in Jacksonville in 2017.\n18 / 24\nJason Getz/jgetz@ajc.com Georgia fan Sarah Beth Boothby of Warner Robins dances with friends as at the Jacksonville Landing on Oct. 28, 2011.\n19 / 24\nBrant Sanderlin Fans party at the Jacksonville Landing Friday night Oct. 28, 2016.\n20 / 24\nHYOSUB SHIN / AJC/hshin@ajc.com Georgia and Florida fans elebrate during an annual party at the Jacksonville Landing on the eve of the Georgia vs Florida game on Oct. 28, 2016.\n21 / 24\nHYOSUB SHIN / AJC/hshin@ajc.com Georgia fan Libby Terrell dances during an annual party at the Jacksonville Landing on the eve of the Georgia vs Florida game on Friday, Oct. 28, 2016.\n22 / 24\nHYOSUB SHIN / AJC/hshin@ajc.com Georgia and Florida fans gather to celebrate during an annual party at the Jacksonville Landing on the eve of the Georgia - Florida game on Friday, Oct. 30, 2015.\n23 / 24\nHYOSUB SHIN / AJC/hshin@ajc.com Georgia and Florida fans gather to celebrate during an annual party at the Jacksonville Landing on the eve of the Georgia - Florida game on Oct. 30, 2015.\n24 / 24","url":"https://www.ajc.com/news/photos-uga-fans-jacksonville-landing-through-the-years/22BRp7ytR2Xs6VzeAnF3JK/"}
