{"authors":["Emma Pettit"],"date_download":"2018-10-30 22:18:55","date_modify":"2018-10-30 22:18:55","date_publish":"2017-03-14 00:00:00","description":"Two people were hospitalized after a stolen car they were in ran off an Arkansas highway, hit a tree and ejected them Tuesday afternoon, authorities said.","filename":"data/vaneerConsumption/PHOTOS2ejectedafterstolencarinhighspeedchasecrashesnearI40policesay.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/14/resized_250499-cop-chase-crash1_5-22759_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_14_police-2-e_f50647c3a61151b124c486d308c9646a__page=2_1540937935.html","title":"PHOTOS: 2 ejected after stolen car in high-speed chase crashes near I-40, police say","title_page":"PHOTOS: 2 ejected after stolen car in high-speed chase crashes near I-40, police say","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas Democrat-Gazette/BENJAMIN KRAIN --3/14/17-- Lonoke County Sheriff Department and State Police investigate and accident in North Little Rock that injured two people after they were ejected from a stolen vehicle during a high speed chase. The driver refused to pull over for a Lonoke County sheriff's office deputy during a traffic vilation in Cabot around 12:30 Tuesday and led several other law enforcement vehicles on a pursuit until it hit a tree while exiting Interstate 40 westbound at Highway 167. The driver who had multiple warrants out for his arrest and the passenger were seriously injured after being ejected. - Photo by Benjamin Krain\nTwo people were hospitalized after a stolen car they were in ran off an Arkansas highway, hit a tree and ejected them Tuesday afternoon, authorities said.\nA Lonoke County sheriff's office deputy attempted to pull over the black Pontiac in Cabot for a traffic violation around 12:30 p.m., spokesman Lt. Matt Edwards said at the scene of the crash.\nClick here for larger versions\nPhotos by Emma Pettit\nThe vehicle did not pull over, and more Lonoke County deputies joined the pursuit, Edwards said. Eventually, the car made its way to westbound Interstate 40 and took an exit onto northbound U.S. 167, he said. At one point the vehicle was clocked going 105 mph, Edwards said, noting Arkansas State Police also joined the pursuit.\nWhile exiting the interstate, the Pontiac lost control and slammed into a tree, ejecting a man and a woman, Edwards said. They were taken to a nearby hospital for treatment, he said. There was no immediate indication of the extent of their injuries.\nThe car was reported stolen out of North Little Rock, and the man had multiple warrants out for his arrest, Edwards said. Charges against the pair are pending.","url":"https://www.arkansasonline.com/news/2017/mar/14/police-2-ejected-after-stolen-car-high-speed-chase/?page=2"}
