{"authors":[],"date_download":"2018-10-30 19:36:52","date_modify":"2018-10-30 19:36:52","date_publish":"2016-10-15 00:00:00","description":"Photos: Georgia falls to Vanderbilt","filename":"data/vaneerConsumption/PhotosGeorgiafallstoVanderbilt.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/15/Images/101616%20uga%20photos%20bs20.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_photos-georgia-falls-vanderbilt__1540928212.html","title":"Photos: Georgia falls to Vanderbilt","title_page":"Photos: Georgia falls to Vanderbilt","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 15\nBrant Sanderlin/AJC Georgia Bulldogs quarterback Jacob Eason is helped up by teammate Greg Pyke after he was sacked to bring up 4th and 15 in the third quarter against the Vanderbilt Commodores on Saturday, Oct. 15, 2016, at Sanford Stadium in Athens.\n2 / 15\nBrant Sanderlin/AJC Georgia Bulldogs quarterback Jacob Eason walks off the field after falling 17-16 to the Vanderbilt Commodores Saturday, Oct. 15, 2016. at Sanford Stadium in Athens.\n3 / 15\nBrant Sanderlin/AJC Georgia Bulldogs wide receiver Isaiah McKenzie walks off the field after falling 17-16 to the Vanderbilt Commodores Saturday, Oct. 15, 2016. at Sanford Stadium in Athens.\n4 / 15\nBrant Sanderlin/AJC Georgia Bulldogs head coach Kirby Smart walks off the field after falling to the Vanderbilt Commodores 17-16 Saturday Oct. 15, 2016, at Sanford Stadium in Athens.\n5 / 15\nBrant Sanderlin/AJC Georgia Bulldogs quarterback Jacob Eason throws under pressure from Vanderbilt Commodores cornerback Taurean Ferguson during the fourth quarter Saturday, Oct. 15, 2016. at Sanford Stadium in Athens.\n6 / 15\nBrant Sanderlin/AJC Georgia Bulldogs linebacker Lorenzo Carter sacks Vanderbilt Commodores quarterback Vanderbilt Commodores quarterback Kyle Shurmur during the first half Saturday Oct. 15, 2016, at Sanford Stadium in Athens.\n7 / 15\nBrant Sanderlin/AJC Georgia Bulldogs quarterback Jacob Eason's pass in the end zone was just out of reach of wide receiver Riley Ridley during the first half Saturday Oct. 15, 2016, at Sanford Stadium in Athens.\n8 / 15\nBrant Sanderlin/AJC Georgia Bulldogs defensive back Juwuan Briscoe tries to strip the ball from Vanderbilt Commodores running back Khari Blasingame during the 4th quarter on Saturday, Oct. 15, 2016, at Sanford Stadium in Athens.\n9 / 15\nBrant Sanderlin/AJC Georgia Bulldogs place kicker Rodrigo Blankenship watches his 45 yard field goal in the first half against the Vanderbilt Commodores Saturday Oct. 15, 2016, at Sanford Stadium in Athens.\n10 / 15\nBrant Sanderlin/AJC Georgia Bulldogs place kicker Rodrigo Blankenship is congratulated by Aulden Bynum after kicking a 45 yard field goal in the first half against the Vanderbilt Commodores Saturday Oct. 15, 2016, at Sanford Stadium in Athens.\n11 / 15\nBrant Sanderlin/AJC Georgia Bulldogs wide receiver Reggie Davis hauls in a pass in front of Vanderbilt Commodores cornerback Torren McGaster during the first half Saturday Oct. 15, 2016, at Sanford Stadium in Athens.\n12 / 15\nBrant Sanderlin/AJC Georgia Bulldogs quarterback Jacob Eason keeps against the Vanderbilt Commodores to pick up a first down in the first half on Saturday, Oct. 15, 2016, at Sanford Stadium in Athens.\n13 / 15\nBrant Sanderlin/AJC Georgia Bulldogs running back Nick Chubb is brought down by Vanderbilt Commodores linebacker Ja'karri Thomas during the 3rd quarter on Saturday, Oct. 15, 2016, at Sanford Stadium in Athens.\n14 / 15\nBrant Sanderlin/AJC Georgia Bulldogs fullback Christian Payne tries to elude the tackle of Vanderbilt Commodores linebacker Zach Cunningham during the 3rd quarter on Saturday, Oct. 15, 2016, at Sanford Stadium in Athens.\n15 / 15","url":"https://www.ajc.com/sports/college/photos-georgia-falls-vanderbilt/CeY5Cv9bkjO4nUa3Mggb8L/"}
