{"authors":[],"date_download":"2018-10-30 20:06:41","date_modify":"2018-10-30 20:06:41","date_publish":"2016-10-02 00:00:00","description":"NFC South division battle between the Carolina Panthers and Atlanta Falcons Sunday, Oct. 2, 2016, at the Georgia Dome in Atlanta.","filename":"data/vaneerConsumption/PhotosPanthersvsFalcons.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/02/Images/100316%20falcons%20photos%20bs36.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_photos-panthers-falcons__1540930001.html","title":"Photos: Panthers vs. Falcons","title_page":"Photos: Panthers vs. Falcons","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 47\nBrant Sanderlin Atlanta Falcons quarterback Matt Ryan celebrates after connecting with wide receiver Julio Jones for a 75-yard touchdown against the Carolina Panthers in the Georgia Dome Sunday October 2, 2016. Ryan was 28-of- 27 for 503 yards with four touchdowns.\n2 / 47\nBrant Sanderlin/AJC Atlanta Falcons wide receiver Julio Jones hauls in one of his record-breaking catches against the Carolina Panthers Sunday, Oct. 2, 2016, at the Georgia Dome in Atlanta.\n3 / 47\nBrant Sanderlin Atlanta Falcons wide receiver Julio Jones hauls in a Matt Ryan pass in front of Carolina Panthers cornerback Daryl Worley in the Georgia Dome Sunday, October 2, 2016. Jones set a franchise record with 12 receptions and 300 yards and 1 touchdown. The performance was the 6th-highest receiving yardage game in NFL history.\n4 / 47\nBrant Sanderlin/AJC Atlanta Falcons wide receiver Julio Jones holds onto a pass in front of Carolina Panthers cornerback Bene' Benwikere during the second quarter in the Georgia Dome Sunday October 2, 2016. Jones had 12 receptions for 300 yards in the record breaking performance.\n5 / 47\nBrant Sanderlin/AJC Atlanta Falcons running back Tevin Coleman lunges for extra yardage to pick up a first down as Carolina Panthers middle linebacker A.J. Klein tries to hand on in the Georgia Dome Sunday October 2, 2016.\n6 / 47\nBrant Sanderlin Atlanta Falcons tight end Jacob Tamme scores on a pass from Matt Ryan in the first quarter against the Carolina Panthers in the Georgia Dome Sunday October 2, 2016.\n7 / 47\nBrant Sanderlin/AJC Atlanta Falcons wide receiver Aldrick Robinson haul in a Matt Ryan touchdown pass in front of Carolina Panthers strong safety Kurt Coleman during the second half in the Georgia Dome Sunday October 2, 2016.\n8 / 47\nBrant Sanderlin/AJC Atlanta Falcons wide receiver Julio Jones tries to elude Carolina Panthers Colin Jones and James Bradberry in the Georgia Dome Sunday October 2, 2016.\n9 / 47\nBrant Sanderlin/AJC Atlanta Falcons running back Devonta Freeman breaks the tackle of Carolina Panthers outside linebacker Shaq Green-Thompson in route to a first quarter touchdown in the Georgia Dome Sunday October 2, 2016.\n10 / 47\nBrant Sanderlin Atlanta Falcons wide receiver Julio Jones reacts after beating Carolina Panthers cornerback Bene' Benwikere deep for a second quarter pass reception in the Georgia Dome Sunday October 2, 2016.\n11 / 47\nBrant Sanderlin/AJC Atlanta Falcons quarterback Matt Ryan throws against the Carolina Panthers in the Georgia Dome Sunday October 2, 2016.\n12 / 47\nBrant Sanderlin Atlanta Falcons cornerback Robert Alford reacts after making his second interception in the 4th quarter against the Carolina Panthers in the Georgia Dome Sunday, October 2, 2016.\n13 / 47\nBrant Sanderlin/AJC Atlanta Falcons wide receiver Julio Jones hauls in a pass in front of Carolina Panthers cornerback Bene' Benwikere strong safety Kurt Coleman during the second quarter in the Georgia Dome Sunday October 2, 2016.\n14 / 47\nBrant Sanderlin/AJC Atlanta Falcons wide receiver Julio Jones waits for the ball after getting position on Carolina Panthers cornerback James Bradberry during the first quarter in the Georgia Dome Sunday October 2, 2016.\n15 / 47\nBrant Sanderlin Atlanta Falcons wide receiver Julio Jones tries to elude Carolina Panthers Colin Jones and James Bradberry in the Georgia Dome Sunday October 2, 2016.\n16 / 47\nBrant Sanderlin/AJC Atlanta Falcons quarterback Matt Ryan calls the play at the line of scrimmage against the Carolina Panthers in the Georgia Dome Sunday October 2, 2016.\n17 / 47\nBrant Sanderlin/AJC Carolina Panthers running back Fozzy Whittaker is brought down by Atlanta Falcons Kemal Ishmael Keanu Neal during the second quarter in the Georgia Dome Sunday October 2, 2016.\n18 / 47\nBrant Sanderlin/AJC Atlanta Falcons quarterback Matt Ryan throw deep under pressure from Carolina Panthers defensive tackle Kawann Short during the first quarter in the Georgia Dome Sunday October 2, 2016.\n19 / 47\nJohn Bazemore/AP Carolina Panthers middle linebacker Luke Kuechly (59) sacks Atlanta Falcons quarterback Matt Ryan (2) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n20 / 47\nKevin C. Cox/Getty Images Devonta Freeman #24 of the Atlanta Falcons breaks a tackle by Shaq Thompson #54 of the Carolina Panthers on the way to a touchdown at Georgia Dome on October 2, 2016 in Atlanta, Georgia. (Photo by Kevin C. Cox/Getty Images)\n21 / 47\nKevin C. Cox/Getty Images Devonta Freeman #24 of the Atlanta Falcons dives for a touchdown against the Carolina Panthers at Georgia Dome on October 2, 2016 in Atlanta, Georgia. (Photo by Kevin C. Cox/Getty Images)\n22 / 47\nRainier Ehrhardt/AP Atlanta Falcons wide receiver Aldrick Robinson (19) celebrates Atlanta Falcons running back Devonta Freeman's touchdown against the Carolina Panthers during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n23 / 47\nRainier Ehrhardt/AP Atlanta Falcons wide receiver Julio Jones (11) makes a catch against Carolina Panthers cornerback Daryl Worley (26) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n24 / 47\nJohn Bazemore/AP Carolina Panthers wide receiver Kelvin Benjamin (13) is hit by Atlanta Falcons strong safety Kemal Ishmael (36) and Atlanta Falcons cornerback Desmond Trufant (21) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n25 / 47\nRainier Ehrhardt/AP Carolina Panthers strong safety Kurt Coleman (20) celebrates his interception and touchdown against the Atlanta Falcons during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n26 / 47\nJohn Bazemore/AP Atlanta Falcons head coach Dan Quinn fist bumps a coach after the Carolina Panthers were stopped during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n27 / 47\nRainier Ehrhardt/AP Atlanta Falcons fullback Patrick DiMarco (42) runs against Carolina Panthers cornerback Daryl Worley (26) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n28 / 47\nRainier Ehrhardt/AP Carolina Panthers wide receiver Kelvin Benjamin (13) past Atlanta Falcons defensive back Brian Poole (34) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n29 / 47\nRainier Ehrhardt/AP Carolina Panthers wide receiver Corey Brown (10) works for a catch against Atlanta Falcons defensive back Brian Poole (34) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n30 / 47\nJohn Bazemore/AP Carolina Panthers strong safety Kurt Coleman (20) scores a touchdown after he intercepted the ball thrown by Atlanta Falcons quarterback Matt Ryan (2) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n31 / 47\nJohn Bazemore/AP Carolina Panthers middle linebacker Luke Kuechly (59) celebrates the sack of Atlanta Falcons quarterback Matt Ryan (2) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n32 / 47\nRainier Ehrhardt/AP Atlanta Falcons tight end Jacob Tamme (83) scores a touchdown against Carolina Panthers outside linebacker Thomas Davis (58) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n33 / 47\nScott Cunningham/Getty Images ATLANTA, GA - OCTOBER 2: Jacob Tamme #83 of the Atlanta Falcons runs with a catch for a first quarter touchdown against Thomas Davis #58 of the Carolina Panthers at the Georgia Dome on October 2, 2016 in Atlanta, Georgia. (Photo by Scott Cunningham/Getty Images)\n34 / 47\nJohn Bazemore/AP Atlanta Falcons quarterback Matt Ryan (2) passes the ball against the Carolina Panthers during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n35 / 47\nRainier Ehrhardt/AP Carolina Panthers quarterback Cam Newton (1) warms up before the first half of an NFL football game between the Atlanta Falcons and the Carolina Panthers, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n36 / 47\nRainier Ehrhardt/AP Atlanta Falcons quarterback Matt Ryan (2) runs up field against the Carolina Panthers during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n37 / 47\nJohn Bazemore/AP Atlanta Falcons running back Devonta Freeman (24) runs toward the end zone for a touchdown against Carolina Panthers outside linebacker Shaq Green-Thompson (54) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n38 / 47\nJohn Bazemore/AP Carolina Panthers quarterback Cam Newton (1) gestures a first down against the Atlanta Falcons during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n39 / 47\nRainier Ehrhardt/AP Atlanta Falcons linebacker Sean Weatherspoon (56) tackles Carolina Panthers quarterback Cam Newton (1) during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n40 / 47\nJohn Bazemore/AP Carolina Panthers quarterback Cam Newton (1) and Carolina Panthers head coach Ron Rivera stand on the sidelines during the national anthem before the first half of an NFL football gamen between the Atlanta Falcons and the Carolina Panthers, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n41 / 47\nJohn Bazemore/AP Carolina Panthers quarterback Cam Newton (1) calls a play in huddle against the Atlanta Falcons during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n42 / 47\nRainier Ehrhardt/AP Carolina Panthers quarterback Cam Newton (1) works against the Atlanta Falcons during the first half of an NFL football game, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n43 / 47\nRainier Ehrhardt/AP Atlanta Falcons cheerleaders perform before the first half of an NFL football game between the Atlanta Falcons and the Carolina Panthers, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n44 / 47\nRainier Ehrhardt/AP Atlanta Falcons wide receiver Julio Jones (11) warms up before the first half of an NFL football game between the Atlanta Falcons and the Carolina Panthers, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n45 / 47\nJohn Bazemore/AP Actor Samuel L. Jackson takes a photo on the sidelines before the first half of an NFL football game between the Atlanta Falcons and the Carolina Panthers, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/John Bazemore)\n46 / 47\nRainier Ehrhardt/AP Olympic gold medalist swimmer Madeline Dirado, left, speaks with Atlanta Falcons owner Arthur Blank before the first half of an NFL football game between the Atlanta Falcons and the Carolina Panthers, Sunday, Oct. 2, 2016, in Atlanta. (AP Photo/Rainier Ehrhardt)\n47 / 47","url":"https://www.ajc.com/sports/football/photos-panthers-falcons/BcetcAKfA84vVpjaDlVSwO/"}
