{"authors":["Gerard Couzens For Mailonline"],"date_download":"2018-10-23 03:17:17","date_modify":"2018-10-23 03:17:17","date_publish":"2016-01-11 15:54:59","description":"Ambulance workers took photographs of the catfish which had impaled a tourist's stomach at a Sao Paulo beach resort. She was taken to hospital to have the creature surgically removed","filename":"data/vaneerConsumption/Photosshowhowcatfishimpaledthemselvesontwotourists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B70A300000578-0-image-a-13_1452526414089.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3393880_Shocking-photos-catfish-impaled-two-tourists-leaving-huge-spikes-flesh_1540264637.html","title":"Photos show how catfish impaled themselves on two tourists","title_page":"Photos show how catfish impaled themselves on two tourists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"These shocking photos show the aftermath of painful encounters with catfish that two tourists experienced at a popular beach resort in Brazil.\nOne fish became lodged in the stomach of one swimmer, while another was dragged from the sea with a catfish dangling from her arm.\nAmbulance workers took the picture of the fish impaled in the tourist's stomach as they took the woman to hospital to have the creature removed.\nScroll down for videos\nThe catfish pierced the woman's stomach after she went swimming at a popular tourist spot in Brazil\nThe fish was cut from her body at the scene in the resort of Itanhaem in the state of Sao Paulo\nThe serrated spine in its fin had to be taken out with microsurgery to avoid her flesh being ripped out\nThey cut the fish from her body at the scene in the resort of Itanhaem in the state of Sao Paulo.\nBut the serrated spine in its fin had to be taken out with microsurgery to avoid her flesh being ripped out.\nMarcelo Araujo, who posted the picture on his Facebook page, joked: 'A rare occurrence. A swimmer is hit by a fish.'\nHe added: 'We were alerted to an incident where an object had penetrated a swimmer's stomach and when we got there, discovered it was a fish.\n'She was in a lot of pain. We didn't remove the spine because only a doctor can do this. We took her to hospital so she could have microsurgery.\n'Generally we deal with people who have stood on fish or have cut a finger touching one, but I've never seen a catfish stuck to someone's stomach. It was definitely a first.'\nLess than 48 hours later a second swimmer was dragged out of the sea at the same resort with a catfish attached to her arm.\nThe woman victim looked to be in agony as she was attended on the beach at Itanhaem.\nA fellow tourist filmed first-aiders comforting her as the fish dangled from her left arm with its serrated spines stuck deep into her skin.\nAnother female swimmer was dragged out of the same waters after a catfish lodged itself on her arm\nShe appeared at times to be semi-conscious and needed help to keep her head from rolling forwards as crowds gathered round to see the bizarre scenario for themselves.\nWitness Cristian Fernandes, who videoed the latest scare and posted footage on YouTube, said: 'She was shouting a lot and asking for the fish to be removed because it was hurting her a lot.'\nLike the first victim, she was taken to hospital for microsurgery to remove the spine.\nA spokesman for the local Maritime Firefighters Group which dealt with the incident, said: 'We don't recommend removing the spines for the safety of the victims.\n'They're like saws or the tips of arrows.\n'You never know if they've reached important arteries and if pulling them out on the spot can cause even more damage.'\nParamedic Marcelo Araujo, who was called to the earlier incident involving a catfish in Itanhaem, called it a 'first.'\nOne of the firefighters involved in the new drama, said: 'They're atypical cases because generally we see people who been injured by accidentally standing on fish.\n'To see them causing harm to other parts of the body is really surprising.\n'Our recommendation is to remain calm and wait for proper medical attention.'\nLast September a shocking video went viral of a sunbather getting stabbed in the leg with a catfish while messing around with a friend on a beach.\nOne of the bikini-clad women chased the other around with the dead fish before the prank backfired and it accidentally attached itself to her.\nThe injured woman, called Tina, grew increasingly worried and told friends in the footage she was concerned she would get a disease.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3393880/Shocking-photos-catfish-impaled-two-tourists-leaving-huge-spikes-flesh.html"}
