{"authors":["Abc News"],"date_download":"2018-10-30 00:53:57","date_modify":"2018-10-30 00:53:57","date_publish":"2018-10-28 20:05:33","description":"The 10-day hunt for a mystery couple behind a viral engagement is over.","filename":"data/vaneerConsumption/PhotographerwhosnappedviralsurpriseproposalatYosemitefindscouple.json","image_url":"https://s.abcnews.com/images/US/yosemite.proposal4.10.28.18_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Living_photographer-sna_2a7f8274ed1807adc98538f63e62c126_story_id=58814688_1540860837.html","title":"Photographer who snapped viral surprise proposal at Yosemite finds couple","title_page":"Photographer who snapped viral surprise proposal at Yosemite finds couple - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"With the help of hundreds of thousands of social media users, the 10-day hunt for a mystery couple behind a picture perfect viral engagement photograph is over.\nOn Oct. 17, photographer Matthew Dippel of Kentwood, Michigan, shared a stunning image that captured what appeared to be a proposal taking place at Taft Point in Yosemite National Park. However, he had no idea who the couple was.\n“I ran over there to try and find them, asked maybe 20-25 individuals and came up short,” Dippel told ABC News.\nMatthew Dippel\nThat’s when he turned to social media to try and track them down.\nDippel shared the picture on his social media accounts, attaching the following caption on Twitter, \"Twitter help, idk who these two are but I hope this finds them. I took this at Taft Point at Yosemite National Park, on October 6th, 2018.\"\nWithin hours, the image went viral thanks to the thousands hoping to uncover the mystery couple. Over a week later, Dippel shared with his followers that the two behind the image were finally found.\nCharlie Bear\n\"UPDATE: I FOUND THEM. Everyone meet, Charlie Bear and his fiancé Melissa the happy happy couple that was out on the point in my Taft Point Proposal. In short, I captured the second proposal, the more special and official one in Charlie’s words. Huge congratulations to you two. I wish I was able to meet you in person and hug you. I’m glad I finally found you to share this special moment with you, thanks for being so awesome, maybe one day we will finally meet in person!\"\nBear told ABC News he came across the image by complete accident. He was scrolling through a local news station’s Instagram feed looking for a friend’s picture they had re-posted when he instead came across the viral one of his fiancée and himself. He cited the couple’s love for the outdoors as the reason for getting down on one knee in that spot.\nCharlie Bear\n\"Basically we went on a hike at Taft and I decided to surprise Melissa with a 2nd proposal, for personal/meaningful reasons,\" he said. \"Since Melissa and I love to travel and hike and the outdoors I wanted to give her an epic proposal photo and that’s how it came about.\"\nTo date, Dippel’s initial image and message have been retweeted over 165,000 times and shared on Facebook nearly 20,500 times.\n\"I’ve seen countless photos from this point. It’s super popular ... I’m just surprised at how viral my mysterious couple became!\"","url":"https://abcnews.go.com/GMA/Living/photographer-snapped-viral-surprise-proposal-yosemite-finds-couple/story?id=58814688"}
