{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:32:18","date_modify":"2018-10-30 21:32:18","date_publish":"2015-05-13 15:31:42","description":"\"Captain America: Civil War\" is filming at Peachtree Christian Church in Midtown today, across the s...","filename":"data/vaneerConsumption/PhotosfromthesetofCaptainAmericaCivilWar.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_photos-from-the-set-captain-america-civil-war__1540935138.html","title":"Photos from the set of \"Captain America: Civil War\"","title_page":"Photos from the set of \"Captain America: Civil War\"","title_rss":"NULL","source_domain":"ajc.com","text":"\"Captain America: Civil War\" is filming at Peachtree Christian Church in Midtown today, across the street from The Temple, where extras were staging.\nThe interfaith effort turned traffic into a holy mess but the cast and crew have all been blessedly polite. Amen!\nPAST COVERAGE:\nPhotos from the Buckhead set\nChris Evans spotted toning his \"monster\" physique at Atlanta gym\nScarlett Johansson, Chris Evans spotted in Buckhead\n\"Captain America: Civil War\" films in downtown Atlanta, Buckhead hotel\n\"Captain America: Civil War\" is filming at Peachtree Christian Church today. I'd recommend an alternate route if you can take one. Photos: Jennifer Brett\nOfficers had to stop traffic a few times during filming. Photos: Jennifer Brett\nExtras prepare to head across the street. Photos: Jennifer Brett\nMarvel's “Captain America” threequel stars Chris Evans, Scarlett Johansson, Robert Downey Jr., Paul Rudd, Elizabeth Olsen, Jeremy Renner, Emily VanCamp, Paul Bettany, Sebastian Stan Martin Freeman, Chadwick Boseman, Anthony Mackie, Frank Grillo, Daniel Brühl, Don Cheadle and William Hurt.\nPeachtree Christian Church Pastor Barry McCarty said the “cast and crew have been incredibly nice onsite guests.”","url":"https://www.ajc.com/blog/buzz/photos-from-the-set-captain-america-civil-war/Ey4ru9rLWJhijsLOQjqF3J/"}
