{"authors":[],"date_download":"2018-10-30 14:28:45","date_modify":"2018-10-30 14:28:45","date_publish":"2017-02-10 00:00:00","description":"Former Georgia congressman Tom Price resigned as Secretary of HHS on Sept. 29, 2017 after tumultuous eight months in the Trump administration.","filename":"data/vaneerConsumption/PhotosTomPriceformerSecretaryofHealthandHumanServices.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/02/10/Images/newsEngin.17715265_price-oath.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national-govt--politic_17e6d9d4be6c4340ad36c9952e2e1cd0__1540909725.html","title":"Photos: Tom Price, former Secretary of Health and Human Services","title_page":"Photos: Tom Price, former Secretary of Health and Human Services","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 21\nThe Atlanta Journal-Constitution Vice President Mike Pence, right, administers the oath of office Friday to Tom Price to become the nation’s 23rd secretary of health and human services. Price resigned on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets. (Photo by Mark Wilson/Getty Images)\n2 / 21\nAndrew Harnik Former Health and Human Services Secretary Tom Price, center, accompanied by his wife Betty, and Vice President Mike Pence, signs an official document during a swearing in ceremony, Friday, Feb. 10, 2017. Price resigned on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets,(AP Photo/Andrew Harnik)\n3 / 21\nJ. Scott Applewhite/AP Republicans hoped that as President Donald Trump's choice to run the Department of Health and Human Services, Rep. Tom Price, R-Ga will preside over the dismantlement of President Barack Obama's signature health care law. Price resigned on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n4 / 21\nAndrew Harnik/AP In this file photo, Rep. Tom Price, R-Ga., right, and Sen. Johnny Isakson, R-Ga. talk on Capitol Hill in Washington, Tuesday, Jan. 24, 2017, prior to the start of Price's confirmation hearing before the Senate Finance Committee. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets. (AP Photo/Andrew Harnik)\n5 / 21\nJ. Scott Applewhite/AP In this file photo from Thursday, Jan. 7, 2016, House Budget Committee Chairman Tom Price, R-Ga., left, is congratulated by Speaker of the House Paul Ryan, R-Wis., at a bill signing ceremony at the Capitol in Washington. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n6 / 21\nCurtis Compton/AJC Then Republican Vice Presidential nominee and Indiana Governor Mike Pence, his wife Karen, and congressman Tom Price make a campaign stop to shore up support for Donald Trump in Georgia at the Cobb Galleria Centre on Monday, Aug. 29, 2016, in Marietta. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n7 / 21\nAL DRAGO/NYT In this file photo, Senate Majority Leader Mitch McConnell (R-Ky.) meets with Rep. Tom Price (R-Ga.), President Donald Trump's pick for health and human services secretary, on Capitol Hill in Washington, Dec. 6, 2016. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n8 / 21\nEvan Vucci/AP Senate Finance Committee Chairman Sen. Orrin Hatch, R-Utah, left, meets with Secretary of Health and Human Services-designate Rep. Tom Price, R- Ga., Thursday, Dec. 8, 2016, on Capitol Hill in Washington. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n9 / 21\nAlex Brandon/AP In this Nov. 30, 2016 file photo, Health and Human Services Secretary-designate, Rep. Tom Price, R-Ga. speaks in Washington. Propelled by populist energy, President-elect Donald Trump’s candidacy broke long-standing conventions and his incoming Cabinet embodies a sharp turn from the outgoing Obama administration. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n10 / 21\nAllison Shelley/Getty Images Committee chair Rep. Tom Price (R-GA) speaks during a U.S. House Budget Committee markup on the Concurrent Resolution on the Budget for FY 2016 on Capitol Hill in Washington, D.C. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n11 / 21\nJohn Shinkle/AP/Politico.com Rep. Tom Price, R-Ga., left, accompanied by then congressman Mike Pence, R-Ind., and others, makes remarks during a news conference on Capitol Hill in Washington, Monday, Aug. 4, 2008, demanding that House Speaker Nancy Pelosi bring back Congress and has a vote on energy legislation during the summer recess. Price resigned as Secretary of Health and Human Services on Sept. 29, 2017 after racking up at least $1 million in travel on private and military jets.\n12 / 21\nAJC File Photo Tom Price is pictured here with his wife, Betty Price. Betty Price represented the 48th District in Georgia's House of Representatives before serving as Secretary of Health and Human Services.\n13 / 21\nJason Getz/AJC Former U.S. Representative Tom Price, right, talks with a fellow republican during the first day of candidate qualifying in the House and Senate Chambers at the State Capitol Wednesday morning in Atlanta, Ga., May 23, 2012. The republican party was qualifying in the House and the democratic party was qualifying in the Senate.\n14 / 21\nsouthernheritagepac.org After Republicans in the state Capitol cut a deal with Democrats to avoid a statewide referendum on the 1956 state flag and its Confederate battle emblem, critics produced a deck of cards with the faces of white lawmakers who had opposed them. Tom Price, then the Senate majority leader, was the ace of diamonds.\n15 / 21\nCliff Owen/AP In this file photo, House Budget Committee Chairman Rep. Tom Price, R-Ga. holds-up a synopsis of the House Republican budget proposal as he announces the plan on Capitol Hill in Washington, Tuesday, March 17, 2015. The plan included a boost in defense spending but cuts in the Medicaid program for the poor, food stamps and health care subsidies.\n16 / 21\nManuel Balce Ceneta/AP In this file photo, House Budget Committee member Rep. Tom Price, R-Ga., right, accompanied by committee Chairman Paul Ryan, R-Wis., left, and other committee members, speaks during a news conference on Capitol Hill in Washington, Wednesday, Dec. 7, 2011, to unveil a \"comprehensive reform effort aimed to repair the broken budget process\".\n17 / 21\nJ. Scott Applewhite/AP In this Jan. 13, 2015 file photo, House Ways and Means Committee Chairman Rep. Paul Ryan, R-Wis., left, joined by Rep. Tom Price, R-Ga., heads to a meeting of House Republicans on Capitol Hill in Washington. When President-elect Donald Trump takes office in January, Republicans will have the opportunity to do something they have desired for years - overhaul Medicaid, the program that provides health care to millions of lower-income and disabled Americans. Republicans have argued that states have little incentive to keep expenses under control, because no state pays more than half the total cost. Both Ryan and Trump's pick for secretary of health and human services, Price, want to switch to block grants.\n18 / 21\nCobb Chamber of Commerce In this file photo, U.S Rep. Mac Thornberry, R-Texas, chairman of the House Armed Services Committee, left, greets U.S. Rep. Tom Price, R-Roswell, at the 63rd Military Appreciation Luncheon held by the Cobb Chamber of Commerce and the Atlanta Regional Military Affairs Council in 2015.\n19 / 21\nJason Getz/AJC U.S. Representative Tom Price, center, jokes with fellow republicans during the first day of candidate qualifying in the House and Senate Chambers at the State Capitol Wednesday morning in Atlanta, Ga., May 23, 2012. The republican party was qualifying in the House and the democratic party was qualifying in the Senate.\n20 / 21\nJ. Scott Applewhite/AP Rep. Tom Price, R-Ga., center, flanked by Rep. Mike Kelly, R-Pa., left, and Rep. Mark Meadows, R-N.C., speaks during a news conference on Capitol Hill in Washington, Friday, Aug. 2, 2013, about his bill, the \"Keep the IRS Off Your Health Care Act,\" which the House passed and targets President Barack Obama's health care overhaul. The bill aims to prevent the Internal Revenue Service from implementing any part of the health care law. It is the 40th time the Republican-controlled House has tried to block the Affordable Care Act, popularly known as Obamacare.\n21 / 21","url":"https://www.ajc.com/news/national-govt--politics/photos-tom-price-former-secretary-health-and-human-services/D8E0v9gzdF2LNUW75q9ncN/"}
