{"authors":[],"date_download":"2018-10-30 21:03:11","date_modify":"2018-10-30 21:03:11","date_publish":"2016-12-02 00:00:00","description":"Tex McIver, an attorney, has maintained the Sept. 25 shooting death of his wife was an accident. Photos show items that were set for auction Dec. 7-10","filename":"data/vaneerConsumption/PhotosTexMcIversellingwifesclothesjewelryinestatesale.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/02/Images/photos.medleyphoto.12371400.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_photos-tex-mciver-sell_ce63cb2ff014319b6558c84a9c50303a__1540933391.html","title":"Photos: Tex McIver selling wife's clothes, jewelry in estate sale","title_page":"Photos: Tex McIver selling wife's clothes, jewelry in estate sale","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 13\nHyosub Shin Christy Ogletree Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, is seen on Dec. 2, 2016, preparing for the estate sale of Diane McIver's wardrobe. HYOSUB SHIN / HSHIN@AJC.COM\n2 / 13\nHyosub Shin Christy Ogletree Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, is seen on Dec. 2, 2016, preparing for the estate sale of Diane McIver's wardrobe. HYOSUB SHIN / HSHIN@AJC.COM\n3 / 13\nHyosub Shin Christy Ogletree Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, is seen on Dec. 2, 2016, preparing for the estate sale of Diane McIver's wardrobe. HYOSUB SHIN / HSHIN@AJC.COM\n4 / 13\nHyosub Shin Christy Ogletree Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, is seen on Dec. 2, 2016, preparing for the estate sale of Diane McIver's wardrobe. HYOSUB SHIN / HSHIN@AJC.COM\n5 / 13\nHyosub Shin Christy Ogletree Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, is seen on Dec. 2, 2016, preparing for the estate sale of Diane McIver's wardrobe. HYOSUB SHIN / HSHIN@AJC.COM\n6 / 13\nHyosub Shin Christy Ogletree Ahlers, owner of Peachtree Battle Estate Sales and Liquidations, prepares for the estate sale of Diane McIver's wardrobe as she is surrounded by more than 2,000 of Diane McIver's clothing and jewelry items in a warehouse showroom at Peachtree Battle Estate Sales and Liquidations on Friday, December 2, 2016. HYOSUB SHIN / HSHIN@AJC.COM\n7 / 13\nHyosub Shin Tex McIver has enlisted an estate liquidation company to sell more than 2,000 of his deceased wife's clothing and jewelry items. HYOSUB SHIN / HSHIN@AJC.COM\n8 / 13\nHyosub Shin Diane McIver's clothing and jewelry items, in a warehouse showroom of Peachtree Battle Estate Sales and Liquidations, are ready for the estate sale. Tex McIver has enlisted an estate liquidation company to sell more than 2,000 of his deceased wife's clothing and jewelry items. HYOSUB SHIN / HSHIN@AJC.COM\n9 / 13\nHyosub Shin More than 2,000 of Diane McIver's clothing and jewelry items in a warehouse showroom of Peachtree Battle Estate Sales and Liquidations.. HYOSUB SHIN / HSHIN@AJC.COM\n10 / 13\nHyosub Shin Diane McIver's shoes in a warehouse showroom of Peachtree Battle Estate Sales and Liquidations are ready for the Dec. 7-10 estate sale. Tex McIver, a high-powered corporate attorney, has maintained the Sept. 25, 2016, shooting death of his wife was an accident and that he didn’t mean to pull the trigger. HYOSUB SHIN / HSHIN@AJC.COM\n11 / 13\nHyosub Shin More than 2,000 items of Diane McIver's clothing and jewelry are seen on December 2, 2016, in a warehouse showroom of Peachtree Battle Estate Sales and Liquidations. Tex McIver has enlisted an estate liquidation company to sell his deceased wife's clothing and jewelry items. HYOSUB SHIN / HSHIN@AJC.COM\n12 / 13\nHyosub Shin More than 2,000 items that belonged to the late Diane McIver are in a warehouse showroom of Peachtree Battle Estate Sales and Liquidations, being prepared for the estate sale that runs December 7-10. Tex McIver has enlisted an estate liquidation company to sell his deceased wife's clothing and jewelry items. HYOSUB SHIN / HSHIN@AJC.COM\n13 / 13","url":"https://www.ajc.com/news/photos-tex-mciver-selling-wife-clothes-jewelry-estate-sale/s9Wim6gzvlFvB8kLFP2DbL/"}
