{"authors":[],"date_download":"2018-10-30 18:50:54","date_modify":"2018-10-30 18:50:54","date_publish":"2015-03-02 00:00:00","description":"Photos: Beverly Hall through the years","filename":"data/vaneerConsumption/PhotosBeverlyHallthroughtheyears.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/03/02/Images/photos.medleyphoto.6853269.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_photos-beverly-hall-through-the-years__1540925454.html","title":"Photos: Beverly Hall through the years","title_page":"Photos: Beverly Hall through the years","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 25\nVino Wong Beverly L. Hall, the former Atlanta schools superintendent whose national acclaim as an education reformer dissolved amid the ignominy of a cheating scandal, died Monday, March 2, 2015 of breast cancer. Hall, who led the Atlanta Public Schools from 1999 to 2011, still faced criminal charges for her alleged role in falsifying students scores on state achievement tests. Hall had strongly denied wrongdoing, but her lawyers said in March she was too ill to withstand a trial. If convicted, she could have received a prison sentence as long as 45 years for racketeering and other offenses.\n2 / 25\nSPECIAL Dr. Beverly Hall, state appointed Newark Schools Superintendent, during an interview in her Newark office. From the start, Hall was seen in Newark as the field marshal of an occupying army. Educators and elected officials resented the state intervention and pounced on Hall’s every misstep. Credit: New Jersey Newsphotos\n3 / 25\nRICH ADDICKS Candidate Beverly Hall, the lone candidate for the Atlanta Public Schools superintendent job, talks with the media in 1999. Rich Addicks/AJC file\n4 / 25\nRICH ADDICKS The head of the committee searching for an Atlanta superintendent in 1999 described luring Hall as “a real coup.” Rich Addicks/AJC file\n5 / 25\nNICK ARROYO At 210 Pryor St. downtown, Beverly Hall -on her first day at work as superintendent of Atlanta public schools- with Sadie Dennard -Atlanta school board president, discussing some preparations for upcoming events and meetings Nick Arroyo/AJC file\n6 / 25\nNICK ARROYO APS Superintendent Beverly Hall at the city's first APS leadership conference for students. Nick Arroyo/AJC file\n7 / 25\nNICK ARROYO Brenda Muhammad (right) is sponsoring an on-line chat with parents, students and school staff members. Superintendent Beverly Hall (left) and others answering a host of questions about the school system. Nick Arroyo/AJC file\n8 / 25\nNICK ARROYO District web master, Evelyn Myers with student, Shynika Evett and Superintendent Beverly Hall (and others) answering a host of questions about the school system. Nick Arroyo/AJC file\n9 / 25\nLEVETTE BAGWELL Superintendent Beverly Hall at the Atlanta Board of Education meeting on Garnett Street Monday in 1999. The Atlanta Board of Education approved the Student Performance Goals of Hall. Levette Bagwell /AJC file\n10 / 25\nNICK ARROYO Atlanta public school superintendant Beverly Hall and Atlanta mayor Bill Campbell at the city's first APS leadership conference for students held at the Civic Center . Nick Arroyo/AJC file\n11 / 25\nBEN GRAY Hall quickly established herself in Atlanta as a different kind of superintendent. Early on, she gathered the district’s principals to announce she planned to replace most of them. Lest they consider a revolt, she warned, “I know how to swim with the sharks.” Ben Gray/bgray@ajc.com\n12 / 25\nNICK ARROYO Students see what it's like to run a school system as part of the Job Shadow Program. Talesha Noble shadowing Superintendent Beverly Hall at the senior staff meeting. Nick Arroyo/AJC file\n13 / 25\nRICK MCKAY Beverly Hall, superintendent of Atlanta Public Schools, left, with Scott Painter, 2002-03 Atlanta Public Schools Teacher of the Year, right, during remarks in Washington, DC at a briefing on the Teaching Commission report titled, \"Teaching at Risk: A Call to Action.\" (Rick McKay/Cox Washington Bureau)\n14 / 25\nKIMBERLY SMITH Beverly Hall in a meeting in 2004 at APS headquarters in Atlanta with other board members where some of the topics of conversation were e-rate accountability issues. Kimberly Smith/AJC file\n15 / 25\nJohn Spink Atlanta's superintendent of schools, Beverly Hall visits Carla Bernard's kindergarten class in 2006. It was the first day of school for children in the Atlanta public schools Monday. John Spink/jspink@ajc.com\n16 / 25\nJohn Spink Atlanta's superintendent of schools, Beverly Hall greets pre-K students Harold Simmons, 4, Charles Whitlock, 4 and William Straton, 4 as E. Rivers principal, Bob Woese looks on. John Spink/jspink@ajc.com\n17 / 25\nJoey Ivansco Atlanta public schools Superintendent Beverly L. Hall photographed in her office in 2007. Joey Ivanso/AJC file\n18 / 25\nHyosub Shin Atlanta schools Superintendent Beverly Hall talks with Endya Boyd and Rodneisha Ooten as Hall visits Beecher Hills Elementary. Hall has received accolades across the state and nation lately for her efforts to improve the school district. Test scores have gone up, which is the main reason she is receiving all this attention. But some parents and teachers say she has implemented reform programs without consulting them or asking for their opinion. Hyosub Shin/ hshin@ajc.com\n19 / 25\nBob Andres Grady principal Dr. Vincent Murray, Arne Duncan, Adolfo Carrion and Beverly Hall listen to a discussion of the Social Diversity Club during his visit to Grady High School in Atlanta. Student at right is Alexandra McColl, 16. U.S. Secretary of Education Arne Duncan visited two Atlanta high schools on Monday. He held a \"listening and learning\" session at Atlanta Tech High School, which is part of a nationwide tour to get local input on education reform. He then attended a discussion at Grady High School with White House Urban Affairs Director Adolfo Carrion about Obama's \"Promise Neighborhood\" initiative to prevent violence among youth and visited a classroom. Bob Andres, bandres@ajc.com\n20 / 25\nHyosub Shin Her stature peaked in 2009, when she was named National Superintendent of the Year — for school administrators, the equivalent of a Nobel Prize. The award was largely based on the school district’s improved scores on standardized tests. The same year, however, the authenticity of those scores came under withering scrutiny. Hyosub Shin/ hshin@ajc.com\n21 / 25\nHyosub Shin Atlanta schools Superintendent Beverly Hall looks at work done by Beecher Hills Elementary students as Joyce McCloud (left), Special Assistant to Superintendent, and Dr. Robin Hall (center), principal, assist at Beecher Hills Elementary. The superintendent has received accolades across the state and nation lately for her efforts to improve the school district. Hyosub Shin/ hshin@ajc.com\n22 / 25\nJohnny Crawford Beverly Hall, superintendent Atlanta Public Schools, speaks during a press conference on the Nation's report card at Atlanta public schools headquarters in 2010. Atlanta Public Schools' 8th grade students have gained 14 points on the National Assessment of Educational Progress (NAEP) reading test since 2002. Johnny Crawford/jcrawford@ajc.com.\n23 / 25\nElissa Eubanks eeubanks@ajc.com By then, however, a reputation so carefully constructed for so many years was irreparably marred. Elissa Eubanks/eeubanks@ajc.com\n24 / 25\nBob Andres Superintendent Beverly Hall discusses her report on the recommendations of the blue ribbon committee with Yolanda Johnson. She read an extended power point presentation from her binder then answered questions from the board members. At Monday's day long board meeting that began at 2pm, the Atlanta School Board was expected to hear Superintendent Beverly Hall detail what the system will change in the wake of an investigation that found 109 employees may have cheated and 12 city schools have pervasive problems. Meanwhile, the board voted to break into executive session shortly after convening. Bob Andres bandres@ajc.com\n25 / 25","url":"https://www.ajc.com/news/photos-beverly-hall-through-the-years/1ddviDPzu2TUNyqUXkQQUN/"}
