{"authors":[],"date_download":"2018-10-30 18:00:40","date_modify":"2018-10-30 18:00:40","date_publish":"2018-08-31 00:00:00","description":"Atlanta photographer Lucinda Bunnen has a new book, 'Gathered,' and a related exhibit opening Sept. 13 at Mason Fine Art Gallery","filename":"data/vaneerConsumption/PhotographerLucindaBunnenreturnswithnewbookexhibit.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/31/Videos/4473324.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_esteemed-atlanta_feb2b9f87ac89fa471cbd5e43e124fbb__1540922440.html","title":"Photographer Lucinda Bunnen returns with new book, exhibit","title_page":"Photographer Lucinda Bunnen returns with new book, exhibit","title_rss":"NULL","source_domain":"ajc.com","text":"Always within reach of her camera, Lucinda Bunnen keenly observes to seize a decisive moment — like when clouds in the sky seem to replicate the cotton balls in the fields of the Mississippi Delta on a cool fall day, or when a cow stands perfectly still in India near the banks of the Ganges River. Her formal portraits and snapshots have included high-profile figures — Jimmy and Rosalynn Carter, Coretta Scott King, Bobby Dodd.\nPhotographer Lucinda Bunnen poses for a portrait at her Atlanta residence, which holds many sources of inspiration for her new book — “Gathered.” ALYSSA POINTER / ALYSSA.POINTER@AJC.COM (The Atlanta Journal-Constitution)\nBut for her most recent project, the renowned photographer found inspiration inside the walls of her Buckhead home. The 79 photographs capture a wide variety of objects — a deer head-shaped piece of wood, two painted pipes by a pipe fitter in Milledgeville, a 1960s baby doll carriage. The pieces include work by local artists. Some of them hail from her travels around the world. Others were discovered close to home while taking a walk with her dogs.\nLast year, Bunnen photographed these objects for her newest book, “Gathered,” which was recently released. Her seventh book to date, “Gathered” offers a glimpse inside Bunnen’s rich and colorful life by featuring simple and beautiful photographs of objects she has collected over the past several decades. The two-piece accordion book, tucked inside a box with red stitching, is an art object unto itself. The self-published book retails for $125 and is available on Bunnen’s website — lucindabunnen.com.\nA few of the many objects that photographer Lucinda Bunnen has collected and photographed are displayed at her Atlanta residence. Bunnen’s new book is called “Gathered,” and a related exhibition will open Sept. 13 at the Mason Fine Art Gallery. ALYSSA POINTER/ALYSSA.POINTER@AJC.COM (The Atlanta Journal-Constitution)\nBunnen will also have an exhibition of the photographs from “Gathered” at the Mason Fine Art Gallery from Sept. 13-Oct. 31. (See below for more information.)\nShe photographed all of the objects in her open-air garage. She found two dropcloths and a card table. She set up a tripod and got to work.\nThere’s a piece of metal from the pump of her swimming pool. Bunnen saw what others may not see, at least at first — a sculpture, streaked in colors — copper brown, turquoise blue, sandy white.\n“I have acquired many strange and wonderful things during the 60 years of life in my house,” she said on a recent morning at her home, “and each piece has a story to tell.”\nThe packaging of “Gathered,” a new book by Lucinda Bunnen, is an art object unto itself. CONTRIBUTED BY BRILLIANT, EXTON PA (The Atlanta Journal-Constitution)\nExuding a vitality that defies her age, Bunnen, 88, smiles as she walks around her house with tall windows and surrounded by trees. She stops at a collection of brightly colored marbles — red and green, orange — resting next to antique spinning tops on a round table.\nShe explains they are among the thousands of circa 1837 marbles discovered by bulldozer operator James W. Kirkland of Harriman, Tenn. He was a subcontractor for one of the construction companies that flattened the dilapidated buildings that covered an area which would later develop into Centennial Olympic Park and what is now Turner Field.\nWhen it comes to her work, Bunnen prefers to say that she “makes a picture” instead of “takes a picture,” emphasizing the role of the artist before and after the shutter blinks.\n“Lucinda is very engaged, very passionate, very active,” High photography curator Brett Abbott (left, with Bunnen) says of the 2013 Nexus Award recipient. The honor was bestowed by the Atlanta Contemporary Art Center (which she helped found 40 years ago) for her artistry and patronage.\nBunnen, also a photo collector and philanthropist, was celebrated in a special 2013 exhibition drawn from more than four decades of giving to the High Museum of Art. Bunnen has supported the acquisition of more than 650 photographs and established the High Museum’s first dedicated photography gallery. The large wedge-shaped space is on the Wieland Pavilion’s Skyway level, the top floor in the Renzo Piano-designed expansion, adjoining modern and contemporary art galleries.\nBunnen’s affinity for photography developed during a family trip to Peru in late 1969. She was turning 40, and didn’t want to celebrate with a party, but instead made plans to usher in the next decade with a family trip to remote areas of South America.\nYayoi Kusama's world-famous exhibit will run at Atlanta's High Museum from Nov. 18, 2018 through Feb. 17, 2019.\nShe made a silent Super 8 movie of the trip, capturing images of natives who had never seen outsiders before.\nShe filmed scenes from Machu Picchu. She filmed farmers, alpacas, children fetching fresh water, barefoot villagers.\nAfter returning home from the Peruvian adventure, she signed up for the first photography class offered at the Atlanta College of Art in 1970.\nShe quickly established herself as a highly unconventional artist.\nWhen assigned to take photos of windows, photography students snapped photos of windows in barns with red geraniums. Bunnen, meanwhile, trekked to 14th Street to snag images of a man standing in a doorway with large glass panes. She captured reflections in the windows, and she encapsulated moments of life passing by — from the bus rumbling by to the man’s reaction to the cute girl strolling in front of him.\nShe initially worried she might be doing something wrong, but her teacher saw Bunnen blossoming as a unique artist and he encouraged her to keep going — and keep doing what she was doing.\nMORE: Suwanee considering public art capital campaign\nLucinda Bunnen’s “Man in Wall Window, New York City” (1970-75), a gelatin silver print, was included in the High Museum of Art photography exhibition “The Bunnen Collection.”\nBunnen’s large and amazingly diverse array of images includes landscapes (mainly trees), surreal compositions, portraits, building facades and travelogues.\nEVENT PREVIEW\n‘Gathered’ exhibit\nSept. 13-Oct. 31. 11 a.m.-5 p.m. Tuesdays-Fridays; noon-5 p.m. Saturdays. Free. Mason Fine Art Gallery, 415 Plasters Ave., Atlanta. 404-879-1500, masonfineartandevents.com.\nNote: Lucinda Bunnen will have a book signing and reception to kick off the exhibit 6-9 p.m. Sept. 13.","url":"https://www.ajc.com/lifestyles/esteemed-atlanta-photographer-lucinda-bunnen-finds-inspiration-home/GnaRbjGRLCqJHR77nwCMhJ/"}
