{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 03:05:01","date_modify":"2018-10-21 03:05:01","date_publish":"2018-08-17 10:01:07","description":"Reuters photographer David Gray documents a drought in Australia.","filename":"data/vaneerConsumption/PhotosofthedroughtinAustraliaNewSouthWales.json","image_url":"https://www.washingtonpost.com/resizer/kHPY2FezVfoqejcrBEBOFWYxVYg=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MHIVA7GQOM56FDY35L4UJJOYTA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_17__1540091101.html","title":"Photos of the drought in Australia New South Wales","title_page":"Photos of the drought in Australia New South Wales - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\nA lone tree stands near a water trough in a drought-affected paddock on Jimmie and May McKeown’s property, located on the outskirts of Walgett, a town in New South Wales, Australia. (David Gray/Reuters)\nA windmill and solar panels stand next to a dam in a drought-affected paddock on farmer Scott Cooper’s property east of Gunnedah, a town in New South Wales. (David Gray/Reuters)\nAll of Australia’s New South Wales is under drought. According to Reuters, “A quarter of Australia’s agricultural production by value is grown in [New South Wales] and the state government has offered more than A$1 billion in emergency funding to farmers. It announced the latest tranche — A$500 million — on July 30.” There is no indication that the drought will end anytime soon.\nReuters photojournalist David Gray recently turned his lens on this natural disaster, shooting spectacular aerial photos of the terrain. Here’s what he said about the conditions in New South Wales:\n“From ground level, Australia’s drought looks like a featureless, brown dust bowl, but from the air it transforms into an artistry of color and texture as the land cracks under a blazing sun. Circular dry plow tracks resemble the concentric circles in Aboriginal dot paintings that tell of an ancient mythology, starving cattle queuing for feed look like an abstract painting and their black shadows stretching across the land a surrealist image.”\nThe drought is so bad that it is causing wild animals to move closer to the human population. Right now, one of the biggest problems has to do with the kangaroo population. The Post’s Siobhán O’Grady writes the following about the situation:\n“To help farmers deal with the dry weather, the government of New South Wales … has loosened restrictions on shooting kangaroos, as complaints emerged that the wild animals are encroaching on farmers’ pastures and grazing in areas they need to keep their cattle alive. “The number of kangaroos in the state, said Niall Blair, the New South Wales minister of primary industries, has reached ‘plague proportions,’ according to the Australian Broadcasting Corp. ‘Many farmers are taking livestock off their paddocks, only to then see kangaroos move in and take whatever is left,’ he said. ‘If we don’t manage this situation, we will start to see tens of thousands of kangaroos starving and suffering, ultimately leading to a major animal welfare crisis.’ ”\nThis is the worst drought that Australia has experienced in living memory.\nCattle eat hay in a drought-affected paddock on farmer Tom Wollaston’s property, located west of the town of Tamworth in northwestern New South Wales. (David Gray/Reuters)\nPatterns created by a plow can be seen in a drought-affected paddock on a property west of the town of Gunnedah in New South Wales. (David Gray/Reuters)\nA cow walks away from a water tank on Wollaston’s property in New South Wales. (David Gray/Reuters)\nFarmer Ash Whitney stands in the middle of a dried-up dam on his property, located west of the town of Gunnedah in New South Wales. (David Gray/Reuters)\nWhitney stands on the back of his truck as he throws hay for the cattle on his property. (David Gray/Reuters)\nA water tank on Whitney’s property. (David Gray/Reuters)\nFarmer May McKeown feeds cattle on her property, on the outskirts of the town of Walgett in New South Wales. (David Gray/Reuters)\nAn old Sydney tram sits in a drought-effected paddock on Jimmie and May McKeown’s property. (David Gray/Reuters)\nTire tracks from farmer Jimmie McKeown’s truck can be seen on his property. (David Gray/Reuters)\nA dead tree lies in a drought-affected paddock on Wollaston’s property. (David Gray/Reuters)\nCattle tracks can be seen around a water tank and feed lot on farmer Jack Hewitt’s property, north of the town of Gunnedah in northwestern New South Wales. (David Gray/Reuters)\nCattle eat grain and hay dropped onto a drought-affected paddock by Wollaston, next to an irrigated paddock containing a crop. (David Gray/Reuters)\nDead trees are seen on farmer Scott Cooper’s property, east of the town of Gunnedah in New South Wales. (David Gray/Reuters)\nFarmer May McKeown feeds the remaining cattle on her property. (David Gray/Reuters)\nAn irrigated paddock can be seen next to a plowed paddock on a farm on the outskirts of the town of Mudgee in New South Wales. (David Gray/Reuters)\nFarmer Jimmie McKeown walks near a water trough and tanks on his property. (David Gray/Reuters)\nCooper drops hay for his cattle next to a dried-up creek on his property. (David Gray/Reuters)\nSheep eat grain dropped in a drought-affected paddock on a property on the outskirts of Tamworth in New South Wales. (David Gray/Reuters)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nConfronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’\nArtist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’\nInside the effort to save Africa’s elephant population","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/17/stunning-aerial-photos-of-the-worst-drought-in-australias-living-memory/"}
