{"authors":[],"date_download":"2018-10-30 21:12:59","date_modify":"2018-10-30 21:12:59","date_publish":"2015-03-30 00:00:00","description":"Photos: Mount Vernon Baptist Church celebrates new sanctuary","filename":"data/vaneerConsumption/PhotosMountVernonBaptistChurchcelebratesnewsanctuary.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/03/30/Images/photos.medleyphoto.7037425.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_photos-mount-ver_631bd22bdbcac7c1d73b56e5eb68de7a__1540933979.html","title":"Photos: Mount Vernon Baptist Church celebrates new sanctuary","title_page":"Photos: Mount Vernon Baptist Church celebrates new sanctuary","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 25\nccompton@ajc.com Pastor R.K. Turner and First Lady LaNett Turner (far left) lead the Entrance Processional to the ribbon cutting to begin the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n2 / 25\nccompton@ajc.com Women of the church, some dressed in white, look on for the Ribbon Cutting Ceremony during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n3 / 25\nccompton@ajc.com Children wave banners during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n4 / 25\nccompton@ajc.com A police officer looks on as a parade of vehicles full of church members arrives from their temporary facility for their Entrance Service to their new home at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n5 / 25\nccompton@ajc.com Visitor Melanie Gallo gets a joyous hug from her son Preston Jackson, 11, during the Entrance Service into Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n6 / 25\nccompton@ajc.com Church members climb the stairs into their new sanctuary during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n7 / 25\nccompton@ajc.com A church family arrives in a parade of cars for the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n8 / 25\nccompton@ajc.com Visitor Pat Ellis waves at the parade of cars full of church members as she arrivers for the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n9 / 25\nccompton@ajc.com A church member dressed in all white is all smiles as she arrives in the Entrance Processional during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n10 / 25\nccompton@ajc.com Visitor Vavian Carlins bows in prayer in the sanctuary balcony during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n11 / 25\nccompton@ajc.com Reverend R.K. Turner welcomes church members and visitors into their new sanctuary during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n12 / 25\nccompton@ajc.com Reverend R. K. Turner, Pastor, bows his head in prayer during an emotional and joyous day for the Entrance Service in the new sanctuary at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n13 / 25\nccompton@ajc.com Cara Johnson-Malbrough follows along in her Bible during a scripture reading in the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n14 / 25\nccompton@ajc.com Men of the church, who gave up their seats to visitors when the sanctuary filled to standing room only, bow in prayer on the steps to the pulpit and choir loft during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. A church motto Galatians 5:13-14 reads “Converted, Committed & Commissioned by Jesus Christ To Serve This Present Age” is seen on the pulpit over their shoulders. Curtis Compton / ccompton@ajc.com\n15 / 25\nccompton@ajc.com Cara Johnson-Malbrough claps and sings along with the choir during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n16 / 25\nccompton@ajc.com A church member joins in the praise during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n17 / 25\nccompton@ajc.com Church members greet each other after the invocation and scripture readings during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n18 / 25\nccompton@ajc.com 0A church member lays hands on a fellow member as they greet each other after the invocation and scripture readings during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n19 / 25\nccompton@ajc.com Church members hold hands as they greet each other during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n20 / 25\nccompton@ajc.com Church members greet one another during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n21 / 25\nccompton@ajc.com A church member holds his bulletin in his pew during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n22 / 25\nccompton@ajc.com Usher Michael Williams, wearing a black suit and white gloves, watches over the needs of the congregation during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n23 / 25\nccompton@ajc.com Pastor R.K. Turner and First Lady LaNett Turner (left) lead the congregation in the entrance processional for the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. The church moved locations to make way for the Falcons new stadium. Curtis Compton / ccompton@ajc.com\n24 / 25\nccompton@ajc.com First Lady LaNett Turner gives praise during the Entrance Service at Mount Vernon Baptist Church on Palm Sunday, March 29, 2015, in Atlanta. Curtis Compton / ccompton@ajc.com\n25 / 25","url":"https://www.ajc.com/news/local/photos-mount-vernon-baptist-church-celebrates-new-sanctuary/RHzwptAalSMkK9xJRt4ieI/"}
