{"authors":[],"date_download":"2018-10-30 21:38:51","date_modify":"2018-10-30 21:38:51","date_publish":"2015-06-30 00:00:00","description":"Photos: The rise of NeNe Leakes","filename":"data/vaneerConsumption/PhotosTheriseofNeNeLeakes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/30/Images/photos.medleyphoto.7535968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_photos-the-rise-nene-leakes__1540935531.html","title":"Photos: The rise of NeNe Leakes","title_page":"Photos: The rise of NeNe Leakes","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 26\nChelsea Lauren NeNe Leakes attends the NBCUniversal 2015 Golden Globe Awards Party sponsored by Chrysler at The Beverly Hilton Hotel on January 11, 2015 in Beverly Hills, California. Leakes announced Monday, June 29, 2015, she is moving on from \"The Real Housewives of Atlanta.\" The Bravo channel said that Leakes won't return for the reality show's eighth season this fall. (Photo by Chelsea Lauren/Getty Images for Chrysler)\n2 / 26\nFrazer Harrison Leakes walks the runway at Naomi Campbell's Fashion For Relief Charity Fashion Show during Mercedes-Benz Fashion Week Fall 2015 at The Theatre at Lincoln Center on February 14, 2015 in New York City. Leakes announced Monday, June 29, 2015, she is moving on from \"The Real Housewives of Atlanta.\" The Bravo channel said that Leakes won't return for the reality show's eighth season this fall. (Photo by Frazer Harrison/Getty Images For Fashion For Relief)\n3 / 26\nDaniel Zuchnik Leakes arrives at Rihanna's Private Met Gala After Party at Up & Down on May 4, 2015 in New York City. (Photo by Daniel Zuchnik/Getty Images)\n4 / 26\nMike Coppola Leakes takes a curtain call during the final performance of Broadways \"Rodgers + Hammerstein's Cinderella\" at Broadway Theatre on January 3, 2015 in New York City. (Photo by Mike Coppola/Getty Images)\n5 / 26\nBrad Barket In this Feb 6, 2014, file photo, Leakes models an outfit from the 2014 Red Dress Collection in New York. (Photo by Brad Barket/Invision/AP, File)\n6 / 26\nAstrid Stawiarz Leakes attends the 2014 NBCUniversal Cable Entertainment Upfronts at The Jacob K. Javits Convention Center on May 15, 2014 in New York City. (Photo by Astrid Stawiarz/Getty Images)\n7 / 26\nAndrew H. Walker Leakes attends the \"Rodgers + Hammerstein's Cinderella\" Broadway curtain call with NeNe Leakes and KeKe Palmer at Broadway Theatre on November 25, 2014 in New York City. (Photo by Andrew H. Walker/Getty Images)\n8 / 26\nIsaac Brekken Leakes performs in 'ZUMANITY, The Sensual Side of Cirque du Soleil' at the New York-New York Hotel & Casino on June 27, 2014 in Las Vegas, Nevada. (Photo by Isaac Brekken/Getty Images for Cirque du Soleil)\n9 / 26\nBryan Bedder Leakes and Gregg Leakes attend the Shop Your Way #RealPersonal event at Ink48 on February 5, 2014 in New York City. (Photo by Bryan Bedder/Getty Images for Shop Your Way)\n10 / 26\nMichael Buckner Actress Uzo Aduba, Leakes and actress Keke Palmer attend ELLE's Annual Women in Television Celebration on January 22, 2014 in West Hollywood, California. (Photo by Michael Buckner/Getty Images for Elle)\n11 / 26\nIsaac Brekken Leakes (R) and her husband Gregg Leakes attend a perforamnce of 'ZUMANITY, The Sensual Side of Cirque du Soleil' at the New York-New York Hotel & Casino on June 27, 2014 in Las Vegas, Nevada. (Photo by Isaac Brekken/Getty Images for Cirque du Soleil)\n12 / 26\nTodd Wawrychuk Leakes competed on the reality dancing competition \"Dancing With the Stars\" with, amongst others, Billy Dee Williams, Dancia McKellar and Drew Carey. (ABC/Todd Wawrychuk)\n13 / 26\nTommaso Boddi Leakes attends the ELLE Women in Television Celebration presented by Hearts on Fire Diamonds and Wella Professionals held at Soho House on January 24, 2013 in West Hollywood, California. (Photo by Tommaso Boddi/Getty Images)\n14 / 26\nJason Kempin Leakes and actor Jayson Blair attend the Paley Center For Media's PaleyFest 2013 Honoring \"The New Normal\" at Saban Theatre on March 6, 2013 in Beverly Hills, California. (Photo by Jason Kempin/Getty Images)\n15 / 26\nCraig Barritt Leakes attends the 2013 Bravo New York Upfront at Pillars 37 Studios on April 3, 2013 in New York City. (Photo by Craig Barritt/Getty Images)\n16 / 26\nMike Coppola Leakes and Bethenny Frankel on the set of 'Bethenny' with special guests NeNe Leakes, Miss America, Heather Dubrowm, Bevy Smith and Nicole Byer at CBS Broadcast, Center on September 17, 2013 in New York City. Air Date: Thursday, September 19th (Photo by Mike Coppola/Getty Images for \"bethenny\")\n17 / 26\nLeakes poses with her husband, Gregg Leakes, during an episiode of the 2013 Bravo series, \"I Dream of NeNe.\" Cameras followed NeNe and Gregg as they planned their second wedding and got remarried.\n18 / 26\nDonald Bowers (L-R) Fantasia and Leakes attend Design Duo Isabel and Ruben Toledo and Friends 'Caravan' To Broadway's Hit Duke Ellington Musical, \"After Midnight\" on November 6, 2013 in New York City. (Photo by Donald Bowers/Getty Images for After Midnight)\n19 / 26\nJonathan Phillips Leakes walks the red carpet for Tyler Perry's movie \"Temptation\" at the AMC Parkway Pointe 15 theaters in Atlanta on Saturday, March 16, 2013. Jonathan Phillips Special\n20 / 26\nJesse Grant Leakes attends the NBCUniversal Golden Globes viewing and after party held at The Beverly Hilton Hotel on January 13, 2013 in Beverly Hills, California. (Photo by Jesse Grant/Getty Images for NBCUniversal)\n21 / 26\nEthan Miller Leakes arrives at the 2013 Miss USA pageant at Planet Hollywood Resort & Casino on June 16, 2013 in Las Vegas, Nevada. (Photo by Ethan Miller/Getty Images)\n22 / 26\nTheo Wargo Leakes visits \"Late Night With Jimmy Fallon\" at Rockefeller Center on January 3, 2013 in New York City. (Photo by Theo Wargo/Getty Images)\n23 / 26\nLeakes had a recurring role as Coach Roz Washington from 2012-2015 on the Fox show \"Glee\".\n24 / 26\nDavid Livingston (L-R) Actors Justin Bartha, Andrew Rannells, Bebe Wood (foreground), Georgia King and Leakes attend The Paley Center for Media's 2012 PaleyFest: Fall TV Preview Party for NBC at The Paley Center for Media on September 5, 2012 in Beverly Hills, California. (Photo by David Livingston/Getty Images)\n25 / 26\nCindy Ord \"Real Housewives of Atlanta\" stars Kandi Burruss, Phaedra Parks, Leakes, and Cynthia Bailey of the Real Housewives of Atlanta attends the Bravo Upfront 2012 at Center 548 on April 4, 2012 in New York City. (Photo by Cindy Ord/Getty Images)","url":"https://www.ajc.com/entertainment/photos-the-rise-nene-leakes/P3HgtlxL5LJ3fVyZfz4A0L/"}
