{"authors":["Rodney Thrash"],"date_download":"2018-10-30 20:14:10","date_modify":"2018-10-30 20:14:10","date_publish":"2015-03-13 13:19:54","description":"Family, friends and police officers from around the country Friday said farewell to a...","filename":"data/vaneerConsumption/PHOTOSRememberingFultonpoliceDetTerenceGreen.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_news_photos-remembering-fulton-police-det-terence-green__1540930450.html","title":"PHOTOS: Remembering Fulton police Det. Terence Green","title_page":"PHOTOS: Remembering Fulton police Det. Terence Green","title_rss":"NULL","source_domain":"ajc.com","text":"Family, friends and police officers from around the country Friday said farewell to a Fulton County police detective shot and killed last week.\nTerence Avery Green, 48, was on duty March 4 when he was killed in what a Fulton police assistant chief called an ambush-style attack.\nAmanuel Menghesha, the 42-year-old Fairburn man accused of shooting and killing Green, was booked March 5 into the Fulton County jail on murder and aggravated assault charges.\nOfficers from various agencies gathered at Turner Field at 10 a.m. for a processional to World Changers Church International on Burdett Road in College Park, the site of Green's 1 p.m. funeral. Officers in the processional started arriving at the church just before noon.\n»View scenes from the day through the eyes of Atlanta Journal-Constitution photographers.\nPrevious coverage:\n»Video: Remembering a fallen officer | Terence Avery Green\n»Leave condolences for the family of Fulton police Det. Terence Avery Green\n»Photos: Remembering a fallen officer\n»Funeral Friday for Fulton officer killed in the line of duty\n»Memorial fund set up for sons of slain Fulton officer\n»Slain Fulton officer’s mother: It was way too soon for my baby\n»Fulton officer “died doing what he loved: protect and serve”\n»Terence Avery Green: 1966-2015","url":"https://www.ajc.com/blog/news/photos-remembering-fulton-police-det-terence-green/JSzWqIx0hDRkcfRnxOk9iJ/"}
