{"authors":[],"date_download":"2018-10-30 18:31:13","date_modify":"2018-10-30 18:31:13","date_publish":"2016-12-31 00:00:00","description":"3...2...1... Happy New Year! Different cities across the world are ringing in the new year and welcoming 2017.","filename":"data/vaneerConsumption/PhotosWorldringsin2017.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/CmgSharedContent/2016/12/31/Images/photos.medleyphoto.12695091.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_photos-world-rings-2017__1540924273.html","title":"Photos: World rings in 2017","title_page":"Photos: World rings in 2017","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 12\nVincent Yu Fireworks explode over Victoria Harbour to celebrate the New Year's Eve in Hong Kong, early Sunday, Jan. 1, 2017. (AP Photo/Vincent Yu)\n2 / 12\nRick Rycroft Fireworks explode over the Sydney Opera House and Harbour Bridge as New Year's celebrations are underway in Sydney, Australia, Sunday, Jan. 1, 2017. (AP Photo/Rick Rycroft)\n3 / 12\nPeter Meecham Fireworks explode from Auckland's Sky Tower as the new year is welcomed to New Zealand, Jan 1, 2017. (Peter Meecham/New Zealand Herald via AP)\n4 / 12\nAhn Young joon Protesters set off fireworks during a candle light vigil calling for impeached President Park Geun-hye to step down, near the presidential house in Seoul, South Korea, Saturday, Dec. 31, 2016. Even on New Year's Eve, large crowds of South Koreans gathered to join another rally demanding the ouster of Park, who's determined to restore her powers through a court trial. (AP Photo/Ahn Young-joon)\n5 / 12\nKoji Sasahara Bubbles float over visitors during a New Year's Eve celebration event a Tokyo Hotel, late Saturday, Dec. 31, 2016. (AP Photo/Koji Sasahara)\n6 / 12\nTatan Syuflana Fire crackers explode above the Hotel Indonesia Roundabout during New Year's eve in the main business district in Jakarta, Indonesia, Saturday, Dec. 31, 2016. (AP Photo/Tatan Syuflana)\n7 / 12\nAttila Balazs A young woman writes '2017' using a sparkler during the New Year's Eve celebrations in Nyiregyhaza, 245 kms east of Budapest, Hungary, Saturday, Dec. 31, 2016. (Attila Balazs/MTI via AP)\n8 / 12\nLim Huey Teng Fireworks explode in front of Malaysia's landmark building, Petronas Twin Towers, during the New Year's Eve celebration in Kuala Lumpur, Malaysia, early Sunday, Jan. 1, 2017. (AP Photo/Lim Huey Teng)\n9 / 12\nFireworks light up the sky to welcome the New Year at the Mall of Asia, the country's largest shopping mall Sunday, Jan. 1, 2017 in suburban Pasay city south of Manila, Philippines. The country's notorious tradition of dangerous New Year's Eve celebrations persisted after President Rodrigo Duterte delayed to next year his ban on the use of powerful firecrackers, often worsened by celebratory gunfire. (AP Photo/Bullit Marquez)\n10 / 12\nJon Gambrell Fireworks explode at the Burj Khalifa, the world's tallest building, and surrounding skyscrapers to mark New Year in Dubai, United Arab Emirates, on Sunday, Jan. 1, 2017. (AP Photo/Jon Gambrell)\n11 / 12\nJack Taylor LONDON, ENGLAND - JANUARY 01: Fireworks light up the London skyline and the London Eye just after midnight on January 01, 2017 in London, England. Thousands of people line the streets of central London tonight to watch the annual New Year's Eve fireworks display. (Photo by Jack Taylor/Getty Images)\n12 / 12","url":"https://www.ajc.com/news/national/photos-world-rings-2017/6YR1tswg9mZBPBhwLX2XyN/"}
