{"authors":["Jay Akbar For Mailonline"],"date_download":"2018-10-23 04:08:36","date_modify":"2018-10-23 04:08:36","date_publish":"2016-01-11 17:12:23","description":"These are the final photos of American pilot Major Taj Sareen (pictured), 34, who died in a 'fireball' when his jet went down as he flying back home after a six month long tour battling ISIS","filename":"data/vaneerConsumption/PhotosofMajorTajSareenwhocrashedoverUKafterejectingtoolaterevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/3007E1FD00000578-0-image-a-16_1452532288965.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394134_A-hero-s-wave-goodbye-Final-photos-brave-pilot-crashed-UK-ejecting-late-jet-did-not-crash-nearby-homes_1540267716.html","title":"Photos of Major Taj Sareen who crashed over UK after 'ejecting too late' revealed","title_page":"Photos of Major Taj Sareen who crashed over UK after 'ejecting too late' revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Waving to the camera before take off, these are the final photos of a heroic American pilot who died the day after they were taken.\nMajor Taj Sareen, 34, a father of one, died in a 'fireball' when his F/A-18 Hornet went down over UK farmland in October as he flying back to the U.S. after a six month long tour battling ISIS in the Middle East.\nHe is thought to have ejected later than he should have to avoid the jet crashing into nearby homes.\nScroll down for video\nThese are the final photos of heroic American pilot Major Taj Sareen (pictured) who died the day after they were taken\nMajor Sareen (pictured) is thought to have ejected later than he should have to avoid the jet crashing into nearby homes\nAn amateur photographer took the pictures of Major Sareen on the runway at RAF Lakenheath in Suffolk the day before he died.\nMatthew Varley, 23, said it was 'heart wrenching' to know they could be the pilot's final moments caught on camera.\nHe added: 'There were four aircraft on the day and he was the only pilot to take off his flight mask and actually wave which was quite poignant.\n'When I later found out that it was possibly the last photo of him alive it became heart wrenching. He was smiling and looking happy and I think it's become a nice tribute to him.'\nMajor Sareen's family said they were 'thankful' after the last known photo of him emerged on an aviation enthusiast's website.\nMajor Sareen, from California, was flying one of six jets back to the U.S. from the Persian Gulf when it crashed in Redmere, Cambridgeshire.\nHe was branded a hero by farmer Peter Sizer who saw the crash. He told of how the pilot narrowly avoided two houses and crashed into farmland to avoid hurting anyone else.\nAn amateur photographer took these pictures of Major Sareen the day before his jet went down over UK farmland\nHis friend Preston Phillips, an ABC news anchor, said he was not surprised by the claims that he risked his life to risk harming others.\nHe said: 'I knew that was Taj. That's Taj in a heartbeat. I mean, he would do that to save people.'\nEarlier, witnesses had told of the 300 to 400ft high fireball and 'unbelievable' bang that had occurred in the wake of the crash at around 10.30am.\nOthers spoke of seeing numerous emergency service personnel gathered around a parachute roughly 'a mile-and-a-half' from where the jet came down near the Cambridgeshire border.\nMaj Sareen's friend Captain Annie Driscoll created a fund for his 16-month-old daughter Jade after his death and it has already raised nearly £50,000.\nIt has been reported that Maj Sareen's jet had refueling issues shortly before it crashed but officials could not confirm this.","url":"https://www.dailymail.co.uk/news/article-3394134/A-hero-s-wave-goodbye-Final-photos-brave-pilot-crashed-UK-ejecting-late-jet-did-not-crash-nearby-homes.html"}
