{"authors":["Frances Martel"],"date_download":"2018-10-30 19:28:56","date_modify":"2018-10-30 19:28:56","date_publish":"2016-04-06 03:00:29","description":"An estimated 250,000 Colombians took to the streets of 22 cities on Sat. to demand President Juan Manuel Santos cease negotiations with FARC.","filename":"data/vaneerConsumption/PhotosHundredsofThousandsofColombiansSayNotoPeaceTalkswithTerrorists.json","image_url":"https://media.breitbart.com/media/2016/04/GettyImages-518769056.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_05__1540927736.html","title":"Photos: Hundreds of Thousands of Colombians Say 'No' to Peace Talks with Terrorists","title_page":"Photos: Hundreds of Thousands of Colombians Say 'No' to Peace Talks with Terrorists | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An estimated 250,000 Colombians took to the streets of 22 cities on Saturday to demand President Juan Manuel Santos cease negotiations with the dreaded FARC terrorist group, as well as cancel plans for similar negotiations with the National Liberation Army (ELN) guerrilla.\nThe protesters also brought signs with them calling for lower taxes, the end of government corruption, and the liberation of a number of prisoners they believe were arrested on false charges due to their opposition to the Santos government.\nThe protests, titled “No+” (“No More”), swept the nation’s major metropolises, attracting the most people in Medellín, the mountainside capital of Antioquia state famous for its economic recovery following decades of plundering by cocaine traffickers and the Revolutionary Armed Forces of Colombia (FARC). Colombia’s El Tiempo reports that 45,000 people congregated in Medellín, with the nation’s capital, Bogotá, attracting 9,200 people. The organizers of the event, members of the Democratic Center Party, estimated between 250,000-300,000 attendees nationwide.\nProtesters held signs calling Santos a “traitor” and calling for his resignation, as well as calling for an end to guerrilla warfare and high taxes. Some also called for the release of prisoners associated with the Democratic Center party. Among those is Santiago Uribe, the brother of former president and current Senator Álvaro Uribe, the head of the Democratic Center party and protest organizer.\n#Abril2ALaCalle Más de 30 mil caleños bajo un torrensal aguacero, cumplimos la cita Democrática de la Marcha del NO+ pic.twitter.com/3keNcN4FND — MARIO PELAEZ SOTO (@MarioPelaezSoto) April 4, 2016 “More than 30,000 in Cali under a torrential rain, we kept our democratic appointment.”\nMedellín #Abril2ALaCalle imponente la voz ciudadana pic.twitter.com/DrusLgru1U — Nohora Tovar Rey (@nohoratovar) April 2, 2016 “Medellín #April2ToTheStreet the citizen voice in imposing.”\nPese a la lluvia, masiva participación ciudadana en Ibagué.#Abril2ALaCalle pic.twitter.com/n7xLlWLG4u — Pierre Garcia (@PierreGarciaJ) April 2, 2016\nLos boyacenses salimos a decir:\nNo más abandono a las regiones\nNo más papa importada #Abril2ALaCalle pic.twitter.com/doVRx3YOYn — Ciro A. Ramirez (@CIROARAMIREZ) April 2, 2016\n“We ask that he resign, but if he is not capable of that, let him rectify [his errors],” Everth Bustamante, a legislator, told El Tiempo. “He still has two years to save this government.”\nOn Sunday April 3, a second rally occurred in Montería, where inclement weather prohibited Álvaro Uribe from flying in from his native Medellín, and the sole incident of disorder occurred during the Saturday rallies, ending the protest early. All other protests were peaceful. He repeated the message in Montería that he had issued in Medellín the day before: “Let this march help us be aware of the damage that coexistence, impunity for narcoterrorism causes. They give one group impunity and another appears, and Colombia will never be free of violence.”\nColombia has engaged in talks with the FARC for the past three years. Given the concessions that appear to be on the table for FARC terrorists thanks to the talks, including most walking away without having to serve time in prison, the leaders of the ELN terrorist group are now telling government officials they would like to engage in a similar dialogue. The April 2 protests are largely a response to the government’s announcement that they have accepted peace talks with the ELN.\nFollowing the ELN peace talks announcement, another narco-terrorist group, the Clan Úsuga, is rumored to be seeking talks with the government, as well. The group recently called for a “24-hour strike” in the neighborhoods it controls, forcing civilians to stay home from work or be killed. Santos responded by demanding Clan Úsuga members “submit to justice.”\nWhether Colombians have confidence that Santos will be able to handle the Clan Úsuga is an open question. His national approval ratings have plummeted in light of the FARC talks, following the failure to meet a self-imposed March 23 deadline to submit a peace proposal to a national vote. Santos currently boasts a 13 percent approval rating. A poll released Tuesday finds that 60 percent do not believe a peace deal with the FARC is possible, and 74 percent do not believe the FARC are making a good faith attempt to achieve a peace deal. 75 percent disapprove of the way Santos is handling the peace talks, specifically.","url":"https://www.breitbart.com/national-security/2016/04/05/photos-thousands-colombians-protest-peace-talks-terrorists/"}
