{"authors":[],"date_download":"2018-10-30 18:18:39","date_modify":"2018-10-30 18:18:39","date_publish":"2014-07-02 00:00:00","description":"Photos: Olivia de Havilland through the years","filename":"data/vaneerConsumption/PhotosOliviadeHavillandthroughtheyears.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/07/02/Images/photos.medleyphoto.5549868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_photos-olivia-havilland-through-the-years__1540923519.html","title":"Photos: Olivia de Havilland through the years","title_page":"Photos: Olivia de Havilland through the years","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 25\nFrancois Durand Olivia de Havilland arrives at the 36th French Cesar film awards ceremony at Theatre du Chatelet on February 25, 2011 in Paris, France.\n2 / 25\nFrancois Durand Olivia de Havilland and Frederic Mitterrand arrive at the 36th French Cesar film awards ceremony at Theatre du Chatelet on February 25, 2011 in Paris, France.\n3 / 25\nJacques Brinon U.S. actress Olivia de Havilland smiles as she attends during the 36th Cesar Awards ceremony in Paris, Friday, Feb. 25, 2011.\n4 / 25\nMark Wilson U.S. President George W. Bush congratulates actress Olivia de Havilland after presenting her with the 2008 National Medals of Arts award during an event in the East Room at the White House November 17, 2008 in Washington, DC. During the event president Bush presented recipients with awards for the National Medals of Arts and the National Humanities Medal.\n5 / 25\nMark Wilson U.S. President George W. Bush congratulates actress Olivia de Havilland before presenting her with the 2008 National Medals of Arts award during an event in the East Room at the White House November 17, 2008 in Washington, DC. During the event president Bush presented recipients with awards for the National Medals of Arts and the National Humanities Medal.\n6 / 25\nDavid Livingston Screen legend Olivia de Havilland and producer Samuel Goldwyn, Jr. attend the Academy of Motion Picture Arts and Sciences' tribute to Ms. de Havilland at the Academy of Motion Picture Arts and Sciences on June 15, 2006 in Beverly Hills, California.\n7 / 25\nDavid Livingston Screen legend Olivia de Havilland attends the Academy of Motion Picture Arts and Sciences' tribute to Ms. de Havilland at the Academy of Motion Picture Arts and Sciences on June 15, 2006 in Beverly Hills, California.\n8 / 25\nPascal Le Segretain Olivia de Havilland arrives to attend the International evening of the child on November 28, 2005 in Versailles, France.\n9 / 25\nKEVORK DJANSEZIAN Actress Olivia de Havilland, who played the doomed Southern belle Melanie in \"Gone With the Wind,\" poses for a photograph Wednesday, Sept. 15, 2004, in Los Angeles.\n10 / 25\nKEVORK DJANSEZIAN Actress Olivia de Havilland, who played the doomed Southern belle Melanie in \"Gone With the Wind,\" poses for a photograph Wednesday, Sept. 15, 2004, in Los Angeles.\n11 / 25\nGetty Images Former Best Actress Oscar winner Olivia de Havilland (To Each His Own, 1946) introduces other former winners in acting categories for a group presentation during the 75th Annual Academy Awards at the Kodak Theater on March 23, 2003 in Hollywood, California.\n12 / 25\nAlex Wong Actress Olivia De Havilland smiles May 9, 2001 in Washington, D.C. during a luncheon to introduce a new permanent interactive exhibition about American achievers at the National Museum of American History\n13 / 25\nJON NASO\n14 / 25\nJIM COOPER Actress Olivia de Havilland poses in New York on June 17, 1998.\n15 / 25\nMichel Lipchitz Olivia de Havilland, the Oscar-winning actress who played the charitable and loving Melanie in 'Gone With The Wind', sits in the garden ofher Paris home, April 15, 1997. Although de Havilland has not acted since 1988, when she appeared in a television movie 'The Woman He Loved,' she insists she is not retired.\n16 / 25\nOlivia de Havilland as the Dowager Empress in \"Anastasia.\"\n17 / 25\nGlenn Waggner Henry Fonda and Olivia de Havilland are seen in a scene from \"Roots: The Next Generation\".\n18 / 25\nOlivia de Havilland and Joseph Cotten in a scene from \"Airport '77.\"\n19 / 25\nLiv Ullmann (left) and Olivia de Havilland in \"Pope Joan\".\n20 / 25\nOlivia de Havilland, lone survivor of the top stars of the movie, \"Gone With the Wind,\" speaks to a crowd attending Wednesday night's new premiere of the fabulous movie. She called it a \"joyful reunion.\" The movie was first premiered in Atlanta Dec. 15, 1939.\n21 / 25\nJoe McTyre Mayor Ivan Allen Jr. and actress Olivia De Havilland wave to the crowd during a parade celebrating the re-release of the movie 'Gone With the Wind.'\n22 / 25\nJoe McTyre Mayor Ivan Allen Jr. and actress Olivia De Havilland wave to the crowd during a parade celebrating the re-release of the movie 'Gone With the Wind.'\n23 / 25\nBob Dendy Actress Olivia de Havilland. Photo taken March 17, 1961.\n24 / 25\nBob Dendy Motion picture producer David O. Selznick and actress Olivia de Havilland. Photo taken March 17, 1961.\n25 / 25","url":"https://www.ajc.com/entertainment/photos-olivia-havilland-through-the-years/AE8GYViuVn5kT0P8MoFtZJ/"}
