{"authors":[],"date_download":"2018-10-30 19:34:31","date_modify":"2018-10-30 19:34:31","date_publish":"2017-03-05 00:00:00","description":"Photos from the first game in franchise history for the Atlanta United FC on Sunday March 5, 2017 at Georgia Tech","filename":"data/vaneerConsumption/PhotosHistoricdayforAtlantaUnited.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/05/Images/united31.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_soccer_photos-historic-day-for-atlanta-united__1540928071.html","title":"Photos: Historic day for Atlanta United","title_page":"Photos: Historic day for Atlanta United","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United's Carlos Carmona can't block a shot by Bradley Wright-Phillips during the second half of Sunday's game.\n2 / 20\nCurtis Compton/ccompton@ajc.com Members of Atlanta United gather for a team photo before taking on the New York Red Bulls Sunday in the first game in franchise history at Bobby Dodd Stadium.\n3 / 20\nCurtis Compton/ccompton@ajc.com Fans unfurl the Atlanta United tifo to open the action against the N.Y. Red Bulls Sunday.\n4 / 20\nCurtis Compton/ccompton@ajc.com Andrea Bustamante cheers on Atlanta United Sunday in its first game in franchise history against New York Red Bulls at Georgia Tech's Bobby Dodd Stadium.\n5 / 20\nCurtis Compton/ccompton@ajc.com Yamil Asad reacts to scoring the first goal in franchise history, which occurred in the first half of Sunday's game against the New York Red Bulls.\n6 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United players pile on top of Yamil Asad after he scored the team's first goal Sunday.\n7 / 20\nCurtis Compton/ccompton@ajc.com March 5, 2017, Atlanta: Atlanta United goalkeeper Alec Kann blocks a shot by Red Bulls' Derrick Etienne Jr.\n8 / 20\nCurtis Compton/ccompton@ajc.com March 5, 2017, Atlanta: Atlanta United head coach Gerardo Martino reacts to a play during Sunday's game.\n9 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United head coach Gerardo Martino walks off the field after falling Sunday's loss.\n10 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United goalkeeper Alec Kann goes up high for the defensive stop against the Red Bulls.\n11 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United's Greg Garza makes a move past N.Y. Red Bulls defender Alex Muyl during the first half of Sunday's game.\n12 / 20\nCurtis Compton/ccompton@ajc.com Yamil Asad is double teamed by N.Y. Red Bulls' Daniel Royer (left) and Sal Zizzo during the second half.\n13 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United's Michael Parkhurst reverses the field against N.Y. Red Bulls Bradley Wright-Phillips with a backwards kick during the second half.\n14 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United fan Mya Todd of Atlanta gets her face painted for the first game in franchise history against the New York Red Bulls Sunday at Georgia Tech.\n15 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United FC fans John and Yvonne Frantz have their game faces on for the first game in franchise history against the New York Red Bulls at Georgia Tech.\n16 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United fan Barbara Morningstar dances with MC Leighton outside Bobby Dodd Stadium Sunday.\n17 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United fan J.G. George of Woodstock arrives for Sunday's game.\n18 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United fan Cindy Stigall of Acworth gets in the mood for the first game in franchise history.\n19 / 20\nCurtis Compton/ccompton@ajc.com Atlanta United fan Jorge Alonso roots for his team during the first game in franchise history.\n20 / 20","url":"https://www.ajc.com/sports/soccer/photos-historic-day-for-atlanta-united/eolL5IttasEG95An7Qd7HK/"}
