{"authors":[],"date_download":"2018-10-30 20:47:46","date_modify":"2018-10-30 20:47:46","date_publish":"2014-05-07 00:00:00","description":"Mugshots and sketches of suspects wanted by metro Atlanta police agencies.","filename":"data/vaneerConsumption/PhotosAtlantasMostWanted.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/07/Images/photos.medleyphoto.5218192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_photos-atlanta-most-wanted__1540932466.html","title":"Photos: Atlanta's Most Wanted","title_page":"Photos: Atlanta's Most Wanted","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 25\nCrime Stoppers Atlanta Demetruis Fortson, 19, is wanted for murder by Atlanta police. Nicholas Hagood, 34, of Marietta, was shot and killed at a southwest Atlanta apartment complex on March 26, 2014. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online ww.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637).\n2 / 25\nCrime Stoppers Atlanta Jeremy Southern, 24, is wanted for murder by Atlanta police. Nicholas Hagood, 34, of Marietta, was shot and killed at a southwest Atlanta apartment complex on March 26, 2014. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online ww.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637).\n3 / 25\nCrime Stoppers Atlanta Atlanta police are seeking information leading to the arrest of the suspect who killed motorist Demetrius Wright (pictured). On March 16, 2014, Wright was traveling down Cheshire Bridge in a black Dodge Charger when a dark gray Pontiac Grand Prix pulled up and someone inside that vehicle shot him. Wright died April 8. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637).\n4 / 25\nCrime Stoppers Atlanta Quentin Gray is wanted for allegedly taking a 15-year-old girl from a bus stop to an apartment in Jonesboro and raping her in 2010. Gray is charged with enticing a child for indecent purposes, statutory rape, child molestation. Gray has ties in the Fayetteville, Atlanta, and Jonesboro areas and is believed to be armed and dangerous.\n5 / 25\nCrime Stoppers Atlanta Taurezs Bullock, 27, is wanted for 1st degree murder out of Tampa, Fla., but is known to frequent Atlanta and Decatur, police say. Bullock is 6’1 and weighs 195 pounds. He has a tattoo on his right cheek and all over his neck. Police say Bullock got into a fight at a Tampa night club, then went to his car and retrieved a gun. Bullock returned to the club and shot and killed David Avant, police say.\n6 / 25\nCrime Stoppers Atlanta Timothy Maddox is wanted for possession of firearm by a convicted felon, possession of firearm during the commission of a felony, criminal attempt to commit a crime, failure to appear and obstruction of law enforcement. Maddox, 30, is 5'9\" and weighs 175 pounds. He also has a probation warrant. Maddox is know to have lived in the Taco Town area (northeast Grant Park) and Cabbagetown areas of Atlanta.\n7 / 25\nCrimestopppers Atlanta DeKalb police seek Dixon Kedar, 16, in the killing of 18-year-old Quantaveus Armstrong. Police say Dixon shot Armstrong March 20 in a gas station parking lot in DeKalb County after the two argued. The parking lot was located in the 4400 block of Glenwood Road. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637).\n8 / 25\nAtlanta police have released a sketch related to the investigation of a man who ordered a 12-year-old girl to get into his vehicle on March 4. The girl was waiting at a bus stop around 8 a.m. near the intersection of Jonesboro and Constitution roads in southeast Atlanta when the suspect pulled up and demanded she get in his white truck, police said. The suspect is described as a thin, white man, approximately 60 years old, 5-foot-10 to 6 feet tall, with blue eyes, brown and gray hair, and a gray goatee or beard. Anyone with information is asked to contact Crime Stoppers at 404-577-8477.\n9 / 25\nCrimestopppers Atlanta Atlanta police are seeking Mario Miller in a home invasion that occurred in the Thomasville Heights area. Miller is considered armed and dangerous. He is known to frequent the Thomasville Heights area. Any information contact the Atlanta Police Department or call 911. You can also submit an anonymous tip to Crime Stoppers at 404.577.TIPS. There is a $2,000 reward.Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637).\n10 / 25\nCrimestopppers Atlanta Gonzalez Gonzalo Harrell is sought by the FBI on charges of vehicular homicide. Harrell, who may be using a similar name as an alias, is originally from Mexico and may have fled there. On June 16, 2000, in Gilmer County, Georgia, Harrell's vehicle struck another vehicle at a red light, killing 16-year-old Dustin Inman. Harrell was hospitalized but escaped during treatment for his injuries. At the time, he was described as being 46, about 5 foot 8 inches, and weighing 150 pounds. Crime Stoppers Atlanta is offering a reward of up to $2000 for information in this matter. Anyone with information in this matter should contact Crime Stoppers Atlanta at tel. (404) 577-TIPS (8477).\n11 / 25\nTwo suspects are sought in the murder of Georgia Tech graduate Patrick Cotrona, who was shot and killed in May 2013 as he walked home from an East Atlanta pub. One suspect in the video game programmer's killing is described as an African-American male, 16- to 18-years of age, 5'8 to 5'10 in height, thin build, medium brown complexion with little to no facial hair. He was wearing a dark hat with a red Polo emblem, a red and blue vertical striped/checkered short sleeve, button up shirt with a collar; khaki shorts and; white, high-top shoes. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637).\n12 / 25\nKinneth Battle is wanted for the robbery of a BP gas station in the 5000 block of Windward Parkway. Police say Battle was the getaway driver for Fredrequis Cobbs during the March 15, 2014, robbery attempt. Cobbs was arrested at Battle's home in Cumming, but Battle fled, armed with an AK-47 or similar weapon. Battle is known to frequent Alpharetta and southwest Atlanta. He is considered armed and dangerous.\n13 / 25\nAuthorities released a sketch of the man wanted for a reported rape at Emory. The suspect is about 5 foot 10 inches and in his mid-50s, said police. The incident was reported to have occurred Feb. 11 around 11:15 p.m. on the university’s campus in a wooded area near Dowman Drive, police said. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637). (Sketch by Kelly Lawson / GBI)\n14 / 25\nThis suspect is accused of sexually assaulting a 52-year-old woman, Atlanta police said. According to the Atlanta police report, the woman was walking on Elizabeth Place around 1 a.m. Dec. 7 when she was assaulted by two men with weapons. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637). (Sketch by Kelly Lawson / GBI)\n15 / 25\nCrime Stoppers Atlanta Atlanta police are looking for a man who posed as a taxi driver and attempted sodomy on a passenger he picked up. A reward of up to $2,000 is being offered for information leading to the arrest and indictment of the suspect. Police say on Dec. 14, 2013, in the 3100 block of Roswell Road, the white or Hispanic male in his early 30s was driving a black sedan and impersonated being a taxi driver and picked a 23-year-old woman up outside a nightclub. He attempted to assault her but the woman was able to flee. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637). Persons do not have to give their name or any identifying information to be eligible for the reward of up to $2,000.\n16 / 25\nCrime Stoppers Atlanta Atlanta police are seeking the public's assistance in identifying the man in this sketch, who is wanted on attempted sodomy charges. A reward of up to $2,000 is being offered for information leading to the arrest and indictment of the person or persons responsible. On Dec. 20, 2013, in the 2800 block of Peachtree Road, a white male suspect in his 20s driving a black Dodge Ram picked up a 20-year-old female by offering a ride to her hotel. The suspect drove the victim to an area away from the hotel and assaulted her. The victim was able to flee from the scene and notify police. The forensic sketch was completed by the GBI. Any information on the case can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477), online www.crimestoppersatlanta.org or by texting CSA and the tip to CRIMES (274637). Persons do not have to give their name or any identifying information to be eligible for the reward of up to $2,000.\n17 / 25\nCrime Stoppers Atlanta Salvador Orega Sanchez is wanted for the murder of Jose Castulo and the aggravated assault of Rene Castanon-Ordac on August 15, 2009, in the 6600 block of Wren Court in Roswell. The suspect was injured during the attack and went to the hospital in Douglasville using the name Jose Luis Martinez . Any information please contact Detective Roger Marbut at 770-640-4439 or Atlanta Crime Stoppers at 404-577-TIPS (8477). Information can remain anonymous.\n18 / 25\nCrime Stoppers Atlanta Aaron Austin Shobe is wanted for armed robbery during Craigslist sales. Shobe works out of Zone 4, police say, which is west Atlanta in the Cascade region. If you have any information on this suspect, submit a tip at www.crimestoppers.org or 404-577-TIPS.\n19 / 25\nCrime Stoppers Atlanta The man pictured here is wanted for the robbery of two Family Dollar stores in Atlanta. He is considered armed and dangerous. The suspect robbed the Family Dollar at 3050 Martin Luther King Jr. Drive on Dec. 21 and the 2779 Lakewood Avenue store on Dec. 23. If you have any information on this suspect, submit a tip at www.crimestoppers.org or 404-577-TIPS.\n20 / 25\nCrime Stoppers Atlanta Lindsey Brooks is wanted for aggravated battery in a stabbing on Peachtree Street in downtown Atlanta. He is known to frequent the Peachtree Pine shelter (477 Peachtree Street) where the stabbing occurred. He has had several fights with law enforcement officers. If you have any information on this suspect, submit a tip at www.crimestoppers.org or 404-577-TIPS.\n21 / 25\nCrime Stoppers Atlanta U.S. Marshals are seeking assistance from the public in locating Marcus Lowe for supervised release violation and possession of a firearm by a convicted felon. He is believed to be hiding in southwest Atlanta. Lowe also uses the names Sean Lowe and Broderickus Watkins. He is considered armed and dangerous.\n22 / 25\nCrime Stoppers Atlanta U.S. Marshals are seeking assistance from the public in locating Shawn Penson, 31, on armed robbery charges. Penson is 6 feet tall and weight 280. Marshals believe he may be hiding out in southwest Atlanta. Cash rewards are available. Penson is considered armed and dangerous.\n23 / 25\nCrime Stoppers Atlanta A $2,000 reward is offered for a sexual assault suspect Atlanta police believe is responsible for attacks on women in the West End area. The suspect is described as being about 6 feet, 1 inches with a stocky build and a small scar on his left cheek. If you have any information on this suspect, submit a tip at www.crimestoppers.org or 404-577-TIPS.\n24 / 25\nCrime Stoppers Atlanta Atlanta police believe the two suspects pictured here stole a wallet Dec. 27 from a business at 998 N. Highland Ave. and within 15 minutes were able to create a new ID and successfully charge $1,000 to a stolen credit card. The suspects may also work the Phipps area. If you have any information on these suspects, submit a tip at www.crimestoppers.org or 404-577-TIPS.\n25 / 25","url":"https://www.ajc.com/news/crime--law/photos-atlanta-most-wanted/iTGJCmEXHACIph1jjtNKFK/"}
