{"authors":["Associated Press"],"date_download":"2018-10-22 23:38:46","date_modify":"2018-10-22 23:38:46","date_publish":"2016-01-11 06:49:28","description":"Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the...","filename":"data/vaneerConsumption/PHOTOGALLERYAsChryslerredoestheminivanalookback.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:a4db613493674a5e8533f1187832a9a6-56CX32zFKLb7123928b84cb6f462-194_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393419_PHOTO-GALLERY-As-Chrysler-redoes-minivan-look-back_1540251526.html","title":"PHOTO GALLERY: As Chrysler redoes the minivan, a look back","title_page":"PHOTO GALLERY: As Chrysler redoes the minivan, a look back | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PHOTO GALLERY: As Chrysler redoes the minivan, a look back\nChrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear.\nBy the early 1990s, Chrysler was selling more than 500,000 per year. Rivals such as Honda and Toyota soon developed popular minivans of their own.\nBut while extremely practical, the minivan lacked a coolness factor, especially compared with sport utility vehicles. When car companies started making crossovers — small SUVs that had as much space as minivans but more car-like handling and better fuel efficiency — minivan sales took a dive. General Motors and Ford soon stopped making them altogether.\nThis photo provided by Fiat Chrysler Automobiles shows the 1984 Dodge Caravan minivan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nFiat Chrysler Automobiles aims to reverse that slide with the Pacifica, which goes on sale this spring. It replaces both the Town and Country and Grand Caravan. The company is unveiling the Pacifica at this week's auto show in Detroit.\nThis photo provided by Fiat Chrysler Automobiles shows the 1986 Dodge Caravan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the 1989 Dodge Caravan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the 1990 Dodge Caravan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the 1990 Chrysler Town & Country minivan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the 1991 Chrysler Town & Country minivan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the interior of the 1991 Dodge Caravan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the 1995 Chrysler Town & Country. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)\nThis photo provided by Fiat Chrysler Automobiles shows the 1997 Dodge Caravan. Chrysler introduced the minivan 33 years ago, and it took the suburbs by storm. The sliding doors and roomy interior in the Chrysler Town and Country and the Dodge Caravan were perfect for shuttling kids and their sports gear. (Courtesy of Fiat Chrysler Automobiles)","url":"https://www.dailymail.co.uk/wires/ap/article-3393419/PHOTO-GALLERY-As-Chrysler-redoes-minivan-look-back.html"}
