{"authors":["Sarah Jacobs"],"date_download":"2018-10-30 20:49:36","date_modify":"2018-10-30 20:49:36","date_publish":"2016-12-27 00:00:00","description":"From sports memorabilia to rock 'n' roll shrines, these man caves are pretty elaborate.","filename":"data/vaneerConsumption/Photosofextravagantmancaves.json","image_url":"https://amp.businessinsider.com/images/58598a3ba1a45e23028b723e-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_photos-of-extravagant-man-caves-2016-12_1540932576.html","title":"Photos of extravagant man caves","title_page":"    Photos of extravagant man caves - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Stewart McVicar's man cave. Photo courtesy of ManCaveSite.org\nAs was first explored in 1992 by Joanne Lovering in a Toronto Star column and by John Gray in \"Men Are From Mars, Women Are From Venus,\" the \"man cave\" is a sacred space in many homes today.\nOften an extra bedroom or even an entire basement, man caves are more than just a media room or office — they're a private space, one that a guy can deck out however they want (without any arguments from family members), and retreat to when they need some alone time. When properly designed, the man cave can also become a communal hang-out space to replace the local sports bar.\nMike Yost, creator of the \"The Official Man Cave Site,\" is an expert on the spaces that men cherish in their homes. The site, which has grown to have more than 8,000 members, allows man cave owners to share photos of their digs. Yost then goes through the submissions to promote those he thinks are the best.\nYost also co-wrote a book with Jeff Willser, called \"The Man Cave Book,\" where the man cave is described as \"a stylish lounge, a home theater, a high-tech Mecca to gaming, a music studio, or just an ode to your once great college crash-pad.\"\nHere, Yost shares photos of some of the most impressive man caves he's seen.","url":"https://www.businessinsider.com/photos-of-extravagant-man-caves-2016-12"}
