{"authors":[],"date_download":"2018-10-30 21:21:42","date_modify":"2018-10-30 21:21:42","date_publish":"2015-07-06 00:00:00","description":"The ghostly relics of the former home of NFL football quarterback's Bad Newz Kennels have been retained because the current owner of the 15-acre compound in Smithfield, Va., the anti-chaining organization Dogs Deserve Better Inc., wants to keep people aware of animal cruelty.","filename":"data/vaneerConsumption/PhotosMichaelVicksformerdogfightingpropertytransitioned.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/06/Images/photos.medleyphoto.7589291.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_photos-michael-vick-fo_40dd6fd40fd4288c23b6df2d9788e90f__1540934502.html","title":"Photos: Michael Vick's former dogfighting property transitioned","title_page":"Photos: Michael Vick's former dogfighting property transitioned","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 13\nSteve Helber In this June 15, 2015, photo, caretaker Chrissy Appel, works with a dog in front of the Good News Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz Kennel, in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n2 / 13\nSteve Helber A statue of a dog as well as a dog house with a poster adorn the front steps of the Good Newz Rehab Center, the former home of NFL football quarterback and former Atlanta Falcons player Michael Vick's dogfighting operation in Smithfield, Va., Monday, June 15, 2015. The anti-chaining organization Dogs Deserve Better bought the 15-acre compound and its five-bedroom house in 2011. The property where dogs were once brutalized is now a refuge for dogs rescued from a life of being chained or penned. (AP Photo/Steve Helber)\n3 / 13\nSteve Helber In this June 15, 2015, photo, Gus looks at a visitor from his room at the Good Newz Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz kennel, in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n4 / 13\nSteve Helber In this June 15, 2015, photo, caretaker Chrissy Appel, works with a dog in front entrance of the Good News Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz Kennel in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n5 / 13\nSteve Helber In this June 15, 2015, photo, caretaker Chrissy Appel works with Gus as director of Dogs Deserve Better, Denise Cohn, right, holds the leash at Good News Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz Kennel in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n6 / 13\nSteve Helber In this June 15, 2015, photo, a rescue dog looks out a window at visitors during a tour of the Good Newz Rehab Center, the former home of NFL football quarterback Michael Vick's dogfighting operation in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n7 / 13\nSteve Helber In this June 15, 2015, photo, a hole cut in the floor by investigators in the dog fighting building at the Bad Newz kennel remains during a tour of the Good Newz Rehab Center, the former home of NFL football quarterback Michael Vick in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n8 / 13\nSteve Helber Stitch lays in his crate in an office at the Good Newz Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz kennel in Smithfield, Va., Monday, June 15, 2015. The anti-chaining organization Dogs Deserve Better bought the 15-acre compound and its five-bedroom house in 2011. The property where dogs were once brutalized is now a refuge for dogs rescued from a life of being chained or penned. (AP Photo/Steve Helber)\n9 / 13\nSteve Helber In this June 15, 2015, photo, a rescued dog walks down the back stairs of the Good Newz Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz kennel in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n10 / 13\nSteve Helber A rescued dogs walk to a run in back of the Good Newz Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz kennel in Smithfield, Va., Monday, June 15, 2015. The anti-chaining organization Dogs Deserve Better bought the 15-acre compound and its five-bedroom house in 2011. The property where dogs were once brutalized is now a refuge for dogs rescued from a life of being chained or penned. (AP Photo/Steve Helber)\n11 / 13\nSteve Helber A cage used by the dogfighting operation of former NFL football quarterback Michael Vick's dogfighting operation has been retained by the new owners of the property in Smithfield, Va., Monday, June 15, 2015. The anti-chaining organization Dogs Deserve Better bought the 15-acre compound and its five-bedroom house in 2011. The property where dogs were once brutalized is now a refuge for dogs rescued from a life of being chained or penned.(AP Photo/Steve Helber)\n12 / 13\nSteve Helber In this June 15, 2015, photo, caretaker Chrissy Appel works with a dog in the back of the Good News Rehab Center, the former home of NFL football quarterback Michael Vick's Bad Newz Kennel in Smithfield, Va. The former Atlanta Falcons star quarterback served an 18-month federal prison sentence for running a dogfighting ring. (AP Photo/Steve Helber)\n13 / 13","url":"https://www.ajc.com/news/photos-michael-vick-former-dogfighting-property-transitioned/pNzffKoUQfpVpVVp7dIOOP/"}
