{"authors":["Alicia Lu"],"date_download":"2018-10-30 22:36:09","date_modify":"2018-10-30 22:36:09","date_publish":"2014-08-14 22:00:03","description":"The days following the shooting of Michael Brown on Saturday, Ferguson, Mo. have been rocked by civil unrest and heavy police presence, prompting Gov. Jay Nixon to announce Missouri Highway Patrol would take over security operations in the town.…","filename":"data/vaneerConsumption/PhotosFromFergusonStLouisRevealHowMuchTheTownResemblesAWarZone.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/79651424-7cb8-434e-a67d-d96a611dcc28.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35820-photos-from-ferguson-st-louis-reveal-how-much-the-town-resembles-a-war-zone_1540938969.html","title":"Photos From Ferguson, St. Louis Reveal How Much The Town Resembles A War Zone","title_page":"Photos From Ferguson, St. Louis Reveal How Much The Town Resembles A War Zone","title_rss":"NULL","source_domain":"bustle.com","text":"The days following the shooting of Michael Brown on Saturday, Ferguson, Mo. have been rocked by civil unrest and heavy police presence, prompting Gov. Jay Nixon to announce Missouri Highway Patrol would take over security operations in the town. Brown, an 18-year-old African-American teenager, was unarmed when he was fatally shot by a Ferguson police officer on Saturday. The nature of the shooting has sparked four nights of violent protests, vandalism, and looting.\nSince last weekend, Ferguson and St. Louis police have swarmed the streets of Ferguson wearing camouflage, carrying rifles, patrolling the streets in armored vehicles, and using smoke bombs and tear gas on protestors. According to ABC News, Ferguson police received non-tactical military equipment last October through the Department of Defense's 1033 program, which \"provides surplus DoD military equipment to state and local civilian law enforcement agencies for use in counter-narcotics and counter-terrorism operations, and to enhance officer safety.\"\nIn the case of Ferguson, the equipment is being used to regulate civil demonstrators who are demanding murder charges for the officer who shot and killed Brown.\nOutrage over the shooting has also erupted on social media, with many users posting photos of the current unrest in Ferguson. The visual evidence highlights one common theme: the war zone-like scenes in the town.\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nScott Olson/Getty Images News/Getty Images\nImages: Getty (9)","url":"https://www.bustle.com/articles/35820-photos-from-ferguson-st-louis-reveal-how-much-the-town-resembles-a-war-zone"}
