{"authors":[],"date_download":"2018-10-30 14:22:54","date_modify":"2018-10-30 14:22:54","date_publish":"2017-01-08 00:00:00","description":"Freddie Falcon, the Atlanta Falcons mascot, will rally fans at Super Bowl 2017. The Atlanta Falcons mascot costume has changed over the years.","filename":"data/vaneerConsumption/PhotosAtlantaFalconsmascotFreddieFalcon.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/08/Images/newsEngin.17375415_falcons.0921-CC33.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_photos-atlanta-falcons-mascot-freddie-falcon__1540909374.html","title":"Photos: Atlanta Falcons mascot Freddie Falcon","title_page":"Photos: Atlanta Falcons mascot Freddie Falcon","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 10\nThe Atlanta Journal-Constitution Freddie Falcon, mascot of the Atlanta Falcons, swarmed by Falcons cheerleaders in the Georgia Dome in Atlanta, Ga. Curtis Compton / ccompton@ajc.com\n2 / 10\nANDY SHARP/AJC Freddie Falcon celebrates Super Bowl fever with fan, Kim Smith, on January 27, 1999 in the Cobb Galleria Specialty Mall. At the time, the Falcons were preparing to take on the Denver Broncos in the team's first-ever Super Bowl. PHOTO BY ANDY SHARP/STAFF\n3 / 10\nPHIL SKINNER/AJC Freddie the Falcon at an event in Buckhead, Ga in 1998. The Atlanta Falcons mascot costume has changed through the years. (PHIL SKINNER /AJC staff).\n4 / 10\nCurtis Compton/AJC Freddy the Falcon looks like he can't bear to watch the end of the game as he hides under part of the field decoration in the 4th quarter of the Falcons 38-28 loss in the Falcons vs. Cowboys game at the Georgia Dome December 16, 2006. (Curtis Compton / AJC Staff)\n5 / 10\nBrant Sanderlin Freddie the Falcon jokes around with a student at M. Agnes Jones Elementary in Atlanta, Georgia on October 20, 2015. BRANT SANDERLIN/BSANDERLIN@AJC.COM\n6 / 10\nJason Getz/jgetz@ajc.com Atlanta Falcons mascot Freddie Falcon jumps into a group of students at Morris Brandon Elementary in Atlanta, Ga., October 18, 2011. Jason Getz jgetz@ajc.com\n7 / 10\nCurtis Compton Atlanta Falcons mascot, Freddie Falcon, during a team event in Dec. 17, 2013, in Lawrenceville, Ga. CURTIS COMPTON / CCOMPTON@AJC.COM\n8 / 10\nFalcons cornerback Phillip Adams faces off with mascot Freddie Falcon as he takes the field for team practice during mini-camp on Wednesday, June 17, 2015, in Flowery Branch. Curtis Compton / ccompton@ajc.com\n9 / 10\nSean Ryan Atlanta Falcons quarterback Matt Ryan high-fives with the Falcons mascot. Samantha Thompson /NFL\n10 / 10","url":"https://www.ajc.com/sports/football/photos-atlanta-falcons-mascot-freddie-falcon/NgmuSeSvYmUVNP2HvQUr0N/"}
