{"authors":[],"date_download":"2018-10-30 21:23:54","date_modify":"2018-10-30 21:23:54","date_publish":"2017-01-01 00:00:00","description":"Michael Vick joined former Falcons players and coaches in ceremony paying tribute to the retiring Georgia Dome before the Falcons meet the New Orleans Saints on Sunday, Jan. 1, 2017, in Atlanta.","filename":"data/vaneerConsumption/PhotosVickformerFalconspaytributetoGeorgiaDome.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/01/Images/010217%20falcons%20photos%20DB%200012.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_photos-vick_00429b4bbb7d870a94cd4fec5ac57810__1540934634.html","title":"Photos: Vick, former Falcons pay tribute to Georgia Dome","title_page":"Photos: Vick, former Falcons pay tribute to Georgia Dome","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 13\nDavid Barnes/AJC Former Falcons quarterback Michael Vick (7) and star wide receiver Roddy White (left) enter the Georgia Dome for a halftime celebration of the retiring stadium Sunday, Jan. 1, 2017, in Atlanta.\n2 / 13\nDavid Goldman/AP Former Atlanta Falcons players are recognized at halftime of Falcons' final regular season game at the retiring Georgia Dome on Sunday, Jan. 1, 2017, in Atlanta.\n3 / 13\nDavid Barnes/AJC Former Falcons quarterback Michael Vick (7) was part of celebration of the Georgia Dome during its final regular season game Sunday, Jan. 1, 2017.\n4 / 13\nDavid Barnes/AJC Former Falcons quarterback Michael Vick (7) acknowledges the crowd at the Georgia Dome during a halftime celebration, paying tribute to the retiring stadium on the Falcons’ final regular season game on Jan. 1, 2017, in Atlanta.\n5 / 13\nDavid Barnes/AJC Former Falcons outside linebacker Stephen Nicholas (54) hugs Falcons quarterback Matt Ryan (2) during tribute to Georgia Dome on Sunday, Jan. 1, 2017, in Atlanta.\n6 / 13\nDavid Barnes/AJC Former Falcons outside linebacker Stephen Nicholas (54) smiles to fans at the Georgia Dome during a haltime celebration paying tribute to the retiring stadium Sunday, Jan. 1, 2017, in Atlanta.\n7 / 13\nCurtis Compton/ccompton@ajc.com Former Falcons quarterback Michael Vick waves to fans as he returns to the Georgia Dome for ceremony paying tribute to the retiring stadium before the team plays the final regular season game against the New Orelands Saints on Sunday, Jan. 1, 2017, in Atlanta.\n8 / 13\nCurtis Compton/ccompton@ajc.com Former Falcons quarterback Michael Vick talks with former head coach Jerry Glanville as they return to the Georgia Dome for a ceremony paying tribute to the retiring stadium before the final regular season game against the New Orleans Saints on Sunday, Jan. 1, 2017, in Atlanta.\n9 / 13\nCurtis Compton/ccompton@ajc.com Former Falcons quarterback Michael Vick returns to the Georgia Dome for a ceremony paying tribute to the retiring stadium before the final regular season game against the New Orleans Saints on Sunday, Jan. 1, 2017, in Atlanta.\n10 / 13\nCurtis Compton/ccompton@ajc.com Former Falcons quarterback Michael Vick and owner Arthur Blank exchange words as the team paid tribute to the retiring Georgia Dome before the final regular season game against the New Orleans Saints on Sunday, Jan. 1, 2017, in Atlanta.\n11 / 13\nCurtis Compton/ccompton@ajc.com Former Falcons quarterback Michael Vick and owner Arthur Blank greet each other on the sidelines before the a ceremony paying tribute to the retiring Georgia Dome before the final regular season game against the New Orleans Saints on Sunday, Jan. 1, 2017, in Atlanta.\n12 / 13\nCurtis Compton/ccompton@ajc.com Former Falcons quarterback Michael Vick and owner Arthur Blank hug on the sidelines beforef a ceremony paying tribute to the retiring stadium before the final regular season game against the New Orleans Saints on Sunday, Jan. 1, 2017, in Atlanta.\n13 / 13","url":"https://www.ajc.com/sports/football/photos-vick-former-falcons-pay-tribute-georgia-dome/YMbe3xI8NXemtLoecFL5WK/"}
