{"authors":["Chris Bahn Noel Oman"],"date_download":"2018-10-30 21:44:58","date_modify":"2018-10-30 21:44:58","date_publish":"2016-10-11 00:00:00","description":"Turns out the Broadway Bridge wasn't just old. It was also pretty darned stubborn.","filename":"data/vaneerConsumption/PHOTOSVIDEOBroadwayBridgefallsafterabit.json","image_url":"https://media.arkansasonline.com/img/photos/2016/10/11/resized_250499-broadway-bridge-implosion_72-21982_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_oct_12_bridge-falls-after-a-bit-20161012__page=1_1540935898.html","title":"PHOTOS/VIDEO: Broadway Bridge falls ... after a bit","title_page":"PHOTOS/VIDEO: Broadway Bridge falls ... after a bit","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Explosive charges go off across the Broadway Bridge’s steel arch Tuesday morning. The charges were supposed to drop the bridge into the Arkansas River, but it held on, barely teetering. - Photo by Benjamin Krain\nTurns out the Broadway Bridge wasn't just old. It was also pretty darned stubborn.\nThe 93-year-old bridge defied a series of explosive charges and a half-dozen heavy-duty tugs by towboats before it finally toppled into the Arkansas River on Tuesday afternoon, a good five hours after it was expected to fall.\nWith throngs of expectant onlookers lining both sides of the river as well as the Main Street Bridge and Junction Bridge, the scheduled 10 a.m. detonation of strategically placed charges on the bridge's steel arch went off like clockwork. A few loud booms and a lot of black and gray smoke.\nAnd not so much as a shiver from the bridge.\n[BROADWAY BRIDGE: More videos of explosion and bridge falling + traffic map, cameras, previous coverage, photos here]\nBroadway Bridge detonation and collapse Nearly five hours after the detonation that was supposed to bring the Broadway Bridge down, two tugboats pulled it into the Arkansas River. Video by Brandon Riddle and Austin Cannon.\n[View Full-Size]\nPhoto by Staton Breidenthal\nFive hours later, the arch finally fell with the help of towboats and strong cables.\nPhoto by Staton Breidenthal\nThe steel arch of the Broadway Bridge sinks beneath the Arkansas River after it was finally pulled down Tuesday.\nPhoto by Benjamin Krain\nEngineers examine the Broadway Bridge from a crane after the failed demolition attempt Tuesday.\nPhoto by Benjamin Krain\nWorkers secure cables to a barge so towboats could move in to finish the job.\nPhoto by Staton Breidenthal\nSpectators line the bank Tuesday morning on the Little Rock side of the Arkansas River to watch the Broadway Bridge come down. They were treated to loud booms and lots of smoke, but the bridge stood tall for five more hours.\n\"Well, that didn't quite go as planned,\" the Arkansas Highway and Transportation Department said in a tweet just after the implosion failed to topple the bridge.\nThe snafu set off a social-media field day, as several people took delight in the difficulty in taking down the old bridge.\n\"We will always remember where we were when the #BroadwayBridge almost came down,\" one person tweeted.\nLittle Rock city employees, who watched the bridge drama from nearby City Hall, jokingly took credit once the job was done.\n\"We're not saying our jumping did the trick, but it certainly didn't hurt. Goodbye, span,\" the city's official Twitter account tweeted once the bridge finally fell.\nThe implosion was arranged by a subcontractor for Massman Construction Co. of Kansas City, Mo., which was awarded the $98.4 million contract to replace the bridge and is in the midst of 180-day period in which it will remove the old bridge and replace it.\nMassman crews spent the weekend cutting the bridge arch in some areas to weaken the structure and help it fall apart in what essentially was supposed to be a controlled explosion, highway officials said. The charges were designed to produce heat to cut through the bridge rather than explode it.\n\"All the the pre-cuts worked,\" said Danny Straessle, a spokesman for the Highway Department. \"All the detonations worked. The bridge is just falling into itself. It's just barely teetering there.\"\nWhile the charges worked as designed, the bridge pieces didn't separate and instead rested against one another, with the weight holding the bridge together.\n[GALLERY: Photos show Broadway Bridge detonation, arch falling]\n\"They're basically wedged in there,\" said Tony Sullivan, an assistant chief engineer for operations at the Highway Department, who monitored the operation from the Main Street Bridge.\nStill, it was a dangerous situation.\n\"It could fall in the water at any time,\" Straessle said. \"It's severely weakened.\"\nMassman used a towboat to position a crane on a barge near the arch after it failed to fall. The crane was used to raise a small basket carrying a crew to assess the arch.\nAbout 11:30 a.m., the towboat moved another barge to the bridge.\n\"We're going to put a cable up there and tug it,\" Straessle said.\nThe crane raised the cable over the arch near its north end near one of the arch's two triangle pieces that are anchored in concrete at each end of the arch.\nShortly after 1 p.m., the first attempt to pull down the bridge commenced. Again, the arch didn't move. A second one was tried about five minutes later, also without success.\nAt that point, it was decided to reposition the cable over the horizontal beam at the center of the arch. By 2:40 p.m., the tow and barge were repositioned for a third try.\nIt, too, failed, but the metallic noises and dust emanating from the bridge clearly reflected stress on the arch. Two more attempts were made and they, too, failed.\nFinally, a second, larger towboat arrived to help pull the barge to which the cable was connected. At 2:49 p.m., the arch turned over and crashed into the water.\nCompared with the rest of the bridge, the steel arch was a relatively new part of the bridge, having replaced part of the original bridge in 1974 to make way for the McClellan-Kerr Arkansas River Navigation System.\nMassman was given 24 hours by the U.S. Coast Guard to clear the navigation channel of the debris from the fallen arch -- an estimated 2 million pounds of structural steel -- and reopen the navigation channel to barge traffic. The contractor likely will move the steel from the navigation channel to another part of the river before removing it completely.\nCommercial traffic initially was scheduled to resume within 24 hours of the 10 a.m. implosion. How the delay would affect the timeline was not immediately known.\nGene Higginbotham, executive director of the Arkansas Waterways Commission, said an average of fewer than five commercial vessels pass through that stretch of the river per day, but traffic is higher this time of year because of harvested grain being shipped out of and through the The McClellan-Kerr Arkansas River Navigation System.\nApproximately 12 million tons, valued between $2 billion and $3 billion, are shipped annually on the river system, which stretches 445 miles between the Port of Catoosa near Tulsa and the Mississippi River.\nHigginbotham said that as of Tuesday afternoon about 3 p.m., three vessels appeared to be waiting on the river for clearance to begin moving again. Advance noticed helped companies plan and likely will ease the burden felt by businesses moving goods on the river, Higginbotham said.\n\"The industry has known that this has been planned for some time and have adjusted their schedules to pass through Little Rock accordingly,\" Higginbotham said. \"The area, from mile marker 118.6 to 119.6, is in a safety zone previously established by the U.S. Coast Guard when construction began. We hope the efforts to bring the arches down will be successful soon so navigation can resume through this part of the system.\"\nHigginbotham said it was his understanding that the 24-hour window for cleanup began \"from the time the arches fall into the river.\"\nDespite the delayed implosion, Little Rock Port Authority Executive Director Bryan Day said replacing the bridge will ultimately be a plus for commercial traffic on the Arkansas River. The bridge spans, the distance between the supports, will be widened by approximately 65 feet, making it easier, and safer, for shipping.\nCurrently the bridge spans are 331.3 feet and the new ones are 396 feet.\n\"The river is important to commercial navigation and whenever it is closed it creates challenges for the industry,\" Day wrote in a text message. \"The new bridge design will be a significant improvement to navigation and those who use the river are grateful for the bridge upgrade. I would go on to say that I hope the contractor can find a way to safely remove the span from the Broadway Bridge as soon as possible so that the navigation channel can be reopened to commercial traffic.\"\nOnlookers Tuesday were attracted by the marvel of seeing a bridge fall into the water, even though it didn't quite work out that way initially.\n\"This is kind of a unique experience, a once-in-a-lifetime experience,\" said U.S. Sen. John Boozman, R-Ark., who was among the onlookers who wanted to see the implosion. \"I have fond memories of the bridge. It's a new era. Seeing it come down is going to be a neat thing. We've seen a big blast, but it's yet to come down. It shows how tough the original structure was, I guess.\"\nMetro on 10/12/2016","url":"https://www.arkansasonline.com/news/2016/oct/12/bridge-falls-after-a-bit-20161012/?page=1"}
