{"authors":["Hannah Mellin For Mailonline"],"date_download":"2018-10-23 02:35:38","date_modify":"2018-10-23 02:35:38","date_publish":"2017-03-10 11:50:46","description":"The British actress, 63 who played Mrs Hughes in the ITV1 period drama, appeared on Good Morning Britain on Friday to all but confirm a big-screen version of the hit series soon be on its way.","filename":"data/vaneerConsumption/PhyllisLoganonreunitingforDowntonAbbeymovie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E2255DD00000578-0-image-a-22_1489143005211.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300478_Phyllis-Logan-reuniting-Downton-Abbey-movie_1540262138.html","title":"Phyllis Logan on reuniting for Downton Abbey movie","title_page":"Phyllis Logan on reuniting for Downton Abbey movie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Phyllis Logan has insisted that the 'will is definitely there' for a movie adaptation of Downton Abbey.\nThe British actress, 61, who played Mrs Hughes in the ITV1 period drama, appeared on Good Morning Britain on Friday to all but confirm a big-screen version of the hit series soon be on its way.\nChatting to hosts Kate Garraway and Ben Shephard on the daytime show, the star said the entire cast would love to have 'one last hurrah'.\nScroll down for video\nKeeping hope: Phyllis Logan has insisted that the 'will is definitely there' for a movie adaptation of Downton Abbey\nShe explained: 'The will is definitely there with everybody involved. The will is definitely there.\n'So, let's fingers crossed that we can make it all come about at some stage. And we’d love all to get back together again and have one last hurrah, we certainly would.'\nBut the Good Karma Hospital star admitted it would be difficult to round up all of her co-stars, including the likes of Michelle Dockery, Laura Carmichael and Hugh Bonneville.\nPhyllis joked: 'There’s so many of us. There's so many of us. In normal film situations you might have a core cast of half a dozen or whatever.\nMake it happen: The British actress, 63 who played Mrs Hughes in the ITV1 period drama, appeared on Good Morning Britain on Friday to all but confirm a big-screen version\nMrs Hughes has spoken! Chatting to hosts Kate Garraway and Ben Shephard on the daytime show, the star said the entire cast would love to have 'one last hurrah'\n'But this is a core cast of thousands it feels like at times. And so… herding cats?'\nThe actress looked lovely for her daytime television appearance, wearing a tailored black trouser suit and slogan T-shirt.\nRumours of a film have been rife ever since Downton bowed out on Christmas Day in 2015.\nScreenwriter Julian Fellowes added fuel to the fire in January, when he told the Daily Mail 'we are all hoping it will happen', and suggested a script was in the pipeline.\nHe said: 'It hasn’t been confirmed or commissioned… but we are all hoping it will happen. That’s all I know.\nTricky task: The Good Karma Hospital star admitted it would be difficult to round up all of her co-stars, including the likes of Michelle Dockery, Laura Carmichael and Hugh Bonneville\nWill Downton open it's doors again? Phyllis played Mrs Hughes (R) in the period drama and her character shared a close friendship with Mrs Patmore (L)\n'Obviously I have been thinking about it because if they suddenly give the go-ahead I don’t want to be completely caught standing. But I wouldn’t take it as more than that.'\nJim Carter, 68 - who played popular butler Carson - dropped the biggest hint to date, admitting the cast had been instructed to 'keep dates available'.\nSpeaking on Good Morning Britain in January, he said: 'We’ve been asked to keep ourselves available at dates in the future.’\nWhen presenter Susanna Reid reacted with excitement, he hastily added: 'I think there’s a willingness there to do a film but until there’s a script there’s no film.'\nIn August 2016, Michelle Dockery - who portrayed the aristocratic Lady Mary Crawley - said: 'I think there is potential for a [Downton Abbey] film.\nWedded bliss: Viewers witnessed warm-hearted Mrs Hughes marry pompous but gentle butler Carson, played by Jim Carter\n'That is something I would wholeheartedly consider, so we will see. It may not be over yet.'\nA few months later, Lily James, who played Lady Rose, said: 'We’ve all heard this rumour - the cast - that the script has been written.\n'There’s a hard copy somewhere but none of us have seen it or know what’s in it. So we’ll all keep our fingers crossed that it all comes together.'\nViewers witnessed Phyllis' warm-hearted character Mrs Hughes finally marry pompous but gentle butler Carson in the last series.\nIt's unknown what the highly-anticipated Downton movie would focus upon, especially as creator Fellowes gave all his beloved characters their fairytale endings in the series finale back in 2015.\nDevoted fans praised the surprisingly cheerful end, which saw Lady Edith finally tie the knot, Lady Mary expecting her second child and Anna and Bates welcomed their first baby together.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300478/Phyllis-Logan-reuniting-Downton-Abbey-movie.html"}
