{"authors":[],"date_download":"2018-10-22 21:51:05","date_modify":"2018-10-22 21:51:05","date_publish":"2014-06-06 19:06:39","description":"Some physicists are suggesting that the best evidence for inflationary Big Bang theory is actually nothing more than galactic dust.","filename":"data/vaneerConsumption/PhysicistsDebateClaimsofEvidenceforCosmicInflation.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/493081/140606-blackholes_7949df4786dd3c2c3b8769ff62f54f8b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_physicists-debate-claims-evidence-cosmic-inflation-n124756_1540245065.html","title":"Physicists Debate Claims of Evidence for Cosmic Inflation","title_page":"Physicists Debate Claims of Evidence for Cosmic Inflation","title_rss":"NULL","source_domain":"nbcnews.com","text":"One of the panelists, cosmologist Alan Guth of MIT, developed the hypothesis of inflation in 1980 to explain the large-scale structure of the universe. The Big Bang left behind remnant heat, known as the cosmic microwave background, or CMB. Although the CMB contains tiny temperature variations, it's still remarkably uniform, which might be expected if the universe expanded from a very small region.\nIf inflation occurred, scientists suspect it might have left an imprint on the CMB, produced by gravitational waves, which would appear as a swirly pattern in the CMB. Harvard astronomer John Kovac and his colleagues claimed to have detected this pattern in March using the BICEP2 instrument at the South Pole.\nSince then, the results have come under fire from scientists who question whether the team had ruled out other possible sources that would produce the same swirly signature, such as dust in the Milky Way. Princeton cosmologist Paul Steinhardt, who supports an alternative model of the universe that suggests the existence of higher dimensions, said Kovac and his colleagues were too confident in their initial claims.\nDuring the panel discussion, Kovac admitted some uncertainty but defended the findings. His team has further analyzed their data and feels \"very confident\" the results were not spurious, he said.\nOther groups are also looking for these ripples from the Big Bang. The European Space Agency's Planck satellite is expected to release its own data soon, and should offer strong evidence one way or the other.\n— Tanya Lewis, Space.com\nThis is a condensed version of a report from Space.com. Read the full report. Follow Tanya Lewis on Twitter and Google+. Follow Space.com on Twitter, Facebook and Google+.","url":"https://www.nbcnews.com/science/space/physicists-debate-claims-evidence-cosmic-inflation-n124756"}
