{"authors":["Greg Styles","Marta Jary For Daily Mail Australia"],"date_download":"2018-10-23 01:39:28","date_modify":"2018-10-23 01:39:28","date_publish":"2017-03-10 10:05:33","description":"Pia Miller was very happy to finish work early on Friday. The actress celebrated leaving the set of Home and Away by snapping a selfie and sharing her delight on Instagram.","filename":"data/vaneerConsumption/PiaMillertakesselfieassheleaveshomeandAwayset.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21E39800000578-0-image-a-18_1489138214759.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300496_Pia-Miller-selfie-brunette-beauty-Home-Away_1540258768.html","title":"Pia Miller takes selfie as she leaves home and Away set","title_page":"Pia Miller takes selfie as she leaves home and Away set | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pia Miller was very happy to finish work early on Friday.\nThe actress celebrated leaving the set of Home and Away by snapping a selfie and sharing her delight on Instagram.\nPictured in the backseat of a car, the 33-year-old showed off her flawless complexion and beautiful brown eyes.\nScroll down for video\nHome time! Pia Miller celebrated leaving the set of Home and Away by snapping a selfie and sharing her delight on Instagram\nShe captioned the image: 'Here's to an early wrap on a Friday!'\nThe Chilean-born stunner added the hashtags 'happy weekend' and 'happy me' - just in case her broad smile didn't give make her emotions clear enough.\nLast week, the beauty returned to the fictional Summer Bay as she was seen posting for a selfie on the Home and Away set in Sydney.\nBack to work! The beauty returned to the fictional Summer Bay as she was seen posting for a selfie on the Home and Away set in Sydney\n'Me and mi (sic) mate' she captioned the image, in which she is clutching a coffee cup.\nThe fresh-faced actress, who plays Katarina Chapman on the long running soap, leaned down into the camera, her thick, long hair looking luminous.\nShe donned the police uniform her character wears and despite tagging a makeup artist, looked natural and almost makeup-free.\nMaking the most of it: A day earlier the brunette had been enjoying the final day of her summer holidays, snapping a picture in her swimwear\nBeach babe: Pia regularly flaunts her enviable bikini body. Pictured here at the north rocks of Bondi Beach last month\nA day earlier the brunette had been enjoying the final day of her summer holidays, snapping a picture in her swimwear.\n'Last week of summer apparently,' wrote the 33-year-old stunner.\n'It's been real,' she continued, before adding the hashtags 'Sydney' and 'happy Monday'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300496/Pia-Miller-selfie-brunette-beauty-Home-Away.html"}
