{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:36","date_modify":"2018-10-23 05:01:36","date_publish":"2016-01-28 21:07:27","description":"WASHINGTON (AP) — President Barack Obama's nominee to be the next U.S. commander in Afghanistan said Thursday the security situation in the war-torn country ...","filename":"data/vaneerConsumption/PicktoleadAfghanistanforcessayssituationisworsening.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:186e68194b3c4b7182603237e79c600f-2vdWmEltwXfba0ce28e632ca9943-430_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421155_Army-official-Security-Afghanistan-worsening_1540270896.html","title":"Pick to lead Afghanistan forces says situation is worsening","title_page":"Pick to lead Afghanistan forces says situation is worsening | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pick to lead Afghanistan forces says situation is worsening\nWASHINGTON (AP) — President Barack Obama's nominee to be the next U.S. commander in Afghanistan said Thursday the security situation in the war-torn country is deteriorating and assured senators he will do a thorough review of American troop levels needed to stabilize the nation.\nArmy Lt. Gen. John W. \"Mick\" Nicholson Jr. told the Senate Armed Services Committee he will have a better sense of conditions in Afghanistan within a few months if he is confirmed by the Senate.\nAs wartime commanders must often do, Nicholson walked a fine line during his confirmation hearing. He supported the Obama administration's exit strategy, which critics have derided as politically driven, while also promising the senators his decisions will be grounded in sound military strategy.\nArmy Lt. Gen. John Nicholson Jr. testifies on Capitol Hill in Washington, Thursday, Jan. 28, 2016, before the the Senate Armed Services Committee hearing on his nomination to become the next top American commander in Afghanistan. (AP Photo/Alex Brandon)\nHe peppered his answers with phrases like \"right-sized\" and \"right-sourced\" to make sure Afghanistan didn't devolve into the same terrorist harbor it was before the 9/11 attacks. The U.S. mission in Afghanistan is to conduct counterterrorism missions and to train and assist the Afghan security forces.\nNicholson would succeed Gen. John F. Campbell, who is expected to retire.\nThere are about 9,800 U.S. troops in Afghanistan. At Campbell's urging, Obama decided last October to abandon his plan to reduce troop levels to near zero by the end of 2016. Instead, he said they would shrink to 5,500 by the end of the year. His advisers could press Obama to maintain the current level of 9,800 troops until he leaves office in January 2017.\nAsked at a Pentagon news conference whether the Taliban is making a comeback, Defense Secretary Ash Carter said: \"That's happened this past fighting season. We expected that.\" And while the Afghans fought well last year, he said, they are still \"a force-in-the-making\" that can be expected to perform better this year as they gain more experience and capability.\nCarter said Campbell has not recommended to him any increase in U.S. troop levels.\nDuring an exchange with Sen. Lindsey Graham, R-S.C., Nicholson said he would be concerned that the military would not be able to perform counterterrorism operations if the number of American troops fell to a hypothetical 1,000 suggested by Graham.\nNicholson said he supported the decision to retain the 9,800 American troops and he agreed with Campbell's approach. But the general also said at numerous points during the hearing that he would conduct his own assessment.\nAlthough American forces are no longer engaged in direct action missions against the Taliban, Nicholson said he could not envision U.S. troops remaining on the sidelines if the strategic city of Kandahar were at risk. Kandahar, in southern Afghanistan, is the spiritual birthplace of the Taliban.\n\"We need to prevent Kandahar from falling into the hands of the Taliban,\" Nicholson said.\nThe committee chairman, Sen. John McCain, R-Ariz., opened Nicholson's confirmation hearing with a blistering assessment of Obama's handling of the war in Afghanistan and the president's adherence to a \"calendar-based withdrawal.\"\n\"By now, we should have learned from the precipitous withdrawal from Iraq and the disaster that ensued that wars do not end because politicians say so,\" McCain said. \"Nor will any politician be able to schedule an end to the threat of radical Islamist terrorism emanating from Afghanistan or the region more broadly.\"\nMcCain prefaced a question to Nicholson about the security situation in Afghanistan with his own stark appraisal of the conditions there. He cited recent battlefield successes by the Taliban, who he said are being aided with weapons from Iran, and the presence of the Islamic State extremist group in Afghanistan.\n\"The view of many of us is that the security situation in Afghanistan has been deteriorating rather than improving,\" McCain said.\n\"Sir, I agree with your assessment,\" Nicholson said. Later, he added, \"This is Afghanistan. There will always be some level of violence in Afghanistan.\"\nNicholson, a 1982 graduate of the U.S. Military Academy at West Point and a career infantry officer, is currently commander of NATO's Allied Land Command, headquartered at Izmir, Turkey. Among numerous tours of duty in Afghanistan starting in 2006, he served as deputy chief of staff of operations for the international military command and for U.S. forces in 2010. Before that he spent 14 months as director of the Pentagon's Afghanistan-Pakistan coordination cell.\n___\nAssociated Press writer Robert Burns contributed to this report.\n___\nFollow Richard Lardner on Twitter at http://twitter.com/rplardner\nArmy Lt. Gen. John Nicholson Jr. testifies on Capitol Hill in Washington, Thursday, Jan. 28, 2016, before the the Senate Armed Services Committee hearing on his nomination to become the next top American commander in Afghanistan. (AP Photo/Alex Brandon)\nSenate Armed Services Committee Chairman Sen. John McCain, R-Ariz., left, and the committee's rankings member Sen. Jack Reed, D-R.I., question Army Lt. Gen. John Nicholson Jr., center, on Capitol Hill in Washington, Thursday, Jan. 28, 2016, during the committee's hearing on Nicholson's nomination to become the next top American commander in Afghanistan. (AP Photo/Alex Brandon)","url":"https://www.dailymail.co.uk/wires/ap/article-3421155/Army-official-Security-Afghanistan-worsening.html"}
