{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:17:34","date_modify":"2018-10-30 21:17:34","date_publish":"2016-12-21 00:00:00","description":"Bern regularly pops up in indexes which rank best quality of life.","filename":"data/vaneerConsumption/PicsofBernSwitzerland.json","image_url":"https://amp.businessinsider.com/images/5757df64dd0895bf198b49f1-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pics-of-bern-switzerland-one-of-the-cities-with-the-best-quality-of-life-in-the-world-2016-12_1540934254.html","title":"Pics of Bern, Switzerland","title_page":"    Pics of Bern, Switzerland — one of the cities with the best quality of life in the world - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Rebecca Griffiths/Business Insider Ever since Britain voted to leave the European Union in June this year, a number of Brits who voted Remain have said they are looking move somewhere in Europe.\nWhile moving to Ireland seems top of the list, some have been looking further into the continent.\nCue Bern in Switzerland — considered one of best cities to live in the world.\nThe Alpine city ranked 14th in the annual \"Quality of Living Index\" of one of the world's largest HR consultancy firms, Mercer, and as the second-safest city in the world in the group's separate rankings.\nAccording to London-based think tank Legatum Institute in its annual global Prosperity Index, Switzerland overall is the second happiest, richest, healthiest, and most crime-free country in the world.\nGlassdoor also showed that Switzerland has the best standard of living in Europe because of its on average high salaries of over €50,000 (£39,038, $56,838) and strong purchasing power.\nBasically, Bern sounds pretty amazing. Travel experts point out that it's underrated because it is less well known than Switzerland's huge financial hubs, Zurich and Geneva.\nSo what makes Bern great?\nRebecca Griffiths is a cardiovascular admissions manager for a large NHS Foundation Trust in London, and earlier this year she went to Switzerland for a month to experience and learn about the healthcare system as part of the multidisciplinary Hope Exchange programme.\n\"The quality of life in Switzerland, and very much so in Bern, is of a very high standard. People take care of themselves. Work-life balance was good,\" Griffiths said.\nShe gave us the inside track on why the Swiss city is so incredible and one of the best places to live and work in the world and how it compares to London:","url":"https://www.businessinsider.com/pics-of-bern-switzerland-one-of-the-cities-with-the-best-quality-of-life-in-the-world-2016-12"}
