{"authors":["Associated Press"],"date_download":"2018-10-23 00:12:47","date_modify":"2018-10-23 00:12:47","date_publish":"2016-01-11 09:02:49","description":"It was an eventful first week of 2016 in Asia, with political rallies in Taiwan drawing cheering supporters ahead of this weekend's presidential elections, w...","filename":"data/vaneerConsumption/PICTUREDEditorselectionsfromAsia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:f34d00cf441940a89b0baca7b44eae5b-48qEJGFphM8d437f0aaf922a24a9-281_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393563_PICTURED-Editor-selections-Asia_1540253567.html","title":"PICTURED: Editor selections from Asia","title_page":"PICTURED: Editor selections from Asia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PICTURED: Editor selections from Asia\nIt was an eventful first week of 2016 in Asia, with political rallies in Taiwan drawing cheering supporters ahead of this weekend's presidential elections, while a swoon in mainland Chinese stocks sent shivers through global markets.\nA defiant North Korea, meanwhile, said it conducted a disputed hydrogen bomb test that showed up as seismic waves on screens at South Korea's meteorological agency. Even if it wasn't an H-bomb, the test likely pushes Pyongyang closer to its goal of a nuclear-armed missile that can reach the U.S. mainland.\nIn other images from around the region, tens of thousands of Catholic devotees in Manila jostled to get closer to the image of the Black Nazarene in a raucous procession.\nIn this Saturday, Jan. 9, 2016 file photo, supporters of Taiwan's Democratic Progressive Party presidential candidate Tsai Ing-wen cheer as she speaks during a large campaign rally in Kaohsiung, Taiwan. Taiwan will hold its presidential election on Jan. 16, 2016. (AP Photo/Wally Santana, File)\nIn Kashmir, Shiite Muslim boys held candles during a protest against Saudi Arabia, which said it executed 47 prisoners convicted of terrorism charges, including al-Qaida detainees and a prominent Shiite cleric.\nAs the sun rose over Singapore, a man found a quiet spot for morning exercises, while Japanese men performed ladder stunts to preserve New Year's traditions.\nIn the world of sports, Australia's David Warner celebrated hitting a century in a cricket test match against the West Indies, and Victoria Azarenka of Belarus clenched her fist after winning a point at the Brisbane International tennis tournament.\n___\nThis gallery was curated by Associated Press photo editor Hiroshi Otabe in Tokyo.\nIn this Friday, Jan. 8, 2016 file photo, a Chinese investor takes a smartphone photo of electronic displays showing stock prices in a brokerage house in Beijing. Chinese stocks were volatile Friday and other Asian markets rebounded after a plunge in Chinese prices rattled global markets. (AP Photo/Mark Schiefelbein, File)\nIn this Wednesday, Jan. 6, 2016 file photo, a Chinese paramilitary policeman stands guard outside the North Korean Embassy in Beijing. North Korea said it conducted a powerful hydrogen bomb test Wednesday, a defiant and surprising move that, if confirmed, would be a huge jump in Pyongyang's quest to improve its still-limited nuclear arsenal. (AP Photo/Andy Wong, File)\nIn this Wednesday, Jan. 6, 2016 file photo, Earthquake and Volcano of the Korea Meteorological Administration Director General Yun Won-tae stands in front of a screen showing seismic waves that were measured in South Korea, in Seoul. North Korea said it had conducted a powerful hydrogen bomb test Wednesday, a defiant and surprising move that, if confirmed, would be a huge jump in Pyongyang's quest to improve its still-limited nuclear arsenal. (AP Photo/Lee Jin-man, File)\nIn this Wednesday, Jan. 6, 2016 file photo, North Koreans watch a news broadcast on a video screen outside Pyongyang Railway Station in Pyongyang, North Korea. North Korea said Wednesday it had conducted a hydrogen bomb test, a defiant and surprising move that, if confirmed, would put Pyongyang a big step closer toward improving its still-limited nuclear arsenal. (AP Photo/Kim Kwang Hyon, File)\nIn this Saturday, Jan. 9, 2016 file photo, tens of thousands of Catholic devotees jostle to get closer to the image of the Black Nazarene as they take part in a raucous procession to celebrate its feast day in Manila, Philippines. As in the past, the annual procession attracts thousands of devotees with scores being injured and saw the deployment of hundreds of police and soldiers. (AP Photo/Bullit Marquez, File)\nIn this Wednesday, Jan. 6, 2016 file photo, Indian soldiers keep guard at the perimeter fence of the Indian air force base in Pathankot, India, Wednesday, Jan. 6, 2016. Indian defense minister Manohar Parrikar had said on Tuesday that Indian forces have killed the last of the six militants who attacked the air force base near the Pakistan border over the weekend, though soldiers are still searching the base as a precaution. (AP Photo/Channi Anand, File)\nIn this Tuesday, Jan. 5, 2016 file photo, Kashmiri Shiite Muslim boys hold candles during a protest against Saudi Arabia in Srinagar, Indian controlled Kashmir. Hundreds of Shiite Muslim in Indian portion of Kashmiri rallied in the Shia dominated areas protesting against Saudi Arabia , after they announced on Saturday it had executed 47 prisoners convicted of terrorism charges, including al-Qaida detainees and a prominent Shiite cleric who rallied protests against the government. (AP Photo/Dar Yasin, File)\nIn this Wednesday, Jan. 6, 2016 file photo, a man is silhouetted against the rising sun in Singapore during his morning exercise along the eastern coast of Singapore. Singapore's East Coast Park is a popular spot for locals to escape the hustle and bustle of the city. (AP Photo/Wong Maye-E, File)\nIn this Wednesday, Jan. 6, 2016 file photo, members of a traditional firefighting preservation group perform ladder stunts during the annual New Year's Fire Brigade Review in Tokyo. (AP Photo/Eugene Hoshiko, File)\nIn this Thursday, Jan. 7, 2016 file photo, Australia's David Warner leaps as he celebrates after hitting a century during their cricket test match against the West Indies in Sydney, Australia. (AP Photo/Rob Griffith, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3393563/PICTURED-Editor-selections-Asia.html"}
