{"authors":["Associated Press"],"date_download":"2018-10-22 23:15:29","date_modify":"2018-10-22 23:15:29","date_publish":"2016-01-11 05:08:02","description":"The world's most-wanted drug trafficker was made to face the press, again. It was the second re-capture of Joaquin \"El Chapo\" Guzman in Mexico, after escapin...","filename":"data/vaneerConsumption/PICTUREDEditorselectionsfromLatinAmerica.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:d8916c5c7ea24aa79893a06800311764-56CX32zFKLb7123928b84ca96ab2-759_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393392_PICTURED-Editor-selections-Latin-America_1540250129.html","title":"PICTURED: Editor selections from Latin America","title_page":"PICTURED: Editor selections from Latin America | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PICTURED: Editor selections from Latin America\nThe world's most-wanted drug trafficker was made to face the press, again. It was the second re-capture of Joaquin \"El Chapo\" Guzman in Mexico, after escaping from a maximum security prison last year. Days before, a Mexican mayor took office only to be shot at her home the next day.\nBolivia welcomed Dakar Rally racers to their Uyuni Salt Flats, where a spectator was killed as a race car plowed over him.\nGuatemala's former military officers were taken to court for alleged crimes against humanity committed during their nation's civil war. Meanwhile, Guatemala's Volcano of Fire erupted in dramatic fashion.\nIn this Friday, Jan. 8, 2016 photo, Joaquin \"El Chapo\" Guzman is made to face the press as he's escorted to a helicopter in handcuffs by soldiers and marines at a federal hangar in Mexico City. Guzman's second prison escape in 2015 from a top security prison though a tunnel had embarrassed President Enrique Pena Nieto and made his capture a national priority. (AP Photo/Eduardo Verdugo)\nVenezuela's newly elected National Assembly, now dominated by the opposition, took their seats amid dueling street demonstrations and Brazilians once again protested bus fare hikes.\nEcuador held its \"Diablada\" festival, mixing pre-colonial with Catholic traditions and celebrating the clash of good and evil.\nCubans marked the anniversary of the original street party that greeted a triumphant Fidel Castro and his rebel army after toppling dictator Fulgencio Batista.\n___\nThis gallery was curated by photo editor Leslie Mazoch in Mexico City.\n___\nAssociated Press photographers and photo editors on Twitter: http://apne.ws/150o6jo\nIn this Saturday, Jan. 9, 2016 photo, KTM motorcycle driver Matthias Walkner, of Austria, races during the seventh stage of the Dakar Rally between Uyuni, Bolivia and Salta, Argentina. The rally, running in Argentina and Bolivia, ends next Saturday in Rosario, Argentina. (AP Photo/Jorge Saenz)\nIn this Friday, Jan. 8, 2016 photo, former Army Colonel Carlos Humberto Rodriguez Lopez looks out his glass and gated cell during a court hearing in Guatemala City. Prosecutors arrested more than a dozen former military and government officials for alleged crimes against humanity committed during Guatemala's civil war. (AP Photo/Moises Castillo)\nIn this Monday, Jan. 4, 2016 photo, Mini driver Nani Roma, from Spain, is covered in dirt after completing the second stage of the Dakar Rally, between Villa Carlos Paz and Termas de Rio Hondo, Argentina. The rally, running in Argentina and Bolivia, ends next Saturday in Rosario, Argentina. (AP Photo/Jorge Saenz)\nIn this Tuesday, Jan. 5, 2016 photo, opposition supporters shout against soldiers at a checkpoint near the National Assembly in Caracas, Venezuela. The newly elected legislature, now dominated by opponents of the ruling party, was sworn in amid dueling street demonstrations. (AP Photo/Alejandro Cegarra)\nIn this Tuesday, Jan. 5, 2016 photo, a musician jokes around with a monkey mask as he waits for his group to begin their procession to downtown Pillaro, Ecuador for the \"Diablada\" festival. Diabladas are held annually in several Andean nations. They mix pre-colonial with Catholic traditions, celebrating the clash of good and evil. One popular explanation for the Pillaro version is that it began as a way for men to anonymously court women. (AP Photo/Dolores Ochoa)\nIn this Friday, Jan. 8, 2016 photo, a homeless man is woken up after a police officer dropped his motorcycle during clashes at a protest against bus fare hikes in Rio de Janeiro, Brazil. The march, which is taking place in other Brazilian capitals, began peacefully in downtown Rio de Janeiro but turned violent. (AP Photo/Felipe Dana)\nIn this Sunday, Jan. 3, 2016 photo, mourners carry the coffin of slain mayor of Temixco, Gisela Mota, to the cemetery in Pueblo Viejo, Mexico. Mota took office as mayor of the city of on Jan. 1 and was shot at her home on Jan. 2. The governor of the southern Mexican state of Morelos says the killing of the mayor was a warning by drug gangs, meant to convince other officials to reject state police control of local forces. (AP Photo/Tony Rivera)\nIn this Monday, Jan. 4, 2016 photo, the Volcano of Fire releases lava, seen from Escuintla, Guatemala. Guatemalan authorities are on alert after the country's Volcano of Fire erupted in dramatic fashion on Sunday. Officials are asking nearby communities to remain vigilant amid a state of yellow alert. In Spanish it's known as \"El Volcan del Fuego.\" (AP Photo/Moises Castillo)","url":"https://www.dailymail.co.uk/wires/ap/article-3393392/PICTURED-Editor-selections-Latin-America.html"}
