{"authors":["Associated Press"],"date_download":"2018-10-23 04:47:00","date_modify":"2018-10-23 04:47:00","date_publish":"2016-01-11 17:59:03","description":"David Bowie was a space-age star with a global impact. As news spread of his death, fans gathered and left flowers Monday outside his New York apartment buil...","filename":"data/vaneerConsumption/PICTUREDFansgathertorememberDavidBowie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:f6aae25233f84eaa8cbf3f79ff22e3e5-3WAQP5SaQH704788ebcf7e18ca80-911_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394309_PICTURED-Fans-gather-remember-David-Bowie_1540270020.html","title":"PICTURED: Fans gather to remember David Bowie","title_page":"PICTURED: Fans gather to remember David Bowie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PICTURED: Fans gather to remember David Bowie\nDavid Bowie was a space-age star with a global impact.\nAs news spread of his death, fans gathered and left flowers Monday outside his New York apartment building, at the nondescript Berlin apartment block where he once lived and near a mural in the London neighborhood where he was born.\nThere were candles at his star on the Hollywood Walk of Fame and tears at a museum in The Netherlands where an exhibition is examining Bowie's legacy in music, fashion and design. Few rock musicians have had a wider or deeper influence.\nFan Rosie Lowery wearing Bowie style make up talks to the media beside tributes placed next to a mural of British singer David Bowie by artist Jimmy C in Brixton, south London, Monday, Jan. 11, 2016. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday aged 69. He was born in Brixton. (AP Photo/Matt Dunham)\nSome of the fans were young, many were middle-aged — and almost all remembered the impact Bowie had had on them as teenagers, helping them to feel less like outsiders, less alone.\nRosie Lowery, 21, came to the Bowie mural in London's Brixton with the red-and-blue slash of Aladdin Sane painted on her face.\nHer 59-year-old father Roland Lowery remembered Bowie in the 1970s singing the track \"Sorrow,\" which begins: \"With your long blond hair and your eyes of blue...\" Lowery said: \"When I was 15 or 16 I had long blond hair and eyes of blue, and I thought he was singing about me.\"\nBowie's gift was to convince millions of people around the world that he was singing about them, too.\n___\nFollow AP photographers and photo editors on Twitter: http://apne.ws/1ox8vgG\nA woman with a tattoo on her back looks at a mural of British singer David Bowie by artist Jimmy C in Brixton, south London, Monday, Jan. 11, 2016. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday aged 69. He was born in Brixton. (AP Photo/Matt Dunham)\nA man places letters spelling out a tribute to British singer David Bowie at the Brixton Academy music venue, in Brixton, south London, Monday, Jan. 11, 2016. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday aged 69. He was born in Brixton. (AP Photo/Matt Dunham)\nA woman looks at shirts with a portrait of David Bowie, in London, Monday, Jan. 11, 2016. David Bowie, the other-worldly musician who broke pop and rock boundaries with creative musicianship, nonconformity, striking visuals and a genre-bending persona and christened Ziggy Stardust, died of cancer Sunday. He was 69 and had just released a new album.(AP Photo/Frank Augstein)\nFlowers are placed on the floor where the Ziggy Stardust album cover of David Bowie was photographed in London, Monday, Jan. 11, 2016. David Bowie, the other-worldly musician who broke pop and rock boundaries with creative musicianship, nonconformity, striking visuals and a genre-bending persona and christened Ziggy Stardust, died of cancer Sunday. He was 69 and had just released a new album.(AP Photo/Frank Augstein)\nA mourner leaves a candle at a makeshift memorial at David Bowie's star on the Hollywood Walk of Fame in Los Angeles, Monday, Jan. 11, 2016. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday. He was 69 and had just released a new album. (AP Photo/Nick Ut)\nDavid Bowie fan Mark Lundeen poses for photos next to bouquets of flowers in front of the building where David Bowie had his New York apartment, Monday, Jan. 11, 2016. Lundeen is making a face with his hands reminiscent of Bowie. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday. He was 69. (AP Photo/Mark Lennihan)\nMen stand with guitars backdropped by a spelt out tribute to British singer David Bowie at the Ritzy cinema, in Brixton, south London, Monday, Jan. 11, 2016. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday aged 69. He was born in Brixton. (AP Photo/Matt Dunham)\nA woman and child place a flower alongside other tributes beside a mural of British singer David Bowie by artist Jimmy C in Brixton, south London, Monday, Jan. 11, 2016. David Bowie, the iconic and shape-shifting British singer whose illustrious career lasted five decade with hits like \"Fame,\" ''Heroes\" and \"Let's Dance,\" died Sunday after a battle with cancer. He was 69. The singer, who was born David Jones at the family home in the Brixton area of London, came of age in the glam rock era of the early 1970s. (AP Photo/Matt Dunham)\nVisitors take an audio tour at the Groninger Museum which hosts the \"DAVID BOWIE is' exhibit, in Groningen, northern Netherlands, Monday, Jan. 11, 2016. The museum is normally closed on Mondays but opened its doors to allow people to sign a book of condolences for the deceased popstar and visit the Bowie exhibit which runs till March 13, 2016. (AP Photo/Peter Dejong)\nA woman holds a tablet with a David Bowie cover next to a mural of him by artist Jimmy C in Brixton, south London, Monday, Jan. 11, 2016. Bowie, the other-worldly musician who broke pop and rock boundaries with his creative musicianship, nonconformity, striking visuals and a genre-spanning persona he christened Ziggy Stardust, died of cancer Sunday aged 69. He was born in Brixton. (AP Photo/Matt Dunham)","url":"https://www.dailymail.co.uk/wires/ap/article-3394309/PICTURED-Fans-gather-remember-David-Bowie.html"}
