{"authors":["Katie Louise Davies For Mailonline"],"date_download":"2018-10-23 03:03:27","date_modify":"2018-10-23 03:03:27","date_publish":"2016-01-28 18:17:39","description":"An image of what appears to be a man snorting drugs was posted on Scotland's Club de Mar's Facebook page after New Year's Eve. Club bosses have hit back at the photo - saying it caused slurs online.","filename":"data/vaneerConsumption/Picturewhichviewersbelievedshowedclubbersnortingdrugsisinfactamanwithaglass.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACA6A600000578-0-image-a-50_1454004913747.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421399_Picture-internet-hit-viewers-believed-showed-clubber-openly-snorting-drugs-fact-man-glass-says-nightcub-boss_1540263807.html","title":"Picture which viewers believed showed clubber snorting drugs is in fact a man with a glass","title_page":"Picture which viewers believed showed clubber  snorting drugs is in fact a man with a glass | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A picture of what appeared to be a young clubber openly snorting drugs from a table is in fact a man with a glass, says a nightclub boss.\nThe image appeared on Club de Mar nightclub's Facebook page following a New Year's Eve party before it became an internet hit.\nToday club boss Debbie Cairns hit back at the claims - saying that photograph has caused unnecessary slurs.\nThis picture of what appeared to be a young clubber openly snorting drugs from a table is in fact a man with a glass, says a nightclub boss\nThe picture was instantly removed from the club's website when the insinuations were made.\nMs Cairns, manager of the club in Ayr, Scotland, told the Daily Record: 'Things like this can be damaging and bring the town down.\n'In fact we have a stringent drugs policy and a picture like this gives totally the wrong impression.\n'When we blew the image up it is clear all it is is a reflection of a strip light onto a shot glass.'\nDebbie took a blown up version of the picture into the local newspaper the Ayrshire Post's offices in a bid to unveil the truth about the picture.\nShe told the Daily Record that the only person who was acting maliciously was the person who copied the circulated picture. She went on to say that the picture might have given people the wrong impression of what goes on in the club.","url":"https://www.dailymail.co.uk/news/article-3421399/Picture-internet-hit-viewers-believed-showed-clubber-openly-snorting-drugs-fact-man-glass-says-nightcub-boss.html"}
