{"authors":["David Wilkes For The Daily Mail"],"date_download":"2018-10-23 00:12:46","date_modify":"2018-10-23 00:12:46","date_publish":"2016-01-11 09:00:50","description":"The photograph of the youngster making the most of his jungle playground has just won the Wildlife Photographer of the Year’s People’s Choice Award, attracting more than half of the 20,000 votes.","filename":"data/vaneerConsumption/PictureofyounglangurmonkeywinsWildlifePhotographeroftheYearaward.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/3001A1F700000578-0-image-a-35_1452473418319.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393169_Swing-winning-Cheeky-langur-monkey-roaring-laughter-uses-two-adults-tails-playtime-lands-wildlife-photography-award_1540253566.html","title":"Picture of young langur monkey wins Wildlife Photographer of the Year award","title_page":"Picture of young langur monkey wins Wildlife Photographer of the Year award | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A cheeky little monkey stakes his claim to be king of the swingers as he dangles playfully from two grown-ups’ tails.\nThe young grey langur looks like he is roaring his head off with laughter as he enjoys his fun while the adults perch nonchalantly on the branch above.\nThe photograph of the youngster making the most of his jungle playground has just won the Wildlife Photographer of the Year’s People’s Choice Award, attracting more than half of the 20,000 votes.\nWhee! The young langur monkey enjoys his makeshift swing in the image that won the Wildlife Photographer of the Year’s People’s Choice Award. It was taken by photographer Thomas Vijayan in the Bandipur National Park in India and received more than half of the votes cast\n'Berries for the fieldfares': French photographer JoÎl Brunet captured this image showing a group of fieldfares gathering berries. The image is one of those on display at an exhibition at the Natural History Museum\nWarrior of the grassland: Anup Deodhar, an Indian photographer, captured this colourful fan-throated lizard. This image was one of the finalists in the Wildlife Photographer of the Year People's Choice Award\nIt was taken by Thomas Vijayan, who had travelled from his home in Canada to Bandipur National Park in the southern Indian state of Karnataka to photograph tigers.\nBut then he spotted these langurs basking and playing in the rays of evening light and noticed the little one lower itself down on the adults’ tails, using them to swing beneath.\nMr Vijayan said: ‘Big cats are my favourite subjects in photography. But on this particular day, when the safari was almost over with no sighting of any big cats, everyone was looking around hopefully.\n‘I saw a few langurs playing on a tree, and it struck me that there was a chance for a good photograph. While everyone else was waiting for the tigers, I came back with this mesmerising moment.’\nLangurs, also known as ‘leaf-eating monkeys’ because of their diet, grow to 31 inches tall and can have tails up to 42 inches long when adults.\nThey have prehensile tails - that is, tails that have adapted to be able to grasp or hold objects. Usually they use them to hang from branches to help them find and eat food in the trees rather than as a makeshift adventure playground for the kids.\nThe image will be showcased in London’s Natural History Museum’s Wildlife Photographer of the Year exhibition until it closes on 10 April 2016.\nA mother's courage: This image by Linc Gasking shows a mother Adelie penguin protecting a group of chicks from a southern giant petre","url":"https://www.dailymail.co.uk/news/article-3393169/Swing-winning-Cheeky-langur-monkey-roaring-laughter-uses-two-adults-tails-playtime-lands-wildlife-photography-award.html"}
