{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:19:51","date_modify":"2018-10-23 03:19:51","date_publish":"2016-01-29 18:16:22","description":"The 28-year-old former bantamweight champion is pictured posing nude on a beach in the Caribbean. Previous images from the shoot saw her modeling a black and white body-paint bathing suit.","filename":"data/vaneerConsumption/PICTUREDRondaRouseyposesnakedAGAINshowingoffatonedphysiqueinyetanotherpaintedonbathingsuitinstunningnewimagesfromSportsIllustratedshoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4B94600000578-0-image-a-34_1454091243612.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3423262_PICTURED-Ronda-Rousey-poses-naked-showing-toned-physique-painted-bathing-suit-stunning-new-images-Sports-Illustrated-shoot_1540264791.html","title":"PICTURED: Ronda Rousey poses naked AGAIN, showing off a toned physique in yet another painted-on bathing suit in stunning new images from Sports Illustrated shoot","title_page":"PICTURED: Ronda Rousey poses naked AGAIN, showing off a toned physique in yet another painted-on bathing suit in stunning new images from Sports Illustrated shoot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Travis and Ronda were pictured at an airport in the Bahamas on Thursday having enjoyed a quick getaway together\nRonda Rousey is proving once again what a knockout she is, after posing up a storm in a new set of nude images from her hotly-anticipated Sports Illustrated shoot.\nThe 28-year-old Californian, who appeared in last year's Sports Illustrated Swimsuit Edition, and is set to make her return again this year, was pictured on the beach during her Caribbean shoot wearing nothing but a colorful painted-on bathing suit.\nAppearing totally relaxed, despite her lack of clothing, the UFC star can be seen frolicking in the waves, whipping her hair back and forth in the breeze, and striking several saucy poses for the photographer as he snapped away.\nStrike a pose: Ronda Rousey has been pictured modeling yet another painted-on bathing suit from her Sports Illustrated shoot in the Caribbean\nCheeky! In the images, the 28-year-old can be seen posing up a storm, flicking her hair back and forth, and at one point turning around to show off her pert behind\nWork it: Proving that she can keep up with the most experienced of catwalk stars, the UFC fighter looked relaxed and happy as she modeled in the nude shoot\nBeach babe: Popping her hands above her head, Ronda can be seen running her hands through her wavy blonde locks\nIt should perhaps come as no surprise to see how at-ease Ronda appears throughout the naked shoot, as it is not the first time that the former UFC champion has been photographed in the nude.\nEarlier this month, official and behind-the-scenes paparazzi photos taken during the Sports Illustrated photoshoot showed the Californian again posing in nothing but body paint - although on this occasion, it was black and white, rather than the colored creation she models in the latest images.\nBoth sets of snaps were taken on Petite Martinique island off the coast of Grenada, with the first set showing the blonde latest set showing the trim and toned blonde sitting on a rock, while the second set show her flaunting her figure on the beach.\nThe latest series of snaps also appear show Ronda taking some direction from the Sports Illustrated team, with several images showing her lifting up her arms in the air as she looked back at the team behind her, seemingly taking some advice on her poses.\nPuts your hands up! At one point, Ronda appeared to be looking back at the team of assistants behind her for some direction on her poses\nGet low: At one point Ronda knelt down in the sand, looking away from the camera as the photographer eagerly snapped away in front of her\nFree as a bird: Ronda threw her arms behind her for this shot, while offering a sultry stare to the camera\nAn outtake? It seems the wind got the better of Ronda at one point, as she took up something of an awkward stance mid-way through her poses\nHip pop: Throughout the shoot, Ronda's distinctive ankle tattoos were on display, often appearing just above the waves lapping around her feet\nAt one point, the UFC fighter turned her back to the camera, showing off a very toned derriere in her painted bathing suit, which was designed to look like a high-rise swimsuit, exposing plenty of Ronda's rear end.\nRonda's distinctive ankle tattoos were also on full display throughout the shoot, appearing just above the small waves lapping around her feet; the mixed martial arts star has inkings on both ankles, and on both of her wrists - a telling feature which actually gave away the fact that she would be appearing in this year's Swimsuit Edition.\nEarlier this month, the star was identified by beady-eyed social media users in an Instagram post shared by Sports Illustrated's Swimsuit Edition editor MJ Day, who had thought that she was sharing a snap of an 'anonymous' model's derriere - not realizing that the clearly-visible wrist tattoos in the image gave away Ronda's identity.\nTaken during the same exotic shoot as the latest series of snaps, MJ's behind-the-scenes photograph showed a woman's posterior in a grey and black patterned swimsuit body paint design, alongside the caption: '#instabooty if #2016 keeps going like this then I'm going to be one happy happy girl! #bootypaint #siswimsuit.'\nCasual lean: Clearly confident in the fact that her painted-on swimsuit would withstand the ocean, Ronda lay down in the sea to pose for another shot\nGetting comfy? It looked as though it took Ronda some time to adjust to her new posing position\nTrim and tanned: Ronda looked to be enjoying the sunshine during the Caribbean shoot, despite being forced to squint at times because of the bright rays, and was showing off an enviable tan\nThigh's the limit! The shoot provided Ronda with the perfect opportunity to show off her lean physique, and muscular legs, which are the result of her strict UFC training\nHappy and relaxed: Ensuring she offered the photographer plenty to work with, Ronda switched up her sultry stare for a saucy smile in some shots\nAnd due to the impressive back and leg muscles on display, alongside two giveaway wrist tattoos, Ronda's identity as the model on show was soon revealed, prompting the magazine to confirm her appearance in the eagerly-awaited annual issue with their own official behind-the-scenes shots from the shoot.\nThe publication also revealed that the inspiration for the design of Ronda's first painted-on swimsuit came from a swimsuit created by Australian brand We Are Handsome, a favorite among celebrities like Beyonce and Rihanna.\nRonda's latest suit also appears to have been modeled on one of the beachwear brand's patterned designs, and has the same low-cut shape, exposing plenty of Ronda's tanned skin.\nThe Caribbean shoot, which is thought to have taken place earlier this month, appears to have just been the start of another jet-setting year for Ronda.\nDown time: In between shoots, Ronda was able to relax her face a bit more, and quickly dropped the sultry expression she had been offering to the camera\n(Swim)suits you! While many models might balk at the idea of posing virtually naked, the painted-on bathing suit actually flattered Ronda's toned figure\nQuite the crowd: Ronda had a sizable Sports Illustrated entourage on-hand, no doubt to ensure that every aspect of the shoot went as smoothly as possible\nRepeat appearance: Ronda appeared in last year's Swimsuit Edition too, however in that shoot she wore an actual bathing suit, rather than just a painted one\nCarefree: While not posing in front of the cameras, Ronda seemed less concerned with maintaining a picture-perfect stance\nOn Thursday, she was pictured together with her boyfriend Travis Browne in the Bahamas, after the pair enjoyed a quick getaway together.\nThe mixed martial arts fighter held hands with her 33-year-old beau as they arrived at an airport on Thursday after their short-lived beachside vacation.\nHowever, the rumored engagement ring that Ronda wore to host Saturday Night Live last Saturday was nowhere in sight, which may put an end to the speculation that Travis had proposed to the former UFC bantamweight champion.\nSwept away! The wind appeared to get the better of Ronda at certain points throughout the shoot, blowing her hair around behind her\nSneak peek: Perhaps eager to ensure that she was putting on her best performance, Ronda took the chance to check out some of her photographs with the Sports Illustrated team\nQuick close-up: Shielding her eyes from the glaring sun, Ronda peered at the screen displaying her snaps\nGetting warm! At the end of the shoot, Ronda wrapped up in a cozy robe\nA job well done! At the end of the shoot, several members of the crew appeared to raise a glass in honor of its successful completion\nThe couple dressed casually for their trip to the airport. While Travis donned a simple black V-neck T-shirt, shorts cut off at the knee, and black flipflops, Ronda looked relaxed in a sleeveless gray tank and baggy gray sweatpants with letters splashed up and down the legs.\nThe blond beauty topped off her ensemble with black sunglasses and high top sneakers, and she appeared to be holding a purple pillow for the flight.\nRonda and Travis left New York on Monday, just as a for the Ultimate Fighting Championship, the Mixed Martial Arts organization for which both fight, denied that they were engaged.\n'The rumors are not true,' the rep told People magazine, adding that the ring which sparked the reports was a prop for Ronda's SNL gig.\nTotally comfortable: Being naked in front of such a large group of people didn't seem to bother Ronda at all\nGuessing game: The magazine accidentally revealed that Ronda would be starring in the upcoming Swimsuit Edition when editor MJ Day shared this image, which clearly showed the UFC fighter's wrist tattoos\nThe jig is up! Sports Illustrated soon confirmed Ronda's inclusion in the publication with their own set of behind-the-scenes images from her shoot\nLounging around: Much like the most recent snaps, the images featured Ronda lying across the sand\nLast weekend, viewers spotted the rectangular diamond ring on Ronda's finger during her SNL debut, causing a social media firestorm about whether or not Travis had proposed.\nTravis' estranged wife Jenna Renee Webb had also seen the ring and took to Instagram to share a photo of Ronda wearing the unique ring, writing: 'Is Ronda Rousey wearing a promise ring? As in ''I promise not to hit you like my current wife'' ring?'\nThe fitness model, who accused Travis of assaulting in her July, shared photos of herself with a black eye, bruised knee, and black-and-blue arms - all of which she claimed where the result of her husband's physical abuse.\nJenna Renee also revealed that the alleged abuse was what prompted her to finally leave Travis.\nHolding on: Ronda Rousey and her boyfriend Travis Browne are pictured at an airport in the Bahamas on Thursday\nStill single: Ronda and Travis left New York for the Bahamas on Monday, just as a for the Ultimate Fighting Championship, the Mixed Martial Arts organization for which both fight, denied that they were engaged\nAfter Ronda's SNL appearance, Jenna Renee used the photo of the ring to congratulate Ronda and Travis for being open about their relationship, but she quickly reminded the world that she and her estranged husband are still married.\n'When he hits you across your pretty face don't worry, I'll be right here to say #IToldYouSo I wish you both the best #yourewelcome #hyprocrite #thankyou #DNB,' she wrote.\nHowever, Travis has denied that he has ever been physically violent with his wife, and a UFC commissioned third-party investigation cleared him of the claims. There has been no police investigation.","url":"https://www.dailymail.co.uk/femail/article-3423262/PICTURED-Ronda-Rousey-poses-naked-showing-toned-physique-painted-bathing-suit-stunning-new-images-Sports-Illustrated-shoot.html"}
