{"authors":["Piers Morgan For Mailonline"],"date_download":"2018-10-23 01:40:06","date_modify":"2018-10-23 01:40:06","date_publish":"2016-01-11 12:50:29","description":"I never thought David Bowie would die. He carried with him such an aura of invincibility that if anyone could cheat the passage of time I assumed it would be The Thin White Duke.","filename":"data/vaneerConsumption/PIERSMORGANIdontknowwhereDavidBowieisgoingfromhere.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A23F000000578-0-image-a-116_1452516163259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393840_PIERS-MORGAN-don-t-know-Starman-Bowie-going-genius-chameleon-said-won-t-boring_1540258806.html","title":"PIERS MORGAN: I don't know where David Bowie is going from here","title_page":"PIERS MORGAN: I don't know where David Bowie is going from here | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"I never thought David Bowie would die.\nOh, I know we all do eventually, but he carried with him such an aura of invincibility that if anyone could cheat the passage of time I assumed it would be The Thin White Duke.\nThis brilliantly talented, outrageously creative glittering chameleon of a man; a master of reinvention who smashed down so many barriers in music, fashion, film and art.\nHe remained so resolutely, absurdly cool right to the end.\nStarman: David Bowie - seen left on the cover of Aladdin Sane and right performing in 1999 - remained resolutely, absurdly cool right to the end\nWho else but Bowie could die in the very week he releases a new album, Blackstar, with a dominant theme of death?\nThis was no accident.\nHis long-time friend and producer Tony Visconti wrote on Facebook: ‘His death was no different from his life, a work of art. He made Blackstar for us, a parting gift.’\nI felt the same palpable sense of shock and loss this morning that I felt when John Lennon died.\nBowie and Lennon were to me the greatest British rock stars of them all; a pair of uncompromising, ferociously charismatic and singularly individual characters who didn’t give a damn what people thought of them.\n‘Fame can take interesting men and thrust mediocrity upon them,’ Bowie once opined.\nFor him, as with Lennon, the opposite was true.\nBowie became ever more fascinating through the years because he knew how to play the fame game better than anyone else.\nNo accident: Bowie died in the week he released an album whose dominant theme is death; pictured is the haunting music video for the song Lazarus, released on Thursday\nLess is more was his mantra.\nHe rarely went to glitzy parties or premieres, he didn’t strut and preen for the paparazzi, he shunned expansive interviews about life and the universe.\nInstead, he slowly retreated into the protective streets of New York, where fame is reluctantly acknowledged but not celebrated in the hyperactive way of a place like Los Angeles.\nBowie wasn’t so much a recluse as a man who guarded his privacy with the tightness of an agitated boa constrictor.\nWhat mattered to him most was his art, in all its guises.\nCharismatic: Like John Lennon, Bowie - pictured dressed as Ziggy Stardust - never cared what anyone else thought of him\nHe listened, he read, he viewed, he engaged, and as a result he constantly evolved.\nHis last two albums have been heralded as two of his best. How many rock legends in history can lay claim to that?\nI interviewed Bowie several times as a young showbusiness reporter.\nThe first, and most memorable, was in November, 1991, the day after a fan had nearly blinded him with a carton of his beloved Marlboro cigarettes – fans would regularly throw them at him on stage – during a concert at London’s Brixton Academy, a few streets from where he was born.\nI door-stepped his hotel for The Sun newspaper and eventually out came the great man sporting an eye-patch and a big grin.\n‘It’s time I gave up bloody cigarettes!’ he laughed.\nThen he told me not to bother asking about his silly injury because he had something far more interesting to talk about.\n‘OK, ‘ I said, ‘what is it?’\n‘I just got engaged to Iman…’\nBowie then stood on the pavement for 30 minutes and gave this massively over-excited young 26-year-old reporter a whacking great big scoop about the secret engagement to his Somalian-born supermodel girlfriend.\nHe wasn’t a tabloid creature, of course he wasn’t. He was David Bowie for god’s sake.\nBut nor was he a snob who thought the ordinary working man and woman were somehow beneath him.\nHis mother was a waitress, his father worked for the children’s home Barnardo’s. They were working class people themselves.\nBowie understood the power of mass communication and he liked to control his message.\nHe also understood the magical power of love.\nRomantic: Bowie proposed to his second wife Iman when they were having dinner on a boat on the Seine\n‘I’m a hopeless, incurable romantic,’ he told me that day.\n‘I decided the proposal had to be in Paris, on a boat down the Seine, over dinner, and I knew I had to sing to her to express how I felt in the best way I can.’\nThat way was through the adapted words of Doris Day’s hit, April In Paris, with its lyrics including: ‘I never knew my heart could sing, never missed a warm embrace, until April in Paris, whom can I run to, what have you done to my heart?’\nBowie chuckled as he relived the moment.\n‘Luckily, it worked. Everything was perfect. We were eating dinner by candelight as the boat drifted down the river, and I just stood up and started singing October in Paris. Then I went on bended knee, plucked a rose from the table’s flower arrangement and said: \"Iman, will you marry me?\"\n‘She said yes then nearly fell into the water from shock!’\nI asked him why he was so in love with Iman.\n‘We’ve both been married and divorced, we both have children, and we both have shared so many similar experiences. I am ecstatically happy and we want to spend the rest of our lives together.’\nThat they did.\nIman was at his bedside in New York yesterday when her beloved husband passed away.\nTheirs was a great, enduring love story.\nOthers far better qualified than me will pay proper tribute to Bowie’s musical genius.\nI just know, like so many of my generation, that at every stage of my life, Bowie’s been lurking somewhere in the background – pushing and probing at my consciousness, challenging me to confront convention.\nHe was a Space Oddity, a Hero, a Rebel Rebel, a Starman who preached about Modern Love, Fame, China Girls, Jean Genie and Absolute Beginners.\nWord of mouth: Bowie, pictured on stage in Switzerland in 2002, admitted that he could not rely on record sales or chart positions to maintain his fame\nBecause he was so self-aware, Bowie knew that his relevance depended on something less tangible than new record sales or chart positions.\n‘I’m well past the age where I’m acceptable,’ he explained, ‘You get to a certain age and you are forbidden access. You’re not going to get the kind of coverage that you would like in music magazines, you’re not going to get played on radio and you’re not going to get played on television. I have to survive on word of mouth.’\nThat word of mouth was so globally cavernous that Bowie never lost his credibility or appeal.\nAnd now with his death, of course, the world’s music magazines will once again be dominated by his image, and the world’s radio and television airwaves dominated by his music.\n‘I don’t know where I’m going from here,’ he once declared, ‘but I promise it won’t be boring.’\nHe was right about that, because David Bowie was never, and could never be boring.\nHe dared us all to be different.\nAs I finished writing this column, a man came up to me in the café where I was sitting.\n‘Excuse me for intruding, but what was your favourite Bowie song?’ he asked.\n‘Starman,’ I replied, after some thought.\n‘I remember seeing him appear on TV to sing that,’ said my new friend, ‘with his red hair and make-up, and his arm round a bloke, and we all thought, \"What the bloody hell’s going on here?\"'\nI laughed.\nHe continued. ‘The thing about Bowie is not just that we all wanted to be like him. We all WERE him to a certain degree in the sense that all teenagers are a bit weird. He just made it OK to be a bit weird.’\nYes he did.","url":"https://www.dailymail.co.uk/news/article-3393840/PIERS-MORGAN-don-t-know-Starman-Bowie-going-genius-chameleon-said-won-t-boring.html"}
