{"authors":["Hannah Mellin For Mailonline"],"date_download":"2018-10-23 01:22:50","date_modify":"2018-10-23 01:22:50","date_publish":"2017-03-10 09:19:17","description":"The actor, 63, looked as though he hadn't aged a day since his 007 heyday as he enjoyed a low-key stroll in Beverly Hills on Thursday.","filename":"data/vaneerConsumption/PierceBrosnanshowsofftimelessgoodlooksinLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21E5F800000578-0-image-a-16_1489137977076.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300274_Dapper-Pierce-Bronson-63-shows-timeless-good-looks_1540257770.html","title":"Pierce Brosnan shows off timeless good looks in LA","title_page":"Pierce Brosnan shows off timeless good looks in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's known for being one of the longest-serving James Bond actors, starring in Golden Eye, Die Another Day and The World Is Not Enough.\nAnd dapper Pierce Brosnan, 63, looked as though he hadn't aged a day since his 007 heyday as he enjoyed a low-key stroll in Beverly Hills on Thursday.\nThe actor showed off his fine form in a crisp white linen shirt, cool grey tailored trousers and brown suede desert boots.\nScroll down for video\nDapper dude: Pierce Brosnan, 63, looked as though he hadn't aged a day since his 007 heyday as he enjoyed a low-key stroll in Beverly Hills on Thursday\nLike a fine wine: The star known for being one of the longest-serving James Bond actors, starring in Golden Eye, Die Another Day and The World Is Not Enough\nThe star kept his salt and pepper hair neatly coiffed and complemented his smart outfit with an expensive watch and dark wayfarer sunglasses with a tortoiseshell rim.\nPierce even kept a few buttons on his shirt undone, exposing his chest hair as he ran errands in Los Angeles.\nThe Dante's Peak star looked full of bravado as he swaggered down the street and interacted with passers by.\nThe Irish producer seemed to be in good spirits and flashed his best charming smile for his day of running errands in the Californian sunshine.\nGolden smile: The actor showed off his fine form in a crisp white linen shirt\nHandsome: The producer kept his salt and pepper hair neatly coiffed and complemented his smart outfit with an expensive watch and dark wayfarer sunglasses with a tortoiseshell rim\nIt was recently revealed that fellow Bond actor Daniel Craig had overtaken Pierce as the second longest-serving James Bond of all time - starring as the secret-service spy for 4,147 days.\nThe British actor, who is yet to confirm whether he will star in another 007 film, surpassed Brosnan’s time as the secret service spy, which lasted for four films and 4,146 days.\nRoger Moore currently holds the top spot, playing Bond for seven films and 5,118 days, and it's unlikely that anyone else will be able to surpass him.\nNo longer second best: Daniel Craig recently overtook Pierce as the second longest-serving James Bond of all time\nPierce recently took on the challenge of growing a beard for AMC's new western drama series, The Son, where he plays rugged oil tycoon Eli McCullough.\nTalking to Entertainment Tonight about his willingness to take on his character's own stunts, Pierce revealed that he was rather fond of his brand new beard too.\n'The beard progressively grows throughout the piece,' he explained.\n'So by episode ten, it's a fairly big old piece of shrubbery around my face. I grew very fond of the beard, and so did my wife [Keely Shaye Smith].'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300274/Dapper-Pierce-Bronson-63-shows-timeless-good-looks.html"}
