{"authors":["The Associated Press"],"date_download":"2018-10-30 14:35:15","date_modify":"2018-10-30 14:35:15","date_publish":"2018-10-30 01:40:00","description":"Ben Simmons had 21 points, 12 rebounds and nine assists and the Philadelphia 76ers flashed a little...","filename":"data/vaneerConsumption/PiercelosesinreturntoPhillyasHawksfall11392.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_State_Online_Georgia/2018/10/30/Images/18d78d4f4a78473a8025f58ee54ea741.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_basketball_pierce-lo_edad2cc13bd063927dd084bea6f8cc92__1540910115.html","title":"Pierce loses in return to Philly as Hawks fall 113-92","title_page":"Atlanta Hawks: Pierce loses in return to Philly as Hawks fall 113-92","title_rss":"NULL","source_domain":"ajc.com","text":"Ben Simmons had 21 points, 12 rebounds and nine assists and the Philadelphia 76ers flashed a little of last year’s playoff form in a 113-92 win over the Atlanta Hawks on Monday night.\nWithout a major roster addition, the Sixers had played little like a team that won 52 games and a playoff round a year ago. Simmons and Joel Embiid have been solid and are making early cases for All-Star berths. But Philly’s distinguished duo had little help and the Sixers had won their last two games by one and two points, respectively, and needed this win just to move above .500 (4-3).\nHere’s how much expectations have soared in Philly: the Sixers were booed by fans, who showed nothing but love in the early day of “The Process,” as they trudged off the court at the break tied 47-all.\nThey got some help in the third from the oft-maligned Markelle Fultz. Fultz, desperately trying to join Simmons and Embiid as a cornerstone trio, had a sweet stretch during which he buried an open 3, crushed a one-handed dunk in transition and had an assist on an Embiid jumper for a 78-60 lead.\nFultz had season-highs with seven baskets (on 16 attempts) and 16 points in 23 minutes.\nThat was enough to help send Atlanta to its second straight loss. Kent Bazemore led the Hawks with 18 points.\nThe Sixers aren’t much more than Embiid and Simmons and some needed 3s from JJ Redick. The Hawks sagged off Fultz most of the game and dared him to shoot jumpers. Dario Saric, one of the early parts of “The Process,” has seemingly lost his shot, much the same way Fultz did. Saric missed all seven shots in the first half (including four 3s) and finished 1 of 9 overall for four points.\nTIP-INS\n• Hawks: The Hawks were outrebounded 64-47. ... Hit just eight 3s. ... Shot 37 percent from the floor.\n• ﻿76ers: F Wilson Chandler has yet to play this season with an injured left hamstring. “He is coming along,” coach Brett Brown said. “What that means on when he returns, I do not know. We're not that far off.” ... Movie director M. Night Shyamalan was at the game.\nWELCOME BACK\nAtlanta coach Lloyd Pierce made a homecoming of sorts after spending five years on Brown’s staff with the Sixers. Pierce said he owed Brown so much for helping him become a head coach.\n“He’s passionate. He’s got energy all the time,” Pierce said. “He cares about the players.”\nPierce said he’s kept in touch with Brown and former players who have wished him well in his new gig.\n“These guys are happy I’m in the position that I’m in,” Pierce said.\nBrown said having a coaching tree was one of the responsibilities of the job.\nFAMILIAR FACES\nHawks rookie Omari Spellman is coming off a national championship at Villanova and third-year forward DeAndre’ Bembry from Saint Joseph’s both had plenty of local fans in the house. Pierce said Bembry is playing with confidence after missing chunks of his first two seasons with injuries.\n“He’s happy he’s getting an opportunity to play,” Pierce said.\nPierce said Spellman was making an impact, even with spotty minutes.\nBut not every hoops fan in Philly is part of Nova Nation. One fan yelled out, “Spellman, you’re a D-League player!”\nUP NEXT\nHawks: Play Tuesday at Cleveland.\n76ers: Play Tuesday at Toronto.","url":"https://www.ajc.com/sports/basketball/pierce-loses-return-philly-hawks-fall-sixers/fMzCsBLikkjaJjwE1ZCSjN/"}
