{"authors":["Piers Morgan For Mailonline"],"date_download":"2018-10-23 04:34:35","date_modify":"2018-10-23 04:34:35","date_publish":"2017-03-10 14:48:18","description":"That Barack Obama’s a lovely guy, right? The Trump antithesis. Handsome, intelligent, charming, witty; he can sing, dance, shoot hoops, and make speeches that stir the soul. Not so fast.","filename":"data/vaneerConsumption/PIERSMORGANObamadeportedmillionskilledthousands.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E23708300000578-0-image-a-23_1489157021084.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301466_PIERS-MORGAN-Obama-deported-millions-killed-thousands_1540269275.html","title":"PIERS MORGAN: Obama deported millions & killed thousands","title_page":"PIERS MORGAN: Obama deported millions & killed thousands | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"That Barack Obama’s a lovely guy, right?\nHandsome, intelligent, eloquent, charming, witty; he can sing, dance, shoot hoops, and make speeches that stir the soul.\nOh, and he’s a great husband, father, son and friend.\nIn fact, to many around the world, President Perfect is the complete antithesis of his replacement Donald Trump.\nThat’s why millions have marched to protest against the current POTUS, who they brand the ‘new Hitler.’\nThat Barack Obama’s a lovely guy, right? He's a great husband, father, son and friend\nHandsome (did you see that cool leather jacket this week?) charming, witty; he can sing, dance, shoot hoops, and make speeches that stir the soul\nWhy, they squeal with rage, can’t ‘Monster’ Trump just be more like ‘Saint’ Obama?\nHmmm.\nForgive me if I don’t join the ecstatic global race to canonize Mr Obama quite so enthusiastically.\nFor beneath his ever-smiley beatific halo lies a rather different, far murkier reality.\nMy favourite question for the anti-Trump brigade is this: ‘How many people did Barack Obama deport from America during his eight years as President?’\nMost people guess 5,000, maybe 10,000. Even those with a good knowledge of how the real world of US immigration policy works rarely respond with a number higher than around 500,000.\nIn fact, Obama deported nearly THREE MILLION people.\nThat is the most deported by any president, ever.\nHis appalled critics even dubbed him ‘Deporter-in-Chief.’\nWhen challenged, Obama loved to pretend that he was only deporting ‘criminals’.\nThe truth is very different. Over half of all immigrants deported under Obama had no criminal convictions. Many others were slung out for minor offences involving traffic violations or marijuana possession.\nThe truth about Obama's presidency? He deported three million people. He also was a hawk, served two terms of war and killed thousands of people with drones - ordering 26,171 bombs dropped and they all targeted Muslims\nObama also loved to make out that when it came to killing people, he was a very reluctant dove; a man of peace, not war.\nAgain, the truth is the complete opposite.\nHe was at war longer than any president in US history, and is the only president to have served two whole terms with America at war.\nBy contrast, the much-maligned Jimmy Carter never ordered a US military bullet to be fired in anger during his four-year tenure.\nObama was a hawk, alright, and a lethal one.\nRecently released figures revealed that in 2016, US special operations were active in 70% of the world’s nations, or 138 countries. This was a 130% increase over Bush’s administration.\nIn the same year, Obama ordered his military to drop at least 26,171 bombs. That’s 72 a day, or three every hour.\nThey rained relentlessly down on seven majority-Muslim countries – Syria, Iraq, Afghanistan, Libya, Yemen, Somalia and Pakistan.\nYes, Bomber Barack deliberately targeted Muslims, folks.\nOnly he wasn’t exposing them to ‘extreme vetting’ as Trump wants to do, he was killing them.\nObama ordered 10 times more drone strikes than George W. Bush, a mind-blowing statistic.\nYet when he left office, his administration laughably tried to claim only 117 civilians died in all this bombing.\nThat was an obvious lie.\nIndependent assessors put the estimated death toll massively higher, in the 1000s.\nSo Obama killed a lot of innocent people but prefers us not to know about it.\nHe also allowed a lot of other innocent people to die in Syria by choking when President Assad crossed Obama’s chemical weapons ‘red line’.\nThat empowered both Assad and Vladimir Putin, and weakened America.\nThis wasn’t the only time Obama said one thing and did another.\nHis lofty moral principles were never more startlingly exposed than with his broken election pledge in 2008 to shut Guantanamo Bay.\n‘As president, Barack Obama will close the detention center facility at Guantanamo,’ it stated.\nNot ‘might’ or ‘will try’ but ‘will’.\nYet, it’s still open, eight years later, and remains a toweringly disgraceful monument of illegal detention and torture that makes a mockery of Obama’s claim to stand for justice and fairness.\nBroken promises became a theme of Obama’s tenure.\nUnder him, over 250,000 people in America died from gun violence.\nObama tearfully vowed to the parents of the 20 slain children at Sandy Hook elementary school he would ‘get action’ on new gun control laws, a message he repeated ad nauseam after each mass shooting.\nRemember when Obama tearfully vowed to the parents of the 20 slain children at Sandy Hook elementary school he would ‘get action’ on new gun control laws? He failed to do anything\nBut he failed to get anything done at all. Instead, he was battered into submission by the NRA, and the mayhem and slaughter has continued, unabated.\nThere have been more than 180 shootings at schools and colleges in the US since Sandy Hook alone.\nObama also promised to bring ‘hope and change’ to Washington but again, failed miserably. Asked about this near the end of his presidency, he admitted to Vice News: ‘Well, that didn’t work out. There is no doubt that one of the central goals that I had was to make the politics in Washington work better. I haven’t accomplished that.’\nHis other failures make equally unedifying reading.\nDrug abuse in America, particularly involving opiates, rocketed to obscene levels in the Obama years.\nRacial tensions, especially between police and civilians, worsened to levels not seen since the 60s and 70s.\nViolent crime, on a downward curve for several decades, spiked by 15% in each of the last two years.\n(Obama’s hometown Chicago, run by his former chief of staff Rahm Emanuel is one of the cities most responsible for that spike.)\nEven Obamacare, his once-vaunted flagship health program, has disintegrated amid bitter acrimony and soaring costs to millions of Americans.\nAs for ‘Monster’ President Trump’s war with the media, arguably the single worst offender in presidential history when it came to attacking press freedom was…you’ve guessed it, Barack Obama.\nUnder Obama, the Justice Department and FBI spied on reporters by monitoring their phone records, and pursued Fox News reporter James Rosen’s private emails, then misled Congress about it.\nHis administration set a record for failing to provide information requested by the press and public under the Freedom of Information Act.\nAs for Trump’s war with the media, arguably the single worst offender when it came to attacking press freedom was Obama. Under him, the Justice Department and FBI spied on reporters by monitoring their phone records, and pursued Fox News reporter James Rosen’s private emails, then misled Congress about it\nIt used the Espionage Act to prosecute whistle-blowing leakers more than all of his predecessors combined.\nVeteran New York Times reporter James Risen said Obama’s administration was ‘the greatest enemy of press freedom that we have encountered in at least a generation.’ Others say it was even worse than in the Nixon era.\nMr ‘Transparent’ turned out to be as transparent as the heavily fortified doors on the presidential car, The Beast.\nSo, no, I don’t share the view that Barack Obama was a great or even good president.\nHistory will, I suspect, judge him far more harshly than the current blindly-loyal sycophants who love the way he sings like Al Green.\nEven less impressive than his record as president is Obama’s behaviour since leaving office.\nHis predecessor George W. Bush was a divisive and polarizing president, particularly due to his appalling misjudgement in waging the Iraq War.\nYet he vowed when he left office not to publicly criticize his successor, believing the job to be hard enough as it is, and to his great credit, he kept his word.\nThere must have been many things Obama did or said which Bush disagreed with, but he never stirred the media pot about them or plotted against him.\nNow the former president has set up a nerve center for a Trump insurgency from his DC home, pictured here\nObama, by contrast, seems hell-bent on bringing Trump down.\nA close Obama family friend told DailyMail.com last week that Obama’s goal now was to oust Trump by forcing his resignation or through his impeachment.\nHe’s turned his new home in Washington, just two miles from the White House, into a nerve center for the mounting insurgency against Trump, even moving his long time consigliere Valerie Jarrett into the mansion.\nObama’s former Attorney General Eric Holder told reporters: ‘It’s coming. He’s coming. And he’s ready to roll.’\nI’m sure he is.\nBut as ‘Saint’ Obama rolls against ‘Monster’ Trump, it may be worth remembering just what a deadly, deporting, press freedom-destroying, and generally weak president he was himself.","url":"https://www.dailymail.co.uk/news/article-4301466/PIERS-MORGAN-Obama-deported-millions-killed-thousands.html"}
