{"authors":["James Delingpole"],"date_download":"2018-10-30 21:12:38","date_modify":"2018-10-30 21:12:38","date_publish":"2014-05-25 18:23:00","description":"Thomas Piketty - house economist of the Occupy movement - has been rumbled.Ever since the publication earlier this year of his doorstopper treatise |","filename":"data/vaneerConsumption/PikettyauthorofDasKapitalintheTwentyFirstCenturyrumbled.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/05/24/Piketty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_05_25__1540933958.html","title":"Piketty - author of Das Kapital in the Twenty-First Century - rumbled","title_page":"Piketty - author of Das Kapital in the Twenty-First Century - rumbled | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Thomas Piketty – house economist of the Occupy movement – has been rumbled.\nEver since the publication earlier this year of his doorstopper treatise Capital in the Twenty-First Century – the French economist has been adulated as the poster boy of the liberal-left, his apparently thorough, ground-breaking research affording the intellectual justification for the usual leftist preoccupations: massive state intervention; swingeing attacks on the ‘undeserving’ rich; epic wealth redistribution.\nBut now it seems there’s a teeny, tiny problem: Piketty’s ‘evidence’ doesn’t stack up.\nA Financial Times journalist called Chris Giles has done his homework – unlike, it would seem, Piketty, or indeed his publisher Harvard University Press – and found the Frenchman’s research sorely wanting.\nThe central theme of Prof Piketty’s work is that wealth inequalities are heading back up to levels last seen before the first world war. The investigation undercuts this claim, indicating there is little evidence in Prof Piketty’s original sources to bear out the thesis that an increasing share of total wealth is held by the richest few. Prof Piketty, 43, provides detailed sourcing for his estimates of wealth inequality in Europe and the US over the past 200 years. In his spreadsheets, however, there are transcription errors from the original sources and incorrect formulas. It also appears that some of the data are cherry-picked or constructed without an original source.\nAmong the many who rhapsodised about Piketty’s work when it was published in March was economist Paul Krugman, who hailed it as “the most important economics book of the year — and maybe of the decade.” Well of course Krugman would, for Piketty’s book said exactly the kind of things the New York Times’s favourite left wing economist would like to hear, such as recommending an 80 per cent income tax for everyone earning more than $500,000 a year. (Yeah, that would work. No one would resist or move jurisdictions. And it would be really easy to administer and totally in harmony with property rights and liberal democracy…).\nBut even commentators on the right – such as the Telegraph’s Allister Heath – felt compelled to admit through gritted teeth that while they were appalled by Piketty’s economic prescriptions they had to concede it was a great work of scholarship. As Heath put it, in an otherwise very hostile review, “its ground-breaking research on historicpatterns of wealth ownership is second to none.”\nThanks to Chris Giles, however, it now seems that even the fig-leaf of factual credibility has been stripped away from it. Giles has done to Piketty what Steve McIntyre did to Michael Mann’s Hockey Stick.\nUp until Giles’s shock revelations, Capital in the Twenty-First Century was the liberal-left’s philosopher’s stone: the magical device capable of transforming base socialist instinct (greed, envy, hatred, control-freakery, love of the state, obsession with equality) into intellectual gold. This week, it’s just another worthless leftist screed in the dustbin of history.\nAdieu, M. Piketty. And no, I don’t mean au revoir.","url":"https://www.breitbart.com/europe/2014/05/25/piketty-author-of-das-kapital-in-the-twenty-first-century-rumbled/"}
