{"authors":[],"date_download":"2018-10-22 20:50:00","date_modify":"2018-10-22 20:50:00","date_publish":"2014-06-03 12:21:00","description":"Pilgrim's Pride raises its offer for Hillshire Brands, escalating a bidding war with Tyson Foods for the maker of Jimmy Dean sausages.","filename":"data/vaneerConsumption/PilgrimsPrideBoostsItsBidforHillshireBrands.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483436/140603-foodfight_0819_46b78b54b822163f89d3d6bda6e88b5f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_pilgrims-pride-boosts-its-bid-hillshire-brands-n121061_1540241400.html","title":"Pilgrim's Pride Boosts Its Bid for Hillshire Brands","title_page":"Pilgrim's Pride Boosts Its Bid for Hillshire Brands","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPilgrim's Pride Corp, the second largest U.S. chicken processor, raised its offer for Hillshire Brands Co, escalating a bidding war with Tyson Foods Inc for the maker of Jimmy Dean sausages.\nPilgrim's Pride said it raised its offer to $55 per share in cash from $45.\nTyson Foods, the world's second largest meat processor after Brazil's JBS SA, has offered $50 per share in cash for Hillshire. JBS owns about 75 percent of Pilgrim's Pride.\nHillshire said on Tuesday it would \"provide information\" to both bidders and conduct talks with them.\nPilgrim's Pride said its offer valued Hillshire at $7.7 billion, including debt. Tyson Foods' offer values Hillshire at $6.8 billion, including $500 million in debt.\nPilgrim's Pride said the raised offer represented a 49 percent premium to Hillshire's share price a day before Hillshire announced a bid for Pinnacle Foods Inc.\nHillshire said on May 12 that it planned to buy Pinnacle, the maker of Birds Eye frozen vegetables, in a deal valued at $4.3 billion, excluding debt.\nThe Wall Street Journal reported on Monday that Pilgrim's Pride was planning to raise its offer for Hillshire. Tyson Foods told Reuters it was aware of the report, but did not have a comment.\nThe two offers, made last week, require Hillshire to terminate its deal with Pinnacle.\n-- Reuters","url":"https://www.nbcnews.com/business/business-news/pilgrims-pride-boosts-its-bid-hillshire-brands-n121061"}
