{"authors":[],"date_download":"2018-10-22 22:30:59","date_modify":"2018-10-22 22:30:59","date_publish":"2014-05-10 21:30:45","description":"Daniel T. Kirk's father confirmed to NBC News that his son was the pilot of the balloon that caught fire during a balloon festival in Virginia.","filename":"data/vaneerConsumption/PilotinFatalAirBalloonCrashhad30YearsExperience.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/433591/140509-hot-air-balloon-fire-2126_348f37455377bfd47e06770f8152877b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hot-air-balloon-accident_pilot-fatal-air-balloon-crash-had-30-years-experience-n102266_1540247459.html","title":"Pilot in Fatal Air Balloon Crash had 30 Years Experience","title_page":"Pilot in Fatal Air Balloon Crash had 30 Years Experience","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe pilot of the air balloon that caught on fire before exploding, leaving two dead and a third presumed dead, was an Army veteran with 30 years of ballooning experience, family said.\nThe father of pilot Daniel T. Kirk confirmed to NBC News that his son was the operator of the balloon that caught fire during a balloon festival Friday night in Virginia.\nDonald Kirk said his son was a retired lieutenant Army colonel who served in the military for 37 years.\nFriday's crash was \"just a freak accident,\" Kirk said. He added that he had flown with his son more than 40 times and he was always very cautious.\nPolice would not identify the victims of the accident, but Virginia State Police spokeswoman Corinne Geller said during a news conference Saturday that they were not all residents of Virginia.\nGeller also shared the registration number of the Eagle Corp. hot air balloon, which indicates the balloon was registered under Kirk's name, according to Federal Aviation Administration records. Kirk's ballooning certification was issued in 1996, and the balloon in Friday's accident was certified in 2001, according to the documents.\nThe balloon had not been recovered and may have been incinerated in the explosion, Geller said Saturday.\nKirk was the \"Pilot in Command\" of Starship Adventures, where he offered \"scenic hot air balloon flights over the beautiful DelMarVa area,\" according to the website, which invites guests to \"come touch the clouds.\"\n\"I look forward to booking your flight and introducing you to man’s oldest form of flight,\" said a letter written by Kirk on the site.\n— Elisha Fieldstadt and Brittany Auger","url":"https://www.nbcnews.com/storyline/hot-air-balloon-accident/pilot-fatal-air-balloon-crash-had-30-years-experience-n102266"}
