{"authors":[],"date_download":"2018-10-23 01:07:50","date_modify":"2018-10-23 01:07:50","date_publish":"2016-01-24 00:00:00","description":"If you're a Republican who wants to win New Hampshire, you're supposed to be nice to the Union Leader newspaper and the Sununu family. Unless you're Donald Trump.","filename":"data/vaneerConsumption/PinchMeSomeRepublicansWonderIfTrumpsCampaignIsAnAmbienDream.json","image_url":"https://media.npr.org/assets/img/2016/01/22/24113827689_011979f5ba_o_wide-aeed8e21511b17cc58e86385b7402665436ec9b7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=463967779_1540256870.html","title":"Pinch Me? Some Republicans Wonder If Trump's Campaign Is An 'Ambien Dream'","title_page":"Pinch Me? Some Republicans Wonder If Trump's Campaign Is An 'Ambien Dream' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nNow, in this country an election is right on track, although it's moved in unpredictable directions. It's our presidential election, which is heading toward the first caucus in Iowa and the first primary in New Hampshire. In New Hampshire, Donald Trump's political rise has really disrupted Republican politics. As New Hampshire Public Radio's Josh Rogers reports, this could affect races up and down the ticket.\nJOSH ROGERS, BYLINE: Little about Donald Trump's approach to courting voters in New Hampshire has been orthodox. Trump favors large rallies over retail politicking. He's never campaigned here two days in a row. And then there's the GOP front-runner's open disdain for some of the state's traditional Republican power brokers, including the New Hampshire Union Leader, the only statewide paper known for its blistering conservative editorials.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDONALD TRUMP: The famous paper, right, you know? Your little paper, the Union Leader. No, it's really a dishonest paper though. It's terrible. So this gets a rag (ph).\n(LAUGHTER)\nTRUMP: I guess.\nROGERS: Trump's been a regular target and branded a bully by Union Leader publisher Joe McQuaid. Ever since, McQuaid and his paper have become fodder when Trump campaigns here.\n(SOUNDBITE OF ARCHIVED RECORDING)\nTRUMP: So this guy, his name's Joe McQuaid.\n(BOOING)\nTRUMP: Now, he's a - he's a lowlife. I'm telling you.\n(SOUNDBITE OF ARCHIVED RECORDING)\nJOE MCQUAID: Astounding.\nROGERS: That's McQuaid.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMCQUAID: In matters large and small about the Union Leader, he lies through his teeth.\nROGERS: Whatever the case may be, Trump's spat with the paper hasn't hurt him. And for Karl Zahn, a longtime watcher of New Hampshire politics who backs Trump, the whole thing - a GOP candidate taking the fight to the Union Leader and possibly winning - seems almost surreal.\nKARL ZAHN: We were at the thing in Nashua a couple of weeks ago, and, you know, he spent 20 minutes excoriating Joe McQuaid. I turned to a friend of mine and just said, pinch me. This is like a - in a Ambien dream I'm having here. It's crazy.\nROGERS: And the Union Leader is just one of Trump's high-profile New Hampshire targets. There's also former Governor John Sununu, a White House chief of staff to the first President Bush and top adviser to Mitt Romney in 2012. He's also the patriarch of what is probably New Hampshire's most prominent Republican family. One of Sununu's sons was a U.S. senator. Another is running for governor.\n(SOUNDBITE OF ARCHIVED RECORDING)\nTRUMP: John H. Sununu has been known - he was fired by Bush. And he was fired like dog. He was fired viciously, and he's such a dumb guy that he doesn't even know he was fired.\nROGERS: Sununu had criticized Trump in print and on television. During a recent appearance on Bloomberg TV, Sununu warned nominating Trump would doom local Republicans in November.\n(SOUNDBITE OF BLOOMBERG TV BROADCAST)\nJOHN SUNUNU: Here in New Hampshire, if Donald Trump's the nominee, we will not get a Republican governor. We will lose the New Hampshire state Senate. And we could lose the New Hampshire state House. It is that bad. And we could lose Senator Ayotte.\nROGERS: If those Republicans running for office here share that view, they aren't letting on. Ask Senator Kelly Ayotte about Trump - she's being challenged by New Hampshire's Democratic Governor Maggie Hassan - and you get a practiced response and the sense she'd rather talk about something else.\nKELLY AYOTTE: Well, listen. I mean, I think it's the favorite question of the press to ask all of us what we think about Trump. You know, I plan to support our Republican nominee. But I think there's a long way to go until that decision is made.\nROGERS: Chris Sununu, meanwhile - he's the Sununu hoping to be governor - claims he's not paying attention to his father's spat with Donald Trump or to what Trump's style of politics may mean for Republicans down-ballot.\nSUNUNU: Donald Trump is, as far as I'm concerned, is just another candidate. I don't worry about it too much because I try to control things I can control.\nROGERS: Sensible advice perhaps, even if Donald Trump is proving to be anything but just another candidate. For NPR News, I'm Josh Rogers in Concord.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=463967779"}
