{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 04:18:02","date_modify":"2018-10-23 04:18:02","date_publish":"2016-01-28 20:14:28","description":"Singer Pink, 36, sported an edgy look in a band T-shirt and trousers while on a family trip to Disneyland on Wednesday. She and husband Carey Hart, 40, recently celebrated their 10-year anniversary.","filename":"data/vaneerConsumption/PinkgoestoDisneylandwithhusbandCareyHartanddaughterWillow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACF7BA00000578-0-image-a-41_1454007873880.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421456_Pink-unrecognizable-Disneyland-raggedy-T-oversized-harem-pants-husband-Carey-Hart-sports-cast-arm_1540268282.html","title":"Pink goes to Disneyland with husband Carey Hart and daughter Willow","title_page":"Pink goes to Disneyland with husband Carey Hart and daughter Willow | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Everyone dresses down when they're with their family at Disneyland, but Pink went the extra mile.\nOn Wednesday the 36-year-old Funhouse singer was nearly unrecognizable as she wore some odd clothes as she strolled the park in Anaheim, California.\nThe Nineties icon was joined by husband Carey Hart, 40 - who had a cast on his arm - and their daughter, Willow Sage, aged four.\nRock star: Pink, 36, sported an edgy look during family trip to Disneyland on Wednesday\nPink wore a Beatles T-shirt and a trucker hat, complete with a motorcycle decal, perhaps due to her husband's former profession as a freestyle motorcycle racer.\nThe cover girl paired her look with a pair of wide-legged, Kimono-style pants complete with a tie-around waist and dropped front.\nAnd the Sober hit maker accessorized her ensemble with a pair of shades, hoop earrings and stacked bracelets.\nFamily affair: The Just Give Me A Reason songstress was joined by husband Carey Hart, 40, and their young daughter, Willow Sage, four\nHusband Carey wore a black T-shirt with a pair of cargo pants and a cast. It is not known how he got his injury.\nDaughter Willow dressed similarly to her parents in a pair of star print trousers, a baseball top and a trucker hat, complete with a yellow lightning bolt and People Footwear ‘Stanley’ in Black footwear.\nDuring their outing, Pink attended to details on her phone while Carey was on daddy duty.\nMilestone: Three weeks ago on Thursday, the couple celebrated their 10 year wedding anniversary\nThrough the years: The couple first started dating it 2001, before briefly splitting in 2003. On June 2005, Pink proposed to her now husband, and the duo were married in Costa Rica on January 7, 2006\nThree weeks ago on Thursday, the couple celebrated their 10 year wedding anniversary. Carey shared a black-and-white shot of his family, and gave a special shout-out to his wife.\n'Happy anniversary to my MUCH better half. 10 years is a pretty amazing milestone for 2 misfits like us. I'm proud of us baby!!! Thank you for being an amazing wife, mother, and friend. I love you.,' he wrote.\nThe couple first started dating it 2001, before briefly splitting in 2003. On June 2005, Pink proposed to her now husband, and the duo were married in Costa Rica on January 7, 2006.\nThey separated in 2008, before the So What singer announced their reconciliation in 2010. Through counseling during their difficult time, the duo were able to make their marriage work, having never divorced.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421456/Pink-unrecognizable-Disneyland-raggedy-T-oversized-harem-pants-husband-Carey-Hart-sports-cast-arm.html"}
