{"authors":["Quentin Letts For The Daily Mail"],"date_download":"2018-10-22 20:28:12","date_modify":"2018-10-22 20:28:12","date_publish":"2016-01-29 01:47:48","description":"Pink Mist is a poetic polemic, says QUENTIN LETTS.","filename":"data/vaneerConsumption/PinkMistisapoeticpolemicsaysQUENTINLETTS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30909B0100000578-0-image-a-53_1454032054151.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422084_A-pacifist-message-line-Pink-Mist-poetic-polemic-says-QUENTIN-LETTS_1540240092.html","title":"Pink Mist is a poetic polemic says QUENTIN LETTS","title_page":"Pink Mist is a poetic polemic says QUENTIN LETTS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pink Mist\nby Owen Sheers, Bush Theatre\nRating:\nArtfully scripted, cleverly staged, Pink Mist is a poem play about three Army recruits who end up being blown to pieces in 21st-century Afghanistan.\nThe title takes its name from a terrible euphemism for what happens when a body is entirely obliterated by munitions.\nLong before the end, I was shifting in my seat. Yes, I felt uncomfortable about the sacrifices we demand of our soldiers — but also a little fed up with the insistent pacifism of playwright Owen Sheers.\nThe cast of Pink Mist, pictured, a play about three Army recruits who are 'blown to pieces' in Afghanistan\nThe two-hour show begins strikingly with a verse monologue by Arthur, one of the three Bristolian recruits.\nPhil Dunster is perfect as broad-chested Arthur, who quickly finds a sense of belonging. Arthur’s friends, Taff and Hads (Peter Edwards and Alex Stedman), join him in training, then deployment to Afghanistan.\nDirectors John Retallack and George Mann should almost be hailed as choreographers, for the performance has strong elements of well-drilled dance. Rifles and explosions are mimed. There are almost no props.\nA year or so ago, Sheers had a similar but more factual play, The Two Worlds Of Charlie F, which included real Army disabled veterans. Though this production may be slicker, it lacks the emotional restraint of Charlie F (which, paradoxically, was terribly moving).","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422084/A-pacifist-message-line-Pink-Mist-poetic-polemic-says-QUENTIN-LETTS.html"}
