{"authors":[],"date_download":"2018-10-22 21:32:09","date_modify":"2018-10-22 21:32:09","date_publish":"2014-05-07 15:55:39","description":"It's no lie: Researchers in China discovered a top predator with a seriously long snout and genetic ties to Tyrannosaurus rex.","filename":"data/vaneerConsumption/PinocchioRexTRexsLongSnoutedCousinDiscovered.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/426456/qianzhousauruspressfigure1artworkbychuangzhaolowres_680da43bcb3a8fc201ef8d362c003623.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_pinocchio-rex-t-rexs-long-snouted-cousin-discovered-n99351_1540243929.html","title":"'Pinocchio Rex': T. Rex's Long-Snouted Cousin Discovered","title_page":"'Pinocchio Rex': T. Rex's Long-Snouted Cousin Discovered","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"People have a picture of tyrannosaursas apex predators — the biggest, baddest, meanest dinosaurs,\" said study researcher Steve Brusatte, a paleontologist at the University of Edinburgh, in Scotland.\nThe new dinosaur fits that image in some ways, but not quite as closely as T. rex does. Although big and at the top of the food chain, the long-nosed dino wouldn't have been able to \"crunch through bone\" like T. rex, Brusatte told Live Science.\nLong-nosed dinos\nResearchers previously found the complete skull and parts of the neck, back, hind limbs and tail of the new dinosaur, Qianzhousaurus sinensis, at a construction site in the Nanxiong Formation in southeastern China.\nThe new specimen had a long snout with many teeth, and horns on its nose. The creature probably weighed a little less than a ton and was probably 25 to 30 feet (7.5 to 9 meters) long, compared with a full-grown T. rex, which weighed about 5 tons and was about 40 feet (12 m) long, the researchers said.\n\"It really is a beautiful specimen,\" Brusatte said.\nBrusatte and colleagues said Pinocchio Rex was a \"top predator\" in its ecosystem, likely feeding on small, feathered dinosaurs or lizards.","url":"https://www.nbcnews.com/science/science-news/pinocchio-rex-t-rexs-long-snouted-cousin-discovered-n99351"}
