{"authors":["Gerard Couzens","Paddy Dinham For Mailonline"],"date_download":"2018-10-23 05:38:17","date_modify":"2018-10-23 05:38:17","date_publish":"2017-03-10 15:22:06","description":"The mismatch in size didn't appear to worry the pink-shorted woman, as she lost her rag after being hit from behind in a minor collision near the Argentinian capital Buenos Aires.","filename":"data/vaneerConsumption/Pintsizedwomanattacksburlymaninafitofroadrage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2317B100000578-0-image-a-2_1489156723709.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300846_Pint-sized-woman-attacks-burly-man-fit-road-rage_1540273097.html","title":"Pint-sized woman attacks burly man in a fit of road rage","title_page":"Pint-sized woman attacks burly man in a fit of road rage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pint-sized woman has been filmed repeatedly delivering vicious punches to a burly driver's face in an fit of road rage.\nThe mismatch in size didn't appear to worry the pink-shorted woman, as she lost her rag after being hit from behind in a minor collision near the Argentinian capital Buenos Aires.\nAs other drivers tooted their horns, she walked up to the driver of the offending vehicle and kicked his door twice to lure him out of his car.\nFootage taken by a shocked motorist behind them showed she didn't appear too impressed by his assessment of the situation either after he'd inspected her vehicle.\nAs other motorists in Beunos Aires, Argentina, tooted their horns, she walked up to the driver of the offending vehicle and kicked his door twice to lure him out of his car\nShe gave him a slap round the face with her right hand as he walked back towards his car before knocking his head sideways with a left hook to his other cheek and delivering a combination of left and right seconds later.\nThe man tried to stop her by putting his hands out to protect himself as she threatened to continue her onslaught, and she got in another punch to his stomach before an onlooker rushed over to intervene.\nThe motorist filming the violent scene could be heard sympathising with the male victim by saying: 'You can't fight with a woman because if you hit her, you go to prison.'\nIt is not known if he made a formal complaint about the assault, which happened in the city of Ramos Mejia in Buenos Aires province, a 30-minute drive from the capital.\nThe man tried to stop her by putting his hands out to protect himself as she threatened to continue her onslaught\nOne social media user said: 'You've got to take your hat off to this man. He didn't deserve what he got. This woman is awful.'\nLocal Nora Beatriz Silva added: 'What a stupid woman. Does she know what car insurance is? 'Keep your hair on. It's an accident and the insurance is going to pay, if you have insurance that's it.\n'I wish I'd been the one you had a run-in with.'","url":"https://www.dailymail.co.uk/news/article-4300846/Pint-sized-woman-attacks-burly-man-fit-road-rage.html"}
