{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 14:14:29","date_modify":"2018-10-30 14:14:29","date_publish":"2018-10-30 00:00:00","description":"The man suspected of sending pipe bombs to prominent Democrats and to CNN kept a list of about 100 people who investigators believe were intended targets, an official told The Associated Press on Monday.","filename":"data/vaneerConsumption/Pipebombtargetlistisreported.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/190184831_190182603-2b5ac834f4cb45d387f1c0302b8a028a_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_pipe-bomb-target-list-is-reported-20181__page=1_1540908869.html","title":"Pipe bomb target list is reported","title_page":"Pipe bomb target list is reported","title_rss":"NULL","source_domain":"arkansasonline.com","text":"In this courtroom sketch, Cesar Sayoc, left, appears in federal court, Monday, Oct. 29, 2018, in Miami. Sayoc is accused of sending pipe bombs to prominent Democrats around the country. A judge will hold a hearing Friday on whether Sayoc can be released on bail. (Daniel Pontet via AP)\nMIAMI -- The man suspected of sending pipe bombs to prominent Democrats and to CNN kept a list of about 100 people who investigators believe were intended targets, an official told The Associated Press on Monday.\nThe disclosure came as Cesar Sayoc, 56, made his initial court appearance in Miami federal court Monday, saying little, and after bomb squads were called to a post office in Atlanta about a suspicious mailing to CNN similar to the pipe-bomb packages recovered in the case last week.\nThe official said authorities had recovered soldering equipment, a printer, and stamps similar to those used on the package bombs in the investigation into Sayoc, who was arrested last week in Florida. Authorities believe Sayoc was putting explosives together in his van.\nThe official wasn't authorized to discuss the ongoing investigation and spoke on condition of anonymity to the AP.\nFederal law enforcement authorities did not publicly reveal who was on the list of possible targets, though they did begin Monday to inform those people and news organizations as a precaution.\nEileen Murphy, a spokesman for The New York Times, said the FBI told the newspaper that one of its editors was on the list.\n\"It's troubling but not surprising to learn that The Times was among the potential targets, which is precisely why we've prioritized safety and security,\" Murphy said.\nIt was not immediately clear where the list of possible targets was found. After Sayoc's arrest Friday, FBI agents conducted court-ordered searches of his van and a residence he had been associated with in the past, a law enforcement official said last week.\nAt Monday's hearing, federal prosecutors said they will seek to keep Sayoc jailed until trial as a flight risk and a danger to the community. A judge set another hearing for Friday on whether to grant bail to Sayoc and to discuss when he will be sent from Miami to New York, where he will ultimately be prosecuted. Authorities there have filed five federal charges that include illegal mailing of explosives and threats against a former president.\nOne of Sayoc's attorneys, Daniel Aaronson, urged people not to rush to judgment based on media reports.\n\"Right now, we know very, very, very little,\" Aaronson said of the case. \"We do not know all the evidence the government has. You have to keep in mind he has not been found guilty of anything.\"\nSayoc, shackled at the wrists and ankles and wearing a tan jail jumpsuit, said little at the hearing but at one point teared up. Aaronson said he did not know what made Sayoc seem emotional but noted he is facing more than 50 years in prison if convicted of all charges.\nAs Sayoc shuffled out of the courtroom, accompanied by a deputy U.S. marshal, he glanced toward the gallery, where his youngest sister, Tina Villasana, was watching the proceedings. He appeared to mouth, \"I love you.\"\nSayoc was arrested Friday outside a south Florida auto parts store based on fingerprint and DNA evidence. He already had a criminal record after arrests for theft, fraud and threatening to bomb a utility company.\nAuthorities have said the packages contained possible bombs made of six inches of PVC pipe, a small clock, a battery, wiring and what authorities termed \"energetic,\" or possibly explosive, material. They were shipped through the mail in manila envelopes lined with bubble wrap.\nNo one was injured. None of the bombs detonated, and it is unclear whether they could have, authorities have said.\nLATEST PACKAGE\nAuthorities did not immediately say who might be responsible for the most recent package to CNN intercepted on Monday.\nThe FBI said via its Twitter account that the recovered package at a post office in Atlanta was \"similar in appearance\" to the bubble-wrapped manila envelopes authorities say were sent by Sayoc to intended targets from Delaware to California. Law enforcement officials have said they believe the packages were staggered and that more could be discovered.\nCNN President Jeff Zucker says all mail to CNN has been screened offsite since last week, when the series of package bombs began appearing around the country. Among them were two apparent mail bombs sent to CNN, one of which sparked an evacuation of the organization's office in New York.\nAt least some listed a return address of U.S. Debbie Wasserman Schultz, former chair of the Democratic National Committee.\nShe represents the south Florida district where Sayoc -- a former male stripper, pizza driver and strip club DJ -- lived in a van covered with bumper stickers praising President Donald Trump, disparaging Democrats and CNN, and showing rifle crosshairs over liberals like former Secretary of State Hillary Clinton and filmmaker Michael Moore.\nAfter Sayoc's arrest Friday, authorities warned that more packages might still be circulating through the mail system.\nCNN broke the news of the latest package Monday. In a statement, CNN president Jeff Zucker said there was \"no imminent danger to the CNN Center\" in Atlanta, one of the city's busiest tourist centers. He said all mail is screened off site, so the package would not have come there directly, even if it had not been intercepted at the post office.\nA CNN correspondent posted an image of the package on Twitter, showing that it appeared similar to the other 14.\nThe two packages that authorities say Sayoc directed to CNN previously were targeted at former director of national intelligence James Clapper and former CIA director John Brennan. Both are prominent television commentators, though Brennan is an analyst for MSNBC, rather than CNN, and his name was misspelled on the package directed to him.\nSayoc's other targets included Clinton; former President Barack Obama; former Vice President Joe Biden; former Attorney General Eric Holder; Rep. Maxine Waters, D-Calif.; liberal billionaire George Soros; and actor Robert De Niro, authorities said.\nInformation for this article was contributed by Curt Anderson and Michael Balsamo of The Associated Press; by Alan Blinder and William K. Rashbaum of The New York Times; and by Matt Zapotosky and Devlin Barrett of The Washington Post.\nA Section on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/pipe-bomb-target-list-is-reported-20181/?page=1"}
