{"authors":[],"date_download":"2018-10-22 20:28:37","date_modify":"2018-10-22 20:28:37","date_publish":"2014-06-01 18:03:39","description":"One of the founders of file-sharing website Pirate Bay has been arrested in southern Sweden to serve an outstanding sentence for copyright violations.","filename":"data/vaneerConsumption/PirateBayCoFounderArrestedinSwedenforCopyrightViolation.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/480251/140601-peter-sunde-hg-1358_9200a3cb7e8f89f068930b2089496c9e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_pirate-bay-co-founder-arrested-sweden-copyright-violation-n119731_1540240117.html","title":"Pirate Bay Co-Founder Arrested in Sweden for Copyright Violation","title_page":"Pirate Bay Co-Founder Arrested in Sweden for Copyright Violation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSTOCKHOLM — One of the founders of file-sharing website Pirate Bay has been arrested in southern Sweden to serve an outstanding sentence for copyright violations after being on the run for nearly two years, officials said.\nPeter Sunde had been wanted by Interpol since 2012 after being sentenced in Sweden to prison and fined for breaching copyright laws.\n\"We have been looking for him since 2012,\" said Carolina Ekeus, spokeswoman at the Swedish National Police Board. \"He was given eight months in jail so he has to serve his sentence.\"\nEkeus said Sunde had been arrested on Saturday in the southern Swedish county of Skane but she was not able to provide further details.\nFour men linked to Pirate Bay were originally sentenced to one year in prison and a fine of $4.8 million. An appeals court later reduced the prison sentences by varying amounts, but raised the fine to $6.9 million.\nIn September, 2012, Cambodia arrested and deported another Pirate Bay co-founder at Sweden's request.\nSwedish media reported on Saturday that Sunde may have been living in Germany in recent years and that Sweden's Supreme Court had as recently as May rejected an appeal from him.\n\"He is extremely talented and I still think that the judgment was wrong,\" Peter Althin, who defended Sunde during the trial, was quoted as saying by Swedish news service TT.\n\"It's about being on the cutting edge if one is going to be successful... But if one is too far ahead it is not always about success. Peter fought for file-sharing and in 10 years I think it goes without saying that file-sharing for one's own needs will be allowed.\"\nPirate Bay, launched in 2003, provided links to music and movie files that were stored on other users' computers. Swedish subsidiaries of prominent music and film companies had taken the company to court claiming damages for lost revenue.\nDespite the Swedish court case, the website is still functioning. On its website, Pirate Bay says it is now run by a different organization and is registered in the Seychelles.\n— Reuters","url":"https://www.nbcnews.com/news/world/pirate-bay-co-founder-arrested-sweden-copyright-violation-n119731"}
