{"authors":["Caroline Pate"],"date_download":"2018-10-30 23:09:48","date_modify":"2018-10-30 23:09:48","date_publish":"2014-08-14 01:02:53","description":"The cast of the upcoming Pitch Perfect 2 movie recently reunited at a Justin Timberlake concert in Los Angeles, and this can only mean good things. Hailee Steinfeld, Brittany Snow, Kelley Jakle, and Elizabeth Banks all posed for a group photo…","filename":"data/vaneerConsumption/PitchPerfect2CastAttendsJustinTimberlakeShowProvingTheBellasShouldCoverTheseJTHitsVIDEOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/225b73b5-579d-4489-9811-7239416bcbd6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35704-pitch-perfect-2-cast-attends-justin-timberlake-show-proving-the-bellas-should-cover-these-jt-hits_1540940988.html","title":"'Pitch Perfect 2' Cast Attends Justin Timberlake Show Proving The Bellas Should Cover These JT Hits - VIDEOS","title_page":"'Pitch Perfect 2' Cast Attends Justin Timberlake Show Proving The Bellas Should Cover These JT Hits  — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"The cast of the upcoming Pitch Perfect 2 movie recently reunited at a Justin Timberlake concert in Los Angeles, and this can only mean good things. Hailee Steinfeld, Brittany Snow, Kelley Jakle, and Elizabeth Banks all posed for a group photo post-concert. First of all, consider the first sentence. The hilarious ladies of Pitch Perfect 2 at a Justin Timberlake concert? That was certainly nothing short of epic. I can't imagine a better way to sing along to \"Rock Your Body\" in concert. Oh, to be a fly upon Brittany Snow's huge eyelashes.\nBut more importantly, this might be some real-life foreshadowing for the movie. In other words: will some of Justin Timberlake's discography be performed in Pitch Perfect 2? After all, Timberlake's danceable tunes lend themselves well to acapella. And what could be better than an early-2000's throwback in Pitch Perfect 2? Really, there's only two questions here: would Timberlake allow his music to be used in the movie, and what song should they cover? Well, while Mr. Timberlake is unlikely to respond to calls, the second question is fairly easy to answer. Just exactly what Justin Timberlake songs would be best for the Barden Bellas to cover? Here's a few suggestions:\n\"Mirrors\"\njustintimberlakeVEVO on YouTube\nOne of the best hits from new Justin Timberlake. The gorgeous harmonies can only be more heart wrenching when sung in four parts by the ladies in the Bellas.\n\"Cry Me a River\"\njustintimberlakeVEVO on YouTube\nThe classic Justin Timberlake song. Imagine the choral part at the end being sung a capella? Yeah, it'd be phenomenal.\n\"Senorita\"\njustintimberlakeVEVO on YouTube\nThe flirty number would be perfect sung as a serenade by the Treblemakers, and Skylar Astin has just the right amount of swagger to pull it off.\n\"Love Sex Magic\"\nCiaraVEVO on YouTube\nOf course, the best part about a capella is the duets. And the back-and-forth between Ciara and Justin Timberlake would be perfect for a Treblemaker and a Bella. And of course, the song would allow Benji to work some of his \"illusionist\" magic.","url":"https://www.bustle.com/articles/35704-pitch-perfect-2-cast-attends-justin-timberlake-show-proving-the-bellas-should-cover-these-jt-hits"}
