{"authors":[],"date_download":"2018-10-30 18:53:05","date_modify":"2018-10-30 18:53:05","date_publish":"2017-02-23 15:37:00","description":"ATL is in need of young stars. Check out the Peach City’s latest casting call for your chance at fame.","filename":"data/vaneerConsumption/PitchPerfect3castingVIPsuiteguests.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/07/Images/skyWord.395166-pitch-perfect-3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_now-cas_7da79145bfa0870fc48340ae71b6473f__1540925585.html","title":"‘Pitch Perfect 3’casting VIP suite guests","title_page":"‘Pitch Perfect 3’casting VIP suite guests  | Atlanta film jobs","title_rss":"NULL","source_domain":"ajc.com","text":"Are you ready to make your mark on Atlanta’s film and TV industry? Are you the next Tyler Perry? ATL is in need of young stars. Check out the Peach City’s latest casting call for your chance at fame.\n»RELATED: 9 big movies filming in Georgia in 2017\n‘Pitch Perfect 3’\nThis movie is a sequel to the 2012 and 2015 movies about an all-girl singing group. It stars Anna Kendrick, Rebel Wilson, Anna Camp, Kelley Jakie, Shelley Regner, Chrissie Fit and Ester Dean.\nWhat are they looking for?\nCool, hip and unique-looking men and women 18 and over and of all ethnicities are needed to portray VIP suite guests for a party scene. You should be a fresh face to the movie. If you’re cast, you’ll probably be sprayed with food items as part of the scene, but wardrobe will be provided.\nWhen are they filming?\nFilming is in downtown Atlanta on Feb. 28 and March 1-2. You’ll also need to be available for a fitting on Feb. 24. You must be available for all of these days.\n»RELATED: Top TV shows and movies filmed in Georgia this year\nHow much does it pay?\nPay is $64 for eight hours of work, and you’ll be paid a fitting rate of $16 for two hours.\nHow do I submit?\nSend three photos (head, body and profile) and your age, height, weight and all contact information to extras@RoseLockeCasting.com. Put “SUITE GUEST” in the subject line.\n»RELATED: 10 reasons to seek a job in Atlanta’s TV and film industry\n»RECOMMENDED VIDEO: Top movies and TV shows filmed in Georgia in 2016","url":"https://www.ajc.com/business/employment/now-casting-pitch-perfect-seeking-vip-suite-guests-atlanta-film-jobs/U1y7IOJ3iSGTv72cv4BzOO/"}
