{"authors":["Abc News","More Roey"],"date_download":"2018-10-30 00:52:02","date_modify":"2018-10-30 00:52:02","date_publish":"2018-10-28 07:10:03","description":"Former Secretary of Homeland Security Jeh Johnson said the U.S. now has a \"toxic environment\" that encourages \"deranged\" people to act.","filename":"data/vaneerConsumption/PittsburghsynagogueshootingmailbombsshowUStoxicdiscoursespursderangedpeopletoactExDHSchief.json","image_url":"https://s.abcnews.com/images/US/police-pittsburgh-shooting-ap-ps-181027_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_deranged-people-us-now-feeling-bring-change-ar_story_id=58803240_1540860722.html","title":"Pittsburgh synagogue shooting, mail bombs show US 'toxic' discourse spurs 'deranged' people to act: Ex-DHS chief","title_page":"Pittsburgh synagogue shooting, mail bombs show US 'toxic' discourse spurs 'deranged' people to act: Ex-DHS chief - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"In the wake of a shooting massacre at a synagogue and a mail-bomb campaign against prominent critics of President Donald Trump, a former Homeland Security chief said the U.S. currently has a \"toxic\" political environment in which \"deranged\" people \"feel it's their place\" to bring about change.\nInterested in Pittsburgh Synagogue Shooting? Add Pittsburgh Synagogue Shooting as an interest to stay up to date on the latest Pittsburgh Synagogue Shooting news, video, and analysis from ABC News. Add Interest\nJeh Johnson, who was Homeland Security Secretary under President Barack Obama, told “This Week” Co-Anchor Martha Raddatz on Sunday, “We're in an environment now where deranged individuals feel that it's their place to bring about change in our society with an AR-15 or a series of pipe bombs.”\nJohnson said Americans need to pressure their leaders to promote a more civil public dialogue.\n“We live now in a very, very toxic environment that includes an incivility in our political discourse among our leaders. The attack yesterday and the attempted pipe bombings over the course of last week should be a wake-up call to all Americans to demand change, and change has to start at the top,” he said.\nAFP/Getty Images\nThe shooting massacre at a Pittsburgh synagogue on Saturday killed 11 people and injured at least six more, including four police officers.\nThe suspect, 46-year-old Robert Bowers, who has been arrested and charged, had allegedly posted anti-Semitic and anti-immigrant messages on social media, including one post that said, “Jews are the children of Satan.”\nJonathan Greenblatt, head of the Anti-Defamation League, a Jewish civil rights group, also appeared on \"This Week\" and cited research from his organization showing sharp increases in anti-Semitic incidents in the U.S. in 2016 and 2017.\n\"In 2016, we saw a 34 percent increase in acts of harassment, vandalism and violence against the Jewish community,\" Greenblatt said. \"But last year, a 57 percent increase, the single-largest surge that we’ve ever seen in anti-Semitic acts in the United States.\"\n“All of this is absolutely unacceptable, and we cannot create a situation or allow ourselves to normalize anti-Semitism and think this is somehow just an average daily course of business,\" the Anti-Defamation League CEO said. \"It's abnormal and it needs to be interrupted and stopped.”\nPresident Trump on Saturday condemned the synagogue attack as \"evil.\"\n“This evil anti-Semitic attack is an assault on all of us. It's an assault on humanity. It will require all of us working together to extract the hateful poison of anti-Semitism from our world,” Trump said.\nBut Greenblatt and Johnson both said that Trump needs to do more than speak out after tragedies by setting an example of civil discourse.\n\"It isn’t what you say after the tragedy,\" Greenblatt said. \"It’s the environment that you create with your rhetoric.\"\nJohnson said the president has a particular responsibility to create a \"more civil environment.\"\n\"Our president has the largest microphone; he has the largest bullhorn,\" the former Homeland Security secretary said. \"This particular president has a particularly large voice and a large microphone, and Americans should demand that their leaders insist on change, a more civil discourse, and a more civil environment generally.\"","url":"https://abcnews.go.com/Politics/deranged-people-us-now-feeling-bring-change-ar/story?id=58803240"}
