{"authors":["Abc News","Matt Gutman","Allie Yang","More Bill","More Matt","More Allie"],"date_download":"2018-10-30 00:50:16","date_modify":"2018-10-30 00:50:16","date_publish":"2018-10-29 07:04:31","description":"Rabbi of Pittsburgh synagogue says it was an \"attack on America.\"","filename":"data/vaneerConsumption/PittsburghsynagoguerabbirecountsshootingCongregantswereslaughteredinmysanctuary.json","image_url":"https://s.abcnews.com/images/US/synagogue-shooting-02-ap-jc-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_News_pittsburgh-synagog_4b37c0d7385cbf81a8b3725eb2f45313_story_id=58822432_1540860616.html","title":"Pittsburgh synagogue rabbi recounts shooting: Congregants 'were slaughtered in my sanctuary'","title_page":"Pittsburgh synagogue rabbi recounts shooting: Congregants 'were slaughtered in my sanctuary' - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The rabbi of the Pittsburgh synagogue where 11 worshippers were gunned down Saturday said the massacre was not just an attack on the Jewish community.\nInterested in Pittsburgh Synagogue Shooting? Add Pittsburgh Synagogue Shooting as an interest to stay up to date on the latest Pittsburgh Synagogue Shooting news, video, and analysis from ABC News. Add Interest\n\"It was an attack on America,\" Rabbi Jeffrey Myers of the Tree of Life synagogue said on ABC's \"Good Morning America\" on Monday.\nSuspect Robert Gregory Bowers allegedly burst into the temple wielding three handguns and an AR-15 assault rifle and spewing anti-Semitic statements just as Myers was starting services Saturday morning. The gunman killed three women and eight men ranging in age from 54 to 97 before police shot and wounded him.\nEven after he was stopped, Bowers allegedly screamed at SWAT team members that he wanted all \"Jews to die.\"\nABC News\n\"Many just see this an attack on the Jewish community. It's not,\" Myers told ABC News Chief Anchor George Stephanopoulos Monday morning. \"When American citizens cannot freely and safely worship in their house of worship and celebrate the Sabbath, it concerns me because it challenges the safety and security of all Americans in any house of worship.\"\nMyers told ABC News in a separate interview that while he never saw the gunman during the rampage, he'll never be able to erase the screams, gunfire and shattering glass from his mind.\nAmong the cries he heard were the last words of one of his beloved congregants, 84-year-old Bernice Simon.\nHe said he heard Simon yell out, \"My husband has been shot!\" Simon, who married her husband, Sylvan, in the same synagogue they were killed in, then fell silent. Police would later find her and her husband dead.\nThe attack at the Tree of Life synagogue was the third mass shooting at a house of worship in the United States in the past three years.\nOn Nov. 5, 2017, gunman Devin Patrick Kelley killed 26 people at the First Baptist Church in Sutherland Springs, Texas, before taking his own life after an armed civilian fired shots at him as he exited the sanctuary. On June 17, 2015, nine members of the Emanuel African Methodist Episcopal Church in Charleston, South Carolina, were murdered by 21-year-old white supremacist Dylann Roof, who was convicted of federal hate-crime charges and sentenced to death in January.\nAFP/Getty Images\n\"It seemed like a typical morning. The usuals were there. Nothing seemed out of the ordinary in any way, shape or form,\" Myers told \"Nightline.\" \"I’m not hyper-vigilant but you’re always looking to see, all right, is there something out of place? I’ve just been over the years readily trained to do that. But all seemed good. All was ready.\"\nMyers told \"Good Morning America\" that he and a dozen congregants were just beginning the service at the temple in the Squirrel Hill neighborhood of Pittsburgh at 9:45 a.m. Saturday when he heard what he initially thought was a stainless-steel coat rack falling to the floor.\n\"Within the next 15 seconds, the sound repeated and it was apparent to me at that time, just instinct I guess, that was not the sound of a piece of metal falling, that it was rapid-fire,\" Myers said.\nDustin Franz/AFP/Getty Images\nHe immediately instructed people attending the service to drop to the floor, be silent and don't move. He then evacuated some of the congregants out a side door of the sanctuary but eight remained behind.\nMyers said he went back into the sanctuary and up to the second floor, where the gunman was still shooting people. All that separated him from the killer was a curtain.\n\"Regretfully, there was no way for me to get back to the remaining eight people that were in the back of the sanctuary,\" he said. \"One of them was wounded. Thank God, she will survive her injuries. The remaining seven people were slaughtered in my sanctuary.\"\nAuthorities said Bowers went to three different areas of the synagogue, killing victims. Besides the 11 he shot dead, another six, including four police officers responding to the incident, were injured.\nAP\nMyers said he immediately called 911 on his cellphone and stayed on the line with dispatchers for 20 minutes as police swarmed the scene and engaged in a gunfight with Bowers.\n\"It felt like an eternity,\" Myers said of waiting for help to arrive.\nHe said that he would not normally carry his cellphone on the Sabbath, but in August he took a course with a community security adviser who convinced him to carry his phone even on that holy day.\nBrendan Smialowski/AFP/Getty Images\n\"He said, 'Rabbi, it's a different world, you need to carry it,'\" Myers said. \"I'm so grateful for his presence in teaching me.\"\nHis congregants, especially those who witnessed the attack and survived, are now coping with \"various stages of trauma, mourning, disbelief, shock all rolled up into one,\" he noted.\n\"I now live with the fact that I lost those people and I just lay awake at night wondering, 'Could I have done something?'\" Myers says he’s told often he \"couldn’t have done anything\" though \"that doesn’t ease my pain.\"\n\"The emotional side of me says, 'I left them and I’m their pastor of their flock and I can’t be consoled for that.'\" Myers said he ultimately made the decision to stay on the phone with law enforcement. \"I can’t save anybody, but I could at least be 'eyes and ears' for the law enforcement to tell them, 'Here’s what I’m hearing' to the best that I can to give information.\"\nBrendan Smialowski/AFP/Getty Images\nMyers is now preparing to conduct funerals for those who were killed.\nHe said \"part of me wishes that\" he didn’t have to be the one to have this burden. \"But the bigger part of me says, \"God sent me to Pittsburgh for a reason. Maybe this is the reason. I’m here. I have a job to do. I have a congregation to tend.'\"\nABC News' Jake Lefferman and Katie Muldowney contributed to this report.","url":"https://abcnews.go.com/GMA/News/pittsburgh-synagogue-rabbi-massacre-killed-11-jews-attack/story?id=58822432"}
