{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 00:01:47","date_modify":"2018-10-31 00:01:47","date_publish":"2018-10-28 15:43:08","description":"A Pittsburgh city official is pushing back on President Donald Trump's suggestion that placing armed security guards inside places of religious worship could potentially curb attacks like the deadly shooting that left 11 people dead at Pittsburgh's…","filename":"data/vaneerConsumption/PittsburghMayorBillPedutoRespondsToTrumpsArmedGuardCommentsWithATerseMessage.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/cf20cdb5-f1df-4908-bbe1-30fd0edf787c-getty-937089728.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_pittsburgh-mayor-bill-peduto-responds-to-trumps-armed-guard-comments-with-a-terse-message-13009621_1540944107.html","title":"Pittsburgh Mayor Bill Peduto Responds To Trump's \"Armed Guard\" Comments With A Terse Message","title_page":"Pittsburgh Mayor Bill Peduto Responds To Trump's \"Armed Guard\" Comments With A Terse Message","title_rss":"NULL","source_domain":"bustle.com","text":"A Pittsburgh city official is pushing back on President Donald Trump's suggestion that placing armed security guards inside places of religious worship could potentially curb attacks like the deadly shooting that left 11 people dead at Pittsburgh's Tree of Life Synagogue on Saturday. In an interview with NBC News on Sunday, Pittsburgh Mayor Bill Peduto disagreed with Trump's \"armed guard\" comment , saying we should seek to end the behavior behind such attacks rather than govern around it.\n\"I don't think that the answer to this problem is solved by having our synagogues, mosques and churches filled with armed guards or our schools filled with armed guards,\" Peduto said Sunday in an appearance on NBC's Meet the Press. \"I think we're dealing with an irrational person who acted irrationally and trying to create laws around that is not the way that we should govern. We should try to stop irrational behavior from happening at the forefront.\"\nOn Saturday, just hours after police in Pittsburgh had reported an active shooter at a synagogue in the city's Squirrel Hill neighborhood, President Trump appeared to suggest armed security could have prevented the attack. \"If they had protection inside, the results would have been far better,\" he told reporters before boarding Air Force One at Joint Base Andrews in Maryland. \"This is a dispute that will always exist, I suspect, but if they had some kind of a protection inside the temple maybe it could have been a much better situation. They didn't.\"\nLater in the day, as a number of Democrats called for bipartisan, common sense gun safety legislation, Trump appeared to double down on his statement. \"This is a case where if they had an armed guard inside they may have been able to stop him immediately,\" he said while speaking to reporters in Illinois. \"Maybe there would have been nobody killed, except for him maybe.\"\nBut Peduto, a Democrat, has repeatedly pushed back against the president's suggestion. \"The idea that we as a country have evolved to a place where every church, synagogue or mosque will need to have armed security is wrong,\" Peduto said in a statement to Haaretz. \"There should be places in this country that are sacred and that nobody would ever consider harming. If we get to a point where every synagogue needs armed security guards, that's not the kind of county or city I would want to live in.\"\nRather than placing armed guards everywhere, Peduto said leaders, legislators, and government officials \"need to focus on solving the problems that led us to this point.\" Peduto did not, however, explicitly call for stricter gun safety laws.\nBut the mayor once again pushed back on the president's remarks during a press conference held early Sunday, reiterating his message about a need for curbing the irrational behavior behind such deadly attacks. \"There is no way that you can rationalize a person walking in to a synagogue during services and taking the lives of 11 people,\" he said. \"We shouldn't be trying to find ways to minimize the dangers that occur from irrational behavior. We should be working to eliminate irrational behavior and the empowerment of people who would seek to cause this type of carnage from continuing.\"","url":"https://www.bustle.com/p/pittsburgh-mayor-bill-peduto-responds-to-trumps-armed-guard-comments-with-a-terse-message-13009621"}
