{"authors":["Abc News","More Emily"],"date_download":"2018-10-30 00:58:05","date_modify":"2018-10-30 00:58:05","date_publish":"2018-10-29 08:23:16","description":"The oldest victim was 97 years old.","filename":"data/vaneerConsumption/PittsburghsynagogueshootingPortraitsofthe11victims.json","image_url":"https://s.abcnews.com/images/US/synagogue-11-ap-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_pittsburgh-synagogue-shooting-portraits-11-victims_story_id=58823835_1540861085.html","title":"Pittsburgh synagogue shooting: Portraits of the 11 victims","title_page":"Pittsburgh synagogue shooting: Portraits of the 11 victims - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Eleven worshippers, including a 97-year-old woman, were gunned down inside the Tree of Life synagogue in Pittsburgh's Squirrel Hill neighborhood Saturday morning.\nInterested in Pittsburgh Synagogue Shooting? Add Pittsburgh Synagogue Shooting as an interest to stay up to date on the latest Pittsburgh Synagogue Shooting news, video, and analysis from ABC News. Add Interest\n\"Words escape me of what you can say,\" said Rabbi Jeffrey Myers, who was officiating the service when a gunman started shooting. \"They were all beautiful, wonderful, good decent people. Hate was not in their vocabulary.\"\nHere is what we know about the victims:\nRose Mallinger\nAndrew Caballero-Reynolds/AFP/Getty Images\nRose Mallinger, 97, was the oldest of the victims but she seemed much younger than her age, Brian Schreiber, who is a Tree of Life synagogue member and president and CEO of the Jewish Community Center of Pittsburgh, told the Pittsburgh Post-Gazette.\n\"You've never met a more vivacious 97-year-old,\" Schreiber told the newspaper. \"She was just so full of life. ... She had so much energy.\"\nMallinger is survived by her children and grandchildren. Her 61-year-old daughter, Andrea Wedner, was wounded in the Saturday morning attack.\nJerry Rabinowitz\nBrendan Smialowski/AFP/Getty Images\nDr. Jerry Rabinowitz, 66, was killed when he ran outside to try to help the wounded, according to his nephew, Avishai Ostrin.\n\"In addition to being the president of the congregation, he was a doctor, a healer ... when he heard shots he ran outside to try and see if anyone was hurt and needed a doctor. That was Uncle Jerry, that’s just what he did,\" Ostrin wrote on Facebook.\n\"He always wore a bowtie,\" Ostrin added. \"There is just something about guys who wear bowties. Something youthful, something fun. And that is a word that definitely embodied my Uncle Jerry – fun. You know how they say there are people who just lighten up a room? You know that cliché about people whose laugh is infectious? That was Uncle Jerry. It wasn’t a cliché, it was just his personality. His laughter, with his chest heaving up and down, with a huge smile on his face – that was uncle Jerry. And that bowtie. That bowtie that you know made people smile, you know made his patients more at ease.\"\nDustin Franz/AFP/Getty Images\nA former patient said the slain doctor was one of his heroes.\n\"In the old days for HIV patients in Pittsburgh he was to [sic] one to go to,\" former patient Michael Kerr wrote on Facebook. \"He often held our hands (without rubber gloves) and always always hugged us as we left his office.\"\n\"I got lucky beyond words - because when he gently told me around November 1995 that it was time to begin taking medications - there was an ACTG trial for two HIV medications that saved my life,\" he wrote. \"Thank you Dr. Rabinowitiz for having always been there during the most terrifying and frightening time of my life. You will be remembered by me always. You are one of my heroes.\"\nThe University of Pittsburgh Medical Center \"cannot even begin to express the sadness and grief we feel over the loss of Dr. Jerry Rabinowitz,\" the medical center said in a statement. \"Jerry was above all one of the kindest physicians and human beings in our community.\"\nTami Minnier, chief quality officer of the University of Pittsburgh Medical Center, added, \"Those of us who worked with him respected and admired his devotion to his work and faith. His loss is devastating, and we extend our deepest sympathies to his family, friends, and fellow UPMC colleagues who loved him.\"\n\"The UPMC family, in particular UPMC Shadyside, cannot even begin to express the sadness and grief we feel over the loss of Dr. Jerry Rabinowitz. Jerry was above all one of the kindest physicians and human beings in our community.\" More ??. pic.twitter.com/nX2yiyyDR2 — UPMC (@UPMCnews) October 28, 2018\nCecil and David Rosenthal\nBest Buddies\nBrothers Cecil Rosenthal, 59, and David Rosenthal, 54, were both killed in the attack.\nThe brothers never missed a service and were always at the synagogue because it was a place they felt the most safe, fellow congregant Scott Levin told ABC News.\nThe brothers were always together, congregant Katy Levin told ABC News, so she said it brings her some comfort that they died together because she doesn't know how one could live without the other.\nBoth brothers were developmentally disabled.\n\"Cecil and David had a love for life and for those around them,\" according to a statement from ACHIEVA, a local organization which provides support for people with disabilities.\n\"Cecil’s laugh was infectious. David was so kind and had such a gentle spirit,\" Chris Schopf, Vice President of ACHIEVA Residential Supports, said in the statement. \"Together, they looked out for one another. They were inseparable. Most of all, they were kind, good people with a strong faith and respect for everyone.\"\nCecil Rosenthal was \"a gregarious person who was super social, absolutely loved talking to people,\" said David DeFelice, Cecil Rosenthal's friend and match in a \"Best Buddy\" program.\n\"Somebody who had an intellectual disability ... we were kind of their mentor, their friend, and the whole point was to just foster friendship,\" he explained to ABC News' \"Nightline.\"\nHe knew Cecil Rosenthal for three years and called his friend \"a fixture in the Jewish community and at Tree of Life.\"\n\"I was you know welcomed right away because he kind of brought me in,\" DeFelice said. \"He always carried a Hebrew calendar, knew the Jewish holidays -- he marked them down. He was always talking about events and parties that the synagogue was having and that he invited different people to.\"\n\"He was a funny guy, he liked to tease,\" DeFelice said. \"I loved talking to him. I have nothing but good memories, so it’s nice because it brings a smile to my face.\"\nDaniel Stein\nSteven Halle\nDaniel Stein, 71, was a \"simple man\" who loved going to synagogue and playing with his grandson, his son, Joe Stein, wrote on Facebook.\n\"Yesterday was the worst day of my life,\" Joe Stein wrote on Facebook. \"My mom, sister and I are absolutely devastated and crushed! Our lives now are going to have to take a different path, one that we thought would not happen for a long time. ... We love you dad more than you’ll ever know!\"\n\"He was the best man you’d ever want to know,\" Steven Halle, a nephew of Daniel Stein, told ABC News.\nDaniel Stein was incredibly active in the synagogue community, where he was a mentor, provided services to the elderly community and served as president of his congregation, Halle said.\nHe called his uncle a happy, caring and sympathetic man who had two \"wonderful\" kids and a \"beautiful wife.\"\nDaniel Stein also loved to show off his 7-month-old grandchild. Now, his grandson \"is never going to know who his grandfather is,\" Halle said.\nRichard Gottfried\nBarry Werber via AP\nRichard Gottfried, 65, a successful dentist, had reconnected with his faith following his father's death and at one point became the president of the 70-member congregation in Pittsburgh, reported the Pittsburgh Post-Gazette.\nHe is survived by his wife, Margaret A. \"Peg\" Durachko, who is also a dentist.\nThe couple had worked together at the Squirrel Hill Medical Center’s dental clinic, where they treated refugees and immigrants, many of whom had never been to a dentist, the newspaper reported.\n\"Do not let his death be in vain. Drive out evil from your own life and help another to drive it out of their life. The only way to combat evil is with love,\" his wife said, according to the Pittsburgh Post-Gazette.\nJoyce Fienberg\nCourtesy Fienberg Family\nVictim Joyce Fienberg, 75, a former research specialist, is survived by her two sons and grandchildren. Her husband, \"internationally acclaimed statistician\" Stephen Fienberg, died in 2016.\nJoyce Fienberg was a research specialist at the University of Pittsburgh's Learning Research and Development Center (LRDC) from 1983 until she retired in 2008.\n\"My mother-in-law was one of the kindest humans I've ever met,\" her daughter-in-law, Marnie Fienberg, told ABC News. \"If you knew her for five minutes, if you knew her for 20 years, you felt exactly the same way.\"\n\"She traveled extensively with her husband and they met people internationally -- she would stay in touch with them. So there are people from 50 years ago who she met once in Australia who are her good friends,\" she said. \"She would stay up nights making sure everybody was staying in touch -- I've never seen anything like it before. ... I think everybody tries to do that, but she succeeds.\"\nJoyce Fienberg's most important relationships were the ones she had with her six grandchildren, who range in age from 15 to 8.\n\"She made a point of mastering social media very early so she could stay in touch with these kids,\" Marnie Fienberg said. \"Each one of them had a one-on-one relationship with her. She knew what was going on in their days, she was so involved. She really was an amazing, amazing grandmother.\"\nMelvin Wax\nCourtesy of Barry Werber via AP\nMelvin Wax, 88, a retired accountant, was a fixture of the congregation, friend Myron Snider told The Associated Press.\nWax's wife, Sandra, had died in 2016.\nWax was known for being one of the few people who always showed up to services early, Marilyn Honigsberg told the AP.\n\"If somebody didn't come that was supposed to lead services, he could lead the services and do everything. He knew how to do everything,\" Snider told the AP.\nSnider recently spent six weeks in the hospital for pneumonia and recalled how Wax \"called my wife to get my phone number in the hospital so he could talk to me. ... Just a sweet, sweet guy.\"\nBernice and Sylvan Simon\nCathal McNaughton/Reuters\nSylvan Simon, 86, and his wife, Bernice Simon, 84, were killed in the same synagogue where they married in December 1956, The Tribune-Review reported.\n\"A loving couple, and they’ve been together forever,\" longtime friend Michael Stepaniak told the newspaper. \"I hope they didn’t suffer much, and I miss them terribly.\"\n“\"They held hands and they always smiled, and he would open the door for her,\" neighbor Heather Graham told the newspaper. \"They were really generous and nice to everybody.\"\nThe couple's front door has three stickers, according to The Tribune-Review: \"Support Our Troops,\" \"God Bless America\" and \"America the Beautiful.\"\nIrving Younger\nLinda Mealy\nIrving Younger, 65, a father and grandfather, was a regular volunteer and worshiper at the synagogue, where he would come early and stay late, The Pittsburgh Post-Gazette reported.\n\"I wouldn’t be surprised if he saw this gunman walk into the room where the services were and his first thought was, 'Can I help this stranger get settled?' Until he saw what the stranger was doing -- because that’s the kind of thought that he would have,\" said Schachter, the former congregation president.\nABC News' Teri Whitcraft, Cassidy Gard, Jake Lefferman, Katie Muldowney and Carlin Mccarthy contributed to this report.","url":"https://abcnews.go.com/US/pittsburgh-synagogue-shooting-portraits-11-victims/story?id=58823835"}
