{"authors":["Abc News","More Luke"],"date_download":"2018-10-30 00:50:28","date_modify":"2018-10-30 00:50:28","date_publish":"2018-10-29 09:29:54","description":"Pittsburgh shooter shows increase in antisemitism in the United States","filename":"data/vaneerConsumption/PittsburghsynagogueshootingevidenceofincreasedantiSemitisminUSADL.json","image_url":"https://s.abcnews.com/images/US/shooting-reaction-ap-ps-181027_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_pittsburgh-synagogue-sho_d9fd4609aefa3ad2527cfbdb1e75bff9_story_id=58825423_1540860628.html","title":"Pittsburgh synagogue shooting evidence of increased anti-Semitism in US: ADL","title_page":"Pittsburgh synagogue shooting evidence of increased anti-Semitism in US: ADL - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"In August 2017, white supremacists and alt-right protesters shouted \"Jews will not replace us\" as they marched on the campus of the University of Virginia.\nThe school that Thomas Jefferson founded had become the scene of anti-Semitic chants.\nIn that same year, the Anti-Defamation League reported a 57 percent increase in the number of anti-Semitic incidents.\nFor the first time since 2010, there was an anti-Semitic incident in every state - New York had the most with 380, the ADL said.\nDustin Franz/AFP/Getty Images\nIn total, according to the ADL, there were 1,986 incidents in 2017, 1,267 in 2016 and 941 in 2015.\nThese anti-Semitic incidents came to a head when authorities say Robert Bowers entered the Tree of Life synagogue in Pittsburgh just before 10 a.m. this past Saturday morning and killed 11 people.\n\"This is the deadliest attack on the Jewish community in the history of the United States,\" the ADL said in a statement.\nJewish leaders decried the attack and saw it as more evidence hate is growing in the country.\n“I think this is another example of hate in our country that just doesn’t go away. I’m afraid we’re going down the wrong path. Hate has to stop,” Rabbi Hazzan Jeffery Meyers the Rabbi at the Tree of Life synagogue told WVPI, an ABC affiliation tv station in Pittsburgh.\nJohn Cohen, an ABC News contributor and former Department of Homeland Security acting undersecretary, said that in \"this threat environment,\" politicians should use caution about what they say - because their words matter.\n\"The words they use can actually inspire violence by those who are prone to violence and who are simply searching for a cause to justify it,\" Cohen said.\nThat hate, the numbers show, has been increasing steadily the past few years.\nThe FBI has reported, in its most complete numbers, that hate crimes across the board were up 4 percent and showed patterns of increase.\nIn 2016, there were 6,121 hate crimes, up from 5,850 in 2015.\nFurther, a report released by the Center for the Study of Hate and Extremism at Cal State San Bernardino found that hate crimes in the largest U.S. cities rose 12.5 percent in 2017 - making it the fourth year in a row that hate crimes have increased.\nLos Angeles, followed by Phoenix, Arizona had the most hate crimes by city, according to the study.\nLast year, the FBI and Homeland Security officials repeatedly issued intelligence bulletins to police around the country warning that quote \"lone actors and small cells within the white supremacist movement likely will continue to pose a threat of lethal violence.\"\nThe bulletins noted that the violence will often be \"spontaneous\" and \"opportunistic,\" limiting \"prevention by law enforcement.\"\nPolice across the country are stepping up patrols around synagogues in the wake of the Pittsburgh shooting.","url":"https://abcnews.go.com/US/pittsburgh-synagogue-shooting-evidence-increased-anti-semitism-us/story?id=58825423"}
