{"authors":["Julie Cart","Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-30 22:28:33","date_modify":"2018-10-30 22:28:33","date_publish":"2016-10-19 08:00:00","description":"Oh, to be a plastic bag. Helpful, ubiquitous and ever useful. Carefree, wafting on the wind, and alive for a thousand years. On the other hand, you are","filename":"data/vaneerConsumption/PitytheplasticbagWillCalifornianssealitsfatewithaban.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/PlasticBags_sa3iA1N-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938513.html","title":"Pity the plastic bag: Will Californians seal its fate with a ban?","title_page":"Pity the plastic bag: Will Californians seal its fate with a ban? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Oh, to be a plastic bag. Helpful, ubiquitous and ever useful. Carefree, wafting on the wind, and alive for a thousand years.\nOn the other hand, you are cheap and trashy. Discarded, your presence mars beautiful landscapes. You and your trillions of clones clog sewers, accumulate in the worlds’ oceans, and entangle and choke wildlife and sea creatures.\nCalifornia banned your flimsy presence in the Golden State, consigning you to an environmentally-sensitive death by recycling.\nBut, as shoppers know all too well, getting rid of plastic bags isn’t that easy.\nThe “paper-or-plastic?” checkout query was supposed to be a relic of our unenlightened past. After reviewing the scientific evidence of persistent environmental harm, California legislators in 2014 banned thin plastic carryout bags, authorizing stores to charge customers 10 cents for heavier-duty plastic sacks or paper bags. (Smaller, handle-less bags offered for produce or meat aren’t affected.)\nBut the ban inflamed the nation’s bag makers, who intervened before the law could take effect. They wielded two ballot measures to poke a stick in the eye of the Legislature and the grocery industry, whom they haven’t forgiven for switching sides to support the ban after lawmakers allowed the grocers to keep the 10 cent fee.\nSo, in the confounding manner of direct democracy, California voters in November will ponder two opposing initiatives, each sponsored by the plastic bag industry—which has spent more than $6 million to put them on the ballot.\nOne, Prop. 67, is a referendum—an attempt to block the bag ban by asking voters whether they agree with the new law. The plastic bag industry is hoping to convince enough Californians to vote no, thereby preempting the ban.\nAnother, Prop. 65, would redirect the 10 cent bag fee consumers pay, so that rather than stores reaping the benefit, it would instead go to an environmental fund administered by the state Wildlife Conservation Board. The plastics industry is backing this one, a smack-down to the grocery industry.\n(Should both measures pass, Prop. 65 would only be enacted if it receives more votes than Prop. 67. If voters reject Prop. 67, then Prop. 65 does not apply.)\nIf the bag ban survives at the polls, Californians would say goodbye to one of the world’s most utilitarian products. Thus would the plastic bag, a humble object engineered to be of long and useful service, become undone by its very design.\nIt already has been exiled from 150 cities and counties, primarily along the Pacific coast.\n“We believe the environmental facts have been misconstrued,” said Phil Rozenski, policy chair of the American Progressive Bag Alliance, and a senior director at Novolex. Its subsidiary, Hilex Poly Co., has contributed to the ballot propositions. “This is all about politics and emotional debate. Science left the building years ago.”\nBecause of plastic’s durability, even when it is exposed to constant wave action and degraded by a relentless sun, it doesn’t disappear, but breaks down into tiny particles called microplastics.\nTwo years ago, a survey of existing research estimated that as many as 51 trillion particles of microplastics are floating around the planet’s oceans, weighing as much as 236,000 metric tons. Closer to home, a 2015 study found that eight wastewater treatment plants discharge nearly half a million microplastic particles into the San Francisco Bay each day.\nEven taking into consideration that bags represent only a portion of all plastics found in marine debris, researchers say 80 percent of trash floating in the ocean is plastic. “The problems with plastics are well-documented,” said Eben Schwartz, who oversees the California Coastal Commission’s Marine Debris Program. “Sea animals ingest plastic and it not only gives the sense of being full, so they starve, but it can also get caught in the esophagus, and keep food from getting down.”\nPlastic accumulated in the stomach of a marine mammal renders the animal more buoyant, making it more difficult to dive for food. Sea Turtles can mistake floating plastic bags for their favorite meal, jellyfish. Offshore and onshore, animals become entangled with plastic bags.\nStill, Californians use about 15 billion single-use plastic bags a year—as the Legislative Analyst notes– that’s more than 400 bags per Californian.\nBecause plastic is marvelous. Few modern inventions have so quickly shoved aside the competition and staked a spot smack in the middle of American culture, industrial design and manufacturing. Plastics emerged in the late 1940s full of promise and vigor, rising to become the third-largest manufacturing industry today. Then, as now, plastic begins life as a petrochemical. Manufacturing processes convert chains of hydrogen and carbon molecules into a polymer resin that is then heated, shaped and cooled.\nCheap and versatile, it can become just about anything.\nBut plastic formulation prevents it from bio-degrading along with other garbage. Scientists sifting through landfills of the future will dredge up diapers—and Safeway bags. Even the industry’s “biodegradable” bags don’t completely break down, and these green plastic bags account for less than 1 per cent of the market.\nThis is the description of a plastic bag’s afterlife, from an environmental assessment prepared for California local governments: “The majority of bags end up as litter or in the landfill, and even those in the landfill may be blown away as litter due to their light weight. Although some recycling facilities will handle plastic bags, most reject them because they can get caught in the machinery and cause malfunctioning, or are contaminated after use.”\nBags snag on tree limbs, blow around on vacant lots and loiter in gutters. But don’t blame the bag, says the industry, blame a populace ridden with litterbugs.\n“Whether it’s marine debris or litter—it shouldn’t be there,” said Rozenski. “We have to work on it as a society. Approaching it on a product-by-product basis is not the way to do it.”\nOthers oppose the ban on philosophical grounds. “The government shouldn’t be telling stores what kind of bags to offer. That’s between the store and the customer,” said Ted Brown, chairman of the state Libertarian Party, which opposes both propositions.\nDo bag bans really make a difference?\nSince San Francisco’s ban has been in place, plastic bag refuse found on the Bay Area’s inland and coastal beaches has fallen 34 per cent, according to Schwartz of the coastal commission. He cited data gathered at annual Bay Area cleanups showing that in 2008, plastic bags accounted for about 9 percent of all debris removed from beaches. By 2012, they were only 6 percent.\n“We never see drops like that,” he said. “The bans are effective.”\nLikewise, an analysis of San Jose’s 2011 ordinance found the ban had reduced bag litter by “89 per cent in the storm drain system, 60 percent in the creeks and rivers, and 59 percent in city streets and neighborhoods.”\nCoby Skye, senior civil engineer for the Los Angeles County Department of Public Works, said mitigating impacts of plastic bags cost taxpayers money. Measured by weight, plastic bags make up less than 1 percent of total waste in Los Angeles landfills, he said. “But by volume, if you look at what’s in the catch basins and storm drains, it’s as high as 15 to 20 percent of the litter there,” he said. Skye added that they also represent a potential flood hazard.\nThe National Oceanic and Atmospheric Administration and other agencies studied the economic impact of the rafts of marine debris that wash onto California beaches. Their finding: Plastic items account for seven of the top 10 debris items, and reducing marine debris by 25 percent on Orange County beaches would add $32 million to local coffers in three summer months alone.\n“I don’t have any problems with plastics as a material, I think it’s amazing,” said Schwartz, of the coastal commission. “The difficulty I have is single-use disposable plastics—designed to be used for mere minutes, then disposed of.”\nBut manufacturers insist that Californians love the plastic bag.\n“Every day, people are asked if they want paper or plastic,” Rozenski said. “According to our surveys, 7 percent prefer paper, and 85 percent prefer plastic.”\nIn the end, even if voters approve the ban, plastic bags won’t disappear from our lives. Just imagine how many we have stashed in the back of kitchen drawers, car trunks, and wadded up inside other plastic sacks across California.\nIt’s likely to be a protracted, messy breakup.\nPoor plastic bag. It’s not you. It’s us.","url":"https://calmatters.org/articles/pity-the-plastic-bag-will-californians-seal-its-fate-with-ban/"}
