{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-22 23:57:27","date_modify":"2018-10-22 23:57:27","date_publish":"2016-01-28 13:18:04","description":"The 25-year-old star was sure to turn heads as she posed outside of the Theatre Royal Haymarket, clad in an vivid tangerine sun-dress that ensured the pop princess was unmissable.","filename":"data/vaneerConsumption/PixieLottshowsoffherlithelimbsatBreakfastatTiffanysphotocall.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA447000000578-0-image-a-76_1453985858185.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420839_Singer-Pixie-Lott-shows-lithe-limbs-tangerine-sun-dress-dazzles-Breakfast-Tiffany-s-photocall_1540252647.html","title":"Pixie Lott shows off her lithe limbs at Breakfast at Tiffany's photocall","title_page":"Pixie Lott shows off her lithe limbs at Breakfast at Tiffany's photocall | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She will reprise the role of Holly Golightly, made famous by Audrey Hepburn, in the stage production of Breakfast at Tiffany's when it opens later this year.\nAnd Pixie Lott looks as though she can hardly wait to make her theatre debut as she flashed an unrelenting smile while at a photocall for the upcoming production on Thursday.\nThe 25-year-old star was sure to turn heads as she posed outside of the Theatre Royal Haymarket, clad in an vivid tangerine sun-dress that ensured the pop princess was unmissable.\nScroll down for video\nIt's almost time! Pixie Lott looks as though she can hardly wait to make her theatre debut as she flashed an unrelenting smile while at a photocall for the upcoming production on Thursday\nThe Mama Do crooner, who has made no secret of her theatre ambitions, looked sensationally leggy in the short design which featured laser cut detailing around the skirt.\nThe singer elongated her famous pins with barely-there gold stilettos, which made for a somewhat summery style overall despite the chilly weather.\nEven Pixie's choice of outerwear nodded at the warmer days of spring as she modelled a white duster coat emblazoned with a bright floral motif.\nBold: The 25-year-old star was sure to turn heads as she posed outside of the Theatre Royal Haymarket, clad in an vivid tangerine sun-dress that ensured the pop princess was unmissable\nPerfect pins: The Mama Do crooner, who has made no secret of her theatre ambitions, looked sensationally leggy in the short design which featured laser cut detailing around the skirt\nHer signature blonde locks were worn in a sleek, yet voluminous, style around her stunning face which sported a glamorous make-up look comprised of a copper smoky eyeshadow look and a glossy nude lipstick.\nPixie was joined at the photocall by co-stars Charlie De Melo and Matt Barber, of Downton Abbey fame, as well as director Nikolai Foster.\nThe Essex native will be taking the lead in a limited 12-week season of Breakfast at Tiffany’s at the Theatre Royal Haymarket in London’s West End in 2016, after doing a UK and Ireland tour of the production from March 2016.\nGoing for gold: The singer elongated her famous pins with barely-there gold stilettos, which made for a somewhat summery style overall despite the chilly weather\nBig shoes to fill: Pixie will reprise the role of Holly Golightly, made famous by Audrey Hepburn, in the stage production\nHere they are! Pixie was joined at the photocall by co-stars Charlie De Melo (R) and Matt Barber (L), of Downton Abbey fame\nGorgeous: The Nasty hitmaker's signature blonde locks were worn in a sleek, yet voluminous, style around her stunning face which sported a glamorous make-up look\nThe play is based on Truman Capote’s original 1958 novella.\nBreakfast At Tiffany's has been adapted for the stage by Tony and Olivier Award-winning playwright Richard Greenberg (Take Me Out, Three Days of Rain), and contains memorable songs from the era as well as original music by Grant Olding (One Man, Two Guvnors).\nPixie enthused: 'I am so excited to play Holly Golightly in Breakfast at Tiffany’s in my first West End play.\n'I absolutely love Holly’s style, and free spirit; she has always been an icon to me and I can't wait to bring my own personality to the role.\nLeading lady! The Essex native will be taking the lead in a limited 12-week season of Breakfast at Tiffany’s at the Theatre Royal Haymarket in London’s West End in 2016\n'Alongside music, I've always wanted to be in a play, and getting the opportunity to be in one of my all time favourites and play this fabulous character is a dream come true.'\nSet against the backdrop of 1943 New York, the story follows writer Fred's attempts to woo Holly, a charming, vivacious and utterly elusive good-time girl with a string of rich suitors.\nFans can catch Pixie on stage from 30 June to 17 September 2016.\nShowing off: The singer looked ready to entertain as she offered a twirl for the cameras","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420839/Singer-Pixie-Lott-shows-lithe-limbs-tangerine-sun-dress-dazzles-Breakfast-Tiffany-s-photocall.html"}
