{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:04:17","date_modify":"2018-10-23 01:04:17","date_publish":"2017-04-26 11:08:52","description":"The stunning popstar contorted her lean figure into an impressive back bend on Wednesday as she shared her morning yoga routine in a flashback to summers spent in California.","filename":"data/vaneerConsumption/PixieLottslipsintoapolkadotformorningyoga.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EC00A00000578-0-image-a-8_1493200522857.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447022_Flexy-Pixie-Lott-slips-polka-dot-morning-yoga_1540256657.html","title":"Pixie Lott slips into a polka dot for morning yoga","title_page":"Pixie Lott slips into a polka dot for morning yoga | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's spent many a summer in sunny LA - but Pixie Lott was California dreaming on Wednesday as she shared a flashback to the poolside.\nThe stunning popstar contorted her lean figure into an impressive back bend as she shared her morning yoga routine.\nDressed in just a teeny polka dot bikini, Pixie was the picture of perfection with her torso turned to the sun and her legs outstretched with pointed toes.\nScroll down for video\nBody beautiful: Pixie Lott showed off her impressive flexibility on Wednesday, as she shared a flashback of her morning yoga routine\n'Morning yoga. Rise and shine,' she wrote beside the sunkissed picture from her time in Los Angeles.\nFlexy Pixie was lying by the side of the pool, tucking her head underneath her body to stretch out her spine.\nShe had a hoodie tied around her waist but otherwise left her bikini body on show by choosing to do her morning ritual in her two-piece.\nPink to make the boys wink: Tagging California, Pixie hinted that the image was a flashback thanks to her newly-pink hued hair\nThe workout picture pre-dates Pixie's new candy-floss coloured hair do, which she unveiled two weeks ago.\nAs a popstar and former Strictly Come Dancing contestant, Pixie is known for her gymnastic and dancing prowess.\nIn 2014, the singer took part in the 12th series of the BBC One celebrity competition Strictly.\nKeeping fit: Pixie stays in shape with a combination of dance, ballet and yoga\nShe was the youngest contestant of that cycle at 23, but sadly crashed out in the 11th week as part of a series that saw Caroline Flack take the glitterball trophy.\nAfter her dancing stint, Pixie confessed that she definitely not a gym bunny, saying she finds it 'so boring'.\n'I don't hit the gym at all; I find it so boring. But I love, love dancing,' she told Hello magazine.\n'Dancing is a great all-over body workout, but you really enjoy it so it doesn't feel like exercise.'\nMore of a ballet and yoga fan, Pixie has even been known to share meditation classes with fiance Oliver Cheshire.\nTwo's company: Pixie has been known to practise yoga with model boyfriend Oliver Cheshire (left)\nBody beautiful: A self-confessed dance lover, Pixie says she hates the gym because it's boring","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447022/Flexy-Pixie-Lott-slips-polka-dot-morning-yoga.html"}
