{"authors":[],"date_download":"2018-10-22 22:42:41","date_modify":"2018-10-22 22:42:41","date_publish":"2014-05-12 15:06:35","description":"Four of Silicon Valley's biggest tech companies agreed to settle an anti-poaching case -- but one of the plantiffs asked the judge to reject the sum.","filename":"data/vaneerConsumption/PlaintiffInTechAntiPoachingSuitAsksJudgeToRejectSettlement.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_11/249386/140313-apple-930a_d348c80a0621c21a8f1bb5a5cf93d9a9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_plaintiff-tech-anti-poaching-suit-asks-judge-reject-settlement-n103131_1540248161.html","title":"Plaintiff In Tech Anti-Poaching Suit Asks Judge To Reject Settlement","title_page":"Plaintiff In Tech Anti-Poaching Suit Asks Judge To Reject Settlement","title_rss":"NULL","source_domain":"nbcnews.com","text":"The case involved a class of more than 64,000 software engineers, who said they lost a collective $3 billion in lost wages as a result of the companies' alleged collusion.\nBut the settlement is $324 million, Devine wrote in his letter to the judge, which he posted to a site he created about the case.That works out to about $5,060 per class member -- and that's before the lawyers take their cut.\n\"There’s no justice for the Class in that, nor is there any real deterrent to future wrongdoing,\" Devine wrote in his letter to the judge, about which The New York Times was the first to report.\nDevine compared the settlement to allowing a shoplifter caught on video stealing a $400 iPad to pay Apple $40, keep the device, and walk away without a criminal record.\n\"I respectfully ask that you reject this settlement so that we may have our day in court and a have real shot at justice,\" he wrote.\nDevine did not immediately respond to a request for further comment.\nThe anti-poaching case began in May 2011, when a former Lucasfilm software engineer filed suit against the four tech companies as well as Lucasfilm, Pixar and Intuit. The suit alleged that the late Apple founder Steve Jobs was the mastermind of the scheme, emailing executives from Google with poaching complaints as early as 2005.\nLucasfilm, Pixar and Intuit rolled over in 2013 and settled their portion of the case for a total of $20 million.","url":"https://www.nbcnews.com/tech/tech-news/plaintiff-tech-anti-poaching-suit-asks-judge-reject-settlement-n103131"}
