{"authors":["Austin Ruse"],"date_download":"2018-10-30 20:17:48","date_modify":"2018-10-30 20:17:48","date_publish":"2015-07-30 14:51:07","description":"Dr. Savita Ginde of Planned Parenthood talks specifically about how to avoid “getting caught.”","filename":"data/vaneerConsumption/PlannedParenthoodDoctoronHowtoAvoidGettingCaught.json","image_url":"https://media.breitbart.com/media/2015/07/planned-parenthood-organs.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_30__1540930668.html","title":"Planned Parenthood Doctor on How to Avoid Getting Caught","title_page":"Video: Planned Parenthood Doctor on How to Avoid Getting Caught","title_rss":"NULL","source_domain":"breitbart.com","text":"The latest video released today shows Dr. Savita Ginde of Planned Parenthood talking to buyers from a fictitious company about how to avoid the appearance of violating federal law against selling fetal body parts that are the result of abortion. Ginde talks specifically about how to avoid getting caught.\n“Because if you have someone in a really anti- state that’s going to be doing this for you, they’re probably going to get caught,” she says.\nGinde talks about how she’s very confident that Planned Parenthood lawyers had worked out the details on how not to get caught. “We talked to him in the beginning, you know, we were like, ‘we don’t want to get called on,’ you know, ‘selling fetal parts across states.’ I’m confident that our legal will make sure that we are not put in that situation.”\nIn a previous video Ginde is caught talking about the prices of intact body parts and, looking at the body of a child in a petri dish, concluded that the pieces sold separately would run to $200-$300.\nIn this new video there are more scenes in the pathology lab where Planned Parenthood personnel and picking through body parts in a petri dish. At one point there is a cracking sound and a medical assistant says it’s the cracking of the baby’s skull.\nDr. Ginde laughs and says, “It’s a baby.”\nReferring to the value of an intact heart laying in the dish, a medical assistant is heard to say, “five stars.”\nLooking for legs and finding them, the assistant announces, “Another boy.”\nWith this new video it will become increasingly difficult for Planned Parenthood to avoid the suspicion that they knew they were skating close to the line between legal and illegal. Ginde is caught talking about their concerns and how their legal team is working to help them avoid getting caught.\nIt is illegal under Federal Law for anyone to trade in human body parts for profit. A conviction would include huge fines and jail time.\nFollow Austin Ruse on Twitter @austinruse","url":"https://www.breitbart.com/politics/2015/07/30/video-planned-parenthood-doctor-on-how-to-avoid-getting-caught-selling-baby-parts/"}
