{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:10:29","date_modify":"2018-10-30 20:10:29","date_publish":"2016-12-27 18:46:53","description":"Planned Parenthood receives more than a half-billion taxpayer dollars annually. The group has been under congressional investigation for the past year following the release of videos that alleged Planned Parenthood harvests the body parts of babies aborted in its clinics and sells them for a profit. | Faith","filename":"data/vaneerConsumption/PlannedParenthoodRaisesSome300KinPrivateDonations.json","image_url":"https://media.breitbart.com/media/2016/01/March-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/faith_2016_12_27__1540930229.html","title":"Planned Parenthood Raises Some $300K in Private Donations","title_page":"Planned Parenthood Raises Some $300K in Private Donations | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Planned Parenthood has raised more than $300,000 in private donations in just the six weeks since Donald Trump was elected president of the United States.\nThe amount in donations is 40 times its normal rate, reports The Guardian, and occurs as the nation’s largest abortion chain anticipates having its taxpayer funding eliminated in the new Trump administration.\nDonate before 12/31 and your donation to Planned Parenthood will be DOUBLED. Give today: https://t.co/Q1S9PpjjIA pic.twitter.com/aheFeNhbek — Planned Parenthood (@PPact) December 26, 2016\nIn a recent fundraising email to supporters, Planned Parenthood Action Fund president Cecile Richards wrote:\nA lot of people are worried about what the new year will mean for their rights, their safety, and their lives. A lot of people are outraged by the agenda of the incoming administration, including Vice President-elect Mike Pence who has spent his entire career working to block access to reproductive health care. If you’re anxious or angry, I have one piece of advice and one sincere request: Don’t wait. Don’t wait to make your voice heard. Don’t wait to take a stand against an agenda that has shown nothing but contempt for women, immigrants, LGBTQ Americans, and people of color. Don’t wait to fight for what you believe and protect what matters most. We need you right now…to be ready for the fights to come. Renew with Planned Parenthood Action Fund right now, and your gift will be doubled by a special matching gift, up to a total of $300,000. In just a few weeks, we will stand proudly with you and countless supporters across the country to defend affordable health care, reproductive rights, and access to abortion. That work has already begun. But it’s what you do right now that will determine if we have the resources we need to be ready for what’s coming. Do your part now: Make a MATCHED year-end gift to Planned Parenthood Action Fund today... Thank you for stepping up today. Sincerely, Cecile Richards, President Planned Parenthood Action Fund\nCelebrities are especially assisting Planned Parenthood as it faces possible elimination of its taxpayer funds.\nThe mother of Hamilton creator and star Lin-Manuel Miranda recently wrote at Vogue that the abortion business is a “beacon of hope.” A member of Planned Parenthood’s board of directors, psychologist Dr. Luz Towns-Miranda is joining with her son in offering a chance for donors to win free tickets to Hamilton at its locations in New York, Chicago, and San Francisco, as well as backstage passes.\nGuess who's back?\nPrize, yo's back.\nWhat's the prize?\nWinner & a guest sees ALL THREE HAMILTONS.\nWha?!\nRead on!\nhttps://t.co/xHb96tFLJq — Lin-Manuel Miranda (@Lin_Manuel) December 6, 2016\nAdditionally, a biopic about Planned Parenthood founder Margaret Sanger is in the works this year. The film will portray the eugenicist as a bold hero to women whose organization ultimately created an image of abortion as a “basic human right.”\nPlanned Parenthood receives more than a half-billion taxpayer dollars annually. The group has been under congressional investigation for the past year following the release of videos that alleged Planned Parenthood harvests the body parts of babies aborted in its clinics and sells them for a profit.\nHelp us fight back against the attacks ahead. We need everyone to pitch in what they can: time, talent, or money: https://t.co/6AnoCYIBld pic.twitter.com/qO2dLI5NxG — Planned Parenthood (@PPact) December 26, 2016\nIn March of 2015, a Government Accountability Office report confirmed that Planned Parenthood Federation of America and five other groups are using taxpayer funds to advocate for abortions as “reproductive health care.”\nThe House Select Investigative Panel on Infant Lives has referred Planned Parenthood, other abortion clinics, and several biomedical procurement companies for investigation for potential criminal violations. The Senate Judiciary Committee has also referred Planned Parenthood to both the FBI and the Justice Department for investigation and possible criminal prosecution.\nThe Obama administration has participated in the narrative set by the abortion industry and the mainstream media that Planned Parenthood provides family planning services to low-income women that cannot be obtained elsewhere.\nStates that have eliminated Planned Parenthood’s federal funding, however, have redirected it to other healthcare centers that have met the federal government’s criteria.\nThese federally qualified healthcare centers (FQHCs) provide more comprehensive services than Planned Parenthood to low-income families. Nationally, there are 13,000 FQHCs – a figure that outnumbers Planned Parenthood facilities by 20 to 1.\nPlanned Parenthood has just spent some $30 million in the 2016 election to help elect Democrats.","url":"https://www.breitbart.com/faith/2016/12/27/planned-parenthood-raises-some-300k-in-private-donations/"}
