{"authors":[],"date_download":"2018-10-23 05:24:22","date_modify":"2018-10-23 05:24:22","date_publish":"2015-04-16 00:00:00","description":"When Magic: The Gathering became a hit, its creators faced a surprising problem.","filename":"data/vaneerConsumption/PlanetMoneyNPR.json","image_url":"https://media.npr.org/assets/img/2015/04/16/bilanko_small_wide-6867b36b938258a50e423b3fc3299fe5bbaf82c1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=400140583_1540272262.html","title":"Planet Money : NPR","title_page":"How Success Almost Killed A Game, And How Its Creators Saved It : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nAbout 20 years ago on this program, we reported on a fad.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nNOAH ADAMS, HOST:\nAmericans by the millions are discovering a new card game. It's called Magic the Gathering. It's one of the fastest-growing games in the country.\nSIEGEL: The game consists of a elaborately illustrated cards with dragons and wizards. Back in the 1990s, everyone expected Magic the Gathering to go the way of Beanie Babies, super hot, then not. But as Robert Smith of our Planet Money team reports, the makers of Magic figured out how to make a fad that wouldn't fade.\nROBERT SMITH, BYLINE: The game of Magic was a lot like Dungeons & Dragons, only you played with a deck of cards. You bought them in random packs like baseball cards, and if you were lucky, you got a rare card - a fiery monster, a particularly powerful spell.\nSKAFF ELIAS: So that anticipation of, did I get the best one of those hundred rare cards, is - yeah. That's super exciting for people.\nSMITH: Skaff Elias was an early designer of the game - worked for the company Wizards of the Coast. And back in the 1990s, they knew they had a hit. They were selling packs of cards as fast as they could make them. And the rarest of the cards were being bought and resold by collectors.\nELIAS: Some of these cards that nominally are $3 a piece - eventually those become $10 cards and $15 cards and then hundred-dollar cards and then $500 cards, and this all happened in the first year.\nSMITH: This is the dream, right? You print up worthless bits of cardboard with pictures of orcs on them, and they become worth a fortune. There was this one legendary car, the Black Lotus, that when used in a certain way in the game was super powerful. It was being resold for thousands of dollars. There's a great video going around recently of a kid who discovers one of these Black Lotus cards in a random pack.\n(SOUNDBITE OF VIDEO)\nUNIDENTIFIED MAN: (Laughter) That's a freaking Black Lotus. That's an Alpha freaking Lotus. That should - holy - oh, my God (laughter).\nSMITH: All of the sudden, Magic had the makings of a classic fad - a flash in the pan. There is a very logical thing to do when this happens to you. Make as much money as you possibly can before it goes away.\nELIAS: People at the company - a lot of them wanted to push that side of it - produce more cards, produce rarer cards, keep the print runs limited.\nSMITH: But if the company had gone in this direction, there is a chance that you would never have heard of Magic ever again because whenever there's a bubble - in Beanie Babies, in comic books, in collectible wizard cards, the bubble peaks quickly and then it crashes. Skaff and the early makers of the cards were former math graduate students, and they knew this. And Skaff was telling his colleagues, if we don't do something to deflate this bubble, this game won't be around in two years.\nELIAS: The more that these cards got bought up by speculators, the less that people could play.\nSMITH: So what do you do when your product is way too popular - when you have a scarce resource and speculators are taking advantage of it? Well, you make more of the product.\nELIAS: And so we just blew them out. I mean, we just printed so many cards of the new sets coming out. We warned people that we were going to do that. We basically printed enough that we thought we could drive the price down.\nSMITH: It was like an economic battle. Skaff says they would print the new cards and then go out to the resale market to check the prices, and if the cards were reselling for, say, a hundred bucks, they would come back and print more and more until the packs were back down to $3. And as for the rare cards out there - the Black Lotus, those sort of things, they didn't reprint those, but they did tweak the rules to make them at least a little less desirable.\nELIAS: We heard from so many people that we were destroying the game over and over again. Like it's - this is the end. You guys have screwed everything up, in much more colorful language.\nSMITH: But it worked. Magic, the collectible card game, became primarily Magic, a fun game you play with your friends. You didn't need hundreds of dollars or rare cards to play. The company probably made a lot less money in the short-term, but the game stuck around longer than anyone thought. They still print Magic cards, and people still line up to buy them.\nUNIDENTIFIED WOMAN: Please wait to the back of the line, and we will take care of you at the end.\n(CHEERING)\nSMITH: This place is called the Twenty Sided Store in Brooklyn. Twenty-two years after the beginning of the Magic bubble, people still come out to get the newest cards and play them against each other. There are still some cards that are cooler than others. In this pack, everyone wants a card with the Ugin. It's a large dragon surrounded by this blue mist.\nUNIDENTIFIED MAN: Oh, that's sick.\n(LAUGHTER)\nUNIDENTIFIED GROUP: Oh.\nUNIDENTIFIED MAN #2: We got an Ugin.\nUNIDENTIFIED MAN #3: Who got an Ugin?\nUNIDENTIFIED MAN #4: We got an Ugin.\nUNIDENTIFIED MAN #2: Yeah, got an Ugin.\nSMITH: The Ugin - is that cool?\nUNIDENTIFIED MAN #2: It's pretty cool.\nUNIDENTIFIED MAN #5: That is the best card in the set.\nSMITH: All right. Are you going to sell it?\nUNIDENTIFIED MAN #2: Maybe.\nSMITH: Not this second though?\nUNIDENTIFIED MAN #2: Not this second. For now I'm playing with it.\nSMITH: This - this moment right here is a sign that the plan worked. This guy gets the card everyone wants, and rather than framing it or trying to resell it to collectors, he does what you're supposed to do in a game. He plays it. Robert Smith, NPR News, New York.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=400140583"}
