{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-22 23:23:16","date_modify":"2018-10-22 23:23:16","date_publish":"2016-01-28 12:17:25","description":"Footage recorded by British traveller Howard Godolphin shows the plane rocking from side to side and flying low over the runway at Dublin Airport before the landing is abandoned.","filename":"data/vaneerConsumption/PlaneforcedtoabandonlandingatDublinAirportinStormJonas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA375300000578-0-image-a-3_1453983535422.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3419034_Plane-forced-abandon-landing-Dublin-Airport-Storm-Jonas_1540250596.html","title":"Plane forced to abandon landing at Dublin Airport in Storm Jonas","title_page":"Plane forced to abandon landing at Dublin Airport in Storm Jonas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Passengers were left startled when a plane was forced to abort a landing attempt as it was battered by high winds from Storm Jonas.\nFootage recorded by a passenger, who was in a window seat near the right wing, shows the plane rocking from side to side as it approaches Dublin Airport.\nFlying under dark skies, the plane flies low over the runway before it lifts off to make a second attempt.\nFootage captured by a passenger shows the plane rocking from side to side as it approaches Dublin Airport\nThe go-around occurred yesterday while Ireland was walloped by damaging wind gusts and coastal flooding from a storm that killed more than two dozen people in the US before crossing the Atlantic.\nBritish passenger Howard Godolphin, 53, told the Irish Independent that the plane was shaking violently and fellow travellers became upset.\nHe said: ‘The nearer the ground we came, the gusts seemed a lot more severe. That would upset the balance of the aircraft more.\n‘I was looking out at the wing, it was going up, then down, then up. The plane was going from left to right as well.’\nThe clip captured by British traveller Howard Godolphin shows passengers' perspective of the go-around\nHe added: ‘A few people were quite frightened. A young lady sitting near me, her knuckles were white as she was clinging to her seat. People were very, very nervous.’\nIn the video clip, one passenger is heard saying ‘Oh my God’ after the landing was abandoned.\nGodolphin said passengers were warned that the descent would be turbulent.\nPassengers gave the flight crew a round of applause when the plane landed safely on its second attempt, which he said was also ‘quite scary’.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3419034/Plane-forced-abandon-landing-Dublin-Airport-Storm-Jonas.html"}
