{"authors":[],"date_download":"2018-10-22 22:56:15","date_modify":"2018-10-22 22:56:15","date_publish":"2014-06-11 11:09:36","description":"Zeinat Akhras, a 65-year-old pharmacist, was one of few civilians who stayed behind in the city during a seige by government forces.","filename":"data/vaneerConsumption/PlantsBooksHelpSyrianSurvive700DayBlockadeofHoms.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/501406/140611-syria-homs-zeinat-akhras-720a_390eb6aef507271eb44957271935c57b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_plants-books-help-syrian-survive-700-day-blockade-homs-n128181_1540248975.html","title":"Plants, Books Help Syrian Survive 700-Day Blockade of Homs","title_page":"Plants, Books Help Syrian Survive 700-Day Blockade of Homs","title_rss":"NULL","source_domain":"nbcnews.com","text":"Akhras and her two brothers were among the few civilians who stayed until the end, in their multi-story family home in the al-Maljaa quarter, decorated like many of the area's homes in an Arab medieval style of black-and-white geometric facades.\nThey stayed because they feared rebels would seize the building — the fate of other abandoned homes — or would loot the family pharmacy or clothing shop.\nIn the beginning, the siege was tolerable because Akhras' family had hoarded provisions for the sometimes long lockdowns during previous gunbattles. They were well stocked with rice, beans and cracked wheat and fuel.\n\"We'd hear explosions day and night. You get used to it\"\nAs the blockade deepened, Akhras rarely left the building — perhaps six times during the 700 days, she estimated.\n\"I used to come back sad from seeing the destruction. This area used to be full of life,\" she said.\nLife took on a routine.\nHer brothers Anas and Ayman went out to check on their businesses and kept an eye on the nearby Mar Elia church. She cooked, kept the building tidy. She rose at dawn and slept at sunset, since there was no electricity. Over the course of the two years, at least 12 shells slammed into their home, causing damage upstairs.\n\"It was bothersome, because we'd hear explosions day and night. You get used to it.\"\nA priest asked the Akhras siblings, who are Christians, to hide valuable church property. So gradually, icons and boxes of centuries-old church records piled up in their home. Then, their pharmacy and clothes shop were looted in 2013, so the brothers brought home boxes of remaining medicines and clothes to store as well.\nAs the siege dragged on, rebel fighters showed up repeatedly demanding food and fuel, Akhras said. They usually came in groups, ordering Akhras to sit in the living room as they raided the kitchen and the upstairs apartments where food was kept. One young rebel snatched a jam jar that \"barely had a spoonful left in it,\" she recalled.\nToward the end, the fighters didn't even bother to come with guns — they simply knocked on the door and demanded food. Finally, in mid-2013, armed rebels surrounded the building and came in, carrying away nearly the entire stock of food and fuel. The siblings were left with only cracked wheat, which ran out by January.\nStill, she said her family was not harassed by the Sunni rebels for being Christian — it appeared to be because her house was the one with food.\nTragedy came in December. One of her brothers, Anas, who was suffering from cancer, left in a U.N. organized evacuation of hundreds of civilians from the Old City. He died 19 days later.\nFor the last months, Akhras kept her mind on daily tasks.\nWithout fuel, her surviving brother Ayman collected firewood. With their supplies down to only tea, oil and spices, Ayman also collected greens — dandelion, chicory and mallow, plants so unnoticed by a city-dweller that Akhras referred to them simply as \"grass.\" Even those became so scarce that Ayman dug for them in a church cemetery.\nAkhras' duties now included chopping wood to fuel the subya, a traditional heater-oven. She learnt to soak, boil and spice the salvaged greens.\nShe lost her appetite on the bitter, monotonous meals. She withered from about 127 pounds when the blockade began to 75 pounds, shrinking as her space grew smaller.\n\"I was smaller than a child!\"\nAkhras said she didn't want to upset herself by looking in the mirror. \"I knew I had lost weight. It was like I was on a diet I never wanted.\"\nOnly after the siege was over did she finally see her transformation — she saw herself on TV, in footage of the army's entry. \"I was smaller than a child!\" she exclaimed.\nIn free hours trapped in her home, Akhras devoured books — the Bible and stories of saints, mostly. Neatly arranged on her coffee table stood a row of large bullet casings.\nHer darkest days, she said, came after Anas died and when Ayman went to sleep in another building they own to keep away looters. She was left alone as rebels raided the building again, this time digging upstairs for more medicine and clothing.\n\"I missed my siblings — we are six girls and six boys. I missed my mother who died at the end of 2011,\" she said.\nAkhras initially didn't know on May 9 that the blockade had been lifted and government troops had entered the neighborhood. She has no radio and did not listen to the news. In a rare outing to the well across her alleyway, she saw a man who told her, \"The army is here.\"\nSurprised, Akhras found a soldier and asked him for bread — still unaware of how skeletal she appeared. The soldier bought her two dozen pieces of pita bread.\n\"I ate a whole piece of bread myself,\" she said, her eyes shining. \"It tasted like sweets.\"","url":"https://www.nbcnews.com/news/world/plants-books-help-syrian-survive-700-day-blockade-homs-n128181"}
