{"authors":["Sarah Rumpf"],"date_download":"2018-10-30 19:26:57","date_modify":"2018-10-30 19:26:57","date_publish":"2015-07-30 13:24:43","description":"As Breitbart News reported, Planned Parenthood claimed that they had been hacked on Sunday evening. But it looks like an inside job.","filename":"data/vaneerConsumption/PlannedParenthoodsHackedWebsiteLooksLikePRStunt.json","image_url":"https://media.breitbart.com/media/2015/07/PP.org-screenshot-homepage.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_30__1540927617.html","title":"Planned Parenthood's 'Hacked' Website Looks Like PR Stunt","title_page":"Planned Parenthood's 'Hacked' Website Looks Like PR Stunt | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As outcry grows in response to a series of undercover videos revealing Planned Parenthood (PP) employees appearing to engage in selling organs and tissues from aborted babies for profit, the abortion provider claimed that “extremists” had hacked their website.\nAs Breitbart News reported, PP claimed that it had been hacked on Sunday evening.\nThe hacking followed several weeks of extremely negative press for PP in response to videos released by the Center for Medical Progress (CMP). So far, three videos have been released (See here, here, and here for Breitbart News’ coverage), and more are promised soon.\nAt least one other video is known to exist and has been provided to the Texas Attorney General’s Office, where it is the subject of an investigation. Efforts to defund PP of taxpayer dollars — the group reportedly receives more than $500 million each year in federal funding — have been renewed in Congress.\nPP initially responded by claiming that the videos were edited in a misleading way, but CMP had also posted hours of unedited raw video with each of their releases. The abortion provider also tried denying the content of the videos, claiming that the interpretations are unfair, but each subsequent video has ended up refuting the defenses PP offered for the one before it. Within the past few days, PP hired a high-powered public relations firm, SKDKnickerbocker, well-known for its work on behalf of liberal causes and close ties to the Obama administration. PP’s latest moves include having SKDK pressure media outlets not to cover the story and filing lawsuits to block future releases.\nUnlike most other website hacking events that have made the news, PP’s website was not altered to display any message from the alleged hackers. Nor was it otherwise vandalized. The website that first reported the alleged hacking, The Daily Dot, noted that the hackers were unable to deface PP’s website or access its Twitter account, but that they claimed to have accessed emails and other databases.\nIntriguingly, while PP’s website does not show any negative changes from the alleged hackers, it does display a message that many critics are challenging as a public relations stunt. Even if PP was legitimately targeted by hackers over the weekend, there are a number of indicators that at this point, their website issues have been deliberately triggered.\nAs of Wednesday evening, visitors to www.PlannedParenthood.org would find a nearly empty site with text stating that: “We apologize, but our website is not available because of an extremist attack. 200,000 people a day are now being blocked from information and care by this attack.” The message reflects one of the group’s favorite strategies: to shield the details of their abortion services behind claims that they are simply providing “women’s health” or “reproductive services.”\nBelow the text, a link that says “LEARN MORE,” which directs to Planned Parenthood Action Fund’s Facebook page. That Facebook page implores the reader to “help PP fight back,” by — no surprise here — making a donation. The donation page says:\nPlanned Parenthood has been the target of hackers seeking to intimidate and silence us. Hundreds of thousands of patients who rely on plannedparenthood.org for health information and services have been denied access. The attacks on Planned Parenthood are an attempt to cut people off from care, plain and simple. We can’t let that happen, and we won’t. Please chip in what you can to help make sure patients can get the care they need — and ensure that Planned Parenthood can’t be silenced.\nSeveral sharp-eyed Twitter users noted some key quirks in PP’s website that give credence to the theory that this is a PR stunt. As digital media consultant Stephen Miller (@redsteeze) observed, not only did PP maintain control of the homepage of their website so as to put up their sympathetic message, they also had the ability and the time to tweak the font and alignment.\nTheir site is so hacked right now that someone has been rearranging CSS fonts and alignment. pic.twitter.com/7vxO4siXJH — Stephen Miller (@redsteeze) July 30, 2015\nLooking up the source code for the website (accessible by right-clicking the website and choosing “View page source“), PP’s programmers named the landing page “Campaigns,” and identified the page as “Site Down Tempalte,” presumably a misspelling of “template.”\nThey even titled their landing page “Campaigns” and misspelled “Template” in source coding. Hilarious. pic.twitter.com/OY6NZzBDvd — Stephen Miller (@redsteeze) July 30, 2015\nA number of other people questioned the timing of the recent changes to PP’s website, with it going offline and then back up, and so on. Many found it suspicious that the website went “down” days after the alleged hacking occurred.\n“We got hacked a couple days ago, right? Let’s get ‘hacked’ again. It’ll work, I swear.” – Meeting at Planned Parenthood earlier today. — RB (@RBPundit) July 30, 2015\nNot only does PP have their propaganda message and a link to their Facebook page on this allegedly “hacked” website, they also took the time to include “breadcrumb” navigation information (a type of secondary navigation that is helpful on large, multi-page websites) and Twitter card codes. Twitter cards assist with social media sharing by defining the language that will be auto-filled in if a website visitor Tweets a link from the site. (For an example of how this works, clicking the “Tweet” button at the top and bottom of this article will bring up a Tweet with language already drafted that includes the headline of the article, the link, and @BreitbartNews.)\nIn other words, this “hacked” website is optimized for search engines and social media sharing. If the site is truly hacked, and this message is only necessary while they fix whatever the security breach is, there would be no need to code Twitter cards to be added later. The obvious implication is that this is not being done because of hacking, but to gain sympathy for PP.\nAnother Twitter user, @SooperMexican, noted that PP had edited their Facebook message eliciting donations at least four times.\nLOL! Actually @PPact changed their facebook post about the fake “hacking” FOUR TIMES. Wow you suck at false attacks. pic.twitter.com/hvprhrWnuV — el Sooper ن (@SooperMexican) July 30, 2015\nAt this point, it is worth taking a moment to recall how, earlier this month, on-demand car service Uber fought back against New York City Mayor Bill de Blasio’s efforts to enact a cap on the number of cars it would be allowed to have operating in the city. As Breitbart News reported, Uber updated its app for the NYC market to include a “DE BLASIO” option, that, when selected, would display a message that no cars were available, blaming de Blasio’s restrictions. Uber’s efforts were successful, and de Blasio backed down.\nHere is the connection between Uber’s communication strategy and PP: both are seeking to thwart the will of those who want to restrict their business, so they highlight for their supporters what deprivation of their work would look like. Call it the Anna Kendrick Stratagem: “You’re gonna miss me when I’m gone.” Uber, of course, deployed this strategy for a business that many conservatives view as a positive improvement to their transportation options, whereas PP is using it to protect their right to sell the scrap parts of aborted babies after they are finished crushing them to death in their mother’s womb. To-may-to, to-mah-to.\nAs mentioned above, PP’s PR firm has a number of close ties to the Obama administration. This is accomplished chiefly through several Obama campaign alumni that they employ, including Obama’s former White House communications director Anita Dunn, national press secretary for the campaign Bill Burton, and Rock the Vote founder Hilary Rosen, who previously made headlines for her role in the PP and Susan G. Komen Foundation kerfuffle.\nUber has a Team Obama connection too: David Plouffe, Obama’s 2008 campaign manager, serves on Uber’s board of directors as their Senior Vice President for Policy and Strategy.\nHere’s one more example of people connected to the Obama administration using a strategy of deliberate deprivation to cause pain and get their way: the barricading of the World War II Memorial in Washington, D.C. during the October 2013 government shutdown. Obama had blamed Republicans for creating the problem, and claimed that barricading the memorial was necessary, even though public records released later proved that was not the case.\nIt should be noted that it cannot be proved conclusively that PP is faking their website being hacked. At minimum, they are certainly milking it for all it is worth — not shocking coming from the “never let a crisis go to waste” mindset. With more CMP videos expected to be released throughout the summer and an estimated $540 million in federal funding at stake, it remains to be seen if PP will be able to rally support, and what else besides (possibly) faking the hacking of the website they are willing to consider doing.\nFollow Sarah Rumpf on Twitter @rumpfshaker.","url":"https://www.breitbart.com/politics/2015/07/30/planned-parenthoods-hacked-website-looks-like-pr-stunt/"}
