{"authors":[],"date_download":"2018-10-22 21:38:26","date_modify":"2018-10-22 21:38:26","date_publish":"2014-05-07 20:14:37","description":"Plant life may touch down on Mars in 2021.","filename":"data/vaneerConsumption/PlantLifeonMarsNASAMaySendUpGreenhousein2021.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/427271/mpx-mars-2020-rover_9f36d1295e43a204b2b1e956ffd791d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_plant-life-mars-nasa-may-send-greenhouse-2021-n99696_1540244306.html","title":"Plant Life on Mars? NASA May Send Up Greenhouse in 2021","title_page":"Plant Life on Mars? NASA May Send Up Greenhouse in 2021","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"In order to do a long-term, sustainable base on Mars, you would want to be able to establish that plants can at least grow on Mars,\" MPX deputy principal investigator Heather Smith, of NASA's Ames Research Center in Mountain View, California, said April 24 at the Humans 2 Mars conference in Washington, D.C. \"This would be the first step in that … we just send the seeds there and watch them grow.\" [The Boldest Mars Missions in History]\nThe MPX team — led by fellow Ames scientist Chris McKay — isn't suggesting that the 2020 Mars rover should play gardener, digging a hole with its robotic arm and planting seeds in the Red Planet's dirt. Rather, the experiment would be entirely self-contained, eliminating the chance that Earth life could escape and perhaps get a foothold on Mars.\nMPX would employ a clear \"CubeSat\" box — the case for a cheap and tiny satellite — which would be affixed to the exterior of the 2020 rover. This box would hold Earth air and about 200 seeds of Arabidopsis, a small flowering plant that's commonly used in scientific research.\nThe seeds would receive water when the rover touched down on Mars, and would then be allowed to grow for two weeks or so.\n\"In 15 days, we'll have a little greenhouse on Mars,\" Smith said.\nMPX would provide an organism-level test of the Mars environment, showing how Earth life deals with the Red Planet's relatively high radiation levels and low gravity, which is about 40 percent as strong as that of Earth, she added.\n\"We would go from this simple experiment to the greenhouses on Mars for a sustainable base,\" Smith said. \"That would be the goal.\"\nIn addition to its potential scientific returns, MPX would provide humanity with a landmark moment, she added.\n- Mike Wall, Space.com\nThis is a condensed version of a report from Space.com. Read the full report. Follow Mike Wall on Twitter @michaeldwall and Google+. Follow us @Spacedotcom, Facebook or Google+. Originally published on Space.com.\nCopyright 2014 SPACE.com, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/space/plant-life-mars-nasa-may-send-greenhouse-2021-n99696"}
