{"authors":[],"date_download":"2018-10-30 19:27:53","date_modify":"2018-10-30 19:27:53","date_publish":"2017-04-12 20:57:00","description":"As questions swirl about when Mercedes-Benz Stadium will open, organizers of the building’s fi...","filename":"data/vaneerConsumption/PlansunveiledforcollegefootballtitlegameinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/12/Images/newsEngin.18372987_040417-atlanta-aerials-ba-013.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_plans-unveil_1184f1e6fef30a882c7676a925557f5c__1540927673.html","title":"Plans unveiled for college football title game in Atlanta","title_page":"College football national championship game 2018 in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"As questions swirl about when Mercedes-Benz Stadium will open, organizers of the building’s first scheduled mega-event — the college football national championship game Jan. 8 — announced Wednesday the lineup of fan activities leading to the game.\nRELATED\nHow Selection Sunday will work Dec 3, 2017\nCFP Ranking and Schedule: Live updates\nThe lineup includes several three-day events Jan. 6-8: Playoff Fan Central, a 300,000-square foot interactive attraction inside the Georgia World Congress Center; AT&T Playoff Playlist Live, a free series of concerts and fireworks shows in Centennial Olympic Park; and Championship Tailgate Plaza, a gathering place for outdoor activities on International Plaza near the stadium.\nAn open-to-the-public media day, where 1,000 journalists will interview the players and coaches, will be held in Philips Arena on Jan. 6. A 5K road race will be held Jan. 7. Atlanta restaurants will be featured at a Taste of the Championship food event at the Georgia Aquarium on Jan. 7.\n“It is the perfect setup for this major event,” Atlanta Sports Council President Dan Corso said. “All the venues and hotels are in walking distance of Mercedes-Benz Stadium.”\nAlso Wednesday, it was announced that the Atlanta Football Host Committee and College Football Playoff will make a $75,000 donation to fund a cutting-edge learning laboratory at Atlanta’s Scott Elementary School.\nForty second-grade students from the school attended the announcement.\nSpeaking at the ceremony, College Football Playoff Executive Director Bill Hancock and Falcons President and CEO Rich McKay praised Mercedes-Benz Stadium as a venue for the championship game.\n“There will not be a finer stadium in the world than this one,” said Hancock, who spent 90 minutes in the building Wednesday.\n“When you see the design of it, when you go for the first time,” McKay said, “I think you will be somewhat overwhelmed by many of the elements.”\nMcKay did not address when the stadium will open. He left without taking questions from the media.\nIssues associated with the $1.5 billion stadium’s complex retractable roof have delayed the scheduled opening twice, first from March 1 to June 1 and then to July 30, when Atlanta United is slated to play there. Team and stadium officials say the July 30 opening date hasn’t changed, but they also have promised an upcoming update on the construction schedule.\nHancock said he hasn’t been told when the stadium will open.\n“We have not asked the question too often because we know it will be ready by Jan. 8,” Hancock said. “There will be a lot of football played in that building before the championship game. … We have no concerns about this building at all.”\nMLS Commissioner Don Garber said during the opening of Atlanta United’s training ground Tuesday that he looks forward to the team playing in the new stadium in September. He later said he misspoke about the timing.\nQuestions also loom about whether the stadium might have to open with its roof not fully operable. In any case, Hancock said the college football title game would be “99 percent sure” to play with the roof closed.","url":"https://www.ajc.com/sports/college/plans-unveiled-for-college-football-title-game-atlanta/Qkzzwr8y0SHb5kqK2s0ilN/"}
