{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 02:46:05","date_modify":"2018-10-23 02:46:05","date_publish":"2017-03-16 13:20:05","description":"Images show planes rusting in the undergrowth and creepy underground chambers at the Bihać Air Base, on the border between Croatia and Bosnia and Herzegovina.","filename":"data/vaneerConsumption/Planesarereclaimedbynatureatabandonedmilitarybase.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E53E98300000578-0-image-a-208_1489670293047.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320186_Planes-reclaimed-nature-abandoned-military-base_1540262765.html","title":"Planes are reclaimed by nature at abandoned military base","title_page":"Planes are reclaimed by nature at abandoned military base | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"These eerie photographs show how titans of the sky have been left to rot after being reclaimed by nature at an abandoned military base.\nImages show planes rusting in the undergrowth and creepy underground chambers at the Bihać Air Base, on the border between Croatia and Bosnia and Herzegovina.\nThe vast military facility, built between 1948 and 1968 under Mount Pljesevica, was once one of the largest in Europe.\nNow overgrown and crumbling, the air base, code-named 'Objekat 505', cost the former Yugoslavia nearly £5billion.\nEerie photographs show how titans of the sky have been left to rot after being reclaimed by nature at an abandoned military base. A propeller plane can be seen rusting in the trees at the facility\nImages show planes rusting in the snow at the Bihać Air Base, on the border between Croatia and Bosnia and Herzegovina\nThe vast military facility, built between 1948 and 1968 under Mount Pljesevica, was once one of the largest in Europe\nThe giant interior of one of the rusting military planes can be seen in one picture. The abandoned facility is on the border of Croatia and Bosnia\nAs well as rusting planes, the air base also features these underground chambers where helmets and gas masks (bottom right) can be seen abandoned on the ground\nAbandoned: Once the focal point of the £5million air base, the facility's runway is now crumbling and overgrown with weeds\nIt became one of the largest and most expensive military construction projects in Europe aimed at providing a nationwide early warning radar network akin to NORAD.\nThe complex was reportedly designed and built to sustain a direct hit from a 20-kiloton nuclear bomb, equivalent to the one dropped on Nagasaki in Japan at the end of the Second World War.\nIt was strategically placed to house the country's 'Celopek' intercept and surveillance radar on Mount Pljesevica.\nThe facility became one of the largest and most expensive military construction projects in Europe aimed at providing a nationwide early warning radar network akin to NORAD. One of its underground chambers is pictured above\nSecret entrance: The way in to the underground chambers is virtually concealed by trees and overgrowth having been abandoned for years\nIn decline: This rusting propeller plane is among the many relics at the abandoned airbase on the border between Croatia and Bosnia\nFormer glory: One military plane, with its windows and doors long since stripped away, is almost completely hidden among the undergrowth\nDisrepair: A close up shot of one of the abandoned planes shoes the mechanics of the propeller. The base was once one of Europe's largest\nThe baes was strategically placed to house the country's 'Celopek' intercept and surveillance radar on Mount Pljesevica\nThe complex was reportedly designed and built to sustain a direct hit from a 20-kiloton nuclear bomb, equivalent to the one dropped on Nagasaki in Japan at the end of the Second World War\nInner workings: Pictures show the rusting interior of a pilot's cockpit (right) on one plane while the window of another is pictured, left\nIn the cockpit of one abandoned plane, the photographer pictured two steering wheels and a series of rusting control levers\nGoing underground: Piles of rubble now lie at the entrance to the facility on the border between Croatia and Bosnia and Herzegovina under Pljeöevica Mountain\nOff road: As well as planes and military equipment, a rusting truck was also found in the abandoned facility\nBut the airbase also contained underground tunnels housing two full fighter squadrons, one reconnaissance squadron, and associated maintenance facilities.\nToday, the base often serves as a waypoint for migrants crossing through the country. A facility for asylum seekers was scheduled to open there in 2004 or 2005, but the idea was abandoned, and new plans were developed for it to become part of the Slunj military training grounds, and barracks from the nearby Udbina complex.\nThis idea was dropped, however, in line with the agreement between the countries of former Yugoslavia which bans any military facility up to 15 km inside the borders.\nOvergrown: Weeds can be seen growing up through the engine of one abandoned plane at the giant disused airbase\nThe airbase also contained underground tunnels housing two full fighter squadrons, one reconnaissance squadron, and associated maintenance facilities\nToday, the base often serves as a waypoint for migrants crossing through the country. A facility for asylum seekers was scheduled to open there in 2004 or 2005, but the idea was abandoned, and new plans were developed for it to become part of the Slunj military training grounds, and barracks from the nearby Udbina complex\nA sign at the facility warns visitors of the threat of mines in the area. The base has long been abandoned despite costing billions to construct\nAn unidentified item of rusting equipment was found in one building at the site which was built between 1948 and 1968\nPlans to turn the area in to a training base for the military were dropped in line with the agreement between the countries of former Yugoslavia which bans any military facility up to 15 km inside the borders\nThick metal wiring could be seen twisted together in the wreckage of one crumbling building at the abandoned air base\nSunlight shines through gaps in a bunker at the airbase - one of the many underground chambers at the vast facility\nHidden away: This military jet has been almost completely covered by trees and weeds on one part of the abandoned airbase\nOnce one of Europe's largest and costliest airbases the site is now full of rusting planes, A close up shows some of the rusting remains\nDilapidated: Pictures from inside one of the aircraft show how panels have been ripped off with much of the inner workings now rusty\nConstruction of the giant air Base, code-named 'Objekat 505', began in 1948 and was completed in 1968 costing billions of pounds\nAn examination of the site reveals a series of underground tunnels and chambers that formed part of a huge air base\nGrounded: Pictures show the steering column of a plane abandoned in the undergrowth of the vast military base","url":"https://www.dailymail.co.uk/news/article-4320186/Planes-reclaimed-nature-abandoned-military-base.html"}
