{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 22:19:06","date_modify":"2018-10-30 22:19:06","date_publish":"2016-08-17 22:33:09","description":"The undercover journalist who exposed Planned Parenthood’s alleged baby-parts-for-sale scheme is responding to yet another lawsuit filed by the abortion giant in a federal court demanding further suppression of public records of its fetal harvesting activities. | Politics","filename":"data/vaneerConsumption/PlannedParenthoodsLatestAttemptToSuppressItsBabyPartsScandal.json","image_url":"https://media.breitbart.com/media/2015/08/youth-protest-planned-parenthood-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_17__1540937946.html","title":"Planned Parenthood’s Latest Attempt To Suppress Its Baby Parts Scandal","title_page":"Planned Parenthood’s Latest Attempt To Suppress Its Baby Parts Scandal","title_rss":"NULL","source_domain":"breitbart.com","text":"The undercover journalist who exposed Planned Parenthood’s alleged baby-parts-for-sale scheme is responding to yet another lawsuit filed by the abortion giant in a federal court demanding further suppression of public records of its fetal harvesting activities.\n“What is Planned Parenthood hiding about their new model baby parts program at the University of Washington?” asks David Daleiden, project lead at Center for Medical Progress (CMP). “The American people, whose tax dollars make this entire barbaric industry possible, deserve to know the truth.”\nPlanned Parenthood filed a lawsuit against the University of Washington on August 4 in federal court to block the school from revealing information about the abortion business’ involvement in its fetal parts research program.\nIn Daleiden’s declaration, filed Monday, he refers to the University of Washington’s Birth Defects Research Laboratory (BDRL), which was mentioned as well in the now well-known video featuring Planned Parenthood Federation of America’s senior director of medical services, Dr. Deborah Nucatola, discussing the harvest and sale of aborted fetal body parts while eating a salad at lunch.\nNucatola, Daleiden says, referenced the BDRL as the “group at the University of Washington that reached out directly to” Planned Parenthood affiliates.\nIn scrambling to defend itself against the video series produced last year, Planned Parenthood and its political and media allies have used tactics largely focused on suppression of information about its apparent practices — the same type of tactics that led to convicted murderer Kermit Gosnell’s long career as an abortionist at his “house of horrors” clinic in the Philadelphia area.\nFor example, under suspicion of bias, Harris County, Texas, District Attorney Devon Anderson convened a grand jury that cleared Planned Parenthood of any wrongdoing in the video exposé and, instead, indicted Daleiden and his colleague Sandra Merritt. Two pro-choice law professors wrote the indictment of the journalists amounted to “a stunning act of legal jujitsu” and was a “deeply disturbing” outcome both for the First Amendment and undercover citizen journalists attempting to expose corruption.\nSubsequently, a judge dismissed all charges against Daleiden, though many media outlets hardly reported this news at all.\nMeanwhile, congressional Democrats – whose Party now fully embraces abortion-on-demand – are vowing not only to defend Planned Parenthood against the elimination of its half a billion dollar federal funding per year, but also to expand its taxpayer funding by repealing the Hyde Amendment. Democrats attempted to suppress any further release of damning information about Planned Parenthood’s practices by demanding a complete shut-down of congressional investigation into the abortion business.\nIn addition, while Planned Parenthood has denied any wrongdoing in its sale of body parts, its president Cecile Richards also released a statement in October announcing it will no longer accept payments for aborted fetal tissue. The narrative put forward at that point was that the videos produced by CMP were “deceptively edited.”\nNevertheless, a Democrat opposition research firm named Fusion, hired by Planned Parenthood itself to review the videos, said that while its staff observed the videos had been edited – as most videos are – “the analysis did not reveal widespread evidence of substantive video manipulation.”\nAdditionally, Fusion noted, “[A]nalysts found no evidence that CMP inserted dialogue not spoken by Planned Parenthood staff.”\nAn analysis by Coalfire, a third-party forensics company hired by Alliance Defending Freedom, found that the videos were “not manipulated” and that they are “authentic.”\nDaleiden and his attorneys filed responses to the plaintiffs’ motions for temporary injunctions, a motion to dismiss the lawsuit, and a declaration by Daleiden showing the involvement of the University of Washington in aborted fetal parts research.\nDaleiden’s CMP said in a statement:\nLast October, Planned Parenthood President Cecile Richards hailed the partnership between Planned Parenthood Greater Washington & North Idaho and the University of Washington as the exemplary model of their new program for profit-neutral baby parts harvesting. Numerous headlines proclaimed Planned Parenthood’s new “policy change” purporting to stop receiving payment for fetal body parts, after CMP’s videos had revealed Planned Parenthood’s senior leadership callously negotiating the harvest and sale of tiny baby hearts, lungs, and brains for profit. Over the past year, the American people have watched as Planned Parenthood has scrambled to distract the public and public authorities from the scandal—even while Planned Parenthood has failed the answer the most basic questions about their baby body parts program. What is Planned Parenthood hiding about their new model baby parts program at the University of Washington? The American people, whose tax dollars make this entire barbaric industry possible, deserve to know the truth.\n“The people have a right to know how their government is run,” says Peter Breen, legal counsel for David Daleiden and CMP and special counsel for the Thomas More Society in a statement. “The plaintiffs here work at a taxpayer-funded state university, and their work is subject to the same sunshine and open records laws as any other government employee.”\n“The abortion clinic and fetal tissue personnel who brought this lawsuit should not be allowed to prevent the people of the State of Washington from monitoring their government’s involvement in the national controversy over aborted fetal body parts,” he continues. “These plaintiffs seek to stop release of records owned by the public, but the Washington Public Records Act requires transparency and openness, not obfuscation and delay. We are confident that the public’s right to know will be vindicated in court.”","url":"https://www.breitbart.com/politics/2016/08/17/planned-parenthoods-latest-attempt-suppress-baby-parts-scandal/"}
