{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:25:52","date_modify":"2018-10-30 18:25:52","date_publish":"2016-04-18 23:32:12","description":"Planned Parenthood president Cecile Richards told Hillary Clinton supporters at a New York City rally that her deceased mother, former Gov. Ann Richards | Politics","filename":"data/vaneerConsumption/PlannedParenthoodPrezAWomanVotingforTedCruzIsLikeaChickenVotingforColSanders.json","image_url":"https://media.breitbart.com/media/2016/04/bucket-of-chicken-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_18__1540923952.html","title":"Planned Parenthood Prez: ‘A Woman Voting for Ted Cruz Is Like a Chicken Voting for Col. Sanders’","title_page":"Planned Parenthood Prez: ‘A Woman Voting for Ted Cruz Is Like a Chicken Voting for Col. Sanders’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Planned Parenthood president Cecile Richards told Hillary Clinton supporters at a New York City rally that her deceased mother, former Gov. Ann Richards of Texas, would have said that “a woman voting for Ted Cruz is like a chicken voting for Colonel Sanders.”\nWATCH: @CecileRichards at Clinton rally: \"A woman voting for Ted Cruz is like a chicken voting for Colonel Sanders\" https://t.co/01YIyQUJEm — ABC News Politics (@ABCPolitics) April 18, 2016\nThe pro-life organization March for Life, however, observed that Richards “inadvertently drew attention to her organization’s practice of selling fetal parts for research” in her attack against Cruz.\n“Cecile Richards’ comment today is incredibly condescending towards women—pro-life or not,” said Jeanne Mancini, President of the March for Life Education & Defense Fund. “It shows what a profoundly disintegrated perspective she has of the relationship between a mother and her unborn baby.”\nSanders founded Kentucky Fried Chicken, a successful fast-food chain known for selling cut-up chicken parts in a bucket.\nPlanned Parenthood has endorsed Clinton – the first time it has ever endorsed a candidate in a primary. The abortion business is reeling since a series of videos released last summer exposed its apparent practices of selling the body parts of babies it aborts and altering the position of babies during abortions in order to harvest the most intact organs.\nFond of referring to pro-life Republicans as telling “lies” about “women’s healthcare” – aka “abortion” – Planned Parenthood Action Fund’s executive vice president said last month about Carly Fiorina’s decision to endorse Cruz that he is “the biggest liar in the room” when it comes to “women’s health.”","url":"https://www.breitbart.com/politics/2016/04/18/planned-parenthood-prez-a-woman-voting-for-ted-cruz-is-like-a-chicken-voting-for-col-sanders/"}
