{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-22 22:56:29","date_modify":"2018-10-22 22:56:29","date_publish":"2016-01-28 11:30:57","description":"Dr Amedeo Usai, 48, who practised in Greater Manchester, fired off an abusive email to one patient who complained to medical watchdogs when she was left hospitalised after his care.","filename":"data/vaneerConsumption/PlasticsurgeonAmedeoUsaicalledpatientswhresbtchesandsltsstruckoff.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A95EAD00000578-0-image-a-8_1453980426725.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420784_Plastic-surgeon-botched-boob-jobs-called-patients-wh-res-b-tches-sl-ts-complained-struck-off_1540248989.html","title":"Plastic surgeon Amedeo Usai called patients 'wh*res, b*tches and sl*ts struck off","title_page":"Plastic surgeon Amedeo Usai called patients 'wh*res, b*tches and sl*ts struck off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A hot-headed plastic surgeon told a patient she was a 'f***ing stupid b*tch' in a foul-mouthed email after she complained about her botched breast implant surgery.\nItalian doctor Amedeo Usai, 48, snapped and fired off the angry message to the woman after she told medical watchdogs his poor aftercare led to her being admitted to hospital for three days with a severe infection in one of her breasts.\nThe shocking email - littered with spelling mistakes and grammatical errors - started 'I trust you are well' before firing a volley of insults.\n'This is to tell you that you are a lier (sic) a stupid f***ing lier (sic) who reported me to the GCM (sic) for no reasons (sic).\n'Shame on you stupid b*tch! I offered you my sincere help: you f***ing butch (sic) have reported stupid f***ing things that are out of minds!! (sic)\n'Do you have a brain? Do you have a soul? I bet you are just full of sh*t. F*** off.'\nUsai, based in Preston, Lancashire, was struck off the medical register after being found guilty of misconduct at a disciplinary hearing of the Medical Practitioners Tribunal Service.\nHe has since quit the UK to move back to his native Rome.\nAmedeo Usai sent the abusive email to a patient after she reported him to the General Medical Council for her botched breast implant surgery. The Italian surgeon's message was littered with spelling mistakes and grammatical errors\nThe tribunal heard an unnamed woman, from Bolton, known only as Patient E, was said to be 'shocked' at the contents of the abusive note.\nLater when a female General Medical Council investigator confronted Usai following complaints from the patient and four other women, he referred to them all in Italian as 'wh*res, b*tches and sl*ts'.\nHe subsequently fired off a further email to the investigator - again in Italian - saying: 'Hello nice p*ssy.'\nUsai was investigated after a string of complaints from five women over his face lift, liposuction, and breast augmentation treatments at private cosmetic clinics across Greater Manchester between 2009 and 2013.\nOn a woman's magazine forum, a number of posts discuss Usai's work after someone asked if people would recommend him for a nose job.\nOne woman, writing under the name Farrell 275, said her breasts had been 'butchered' by Usai.\nShe said: 'The scars r (sic) disgusting and I have had two ultra sounds and MRI scan and they (implants) both have leaked and very painful.'\nMany women claimed to have taken legal action against him, alleging his surgery left them with leaking implants and needing corrective surgery.\nThe tribunal heard how Patient E had undergone a breast enlargement in July 2013 at Bridgewater Hospital in Manchester.\nDo you have a brain? Do you have a soul? I bet you are just full of sh*t. F*** off Dr Amedeo Usai\nBut Usai failed to record full details of the two silicone implants she was given - instead writing illegible scrawl about them in his medical notes.\nThe following September, the woman had a follow-up meeting to discuss the operation in which she complained of swelling and pain in left breast consistent with an infection.\nBut he failed to appreciate how serious it was or take swabs and wrote a handwritten note saying: 'To be seen (..illegible words x 2) next (...illegible word) clinic.'\nUsai later had a further consultation with her and, although her breast was leaking, she was given a prescription for cream.\nShe was subsequently admitted to Bolton Hospital on December 28 2013 and was put on three days of intravenous antibiotics.\nThe hearing was told Usai should have urgently arranged to remove Patient E's left breast implant when it was clear she had an infection.\nBut instead he went abroad without giving the woman contact details for an alternative surgeon to help her. She recalled how she 'did not know what to do and felt alone'.\nAmedeo Usai was suspended by the General Medical Council before the hearing took place and has now been struck off. The tribunal said his actions demonstrated a 'deplorable attitude'\nOne patient known as C said Usai wrongly told her there was a 'one in several thousand risk of raised scarring' following breast reduction surgery - when it was in fact a possible one in 10 chance.\nShe later complained her stitches were 'overgrowing with skin' after Usai left them in too long and said her left breast was 'full of lumps like a beanbag.'\nA third woman known as Patient A, who underwent a facelift and neck liposuction, complained about her 'lower eyelid drooping'.\nBut Usai recorded a note saying she was 'doing fine' and adding: 'Pt, quite happy'.\nThese emails demonstrate Dr Usai's attitude of contempt for his patients Chitra Karve, tribunal chairman\nHe later even wrote: 'doing much better' when the patient said she could not close her eyes properly.\nA fourth woman known as D, whose incisions opened after breast surgery, had to be admitted to hospital for treatment after Usai checked the open wounds, prescribed cream and told her to 'let her body heal naturally'.\nIn his email to the GMC investigator in August last year, Usai referred to the four women and the fifth patient known as B as the Italian word 'troie' which was translated by an interpreter as 'b**ches/wh*res/sl*ts.'\nHis subsequent email to the official read: 'ciao bella fica' which translated as 'Hello, nice p*ssy'.\nUsai did not attend the Manchester hearing and instead fired off another email to the GMC saying: 'Why you want to extend your investigations when I am already dead? I am now a poor unemployed doctor in this poor country called Italy.\nThe woman who was sent the abusive email had undergone a breast enlargement in July 2013 at Bridgewater Hospital in Manchester (pictured). She complained after one breast became infected and needed three days of intravenous antibiotics after Usai only gave her cream\n'May be (sic) I do not deserve anymore (sic) letters from you. Please leave me alone.'\nTribunal chairman Chitra Karve said: 'The Tribunal was appalled that a medical practitioner would use such language in emails to, and about, patients.\n'Doctors occupy a position of privilege and trust in society, and members of the public are entitled to place complete reliance upon doctors to act at all times with absolute respect for their patients.\n'These emails demonstrate Dr Usai's attitude of contempt for his patients.\n'Patient E was shocked when she received this email. She said that she had felt at risk and was worried about attending this hearing in case Dr Usai was in attendance as she feared for her safety.\n'Dr Usai's actions demonstrated a deplorable attitude to Patient E.\n'He has little or no insight - in fact when faced with these proceedings Dr Usai continued his inappropriate behaviour. The risk of repeated similar behaviour remains high.'","url":"https://www.dailymail.co.uk/health/article-3420784/Plastic-surgeon-botched-boob-jobs-called-patients-wh-res-b-tches-sl-ts-complained-struck-off.html"}
