{"authors":["Jon Fleischman"],"date_download":"2018-10-30 22:14:43","date_modify":"2018-10-30 22:14:43","date_publish":"2014-12-30 12:00:16","description":"Last September, we reported that the American Progressive Bag Alliance, which represents the plastic bag manufacturing industry, was launching a signature-gathering effort to attempt to stop the implementation of SB 270, legislation signed by Governor Brown, that would ban single-use plastic bags at grocery stores, and also require grocers to charge a ten-cent fee on every paper bag used, with proceeds going to the grocers. |","filename":"data/vaneerConsumption/PlasticBagBanHeadedtoCaliforniaVoters2016.json","image_url":"https://media.breitbart.com/media/2014/12/Plastic-bags-Jae-C.-Hong-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_12_30__1540937683.html","title":"Plastic Bag Ban Headed to California Voters 2016","title_page":"Plastic Bag Ban Headed to California Voters 2016","title_rss":"NULL","source_domain":"breitbart.com","text":"Last September, we reported that the American Progressive Bag Alliance, which represents the plastic bag manufacturing industry, was launching a signature-gathering effort to attempt to stop the implementation of SB 270, legislation signed by Governor Brown, that would ban single-use plastic bags at grocery stores,and also require grocers to charge a ten-cent fee on every paper bag used, with proceeds going to the grocers.\nWith the 90-day deadline to turn in 504,760 valid signatures, referendum backers said they have signatures from over 800,000 California voters — well over what would be necessary stop SB 270 from going into effect on July 1st, as it is scheduled to do now. By turning in the required number of voter-signatures, the implementation of SB 270 is on hold and the legislation actually will go before voters in the November 2016 general election. In the meantime the legislature is prohibited from passing any other bag ban legislation.\n“We are pleased to have reached this important milestone in the effort to repeal a terrible piece of job-killing legislation, and look forward to giving California voters a chance to make their voice heard at the ballot box in 2016,” American Progressive Bag Alliance spokesman Lee Califf said in a prepared statement.\nNeedless to say the news of this many signatures being turned in by opponents of the ban has evoked some strong statements by bag-ban proponents, such as Mark Murray of an advocacy group called California vs. Big Plastic, who told the Sacramento Bee, “It is clear that the plastic bag industry is more interest in their own profits than reducing an unnecessary source of pollution and waste that threaten California’s wildlife and pollutes our ocean, coast and our communities.”\nFor years legislation to ban plastic grocery bags failed to gain passage through the legislature, facing unified opposition by bag manufacturers, advocates of consumer choice, and grocers. This year the dynamic changed when a ten-cent fee on paper bags was put into a bill, with the proceeds not going to any state or local government programs, but rather those funds, which are estimated to be hundreds of millions of dollars, instead going to the profits of grocers. With this change in the legislation, most were not surprised to see the California Grocers Association do a complete turn-around and support SB 270.\nInterestingly, also opposing SB 270 as introduced was the United Food and Commercial Workers Union (UFCW) who represents the workers in grocery stores. However, the grocers engaged in back room meetings with the UFCW folks in the hours before the passage of the legislation, and then suddenly a memo was sent to all of the legislators on behalf of the UFCW removing their opposition to the bill. What deal was struck? It was done behind closed-doors, but of course there are a lot of spoils to be divvied up if the paper bag fee as structured into SB 270 is enacted by voters next year.\nEarly last month a University of Southern California/Los Angeles Times poll was released showing that among those voters surveyed the ban and paper bag fee enjoyed a 60%—35% advantage. Mitigating these results, however, was the fact that survey respondents were not informed that this new ten cent bag fee would go straight to the bottom line of grocers and not into any sort of environmental or recycling program. According to Mark Daniels of the American Plastic Bag Alliance, in the Orange County Register, “When consumers understand that this is a cash grab by the grocers, they oppose this horrible legislation.”\nIn talking to the Register, Daniels cites an internal APBA poll which he says shows a move in voter sentiment against the bag ban when those questioned are told that grocers will make millions from selling paper bags.\nBecause of legislation signed a couple of years ago by Governor Brown, all referendums and ballot measures placed onto the ballot through the collection of voter signatures must appear on November general election ballots. For decades these measures would simply appear on the next statewide ballot to occur (whether it was the primary, the general, or even a special election), except that when what was to become Proposition 32 qualified for the June 2012 ballot, the Democrat legislature and Governor worked together, passing this new law, forcing it to the November election. Traditionally, general elections have a higher turnout: that favors Democrats.\nThis referendum on the ban on plastic grocery bags will be the first of a great many high-profile items that are likely to appear on the November 2016 ballot — including several potential tax increase measures, a hike in the state’s minimum wage, public pension reform, and decriminalization of marijuana. The presence of so many issues on the ballot ensures that it will be a costly battle for both proponents and opponents of the bag ban, as they seek to influence voters with all of the competitive political noise, not to mention all of the national attention being paid to the Presidential election.","url":"https://www.breitbart.com/local/2014/12/30/statewide-plastic-bag-ban-opponents-turn-in-over-800k-signatures/"}
