{"authors":["Nate Raymond"],"date_download":"2018-10-30 21:39:47","date_modify":"2018-10-30 21:39:47","date_publish":"2016-12-19 00:00:00","description":"The founder of the New York-based hedge fund Platinum Partners was arrested on Monday as prosecutors unveiled an indictment charging him and six others.","filename":"data/vaneerConsumption/PlatinumPartnersMarkNordlichtarrestedandchargedwithfraud.json","image_url":"https://amp.businessinsider.com/images/5857f794a1a45e46008b6af0-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_platinum-partners-mark-nordlicht-arrested-on-alleged-1b-fraud-2016-12_1540935587.html","title":"Platinum Partners Mark Nordlicht arrested and charged with fraud","title_page":"    Platinum Partners Mark Nordlicht arrested and charged with fraud - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Platinum Partners' Mark Nordlicht, left, and Uri Landesman. REUTERS/Mark Hartman\nNEW YORK — The founder of the New York-based hedge fund Platinum Partners was arrested Monday as prosecutors unveiled an indictment charging him and six others with participating in an approximately $1 billion fraud.\nMark Nordlicht, Platinum's founding partner and chief investment officer, was taken into custody at his New Rochelle, New York, home in connection with charges contained in an indictment filed in federal court in Brooklyn.\nOthers arrested included David Levy, Platinum's cochief investment officer, and Uri Landesman, the former president of the firm's signature fund, FBI spokeswoman Adrienne Senatore said.\nPlatinum is liquidating its hedge funds, two of which have received bankruptcy protection.\nThe indictment said that since 2012, Nordlicht, Levy, and Landesman schemed to defraud Platinum investors by overvaluing illiquid assets held by its flagship fund.\nThis caused a \"severe liquidity crisis\" that Platinum at first tried to remedy through high-interest loans between its funds before selectively paying some investors ahead of others, the indictment said.\nNordlicht, Levy, and Jeffrey Shulse, the former chief executive officer of Platinum's majority-owned Black Elk Energy Offshore Operations LLC, also defrauded the Texas energy company's bondholders, the indictment said.\nA Platinum spokesman declined to comment. Nordlicht's lawyer did not immediately respond to a request for comment. Michael Sommer, Levy's lawyer, said he looked forward to clearing his client's \"good name.\"\nLawyers for Shulse and the other defendants could not be immediately identified.\nFounded in 2003, Platinum Partners until this year had more than $1.7 billion under management, the indictment said. The flagship fund reported returning profits of more than 8% in 2015 and 7% from January to April 2016, it said.\nBut this year, a series of investigations tied to Platinum came to a head, leading a Cayman Islands court to place its two main funds into liquidation in August.\nIn June, Murray Huberfeld, a Platinum associate who prosecutors say was a founder, was charged in Manhattan federal court with orchestrating a bribe to the head of the New York City prison guards' union, Norman Seabrook, to secure a $20 million investment. Both have pleaded not guilty.\nTwo weeks later, the FBI raided Platinum's Manhattan offices in a separate fraud investigation that culminated in Monday's indictment.\nOthers indicted include Joseph Sanfilippo, the former chief financial officer of flagship fund Platinum Partners Value Arbitrage Fund LP; Joseph Mann, a former Platinum marketing employee; and Daniel Small, a Platinum managing director.\nThe case is US v. Nordlicht et al, US District Court, Eastern District of New York, No. 16-cr-640.\n(Reporting by Nate Raymond in New York; Additional reporting by Lawrence Delevingne; Editing by Chizu Nomiyama and Lisa Von Ahn)","url":"https://www.businessinsider.com/platinum-partners-mark-nordlicht-arrested-on-alleged-1b-fraud-2016-12"}
