{"authors":[],"date_download":"2018-10-22 22:07:05","date_modify":"2018-10-22 22:07:05","date_publish":"2014-06-08 20:17:40","description":"Playland, a collection of modest coasters, rides and attractions that evokes a simpler time and even holds a place in Hollywood, is in trouble.","filename":"data/vaneerConsumption/PlaylandParkWhereBigWasFilmedIsinTrouble.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/495461/140608-playland-park-jms-1657_8295d722ddd58e84fa9894ead44b0ea8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_playland-park-where-big-was-filmed-trouble-n125746_1540246025.html","title":"Playland Park Where 'Big' Was Filmed Is in Trouble","title_page":"Playland Park Where 'Big' Was Filmed Is in Trouble","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPlayland, a collection of modest coasters, rides and attractions that evokes a simpler time and even holds a place in Hollywood history, is in trouble.\nThe 86-year-old Art Deco landmark north of New York City is the nation's largest government-run amusement park, and it's been a money loser for suburban Westchester County for years. It lost $4.3 million in 2013, attendance dropped from 1 million in 2005 to 390,000 last year, and a grand plan to revamp the park is more than a year behind schedule, caught up in politics and opposition from neighbors.\nWhile no one is predicting that Playland will have to close anytime soon, Westchester County Executive Rob Astorino — now the GOP nominee for governor — has often said the status quo can't continue. And officials note that only about 30 percent of Playland's patrons are county residents.\n\"Amusement parks aren't an essential service of government,\" said Astorino spokesman Ned McCormack. \"If we can't get it to a point where it's financially viable, a day could come where it just can no longer go forward.\"","url":"https://www.nbcnews.com/news/us-news/playland-park-where-big-was-filmed-trouble-n125746"}
