{"authors":[],"date_download":"2018-10-22 21:58:02","date_modify":"2018-10-22 21:58:02","date_publish":"2014-06-04 21:44:49","description":"Four Winds Field in South Bend, Indiana, offers a baseball-as-religion link that the Wrigleys, Fenways and Camden Yards of the world never will.","filename":"data/vaneerConsumption/PlayBallJewishSynagogueConvertedIntoTeamStore.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/488171/140604-baseball-synagouge_f6defbd40fb51a09661747f5ee18412c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_play-ball-jewish-synagogue-converted-team-store-n122876_1540245482.html","title":"Play Ball! Jewish Synagogue Converted Into Team Store","title_page":"Play Ball! Jewish Synagogue Converted Into Team Store","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhile today’s Major League Baseball stadiums are often considered cathedrals of sport, tiny Four Winds Field in South Bend, Indiana, offers a baseball-as-religion link that the Wrigleys, Fenways and Camden Yards of the world never will.\nHome to the South Bend Silver Hawks, the Class A affiliate of the Arizona Diamondbacks, the 4,300-seat ballpark also features the only synagogue in an American ballpark. True, it now hosts the franchise’s team store, rather than worshipers, but there’s clearly a rich history hidden among the foam fingers and trading cards.\n“When our owner, Andrew Berlin, purchased the team, we didn’t actually have a walk-in team store,” said Joe Hart, club president. “It was literally an old concession stand that had been converted.”\nJust outside the left field fence, however, sat the empty (and previously deconsecrated) Sons of Israel Synagogue, originally built in 1901 to serve South Bend’s Jewish community. Using $1 million of a total ballpark-renovation budget of $4 million, the club restored the building, pushed the fence out beyond it and filled it with team gear and memorabilia.","url":"https://www.nbcnews.com/business/travel/play-ball-jewish-synagogue-converted-team-store-n122876"}
