{"authors":[],"date_download":"2018-10-30 14:20:05","date_modify":"2018-10-30 14:20:05","date_publish":"2018-10-29 20:02:00","description":"When the College Football Playoff selection committee unveils its first rankings of the season Tuesd...","filename":"data/vaneerConsumption/PlayoffrankingsdebutTuesdaywherewillGeorgiastart.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Videos/4518335.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_playoff-rankings-deb_a4f5727d105b722b1430bf1b5cb92747__1540909205.html","title":"Playoff rankings debut Tuesday; where will Georgia start?","title_page":"Playoff rankings debut Tuesday; where will Georgia start?","title_rss":"NULL","source_domain":"ajc.com","text":"When the College Football Playoff selection committee unveils its first rankings of the season Tuesday night, Georgia won’t be rated as loftily as at the same point last year.\nThe Bulldogs, the No. 1 team in the playoff committee’s initial rankings of 2017, figure to be outside the top four in the group’s first rankings of 2018 – but close enough to reach the four-team playoff if they win all of their games between now and Dec. 2.\nGeorgia players won’t quibble about where they are ranked in the 13-member committee’s initial assessment, which will be released on ESPN shortly after 7 p.m.\n“Not at all, not at all,” UGA defensive back Tyrique McGhee said when asked Monday if the committee’s rankings will be of concern to the Bulldogs. “Like coach (Kirby) Smart says, control what you can control. Anything else, let the chips fall where they may. If you handle your business, everything else will fall into place.”\nThe playoff organization has said it doesn’t use the Associated Press or coaches’ polls as a reference tool. Indeed, in the first four years of the playoff, the selection committee’s initial rankings haven’t had the same top four teams as that week’s AP poll.\nStill, it would be a surprise to most observers if the CFP ranks the top four substantially different Tuesday than than this week’s traditional polls, both of which have unbeaten teams Alabama, Clemson and Notre Dame Nos. 1-2-3 in that order and one-loss LSU No. 4.\n“I think the committee stays status quo with the other polls this week,” Chick-fil-A Peach Bowl president Gary Stokan, a close observer of the playoff selection process, said Monday.\n“Alabama obviously is the cream of the crop right now,” Stokan said. “You’ve got to have Clemson up there based on their last two wins (routs of N.C. State and Florida State). You’ve got to have Notre Dame up there; they beat Michigan, so Michigan couldn’t jump Notre Dame. And with LSU beating Georgia, and Georgia beating Florida, that only helps LSU.”\nStokan predicted the CFP’s initial rankings will have one-loss teams Michigan and Georgia at Nos. 5 and 6, respectively. He thinks Georgia will be ranked ahead of one-loss Oklahoma because the Bulldogs lost to a better team (LSU) than the Sooners did (two-loss Texas).\nGeorgia, though, lacks the type of marquee non-conference win that served it well with the playoff committee last year, when the Bulldogs benefited from an early-season victory at Notre Dame. So far this season, Georgia hasn’t played a Power 5 team outside the SEC and has just one win over an SEC team that currently has a winning league record (Florida).\nWhatever its exact spot in the rankings Tuesday, Georgia will be well-positioned to move into the top four if it can sweep its remaining regular-season games (Kentucky, Auburn, Massachusetts and Georgia Tech) and beat Alabama or LSU in the SEC Championship game at Atlanta’s Mercedes-Benz Stadium on Dec. 1.\n“All they’ve got to do is win,” Stokan said of Georgia.\nThe winner of Saturday’s Georgia at Kentucky game will clinch the SEC East title and a berth in the conference championship game.\nLast season, after being No. 1 in the playoff committee’s initial rankings, Georgia dropped to No. 7 upon losing to Auburn two weeks later. But the Bulldogs reached the playoff – and ultimately the national title game – after winning a rematch against Auburn in the SEC Championship game.\nWhile the Associated Press and coaches’ polls begin their rankings before the season, the playoff committee holds off until the final week of October so that it can measure teams entirely by the current season’s results, not expectations or history.\nThe committee is chaired this season by Oregon athletic director Rob Mullens. Georgia Tech athletic director Todd Stansbury is among the other 12 members.\nTuesday’s rankings are a starting point for the committee, the first of its six sets of rankings. The group will reconvene in Grapevine, Texas, every week through November to re-rank teams.\nIts final rankings on Dec. 2 will set the playoff field, with No. 1 facing No. 4 and No. 2 facing No. 3 in the semifinals, which this season will be played in the Orange and Cotton bowls on Dec. 29.\nThe national championship game will be played Jan. 7 in Santa Clara, Calif.","url":"https://www.ajc.com/sports/playoff-rankings-debut-tuesday-where-will-georgia-start/vi8LIVHpimhsTjxDCFaBMM/"}
