{"authors":[],"date_download":"2018-10-30 00:59:36","date_modify":"2018-10-30 00:59:36","date_publish":"2018-08-28 00:05:06","description":null,"filename":"data/vaneerConsumption/PlayFastWinaBigPot.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/3393476442_0dbed23b4f_z-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861176.html","title":"Play Fast, Win a Big Pot","title_page":"Play Fast, Win a Big PotThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"One thing that took me a few years to learn, as I transitioned from primarily limit Texas Hold’em to primarily no-limit Texas Hold’em a decade ago, was that playing a big hand fast on the flop tended to yield a bigger pot most of the time.\nBy big hand, I mean straights, sets, perhaps even flushes (though players tend to be more easily scared of flops with three of the same suit on them). These hands are strong, but still vulnerable. Monster hands like full houses and four-of-a-kind I would still recommend playing slowly to try to trap your opponents.\nThe standard play in limit after flopping a big hand was to just call the flop and raise the turn. This being limit, most players would just call you down after having invested a few bets and having to only call two more bets — the turn raise and the assumed river bet.\nBut there are a few reasons in no-limit why you might want to consider applying more pressure on the flop.\nFor one example, if you hold a set then a scare card could come on the turn, putting a possible straight or flush on the board, or if an ace or king hits it could scare a player holding a good, but very beatable, pocket pair like jacks or queens. In these instances, a player who bet the flop could fold to a raise on the turn whereas they would have been more apt to push back on the flop by making a re-raise.\nFor another, raising on the flop pushes out many draws to straights and flushes that could beat your set or straight. At the very least, you are making them pay to try to hit their draw, usually at poor odds for them.\nA third reason a raise on the flop is beneficial is that if your opponent likes his or her hand well enough to go to the river you can better bloat the size of the pot by putting more money in on the flop. Future bets tend to be exponentially bigger as the pot grows.\nIn a recent online poker game, I picked up pocket fours and decided to raise the $5 big blind to $15, but the player in the big blind re-raised to $30. I immediately put him on a big hand since he didn’t make a big re-raise to try to blow me out of the pot before the flop. I assumed he had aces and knew if I could flop a set I could potentially win a big pot.\nThe flop was a dandy: K-4-2. My opponent bet $20 and unless he had flopped a set of kings I knew I had the best hand. I raised it to $50 and he pushed all in for the rest of his $180 or so. I called, of course. He showed A-K and I won the hand.\nSince I raised on the flop, he likely put me on a king with a smaller kicker than his ace and so pushed all-in hoping to win the pot right there or get me to call with an inferior hand. He didn’t expect me to play a set that quickly.\nContrast that hand to another I played in Las Vegas many summers ago in which I flopped a set of fours and waited to raise on the turn (I made a very suspicious minimum raise, no less). My opponent laid down top pair (queens) with an ace kicker to my novice attempt to slow play my hand.\nShe made the comment that my turn bet looked awfully suspicious as she tossed in a hand from which I had hoped to extract a lot of chips. I could see the profits disappear along with her hand into the muck.\nDon’t make the same mistake. You’ll often find that your opponents expect you to slow play your big hands, so if you do the opposite you stand to win your foe’s stack more often.\nJohnny Kampis is author of Vegas or Bust: A Family Man Takes on the Poker Pros.","url":"https://spectator.org/play-fast-big-pot/"}
