{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 00:59:16","date_modify":"2018-10-23 00:59:16","date_publish":"2017-03-16 10:37:17","description":"Video footage taken today at a panda base in Chengdu, China shows the moment a playful panda desperate for its keeper's attention stands up.","filename":"data/vaneerConsumption/Playfulbabypandadesperateforattentionstandsup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53441700000578-0-image-a-22_1489658470660.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319398_Playful-baby-panda-desperate-attention-stands-up_1540256356.html","title":"Playful baby panda desperate for attention stands up","title_page":"Playful baby panda desperate for attention stands up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Video footage has caught the adorable moment a baby panda stands up and demands hugs from its keeper.\nThe footage was recorded today at Chengdu's Research Base of Giant Panda Breeding.\nToday is International Panda Day which aims to spread awareness of the cuddly creatures.\nPlease can I have a hug? He tries to grab the keeper's attention as if to ask for a hug\nThe keeper picks up Ya Zhu after he caused havoc while his keeper was trying to clean\nThe footage recorded exclusively for MailOnline by iPanda stars four pandas born at the base in 2016.\nAt the start of the video, panda cub Ya Zhu can be seen coming down a tree to greet his keeper.\nIts keeper can be seen collecting bamboo and putting it in the enclosure. However Ya Zhu wants to play games with its keeper.\nYa Zhu is then picked up by the man and taken to another section of the enclosure.\nTough job: The keeper was trying to collect bamboo and put it in the enclosure at the time\nHello! Panda cub Fushun stands on its legs as he tries to get the attention of his keeper\nThe footage then cuts to another section of the enclosure which is being cleaned by another keeper.\nPanda cub Fushun can be seen on a wooden platform watching what the woman is doing.\nAll of a sudden Fushun throws himself off the platform. Ironically enough, Fushun originally became famous after he face-planted to the ground during a photo shoot at the base.\nThe picture showing the exact moment Fushun fell to the ground was selected by Reuters as one of the best pictures of 2016.\nAs the keeper tries to clean out the enclosure, Fushun tries to grab hold of the brush she is using.\nIn order to grab her attention, he gets up on his hind legs and stands as if to demand a hug from the woman.\nHe then gets into the hole she was clearing and becomes stuck, needing help from the keeper to escape.\nThe female keeper can be seen sweeping the enclosure as Fushun tries to grab her attention\nFushun and another panda cub named Xiao Hui Hui can be seen fighting with each other\nFushun and another panda cub named Xiao Hui Hui can be seen play fighting in their enclosure.\nOne of the cubs is pushed to the ground and struggles to get back onto the wooden platform.\nThe footage then cuts to another panda cub named Cheng Shi. Cheng Shi is having photos taken of him as he sits among bamboo.\nIt almost looks like he's posing for the camera .\nAdorable: Towards the end of the footage panda Cheng Shi sits in his enclosure\nSmile for the camera! Cheng Shi poses for the camera as one of the keepers takes photos\nChengdu Research Base of Giant Panda has the world's largest artificial breeding population of captive giant pandas. Founded in 1987, the centre has bred 243 cubs, with 176 surviving.","url":"https://www.dailymail.co.uk/news/article-4319398/Playful-baby-panda-desperate-attention-stands-up.html"}
