{"authors":[],"date_download":"2018-10-22 22:13:33","date_modify":"2018-10-22 22:13:33","date_publish":"2014-06-08 15:39:39","description":"The Seattle Police Department released calls from faculty, students, bystanders and a victim of the shooting that left one dead and three wounded.","filename":"data/vaneerConsumption/PleaseHurrySeattlePacificUniversityShooting911CallsReleased.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/495156/140608-seattle_pacific-shot-ef-1136_d82ecc950a4247184b3342790a0d56c6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_please-hurry-seattle-pacific-university-shooting-911-calls-released-n125636_1540246413.html","title":"'Please Hurry': Seattle Pacific University Shooting 911 Calls Released","title_page":"'Please Hurry': Seattle Pacific University Shooting 911 Calls Released","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPolice have released 911 calls from bystanders, students, faculty and one victim of the shooting Thursday at a small Seattle university.\n“Please hurry,” whispered one student, who said she was locked in an office with her professor near Otto Miller Hall at Seattle Pacific University. The student said she still heard commotion in the lobby of the hall and thought the gunman might still be directly outside the office.\n“I heard someone yell, ‘everyone stand up’ so I’m pretty sure he’s still in here,” the professor calmly explained to the dispatcher.\nThe Seattle Police Department released what they called “chilling and fairly graphic” audio to highlight “the remarkable calm and resourcefulness of students, faculty, and other witnesses in the moments after a gunman opened fire at Otto Miller Hall.\"\nA 19-year-old freshman student was killed and three others were wounded in the violence that suspect, Aaron Rey Ybarra, 26, has since admitted to. He is being held without bond at the King County Jail on homicide charges.\nYbarra, who was not a student at the private Christian college, had a history of violence and had researched previous mass shootings, police said. He told detectives he wanted to kill as many people as he could.","url":"https://www.nbcnews.com/news/us-news/please-hurry-seattle-pacific-university-shooting-911-calls-released-n125636"}
