{"authors":[],"date_download":"2018-10-30 21:11:01","date_modify":"2018-10-30 21:11:01","date_publish":"2015-10-30 14:10:02","description":"Nothing would reinvigorate GamerGate quite like the safe space sisterhood being handed a \"harassment day\" at an event celebrating creators.","filename":"data/vaneerConsumption/PleaseLetsHaveAnAllDaySXSWPanelonHarassment.json","image_url":"https://media.breitbart.com/media/2015/10/brianna-wu-youtube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2015_10_30__1540933861.html","title":"Please! Let's Have An All-Day SXSW Panel on Harassment","title_page":"Please! Let's Have An All-Day SXSW Panel on Harassment","title_rss":"NULL","source_domain":"breitbart.com","text":"Disciples! I’m here to tell you that it is important – nay, essential – that the SXSW festival in Austin, Texas follow the wishes of social justice warriors and create an all-day event about “online harassment.” The brightest stars of anti-harassment should be there. Randi Harper, Zoe Quinn, Brianna Wu, and the queen of online victimhood, Anita Sarkeesian.\nAs we know, “abuse” and “harassment” are feminist euphemisms for “someone disagreeing with me on the internet.” Social justice warriors love shutting down free speech, and will never understand the Streisand Effect.\nHow do authoritarian hand-wringers not realise that attempting to silence the voice of free speech true believers is what gives the latter motivation to make themselves more widely heard? Is it the hair dye, or perhaps all those wonky bits of metal sticking out of their faces?\nSarkeesian suggested a reinstatement of the short anti-harassment panel and an apology for even considering a #GamerGate-positive panel after both were cancelled earlier this week, but I am going to chalk the modesty of her suggestion up to her natural humility, which of course rivals my own. It should be a whole day.\nSome of you may wonder why I’d be giving advice to radical authoritarian demagogues and professional victims. It is a reasonable question.\nWell. If I’ve learned anything in my year of playing video games, it is that an easy game quickly becomes boring. Have you ever played Act 1 of Diablo III on normal mode with a level 70 crusader? It isn’t thrilling.\nI actually have no idea what any of that means, but my research team assures me it’s as challenging as me trolling for a quick roll in the sheets at a gay Nigerian sex addict support group meeting.\nIn essence, if my SJW opponents refuse to raise their game by themselves, I will assist them in levelling up by providing the type of alpha male strategic advice they so obviously lack, thanks to being comprised entirely of women and beta male white knights. In short: I need a better class of enemy.\nOK, OK. I know by this point even the most ardent, meme-throwing Bokharian cultural libertarian doesn’t believe a word I am saying, so I will drop the charade.\nI want SXSW to cave into the demands of the no-platform ninnies, but not for the reasons I’ve stated. My real motivation is that GamerGate would surge back with a ferocity not seen since this time in 2014.\nGamers burnt out from the fight and those who left the consumer revolt from fatigue and infighting would respawn and bring a ton of new friends as well – especially now that so many developers are coming out of the woodwork and spouting heresies such as, “Anita Sarkeesian is wrong.”\nFeminists are always whinging about being “silenced.” Well, let them have their day. The more these mendacious weirdos talk, the more they turn off the public and reveal themselves as the far-left authoritarian wackos they are.\nSilicon Valley, the games industry and even ordinary members of the public are wising up to the social justice shakedown – a phenomenon Breitbart Tech will be covering in detail in the coming months. So why not give these loons a platform from which to expose themselves. It will only hasten their demise.\nEven you, Brianna Wu. You weren’t even invited to the cancelled SXSW panel but you hurled yourself at the nearest microphone anyway this week in the hope of propping up your rapidly evaporating public profile. You can come too. The more the merrier!\nNothing would reinvigorate the GamerGate movement – or bring it more high-profile and respectable supporters – quite so much as the safe space sisterhood being handed a hectoring snoozefest “harassment day” at what purports to be an event celebrating creators. Let’s support the idea wholeheartedly.\nFollow Milo Yiannopoulos (@Nero) on Twitter and Facebook, or write to him at milo@breitbart.com. Android users can download Milo Alert! to be notified about new articles when they are published.","url":"https://www.breitbart.com/tech/2015/10/30/please-lets-have-an-all-day-sxsw-panel-on-harassment/"}
