{"authors":["Associated Press"],"date_download":"2018-10-22 23:58:15","date_modify":"2018-10-22 23:58:15","date_publish":"2017-04-26 09:00:32","description":"WASHINGTON (AP) - Donald Trump is far from the first president to enlist his children and in-laws in the work of the White House. Look back through history,...","filename":"data/vaneerConsumption/Plentyofpresidencieshavebeenfamilyaffairs.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/09/wire-464013-1493193634-515_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446674_Plenty-presidencies-family-affairs_1540252695.html","title":"Plenty of presidencies have been family affairs","title_page":"Plenty of presidencies have been family affairs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Donald Trump is far from the first president to enlist his children and in-laws in the work of the White House. Look back through history, and it turns out that plenty of presidencies have been a family affair.\nEighteen sons served in their fathers' White Houses, most of them with the title of \"secretary to the president,\" according to Doug Wead, who served in the George H.W. Bush White House and has written books on presidential children and the 2016 campaign. Fourteen daughters or daughters-in-law have taken on responsibilities in the White House, mostly ceremonial but sometimes more substantive, says Wead.\nMartha Johnson, daughter of Andrew Johnson, lobbied members of Congress for appropriations and helped set protocols still used at the White House. Webb Hayes, son of Rutherford Hayes, \"virtually ran the White House for his father,\" says Wead. John Eisenhower was a trusted adviser and protector of his father, Dwight Eisenhower. Anna Roosevelt went to Yalta to help with her father's meeting with Joseph Stalin and Winston Churchill, Wead says.\nFILE - In this March 6, 2017 file photo, Housing a Urban Development (HUD) Secretary Ben Carson speaks to HUD employees in Washington. Columbus, Ohio, is the fourth stop on Carson's national listening tour. President Donald Trump's housing secretary has been traveling the country gathering input from agency field staff, local leaders and residents of public housing developments. (AP Photo/Susan Walsh, File)\nIt's also not new for presidential children's business dealings to create complications.\nJimmy Roosevelt, one of Franklin's sons and an insurance salesman, created a ruckus when it came out that major companies had transferred their policies to him after his father rose to power.\nIn the early 1990s, Neil Bush, who served as an outside director of a savings and loan that collapsed, claimed he was unfairly targeted for investigation by federal regulators because his father was President George H.W. Bush. He was cleared of wrongdoing.\nPlenty of wives get in on the presidential action, too. Hillary Clinton's portfolio as first lady included an unsuccessful effort to overhaul the health care system. And Nancy Reagan was an influential adviser to her husband.","url":"https://www.dailymail.co.uk/wires/ap/article-4446674/Plenty-presidencies-family-affairs.html"}
