{"authors":["Christine Distasio"],"date_download":"2018-10-30 23:47:29","date_modify":"2018-10-30 23:47:29","date_publish":"2014-08-13 04:37:52","description":"Did you really think we weren't going to catch all of these hints, I. Marlene King? All this time we thought that Melissa Hastings was \"A,\" but is it possible that Melissa is just as scared of \"A\" as anyone else? On Tuesday night, Pretty Little…","filename":"data/vaneerConsumption/PLLsADarkAliSuggestsANewTheoryAlisonIsControllingMelissa.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/05980b3a-9072-43d6-bfcc-4bd3b1a2e7f3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35549-plls-a-dark-ali-suggests-a-new-theory-alison-is-controlling-melissa_1540943249.html","title":"'PLL's \"A Dark Ali\" Suggests A New Theory - Alison Is Controlling Melissa","title_page":"'PLL's \"A Dark Ali\" Suggests A New Theory — Alison Is Controlling Melissa","title_rss":"NULL","source_domain":"bustle.com","text":"Did you really think we weren't going to catch all of these hints, I. Marlene King? All this time we thought that Melissa Hastings was \"A,\" but is it possible that Melissa is just as scared of \"A\" as anyone else? On Tuesday night, Pretty Little Liars' new episode, \"A Dark Ali,\" introduced an entirely new theory to the many swirling around Alison's super-shady behavior in Rosewood — Alison is controlling Melissa Hastings. And the episode dropped three enormous and painfully obvious hints to prove it.\nIt's hard to believe that the creepily sinister Melissa Hastings is actually a victim here, but bear with me. On Tuesday night, Spencer confronted Melissa about making a great escape and looking for plane tickets (**ALERT: HINT #1) to get out of Rosewood. Sure, that could mean that she's running off to London to shack up with even-creepier Wren for awhile. But when Melissa told Spencer that they aren't safe in Rosewood and that Ali's going to get what's coming to her, and soon, she didn't sound malicious — she sounded downright terrified. Like things are totally out of control and even though she's working with Mona, she has virtually no power in the massive, intricately woven \"A\" game.\nAlso pertaining to Melissa, when Spencer realized that her super-secret hiding place (which really wasn't so secret when you think about it) was compromised, she turned to her trusty surveillance camera to see what her sister's been up to. And it sure seemed like Melissa had met Cyrus before he'd turned himself in for breaking into Mrs. Marin's house where she told him to, \"do it now,\" about something in a strangely similar envelope to the one Spencer took from Noel Kahn (**ALERT: HINT 2). Shady? Yes. Did I believe that Ali was definitely working for the \"A\" team at this point? Absolutely. Well, I was wrong.\nMonday night's episode of PLL actually ended with some serious answers and a side of Alison DiLaurentis in a dark brown wig. In one of \"A Dark Ali\"s final scenes, Alison meets with Cyrus in the woods after he escapes from the Rosewood Police Department and it seems like the pair planned his alleged \"confession\" and arrest. And while this was a startling revelation, considering how incredibly shady Ali's been since she got back to Rosewood, I wasn't entirely surprised. I didn't bat an eye when Cyrus called out Alison for wasting her second chance on whatever she was up to — because she's, again, been shady as hell and done her best to alienate everyone close to her.\nI was surprised, however, when PLL came full-circle and Ali handed Cyrus a passport a plane ticket (**ALERT: HINT 3). Because that plane ticket could've very well been acquired by one Melissa Hastings — Melissa wasn't planning her getaway, she was planning Cyrus' for Alison. Which leaves us with huge questions: Is Melissa playing the double-agent? Has Ali been \"A\" this entire time? What does Ali have on Melissa that could force her into becoming her personal slave?\nThe plot in Rosewood has officially thickened and I don't know what to believe anymore.\nImage: ABC Family","url":"https://www.bustle.com/articles/35549-plls-a-dark-ali-suggests-a-new-theory-alison-is-controlling-melissa"}
