{"authors":[],"date_download":"2018-10-22 21:20:00","date_modify":"2018-10-22 21:20:00","date_publish":"2014-06-04 21:35:55","description":"The scientist in charge of NASA's New Horizons probe is already thinking about next year's Pluto flyby and the debate over the dwarf planet's status.","filename":"data/vaneerConsumption/PlutoMissionLeaderChallengesNeildeGrasseTysontoaPlanetDebate.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2015_29/455881/140520-newhorizons2_2612be192d637c4b38ebc6f1266e2ebc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_pluto-mission-leader-challenges-neil-degrasse-tyson-planet-debate-n122861_1540243200.html","title":"Pluto Mission Leader Challenges Neil deGrasse Tyson to a Planet Debate","title_page":"Pluto Mission Leader Challenges Neil deGrasse Tyson to a Planet Debate","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThere's a year and a month to go before NASA's New Horizons probe flies by Pluto, but that rendezvous is already one of the big events for Alan Stern, the scientist in charge of the $728 million mission.\nHe's also pressing for a debate with astrophysicist Neil deGrasse Tyson over Pluto's planetary standing — and for something completely different, he's even giving some thought to Father's Day on June 15.\nStern has so many projects in the air that he sometimes seems more like a juggler than a researcher. In addition to his roles as New Horizons' principal investigator and a planetary scientist at the Southwest Research Institute in Boulder, Colorado, he helped create Uwingu, a commercial venture focusing on space education and research; the Golden Spike Company, which is planning private-sector moon missions; and the Suborbital Applications Research Group, which is helping researchers get ready for suborbital space studies.\nYou can hear more about Stern's juggling act at 8 p.m. ET Wednesday during an hourlong chat on \"Virtually Speaking Science.\"\nProgress toward Pluto\nThe next couple of months will see an uptick in the New Horizons mission, which literally got off the ground back in 2006, before the International Astronomical Union reclassified Pluto as a dwarf planet, and is due to fly past Pluto on July 14, 2015.\n\"We're about to wake the spacecraft up\" for its final checkout before next year's encounter, Stern told NBC News. After the weeks-long checkout, the probe will be put back into hibernation for the last time in August, with a wakeup call set for December.\nOn July 16, Stern and other luminaries will give lectures on the Pluto mission at the Smithsonian Institution's National Air and Space Museum in Washington. \"It's a kickoff to the 'Year of Encounter,'\" he said. Another kickoff event will take place at NASA Headquarters on Aug. 25, the date when New Horizons is due to zoom beyond Neptune's orbit. It's also the 25th anniversary of Voyager 2's Neptune flyby, and Voyager project scientist Ed Stone will be on hand.\n\"He's going to pass the baton of exploration from Voyager to New Horizons,\" Stern said.","url":"https://www.nbcnews.com/science/space/pluto-mission-leader-challenges-neil-degrasse-tyson-planet-debate-n122861"}
