{"authors":["Clemence Michallon For Mailonline"],"date_download":"2018-10-23 03:24:25","date_modify":"2018-10-23 03:24:25","date_publish":"2016-01-11 16:03:27","description":"Michael Brain, 46 (pictured), of Plymouth, stole cheques from one of the woman's estranged husband and made them payable to himself. He then stole from two other women.","filename":"data/vaneerConsumption/Plymouthmanjailedafterstealing3000fromformergirlfriends.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B74FB00000578-0-image-a-82_1452526024053.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394048_Plymouth-man-jailed-stealing-3-000-former-girlfriends_1540265065.html","title":"Plymouth man jailed after stealing £3,000 from former girlfriends","title_page":"Plymouth man jailed after stealing £3,000 from former girlfriends | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Used the money to fuel drinking and gambling habit in 'downward spiral'\nThe former sailor, from Plymouth, then stole £320 from two other women\nMichael Brain, 46, was jailed for 70 weeks after stealing almost £3,000 from previous girlfriends\nA two-timing 'cash card Casanova' has been jailed for stealing nearly £3,000 from a string of lovers.\nMichael Brain, 46, stole cheques from a woman's estranged husband and forged the man's signature, making them payable to himself and pocketing £2,698.\nThe former sailor, from Plymouth, Devon, later stole from two other women, taking £170 from one and £150 from the other.\nHe was jailed for 70 weeks at Plymouth Crown Court by Recorder Stephen Parish, who labelled him 'a cash card Casanova'.\nHe added: '”You appear to get yourself involved with women and then you take advantage of them, typically taking their cash cards.”'\nThe court heard that Brain, from Plymouth, Devon, stayed with his first victim in Launceston, Cornwall, while her estranged husband was on holiday.\nOn his return, the husband was contacted by his bank who told him they had refused cheques drawn on his account made payable to Brain.\nThe man later discovered the bank had paid out £2,698 on cheques that he had not signed and his wife admitted that Brain her boyfriend had been at their home.\nThe husband told the court the theft had 'driven a wedge' between himself, his wife and their children.\nHe said: 'I hate the idea that someone has been rummaging through my possessions.'\nSally Daulton, prosecuting, said Brain went on to steal from two women he was dating.\nBrain admitted stealing seven cheques in Launceston and pleaded guilty to three counts of fraud where he forged signatures on the cheques and made them payable to himself.\nFrom the cheques Brain gained £2,698, and he also admitted stealing £320 from the other two women.\nHe was also in breach of a suspended prison sentence for stealing £3,000 from the account of a fourth woman, the court heard.\nMichael Green, defending, said: 'When there are problems he goes back to drinking and gambling and he is on a downward spiral.'\nHe added that Brain was 'ashamed and embarrassed' at his offending, which started in his late thirties when he quit the Royal Navy and split up from his wife.","url":"https://www.dailymail.co.uk/news/article-3394048/Plymouth-man-jailed-stealing-3-000-former-girlfriends.html"}
