{"authors":[],"date_download":"2018-10-22 21:45:55","date_modify":"2018-10-22 21:45:55","date_publish":"2014-08-22 00:00:00","description":"In this poem, \"Kingfisher,\" Chris McCabe recalls a bird watching trip, and an attempt to see a rare bird — the vivid blue kingfisher — that he long dreamed of seeing.","filename":"data/vaneerConsumption/PoetFindsSummerIsATimeToReconnectWithNature.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=342354112_1540244755.html","title":"Poet Finds Summer Is A Time To Reconnect With Nature","title_page":"Poet Finds Summer Is A Time To Reconnect With Nature : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nThis month, MORNING EDITION has been taking a break from the heat with poetry. Today we're going to hear about Chris McCabe. For him, summer is a time to reconnect with nature. Out on a walk with his baby son one day, McCabe was hoping to see a rare bird - the blue kingfisher. He'd always wanted to see it.\nCHRIS MCCABE: As I was looking after my son trying to stop him running into the lake or whatever he was doing at that point, my wife saw not one but two kingfishers at the same moment. And I, of course, completely missed the experience. The kingfishers were gone.\nMCEVERS: But, McCabe says, maybe it's better to just imagine the bird. The result is this poem.\nMCCABE: This poem begins with a quotation from the American poet Charles Olson which says (Reading) it is true. It does nest with the opening year but not on the waters. Kingfisher. How do you describe the blue you've never seen? I was fixing the biting muscles of mitts to the boy's fingers. You saw the tailless hologram shoot its bib of awe. I was holding the boy from the lagoon-green under breeze of the lake. The blue flecks shook green it's Atlantic dorsal. I was persuading the boy that faces in puddles were not the only ones to understand him - the savage Buddha ball bearing for digested fishbone. I was hauling the boys knees from the ulcer of lap pools, the blast of Bunsen made swift if it's short fuel. I was kneading the yeast kisses he tossed to Canada geese. And as your lizard-shed January skin, I was searching the path for the boy's alchemy of chance in gold grass. The pixilated dash from Victorian taxidermists. I was pushing the boy in euphorics towards the A roads of futurist fire services. The damsel blue hunter thrust its mollusk glance. I read that night, only the righteous see the kingfisher. I was later, the boy asleep, his consciousness given back to dreams, a gale to the wind chimes, his exhausted limbs lit by the trip-switch of pulse. The righteous one said, as I drifted to dark - said the one word, kingfisher. And I caught his blue, pulled back from the only place I'd ever seen him.\nMCEVERS: That's Chris McCabe reading his poem \"Kingfisher.\" His latest work, \"In The Catacombs: Summer Among The Dead Poets Of West Norwood Cemetery,\" is a book of prose. It's out from publisher Penned in the Margins. This is MORNING EDITION from NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=342354112"}
