{"authors":["Daisy Dunne For Mailonline"],"date_download":"2018-10-23 01:54:29","date_modify":"2018-10-23 01:54:29","date_publish":"2017-04-26 12:34:40","description":"More than 40 apps offering fake walkthroughs of popular games were found in the Google Play Store by experts from Check Point, an IT security company based in San Carlos, California.","filename":"data/vaneerConsumption/PokemonGoandFifafakeguideshijack600000Androids.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F118600000578-0-image-a-43_1493203414069.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4446918_Pokemon-Fifa-fake-guides-hijack-600-000-Androids_1540259669.html","title":"Pokemon Go and Fifa fake guides hijack 600,000 Androids","title_page":"Pokemon Go and Fifa fake guides hijack 600,000 Androids | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Up to two million Android devices have been secretly hijacked by new malware posing as Pokemon Go and Fifa gaming guides, security experts have warned.\nMore than 40 apps offering fake walkthroughs of popular games were found in the Google Play Store by experts from Check Point.\nExperts warned that the malicious apps can take control of devices without the user's knowledge.\nUp to two million Android devices have been secretly hijacked by new malware posing as Pokemon Go and Fifa gaming guides, security experts have warned (stock photo)\nHOW DO THEY WORK? The malicious apps work by asking the user for 'administrator' permission. Once the user agrees, the malware can then prevent itself from being deleted from a phone or tablet. The malware then secretly registers to a cloud-based messaging services, from which hackers can send commands to the device. By doing this, the malware can get full access over a device and use it to launch a cyber attack.\nThe new strain of malware, called FalseGuide, poses as gaming manuals for popular mobile games including Pokemon Go and Fifa.\nSome of the apps have been downloaded more than 50,000 times, Check Point experts said in a blog post.\nFalseGuide hackers could be attempting to create a 'silent' army out of the hijacked devices, they warned.\n'The apps were uploaded to the app store as early as November 2016, meaning they hid successfully for five months, accumulating an astounding number of downloads,' said researchers OrenKoriat, Andrey Polkovnichenko and Bogdan Melnykov.\n'The updated estimate now includes nearly two million infected users.'\nThe experts believe hackers are trying to infect as many devices as possible to build up a 'silent botnet'.\nBotnets are made up of a network of infected devices, computers and smart products such as fridges and kettles.\nAfter taking over a large number of devices, cyber criminals can launch a coordinated attack on companies or businesses.\nThe viral smartphone game Pokemon Go was released on both the Apple Store (left) and Android's Play Store (right) in the UK and US last year\nHOW TO AVOID GETTING HACKED 'Users shouldn't rely on the app stores for their protection, and implement additional security measures on their mobile device, just as they use similar [products] on their PCs,' said security experts from Check Point. On top of downloading security software for their phones, users can avoid being hacked by being selective about the apps that they download. Gamers should always check the rating of gaming guides and be wary of those with anything below a four-star rating. That's because hackers often bombard the rating system with five-star reviews, which artificially boost the app's overall score. Reading through written feedback to check for negative comments is another good way of avoiding the scam.\nThese kind of attacks, called distributed-denial-of-service (DDoS) cyberattacks, are often used to bombard company websites with traffic from a large number of devices.\nBombarding websites in this way causes them to crash.\n'FalseGuide masquerades as guiding apps for games for two major reasons,' the researchers said.\n'First, guiding apps are very popular, monetising on the success of the original gaming apps.\n'Second, guiding apps require very little development and feature implementation.\n'For malware developers this is a good way to reach a widespread audience with minimal effort.\nThe malicious apps work by asking the user for 'administrator' permission.\nOnce the user agrees, the malware can then prevent itself from being deleted from a phone or tablet.\nThe new strain of malware, called FalseGuide, poses as gaming manuals for popular mobile games including Pokemon Go and Fifa\nWHAT ARE HACKED DEVICES USED FOR? The experts believe hackers are trying to infect as many devices as possible to build up a 'silent botnet'. Botnets are made up of a network of infected devices, computers and smart products such as fridges and kettles. After taking over a large number of devices, cyber criminals can launch a coordinated attack on companies or businesses. These kind of attacks, called distributed-denial-of-service (DDoS) cyberattacks, are often used to bombard company websites with traffic from a large number of devices. Bombarding websites in this way causes them to crash.\nThe malware then secretly registers to a cloud-based messaging services, from which hackers can send commands to the device.\nBy doing this, the malware can get full access over a device and use it to launch a cyber attack.\n'Mobile botnets are a growing trend since early last year, growing in both sophistication and reach,' the experts said.\n'This type of malware manages to infiltrate Google Play due to the non-malicious nature of the first component, which only downloads the actual harmful code.\n'Users shouldn't rely on the app stores for their protection, and implement additional security measures on their mobile device, just as they use similar [products] on their PCs.'\nOn top of downloading security software for their phones, users can avoid being hacked by being selective about the apps that they download.\nGamers should always check the rating of gaming guides and be wary of those with anything below a four-star rating.\nThat's because hackers often bombard the rating system with five-star reviews, which artificially boost the app's overall score.\nReading through written feedback to check for negative comments is another good way of avoiding the scam.","url":"https://www.dailymail.co.uk/sciencetech/article-4446918/Pokemon-Fifa-fake-guides-hijack-600-000-Androids.html"}
