{"authors":["Breitbart London"],"date_download":"2018-10-30 22:01:00","date_modify":"2018-10-30 22:01:00","date_publish":"2017-03-05 10:20:15","description":"Poland proposed a counter-candidate to Donald Tusk as European Council head, saying the Polish incumbent has hurt his country's interests.","filename":"data/vaneerConsumption/PolandNamesCounterCandidatetoTuskasEULeader.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-460646702.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_05__1540936860.html","title":"Poland Names Counter-Candidate to Tusk as EU Leader","title_page":"Poland Names Counter-Candidate to Tusk as EU Leader","title_rss":"NULL","source_domain":"breitbart.com","text":"WARSAW, Poland (AP) – Poland on Saturday proposed a counter-candidate to Donald Tusk as European Council head, saying the Polish incumbent has hurt his country’s interests.\nJust days before a March 9-10 European Union summit in Brussels to vote on Tusk’s re-election, Poland’s conservative government named Jacek Saryusz-Wolski, one of the country’s center-right members of the European Parliament, as its candidate for the post.\nThe move undermines the re-election chances of Tusk, a former Polish prime minister, though he has wide EU backing and his remaining in the job had seemed a formality. His term expires in May.\nThe nomination of the 68-year-old Saryusz-Wolski stems from feuding in Poland’s politics.\nThe conservative government of the Law and Justice party has accused Tusk, a political rival, of supporting the opposition and of failing to shield Poland from EU criticism. Ruling party leader Jaroslaw Kaczynski says Tusk breaks EU rules by backing his former Civic Platform party, which is Poland’s main opposition force. Kaczynski also accuses Tusk of contributing through lax security to the death of his twin, President Lech Kaczynski, in a plane crash in 2010.\nForeign Minister Witold Waszczykowski said Saturday he has officially submitted Saryusz-Wolski’s candidacy to Malta, which now holds EU presidency.\n“Jacek Saryusz-Wolski has a lot of experience in European politics,” Waszczykowski told Poland’s PAP agency. Moreover, he “guarantees impartiality,” though coming from the same party as Tusk.\nIn reaction, Civic Platform leaders expelled Saryusz-Wolski from the party. He has been critical of some of Tusk’s decisions as EU leader.\nSaryusz-Wolski prepared Poland’s 2004 access to the EU and has since been a European Parliament member. He was its deputy head from 2004-2007.","url":"https://www.breitbart.com/europe/2017/03/05/poland-names-counter-candidate-tusk-eu-leader/"}
