{"authors":["Associated Press"],"date_download":"2018-10-23 01:59:08","date_modify":"2018-10-23 01:59:08","date_publish":"2016-01-29 16:16:40","description":"WARSAW, Poland (AP) — Poland's conservative, pro-Catholic government says it plans to help finance a college founded by a controversial priest who also runs ...","filename":"data/vaneerConsumption/Polandtofundprivatecollegerunbycontroversialpriest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:2938ad46f43b473a8fe0d84d1b391c4d-3bmscybNe842cce83474b57bed72-560_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422751_Poland-fund-private-college-run-controversial-priest_1540259948.html","title":"Poland to fund private college run by controversial priest","title_page":"Poland to fund private college run by controversial priest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Poland to fund private college run by controversial priest\nWARSAW, Poland (AP) — Poland's conservative, pro-Catholic government says it plans to help finance a college founded by a controversial priest who also runs Radio Maryja, a station that has been reprimand by the Vatican for fomenting anti-Semitism.\nMembers of the ruling Law and Justice party say they want to earmark 20 million zlotys ($4.9 million) from this year's budget for Father Tadeusz Rydzyk's College of Social and Media Culture in Torun, which offers degrees in journalism and other subjects.\nAndrzej Jaworski, head of the parliamentary finance committee, said the school had been \"completely neglected and ignored\" by the country's previous leaders. The school, founded in 2001, is private and never received state help before.\nFILE - This Sept. 29, 2012 file photo shows Father Tadeusz Rydzyk, front left, head of the controversial Radio Maryja station as he takes part in a protest against the Polish government in power in 2012, in Warsaw, Poland. On Friday, Jan. 29, 2016 Poland¿s current, pro-Catholic government says it plans to help finance a college founded by Rydzyk, whose station Radio Maryja has been reprimanded by the Vatican for fomenting anti-Semitism. (AP Photo/Czarek Sokolowski)\nLaw and Justice swept to victory in an October election thanks in part to the positive coverage given to the party by Radio Maryja.\nRadio Maryja has a devoted following among conservative Poles, many of them older and rural. Some of the ideas it propagates are widely condemned by liberal Poles and even many other Catholics as xenophobic and homophobic. Following anti-Semitic broadcasts in the past, two popes, John Paul II and Benedict XVI, issued warnings to the station making it clear they were not pleased.\nThe development comes as the European Union is assessing whether the government of Prime Minister Beata Szydlo has committed \"systemic\" violations of the rule of law after government moves that have weakened the Constitutional Tribunal and given the government direct control over state broadcast media.","url":"https://www.dailymail.co.uk/wires/ap/article-3422751/Poland-fund-private-college-run-controversial-priest.html"}
