{"authors":["Matthew Tyrmand"],"date_download":"2018-10-30 21:59:04","date_modify":"2018-10-30 21:59:04","date_publish":"2016-03-28 13:42:36","description":"In recent months Western readers of news reports from Poland have been greeted with a steady stream of vitriolic reportage about the supposed “fascist coup” the country is experiencing at the hands of the freshly democratically elected reformist and Eurosceptic government","filename":"data/vaneerConsumption/PolandsNewGovtIsTryingToUndoCorruptCommunistLegaciesTheEUIsTryingToStopIt.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-506417692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_28__1540936744.html","title":"Poland's New Govt Is Trying To Undo Corrupt, Communist Legacies - The EU Is Trying To Stop It","title_page":"Poland's New Govt Is Trying To Undo Corrupt, Communist Legacies – The EU Is Trying To Stop It | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In recent months Western readers of news reports from Poland have been greeted with a steady stream of vitriolic reportage about the supposed “fascist coup” the country is experiencing at the hands of the freshly democratically elected reformist and Eurosceptic government. I have written on this site about just how incorrect (and purposely slanted) this narrative is\nThe verifiable fact remains, to the chagrin of the European Union’s (EU) mandarins in Brussels, that this recent electoral cycle saw power delivered for the first time in modern Polish history to one party (PiS- Prawo i Sprawiedliwosc– “Law & Justice”) with an unprecedentedly overwhelming mandate to reform the post-Communist complexes that have run roughshod over rule of law for over two decades.\nThe proverbial final straw was the last government’s (led by European Council head Donald Tusk’s Polish political party- PO- Platforma Obywatelska– “Civic Platform”) readiness to follow any and all of Brussels edicts (including unmitigated migrant quotas) as long as their brazen domestic corruption remained unchecked.\nThe EU apparatchiks are indignant that once again democracy has played out in a sovereign state and the outcome delivered is a stinging rebuke of their undesired policies in tandem with their philosophy of centralising power away from constituent nation states. Scepticism of their machinations remains higher than ever in Central European nations which remember clearly what having their sovereignty abrogated feels like.\nWith the rejection of “more Europe” democratically mandated by the people of Poland the EU has gone on a rampage of attempted censures of the new government. Two large scale (and eminently reasonable) reforms: a new media law, and a restructuring of the judiciary, have been points of contention that have led to regular attacks in the European Parliament. These reforms are attempts to beat back the corruption that evolved over the last two-and-a-half decades of the post-Communist spoils-system transition toward democracy.\nThe transition was engineered by those who benefited materially from the totalitarian system that predated 1989 and more recently by those who ceded Polish sovereignty to Brussels in exchange for personal benefit doled out by the EU. This came in the form of “development funds” which were ripe for pilfering, and elaborate kickback schemes given to the Polish political elite such as offices with large staffs and budgets in the European capitals for the plutocrats and their circle.\nThose who put Berlin’s interests ahead of Poland’s interests were also in line for the spoils of “statecraft.” This was best exemplified by Radoslaw Sikorski who was seen as a likely successor to Catherine Ashton as EU Foreign Affairs head until hidden tapes showing him making back room deals in some of Warsaw’s most expensive restaurants were revealed. The public media did not cover this story.\nSikorski even gave a speech in November 2011 in Berlin inviting, even in some parts rather demanding, Germany become the de facto leader of Europe. This was not behavior befitting a Foreign Minister of a sovereign nation but Oxford “educated” Sikorski perennially demonstrated in his attitude and rhetoric that he fancied himself a European first and a Pole second.\nWith this backdrop, and resistance to sovereign autonomy high in the previous Polish government aligned with Brussels and Berlin, PiS instituted these two reforms. The first one was a new media law drafted by the legislature and signed by President Duda (also previously a member of PiS, renouncing party affiliation upon his victory, who won the presidential election by simple majority against incumbent President Komorowski of PO in May of last year) that gave the government more direct control of the public media. The law gave the right to the Treasury Minister to appoint (and fire) all heads of public television and radio. Given that the budgets of these media platforms are allocated out of the Treasury (and from various legislated user fees and taxes) this gave the decision making on public media leadership to the federal government as opposed to the National Broadcasting Council (roughly analogous to the American Federal Communications Commission).\nThis council (known as KRRiT) had been dominated by an entrenched (thanks to lengthy statutory terms) cabal of hyper politicised leftists connected to SLD (Democratic Left Alliance) which was the most connected remnant of the legacy communist party (PZPR) predating the 1989 transition. The propagandising and outright corruption of this body led to a public media that functioned as an overt water carrier for post-Communist incumbents with ties to pre-transition practices.\nPiS, looking to break the stranglehold of a public media that was hostile to reform and consistently spun narratives rather than follow their mandate of maintaining a free and independent media, easily passed this reform. This was widely supported by the citizenry on the ground who observed during the last 8 years (two terms of PO) a public media that would not report on PO scandals no matter how egregious. And when they did it was to spin the scandal and help facilitate the cover up.\nThe second reform, the restructure of the constitutional tribunal (TK- Trybunal Konstytucyjny), has been the issue the opposition has held on to in order to maintain their allegation of a developing “fascist coup” orchestrated by those that sent the last government’s political and media class packing.\nThe opposition is comprised of a composite group of the proven looters of the PO party formerly in government, unreformed and unrepentant post-Communist apparatchiks of multiple, withering legacy parties, and a new party called Nowoczesna made up of mostly former PO party members defining itself as economically liberal but with ties to socialist Guy Verhofstadt.\nThe action that set the stage for the drama and further proved the necessity for judicial reform was an unconstitutional stuffing of the tribunal bench by PO before the October parliamentary elections. Seeing the writing on the wall regarding the electoral outcome – with PiS having won the presidency in May and all indications suggesting a dominant mandate about to be won in the legislature – PO (alongside their junior coalition partner PSL – the Marxist farmers party), appointed two new justices while simultaneously retiring two sitting justices before their terms were up.\nIn preventing the resultant judicial independence the opposition would be able to stymie PiS’s legislative priorities claiming all new proposed legislation was unconstitutional – whether it was or it wasn’t. This action was akin to Obama appointing two new United States Supreme Court Justices while forcing the retirement of two conservative justices before their terms were up by executive order without Senate confirmation.\nThis illegal packing of the judiciary was the real constitutional crisis. At no point did the Eurocrats in Brussels say a word about these actions nor did any of the Western press outlets.\nThis judicial body was complicit for many years in acting as an un-Constitutional Tribunal in their decisions and the cronyism that informed their “process.” Yet another recent example showing how committed they were to rule of law was in September 2015 when they upheld the “constitutionality” of a law that said criticising public officials, even privately, was an act of hate speech and punishable by incarceration. By upholding the protection of the political class from criticism the court again proved where their priorities lay.\nUpon gaining legislative power PiS immediately reversed the pre-electoral illegal appointments and went further in appointing three more judges of their choosing in an effort to provide a semblance of balance to this previously hyper partisan and compromised judiciary that had been rubber stamping so many unconstitutional actions of the former PO government. They also changed the simple “majority rules” voting procedure to a now two-thirds majority being necessary to certify a decision and changed the triage process in which order cases are heard- chronologically on the docket rather than the more discretionary “in order of importance” practice previously utilized.\nThe compromised judges in the past had willfully disregarded their obligation to bring hearings on items that were politically damaging to their appointers (when they were not ruling in their friends favour by default). Their behaviour proved the need for reform.\nMeanwhile in Brussels, the Venice Commission (VC – an advisory organisation to the Council of Europe) ruled that both the illegal actions of PO ahead of the elections, and the reversal and negation of these actions by PiS, were in opposition to legitimate judiciary action.\nThe Commission stopped short of providing an expressly delineated solution but suggested in their analysis to follow the pathways of other European nations in restructuring their court, which was a softer endnote than the mainstream Western media spun the commission report. The usual propagandists of the press focused their coverage on the verbiage from which they could build hyperbole around.\nThe main condemnation handed down by the VC was against the manner in which PiS executed the reform which was swift and without deep debate and legislative due process. This point is a fair one but in the view of the new government they had to act decisively against this lawless body lest new legislation be tied up.\nIt is also important to note that this court has been up until now truly a shining example of a vestigial legacy apparatus from Communist times. It was founded in 1986 as a “Potemkin Village” court during the “softening” of Communism that presaged 1989 by the Soviet-placed leader in the 1980’s; General Wojciech Jaruzelski (a Polish General in name only who declared martial law in 1981 and was as brutal a dictator as Communism has been known to turn out). He devised his kangaroo court to show the West during the times of glasnost and perestroika that the Iron Curtain was liberalising even if there was little truth to this.\nThis court, post-1989, protected the Communist class of apparatchiks who had been closely aligned with the Soviets. The clearest proof of this role of the court was in their standing in the way of the “lustration” law proposed during the time of the first PiS government (2005-7).\nThe Kaczynski brothers (Lech as President and Jaroslaw as Prime Minister, along with the current Defense Minister Antoni Macierewicz) were committed to opening up all files and making records transparent in order to glean who served the Communist regime. This was the Romanian model, but the Constitutional Tribunal blocked all legislative attempts, claiming it was unconstitutional.\nAs the saga of the Tribunal plays out, along with the other attacks on the new Polish government by hostile media and EU politicians, it is important for Poland to reaffirm that Republican ideals of rule of law are optimal.\nThis is what the new Polish government was elected to uphold. But this only applies when there is a codified rule of law to be adhered to. When the “watchers” have been corrupted, their legitimacy is nullified, and reform is needed. With the people of Poland clamouring for these types of reforms (validated at the ballot box in both the presidential and parliamentary elections), reforms that uproot the post-communist status quo, PiS has been endowed with a moral and political imperative to deliver them. One can see the seriousness with which they are taking this mandate.\nHopefully they will be able to see these reforms through despite the potent vitriol from those whose agenda does not prioritise Polish national sovereignty or high integrity domestic governance.","url":"https://www.breitbart.com/europe/2016/03/28/new-polish-government-attempts-to-break-two-decades-of-post-communist-corruption-and-is-met-with-derision-and-censure-by-the-eu-and-its-pliant-western-media/"}
