{"authors":["Mary Chastain"],"date_download":"2018-10-30 19:50:11","date_modify":"2018-10-30 19:50:11","date_publish":"2015-02-26 19:26:33","description":"NATO member Poland has announced plans to send Polish military personnel to Ukraine to help train the Ukrainian military in their fight against Russian-backed troops in the east. |","filename":"data/vaneerConsumption/PolandWillSendTroopstoTraintheUkrainianArmy.json","image_url":"https://media.breitbart.com/media/2015/02/poland-troops-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_26__1540929011.html","title":"Poland Will Send Troops to Train the Ukrainian Army","title_page":"Poland Will Send Troops to Train the Ukrainian Army | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NATO member Poland has announced plans to send Polish military personnel to Ukraine to help train the Ukrainian military in their fight against Russian-backed troops in the east.\n“The Ministry of Defence intends to send Polish instructors to support the training of Ukrainian non-commissioned officers,” said defense ministry advisor Bogusław Pacek.\nThe Polish instructors will meet their counterparts in Lviv and Kiev. The Ukrainians will then use the new knowledge gathered from training exercises to train the army and non-commissioned officers. Defense Minister Tomasz Siemoniak claimed 33 Ukrainian military officers are currently in Poland for training. He also did not rule out sending weapons to Ukraine, but added, “now is the wrong moment for that because more weapons could lead to an escalation of the conflict in eastern Ukraine.”\nOn February 16, Poland revealed a plan to invest over $42 billion on military equipment and training to strengthen their forces. The country, which was ripped apart by the Nazis and Soviet Union, no longer believes “peace in Europe is a given.” Warsaw admits the war in Ukraine is the reason why the country needs to boost their defenses.\n“The key to a political and military solution lies in Moscow,” stated President Bronislaw Komorowski. “The possibility of a lasting peace still isn’t close.”\nThe United Kingdom shocked Europe this week when Prime Minister David Cameron declared that British troops will arrive in Ukraine to train the army. Cameron said Europe will suffer “deeply damaging” consequences if the world does not stand up to Russian President Vladimir Putin. Over 75 British troops will train Ukrainian officials on “infantry skills, intelligence gathering, medical aid and logistics.”\n“The countries of Europe depend on a rules-based system where people obey the rules, and the instability we will yield if we don’t stand up to Russia in the long term will be deeply damaging to all of us,” said Cameron. “You will see further destabilisation — next it will be Moldova or one of the Baltic states — and that sort of instability and uncertainty will be dreadful for our economies, dreadful for our stability.”","url":"https://www.breitbart.com/national-security/2015/02/26/poland-will-send-troops-to-train-the-ukrainian-army/"}
