{"authors":[],"date_download":"2018-10-30 21:56:19","date_modify":"2018-10-30 21:56:19","date_publish":"2016-04-14 16:46:00","description":"(Reuters) - Poland cannot take in the 7,000 refugees it agreed to accept and thinks the plan to distribute 120,000 migrants across the European union is | London / Europe","filename":"data/vaneerConsumption/PolandRefusesToTakeInAgreedMigrantsSaysEUQuotaPlanIsDead.json","image_url":"https://media.breitbart.com/media/2016/04/Screen-Shot-2016-04-14-at-17.44.02.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_04_14__1540936579.html","title":"Poland Refuses To Take In Agreed Migrants, Says EU Quota Plan Is 'Dead'","title_page":"Poland Refuses To Take In Agreed Migrants, Says EU Quota Plan Is 'Dead' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(Reuters) – Poland cannot take in the 7,000 refugees it agreed to accept and thinks the plan to distribute 120,000 migrants across the European union is “dead”, its deputy foreign minister was quoted as saying on Thursday.\nKonrad Szymanski told the newspaper Dziennik Gazeta Prawna that few of the 28 other EU countries would implement the quota system agreed at a Brussels summit in late September over vehement objections from four ex-communist east European states.\nPoland’s previous government reluctantly accepted Poland’s assigned quota and the new conservative government that won a general election in late October initially agreed to respect it despite its own criticism of the plan.\n“I don’t see a possibility to implement this decision and I can’t see it happen also in most EU countries. This decision is dead,” Szymanski said in the interview.\n“It was not being implemented from the very beginning and nothing points to the fact that the majority of EU countries would implement it.”\nThe flow of refugees and migrants from the Middle East and Africa to Europe, which rose to over a million last year, has slowed since the closing of borders along the Balkan route, but officials expect it to surge again with warmer weather.\nAfter Islamist militants killed 130 people in Paris last November, Szymanski said Warsaw could not take in its quota of migrants without security guarantees.\nForeign Minister Witold Waszczykowski said in January that Warsaw would respect the quota deal even though it regarded it as legally flawed.\nPoland’s refugee quota is small compared to larger EU countries but its new government is one of the loudest opponents of the plan.\nJaroslaw Kaczynski, leader of the conservative eurosceptic Law and Justice (PiS) party that heads the new government, said last year that migrants could bring diseases and parasites into Poland.","url":"https://www.breitbart.com/europe/2016/04/14/poland-refuses-take-agreed-migrants-says-eu-quota-plan-dead/"}
