{"authors":[],"date_download":"2018-10-22 22:21:08","date_modify":"2018-10-22 22:21:08","date_publish":"2017-04-26 04:21:19","description":"The woman raped by filmmaker Roman Polanski in 1977 when she was a teen lashed out at prosecutors in the case on Tuesday, accusing them of seeking to further...","filename":"data/vaneerConsumption/PolanskivictimlashesoutatUSprosecutors.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/04/wire-463071-1493176885-139_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446248_Polanski-victim-lashes-US-prosecutors_1540246868.html","title":"Polanski victim lashes out at US prosecutors","title_page":"Polanski victim lashes out at US prosecutors | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A combo of US writer and former actress Samantha Geimer who, at the age of 13, was raped by French-Polish film director Roman Polanski\nThe woman raped by filmmaker Roman Polanski in 1977 when she was a teen lashed out at prosecutors in the case on Tuesday, accusing them of seeking to further their careers rather than resolve the matter.\n\"Celebrity cases should not be misused by those like yourselves for some limelight and career advancement,\" Samantha Geimer wrote in a scathing letter to Los Angeles County District Attorney Jackie Lacey and his deputy Michele Hanisee, who is handling Polanski's case.\nThe letter, dated April 21 and a copy of which was obtained by AFP, was brought up at a hearing in the case on Tuesday.\nGeimer said she was \"outraged\" that prosecutors \"continue to cover up the misconduct that has occurred in this case, which began 40 years ago and continues today.\"\n\"You and those who have come before you have never protected me, you have treated me with contempt, using a crime committed against me to further your own careers,\" she added.\nGeimer is seeking to have authorities release a transcript of testimony by the prosecutor who initially handled the case, Roger Gunson.\nThe 83-year-old Polanski, who lives in France, also wants the document unsealed on grounds they will prove that Gunson had agreed to a plea deal calling for the filmmaker to be sentenced to time already served behind bars.\nThe director of \"Rosemary's Baby\" and \"Chinatown\" was accused of drugging Geimer when she was 13 before raping her at film star Jack Nicholson's house in Los Angeles in 1977.\nHe admitted statutory rape after a number of more serious charges were dropped, and spent an initial 42 days in jail before being released.\nBut in 1978, convinced a judge was going to scrap his plea deal and send him to prison for decades, he fled for France and has been on the run ever since.\nHis attorney Harland Braun argues that Polanski has \"already done his time\" and wants to resolve the case with a finding that he has completed his sentence.\nProsecutors, however, have balked at his demand, saying that Polanski's celebrity status should not afford him special treatment.\nScott Gordon, the judge overseeing the case that has become increasingly convoluted, in April denied Polanski's motion seeking information on whether he risked serving more time if he returned to the United States.\n- 'Notches in your belts' -\nHanisee in a response to Geimer's accusations said Tuesday that her office \"has never 'covered up' any misconduct, nor is there, as you suggest, any misconduct continuing today.\"\nGeimer in her letter implored prosecutors to \"DO YOUR JOB\" and said \"victims and those who commit crimes are not just wins and losses, not just notches in your belts.\"\n\"I have spent 40 years with a boot on my neck filled by one powerful man after another, standing on a 13-year-old rape victim's suffering to further their own purposes and to serve themselves, and sickened that it has now been filled by women,\" she said.\nA hearing on the motion to unseal Gunson's testimony has been scheduled June 9.\nPolanski has been engaged in a decades-long cat-and-mouse game with US officials seeking his extradition for trial, before a global audience split between continuing outrage and forgiveness for his acts.\nPolanski was arrested in Switzerland in 2009 on a US extradition request and spent 10 months under house arrest before Bern rejected the US order.\nThe United States then asked Poland to extradite Polanski in January 2015, but the country's Supreme Court ruled in December that he had served his time under the plea deal.","url":"https://www.dailymail.co.uk/wires/afp/article-4446248/Polanski-victim-lashes-US-prosecutors.html"}
