{"authors":[],"date_download":"2018-10-22 20:45:56","date_modify":"2018-10-22 20:45:56","date_publish":"2014-05-03 15:20:05","description":null,"filename":"data/vaneerConsumption/PoliceChargeTeeninDeathof8YearOldBoyKilledHelpingSister.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/418116/cobb-ejo-50314_939b98aea43a9a3d7db516f5b7a158c3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_police-charge-teen-death-8-year-old-boy-killed-helping-n96291_1540241156.html","title":"Police Charge Teen in Death of 8-Year-Old Boy Killed Helping Sister","title_page":"Police Charge Teen in Death of 8-Year-Old Boy Killed Helping Sister","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA 16-year-old suspect was charged with murder and strangulation in the death of an 8-year-old Virginia boy who was trying to defend his sister during a sexual assault, police said Saturday.\nRichmond police are not identifying the suspect because of his age.\nHe was taken into custody after the attack was reported at 6:30 p.m. Thursday, but police waited to charge him while he was being medically evaluated.\nThe victims, Martin Cobb and his 12-year-old sister, were playing on train tracks behind their family’s home when the suspect approached them, police said.\nFamily told NBC affiliate WWBT that Martin was trying to defend his sister when he was fatally struck, possibly with a brick. He died at the scene, while his sister was taken to the hospital, where she was still recovering Friday.\nPolice declined to detail the attack or the severity of the girl’s injuries.\nBut Dionne Waugh, a spokeswoman for the Richmond police, told NBC News that outraged neighbors helped cops track down the alleged assailant.\n“The community’s response has been tremendous,” Waugh said Friday.\n— Erik Ortiz","url":"https://www.nbcnews.com/news/crime-courts/police-charge-teen-death-8-year-old-boy-killed-helping-n96291"}
