{"authors":[],"date_download":"2018-10-30 20:54:11","date_modify":"2018-10-30 20:54:11","date_publish":"2016-03-09 12:39:20","description":"One of the two police officers at the center of a controversial 2010 shooting death of a South Georgia mother has died after a bout with brain cancer, according to local media reports.","filename":"data/vaneerConsumption/PoliceofficerwhoshotCarolineSmallhasdied.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/09/Images/photos.medleyphoto.8947342.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_police-o_24a8648563d4eb1f42f58e19f2dc8a33__1540932851.html","title":"Police officer who shot Caroline Small has died","title_page":"Police officer who shot Caroline Small has died","title_rss":"NULL","source_domain":"ajc.com","text":"One of the two police officers at the center of a controversial 2010 shooting death of a South Georgia mother has died after a bout with brain cancer, according to local media reports.\nIt’s unclear how the death of Michael Todd Simpson will impact the grassroots movement to get the case re-opened and presented to a new grand jury. Simpson, who was 49, died Friday and funeral services were held on Tuesday, the Brunswick News reported.\nSimpson and fellow Glynn County officer Sgt. Robert C. Sasser fired a barrage of eight bullets into Caroline Small’s windshield — all of it captured in a dramatic dashcam video. Both officers were cleared by a Glynn County grand jury in 2011, but an Atlanta Journal-Constitution/Channel 2 Action investigation last year drew fresh scrutiny to the case and calls for state and local officials to re-open the investigation.\nThe Georgia Bureau of Investigation supervisor who oversaw the investigation in the Small case called it the worst police shooting he’d investigated in his career. Particularly troubling to some, including Small’s family, were comments Simpson and Sasser made after the shooting comparing their marksmanship.\nSmall’s family formed a grassroots group, Justice For Caroline Small, and have been pressing for the case to be re-opened and handled by an independent prosecutor who can present the case to a new grand jury.\nSimpson left the Glynn County Police Department in 2014. He worked part of last year at the Glynn County sheriff’s office, but left the agency in December, according to records with the state agency that certifies officers.\nSasser remains employed with the Glynn County Police Department.","url":"https://www.ajc.com/news/breaking-news/police-officer-who-shot-caroline-small-has-died/6gJRGUL72LKPAgMhSK5GLL/"}
