{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 02:31:45","date_modify":"2018-10-23 02:31:45","date_publish":"2016-01-28 17:20:08","description":"Detectives in San Jose, California, have today revealed evidence they say proves Steven Hlebo, 39, killed co-worker Kyle Myrick, 28 (pictured), despite Hlebo's claims that he is being framed.","filename":"data/vaneerConsumption/PolicerevealevidenceagainstbikeshopworkerSteveHleboaccusedofmurder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/26/15/3098CDED00000578-0-image-a-26_1453821373543.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421305_Police-say-severed-ear-pools-blood-bike-shop-prove-employee-killed-worker-accused-man-claimed-framed_1540261905.html","title":"Police reveal evidence against bike shop worker Steve Hlebo accused of murder","title_page":"Police reveal evidence against bike shop worker Steve Hlebo accused of murder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"claimed in an interview from jail that he is being framed\nWhen officers arrested Hlebo later that evening, blood was inside his truck\nEmployee told police that Myrick disappeared a short time after, before Hlebo's truck was seen backed up to a nearby abandoned building\nPair were last seen working together at GP Sports bike shop on Friday\nPolice have revealed evidence they say proves a motorbike salesman killed his new co-worker, including pools of blood found in his car and a severed ear discovered at their workplace.\nSteve Hlebo, 39, who worked at GP Sports motorbike shop in San Jose, California, was arrested on Saturday and charged with killing Kyle Myrick, 28, who was reported missing the day before.\nDespite Myrick's body not being found, officers said they had enough evidence to charge Hlebo with murder, some of which was revealed in a statement of the facts presented in court today.\nCops believe the men got in a fight while building ATVs before Hlebo killed Myrick, loaded his body into his truck, then disposed of it at an unknown location, the San Jose Mercury reports.\nScroll down for video\nOfficers have today revealed evidence that they say proves Kyle Myrick, 28 (pictured), was killed by co-worker Steven Hlebo, 39, despite no body being found\nDetectives believe Hlebo (pictured) and Myrick got into a fight while building ATVs at GP Sports bike store in San Jose, California, before Hlebo killed Myrick, loaded the body into his truck, and disposed of it\nOfficers say that large amounts of blood and a severed ear found near the bike store, plus more blood found inside Hlebo's truck, are enough to convict him despite his claims that he is being framed\nIn an interview from jail yesterday, Hlebo claimed his is being framed for the killing.\nLaying out their case today, San Jose police Detective Sgt. Paul Hamblin and Detective Jason Tanner said that Myrick and Hlebo were last seen together on Friday afternoon after being sent to go and assemble two ATVs in a lot behind the GP Sports store.\nWhen an employee went to check on them later, he found the gate to the lot locked, which he said was unusual, while Myrick was nowhere to be seen.\nWhen he asked Hlebo where Myrick was, the employee said Hlebo claimed not to know.\nLater in the day, the employee recalled seeing Hlebo's truck pulled up to the back entrance of an abandoned building on the site which had been gutted by a fire in 2014.\nWhen Hlebo was asked to explain what he was doing, he gave a 'nonsensical' answer, the employee told detectives.\nLater, when asked to look for Myrick, Hlebo appeared reluctant and refused to go into the abandoned unit, claiming there were 'ghosts' inside.\nAn employee at GP Sports told investigators that Myrick (pictured) and Hlebo were last seen together going into a lot behind the main store to assemble bikes, before the lot was found locked up later\nThe same employee told cops Hlebo's truck was later seen backed up against an abandoned building near the shop (right) and when asked about it he gave a 'nonsensical' answer\nAfter Hlebo went home for the night, that employee and another staff member said they checked the abandoned building and found the blood and ear which is believed to have belonged to Myrick\nAfter the bike shop closed at 6pm Hlebo left, and the employee and another coworker decided to enter the burned-out building.\nInside, in a small 5ft by 5ft storage unit, they found a good deal of fresh blood spattered across the wall and floor and decided to call police.\nWhen officers arrived they found blood stains suggesting that a body had been dragged to where Hlebo's truck was parked, and a severed ear on the floor of the storage unit.\nOfficers then went to Hlebo's home, only to discover he was out, and staked the property out until 2am when he finally returned home.\nAt that point officers entered the property and searched for Myrick, who was not found, before inspecting Hlebo's truck.\nInside officers said they found more fresh blood in the vehicle's cab, and decided to arrest Hlebo.\nMyrick's body has still not been found and today family members appealed for more volunteers to help them search the area around the bike store and in the nearby San Jose Mountains\nAccording to an unnamed relative, Hlebo also confessed to killing Myrick and dumping his body in the ocean, police said.\nHlebo had previously claimed during a jailhouse interview that he was being framed for the crime after somebody drugged his coffee.\nAccording to Hlebo he had been drugged 'for days' with an unknown substance that kept him awake at night, explaining why he was out until 2am the evening Myrick disappeared.\nHowever, Hlebo refused to say who he believes drugged him, or what motive they could have had for killing Myrick themselves.\nMyrick and Hlebo had been working for the same company for several years before Myrick went missing, though had only been located in the same store for around five days.\nSearches for Myrick's body have entered their fourth day today, with relatives continuing to comb the area around the GP Sports store and parts of the Santa Cruz Mountains.","url":"https://www.dailymail.co.uk/news/article-3421305/Police-say-severed-ear-pools-blood-bike-shop-prove-employee-killed-worker-accused-man-claimed-framed.html"}
