{"authors":["Chriss W. Street"],"date_download":"2018-10-30 20:03:21","date_modify":"2018-10-30 20:03:21","date_publish":"2016-10-03 17:58:36","description":"Private detective and former Riverside cop Christopher Joseph Lanzillo, hired by the union-led Costa Mesa Police Association to set up a DUI scam against a conservative City Councilman, pleaded guilty to felony charges of false imprisonment and conspiracy to file a false police report. | Local","filename":"data/vaneerConsumption/PoliceUnionHiredPrivateDetectivePleadsGuiltytoFalseDUIScamagainstConservativeCouncilman.json","image_url":"https://media.breitbart.com/media/2016/09/wi/afp/26/2ljmfea.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_10_03__1540929801.html","title":"Police Union Hired Private Detective Pleads Guilty to False DUI Scam against Conservative Councilman","title_page":"Police Union Hired Private Detective Pleads Guilty to False DUI Scam against Conservative Councilman | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Private detective and former Riverside cop Christopher Joseph Lanzillo, hired by the union-led Costa Mesa Police Association to set up a DUI scam against a conservative City Councilman, pleaded guilty to felony charges of false imprisonment and conspiracy to file a false police report.\nLanzillo on August 22, 2012 placed a tracking device on then conservative Costa Mesa Mayor Jim Righeimer’s car to set up a crooked DUI entrapment scam during budget and union contract negotiations, according to Orange County prosecutors. He and former Riverside detective Scott Impola, are still awaiting trial. He then used a GPS tracker to electronically follow the Mayor home from a local bar, and then called 911.\nCosta Mesa Police Officers responded, detained Righeimer, and administered a field sobriety test. The city cops seemed surprised when the Mayor passed a field sobriety test. At a news conference shortly thereafter, Mayor Righeimer provided a restaurant receipt listing that he had only been drinking Diet Coke.\nLanzillo is alleged to have been aided and abetted by a second private investigator named Scott Impolo, a former Riverside detective that is still awaiting trial. The goal of the effort funded by the Costa Mesa Police Association, has been alleged to dig up dirt on the then mayor and Councilman Stephen Mensinger, who is currently the Mayor of Costa Mesa.\nBoth private detectives had pleaded not guilty. But at a pre-trial hearing in Santa Ana courthouse, Lanzillo reversed his plea and admitted to four felony counts tied to the false DUI report against City Councilman Jim Righeimer and for using another GPS tracking device to tail current Costa Mesa Mayor Stephen Mensinger.\nRigheimer made a statement following Lanzillo’s guilty plea:\n“This case revolves around the Costa Mesa Police Association hiring private investigators to get information to extort elected officials for the benefit of their member’s salary and pensions. This is pure political corruption. Mr. Lanzillo and Mr. Impola worked at a law firm that represented over 130 Police Officer Associations. They worked full-time getting dirt on elected officials that could be used later to extort these same elected officials when their contract came up for negotiation.”\nThe union representing Costa Mesa police has acknowledged hiring Lanzillo and Impolo’s employer, the now-shuttered law firm Lackie, Dammeier, McGill & Ethir, to investigate Mensinger, Righeimer, Costa Mesa Councilman Gary Monahan, and candidate Colin McCarthy for “candidate research.”\nThe Costa Mesa Police Association has vehemently denied for four years knowing about any illegal actions on the part of the law firm they hired or its investigators during a period that the City Council was considering outsourcing city services.\nSenior Deputy District Attorney Robert Mestman confirmed to the Orange County Register that Lanzillo was not offered a plea deal, instead admitting to all the charges he was facing. He added, “I think it speaks to the strength of our case,” Mestman said.\nMayor Mensinger to the Register, “I think the message is clear, that unions and their candidate operatives who are involved in extortion and dirty tricks will see justice served cold,” He added, “I’m elated with the plea and my family can put this chapter of the ongoing union nightmare to rest.”\nMr. Lanzillo is scheduled to face up to a four years and four months prison sentence at a hearing on January 13, 2017.","url":"https://www.breitbart.com/local/2016/10/03/private-detective-pleads-guilty-union-sponsored-dui-scam-costa-mesa-councilman/"}
