{"authors":["Breitbart News"],"date_download":"2018-10-30 21:13:11","date_modify":"2018-10-30 21:13:11","date_publish":"2015-03-28 02:33:29","description":"Actress Taraji P. Henson has apologized to police in the Southern California city of Glendale for accusing an officer of racially profiling her son. |","filename":"data/vaneerConsumption/PoliceProveTarajiPHensonsStoryofSonsRacialProfilingWasFalse.json","image_url":"https://media.breitbart.com/media/2015/03/TARAJI-P-HENSON-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_27__1540933991.html","title":"Police Prove Taraji P. Henson's Story of Son's Racial Profiling Was False","title_page":"Police Prove Taraji P. Henson's Story of Son's Racial Profiling Was False | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES (AP) — Actress Taraji P. Henson has apologized to police in the Southern California city of Glendale for accusing an officer of racially profiling her son.\nHenson posted a statement on Instagram Friday afternoon, hours after the Glendale Police Department released video of a traffic stop of the actress’ son that showed the officer respectfully dealing with the 20-year-old.\n“A mother’s job is not easy and neither is a police officer’s,” Henson wrote on the social networking site. “Sometimes as humans we overreact without gathering all the facts. As a mother in this case I overreacted and for that I apologize.\n“Thank you to that officer for being kind to my son,” Henson wrote.\nHenson accused a Glendale police officer of profiling her son in an interview with Uptown magazine.\nThe Los Angeles Time obtained the video of the October traffic stop of Henson’s son, Marcell, for driving through a lighted crosswalk while a pedestrian was walking in it.\nHenson acknowledged he had marijuana in his backpack and was cited for having it without a valid prescription. The officer did not cite him for the traffic violation, but confiscated the marijuana.\nThe “Empire” star said in the interview her son was also racially profiled by an officer at the University of Southern California and that prompted him to transfer to Howard University in Washington, D.C.\nHenson said her son was stopped on the Los Angeles campus “for having his hands in his pockets.”\nHenson’s apology Friday did not mention USC.\nUSC Public Safety Chief John Thomas wrote in a statement earlier this week that he wanted to discuss the allegations with Henson, but the school had no update Friday on whether that conversation had occurred.\nThomas wrote he was racially profiled as a teenager and was “deeply disturbed” to learn that Henson’s son felt profiled because of his race.","url":"https://www.breitbart.com/entertainment/2015/03/27/police-prove-taraji-p-hensons-story-of-sons-racial-profiling-was-false/"}
