{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:48:08","date_modify":"2018-10-30 22:48:08","date_publish":"2016-09-07 19:15:04","description":"Six years after Citizens United—the landmark U.S. Supreme Court decision that says corporations and unions have a 1st Amendment right to unlimited","filename":"data/vaneerConsumption/PoliticalParadoxProp59asksCalifornianstocondemnabigmoneysystemlongusedhere.json","image_url":"https://calmatters.org/wp-content/uploads/CITIZENS_UNITED_Photo1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939688.html","title":"Political Paradox? Prop. 59 asks Californians to condemn a big-money system long used here","title_page":"Political Paradox? Prop. 59 asks Californians to condemn a big-money system long used here | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Six years after Citizens United—the landmark U.S. Supreme Court decision that says corporations and unions have a 1st Amendment right to unlimited campaign spending—presidential candidates across the spectrum have condemned the campaign finance system it shaped. “Corrupt,” says Bernie Sanders. “Pernicious,” says Hillary Clinton. “A broken system,” says Donald Trump.The issue is getting extra attention in California because of Proposition 59, which asks if voters want the state’s elected officials to take steps to try to reverse Citizens United and related cases. It’s an attempt to rein in the influence of lucrative super-PACS on elections. Undoing Citizens United would require either amending the U.S. Constitution or a lawsuit that causes the U.S. Supreme Court to reverse itself. As an advisory measure, Prop. 59 is essentially an opinion poll that lacks authority to directly change the law.Yet there is a certain irony in asking Californians to rebuke the nation’s approach to funding political campaigns. The very system allowed by Citizens United—in which corporations and unions spend unlimited amounts on independent advertising campaigns—has been accepted for much longer here in the Golden State.Known in California as independent expenditures, these became common in state-level races after 2000, when voters capped the amount of money that could be donated to a candidate for state office. The result: Groups that wanted to spend heavily to elect someone found other ways to do it. In many cases, they poured money into their own advertising campaigns to praise or slam a candidate—a completely legal maneuver as long as the candidate is not involved.\nIndependent expenditure have become a growing force in legislative races, making up a steadily larger share of the money spent on state elections—$53.1 million in 2014. In some races, these groups spend more than the candidates do on their own campaigns. Many candidates play along, even posting photos on their campaign websites for outside groups to use in producing ads. It’s the same thing that happens with super-PACs at the federal level.\n“Citizens United didn’t change the law in California but it did, I think, change the culture,” said Jessica Levinson, a Loyola Law School professor specializing in campaign finance law. “It has created a psychological shift in terms of the amount of money we expect to be spent by, quote unquote, independent groups.”\nMost Californians may not have paid much attention to super-PAC type spending in legislative races until Citizens United raised public awareness. The court decision has grown into a larger symbol for the prevalence of money in politics and the feeling—especially on the left—that voters are being drowned out by wealthy interests.\nThe issue followed a convoluted path to land on the November state ballot: The Democrat-dominated California Legislature first passed a resolution stating its disdain of Citizens United, then advanced a ballot measure to let votes express their disapproval, too. Gov. Jerry Brown sent mixed signals, allowing this measure to get on the ballot without signing the bill, and saying Citizens United was “wrongly decided” but that he doesn’t want California to make a habit of cluttering the ballot with advisory measures\nKey figures on each side of the Prop. 59 campaign are two legislators who had opposite experiences with independent expenditures during their 2014 run for state Senate.\nSen. Ben Allen (D-Santa Monica) benefited from nearly $1.5 million in independent spending that supported him. Sen. Jeff Stone (R-Temecula) had to overcome more than $1.5 million in independent spending against him.\nYet Allen opposes Citizens United and the campaign finance system that helped elect him, while Stone supports the Supreme Court’s decision, even though he’s felt the brunt of independent attacks.\nState Sen. Jeff Stone (R-Temecula) says efforts to overturn Citizens United are taking “the wrong approach.”“It was just obscene,” Stone said. “These groups can come together and try to influence and buy elections.” But he called efforts to overturn Citizens United “the wrong approach,” favoring instead changes to the law to require immediate disclosure of campaign contributions. He also criticized the non-binding nature of Prop. 59, saying it clutters an already-long ballot and could confuse voters.\nAllen, who wrote the bill putting Prop. 59 on the ballot, said the growth of independent spending makes the issue more salient to many of his fellow lawmakers. “We’re not forgetting these experiences that we’re having and how scary it is to be in a race when you’ve got all sorts of people out there messaging for you and against you, with no accountability or connection,” he said.\nHe called Prop. 59 “a significant tool” that is one piece of a much larger nationwide strategy. Colorado and Montana have already approved similar advisory measures and the state of Washington is voting on one in November.\nAmending the Constitution is a lengthy process that requires approval by two-thirds of members of Congress plus the support of at least 38 states. Even if opponents of Citizens United can’t muster enough votes to amend the Constitution, they hope a win on Prop. 59 could help sway deliberating judges if the Supreme Court ever reconsidered its decision\n“The Constitution is not changed overnight,” Allen said. “The folks who went out and protested segregation in the south before the Brown v. Board decision didn’t do their work in vain. That didn’t change anything overnight on its own, but it was part of a collective movement that ended up making enormous changes… So this is part of a movement. It’s part of a trajectory.”","url":"https://calmatters.org/articles/political-paradox-prop-59-asks-californians-to-condemn-a-big-money-system-long-used-here/"}
