{"authors":[],"date_download":"2018-10-22 22:59:08","date_modify":"2018-10-22 22:59:08","date_publish":"2014-06-11 16:39:43","description":"Initial reports said Miller’s wife, Amanda, may have fatally shot him before she committed suicide during Sunday's anti-government ambush.","filename":"data/vaneerConsumption/PoliceFatallyShotLasVegasGunmanJeradMillerDuringGunfight.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/497456/140609-vegas-shooters-jhc-1520_6bf0dbef578906d191194df76256ff7b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_vegas-cop-killers_police-fatally-shot-las-vegas-gunman-jerad-miller-during-gunfight-n128546_1540249148.html","title":"Police Fatally Shot Las Vegas Gunman Jerad Miller During Gunfight","title_page":"Police Fatally Shot Las Vegas Gunman Jerad Miller During Gunfight","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe bullet that killed Las Vegas gunman Jerad Miller came from a police officer’s rifle, authorities confirmed Wednesday, revealing video surveillance footage from the final shootout.\nInitial reports said Miller’s wife, Amanda, fatally shot him before she committed suicide Sunday amid a gunfight with cops in a Las Vegas Walmart.\nSign up for breaking news alerts from NBC News\nThe harrowing video shows the pair on the ground with their guns drawn. In the moment prior to what is shown on the clip, Jerad Miller, 31, had already been struck by police, said Assistant Clark County Sheriff Kevin McMahill.\n“None of the rounds that she fired hit him,” McMahill said at a news conference.\nBefore the video goes dark, an officer can be heard saying 22-year-old Amanda Miller was about to commit a “405” — the local police department’s code for a suicide.\nMcMahill said investigators conducted a forensic review of evidence at the crime scene and an autopsy of the bodies to determine “she did not shoot him.”\nThe suspects were carrying three guns when they killed two police officers who were having lunch, police said. The firearms — a Smith & Wesson 9 mm, a Ruger .38-caliber revolver and a Winchester 1300 12-gauge pump-action shotgun with a pistol grip — were later recovered.\nAfter killing officers Alyn Beck and Igor Soldo at a pizzeria, the pair stripped them of their weapons and ammunition. They left a swastika, a Revolutionary War-era “Don’t Tread On Me” flag and a note proclaiming, “The revolution is beginning,” on the fallen officers.\nThe pair then migrated to the nearby Walmart, where a gun-carrying customer, 31-year-old Joseph Robert Wilcox, tried to take down Jared Miller. But police say Amanda Wilcox blindsided Wilcox and fatally shot him at close range, police said.","url":"https://www.nbcnews.com/storyline/vegas-cop-killers/police-fatally-shot-las-vegas-gunman-jerad-miller-during-gunfight-n128546"}
