{"authors":["Emma Pettit"],"date_download":"2018-10-30 22:16:19","date_modify":"2018-10-30 22:16:19","date_publish":"2017-03-15 00:00:00","description":"A former North Little Rock service station employee was arrested Tuesday after he signed for a pack of lottery tickets, then tried to cash in a few of them last year, authorities said.","filename":"data/vaneerConsumption/PoliceExworkeratNorthLittleRockservicestationtriedtocashlotteryticketsthatwentmissing.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/15/Screen_Shot_2017-03-15_at_1.46.27_PM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_15__1540937779.html","title":"Police: Ex-worker at North Little Rock service station tried to cash lottery tickets that went missing","title_page":"Police: Ex-worker at North Little Rock service station tried to cash lottery tickets that went missing","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A former North Little Rock service station employee was arrested Tuesday after he signed for a pack of lottery tickets that went missing and then tried to cash in a few of the winners, authorities said.\nThe investigation started last year after a manager of the Petro Travel Center at 3205 Valentine Road realized some lottery tickets that had been delivered to the store were missing, according to a police report. An employee reportedly found the missing package torn open around the counter with one booklet taken out.\nPolice said they determined an employee, 34-year-old Matthew Todd Sitzmann of Cabot, signed for a package of lottery tickets April 29, but the tickets were never put in service. Sitzmann was working as a cook at a restaurant inside the service station, police said.\nAn official with the state lottery commission provided police with a photo that shows Sitzmann going into a store and trying unsuccessfully to use a few tickets, the report said.\nA warrant was issued for Sitzmann in July. He was arrested eight months later around 11 p.m. Tuesday in Jacksonville and was charged with lottery fraud, a felony.\nA court date was scheduled for Wednesday morning.","url":"https://www.arkansasonline.com/news/2017/mar/15/former-north-little-rock-service-station-employee-/"}
