{"authors":[],"date_download":"2018-10-30 14:25:04","date_modify":"2018-10-30 14:25:04","date_publish":"2018-08-13 14:39:00","description":"Authorities are looking for a woman who hit an officer with a car and sped away as police fired at t...","filename":"data/vaneerConsumption/Policeshootatwomanwhohitofficerwithcardriverontherun.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/13/Images/SceneOIS.JPEG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_breaking-gb_f21769fa98c2625e184ee358c388da5a__1540909504.html","title":"Police shoot at woman who hit officer with car; driver on the run","title_page":"Police shoot at woman who hit officer with car; driver on the run","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities are looking for a woman who hit an officer with a car and sped away as police fired at the vehicle, the GBI said.\nThe dramatic sequence of events started about 1:10 a.m. Monday when Clayton County police responded to a report of a fight near Conley in the 1800 block of Marceau Drive.\nMedia advisory: GBI Investigates Officer Involved Shooting in Clayton County, GA https://t.co/7sDW5dprHp pic.twitter.com/XXxeXWNHWQ — GA Bureau of Invest (@GBI_GA) August 13, 2018\n“When officers arrived, a female attempted to flee the scene in a vehicle,” GBI spokeswoman Nelly Miles said in a news release. “The female driver backed up and struck an officer, pinning him against a marked CCPD patrol car. A CCPD officer fired at the fleeing vehicle.”\nThe officer was taken to Grady Memorial Hospital with a broken leg, she said. The injured officer was later released and is home recovering.\nWhile the car was recovered about a mile from the scene, the woman has not been found, Miles said.\nAuthorities have not released the woman’s name, a description of her or any other details.","url":"https://www.ajc.com/news/crime--law/breaking-gbi-investigating-officer-involved-shooting-clayton-county/1y8GTTUhQyZb0mUODT1jDP/"}
