{"authors":[],"date_download":"2018-10-30 20:33:19","date_modify":"2018-10-30 20:33:19","date_publish":"2015-08-28 13:29:41","description":"Police continued to search Friday for the mother of a baby who was left at the doorstep of a southwest Atlanta home Monday with a pink “Hello Kitty” blanket wrapped around her and her umbilical cord still attached.","filename":"data/vaneerConsumption/Policestilllookingformotherofabandonedbabyrewardoffered.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/28/Images/photos.medleyphoto.8042249.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_police-stil_a9896ac14ef43f3380c1eec8a426522d__1540931599.html","title":"Police still looking for mother of abandoned baby, reward offered","title_page":"Police still looking for mother of abandoned baby, reward offered","title_rss":"NULL","source_domain":"ajc.com","text":"Police continued to search Friday for the mother of a baby who was left at the doorstep of a southwest Atlanta home Monday with a pink “Hello Kitty” blanket wrapped around her and her umbilical cord still attached.\nFive days after Baby Harlan was abandoned, police called for help from the public and announced a reward of up to $2,000 for information, if it leads to an arrest and indictment in the case.\nCriminal charges are not necessarily expected in the case, police have pointed out.\n“We need to find this mother,” Atlanta police Lt. Celeste Murphy said at a press conference Friday.\nAnyone with information can anonymously contact Crime Stoppers Atlanta at 404-577-TIPS, or online at www.crimestoppersatlanta.org, or by texting CSA and the tip to CRIMES (274637).\nNo one had come forward with information as of Friday, Murphy said.\nNamed for the road where she was found —Baby Harlan was discovered about 6:30 p.m. Monday when a family returned home and saw the only hours-old child.\nChance Benton, a family member at the home, said they had no idea who she belonged to.\nThe newborn was taken to Children’s Healthcare of Atlanta at Scottish Rite and was in good condition. Murphy said she was still doing well Friday.\nPolice said that if no relative is found, Baby Harlan would be handed over to the Division of Family and Child Services once she is released from the hospital. Murphy said she was scheduled to be released Friday.\nPolice have said they are concerned about the mother’s condition, and want to make sure she gets proper medical care.\nAtlanta police Sgt. Greg Lyon said Baby Harlan is the city’s first case of a newborn being abandoned this year. The department doesn’t keep statistics, but authorities couldn’t remember an abandonment in 2014 either, Lyon said.","url":"https://www.ajc.com/news/crime--law/police-still-looking-for-mother-abandoned-baby-reward-offered/kALiZ94waAYnL7hDcWFJ4N/"}
