{"authors":["Associated Press"],"date_download":"2018-10-22 20:49:52","date_modify":"2018-10-22 20:49:52","date_publish":"2016-01-28 04:12:40","description":"MEMPHIS, Tenn. (AP) — Memphis police fatally shot one man and were still looking for another involved in a chase Wednesday, authorities said. The incident be...","filename":"data/vaneerConsumption/PoliceOfficersfatallyshootmansearchingfor1other.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:c4805a44d06d42ed979e6242d351a88e-4vVdYopwYQ7f641721b07a8662a4-418_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420187_Tennessee-police-1-person-dead-officer-involved-shooting_1540241392.html","title":"Police: Officers fatally shoot man, searching for 1 other","title_page":"Police: Officers fatally shoot man, searching for 1 other | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police: Officers fatally shoot man, searching for 1 other\nMEMPHIS, Tenn. (AP) — Memphis police fatally shot one man and were still looking for another involved in a chase Wednesday, authorities said.\nThe incident began when officers in two Memphis police cruisers tried to stop a Chevrolet Impala for a routine traffic violation but the driver of the car drove away, Tennessee Bureau of Investigation spokesman Josh DeVine said.\nOfficers started to pursue the car but backed off for safety reasons, DeVine said. Police continued to watch the car as it drove recklessly through a south Memphis neighborhood and crashed.\nTwo women hug each other near the scene of a fatal shooting involving a police officer Wednesday, Jan. 27, 2016, in Memphis, Tenn. The women identified themselves as relatives of the person who was shot on Wednesday. (AP Photo/Adrian Sainz)\nTwo men in the car then fled on foot and an officer from each police vehicle gave chase, he said.\nA third officer, a Shelby County sheriff's deputy, was in the area and also responded to the scene.\nDuring the foot chase, one of the men from the Impala opened fire on the officers, DeVine said. He said the two Memphis officers returned fire, shooting the suspect, who died on the scene. He didn't indicate in what part of the body the man was shot but did note that he was not in custody at the time.\nThe second man who fled the car had not been located, and a search for him was still underway Wednesday night.\nDeVine said the TBI was not releasing the identity of the dead man yet because the next of kin needed to be notified.\nPeople who identified themselves as relatives of the person who was shot were crying and hugging near the St. Andrew AME Church, where dozens of people were gathered, some screaming expletives at police. More than two dozen marked and unmarked police cars lined the streets.\nThe identities of the officers involved in the shooting had not been released, but DeVine did say that one is white and one is black. The dead man was black. Memphis officers involved in shootings are routinely placed on administrative leave.\nIn July, a 19-year-old black man was fatally shot by a white police officer during a fight at a traffic stop in Memphis. The shooting of Darrius Stewart led to peaceful rallies and protests, and calls for the officer, Connor Schilling, to be charged. A grand jury declined to indict Schilling, but federal prosecutors are investigating the shooting.\nLaw enforcement officers and bystanders gather near the scene of a fatal shooting involving a police officer Wednesday, Jan. 27, 2016, in Memphis, Tenn. (AP Photo/Adrian Sainz)\nPolice officers secure the scene of a shooting involving a police officer near a church south of downtown Memphis, Tenn., Wednesday, Jan. 27, 2016. (AP Photo/Adrian Sainz)\nTwo women hug each other near the scene of a fatal shooting involving a police officer Wednesday, Jan. 27, 2016, in Memphis, Tenn. The women identified themselves as relatives of the person who was shot on Wednesday. (AP Photo/Adrian Sainz)\nTennessee Bureau of Investigation spokesman Josh DeVine, left, speaks to the media near the scene of a fatal shooting involving a police officer Wednesday, Jan. 27, 2016, in Memphis, Tenn. (AP Photo/Adrian Sainz)","url":"https://www.dailymail.co.uk/wires/ap/article-3420187/Tennessee-police-1-person-dead-officer-involved-shooting.html"}
