{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:35:53","date_modify":"2018-10-30 20:35:53","date_publish":"2015-10-11 13:48:04","description":"Contents: Palestinian-Israeli violence continues in Gaza and West Bank; Obama administration announces an abrupt change of policy in Syria; Obama administration may be forced into greater military role |","filename":"data/vaneerConsumption/PoliticsMayForceObamatoOverReactMilitarilyinSyria.json","image_url":"https://media.breitbart.com/media/2015/09/obamaz.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_11__1540931753.html","title":"Politics May Force Obama to 'Over-React' Militarily in Syria","title_page":"Politics May Force Obama to 'Over-React' Militarily in Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nPalestinian-Israeli violence continues in Gaza and West Bank\nObama administration announces an abrupt change of policy in Syria\nObama administration may be forced into greater military role\nPalestinian-Israeli violence continues in Gaza and West Bank\nPalestinian protesters in Gaza on Friday (AP)\nSix Palestinians were killed and hundreds of Palestinians and Israeli were wounded on Friday as several weeks of violence continued. ( “9-Oct-15 World View — Israeli-Palestinian violence spreads across West Bank as anger grows”)\nIsmail Haniyeh, the leader of Hamas, which governs Gaza, applauded the recent Palestinian knife attacks on Israelis, and called for a “third intifada.” By contrast, Israeli Prime Minister Benjamin Netanyahu “strongly condemned the harming of innocent Arabs.” Both Israeli and Palestinian security forces are on high alert, with more violence expected. Fox News/AP\nObama administration announces an abrupt change of policy in Syria\nThe Obama administration’s widely ridiculed $500 million program to train and equip Syrian rebels to fight the so-called Islamic State (IS or ISIS or ISIL or Daesh) was “paused” on Friday as a publicly admitted failure. The program was supposed to train thousands of rebels, but the public was shocked several weeks ago when the administration admitted that only “four or five” had been trained, despite the program’s huge price tag.\nAs Foreign Policy magazine put it: “On Capitol Hill, it’s been called “a joke,” a “total failure,” and “a bigger disaster than I could have ever imagined.” And now we have another name for it: dead.”\nA new program has been announced. The new program will provide air support and basic equipment and training to vetted opposition group leaders who are already fighting ISIS and who are committed to fighting ONLY ISIS, and not the regime of Syria’s president Bashar al-Assad.\nBrett McGurk, whose title is “White House deputy envoy to the Global Coalition to Counter Islamic State,” described the new program as follows:\n“Is it best to take those guys out and put them through training programs for many weeks, or to keep them on the line fighting and to give them additional enablers and support? I think the latter is the right answer, and that’s what we’re going to be doing.”\nAccording to Secretary of Defense Ash Carter: “I remain convinced that a lasting defeat of ISIL in Syria will depend in part on the success of local, motivated and capable ground forces. I believe the changes we are instituting today will, over time, increase the combat power of counter-ISIL forces in Syria and ultimately help our campaign achieve a lasting defeat of ISIL.”\nThe old policy was criticized and mocked from the day it was announced last year. The new policy is receiving similar treatment. A NY Times editorial titled “An Incoherent Syria War Strategy” points out that the strategy of finding and arming rebel groups that want to fight ISIS but who are going to be forbidden from fighting the al-Assad regime makes no sense:\n“The initial plan was dubious. The new one is hallucinatory, and it is being rolled out as the war enters a more perilous phase now that Russia has significantly stepped up its military support of Mr. Assad’s forces. There is no reason to believe that the United States will suddenly be successful in finding rebel groups that share its narrow goal of weakening the Islamic State, also known as ISIS or ISIL, but not joining the effort to topple Mr. Assad. Washington’s experience in Syria and other recent wars shows that proxy fighters are usually fickle and that weapons thrust into a war with no real oversight often end up having disastrous effects.”\nThis harsh criticism from a newspaper that regularly slobbers over President Obama symbolizes how much even the left-wing mainstream media, not to mention foreign media throughout the Mideast, now views the Obama administration as weak and rudderless, lurching from one policy to the next. (As another example, it had been widely expected that Secretary of State John Kerry would win this year’s Nobel Peace Prize for the Iran nuclear deal, but even the loony Norwegians have lost faith.) VOA and NY Times\nObama administration may be forced into greater military role\nI’ve written many times about the Harry Truman’s Truman Doctrine of 1947, which made America policeman of the world. The justification is that it’s better to have a small military action to stop an ongoing crime than to let it slide and end up having an enormous conflict like World War II. Every president since WW II has followed the Truman Doctrine, up to and including George Bush. Barack Obama is the first president to repudiate the Truman Doctrine, essentially leaving the world without a policeman.\nCall it Kismet or Karma or God’s Will (or call it an unstoppable generational trend), but America does have an exceptional role in the world, and repudiating that role does not end it. Obama’s policy of apologizing for America has held sway for over six years, but now powerful political pressures are growing to force a change. Those forces are being driven by massive shifts in public attitudes towards Obama, both in the US and abroad, as reflected in worldwide criticism of him in the media as a weak president.\nAccording to the left-leaning Washington Post:\n“Russia’s military moves in Syria are fundamentally changing the face of the country’s civil war, putting President Bashar al-Assad back on his feet, and may complicate the Obama administration’s plans to expand its air operations against the Islamic State. … But others within the administration, and many outside experts, are increasingly worried that if President Obama does not take decisive action — such as quickly moving to claim the airspace over northwestern Syria and the Turkish border, where Russian jets are already operating — it is the United States that will suffer significant damage to both its reputation and its foreign policy and counterterrorism goals. … The current internal administration debate is largely the same one that has kept the administration out of significant intervention in Syria’s civil war for the past four years. On one side, Russia’s involvement has strengthened the winning argument that the United States should avoid direct involvement in yet another Middle East conflict and should continue directing its resources toward countering forces such as the Islamic State that pose a direct threat to U.S. national security. On the other side, the argument is that it makes no strategic sense for the United States to concede Russian dominance of the situation: If Russia succeeds in keeping Assad in power, the problems in the West caused by both the Syrian war and militant expansion will only get worse.”\nThe article describes two sides of the debate whether to intervene in Syria, but does not draw the obvious conclusion that the weight of political opinion is moving sharply towards the side of some kind of intervention — although those that say that “it makes no strategic sense … to concede Russian dominance” do not agree on what steps should be taken to avoid conceding.\nThe left-leaning Brookings Institution makes the claim that intervention in Syria is costing Russia enormously, and so “For the United States, avoiding the temptation to over-react is still the key guideline.”\nBut the article then goes on to describe problems with doing nothing, and even conclude:\n“Finally, the United States and its allies could deliver a series of airstrikes on the Hezbollah bands around Damascus. That would be less confrontational vis-à-vis Russia than hitting Assad’s forces. Hezbollah has already suffered losses in the Syrian war and is not particularly motivated to stand with Assad to the bitter end, away from own home-ground in Lebanon. (Israel would appreciate such punishment, too.)”\nI almost can’t believe my eyes reading this recommendation. American warplanes around Damascus would almost certainly come into contact with Russian warplanes, and even if they didn’t, bombing al-Assad’s close ally Hezbollah could be the trigger that sets off a wider war in this generational Crisis era.\nPolicy can sometimes act like a rubber band that be stretched in one direction so far that when it’s released, it snaps back in the other direction violently. After six years of constantly apologizing for America, the pressure is on President Obama to do something different. Brookings advises Obama about “avoiding the temptation to over-react,” but Obama may be politically forced to decide that with his previous policies so widely criticized and mocked, he has to take some step to prove to the world that he’s a tough leader after all, and he may have to over-react, because no half-measure will provide the proof he needs. Washington Post and Brookings Institution\nKEYS: Generational Dynamics, Israel, West Bank, Gaza, Ismail Haniyeh, Benjamin Netanyahu, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Syria, Brett McGurk, Ash Carter, John Kerry, Harry Truman, Truman Doctrine, Brookings Institution\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/politics/2015/10/11/world-view-politics-may-force-obama-to-over-react-militarily-in-syria/"}
