{"authors":["William Bigelow"],"date_download":"2018-10-30 20:03:33","date_modify":"2018-10-30 20:03:33","date_publish":"2015-10-13 01:49:53","description":"A Florida man, who led Manatee County Sheriff’s deputies on a high-speed chase, claimed his dog was the driver.","filename":"data/vaneerConsumption/PoliceFloridaManCaughtSpeedingClaimsDogDrovetheCar.json","image_url":"https://media.breitbart.com/media/2015/10/Reliford-Cooper-III-Manatee-County-Sheriffs-Office.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_12__1540929813.html","title":"Police: Florida Man Caught Speeding Claims Dog Drove the Car","title_page":"Police: Florida Man Caught Speeding Claims Dog Drove the Car | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Florida man, who led Manatee County Sheriff’s deputies on a high-speed chase, had an interesting explanation once he was apprehended: He was not the driver.\nIt was his dog.\nAt roughly 7:45 p.m. October 7, Reliford Cooper III, 26, raced along streets, running stop signs as he led a deputy chasing him. Cooper went too fast while making a turn, ran into a ditch, wheeled the other way, and landed in another ditch. He then allegedly drove into a home, which finally halted his adventure and caused him to exit the car and started running.\nK9 units arrived, and a perimeter was created as deputies searched for Cooper, ultimately cornering him near a church after churchgoers forced Cooper outside.\nAfter Cooper lambasted police, snapping, “Who was chasing me? You’re slow as ****!,” he informed a deputy, who allegedly smelled alcohol and pot on Cooper, “My dog was driving that car. I ran because I wanted to. You ain’t gonna find no drugs or guns on me.”\nAfter that feeble excuse, Cooper became nauseous and complained of neck pains.\nThere was no dog found in the car; Cooper was taken to Manatee Memorial then taken to jail.","url":"https://www.breitbart.com/politics/2015/10/12/police-florida-man-caught-speeding-claims-dog-drove-car/"}
