{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:57:46","date_modify":"2018-10-30 17:57:46","date_publish":"2016-03-07 16:03:47","description":"Police in Istanbul, Turkey, arrested a woman and fired rubber bullets into a crowd attempting to celebrate International Women's Day.","filename":"data/vaneerConsumption/PoliceFireRubberBulletsintoWomensDayCelebration.json","image_url":"https://media.breitbart.com/media/2016/03/Turkish-Police-fire-at-Intnl-Womens-Day-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_07__1540922266.html","title":"Police Fire Rubber Bullets into Women's Day Celebration","title_page":"Turkey: Police Fire Rubber Bullets into Women's Day Celebration","title_rss":"NULL","source_domain":"breitbart.com","text":"Police in Istanbul, Turkey, arrested a woman and fired rubber bullets into a crowd attempting to celebrate International Women’s Day.\nThe Istanbul governor canceled the rally due to alleged security concerns, but women in Turkey defied the ban and gathered supporters in the city two days before March 8, the official International Women’s Day.\nTurkish police fire rubber bullets to break up International Women's Day rally https://t.co/8q8mqswidv via @Reuters — Sally Jane (@SallyPresto) March 6, 2016\nPolice to women during International Women's Day rally: 'Go home and take a rest. Send (us) your men.' https://t.co/OjHv0FaFcv #Turkey — Cahida Dêrsim (@avjin737) March 6, 2016\n“We have always said that we would never leave the streets for the March 8 demonstration, and we never will. Neither the police nor the government can stop us,” exclaimed protestor Guris Ozen. “You see the power of women. We are here despite every obstacle and we will continue to fight for our cause.”\nThe marchers filed into “the Kadikoy district on the Asian side of Istanbul chanting slogans and carrying purple banners, the hallmark of a movement centered on women’s social and economic issues.” Witnesses saw police “shoving members of the group” while many women fled when the police fired rubber bullets.\nTurkey currently ranks “77th out of 138 countries on a United Nations Development Programme (UNDP) index of gender equality.” The government often faces criticism from its citizens and counterparts over women’s issues.\nLast year, female activists fought with Istanbul police as they marched “towards Gezi Park at Taksim Square.” The police attempted to stop the protesters, but activists hit “officers with the sticks of the banners” they carried.\nHuman rights groups have said violence against women has risen since Islamist President Recep Tayyip Erdoğan took office. In May 2015, Hürriyet reported that men, mostly relatives, killed more than 100 women in the first months of the year. The Domestic Violence Against Women Report 2014 found the country “made no progress in reducing domestic violence between 2008 and 2014.” Researchers discovered “almost 40% of women in Turkey had been physically abused at least once in their lifetime.” They also said one in ten were sexually abused.\nIn 2014, Erdoğan asserted women were not fit to be part of the workforce in the same way men are.\n“You cannot make women work in the same jobs as men do, as in communist regimes,” he said. “You cannot give them a shovel and tell them to do their work. This is against their delicate nature.”\nHe also received backlash after he told a newlywed couple that they would be committing treason against Turkey if they used birth control.\n“One or two (children) is not enough,” he said, adding:\nTo make our nation stronger, we need a more dynamic and younger population. We need this to take Turkey above the level of modern civilisations. In this country, they (opponents) have been engaged in the treason of birth control for years and sought to dry up our generation. Lineage is very important both economically and spiritually. I have faith in you.\nTurkey’s birth rate began to fall in the 1990s, when women chose to pursue higher education, instead of starting a large family. A growing number of women use birth control and choose to start a family in their early thirties. In 2012, then-Prime Minister Erdoğan pressed Turkey to outlaw abortion since Turkey’s birth rate had fallen to 0.12 percent, or an average of about two children per woman. In 1978, the average was 4.33 children.","url":"https://www.breitbart.com/national-security/2016/03/07/turkey-police-fire-rubber-bullets-into-international-womens-day-celebration/"}
