{"authors":[],"date_download":"2018-10-22 22:35:05","date_modify":"2018-10-22 22:35:05","date_publish":"2014-05-12 00:25:41","description":"The California Highway Patrol is being lauded for its efforts in rescuing a Chihuahua off Interstate 680 in Walnut Creek Friday.","filename":"data/vaneerConsumption/PolicePraisedforRescuingTinyDogFromBusyHighway.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/435251/140511-dog-rescue-jms-1935_69fc755bfc258d8c0242bb0b3badca2a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_police-praised-rescuing-tiny-dog-busy-highway-n102701_1540247705.html","title":"Police Praised for Rescuing Tiny Dog From Busy Highway","title_page":" Police Praised for Rescuing Tiny Dog From Busy Highway","title_rss":"NULL","source_domain":"nbcnews.com","text":"CHP officer Alex Edmon said that officers got a call Friday about a Chihuahua running in lanes on northbound I-680 just south of North Main Street. Officers received another call that reported the dog as sitting in the middle of the center-divide wall. Edmon and his partner responded and spotted the small dog on the highway's concrete center divider.\n\"We attempted to coax it, we could tell it was very frightened, it was shaking - we were able to pet it a little bit, but other than that we could tell it was not happy.\"\nEdmon, who is a dog lover and owns two dogs himself, tried to coax the dog with some trail mix but she wouldn't eat it, he said. The officers called animal control since they had no way to transport the dog on their motorcycles, Edmon said.\nAnimal control estimates the dog to be around two years old. There were no signs of tags or any kind of injury when she was rescued.\n\"I would try to encourage everybody to try and rescue any dog they can,\" Edmon said. \"Animal control has already been inundated with calls for this particular dog because of the story, but don't be discouraged if you can't get this exact dog, look for other dogs out there.\"\nEdmon said that he didn't know how the dog ended up stranded on the freeway.\n\"As of right now there are no witnesses that actually saw someone take the dog out of a car and leave it there,\" he said.\nEdmon said that the CHP receives calls about dogs loose on the freeway on a weekly basis.\n\"It's not uncommon at all,\" he said.\nContra Costa Animal Services posted an update on Facebook Saturday, saying the Chihuahua \"may already have a home if her owner doesn't come for her.\"","url":"https://www.nbcnews.com/news/us-news/police-praised-rescuing-tiny-dog-busy-highway-n102701"}
