{"authors":[],"date_download":"2018-10-30 21:54:16","date_modify":"2018-10-30 21:54:16","date_publish":"2016-12-19 12:45:00","description":"A recently discharged patient who returned to a hospital with a gun and began shooting now faces agg...","filename":"data/vaneerConsumption/PoliceDischargedpatientopensfireathospitalinjuresdeputy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/15/Videos/5249402380001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_police-discharged-pati_7d588879b5f6e85822e09ef8a7da0e03__1540936456.html","title":"Police: Discharged patient opens fire at hospital, injures deputy","title_page":"Police: Discharged patient opens fire at hospital, injures deputy ","title_rss":"NULL","source_domain":"ajc.com","text":"A recently discharged patient who returned to a hospital with a gun and began shooting now faces aggravated assault, weapons and criminal obstruction charges.\nAkeem Woodard opened fire just after 9 p.m. Sunday at Fairview Park Hospital, Dublin police Chief Tim Chatman told The Atlanta Journal-Constitution. Dublin is more than 130 miles southeast of downtown Atlanta.\nOfficers returned fire, and a Laurens County sheriff’s deputy was shot in the lower leg. The deputy, whose name was not released Monday, is expected to make a full recovery.\nRELATED: ‘It could have been bad,’ chief says of Dublin hospital shooting that wounded deputy\nThe shooting, which occurred two weeks after an active shooter training at the hospital, continues a nationwide trend that has made 2016 one of the most dangerous for law enforcement this century.\nFirearms-related fatalities are up 68 percent from this same time a year ago, leading many, including President-elect Donald Trump, to claim there's a war on cops that's being driven largely by criticism from activists and politicians following a string of incidents in which unarmed suspects, mostly African-Americans, died at the hands of police. Protests followed, and so did shootings that targeted law enforcement.\nRELATED: ‘A lot of chaos’ as gunman wounds Laurens deputy in Dublin hospital shootout\nOfficials said Woodard initially got away. A search prompted a lockdown of the hospital, Chatman said. At one point, at least 60 law enforcement officials were involved in the search.\nAn officer ultimately spotted Woodard “hiding behind some shrubbery,” Chatman said. “We confronted that individual, arresting him without incident.”\nPolice also found the weapon used during the shooting. Chatman said Woodard does have a criminal history. Details about Woodard’s record were not immediately available.\nThe GBI is investigating the shooting. Police plan to talk with the hospital and determine if any security changes are needed, Chatman said.\nSince early November, nine other law enforcement officials have been shot in Georgia.\n» Lavonia police Officer Jeffery Martin and Capt. Michael Schulman were wounded in a Dec. 12 shooting in Franklin County. Schulman, 50, of Lavonia, was struck under the armpit while wearing a bulletproof vest. Martin, 22, of Toccoa, was shot in the right hand, Carlisle said.\n» That same day, two Byron police officers were shot and injured while serving a warrant during a drug raid at a Fort Valley home. Officer William Patterson was treated and released shortly after being shot. James Wynn was seriously injured and underwent surgery.\n» Two Peach County sheriff’s deputies were ambushed in Byron on Nov. 6. Sgt. Patrick Sondron was pronounced dead at the county hospital, while deputy Daryl Smallwood died two days later. The GBI charged the alleged shooter, Ralph Stanley Elrod, with murder and aggravated assault.\n» Patrick Carothers, a 26-year veteran of the U.S. Marshals Service, was fatally shot Nov. 18 while serving a fugitive with a warrant in Long County. The fugitive, Dontrell Montese Carter, was shot and killed when marshals working with Carothers returned fire.\n» Americus police Officer Nicholas Smarr and Georgia Southwestern State University Officer Jody Smith were shot and killed after responding to a domestic call Dec. 7 in Americus. Minquell Kennedy Lembrick, who police say was the shooter, was found dead Dec. 8 from a self-inflicted gunshot.\nChatman said he believes the active shooter training at the hospital “saved countless lives” in Dublin. No patients or hospital staff were harmed during the shootout.\nAn officer was wounded when a man opened fire at Fairview Park Hospital Sunday.\n—Staff writer Christian Boone contributed to this report.","url":"https://www.ajc.com/news/police-discharged-patient-opens-fire-hospital-injures-deputy/6WjqMPwjy4n4v3gQMtJOmO/"}
