{"authors":["Breitbart London"],"date_download":"2018-10-30 21:57:51","date_modify":"2018-10-30 21:57:51","date_publish":"2017-03-17 17:40:23","description":"WARSAW, Poland (AP) -- Poland's main opposition party said Friday it is seeking a parliamentary vote of no-confidence against the conservative government which, it said, is \"demolishing\" the country and wants to bring it out of the European Union.","filename":"data/vaneerConsumption/PolishOppositionSeeksNoConfidenceVotetoBringDownRightWingGovernment.json","image_url":"https://media.breitbart.com/media/2016/06/POLAND-EU-VOTE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_17__1540936671.html","title":"Polish Opposition Seeks No-Confidence Vote to Bring Down Right Wing Government","title_page":"Polish Opposition Seeks No-Confidence Vote to Bring Down Right Wing Government","title_rss":"NULL","source_domain":"breitbart.com","text":"WARSAW, Poland (AP) — Poland’s main opposition party said Friday it is seeking a parliamentary vote of no-confidence against the conservative government which, it said, is “demolishing” the country and wants to bring it out of the European Union.\nCivic Platform’s leader in parliament, Slawomir Neumann, said that regardless of the vote’s slim chances, the debate would expose what he called the harmful policies of the 17-month-old government, led by the Law and Justice party.\nHe said the cabinet of Prime Minister Beata Szydlo is “demolishing Poland, Poland’s democracy, the rule of law and is taking over civic freedoms,” and recently “compromised Poland on the international arena.”\n“We have good reason to believe that what this government is doing amounts to opening the path that will lead Poland out of the EU,” Neumann said.\nNeumann was referring to a fierce but ultimately unsuccessful protest that Poland put up last week against the re-election of Donald Tusk to a top EU job.\nTusk, Civic Platform’s founder and Poland’s prime minister from 2007-2014, is the chief political foe of the nation’s most powerful politician, Law and Justice head Jaroslaw Kaczynski, a critic of the EU.\nLeaders of the pro-EU Civic Platform steps said they would request a so-called constructive vote of no-confidence early next week. The vote could be held at the soonest during a parliament session that starts April 5.\nIn theory, the vote could overturn Szydlo’s government, but the ruling party holds a majority of 234 seats out of 460.\nThe leader of the ruling Law and Justice party in parliament said its lawmakers were open to debate.\n“We know how much our government has done in this year and a half, definitely much more than the Civic Platform government did in its eight years in office,” said Ryszard Terlecki.\nEU leaders have criticized policies adopted by the ruling party, such as taking control of the country’s constitutional court and increasing police surveillance powers. The say such moves threaten democracy and the rule of law.\nKaczynski argues that through deep changes to state institutions, his party is clearing away remains from the communist era that ended in 1989.\n“You cannot build democracy and a free market on the skeleton of a communist state,” Kaczynski said in an interview for the onet.pl news website. “You have to build a completely new state. And we are doing just that.”","url":"https://www.breitbart.com/europe/2017/03/17/polish-opposition-seeks-no-confidence-vote-bring-right-wing-government/"}
