{"authors":["George Odling For Mailonline"],"date_download":"2018-10-22 23:40:36","date_modify":"2018-10-22 23:40:36","date_publish":"2016-01-29 12:03:47","description":"The worst performing forces in England and Wales were Wiltshire, Surrey, South Yorkshire and Sussex. The best performing force was Dyfed-Powys in Mid-Wales.","filename":"data/vaneerConsumption/Policesolvejustonein10burglariesbutinareaswheretheytryabithardermorethanaQUARTERgotocourt.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30AA52F600000578-0-image-a-54_1454068944854.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422592_Police-solve-just-one-10-burglaries-areas-try-bit-harder-QUARTER-court_1540251636.html","title":"Police solve just one in 10 burglaries - but in areas where they try a bit harder more than a QUARTER go to court","title_page":"Police solve just one in 10 burglaries - but in areas where they try a bit harder more than a QUARTER go to court  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Victims face postcode lottery of justice as some areas badly underperform\nNine out of 10 burglaries in England and Wales go unsolved\nNearly 90 per cent of burglaries go unsolved as crime campaigners blasted the shockingly low success rate of police forces.\nThe worst performing forces in England and Wales, Wiltshire, Surrey, South Yorkshire and Sussex, solved between 8.3 and 9 per cent of reported burglaries.\nThe best performing force was in Dyfed-Powys, mid Wales, where officers had a 28.7 per cent success rate.\nDyfed-Powys also had the lowest number of burglaries, with just 2.5 per 1,000 people a year.\nThe highest was in Humberside and and West Yorkshire, where 10.8 people in every 1,000 fell victim to break-ins.\nThe average for England and Wales as a whole is 7.2 people per 1,000.\nCoventry Police were accused of 'breaking and entering' and 'trespassing' after letting themselves into people's houses and tweeting pictures as part of a bizarre anti-burglary drive earlier in January\nChief Constable Sara Thornton (pictured), the £252,000-a-year head of the National Police Chiefs' Council, said burglary victims should no longer expect police officers to come to their homes\nThe alarming figures come after a number of forces explored some unusual alternative methods of combating burglaries.\nLeicestershire police force refused to attend attempted burglaries at houses with odd numbers in a bizarre three month pilot scheme in the summer aimed at cutting costs.\nFrom March 2013 to March 2014, Leicestershire police solved 11.3 per cent of burglaries.\nHead of the National Police Chiefs Council (NPCC), Sara Thornton, caused outrage when she said budget cuts meant victims could no longer expect officers to attend burglaries.\nCoventry Police faced an angry backlash earlier in the month when officers began letting themselves into people's unlocked homes and tweeting pictures in an effort to demonstrate how unsecure some properties were.\nThe burglary figures, published yesterday by Churchill Home Insurance, show that during the 12 months before March 2014 just 12.2 per cent of burglaries were solved.\nDirector of engagement at Victim Support, Lucy Hastings, said: 'Burglary not only robs victims of their physical possessions, it can also rob people of their sense of security at home – a place where they should feel most safe.\n'This crime can leave many people feeling vulnerable, frightened and distressed.'\nThese cocky crooks in Northampton managed to turn CCTV cameras on themselves before they broke in\nThe thieves were eventually scared off by the family dogs in a bungled raid in Weston Favell on January 19\nA spokesman for the NPCC said: 'The police fully recognise the impact burglaries have on their victims.\n'Research has shown us how to prevent repeat burglaries and that taking basic crime prevention measures work. Burglary rates are now at their lowest for thirty years.\n'The best chance of achieving a successful outcome in a burglary investigation is either through the perpetrator being apprehended at the scene or by the retrieval of forensic material which can identify who has committed the crime.\n'All the evidence points to this. The police service is constantly seeking new ways and new technologies to improve our chances of helping victims achieve justice.'","url":"https://www.dailymail.co.uk/news/article-3422592/Police-solve-just-one-10-burglaries-areas-try-bit-harder-QUARTER-court.html"}
