{"authors":[],"date_download":"2018-10-30 18:28:42","date_modify":"2018-10-30 18:28:42","date_publish":"2017-03-10 21:23:06","description":"Only now, after a decade as a fugitive, has one of the accused DeKalb County killer been arrested in 27-year-old Juan Reyes’ death.","filename":"data/vaneerConsumption/PoliceDeKalbmurdersuspectfound10yearsaftercoplethimescape.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/10/Images/AROLDO%20RABANALES_341x213.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_police-dekalb-mu_e7939c0e55bd5769644dedefb45642eb__1540924122.html","title":"Police: DeKalb murder suspect found 10 years after cop let him escape","title_page":"Police: DeKalb murder suspect found 10 years after cop let him escape","title_rss":"NULL","source_domain":"ajc.com","text":"One night 10 years ago, a fight broke out among soccer buddies playing cards at an apartment in Chamblee. One of them was beaten badly enough with a broken coffee table leg that he died 13 days later in the hospital.\nBut the city cop who responded to the fight hadn’t taken a report. That allowed the suspects to flee town before they were wanted on murder charges, a Chamblee police spokesman said Friday.\nOnly now, after a decade as a fugitive, has one of the accused been arrested in 27-year-old Juan Reyes’ death.\nAroldo Amlicar Rabanales, now 40, arrived at the DeKalb County jail early Thursday morning. He was reportedly arrested in Boston, Massachusetts, and extradited.\n“I never thought they’d get him,” Capt. Ernesto Ford, who was the detective on the homicide in 2007, told The Atlanta Journal-Constitution on Friday.\nFord had thought Rabanales fled to his native Central America. As far as Ford knows, the other suspect, Sergio Cifuentes, who would be 41, has never been arrested.\nReyes was beaten on Feb. 4, 2007 at Lee Mar apartments on Shallowford Road near Buford Highway. The coffee table had broken in the card game argument and the leg was used to pound him, according to a police report obtained by the AJC.\nPolice and emergency medical workers responded to the scene. It isn’t clear why the officer didn’t make a report, but the result was the investigations division didn’t find out about the case until Feb. 17, when Reyes died.\n“It’s a clear violation,” Ford said of the officer’s omission. “It definitely hurt our case. No doubt.”\nFord got a call from the medical examiner’s office about the death.\nThe investigator interviewed witnesses, neighbors and family. He had murder warrants in hand for both suspects within two days.\nBut he could find neither man.\nAt the apartment where the beating happened, he was told the tenants had moved out after Reyes was rushed to the hospital.\nJason Jones, the officer who had failed to make the initial report, was disciplined at the time, Ford said. Last year, Jones was fired after an unrelated internal investigation.\nEfforts to locate Jones for comment weren’t immediately successful Friday.\nRabanales has no bond. Jail records show he is also being held for immigration authorities.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/police-dekalb-murder-suspect-found-years-after-cop-let-him-escape/f3HvLDNhboIaoHjgKquHeO/"}
