{"authors":["Jaime Dunaway"],"date_download":"2018-10-30 18:41:54","date_modify":"2018-10-30 18:41:54","date_publish":"2018-08-22 00:00:00","description":"Little Rock police said a woman accused of hitting an officer with her car surrendered to authorities Wednesday afternoon.","filename":"data/vaneerConsumption/PoliceidentifyofficerhitbyvehicleatwestLittleRockshoppingcentersuspectsurrenders.json","image_url":"https://media.arkansasonline.com/img/photos/2018/08/22/Screen_Shot_2018-08-22_at_1.08.31_PM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_22_little-roc_3fe4edc92ad83104f3529ca4386ecc42__page=1_1540924914.html","title":"Police identify officer hit by vehicle at west Little Rock shopping center; suspect surrenders","title_page":"Police identify officer hit by vehicle at west Little Rock shopping center; suspect surrenders","title_rss":"NULL","source_domain":"arkansasonline.com","text":"1 P.M. UPDATE:\nLittle Rock police said a woman accused of hitting an officer with her car surrendered to authorities Wednesday afternoon.\nPolice Department spokesman Lt. Michael Ford said Rhakelle Brown, 23, of Little Rock was taken into custody around 12:45 p.m. at the 12th Street station.\nAuthorities said Brown, who is also accused of shoplifting, injured 44-year-old Scott Dettmer just before 5 p.m. Tuesday while fleeing from the Promenade at Chenal shopping center in west Little Rock.\nEARLIER:\nThe Little Rock Police Department officer who was seriously hurt Tuesday afternoon when a shoplifting suspect hit him with her vehicle has been released from the hospital and is recovering at home, the agency said Wednesday.\nAccording to a news release, 44-year-old Scott Dettmer has served at the agency for 22 years and is currently assigned to the northwest patrol division.\nDettmer was hurt just before 5 p.m. Tuesday while responding to a shoplifting call at the Promenade at Chenal shopping center in west Little Rock.\nWhen he arrived, he found that a woman was trying to shoplift from the children's clothing store, Justice, according to a report.\nAs he approached her, she fled to her 2007 Honda Accord, locked the door and refused to come out, the report states.\nAuthorities said that as the woman began backing up, Dettmer's hand went through the driver's-side window as he got out his baton.\nThe woman continued in reverse with the officer's hand through the window and ran over his left ankle, causing him to fall to the ground, police said. They added that he was almost run over as she sped away.\nDettmer was taken to Baptist Health Medical Center to be treated for his injuries.\nAuthorities identified 23-year-old Rhakelle Brown of Little Rock as a suspect. Her name did not appear on the Pulaski County jail inmate roster as of Wednesday afternoon.","url":"https://www.arkansasonline.com/news/2018/aug/22/little-rock-police-identify-officer-hit-vehicle-sh/?page=1"}
