{"authors":["Austin Cannon"],"date_download":"2018-10-30 21:25:45","date_modify":"2018-10-30 21:25:45","date_publish":"2016-12-20 05:45:00","description":"After neglecting to pay for her piece of pizza, a woman shoved the pepperoni-covered slice into a Damgoode Pies employee’s chest and slapped her Sunday morning in Little Rock, police said.","filename":"data/vaneerConsumption/PoliceWomanshovessliceintoLittleRockpizzaplaceemployeeschestslapsher.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_dec_20_police-wom_a87dc517dd639876e03abf6b4c586c14__page=1_1540934745.html","title":"Police: Woman shoves slice into Little Rock pizza place employee's chest, slaps her","title_page":"Police: Woman shoves slice into Little Rock pizza place employee's chest, slaps her ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"After neglecting to pay for her piece of pizza, a woman shoved the pepperoni-covered slice into a Damgoode Pies employee’s chest and slapped her Sunday morning in Little Rock, police said.\nAccording to a police report, the woman walked into the pizza place at 6706 Cantrell Road around 10 a.m. She wanted a drink, but the employee told her the restaurant doesn’t serve alcohol until 11 a.m. The employee told police she thought the woman was drunk.\nThe woman ordered her slice and was angered when the employee again told her alcohol was unavailable, the report said. The employee said the woman was then asked to leave, but she grabbed her slice of pizza on the way out without paying for it.\nWhen the employee caught up to her outside, telling her she needed to pay for the pizza, the woman again became angry, according to the report. The employee told police the woman crowded her before shoving the slice of pepperoni into her chest and slapping her in the face.\nOfficers searched the area unsuccessfully for the woman, who was described as a white woman between 45 and 50 years old who’s 5 feet 2 inches tall and weighs 110 pounds.","url":"https://www.arkansasonline.com/news/2016/dec/20/police-woman-shoves-pizza-chest-restaurant-employe/?page=1"}
