{"authors":[],"date_download":"2018-10-23 04:09:53","date_modify":"2018-10-23 04:09:53","date_publish":"2016-01-29 19:50:25","description":"The top editor and other key staff at Politico will depart the Washington-based media group as it prepares to celebrate its 10th anniversary and expand inter...","filename":"data/vaneerConsumption/Politicotopstafftoseepostelectionshakeup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i5am-4PuZeKVXE7cd9005b2c876dc7bfd-969_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423361_Politico-staff-post-election-shakeup_1540267793.html","title":"Politico top staff to see post-election shakeup","title_page":"Politico top staff to see post-election shakeup | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Politico top staff to see post-election shakeup\nThe top editor and other key staff at Politico will depart the Washington-based media group as it prepares to celebrate its 10th anniversary and expand internationally.\nOne of those departing is Jim VandeHei, CEO and co-founder of the group which has made an impact on political journalism and has since expanded to Europe.\nThe departures, most of which will come after the 2016 US elections, were announced in a memo to staff Thursday by publisher Robert Allbritton.\nPolitico's chief political writer Mike Allen, seen here hosting a Politico Playbook Breakfast on November 28, 2012, announced he would be leaving the news organization alongside other key staff ©Alex Wong (Getty/AFP/File)\nAlso departing will be chief political writer Mike Allen, chief operating officer Kim Kingsley, executive vice president Danielle Jones and chief revenue officer Roy Schwartz.\n\"These transitions make perfect sense for the publication, coming a decade (almost to the day) after I recruited them to join this cause,\" Allbritton said in the memo.\n\"Jim in particular began signaling to me some years ago that he hoped the next stop in his career would be to once again start a new venture.\"\nAllbritton said he had asked John Harris to take on the title of publisher in addition to editor in chief.\n\"The goal during this transition is to never lose touch with the magic embedded in the Politico brand,\" the memo said.\n\"With this additional role, I am asking him to help lead us once more in building a Politico that will be much bigger than we know today -- one that spans the country, spans oceans, and spans languages.\"\nHarris and VandeHei walked out of Washington Post jobs to launch Politico as a digital media outlet in 2007.\nPolitico came to prominence on the back of the dramatic fight between then-Senator Barack Obama and former first lady Hillary Clinton for the US presidency.","url":"https://www.dailymail.co.uk/wires/afp/article-3423361/Politico-staff-post-election-shakeup.html"}
