{"authors":[],"date_download":"2018-10-30 20:41:16","date_modify":"2018-10-30 20:41:16","date_publish":"2014-07-17 22:14:01","description":"The Georgia State Patrol is still looking for the vehicle and trailer involved in a fatal incident Monday afternoon on Interstate 75 in Lamar County.","filename":"data/vaneerConsumption/PolicestillseekvehicletrailerinvolvedinI75fatality.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/07/17/Images/photos.medleyphoto.5747378.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_police-still-seek-vehicle-trailer-involved-fatality__1540932076.html","title":"Police still seek vehicle, trailer involved in I-75 fatality","title_page":"Police still seek vehicle, trailer involved in I-75 fatality","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia State Patrol is still looking for the vehicle and trailer involved in a fatal incident Monday afternoon on Interstate 75 in Lamar County.\nAccording to a news release from the GSP, 53-year-old Brian Edward Durst was struck about 12:50 p.m. by a tire that came from a utility trailer that passed him as he changed a flat tire on his car.\nInvestigators said they now believe what happened was an accident, and that the person driving the truck may not have known the trailer lost a tire until much later. While the incident was initially called a hit-and-run, GSP Trooper Byron Mims said that is no longer the case.\n“With the type of trailer we’re looking at, you could continue to operate the vehicle and pull the trailer without difficulty if it lost a tire,” Mims told The Atlanta Journal-Constitution on Thursday.\nDashboard video from a nearby patrol car captured the truck and trailer authorities believe lost the tire before the incident. The camera did not record the incident, Mims said.\n“But the timeline all adds up that we’re pretty sure the truck in the video is the truck we are looking for,” he said.\nAnyone with information on the vehicle, trailer, or driver is asked to call the Georgia State Patrol at the Newnan Communications Center at 770-254-7201 or the Lamar County Sheriff’s Office.","url":"https://www.ajc.com/news/police-still-seek-vehicle-trailer-involved-fatality/k77KSh2WntAM7sPQ9oMprL/"}
