{"authors":[],"date_download":"2018-10-30 17:55:33","date_modify":"2018-10-30 17:55:33","date_publish":"2018-06-29 00:22:00","description":"A police report on a man who ran onto an active taxiway at Hartsfield-Jackson International Airport says he \"appeared to be under the influence of narcotics\" and was delusional.","filename":"data/vaneerConsumption/Policereportrevealsmoreonmanwhoranontoairporttaxiway.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/27/Videos/4426059.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_man-who-ran-onto-t_27ea37b05b62a1ffc93c571db580d461__1540922133.html","title":"Police report reveals more on man who ran onto airport taxiway","title_page":"Police report reveals more on man who ran onto airport taxiway","title_rss":"NULL","source_domain":"ajc.com","text":"A man who hopped a razor-wire fence and ran onto an active taxiway at Hartsfield-Jackson International Airport on Tuesday “appeared to be under the influence of narcotics,” according to a police report on the incident.\nOn Friday, Hartsfield-Jackson released surveillance video showing the man running across a roadway, after which he climbs a fence and runs onto the airfield.\nThe report said the man, who police identified as Jhyrin Jones, “was delusional.” According to the police report, Jones said he “smoked a blunt.”\nBefore the incident at the airport, “witnesses stated that the accused jumped onto several parked vehicles at a nearby construction site,” according to the report. Then, he “yelled out, ‘I’m going to kill y’all, I’m going to blow this place up, trust nobody, you better believe me,’” the report said.\nJones, who approached a Delta Air Lines plane wearing only underwear and exposed himself to passengers, according to the report, was charged with criminal trespass, criminal damage to property, public indecency and obstruction to law enforcement.\nThe incident has raised concerns about airport perimeter security.","url":"https://www.ajc.com/business/man-who-ran-onto-taxiway-atlanta-airport-appeared-under-the-influence-police-say/VJiQwHY1BtKvuWUfhL2pSK/"}
