{"authors":[],"date_download":"2018-10-30 17:56:13","date_modify":"2018-10-30 17:56:13","date_publish":"2015-07-25 04:00:00","description":"Two things were unavoidable last week: the oppressive heat and the water cooler talk about, you guessed it, Donald Trump.","filename":"data/vaneerConsumption/PolitiFactTheRoundup.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--politics_politifact-the-roundup__1540922173.html","title":"PolitiFact: The Roundup","title_page":"PolitiFact: The Roundup","title_rss":"NULL","source_domain":"ajc.com","text":"Two things were unavoidable last week: the oppressive heat and the water cooler talk about, you guessed it, Donald Trump. PolitiFact jumped in, fact-checking Part II of his attack on John McCain. After saying McCain was “not a war hero,” Trump said the senator, in his life since being a prisoner of war, “has done nothing to help the vets.”\nWe also put claims through the Truth-O-Meter about Atlanta’s murder rate, the percentage of state law enforcement agencies that are state-certified and a Vermont pastor going to prison for refusing to marry a gay couple. (Hint: We had to call for a fire extinguisher on that last one.)\nAbbreviated versions of our fact checks are below.\nFull versions can be found at www.politifact.com/georgia/.\n—\nJohn McCain “has done nothing to help the vets.” — Donald Trump on July 19 during comments on ABC’s “This Week”\nFacing a continuing maelstrom over his remark that U.S. Sen. John McCain, R-Ariz., is “not a war hero,” billionaire businessman and GOP presidential candidate Donald Trump tried to shift the focus from McCain’s service record to his track record.\nMcCain may talk a lot about supporting American troops, Trump insisted on ABC’s “This Week,” but he doesn’t walk the walk.\n“I’m very disappointed in John McCain because the vets are horribly treated in this country. I’m fighting for the vets. I’ve done a lot for the vets,” Trump said on July 19. “He’s done nothing to help the vets. And I will tell you, they are living in hell.”\nHe echoed the point that same day in an editorial published in USA Today.\nIs Trump correct that McCain — a Vietnam prisoner of war and current chairman of the Senate Armed Services Committee — hasn’t helped his fellow veterans?\nThe Trump campaign never got back to us, but McCain’s office did, and, not surprisingly, it begged to differ. It provided a wide variety of examples of things McCain has done for veterans during his nearly three-decade congressional career.\nWhile many veterans’ groups have had their differences with McCain over the years on specific legislation and his general approach to veterans’ issues, none agreed with Trump’s assessment. Within the past two years, McCain has sponsored and helped enact several major provisions to help veterans. He also devotes a significant portion of his office staff to helping veterans who have problems with the U.S. Department of Veterans Affairs.\nWe rated Trump’s claim False.\n—\n“Christian Pastor in Vermont Sentenced to One Year in Prison After Refusing to Marry Gay Couple” — Bloggers on July 10 in a headline on the website NewsExaminer\nPerhaps you have seen in your social media feeds an article headlined “Christian Pastor in Vermont Sentenced to One Year in Prison After Refusing to Marry Gay Couple.” It received about 5,000 Facebook shares as well as interactions on other social media platforms.\nIs it real? We decided to take a closer look.\nThe article was published on a site called NewsExaminer on July 10. It says that a pastor from Proctor, Vt., was sentenced to a year in federal prison after refusing to marry gay couples. It came just days after the Supreme Court ruled, 5-4, that same-sex marriage would be allowed in all 50 states. (The ruling didn’t legalize same-sex marriage in Vermont, which approved it on its own in 2009.)\nBut the bottom line is that the NewsExaminer is a fake news site and has been classified as such by Snopes, the urban legends site. Through a posting to an NBC copycat website with the url www.nbc.com.co, the article gained traction through mistaken association with the genuine NBC News site.\nWe found no evidence to support the existence of key elements of the story, including the pastor, the church or the judge referenced in the article.\nWe ruled this claim Pants on Fire.\n—\nGeorgia has more than 700 law enforcement agencies, and fewer than 20 percent of them are state-certified. — Billy Grogan on July 14 in a press release\nThe 6-year-old Dunwoody Police Department was recognized July 13 for achieving state certification.\nBilly Grogan, Dunwoody’s police chief, said the certification validates that his department’s standards are in line with national best practices.\n“I hope this achievement will instill even greater public confidence in our agency and staff, ” Grogan said in a press release issued the following day.\n“There are more than 700 law enforcement agencies in Georgia, and fewer than 20 percent of those agencies have achieved this status,” the release said.\nThat statistic caught our eye. We decided to investigate.\nThe state certification process was developed in the 1990s, and the first state certification was issued in 1997. Currently, 118 law enforcement agencies are state-certified through the Georgia Association of Chiefs of Police, said Mark Bender, the association’s director of state certification.\nThat’s out of about 700 eligible law enforcement agencies in the state, said Frank V. Rotondo, executive director of the Georgia Association of Chiefs of Police.\nNot all agencies want to go through “a lot of extra hoops” to obtain certification, Rotondo said. Others don’t have the extra money that’s required, he said.\nIt’s likely that less than 20 percent of the state’s law enforcement agencies are state-certified, given than 118 of 700 is 17 percent. But 700 is an estimate, not a firm figure. That’s missing context.\nFor that reason, we rated the statement Mostly True.\n—\nThe murder rate in Atlanta is on the rise this year. — An Atlanta neighborhood association in an online community forum July 9\nCrime is always the sort of news that attracts headlines.\nNow, it’s also generating posts in online forums, where one neighborhood association alerted Atlanta residents that the city’s murder rate was spiking and had even reached a 50 percent increase from a year ago.\nPolitiFact Georgia couldn’t resist when an alert reader asked us to check it out.\nThe murder rate did spike that high, with weekly fluctuations. But the year-to-date rate is up about 25 percent from this time last year.\nThat puts Atlanta in line with other cities seeing an increase in their murder rates.\nThere is little conclusion on what might be driving the rate, or even if different cities share the same causes.\nBut an increase of that size is cause for notice. We rated the claim True","url":"https://www.ajc.com/news/state--regional-govt--politics/politifact-the-roundup/ihFjBbWhLXhme9W9WuHzfI/"}
