{"authors":["Josh"],"date_download":"2018-10-30 22:21:11","date_modify":"2018-10-30 22:21:11","date_publish":"2018-10-30 02:55:00","description":"Two Little Rock men were tied up and robbed at gunpoint during a home invasion Monday morning, authorities said.","filename":"data/vaneerConsumption/Police2mentiedupwithshoelacesrobbedinLittleRockhomeinvasion.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540938071.html","title":"Police: 2 men tied up with shoelaces, robbed in Little Rock home invasion","title_page":"Police: 2 men tied up with shoelaces, robbed in Little Rock home invasion","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Two Little Rock men were tied up and robbed at gunpoint during a home invasion Monday morning, authorities said.\nOne of the victims told police he was asleep in his home in the 5200 block of Stanley Drive when three people kicked in his front door just before 5 a.m., according to a report by Little Rock police. Authorities said the three tied up the 42-year-old and 20-year-old victims using shoelaces.\nThe gunman hit the older victim on the head with a firearm before the invaders left in an unknown vehicle, the report states.\nPolice said paramedics treated the older man’s injuries, but they did not transport him to the hospital. The report does not indicate whether the 20-year-old was injured.\nItems stolen included $1,000 in clothing and shoes, electronics, car keys, jewelry and a jar containing about $400 in coins, the report states. Altogether, approximately $3,500 in items was reported stolen, according to authorities.\nThe report described the gunman as a male standing roughly 5 feet, 8 inches tall, and weighing approximately 165 pounds. According to authorities, he was wearing a gray hooded sweatshirt and gray sweatpants. Another robber is described as a heavyset male. The report provided no details for the third person, also a male.\nNo suspects have been named and no arrests were made at the time of the report.","url":"https://www.arkansasonline.com/news/2018/oct/30/2-men-tied-robbed-3-little-rock-home-invasion/"}
0/2-men-tied-robbed-3-little-rock-home-invasion/?page=1"}
