{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-23 00:50:48","date_modify":"2018-10-23 00:50:48","date_publish":"2016-01-29 14:13:14","description":"Taxi driver Julie Matthews' dashboard camera filmed the moment of the soaking when she was driving in Leigh Road, Eastleigh, Hants. The police have defended the actions of the officer.","filename":"data/vaneerConsumption/PolicecarinEastleighsplashespedestrianwhenitdrivesthroughpuddle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B26A3100000578-0-image-a-80_1454072871241.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422760_Police-car-Eastleigh-Hants-splashes-pedestrian-drives-huge-puddle-captured-dashboard-camera_1540255848.html","title":"Police car in Eastleigh splashes pedestrian when it drives through puddle","title_page":"Police car in Eastleigh splashes pedestrian when it drives through puddle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Splashing a pedestrian while driving though a puddle can be an offence under the Road Traffic Act\nolice defended their actions - claiming it was 'safer' for them to drive through instead of swerving or\nThis is the moment a helpless pedestrian gets showered with dirty water while walking along a pavement - after a police officer drove through a giant puddle.\nThe shocking footage shows the unidentified male strolling next to a main road when the marked police vehicle makes no attempt to avoid a puddle.\nHe then gets sprayed after the police car's left tyres create a wave of water which flies at the man, who is wearing shorts.\nDry for now: This is the moment a helpless pedestrian gets showered with dirty water while walking along a pavement - after a police officer drove through a giant puddle. The shocking footage shows the unidentified male strolling next to a main road when the marked police vehicle makes no attempt to avoid a puddle\nSoaked: He then gets sprayed after the police car's left tyres create a wave of water which flies at the man, who is wearing shorts\nThe incident was filmed by taxi driver Julie Matthews' dashboard camera when she was driving in Leigh Road, Eastleigh, Hants.\nHer husband, Paul, 53, also a cab driver, said the behaviour of the police driver was 'disgusting' and has urged the officer to apologise to the young man.\nBut police have defended their actions - claiming it was 'safer' for them to drive through the large area of surface water.\nThey added it would have been more of a risk if the driver 'swerved' onto the opposite side of the road or if they stopped abruptly.\nThis is despite Mrs Matthews, 50, slowing down and driving around the large area of surface water which had gathered by the kerb.\nSplashing a pedestrian while driving though a puddle can be an offence under the Road Traffic Act.\nAccording to police, the offence is appropriate when the driving amounts to a clear act of incompetence, selfishness, impatience or aggressiveness in addition to inconvenience to road users.\nThe offence carries a maximum penalty of £5,000 and between and three and nine penalty points.\nThe incident was filmed by taxi driver Julie Matthews' dashboard camera when she was driving in Leigh Road, Eastleigh, Hants, on Wednesday. But police have claimed it was 'safer' for them to drive through the puddle\nMr Matthews, from Southampton, Hants, said after viewing the footage: 'It was disgusting. The young lad got soaked and had to carry on walking.\n'I am not saying they did it deliberately but my wife pulled around it herself and if you've got no choice you should slow down.\n'Julie came home and said to me straight away 'you need to download this footage from the dashboard camera'.\n'She had a customer in the back and they were both shocked that the police car didn't slow down or move around the puddle.\n'I watched it and I was completely shocked. The police car made no attempt to move out of the way and to drive around the puddle.\n'Drivers normally do all they can to avoid going through puddles. It is filthy water from the road and can include all sorts of debris.\nDisgusting: Mr Matthews, from Southampton, Hants, said after viewing the footage: 'It was disgusting... Iam not saying they did it deliberately but my wife pulled around it herself and if you've got no choice you should slow down\n'It is something you'd expect a young driver to do for a laugh - not a police car.\n'The police officer should have pulled over to at least apologise.\n'Julie said the young man stood there in shock and was dripping wet. The driver could have offered him a lift somewhere so he could get into some dry clothes.\n'If we had done it they probably would have pulled us over and spoke to us, they should run by the same laws as the rest of us.'\nA spokeswoman for Hampshire Constabulary said: 'It is likely that the officer made an assessment that as they approached this it was safer to continue driving through the puddle rather than stop abruptly and risk causing another vehicle to run into the back of the police car, or avoid the puddle by swerving towards the oncoming vehicle on the other side of the carriageway.\n'The driver behind the police car who recorded the footage was able to safely swerve to avoid the puddle as there were no vehicles on the other side of the road at that time.\n'We are not aware of a complaint being made by the pedestrian shown in the footage but should we receive one, the matter will be dealt with appropriately as any other complaint would be.'","url":"https://www.dailymail.co.uk/news/article-3422760/Police-car-Eastleigh-Hants-splashes-pedestrian-drives-huge-puddle-captured-dashboard-camera.html"}
