{"authors":["Breitbart News"],"date_download":"2018-10-30 19:41:09","date_modify":"2018-10-30 19:41:09","date_publish":"2016-08-31 20:07:49","description":"Politico: Conservative Media Like Breitbart Built the Conservative Movement","filename":"data/vaneerConsumption/PoliticoConservativeMediaLikeBreitbartBuilttheConservativeMovement.json","image_url":"https://media.breitbart.com/media/2016/08/Barry-Goldwater-1952-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_31__1540928469.html","title":"Politico: Conservative Media Like Breitbart Built the Conservative Movement","title_page":"Politico: Conservative Media Like Breitbart Built the Conservative Movement","title_rss":"NULL","source_domain":"breitbart.com","text":"Nicole Hemmer, the Assistant Professor of Presidential Studies at the University of Virginia’s Miller Center, provided Politico an excerpt of her new book, “Messengers of the Right: Conservative Media and the Transformation of American Politics.”\nAs Hemmer explains in her preface, conservative media outlets like Breitbart have historically provided the backbone of the conservative movement in America. Politico notes that “[i]n 1956, a cadre of frustrated conservative media activists formed a PAC and bankrolled a populist candidate. Then they made Goldwater famous. Call it the Steve Bannon playbook.”\nWhen Donald Trump announced his new campaign CEO in mid-August—Steve Bannon, the pugnacious CEO of the conservative news site Breitbart—the world reacted like wires had been crossed. A figure from the media jumping straight into politics? Even in the world of partisan media, it seemed unusual to give up all pretense of removal from the contest for power to directly pulling the strings.\nBut if it seemed surprising, it shouldn’t have. Conservative candidates have been able to count on more or less the direct support of networks like Fox for a generation, to say nothing of hosts like Rush Limbaugh and Hugh Hewitt. And in fact the connection is much, much older than that—older, in fact, than most people assume conservative media is. If you want to understand just how deeply this kind of activism is entwined in the DNA of modern conservative media, you have to go back to 1956, and to the case of a Steve Bannon-esque figure named Clarence Manion, who tried to run his own outsider candidate for president.\n***\nThe 1952 Republican convention was rigged.\nThat was the conclusion of many conservatives who had toiled in the trenches for Robert Taft, the darling of midwestern conservatism, and greeted the more moderate Eisenhower’s victory in the 1952 nomination race with suspicion. “The convention, needless to say, was a great disappointment,” conservative publisher Henry Regnery wrote William F. Buckley, Jr. after Eisenhower nabbed the nomination. “Delegates, I understand, were bought or intimidated with Ford and General Motors dealerships, pressure from banks, insurance companies, and even, I am told, Ford Foundation grants.” National Review echoed the charge when it launched in 1955. In the first issue, the editors blamed the machinations of eastern elites for Eisenhower’s rise to power. “Early in 1951, a small band of Eastern financiers, international bankers and industrialists organized the Eisenhower boom and entrusted its inflation to a New York advertising firm. The rest is history.” Clarence Manion, host of the conservative radio program The Manion Forum, saw the convention as a conspiracy of internationalists determined “to keep American foreign policy foreign,” understanding that Taft, if elected, “would restore our capricious foreign policy to its proper confinement within the Constitution of the United States.”\nRead the rest here.","url":"https://www.breitbart.com/politics/2016/08/31/politico-conservative-media-like-breitbart-built-conservative-movement/"}
