{"authors":["The Texarkana Gazette"],"date_download":"2018-10-30 21:50:30","date_modify":"2018-10-30 21:50:30","date_publish":"2018-08-01 00:00:00","description":"An 18-year-old Arkansas man arrested at Texarkana Regional Airport last month told investigators he intended to fly a stolen plane to a rap music concert in another state, authorities said..","filename":"data/vaneerConsumption/PoliceArkansasteenwantedtostealplaneflyittorapconcert.json","image_url":"https://media.arkansasonline.com/img/photos/2018/08/01/Screen_Shot_2018-08-01_at_10.08.35_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_01__1540936230.html","title":"Police: Arkansas teen wanted to steal plane, fly it to rap concert","title_page":"Police: Arkansas teen wanted to steal plane, fly it to rap concert","title_rss":"NULL","source_domain":"arkansasonline.com","text":"An 18-year-old Arkansas man arrested at Texarkana Regional Airport last month told investigators he intended to fly a stolen plane to a rap music concert in another state, authorities said.\nChief Deputy Prosecuting Attorney Chuck Black on Monday formally charged Zemarcuis Devon Scott with commercial burglary and attempted theft of property with a value greater than $25,000.\nAsked about his lack of training as a pilot, Scott told Texarkana police that he didn't believe there was much more to the task than pushing buttons and pulling levers, according to a probable cause affidavit filed in the case.\nAbout 2:30 a.m. on July 4, airport security personnel contacted police about seeing a man jump a fence and attempt to enter an American Eagle twin-engine jet. By the time officers arrived, the suspect, later identified as Scott, had gotten onto the small commercial plane and closed the door behind him, authorities said.\nWhen officers shined a flashlight into the plane's cockpit from outside the jet, they could see a man sitting in the pilot's seat with his hands below the window and out of direct view. Fearing for their safety, an officer drew his weapon and ordered the man to keep his hands up.\nTwo officers reportedly recognized the man as Scott before authorities opened the plane door and arrested him.\nScott is being held in the Miller County jail with bail set at $25,000.","url":"https://www.arkansasonline.com/news/2018/aug/01/police-arkansas-teen-wanted-steal-plane-fly-it-rap/"}
