{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-22 23:34:23","date_modify":"2018-10-22 23:34:23","date_publish":"2016-01-28 12:36:14","description":"A policeman from China's Guizhou province was conducting routine inspections when he was dragged along by the man who refused to stop. The driver has been charged with endangering his life.","filename":"data/vaneerConsumption/Policemandraggedalongroadbymotorcyclistavoidinginspection.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A942AC00000578-0-image-a-12_1453976564156.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3420548_Terrifying-moment-motorcyclist-caught-riding-without-helmet-drags-policeman-busy-traffic-escape-punishment_1540251263.html","title":"Policeman dragged along road by motorcyclist avoiding inspection","title_page":"Policeman dragged along road by motorcyclist avoiding inspection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A police officer in a Chinese city was dragged along a road for 500 metres by a motorcyclist who refused to stop after he was seen riding without a helmet.\nSurveillance footage of the incident in Chisui, south-west China's Guizhou province, shows the policeman motioning for the man to pull over, the People's Daily Online reports.\nThe driver of the vehicle with the surname of You, was later charged with endangering the life of a police officer.\nDangerous driving: The police officer tried to stop the driver after it failed to slow down for a routine inspection\nTrouble at work: The officer becomes stuck after trying to halt a motorcycle to see his papers\nAccording to reports, the police officer named Huang Yu spotted the man riding without a helmet.\nHuang Yu told Chinese media: 'I gestured at him to stop. Surprisingly he did not and instead he sped up. I had to hold on tight to his rear seat.'\nThe footage taken from CCTV shows the officer flagging down the vehicle. When You refuses to slow down, the policeman grabs on to the back of the bike.\nThe driver still refuses to stop, pulling the policeman further along the road.\nChinese media have reported that passersby formed a human shield to help stop the motorcycle and rescue the officer.\nA spokesman from Chisui Traffic Police said the motorist did not wear a helmet and could not produce his driving license. In a bid to avoid punishment, he tried to escape when the officer caught him.\nYou was charged with endangering the life of enforcement personnel and was given 10 days detention and a fine.\nHanging on: CCTV footage shows the officer being pulled along by the motorcycle driver in Guizhou province","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3420548/Terrifying-moment-motorcyclist-caught-riding-without-helmet-drags-policeman-busy-traffic-escape-punishment.html"}
