{"authors":["Lauren Barbato"],"date_download":"2018-10-30 22:38:48","date_modify":"2018-10-30 22:38:48","date_publish":"2014-08-14 21:22:08","description":"Protests sparked by the shooting of Mike Brown continued into Thursday in Ferguson, Missouri, where the streets are beginning to look like a scene from a war zone. As police decked out in riot gear patrol the area — and have reportedly thrown cans…","filename":"data/vaneerConsumption/PoliticiansWeighingInOnFergusonIncludeSenatorsTedCruzElizabethWarrenClaireMcCaskill.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e764ed09-4f60-40f7-b5c3-327043a63999.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35765-politicians-weighing-in-on-ferguson-include-senators-ted-cruz-elizabeth-warren-claire-mccaskill_1540939128.html","title":"Politicians Weighing In On Ferguson Include Senators Ted Cruz, Elizabeth Warren, & Claire McCaskill","title_page":"Politicians Weighing In On Ferguson Include Senators Ted Cruz, Elizabeth Warren, & Claire McCaskill","title_rss":"NULL","source_domain":"bustle.com","text":"Protests sparked by the shooting of Mike Brown continued into Thursday in Ferguson, Missouri, where the streets are beginning to look like a scene from a war zone. As police decked out in riot gear patrol the area — and have reportedly thrown cans of tear gas at residents — President Obama told Ferguson residents in a statement that \"now is the time for healing.\"\nBoth the president and Holder have released statements on the death of Mike Brown, an 18-year-old African-American college student who was shot and killed by a Ferguson police officer on Aug. 9. Brown was reportedly unarmed when he was shot.\nAccording to Holder, the incident calls for a federal investigation. Holder said in a statement:\nIn addition to the local investigation already underway, FBI agents from the St. Louis field office, working together with attorneys from the Justice Department’s Civil Rights Division and US Attorney's Office, have opened a concurrent, federal inquiry.\nThe president added that he'd asked the Department of Justice and the FBI to investigate Brown's death. Obama is far from the only U.S. politician to weigh in on the violence erupting in Ferguson. Here's what some others had to say about the death of Mike Brown, the ensuing protests, and police brutality . . .\nSen. Ted Cruz\nAlex Wong/Getty Images News/Getty Images\nSen. Ted Cruz posted this message on his Facebook page on Thursday:\nTogether, we should all mourn the loss of life in Ferguson, Missouri and work to keep our communities safe and free. Police officers risk their lives every day to keep us safe, and any time a young man loses his life in a confrontation with law enforcement, it is tragic.\nAll of our prayers are with the citizens of Ferguson, that the violence will subside and peace will be restored. Reporters should never be detained -- a free press is too important -- simply for doing their jobs. Civil liberties must be protected, but violence is not the answer. Once the unrest is brought to an end, we should examine carefully what happened to ensure that justice is served.\nSen. Elizabeth Warren\nDrew Angerer/Getty Images News/Getty Images\nSen. Elizabeth Warren relayed her thoughts on the events unfolding in Ferguson via Twitter. \"The people of Ferguson just want answers,\" Warren said.\nSen. Roy Blunt\nBrendan Smialowski/Getty Images News/Getty Images\nThe Missouri senator released this statement about Mike Brown earlier this week:\nI join all Missourians in remembering the family of Michael Brown and the Ferguson community as they grieve the tragic loss of this young man. His recent high school graduation should have been a beginning of better things. Everyone deserves a transparent understanding of what happened here. I am fully supportive of County Executive Charlie Dooley and St. Louis County Police Chief Jon Belmar calling for DOJ and the FBI to take a careful, open review of the events that led to this tragedy for everyone involved.\nBlunt added on his Facebook and Twitter pages that he's working with local law enforcement officials to conduct \"transparent investigations\" and has met with community leaders.\nSen. Claire McCaskill\nAllison Shelley/Getty Images News/Getty Images\nMissouri Sen. Claire McCaskill also called for transparency:\nAs a mother, I grieve for this child and his family. I pray that the wonderful, hardworking, and God-loving people of Ferguson will find peace and patience as we wait for the results of what will be numerous and thorough investigations of what happened. I, like so many other Missourians, will not be satisfied until we have a complete and transparent understanding of all the facts and circumstances that led to this young man’s death.\nOn Wednesday, McCaskill released another statement announcing her meeting with the Department of Justice:\nAs we continue to grieve for Michael and his family, I’m working to make sure the federal piece of this investigation is fair, transparent, and moving forward without delay. As it proceeds, I’ll be remaining in close touch with the Department of Justice, and am reaching out personally to local elected officials and religious leaders, to keep monitoring the painful events on the ground in Ferguson.\nRep. Eleanor Holmes Norton\nPatrick McDermott/Getty Images News/Getty Images\nThe Washington, D.C., representative shared her grief over Twitter:\nGov. Jay Nixon\nAlex Wong/Getty Images News/Getty Images\nThe Missouri governor spoke out about the Ferguson protests and police violence on Thursday, calling the situation \"deeply troubling.\" Nixon announced on Twitter that he would be traveling to the St. Louis suburb Thursday morning:\nThe worsening situation in Ferguson is deeply troubling, and does not represent who we are as Missourians or as Americans. While we all respect the solemn responsibility of our law enforcement officers to protect the public, we must also safeguard the rights of Missourians to peaceably assemble and the rights of the press to report on matters of public concern.\nI have been closely monitoring the situation and will continue to be in communication with local leaders, and I will be in north St. Louis County Thursday. As Governor, I am committed to ensuring the pain of last weekend’s tragedy does not continue to be compounded by this ongoing crisis. Once again, I ask that members of the community demonstrate patience and calm while the investigation continues, and I urge law enforcement agencies to keep the peace and respect the rights of residents and the press during this difficult time.","url":"https://www.bustle.com/articles/35765-politicians-weighing-in-on-ferguson-include-senators-ted-cruz-elizabeth-warren-claire-mccaskill"}
