{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-22 21:44:10","date_modify":"2018-10-22 21:44:10","date_publish":"2016-01-29 07:43:02","description":"Police are not investigating whether illicit drugs were at the party where NRL star Mitchell Pearce was filmed simulating a sex act with a dog and urinating on a couch.","filename":"data/vaneerConsumption/PoliceareNOTinvestigatingtextsaboutdrugsatMitchellPearceparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/07/30B037F900000578-0-image-a-6_1454053280329.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422288_Sydney-Roosters-investigating-drug-use-claims-texts-Mitchell-Pearce-video_1540244650.html","title":"Police are NOT investigating texts about drugs at Mitchell Pearce party","title_page":"Police are NOT investigating texts about drugs at Mitchell Pearce party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police are not investigating whether illicit drugs were at the party where NRL star Mitchell Pearce was filmed simulating a sex act with a dog and urinating on a couch.\nImages of the potentially damaging messages allegedly sent by a person at the party where the Sydney Roosters star was filmed have emerged on social media - as the Roosters confirmed on Friday night that Pearce has gone overseas to go to rehab, accompanied by his mother.\nThe texts, which refer to 'liney lineys', surfaced two hours after the former captain apologised for his lewd behaviour at a boozy Australia Day party.\nThey suggest that Pearce did not know the person that filmed him miming a sex act with the small dog, Bella, prior to the party on Tuesday.\nThe NRL is investigating texts allegedly sent by a reveller at a party where Mitchell Pearce was filmed simulating a sex act with a dog, according to reports\nUnder-fire Sydney Roosters co-skipper Mitchell Pearce has apologised publicly after video footage of him simulating a sex act with a dog on Australia Day was aired\n'Jack has to send you a video of Mitchell Pearce humping bella,' one of the text messages says.\n'Thinking about sending it to the Daily Mail to end his career.'\nA NSW Police spokeswoman told Daily Mail Australia there had been no reports relating to drug use or the text messages.\nThe spokeswoman added anyone with information should contact Crime Stoppers.\nNine Network reportedly paid $20,000 for the footage and News Corp paid a four-figure sum of money, but Daily Mail Australia did not pay for any exclusive rights to the video.\nA friend responded to the text messages saying: 'I had to google Mitchell Pearce haha. Wait humping the dog?'\nTo which the person, who claims to have been at the party, replied: 'Yep so f***** and p***ed on her lounge.'\nOne of the messages asks whether the host of the party was friends with the halfback, who now faces a $50,000 fine and lengthy ban.\n'No none of us were. They were all with us at the oak and they were pretty normal – giving out liney lineys and then they jumped a cab with me back to hers and went f****** ape s***.\n'Jack just sat there filming it all,' the final message reads.\nThe NRL has confirmed that the Integrity Unit is in possession of the messages and will be investigating the exchange, Nine News reported.\nIt will also be checking the messages to ensure they are not part of a social media hoax, Fairfax Media said.\nThere is no suggestion Pearce or other Roosters players or members of their entourage were involved in any illicit drug use.\nPearce was filmed simulating a sex act with a dog at a boozy Australia Day party in Sydney on Tuesday\nA spokesman for the NRL said: 'To clarify, the NRL Integrity Unit is in possession of alleged text messages but makes no comment on its investigation until it is concluded.'\nPearce has already been stood down and could face being rubbed from the game altogether. He is now expected to go for a six-week stint in rehab.\nThe NSW State of Origin star publicly apologised for his actions at a press conference on Friday.\n'I would like to unreservedly apologise to everyone for my actions over the last three days,' Pearce said.\n'My behaviour was unacceptable, I'm embarrassed and take full responsibility for my actions.\n'I acknowledge that I have a problem with alcohol and it's something I need to address. It's not an excuse but a realisation that I finally need help.\n'Together with the club I'm working on a solution to address these issues and it will come out in the next couple of days.'\nThe Sydney Roosters confirmed that Pearce had been sent to a rehab clinic overseas with his mother, Terri.\nThe NSW State of Origin five-eighth publicly apologised for his actions at a press conference on Friday\nThe NSW State of Origin five-eighth publicly apologised for his actions at a press conference on Friday\n'The Club's concerns for Mitchell's welfare remain paramount as he seeks treatment,' a spokesman said.\nPearce has been stood down indefinitely from club activities while the NRL club investigates the incident.\nThe manager-less Pearce has already apologised to the club and his teammates for behaviour that coach Trent Robinson described as unacceptable.\n'The behaviour was unacceptable, we understand that and, at the Roosters, we can't accept that - we won't,' Robinson said.\nRoosters recruits Jayden Nikorima and Dale Copley were reported to have been present at the party and have since been interviewed by the club.\nThe 26-years-old Roosters premiership captain was captured miming the lewd act in front of his teammates","url":"https://www.dailymail.co.uk/news/article-3422288/Sydney-Roosters-investigating-drug-use-claims-texts-Mitchell-Pearce-video.html"}
