{"authors":["Breitbart News"],"date_download":"2018-10-30 21:54:23","date_modify":"2018-10-30 21:54:23","date_publish":"2016-06-05 02:59:20","description":"LJLJUBLJANA, Slovenia—In the gray drizzle of the Slovenian capital, a crowd of hundreds gathered in February to protest the flow of foreign refugees through their tiny country. Confronted with riot police, some cried, “Traitors!” | Politics","filename":"data/vaneerConsumption/PoliticoSloveniasNationalistPartyEmbracesTrump.json","image_url":"https://media.breitbart.com/media/2016/05/donald-and-melania-trump-Spencer-Platt-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_04__1540936463.html","title":"Politico: Slovenia's Nationalist Party Embraces Trump","title_page":"Politico: Slovenia's Nationalist Party Embraces Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Joel van Houdt writes at Politico:\nLJLJUBLJANA, Slovenia—In the gray drizzle of the Slovenian capital, a crowd of hundreds gathered in February to protest the flow of foreign refugees through their tiny country. Confronted with riot police, some cried, “Traitors!” Others waved the red-white-and-blue striped Slovenian flag. Then the crowd chanted something bizarre, the name of the Republican presidential nominee: “Donald Trump! Donald Trump! Donald Trump!”\nYes, Trump is being invoked in the internal debates of this former Yugoslav country framed by the Adriatic Sea and the Alps, with the political far-right here embracing the American’s strongly anti-immigrant, anti-ISIS rhetoric. “In Slovenia, we look at migrant problems in similar terms as Trump does,” says Andrej Sisko, the head of the right-wing Movement of United Slovenia, whose members attended the February rally and want to keep all refugees out.\nSlovenia isn’t alone in this regard. For the far-right across Europe, a U.S. presidential nominee who opposes immigration is something of a validation—a counter-symbol to America’s historical role in suppressing ethnic conflicts abroad and professing to welcome migrants in its own borders. Politicians like France’s Marine Le Pen, Italy’s Matteo Salvini and the Netherlands’ Geert Wilders, have used Twitter and personal video tributes and even sent envoys to make overtures to Trump, hoping for collaboration and a powerful endorsement.\nBut unlike other European countries wrestling with mass migration, Slovenia also has a personal connection to Trump, making his political rise a matter of national pride, and support for him here all the more acute: The candidate’s wife, Melania (née Knavs, later changed to Knauss), grew up under the cloak of Communism in the Slovenian town of Sevnica. The Trumps have graced more than a few magazine covers here during the course of Donald’s campaign. Now, some Slovenian politicians are even hoping for a special diplomatic and business relationship with the United States should the New York billionaire be elected.","url":"https://www.breitbart.com/politics/2016/06/04/politico-slovenias-nationalist-party-embraces-trump/"}
