{"authors":["John Hayward"],"date_download":"2018-10-30 20:43:46","date_modify":"2018-10-30 20:43:46","date_publish":"2015-01-20 22:02:21","description":"Modern police have radar guns that allow them to see through the walls of houses, and they've been using them for the past two years without telling the public. In fact, they still haven't formally announced the technology. If no one has briefed him yet, I would like to volunteer to be the guy who tells Senator Rand Paul about the drone that can see through walls. |","filename":"data/vaneerConsumption/PoliceDepartmentsQuietlyEquippedwithDeviceThatLetsThemSeeThroughWalls.json","image_url":"https://media.breitbart.com/media/2014/11/police-car-detail-ap-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_20__1540932226.html","title":"Police Departments Quietly Equipped with Device That Lets Them See Through Walls","title_page":"Police Departments Quietly Equipped with Device That Lets Them See Through Walls | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This might be a delicate moment for the police to reveal they have radar guns that allow them to see through the walls of houses, and that they’ve been using them for the past two years without telling the public. In fact, they still haven’t formally announced the technology; USA Today describes the radar devices as “largely unknown until December, when a federal appeals court in Denver said officers had used one before they entered a house to arrest a man wanted for violating his parole.” The judges on that court were not keen on the idea of using such technology without a search warrant.\nNow that the cat is out of the bag, we learn that the Marshals Service has been using these devices since 2012, and they have now spread to at least fifty other law enforcement agencies, including the FBI. It’s an adaptation of military technology used in Iraq and Afghanistan. The device isn’t quite the set of Superman spectacles USA Today’s headline implies – it’s a bit closer in concept to the motion detectors from the movie “Aliens.” (That’s probably not going to make anyone in the civil-liberties movement feel better about them…)\nThe idea is that radar pulses pass through the wall of a building and track moving objects up to 50 feet away. The commonly deployed Range-R device displays the range to moving targets detected on the other side of a wall, but USA Today reports there are more advanced devices on the way that can create “three-dimensional displays of where people are located inside a building.” One model can be mounted on a drone.\nOh, that’s definitely not going to win any warm, fuzzy feelings from privacy advocates. If no one has briefed him yet, I would like to volunteer to be the guy who tells Senator Rand Paul about the drone that can see through walls.\nAs with almost every other Panopticon controversy, the Range-R system is an example of high technology turning yesterday’s thought experiment into today’s hard, cold, battery-powered reality. As USA Today notes, the Supreme Court took a dim view of violating the sanctity of a citizen’s home by merely using a drug dog to sniff around the premises, or penetrating the walls with thermal imaging devices. One supposes that three-dimensional images of the interior created with radar echoes would be right out.\nThe Supreme Court also ruled, in Kyllo v. United States, that the use of thermal imaging technology to conduct “through the walls” surveillance without a warrant was unacceptable. But that 5-4 ruling employed an interesting standard – it was judged that because the military-grade thermal imaging system employed to discover Danny Lee Kyllo was using heat lamps to grow a hundred marijuana plants wasn’t available to the general public, Kyllo had a “subjective expectation of privacy.”\nHe didn’t think it would be possible to see through the walls of his house, so the warrantless thermal scan constituted unreasonable search and seizure. This would presumably also cover radar detection… unless, perhaps, the Court decides this amazing technology is merely more efficient at delivering information that could be obtained with eyes and ears. Interestingly enough, the Kyllo ruling mentioned the possible future development of technology that could allow the police to see through solid walls.\n(For the record, the Marshals Service has argued that its arrest warrants grant it authorization to use these radar devices to locate suspects, and the 10th Circuit Court of Appeals somewhat queasily agreed, while warning that it expected more cases involving the use of such technology to vex the courts in years to come.)\nNaturally, privacy advocates are upset that these devices were put into service without notifying the public, and it is equally natural for law enforcement to say that it doesn’t want to tip its hand to criminals by issuing splashy press releases describing all of the surveillance tools at its disposal. Now that we’ve learned about the Range-R system, maybe the bad guys will figure out ways to defeat it. That’s always a risk in the surveillance game, on every playing field from the Internet to the front door of the local drug den.\nThese radar devices have enormous value for saving the lives of officers during raids – every tactical team would love to know exactly where the bad guys are before they go through the door. Their usefulness for the creepier forms of government surveillance is somewhat limited. Being able to determine the approximate position of people moving around inside a house is nothing compared to, say, the NSA harvesting cell phone and email metadata. Still, it’s likely that people who are already nervous about the Surveillance State, and those who are angry at the police for other reasons, will have a bit of trouble getting past the idea that “the cops can see through walls now.”","url":"https://www.breitbart.com/politics/2015/01/20/police-departments-quietly-equipped-with-device-that-lets-them-see-through-walls/"}
