{"authors":["Fiona Connor For Daily Mail Australia"],"date_download":"2018-10-22 21:13:44","date_modify":"2018-10-22 21:13:44","date_publish":"2017-03-16 00:50:26","description":"A person has been confirmed dead after a house fire destroyed a residence at Atkinsons Dam west of Brisbane. Flames tore through the home just before 4am this morning.","filename":"data/vaneerConsumption/PolicesayonedeadafterfireathomewestofBrisbane.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FCA2F00000578-0-image-a-2_1489622922431.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318386_Police-say-one-dead-fire-home-80KM-west-Brisbane_1540242824.html","title":"Police say one dead after fire at home west of Brisbane","title_page":"Police say one dead after fire at home west of Brisbane | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One person has been confirmed dead after a house fire destroyed a residence at Atkinsons Dam west of Brisbane.\nPolice are on the scene at the Lake St property after flames tore through the Queenslander home during the early hours of this morning.\nThe fire investigation unit is at the scene working with police to uncover how the person could have been trapped inside and the cause of the devastating flames.\nA police representative told Daily Mail Australia that the house is currently too hot to go inside to confirm details of the incident but had been making enquiries to find if the deceased owned the home.\nThey say the body found is believed to be the only occupant of the house.\nFlames tore through the Queenslander home during the early hours of this morning\nFire services arrived at the two-storey property just before 4am this morning.\nThe Queenslander home was engulfed in flames at that time a fire spokesperson told DMA.\nThe fire is being treated as suspicious at this stage.\nThe house is currently too hot to confirm the details of the incident","url":"https://www.dailymail.co.uk/news/article-4318386/Police-say-one-dead-fire-home-80KM-west-Brisbane.html"}
