{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:01:50","date_modify":"2018-10-30 20:01:50","date_publish":"2018-09-07 14:55:03","description":"Police indicate three armed home invaders in Memphis were met by gunfire which left one of the suspects dead and caused the other two to flee.","filename":"data/vaneerConsumption/PoliceThreeArmedHomeInvadersMetwithGunfireOneDeadTwoFled.json","image_url":"https://media.breitbart.com/media/2018/09/homebreak.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_07__1540929710.html","title":"Police: Three Armed Home Invaders Met with Gunfire, One Dead, Two Fled","title_page":"Police: Three Armed Home Invaders Met with Gunfire, One Dead, Two Fled | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Police indicate that three armed home invaders in Memphis, Tennessee, were met by gunfire which left one of the suspects dead and caused the other two to flee.\n@ 2:20 am, officers responded to a Home Invasion Robbery at 690 N. Stevens Circle. While on the scene, officers found that 3 males, who were armed, forced their way into the home. One of the suspects was shot & killed by someone within the home. 2 unknown susps fled the scene. — Memphis Police Dept (@MEM_PoliceDept) September 5, 2018\nFox 13 reports that five people were in the home at the time of the attempted invasion, those five included a toddler.\nOne of the five adults in the house at the time said, “They rushed the house and they came after us.” He said the suspects demanded money then began shooting.\nThe man observed, “Once I started hearing multiple gunshots, I just thought everyone was dead.”\nBut another resident in the home returned fire, killing one of the suspects and causing the other two to flee the scene.\nOn July 7, 2018, Breitbart News reported Gabby Giffords’ gun control group’s claim that self-defensive gun usage is a “myth.” Giffords’ group said, “The ‘good guy with a gun’ narrative is a myth meant to scare people into buying guns for self-defense. The truth? People rarely use guns for self-defense.”\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.","url":"https://www.breitbart.com/politics/2018/09/07/police-three-armed-home-invaders-met-with-gunfire-one-dead-two-fled/"}
