{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-22 22:31:43","date_modify":"2018-10-22 22:31:43","date_publish":"2017-03-10 01:01:26","description":"The pensioner, named in reports as Peter Pickering, was rearrested and bailed in relation to the savage murder of Elsie in Wakefield, West Yorkshire in 1965.","filename":"data/vaneerConsumption/PolicecallformurderchargesagainstElsieFrostsuspect.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E08B5A700000578-0-image-a-13_1489108097354.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299614_Police-call-murder-charges-against-Elsie-Frost-suspect_1540247503.html","title":"Police call for murder charges against Elsie Frost suspect","title_page":"Police call for murder charges against Elsie Frost suspect | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police have called for rape and murder charges against a 79-year-old man suspected of killing schoolgirl Elsie Frost 52 years ago.\nElsie, 14, was attacked from behind and stabbed in the head and back as she walked through a railway tunnel just off a canal towpath in Wakefield, West Yorkshire, in October 1965.\nDetectives how now rearrested a man on suspicion of murder in Newbury, Berkshire and he has been bailed to March 6.\nElsie Frost (left) was killed more than 50 years ago as she walked near a canal in Wakefield (right, file photo)\nWest Yorkshire police said a file of evidence will be submitted to the Crown Prosecution Service.\nOn Monday, a force spokesman said the man was also arrested in connection with an unconnected offence of kidnap and rape, dating back to 1972.\nThe suspect, who has been named in reports as Peter Pickering, was taken into custody in September last year and later bailed.\nA major inquiry was launched after Elsie's body was found at the bottom of a flight of steps by a dog walker, and hundreds of people were interviewed but her killer has evaded justice ever since.\nPolice renewed efforts to find the killer in 2015 with refreshed publicity five decades on from her death, and received new information.\nThe inquiry was triggered by a BBC Radio 4 investigation into the case.\nElise, pictured aged six with her older sister Anne, 10, would be in her sixties if she was alive\nPictured: The ABC steps at a rail underpass where Elsie's body was found in 1965\nDetective Superintendent Nick Wallen said: 'Following extensive interviews, we have now bailed a man we arrested earlier this week in connection with the murder of Elsie Frost.\n'We have been in dialogue with a dedicated case lawyer from the CPS' Complex Case Unit and we will now be submitting a file of evidence for them to consider charges in respect of kidnap, rape and murder.'\nIn the wake of the fresh police appeal, Elsie's brother, Colin Frost, spoke out about her family's pain, saying their parents, Edith and Arthur, had died 'with a huge amount of guilt'.\nMr Frost said Elsie had been like a mother to him, adding: 'She was just a sweet, sweet person. She was lovely.'\nIn 1966, Ian Bernard Spencer, then aged 33, was charged with her murder but cleared on the orders of the judge who heard the case at trial.","url":"https://www.dailymail.co.uk/news/article-4299614/Police-call-murder-charges-against-Elsie-Frost-suspect.html"}
