{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:42:12","date_modify":"2018-10-30 18:42:12","date_publish":"2014-12-31 14:22:32","description":"Police Scotland, which is responsible for policing the whole of Scotland, has taken to Twitter to warn people that they are continuing to “monitor |","filename":"data/vaneerConsumption/PoliceScotlandWarnsTwitterUsersBigBrotherIsWatchingYou.json","image_url":"https://media.breitbart.com/media/2014/12/Police.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_12_31__1540924932.html","title":"Police Scotland Warns Twitter Users: Big Brother Is Watching You","title_page":"Police Scotland Warns Twitter Users: Big Brother Is Watching You | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Police Scotland, which is responsible for policing the whole of Scotland, has taken to Twitter to warn people that they are continuing to “monitor comments on social media”, and that “any offensive comments will be investigated.” The Tweet, posted at 3:49pm yesterday afternoon, has been retweeted nearly 700 times.\nPlease be aware that we will continue to monitor comments on social media & any offensive comments will be investigated. — Police Scotland (@policescotland) December 30, 2014\nThe Tweet was met with a storm of opprobrium from fellow Twitter users, with some questioning what would be deemed “offensive”, whilst others simply swore. A good number of the replies questioned the legitimacy of Police Scotland’s tweet. Jamie Foster ‏replied “It is excellent to know you have a budget to do that. We were worried the cuts might have affected you but clearly not”. John Lilburne opted for a simple “F*** yourselves”, whilst another Twitter user commented “#Fascism”.\nThere is some speculation that the tweet was prompted by Katie Hopkin’s tirade on twitter yesterday. The former Apprentice star decided to weigh in on the news that a Scottish nurse has been diagnosed with Ebola in Glasgow by tweeting:\nLittle sweaty jocks, sending us Ebola bombs in the form of sweaty Glaswegians just isn’t cricket. Scottish NHS sucks. http://t.co/EZpO0UTYHx — Katie Hopkins (@KTHopkins) December 30, 2014\nAdding:\nGlaswegian ebola patient moved to London’s Royal Free Hospital. Not so independent when it matters most are we jocksville? — Katie Hopkins (@KTHopkins) December 30, 2014\nIn response, Piers Morgan called her a “repulsive creature”. Police Scotland have confirmed that they are investigating her tweets. Det Insp Glyn Roberts, of Police Scotland, said: “We have received a number of complaints regarding remarks made on Twitter. Inquiries are ongoing into the nature of these tweets and to establish any potential criminality. Police Scotland will thoroughly investigate any reports of offensive or criminal behaviour online and anyone found to be responsible will be robustly dealt with.”\nThis is not the first time that Police Scotland have issued such a warning. On the 23rd December they tweeted: “Please be aware that we will continue to monitor comments on social media & any offensive comments will be investigated #georgesquare”, with reference to the shocking incident in Glasgow in which an out of control bin lorry killed six Christmas shoppers.\nThat Tweet too was met with derision. David Jack Smith replied “PLEASE BE AWARE that the British police are monitoring YOU>>@policescotland Just like the North Koreans, Commie Chinese, et al”, whilst RubyMalvolio ‏asked “which law are you enforcing? Didn’t realise being offensive was illegal.”\nIndeed it is. On the same day, a 19 year old man in Sunderland was arrested by Northumbria Police on suspicion of making a malicious communication after he tweeted “So a bin lorry has apparently driven in 100 people in Glasgow eh, probably the most trash it’s picked up in one day”. The tweet has now been deleted, along with his account. The man has been bailed.\nPolice Scotland also use their Twitter feed to intimidate those suspected of domestic abuse. On 29th December they tweeted “If you commit domestic abuse we’ll find you … #NoHidingPlace” The tweet also contained a link to a video warning “Police Scotland will not tolerate domestic abuse. If you commit it, we’ll find you – there is #NoHidingPlace”.\nBy contrast, Greater Manchester Police’s twitter feed urges those committing domestic abuse to seek help. On the same day as Police Scotland’s threat went out, Greater Manchester police tweeted “Domestic abuse is a crime and you could face time in prison. Seek help #endthefear and contact Respect 0808 8024040”.\nThey have also tweeted about rape eight separate times in the last ten days alone. Tweets include “Do you know what rape is? If someone is drunk & they can’t consent – that is rape. If someone is asleep & they can’t consent – that is rape,” which was posted last night.\nMeanwhile, Nicola Sturgeon, First Minister of Scotland and the leader of the Scottish National Party, met with officers within the Scottish police force to thank them for all their hard work. On the 22nd December, Police Scotland tweeted “Today officers met with FM @NicolaSturgeon as she thanked the emergency services for their work over Xmas”, and urged the people of Scotland to “tweet your ‘thank you’ message by using #BlueLightThanks”.","url":"https://www.breitbart.com/europe/2014/12/31/police-scotland-warns-twitter-users-big-brother-is-watching-you/"}
