{"authors":["John Hayward"],"date_download":"2018-10-30 22:00:10","date_modify":"2018-10-30 22:00:10","date_publish":"2016-07-15 17:47:37","description":"Breitbart News Daily's Stephen K. Bannon discussed with former NYPD commissioner Ray Kelly whether there is a “war on cops” in America.","filename":"data/vaneerConsumption/PoliceUnderAttackforDoingTheirJobsFergusonEffectIsReal.json","image_url":"https://media.breitbart.com/media/2014/12/Antonio-Martin-Berkeley-Missouri-protests-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2016_07_15__1540936810.html","title":"Police Under Attack for ‘Doing Their Jobs’; ‘Ferguson Effect Is Real'","title_page":"Fmr. NYPD Commish Ray Kelly: Police Under Attack for ‘Doing Their Jobs’; ‘Ferguson Effect Is Real'","title_rss":"NULL","source_domain":"breitbart.com","text":"On Friday’s Breitbart News Daily, SiriusXM host Stephen K. Bannon asked former NYPD commissioner Ray Kelly, author of Vigilance: My Life Serving America and Protecting Its Empire City, if he thinks there is a “war on cops” in America today.\n“It’s certainly a very difficult environment for police,” Kelly replied. “I mean, they have been attacked for, really, doing their jobs. Of course, we saw the terrible events in Dallas: five police officers who had nothing to do with those questionable shootings, who were just assassinated.”\n“The police are hesitating in certain situations. The so-called ‘Ferguson Effect’ is real,” he said. “I’ve never seen police hesitate in emergency situations, but as far as discretionary actions are concerned, yeah, they are. It’s understandable. They don’t want to jeopardize their job.”\n“As a result, I believe it’s been pretty well-documented that in major cities throughout America, the homicide rates are going up. We can see that, certainly, in Baltimore, in other major cities,” Kelly said, adding:\nI attribute that to backing away from proactive policing. In New York City, proactive policing is what made the difference. In 1990, we had 2,245 murders, on a population base of 7.5 million people. In 2013, the last year of the Bloomberg administration, we had 333 murders on 8.5 million population. Again, I think that was a result of proactive, smart, intelligent policing.\n“So far in New York, we see those numbers staying down, and that’s a good thing,” he added. “But in other cities – crime is down, generally speaking, over the last 20 years throughout America. But now, we see violence creeping up. We certainly see the murder rate increasing in inner cities. It’s something to be concerned about.”\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/radio/2016/07/15/nypd-commissioner-ray-kelly-police-under-attack-for-doing-their-jobs-ferguson-effect-is-real/"}
