{"authors":["Associated Press"],"date_download":"2018-10-23 00:34:05","date_modify":"2018-10-23 00:34:05","date_publish":"2017-03-16 10:00:15","description":"DETROIT (AP) - A 60-year-old man suspected in the shooting of two Detroit police officers has been arrested and the officers are in stable condition, the...","filename":"data/vaneerConsumption/Policearrestsuspectinshootingof2Detroitofficers.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/21/wire-230745-1489698874-122_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319500_Police-arrest-man-suspected-wounding-2-Detroit-officers_1540254845.html","title":"Police arrest suspect in shooting of 2 Detroit officers","title_page":"Police arrest suspect in shooting of 2 Detroit officers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DETROIT (AP) - A 60-year-old man suspected in the shooting of two Detroit police officers has been arrested and the officers are in stable condition, the police chief said Thursday.\nThe officers were conducting an investigation in an area where narcotics are sold Wednesday night on the city's west side when they approached a man who was \"acting fidgety,\" Police Chief James Craig said. The man pulled out a gun and fired before the officers returned fire, Craig said.\nOne officer was shot in the neck and \"the early diagnosis is he's going to be OK,\" the chief said. The other officer was shot in the ankle and body armor stopped two bullets to the chest, he said.\nIn a Wednesday, March 15, 2017 photo, Detroit police gather at the staging area near Ash and Tillman in Detroit for the search a suspect wanted in the shooting of two Detroit police officers. A 60-year-old man suspected in the shooting has been arrested and the officers are in stable condition, the police chief said Thursday. (David Guralnick/Detroit News via AP)\nThe shooter fled, sparking a police search that ended with the arrest late Wednesday, Craig said. The man arrested had been shot in the leg - an injury police believe was from the initial exchange of gunfire, the chief said. He is being treated at a hospital.\nCraig told WWJ-AM on Thursday morning that he expects the man to be charged.\nPolice sent a warrant request to the Wayne County prosecutor's office, but a decision about charges had not been made as of Thursday afternoon, a prosecutor's spokeswoman said.\nThe shooting occurred near where Wayne State University officer Collin Rose was fatally shot in November. Craig said the officers who were shot Wednesday were part of a stepped-up police presence in the area since the 29-year-old Rose was shot.\nThe chief said police are investigating whether there's any connection between the Rose shooting and Wednesday's. Investigators have been asking for tips from the public in Rose's death. Charges against a man initially arrested in the case were later dropped.\nIn a Wednesday, March 15, 2017 photo, Detroit police gather at the staging area near Ash and Tillman in Detroit for the search a suspect wanted in the shooting of two Detroit police officers. A 60-year-old man suspected in the shooting has been arrested and the officers are in stable condition, the police chief said Thursday. (David Guralnick/Detroit News via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4319500/Police-arrest-man-suspected-wounding-2-Detroit-officers.html"}
