{"authors":["Liz Dunphy For Mailonline"],"date_download":"2018-10-23 03:49:49","date_modify":"2018-10-23 03:49:49","date_publish":"2017-03-16 14:52:09","description":"The officer sent a selfie to the student friends to prove his identity and he is fast becoming a sensation online. The friends were out in Cardiff when one male left the groupand got a police escort home","filename":"data/vaneerConsumption/PolicejoinFacebookgrouptogetdrunkstudenthome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E53E37700000578-0-image-a-60_1489672980718.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320034_Police-join-Facebook-group-drunk-student-home_1540266589.html","title":"Police join Facebook group to get drunk student home","title_page":"Police join Facebook group to get drunk student home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A private group chat among friends went public after a police officer interrupted their messages to help their drunk friend find his way home.\nLawrence Court, a student, was on a night in Cardiff when his friend Cameron had a little too much to drink and was refused entry to a nightclub.\nCameron decided to cut his losses and head home but was picked up by police officers on his stumble home.\nCameron was too drunk to remember where he lived, so the resourceful policeman hijacked the group chat on his phone and asked his friends for his address.\nL-R Poppy, Lawrence, Brad, Cameron (back) and Demelza, the students were stunned when a policeman contacted their Facebook Messenger group to help their drunk friend Cameron (top right) get home after a night out in Cardiff\nThe messenger conversation in which the Cardiff policeman contacted the group of friends. The policeman asked the group for Cameron's address which they supplied. The policeman then assured them that he would take Cameron home safely\nThe friends then started to question whether the mystery messenger was legit, so he sent them a selfie from the police van to prove his identity, wearing full police uniform\nThe group gave the mystery messenger Cameron's address, but then questioned the author's identity, and presumed that the message was a joke.\nTo prove it wasn't a windup, the officer sent a selfie into the chat and even changed Cameron's name in it to: 'Such a VIP he had a police escort.'\nMr Court, who is a human geography student at Cardiff University, shared screenshots of the chat, including the police selfie, on Twitter on Tuesday with the caption: 'So last night the police interrupted our group chat in the most spectacular way.'\nHis post has already been retweeted 18,000 times with a further 60,000 likes and countless comments.\nThe first screenshot shows the initial message from the police which read: 'Hello, it's the police on Cameron's phone.\n'He is very drunk and we are dropping him home. He does not know what number he lives on.'\nCameron's friends respond with his house number before the policethank them and write: 'We will get him home safe now. Don't forget to thank your friendly neighbourhood officers at Cathays station.'\nHowever, some on the chat grow suspicious and ask why they would ask that on the group chat with one member writing: 'I call b******t.'\nTo prove it was legitimate, the police officer sent them a selfie, dressed in uniform from the police van.\nThe helpful policeman became a sensation online after he sent the group a selfie to prove that the message was not a wind up. After the group gave him the drunk student's address the officer took him home safely\nHe had also changed Cameron's name to: 'Such a VIP he has a police escort.'\nBefore one of the group responds: 'F*** me dead, it's legit..'\nSpeaking today about the unusual group chat intruder, Mr Court said: 'My friend had a few too many drinks before a night out and was refused entry.\n'On his stumble home he was found by the police who couldn't communicate with him so resorted to using his phone to find where he lives.\n'The rest as on the photos, is history. I'm just impressed with the police force for taking him home and using their initiative to find the address. The police can get some stick but this shows another side to them.'\nTwitter users were quick to react Lawrence's Twitter post.\nMeliodas wrote: 'Without a doubt, you sir, have made my year.'\nAsaad Qureshi commented: 'Who needs uni when you're famous lol?'\nWhilst Brad added: 'Unreal.'","url":"https://www.dailymail.co.uk/news/article-4320034/Police-join-Facebook-group-drunk-student-home.html"}
