{"authors":["Brandon Riddle Clara Turnage"],"date_download":"2018-10-30 14:31:28","date_modify":"2018-10-30 14:31:28","date_publish":"2018-08-29 04:30:00","description":"In a span of three days, Pine Bluff police officers responded to four slayings in the city limits, the last one occurring late Tuesday.","filename":"data/vaneerConsumption/Policecount4PineBluffkillingsinjust3days.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_29_police-count-4-pb-killings-in-just-3-da__page=1_1540909888.html","title":"Police count 4 Pine Bluff killings in just 3 days","title_page":"Police count 4 Pine Bluff killings in just 3 days","title_rss":"NULL","source_domain":"arkansasonline.com","text":"In a span of three days, Pine Bluff police officers responded to four slayings in the city limits, the last one occurring late Tuesday.\nDepartment spokesman officer Richard Wegner said that an unidentified man was fatally shot in the chest late Tuesday in the 2800 block of W. 40th Street. His death is the fourth officers have investigated since Sunday.\nThe victim was taken to a hospital, but Wegner said he was pronounced dead on arrival. Wegner said officers didn't know of any other victims in that case.\nOfficers responded to the scene at approximately 6:30 p.m., Wegner said, but were still waiting for a search warrant at 8 p.m.\nWegner said officers could not enter the residence or learn more about where the crime took place until they got the search warrant. He said officers have identified a person of interest and were still interviewing him Tuesday night.\nWegner said he could not yet say whether the man was a suspect.\nFewer than 24 hours earlier, officers were called shortly before 9:30 p.m. Monday to a shooting in the 2800 block of South Poplar Street, where they found 26-year-old Corey Pitts lying unresponsive in the street, according to a news release from the department.\nPitts was taken by ambulance to a hospital, where he was pronounced dead.\nPolice said Pitts appeared to have been shot once during an altercation with a 29-year-old man. The man was questioned but had not been arrested as of Tuesday. The Jefferson County prosecuting attorney's office was set to review the case.\n\"A final decision on if criminal charges are warranted will be made by the prosecutor's office once the completed case file is reviewed,\" Wegner said in a statement, adding that \"self-defense may be considered in the final decision.\"\nThe shooting came on the heels of another case of fatal gunfire that occurred around 1 a.m. Monday. That's when Antonio Brown, 36, was found at a residence in the 2600 block of West 34th Avenue. Brown died at the scene. Two children and Carolyn Cole, 27, also were hurt.\nAnother man, Raymond Buchanan, 29, was fatally shot around 10:15 a.m. Sunday after as many as four people approached him in the area of 19th Avenue and Amis Street. At least one fired shots, according to authorities.\nBuchanan was taken to Jefferson Regional Medical Center and died shortly after going into surgery, officers said.\nThere was no immediate indication that any of the homicides were related.\nThere have been 16 homicides reported in Pine Bluff this year, according to police figures. Nineteen killings had been reported in the city by this time last year, and 29 were reported for all of 2017.\nADVERTISEMENT\nMore headlines\nState Desk on 08/29/2018","url":"https://www.arkansasonline.com/news/2018/aug/29/police-count-4-pb-killings-in-just-3-da/?page=1"}
