{"authors":["Victoria Friedman"],"date_download":"2018-10-30 22:04:13","date_modify":"2018-10-30 22:04:13","date_publish":"2017-04-19 09:31:14","description":"Poland's interior minister said the country will reject multiculturalism which he said led to the “bloody harvest” of terror attacks across Europe.","filename":"data/vaneerConsumption/PolishGovernmentWillNotAllowBloodyHarvestofMulticulturalism.json","image_url":"https://media.breitbart.com/media/2017/04/Mariusz-Błaszczak.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_19__1540937053.html","title":"Polish Government Will Not Allow 'Bloody Harvest' of Multiculturalism","title_page":"Polish Government Will Not Allow 'Bloody Harvest' of Multiculturalism","title_rss":"NULL","source_domain":"breitbart.com","text":"The Polish interior minister affirmed Poland will not repeat the Western European policy of multiculturalism which he said has led to the “bloody harvest” of multiple terror attacks across the continent since the start of the migrant crisis.\n“The policy of multiculturalism in Western Europe is bringing about a bloody harvest in the form of terrorist attacks,” Mariusz Błaszczak told Polish Radio on Tuesday.\nThe conservative Law and Justice (Prawo i Sprawiedliwość, PiS) government has refused to accept migrants from the Middle East and Africa under an EU programme to relocate across the bloc some 98,000 asylum seekers currently residing in camps in Italy and Greece.\nAt the EU summit on the migrant crisis in September 2015, Poland’s previous coalition government led by Donald Tusk’s Civic Platform (Platforma Obywatelska, PO) agreed to accept 4,500-5,000 asylum seekers.\nHowever, the following month PiS swept the parliamentary election and proceeded to reject the previous government’s migrant position.\n“Our predecessors, agreeing to receive thousands of refugees – and de facto immigrants from the Middle East, and northern Africa – were striving to bring about such a crisis,” Błaszczak said.\nHe added that while PiS was in power, it would “not allow a repeat of what we are dealing with in Western Europe”.\nWestern European countries like Germany and France have been victims of deadly terror attacks committed by migrants, failed asylum seekers, and others using the migrant route to enter the bloc. This month, a failed asylum seeker from Uzbekistan hijacked a truck and drove at speed through a pedestrianised shopping area in Stockholm, Sweden, killing four and injuring at least 15 people including children.\nMr. Błaszczak also said the country must be prepared for a “negative scenario” in the event of another mass flow of migrants into Europe, and raised the prospect of the country building Hungarian-style detention centres to house migrants whilst their asylum claims are processed.\nThe possibility of a second migrant crisis appears more likely following a win for Islamist Turkish President Recep Tayyip Erdoğan in a referendum that would grant him further constitutional powers in Turkey. Erdoğan has threatened to dissolve the migrant deal with the EU, which could see thousands again crossing the Aegean Sea from the Near Eastern nation to Greece and onwards to northern Europe.\nThe Polish minister’s comments come days after a poll revealed that more Poles now than ever (70 per cent) back the conservative government’s stance on refusing to accept non-European migrants.","url":"https://www.breitbart.com/europe/2017/04/19/western-europe-bloody-harvest-multiculturalism-poland/"}
