{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:04:05","date_modify":"2018-10-30 22:04:05","date_publish":"2015-11-09 14:23:32","description":"Contents: Political crisis in Iran grows over nuclear agreement; Iran arrests journalists for allowing U.S. 'infiltration network'; The coming regime change in Iran |","filename":"data/vaneerConsumption/PoliticalCrisisinIranGrowsoverNuclearAgreement.json","image_url":"https://media.breitbart.com/media/2015/05/Iran-Hassan-Rouhani-Bushehr-nuclear-power-plant-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_09__1540937045.html","title":"Political Crisis in Iran Grows over Nuclear Agreement","title_page":"Political Crisis in Iran Grows over Nuclear Agreement","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nPolitical crisis in Iran grows over nuclear agreement\nIran arrests journalists for allowing U.S. ‘infiltration network’\nThe coming regime change in Iran\nPolitical crisis in Iran grows over nuclear agreement\nWomen hold anti-U.S. banners commemorating Iran’s 1979 attack on the U.S. embassy in Tehran (Reuters)\nThe signing of the nuclear deal with the West has apparently been the trigger launching Iran into a growing political crisis between the “hardliners,” generally represented by survivors of the 1979 Great Islamic Revolution, and the “moderates,” generally the generations growing up since the Revolution.\nAlmost all Iranians favor the nuclear deal (the “Joint Comprehensive Plan of Action” or JCPOA), but mainly because it means that the Western sanctions will be lifted and the economy will improve. This leads to today’s core political conflict in Iran:\nThe nuclear agreement clearly states that the sanctions will be suspended over time, as Iran implements its part of the agreement, and that the sanctions can be reinstated (“snapped back”) if Iran fails to implement something. An Iranian committee has confirmed that the JCPOA says this.\nOn the other hand, Iran’s Supreme Leader Seyed Ali Khamenei has said repeatedly, both before and after the agreement was signed, that sanctions must be permanently canceled before Iran implements any of its obligations, and that they can never be reinstated.\nIran’s president Hassan Rouhani, who is considered a moderate, responded last week to Khamenei’s additional requirements by making a kind of weasel-worded statement that the “fulfillment of the opposing party’s commitments” will be monitored with “complete vigilance” and that the Supreme National Security Council will “adopt the appropriate decision for the proper course of action” while monitoring the implementation. Rouhani added that the U.S. and the EU have provided “written and formal” guarantees of the complete lifting of all economic and financial sanctions.\nAs we wrote last week, Hashemi Rafsanjani, the head of Iran’s Expediency Council and the political rival of Iranian Supreme Leader Seyed Ali Khamenei, was supporting Rouhani’s position and was laying the groundwork for a rebellion against Khamenei over the nuclear agreement.\nHossein Shariatmadari, managing editor of conservative news outlet Kayhan, struck back by saying that Rouhani’s administration is not “serious” about implementing the nuclear deal according to Khamenei’s expressed recommendations.\nThere is really no middle path through these core differences. Iran’s hardliners have reacted strongly and critically to reports, apparently untrue, that the Atomic Energy Organization of Iran (AEOI) has already started dismantling centrifuges under the deal, but this is just one example of vitriolic arguments that are arising. As new deadlines approach, the differences will become more explicit. AEI Iran Tracker (22-Oct) and AEI Iran Tracker (28-Oct) and AEI Iran Tracker (3-Nov)\nIran arrests journalists for allowing U.S. ‘infiltration network’\nLast week, Iranians rallied to celebrate the anniversary of the 1979 attack on the American embassy in Tehran, and taking hostages. At that celebration, the crowds changed “Death to America!”, and Iran’s hardliners coined the phrase “infiltration network” to describe the treason of allowing American ideas and products to infiltrate Iran’s society.\nOnce again, this appears to be driven by the nuclear deal, which many conservative Iranian hardliners bitterly oppose. Allowing the infiltration of American ideas is interpreted as supporting the nuclear agreement without imposing Khamenei’s new conditions requiring the immediate permanent cancellation of all sanctions. Demanding the immediate cancellation of all sanctions is a tool being used by the hardliners to get the deal completely scuttled.\nThe hardliners have arrested several journalists, as well as dissident writers and artists, on charges of supporting the “infiltration network.” However, president Hassan Rouhani has infuriated the hardliners by saying:\nLet us not go and arrest one person here, another there, based on an excuse and without any reason, and then make up a case and aggrandize it, and finally say this is an infiltration movement.\nAccording to Mehdi Khalaji, an Iran expert at the Washington Institute for Near East Policy, the hardliners are now going to crack down hard on Rouhani:\nThis is the beginning of Rouhani’s end. What we’ll now see, inside and outside the country, is an Iran that will pursue a more adversarial policy while the nice, smiling face of Iran is going to fade.\nKhalaji’s prediction is possible, but extremely unlikely in a generational Awakening era. Whether Rouhani survives or not, what is far more likely is that the political conflict will increase, as it did in America’s last generational Awakening era in the 1960s.\nA generational Awakening era is always political battle between the older generation of traumatized survivors of the last generational crisis war versus the younger generations that grow up after the war ends. As the older generations retire and die off, the younger generations take charge and win the political battles. It seems to me that the hardliners cannot win this current battle, since that would mean scuttling the nuclear deal completely. Business Insider (4-Nov) and Reuters (4-Nov) and AEI Iran Tracker (5-Nov) and Reuters\nThe coming regime change in Iran\nTen years ago I predicted, based on a Generational Dynamics analysis, that Iran would become America’s ally. At the time, that prediction seemed insane, so it has been astonishing to see Iran move step by step in that direction during the last five years.\nFor this article, I wanted to go more deeply in the reasoning behind that prediction ten years ago. In order to do that, I went back through my archive of news articles that I have cut, pasted and saved (currently totally about 80,000 articles since the 1990s) to find some news articles about Iran that influenced me.\nHere are some excerpts from a Washington Times article that appeared on July 11, 2002, about ten months after 9/11:\nIranians Stage Pro-American Protest Against Ayatollahs “Death to the Islamic Republic, the Taliban of Tehran.” This is the challenge tens of thousands of Iranians chanted to their government yesterday, marking the third anniversary of peaceful demonstrations that left students lying dead outside of their dormitories. The United States should listen to what the people within Iran are demanding since it may affect the outcome of our war against terrorism. The U.S. war against terrorism is about rolling back Islamic fundamentalism. The enemies of America are not ordinary Muslims living in Tehran, Istanbul, Baghdad or Dearborn. Those who wish to see us dead are the self-proclaimed radical Islamists who have been inspired, supported and funded by the Islamic Republic of Iran, among others, for more than 23 years. If the United States is interested in winning the war against terrorism, then it must pay attention to what happened in Iran yesterday because, for the first time in 23 years, the people of Iran are taking the lead in exposing the bankruptcy of Islam as a form of governance.\nThe article is referring to July 9, 2009, when tens of thousands of Iranian college students held anti-government protests for six days. Iran’s security forces brutally massacred the students, killing many of them, and the protests spread to cities across the country. The above article is about new protests being held on the 3rd anniversary of those protests.\nThe next year, the government took some steps to contain the fourth anniversary of the 1999 massacre. This article is from the Iran Press Service, dated June 23, 2003:\nIran Bans Off Campus Protests TEHRAN — The Iranian government said on Tuesday that it would not allow any protests meeting to be held in the future outside universities. Abdollah Ramezanzadeh, the official spokesman for the government said, in answer to questions concerning the anniversary of the student’s anti-regime revolt of July 9, 1999, “no further demonstrations would be allowed outside universities’ campuses.” “The Interior Ministry is opposed to any gathering outside university campuses and no permit has been issued by the government for holding special commemoration meetings, Ramezanzadeh stated, adding that however, the government “will not interfere in any gathering held inside universities.” … Ramezanzadeh said the government and many students were still “dissatisfied” since the masterminds of the July 9, 1999 disaster have not been properly dealt with.” “We expect that those behind recent events and the culprits involved in the 9 July 1999 crimes, irrespective of their factional affiliation, are confronted,” he added, quoted by the official news agency IRNA.\nHere’s another article from my archives, from the LA Times on July 2, 2003:\nIran Shuts Out Porn, Dissent Web Sites TEHRAN — Iran is blocking access to Web sites containing pornographic material and dissent against the country’s Islamic establishment, an official said Tuesday. More than 140 Web sites promoting dissent, dancing and sex have been blocked since the crackdown began last month, said Farhad Sepahram, a Telecommunications Ministry official. Religious hard-liners are increasingly worried about Iranians’ access to information from the outside world, apparently concerned that communications are playing a role in stirring reform sentiment such as the recent anti-government protests by young people. Sepahram said most of the blocked Web sites belong to opposition groups. They include one run by Reza Pahlavi, son of the late Shah Mohammed Reza Pahlavi, who was toppled by the 1979 Islamic Revolution, and one by Abolhassan Bani-Sadr, Iran’s first elected president after 1979 who now opposes the cleric-dominated establishment. Also blocked are the Voice of America’s Persian-language service and radiofarda.com, a U.S.-financed Persian-language audio program.\nSo how did I know ten years ago that Iran was going to become America’s ally? It was because reading all these articles, and others like them, made it clear that what was going on in Iran was the same as what went on in America in the 1960s.\nIn America’s Awakening era in the 1960s, we had girls burning their bras, marches on Washington, violence in the streets of Los Angeles, Chicago and Detroit, and student anti-war protests. These are the kinds of things that are typical of any society 20-30 years after the end of a generational crisis war. Student protests are particular common during these eras because the represent the rise of the first post-war generation.\nIt was just like that in Iran ten years ago. So I could see that many college students were protesting against the hardliners, and were pro-American and pro-Western. (They did not like America’s 2003 ground invasion of Iraq, and they did not like President Bush’s characterization of “Axis of Evil,” but they were still pro-American because they really hated their own government more than anything else.)\nAnd now, of course, those college students are 30-40 years old, and have moved into positions of power, as I knew ten years ago that they would. Today, they are the reporters who write the news stories and are being accused of supporting an “infiltration network” (a phrase that they undoubtedly think is hilarious), and they are the scientists working in the nuclear plants.\nAmerica’s Awakening era finally climaxed in 1974 with the resignation of Richard Nixon, resulting in a victory of the younger generation over the older generation. Iran is headed in the same direction. The Watergate issue triggered the political coup that ousted Richard Nixon, and it is possible that the nuclear deal may be the trigger for the eventual coup that ousts Iran’s Ayatollah Khamenei and the other older generation hardliners.\nKEYS: Generational Dynamics, Iran, Seyed Ali Khamenei, Hassan Rouhani, Hashemi Rafsanjani, Mehdi Khalaji, Joint Comprehensive Plan of Action, JCPOA, Atomic Energy Organization of Iran, AEOI, Richard Nixon, Abdollah Ramezanzadeh, Farhad Sepahram, Reza Pahlavi, Shah Mohammed Reza Pahlavi, Abolhassan Bani-Sadr\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/11/09/world-view-political-crisis-in-iran-grows-over-nuclear-agreement/"}
