{"authors":["Jaime Dunaway Brandon Riddle"],"date_download":"2018-10-30 14:31:56","date_modify":"2018-10-30 14:31:56","date_publish":"2018-08-27 07:54:00","description":"One person died and three others were hurt in a shooting early Monday in Pine Bluff, police said.","filename":"data/vaneerConsumption/Policeidentify2killedinseparatehomicidesinPineBluff.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_27__1540909916.html","title":"Police identify 2 killed in separate homicides in Pine Bluff","title_page":"Police identify 2 killed in separate homicides in Pine Bluff","title_rss":"NULL","source_domain":"arkansasonline.com","text":"One person died and three others were hurt in a shooting early Monday in Pine Bluff, police said.\nOfficers were called to the area of 34th Avenue and Fir Street around 1 a.m. in reference to shots fired, according to a Pine Bluff Police Department news release.\nAuthorities were later directed to a residence in 2600 block of West 34th Avenue, where they discovered several people with gunshot wounds.\nOfficers noticed a trail of blood leading into the home, where they found a man, identified as 36-year-old Antonio Brown, unresponsive on the floor, according to a report. He was later pronounced dead at the scene.\nTwo minors, whose names and ages have not been released, were taken to Arkansas Children’s Hospital in Little Rock. Police noted that one youth had a gunshot wound in the left eye, and the other had a gunshot wound in the buttocks.\nOne of the minors told officers they were outside when a gray vehicle drove by and shots were fired.\nAnother person, 27-year-old Carolyn Cole, was taken to Jefferson Regional Medical Center, where she was treated in the emergency room for a gunshot wound to the leg, the report states. Police said it was a serious but not life-threatening injury.\nNo suspects had been named as of Monday morning in Pine Bluff’s 14th homicide of the year. An investigation is ongoing.\nA shooting Sunday morning left another person dead in Pine Bluff in the area of 19th Avenue and Amis Street. Up to four people were believed to have approached the victim, and at least one fired shots, according to police.\nAuthorities said they arrived shortly after 10:15 a.m. to find a 29-year-old man suffering from gunshot wounds to the his abdomen and left shoulder in his backyard.\nA witness told police he was in the backyard working when he heard shots near the front of the residence, according to a report. He later saw the victim, identified Monday as Raymond Buchanan, running toward the back of the house. Buchanan told the witness he’d been shot before collapsing on the ground, officers noted.\nThe worker said he went to the front of the house and saw a black Chevrolet Impala with out-of-state tags speed away from the area. He also saw a dog lying in the yard with a gunshot wound to the head, according to the report.\nBuchanan was taken to Jefferson Regional Medical Center and died shortly after going into surgery, police said.\nIt was not immediately clear whether the shootings were related.","url":"https://www.arkansasonline.com/news/2018/aug/27/1-killed-3-hurt-overnight-shooting-pine-bluff-poli/"}
