{"authors":["Thomas Burrows For Mailonline","Katherine Rushton For The Daily Mail"],"date_download":"2018-10-23 03:40:09","date_modify":"2018-10-23 03:40:09","date_publish":"2016-01-28 19:19:03","description":"Police have dropped an investigation into allegations of physical and sexual abuse at the scandal-hit charity Kids Company because there was not enough evidence of 'criminality'.","filename":"data/vaneerConsumption/PolicedropinvestigationintoreportsofphysicalandsexualabuseatKidsCompany.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/0D7944E500000514-0-image-a-26_1454008594105.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421535_Police-drop-investigation-reports-physical-sexual-abuse-scandal-hit-charity-Kids-Company_1540266009.html","title":"Police drop investigation into reports of physical and sexual abuse at Kids Company","title_page":"Police drop investigation into reports of physical and sexual abuse at Kids Company | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Camila Batmanghelidjh said she 'burst into tears' when hearing the news\ncharity blame allegations for forcing it to close last August\nThe charity's founder Camila Batmanghelidjh said it could have survived if the claims of physical and sexual abuse had not frightened away donors\nPolice have dropped an investigation into allegations of physical and sexual abuse at the scandal-hit charity Kids Company because there was not enough evidence of 'criminality'.\nThe Metropolitan Police said they carried out an 'extensive' investigation into the now-defunct charity, and heard 32 accounts of alleged physical and sexual abuse.\nHowever, they did not find enough evidence to bring a criminal prosecution, or to suggest that the charity had 'fail[ed] in its duty to safeguard children or vulnerable adults.'\nThey said the reports - supplied by a journalist - were mostly third-party hearsay which were 'vague in detail'.\nThe news will be both a relief and a source of frustration to Kids Company's former bosses, who blame the allegations of sexual abuse for forcing the charity to close its doors last August.\nKids Company's reputation had already been savaged by claims of financial mismanagement.\nBut its founder Camila Batmanghelidjh said it could have survived if the claims of physical and sexual abuse had not scared off donors.\n'That's the reason the charity closed. We had money confirmed. But the philanthropists said they couldn't support us when we were informed there were allegations,' she said.\nMiss Batmanghelidjh added how she 'burst into tears' when she heard police had ended their investigation.\n'I'm very grateful to the police for acting honourably and fairly', she said.\n'A lot of other organisations judged on the basis of allegations that were unfounded and the police acted with complete integrity on all this.\n'I don't feel that the parliamentary inquiry will be honourable because that's the committee that was suggesting I do voodoo and all that.'\nMiss Batmanghelidjh added how she 'burst into tears' when she heard police had ended their investigation\nThe allegations surfaced during interviews with two former charity workers by the BBC's Newsnight and BuzzFeed.\nThe information was passed on to police after an independent expert said the claims raised child protection concerns.\nBut police found the reports between 2008 and 2015 had largely come from third parties, rather than people who were abused themselves.\nOne of the allegations had already been investigated, and involved an adult 'client' who physically assaulted a staff member. He has already been handed a three-month suspended sentence.\nHowever, officers could not find anything substantive beyond this, or any evidence of 'failings by the charity in its duty to safeguard children or vulnerable adults'.\nThe Government dished out £46million to Kids Company over 15 years, despite repeated warnings about the dire state of its finances\nSCANDAL-HIT CHARITY CLOSED LAST AUGUST JUST SIX DAYS AFTER RECEIVING A £3MILLION GRANT Founded by Camila Batmanghelidjh in 1996 to offer counselling, support and art therapy to disadvantaged youngsters in Lambeth and Southwark, Kids Company was widely praised for its innovative approach and received a total of at least £42 million from central government and £4 million from local authorities and lottery bodies. However, it folded amid a storm of controversy in August 2015 - just six days after receiving a £3 million grant in a final bid to keep it afloat. In December, Alan Yentob, who was chairman of trustees at the charity, stepped down as BBC creative director after facing intense scrutiny during the episode.\nThe Metropolitan Police said in a statement: 'Aside from this case, to date the Met has identified no evidence of criminality within the 32 reports which would reach the threshold to justify a referral to the Crown Prosecution Service.\n'As such the Met investigation into potential physical and sexual abuse has now concluded, although, as with any investigation, should any further information come to light it will be fully considered.'\nSince Kids Company's collapse, a series of damaging reports have painted a picture of chaos at the charity, with money being handed out 'willy-nilly' to youngsters, and relatives of staff.\nKids Company is also the subject of an investigation by the Charity Commission.\nAnd the charity is not the only casualty of the scandal.\nAlan Yentob, its former chairman, was forced to give up his £330,000 job as the BBC's creative director, after he meddled in the corporation's coverage of Kids Company's closure.\nMeanwhile, the Government has been heavily criticised for handing Kids Company so much tax payers' money, when officials knew it was on the brink of collapse and could fail.\nThe Government dished out £46million to Kids Company over 15 years, despite repeated warnings about the dire state of its finances.","url":"https://www.dailymail.co.uk/news/article-3421535/Police-drop-investigation-reports-physical-sexual-abuse-scandal-hit-charity-Kids-Company.html"}
