{"authors":["Simon Kent"],"date_download":"2018-10-30 18:59:32","date_modify":"2018-10-30 18:59:32","date_publish":"2016-01-13 10:16:26","description":"The Metropolitan Police have been called in to investigate a BBC Radio phone-in show that gave an anti-Semitic Londoner almost 15 minutes of airtime to |","filename":"data/vaneerConsumption/PoliceInvestigatingAntiSemiticBBCCallerWhoSaidJewsRuleTheWorld.json","image_url":"https://media.breitbart.com/media/2015/06/BBC.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_13__1540925972.html","title":"Police Investigating Anti-Semitic BBC Caller Who Said Jews ‘Rule’ The World","title_page":"Police Investigating Anti-Semitic BBC Caller Who Said Jews ‘Rule’ The World | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Metropolitan Police have been called in to investigate a BBC Radio phone-in show that gave an anti-Semitic Londoner almost 15 minutes of airtime to air his views on the topic of Jewish world domination.\nAs Breitbart News reported, during the Simon Lederman show on 22 December, the caller, introduced as “Andy from St Margaret’s”, said: “The Rothschilds, the people who own the Bank of England, the people who own the Federal Reserve, they’re all Zionist Jews. The people who own corporate America, the media, you’ll find if you just do a little bit of research, they’re all Zionist Jews. We are ruled by Zionist Jews.”\nThe caller’s comments continued with a long and bad-tempered rant in which he complained of an obsession with the Holocaust and repeated: “We are dominated by the Jews’ system, the financial Jewish system.” Hear a repeat of the segment below:\nThe Campaign Against Antisemitism (CAA) said the caller was granted 15 minutes to preach his views without “counter argument, correction or condemnation of his views that Jews control money, banks, commerce and the media”.\nA police spokesperson told Jewish News Online: “Police in Barnet are investigating an allegation of anti-Semitism made by a caller to a London radio talk show. No arrests have been made. Enquiries are ongoing.”\nFor its part, BBC Complaints is not sure what all the fuss is about. While apologising for “any offence caused by the caller’s views”, it said Lederman is an experienced journalist “with a good understanding of BBC editorial policy which he made every effort to follow by robustly challenging the caller”.\nIn an email to a complainant, it added: “The listener called saying he wanted to talk about his belief the UK is a plutocracy not a democracy. That was the reason he was put on air in the first place, but it soon became clear he had another agenda about Zionism and simon chose to explore and challenge those opinions.”\nCAA and the Board of Deputies called for the BBC to hand the caller’s details to police but the BBC said last month it had received no formal request from officers.\nPro-Israel website Israellycool noted the wider disgust at the transmission: “What’s shocking is not that people think this way, it’s that in today’s Britain they not only have no trouble expressing themselves, the BBC has no trouble devoting large amounts of air time to this.”","url":"https://www.breitbart.com/europe/2016/01/13/police-investigation-into-anti-semitic-bbc-caller-who-said-jews-rule-britain/"}
