{"authors":[],"date_download":"2018-10-30 20:37:42","date_modify":"2018-10-30 20:37:42","date_publish":"2014-08-27 20:44:28","description":"Atlanta police shot a man after he allegedly stabbed a Georgia State University officer Wednesday afternoon near Woodruff Park.","filename":"data/vaneerConsumption/PoliceshootmanwithknifenearWoodruffPark.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/08/27/Videos/3752185356001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_atlanta-police-shoot-m_8193bac7709a263feacd2438eb3a1660__1540931862.html","title":"Police shoot man with knife near Woodruff Park","title_page":"Atlanta News: Police shoot man with knife near Woodruff Park","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta police shot a man after he allegedly stabbed a Georgia State University officer Wednesday afternoon near Woodruff Park.\nThe wounded suspect was wielding an 8-inch butcher knife, which was recovered at the scene, Atlanta police homicide unit commander Capt. Paul Guerrucci said.\nAccording to messages on the GSU website, the officer was near the downtown university when the incident occurred. The officer was wounded in the back, according to Guerrucci, and transported to Grady Memorial Hospital. The officer is in stable condition.\nThe wounded suspect was also taken to Grady after being shot in the lower torso, Guerrucci said. He is also in stable condition.\nThe homicide unit is investigating the incident because it is an officer-involved shooting, Guerrucci said.\nThe incident began after an Atlanta police officer attempted to question a man who appeared to be drinking alcohol in the downtown park, according to department spokesman Officer John Chafee. The man did not respond to police inquires and walked in the direction of a plain clothes GSU officer, who was attempting to aid Atlanta police. As the man got closer to the GSU officer, he pulled out the large knife and wounded the officer.\n“An APD officer saw the threat to another person and stopped the threat,” Guerrucci said during a news conference.\nA witness who would not give his name told The Atlanta Journal-Constitution that the suspect was bothering a woman with a knife before the situation escalated.\n“It was justified, that’s all I want to say,” he said of the shooting.\nStudents were asked to stay away from the scene during the investigation, Atlanta police said.\nPolice are asking anyone with video of the incident to turn the footage over to them.\n—Photojournalist Ben Gray contributed to this report.","url":"https://www.ajc.com/news/atlanta-police-shoot-man-after-gsu-officer-stabbed-near-woodruff-park/8N1tetIag8qbjeiAjEUXMO/"}
