{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 00:01:46","date_modify":"2018-10-23 00:01:46","date_publish":"2016-01-28 13:21:35","description":"New Chief Constable Steve Ashman, pictured, is said to be keen for officers of Northumbria Police to take pride in their appearance - so the force has ordered 55 mirrors at a cost of £595.","filename":"data/vaneerConsumption/Policespend600onmirrorssostaffcanfeelmorePRIDEatwork.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30A80C2800000578-0-image-a-9_1453986879612.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420898_Mirror-mirror-wall-s-proudest-police-officer-Force-spends-600-mirrors-staff-feel-PRIDE-work_1540252906.html","title":"Police spend £600 on mirrors so staff can feel more PRIDE at work","title_page":"Police spend £600 on mirrors so staff can feel more PRIDE at work | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The expenditure comes as force plans to cut 430 jobs and close stations\nOfficers to carry the small mirrors with them to use before meeting public\nNew Chief Constable Steve Ashman is said to be keen for officers take pride in their appearance\nNorthumbria Police has invested almost £600 in new mirrors for its stations to promote officers' 'pride'.\nNew Chief Constable Steve Ashman is said to be keen for officers take pride in their appearance - so the force has ordered 55 mirrors at a cost of £595.\nThe force said in a reply to a Freedom of Information request: 'They are there to reinforce police officer and police staff standards and a sense of pride in policing.\n'They are to remind them to be proud to protect, to serve and to make a positive difference to the communities they work within.\n'While instilling a sense of pride in their appearance is a part of that, it is not restricted to uniform staff who work for the organisation.'\nOfficers are to use the 47 by 12-inch mirrors, which cost £10.83 each, to check their appearance before they meet the public.\nHowever, the outlay has not been welcomed by some.\nOne unnamed source told the Mirror: 'The idea has not gone down too well in some quarters.\n'We are losing so many officers and providing a few mirrors is not really going to help cut crime.\n'It smacks of image over substance.'\nThe force will cut 430 jobs and close stations to save £46million by 2017.\nIt has already lost more than 1,000 staff and reduced costs by £58million in a bid to cope with huge cuts in funding from Government.","url":"https://www.dailymail.co.uk/news/article-3420898/Mirror-mirror-wall-s-proudest-police-officer-Force-spends-600-mirrors-staff-feel-PRIDE-work.html"}
