{"authors":["Associated Press"],"date_download":"2018-10-23 02:37:10","date_modify":"2018-10-23 02:37:10","date_publish":"2016-01-28 17:29:00","description":"SEATTLE (AP) — A shooting at a Seattle homeless encampment that left 2 people dead and three others wounded appears to have originated with a drug-dealing di...","filename":"data/vaneerConsumption/PoliceDrugdisputelikelystartedSeattlehomelessattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:a31d1bca1eaa45559731bccd7c5c0a81-4vVdYopwYQ7f641721b07afb2b0c-801_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420618_Drug-dispute-likely-started-deadly-Seattle-homeless-shooting_1540262230.html","title":"Police: Drug dispute likely started Seattle homeless attack","title_page":"Police: Drug dispute likely started Seattle homeless attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police: Drug dispute likely started Seattle homeless attack\nSEATTLE (AP) — A shooting at a Seattle homeless encampment that left 2 people dead and three others wounded appears to have originated with a drug-dealing dispute, according to the police chief.\n\"The investigators feel strongly that's probably the case, but again we always have to keep open minds in this type of investigation,\" Chief Kathleen O'Toole said Wednesday.\nOfficials with the King County Medical Examiner's Office identified the 45-year-old woman killed as Jeannine L. Zapata, who is also known by the last name Brook. They identified the slain man as James Q. Tran, 33.\nCrime scene tape wraps around a pole at a homeless encampment known as The Jungle in Seattle on January 28, the day after two people were killed and three injured in a shooting there\nNo arrests have been made in the Tuesday evening attack. Police say they have eyewitnesses and believe at least two people were involved in the shooting.\nPolice said they believe the shooters weren't homeless and were acquainted with the victims. O'Toole said investigators have no evidence the people were targeted because they are homeless.\nIt was the second fatal attack at a homeless camp in Seattle within the past six months. In August, a homeless woman was beaten to death under a bridge and her husband was attacked.\nMayor Ed Murray and King County Executive Director Dow Constantine declared a state of emergency regarding homelessness in November, pledging more than $7 million to address the crisis.\nMurray said Wednesday significant parts of the homeless services system in Seattle and throughout the country are broken.\nShelter is provided for 2,000 people a night in Seattle, but Murray said it's not enough. He reiterated a call he made in November for help at the federal level.\n\"These are humans. And for the most part, they're not criminals,\" he said.\nO'Toole said police officers and social workers have been visiting other nearby homeless camps to reassure people that they are not in danger because of the shooting.\nThe conditions of the three wounded people continued to improve, with two in satisfactory condition. Their names have not been released.\n___\nInformation from: The Seattle Times, http://www.seattletimes.com\nOn Monday, three teen boys were arrested in connection to the death shooting. Above, the homeless encampment on Thursday, January 28\nJeannine Zapata, 45, and James Tran, 33, died of gunshot wounds; a man and two women were injured and continue to recover at the hospital. Above, a candle is lit near the scene on January 28","url":"https://www.dailymail.co.uk/wires/ap/article-3420618/Drug-dispute-likely-started-deadly-Seattle-homeless-shooting.html"}
