{"authors":["Breitbart London"],"date_download":"2018-10-30 22:00:57","date_modify":"2018-10-30 22:00:57","date_publish":"2017-03-06 17:40:48","description":"Poland's surprise counter-candidate to challenge incumbent Donald Tusk for the post of European Council head is \"Poland's only candidate in the game,\" the foreign minister said Monday.","filename":"data/vaneerConsumption/PolishCounterCandidatetoTuskOustedfromEuropeanParty.json","image_url":"https://media.breitbart.com/media/2017/03/wi/ap/06/1r7j0u8-e1488821923367.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_06__1540936857.html","title":"Polish Counter-Candidate to Tusk Ousted from European Party","title_page":"Polish Counter-Candidate to Tusk Ousted from European Party","title_rss":"NULL","source_domain":"breitbart.com","text":"Poland has proposed Jacek Saryusz-Wolski, 68, a center-right member of the European Parliament, to succeed fellow Pole Tusk, whose 2 ½-year term ends May 31. Saryusz-Wolski was expelled from the European People’s Party on Monday, two days after being removed from Poland’s Civic Platform party.\nHe lost standing in both groups because of his decision to challenge Tusk, who was Civic Platform’s founder and former leader.\nSaryusz-Wolski paved Poland’s 2004 accession to the EU and has been a European Parliament member since.\nA European Union summit on Thursday and Friday will decide on extending the mission of Tusk, who has voiced readiness to stay on and enjoys wide backing in the 28-nation bloc. But resistance from his own country might undermine his position. A general consensus for the post has been the EU tradition.\nPolish Foreign Minister Witold Waszczykowski declared that Saryusz-Wolski is “in the game.”\n“It’s obvious he is Poland’s candidate and must be taken into consideration,” he said, speaking before a foreign ministers’ meeting in Brussels. He added that Poland’s diplomats were “taking action” to garner support for the new candidate.\nThe conservative ruling team in Warsaw refuses to back a second term for Tusk, a former centrist Polish prime minister, saying he supports anti-government opposition in Poland and has failed to protect the country’s interests in the European Union. A long-standing political rivalry and animosity between the ruling Law and Justice party leader Jaroslaw Kaczynski and Tusk seems to be at the heart of the issue. Kaczynski accuses Tusk of contributing, through lax security, to the death of his twin, President Lech Kaczynski, in a plane crash in 2010.\nBut Poland might be isolated in this approach, even among closest allies.\n“It will be a serious mistake” if Central Europe loses its representative in such high position, said Czech Foreign Minister Lubomir Zaoralek, who added that Tusk understands the region’s interests.\nObservers say Saryusz-Wolski, although well known among EU leaders, stands no chance of getting the job, while the conflict risked bringing a representative of another country into the post.\nSaryusz-Wolski was removed Monday from the center-right EPP party, where he had been a member for about 26 years, and from the position of its vice president. The party backs Tusk’s re-election.\n“I deeply regret Saryusz-Wolski’s disloyalty and disrespect towards the unity and values of his own member parties,” EPP President Joseph Daul said in a statement following a meeting with the Pole.","url":"https://www.breitbart.com/europe/2017/03/06/polish-counter-candidate-tusk-ousted-european-party/"}
