{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 03:05:03","date_modify":"2018-10-23 03:05:03","date_publish":"2016-01-29 17:54:13","description":"A jury today found Pc Adrian Goldsmith, 49, guilty of killing his wife Jill Goldsmith. Mrs Goldsmith's body was found in their home near Northamptonshire Police headquarters last March.","filename":"data/vaneerConsumption/PoliceofficerAdrianGoldsmithbeatwifetodeathwithalargebatteryandpaintpot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B49A6C00000578-0-image-a-219_1454089573018.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423110_Decorated-police-officer-beat-wife-death-large-battery-paint-pot-went-sex_1540263903.html","title":"Police officer Adrian Goldsmith beat wife to death with a large battery and paint pot","title_page":"Police officer Adrian Goldsmith beat wife to death with a large battery and paint pot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A police officer has been found guilty of murdering his wife with a mallet, large battery and a paint pot.\nAdrian Goldsmith, 49, also known as Otis, was accused of killing Jill Goldsmith in the porch of their home next to Northamptonshire Police headquarters last March.\nAfter a three week trial, the jury at Stafford Crown Court returned a guilty verdict today.\nAdrian Goldsmith, 49, (left) has been found guilty of murdering his wife Jill Goldsmith at their home in Wootton Hall Park, Northampton\nMrs Goldsmith's body was found at the couple's semi-detached £140,000 home in Wootton Hall Park, Northampton, just yards from Northamptonshire Police HQ.\nGoldsmith was arrested on March 26 at the property following the discovery of his 49-year-old wife’s body. A post mortem concluded Mrs Goldsmith died of a head injury.\nGoldsmith was awarded a Police Long Service and Good Conduct Medal by the force in 2009 when he was a Detective Constable. At the time of his arrest he was a Police Constable after volunteering to return to uniform.\nDuring the trial, Stafford Crown Court heard a 999 call he made claiming his wife attacked him. In the recording, Goldsmith said: 'My wife tried to kill me, I think she's dead.'\nWhen officers arrived at their home on March 26 last year they found Goldsmith, who had served in the police force for 28 years, holding a smashed drinking glass and a knife.\nIn interview Goldsmith said his wife had come at him with the knife 'like a whirling dervish' and stabbed him.\nThe court heard the couple, who married in May 2014, had problems including Jill's 'lack of sex drive caused by her starting the menopause'.\nWhen officers arrived at the Goldsmith's home on March 26 last year they found Goldsmith holding a smashed drinking glass and a knife and found the body of his wife Jill (right), in the porch\nProsecutor John Lloyd Jones QC said: 'Jill was undergoing the menopause and the reduction in her sex drive was something that annoyed and frustrated the defendant.'\nThe court also heard Goldsmith, who has three children from a previous marriage, told officers he was forced to defend himself against her, saying he felt it was 's*** or bust.'\nAdrian Goldsmith, who had been in the police force for some 28 years, told officers he acted in self-defence\nMr Jones told the court that in 2012, the Professional Standards Department investigated Goldsmith on suspicion of misconduct - after which he went on long term sick leave due to stress.\nMr Jones added: 'Adrian Goldsmith enjoyed drinking alcohol. Unfortunately, his personality changed when he was drinking and this made Jill feel afraid of him.\n'Not being able to have a drink was another source of annoyance for him. He also wasn't allowed to see two of his children from a previous relationship, which was a further cause of upset.'\nThe court was also told Goldsmith was in the habit of writing long letters addressed to himself or his wife in which he would micro-analyse events. The letters were said to be 'all very self-absorbed', with one detailing how he felt he was 'ready to explode' and feared what he might do in such circumstances.\nMr Jones said when officers arrived at the house, they found Mrs Goldsmith 'lying in a pool of blood'.\nHe added: 'They saw [Adrian Goldsmith] behind the porch door. He was holding a small kitchen knife in one hand and a broken drinking glass in the other. He had fresh and dried blood on his face and appeared to have suffered facial injuries.\n'He had blood and black paint on his clothing and was sweating, crying and out of breath.\n'He told them his wife had come at him. He told them she was on drugs and psychotic and had attacked him with a glass and a knife. He said she wouldn't drop it and he had killed her.'\nAfter his arrest, Goldsmith is said to have told detectives he and his wife had argued because of her cannabis smoking.\nHe said she threw a glass at him before punching and kicking him.\nPolice at the scene of the murder at the Goldsmith's home in Wootton Hall Park, Northampton\nMr Jones said: 'He bizarrely claimed she then picked up a mallet and hit herself on the back of the head with it. He said she then banged her own head hard off a nearby wall. He said he put her in a headlock to protect her but she broke free.\n'He said she started to stab him, then they struggled and fell over. He remembered getting hit in the head with a volt box-type battery. He tried to put her in a sleeper hold and as they fought the knife had gone between his legs. He described this as \"a game-changer\".\n'He hit her in the head with a can of paint. He said this had no effect so he picked up the battery and hit her in the head as hard as he could.'","url":"https://www.dailymail.co.uk/news/article-3423110/Decorated-police-officer-beat-wife-death-large-battery-paint-pot-went-sex.html"}
