{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:23:05","date_modify":"2018-10-30 18:23:05","date_publish":"2015-02-24 13:39:11","description":"Indiana Gov. Mike Pence (R) is still considering a bid for the 2016 GOP presidential nomination, says Politico. |","filename":"data/vaneerConsumption/PoliticoIndianaGovMikePenceStillConsidering2016Run.json","image_url":"https://media.breitbart.com/media/2015/01/AP249836808015.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_24__1540923785.html","title":"Politico: Indiana Gov. Mike Pence Still Considering 2016 Run","title_page":"Politico: Indiana Gov. Mike Pence Still Considering 2016 Run | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Indiana Gov. Mike Pence (R) is still considering a bid for the 2016 GOP presidential nomination, says Politico.\nPence, who was in Washington, D.C. over the weekend for a meeting of the National Governors Association (NGA), said he would not likely decide about whether to run for president until the end of April at the earliest.\nBecause of an Indiana law that will not allow an individual to run for both a state office and a federal office at the same time, Pence would have to decide whether to run for re-election as governor, or for president.\nAs the Indianapolis Star reported in December, state Sen. Mike Delph (R) had submitted a bill that would help clear the way for Pence to seek two offices at once.\n“I think it’s good for the state of Indiana to have a sitting governor in the national conversation and because of that I think it’s in our interest to make the obstacles and roadblocks for Pence as minimal as possible,” Delph said at the time, but then withdrew the bill in January.\n“I can tell you: I’m a very focused person,” Pence told Politico. “We’ll spend some time this spring deciding on where our focus should be, and that will be our focus.”\n“Our legislative session ends on April 29, and I’m completely focused on passing another honestly balanced budget, a balanced budget amendment and a robust education agenda,” said Pence, who served six terms in the U.S. House before his election as governor.\nPence said he has lowered the unemployment rate in his state from 8 to 5.8 percent, and led the country in manufacturing jobs last year.\n“So there are 49 governors who wish they could be me,” he added.\nWhen asked about issues he might be concerned about should he run for president, Pence responded that he takes one step at a time.\n“I don’t really think of it that way,” he said. “I’m an A-to-B, B-to-C, C-to-D guy.”\nConservatives who have been fighting against the Common Core standards in Indiana, however, have perhaps remained a step ahead of Pence after he signed a repeal of the controversial standards but then facilitated a “rebrand” of the same standards, save for a few tweaks. Because the Hoosier state’s “new” standards were not much different from the Common Core, Pence was still able to receive a waiver from the federal No Child Left Behind law.\n“For all Pence’s claims of federalism, his signature legislation removing Indiana from the Common Core required the new standards to ‘comply with federal standards to receive a flexibility waiver,’” grassroots organizer Erin Tuttle of Hoosiers Against Common Core told Breitbart News at the time, quoting from the legislation that had Indiana abandon the Common Core. “His Hoosier process was predicated on satisfying the federal government, thus resulting in a rebrand of the Common Core.”\nAdditionally, last month more than 40 conservative groups in the state signed onto an agenda for education reform that was submitted to Indiana lawmakers. Among the coalition’s top issues was cutting regulations for schools that agree to accept school choice vouchers and the freedom to reject the state’s rebranded Common Core-aligned standards.\nPence is reported to have turned Indiana’s school choice initiative into the most extensive in the nation, and is now planning to expand school choice for preschool as well, and to obtain more state funding for charter schools.\nNevertheless, according to the coalition, while Indiana has the largest school voucher program in the country, the state has also been ranked as the second-worst state in the nation for restricting the freedom of private schools due to the voucher program’s many regulations.\nRecently, another issue that plagued Pence was the report by the Indianapolis Star that the governor planned to launch a state-run news service called “Just IN.”\n“A state-run, taxpayer funded news organization designed to compete with independent news outlets is a shocking development to many rank and file conservatives,” Dave Read of the Central Indiana Coalition of Tea Parties told Breitbart News in January. “To think it will be anything but a well crafted PR machine for the Governor’s Presidential aspirations is naive. Instead of naming it ‘Just In’ he might as well call it ‘Pravda’ and call it a day.”\nPence ended up killing the state news site idea after he said on radio he only learned about it when he read it in the newspaper.","url":"https://www.breitbart.com/politics/2015/02/24/politico-indiana-gov-mike-pence-still-considering-2016-run/"}
