{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-22 23:58:31","date_modify":"2018-10-22 23:58:31","date_publish":"2017-04-26 09:01:38","description":"A school in Basildon has warned parents about the challenge after talks with Essex Police. The game has been linked to the death of Russian teen Yulia Konstantinova (pictured).","filename":"data/vaneerConsumption/PolicewarnBlueWhalesuicidegameisheadingtotheUK.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D678300000578-0-image-a-25_1493194118951.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446556_Police-warn-Blue-Whale-suicide-game-heading-UK_1540252711.html","title":"Police warn Blue Whale 'suicide' game is heading to the UK","title_page":"Police warn Blue Whale 'suicide' game is heading to the UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Parents have been warned about a 'suicide game' linked to the death of 130 teenagers in Russia amid reports that it has made its way to the UK.\nA school in Basildon says it has been told about the Blue Whale challenge following talks with Essex Police.\nThe game encourages youngsters to complete a series of challenges over 50 days, ranging from waking up in the night to cutting themselves.\nOn the final day of the sick challenge, they are then instructed by their 'masters' to commit suicide.\nThe deaths of Yulia Konstantinova, 15, pictured left, and Veronika Volkova, 16, right, were connected to the challenge in Russia\nThe game encourages youngsters to complete a series of challenges, including cutting themselves or carving symbols into their bodies\nThe social media 'game' is being investigated by police in Russia in relation to dozens of teenage suicides, and now police in Britain are reaching out to schools.\nThe headteacher of Woodlands School in Basildon reached out to parents in a letter seen by Essex Live.\nIt read: 'We have discovered a game through the police that we feel you should be aware of.\n‘It is called The Blue Whale Game and is played via many social media platforms. Players are given a master who controls them for 50 days and each day they are given a task to complete.\n'On the 50th day the masters behind the game instruct the young people to commit suicide and sadly across the world some have done this.'\nYulia (pictured) and Veronika fell to their deaths from the roof of an apartment block in industrial Ust-Ilimsk\nLast month, Devon and Cornwall Police PCSO Kirsty Down posted an online warning to alert parents about the challenge\nPolice officers in Britain have previously posted online warnings to alert parents about the challenge.\nLast month, Devon and Cornwall Police PCSO Kirsty Down posted on Twitter: 'Who ever created this horrible game is sick!\n'Parents: Please be aware of this \"game\" talk to your children about it if concerned.'\nPanic over the online challenge was prompted by the death of two teenagers in Russia in February.\nYulia Konstantinova, 15, and Veronika Volkova, 16, fell to their deaths from the roof of an apartment block in industrial Ust-Ilimsk.\nMeanwhile a girl named only as Ekaterina, 15, was critically injured after she fell onto snowy ground from a flat in the city of Krasnoyarsk.\nJust two days beforehand a 14-year-old girl from Chita was reported to have thrown herself under a commuter train.\nYulia had earlier posted a picture with big blue whale, seen as a symbol of a social media movement encouraging children to take their own lives\nIn all cases state investigators are probing whether a controversial web 'suicide game' has influenced the girls to seek to take their lives.\nYulia left a note saying 'End' on her social page and earlier she had posted a picture with big blue whale. Her friend Veronika wrote: 'Sense is lost... End.'\nIt was reported that two teenage boys were detained by police at the scene after allegedly filming the double suicide.\nIn the Chita case, transport police confirmed that the so-called suicide game 'Blue Whale' is seen as a possible 'cause of death'.\nA second girl had made plans to kill herself with the dead teenager, but changed her mind at the last moment.\nTeenagers are urged to use a knife or razor to make the shape of a whale on their wrist or leg, say Russian reports.\nThey are also urged to watch horror movies all day, and to wake themselves at 4.20am.","url":"https://www.dailymail.co.uk/news/article-4446556/Police-warn-Blue-Whale-suicide-game-heading-UK.html"}
