{"authors":["Associated Press"],"date_download":"2018-10-23 01:55:56","date_modify":"2018-10-23 01:55:56","date_publish":"2017-03-10 10:24:08","description":"KUALA LUMPUR, Malaysia (AP) - North Korea's soccer match against Malaysia to open a 2019 Asian Cup qualifying group has been postponed because of political...","filename":"data/vaneerConsumption/PoliticaltensionpostponesNKoreaMalaysiasoccermatch.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/10/wire-195345-1489141454-616_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300704_Political-tension-postpones-NKorea-Malaysia-soccer-match_1540259756.html","title":"Political tension postpones NKorea-Malaysia soccer match","title_page":"Political tension postpones NKorea-Malaysia soccer match | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KUALA LUMPUR, Malaysia (AP) - North Korea's soccer match against Malaysia to open a 2019 Asian Cup qualifying group has been postponed because of political fallout from the death of Kim Jong Un's half-brother in Kuala Lumpur.\nThe Asian Football Confederation says it is looking for a new date to play the match scheduled for March 28 in Pyongyang.\nIt's unclear if a neutral venue could be used.\nMalaysians protest outside the North Korean Embassy in Kuala Lumpur, Malaysia Friday, March 10, 2017. They were protesting the rising tensions between Malaysia and North Korea following the killing of Kim Jong Nam, the half brother of North Korean leader Kim Jong Un, at Kuala Lumpur International Airport on Feb. 13, 2017. (AP Photo/Daniel Chan)\nKim Jong Nam, the half-brother of North Korea's leader, was attacked with a nerve agent at a Malaysian airport on Feb. 13. Authorities investigating the death banned North Korean Embassy officials and staff from leaving the country, after North Korea barred all Malaysians exiting its territory.\nNorth Korea and Malaysia are in a four-team group. Two advance to the 2019 tournament in the United Arab Emirates.","url":"https://www.dailymail.co.uk/wires/ap/article-4300704/Political-tension-postpones-NKorea-Malaysia-soccer-match.html"}
