{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:31:00","date_modify":"2018-10-30 18:31:00","date_publish":"2016-02-09 09:19:04","description":"A new poll has claimed that Brits are the most likely in Europe to regard their national press as \"right wing\", despite the other six countries named in |","filename":"data/vaneerConsumption/PollFindsBritainsPressIsMoreRightWingThanSixMASSIVELYLeftWingCountries.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-500588114.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_09__1540924260.html","title":"Poll Finds Britain's Press Is More Right Wing Than Six MASSIVELY Left Wing Countries","title_page":"Poll Finds Britain's Press Is More Right Wing Than Six MASSIVELY Left Wing Countries | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new poll has claimed that Brits are the most likely in Europe to regard their national press as “right wing”, despite the other six countries named in the poll being highly left wing in their politics, media, and culture.\nSwedes and Germans were the most likely to regard their media as “left wing” in a YouGov poll examining the views of citizens in seven major European nations: Britain, France, Germany, Sweden, Norway, Denmark and Finland.\nThe survey asked participants whether they think their state’s media coverage of five key issues is too right-wing, left-wing or balanced. More Britons found their press to be “balanced” than “right wing” though this didn’t stop left-leaning news outlets like the Independent from attacking Britain’s “right wing papers”.\nPolicy areas examined were immigration, health, economics, housing and crime.\nBetween 25 percent and 33 percent of Brits think British media coverage of these issues is reasonably balanced. A higher number only thought the country’s press was more “right wing” on immigration – despite the BBC’s obsession with migration guilt trips, and the media-wide insistence on using the phrase “refugees” to describe all migrants into Europe.\nDanes seemed to perceive their press as pretty much balanced, however the Swedes and Germans were under the impression that their media was severely skewed to the left.\nDespite the public perception in the Britain, an analysis in 2013 found statistical evidence for left-wing bias at the BBC. It found that in only 10 per cent of reports on stories by left-wing think tanks did the BBC qualify the findings with a ‘health warning’ about the think tank’s views, ideological position, or connection to a political figure.\nIn the past few months Breitbart London has reported on how the press and media in the UK have attempted to skew the debate on the migrant crisis in particular, giving unfettered access to outlets to open borders campaigners, and taking their “lines” on issues like “refugee wristbands” and “Nazi red doors“.","url":"https://www.breitbart.com/europe/2016/02/09/brits-think-their-press-is-the-most-right-wing-in-europe/"}
