{"authors":["Neil Munro"],"date_download":"2018-10-30 19:04:58","date_modify":"2018-10-30 19:04:58","date_publish":"2016-11-08 04:09:44","description":"Donald Trump is two points ahead of Hillary Clinton in the critical state of Pennsylvania, according to a new poll from the Trafalgar Group. | Politics","filename":"data/vaneerConsumption/PollsterSaysDonaldTrumpAheadinPennsylvaniaMichigan.json","image_url":"https://media.breitbart.com/media/2016/08/Trump-Rally-Mechanicsburg-Pennsylvania-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_07__1540926298.html","title":"Pollster Says Donald Trump Ahead in Pennsylvania, Michigan","title_page":"Pollster Says Donald Trump Ahead in Pennsylvania, Michigan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump is two points ahead of Hillary Clinton in the critical state of Pennsylvania, according to a new poll from the Trafalgar Group.\nTrump is at 48.4 percent, she is at 46.5 percent, according to the poll from the little-known polling firm, which is also spotlighting evidence that Trump has hidden support from an additional 3 percent to 9 percent of voters who don’t want to reveal their true opinions.\nBreitbart News asked Trafalgar’s CEO why readers should trust the firm’s predictions amid so many other polls that show Trump lagging Clinton by 2 percent in the critical state.\n“On Wednesday, I’m either going to be guy who got it right, or nobody is going to listen to me any more,” responded company CEO Robert Cahaly. “That’s why … [and] I take this craft seriously,” he told Breitbart News. In effect, the company is betting its future by publicly testing — at its own expense — its own methods.\nCahaly said his polls are designed to capture opinions from people who otherwise avoid lengthy interviews on the phone. That’s difficult under normal circumstances, but it is especially difficult when many people are reluctant to pick a side in this hard-fought election.\nHe keeps his questionnaires limited to a minute or two, relies mostly on computer-delivered phone questionnaires and he probes for hidden preferences by asking people who their neighbors are supporting. That question about neighbors allows respondents to present their preferences as the opinion of others, so minimizing possible fear of stigma or embarrassment for supporting Trump. In Pennsylvania, the “neighbors” question boosts Trump’s score by 4.4 points, up to 52.8 percent. Similarly, Clinton’s score drops from 46.5 percent down to 40 percent. That shift converts a 2-point gap into a 12-point valley. The poll was conducted Nov. 3 to Nov. 45, with 1,300 respondents.\nThe firm conducted similar polling in Michigan on Nov. 6, where the panel of 1,200 respondents shows a 2-point Trump lead, 48.5 percent to 46.8 percent. Michigan’s “neighbor question” showed a 3.6 percent boost for Trump, giving him a 12.3 point advantage.\nWhen quizzed by Breitbart News about the reliability of a “hidden vote,” Cahaly offered several arguments for its existence.\nHis said his surveys during the primaries were unusually accurate, and also revealed hidden support for Trump, he said. The support was revealed when respondents were asked to respond to a computerized voice on the phone, versus when talking to a live person. “We did live callers and push-button [telephone polls] and we determined there was always a 4.5 point bounce for Trump [with computerized polls],” he said.\nHe says the people most likely to hide their votes are women and college-educated professionals, matching evidence from other polls.\nWhenever he asks the neighbors question, the answers consistently show a hidden vote for Trump worth three to nine points, said Cahaly.\nThe question never exposes hidden support for Clinton, which would appear if there is a bipartisan and equal reluctance to reveal voting preference. “In most [political] races, the change is usually lower than 2.5 points, and the candidate who is benefitting from the hidden vote goes up, but the other candidate goes not go down,” he said. In this 2016 race, Clinton never gains points, and also goes down when Trump gains points, he said.\n“I believe that is happening because the Trump campaign is different from other campaigns … not just the candidate is being attacked, his supporters are being attacked,” he said. “When is the last time in a presidential race when the candidate’s supporters are called ’deplorable,’ ’racist,’ ’ignorant‘?”\nThis race is also different because so many voters are disgusted at Washington and want to send a message, regardless of the candidate, he said. “They’re voting against the system… they want to send a message …. to the system that has done them wrong [so the election] is their middle finger,” he said.\nMany polls are inaccurate, partly because many things change during a political campaign. Estimated turnout, voting patterns and issues change from day-to-day. The changes force pollsters to constantly tweak their polls during a campaign, and the changes ensures that collections of polls can be way off from the final results.\nThe polling errors are also very different from state to state. For example, pollsters in 2012 overestimated GOP support in Michigan, but underestimated support in North Carolina and Florida.\nReminder of where public polling error occurred in 2012. Colorado/Nevada, but also Michigan which always has public poll problems. RCP data: pic.twitter.com/FOFTHeheBe — Nick Gourevitch (@nickgourevitch) November 5, 2016\nThere is some evidence that the public’s willingness to openly declare support for Trump has changed over time. For example, the Huffington Post’s poll-tracking site showed that Trump did better early in the campaign with live-caller polls, but is now performing equally well with Internet polls.\nTrafalgar is the target of much criticism from other pollsters, for example, for understating the likely African-American and Latino turnout in Nevada, in a race it predicts Trump to win, 49.6 percent to 45 percent. That poll was conduct Nov. 1 to Nov. 4.\n.@stevesingiser\nTrafalgar: 77% white, 13% Latino, 3% black\n2012 Exits: 64% white, 19% Latino, 9% black — David Williams (@dznyc) November 6, 2016\nIn his Pennsylvania poll, Trafalgar predicted that 83 percent of the electorate would be white, 10 percent would be black and 4 percent would be Latino. Gravis Marketing, in contrast, predicts a turnout of 80 percent white, 11 percent African-American and 7 percent Hispanic.\nCahaly’s Michigan poll assumes at turnout that is 85 percent white, 10 percent black and 2 percent Latino. Gravis Marketing predicts 79 percent white, 16 percent black and 4 percent Latino.\nThe company’s future is riding on the accuracy of its polls, Cahaly said. “We looked at this as an investment in showing people that we know what we’re doing … let the market judge.”\nThe Pennsylvania poll is here. The Michigan poll is here.","url":"https://www.breitbart.com/politics/2016/11/07/poll-trump-michigan-pennsylvania/"}
