{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:16:46","date_modify":"2018-10-30 22:16:46","date_publish":"2016-09-07 22:18:54","description":"California Attorney General Kamala Harris could run away with a massive win in the Democrat-on-Democrat race to replace Barbara Boxer.","filename":"data/vaneerConsumption/PollKamalaHarrisFarAheadinCaliforniaSenateRace.json","image_url":"https://media.breitbart.com/media/2015/11/Kamala-Harris-Stan-Honda-AFP-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_07__1540937806.html","title":"Poll: Kamala Harris Far Ahead in California Senate Race","title_page":"Poll: Kamala Harris Far Ahead in California Senate Race","title_rss":"NULL","source_domain":"breitbart.com","text":"If the November election were held today, California Attorney General Kamala Harris could run away with a massive win in the Democrat-on-Democrat race to replace longtime, and now retiring, Democrat Sen. Barbara Boxer, according to a new poll from California Counts.\nEstablishment-anointed Harris is leading by 32 points against her rival, Rep. Loretta Sanchez, in the new poll taken August 15-24, according to KPCC public radio. More respondents were undecided in the race, 25 percent, than expressed support for Sanchez, at 19 percent. Six percent stated support for “Someone Else,” despite the lack of a third non-Democratic candidate, thanks to California’s top-two or “jungle” primary system.\nHarris leads Sanchez in almost every political, ethnic, income, education, age and gender demographic — and usually by wide margins. They are even tied among Latinos, with each receiving 33 percent of that demographic. 18-24 year olds have the highest percentage of “undecided” voters, with 45 percent yet to make a decision.\nBucking the usual political survey of “likely voters,” Kim Nalder, the CALSPEAKS Opinion Research Center political director who conducted the poll, told KPCC that the poll was geared to give a broader view of California residents. The online and mail survey yielded 915 completed responses. KPCC reported, “CALSPEAKS obtains a representative sample of Californians, stratified by the five major regions in the state.” It was not clear what population the sample of Californians was drawn from, and a link in the KPCC report for information on the survey’s methodology was broken.\nHarris has run from Sanchez’s demands for four debates, agreeing to just two, according to the Los Angeles Times. With the two debating over debates, they appear to have yet only agreed upon one, on October 5. Sanchez has opposed a September 20 debate to which Harris has agreed, which would be held in Sacramento. Sanchez consultant Bill Carrick criticized the Sacramento location, which is contained in the same media market as a primary election debate that was held in Stockton. Carrick suggested another location, such as the Bay Area.\nHarris holds endorsements from President Barack Obama, Vice President Joe Biden, California governor Jerry Brown, and 13 members of Congress, along with a host of other labor and Democratic organizations and scores of state legislators.\nPBS commentator Gwen Ifill once called Harris “the female Barack Obama” during an appearance on David Letterman’s now-defunct late night show.\nKPCC is one of four public media organizations involved in California Counts, the station stated in its report on the new poll. The four media groups partnered with CALSPEAKS at Sacramento State in the survey.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2016/09/07/kamala-harris-poll-way-ahead-california-counts/"}
