{"authors":["Matthew Boyle"],"date_download":"2018-10-30 22:17:20","date_modify":"2018-10-30 22:17:20","date_publish":"2016-10-03 11:28:35","description":"The poll, from the Albuquerque Journal, shows Clinton leading Trump 35 percent to 31 percent, with the state’s former governor Libertarian Gary Johnson pulling 24 percent and two percent for Green Party candidate Dr. Jill Stein just over a month from election day. | Politics","filename":"data/vaneerConsumption/PollNewMexicoWithinMarginofErrorinLatestPoll.json","image_url":"https://media.breitbart.com/media/2016/09/GettyImages-606983298.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_03__1540937840.html","title":"Poll: New Mexico Within Margin of Error in Latest Poll","title_page":"Poll: New Mexico Within Margin of Error in Latest Poll | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"DENVER, Colorado — The latest poll in New Mexico shows Hillary Clinton leading Donald Trump by just four points in that state.\nThe survey, from the Albuquerque Journal, shows Clinton leading Trump 35 percent to 31 percent, with the state’s former governor Libertarian Gary Johnson pulling 24 percent and two percent for Green Party candidate Dr. Jill Stein just over a month from election day.\nThe poll of 501 likely New Mexico voters, conducted from Sept. 27 to Sept. 29, has a margin of error of 4.4 percent. That means Trump is statistically tied with Clinton in a state that hasn’t gone Republican since 2004 when incumbent GOP president George W. Bush eked out a victory there over Democratic candidate John Kerry. The last time the state went more than 50 percent for a Republican was in 1988 when George H.W. Bush won nearly 52 percent of the vote there. Ronald Reagan, in both 1980 and 1984 in his reelection, won the state comfortably with nearly 55 percent of the vote the first time and nearly 60 percent the next time.\nTrump is about to hit the road out west with a swing through Colorado on Monday along with stops down in Arizona and Nevada over the coming days. Campaign sources tell Breitbart News he is considering adding a New Mexico campaign stop on his western surge trip, and recent reports have surfaced that the Trump campaign is actively spending in New Mexico.\nThe Research & Polling, Inc., president Brian Sanderoff tells the Albuquerque Journal, “The bottom line is that New Mexico is more competitive than I expected.”\nWhat’s more, this poll confirms that the third party candidates—Johnson and Stein—are pulling more from Clinton than they are from Trump.\n“When the third-party candidates – Johnson and Stein – were removed from the Journal poll and voters were asked who they preferred in a head-to-head matchup between Trump and Clinton, Clinton’s lead increased from four points to 10 points,” the Albuquerque Journal wrote. “Forty-four percent of likely New Mexico voters voiced a preference for Clinton compared to 34 percent who favored Trump when the polling question included only those two candidates.”\nHispanic voters don’t like Clinton, and are gravitating in large part toward Johnson. That, in turn, hurts the Democratic nominee, Sanderoff says.\n“Johnson is picking up Hispanic support, and that is what is keeping Hillary Clinton down,” he said.\nClinton doesn’t even hit 50 percent with Hispanics.\n“Still, Clinton holds a solid lead over Trump among Hispanics in New Mexico, according to the poll. Forty percent of Hispanics said they would vote for Clinton while 18 percent said they would vote for Trump. Stein polled at zero percent support among Hispanics in New Mexico,” the newspaper wrote. “Sanderoff said Clinton needs more support among Hispanics to count on victory in New Mexico.”\nSanderoff said that Clinton’s horrendous showing with Hispanic voters in New Mexico is tearing her down.\n“The Democratic candidate needs to be getting much more than 40 percent of the Hispanic vote to win New Mexico comfortably,” he said.\nAs Breitbart News has already reported, assuming Trump can keep Georgia and Arizona locked in, his polling lead in several other states—Florida, Ohio, Nevada, Iowa, Maine’s second congressional district and now Colorado—would put him at 275 electoral votes. Now that states like New Mexico and Minnesota—where a recent Breitbart News Network/Gravis Marketing survey showed Clinton and Trump tied—are in play, Trump’s pathway to the White House is widening even more. He’s competitive in places like Pennsylvania, Michigan, Wisconsin, New Hampshire, Virginia, statewide in Maine, and has had strong showing in recent surveys in places like Rhode Island and Vermont.","url":"https://www.breitbart.com/politics/2016/10/03/poll-new-mexico-within-margin-of-error-in-latest-poll/"}
