{"authors":["Tony Lee"],"date_download":"2018-10-30 18:49:49","date_modify":"2018-10-30 18:49:49","date_publish":"2014-08-20 11:34:00","description":"A blockbuster new poll obtained by Breitbart News reveals that a majority of likely voters want to push the pause button on massive immigration, similar |","filename":"data/vaneerConsumption/PollVotersWantImmigrationPauseMoreEnforcementPreferenceGiventoUSWorkers.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2013/Immigration/no-amnesty-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_08_20__1540925389.html","title":"Poll: Voters Want Immigration 'Pause,' More Enforcement, Preference Given to US Workers","title_page":"Poll: Voters Want Immigration 'Pause,' More Enforcement, Preference Given to US Workers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A blockbuster new poll obtained by Breitbart News reveals that a majority of likely voters want to push the pause button on massive immigration, similar to what occurred between 1915-1964, which allowed legal immigrants a chance to more fully assimilate while the middle class expanded as wages increased.\nAs President Barack Obama considers giving more guest-worker permits to companies that have laid off American workers and granting temporary work permits and executive amnesty to millions of more illegal immigrants, a comprehensive survey from Kellyanne Conway’s The Polling Company found that a majority of likely voters want even fewer legal immigrants. The poll found that “half of Americans age 65 and over” and 46% of Midwesterners support a zero immigration policy. Furthermore, “independents (47%) were more likely than Republicans (40%) or Democrats (37%) to want zero new immigrants allowed into the country.”\nThe survey, which polled 1,001 likely voters from July 16-20, also revealed that an overwhelming majority of Americans want more enforcement of the country’s immigration laws and employers to give preference to U.S. citizens over legal and illegal immigrants when hiring. For instance, “90% of likely voters feel that “U.S.- born workers and legal immigrants already here should get first preference for jobs.” Even among likely voters who think that illegal immigration laws are enforced “too much,” 67% believed that jobs now held by illegal immigrants should go to American workers. Among those who favor legal status for illegal immigrants, that number is 80%. And even among those who favor a pathway to citizenship for illegal immigrants, 61% feel that Americans should be employed in jobs that illegals currently have.\nWhen asked whether Americans should compete for jobs illegals are doing, 83% of whites agreed while 12% disagreed. Among blacks, 73% agreed while 22% disagreed, and among Hispanics, 73% agreed while 21% disagreed. When asked what U.S. businesses that are having trouble finding workers should do, 75% felt they should “raise wages and improve working conditions to attract Americans” instead of importing more immigrant workers–including 73% of whites, 83% of blacks, 71% of Hispanics, 74% of Republicans, 79% of Democrats, and 74% of independents. On top of that, 80% believed that U.S. businesses should try harder to “recruit and train more American workers from groups with the highest unemployment levels, rather than allowing them to bring in more immigrant workers.”\nAfter over 60,000 illegal immigrant juveniles, lured by Obama’s executive amnesty, have flooded across the border since October of last year, “75% want more enforcement of current immigration laws, including 63% of Hispanics and over 50% of Democrats.” Consistent with other public surveys, 60% believed that “sending these children back to their home countries will convince parents to stop sending their children to the U.S. border,” and even “a majority of those who do not see immigration as a top ten issue want illegals returned home.”\nAs for Obama’s potential executive amnesty, 74% of respondents, including 81% of independents and 75% of moderates, reject it. Another 67%, including 64% of union members, believe that benefits and access to jobs for illegal immigrants should be reduced to compel illegal immigrants to return to their home countries and a majority across party lines want chain migration to be “limited to only spouses and minor children of legal immigrants.”\nA majority also recognized that plenty of Americans want to do jobs they are told they supposedly “won’t do.” For instance, “58% agree that there are plenty of Americans to do construction and service industry jobs, with no need for increased immigration to fill them.” America has a surplus of both high-tech and low-skilled workers, and the poll found that 75% of likely voters believe that green cards “should be given to 100,000 or fewer immigrants per year.”\nAmericans also do not have much tolerance for allowing illegal immigrants to stay. When asked if “adult foreign citizens who came to the U.S. on vacations, as students or temporary workers, and stayed past the date of expiration on their visas,” should be allowed lifetime work permits and legal status in the United States, 76% said they should not be allowed while 18% said they should. When likely voters were asked about “illegal immigrant children who have been sent alone by their parents,” 27% said they should be while 66% said they should not be allowed. When asked about “adult foreign citizens who crossed the U.S. border illegally” should be allowed to remain, 15% said they should be while 79% said they should not be allowed.\nConsistent with other polling, two-thirds of Americans disapprove of Obama’s handling of immigration and 18% of Americans said immigration was their most important issue while “another 39% put it among the top three.”\nAmerica’s view of illegal and legal immigration may be influenced by declining wages for middle-class workers. The median household income for Americans has decreased since 2009, and the workforce participation rate is at a nearly four-decade low. The recession decimated American workers, and minorities have been hit particularly hard. After the Congressional Budget Office determined that the Senate’s comprehensive amnesty bill would lower the wages of American workers, U.S. Civil Rights Commissioner Peter Kirsanow noted that black Americans would be disproportionately impacted by it and any more grants of amnesty.\nTo further complicate matters for American workers, all of the gains in net employment since 2000 have reportedly gone to immigrants, according to a recent Center for Immigration Studies report. Perhaps because of all of these factos, a Reuters poll found that 70% of Americans, including 86% of Republicans, believe illegal immigrants “threaten traditional U.S. beliefs and customs,” while 63% believe that “immigrants place a burden on the economy.” In that poll, 45% wanted “less legal immigration at this time” when the U.S. already has a record number of immigrants, according to Pew Research.\nAmericans may be more in favor of hitting the pause button if they had a better understanding of how many immigrants the country already admits on an annual basis. The country admits over 1 million legal permanent residents and roughly 700,000 guest workers per year. But according to one analysis of polling data, 41% of Americans actually think the country accepts “500,000 or fewer immigrants” per year, which Numbers USA noted was “more in line with traditional immigration norms prior to the mid-1960s,” Another 41% of Americans aren’t even sure how many immigrants enter the country each year.\nhttp://www.pewhispanic.org/2013/01/29/a-nation-of-immigrants/","url":"https://www.breitbart.com/politics/2014/08/20/poll-voters-want-immigration-pause-more-enforcement-preference-given-to-us-workers/"}
