{"authors":["Caroline May"],"date_download":"2018-10-30 18:23:52","date_modify":"2018-10-30 18:23:52","date_publish":"2015-12-21 15:36:01","description":"Additionally the percentage of nonwhite people who viewed the police as ethical and honest increased from 23 percent in 2014 to 40 percent.","filename":"data/vaneerConsumption/PollAmericansFaithinHonestyEthicsofPoliceImproves.json","image_url":"https://media.breitbart.com/media/2015/12/Police-file-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_21__1540923832.html","title":"Poll: Americans’ Faith in Honesty, Ethics of Police Improves","title_page":"Poll: Americans’ Faith in Honesty, Ethics of Police Improves | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Americans’ faith in the honesty and ethics of the police is improving, according to a new Gallup poll.\nGallup reports that after dropping to 48 percent in 2014 — from 54 percent and 58 percent between 2010 and 2013 — this year Americans 56 percent of Americans said they would rate the honesty and ethics of police as either “high” or “very high.”\nAdditionally the percentage of nonwhite people who viewed the police as ethical and honest increased from 23 percent in 2014 to 40 percent this year. Whites, meanwhile, remain relatively consistent compared to last year with confidence improving from an already higher 58 percent to 64 percent this year.\nAs the polling outfit notes, last year nonwhite Americans’ negative views of the police were a central factor in the decline of law enforcement’s ratings, when they fell from 45 percent to 23 percent in a single year.\nThe year 2014 saw police under intense scrutiny for perceived racial targeting following the deaths of two unarmed black men in Ferguson, Missouri and Staten Island, New York. While the conversation about police interaction with minority communities has continued — notably in the ongoing case of Freddie Gray in Baltimore, Maryland — the survey reveals a rebound in the overall views of police from last year.\nThe poll of 824 adults was conducted from December 2-6 and has a margin of error of +/4 percentage points. The results are taken from a larger Gallup poll which asked Americans to rate the honesty and ethics of various professions.","url":"https://www.breitbart.com/politics/2015/12/21/poll-americans-faith-honesty-ethics-police-improves/"}
