{"authors":[],"date_download":"2018-10-22 21:01:30","date_modify":"2018-10-22 21:01:30","date_publish":"2014-06-03 20:26:29","description":"Ahead of several primaries, a new poll finds Latino voters, regardless of party affiliation, see immigration as a key issue.","filename":"data/vaneerConsumption/PollImmigrationIsGatewayIssueForGOPDemLatinos.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485436/20140603-voter-nevada-sl-1706_0f63d7b2a9009c4a348d1f0d398d112a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_poll-immigration-gateway-issue-gop-dem-latinos-n121666_1540242090.html","title":"Poll: Immigration Is 'Gateway' Issue For GOP, Dem Latinos","title_page":"Poll: Immigration Is 'Gateway' Issue For GOP, Dem Latinos   ","title_rss":"NULL","source_domain":"nbcnews.com","text":"A new Latino Decisions poll of registered Hispanic voters found they are generally dissatisfied with both parties' current actions - or inactions - on immigration policy. And regardless of party affiliation, it is an important issue for the electorate, with 71 percent stating legislation should be passed in 2014.\nOn immigration, a little over half of Latinos- 54 percent -approve or somewhat approve of the job Obama is doing, and the number is 49 percent approval for Congressional Democrats and 25 percent for Republicans.\nOver seven-in-ten Hispanics who have previously voted Republican say they would be less favorable toward the GOP if the House does not move forward with immigration legislation, while 61 percent of Hispanics say they would be more likely to listen to Republicans on other issues such as taxes or school choice if the GOP supported immigration reform.\n\"These findings demonstrate immigration is a gateway issue for Latino voters,\" said Latino Decisions political scientist Matt Barreto. The poll of 800 Latino registered voters was commissioned by the Center for American Progress Action Fund, which favors immigration reform.\nThe poll comes as immigration reform advocates as well as President Obama say the window of opportunity is closing to enact legislation in Congress. The Senate passed a comprehensive, bipartisan immigration bill last June, but the House has not moved on immigration.\nWhile most midterm races will not be impacted by Latino voters, Barreto said 2010 showed immigration reform is a mobilizing issue, as seen in Nevada after Latino support tipped the balance in favor of Senator Harry Reid over Sharon Angle's anti-immigration stance. Immigration could affect the balance in 3 or 4 Senate races, Barreto said, adding that it would be difficult to portray Republicans as the \"obstructionist party\" on immigration if they were to support legislation.\n\"Demonizing\" immigration comes at a risk for Republicans, said Barreto.\nWhile virtually half - 49 percent - of Hispanics polled have voted Republican in at least one local, state or national race, Latino voters would blame the GOP if immigration legislation stalls by a three-to-one margin according to the poll. And for many Latinos, immigration is personal - 62 percent say they know an immigrant who is not legally in the country.","url":"https://www.nbcnews.com/news/latino/poll-immigration-gateway-issue-gop-dem-latinos-n121666"}
