{"authors":["John Binder"],"date_download":"2018-10-30 18:02:20","date_modify":"2018-10-30 18:02:20","date_publish":"2018-07-04 16:24:58","description":"The majority of white, black, and Hispanic Americans agree that the U.S. needs stricter enforcement of its immigration laws.","filename":"data/vaneerConsumption/PollMajorityofWhiteBlackandHispanicAmericansUSNeedsStricterImmigrationEnforcement.json","image_url":"https://media.breitbart.com/media/2018/02/wi/ap/23/3u44eq_immigration-deportations-79467-in-tuesday-feb-2017-photo-released-by-immigration-e1522183051577.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_04__1540922540.html","title":"Poll - Majority of White, Black, and Hispanic Americans: U.S. Needs Stricter Immigration Enforcement","title_page":"Poll - Majority of White, Black, and Hispanic Americans: U.S. Needs Stricter Immigration Enforcement | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The majority of white, black, and Hispanic Americans agree that the United States needs stricter enforcement of its immigration laws, a new poll finds.\nIn the latest Harvard/Harris Poll, 77 percent of white voters, 53 percent of black voters, and 51 percent of Hispanic voters said they believe the U.S. needs to crack down on immigration laws.\nOverall, 70 percent of Americans said the U.S. needs stricter immigration enforcement, not looser enforcement as Democrats and the Republican establishment has pushed for.\nIn recent weeks, Democrats in the House and Senate, along with progressive liberals like Cynthia Nixon in New York and most recently insurgent Democrat candidate for Congress, Alexandria Ocasio-Cortez, have been demanding the Immigration and Customs Enforcement (ICE) agency — tasked with deporting illegal aliens — be abolished and all immigration enforcement be ended. House Democrats are now crafting legislation that would officially abolish ICE.\nAbolishing ICE, as Breitbart News reported, would have allowed more than 1.6 million illegal aliens to have gone free throughout the U.S. in the last five years. Nearly 60 percent of Democrat voters say they do not want ICE abolished, while about 3-in-4 swing voters say the same.\n\"Nearly 60 percent of Democrats said they do not want ICE to be disbanded. Abolishing the deportation agency would have allowed more than 1.6 million illegal aliens to have gone free throughout the U.S. in the last five years.\" https://t.co/SIqQRrbIw3 — John Binder 👽 (@JxhnBinder) June 29, 2018\nLast month, every Senate Democrat signed onto the “Keep Families Together Act” which would have ended all immigration and border enforcement across the U.S., as Breitbart News reported.\nSen. Tom Cotton (R-AR), at the time, called the Senate Democrats’ plan “the Child Trafficking Encouragement Act,” saying it would lead to children being “abducted & sold to drug cartels & slave-traders as a free ticket into U.S.”\nLikewise, thirteen Republican Senators also demanded that President Trump end all border and immigration enforcement until Congress passed legislation that would ban illegal alien adults arriving at the U.S.-Mexico border from being separated from the children they crossed into the country with.\nBreitbart News compiled a list of those Republican Senators.","url":"https://www.breitbart.com/politics/2018/07/04/poll-majority-of-white-black-and-hispanic-americans-u-s-needs-stricter-immigration-enforcement/"}
