{"authors":["Neil Munro"],"date_download":"2018-10-30 19:09:11","date_modify":"2018-10-30 19:09:11","date_publish":"2018-07-11 17:19:48","description":"One-quarter of liberals and feminists say they would be much more likely to back political candidates who promise to \"Abolish ICE!\" according to a Morning Consult Poll.   | Trump Highlights Democrats' Split, Radical 'Abolish ICE' Demand","filename":"data/vaneerConsumption/PollOneQuarterofDemocraticBaseStronglyDemandsAbolishICE.json","image_url":"https://media.breitbart.com/media/2018/07/AP_18187570889872.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_11__1540926551.html","title":"Poll: One Quarter of Democratic Base Strongly Demands 'Abolish ICE!'","title_page":"Poll: One Quarter of Democratic Base Strongly Demands 'Abolish ICE!' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"One-quarter of liberals and feminists say they would be much more likely to back political candidates who promise to “Abolish ICE!” according to a Morning Consult poll.\nThe strong support for ending immigration enforcement exceeded 20 percent among students, under-30s, feminists, Democratic men, and liberals, according to the poll of 1,999 registered voters, which was conducted June 6-10.\nTwenty-six percent of liberals, 24 percent of Democratic men, 27 percent of students and 26 percent of people whose top priority are “women’s issues,” say they would strongly back an “Abolish ICE!” candidate. Another 22 percent of liberals and feminists say they are “somewhat more likely” to back Abolish ICE candidates, ensuring that roughly half of the party’s activists strongly or somewhat support the Abolish ICE platform.\nIn contrast, 38 percent of independent men and 31 percent of independent women said they would be “much less likely … [to] vote for a candidate for U.S. Congress if they supported getting rid of Immigration and Customs Enforcement (ICE).”\nAmong Republicans, 57 percent of men and 46 percent of women said they would be “much less likely” to back a candidate who would abolish ICE.\nThe poll helps explain why leading Democrats — and many Democratic candidates — are trying to sidetrack and dodge the growing “Abolish Ice!” demand from their activists, and to cover up the political divide in their ranks.\nBut President Donald Trump is spotlighting the Democrats’ split, telling reporters Tuesday that:\nWe ought to support ICE, not do what the Democrats are doing. Democrats want open borders, and they don’t mind crime. We want no crime, and we want borders where borders mean something. And remember this: Without borders, you do not have a country.\nA vote for Democrats in November is a vote to let MS-13 run wild in our communities, to let drugs pour into our cities, and to take jobs and benefits away from hardworking Americans. Democrats want anarchy, amnesty and chaos – Republicans want LAW, ORDER and JUSTICE! — Donald J. Trump (@realDonaldTrump) July 6, 2018\nTop Democratic leaders, including Sen. Chuck Schumer, are downplaying the split, while Democratic Senate candidates are dodging the radicals’ call for abolishing the immigration-enforcement agency, which helps keep millions of poor foreign migrants out of U.S. workplaces, neighborhoods, and schools.\nInstead, they are urging various forms of reform that would quietly kill off the agency’s mission of enforcing immigration laws inside the United States. That call would revive the stealth policies adopted by President Barack Obama, which gradually encouraged the migrant wave of 500,000 Central American migrants.\nTheHill.com reported:\nDemocratic candidates locked in tight races that will likely determine which party controls the Senate next year are stopping short of embracing the idea as they try to win over moderate voters. “No, I don’t think we should,” Sen. Bill Nelson (Fla.), a vulnerable Democrat seeking reelection, said on Monday when asked if he agreed with calls to abolish ICE … Rep. Beto O’Rourke (D-Texas), who will face off against Sen. Ted Cruz (R), has gone against the grain. He’s expressed a willingness to consider abolishing ICE. “If it’s reorganizing the Department of Homeland Security and changing the functions of ICE, having greater accountability, abolishing that agency altogether, that’s fine,” he told a Texas radio station. “But there will still have to be enforcement of our immigration laws in this country.”\nIn California, gubernatorial candidate Gavin Newsom says he wants to reform – but not abolish – ICE to end enforcement. “The agency needs fundamental reforms, and most of all, we need a president who respects immigrants and their families.”\n“I think there’s no question that we’ve got to critically re-examine ICE, and its role, and the way that it is being administered, and the work it is doing. And we need to probably think about starting from scratch,” California Sen. Kamala Harris said June 24. “There is a lot that is wrong with the way that it is conducting itself and we need to deal with that.”\nOther Democrats have wrapped themselves around the Abolish ICE theme:\n“I agree with it,” New York Sen. Kirsten Gillibrand June 29. She added:\nI believe that it has become a deportation force, and I think you should separate the criminal justice from the immigration issues. I think you should reimagine ICE under a new agency with a very different mission and take those two missions out.\nNew York Mayor Bill deBlasio, has also joined the cause, partly because of pressure from his primary opponent, Cynthia Nixon.\nThe second-ranking leader of the Senate Democrats, Sen. Dick Durbin, is adding fuel to the fire. “Look at ICE — what a group of incompetents,” he told CNN on July 1, adding:\nAt this point, they are focused more on toddlers than terrorists. They want, instead of deporting felons, they want to deport families that are being persecuted by criminal gangs … instead of focussing on stopping bad drugs coming in and stopping dirty drug money from going out, they’re focussed on separating kids from their families.\nThe Democrats’ demand for abolishing ICE is very unpopular.\nA Washington Post poll of 1,473 adults, taken June 27 to July 2, showed that 65 percent of adults nationwide oppose lax border policies, and so do 71 percent of adults in the 2018 battleground states.\nA June 27-28 poll of 1,000 likely voters by Rasmussen Reports showed that only 20 percent of independent voters favor … getting rid of ICE.” Fifty-three percent opposed, and 20 percent declined to state their opinion.\nA Harvard-Harris poll taken June 24-25, showed that 68 percent of 1448 adults said “the Immigration and Customs Enforcement officers, known as ICE, should [not] be disbanded.”\nThe same poll showed that 63 percent of all adults and 59 percent of independents favored Trump’s “Four Pillars” immigration reform, which was described as:\nWould you favor or oppose a Congressional deal that gives undocumented immigrants brought here by their parents work permits and a path to citizenship in exchange for increasing merit preference over preference for relatives, eliminating the diversity visa lottery, and funding barrier security on the U.S.-Mexico border?\nMany Democrats see the political danger and are trying to thread their political needle between ordinary voters and their liberal base. For example, Minnesota Democrat Amy Klobuchar said July 1 that a policy change is more important than abolishing ICE:\nI think what has to change are the policies, and the people that are making these policies are making horrendous decisions like separating kids from their parents. We are always going to need immigration enforcement. … So to me, the issue is what are those policies, and please let’s get comprehensive immigration reform, something I’ve strongly supported for years.\nHouse Minority Leader Rep. Nancy Pelosi also urged a change in policy, saying “ICE has been on the wrong end of far too many inhumane and unconstitutional practices to be allowed to continue without an immediate and fundamental overhaul,” according to a report in the Washington Post.","url":"https://www.breitbart.com/politics/2018/07/11/poll-one-quarter-democratic-base-demands-abolish-ice/"}
