{"authors":["Michelle Fields"],"date_download":"2018-10-30 19:20:46","date_modify":"2018-10-30 19:20:46","date_publish":"2015-11-24 15:28:59","description":"Senate Majority Leader Mitch McConnell (R-KY) is the most unpopular U.S. Senator, according to a new national survey.","filename":"data/vaneerConsumption/PollMitchMcConnellIsTheMostUnpopularUSSenator.json","image_url":"https://media.breitbart.com/media/2015/02/mitch-mcconnell-frown-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_24__1540927246.html","title":"Poll: Mitch McConnell Is The Most Unpopular U.S. Senator","title_page":"Poll: Mitch McConnell Is The Most Unpopular U.S. Senator | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate Majority Leader Mitch McConnell (R-KY) is the most unpopular U.S. Senator, according to a new national survey.\nThe poll released by Morning Consult finds McConnell is the only senator with a disapproval rating higher than 50 percent. McConnell has a 52 percent disapproval rating among Kentucky voters, while only 38 percent approve of his job performance.\nSen. Gary Peters (D-MI) and Sen. Bob Menendez (D-NJ) have the lowest approval rating among their constituents at 37 percent.\nThe most popular U.S. Senator is presidential candidate Bernie Sanders of Vermont, with 83 percent of respondents saying they approve of his job performance.\nThe most popular Republican in the Senate is Sen. Susan Collins. Some 78 percent of Maine voters said they approve of her job performance and only 16 percent said they disapprove\nThe survey concluded that, “while voters disdain Congress as a whole, they have much more positive views of their individual senators with 69 of 100 United States senators having approval ratings of 50 percent of higher among their own constituents.”\nThe poll found that the average approval rating of Senate Democrats is 54 percent, while Republicans have an average approval rating of 51 percent.\nThe sample size varied by state, but the median sample size was 1,172. The polling took place between May 2015 and mid-November 2015. Every state’s sample was weighted based on gender, age, and race.","url":"https://www.breitbart.com/politics/2015/11/24/poll-mitch-mcconnell-unpopular-u-s-senator/"}
