{"authors":["Wynton Hall"],"date_download":"2018-10-30 20:22:12","date_modify":"2018-10-30 20:22:12","date_publish":"2014-12-21 18:03:59","description":"A new ABC News/Washington Post poll finds Democrats cooling to Hillary Clinton as a possible 2016 presidential contender. When Democratic voters were |","filename":"data/vaneerConsumption/PollHillaryClintonsPopularitywithDemocratsFalls.json","image_url":"https://media.breitbart.com/media/2014/11/hillary-clinton-shrug-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_21__1540930932.html","title":"Poll: Hillary Clinton's Popularity with Democrats Falls","title_page":"Poll: Hillary Clinton's Popularity with Democrats Falls | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new ABC News/Washington Post poll finds Democrats cooling to Hillary Clinton as a possible 2016 presidential contender.\nWhen Democratic voters were asked which Democratic candidate they would back in the primary, 61% said Hillary Clinton, a 12% drop since January when 73% preferred her candidacy.\nVice President Joe Biden came in as the second most popular choice among Democrats at a distant 14%. Coming in third was Sen. Elizabeth Warren (D-MA), a favorite among progressives. Since January, Warren has seen a slight 4% uptick in support among Democratic voters.\nWith 4% support, self-avowed socialist Sen. Bernie Sanders (I-VT) bested Jim Webb (3%) and Maryland Governor Martin O’Malley in the poll. O’Malley’s support was so low he didn’t even register in the poll and was marked with an asterisk.\nSanders’ popularity on social media makes him a force to be reckoned with, reported Politico on Sunday.\nSanders staffers also gloat that their boss has more people talking about him on Facebook than any other member of Congress, and more than twice as many as Obama. Looking to 2016, Sanders is poised to be a small-dollar fundraising machine — he counts more than 1 million people combined who have signed up for his official Senate and campaign email lists\nThe ABC News/Washington Post poll was conducted Dec. 11-14.","url":"https://www.breitbart.com/politics/2014/12/21/poll-hillary-clintons-popularity-with-democrats-falls/"}
