{"authors":[],"date_download":"2018-10-22 22:21:03","date_modify":"2018-10-22 22:21:03","date_publish":"2014-06-09 19:38:33","description":"Thirty-four percent say it was the right move.","filename":"data/vaneerConsumption/Poll4in10SayBergdahlSwapWasWrongThing.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/497496/bergdahl_news_gude-jpeg-010a5_7b063afbf7eb93f296b4390786b05469.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_poll-4-10-say-bergdahl-swap-was-wrong-thing-n126626_1540246863.html","title":"Poll: 4 in 10 Say Bergdahl Swap Was 'Wrong Thing'","title_page":"Poll: 4 in 10 Say Bergdahl Swap Was 'Wrong Thing'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAbout four-in-ten Americans say that the prisoner swap that freed Sgt. Bowe Bergdahl was “the wrong thing to do,” while 34 percent say it was the right move, according to a new poll. But more than half also say the United States should be responsible for ensuring the return of a captive soldier, no matter what the circumstances are.\nThe new poll by the Pew Research Center and USA Today found that Republicans were more likely to have a negative reaction to the swap, with 71 percent of Republicans calling it the “wrong thing” versus 24 percent of Democrats.\nFifty-six percent of respondents said that the United States has a responsibility to work to retrieve a captured solider under any circumstances, while 29 percent believe that, because Bergdahl reportedly left his post on his own, the country wasn’t obligated to do everything necessary to ensure his release.\nConservative Republicans were the most likely to say that the United States wasn’t obligated to secure Bergdahl’s release.\nSo far, public sentiment towards Bergdahl himself is fairly muted, the poll found. Fifteen percent say they are angry with him, and the same share say they feel sympathy for him. Nearly six-in-ten respondents said they didn’t feel either way.\nThe poll of 1,004 was conducted June 5-8 and has a margin of error of 3.6 percentage points.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/poll-4-10-say-bergdahl-swap-was-wrong-thing-n126626"}
