{"authors":["Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:06:33","date_modify":"2018-10-30 23:06:33","date_publish":"2017-04-20 09:06:00","description":"Californians have overwhelmingly rejected private school voucher initiatives twice in the last 25 years, but a new poll shows this deep blue state has renewed interest in a policy championed by the Trump administration.","filename":"data/vaneerConsumption/PollCaliforniansfavortaxfundedschoolvouchers.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540940793.html","title":"Poll: Californians favor tax-funded school vouchers","title_page":"Poll: Californians favor tax-funded school vouchers | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Californians have overwhelmingly rejected private school voucher initiatives twice in the last 25 years, but a new poll shows this deep blue state has renewed interest in the idea championed by the Trump administration.\nAnd the strongest support comes from African Americans and Latinos.\nThe poll finds 60 percent of adults and 66 percent of public school parents favor tax-funded vouchers that would help families cover the cost of private or parochial school tuition—even though most respondents also gave their neighborhood schools good grades.\n“Many believe the state isn’t spending enough money on K12 education and should also spend what it has more wisely,” said Mark Baldassare, president of the Public Policy Institute of California, which produced the poll. “In this context, many are willing to raise their local taxes and consider a voucher system.”\nRepublicans are more likely than independents and far more likely than Democrats to back vouchers, according to the poll, which surveyed 1,705 adults and has a sampling error of plus or minus 3.2 percentage points. While majorities across all racial and ethnic groups are in favor, almost three in four Latinos and African Americans surveyed back the idea.\nPresident Trump first pledged his support for tax-funded vouchers during his presidential campaign, calling school choice “the civil rights issue of our time.” And before U.S. Secretary of Education Betsy DeVos joined his administration, she led an advocacy group that promoted private school choice.\nTeachers unions in California and across the country vehemently oppose vouchers because they steer public money away from public school. California Teachers Association President Eric Heins dismissed the idea that Trump led Californians to rethink their long-standing opposition. “When people are asked on the street what they think about vouchers, they often say it’s a good idea,” Heins said. “But once you start sharing some of the details and tell people how much money they strip away from public schools, that support starts to erode.”\nAmerican Federation for Children spokesman Tommy Schultz, however, said he sees a mandate in the poll results. “Lawmakers in California should listen to parents who want to be empowered with educational choice and have access to a quality education for their children,” said Schultz, whose group had long been led by DeVos.","url":"https://calmatters.org/articles/trump_california/poll-californians-favor-tax-funded-school-vouchers/"}
