{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:45","date_modify":"2018-10-30 21:07:45","date_publish":"2016-05-31 10:34:56","description":"One in three Americans back the Boycott, Divestment and Sanctions (BDS) movement as a legitimate way of applying pressure on Israel.","filename":"data/vaneerConsumption/PollThirdOfAmericansSupportBoycottingIsrael.json","image_url":"https://media.breitbart.com/media/2016/03/aboy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_31__1540933665.html","title":"Poll: Third Of Americans Support Boycotting Israel","title_page":"Poll: Third Of Americans Support Boycotting Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – One in three Americans back the Boycott, Divestment, and Sanctions (BDS) movement as a legitimate way of applying pressure on Israel, while nearly two-thirds see it as anti-Semitic, a new poll found.\nThe survey, conducted by Ipsos, came a day before a United Nations conference on BDS.\nThe poll, which sampled 1,100 people across the US, found 33% believe boycotting Israel is legitimate. Forty percent of respondents in the United Kingdom agreed.\n62% or Americans, however, and 50% of Britons, think the boycott movement is a modern-day expression of anti-Semitism.\nThe results show that criticism of Israel, currently at its height on U.S. college campuses, is beginning to have an effect on mainstream public opinion.\nPresidential hopeful Bernie Sanders has selected two well-known BDS activists for the Democratic Party’s platform drafting committee.\nMeanwhile, on Tuesday Israeli Ambassador to the United Nations Danny Danon is set to host a conference condemning the BDS movement.\n“We have no ally more important than the United States of America and we have no closer friends than the American community in all its diversity,” Danon told Channel 2. “Nonetheless, the young students of today are less committed to the special connection between the two countries than previous generations.”\n“There is no doubt that the BDS movement doesn’t let up in its efforts to harm Israel,” Danon noted. “Together with our partners, we will continue to stand firm in the face of any threat, and we will win,” he added.\nSome 1,500 people are expected to attend, including legal experts and representatives from a range of organizations campaigning against BDS.","url":"https://www.breitbart.com/middle-east/2016/05/31/poll-third-of-americans-support-boycotting-israel/"}
