{"authors":["Amanda Lee"],"date_download":"2018-10-30 21:35:54","date_modify":"2018-10-30 21:35:54","date_publish":"2016-04-27 23:23:06","description":"New research among 18-34 year olds reveals that a quarter of young people in the UK would happily date a robot.","filename":"data/vaneerConsumption/PollQuarterofYoungPeopleWouldDateaRobot.json","image_url":"https://media.breitbart.com/media/2016/04/ex-machina.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_04_27__1540935354.html","title":"Poll: Quarter of Young People Would Date a Robot","title_page":"Poll: Quarter of Young People Would Date a Robot | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New research among 18-34 year olds reveals that a quarter of young people in the UK would happily date a robot.\nMarking the launch of FutureFest 2016, a festival focused on inspiring people to change the future, new research was published today detailing the public’s collective vision of the world in 20 years time.\n“As humans, we are all born with our own in-built crystal ball about the future,” said musician and activist Pat Kane, who is one of four curators for FutureFest 2016. “It’s in our nature to have dreams and schemes about better and more exciting worlds to come.”\nCommissioned by Nesta, a UK-based innovation foundation and host of FutureFest, 1,000 British adults ages 18-34 were interviewed on a variety of topics.\nCollective data shows microchipping is not too much of a concern for the Brits; a third admitted they would be microchipped at work provided their privacy was 100% guaranteed, and half of those interviewed who already use contactless bank cards say they would gladly receive microchips allowing them to log on at work or open doors.\nMeanwhile, a third believe that in fifty years time, sales of sugary drinks to those under 16 will be as tightly regulated as tobacco is today.\nIn regards to the one-in-four British millenials who would happily build a relationship with an android, there are, of course, stipulations. To qualify as a potential partner, the android must look like a real-life human and be a “perfect match.” While 26% of British millenials are comfortable with dating a robot, only 17% of the overall British adult population is willing.\n“Our bodies, our identities and our senses are enhancing thanks to technology and societal shifts,” said Ghislaine Boddington, co-founder and creative director of East London design unit body>data>space. Boddington is also curating at FutureFest 2016. “Indeed, intimacy as we know it is expanding its boundaries – enabling us to experience love and affection beyond the physical and into the virtual.”","url":"https://www.breitbart.com/tech/2016/04/27/poll-quarter-of-young-people-would-date-a-robot/"}
