{"authors":[],"date_download":"2018-10-22 20:34:16","date_modify":"2018-10-22 20:34:16","date_publish":"2014-05-02 14:47:46","description":"This is the dawn of “Disinvitation Season,” those thorny weeks before college graduations when speakers often are axed amid student protests.","filename":"data/vaneerConsumption/PompandCircumstancesBootedSpeakersRaiseAcademicConcerns.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/417996/140503-condoleezza-rice-mn-945_e881334a7e32a4c53538c368b3690dca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_education_pomp-circumstances-booted-speakers-raise-academic-concerns-n90141_1540240456.html","title":"Pomp and Circumstances: Booted Speakers Raise Academic Concerns","title_page":"Pomp and Circumstances: Booted Speakers Raise Academic Concerns","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nColleges and universities brace annually for “disinvitation season,” those thorny weeks before graduation when speakers flunk out due to politics, political correctness, or, in one recent case, years-old sex images that found their way onto the Internet.\nThe unwelcome wagon has grown increasingly crowded in recent years, and some free-speech experts contend those moves send an unhealthy message to an audience full of degree recipients in their caps and gowns.\nInvitations extended to nine speakers this year raised the ire of students or professors, prompting protests, the threat of at least one boycott –- and the withdrawal Saturday of former Secretary of State Condoleezza Rice from the commencement ceremony at Rutgers University. She previously was scheduled to address Rutgers students and receive an honorary Doctor of Laws degree May 18. But some faculty members had protested that choice due to Rice’s role in the Iraq War.\n\"Commencement should be a time of joyous celebration for the graduates and their families. Rutgers' invitation to me to speak has become a distraction for the university community at this very special time,\" Rice said in a statement released Saturday. \"I am honored to have served my country. I have defended America's belief in free speech and the exchange of ideas. These values are essential to the health of our democracy. But that is not what is at issue here.\"\n“Colleges and universities are teaching students to think like censors.\"\nFree-speech advocates say, however, the full exchange of ideas is precisely what’s at stake as the number of college-commencement disinvites continues to rise.\nIn 2011, six speakers who had been asked to offer graduation addresses fueled student or faculty unrest. That led two of those speakers to be formally uninvited. In 2012, 11 commencement speakers sparked complaints, causing one to be uninvited and one to have his honorary degree rescinded. In 2013, 16 planned graduation speakers stirred protests and three opted to withdraw. Those cases are tracked by the Foundation for Individual Rights in Education, (FIRE), a Philadelphia-based, nonpartisan nonprofit that advocates for free speech.\n“Colleges and universities are teaching students to think like censors,” said Robert L. Shibley, senior vice president of FIRE. He asserts the practice is fueled by “overbroad harassment policies, free speech zones that render most of campus a censorship zone, and a focus on civility and comfort at the expense of lively debate.\n“Yet colleges are the very institutions that are supposed to be teaching students to think critically and consider all sides of an argument,” Shibley said.\nOne group that works with conservative-leaning students to place speakers on U.S. college and university campuses has similarly noted an uptick in protests and other negative reactions when it comes to certain academic voices who work to silence certain selected speech makers.\n\"We do often deal with this situation a lot when it comes to free speech rights on campuses, how campuses are supposed to be these houses of tolerance when we see these types of things happen all the time,\" said Ashley Pratte, spokeswoman for Young America's Foundation, a nonprofit based in Herndon, Va.,\n\"This incident with Condoleezza Rice is not an isolated one,\" Pratte said. \"Unfortunately, the climate on campuses had led to this sad state of affairs where someone as accomplished as Condoleezza Rice (causes) such an adverse reaction among some of the faculty.\n\"It seems as though this intolerance is only being perpetuated across the country rather than the whole idea of free speech,\" she added.\nWomen’s rights activist Ayaan Hirsi Ali, who has made statements critical of Islam, was to receive an honorary degree at Brandeis University’s commencement in May until a groundswell of criticism pushed the school to rescind the offer. School President Frederick Lawrence said on April 8 that after talking with Hirsi Ali, her name was withdrawn. A Brandeis spokeswoman declined further comment to NBC News. The school’s statement left open the possibility of Hirsi Ali speaking at its Waltham, Massachusetts, campus at a later date.\n\"If there’s one thing I’ve learned in the struggle for equality it is that when you are stung by injustice, you must find your pride and raise your voice. If you are outraged like I am, you must show it.\"\nThen there’s the odd flip-flop involving Dustin Lance Black, the Oscar-winning screenwriter of ‘Milk,’ and an LGBT activist who was originally asked to speak at the May 9 commencement of his alma mater, Pasadena City College. In mid April, leaders at the college abruptly disinvited the screenwriter, citing intimate photos of Black -– shot in 2006 then later stolen and leaked online in 2009.\nBlack used his ex-college’s spurning to address PCC students -– this time, in a tweeted letter, urging that they sound off . “I urge you not to let PCC’s Administrators get away with sending such a harmful message. If there’s one thing I’ve learned in the struggle for equality it is that when you are stung by injustice, you must find your pride and raise your voice. If you are outraged like I am, you must show it. You must speak truth to fear and prejudice and shed light where there is ignorance.”\nOn April 30, the college’s board of trustees voted unanimously to re-invite the writer and offered a formal apology.\nAs of Monday morning, Black had not tweeted whether he’ll re-accept.\nIronically, the Internet provides the very battlefield for this grad-day grudge match, the virtual place of disinvitation petitions and sharp banter critiquing speaker choices, the space that pits the PC concerns of some campus leaders against the hardline of free-speech advocates.\n“I suspect it’s happening because it has become increasingly acceptable to call for silencing one’s opponents, and because sometimes, like at Brandeis, it works,” Shibley said.\n“Commencement speakers are generally higher-profile and are clustered around the same calendar months, which is why we call it ‘disinvitation season.’ It’s this season,” he added, “that we believe is happening earlier (each year).”\nAcademic freedom advocates argue such disinvitations are antithetical to the mission of higher-ed institutions, where debate is encouraged and the marketplace of ideas is nurtured.\nShibley’s group, via its informal tracking, has counted more than 100 attempts to disinvite speakers on U.S. campuses, illustrating as well that the act doesn't just happen around commencement.\n“Academia is just about the worst possible place to silence controversial views,” Shibley said. “If we are to have a meaningfully democratic society, it's incumbent on all of us to be willing to hear both sides of an argument before we reach a decision. That's what being an informed citizen means, and if we silence one side of the debate, we'll never be fully informed.”\n“Commencement speakers are generally higher-profile and are clustered around the same calendar months, which is why we call it ‘disinvitation season.’ It’s this season.\"\nBut some college profs contend various speaker protestations are being misconstrued as attempts to censor views or voices. In several cases, including at Rutgers, faculty members say they’re not bothered by planned speeches or by the celebrity scheduled to appear on the dais; it’s the fact that graduation speakers, as with Rice, often receive honorary degrees. And that citation of “honor” is why a number of faculty members and college administrators wage fights to keep some speakers away.\nAt Rutgers, ecnomics professor Mark R. Killingsworth and other faculty members in New Brunswick had recently drafted a resolution opposing the honorary degree to be awarded to Rice. Those faculty members assert Rice played a “prominent role in (the Bush Administration’s) efforts to mislead the American people about the presence of weapons of mass destruction in Iraq” – one justification for the 2003 invasion.\nRice and Killingsworth do seem to disagree on one point: the ex-Secretary of State’s initial invitation and her ultimate withdrawal from the Rutgers event were not about politics.\nSaid Rice in her statement Saturday: “As a professor for thirty years at Stanford University and as (its) former Provost and Chief academic officer, I understand and embrace the purpose of the commencement ceremony and I am simply unwilling to detract from it in any way.\"\nMeanwhile, Rutgers faculty members “would be be perfectly happy to have Condoleezza Rice come and speak about any topic whatever,” Killingsworth said. “I don’t think anybody would have any trouble hearing from staunch conservatives, or strong liberals or radicals or anybody in between.”","url":"https://www.nbcnews.com/news/education/pomp-circumstances-booted-speakers-raise-academic-concerns-n90141"}
