{"authors":[],"date_download":"2018-10-30 19:53:35","date_modify":"2018-10-30 19:53:35","date_publish":"2016-02-01 17:09:33","description":"Jamestown, investment and management company, has plans for a recently annexed part of Cobb County.","filename":"data/vaneerConsumption/PonceCityMarketdevelopersfocusonSmyrna.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/30/Images/photos.medleyphoto.8636653.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_smyrna-waterfron_9f3a7a233de71cc1315e75545609ca65__1540929215.html","title":"Ponce City Market developers focus on Smyrna","title_page":"Riverview Landing: Ponce City Market developers focus on Smyrna","title_rss":"NULL","source_domain":"ajc.com","text":"Smyrna's planned $300 million mixed-use development, from the same investment company behind Atlanta's Ponce City Market, is now one step closer to reality.\nThe construction of Jamestown's Riverview Landing is, the company said, dependent on the reconstruction of Riverview Road near I-285 — which started in December and which is expected to be completed by December 2016.\nSmyrna City Councilman Ron Fennel said the reconstruction is expected to cost $4 million.\nLike Ponce City Market, Riverview will include a mix of homes, shops, restaurants and green spaces, Jamestown said.\nIt will sit on the Chattahoochee River, on a former industrial site in southwest Smyrna, where the Georgia Tech rowing team now practices and where the REI Outdoor School outpost stands.\nJamestown said Riverview will be more like PCM than its other development projects to date, though it's still not clear what exact shape the development will take, what all it will include or when it will be finished.\nThere is currently no projected completion date for Riverview Landing, Jamestown said. It did not disclose how many homes, shops and restaurants are planned.\n“Riverview Landing will be a serene, respite community and destination for those seeking authentic outdoor recreation and quality lifestyles on the countryside,” Jamestown CEO Matt Bronfman told The Atlanta Journal-Constitution in a statement.\nWhen completed, Riverview will be Atlanta’s only mixed-use development with direct access to the Chattahoochee, Jamestown said.\nThe project was approved by the Smyrna City Council in 2013, the same year the council annexed the 82 acres of land bordering the river, according to previous AJC reports.\nFennel said that Jamestown did not present “very detailed plans about the area,” but said he was assuaged by their “vision to create a community.”\n“We are excited that Jamestown is a major investor in the metro Atlanta area,” Fennel said.\nHe said he trusts the developers to be “good stewards of the land.”","url":"https://www.ajc.com/news/local/smyrna-waterfront-mixed-use-development-takes-another-step-forward/5mfsS2ktOkvMQbqCs87dsJ/"}
