{"authors":[],"date_download":"2018-10-22 22:34:43","date_modify":"2018-10-22 22:34:43","date_publish":"2014-05-11 00:00:00","description":"A new program aims to lead unbanked Americans back into the financial mainstream. But it isn't easy.","filename":"data/vaneerConsumption/PoorAmericansFindBecomingBankedaDauntingQuest.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/433951/140510-credit-card-debt-mn-1045_8b9d4e48a912e93fba3e60e8d5b423da.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_in-plain-sight_poor-americans-find-becoming-banked-daunting-quest-n100961_1540247683.html","title":"Poor Americans Find Becoming 'Banked' a Daunting Quest","title_page":"Poor Americans Find Becoming 'Banked' a Daunting Quest - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Some 17 million Americans don't have bank accounts, which makes everything from depositing paychecks to paying utility bills a hassle. Many aren't unbanked by choice. Some are stuck on bank \"black lists\" and don't know how to get off; others can't afford high fees and balance requirements.\nClawing back and becoming \"rebanked\" is a daunting task for low-income Americans, since the alternative — a patchwork of check-cashing storefronts, payday lenders, prepaid cards and money orders — is an expensive burden on already-strained finances. Many don't know where to turn for help.\nThat's why the U.S. Treasury Department is looking at how local governments, nonprofits and the financial services industry can do a better job connecting with and helping the unbanked get banked. Last month, the agency rolled out a new initiative, the Financial Empowerment Innovation Fund, which will fund research studying how to improve access to and education about financial services.\n“I wasn’t getting any advice .... I was too ashamed to tell anybody I had all this debt,” said Luann Algoso, a Portland, Oregon, resident and graduate student. “It wasn’t a topic of discussion I wanted to bring up with my roommates even though I was close with them.”\n“I wasn’t getting any advice .... I was too ashamed to tell anybody I had all this debt.”\nNow 26, Algoso was 21 when youthful overspending on credit cards — “I didn’t have any supervision at that point” — caught up with her. Her bank account was closed after accumulating hundreds of dollars in overdraft and related penalty fees.\nWhen she found herself paying $40 or $50 to cash paychecks at Western Union, “I realized quickly the importance of having a bank account,” Algoso said.\nWhen she went off to college, then 18-year-old Luann Algoso applied for several credit cards and ran up considerable debt, resulting in her bank account being closed when she was 21. Now 26, and a graduate student living in Portland, Ore., Luann has managed to regain a bank account, and is working on rebuilding her credit. Toni Greaves / for NBC News\nEntering the financial mainstream\nThat’s typical, said Jose Quinonez, CEO of Mission Asset Fund, a nonprofit that helps low-income families access the financial mainstream. “The problem is people who don’t have [bank accounts] are overpaying for their financial services,” he said. On average, low-income unbanked people spend around 9 percent or 10 percent of their annual income on financial services, he said.\n“That sounds about right,” said Jennifer Rice, who estimated she paid about $250 a month during the four years she spent without a bank account.\nIn 2008, as a single mom waiting tables in western Texas in the wake of a divorce, 44-year-old Rice got a letter telling her that her checking account was being closed.\nRice got a prepaid debit card, but she had to pay a $10 monthly fee, plus 99 cents per transaction, and $5 every time she wanted to load money onto the card. (This was before the mainstreaming of prepaid debit cards lowered the cost of use.)\nTo pay bills, Rice used money orders, but she paid on both ends: along with the roughly $3 she paid per money order, her utility company tacked on a $5 fee to accept payment that way — adding to her financial burden.\n“It was scary, really scary,” Rice said. After years of being turned away by bigger banks or deterred by high balance requirements on so-called \"second chance\" accounts, Rice was eventually able to convince a small community bank to take her on as a customer.\nHer story is a common one, consumer advocates say.\n“Half of people who left the banking system did so because of hidden fees like overdrafts,” said Susan Weinstock, director for the Pew Charitable Trust's Safe Checking in the Electronic Age Project.\n“Some of them do get really angry that they weren’t told [about the fees] before they opened the bank account,” said Oumi Cisse, a financial counselor at credit counseling organization Clarifi. She said clients were frequently bewildered by the profusion of fees and didn’t understand what they were being charged or why.\nMany don’t even know they’re being blacklisted, Cisse said. “If you’re being reported in the ChexSystems, it can be a hassle,” she said.\nA credit bureau for bank accounts, ChexSystems warns banks about potential customers with a history of writing bad checks or similar behaviors. As transactions have shifted to debit cards and banks have started relying more on overdraft fee revenue, a system designed to catch fraud has become one that snared people who were poorly informed, confused or just unlucky. As with other consumer credit bureaus, consumers have a right to see their report and request errors to be corrected, but that can be easier said than done, Cisse said.\n“Based on the different conversations I have with clients, they have no idea about ChexSystems and no idea how to request a report and they just give up,” she said.\nThis is why financial education is crucial, said Kasey Wiedrich, senior research manager at the CFED. A program funded by the U.S. Treasury Department and operated in conjunction with an existing program that helped with New Yorkers transitioning off public assistance found that a bank account plus financial education yielded benefits.\n“We did find even for the very financially vulnerable, some positive impacts from counseling,” Wiedrich said. “The percentage of debt that was past due was significantly lower …. People were paying their bills on time, which is the biggest component of a credit score.”\nBeing unbanked also goes hand-in-hand with either a poor credit score, or not enough of a credit history to have a score at all.\n“Our financial education is really centered on the credit system,” said Quinonez, whose group works primarily with Latino immigrants. “We tell them what FICO and credit bureaus are, what goes into their credit score… so they have agency over their credit score to make it more real for them.” In some cases, a lack of identification or a language barrier can also pose challenges.\nLoans out of reach\nThe ramifications are far-reaching. “If they don’t have a bank account, they don’t have a relationship with any bank, so the likelihood of them being able to get a loan if they need it ... is really none,” Cisse said. This makes them vulnerable to high-interest payday lenders and can prevent them from buying a car or a home.\n“There was nothing I could do … can't open an account, can't buy a car, can't buy a house. I was really struggling.\"\n“There was nothing I could do … can't open an account, can't buy a car, can't buy a house. I was really struggling,” said 52-year-old Philadelphia resident Oumar Ba.\nBa, who emigrated from Africa 16 years ago, works two jobs, but said he could never get ahead. “I saved nothing for six, seven years,” he said.\nIt’s harder for people to save money without a bank account, Weinstock said. They might be able to load funds onto a prepaid card, but most of those cards have caps and don’t allow users to funnel money into a dedicated savings track.\nThis leaves an already-vulnerable population even more exposed to the fallout of an economic downturn. “One of the things we learned is that folks who had a bank account weathered the economic storm better than those who didn’t,” Weinstock said. About two-thirds of those with bank accounts were able to save money at least some of the time, compared to fewer than 10 percent of those without bank accounts.\nIn 2012, Ba became involved with Clarifi and opened a savings account, followed by a checking account six months later. Now, he said he’s able to save money, and he’s working to improve his credit so he and his wife can buy a home.\n\"Things are getting better,” he said. “I manage my accounts now. I see where my money goes …. It's wonderful.”","url":"https://www.nbcnews.com/feature/in-plain-sight/poor-americans-find-becoming-banked-daunting-quest-n100961"}
