{"authors":[],"date_download":"2018-10-22 23:31:11","date_modify":"2018-10-22 23:31:11","date_publish":"2017-03-16 07:08:14","description":"US sporting-goods giant Nike has become the latest foreign brand to receive a high-profile rebuke from an influential Chinese consumer-affairs programme that...","filename":"data/vaneerConsumption/PoorAirqualityChinacallsoutNikeonconsumerrights.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-226995-1489648097-374_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319060_Poor-Air-quality-China-calls-Nike-consumer-rights_1540251071.html","title":"Poor Air quality: China calls out Nike on consumer rights","title_page":"Poor Air quality: China calls out Nike on consumer rights | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US sporting-goods giant Nike comes under criticism from a prominent consumer-affairs programme in China\nUS sporting-goods giant Nike has become the latest foreign brand to receive a high-profile rebuke from an influential Chinese consumer-affairs programme that has previously forced Apple and McDonald's to squirm.\nThe programme, broadcast Wednesday on World Consumer Rights Day by state-run China Central Television (CCTV), annually takes aim at alleged unethical behaviour by makers of well-known products and this time accused Nike of misleading advertising.\nNike had claimed that one of its basketball shoes had air-cushion insoles when it did not, the broadcaster said.\nBloomberg News quoted a statement issued by Nike as saying the company was \"committed to providing consumers with the highest product quality and service, and we will fully cooperate with the government regulators regarding their enquiries\".\nNike did not immediately respond to AFP requests for comment.\nIt is not the first time the programme has launched such an attack, forcing a globally-recognised brand to launch damage-control measures to protect its position in China's huge and coveted consumer market.\nApple was accused by the show in 2013 of dishonesty in its customer service and returns policies, prompting an apology from CEO Tim Cook.\nThe programme's past targets also have included fast-food giant McDonald's, Jaguar Land Rover Automotive, Volkswagen and Mercedes-Benz.\nWednesday's programme also took aim at Japanese retailer Muji, saying labelling on some of its food products had misrepresented that they originated in areas of Japan hit by the 2011 nuclear power plant disaster. Such products are banned in China.\nMuji released a statement in China denying the allegation, saying the programme had misunderstood its labels and adding that it \"strictly abides\" by Chinese import regulations.\nSome Chinese companies were also singled out Wednesday, including livestock-feed producers whose products contained excessive levels of certain chemicals.\nChina has been hit over the years by several major product-quality scandal involving Chinese products, prompting a crackdown by authorities and heightened consumer vigilance.","url":"https://www.dailymail.co.uk/wires/afp/article-4319060/Poor-Air-quality-China-calls-Nike-consumer-rights.html"}
