{"authors":["Joe Sheppard For Mailonline"],"date_download":"2018-10-23 05:25:21","date_modify":"2018-10-23 05:25:21","date_publish":"2017-03-10 15:15:58","description":"Indian news website Youth Ki Awaaz (Voice of the Youth) said Nepali women were selling 20 square inches (130 square cm) of skin tissue for $150 to be used in the global cosmetic surgery market.","filename":"data/vaneerConsumption/PoorNepalesewomenaredupedintosellingtheirskin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/17/00BE7AA3000004B0-0-image-a-7_1489167759873.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301616_Nepal-probe-report-women-selling-skin-penis-enlargements_1540272321.html","title":"Poor Nepalese women are duped into selling their skin","title_page":"Poor Nepalese women are duped into selling their skin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Poor Nepalese women are being duped into selling their skin to be used for penis and breast enlargements, according to a shocking investigative report .\nIndian news website Youth Ki Awaaz (Voice of the Youth) said the women were selling 20 square inches (130 square cm) of skin tissue for $150 to be used in the global cosmetic surgery market.\nNepal's Women, Child and Social Welfare Minister Kumar Khadka told the Thomson Reuters Foundation the government was shocked to hear the news.\nThe report said poor Nepali women were trafficked to brothels in Indian cities such as Mumbai and then duped into selling their skin\n'We are stunned by the report,' Mr Khadka said on Thursday. 'We will investigate and if found to be correct, the government will make all efforts to stop this heinous crime and punish those responsible.'\nThe trafficking of Nepalis from the impoverished Himalayan nation to neighbouring India for labour and sexual exploitation - and even kidney transplantation - is widely reported, but cases of trafficking in human skin tissue are unheard of.\nThe report said the Nepalese women were trafficked to brothels in Indian cities such as Mumbai and then later duped into selling their skin.\nSome victims said they were drugged and their skin removed.\nThe skin tissue is then allegedly sold on to pathology laboratories in India where it is processed and exported to companies in the United States which manufacture skin and tissue derivative products for the global plastic surgery market.\nThe report claims Indian news website said Nepali women were selling 20 square inches of skin tissue for $150\nWomen's rights activists called on the government to urgently investigate the report and launch public campaigns in high-risk, poorer districts of the country prone to trafficking.\n'The government should be serious about this and protect our women,' said Sunita Danuwar of Shakti Samuha, a charity which helps to rehabilitate victims of trafficking.\n'Mere lip service will make no difference and innocent villagers will continue to be trafficked for their organs like skin and kidneys.'","url":"https://www.dailymail.co.uk/news/article-4301616/Nepal-probe-report-women-selling-skin-penis-enlargements.html"}
