{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:26:55","date_modify":"2018-10-30 20:26:55","date_publish":"2015-09-25 00:19:19","description":"On September 24, Pope Francis scolded Congress for guns and weapons which are manufactured in America and sold around the world.","filename":"data/vaneerConsumption/PopeFrancisScoldsCongressforGunandWeaponsSales.json","image_url":"https://media.breitbart.com/media/2015/09/pope-francis-speaks-to-congress-9-24-15-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_24__1540931215.html","title":"Pope Francis Scolds Congress for Gun and Weapons Sales","title_page":"Pope Francis Scolds Congress for Gun and Weapons Sales | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On September 24, Pope Francis scolded Congress for guns and weapons which are manufactured in America and sold around the world.\nHe said he was determined “to minimize and, in the long term, to end the many armed conflicts throughout our world,” as he addressed the billion-dollar sales from American companies that he sees as a contributing factor to conflicts abroad.\nAccording to The Intercept, Pope Francis said:\nHere we have to ask ourselves: Why are deadly weapons being sold to those who plan to inflict untold suffering on individuals and society? Sadly, the answer, as we all know, is simply for money: money that is drenched in blood, often innocent blood. In the face of this shameful and culpable silence, it is our duty to confront the problem and to stop the arms trade.\nU.S. manufacturers make tens of billions cumulatively—The Intercept cites a figure of $23.7 billion in 2014 alone—from guns and weapons that are sold “to nearly 100 different countries.” The sales “have surged to record levels” under Obama, due in part to taxpayer subsidized sales to Israel and Egypt and “huge shipments to Gulf States, particularly Saudi Arabia.” And Saudi Arabia has subsequently been criticized for using “cluster bombs and other munitions… to hit densely populated areas, schools, and even a camp for displaced people in Yemen.” These are some of the things that appear to be behind Pope Francis’s statements on this issue.\nHowever, his words to Congress were immediately seized by media outlets like the Chicago Sun-Times and anti-Second Amendment groups as an impetus for gun control too. Breitbart News reported that Americans for Responsible Solutions—the gun control group founded by Gabby Giffords and Mark Kelly—sent out a donation request after Pope Francis spoke. In the request, they asked for $3 from every gun control supporter and quoted the first part of Pope Francis’s question—”Here we have to ask ourselves: Why are deadly weapons being sold to those who plan to inflict untold suffering on individuals and society?”\nGiffords went even further than asking for money by sending a tweet that cast gun control in religious overtones. She tweeted: “Inspired by [Pope Francis], let all Americans engage in a politics that sees the passage of just legislation that may bring us closer to grace.”\nPope Francis’s words may play perfectly into the hands of those trying to push the UN Arms Trade Treaty in the U.S. as well. That treaty is ubiquitously structured to stop small arms from crossing borders illegally, but Breitbart News has shown that the actual result will be international gun control.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/09/24/pope-francis-scolds-congress-gun-weapons-sales/"}
