{"authors":[],"date_download":"2018-10-22 23:10:08","date_modify":"2018-10-22 23:10:08","date_publish":"2014-07-07 00:00:00","description":"In his first meeting with victims of clerical sex abuse, Pope Francis asked forgiveness on behalf of the church.","filename":"data/vaneerConsumption/PopeMeetsSexAbuseVictimsBearingAPleaForForgiveness.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=329585119_1540249808.html","title":"Pope Meets Sex Abuse Victims, Bearing A Plea For Forgiveness","title_page":"Pope Meets Sex Abuse Victims, Bearing A Plea For Forgiveness : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nAt the Vatican today Pope Francis had his first meeting with victims of clergy. He vowed to hold bishops accountable for the protection of children. The meeting came nearly 16 months after Francis was elected. Victim support groups said it was long overdue. For more on this NPR's Sylvia Poggioli joins us from Rome. Hello Sylvia.\nSYLVIA POGGIOLI, BYLINE: Hello, Robert.\nSIEGEL: And I understand the Pope held a Mass with these victims, including a dramatic homily. What did he say?\nPOGGIOLI: Well, the Pope pronounced his strongest words yet on clerical sex abuse. He begged forgiveness from the victims and said, sex abuse of minors is more than a despicable action, it's like a sacrilegious cult in the church that profaned God. He said, he realizes many have suffered unrelenting emotional and spiritual pain, and even despair, and some have turned to drugs and resorted to suicide. And he vowed that he will not tolerate abusers and that bishops will be held accountable if they shield them.\nSIEGEL: What do we know about the victims who were present with the Pope?\nPOGGIOLI: There were three men and three women - two each from Britain, Germany and Ireland. Names and ages were not revealed. The Vatican spokesman Father Federico Lombardi said, the Pope met for about half an hour with each of them and listened very attentively to their stories. The six participants, he said, were very moved by the encounter. But one victim, 43-year-old Marie Cain, later told the Irish Times she told the pope that cover-ups continue and that he has the power to change things. Now interestingly there were no Americans present, even though the sex abuse scandals erupted first in the U.S. It may be that since American watch-dog groups have been among the most critical of the church, the Vatican may have selected a group of survivors more open to reconciliation and more likely to stay out of the media spotlight.\nSIEGEL: Sylvia, many victims groups have criticized the Pope for being slow to speak out on the issue of sex abuse and he did anger many of those same groups when he said, in an interview in March, that the Catholic Church has done more than any other organization to root out pedophiles. So how are those groups reacting to today's meeting?\nPOGGIOLI: Well, you know, most watch-dog groups won't be satisfied until the Vatican definitively requires all bishops and religious superiors to report suspected cases of sex abuse of minors to civil authorities. And yet the director of bishopaccountability.org, Anne Barrett Doyle, said, that though over-due, the meeting was positive and the Pope's homily recognized the terrible impact of abuse on victim's families. She said, Francis made a significant and historic promise to discipline those who fail to respond adequately to child sexual abuse. But the spokesman for a German survivor group, Norbert Denef, called it a public relations event. Vatican spokesman father Lombardi said it was anything but a PR stunt.\nSIEGEL: Sylvia, I understand that Pope Francis has come in for criticism recently, not for his actions as Pope, but as archbishop of Buenos Aires some years ago.\nPOGGIOLI: Yeah. A recent report by bishopaccountability.org shows that the future Pope was silent on the issue and refused to meet with victims. Just ahead of today's meeting a group of Argentine survivors wrote him a letter expressing pain that they had not been included. And commenting on today's meeting, Anne Barrett Doyle of Bishop of bishopaccountability.org said, avoidance, silence and denial were successful containment tactics in Latin America but they will not work on the global stage and they are not consistent with the mercy and compassion so evident in Francis' papacy.\nSIEGEL: That's NPR's Sylvia Poggioli in Rome talking about Pope Francis' meeting today with six victims of clergy sex abuse. Sylvia, thanks.\nPOGGIOLI: Thank you, Robert.\nSIEGEL: This is ALL THINGS CONSIDERED from NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=329585119"}
 is the audio record.","url":"https://www.npr.org/2014/07/07/329585119/pope-meets-sex-abuse-victims-bearing-a-plea-for-forgiveness"}
