{"authors":[],"date_download":"2018-10-22 21:30:05","date_modify":"2018-10-22 21:30:05","date_publish":"2014-06-05 16:00:26","description":"It comes as Pope Francis' latest move to disassociate himself with the Vatican's murky financial past.","filename":"data/vaneerConsumption/PopeFrancisFiresOldGuardBoardofVaticansFinancialWatchdog.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/489896/140605-pope-francis-jms-1201_90484c785aec7665dc14291ff309b4ba.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_pope-francis-fires-old-guard-board-vaticans-financial-watchdog-n123616_1540243805.html","title":"Pope Francis Fires Old-Guard Board of Vatican's Financial Watchdog","title_page":"Pope Francis Fires Old-Guard Board of Vatican's Financial Watchdog","title_rss":"NULL","source_domain":"nbcnews.com","text":"All five outgoing members were Italians who had been expected to serve five-year terms ending in 2016 and were laymen associated with the Vatican's discredited financial old guard.\nReformers inside the Vatican had been pushing for the pope, who already has taken a series of steps to clean up Vatican finances, to appoint professionals with an international background to work with Rene Bruelhart, a Swiss lawyer who heads the AIF and who has been pushing for change.\nFrancis, who was elected in March 2013 after the resignation of former Pope Benedict, in February set up a new Secretariat for the Economy reporting directly to him and appointed an outsider, Australian Cardinal George Pell, to head it.\nIn January he removed Cardinal Attilio Nicora, a prelate who played a senior role in Vatican finances for more than a decade, as president of the AIF and replaced him with an archbishop with a track record of reform within the Vatican bureaucracy.\nA report last December by Moneyval, a monitoring committee of the Council of Europe, said the Vatican had enacted significant reforms but must still exercise more oversight over its bank.\n- Reuters","url":"https://www.nbcnews.com/news/world/pope-francis-fires-old-guard-board-vaticans-financial-watchdog-n123616"}
