{"authors":["Associated Press"],"date_download":"2018-10-23 04:25:00","date_modify":"2018-10-23 04:25:00","date_publish":"2016-01-11 17:27:52","description":"VATICAN CITY (AP) — Pope Francis insisted Monday that Europe has the means to welcome refugees without compromising its security or culture, saying the conti...","filename":"data/vaneerConsumption/PopeEuropemustfindbalancebetweensecurityandrefugees.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:6ed8d01748ad499aa830d0ee30675871-48qEJGFphM8d437f0aaf927608e3-162_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393703_Pope-calls-bold-creative-response-global-migration_1540268700.html","title":"Pope: Europe must find balance between security and refugees","title_page":"Pope: Europe must find balance between security and refugees | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pope: Europe must find balance between security and refugees\nVATICAN CITY (AP) — Pope Francis insisted Monday that Europe has the means to welcome refugees without compromising its security or culture, saying the continent bears the \"moral responsibility\" to care for others who have fled their homes to seek a better life.\nIn a speech to the Holy See's diplomatic corps, Francis lamented the distinction made between refugees fleeing conflict and persecution and migrants escaping poverty, saying both deserve international protection.\nHuman history has been marked by great waves of migration, he told the ambassadors from the 180 nations that have diplomatic relations with the Holy See. Humanity today must not let security fears replace the principles of respecting the dignity of others, he said.\nPope Francis delivers his message during his annual audience with diplomats, at the Vatican, Monday, Jan. 11, 2016. (Alessandro Bianchi/Pool Photo via AP)\n\"Europe has the means to defend the centrality of the human person and to find the right balance between its twofold moral responsibility to protect the rights of its citizens and to ensure assistance and acceptance to migrants,\" Francis said.\nHe called for a frank and respectful dialogue to begin among countries of migrants' origin, transit and reception \"so that with greater boldness and creativity, new and sustainable solutions can be sought.\"\nFrancis has made migration the top priority of his pontificate: His first trip outside Rome as pope was to the Italian island of Lampedusa, where he celebrated Mass in honor of the thousands of people who have died crossing the Mediterranean and denounced the \"globalization of indifference\" that the world had shown to people fleeing their homes for better lives abroad.\nOn subsequent trips, Francis has visited refugee camps, while closer to home he has opened the Vatican's doors to two refugee families and called on parishes around the world to do the same.\nFrancis devoted nearly his entire speech Monday to the issue, showing the importance it has in the Holy See's foreign policy under the first Latin American pope, who ministered to Paraguayan migrants in the slums of Buenos Aires before his election.\nIn his speech, Francis acknowledged fears about security in the wake of extremist attacks in Europe, Asia and elsewhere. But he said those fears should not result in Europe losing its values of solidarity and humanity.\n\"Human history is made up of countless migrations, sometimes out of an awareness of the right to choose freely, and often dictated by external circumstances,\" he said. Citing Biblical accounts, Francis said today's migrants are \"possessed of the same determination which Moses had to reach a land flowing with milk and honey.\"\n___\nFollow Nicole Winfield at www.twitter.com/nwinfield\nPope Francis delivers his message during his annual audience with diplomats, at the Vatican, Monday, Jan. 11, 2016. (Alessandro Bianchi/Pool Photo via AP)\nPope Francis touches the belly of a woman as he greets unidentified diplomats during his annual audience with diplomats, at the Vatican, Monday, Jan. 11, 2016. (Alessandro Bianchi/Pool Photo via AP)\nPope Francis greets an unidentified diplomat during his annual audience with diplomats, at the Vatican, Monday, Jan. 11, 2016. (Alessandro Bianchi/Pool Photo via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393703/Pope-calls-bold-creative-response-global-migration.html"}
