{"authors":["Lauren Barbato"],"date_download":"2018-10-30 23:16:03","date_modify":"2018-10-30 23:16:03","date_publish":"2014-08-13 21:33:02","description":"Why is Pope Francis so popular? In a recent interview with Religion Dispatches, writer Mary Gordon laid out the reason behind the soaring popularity of Pope Francis, noting after the death of Nelson Mandela, \"the world is looking for a spiritual…","filename":"data/vaneerConsumption/PopeFrancisHistoricSouthKoreaVisitIsntExactlyGoingDownWell.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2181d454-d088-44c3-9c02-15a00f75f574.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35660-pope-francis-historic-south-korea-visit-isnt-exactly-going-down-well_1540941363.html","title":"Pope Francis' Historic South Korea Visit Isn't Exactly Going Down Well","title_page":"Pope Francis' Historic South Korea Visit Isn't Exactly Going Down Well","title_rss":"NULL","source_domain":"bustle.com","text":"Why is Pope Francis so popular? In a recent interview with Religion Dispatches, writer Mary Gordon laid out the reason behind the soaring popularity of Pope Francis, noting after the death of Nelson Mandela, \"the world is looking for a spiritual leader to fill the gap.\" But it looks like there's one country that isn't turning to the pontiff for spiritual guidance. Thousands of South Korean Protestants protested Pope Francis' upcoming visit to the country on Tuesday, decrying Catholicism and encouraging Protestants to reject the religion.\nIt's an unsettling way to welcome Francis to South Korea. The pontiff is expected to arrive in Seoul on Thursday morning for a five-day visit, marking the first papal trip to East Asia in 25 years. During his time there, Francis will meet with South Korean government officials, bishops and other religious leaders, and participate in the celebration of Asian Youth Day, which is sponsored by the Catholic Church. He will also beatify — a special process that makes one blessed and open to veneration— more than 100 South Korean Catholic martyrs who were killed by the government in the 18th and 19th centuries.\nAlthough the South Korean government is welcoming the pontiff, the nation's large and vocal Protestant community has been his hostile toward the affable Francis. According to The Wall Street Journal, event organizers said 10,000 people attended Tuesday's anti-Catholic rally, where South Korean Protestant leaders reportedly called Catholicism a \"perversion of faith.\" Local news outlets, including The Christian Daily, added that the leaders described Catholicism as blasphemy.\nChung Sung-Jun/Getty Images News/Getty Images\nNews of this protest may present a challenge for Francis, who Vatican insiders say is hoping to establish a relationship with South Korea and its neighbors. Although Catholics are a minority in South Korea, their population has been rising in recent years. According to the Catholic News Agency, a report released by the Catholic Pastoral Institute of Korea in 2013 said that there were more than 5.3 million Catholics in South Korea by the end of 2012 — a 1.6 percent increase in one year alone.\n“From the vantage of the global demographics of Roman Catholicism, the pope’s presence is a powerful symbol of the Vatican’s recognition that it is in Asia and sub-Saharan Africa that the church is growing most prominently,” Lionel Jensen, an associate professor at the University of Notre Dame, told The New York Times.\nHowever, Catholics currently make up just under 11 percent of South Koreans. As far as Christianity goes, Protestants account for nearly 20 percent of the population, but there numbers have been declining since the mid-1990s, according to The New York Times. Surveys say there are about 8.6 million Protestants in South Korea, compared to 8.76 million in 1995. Buddhism continues to be the reigning religion in South Korea, though there's no denying that Christianity — whether Catholicism or Protestantism — is taking hold in the region.\nChung Sung-Jun/Getty Images News/Getty Images\nDespite the clashes between South Korea's Protestant and Catholic denominations, many South Koreans are hoping that the pope's visit will spark a conversation — and not hatred — about faith in a country that once persecuted Catholics. \"It is very secularized here in Seoul ... It’s very materialistic,\" Korean schoolteacher Angela Park told Vatican Radio. \"However, God can bring all these needs. He can use secularism to bring Jesus [into] our society.\"\nFrancis, too, is hoping to lift the voices of young South Korean Catholics, advising them to look to their nation's bloody past for inspiration. \"Asian youth, wake up!\" the pontiff said in a video message on Monday. \"The glory of the martyrs shines on you.\"\nImages: Getty Images (3)","url":"https://www.bustle.com/articles/35660-pope-francis-historic-south-korea-visit-isnt-exactly-going-down-well"}
