{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 21:42:56","date_modify":"2018-10-30 21:42:56","date_publish":"2016-12-08 15:35:42","description":"On Thursday, the Vatican confirmed its ruling that men with “homosexual tendencies” cannot be admitted to Catholic seminaries.","filename":"data/vaneerConsumption/PopeFrancisConfirmsBanonHomosexualPriests.json","image_url":"https://media.breitbart.com/media/2016/05/pope-francis.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_08__1540935776.html","title":"Pope Francis Confirms Ban on Homosexual Priests","title_page":"Pope Francis Confirms Ban on Homosexual Priests","title_rss":"NULL","source_domain":"breitbart.com","text":"With Pope Francis’ approval, the Vatican has restated its ruling that men with “homosexual tendencies” cannot be admitted to Catholic seminaries.\nIn a new document titled “The Gift of the Priestly Vocation,” the Vatican’s Congregation for Clergy offers extensive guidelines for priestly formation including a section devoted to “Persons with Homosexual Tendencies.”\nThe document, dated December 8, draws extensively from a 2005 text issued by the Vatican’s Congregation for the Doctrine of the Faith, stating that men “who practice homosexuality, present deep-seated homosexual tendencies or support the so-called ‘gay culture’” are ineligible for the Catholic priesthood.\nSuch persons “find themselves in a situation that gravely hinders them from relating correctly to men and women,” the text states. “One must in no way overlook the negative consequences that can derive from the ordination of persons with deep-seated homosexual tendencies.”\nThough published in 2005, the earlier Vatican document barring gays from studying for the priesthood was drafted soon after the clergy sexual abuse scandal broke in the spring of 2002 as part of a Church-wide effort to address the problem of abuse.\nStudies on the crisis revealed that over 80 percent of the victims of clergy sexual abuse were male. In 2004, the research committee of the National Review Board for the Protection of Children and Young People prepared a comprehensive report on the crisis. The head of the committee, Washington lawyer Robert S. Bennett, said that any evaluation of the causes and context of the crisis “must be cognizant of the fact that more than 80 percent of the abuse at issue was of a homosexual nature.”\n“That eighty-one percent of the reported victims of child abuse by Catholic clergy were boys shows that the crisis was characterized by homosexual behavior,” the report stated.\nAccording to the Boston Globe, Bennett said formation personnel had not screened candidates for the priesthood properly, “allowing many sexually dysfunctional and ‘immature’ men into seminaries; and seminaries did not adequately prepare students for the priesthood, particularly for the challenge of remaining celibate.”\nIn 2008, the Vatican released another document on priestly formation, noting that formation personnel needed to look more closely at “areas of immaturity” that could make candidates unsuitable for the priesthood, including “strong affective dependencies,” “uncertain sexual identity” and “deep-seated homosexual tendencies.”\nThursday’s document states that homosexual tendencies that are only the expression of a “transitory problem” do not constitute an insurmountable obstacle to the priesthood, but “such tendencies must be clearly overcome at least three years before ordination to the diaconate.”\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2016/12/08/pope-francis-confirms-ban-homosexual-priests/"}
