{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:28","date_modify":"2018-10-30 18:48:28","date_publish":"2015-10-04 13:17:59","description":"The Pope says the Bible readings of the liturgy of the day seemed especially chosen as the most opportune for the synod that begins today.","filename":"data/vaneerConsumption/PopeFrancisLifelongMarriageIsNotaQuaintRelicofthePastbutGodsDreamforHumanity.json","image_url":"https://media.breitbart.com/media/2015/10/Pope-Mass-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_04__1540925308.html","title":"Pope Francis: Lifelong Marriage Is Not ‘a Quaint Relic of the Past’ but ‘God’s Dream’ for Humanity","title_page":"Pope Francis: Lifelong Marriage Is Not ‘a Quaint Relic of the Past’ but ‘God’s Dream’ for Humanity | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pope Francis is reminding the world that the Christian understanding of marriage is as a lifelong commitment of fruitful love between a man and a woman.\nThe Pope, kicking off the Vatican synod on marriage and family, said that the Bible readings of the liturgy of the day seemed especially chosen as the most opportune for the synod that begins today.\nIn the gospel reading of the Mass, in fact, Jesus teaches about the binary nature of gender as male or female, as well as the indissolubility of marriage.\nFrom the beginning of creation, Jesus reminds his hearers, God made people “male and female.”\n“For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh. So they are no longer two but one flesh. Therefore what God has joined together, no human being must separate,” he said.\nThe reading also contains Christ’s difficult teaching on divorce, which the Catholic Church continues to uphold.\n“Whoever divorces his wife and marries another commits adultery against her; and if she divorces her husband and marries another, she commits adultery,” Jesus said.\nThe Pope said that Christian marriage is a cure for much of the solitude experienced by men and women in our own day. Our world, he said is characterized by loneliness and paradoxes. Today we enjoy “many sophisticated means of entertainment, but a deep and growing interior emptiness; many pleasures, but few loves; many liberties, but little freedom.”\nPeople need the family, even if they don’t realize it, Francis said. “People are less and less serious about building a solid and fruitful relationship of love: in sickness and in health, for better and for worse, in good times and in bad. Love which is lasting, faithful, conscientious, stable and fruitful is increasingly looked down upon, viewed as a quaint relic of the past.”\nLoneliness is overcome by self-giving, Francis said. God “made men and women for happiness, to share their journey with someone who complements them, to live the wondrous experience of love: to love and to be loved, and to see their love bear fruit in children.”\nDuring his recent trip to the United States, the Pope criticized the Supreme Court ruling allowing same-sex marriage, warning that in America marriage has been stretched and distorted to the point where it is no longer resembles the Christian sacrament of matrimony.\n“Until recently,” the Pope said, “we lived in a social context where the similarities between the civil institution of marriage and the Christian sacrament were considerable and shared. The two were interrelated and mutually supportive.”\n“This is no longer the case,” he said.\nOn Sunday, the Pope reiterated the nature of marriage as the union of one man and one woman.\n“This is God’s dream for his beloved creation: to see it fulfilled in the loving union between a man and a woman, rejoicing in their shared journey, fruitful in their mutual gift of self,” he said.\nIt is God, Francis said, who “blesses human love.” It is he “who joins the hearts of two people who love one another, he who joins them in unity and indissolubility.”\nFor God, he continued, “marriage is not some adolescent utopia, but a dream without which his creatures will be doomed to solitude!”\nIn his homily at Mass, Francis twice quoted his immediate predecessor Pope Benedict XVI.\n“Forbidden pleasures lost their attraction at the very moment they stopped being forbidden. Even if they are pushed to the extreme and endlessly renewed, they prove dull, for they are finite realities, whereas we thirst for the infinite,” he said, quoting Ratzinger.\nFrancis said that in the extremely difficult situation of the world today, the Church is called to be a voice crying out in the desert, “in defending faithful love and encouraging the many families which live married life as an experience which reveals of God’s love; in defending the sacredness of life, of every life; in defending the unity and indissolubility of the conjugal bond as a sign of God’s grace and of the human person’s ability to love seriously.”\nThe truth protects people from the temptation of “turning fruitful love into sterile selfishness” and “faithful union into temporary bonds,” Francis said.\nThe Pope’s literal reading of Jesus’ words on marriage seemed as well to be a subtle rebuke of the position taken by German Cardinal Walter Kasper, who recently said that taking Jesus’ teaching on marriage and adultery at face value is like clinging to the belief that God literally created the world in six days.\nWhile Cardinal Kasper thinks that Jesus’ words require updating, the Pope seems to respectfully disagree.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/politics/2015/10/04/pope-francis-lifelong-marriage-not-quaint-relic-past-gods-dream-humanity/"}
