{"authors":[],"date_download":"2018-10-22 21:55:56","date_modify":"2018-10-22 21:55:56","date_publish":"2015-10-26 00:00:00","description":"Catholic bishops wrapped up a three-week gathering at the Vatican this weekend that focused on family issues, but was overshadowed by doctrinal differences.","filename":"data/vaneerConsumption/PopeFrancisChallengedInSynodShowingVaticanDivisions.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=451858186_1540245356.html","title":"Pope Francis Challenged In Synod Showing Vatican Divisions","title_page":"Pope Francis Challenged In Synod Showing Vatican Divisions : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nNow let's talk about the debate in another assembly - of Catholic bishops. They came from all over the world to a meeting called a synod in Rome.\nDAVID GREENE, HOST:\nThe meeting showed a church divided over family issues. Here's NPR's Sylvia Poggioli.\nSYLVIA POGGIOLI, BYLINE: At Saturday's final media briefing, Father Thomas Rosica said this synod was unlike all previous ones. Pope Francis, he added, has put the church on a long journey.\n(SOUNDBITE OF ARCHIVED RECORDING)\nTHOMAS ROSICA: And we're not used to those kind of journeys. We were used to precooked synods with everything already done, documents all written by the time people got here. Your stories were already done. And that didn't happen this time.\nPOGGIOLI: By just one vote, a two-thirds majority of bishops offered some hope for divorced and civilly remarried Catholics to one day receive communion again, a victory for the progressives. But that came after some nasty incidents. In a leaked letter, 13 conservative cardinals complained the synod was rigged to get predetermined results. And in interviews, some bishops vented their anxieties about the synod outcome. Father Thomas Reese, senior analyst for the National Catholic Reporter, had never heard prelates so publicly disrespectful of a pope.\nTHOMAS REESE: Never before at a synod would cardinals challenge the way that the pope had organized the synod to be run, cardinals referring to the pope as the Protestant pope, or using really derogatory language about him and where he was leading the church.\nPOGGIOLI: The conservatives prevailed on the other hot-button issue. a more welcoming stance for gay people. The document said the dignity of every individual must be respected, but same-sex unions cannot be recognized as marriages. It also acknowledged the legitimacy of African bishops concerns over ideological colonization. This is how Cardinal Philippe Ouedraogo of Burkina Faso described it.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPHILIPPE OUEDRAOGO: (Through interpreter) To obtain financial aid, developing countries are pressured to pass laws on abortion, gender theory, homosexuality and euthanasia.\nPOGGIOLI: Belgian bishop Lucas Van Looy hopes the synod experience will be embraced by the whole church.\n(SOUNDBITE OF ARCHIVED RECORDING)\nLUCAS VAN LOOY: (Through interpreter) I would say it's the end of a church that passes judgment on people and all situations. It is a church that welcomes, that accompanies, that listens, a church that also speaks with clarity.\nPOGGIOLI: Exactly the kind of church Pope Francis says he wants. Sylvia Poggioli, NPR News, Rome.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=451858186"}
