{"authors":["Nick Hallett"],"date_download":"2018-10-30 18:47:16","date_modify":"2018-10-30 18:47:16","date_publish":"2016-11-08 14:45:01","description":"Gender ideology has spread so far and wide that the Pope must issue a high-level document to correct its errors, a Dutch cardinal has said.","filename":"data/vaneerConsumption/PopeNeedstoWarnPeopleonDangersofGenderTheorySaysCardinal.json","image_url":"https://media.breitbart.com/media/2016/07/Screen-Shot-2016-01-17-at-13.29.23-640x480.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_08__1540925236.html","title":"Pope Needs to 'Warn People' on Dangers of Gender Theory, Says Cardinal","title_page":"Pope Needs to 'Warn People' on Dangers of Gender Theory, Says Cardinal","title_rss":"NULL","source_domain":"breitbart.com","text":"Gender ideology has spread so far and wide that the Pope may need to issue a high-level document to correct its errors, a Dutch cardinal has said.\nCardinal Willem Eijk, Archbishop of Utrecht, said many Catholics were being “misled” by gender theory to the point where they believed their children can choose their own genders, partly because “they don’t hear anything else”.\nHe said a papal encyclical or other similar document “might appear to be necessary” to spell out church teaching on the issue, adding that it urgently needed to communicate the truth of its teaching on the human body.\n“Perhaps a document only on this problem might be an urgent question,” he told Catholic News Service, adding: “[Gender theory] is spreading and spreading everywhere in the Western world, and we have to warn people.”\n“From the point of moral theology, it’s clear — you are not allowed to change your sex in this way,” he asserted.\nThe cardinal added that many Catholics are now beginning to accept gender ideology “in a very easy way, even parents, because they don’t hear anything else.”\nThe ideology is in turn leading to a new intolerance against all who disagree, especially traditional Christians, Cardinal Eijk added.\n“We are living in a quite intolerant society,” he said. “People are talking about tolerance and they say the individual is free to think what he likes but in practice… people have to accept this certain view of man, this dualistic view of man and this view of the body as something that is mouldable.\n“And when you say perhaps that is not a morally good way, you are excluded,” he added.\n“You have to think according to these modern theories or you are excluded — it’s [permeating] the university world, Parliament, the mass media.\nHe warned that life will become more difficult for Christians as the ideology gains further hold over society, with Catholics facing legal sanctions and even jail for their views.\nYoung people offer some hope, however, as the minority of young Catholics who remain active in church life “accept the whole faith”.\n“It will be the force of the future,” he said. “I think we will be a tiny Church, a small fraction of the population at least in the Netherlands, but the Christians who remain will have a life of prayer, a personal relationship with Christ, and they will be clear about the faith and willing to testify to it.\n“It will be a tiny church, but a convinced church, and it will be willing to suffer.”","url":"https://www.breitbart.com/europe/2016/11/08/pope-needs-warn-people-dangers-gender-theory-says-cardinal/"}
