{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:57:49","date_modify":"2018-10-30 20:57:49","date_publish":"2017-01-17 14:57:28","description":"On Saturday Pope Francis received Palestinian President Mahmoud Abbas and inaugurated the new Embassy of Palestine to the Holy See.","filename":"data/vaneerConsumption/PopeFrancisInauguratesFirstPalestinianEmbassytotheVatican.json","image_url":"https://media.breitbart.com/media/2017/01/abbas-pope-francis.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_17__1540933069.html","title":"Pope Francis Inaugurates First Palestinian Embassy to the Vatican","title_page":"Pope Francis Inaugurates First Palestinian Embassy to the Vatican","title_rss":"NULL","source_domain":"breitbart.com","text":"This weekend Pope Francis received Palestinian President Mahmoud Abbas in the Vatican and formally inaugurated the new Embassy of the State of Palestine to the Holy See.\nAbbas met with the pontiff at the Vatican for some 20 minutes on Saturday just before the opening of diplomatic offices on Via di Porta Angelica, just outside the Vatican City, in a building that also houses the embassies of Peru, Ecuador and Burkina Faso.\nThe new Palestinian embassy, said Abbas, “is a sign that the Pope loves the Palestinian people and peace.” The Vatican recognized the state of Palestine about a year and a half ago.\nAfter the meeting, Abbas also said that he hopes “other states will follow the Holy See’s example.”\n“We are proud to be the birthplace of Christianity and about having one of the oldest Christian communities in the world,” he said.\nDuring the meeting, Abbas offered the Pope several gifts, including a stone from Mount Golgotha. Reciprocating, Francis gave the Palestinian President a jubilee year medal as well as an Arabic version of his two teaching letters Amoris Laetitia (the Joy of Love) and Laudato Sì, on the care of the environment.\nThe Holy See began referring to Palestine as a “state” as of November 2012, when the United Nations voted to recognize it as a nonmember observer state, but only formally recognized Palestinian statehood in a legal document in May of 2015.\nOn Sunday, Abbas traveled to Paris to participate in an international conference that aims to promote the resumption of peace talks between Israel and the Palestinians. Israel did not participate in the conference.\nAbbas took advantage of the meeting to express his opposition to the plan of U.S. president-elect Donald Trump to transfer the U.S. embassy from Tel Aviv to Jerusalem.\n“Any attempts at legitimizing the illegal Israeli annexation of the city will destroy the prospects of any political process, bury the hopes for a two-state solution, and fuel extremism in our region, as well as worldwide,” he said in a statement.\nThe status of the city is one of the most crucial and complex issues of debate underlying the peace process in the Middle East. Israel proclaims the entire city as its capital, while the Palestinians believe that East Jerusalem should be the capital of the future Palestinian state.\nLast fall, Pope Francis seemed to acknowledge that God promised the Holy Land to the people of Israel, during an address delivered in the Vatican.\nThe people of Israel “walked through the desert for forty years until they reached the land promised by God,” he said.\nFrancis also made news in late 2015 when he stated that attacks on the State of Israel and its right to exist constitute anti-Semitism.\n“To attack Jews is anti-Semitism, but an outright attack on the State of Israel is also anti-Semitism,” Francis said in a private audience with delegates from the World Jewish Congress (WJC).\n“There may be political disagreements between governments and on political issues, but the State of Israel has every right to exist in safety and prosperity,” he said.\nThe Holy See established formal diplomatic relations with the State of Israel in 1993, and early the next year the Vatican set up a nunciature in Israel and an Israel established an embassy to the Holy See.\nLast week, in his yearly address to the diplomatic corps, Pope Francis launched an appeal for peace in the Middle East, specifically summoning “Israelis and Palestinians” to resume talks aimed at finding “a stable and enduring solution” to conflicts.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/middle-east/2017/01/17/pope-francis-inaugurates-first-palestinian-embassy-holy-see/"}
