{"authors":["Breitbart London"],"date_download":"2018-10-30 19:39:35","date_modify":"2018-10-30 19:39:35","date_publish":"2017-04-16 10:38:07","description":"Pope Francis began his traditional Easter mass in Rome on Sunday with thousands of the faithful being subjected to heightened security.","filename":"data/vaneerConsumption/PopesEasterAddressMarkedbyHeightenedSecurity.json","image_url":"https://media.breitbart.com/media/2017/04/Pope-Francis.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_16__1540928375.html","title":"Pope's Easter Address Marked by Heightened Security","title_page":"Pope's Easter Address Marked by Heightened Security","title_rss":"NULL","source_domain":"breitbart.com","text":"VATICAN CITY (AFP) – Pope Francis began his traditional Easter mass in Rome on Sunday with thousands of the faithful being subjected to heightened security measures.\nThe Easter mass, the highlight of the Christian calendar, started at 0800 GMT under a cloudy sky where worshippers had gathered since the early hours to gain access. Heavy rain lashed down for several minutes around one hour later.\nThe mass followed Francis’s Good Friday prayer in which he deplored the suffering of migrants, victims of racism and the persecution of Christians around the world.\nA week of Easter events had a bloody beginning last Sunday when attacks claimed by the Islamic State group on two Coptic churches in Egypt left 45 people dead.\nThe entire area around St Peter’s Basilica was blocked, with only several access points for those admitted after their bags had been inspected.\nAccess to St Peter’s Square itself was only possible after security checks similar to those at airports. Hundreds of police and security forces stood guard.\nMass was to be followed by the traditional Urbi et Orbi blessing, to the city and the world, from the Argentine pope at around 1000 GMT.","url":"https://www.breitbart.com/europe/2017/04/16/pope-easter-address-heightened-security/"}
