{"authors":[],"date_download":"2018-10-30 01:07:55","date_modify":"2018-10-30 01:07:55","date_publish":"2016-02-19 00:00:00","description":null,"filename":"data/vaneerConsumption/PopeFrancisImonlyamaterialguy.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_02_pope_francis_im_only_a_material_goy_1540861675.html","title":"Pope Francis: I'm only a material guy","title_page":"Pope Francis: I'm only a material guy","title_rss":"NULL","source_domain":"americanthinker.com","text":"Pope Francis: I'm only a material guy\nPope Francis travels the world canoodling with dictators and mass murderers like Raúl Castro and Hassan Rouhani. Breitbart reported that Pope Francis spent yesterday \"slapping Americans in the face from across the U.S.-Mexico border.\" The pontiff specifically insulted capitalism: \"The flow of capital cannot decide the flow of people.\" This is particularly senseless because he was referring to people who are trying to illegally escape into capitalism. Today, while kicking back on his jet, returning to the most heavily walled city in the world, the pope denigrated the Christianity of millions of Americans who support building a wall at the southern border. The pejorative \"capitalism\" to describe private enterprise was coined by Marx and Engels. Pope Francis is demonstrating the truism that when Christianity and Marxism marry, they became one, and that one is Marxism. That is inevitable because Christianity and Marxism are not merely an odd couple; they are irreconcilably different. One brings love; the other knows only how to bully. For all the high-sounding twaddle about liberation theology, theology is just another ology, and ologies have nothing to do with love. Christianity is the human response to God's love and all forms of socialism, including the pope's sermon-draped materialism, depend on man-made law enforced by man-made guns.\nThe pope's gig traces to Peter. The gist of his anti-capitalist pronouncements traces to Karl. But there's an ironic twist. Marxism is an economic theory built around inevitable revolution due to class struggle. Karl must be spinning, because the Pope's brand of Marxism is to spread the world's greatest anti-revolutionary message. Workers of the world, run for the border, and then maybe unite! The pope is a dream come true for the ruling class of Mexico. Francis is the world's preeminent bourgeois reactionary, exhorting people to skip the class struggle and reject the revolution. Just run away from your homes, families, and country and invade the United States. Plenty of people there insist that other Americans take care of you and your extended families.","url":"https://www.americanthinker.com/blog/2016/02/pope_francis_im_only_a_material_goy.html"}
