{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:17:43","date_modify":"2018-10-30 21:17:43","date_publish":"2015-07-08 19:20:34","description":"Pop star Ariana Grande issued a statement of apology Wednesday after she was caught on video saying she \"hates Americans\" and \"hates America\" while licking donuts she hadn't purchased. |","filename":"data/vaneerConsumption/PopPrincessArianaGrandeApologizesforSayingIHateAmericabyFatShaming.json","image_url":"https://media.breitbart.com/media/2015/07/Grande-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_08__1540934263.html","title":"Pop Princess Ariana Grande Apologizes for Saying ‘I Hate America’ - by Fat Shaming","title_page":"Pop Princess Ariana Grande Apologizes for Saying ‘I Hate America’ — by Fat Shaming | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pop star Ariana Grande issued a statement of apology Wednesday after she was caught on video saying she “hates Americans” and “hates America” while licking donuts she hadn’t purchased.\nIn a video first obtained by TMZ, Grande is seen in a donut shop with her boyfriend on July 4. Grande and her boyfriend appear to lick donuts that had been placed on the counter, that were then ostensibly purchased by other customers.\n“What the f*ck is that?” Grande says loudly to her boyfriend as a fresh tray of donuts is placed on the counter. “I hate Americans. I hate America.”\nIn a statement, Grande said her words were “taken out of context” and apologized for “not using more discretion with my choice of words.”\n“I am EXTREMELY proud to be an American and I’ve always made it clear that I love my country,” Grande said. “As an advocate for healthy eating, food is very important to me and I sometimes get upset by how freely we as Americans eat and consume things without giving any thought to the consequences that it has on our health and society as a whole.”\nThe video may have already cost Grande a headlining slot at the MLB All-Star Game concert this weekend, although Grande said in her statement that she cancelled because of “emergency oral surgery.” Whatever the reason, Demi Lovato has officially been selected to replace Grande at this weekend’s concert.\nCheck out Grande’s full statement below:","url":"https://www.breitbart.com/entertainment/2015/07/08/pop-princess-ariana-grande-apologizes-for-saying-i-hate-america-by-fat-shaming/"}
