{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:31:38","date_modify":"2018-10-30 18:31:38","date_publish":"2018-07-24 21:59:09","description":"Singer Demi Lovato on Tuesday was reportedly rushed to a Los Angeles hospital for an apparent heroin overdose.","filename":"data/vaneerConsumption/PopStarDemiLovatoStableAfterSuspectedHeroinOverdose.json","image_url":"https://media.breitbart.com/media/2018/07/DemiLovato1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_07_24__1540924298.html","title":"Pop Star Demi Lovato 'Stable' After Suspected Heroin Overdose","title_page":"Report: Pop Star Demi Lovato 'Stable' After Suspected Heroin Overdose","title_rss":"NULL","source_domain":"breitbart.com","text":"Pop superstar Demi Lovato on Tuesday was reportedly rushed to a Los Angeles hospital for an apparent heroin overdose.\nLovato, who was found unconscious inside her Hollywood Hills at the time of the incident, was treated with Naracan as she was transported for emergency treatment before noon. LAPD and LAFD responded to a medical emergency at the 8000 block of Laurel View Dr. at 11:40 a.m., Los Angeles Police Department confirmed to People.\nA source tells the magazine the singer is “okay and stable.” “Demi was out Monday night celebrating a friend’s birthday in West Hollywood, and we’re told she posted photos on her private Instagram of herself and others in the group. She seemed happy in the pics,” TMZ reports.\nThe 25-year-old celebrated six years of sobriety in March — yet her new song indicates she may no longer be sober. The pop star released “Sober ” on YouTube this month, singing lyrics like: “Momma, I’m so sorry I’m not sober anymore/And daddy please forgive me for the drinks spilled on the floor.” Lovato tweeted a link to the song with the words “My truth.”\nThe singer-actress struggled with an eating disorder, self-mutilation and other issues, entering rehab in 2010. She has spoken out about her battles with drugs and alcohol over the years, and she’s become a role model for young women and men who have faced their own issues.\nLovato was scheduled to perform in Atlantic City on Thursday.\nThe Associated Press contributed to this report.","url":"https://www.breitbart.com/entertainment/2018/07/24/singer-demi-lovato-rushed-to-hospital-for-suspected-heroin-overdose/"}
