{"authors":[],"date_download":"2018-10-30 18:40:45","date_modify":"2018-10-30 18:40:45","date_publish":"2016-12-15 22:18:00","description":"The original issues were mostly related to food storage at the DeKalb County restaurant.","filename":"data/vaneerConsumption/PopularDeKalbChinesedeliveryspotrecheckedafterbadhealthgrade.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/06/Images/photos.medleyphoto.11264797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_popular-dekalb-c_8a41c2695b3c0870ee553e90455ce07a__1540924845.html","title":"Popular DeKalb Chinese delivery spot rechecked after bad health grade","title_page":"Popular DeKalb Chinese delivery spot rechecked after bad health grade","title_rss":"NULL","source_domain":"ajc.com","text":"Update: The restaurant was reinspected Wednesday and got a 96. Read the new report here.\nOriginal story: Golden Sun, a popular Tucker Chinese delivery restaurant, failed a health inspection this week after a health inspector noted a variety of issues.\nThe Lawrenceville Highway eatery, located in the Cofer Crossing shopping center, received a 64/U on the Thursday afternoon check, according to the report. It was a far fall from the 96 the restaurant got in July.\nManager Sunny Sum told The Atlanta Journal-Constitution she's very upset and regretful about the issues and is training employees immediately to correct the problems. She said the restaurant will definitely pass the next check.\nThe issues were mostly related to food storage.\nThe inspector found chicken stored on the floor, as well as cooked and raw meat stored together.\nChicken wings were seen \"cooling\" on the counter top.\nRubber gloves were \"stored\" in the sink, the report said.\nRestaurants that fail health checks are typically inspected again within 10 days.\nGolden Sun 4349 Lawrenceville Highway, Tucker Score: 64/U See the full report here.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/popular-dekalb-chinese-delivery-spot-rechecked-after-bad-health-grade/agKU9HZ5o7Jj4PV8DvqxsO/"}
