{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:34:38","date_modify":"2018-10-30 21:34:38","date_publish":"2016-03-08 09:18:30","description":"Steven Satterfield, who helms the kitchen at the\nmuch-lauded restaurant Miller Union...","filename":"data/vaneerConsumption/PopularAtlantachefscookbookgetsbignomination.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_po_c617207c7e431737f4e3e569e8223a48__1540935278.html","title":"Popular Atlanta chef's cookbook gets big nomination","title_page":"Popular Atlanta chef's cookbook gets big nomination","title_rss":"NULL","source_domain":"ajc.com","text":"Steven Satterfield, who helms the kitchen at the much-lauded restaurant Miller Union , can add \"award-nominated cookbook author\" to his resume.\nSteven Satterfield with two dishes from his first cookbook, \"Root to Leaf: A Southern Chef Cooks Through the Seasons,\" including Spinach Salad with Strawberries and Rhubarb Vinaigrette and Southern risotto. (styling by chef Steven Satterfield) (Photography by Renee Brock/Special)\nSatterfield's first cookbook, \"Root to Leaf,\" which was released a year ago , was nominated yesterday for a Julia Child First Book Award from the International Association of Culinary Professionals.\nThe book offers up veggie-focused recipes, not a surprise from Satterfield, who has dazzled with his salads and vegetables, amongst other dishes.\nIt's a big few weeks for Satterfield -- he was named a semifinalist for the James Beard Foundation Awards' Best Chef: Southeast category , and he's participating in the 2016 Taste of Tulum Guest Chef Series at Zamas Hotel in Mexico from March 17-21, incorporating his book’s method of using the whole vegetable from root to leaf into his menu.\nAnd in December, he posed in nothing but an apron for a charity calendar .\nThe IACP Cookbook Awards have been formally presented by IACP since 1986. Julia Child lent her support by allowing her name to be associated with the program through a new category to honor the best first cookbook.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/popular-atlanta-chef-cookbook-gets-big-nomination/yTgfSZ1j0FVuUy3RzK7PPO/"}
