{"authors":[],"date_download":"2018-10-30 19:46:07","date_modify":"2018-10-30 19:46:07","date_publish":"2018-08-16 20:11:00","description":"A popular Dunwoody Mexican restaurant failed its recent health inspection with a variety of issues, including a “slime substance” on soda gun nozzles and raw beef stored in “Thank You” bags.El Azteca, 1412 Dunwoody Village Parkway, received a 52 recently but has been rechecked.","filename":"data/vaneerConsumption/PopularDunwoodyMexicanspotrevisitedafterbadcheckfliesfound.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/11/08/Videos/4220839.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_popular-dunwoody_147cf679d911c3f99a1cf7499f198f2d__1540928767.html","title":"Popular Dunwoody Mexican spot revisited after bad check; flies found","title_page":"Popular Dunwoody Mexican spot revisited after bad check; flies found","title_rss":"NULL","source_domain":"ajc.com","text":"Update: El Azteca has passed a re-inspection, though some issues were found, including flies. The restaurant received a 72 score. A 70 is needed to pass. Read the new report: here.\nOriginal:\nA popular Dunwoody Mexican restaurant failed its recent health inspection with a variety of issues, including a “slime substance” on soda gun nozzles and raw beef stored in “Thank You” bags.\nEl Azteca, 1412 Dunwoody Village Parkway, received a 52 last Wednesday, according to the inspector’s report.\nManager Darren Benda said Thursday the failure was an “aberration.”\n“All issues, in my eyes, have been eliminated,” he said. “We’ve retrained just about everyone on the staff.”\nREAD: DeKalb worker gets creative to save 8-week-old puppy from pipe\nREAD: Brother: Atlanta family saw miraculous sights in New Mexico desert\nREAD: Brookhaven is getting a ‘world-class’ dog park\nThe report notes that some foods weren’t stored at the correct temperatures; insect killer stored next to napkins and straws; and “old food residue” on some food prep surfaces.\nRestaurants that fail are typically rechecked within 10 business days.\nEl Azteca\n1412 Dunwoody Village Parkway, Dunwoody\nScore: 52\nReport: here.","url":"https://www.ajc.com/news/local/popular-dunwoody-mexican-spot-fails-inspection-with-slime-substance/DZK7MOmXuacpJZnigx652L/"}
