{"authors":[],"date_download":"2018-10-30 20:17:24","date_modify":"2018-10-30 20:17:24","date_publish":"2016-02-15 20:06:49","description":"The Berry College eagle family, so popular they have their own Facebook page, grew on Valentine’s Day.","filename":"data/vaneerConsumption/PopularBerryCollegeeaglefamilywelcomesnewestadditions.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/15/Images/photos.medleyphoto.8691533.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_popular-berry-co_068a0b85a7ba8aa09d702983ae050eb5__1540930644.html","title":"Popular Berry College eagle family welcomes newest additions","title_page":"Popular Berry College eagle family welcomes newest additions","title_rss":"NULL","source_domain":"ajc.com","text":"The Berry College eagle family, so popular they have their own Facebook page, grew on Valentine’s Day.\nOne eaglet, B6, arrived just after 7:30 p.m. Sunday, according to the Berry College Eagles Facebook page, which has more than 112,000 likes and counting. A second one, B7, made its debut about 2:12 p.m. Monday.\nB6 and B7 are the sixth and seventh eaglets hatched at Berry College since the parent eagles landed on the campus in 2012, Berry College spokeswoman Chris Reinolds Kozelle said.\nTwo eaglets, B1 and B2, were born in early 2013; another, B3, in early 2014; and two more eaglets, B4 and B5, in 2015.\nThe incubation period for the eggs is about 35 days. The newest eaglets are expected to leave the nest by May.\nThe eagle family has nested atop a tall pine tree between the main entrance and the parking lot of the Steven J. Cage Athletic and Recreation Center, according to the college’s website.\nThe eagles’ nest is about the size of a king-sized bed, Reinolds Kozelle said. Eagles are typically 30 to 37 inches long with wingspans ranging from of 72 to 90 inches wide.\nFans of the eagles can keep an eye on the them through Berry College’s Eagle Cam, which allows virtual access to the birds from anywhere. The Eagle Cam has recorded millions of views.","url":"https://www.ajc.com/news/local/popular-berry-college-eagle-family-welcomes-newest-additions/9BPrkUjQvIqDUa4eZXLgWJ/"}
