{"authors":[],"date_download":"2018-10-30 20:08:46","date_modify":"2018-10-30 20:08:46","date_publish":"2017-03-30 16:15:00","description":"The Junior League of Atlanta, Inc. announced this week that, due to competition in the industry, it is closing the shop, which was its oldest fundraiser.","filename":"data/vaneerConsumption/PopularDeKalbthriftshopclosingafter68years.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/30/Images/nn_interior.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_popular-dekalb-thrift-shop-closing-after-years__1540930126.html","title":"Popular DeKalb thrift shop closing after 68 years","title_page":"Popular DeKalb thrift shop closing after 68 years","title_rss":"NULL","source_domain":"ajc.com","text":"The Nearly New Shop, a destination for Atlanta and DeKalb County thrifters for nearly 70 years, is closing down.\nThe Junior League of Atlanta, Inc. announced this week that, due to high competition in the industry, it is closing the shop, which was its longest fundraiser.\nThe women’s civic organization is hosting a farewell celebration on April 8 from noon to 3 p.m., ahead of the closing on April 30. Merchandise will be up to 60 percent off during the celebration, which will also feature food and giveaways.\nThe store, located at 2927 N. Druid Hills Road near Emory University, has generated millions of dollars to support JLA’s charitable programs.\nThe organization said its chapters across the country are moving away from thrift shops.\n“Nearly New has thrived for many years, enabling the Junior League of Atlanta to make a lasting impact on the local community,” JLA president Deanna Anderson said in a news release. “Unfortunately, multiple factors including increased competition, an ongoing decrease in revenue and the need to meet the evolving needs of our volunteers necessitated this decision.”","url":"https://www.ajc.com/news/local/popular-dekalb-thrift-shop-closing-after-years/3qZlmZu11je0NhvuWyhQGI/"}
