{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 00:20:07","date_modify":"2018-10-23 00:20:07","date_publish":"2016-01-29 13:10:28","description":"Wrestler Dean Powell, 36, attacked Michelle Thorne, pictured, at a hotel in Kent. The brute, from Maidenhead, Berkshire, later assaulted the glamour girl and her dad at their marital home.","filename":"data/vaneerConsumption/PornstarMichelleThornewasassaultedatknifepointbywrestlerDeanPowell.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2A6AB00000578-0-image-a-35_1454074698384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422758_Porn-star-assaulted-knifepoint-estranged-wrestler-husband-home-Christmas_1540254007.html","title":"Pornstar Michelle Thorne was assaulted at knifepoint by wrestler Dean Powell","title_page":"Pornstar Michelle Thorne was assaulted at knifepoint by wrestler Dean Powell | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Powell, from Maidenhead, Berkshire, was convicted at Bristol Crown Court\nAfter second attack, Powell calmly made a cup of tea and waited for police\nThe estranged husband of one of Britain's best-known porn stars is behind bars after a terrifying knifepoint assault on her and her father.\nWrestler Dean Powell, 36, attacked Michelle Thorne at a hotel in November when he grabbed her around her neck and dragged her to a room.\nThe brute also assaulted the glamour girl and her dad at their marital home when she tried to throw him out a few days after Christmas.\nWrestler Dean Powell, 36, attacked Michelle Thorne, pictured, at a hotel in November when he grabbed her around her neck and dragged her to a room\nHe stamped on a PlayStation 3 game several times before making threats and arming himself with knives.\nWhen Michelle's father Michael appeared on the scene and put Powell in a headlock, the wrestler head-butted and bit him, causing a nose bleed.\nAfter the second attack Powell calmly made himself a cup of tea and sat down and waited for police to arrive and arrest him.\nPowell, now living with his parents in Maidenhead, Berkshire, admitted six charges of assaults, making threats to kill, property damage and possessing a blade.\nJudge William Hart adjourned the case for sentence until next month and remanded him in custody.\nHe warned him at Bristol Crown Court: 'It seems inevitable you will receive a custodial sentence.\n'There may be an application for a restraining order. That will be considered on its merits.'\nAt an earlier hearing May Li, prosecuting, told magistrates the couple had been in a relationship since 2009 and married in 2010.\nShe said Powell assaulted former X Factor hopeful Michelle when they attended a junior dance competition at a Kent hotel on November 21.\nHe grabbed her around her neck and took her to a room - wrestling a concerned mum out of the way.\nJust over a month later he attacked her a second time, on December 29 at their marital home in Mangotsfield, Bristol.\nMichelle's adult film career began in 1999 with All Amateur: Girls of the UK.\nShe has worked with production companies such as Bluebird Films, Extreme Associates, and Union Jaxxx. She also has her own production company called Bombchelle Productions.","url":"https://www.dailymail.co.uk/news/article-3422758/Porn-star-assaulted-knifepoint-estranged-wrestler-husband-home-Christmas.html"}
