{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 21:31:09","date_modify":"2018-10-30 21:31:09","date_publish":"2017-03-15 11:17:51","description":"A new meta-analysis of 50 studies has found that pornography use diminishes men’s levels of “sexual and relational satisfaction.”","filename":"data/vaneerConsumption/PornographyUseTiedtoRelationshipDissatisfactionReport.json","image_url":"https://media.breitbart.com/media/2015/10/Screen-Shot-2015-10-16-at-12.20.32.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_15__1540935069.html","title":"Pornography Use Tied to Relationship Dissatisfaction: Report","title_page":"Pornography Use Tied to Relationship Dissatisfaction: Report","title_rss":"NULL","source_domain":"breitbart.com","text":"A comprehensive new meta-analysis of 50 studies has found that pornography use diminishes men’s levels of “sexual and relational satisfaction.”\nThe report, titled “Pornography Consumption and Satisfaction: A Meta-Analysis,” revealed that pornography consumption is associated with “lower interpersonal satisfaction outcomes in cross-sectional surveys, longitudinal surveys, and experiments.”\n“In an overall, combined-sample analysis of relational and sexual satisfaction studies,” the report states, “the consumption of pornography was associated with lower interpersonal satisfaction.”\nParticularly among male viewers, pornography was linked to significantly “lower sexual and relational satisfaction.” On the average, the report states, men’s sexual and relational satisfaction are “adversely affected” by consumption of pornography.\nFor the purposes of the report, relational satisfaction was defined as “participants’ contentedness with their romantic relationships.”\nThe authors of the analysis were critical of certain prior studies based on direct queries about how pornography has impacted those surveyed. Though consumers may report that pornography use has increased their satisfaction with their sexual knowledge, skill and relations, the authors warn that self-perceived effects may be “due to rationalization, justification, and biased optimism.”\n“It is common for people to rationalize and justify, and to perceive themselves as personally less susceptible to, any negative impacts of behaviors that provide them with immediate and powerful rewards,” they wrote.\nThe meta-analysis, which included more than 50,000 participants from 10 countries, found clear and consistent results of diminished interpersonal satisfaction directly tied to the use of pornography.\nDawn Hawkins, Executive Director of the National Center on Sexual Exploitation (NCOSE), praised the new research as making a significant contribution to the growing body of data showing the damage caused by pornography use.\n“Pornography is sex-negative,” Hawkins said in a statement made available to Breitbart News, because it “rewires an individual’s sexuality to pixels on a screen rather than to a real person, which is inherently inconsistent with healthy, organic relationships.”\n“A wide body of research is bringing attention to the various ways pornography negatively impacts both women and men, and this latest meta-analysis contributes important findings to that on-going dialogue,” she added.\nAccording to NCOSE, internet pornography consumption by adolescents is “associated with risky sexual behavior that can have profoundly adverse effects such as anal sex, multiple sexual partners, and substance use during sex.”\nMore importantly, however, is the harm porn causes to otherwise healthy relationships, as the new report underscores.\nThese findings of pornography’s negative impacts on relational satisfaction are corroborated by the studies of Drs. John and Julie Gottman, renowned clinical psychologists who have published more than 200 academic journal articles on this and related issues.\nAccording to the Gottmans, “use of pornography by one partner leads the couple to have far less sex and ultimately reduces relationship satisfaction,” along with multiple other problems.\n“We are led to unconditionally conclude that for many reasons, pornography poses a serious threat to couple intimacy and relationship harmony,” they stated in an open letter published last April.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/politics/2017/03/15/report-pornography-use-tied-to-relationship-dissatisfaction/"}
