{"authors":[],"date_download":"2018-10-22 21:57:47","date_modify":"2018-10-22 21:57:47","date_publish":"2014-06-07 07:13:38","description":"The inauguration of Ukraine's new president Petro Poroshenko took place in Kiev Saturday. He called for the laying down of arms but said Crimea will always be Ukrainian.","filename":"data/vaneerConsumption/PoroshenkoSworninasUkrainesPresidentSaysCrimeaWillBeUkrainian.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/494156/140607-poroshenko-0618_f4fab8c3c0a483e8e3cc05812efd2eae.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_poroshenko-sworn-ukraines-president-says-crimea-will-be-ukrainian-n125146_1540245467.html","title":"Poroshenko Sworn in as Ukraine's President, Says Crimea 'Will Be Ukrainian'","title_page":"Poroshenko Sworn in as Ukraine's President, Says Crimea 'Will Be Ukrainian'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPetro Poroshenko took the oath of office as Ukraine's president Saturday, calling on armed groups to lay down their weapons as he assumed leadership of a country mired in a violent uprising and economic troubles.\nIn his inaugural address to the Verkhovna Rada, the country's parliament, Poroshenko promised amnesty \"for those who do not have blood on their hands.\"\nThat appeared to apply both to separatist, pro-Russia insurgents in the country's east and to nationalist groups that oppose them.\nPoroshenko also promised dialogue with citizens in the eastern regions, but excluded the insurgents.\n\"Talking to gangsters and killers is not our avenue,\" he said, according to a translator.\nHe also called for early regional elections in the east.\nHe assumed power a day after meeting Russian President Vladimir Putin at D-Day commemoration ceremonies in France.\nDespite the outreach to Putin, Poroshenko said he will not accept Russia's annexation of Crimea.\n\"Crimea is, was and will be Ukrainian. There will be no trade-off,\" Poroshenko said.","url":"https://www.nbcnews.com/news/world/poroshenko-sworn-ukraines-president-says-crimea-will-be-ukrainian-n125146"}
