{"authors":[],"date_download":"2018-10-30 19:58:03","date_modify":"2018-10-30 19:58:03","date_publish":"2018-08-24 12:43:00","description":"Porsche's \"Gold\" project embraces carmaker's sports car history","filename":"data/vaneerConsumption/PorschesGoldprojectembracescarmakerssportscarhistory.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/24/Images/Porsche%20Project%20Gold%20(8).jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_porsche-gold-proje_da31b53252bdb1339a4a77dc0c5460db__1540929483.html","title":"Porsche's \"Gold\" project embraces carmaker's sports car history","title_page":"Porsche's \"Gold\" project embraces carmaker's sports car history","title_rss":"NULL","source_domain":"ajc.com","text":"To mark 70 years of building some of the most beautiful and celebrated sports cars in history, Porsche Classic has created a one-of-a-kind vehicle based on its famous 993 generation.\n“Project Gold showcases the comprehensive skill of Porsche Classic in fascinating fashion,” says Detlev von Platen, member of the executive board of Porsche AG responsible for sales and marketing.\nThis show car, a 911 Turbo with an air-cooled engine, has been painted in the carmaker’s Golden Yellow Metallic, the same color as its 2018 911 Turbo S Exclusive Series.\nThis car also features black wheels with gold highlights, while seats and interior trim also are finished in black with Golden Yellow details.\nExterior features include the air intakes of the 993 Turbo S that were also available as an option for the regular 911 Turbo in 1998. Porsche stopped production of the 993 about 20 years ago.\nPushing 450 horsepower, the car will have its world premiere at Porsche Rennsport Reunion VI in California next month.\nPorsche Classic came up with the concept of building a show car based on an existing 993 body shell to showcase both tradition and innovation. The car was assembled at the Porsche Classic restoration workshop near Stuttgart in Germany, and took about 18 months to build.\nProject Gold is built for the raceway, as it cannot be registered for use on the street. On Oct. 27, the car will be auctioned by RM Sotheby’s at the Porsche Experience Center in Atlanta.\nThe “Porsche 70th Anniversary Sale” is an exclusive auction that boasts nearly 70 Porsche sports cars – each of them showing a part of Porsche history, from the open road to rally and race tracks.\nThe auction proceeds from the sale of “Project Gold” will be donated in Germany to the Ferry Porsche Foundation. The foundation is a nonprofit organization dedicated to education, social issues, and youth development.\nPorsche Cars North America’s headquarters is in Atlanta.","url":"https://www.ajc.com/business/porsche-gold-project-embraces-carmaker-sports-car-history/W7mDU9FtatjlsPmyf0gbWJ/"}
