{"authors":["Simeon Gholam For Mailonline"],"date_download":"2018-10-23 01:35:22","date_modify":"2018-10-23 01:35:22","date_publish":"2016-01-28 15:55:33","description":"Former Premier League midfielder Michael Brown picked a novel way to celebrate his 39th birthday - by hiring an ice cream van to surprise his team-mates at Port Vale.","filename":"data/vaneerConsumption/PortValesMichaelBrowncelebrates39thbirthdaybyhiringouticecreamvan.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB591000000578-0-image-a-42_1453995842922.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421211_Michael-Brown-Ice-Cream-Man-Port-Vale-midfielder-celebrates-turning-39-bringing-treat-team-mates_1540258522.html","title":"Port Vale's Michael Brown celebrates 39th birthday by hiring out ice cream van","title_page":"Port Vale's Michael Brown celebrates 39th birthday by hiring out ice cream van | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michael Brown picked a novel way to celebrate his birthday - by hiring an ice cream van to surprise his team-mates at Port Vale.\nThe former Premier League midfielder went against the usual tradition of bringing in a cake to mark turning 39 earlier this week by getting the van to turn up after training on Thursday.\n'Normally when it’s your birthday you’re meant to bring cakes in or croissants or some sort of flapjacks or whatever – some treats for the lads,' he told the club's official website.\nMichael Brown hired an ice cream van to surprise his team-mates at Port Vale on Thursday\nThe former Premier League midfielder brought it in to celebrate his 39th birthday earlier this week\n'So they were sort of saying \"come on Browny you’re getting on now, you’ve got to do something special for us\".\n'We occasionally get a bacon sandwich or something like that for the lads so they were saying for me to do a butty van or that sort of thing.\n'And I thought that a big bacon and egg sandwich shop isn’t ideal so I thought \"what about ice creams?\" [And] they're loving it!.'\nBrown has made almost 50 appearances for the League One club since joining them in 2014.\nHe has previously spent time at Manchester City, Sheffield United, Hartlepool, Portsmouth, Tottenham, Fulham, Wigan and Leeds in a career spanning more than 20 years.\nBrown (right) in action for Fulham against Middlesbrough's Stewart Downing in December 2006","url":"https://www.dailymail.co.uk/sport/football/article-3421211/Michael-Brown-Ice-Cream-Man-Port-Vale-midfielder-celebrates-turning-39-bringing-treat-team-mates.html"}
