{"authors":["Thomas Colson"],"date_download":"2018-10-30 23:53:02","date_modify":"2018-10-30 23:53:02","date_publish":"2016-12-05 00:00:00","description":"The number of houses being sold in 'prime' central London has dropped by half on last year — and that's a warning sign.","filename":"data/vaneerConsumption/PorticoFallinghousepricefallsinLondonareinevitable.json","image_url":"https://amp.businessinsider.com/images/58455f87dd08953b448b4979-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_portico-falling-house-price-falls-in-london-are-inevitable-2016-12_1540943582.html","title":"Portico: Falling house price falls in London are 'inevitable'","title_page":"    Portico: Falling house price falls in London are 'inevitable' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A row of coloured houses near Portobello Market, London Flickr / CC 3.0 A drop in London property prices is \"inevitable,\" according to a London estate agent.\nPortico Estate Agents says that transaction volumes, or the number of homes being bought and sold in the capital, are \"critically low\" — almost 50% lower than this time last year. That could be a bad sign.\nPart of that drop is explained by a big bounce in sales in the run-up to April this year, when a change to property taxes introduced by ex-chancellor George Osborne came into effect, followed by an immediate fall. Transactions in Westminster, for example, dropped to a record low of 84 in the month of April following the change. There and elsewhere, they've remained low ever since.\nPortico says: \"Transaction volume levels ... are down 60% in prime central London against last year. With price historically following volume decline, we have now seen the first monthly year on year price decrease of 1.1% in the City of Westminster (September 2015 to September 2016) since the 2008 recession.\"\nThere's a very recent example of price decline following volume decline: the financial crash of 2008. Take a look at this chart: Portico It shows that volume decline preceded price decline at the beginning of 2008, when a recession hit the UK. Volume recovery preceded price recovery the following year.\nPortico says the London property market is \"clearly\" beginning to react to the drop in volumes and has forecast a 6-7% decreased in prime central London price. It expects the price slump to \"filter out\" to greater London.\nMark Lawrinson, Regional Sales Director of Portico London estate agents, says: \"Unless action is taken to re-establish the natural movement of the whole market, it's likely this could be a serious issue and we will see prices fall.\"\n\"But it's not all bad news for landlords or investors,\" he added. \"The population is growing, the job market is buoyant, and people are still coming to live in London — so while supply is decreasing, demand is continuing to grow. It's this imbalance between supply and demand that is likely to increase rental prices, while weaker transaction prices will push up rental yields.\"\nOther estate agents have also warned that a central London slowdown will spread to the rest of the capital. Analysis from Knight Frank in November said a \"slowdown in prices which has been evident in central London over the past 12 months will spread to the wider region, with Greater London prices down marginally in 2017.\"","url":"https://www.businessinsider.com/portico-falling-house-price-falls-in-london-are-inevitable-2016-12"}
