{"authors":["Chris Weller"],"date_download":"2018-10-30 22:58:23","date_modify":"2018-10-30 22:58:23","date_publish":"2016-12-09 00:00:00","description":"A recent vote in Portland's city council has approved a law that could generate an extra $3 million to fight homelessness in the Oregon city.","filename":"data/vaneerConsumption/PortlandlawtaxescompanieswhoseCEOsmake100timestheiremployees.json","image_url":"https://amp.businessinsider.com/images/584adf98a1a45ed2008b49ad-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_portland-law-taxes-companies-ceo-salaries-2016-12_1540940303.html","title":"Portland law taxes companies whose CEOs make 100 times their employees","title_page":"    Portland law taxes companies whose CEOs make 100 times their employees - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Justin Sullivan/Getty Images In an effort to combat homelessness, the city government in Portland, Oregon has passed a law that raises corporates taxes on companies whose CEOs make significantly more than their employees.\nCompanies will see a 10% increase on their tax rate if the CEO makes 100 times the average employee and a 25% increase if they make 250 times the average salary, The Guardian reports.\nThe stated goal of the policy is to help decrease the homeless population in Portland, which accounts for roughly 1,800 people sleeping on the street each night. In April, local NBC News affiliate, KGW, declared the problem was a \"crisis\" that had hit a \"breaking point.\"\nThe new law, which passed 3-1 in the city council, is expected to generate between $2.5 million and $3.5 million a year starting in January 2018. Though no specific plans have been announced, every dollar will go toward programs that help rehabilitate the homeless.\nAccording to the research on executive pay versus median employee pay, there will be ample chances for Portland to get those funds.\nIn 2014, a study conducted by the Economic Policy Institute found executives made about 20 times the average worker in 1965. By 2013, they were making about 300 times the average worker.\nSteve Novick, the city commissioner who proposed the measure, told the Guardian that 540 publicly traded companies would hit the threshold for the tax. Novick says he drew inspiration for the policy from French economist Thomas Piketty.\nIn speaking to the New York Times, however, Piketty says the terms of the policy were still too lenient.\n\"This is certainly part of the solution,\" Piketty told the Times via email, \"but the tax surcharge needs to be large enough; the threshold '100 times' should be substantially lowered.\"\nPortland officials hope other cities with taxes on business income, such as Columbus, Ohio and Philadelphia, Pennsylvania, implement similar policies. California tried its hand at the idea in 2014, with a plan that reduced taxes for CEOs making less than 100 times the average worker, but the bill never passed.\nPortland has devised other clever solutions to homelessness, including its communities of tiny houses. Residents in various villages can spend little to no money (work-based \"sweat equity\" is popular) to have heat and a roof over their head.","url":"https://www.businessinsider.com/portland-law-taxes-companies-ceo-salaries-2016-12"}
