{"authors":["Sportsmail Reporter"],"date_download":"2018-10-23 01:03:08","date_modify":"2018-10-23 01:03:08","date_publish":"2016-01-29 14:43:16","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/PortsmouthvsBournemouthTeamnewskickofftimeprobablylineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30A2DBC700000578-0-image-a-31_1454073240841.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422777_Portsmouth-vs-Bournemouth-Team-news-kick-time-probably-line-ups-odds-stats-FA-Cup-clash_1540256588.html","title":"Portsmouth vs Bournemouth: Team news, kick-off time, probably line-ups, odds and stats for the FA Cup clash","title_page":"Portsmouth vs Bournemouth: Team news, kick-off time, probably line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Bournemouth's trip to Portsmouth.\nTeam news\nPortsmouth\nDanny Hollands (leg) is sidelined for Portsmouth with a leg injury for the visit of Bournemouth in the fourth round.\nNew loan signing Kieron Freeman is cup-tied after appearing for Sheffield United earlier in the competition.\nProvisional squad: Jones, Davies, Stevens, Webster, Burgess, McGurk, Tubbs, McNulty, Roberts, Naismith, Barton, Tollitt, Chaplin, Clarke, Bennett, Murphy, Evans, Fulton, Close, Haunstrup\nDanny Hollands (leg) is sidelined for Portsmouth with a leg injury\nBournemouth\nBournemouth will have captain Tommy Elphick back in the squad for Saturday's FA Cup fourth-round tie at Portsmouth following the defender's recovery from ankle surgery.\nMidfielder Junior Stanislas is expected to be out for two weeks following a knee problem sustained in the Barclays Premier League match at Sunderland.\nManager Eddie Howe is likely to rotate his squad, but forwards Callum Wilson and Max Gradel both continue their long-term rehabilitation.\nProvisional squad: Boruc, Francis, Cook, Smith, Daniels, Pugh, Gosling, Surman, Arter, Afobe, Federici, O'Kane, Distin, Iturbe, Ritchie, Murray, Grabban, King, Elphick\nBournemouth will have captain Tommy Elphick (left) back in the squad following injury\nKey match stats (supplied by Opta)\nPORTSMOUTH v BOURNEMOUTH Kick-off: Saturday, 3pm Odds (subject to change): Portsmouth: 21/10 Draw: 3/1 Bournemouth: 7/5 Referee: Mike Dean Managers: Paul Cook (Portsmouth), Eddie Howe (Bournemouth)\nPortsmouth have met Bournemouth once before in the FA Cup, at this very stage in 1991 - Pompey won 5-1 at Fratton Park.\nHowever, these two sides did meet as recently as two seasons ago with Eunan O'Kane scoring the only goal in a 1-0 Bournemouth victory in the League Cup.\nThis is Pompey’s first appearance in the fourth round since they went all the way to the FA Cup Final in 2010.\nThe Cherries haven’t reached the Fifth Round since 1989 when they lost in a replay against Manchester United at Old Trafford. In fact, Bournemouth have only managed to reach the Fifth Round on two other occasions (1929 and 1957).\nBournemouth have lost just one of their last seven competitive away matches (W3 D3 L1).","url":"https://www.dailymail.co.uk/sport/football/article-3422777/Portsmouth-vs-Bournemouth-Team-news-kick-time-probably-line-ups-odds-stats-FA-Cup-clash.html"}
