{"authors":["Associated Press"],"date_download":"2018-10-23 00:14:18","date_modify":"2018-10-23 00:14:18","date_publish":"2016-01-29 12:58:10","description":"LISBON, Portugal (AP) — Portugal's prime minister said Friday he will seek to accommodate European authorities' concerns about his government's spending plan...","filename":"data/vaneerConsumption/Portugalsgovernmenthangstoughonendingausterity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:44f03ed4f89d44e5a137e75e90a43d8e-4PuZeKVXE7cd9005b2c876a18e59-815_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422596_Portugals-government-hangs-tough-ending-austerity_1540253658.html","title":"Portugal's government hangs tough on ending austerity","title_page":"Portugal's government hangs tough on ending austerity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Portugal's government hangs tough on ending austerity\nLISBON, Portugal (AP) — Portugal's prime minister said Friday he will seek to accommodate European authorities' concerns about his government's spending plan for this year, but won't give up his promise to end austerity in the country.\nAntonio Costa told Parliament his government will be \"constructive\" in talks with the European Commission. At the same time he said he will \"stay faithful\" to his recent election pledge of switching the government's focus from debt reduction to economic growth and job creation.\nEuropean authorities want Portugal to keep cutting spending. The aim is to reduce the debt burden that forced Portugal to ask for a 78 billion-euro ($85 billion) bailout in 2011. In return for the cash which prevented the country's bankruptcy, Portugal had to enact a series of spending cuts and tax increases that weighed on the economy and pushed unemployment sharply higher.\nPortugese Prime Minister Antonio Costa, left, is greeted by Dutch Prime Minister Mark Rutte at Catshuis residence in The Hague, Netherlands, Thursday, Jan. 28, 2016. (AP Photo/Peter Dejong)\nThough the bailout ended in 2014, the previous center-right government persevered with the austerity as Portugal is still burdened by high debts. Disillusion with that austerity was a key voter concern in a general election last October.\nFollowing the election, Costa's Socialists were able to form a minority government that relies on support from the Communist Party and radical Left Bloc. They are warning Costa against bowing to Brussels' demands.\nLabor groups close to the Communist Party also kept up the political pressure on Costa with their first strike since the government took power. The strike was part of a wider fight to restore labor entitlements scrapped after the bailout.\nThe walkout organized by the Common Front, an umbrella organization that represents about half the country's more than 600,000 government workers, aimed to demand a quick return to the civil servants' traditional 35-hour working week, down from the current 40 hours. The government has already approved the new working hours, which will be introduced in July, but the Common Front wants the change sooner.","url":"https://www.dailymail.co.uk/wires/ap/article-3422596/Portugals-government-hangs-tough-ending-austerity.html"}
