{"authors":["Mary Chastain"],"date_download":"2018-10-30 19:06:00","date_modify":"2018-10-30 19:06:00","date_publish":"2015-07-22 03:48:15","description":"Bellevue Hospital is currently observing an unidentified man for Ebola who recently returned from Africa and came down with a fever.","filename":"data/vaneerConsumption/PossibleEbolaPatientUnderObservationinNewYorkCity.json","image_url":"https://media.breitbart.com/media/2015/07/ap_ap-photo976-e1451328423512.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_21__1540926360.html","title":"Possible Ebola Patient Under Observation in New York City","title_page":"Possible Ebola Patient Under Observation in New York City | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Bellevue Hospital is currently observing an unidentified man for Ebola who recently returned from Africa and came down with a fever.\nThe man visited Guinea, which is one of three African countries that experienced a large Ebola outbreak in 2014. An ambulance brought him to the hospital at 6PM on Monday night.\nHealth officials said the man did not have any known contact with the disease during his visit.\nBellevue treated Dr. Craig Spencer in 2014. He came down with the deadly infection after traveling to affected parts of West Africa to treat patients there.\nThe World Health Organization (WHO) reported new Ebola cases have risen in Sierra Leone and Guinea in July alone. Officials stated the outbreak is concentrated in western parts of the nations, which is different than the outbreak in 2014. However, the new cases in Conarky, the capital of Guinea, “came from known transmission chains or have known links to earlier cases.” WHO confirmed one health worker in Guinea is infected with the disease.\nResearchers discovered a vaccine against the disease worked on monkeys. The medicine, which is inhaled, will now be tested on people. Alexander Bukreyev, a virologist at the University of Texas Medical Branch in Galveston, said this vaccine “could have advantages over” the other Ebola vaccines currently in production. Since the medicine is inhaled the “administration of such a vaccine will not require trained medical personnel.” Bukreyev also claimed that the vaccine is better because it triggers “two different forms of immunity – a ‘local’ immune response, in the mucous membranes of the respiratory tract, as well as a body-wide immune system response, in form of immune cells circulating the body.”\nThis new vaccine includes a “common respiratory virus” with “genes from the Ebola virus that encode the proteins of the virus’s outer coat.” In monkeys, the researchers discovered that when ingested, the virus replicated in the respiratory tracts, which forced “cells to produce many copies of the Ebola virus’s coat. This then caused the immune system to fight the virus.","url":"https://www.breitbart.com/national-security/2015/07/21/possible-ebola-patient-under-observation-in-new-york-city/"}
