{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 01:12:20","date_modify":"2018-10-23 01:12:20","date_publish":"2017-03-10 09:07:26","description":"The Conservatives have opened up a massive 19-point advantage over Labour in the wake of Philip Hammond's financial package, according to YouGov research.","filename":"data/vaneerConsumption/PostBudgetpollshowsTories19pointsaheadofLabour.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21BEBD00000578-0-image-a-13_1489136831527.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300444_Post-Budget-poll-shows-Tories-19-points-ahead-Labour_1540257140.html","title":"Post-Budget poll shows Tories 19 points ahead of Labour","title_page":"Post-Budget poll shows Tories 19 points ahead of Labour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Tories have enjoyed a post-Budget poll bounce despite the huge backlash over the tax raid on millions of self-employed people.\nThe Conservatives have opened up a massive 19-point advantage over Labour in the wake of Philip Hammond's financial package, according to YouGov research.\nThe gap is the biggest recorded by the polling firm for eight years - and the biggest for the Tories in government since 1987.\nIt would deliver a staggering 130-strong majority for Theresa May in the Commons if replicated at a general election.\nThe Tory lead over Labour is 19 percentage points - the most in a YouGov poll for eight years\nTheresa May, pictured in Brussels last night, has signalled a retreat over the tax raid on the self employed by delaying legislation until the Autumn\nIt underlines the dire performance of Labour under Jeremy Corbyn, who has been facing mounting demands to step aside to avert a bloodbath of previously safe seats.\nSome 55 per cent of those questioned in the poll for The Times said they thought the government had broken a manifesto pledge not to increase national insurance.\nClass 4 NI rates paid by the self-employed were hiked by 2p in the Budget to raise around £2billion for the Exchequer.\nJust 16 per cent believed the claim by Mr Hammond that the promise had merely been a 'broad' commitment and only applied to the main class 1 rate of NICs.\nBut 47 per cent of voters agreed with the decision to increase NICs for the self-employed.\nA third disagreed with the move.\nOverall Tory support was on up two on 44 per cent, a level not reached since August 2010.\nLabour was unchanged on 25 per cent.\nThe gap is the biggest in a YouGov poll since May 2009, when the Conservatives were still in Opposition.\nAs a governing party, their advantage has not been this large since 1987.","url":"https://www.dailymail.co.uk/news/article-4300444/Post-Budget-poll-shows-Tories-19-points-ahead-Labour.html"}
