{"authors":[],"date_download":"2018-10-23 05:15:02","date_modify":"2018-10-23 05:15:02","date_publish":"2014-10-12 00:00:00","description":"Even in a city stricken with Ebola, people come to the beach. A man on crutches is out for a walk. Little girls collect a fish and a headless Barbie. And an actress dreams of her big break.","filename":"data/vaneerConsumption/PostcardFromFreetownOnTheBeachLife.json","image_url":"https://media.npr.org/assets/img/2014/10/10/freetownpostcard_wide-b0a3537012ab2b27748a2ecfd37a33ef374d7342.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=355119205_1540271702.html","title":"Postcard From Freetown: On The Beach, Life","title_page":"Postcard From Freetown: On The Beach, Life — And Dreams — Go On : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nJust north of Liberia lies Sierra Leone. In the capital of Freetown, schools are closed and doors to many businesses are locked. But life does go on, some of it on the beach. The city lies along the Atlantic Coast of West Africa. NPR's Peter Breslow recently took a stroll there and sent us this postcard.\nPETER BRESLOW, BYLINE: Sometimes you can tell a lot about a country just by walking its beaches. Standing at water's edge here, facing the sea, the smooth, blue rollers come splashing in, steady, hypnotic, like oceans can be anywhere in the world. But turn around and face the city, and you're smacked by a shoreline fouled with plastic bottles and spray cans and yellow sewage. To the right, tangled in the brown seaweed, is the stiff, bloated corpse of a dead dog. And beyond, across the boulevard, the gray, cement skeleton of an abandoned building project.\nALIE A KOROMA: So what's your name?\nBRESLOW: Alie A. Koroma struggles over the sand on his metal crutches. He has time to wander the beach. He's out of work. Koroma tells me he used to cater to foreign tourists.\nKOROMA: Used to take them excursions on the islands. We have beaches.\nBRESLOW: Yeah.\nKOROMA: Yeah.\nBRESLOW: But now, no.\nKOROMA: No, nothing like that.\nBRESLOW: Because of Ebola.\nKOROMA: Because of the Ebola, exactly, sir. Yeah.\nBRESLOW: Further down the beach, I meet four beaming girls.\nSUSAN: Susan.\nZAINA: Zaina.\nABBY: Abby.\nLALAI: Lalai.\nBRESLOW: They look about 9 or 10 years old. Zaina balances a small, plastic tub on top of her head, and in it is a collection of beach bounty, including a headless, naked Barbie. The kids have also managed to grab some wildlife splashing in the surf.\nSUSAN: It's fish. I find a fish.\nBRESLOW: Are you are you going to eat that?\nZAINA: Yes.\nBRESLOW: You come on the beach every day?\nSUSAN: Yes.\nZAINA: Yes.\nABBY: Yes.\nLALAI: Yes.\nBRESLOW: Looking for stuff?\nSUSAN: We are going now.\nBRESLOW: OK, bye-bye. Nice to meet you.\nSUSAN: How about you? What is your name?\nBRESLOW: Peter.\nSUSAN: Peter.\nBRESLOW: Yeah.\nOn my other trips down the shore here, nothing has been open. All the seaside restaurants and nightclubs and boutiques shuttered because of the emergency. But today, there is one place operating, an outdoor fitness club, kind of Muscle Beach, Freetown. Under the palm trees, there are thick, rusted barbells and a wooden bench press sitting in the sand and four pairs of breathless young women practicing self-defense. It turns out they're rehearsing for a movie. It is called \"Gunshot.\"\nANSUMANA BANGURA: We go with punches. We go with front punches first, and we block. Action.\nBRESLOW: A hulking master trainer, biceps punishing the sleeves of his blue polo shirt, runs these women through their paces. He's Ansumana Bangura.\nBANGURA: This is an action movie, so, like, they're training to get their physical fitness so that we got a very good thing when they're shooting.\nBRESLOW: Bangura tells me the movie is about someone who's working to prevent drug use among young people and fighting corrupt government officials.\nBANGURA: So that's what we are preaching about.\nBRESLOW: Twenty-two-year-old actor Frances Nicol has been paring with an opponent. She says she'd love for her fight scenes in \"Gunshot\" to lead to a starring role in the movie.\nFRANCES NICOL: Well, it actually depends on the director. We don't know what the director has for us. But somehow, it's an action. So it was like - we're getting ourselves prepared beforehand.\nBRESLOW: And so even in Sierra Leone, in the midst of a devastating epidemic, a young actor can still hope for her big break.\nBANGURA: Let's start it all over again, foots together. Action.\nBRESLOW: Peter Breslow, NPR News, Freetown, Sierra Leone.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=355119205"}
