{"authors":["Jeff Poor"],"date_download":"2018-10-30 21:31:17","date_modify":"2018-10-30 21:31:17","date_publish":"2015-08-19 04:03:01","description":"Frank Luntz focus group turns out not to be an indicator of how the public is reacting to the field nearly two weeks after the debate.","filename":"data/vaneerConsumption/PostFoxDebateFrankLuntzFocusGroupFailstoForecastDirectionofGOPRace.json","image_url":"https://media.breitbart.com/media/2015/08/Luntz818.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_18__1540935077.html","title":"Post-Fox Debate Frank Luntz Focus Group Fails to Forecast Direction of GOP Race","title_page":"Post-Fox Debate Frank Luntz Focus Group Fails to Forecast Direction of GOP Race | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"It’s been 12 days since the first Republican presidential debate was broadcast on the Fox News Channel. Immediately following that event on the network’s The Kelly File, pollster Frank Luntz conducted a focus group on location in Cleveland, the site of the debate.\nAccording to the participants of his focus group, real estate mogul Donald Trump, the frontrunner of the race, fared poorly, but they gave a mixed response as to who was the strongest in the debate.\nMany of the respondents gave a favorable reactions to former Gov. Mike Huckabee (R-AR), Sen. Ted Cruz (R-TX), former Johns Hopkins neurosurgeon Dr. Ben Carson and Sen. Marco Rubio (R-FL). Luntz even highlighted Huckabee as having received the most favorable reaction of the debate based on his real-time dial response from the focus group during the live event.\n“Bad news for Donald Trump. Great news for Ted Cruz and Mike Huckabee,” Luntz said in assessing the reactions of his focus group panel to the August 6 debate.\nHowever, those respondents turned out not to be an indicator of how the public is reacting to the field nearly two weeks after the debate.\nAccording to an average of a bucket of post-debate polls calculated by Real Clear Politics, Trump (22 percent) still holds a commanding double-digit lead in the crowded field over former Gov. Jeb Bush (R-FL) (10.7 percent).\nOf those that performed well in Luntz’s focus group, only Carson remains in the top tier (9.7 percent). Rubio and Cruz are in the middle of the pack (7.3 percent each respectively) and Huckabee has seen a 2.5 percent drop in polling since the debate.\nLuntz has been particularly critical of Trump from the very beginning of his presidential campaign. According to a report from Hadas Gold and Ken Vogel in Tuesday’s Politico, Luntz has been outspoken about Trump’s candidacy, deeming it and the insurgent candidacy of Democratic hopeful Sen. Bernie Sanders (I-VT) to be a “big ‘f—- you’ to the elites in America,” but prefacing it as not being helpful to finding solutions to the country’s difficulties.\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/politics/2015/08/18/post-fox-debate-frank-luntz-focus-group-fails-to-forecast-direction-of-gop-race/"}
