{"authors":[],"date_download":"2018-10-30 21:52:40","date_modify":"2018-10-30 21:52:40","date_publish":"2016-12-20 13:21:00","description":"1. Postal worker accused of dumping mail arrested. A video had surfaced in October showing a U.S.","filename":"data/vaneerConsumption/Postalworkeraccusedofdumpingmailstarvin.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/19/Images/mail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_things-know-toda_04e38b43a213826a37845c48cb9ca4d0__1540936360.html","title":"Postal worker accused of dumping mail; starvin","title_page":"5 things to know today: Postal worker accused of dumping mail; starvin","title_rss":"NULL","source_domain":"ajc.com","text":"1. Postal worker accused of dumping mail arrested. A video had surfaced in October showing a U.S. Postal Service worker dropping several bins of mail near a fenced area. The mail was supposed to be delivered to residents in Longview Walk, a Decatur subdivision. [Read here]\n2. Starving dog prompts social media uproar. Local pet rescue advocate Justine Stinnett wrote on her Facebook page that a woman who was fostering the two dogs “moved away and left him to die\". Lucky, the half-starved dog was found locked in an empty Smryna house. [Read here]\n3. One month to Trump’s inauguration as President. Now that the vote of the Electoral College is out of the way, a quick glance at the calendar shows that January 20, 2017 is just a month away. AJC's Jamie Dupree took some photos of the ongoing preparations at the U.S. Capitol. [Read here]\n4. 9 ways to celebrate New Year's Eve in Ga. From north to south, in big cities and teeny towns, they’re putting their own highly creative and representive twist on the traditional ball drop. Read on for all the details on how to have a fun new take on Auld Lang Syne there and elsewhere in the state this New Year’s Eve. [Read here]\n5. Mild weather ahead in metro Atlanta. It’s the day before the official start to winter, and temperatures are increasing. “Winter is approaching soon but not winter weather,” Channel 2 Action News meteorologist Karen Minton said early Tuesday. [Read here]","url":"https://www.ajc.com/news/local/things-know-today-postal-worker-accused-dumping-mail-starving-dog-prompts-uproar/KOn6tb4XSR9GmmqBTG8MSJ/"}
