{"authors":["John Nolte"],"date_download":"2018-10-30 21:22:04","date_modify":"2018-10-30 21:22:04","date_publish":"2015-10-19 16:42:35","description":"The DC media's rehabilitation campaign to save Democrat Hillary Clinton began with a 5-day infomercial courtesy of NBC News and ended with glowing |","filename":"data/vaneerConsumption/PostDebateBernie10InNHHillarysFavorabilityDrops6Points.json","image_url":"https://media.breitbart.com/media/2015/10/Hillary-Getty1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_19__1540934524.html","title":"Post-Debate: Bernie +10 In NH; Hillary's Favorability Drops -6 Points","title_page":"Post-Debate: Bernie +10 In NH; Hillary's Favorability Drops -6 Points | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The DC media’s rehabilitation campaign to save Democrat Hillary Clinton began with a 5-day infomercial courtesy of NBC News and ended with glowing post-debate spin that declared Clinton empress of all that is good and just in the world. Per the media, she not only beat Bernie Sanders, she effectively told Vice President Joe Biden, “Don’t even think about it.” A recent poll out of New Hampshire shows that actual voters in the crucially important early primary might not agree with their Media Overlords.\nAccording to a Franklin Pierce University/Boston Herald poll released Monday, Sanders leads Clinton 48% to 38%. That is without Biden in the race. Should the Vice President jump in, Sanders is up +8, 38% to 30%. Biden sits at 19%.\nMoreover, among NH Democrats, Clinton’s favorability rating has dipped -6 points since August, from 80% to just 74%. In March, Hillary’s favorable were +10 points higher at 84%.\nA full 83% of NH Democrat voters view Sanders favorably, a +7 point increase.\nIn theReal Clear Politics poll of NH polls, Sanders enjoys a +5.7% lead.\nFor all the DC media talk about Biden having to make a decision now, his favorability rating also sits at 83%. Sounds like the media is more frustrated by Biden’s fence-sitting than actual voters.\nNationally, Clinton is still well ahead of Sanders. A new Monmouth University poll shows that Clinton has increased her lead over the socialist challenger, but not by much. Hillary is up 48% to 21%. Prior to the debate she led 42% to 21%.\nIn another new national CNN poll, Clinton enjoys a +16 point (45% to 29%) lead over Sanders but in this poll, post-last week’s debate, Sanders has actually gained +2 points over Clinton. In September he was behind -18 points (24% – 42%).\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/10/19/post-debate-bernie-10-in-nh-hillarys-favorability-drops-6-points/"}
