{"authors":["Peter Breslow"],"date_download":"2018-10-23 05:15:08","date_modify":"2018-10-23 05:15:08","date_publish":"2014-10-12 00:00:00","description":"Even in a city stricken with Ebola, people come to the beach. A man on crutches is out for a walk. Little girls collect a fish and a headless Barbie. And an actress dreams of her big break.","filename":"data/vaneerConsumption/PostcardFromFreetownOnTheBeachLifeAndDreamsGoOn.json","image_url":"https://media.npr.org/assets/img/2014/10/10/freetownpostcard_wide-b0a3537012ab2b27748a2ecfd37a33ef374d7342.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_goatsandsoda_2014_10_12_355119205_postcard-from-freetown-on-the-beach-life-and-dreams-go-on_1540271708.html","title":"Postcard From Freetown: On The Beach, Life - And Dreams - Go On","title_page":"Postcard From Freetown: On The Beach, Life — And Dreams — Go On : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Postcard From Freetown: On The Beach, Life — And Dreams — Go On\nEnlarge this image toggle caption Peter Breslow/For NPR Peter Breslow/For NPR\nSometimes you can tell a lot about a country just by walking its beaches. That's what I did on my last day in Freetown, the capital of Sierra Leone, where I was on assignment covering the Ebola epidemic.\nStanding at water's edge, facing the sea. The smooth blue rollers come splashing in, steady, hypnotic — like oceans anywhere in the world.\nBut turn around and face the city and you're smacked by a shoreline fouled with plastic bottles and spray cans and yellow sewage. To the right, tangled in the brown seaweed, lies the stiff bloated corpse of a dead dog. Beyond, across the boulevard, is the gray cement skeleton of an abandoned building project.\nAlie A. Koroma struggles over the sand on his metal crutches to talk to me. He has time to wander the beach. He's out of work. Akuroma tells me he used to cater to foreign tourists.\n\"We used to take them [on] excursions on the islands, we have beaches.\"\nThat's over now, he says, \"because of the Ebola.\"\nFurther down the beach I meet four beaming girls. They look to be about 9 or 10 years old. One balances a small plastic tub on top of her head and in it is a collection of beach bounty, including a headless naked Barbie. The kids have also managed to grab some wildlife from the surf.\n\"Is fish. I find a fish,\" one tells me.\nWe chat for a bit as they show me their haul. They ask me my name, then dance down the sand, giggling as they go.\nAll the seaside restaurants and nightclubs and boutiques are shuttered because of the Ebola emergency. But an outdoor fitness club, a kind of Muscle Beach Freetown, is open.\nUnder the palm trees there are thick rusted barbells and a wooden bench press sitting in the sand. Four pairs of breathless young women are running through self-defense drills.\nIt turns out they are rehearsing for an anti-drug movie called Gunshot.\nShouting commands to the women is a hulking presence in a tight blue polo shirt: master trainer Ansumana Bangura.\n\"This is an action movie,\" he tells me, \"So they are training to get their physical fitness so that we got a very good thing when they're shooting.\"\nBangura says Gunshot tells the story of someone who's working to prevent drug use among young people and fighting corrupt government officials.\nOne of the actors he's instructing is a petite 22-year-old named Frances Nicol. She'd love it if her fight scenes in Gunshot lead to a starring role.\n\"It actually depends on the director. We don't know what the director has for us. But somehow it's an action movie so we're getting ourselves prepared beforehand.\"\nAnd so even in Sierra Leone in the midst of the devastating Ebola epidemic, a young actor can still hope for her big break.","url":"https://www.npr.org/sections/goatsandsoda/2014/10/12/355119205/postcard-from-freetown-on-the-beach-life-and-dreams-go-on"}
