{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:37:16","date_modify":"2018-10-30 21:37:16","date_publish":"2016-09-12 02:11:44","description":"Hillary Clinton's campaign had not confirmed Sunday evening whether she will appear at several scheduled fundraisers in California this week.","filename":"data/vaneerConsumption/Post911HillaryClintonsCaliforniaFundraisingTourinDoubt.json","image_url":"https://media.breitbart.com/media/2016/08/AP_16233607314794.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_11__1540935436.html","title":"Post-9/11, Hillary Clinton's California Fundraising Tour in Doubt","title_page":"Post-9/11, Hillary Clinton's California Fundraising Tour in Doubt","title_rss":"NULL","source_domain":"breitbart.com","text":"Politico reports that Hillary Clinton has canceled her travel plans to California on Monday and Tuesday.\n“Hillary Clinton has canceled a trip to California planned for Monday and Tuesday, her campaign said late Sunday,” Politico reported in a breaking news alert late Sunday night. “The cancellation came after Clinton abruptly departed a 9/11 memorial ceremony in New York City on Sunday morning. Her campaign later disclosed that she had been diagnosed with pneumonia on Friday.”\nThe cancellation comes after hours of uncertainty, where her aides were unclear with press whether she would be able to carry on with a planned West Coast fundraising trip on Monday and Tuesday after a medical emergency she experienced during the September 11 commemoration event in New York on Sunday.\nThe medical problem was blamed on “overheating and dehydration,” and a pneumonia infection which was diagnosed on Friday, according to campaign statements.\nClinton was set to appear at several events throughout San Francisco and Los Angeles on Monday and Tuesday. Those are now off, according to Politico. It’s thus far unclear whether she will carry on with a scheduled rally in Las Vegas on Wednesday. Until after 10:30 p.m. on Sunday night, her aides were reportedly “still unclear” as to whether she would change her schedule in light of her health and per her own doctor’s recommendation.\nAides still unclear on whether Clinton will amend her schedule. She is slated to fly to SF tomorrow for a fundraiser, LA later that night. — Ruby Cramer (@rubycramer) September 11, 2016\nA video captured by a memorial attendee shows Clinton appearing to collapse, requiring the help of several aides to place her in the vehicle.\nHillary Clinton 9/11 NYC pic.twitter.com/q9YnsjTxss — Zdenek Gazda (@zgazda66) September 11, 2016\nClinton’s spokesman Nick Merrill issued a statement Sunday morning: “Secretary Clinton attended the September 11th Commemoration Ceremony for just an hour and thirty minutes this morning to pay her respects and greet some of the families of the fallen. During the ceremony, she felt overheated so [she] departed to go to her daughter’s apartment, and is feeling much better.”\nHer Doctor, Lisa Bardack, said “I have just examined here and she is now re-hydrated and recovering nicely.”\nShe issued the following statement:\nSecretary Clinton has been experiencing a cough related to allergies. On Friday, during a follow up evaluation of her prolonged cough, she was diagnosed with pneumonia, She was put on antibiotics, and advised to rest and modify her schedule. While at this morning’s event, she became overheated and dehydrated. I have just examined her and she is now re-hydrated and recovering nicely.\nPrior to Sunday’s episode, Clinton’s health had been the subject of numerous reports in the media. Some had dismissed the reports as mere conspiracy theories, and Dr. Drew Pinsky’s show on CNN’s HLN was even cancelled after he questioned her health.\nLiberal filmmaker Michael Moore, who had endorsed Sen. Bernie Sanders (I-VT) for president, also weighed in on Clinton’s Sunday health scare.\nWell, pneumonia. That's serious. Campaign kept it hidden Fri/Sat/Sun. No wonder the crazies get traction. Dems are pros at losing elections. — Michael Moore (@MMFlint) September 11, 2016\nThis piece has been updated after publication to reflect Clinton’s cancellations of Monday and Tuesday events.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2016/09/11/clinton-aides-unclear-about-upcoming-cali-trip-after-medical-emergency/"}
