{"authors":[],"date_download":"2018-10-30 18:41:43","date_modify":"2018-10-30 18:41:43","date_publish":"2016-11-11 22:50:00","description":"DeKalb teacher removed from class after pro-Trump racist comments","filename":"data/vaneerConsumption/PostelectiontiradegetsDeKalbteachersuspended.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/11/Images/newsEngin.16792855_crosskeys2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_post-e_79b8334a1ef730e9ea20dc13a204c311__1540924903.html","title":"Post-election tirade gets DeKalb teacher suspended","title_page":"DeKalb County teacher removed after pro-Trump racist comments","title_rss":"NULL","source_domain":"ajc.com","text":"A DeKalb County high school teacher was removed from class after going on a post-election tirade where she allegedly made disparaging comments about undocumented immigrants.\nThe Cross Keys High School teacher was not named by district officials, who said she will not return to a classroom until an investigation is complete. She was removed Thursday, a day after the remarks allegedly were made.\nThe DeKalb County School District would not confirm the teacher’s statements, but confirmed that she was removed from the classroom pending an internal investigation.\n“In accordance with established protocol, we began an investigation on Thursday … when the allegations were brought to our attention,” district officials said in a statement. “The teacher in question was removed immediately from the school pending completion of the investigation. Threatening, abusive behavior will not be tolerated in any way and such behavior will be dealt with without delay.”\nThe suspension comes on the heels of several incidents nationally, sparked after businessman and reality TV star Donald Trump won Tuesday’s presidential election. A student in a Detroit suburb posted a video of other students chanting “build a wall” toward Hispanic and Latino students. A teacher in Owasso, Okla., was caught on camera complaining about voters after the election.\nAnti-Trump protests also have taken place across the country, including in Atlanta, New York City, Philadelphia, Chicago, Los Angeles and other cities.\nAt Cross Keys, 86 percent of the students are Hispanic or Latino. Most of those parents speak English as a second language, if at all. The school was in the news recently after state officials announced last week that the school reported the third-largest graduation rate increase between 2015 and 2016. Principal Jason Heard said then that helping parents learn English was the key that sparked more parental engagement.","url":"https://www.ajc.com/news/local-education/post-election-tirade-gets-dekalb-teacher-suspended/59j5NmWObniWhPcjvmM2xK/"}
