{"authors":[],"date_download":"2018-10-30 21:54:29","date_modify":"2018-10-30 21:54:29","date_publish":"2016-10-26 22:02:00","description":"The mail carrier was found dumping mail he was supposed to be delivering to residents in Longview Walk, a Decatur subdivision.","filename":"data/vaneerConsumption/Postalworkerfilmeddumpinglettersnolongerdeliveringmail.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/26/Images/newsEngin.16600788_maildumpingtwo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_postal-worker-fi_439497881fd63301f0d1ca1601dd0508__1540936469.html","title":"Postal worker filmed dumping letters 'no longer delivering mail'","title_page":"Postal worker filmed dumping letters 'no longer delivering mail'","title_rss":"NULL","source_domain":"ajc.com","text":"A U.S. Postal Service worker who was filmed dumping letters into a DeKalb County ditch is “no longer delivering mail,” spokesman Rick Badie confirmed Wednesday.\nThe mail carrier was found dumping mail he was supposed to be delivering to residents in Longview Walk, a Decatur subdivision. Officials did not release the name of the accused mail carrier, who works part time for the company.\nKellie Campbell, the subdivision’s homeowners association president, said she recorded the postal worker walking near a fence and dumping several bins of mail there.\n“I sat there and recorded for about five minutes and he continued to just grab more mail and continued just to toss it over the fence,” she said.\nRoughly thousands of letters were estimated to be scattered near the ditch.\nThe mail retrieved as evidence was delivered to residents by Saturday, Badie said. “The exception to that was some standard mail that contained advertising materials.”\nAccording to the U.S. Government Publishing Office, it is a federal offense to throw away someone’s mail and could result in a fine.\nThe USPS said in a previous statement: “The Postal Service condemns, in the strongest possible sense, behavior that jeopardizes the security and sanctity of the U.S. Mail — or threatens to tarnish the reputation and high level of trust that the vast majority of our employees work so hard to uphold. We are investigating this matter.”\nNo other details were released concerning the worker, but the USPS is continuing its investigation.","url":"https://www.ajc.com/news/local/postal-worker-filmed-dumping-letters-longer-delivering-mail/NKu3WgvRpX7t9yTbsZAcSN/"}
