{"authors":[],"date_download":"2018-10-22 22:03:18","date_modify":"2018-10-22 22:03:18","date_publish":"2014-06-06 19:48:35","description":"A growing number of pets eat hemp-based supplements that contain just trace amounts of the psychoactive ingredient that provides the cannabis high.","filename":"data/vaneerConsumption/PotforPetsCompaniesMakeHempLacedMedsforFidos.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2018_16/494161/140607-pets-marijuana-mn-740_d74f99446e7b67177d0ade43e6437cfb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_pot-pets-companies-make-hemp-laced-meds-fidos-n124826_1540245798.html","title":"Pot for Pets: Companies Make Hemp-Laced Meds for Fidos","title_page":"Pot for Pets: Companies Make Hemp-Laced Meds for Fidos","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMarijuana is going to the dogs, but it's not your parents' Woodstock weed.\nGeorgia, a 5-year-old Cavalier King Charles Spaniel, is a medical marijuana patient. Kelly Conway, Georgia's owner, takes some heat when she tells friends about the unorthodox treatment.\n\"People will say they can't believe I'm letting her get high, but she's not getting high,\" Conway said.\nNo, Georgia is not ingesting the same kind of pot that Snoop Dogg smokes. (Or New York Times columnist Maureen Dowd eats.) Georgia, along with a growing number of pets, eats hemp-based capsules that contain only trace amounts of tetrahydrocannabinol — or THC — the psychoactive ingredient that provides the cannabis high.\nGeorgia suffered from syringomyelia, a serious neurological disease, and traditional medicine wasn't working. So earlier this year, Conway took her to Dr. Cynthia Graves, who practices alternative veterinary care in Philadelphia. Graves started Georgia on acupuncture, which seemed to help, and then she recommended Canna-Pet, a supplement made from hemp, for Georgia's pain and anxiety.\nConway was skeptical, but to her surprise, it worked.\n\"It has truly been a miracle and I don't say that lightly,\" Conway told CNBC. \"I feel like I have a whole new dog. Georgia's happy and relaxed. She's not in pain. It's amazing.\"\nColorado and Washington have legalized and regulated cannabis for human recreational use — and 22 states allow for some form of medical marijuana. But no federal or state agency has made any provisions for the largely unregulated pet supplement industry.\nTo further complicate matters, the Drug Enforcement Agency still considers industrial hemp a controlled substance even though it is not psychoactive.\nBut times are changing. On Thursday, the Senate Appropriations Committee voted 22-8 on a plan that would block the DEA — or any federal agency — from spending funds to enforce anti-hemp laws in any state that has received permission to grow it. The full House OK'd the measure the previous week.\nCongress' action emerged after the DEA in May seized a shipment of hemp seeds from Italy headed to Kentucky. The state filed a lawsuit against the federal government to get its hemp seeds and now Kentucky, long known for its tobacco fields, has hemp in the ground.\nAs the nation grapples with this knotty issue, farmers, business owners, patients — and pets — are moving ahead while lawmakers hash it out.\nHelping with pain and anxiety\nGraves has recommended hemp-based supplements for other dogs experiencing anxiety or pain. She's also used Canna-Pet in conjunction with cancer treatments and to boost appetite in dogs that won't eat.\n\"There's no question that it's a benefit to some patients,\" she said.\nTwo companies in the Seattle area, Canna-Pet and Canna Companion, are leading the charge into this new and uncharted field of hemp-based veterinary medicine.\nDr. Sarah Brandon and Dr. Greg Copas, husband and wife veterinarians, launched Canna Companion in March. They've been exploring medical cannabis for about eight years now.\nThey started with their pets and then those of family and friends, to find the right dosage.\n\"We took information from the human world and combined that with our knowledge of dogs and cats and slowly whittled away until we got something that was safe for them and that worked,\" she explained.\n\"This is not wishful thinking. Her quality of life has definitely improved.\"\nThey grind up the whole hemp plant to make their Canna Companion capsules — roots, seeds, leaves and stem — to preserve all the ingredients. They want just a little THC along with the cannabidiol (CBD), one of the main medical components.\nBrandon readily acknowledges that she does not have any scientific tests to prove the medicinal value of hemp-based supplements. She hopes that by \"pushing the envelope\" a bit, researchers will be encouraged to study it.\n\"It's experimental and we tell people that,\" Brandon noted. \"It's not a miracle drug. This is truly a supplement designed to help conditions and help ongoing therapies, not the sole treatment of anything.\"\nAre testimonials good enough?\nBoth Canna Companion and Canna-Pet have heartwarming testimonials on their websites.\nThere's Kerry Churchill from Virginia. Her dog Ginger has neurological problems that cause uncontrolled muscle twitching. The twitching hasn't stopped, but Churchill says after taking Canna Companion, Ginger's energy level is greatly increased and her playfulness is back.\n\"She just seems happier overall, which is great to see,\" Churchill told CNBC. \"This is not wishful thinking. Her quality of life has definitely improved.\"\nAnnabelle is a 14-year-old Persian cat featured on the Canna-Pet website. Owner Rose Easterling, a self-described \"doubting Thomas,\" was very apprehensive about using the product. She gave it to Annabelle because she didn't like giving her the pain medication the vet prescribed.\n\"I don't think it has cured anything. She still has arthritis, but it's making her feel better,\" Easterling said.\nDoes it work?\nCNBC contacted a number of veterinary experts about the use of cannabis-related products to treat dogs and cats. All of them saw the potential for benefits for some conditions, such as anxiety and pain management. But they also pointed out that testimonials are not scientific evidence.\n\"We don't have any data to go on to indicate whether it's going to have a therapeutic effect or whether it's potentially problematic,\" said Patricia Talcott, a professor in the College of Veterinary Medicine at Washington State University. \"It's probably low risk, but we simply don't know.\"\nDr. Robin Downing, a pain management expert and hospital director at the Downing Center for Animal Pain Management in Windsor, Colorado, agrees. She sees a lot of potential — and a lot of red flags.\n\"There's a whole host of hoo-ha out there when it comes to how this product can and should be used,\" she said. \"We have no information that is reliable, valid or useful about the true applications for cannabinoids. What we don't know far exceeds what we know.\"\nDowning does not use cannabis-based products in her practice because she believes the opportunity to cause harm \"far exceeds\" the opportunity to help.\n\"We have no efficacy data in animals. We have zero safety data in animals. We have no dosing data in animals,\" she said.\nDowning also points out that this new industry has virtually no regulations in terms of manufacturing practices or verifying and standardizing the contents.\n\"There's a huge amount of research that needs to be done,\" said Narda Robinson, director of the Center for Comparative and Integrative Medicine at Colorado State University's Veterinary Teaching Hospital. \"I expect there is some effect, but we need rigorous studies. We need to know more about safety and dosing and proper applications.\"\nRobinson hopes to start clinical trials next year, but first she wants to gather information from people who have given cannabinoid products to their pets. She set up a special email just for this purpose: AnimalMMJ@gmail.com.\nPet owners need to be cautious\nWhile pet-lovers wait for the research, it's clear that sales are getting ahead of the science.\nCanna-Pet has only been selling to the public for about eight months and it's already shipping its products throughout the U.S. and 23 foreign countries. Dan Goldfarb, president of Canna-Pet, calls it \"an exploding market\" that will grow exponentially in the years ahead.\n\"There is no risk. There's no harm,\" Goldfarb said. \"Hemp is incredibly safe. We want people to try it.\"\nDespite companies' safety assurances, veterinary experts advise caution. The best advice for now: Never give any cannabis-based product to your dog or cat without consulting your vet.\n—By CNBC contributor Herb Weisbaum. Follow him on Facebook and Twitter @TheConsumerman or visit The ConsumerMan website.","url":"https://www.nbcnews.com/business/consumer/pot-pets-companies-make-hemp-laced-meds-fidos-n124826"}
