{"authors":[],"date_download":"2018-10-30 01:12:26","date_modify":"2018-10-30 01:12:26","date_publish":"2016-04-12 00:00:00","description":null,"filename":"data/vaneerConsumption/PottyParityFreedomFightersandtheBoss.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_04_potty_parity_freedom_fighters_and_bruce_springsteen_1540861946.html","title":"Potty Parity, Freedom Fighters, and the Boss","title_page":"Potty Parity, Freedom Fighters, and the Boss","title_rss":"NULL","source_domain":"americanthinker.com","text":"overcomes (I would have written trumps but that word has also become a twisted civil rights flashpoint) the civil rights of most people, male and female, to comfortably and safely use the facilities.\nThe definition of civil rights continues to get both more expansive and narrower -- not to mention weirder -- by the second. Nope, that's not a contradiction. While you were perhaps following the run up to the presidential convention sweepstakes, the civil rights of trangendered people to use the public bathroom of their preferred gender of the moment\nJoining the latest cause, one-time New Jersey rocker Bruce Springsteen (now of Malibu, naturally) disappointed his North Carolina fans, cancelling his concert Sunday in the state because he disapproves of their bathroom laws.\nAs you, my fans, know I’m scheduled to play in Greensboro, North Carolina this Sunday. As we also know, North Carolina has just passed HB2, which the media are referring to as the “bathroom” law. HB2 -- known officially as the Public Facilities Privacy and Security Act -- dictates which bathrooms transgender people are permitted to use. Just as important, the law also attacks the rights of LGBT citizens to sue when their human rights are violated in the workplace. No other group of North Carolinians faces such a burden. To my mind, it’s an attempt by people who cannot stand the progress our country has made in recognizing the human rights of all of our citizens to overturn that progress. Right now, there are many groups, businesses, and individuals in North Carolina working to oppose and overcome these negative developments. Taking all of this into account, I feel that this is a time for me and the band to show solidarity for those freedom fighters. As a result, and with deepest apologies to our dedicated fans in Greensboro, we have canceled our show scheduled for Sunday, April 10th. Some things are more important than a rock show and this fight against prejudice and bigotry -- which is happening as I write -- is one of them. It is the strongest means I have for raising my voice in opposition to those who continue to push us backwards instead of forwards.\nWell, it is his right to perform where he prefers but he did sign a contract that had no equal bathroom clause; cancelling it meant many people who work for the various vendors involved in a concert, working-class people such as hotel staff, taxi drivers and arena personnel, already hired in preparation for the concert, did not work. So much for their civil rights.\nMeanwhile his plans for a two-month European summer concert tour remain in place. But is Springsteen aware of the public bathroom civil rights situation in Europe? Apparently not.\nFor instance, in England, over half the women are uncomfortable using a unisex bathroom. And hopefully, while in England, Springsteen won't become ill and land in the hospital because the nationalized hospital Royal Cornwall Hospital has announced they are\nEliminating Mixed-Sex Accommodation Putting respect and dignity at the heart of our services Every patient has the right to receive high quality care that is safe, effective and respects their privacy and dignity. We at the Royal Cornwall Hospitals NHS Trust are committed to providing every patient with same sex accommodation, because it helps to safeguard their privacy and dignity when they are often at their most vulnerable. Over recent years the Trust has carried out improvement works across all its hospital sites to ensure that gender segregation can be provided on each of its ward areas. This predominantly takes the form of gender specific bays with bathroom provision as close as possible to the bays. This therefore provides single sex sleeping accommodation with the ability to access bathroom facilities without having to walk through the sleeping areas of the opposite sex.\nOh dear!\nHowever, to Springsteen's relief -- and approval -- Germany, Sweden, Denmark, and Norway do have gender-neutral bathrooms so he shouldn't have moral problems performing in these countries. But... and there always is a but... these countries have also experienced a rise in assaults on women recently; assaults carried out by newly arrived immigrants from Muslim countries. (Not that I'm Islamophobic or anything; I'm just stating the facts--another problem I know.) Do the rights of male Muslims, transgendered or not, to use any bathroom and practice their cultural heritage by assaulting women who show their faces and ankles overcome (not trump) the civil rights of women to safely appear in public and use a public bathroom or public swimming pool without being mugged? Tell us, Bruce, are you \"in solidarity with these freedom fighters\"?\nDoes Springsteen know about the public bathroom situation in Portugal? Apparently not.\nToilets Public toilets are not common. The nearest cafe or bar will have a door with 'H' (=men; homens) or 'S' (=women; senhoras). Of course the cafe owners prefer that you order something.\nWha-at? Because there are few public bathrooms those in urgent need are not only forced to use gender-segregated facilities in a restaurant, they must also purchase something which just might increase the need to use the facilities again forcing them to make another purchase which would increase the need to use the facilities again...\nAs of this writing, Springsteen has made no comment about this discriminatory economic bathroom situation.\nAnd of course Springsteen and the other so called bathroom civil libertarians, including PayPal, have been silent about one of the most accepted forms of discrimination against women's health, time and comfort -- the lack of an adequate number of public bathrooms for women compared to men. Because of basic anatomical and biological differences between men and women -- and yes they exist no matter what the cis gendered people/believe state -- women have to use the bathroom more often and it takes them longer to do it. If you don't know why, I'm not going to explain these basics.\nIs there a woman reading this who hasn't stood in an agonizingly long public bathroom line? Is there a man reading this who hasn't wondered why his mother, daughter, significant female other is taking so long in there? No, this doesn't justify unisex group public bathrooms -- remember those basic anatomical differences and public safety needs -- it does require more public facilities for women.\nResearch shows women take on average twice as long as men in the restroom, yet it is the rare public space that provides equal access. An insufficient number of women's restrooms regularly results in mind-bogglingly disproportionate wait times, leading to countless minutes wasted at sports arenas, movie theaters, and perhaps worst of all, the office. (snip) \"When many buildings were laid out, [restroom access for women] didn't make a big difference because there weren't many women in the offices or in positions of power,\" says John F. Banzhaf III, a public interest lawyer and professor at George Washington University. Banzhaf has filed federal complaints arguing that disparate restroom access may be a violation of equal protection rights. Many older buildings were also designed at a time when contractors, architects, engineers, builders, and government procurement officials were overwhelmingly male and so rarely considered the needs of women -- a fact pointed out at a 2010 Committee on Oversight and Government Reform meeting, which was the last time a 'potty parity' bill was brought to the federal level. It died.\nSo Bruce Springsteen... when you demand in your concert contract that every venue that you strum your guitar for many bucks has equal facilities for men and women then I'll believe your equal bathroom babble from your public statement\nTaking all of this into account, I feel that this is a time for me and the band to show solidarity for those freedom fighters. (snip) Some things are more important than a rock show and this fight against prejudice and bigotry — which is happening as I write — is one of them. It is the strongest means I have for raising my voice in opposition to those who continue to push us backwards instead of forwards.\nTil then, you're just doing cheap virtue signaling. And here I thought you were better than that.","url":"https://www.americanthinker.com/articles/2016/04/potty_parity_freedom_fighters_and_bruce_springsteen.html"}
