{"authors":["Karen Ruiz For Dailymail.Com"],"date_download":"2018-10-23 04:34:10","date_modify":"2018-10-23 04:34:10","date_publish":"2017-03-10 14:44:52","description":"James Silverence, 50, bought the last six tickets for the lottery's 50th anniversary game at Stewart's Shop in Poughkeepsie to split with wife Sylvia Silverence, 53.","filename":"data/vaneerConsumption/Poughkeepsiecouplewins10milliononscratchofflottery.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23A2CE00000578-0-image-a-3_1489159816492.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301522_Poughkeepsie-couple-wins-10million-scratch-lottery_1540269250.html","title":"Poughkeepsie couple wins $10million on scratch-off lottery","title_page":"Poughkeepsie couple wins $10million on scratch-off lottery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Poughkeepsie couple is cashing in big bucks after they hit a $10million jackpot on a New York lottery scratch-off ticket.\nJames Silverence, 50, bought the last six tickets for the lottery's 50th anniversary game at Stewart's Shop in Red Oaks Mill to split with his wife Sylvia Silverence, 53.\nMr Silverence, who works in the elevator industry, had gone into the store to claim $125 from previous winnings, when he heard a customer complain about losing and it sparked his confidence.\nMulti-millionaires: Sylvia and James Silverence won $10million after scratching off a jackpot in the New York Lottery\nWinner: James had purchased the winning ticket at Stewart's on Vassar Rd in Poughkeepsie\n'The lady ahead of me had purchased four of the $10,000,000 cash tickets and didn’t win. There were six tickets left so I put in some extra money and got them all,' he told the Hudson Valley Post on Thursday.\nThe father-of-four spent $180 on the tickets and went home to split them with his legal assistant wife.\nMrs Silverance scratched her first ticket and was stunned to see she had just become a multi-millionaire after finding the word 'jackpot' under the matching number 23.\nThe mother covered the word with her finger and walked over to her husband in disbelief. When she revealed the prize, the couple started screaming.\nShe said the two were so shocked they had to check their 'blood pressure.'\nThe new millionaires claimed their prize on January 23 but were presented with a giant check by lottery representative Yolanda Vega on Thursday afternoon.\nThe Silverences' winnings are the biggest prize the lottery has offered through a scratch off.\nFinally rich: The couple had regularly purchased tickets, but were still stunned to see they had won such a large prize. They'll each receive $3.3m in one lump sum after taxes\nThe good life: The family may be multi-millionaires, but they said they plan to stay in their Poughkeepsie home\nThe couple agreed to split the cash evenly and will be receiving $3,309,000 each after taxes in one lump sum.\nAs far as spending their cash, James and Sylvia said they do not want the money to change their lives drastically and are planning to put some of it towards their four sons' college education.\nAs for the future, Mr Silverence said he would keep his job and the family plans to stay in their upstate New York home.","url":"https://www.dailymail.co.uk/news/article-4301522/Poughkeepsie-couple-wins-10million-scratch-lottery.html"}
