{"authors":["Will Martin"],"date_download":"2018-10-31 00:09:44","date_modify":"2018-10-31 00:09:44","date_publish":"2018-07-13 00:00:00","description":"\"If they do a deal like that, we would be dealing with the European Union instead of dealing with the UK, so it will probably kill the deal,\" Trump told The Sun.","filename":"data/vaneerConsumption/PounddollarpricePounddropsasTrumpthreatenstokillpostBrexittradedeal.json","image_url":"https://amp.businessinsider.com/images/5b4859164b625631008b4962-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pound-dollar-price-pound-drops-trump-brexit-trade-deal-2018-7_1540944584.html","title":"Pound dollar price: Pound drops as Trump threatens to 'kill' post-Brexit trade deal","title_page":"    Pound dollar price: Pound drops as Trump threatens to 'kill' post-Brexit trade deal - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President Donald Trump (R) speaks to Britain's Prime Minister Theresa May during in a working dinner meeting at the NATO headquarters during a NATO summit of heads of state and government in Brussels, Belgium, May 25, 2017. Reuters/Thierry Charlier\nThe pound has dropped significantly Friday after President Donald Trump warned that British Prime Minister Theresa May's Brexit plans will \"probably kill\" any US-UK trade deal after Britain has left the EU.\nSpeaking to The Sun newspaper during his first official visit to the UK, Trump laid into May's plans to maintain close links with the EU post-Brexit.\n\"If they do a deal like that, we would be dealing with the European Union instead of dealing with the UK, so it will probably kill the deal,\" Trump said.\n\"If they do that, then their trade deal with the US will probably not be made.\"\nThose comments, which could give credence to the wing of the Conservative party who believe May's Brexit plan looks too like the status quo, and possibly hurt her negotiating position in Brussels, have spooked investors in the pound on Friday.\nLosses, as of just before 8.40 a.m. BST (3.40 a.m. ET), are hovering at around 0.5% against the dollar — a substantial drop — leaving the pound at around $1.3127.\nHere's the chart:","url":"https://www.businessinsider.com/pound-dollar-price-pound-drops-trump-brexit-trade-deal-2018-7"}
