{"authors":["Will Martin"],"date_download":"2018-10-30 23:54:00","date_modify":"2018-10-30 23:54:00","date_publish":"2018-07-14 00:00:00","description":"Markets are enamoured by the softest Brexit possible, so Theresa May's Chequers agreement and the subsequent white paper on her Brexit position are music to their ears.","filename":"data/vaneerConsumption/PounddollarnewsPoundtojumponsoftBrexit.json","image_url":"https://amp.businessinsider.com/images/5acfa43f146e711c008b48d5-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pound-dollar-news-pound-to-jump-on-soft-brexit-2018-7_1540943640.html","title":"Pound dollar news: Pound to jump on soft Brexit","title_page":"    Pound dollar news: Pound to jump on soft Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The pound is on a good run. WPA Pool/Getty Images\nLONDON — Theresa May this week made it as clear possible that she wants Britain to pursue a soft Brexit, keeping the country tied closely to the European Union, while remaining outside its formal boundaries.\nThe prime minister's Brexit agreement at Chequers — which triggered the resignations of Brexit Secretary David Davis and Foreign Secretary Boris Johnson — and the subsequent white paper on her Brexit position cemented, for the first time since June 23 2016, a coherent plan for leaving the EU.\nPolitically, May's move towards a softer Brexit is unpalatable for many within the Conservative Party, but the proposals are a breath of fresh air for investors after more than two years of near-total uncertainty about the future shape of Britain's relationship with the EU.\nAs such, this week marked the start of a completely new phase for the British pound, one that could see a significant appreciation in its value going forward.\nIt isn't just greater certainty over the shape of Brexit that could drive the pound higher. The rising likelihood of an interest rate hike from the Bank of England at its next meeting in August is also set to boost the previously downtrodden pound.\nSome analysts now forecast that the pound could rise as high as 1.41 against the dollar by the end of the year, an increase of close to 7% from its current level. The pound's performance so far in 2018. Markets Insider Deutsche Bank, which made that forecast, backs a combination of \"the movement toward a soft Brexit from May, the lack of effective challenge from the Brexiteers and a Bank of England hike in August,\" according to a report from Bloomberg this week.\nThis view is one shared by Sharmin Mossavar-Rahmani, the CIO of Goldman Sachs' investment management division, who in June said: \"There is a 10% appreciation potential there,\" when discussing the pound.\nMarkets have been unequivocal in their belief that a soft Brexit is the best option for the UK, with the pound generally appreciating on developments that suggest a softer deal, and tumbling on signs of a harder deal.\nThat was evident in the early 2018 performance of sterling, which between January and April climbed around $0.10 to over $1.40, confounding all expectations of analysts.\nWhile it remains to be seen whether or not sterling will appreciate sharply over the final five and a half months of 2018, if it follows the precedents set since June 2016, it seems highly likely, especially given it is now almost guaranteed — in the view of the markets at least — that the Bank of England will hike interest rates in August.\nEconomic data, the key driver of whether or not the bank will bump rates from 0.5% to 0.75% in August, has been fairly solid in the last couple of months, with the latest GDP figures showing the economy growing 0.3% in May.\nThings are likely to get a boost from England's stunning run in the World Cup, which early signs suggest has pushed up retail sales.\n\"As such, the economic news is supporting the idea of an August interest rate rise from the Bank of England,\" ING economist James Knightley noted in a recent blog.\nNothing is certain with the pound — as the last two roller coaster years have shown — but if things go as expected, don't be surprised to see a much higher currency in the next few months.","url":"https://www.businessinsider.com/pound-dollar-news-pound-to-jump-on-soft-brexit-2018-7"}
