{"authors":["Will Martin"],"date_download":"2018-10-31 00:31:36","date_modify":"2018-10-31 00:31:36","date_publish":"2018-07-09 00:00:00","description":"Johnson's resignation marks a major blow to the stability of May's government, with speculation it could collapse already rife.","filename":"data/vaneerConsumption/PoundpricePounddivesafterBorisJohnsonresigns.json","image_url":"https://amp.businessinsider.com/images/5b4388b670e2911c008b4dfb-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pound-price-versus-dollar-dives-johnson-resignation-2018-7_1540945896.html","title":"Pound price: Pound dives after Boris Johnson resigns","title_page":"    Pound price: Pound dives after Boris Johnson resigns - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Matt Cardy / Stringer\nThe British pound has dived on Monday as fears that the government could collapse rise.\nThe pound's fall was initially triggered after Boris Johnson, the UK's foreign secretary, unexpectedly resigned from his post.\n\"This afternoon, the Prime Minister accepted the resignation of Boris Johnson as Foreign Secretary,\" a spokesperson for Prime Minister Theresa May said.\n\"His replacement will be announced shortly. The Prime Minister thanks Boris for his work.\"\nJohnson's resignation marks a major blow to the stability of May's government, with speculation it could collapse already rife. It followed the resignation late on Sunday evening of David Davis, the Brexit Secretary.\nIn the minutes after the news of Johnson's resignation, the pound dropped to around 1.3270 against the dollar, a fall of more than 0.3% from it's opening price on Monday.\nThat slide continued as the afternoon progressed, and intensified after rumours surfaced that a leadership challenge to May could be imminent. By 5.10 p.m. BST (12.10 p.m. ET), the pound was down 0.8% to just $1.3210.\nMarkets Insider\nMonday's move may look dramatic, but Viraj Patel, a currency strategist at Dutch bank ING, says that the drop is not the start of a major downward trend for the pound — for the time being a least.\n\"We'll need to see political uncertainty pick-up meaningfully,\" he told Business Insider. \"For us that's rising odds of a general election and a delay in Brexit talks.\"\nWe're \"not there just yet — even if there's rumours of a leadership challenge,\" he added.\n\"What matters for GBP markets is the type of Brexit delivered — not who delivers. The pound is able to live with ministerial resignations as long as that is the extent of the fallout.\"","url":"https://www.businessinsider.com/pound-price-versus-dollar-dives-johnson-resignation-2018-7"}
