{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:17:11","date_modify":"2018-10-30 23:17:11","date_publish":"2018-07-19 00:00:00","description":"The Office for National Statistics said on Thursday that retail sales in June grew 2.9% on an annual basis, well under economists' forecasts of 3.9%. Month-on-month growth turned negative, with sales shrinking by 0.5% between May and June. Economists had expected growth of 0.4%.","filename":"data/vaneerConsumption/PounddollarpriceJuly19Sterlingdivesafterretailsalesdisappoint.json","image_url":"https://amp.businessinsider.com/images/5b505237f47d34ac148b4686-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_pound-dollar-price-july-19-sterling-dives-after-retail-sales-disappoint-2018-7_1540941431.html","title":"Pound-dollar price July 19: Sterling dives after retail sales disappoint","title_page":"    Pound-dollar price July 19: Sterling dives after retail sales disappoint - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters\nLONDON — The pound sterling fell against the dollar on Thursday morning after UK retail sales data seriously undershot analyst forecasts.\nThe Office for National Statistics said on Thursday that retail sales in June grew 2.9% on an annual basis, well under economists' forecasts of 3.9%. Month-on-month growth turned negative, with sales shrinking by 0.5% between May and June. Economists had expected growth of 0.4%.\nThe pound dipped sharply against the dollar in the immediate aftermath, dropping below $1.30. It has since recovered and is trading down 0.37% against the dollar at $1.30 as of 9.50 a.m. BST (4.50 a.m. ET).\nMarkets Insider The poor retail figures, combined with poor inflation data earlier in the week, means traders now believe that an interest rate hike at the Bank of England's next Monetary Policy Committee meeting in August is looking less likely.\nNeil Wilson, the chief market analyst for Markets.com, said in an email: \"That was a terrible set of retail sales figures which will do nothing to persuade the Bank of England to hike in August. Combined with the disappointing CPI reading it suggests the MPC would be well advised to row back on plans to raise rates, a fact that seems to have been reflected by traders' bets on sterling this morning.\"\nJacob Deppe, head of trading at Infinox, said in an email: \"Yes, the World Cup and heatwave could conceivably have kept people out of the shops, but equally they could have contributed to a feel-good factor on the high street. \"The pound dived faster than Neymar on June's weak retail number. It crashed through the $1.30 floor to hit its lowest level against the Dollar for 10 months.\"","url":"https://www.businessinsider.com/pound-dollar-price-july-19-sterling-dives-after-retail-sales-disappoint-2018-7"}
