{"authors":["James Delingpole"],"date_download":"2018-10-30 18:42:24","date_modify":"2018-10-30 18:42:24","date_publish":"2018-08-06 16:08:54","description":"Boris Johnson was mocked as a \"pound-shop Donald Trump\" after being rude about the burqa.","filename":"data/vaneerConsumption/PoundShopTrumpBorisJohnsonMockstheBurqaCannyMove.json","image_url":"https://media.breitbart.com/media/2018/08/BoJo.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_06__1540924944.html","title":"'Pound Shop Trump' Boris Johnson Mocks the Burqa. Canny Move!","title_page":"Delingpole: 'Pound Shop Trump' Boris Johnson Mocks the Burqa. Canny Move!","title_rss":"NULL","source_domain":"breitbart.com","text":"Boris Johnson has been mocked as a “pound-shop Donald Trump” because he has been rude about the burqa.\nBoris Johnson mocks women in burkas who 'look like bank robbers' https://t.co/Dc3o2OlCo7 — Sky News (@SkyNews) August 6, 2018\nMuslim women are having their burkas pulled off by thugs in our streets & Boris Johnson's response is to mock them for \"looking like letter boxes.\" Our pound-shop Donald Trump is fanning the flames of Islamophobia to propel his grubby electoral ambitions.https://t.co/51YTjIdT4x — David Lammy (@DavidLammy) August 6, 2018\nBut I think virtue-signalling race-baiters like the egregious Lammy — and professional offence-takers like whichever SJW handles the Sky Twitter account — are in an increasing minority, don’t you?\nBoris, undoubtedly, was taking a calculated risk when he wrote these words in his latest column:\n“If you tell me that the burka is oppressive, then I am with you. If you say that it is weird and bullying to expect women to cover their faces, then I totally agree – and I would add that I can find no scriptural authority for the practice in the Koran. I would go further and say that it is absolutely ridiculous that people should choose to go around looking like letter boxes…”\nIt was a risk because Boris is the likeliest contender to replace Theresa May as Prime Minister – and so, clearly, has to be careful not to blow it by unnecessarily alienating potential supporters.\nAt the same time, though, if you’re going to run against an incumbent who stands for nothing and believes in nothing then it’s probably quite a good idea to have some kind of ideological backbone by way of contrast.\nWhy should we care about what Boris says?\nBecause, right now, as Stephen Robinson persuasively argues here, Boris Johnson is our best hope of achieving Brexit.\nThis cannot go on, it really cannot. I know the objections and why so many will discard this notion, but especially after watching that Churchill film, it became suddenly obvious to me: it has to be Boris. For sure, he is loathed by most of the media and much of his parliamentary party. But we forget he twice won popular election in London, a city which will probably never vote Conservative again. The loathing of Boris expressed within the Westminster media bubble is not shared by the rest of the country. And who else on the Tory benches would have a chance at the next election? Not May, not Philip Hammond or Raab, or Gove. It has to be Boris.\nIt’s true. However much Boris may be despised in certain quarters – I know, for example, he tends to get short shrift in the comments here at Breitbart News – he tends to play surprisingly well for a Tory in the country at large. And ultimately, it’s going to be the country at large which decides — given the opportunity — whether it’s going to be Boris leading Britain to independence or whether it’s Jeremy Corbyn leading Britain over a cliff.\nThough Boris has made the occasional slip up in his time, you can’t win two terms as Mayor of London and spend a stint as Foreign Secretary without developing a certain political nous.\nWhat Boris’s political nous is telling him right now is that the world has had just about enough of virtue-signalling tosh like those desperate tweets from Sky News, David Lammy, and the rest.\nThe vast majority of people in Britain — perhaps even most Muslims in Britain — feel deeply discomfited by the sight of a burqa. The idea that it is some sacrosanct garment which deserves nothing but reverence may play well with leftist grievance/identity politics narrative — but it’s not how many real people actually think.\nSo I think Boris has made the right call here. And that people, like Lammy, who play this Social Justice Warrior point-and-shriek game are going to look increasingly like the marginal, unrepresentative, dirty-politics-playing loons that they are.","url":"https://www.breitbart.com/europe/2018/08/06/why-brexit-boris-johnson-was-right-mock-burqa/"}
