{"authors":["Associated Press"],"date_download":"2018-10-23 05:56:15","date_modify":"2018-10-23 05:56:15","date_publish":"2016-01-11 18:46:28","description":"TRENTON, N.J. (AP) — A powder horn that some experts believe was used by Alexander Hamilton goes up for auction Monday on what would have been his birthday. ...","filename":"data/vaneerConsumption/PowderhornbelievedownedbyAlexanderHamiltonupforbid.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:cba87154a3b344ee872c9d6767db60dd-48qEJGFphM8d437f0aaf9283194e-986_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394074_Powder-horn-believed-owned-Alexander-Hamilton-bid_1540274175.html","title":"Powder horn believed owned by Alexander Hamilton up for bid","title_page":"Powder horn believed owned by Alexander Hamilton up for bid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Powder horn believed owned by Alexander Hamilton up for bid\nTRENTON, N.J. (AP) — A powder horn that some experts believe was used by Alexander Hamilton goes up for auction Monday on what would have been his birthday.\nHamilton, the nation's first treasury secretary and one of the country's Founding Fathers, is now the focus of a blockbuster hip-hop Broadway musical called \"Hamilton.\" The owner of the powder horn, a New Jersey dentist, hopes buzz from the show will help boost bids, which start at $10,000 at Sterling Associates in Closter, New Jersey.\n\"It's a symbol of hopes and aspirations, and it's such a positive symbol of his future,\" said Dr. Warren Richman, who hopes the winning bidder donates it to a museum.\nIn a Tuesday, Dec. 15, 2015 photo, a powder horn that some experts believe was used by Alexander Hamilton is photographed at Antique NJ in Closter, N.J. The horn goes up for auction Monday Jan. 11, 2016 on would have been Hamilton's birthday. Hamilton, the nation's first treasury secretary and one of the country's Founding Fathers, is now the focus of a blockbuster hip-hop Broadway musical called \"Hamilton.\" The owner of the horn, a New Jersey dentist, hopes buzz from the show will help boost bids, which start at $10,000 at Sterling Associates in Closter, N.J. (AP Photo/Julio Cortez, File)\nRichman acquired the horn from a patient in 1990 and spent years trying to document its authenticity and studying its etchings, which include a unicorn. A descendant, an arms appraiser and a forensic documents expert said they believe Hamilton used the engraved piece of cow horn to carry gunpowder.\nIt is inscribed with his name and 1773, the year he entered what today is Columbia University. Hamilton would have used it leading troops during the Revolutionary War and as an aide to Gen. George Washington.\nHamilton's birthday is recognized as Jan. 11, but historians are not sure whether he was born in 1755 or 1757. He was mortally wounded in a duel with Aaron Burr in 1804.\nHamilton has lately become the unlikely subject of a smash musical that's the hottest ticket in New York.\nWritten by and starring Lin-Manuel Miranda, the show tells the true story of how an orphan emigrant from the Caribbean rose to the highest ranks of American society, as told by a young African-American and Latino cast.","url":"https://www.dailymail.co.uk/wires/ap/article-3394074/Powder-horn-believed-owned-Alexander-Hamilton-bid.html"}
