{"authors":["Caroline Pate"],"date_download":"2018-10-30 22:56:45","date_modify":"2018-10-30 22:56:45","date_publish":"2014-08-14 16:15:46","description":"The newest nostalgia trip for '90s kids finally has a release date: the forthcoming Power Rangers movie is set to premiere in theaters on July 22, 2016. The screenplay is being written by Thor and X-Men: First Class writers Zack Stentz and Ashley…","filename":"data/vaneerConsumption/PowerRangersMovieNeedsTheseInsaneRidiculousVillainstoMakeaComeback.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/addf9ce4-4ec8-4cdb-9ce3-75c53913a95a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35744-power-rangers-movie-needs-these-insane-ridiculous-villains-to-make-a-comeback_1540940205.html","title":"'Power Rangers' Movie Needs These Insane, Ridiculous Villains to Make a Comeback","title_page":"'Power Rangers' Movie Needs These Insane, Ridiculous Villains to Make a Comeback","title_rss":"NULL","source_domain":"bustle.com","text":"The newest nostalgia trip for '90s kids finally has a release date: the forthcoming Power Rangers movie is set to premiere in theaters on July 22, 2016. The screenplay is being written by Thor and X-Men: First Class writers Zack Stentz and Ashley Miller, and it's being executive produced by Robert Orci, veteran of summer blockbuster movies like Transformers and Star Trek. So although the Power Rangers properties are a couple decades old, it's easy to see how it will fit in to today's blockbuster landscape. Superhero team movie like The Avengers or Guardians of the Galaxy? Check. A big-budget nostalgia trip like Transformers or Teenage Mutant Ninja Turtles? Check. It's a movie practically guaranteed for box office stardom.\nBut being an already-existing property doesn't always mean smooth sailing. There's no doubt that there will be some Power Ranger purists who argue that the movie doesn't look like the show they watched when they were seven years old. But while many of these arguments will certainly be about the Power Rangers themselves, those characters are a lot more interesting when you're still arguing with your sister about who gets to be the pink Power Ranger. What's eternally entertaining about the franchise is its low-quality, campy aesthetic: flat characters, bad acting, and most of all, villains that are completely insane. So while some people will be wringing their hands over dream casting for the green Power Ranger, here are the villains and monsters that the movie shouldn't leave out. Not because they're the most important, but they're almost too strange to be believed.\nRita Repulsa\nCoordinatorKYamato on YouTube\nRita Repusla was the boss-ass bitch of the Power Rangers' villains. Sure, her husband Lord Zedd might be much more threatening presence, but Rita had an awesome name, a commanding screech of a voice, and a seemingly limitless amount of monster minions at her disposal. Just watch her make them grow.\nLypsyncher\nWoofy McMann on YouTube\nFor some reason, this is the episode of Mighty Morphin Power Rangers I remember most clearly in my mind, but the monster in this episode is so strange that I thought I must be remembering it wrong. Why? Because it is a lipstick monster. Her head is three tubes of lipstick. But no, there is no monster too ridiculous for the Power Rangers universe.\nPumpkin Rapper\nNewbcannon on YouTube\nNo, really. That's all it is. A rapping pumpkin. And yes, it's just as terrible as you think, if not more.\nSquatt and Baboo\nDylan Robson on YouTube\nRita's two henchmen. Squatt was a fat, blue troll-like creature, while Baboo was essentially a flying monkey with a monocle. They can be seen at the end of this incredible clip where Baboo calls some clothing \"very grunge.\"\nBrick Bully\nTito Teixeira on YouTube\nA monster whose power is... turning people into bricks. He can become more powerful by... eating bricks. Because what do children love more than a monster made out of raw building materials? The Blue Ranger defeats him, saying \"That's definitely one wall we won't be up against again.\" THE PUNS IN THIS SHOW, GUYS.\nPudgy Pig\nFistOfKings on YouTube\nA pig monster whose superpower is just eating everything (same). His weakness? He has IBS. The Power Rangers defeat him by getting him to eat spicy food.\nImage: Flickr/BagoGames","url":"https://www.bustle.com/articles/35744-power-rangers-movie-needs-these-insane-ridiculous-villains-to-make-a-comeback"}
