{"authors":["Associated Press"],"date_download":"2018-10-23 04:00:02","date_modify":"2018-10-23 04:00:02","date_publish":"2016-01-11 16:57:03","description":"OMAHA, Neb. (AP) — The Powerball jackpot has grown to $1.4 billion, and the drawing is still two days away. The prize was already the world's largest before ...","filename":"data/vaneerConsumption/Powerballjackpotincreasesto14Basticketsalessurge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:722afce586b04c51a1e1ab7d3a2c7bcc-3WAQP5SaQH704788ebcf7e109546-175_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394228_Powerball-jackpot-increases-1-4B-ticket-sales-surge_1540267202.html","title":"Powerball jackpot increases to $1.4B as ticket sales surge","title_page":"Powerball jackpot increases to $1.4B as ticket sales surge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Powerball jackpot increases to $1.4B as ticket sales surge\nOMAHA, Neb. (AP) — The Powerball jackpot has grown to $1.4 billion, and the drawing is still two days away.\nThe prize was already the world's largest before lottery officials increased it Monday.\nAnd the jackpot could grow even more before Wednesday's drawing if ticket sales remain intense. Officials review the estimate daily.\nSamir Akhter, the owner of Penn Branch Liquor, exchanges money for Powerball tickets, Saturday, Jan. 9, 2016 in Washington. Officials say it's increasingly likely that someone will win the $900 million Powerball jackpot, which grew by $100 million just hours before Saturday night's drawing. (AP Photo/Alex Brandon)\nNo one matched all six Powerball numbers Saturday night, leading to the astronomical prize.\nTHIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below.\nDisappointed you didn't win the Powerball jackpot this weekend? Don't be.\nLottery officials say the prize has swelled to an estimated $1.3 billion — the world's largest. Ever.\n\"Biggest jackpot in the history of the world. Absolutely confirmed,\" Texas Lottery executive director Gary Grief said.\nThe jackpot is so big that billboards in Texas and around the country have to advertise the price as $999 million because they're not built to show billions. The lottery computers will handle the decimal point without a problem.\nNo one matched all six Powerball numbers Saturday night, leading to the astronomical prize. And that is all but certain to grow before the next drawing Wednesday, according to lottery officials.\n\"We've never been at these levels,\" said Grief, whose state lottery is part of the Multi-State Lottery Association that runs Powerball.\nThe odds to win are one in 292.2 million. Seventy-five percent of all the possible combinations were purchased before Saturday's drawing, Grief said, and he expects that enough tickets will be sold to cover about 80 percent by Wednesday. About 95 percent of Powerball tickets have computer-generated numbers.\n\"I've been in the industry over 20 years, and I've seen jackpots hit when we hardly have any of the potential numbers covered — like 5 percent of the possible combinations covered. And I've seen other jackpots when we've had 95 percent of the combinations covered and it rolls,\" Grief said.\nThe jackpot has ballooned since its Nov. 4 starting point of $40 million and spurred huge ticket sales.\nIn Omaha, Les Wheeler said he probably overdid it by buying $30 worth of tickets for Saturday's drawing with a few friends, but they plan to do the same for this next jackpot.\n\"I didn't expect to win, but I had big dreams,\" said Wheeler, 53. He said a new home in another state away from Omaha's 16-degree temperatures were at the top of his wish list.\nSaturday's winning numbers — 16-19-32-34-57 and Powerball number of 13 — did gain some people a little wealth: 25 tickets won $1 million by matching five numbers, and three other tickets won $2 million because they paid extra to multiply smaller prizes.\nDarryl Collins, of Phoenix, and his husband each won $24 from the 70 Powerball tickets they bought. They plan to use that money toward buying more tickets for the new, higher jackpot. Collins said it was a shock that nobody won.\n\"It was like only 500 people who missed it by one number,\" Collins said. \"It shows you how hard it is to win.\"\nThe 55-year-old real estate agent said he and his husband would definitely share the wealth.\n\"I would give a lot of it to family and friends,\" Collins said. \"Who needs that much money?\"\nMichael Montecelo, a security guard in San Francisco's financial district, said he spent $20 on Powerball tickets and hasn't yet checked if he won anything. He said he will buy another $20 worth of tickets even if thinking about winning more than a billion dollars scares him a bit.\n\"I think I would go into a state of anxiety, but it would be a good anxiety,\" he said, smiling.\nMontecelo, 50, said he would retire and donate some of that money and work on administering the rest.\n\"I would have to open an office and get a team of experts. I think my job would be to keep tabs on that money,\" he said. \"That would be a full-time job.\"\nThe record jackpot lured an unprecedented frenzy of purchases. Between Jan. 6 and Saturday's drawings, more than $900 million in Powerball tickets were sold.\nOfficials expect similar sales before the next drawing, but Grief said it's hard to predict how excitement about the record jackpot will boost sales.\n\"It's exponentially greater than any sales that any of the states involved have ever seen,\" he said.\n___\nAssociated Press writers Terry Tang in Phoenix and Olga R. Rodriguez in San Francisco contributed to this report.\nIn this photo made with a fisheye lens a clerk hands a patron his $10 worth of chances for the upcoming Powerball drawing on Saturday, Jan. 9, 2016, in Cranberry Township, Pa. The Powerball jackpot has reached a record $900 million, with the drawing Saturday night. (AP Photo/Keith Srakocic)\nJulian Perez fills out a Powerball ticket, Saturday, Jan. 9, 2016, in Miami. Officials say it's increasingly likely that someone will win the $900 million Powerball jackpot, which grew by $100 million just hours before Saturday night's drawing. (AP Photo/Lynne Sladky)","url":"https://www.dailymail.co.uk/wires/ap/article-3394228/Powerball-jackpot-increases-1-4B-ticket-sales-surge.html"}
