{"authors":["Alex Kritselis"],"date_download":"2018-10-30 22:46:08","date_modify":"2018-10-30 22:46:08","date_publish":"2014-08-14 19:41:21","description":"According to Entertainment Weekly, Lionsgate announced Wednesday that their Mighty Morphin Power Rangers reboot will arrive in movie theaters on July 22, 2016. That means that we're only 709 days away. Hold on, I need a minute. Or several. Last…","filename":"data/vaneerConsumption/PowerRangersMovieRebootMeansItsTimeToRemembertheOriginalClassicPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0f07523e-3251-4e4a-8c2c-485c0210cac6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35790-power-rangers-movie-reboot-means-its-time-to-remember-the-original-classic-photos_1540939568.html","title":"'Power Rangers' Movie Reboot Means It's Time To Remember the Original Classic - PHOTOS","title_page":"'Power Rangers' Movie Reboot Means It's Time To Remember the Original Classic — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"According to Entertainment Weekly, Lionsgate announced Wednesday that their Mighty Morphin Power Rangers reboot will arrive in movie theaters on July 22, 2016. That means that we're only 709 days away. Hold on, I need a minute. Or several. Last month, we learned that the movie's script is being written by Thor and X-Men: First Class scribes Ashley Miller and Zack Stentz, so this thing could actually turn out to be pretty good!\nIs this real life?\nPut simply, the Power Rangers were an incredibly important part of my childhood. I watched the television show every day after school and I had a crush on all of them. That's right, all of them! (Especially Jason, but ESPECIALLY Kimberly...but especially Billy.) Despite the show's ridiculous formula — Rita Repulsa sends villains to Earth, Power Rangers fight villains, Power Rangers win — I loved it unconditionally.\nSo, imagine my excitement when the original Power Rangers movie, aptly titled, Mighty Morphin Power Rangers: The Movie, hit the big screen in 1993! I exploded. You know that I got a VHS copy for my birthday, and you know that I watched that thing until it disintegrated into DUST.\nI loved Mighty Morphin Power Rangers: The Movie. I thought it was amazing, but I have no way of watching it now. It exists only in my memory (and in poor quality clips on YouTube). I haven't seen it in probably 20 years. But if you've never seen the original Power Rangers movie and you're worried about being ready to see the reboot when it comes out in, you know, two years, don't fret! I'm prepared to give you a detailed rundown based solely on what I can only kind of remember. You can never be too prepared. Let's get started!\nOk, so it all starts off with the Power Rangers — Adam, Aisha, Billy, Kimberly, Rocky, and Tommy — skydiving with their high school's resident bullies, Bulk and Skull. I don't remember why they're skydiving together, but probably because it's AWESOME. Also, they're all supposed to be teenagers, even though they're, like, a million years old. Classic Power Rangers.\nSoon, some local construction workers discover a giant purple egg buried deep underground. This isn't that weird, because sometimes giant purple eggs are just buried deep underground! So, they dig it up and put some caution tape around it (just to be safe). Zordon, the leader of the Power Rangers who looks just like Uncle Fester but isn't, tells the Rangers that a man named Ivan Ooze lives inside this egg. He was banished there for being simply too much.\nIt's tough to understand what Zordon means until Ivan Ooze escapes from his egg prison and simply EXPLODES onto the scene with his larger-than-life personality and a series of Vaudeville-esque jokes that only grandmas and grandpas can understand. He is a fast-talking purple muppet wizard, and he can shoot lightning out of his fingers. He HATES parents, and if I'm remembering correctly, he wants to turn everyone into ooze or something. Because... you know.\nAt some point, Ivan Ooze attacks Zordon at his futuristic headquarters, nearly killing him. In order to save Zordon, the Power Rangers must travel to a mystical island in order to rediscover why they became Power Rangers in the first place. (I don't remember why they became Power Rangers in the first place. Was it exposure to radiation and an innate desire to protect the Earth from a gravelly voiced space hag? I think so.)\nOnce on the island, a mysterious British woman in a bikini teaches them all how to reconnect with their spirit animals/dinos. (She may have also recently escaped from an egg.) I don't know how one reconnects with a pterodactyl, for instance, but I bet it involves time travel, magic, or BOTH — and that sounds like a whole lot of fun to me! Before long, everybody's got new outfits and it's time to go back to... Sunny... ville (is that what their hometown is called?) to fight Oozenstein.\nOh, Rita Repulsa is definitely in this movie, too, along with her husband, Lord Zedd, but I don't remember how they fit into the story. I do know that Rita sends these hilarious flying bird monsters to Earth in order to fight the Power Rangers, though. They are incredible and I wanted to be one more than I wanted to be an actual Power Ranger. But I digress.\nThings have gone absolutely bonkers in Sunnyville. Ivan Ooze has hypnotized all of the parents in town and they're about to walk off a cliff to their deaths. This annoying kid is trying to stop them, but he's doing a terrible job because he's a kid and all kids are helpless. So, the Power Rangers hop into their giant fighting robot in order to take on Ivan Ooze, who also has a giant fighting robot. Fortunately, Ivan Ooze's robot has one major weakness: its dick. The Power Rangers win the battle by kneeing Ivan Ooze's robot in the crotch, killing him instantly. The breathtaking dick kick brings Zordon back to life, and balance is restored to the universe.\nAt the end of the movie, all of the Rangers (plus that stupid kid) are eating cheese fries on a patio somewhere while fireworks go off in the background. I think a Van Halen song is playing. Sunnyville is saved! They all vow to always be Power Rangers and to always be enrolled in high school, even though they're, like, a million years old. All is right with the world. Also, this robot named Alpha 5 is in the movie, but I don't have time for his drama right now!\nFin.\nI'm sure I missed some little details here and there, but basically, you're now totally ready to see the Mighty Morphin Power Rangers reboot in 2016. As always, go go Power Rangers!\nImages: 20th Century Fox; Saban Entertainment; Disney; Giphy (4)","url":"https://www.bustle.com/articles/35790-power-rangers-movie-reboot-means-its-time-to-remember-the-original-classic-photos"}
