{"authors":[],"date_download":"2018-10-22 20:52:05","date_modify":"2018-10-22 20:52:05","date_publish":"2014-05-04 20:57:21","description":"Brominated vegetable oil, linked to a flame retardant, was removed from Gatorade last year.","filename":"data/vaneerConsumption/PoweradeDropsControversialIngredientBrominatedVegetableOil.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/419351/140504-powerade-ingredient-ef-1658_363417945afd550cc31a7af243224e7b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_powerade-drops-controversial-ingredient-brominated-vegetable-oil-n96786_1540241525.html","title":"Powerade Drops Controversial Ingredient Brominated Vegetable Oil","title_page":"Powerade Drops Controversial Ingredient Brominated Vegetable Oil","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCoca-Cola is dropping a controversial ingredient from its Powerade sports drink, after a similar move by PepsiCo's Gatorade last year.\nThe ingredient, brominated vegetable oil, had been the target of a petition by a Mississippi teenager, who questioned why it was being used in a drink marketed toward health-conscious athletes. The petition on Change.org noted that the ingredient is linked to a flame retardant and is not approved for use in Japan or the European Union.\nIn response to customer feedback, PepsiCo said last year it would drop the ingredient from Gatorade. At the time, Coca-Cola declined to say whether it would remove the ingredient from the two flavors of Powerade that contain it as well.\nBut this week, bottles of Powerade in fruit punch and strawberry lemonade flavors being sold in the Detroit, Michigan; Omaha, Nebraska, New York and Washington, D.C. areas no longer list the ingredient. Some bottles still list it, however, suggesting Coca-Cola Co. may have started phasing it out recently.\nA representative for the Atlanta-based company confirmed Sunday that its Powerade brands are \"BVO-free.\" But no details were immediately available on when the change would be complete or how the drinks were reformulated.\nPowerade's website still lists brominated vegetable oil as an ingredient for its fruit punch and strawberry lemonade flavors.\nThe Food and Drug Administration says brominated vegetable oil is used as a stabilizer for flavoring oils in fruit-flavored drinks. Coca-Cola has said in the past that it uses it to \"improve stability and prevent certain ingredients from separating.\"\nThe decision by Coca-Cola to remove brominated vegetable oil from Powerade is just the latest evidence that food makers are coming under pressure for the ingredients they use.\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/powerade-drops-controversial-ingredient-brominated-vegetable-oil-n96786"}
