{"authors":["Laura Wagner"],"date_download":"2018-10-22 21:18:19","date_modify":"2018-10-22 21:18:19","date_publish":"2016-05-09 00:00:00","description":"The speaker of Brazil's lower house of Congress annulled a vote on the impeachment of President Dilma Rousseff. And then he decided to reverse his decision.","filename":"data/vaneerConsumption/PowerStruggleInBrazilianGovernmentContinuesToSeesaw.json","image_url":"https://media.npr.org/assets/img/2016/05/09/ap_16127571858963_wide-f1a1ccccf4829ab4085fa3c7fb271ede047a4247.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_05_09_477379818_power-struggle-in-brazilian-government-continues-to-seesaw_1540243099.html","title":"Power Struggle In Brazilian Government Continues To Seesaw","title_page":"Power Struggle In Brazilian Government Continues To Seesaw : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Power Struggle In Brazilian Government Continues To Seesaw\nEnlarge this image toggle caption Eraldo Peres/AP Eraldo Peres/AP\nThe speaker of Brazil's lower house of Congress on Monday annulled last month's vote on the impeachment of embattled President Dilma Rousseff. Shortly afterward, the leader of Brazil's Senate announced he will ignore the speaker's decision and press on with the impeachment process. And later still, the speaker said he had reversed his own decision.\nThe political seesawing further complicates the already chaotic struggle for political power in Brazil's government.\nIn Rio de Janeiro, Catherine Osborn reports for NPR that House speaker Waldir Maranhão initially decided to nullify the earlier impeachment vote because, he said, Congress members voted \"on the basis of politics.\"\nAs the Two-Way reported, the \"vote was 367 to 137 with seven abstentions,\" and \"two deputies were not present,\" with the total count \"easily surpass[ing] the two-thirds majority required to send the proceeding to Brazil's Senate.\"\nCatherine reports that the president of Brazil's Senate, Renan Calheiros, \"called the lower house leader's decision unilateral and undemocratic\" and said that \"the Senate will move forward with a vote Wednesday that is expected to suspend Rousseff to trial.\"\nAccording to The New York Times, \"Raimundo Lira, the senator at the helm of that body's impeachment commission, said that Mr. Maranhão's decision had no 'practical effect.' \"\nRousseff is charged with tampering with the state budget to make the deficit appear smaller than it actually is. As NPR's Lourdes Garcia-Navarro explained, \"She is accused of juggling federal accounts to make the economy seem better than it was before her re-election in 2014.\"\nLourdes adds that the case is viewed as \"insubstantial\" by many legal analysts.","url":"https://www.npr.org/sections/thetwo-way/2016/05/09/477379818/power-struggle-in-brazilian-government-continues-to-seesaw"}
