{"authors":["Press Association"],"date_download":"2018-10-23 01:04:13","date_modify":"2018-10-23 01:04:13","date_publish":"2017-04-26 11:09:09","description":"The 36-year-old defender will be leaving Chelsea this summer.","filename":"data/vaneerConsumption/PoyetTerrycouldmakeChinaswitch.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464425-1493201356-523_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447072_Poyet-Terry-make-China-switch_1540256653.html","title":"Poyet: Terry could make China switch","title_page":"Poyet: Terry could make China switch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"John Terry could move to China this summer, according to his former Chelsea team-mate Gus Poyet who is now manager of Shanghai Shenhua.\nTerry will be leaving Chelsea this summer after 22 years at Stamford Bridge and is available on a free transfer.\nThe 36-year-old defender came off the substitutes’ bench for his 714th appearance, and first in the Premier League since November, in Chelsea’s 4-2 win over Southampton on Tuesday night.\nGus Poyet during his time at Sunderland (Owen Humphreys/PA)\nTerry, who has won 14 major trophies at Chelsea, could finish the season lifting more silverware, with the Blues also in the May 27 FA Cup final against Arsenal.\nHe has been linked with numerous Premier League clubs, plus moves to Major League Soccer, the Middle East and the Chinese Super League, where recent transfer restrictions may not apply to Terry, Poyet says.\nPoyet told talkSPORT: “It is a great opportunity for him and for all the teams here (in China), including us.\nHaving brought John Terry on as a sub today, Conte says the player knows he is admired by his manager. #CHESOU — Chelsea FC (@ChelseaFC) April 25, 2017\n“The latest change of the quantity of foreigners on the pitch stops some clubs from bringing in defenders, but we are talking about a special one.\n“It is a great possibility that China will be one of the possible situations for John Terry in the future.\n“It is a very difficult decision whether to stay in England or go abroad.\n“I would like him not to play in the Premier League for another club – maybe I’m a little bit selfish.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447072/Poyet-Terry-make-China-switch.html"}
