{"authors":[],"date_download":"2018-10-22 21:10:55","date_modify":"2018-10-22 21:10:55","date_publish":"2014-06-04 13:48:18","description":"Getting ready for the zombie apocalypse might just save your life—in the event of a hurricane, terrorist attack or other disaster.","filename":"data/vaneerConsumption/PracticalReasonsToPlanForaZombieApocalypse.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/442946/140514-zombie-jms-1719_908319adff96f656f5a7a865ee00696b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_practical-reasons-plan-zombie-apocalypse-n122286_1540242655.html","title":"Practical Reasons To Plan For a Zombie Apocalypse","title_page":"Practical Reasons To Plan For a Zombie Apocalypse","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGetting ready for the zombie apocalypse might just save your life—in the event of a hurricane, terrorist attack or other disaster.\nZombies have become a popular theme in emergency planning. The Centers for Disease Control launched a \"Zombie Preparedness Campaign\" in 2011, and last fall, more than 65,000 people signed up for a massive open online course through University of California at Irvine for an academic crossover with AMC's \"The Walking Dead,\" tackling subjects including the spread of infectious disease and managing stress in disaster situations.\nThere are also preparedness apps such as Apocalypse Survival Guide—zombies are just one world-ending possibility—which this week plans to launch a feature to allow friends to create emergency plans together.\n\"If you're ready for zombies, you're ready for anything,\" said Matt Mogk, founder of the Zombie Research Society, which tracks scientific and cultural zombie references.\nEven the Pentagon, it was recently revealed, has looked at zombie survival scenarios. Now you know it's serious!\nOr not.\nEven the Pentagon, it was recently revealed, has looked at zombie survival scenarios.\n\"Zombie attacks\" made the list of disasters people worry about, in a spring survey of 5,835 adults by coupon site Tada.com. But they (and other oddballs including alien invasion and Obamacare) were more of a footnote compared to tornadoes, which 20 percent of people worried about. Hurricanes (14 percent), earthquakes (14 percent), blizzards (12 percent) and floods (12 percent) also made the list of top worries.\nRead More: Pentagon ready for zombie apocalypse\n\"The thing about zombies is, they capture people's imagination in a way that actual disasters don't,\" said Russ Paulsen, executive director of community preparedness and resilience for the American Red Cross. \"If thinking about zombies and thinking about it in a lighthearted way encourages people to take reasonable disaster preparedness steps, more power to them.\"\nGiven Americans' lack of disaster planning, anything that sparks that interest could make a big difference.\nThe Federal Emergency Management Agency's 2013 Preparedness in America report classified 46 percent of Americans as falling into the \"Not On Their Radar\" profile. Of those people, just 34 percent were likely to have disaster supplies at home, and 27 percent, a family plan for emergencies.\n(FEMA did not respond to requests for comment about the need for zombie preparedness.)\nOverall, 61 percent of Americans said they don't have a family emergency plan, and 48 percent don't have supplies set aside for a disaster.\nPerhaps scarier -- the percentage of people taking the government's recommended preparedness actions in 2012, when the survey was conducted, hasn't budged since FEMA's first survey on the subject in 2007. Overall, 61 percent of Americans said they don't have a family emergency plan, and 48 percent don't have supplies set aside for a disaster.\nRead More: Insurance gaps that could cost you in a hurricane\n\"People don't like to think about disasters,\" said John Caballero, creator of the Apocalypse Survival Guide. \"They say, 'That will never happen to me.' \"\nPlanning for zombies is better than planning for nothing at all and has plenty of practical applications.\n\"I'm tricking people into helping themselves,\" said Caballero. \"If they make a group plan with their friends for a zombie apocalypse, and the next Hurricane Sandy comes in, they could use that plan to stay safe.\"\nFor example, the safest place in your home in the event of a zombie attack is probably also the best spot to shelter in the event of a tornado, Paulsen said.\nFleeing hordes of the undead? In the UC Irvine course, one of the more popular class discussions was a practical one for any disaster: Finding safety, said Sarah Eichhorn, associate dean for distance learning. \"Where would you go?\" she said. \"If you had to get out of town, where would be safest?\"\nAssessing your ability to make it through a far-out apocalyptic scenario—like a zombie attack—can get people to think about vulnerabilities they might not want to admit for more mundane scenarios, Caballero said. That includes risks inherent to their location (how easily could you evacuate?) and ongoing health needs (do you wear glasses, take asthma medication?).\nAssessing your ability to make it through a far-out apocalyptic scenario—like a zombie attack—can get people to think about vulnerabilities they might not want to admit for more mundane scenarios,\nRead More: 10 Doomsday Homes\nAnd having a first aid kit, bottled water and a battery-powered radio are smart to have on hand whether you're expecting the power to be knocked out by zombies or a natural disaster. \"There could be a giant earthquake in Los Angeles at any moment, but that never inspired me to get an earthquake preparedness kit,\" said Mogk. His assembled a zombie preparedness kit, however, will work just fine in that scenario.\nIt doesn't do to be too zombie focused, though. \"There are some kits out there that are complete novelty and totally unpractical,\" said Mogk. \"You need more than a zombie survival guide, a crowbar and a chainsaw.\"\nPaulsen said prep should focus on thinking about a family plan, including where to meet and important items to take in an evacuation. \"Basic planning like that goes a long way, and it's free,\" he said. (Both the Red Cross and Ready.gov have DIY kit lists.)\nBesides, zombie fans, there are other, er, larger threats. \"People in Memphis and the West Coast ought to be more concerned about Godzilla preparedness,\" said Paulsen, \"for earthquakes.\"","url":"https://www.nbcnews.com/science/weird-science/practical-reasons-plan-zombie-apocalypse-n122286"}
