{"authors":[],"date_download":"2018-10-23 05:09:49","date_modify":"2018-10-23 05:09:49","date_publish":"2017-04-26 16:42:34","description":"Human funerary practices mean nutrients are being concentrated unnaturally in cemeteries instead of being dispersed evenly throughout nature, according to new research in Prague.","filename":"data/vaneerConsumption/Praguescientistswarncorpsesarealteringsoilchemistry.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA08A0B00000578-0-image-a-6_1493220832050.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4448314_How-humans-ruining-Earth-grave_1540271389.html","title":"Prague scientists warn corpses are altering soil chemistry","title_page":"Prague scientists warn corpses are altering soil chemistry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's not only in life that humans leave their mark on nature.\nIn death, our decomposing corpses alter the chemistry of precious soil, scientists have warned.\nWhether our bodies are buried or cremated, they leach iron, zinc, sulphur, calcium and phosphorus into ground that may later be used as farms, forests or parks.\nThey are essential nutrients, but human funerary practices mean they are being concentrated in cemeteries instead of being dispersed evenly throughout nature, according to new research.\nScroll down for video\nIt's not only in life that humans leave their mark on Nature. In death, our decomposing corpses alter the chemistry of precious soil, scientists warned on Wednesday. And, the effects are long lasting\nWHAT THEY FOUND Smejda and a team used X-ray fluorescence spectroscopy to analyse soil chemicals in graves and ash 'scattering gardens'. Using animal carcasses, they also measured the theoretical impact of an ancient practice called 'excarnation', whereby the dead are left out in the open for nature to take its course. In all three cases, the ground contained 'significantly' higher concentrations of chemicals compared to the surrounds. If there had been no cemeteries, human remains, like those of animals, would be distributed randomly for the nutrients they release to be reused 'again and again, everywhere.' But concentrating them in certain places 'is something that can be regarded as not natural. It's a human impact, we are changing natural levels,' the researcher said.\nThis means that in some places the nutrients may be over-concentrated for optimal absorption by plants and creatures, while lacking in others.\nFurthermore, human bodies also contain more sinister elements, such as mercury from dental fillings.\n'Chemical traces of decomposed bodies can frequently be very well distinguished in soil,' said Ladislav Smejda of the Czech University of Life Sciences in Prague, who took part in the unusual probe.\n'These traces persist for a very long time, for centuries to millennia.'\nThe effects will become more pronounced as more and more dead bodies are laid to rest, Smejda said in Vienna, where he unveiled the research at a meeting of the European Geosciences Union.\n'What we do today with our dead will affect the environment for a very, very long time,' he said.\n'Maybe it is not such a problem in our current perspective but with an increasing population globally it might become a pressing problem in the future.'\nSmejda and a team used X-ray fluorescence spectroscopy to analyse soil chemicals in graves and ash 'scattering gardens'.\nUsing animal carcasses, they also measured the theoretical impact of an ancient practice called 'excarnation', whereby the dead are left out in the open for nature to take its course.\nIn all three cases, the ground contained 'significantly' higher concentrations of chemicals compared to the surrounds, Smejda said.\nIf there had been no cemeteries, human remains, like those of animals, would be distributed randomly for the nutrients they release to be reused 'again and again, everywhere,' the researcher told AFP.\nIt means that in some places the nutrients may be over-concentrated for optimal absorption by plants and creatures, while lacking in others. Furthermore, human bodies also contain more sinister elements, such as mercury from dental fillings\nBut concentrating them in certain places 'is something that can be regarded as not natural. It's a human impact, we are changing natural levels,' he said.\nNow the question is: 'Can we come up with a better idea (of) how to distribute these necessary elements across wider landscapes?' Smejda added.\n'Certainly there is a potential to invent, to develop and to put into practice... new ways of human burial or new treatments that could be more environmentally friendly, more ecological.'\nHe conceded this was a 'taboo' topic for many, with funerary customs deeply rooted in culture and religion.\n'It's a very complex matter and we are just at the start of this discussion, I think.'","url":"https://www.dailymail.co.uk/sciencetech/article-4448314/How-humans-ruining-Earth-grave.html"}
