{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:50:27","date_modify":"2018-10-30 18:50:27","date_publish":"2017-02-07 23:05:33","description":"Dave Rubin, of The Rubin Report, explained his move away from the American political left in a recent video for Prager University.","filename":"data/vaneerConsumption/PragerUDaveRubinExplainsWhyHeLeftthePoliticalLeft.json","image_url":"https://media.breitbart.com/media/2017/02/fb0d90b165c016d032df653e74d3d2d1-Cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_02_07__1540925427.html","title":"PragerU: Dave Rubin Explains Why He Left the Political Left","title_page":"PragerU: Dave Rubin Explains Why He Left the Political Left | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An excerpt from Rubin’s address can be read below. The entirety of the clip’s script can be read on Prager University’s website.\nDo you believe in free speech?\nDo you believe that people should be judged by their character, not their skin color?\nDo you believe in freedom of religion?\nIf you believe these things, you’re probably not a progressive. You might think you’re a progressive. I used to think I was. My show, “The Rubin Report” was originally part of the progressive “The Young Turks” network.\nProgressives struck me as liberals but louder. Progressives were the nice guys; they looked out for the little guy; they cared about women and minorities; they embraced change.\nWho wouldn’t want to be a progressive?\nBut over the last couple years, the meaning of the word “progressive” has changed.\nProgressives used to say, “I may disagree with what you say, but I will fight to the death for your right to say it.” Not anymore.\nBanning speakers whose opinions you don’t agree with from college campuses – that’s not progressive.\nProhibiting any words not approved of as “politically correct” that’s not progressive.\nPutting “Trigger Warnings” on books, movies, music, anything that might offend people – that’s not progressive either.\nAll of this has led me to be believe that much of the Left is no longer progressive, but regressive. This is one of the reasons I’ve spent so much time on my show talking about The Regressive Left.\nThis regressive ideology doesn’t judge people as individuals, but as a collective.","url":"https://www.breitbart.com/tech/2017/02/07/dave-rubin-left-left/"}
