{"authors":["Press Association"],"date_download":"2018-10-22 23:51:52","date_modify":"2018-10-22 23:51:52","date_publish":"2016-01-28 13:14:14","description":"Rail companies should be praised when trains run on time, a Tory MP has said. Huw Merriman suggested that criticism of train operators for running late or cr...","filename":"data/vaneerConsumption/Praiserailfirmswhentrainsrunontimesaystorymp.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-f0c771cd-7bb9-4773-91f9-29fb5225fead-2vdWmEltwXfba0ce28e6328fbb7e-410_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420914_Praise-rail-firms-trains-run-time-says-Tory-MP_1540252312.html","title":"Praise rail firms when trains run on time, says tory mp","title_page":"Praise rail firms when trains run on time, says tory mp | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Praise rail firms when trains run on time, says Tory MP\nRail companies should be praised when trains run on time, a Tory MP has said.\nHuw Merriman suggested that criticism of train operators for running late or crammed services should be offset by positive remarks when they \"get it right most days\".\nTransport Secretary Patrick McLoughlin said the Bexhill and Battle MP was \"absolutely right\" and stressed upgrades to the Thameslink line Mr Merriman uses will cause disruption but eventually lead to better services.\nHuw Merriman suggested that criticism of train operators for running late or crammed services should be offset by positive remarks\nThameslink came bottom of a rail passenger satisfaction survey released this week with 73% of passengers telling the Transport Focus study they were happy with services.\nDuring transport questions in the Commons, Mr Merriman said : \"This morning my train to London Bridge got me in on time.\n\"Would you agree with me that as well as being negative when things don't work, we should also be positive to our rail franchises when they do get it right most days?\"\nMr McLoughlin replied: \"I think you are absolutely right.\n\"What you are seeing on your line and the line that goes into London Bridge and other trains through Thameslink is a massive upgrade of some £6.5 billion.","url":"https://www.dailymail.co.uk/wires/pa/article-3420914/Praise-rail-firms-trains-run-time-says-Tory-MP.html"}
