{"authors":["Gabe Bergado"],"date_download":"2018-10-30 23:38:55","date_modify":"2018-10-30 23:38:55","date_publish":"2014-08-13 15:35:28","description":"Everybody, grab your headbands and your sports bras — The Prancercise lady, Joanna Rohrback, is back with a brand-new video to show you how to gallop into shape. And this time, she's not alone. Joining her is a man-friend with no sleeves, but with…","filename":"data/vaneerConsumption/PrancerciseLadyJoannaRohrbackIsBackandSheBroughtaFriendThisTime.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4672b9e5-10c7-4a5c-ac37-fcfbbc71e2b6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35594-prancercise-lady-joanna-rohrback-is-back-and-she-brought-a-friend-this-time_1540942735.html","title":"Prancercise Lady Joanna Rohrback Is Back, and She Brought a Friend This Time","title_page":"Prancercise Lady Joanna Rohrback Is Back, and She Brought a Friend This Time","title_rss":"NULL","source_domain":"bustle.com","text":"Everybody, grab your headbands and your sports bras — The Prancercise lady, Joanna Rohrback, is back with a brand-new video to show you how to gallop into shape. And this time, she's not alone. Joining her is a man-friend with no sleeves, but with the most perfect Prancercise form and some lovely zebra-print leggings.\nNow, if you don't remember Joanna Rohrback and her fitness mantra, let me give you a quick refresher. She first skipped into our hearts last year with the original Prancercise video. Equipped with ankle weights and a sound track of pseudo-country music, she showed us how imitating a horse could bring physical and spiritual excellence. There's even a book that expands on Rohrback's principles of a healthy life. The workout video went viral and was GIF-ified all over the Internet. Jillian Michaels and Richard Simmons had to step aside: We had a new workout queen.\nRohrback's new video is definitely more fleshed out than her first. Complete with a partner, real horses, and slo-mo (at least, I think it's slow motion) effects, the clip will surely get you off your couch and into some workout gear. Check out the video below:\nPrancercise on YouTube\nThis video is awesome, but I'm left with a few questions. Namely:\nWho exactly is this partner? Just friends? Just a fellow Prancercise enthusiast? Possible lover? Multibillionaire Prancercise investor?\nAnd where exactly did he get those killer leggings?\nJoanna, is that proper Prancercise footwear?\nWait, what is proper Prancercise footwear?\nproper Prancercise footwear? How did they get those far away, semi-aerial shots?\nWas there any risk of either Prancerciser getting trampled by a horse?\nWere the horses aware their images were going to be used to market Prancercise?\nWhy was there no boxing segment of this Prancercise routine?\nExactly how many calories does Prancercise burn?\nPrancercise burn? Did anyone else notice the horse taking a dump at 3:29 then gallop away like nothing happened? (now you did)\nWe need answers, Joanna, and we need answers now.\nImages: Prancercise/Facebook","url":"https://www.bustle.com/articles/35594-prancercise-lady-joanna-rohrback-is-back-and-she-brought-a-friend-this-time"}
