{"authors":["Aimee Brannen For Mailonline"],"date_download":"2018-10-23 01:18:35","date_modify":"2018-10-23 01:18:35","date_publish":"2016-01-11 12:06:59","description":"Joke shop founders Travis and Nick Peterson, from Southern California, have devised the incessantly wailing card which doesn't stop for 180 minutes to remind parents what they have signed up for.","filename":"data/vaneerConsumption/Pranksterscreateababyshowercardthatplaysanewbornscriesfor3HOURS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3006ECB000000578-0-image-a-5_1452510682902.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393743_Pranksters-devise-card-plays-newborn-s-cries-THREE-hours_1540257515.html","title":"Pranksters create a baby shower card that plays a newborn's cries for 3 HOURS","title_page":"Pranksters create a baby shower card that plays a newborn's cries for 3 HOURS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The only way the sound will stop is when the battery finally drains\nA baby shower card which plays the cries of a newborn baby for more than three hours has been devised by pranksters.\nThe unassuming card devised by Travis and LA-based Nick Peterson reminds parents what they've signed up for with incessant wailing lasting more than 180 minutes.\nOn the outside, the prank product looks just like an ordinary white greeting card, with a photograph of a cute sleeping infant and the words 'A baby is God's sweetest gift' in calligraphy.\nScroll down for video\nTravis and Nick Peterson in Southern California devised the card to remind parent what they've signed up for\nThe incessant wailing is activated at the press of an unassuming button - but lasts more than 180 minutes\nIf you continue to press the button, the agonising cries only get louder - and can't be stopped even if the card is ripped or crushed\nHowever, a tongue-in-cheek message inside the card reads 'the gift that keeps on giving' - and, indeed, the screaming baby doesn't stop even if the card is ripped or crushed.\nWhen the recipient pushes a button which just says 'press' next to a musical note, likely to be expecting a brief jingle, the relentless wailing begins - and the agonising noise only gets louder when you press it again\nOn the creator's website Joker Greeting, the description for the product reads: 'Yes, a baby shower card that is a baby crying incessantly.\n'Welcome them into parenthood the best way possible.'\nThe sender of the £7.54 card, which is available for pre-order for March, can test out the noise on 'safe mode' without actually activating the non-stop crying.\nBefore sealing the envelope, they just need to remove a pull-off tab to make the card ready for the unlucky recipient.\nPresident of Joker Greeting, Travis Peterson, who lives in Orange County, was inspired to create this card by his experiences with his own child as a baby.\nPresident of Joker Greeting, Travis Peterson, was inspired to create this card by his experiences with his own child as a baby - and thought it was a great way to say 'welcome to parenthood'\nThe card costs £7.54 and is available to reorder from the Joker Greeting website for March\nMr Peterson said: 'I have a three year-old and a baby due in February. I am familiar with this sort of noise.\n'This was one of our first ideas once the birthday card was successful. We figured it was a great way to say: \"welcome to parenthood\".\n'We haven't yet shipped any of these cards, but I know this Baby Shower card will be a hit.\n'It strikes a very particular and personal nerve - and yet it is still funny.'\nHe added: 'The Joker Baby Shower card is a follow-up to our amazing Joker Birthday card which continues to be successful.","url":"https://www.dailymail.co.uk/femail/article-3393743/Pranksters-devise-card-plays-newborn-s-cries-THREE-hours.html"}
