{"authors":[],"date_download":"2018-10-30 18:51:30","date_modify":"2018-10-30 18:51:30","date_publish":"2016-08-25 20:58:37","description":"The fight over a proposed Georgia Opportunity School District has so far centered on the two dozen words that make up the ballot question facing voters in November.","filename":"data/vaneerConsumption/PreambleforOpportunitySchoolDistrictballotitem.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_new-ba_3311410ec89a86617db6ec8ef7e45567__1540925490.html","title":"Preamble for Opportunity School District ballot item","title_page":"Preamble for Opportunity School District ballot item","title_rss":"NULL","source_domain":"ajc.com","text":"The fight over a proposed Georgia Opportunity School District has so far centered on the two dozen words that make up the ballot question facing voters in November.\nNow, Georgia Secretary of State Brian Kemp has published 14 more words — the official preamble to the ballot question is: “Provides greater flexibility and state accountability to fix failing schools through increasing community involvement.”\n(Kemp doesn’t write the preamble. He’s merely publicizing the work of the Constitutional Amendments Publication Board, chaired by Gov. Nathan Deal and comprising the leaders of the state House and Senate.)\nThat’s how voters across the state, who in some cases will not have heard or read about the school takeover plan before entering their polling place, will form their first impression of it.\nIf it passes, it will enact a 13-page piece of legislation, Senate Bill 133, that details how the governor would set up a new, indepenedent, statewide school system, with the power to take over schools with persistently low scores on the state report card.\nThe ballot question itself asks voters this: “Shall the Constitution of Georgia be amended to allow the state to intervene in chronically failing public schools in order to improve student performance?”","url":"https://www.ajc.com/news/local-education/new-ballot-language-for-state-schools-takeover-proposal/CEbv8idIzu1wXn9IJbIjKM/"}
