{"authors":["Abe Hawken For Mailonline"],"date_download":"2018-10-23 01:09:18","date_modify":"2018-10-23 01:09:18","date_publish":"2017-04-26 11:13:10","description":"Keith Poe, a conservationist, captured the jaw-dropping moment and said the shark ate so much she was swimming around 'upside down like she was intoxicated' in California.","filename":"data/vaneerConsumption/Pregnantgreatwhitesharkchompsonabloatedwhale.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DB3AD00000578-0-image-a-10_1493200657612.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446718_Pregnant-great-white-shark-chomps-bloated-whale_1540256958.html","title":"Pregnant great white shark chomps on a bloated whale","title_page":"Pregnant great white shark chomps on a bloated whale | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pregnant great white shark has been filmed tearing into the carcass of a bloated humpback whale for 17 hours.\nThe fierce shark, which can grow up to 20ft, took giant chunks out of the mammal, who was being towed away by lifeguards.\nKeith Poe, a conservationist, captured the jaw-dropping moment and said the shark ate so much she was swimming around 'upside down like she was intoxicated'.\nHe had travelled to the whale's carcass, nicknamed 'Scarlett' by locals in Dana Point, California, and was stunned to see the shark feasting on the body.\nThe great white shark took a huge chunk out of the carcass 14 miles off the Californian coast\nThe hungry shark would return to the carcass every 15 minutes and her whole feasting session lasted a staggering 17 hours.\nMr Poe visited the carcass with student Ryan Logan and he revealed that Mr Logan was able to 'tag' the female shark.\nHe posted online: 'Big female white shark tearing chunks off Scarlett the whale.\n'She ate so much she was swimming around upside-down aimlessly like she was intoxicated.'\nThe whale, who was nicknamed 'Scarlett' was seen by the great white shark who decided to feast on its carcass","url":"https://www.dailymail.co.uk/news/article-4446718/Pregnant-great-white-shark-chomps-bloated-whale.html"}
