{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 01:10:13","date_modify":"2018-10-23 01:10:13","date_publish":"2017-04-26 11:20:20","description":"Serena Williams was spotted in public for the first time since news of her pregnancy broke, attending the TED conference in Vancouver, Canada on Tuesday.","filename":"data/vaneerConsumption/PregnantSerenaWilliamsstepsoutinstyleinCanada.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EF8BD00000578-0-image-a-14_1493202283477.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447162_Pregnant-Serena-Williams-steps-style-Canada_1540257013.html","title":"Pregnant Serena Williams steps out in style in Canada","title_page":"Pregnant Serena Williams steps out in style in Canada | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently admitted she had announced her pregnancy on social media by accident.\nAnd Serena Williams was spotted in public for the first time since news broke, attending the TED conference in Vancouver, Canada on Tuesday.\nThe tennis pro, who last week accidentally sent a swimsuit snap captioned '20 weeks' to all her followers instead of her intended recipient, kept covered up in a business chic ensemble.\nBaby bump: Serena Williams was spotted in public for the first time since news of her pregnancy broke, attending the TED conference in Vancouver, Canada on Tuesday\nSerena donned a smart, fitted dress and a coordinating, caped jacket for added glamour.\nShe finished off her business chic attire with a pair of high heel and simple, elegant jewellery.\nThe sportswoman kept her arms folded over her bump as she made her way to the high profile event.\nShe means business! Serena donned a smart, fitted dress and a coordinating, caped jacket for added glamour\nIn conversation: Serena was in her element onstage during the Ted Talk\nAnd it was during the Ted Talks event that Serena made the amusing admission that she had shared her happy news on Snapchat by mistake.\nThe star was speaking to Gayle King on the panel discussion when she revealed that she had intended the photo in a yellow one-piece swimsuit to be a private photo - but she accidentally posted it to the world.\nThe tennis number one said: 'You know how social media is, you press the wrong button and...', which was also shared on Twitter.\nOops! Serena revealed on Tuesday that she shared her pregnancy news by mistake\nWrong button: She explained at a Ted Talk on Tuesday that she posted by mistake\nShe explained further: 'On social media, you press the wrong button and thirty minutes later I missed four calls and I’m like, \"That’s weird,\"' reports TMZ.\nThe website adds that she intended to disclose the information publicly 5 or 6 days later.\nSerena now appears to have embraced sharing the news on social media, but was certainly trying to put fans off the scent only a week ago.\nBumping along: Serena now appears to have embraced sharing the news on social media\nShe posted a picture of Kelly Rowland's new book for new mums, and captioned: ' So proud of you @kellyrowland. Ok so this book Kelly wrote is a guide for new moms.\n'One of these days I hope to apply this (but for now I'll stick to my dog Chip). The introduction is hilarious and had me hooked from the first word! Congrats my friend! #whoababy,' despite being 19 or 20 weeks down the line.\nSerena returned to the top of the WTA world rankings on Monday and immediately shared the news with her unborn baby.\nThe American, who is skipping the rest of the year after announcing last week that she was pregnant, took to social media to offer her first public thoughts on impending motherhood.\nSticking to the dog! Serena now appears to have embraced sharing the news on social media, but was certainly trying to put fans off the scent only a week ago\n'My Dearest Baby, You gave me the strength I didn't know I had. You taught me the true meaning of serenity and peace,' the 35-year-old who owns 23 grand slam titles, said on Instagram.\n'I can't wait to meet you. I can't wait for you to join the players box next year,' she continues.\n'But most importantly, I am so happy to share being number one in the world with you... once again today. From the world's oldest number one to the world's youngest number one. - Your Mommy.'\nThe champ is currently on a romantic holiday with her fiance, Reddit co-founder Alexis Ohanian, in Mexico.\nShe also SnapChatted a picture of herself Googling her name - and the rankings appearing.\n'I wonder if this is a first?' she wrote.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447162/Pregnant-Serena-Williams-steps-style-Canada.html"}
