{"authors":[],"date_download":"2018-10-22 21:55:19","date_modify":"2018-10-22 21:55:19","date_publish":"2018-06-25 00:00:00","description":"Doctors want to remind moms to get certain vaccines while pregnant. Whooping cough in particular can be deadly for newborns, but only about 50 percent of pregnant women get the vaccine.","filename":"data/vaneerConsumption/PregnancyVaccineProtectsNewbornsFromWhoopingCoughShots.json","image_url":"https://media.npr.org/assets/img/2018/06/22/final_wide-57776d633862801c47992a4e16d8b1f93faf45e4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=620113958_1540245319.html","title":"Pregnancy Vaccine Protects Newborns From Whooping Cough : Shots","title_page":"Pregnancy Vaccine Protects Newborns From Whooping Cough : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nAll right, when you're pregnant, you know that doctors want you to get a few key vaccines. And now the American College of Obstetricians and Gynecologists is trying to make that a little bit easier. For the first time, it's put together a one-page immunization guide for OBs and midwives. NPR's Selena Simmons-Duffin, who happens to be pregnant at this very moment, went to find out more.\nSELENA SIMMONS-DUFFIN, BYLINE: The guide pulls together information about which shots pregnant women should skip, which they can get and which they should definitely get. The two in that should-get category are the flu shot, since the flu can be really dangerous for pregnant women, and Tdap, the tetanus, diphtheria, pertussis vaccine.\nKIMBERLY JOHNSON: Would you have a preference which arm you would like it in?\nSIMMONS-DUFFIN: That's medical assistant Kimberly Johnson getting ready to give me Tdap a few weeks ago at 30 weeks pregnant.\nThis one's fine.\nJOHNSON: That one's fine? OK.\nSIMMONS-DUFFIN: The idea here is to protect newborns against pertussis or whooping cough.\nLAURA RILEY: People are like, I never heard of whooping cough. What's the big deal? Like, why do we even have to worry about this?\nSIMMONS-DUFFIN: That's Dr. Laura Riley. She's the vice chair of obstetrics at Massachusetts General Hospital and helped write the one-page guide. While pertussis is not generally a serious illness for adults...\nRILEY: If a newborn gets it, they can do very poorly and die.\nSIMMONS-DUFFIN: Newborns aren't given their own vaccine against pertussis until they're a few months old, which is why the best way to protect them is immunizing the mother in the third trimester of pregnancy. There's lots of data to show this works, but the Centers for Disease Control and Prevention estimates only about half of pregnant women get it, including me.\nDoes it hurt?\nJOHNSON: Might burn a little. And we are done.\nSIMMONS-DUFFIN: It really did hurt for a few days. Riley thinks there are two reasons why more people don't get the shot. One is that some patients refuse it because they don't think it's necessary or safe.\nRILEY: Or they hem and haw and, oh, no, I'll wait until my next visit. The next visit comes, no one remembers to ask them again. Well, that baby's not going to be protected.\nSIMMONS-DUFFIN: The other reason is providers sometimes just forget. Immunizations are not a huge part of prenatal care, which is why the American College of Obstetricians and Gynecologists is trying to make it easy.\nRILEY: To put all that information on one page easily posted in any OB or midwifery office so that it becomes more automatic and part of everyday prenatal care.\nSIMMONS-DUFFIN: The guide also makes clear which vaccines should be avoided, like varicella and MMR - measles, mumps and rubella. Live vaccines like this should wait until after the baby is born. Then there's the middle category of immunizations that can be given to pregnant women if they have certain conditions or risk factors. For instance...\nRILEY: Patients with diabetes or sickle cell disease, you should get pneumococcal vaccine during your pregnancy.\nSIMMONS-DUFFIN: There really aren't that many vaccines pregnant women need to worry about. It's a short list. Riley hopes the simplicity of the guide will result in more women getting vaccinated. It's something she's passionate about.\nRILEY: I do care about it because it's disease that can be prevented.\nSIMMONS-DUFFIN: My only complaint about the Tdap shot - it really hurt.\n(LAUGHTER)\nRILEY: Yeah, it's not comfortable.\nSIMMONS-DUFFIN: But she says if it's going to protect the baby, it's worth it. Selena Simmons-Duffin, NPR News.\n(SOUNDBITE OF SUN GLITTER'S \"WHAT ARE WE WAITING FOR\")\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=620113958"}
