{"authors":["Iona Kirfor Dailymail.Com"],"date_download":"2018-10-22 20:58:21","date_modify":"2018-10-22 20:58:21","date_publish":"2016-01-28 05:25:05","description":"The 33-year-old looked radiant on Wednesday at Los Angeles Fine Art Show's 2016 opening night premiere party, benefiting St. Jude Children's Research Hospital.","filename":"data/vaneerConsumption/PregnantAnneHathawayrevealsgrowingbumpinminidressatLAFineArtShow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A7038700000578-0-image-a-103_1453959604645.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420370_Pregnant-Anne-Hathaway-reveals-growing-bump-printed-mini-dress-leads-stars-LA-Fine-Art-Show_1540241901.html","title":"Pregnant Anne Hathaway reveals growing bump in mini-dress at LA Fine Art Show","title_page":"Pregnant Anne Hathaway reveals growing bump in mini-dress at LA Fine Art Show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pregnancy definitely suits Anne Hathaway.\nThe 33-year-old looked radiant on Wednesday at Los Angeles Fine Art Show's 2016 opening night premiere party, benefiting St. Jude Children's Research Hospital.\nAnne showcased her growing bump in a black and white printed mini-dress, which clung to her burgeoning belly and left her long legs on show.\nScroll down for video\nOh baby: Anne Hathaway showed off her growing bump at the Los Angeles Fine Art Show opening night on Wednesday\nWhile the actress is several months along in her pregnancy, she is not ready to give up the high heels just yet.\nAnne wore a pair of black platform sandals with sparkly silver heels, and also carried a metallic clutch bag by Nathalie Trad.\nThe Devil Wears Prada star styled her glossy brunette locks in bouncy curls, and finished off her look with smoky eye make-up and a slick of red lipstick.\nProud parents-to-be: The actress was joined by her handsome husband of three years, Adam Shulman\nBlooming lovely: Anne wore a printed black and white mini-dress, which displayed her burgeoning belly and her long legs\nAnne is expecting her first child with husband of three years Adam Shulman, who joined her at the event in a suave suit and tie.\nThe happy couple led a host of celebrity names at the charity event.\nShannen Doherty, who last August revealed that she is battling breast cancer, was joined by her Charmed co-star Holly Marie Combs.\nNo slowing down: The 33-year-old isn't ready to give up her heels just yet, and wore sparkly sky high platforms\nShe's got that pregnancy glow: Anne highlighted her stunning complexion with smoky eye make-up and red lipstick\nThe two women, who are 44 and 42 respectively, appeared to have coordinated outfits in black dresses and black boots.\nShannen looked happy and healthy as she posed with close friend Holly on the red carpet.\nZach Braff was also at the event in a black tuxedo, while Katherine McNamara was another star to pick black.\nMeanwhile, Species actress Natasha Henstridge wore a pretty floral dress with a plunging neckline.\nBest friends: Shannen Doherty, who last summer revealed she is battling breast cancer, was joined by Charmed co-star Holly Marie Combs\nThey got the memo too: Natasha Henstridge (L) and Katherine McNamara were among the other stars to wear black\nIt was revealed in November that Anne is expecting her first child, when she stepped out debuting a prominent baby bump.\nAnd a source told E! News last month that the Oscar winner has so far been feeling great during her pregnancy.\n'Anne is feeling really healthy. She is working out and trying to stay in shape during this pregnancy,' the insider said. 'Her energy levels are high.\n'She has some new cravings. She is at a healthy pregnancy weight and not stressing out about the weight gain.'\nSuits you: Meanwhile Zach Braff looked suave in a black tuxedo, but went without a tie","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420370/Pregnant-Anne-Hathaway-reveals-growing-bump-printed-mini-dress-leads-stars-LA-Fine-Art-Show.html"}
