{"authors":["Chris Pleasance For Daily Mail Australia"],"date_download":"2018-10-22 22:51:38","date_modify":"2018-10-22 22:51:38","date_publish":"2017-03-16 04:40:45","description":"Anna Horneshaw, 28, who stabbed 67-year-old Zvonimir Petrovski to death at their Melbourne home in 2015 after he refused to give her $70 for cigarettes, has been jailed for 17 years.","filename":"data/vaneerConsumption/PregnantauthorjailedformurderoverCIGARETTES.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51D90B00000578-0-image-a-64_1489639195433.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318734_Pregnant-children-s-author-jailed-cigarette-murder_1540248698.html","title":"Pregnant author jailed for murder over CIGARETTES","title_page":"Pregnant author jailed for murder over CIGARETTES | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pregnant children's author who stabbed her chronically ill housemate to death has been jailed for 17 years.\nAnna Horneshaw, 28, stabbed 67-year-old Zvonimir Petrovski 22 times with a large boning knife at the property they shared in Melbourne in November 2015.\nHorneshaw, who was 20 weeks pregnant at the time, had tried to pin the blame on an imaginary intruder before her partner confessed to what she had done.\nZvonimir Petrovski, 67, was fatally stabbed 22 times with a boning knife at his Melbourne home he shared with killer Anna Horneshaw, 28, in November 2015\nOn Thursday Horneshaw, who co-authored popular tween book 'Two Weeks in Grade Six' with her mother, was jailed for 17 years and told to serve a minimum of 13, according to the ABC.\nJudge Jane Dixon, sitting at the Supreme Court of Victoria, described the killing as 'completely unprovoked' though added Horneshaw's relationship with Mr Petrovski was one of 'frustration and dependency'.\nThe court previously heard Mr Petrovski had been drinking in their house on the night in question when Horneshaw demanded $70 for cigarettes.\nWhen he refused, she followed him into the kitchen and hit him over the head, leaving him sprawled on the floor.\nHorneshaw, who was suffering morning sickness alongside withdrawals from alcohol and cannabis, then flew into a fit of rage.\nShe grabbed the knife and stabbed Mr Petrovski 22 times as he lay defenceless, apologising to the neighbours afterward for 'making such a ruckus'.\nHorneshaw's partner, Grant Brennan, called triple zero but told police that an intruder had attacked Mr Petrovski while they were in bed.\nHe later confessed what happened to police and was released without charge.\nVictoria Supreme Court heard that Horneshaw, who was 20 months pregnant, asked Mr Petrovski for $70 for cigarettes and when he refused she attacked\nThe court heard that Horneshaw had considered Mr Petrovski as a father figure, and referred to him as 'daddy'.\nHorneshaw gave birth to her son last April while in custody, and he is now being cared for by relatives.\nThe court was told Horneshaw suffers from long-term mental health issues and substance abuse problems, but had been trying to get clean in recent years.\nIn sentencing, Justice Dixon said Horneshaw had shown remorse for her actions, had a good chance of rehabilitation, and would have to bear the burden of not seeing her son grow up while behind bars.\nBut Donna Petrovska, Mr Petrovski's daughter, questioned whether that was enough. She said: 'Thirteen years. I don't know how to take that. Does my Dad deserve more?'\nSpeaking about her father's death, she added: ' I was thinking, what was going through your mind?\n'Why couldn't you have just easily stepped out? Go for a walk or something? You didn't have to hurt him.'","url":"https://www.dailymail.co.uk/news/article-4318734/Pregnant-children-s-author-jailed-cigarette-murder.html"}
