{"authors":["Bobbie Whiteman For Dailymail.Com"],"date_download":"2018-10-23 03:40:02","date_modify":"2018-10-23 03:40:02","date_publish":"2016-01-28 19:18:28","description":"The 30-year-old model and TV host quickly took to Twitter to explain to fans that she was talking about her new tome NOT the baby girl she is expecting with husband John Legend in the spring.","filename":"data/vaneerConsumption/PregnantChrissyTeigendebutscookbookCravingsonsocialmedia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACD02800000578-0-image-a-30_1454007229768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421510_Chrissy-Teigen-s-followers-think-welcomed-baby-really-just-plugging-new-cookbook_1540266002.html","title":"Pregnant Chrissy Teigen debuts cook book Cravings on social media","title_page":"Pregnant Chrissy Teigen debuts cook book Cravings on social media | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She released a snap of the front cover of her new recipe book, Cravings, on social media on Wednesday evening.\nBut Chrissy Teigen's proud tweet saying, 'I can't believe I'm holding this thing in my hands...' caused a bit of confusion in the Twitterverse.\nSome of her fans thought she meant she had given birth to the baby girl she is expecting with husband John Legend this spring.\nScroll down for video\nNew baby: Chrissy Teigen shared the front cover of her cook book Cravings on social media on Wednesday causing consternation among Twitter fans who couldn't see the snap and thought she'd had her baby girl\nThe 30-year-old model and TV host quickly took to Twitter to clear up the muddle, explaining: 'I didn't mean for that to sound like I had the baby.\n'I'm not down for trickery i love you guys too much, also she would be early as sh**.'\nThere was no such confusion among the beautiful brunette's Instagram fans.\nHer post showed her holding the book, accompanied by a long caption that started: 'I am finally holding this thing in my hands and I can't believe it is officially real! I actually feel like it's a movie prop or something. I'm so excited for you guys to see.\n'I really really hope you love everything in it and find recipes to make for those you love for years to come...pot pie soup with crust crackers, Italian sausage meatloaf, cholula honey butter fried chicken, buttery scallops with the perfect sear, spicy black bean veggie chili, my herb and garlic goat cheese stuffed chicken breast wrapped in prosciutto.'\nBut even she referred to her book as her baby when she said: 'Ohhhhhhh there is so much I am excited about, this baby has so much love in it!'\nMea culpa: While the 30-year-old's Instagram fans could see the picture of her book and knew that was what she was talking about, her Twitter fans could not. So Chrissy straightened the mess out in this tweet\nChrissy added that she was looking forward to the book tour for Cravings, adding: 'I am so used to the Twitter and Instagram world that I can't even comprehend people actually coming out to my signings or events and seeing your actual human bodies and faces in person.\n'I will be so sick wondering if anyone will show up ahhhhhhh but I can't wait to see you all!!.'\nAnd she wrapped it up with an apology, saying: 'Sorry so long, I have the energy of 1 3/4 people! ❤️❤️❤️❤️❤️'\nCravings is available to pre-order now before its February 23 publishing date.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421510/Chrissy-Teigen-s-followers-think-welcomed-baby-really-just-plugging-new-cookbook.html"}
