{"authors":[],"date_download":"2018-10-22 22:09:29","date_modify":"2018-10-22 22:09:29","date_publish":"2014-05-08 21:24:53","description":"More women are getting in trouble with law enforcement after giving birth to babies who test positive for drugs prescribed by their doctors.","filename":"data/vaneerConsumption/PregnantonOpiatesWhenFollowingDoctorsOrdersBreakstheLaw.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/430851/140508-moms-drugs-jms-1952_add1543fe19ccfe560e6bfba36bfb976.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_pregnant-opiates-when-following-doctors-orders-breaks-law-n100781_1540246169.html","title":"Pregnant on Opiates: When Following Doctors' Orders Breaks the Law","title_page":"Pregnant on Opiates: When Following Doctors' Orders Breaks the Law","title_rss":"NULL","source_domain":"nbcnews.com","text":"But because Moman’s baby was experiencing withdrawal, the hospital contacted the Brown County child welfare agency.\n“I understood that they might want to come out and see,” Moman says. “But the next day, we got a phone call saying they were taking me to court for abuse.”\nFor five months, Moman says, she received regular, unannounced visits from the department. “It put a lot of stress on our family,” she says. “My nine-year-old said, ‘Why are these people here? Are they going to take me away?’ I’m a good mom. I just had that problem. But during my pregnancy, I was good. I turned my life completely around. Sometimes addicts have to have a reason to get help. What better reason is there than that? Your own children.”\nPregnant opiate users and addicts say they sometimes hear one thing from health professionals, who may recommend they be put on a maintenance program like Subutex or Suboxone, and another thing from law enforcement or child welfare agents, who may say that mothers who use any drug, even Subutex or Suboxone, should be investigated. This puts many women in the Catch-22 of either trying to go off a drug completely while pregnant, knowing it could result in a miscarriage, or following their doctor’s orders and fearing that their baby could be taken away at birth.\nA representative of the Ohio state child welfare agency says that county directors have discretion in accepting referrals in cases where legal drugs have caused problems. “The impact of prenatal drug exposure on a newborn is not limited to illicit substances,” he said. Moman’s county is one of many around the country in which the child welfare agency considers NAS grounds for investigation, regardless of whether the source is heroin or Suboxone.\n“Our position is that upon learning that the person is pregnant, that this would be a time that the person would take action to get themselves off of drugs, to keep themselves as clean as possible,” says Mitch Sharp, Director of Brown County’s Department of Job and Family Services, who could not speak about Moman’s case specifically but confirmed that his agency has pursued “a couple” of cases in which women were in a maintenance program. “There are some doctors, some clinics, who feel that Suboxone is almost like a therapeutic drug to help them get off [heroin], but it is still a lower-level opiate. It will still cause the child to go through withdrawals.”\nSharp says that Southwest Ohio has seen a heroin epidemic over the past four or five years, and that addiction has led to a surge in children being removed from their parents’ care. “Very seldom do we ever leave a child in a home where we have positive tests and know that one or both [parents] are using drugs,” says Sharp.\n\"[Maintenance] is the accepted standard of care,\" she said. \"How can you then turn around and say she’s committed child abuse?\"\nThe Centers for Disease Control has proclaimed opiate addiction a national epidemic. And according to new research, one in five pregnant women in this country take some form of opiate during pregnancy. Some of their babies will experience NAS, which may entail a hospital stay that can cost somewhere around five times more than that of a non-NAS newborn and last an average of about 15 days. Rick Massatti, research administrator with the Ohio Department of Mental Health and Drug Addiction Services, says NAS has hit Ohio’s healthcare system hard. “You have kids staying a really long time,” says Massatti. “It’s not like in a day you’re gone.”\nLawmakers have proposed various approaches to this problem, some punitive. Depending on where they live, women who give birth to babies showing NAS symptoms or testing positive for opiates, including Subutex, may be subject to child welfare involvement, mandatory drug treatment, or even prison. In 17 states, drug use during pregnancy is considered child abuse, and in three it is grounds for arrest, according to the Guttmacher Institute. Tennessee just passed an especially severe law holding women criminally liable for giving birth to babies who experience NAS.\nKylee Sunderlin, the Soros Justice Fellow at National Advocates for Pregnant Women, which provides legal advice and advocacy for pregnant women, says she’s seen the number of cases like Moman’s “ramp up” in the past year or so, and that there is no one broadly-accepted protocol for dealing with them.\n“Some people assume [the protocol for opiate-maintenance NAS cases] is state-by-state,” says Sunderlin. “It’s really county-by-county. You can have counties right next to each other where one would not bat an eye at a baby diagnosed with NAS [and experiencing withdrawal from Subutex] and would allow parents and doctors to proceed as they wish. In the next county, the baby may be kept from going home from the hospital with the mother. There is such stigma that it’s hard to separate what’s fueled by CPS thinking there really is harm and what’s just a gross misunderstanding of what medication-assisted treatment is.”\nThe federal Child Abuse Prevention and Treatment Act requires CPS to have a system in place in cases where babies have been identified as affected by illicit drugs or withdrawal symptoms, although the law specifically states that such circumstances don’t establish child abuse or neglect, says Nancy Young, Ph.D., Director of Children and Family Futures, a California-based consulting firm that works on these issues. “In the case that a mom is being maintained for an opiate addiction with medication and the baby experiences withdrawal, there would be a requirement that CPS has a plan to ensure the safe care of the baby if [the hospital] notifies child welfare,” says Young. “If the mom has an opiate addiction, you want them on medication-assisted treatment. That’s the standard medical protocol. Babies aren’t born ‘addicted.’ They can be managed very effectively through NAS and do fine.”\nIn New Jersey, a woman identified in court paperwork only as Y.N. was receiving methadone treatment for an opiate addiction when she gave birth to a baby boy, Paul, in 2011. When Paul showed signs of methadone withdrawal, child welfare authorities charged his mother with child abuse. The court’s conclusion: “Where there is evidence of actual impairment, it is immaterial whether the drugs were from a legal or illicit source.”\nSusan Neshin, M.D., Medical Director of Jersey Shore Addiction Services, who has provided methadone treatment to pregnant women for 30 years, called the case \"ludicrous.\"\n“This [maintenance] is the accepted standard of care,\" she said. \"How can you then turn around and say she’s committed child abuse?”\nNational Advocates for Pregnant Women became involved in Moman’s case in December 2013, and on January 27th, the abuse and neglect charges against her were dropped. But there’s a twist: just months after her baby was born, she learned that she was unexpectedly pregnant again. (Her period hadn’t resumed, and she hadn’t yet received a planned IUD.) She is also, on doctors’ orders, still taking Subutex.\nAs Moman waits for her fourth child, due in July, she wonders what will happen when this baby, a girl, is born with the drug in her system. “I even considered abortion, even though I’m totally against that,” Moman says. She wants the baby, but feels guilty that she may need to be treated for NAS, and that any complications may lead to CPS involvement.\nThis time she is planning to deliver two hours away, at a hospital where there is a special program for women in her situation. And yet, Moman remains anxious. “I’m so scared to put my family through this again.”","url":"https://www.nbcnews.com/news/us-news/pregnant-opiates-when-following-doctors-orders-breaks-law-n100781"}
