{"authors":["Shayan Shankar For Daily Mail Australia"],"date_download":"2018-10-23 01:49:41","date_modify":"2018-10-23 01:49:41","date_publish":"2017-03-16 12:00:10","description":"Anne Horenshaw, 28, was sentenced to 17 years in jail after she brutally stabbed her 67-year-old roommate after he refused to give her money for cigarettes in Melbourne's north.","filename":"data/vaneerConsumption/PregnantAnnaHorneshawkilledroommateformoney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E537D8100000578-0-image-a-7_1489664131598.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319800_Pregnant-children-s-author-28-killed-roommate-money_1540259381.html","title":"Pregnant Anna Horneshaw killed roommate for money","title_page":"Pregnant Anna Horneshaw killed roommate for money | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The pregnant children's author who brutally killed her chronically ill housemate, looked up to her victim as a father figure and would refer to him as 'Daddy'.\nAnna Horenshaw, 28, was sentenced to 17 years in jail on Thursday after she stabbed her 67-year-old roommate Zvonimir Petrovski in their apartment in Melbourne's north.\nHorneshaw, who was 20 weeks pregnant at the time, stabbed Mr Petrovski 22 times with a large boning knife in November 2015.\nAnna Horenshaw (pictured), 28, was sentenced to 17 years in jail on Thursday after she stabbed her roommate who is said to have been like a 'father figure' to her\nThe Supreme Court of Victoria heard how the pregnant Horneshaw had been drinking with Mr Petrovski and her partner Grant Brennan, in their flat on the night of the murder.\nComplaining to her older housemate that he was not financially providing for her, as was promised, she became furious.\nDemanding money for cigarettes, Mr Petrovski - who himself was an ailing alcoholic - began to take a few notes out of his wallet, when Horneshaw snatched them from him, according to 7 News.\nFollowing her into the kitchen, Mr Petrovski asked on Horenshaw to give him his money back when she punched him in the head before stabbing him repeatedly on the floor.\nHer rage was such that at one point she needed to apologise to neighbours for making a commotion.\nHorneshaw had tried to pin the blame on an imaginary intruder before her partner confessed to what she had done.\nZvonimir Petrovski (pictured), 67, was fatally stabbed 22 times with a boning knife at his Melbourne home he shared with killer Anna Horneshaw in November 2015\nJustice Jane Dixon described the two's relationship as one involving 'mutual affection and care but also frustration and dependency'.\nLabelling the killing as 'completely unprovoked' Justice Dixon showed sympathy to Horneshaw who she said was bullied at school and suffered from mental health problems for much of her life, according to the ABC.\nHorneshaw is the daughter of children’s author Mary K Pershall, and the two co-authored the popular tween book 'Two Weeks in Grade Six' ed the 2003 book Two Weeks in Grade Six.\nShe gave birth to her son last April while in custody, and he is now being cared for by relatives.\nJustice Jane Dixon described the Horneshaw and Mr Petrovski's relationship as one involving 'mutual affection and care but also frustration and dependency'\nIn sentencing, Justice Dixon said Horneshaw had shown remorse for her actions, had a good chance of rehabilitation, and would have to bear the burden of not seeing her son grow up while behind bars.\nBut Donna Petrovska, Mr Petrovski's daughter, questioned whether that was enough. She said: 'Thirteen years. I don't know how to take that. Does my Dad deserve more?'\nSpeaking about her father's death, she added: ' I was thinking, what was going through your mind?\n'Why couldn't you have just easily stepped out? Go for a walk or something? You didn't have to hurt him.'","url":"https://www.dailymail.co.uk/news/article-4319800/Pregnant-children-s-author-28-killed-roommate-money.html"}
