{"authors":["Press Association"],"date_download":"2018-10-22 21:05:42","date_modify":"2018-10-22 21:05:42","date_publish":"2017-04-26 01:07:40","description":"The British and Irish Lions tour to New Zealand this summer will be the last in its existing six-week format, Premiership Rugby has confirmed.","filename":"data/vaneerConsumption/PremiershipRugbyconfirmLionstourstobeshortened.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F61D8FD00000578-0-image-a-41_1493165254549.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4445938_Premiership-Rugby-confirm-Lions-tours-shortened_1540242342.html","title":"Premiership Rugby confirm Lions tours to be shortened","title_page":"Premiership Rugby confirm Lions tours to be shortened | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The British and Irish Lions tour to New Zealand this summer will be the last in its existing six-week format, Premiership Rugby has confirmed.\nMark McCafferty, chief executive of the umbrella organisation for the 12 English clubs, has echoed the stance of Rugby Football Union counterpart Ian Ritchie that the tours must be shortened as part of the new global season that comes into effect in 2020.\nFormer Lions captain Brian O'Driscoll is among a chorus of voices who have demanded that tours are retained in their current six-week, 10-match guise, but McCafferty disagrees.\nMark McCafferty says tours must be shortened as part of the new global season\nWarren Gatland will take a 41-man squad, led by Sam Warburton (right), on tour this summer\n'We have been fairly outspoken. At the start of the season we said we were unhappy about the intensity of the schedule that had been signed up several years ago and it needs to change,' McCafferty said.\n'To go through this kind of programme in the future is not feasible. To be playing 10 matches in a five-week period is too much and our views on that have not changed.\n'Hopefully come 2021 some of those changes will come into place and they have largely been agreed. The duration of the tour is scheduled to come down by a week so that will mean a decrease in games.\n'Ultimately it is up to the Lions how many games they put into the time frame, but we have a big interest in how players are managed through that.'\nIt is understood that Premiership Rugby are considering a Ryder Cup-style global club competition between northern and southern hemispheres, while South African Currie Cup teams could be invited to join the Anglo-Welsh Cup.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4445938/Premiership-Rugby-confirm-Lions-tours-shortened.html"}
