{"authors":["Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 21:24:32","date_modify":"2018-10-22 21:24:32","date_publish":"2016-01-29 06:35:37","description":"Kian Richardson, five, who got a rather unusual start in life when he was born four months premature into a toilet bowl, has defied the doctor’s odds and finished his first day of school.","filename":"data/vaneerConsumption/Prematurebabyborninatoiletbowlfinisheshisfirstdayofschool.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AFF1D300000578-0-image-a-42_1454046459502.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422190_Miracle-baby-boy-born-toilet-bowl-four-months-premature-given-just-FIVE-percent-chance-survival-starts-day-school_1540243472.html","title":"Premature baby born in a toilet bowl finishes his first day of school","title_page":"Premature baby born in a toilet bowl finishes his first day of school | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The five-year-old boy was born four months premature in a\nKian Richardson had his first day at school on Friday in Victoria\nA baby who got a rather unusual start in life when he was born four months premature into a toilet bowl has defied the doctor's expected five percent survival rate and finished his first day of school.\nKian Richardson, five, was once expected to be blind, deaf, have mental health issues and not be able to run or play sports – but the perfectly healthy 'miracle baby' and avid sports fan started his first day of school on Friday at a primary school in Victoria.\nConsidering Kian's mum, Tamara Richardson, was once told to say goodbye to her son when he was two months old, watching him skip off to school was a 'great' feeling.\n'To think someone who started off big enough to carry in one hand has started school blows my mind,' Ms Richardson told Daily Mail Australia.\nKian Richardson (pictured), who was born four months premature and was given a five percent chance of survival, headed off to his first day of school on Friday\nHis mother, Tamara Richardson, was 21 weeks along when her water broke and Kian (pictured) was born at just 23 weeks\nMs Richardson (pictured) had severe back pain and was told by a nurse to go to the bathroom, where she looked down and saw Kian - still encase in the placenta - in the toilet\nMs Richardson's pregnancy with Kian had never been easy but she – and doctors – were shocked when he water broke at just 21 weeks.\nShe didn't have any contractions but was kept in the hospital for two weeks as doctors hoped she would make it until at least 24 weeks along before going into labour.\nBut Kian couldn't wait.\n'I looked down and went 'Oh my god – there's a baby there',' she said\nKian was whisked away by nurses who placed him on an oxygen machine to help his underdeveloped lungs\nWhen Ms Richardson was transferred to Monash Hospital at the end of those two weeks, she was suffering from terrible back pain and was told by a nurse that it was nothing to worry about and to go to the bathroom.\nWhile in the bathroom Ms Richardson got the fright of her life when looked down and saw her son – still encased in the placenta – in the toilet bowl.\n'I looked down and went 'Oh my god – there's a baby there',' she said.\n'That's not what you expect when you go to the bathroom.'\nKian's sister, Ayla, (pictured) sits with their father Evan Richardson (pictured) at the hospital\nAt just two months old, doctors told Ms Richardson that her son had taken a turn for the worse and the family headed to the hospital to say their goodbyes. It was the first time she was able to hold her son (pictured)\nWith her intense back pain and because of Kian's small size, Ms Richardson hadn't immediately noticed that she had given birth.\nShe hit the emergency button repeatedly and nurses stormed in to take him into another room.\nHe placed on oxygen machines because his lungs hadn't developed properly and for the next 11 months he was intubated.\nWhen they arrived at the hospital again the next morning, the family was expecting the worse but discovered that Kian had improved over night, and kept on getting better\n'Whatever happened to him on cuddle time - he started picking up,' Ms Richardson said\nAfter 219 days in the hospital, Kian was able to come home with his mum (pictured)\nAt just two months old, doctors told Ms Richardson that her son had taken a turn for the worse and the family headed to the hospital to say their goodbyes.\nIt was the first time Ms Richardson and Kian's father, Evan Richardson, were able to hold their son.\nWhen they arrived at the hospital again the next morning, the family was expecting the worse but discovered that Kian had improved over night and kept on improving until he was eventually able to be released.\n'He looked very, very sick – he was not doing well,' Ms Richardson said, who credited everyone being able to hold and cuddle Kian as one of the reasons he began to improve.\n'Whatever happened to him on cuddle time - he started picking up.'\nToday, Kian is an active, bubbly kid who loves to play sports and is a massive Richmond Tigers football fan\n'He plays footy and cricket and he's doing swimming,' Ms Richardson said\nKian is excited to join his sister at school and be able to play with other kids in the playground\nToday, Kian is an active, bubbly kid who loves to play sports and is a massive Richmond Tigers football fan.\n'He plays footy and cricket and he's doing swimming,' Ms Richardson said.","url":"https://www.dailymail.co.uk/femail/article-3422190/Miracle-baby-boy-born-toilet-bowl-four-months-premature-given-just-FIVE-percent-chance-survival-starts-day-school.html"}
