{"authors":["John Sexton"],"date_download":"2018-10-30 18:41:00","date_modify":"2018-10-30 18:41:00","date_publish":"2016-02-04 03:28:56","description":"President Obama visited the Islamic Society of Baltimore Wednesday but, according to activists, women who attended the mosque regularly pray in a separate balcony space. |","filename":"data/vaneerConsumption/PresidentObamaVisitsMosquewithSeparateWomensArea.json","image_url":"https://media.breitbart.com/media/2016/02/ap_ap-photo-215.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_03__1540924860.html","title":"President Obama Visits Mosque with Separate Women's Area","title_page":"President Obama Visits Mosque with Separate Women's Area | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama visited the Islamic Society of Baltimore Wednesday but, according to activists, women who attended the mosque regularly pray in a separate balcony space.\nAuthor Ify Okoye is a Muslim convert who was co-author of a piece in the NY Times which was critical of the President’s decision to visit the mosque, saying it amounted to “tacit acceptance of a form of discrimination that amounts to gender apartheid.” To further make the point, Okoye posted a string of tweets describing the disparate treatment of women in the mosque:\nMotorcade for @POTUS arriving at the Islamic Society of Baltimore. Prayer space at this mosque is separate and unequal #PrayIn #MosqueVisit — Ify Okoye (@IfyOk) February 3, 2016\nAsked if women were separated from men by a “partition/barrier” Okoye replied:\n@ruthnasrullah @POTUS second floor balcony, with tv monitors. Main hall is beautiful and ornate, plush red carpet, gilted names of Allah — Ify Okoye (@IfyOk) February 3, 2016\nShe also posted this photo of the women’s balcony taken earlier (not during the event today):\nThe view from the women's balcony of Eid prayer at the Islamic Society of Baltimore @POTUS #MosqueVisit #PrayIn pic.twitter.com/89HBLtkH52 — Ify Okoye (@IfyOk) February 3, 2016\nAt today’s visit by the President, both men and women sat in the main hall. The President was introduced by a young woman wearing an Islamic headcloth, and many other covered women could be seen in photos taken during his speech:\n.@POTUS recognizes American Muslim contrubutions and mosque service to society: free medical clinic, etc pic.twitter.com/0brgdPSmhe — Dalia Mogahed (@DMogahed) February 3, 2016\nThe speech was about inclusion of Muslims as Americans. “Let me say it as clearly as I can as President of the Untied States: You fit in here,” he said.\nHowever, a group called the Muslim Reform Movement said it was a “shock” the President had chosen this mosque:\nFor over a decade, many of us have been fighting in the trenches for women’s rights in mosques. It was a shock to us that President Obama chose to go to the Islamic Society of Baltimore, a mosque notorious among Muslim women activists for its gender inequity in its prayer space. Mosque officials insist that it doesn’t have a policy “preventing” women from the sun-drenched main hall, filled with books, where President Obama will hold his mosque photo-op. But what we witnessed this past Sunday was very separate and unequal conditions, girls being dispatched to the gym to pray, while boys prayed in the main hall where President Obama will stand.\nThe group posted photos showing girls in a gym facing a cinder block wall while boys were in the much nicer space where the President spoke.","url":"https://www.breitbart.com/politics/2016/02/03/president-obama-visits-mosque-with-separate-womens-area-says-muslims-fit-in-here/"}
