{"authors":["Peter Lloyd For Mailonline"],"date_download":"2018-10-23 01:37:54","date_modify":"2018-10-23 01:37:54","date_publish":"2017-03-16 11:45:26","description":"The nationwide cost of a prescription will rise by 20 pence, Health Minister Phillip Dunne has revealed.","filename":"data/vaneerConsumption/Prescriptionpricetoriseby20pinApril.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E4FB9BA00000578-0-image-a-44_1489666947708.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4319814_Prescription-price-rise-20p_1540258674.html","title":"Prescription price to rise by 20p in April","title_page":"Prescription price to rise by 20p in April | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Patients in England will have to pay 20p more for their prescriptions starting next month, ministers have announced.\nFrom 1 April, charges will increase from £8.40 to £8.60, rising 'broadly in line with inflation'.\nHealth Minister Phillip Dunne revealed the plans in a written statement to other MPs this morning.\nExpense: England remains the only country in the UK where patients still pay for prescriptions\nHe said: 'Existing arrangements for prescription charge exemptions will remain in place, principally covering those with certain medical conditions like cancer, epilepsy and diabetes, pregnant women and new mothers, children under 16 and anyone over 60 and those on a low income.'\nHe added that the cost of prescription prepayment certificates - which offer a discount for people needing more than twelve per year - wouldn't change.\nThat means the three-month certificate will remain at £29.10, while the annual one will stay at £104.\nHowever, the price of dental care will also increase, with the lowest-cost band one treatment rising by 90p and band three treatment increasing by £10.60.\nThe latest increase comes one year after the government announced a similar 20p cost hike in March 2016.That saw prescriptions rise from £8.20 to £8.40 for each medicine or appliance dispensed.\nExperts have long argued that prescription charges are necessary to fund a high standard of NHS care, but some have bemoaned the latest increase.\nIncrease: Health Minister Phillip Dunne\nMorgan Vine of Parkinson’s UK who Co-Chair the Prescription Charges Coalition, a group of nearly 40 organisations campaigning to end prescription charges for people with long-term medical conditions, told MailOnline: 'This will come as a blow to people with long term conditions, who already have to deal with additional living costs, and rely on regular medication to manage their condition.\n'Our research showed that 1 in 3 people with long term conditions, who answered our survey, had not collected a prescription because of the expense. This can have a hugely negative impact on the person’s health, often resulting in expensive hospital treatment and days off work.\n'In 2018 the outdated and illogical medical exemption list for England will be 50 years old. It is unfair that some conditions are exempt from all charges, where others are required to pay for everything. It is the Government’s duty to support everyone with a long term condition to take their medication as prescribed. They must take urgent action to address this unjust situation.'\nCurrently, England remains the only country in the UK where patients still pay for prescriptions, which are free in Scotland, Wales and Northern Ireland.\nThis means that English patients are effectively subsiding free drugs for those living elsewhere in the UK.","url":"https://www.dailymail.co.uk/health/article-4319814/Prescription-price-rise-20p.html"}
