{"authors":["Ron Elving"],"date_download":"2018-10-23 00:48:04","date_modify":"2018-10-23 00:48:04","date_publish":"2016-05-06 00:00:00","description":"One of the longest-held divides inside American politics is over the role of government. This election year, both the Democrats and the Republicans may be pushed into increasing the government's role.","filename":"data/vaneerConsumption/PresidentialElectionRedefinesDebateOverTheRoleOfGovernment.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_05_06_476993947_presidential-election-redefines-debate-over-the-role-of-government_1540255684.html","title":"Presidential Election Redefines Debate Over The Role Of Government","title_page":"Presidential Election Redefines Debate Over The Role Of Government : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Presidential Election Redefines Debate Over The Role Of Government\nOne of the longest-held divides inside American politics is over the role of government. This election year, both the Democrats and the Republicans may be pushed into increasing the government's role.\nDAVID GREENE, HOST:\nI'm David Greene in Bozeman Mont. And Steve, there's a large audience here who wants to say hello to you.\n(APPLAUSE)\nSTEVE INSKEEP, HOST:\nHey, good morning.\nGREENE: You know, this state, Steve, I've realized this week, a good place to explore a really big American issue. And that is the debate over the role of government.\nINSKEEP: Which is a big divide in national politics, whether the government should do more or less in American life. This goes back to the founding fathers. Alexander Hamilton wanted more. Thomas Jefferson wanted less - or at least, Jefferson did until he was president and found he wanted to do more. In the 2016 presidential campaign, we could argue that both political parties are being pulled toward more. NPR's Ron Elving is here in Washington. Ron, how are both parties going that way?\nRON ELVING, BYLINE: You know, I'm not sure that either party would want to advocate for greater size in the federal government. But they're all talking about a more powerful government, a little bit like what you just said about Thomas Jefferson. They want a government that's, you know, able to deliver on the promises that they've all made and on a grand scale.\nTrump sees a very powerful government as a tool to change the world, you know, deporting 11 million people, building a 2,000-mile wall. Sanders sees an equally big increase in government programs and commitments. And Hillary Clinton's been getting pulled a lot closer to Bernie Sanders' agenda.\nINSKEEP: Well, how different is that from where the parties were?\nELVING: You know, the parties were quite different over a long period of time. You know, Ronald Reagan was saying that big government wasn't the solution; it was the problem. And Bill Clinton said, the era of big government is over. But since then, in the last 15, 16 years, we've seen the return, if you will, of big government with two major wars. And we've seen a stimulus package. We've seen the bailout of Wall Street and the bailout of auto industry. We've really started to going back in the other direction.\nGREENE: Ron, it's David here in Montana. And I wonder if you could think about how this region really fits into the national picture you're describing.\nELVING: Well, everyone in the rural West knows the initials BLM. That's Bureau of Land Management.\nGREENE: Yes. Heard it a lot here this week.\nELVING: It's the largest of five federal agencies that administer 640 million acres of land in the United States and that includes 27 million acres in Montana alone. That's about 30 percent of the whole state. And that's a stewardship that's supposed to preserve these lands for everyone and for posterity.\nBut the Montana folks, and people in the rural West in general, see these lands as theirs, at least in some sense. And they don't like the notion of themselves as either tenants or people making use of something that's not theirs.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/05/06/476993947/presidential-election-redefines-debate-over-the-role-of-government"}
