{"authors":["Pa Reporter"],"date_download":"2018-10-23 03:36:17","date_modify":"2018-10-23 03:36:17","date_publish":"2017-03-16 14:32:19","description":"Presenting Percy turned the Pertemps Network Final Handicap Hurdle into a procession as he gave trainer Pat Kelly and jockey Davy Russell back-to-back victories.","filename":"data/vaneerConsumption/PresentingPercywinsPertempsNetworkfinalatCheltenham.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54CB2900000578-0-image-a-142_1489674546755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_racing_article-4320502_Presenting-Percy-wins-Pertemps-Network-final-Cheltenham_1540265777.html","title":"Presenting Percy wins Pertemps Network final at Cheltenham","title_page":"Presenting Percy wins Pertemps Network final at Cheltenham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Presenting Percy turned the Pertemps Network Final Handicap Hurdle into a procession as he gave trainer Pat Kelly and jockey Davy Russell back-to-back victories.\nMall Dini had struck for the same Irish team 12 months ago and Presenting Percy (11-1) followed up in devastating fashion.\nRussell brought the six-year-old through the pack to lead before the final flight and storm up the hill to win from Barney Dawn, Jury Duty and The Tourard Man.\nPresenting Percy recorded a comprehensive victory in the Pertemps Network Final\nRussell said of the three-and-three-quarter-length winner: 'To be honest the credit has to go to Pat Kelly, he's a master and he improved for the better ground and I'd like to apologise to Phil Smith (BHA handicapper), maybe he was right (to give him more weight that his official Irish rating).\n'Probably 99 times out of 100 the handicapper does a good job, but I thought he'd been a bit harsh on him. Pat has obviously found improvement in him.\n'I rode my luck a bit and jumped him off at the back, but he settled lovely and it all went well.\n'I've been to a lot of sporting occasions, but this is the ultimate.'\nOwner Philip Reynolds said: 'We were here this time last year and it was a dream come true, I can't believe we've done it again.\n'Pat Kelly is unbelievable, he has a 100 per cent strike-rate here\n'I gave my wife a present of this horse this time last year, hoping she could have as much fun as me.\nIt is the second win in as many years for Davy Russell in the Pretemps\n'Davy is unbelievable around here, a master.\n'We were very disappointed when the handicapper here gave us an extra 6lb after his win at Fairyhouse, we had to run that day and win to make sure we got in. I wasn't sure we needed another six, but maybe Phil is right.'","url":"https://www.dailymail.co.uk/sport/racing/article-4320502/Presenting-Percy-wins-Pertemps-Network-final-Cheltenham.html"}
