{"authors":["Gerri Peev","Political Correspondent For The Daily Mail"],"date_download":"2018-10-22 21:21:44","date_modify":"2018-10-22 21:21:44","date_publish":"2017-03-16 01:04:39","description":"Marine Le Pen was interviewed by Nigel Farage about whether she felt snubbed by Mrs May, who had welcomed her presidential rival, Emmanuel Macron, to Downing Street.","filename":"data/vaneerConsumption/PresidentialcandidateMarineLePenblastsTheresaMay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4A228700000578-0-image-a-76_1489626246442.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318532_Presidential-candidate-Marine-Le-Pen-blasts-Theresa-May_1540243304.html","title":"Presidential candidate Marine Le Pen blasts Theresa May","title_page":"Presidential candidate Marine Le Pen blasts Theresa May | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Marine Le Pen, the Far-Right French presidential candidate, has mocked Theresa May, saying the Prime Minister is 'good at getting it wrong'.\nThe controversial nationalist politician was interviewed by Nigel Farage about whether she felt snubbed by Mrs May, who had welcomed her presidential rival, Emmanuel Macron, to Downing Street.\nMr Farage told Miss Le Pen that she would get to meet Mrs May if she won the election, reminding her that Number 10 had also snubbed Donald Trump before he became president. Mrs May has since met him.\nMiss Le Pen replied: 'She is good at getting it wrong but this is rather reassuring!'\nMarine Le Pen (left) was interviewed by Nigel Farage (right) about whether she felt snubbed by Theresa May\nShe told LBC Radio: 'I find it difficult to understand the consistency of the ideas and convictions in this approach of hers because Mr Macron is of course, the key salesperson of globalisation.'\nMr Macron, a former finance minister stood for 'the opposite of what Brexit stands for and the choice made by the British people', she said.\n'I do not understand this discrepancy, this contradiction between what Theresa May stands for because she has decided to be the woman who will implement Brexit, and her meeting with Emmanuel Macron.'\nDespite her criticism, Miss Le Pen said that France and the UK would have 'excellent relations' if she won the election. 'Thank you for showing us the way out from this huge prison which is the EU for the people,' she said.\nMiss Le Pen, who expelled her father, former leader Jean-Marie Le Pen from the party last year, suggested a trade deal would exist between the UK and France, if it followed and left the EU.\n'I see no reason why there should be customs duties between our countries,' she said. 'There is no reason not to take the British decision in our stride and work with Great Britain in negotiations that will take place between two nations that have had long-standing trade relations for centuries.'\nMr Farage told Miss Le Pen that she would get to meet Theresa May (pictured) if she won the election\nThe nationalist has pledged to renegotiate France's membership of the EU and threatened that the republic would quit the bloc if she failed to get a decent deal.\nShe contrasted her position with that of David Cameron's promised referendum, suggesting his had been a 'farce', designed to placate his own party.\n'Mr Cameron would have never contemplated the possibility of Great Britain leaving the EU and the negotiation was not really a negotiation. It was a farce, and this is not my state of mind for the negotiation,' she said.\nThe Front National leader launched a blistering attack on the European Union, accusing it of applying 'blackmails and threats' to Britain in the negotiations. 'What I cannot stand in the behaviour of the EU with regards to Great Britain is blackmail, constant threat.'\nShe criticised Angela Merkel, the German Chancellor, for imposing her will on the EU and said that France and the UK could team up if she was elected to be 'free'.","url":"https://www.dailymail.co.uk/news/article-4318532/Presidential-candidate-Marine-Le-Pen-blasts-Theresa-May.html"}
