{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 18:16:39","date_modify":"2018-10-30 18:16:39","date_publish":"2018-08-20 00:00:00","description":"President Donald Trump on Monday referred to lawyers working for special counsel Robert Mueller as \"thugs\" and accused them of trying to affect this year's elections, further ramping up his rhetoric against prosecutors investigating Russian interference in the 2016 presidential election.","filename":"data/vaneerConsumption/PresidentlabelsprobersthugsMuellerdisgracedhesays.json","image_url":"https://media.arkansasonline.com/img/photos/2018/08/20/AP18231787019157_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_21__1540923399.html","title":"President labels probers 'thugs'; Mueller ‘disgraced,’ he says","title_page":"President labels probers 'thugs'; Mueller ‘disgraced,’ he says","title_rss":"NULL","source_domain":"arkansasonline.com","text":"President Donald Trump waves as he arrives at the White House in Washington, Sunday, Aug. 19, 2018, after spending the weekend at his golf club in Bedminster, N.J. (AP Photo/J. Scott Applewhite)\nWASHINGTON -- President Donald Trump on Monday referred to lawyers working for special counsel Robert Mueller as \"thugs\" and accused them of trying to affect this year's elections, further ramping up his rhetoric against prosecutors investigating Russian interference in the 2016 presidential election.\nIn tweets Monday morning, Trump called Mueller \"disgraced and discredited\" and said the special counsel's team of prosecutors is \"a National Disgrace!\"\nTrump's tweets were the latest in a spate of complaints in recent days about the investigation into whether his campaign coordinated with Russia during the 2016 election and whether Trump has sought to obstruct the inquiry.\nIn Monday's tweets, Trump continued to criticize a New York Times report over the weekend that White House lawyer Don McGahn had participated in at least three interviews with Mueller's team that spanned a total of 30 hours.\n\"Disgraced and discredited Bob Mueller and his whole group of Angry Democrat Thugs spent over 30 hours with the White House Councel, only with my approval, for purposes of transparency,\" Trump said in one tweet, misspelling McGahn's title.\n\"Anybody needing that much time when they know there is no Russian Collusion is just someone looking for trouble,\" he wrote. \"They are enjoying ruining people's lives and REFUSE to look at the real corruption on the Democrat side - the lies, the firings, the deleted Emails and soooo much more!\"\n\"Where's the Collusion? They made up a phony crime called Collusion, and when there was no Collusion they say there was Obstruction (of a phony crime that never existed). If you FIGHT BACK or say anything bad about the Rigged Witch Hunt, they scream Obstruction!\" Trump continued.\nMcGahn has offered detailed accounts of \"episodes at the heart of the inquiry\" over whether Trump and his aides sought to obstruct justice, the Times reported. The paper said McGahn was motivated in part by fear that the president might set him up to be held responsible.\nOver the weekend, Trump insisted the White House counsel isn't a \"RAT\" and accused Mueller's team of \"looking for trouble.\" He contrasted McGahn with John Dean, the White House counsel for President Richard Nixon during the Watergate scandal. Dean ultimately cooperated with prosecutors and helped bring down the Nixon presidency in 1974, though he served a prison term for obstruction of justice.\nDean, a frequent critic of Trump, tweeted Sunday that he doubts the president has \"ANY IDEA what McGahn has told Mueller. Also, Nixon knew I was meeting with prosecutors, b/c I told him. However, he didn't think I would tell them the truth!\"\nTrump's original legal team had encouraged McGahn and other White House officials to cooperate with Mueller.\nTrump's personal attorney, Rudy Giuliani, said in an appearance on NBC's Meet the Press that Trump didn't raise executive privilege or attorney-client privilege during those interviews because his team believed -- he says now, wrongly -- that fully participating would be the fastest way to bring the investigation to a close.\n\"The president encouraged him to testify, is happy that he did, is quite secure that there is nothing in the testimony that will hurt the president,\" Giuliani said.\nMcGahn's attorney William Burck added in a statement: \"President Trump, through counsel, declined to assert any privilege over Mr. McGahn's testimony, so Mr. McGahn answered the Special Counsel team's questions fulsomely and honestly, as any person interviewed by federal investigators must.\"\nINTERVIEW CONCERNS\nTrump's latest comments represented an escalation of his personal attacks on Mueller, whom he's accused of political bias and \"conflicts of interest.\" Standing next to Russian President Vladimir Putin in Helsinki last month, he called Mueller's investigation of Moscow's meddling in the 2016 election a \"disaster.\"\nLater on Monday, Trump expressed concern that anything he tells Mueller under oath could be used to charge him with perjury.\nTrump repeatedly has said he wants to sit down with Mueller because \"there is no collusion.\"\nBut in an interview with the Reuters news agency, the president voiced concern that investigators could use his statements against him if they don't match up with those of other individuals they have already interviewed, such as former FBI Director James Comey.\nSaid Trump: \"Even if I am telling the truth, that makes me a liar. That's no good.\"\nTrump did not say whether he would ultimately agree to be interviewed by Mueller. Members of Trump's legal team have expressed reservations about allowing their client to sit down with the veteran prosecutor, but they continue to negotiate with Mueller's team over whether and how investigators can question Trump about whether he attempted to obstruct justice.\nRussia has denied interfering in the election.\nTrump, who makes his unhappiness over the long-running investigation known through near-daily posts on Twitter, also told his Reuters interviewers that he has decided to \"stay out\" of the probe but is \"totally allowed\" to get involved if he wanted to.\nAdded Trump, \"I could run it if I want.\"\nInformation for this article was contributed by John Wagner of The Washington Post; by Anne Flaherty, Jill Colvin and staff members of The Associated Press; and by Terrence Dopp of Bloomberg News.\nRELATED ARTICLE\nTrump dares Brennan to file suit\nA Section on 08/21/2018","url":"https://www.arkansasonline.com/news/2018/aug/21/president-labels-probers-thugs-20180821/"}
