{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:10:07","date_modify":"2018-10-30 21:10:07","date_publish":"2015-02-16 19:15:25","description":"Presidents Day 2015 comes in the midst of an upheaval about the state of U.S. foreign policy, and particularly regarding the State of Israel, whose Prime Minister will arrive in two weeks to deliver what will amount to a rebuke of President Obama's negotiating stance on Iran. As this particular holiday lends itself to ranking the presidents from best to worst, it is worth considering how they compare on relations with Israel, which has been--despite ups and downs--a staunch ally since 1948. |","filename":"data/vaneerConsumption/PresidentsDayRankingthePresidentsonIsraelPolicy.json","image_url":"https://media.breitbart.com/media/2015/01/Netanyahu-stares-down-Obama-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_16__1540933807.html","title":"Presidents Day: Ranking the Presidents on Israel Policy","title_page":"Presidents Day: Ranking the Presidents on Israel Policy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Presidents Day 2015 comes in the midst of an upheaval about the state of U.S. foreign policy, and particularly regarding the State of Israel, whose Prime Minister will arrive in two weeks to deliver what will amount to a rebuke of President Obama’s negotiating stance on Iran. As this particular holiday lends itself to ranking the presidents from best to worst, it is worth considering how they compare on relations with Israel, which has been–despite ups and downs–a staunch ally since 1948.\nIt is relatively easy to identify the best and worst from each party. Among Republicans, George W. Bush was the best, while George H.W. Bush* was the worst. Among Democrats, Harry S. Truman was the best, while Barack H. Obama sets new lows every day. (Whoever wins the presidency in 2016 could hardly be worse.) In between, there are seven other presidents whose relative ranks are debatable–perhaps highly contested–though most, save the bottom three, have been friendly.\nHistorically, Democrats have tended to be friendlier to Israel than Republicans, following the early contrast established by Truman and Eisenhower. However, in recent decades–and certainly since 9/11–Republicans have been far closer to Israel than Democrats, who have drifted towards the extreme left of their party on relations with Israel. Here is the complete list.\n1. Harry S. Truman – recognized Israel, over the objections of the State Department and numerous other advisers.\n2. George W. Bush – affirmed a close bond with Israel in the war against terror, and had a close affinity for the Jewish state, although his administration erred in pushing for Palestinian elections, a Lebanon ceasefire, and a final peace deal.\n3. Lyndon B. Johnson – affirmed the strong U.S.-Israel relationship in the wake of the 1967 Six-Day War, when France had cut off weapons and there was tremendous mounting pressure from the Arab world and the Soviets to isolate Israel.\n4. Richard M. Nixon – provided crucial weapons shipments to Israel during the Yom Kippur War–though only after intense diplomacy by the Israeli government, which had held off from a preemptive strike partly to appeal to American concerns. Prevented Israel from gaining an upper hand against its Arab enemies, for the sake of Cold War considerations.\n5. John F. Kennedy – built a positive relationship with Israel after the relatively cool diplomacy of the Eisenhower years.\n6. William J. Clinton – perhaps the most well-liked of U.S. presidents in Israel, Clinton reciprocated the affection. Yet he urged Israel forward in ill-fated peace negotiations, and intervened in Israeli elections to the benefit of the Israeli left.\n7. Ronald W. Reagan – condemned Israel for bombing Iraq’s nuclear reactor, sold AWACS to the Saudis, and was critical of Israel over Lebanon. His stand against communism and support for Soviet Jewry, would prove helpful in the long run.\n8. Gerald R. Ford – took a somewhat confrontational approach to Israel, though opposed the infamous “Zionism is racism” resolution in the United Nations at a moment when the State Department was (again) inclined to capitulate.\n9. Dwight D. Eisenhower – in the context of Cold War diplomacy, he had little affinity for Israel, which had yet to prove itself as a regional power. His administration rebuked Israel (and Britain and France) harshly over the 1956 Suez crisis.\n10. George H.W. Bush – The first Bush administration was cold to Israel–trying to deny it loan guarantees, making it absorb Scud missiles without responding in the Gulf War, and then dragging it to peace talks that rehabilitated the PLO.\n11. James E. Carter – despite the Camp David Accords, which secured peace with Egypt, Carter proved an opponent of Israel, particularly in retirement. He may bear indirect responsibility for encouraging Palestinians to leave talks in 2000.\n12. Barack H. Obama – castigated Israel in public, reneged on past understandings, encouraged Palestinian inflexibility, and above all tried to restore a hostile Iran as a regional power as it continued its terror and built its nuclear capacity.\n*Inadvertently, and regrettably, I left George H.W. Bush out of my initial assessment, which I have since corrected.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/politics/2015/02/16/presidents-day-ranking-the-presidents-on-israel-policy/"}
