{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:18:47","date_modify":"2018-10-22 21:18:47","date_publish":"2016-06-14 00:00:00","description":"\"It's a political talking point. It's not a strategy,\" Obama said in a lengthy speech in which he also criticized Donald Trump's proposals for Muslim immigrants.","filename":"data/vaneerConsumption/PresidentObamaSlamsYappingOverRadicalIslamAndTerrorism.json","image_url":"https://media.npr.org/assets/img/2016/06/14/gettyimages-540149048_wide-41a75a3b9b2891224dffbce0ee2e8c9ed2e605a5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_06_14_482041137_president-obama-slams-yapping-over-radical-islam-and-terrorism_1540243127.html","title":"President Obama Slams 'Yapping' Over 'Radical Islam' And Terrorism","title_page":"President Obama Slams 'Yapping' Over 'Radical Islam' And Terrorism : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"President Obama Slams 'Yapping' Over 'Radical Islam' And Terrorism\nHit play to hear the portion of President Obama's remarks that address the debate over using terms such as \"radical Islam.\" YouTube\nUpdated at 8:55 p.m. ET.\nHe called it yapping, loose talk, and sloppiness. President Obama dismissed criticism of his administration's avoidance of the term \"radical Islam\" and urged America to live up to its founding values Tuesday, speaking at length about inclusiveness and religious freedom.\nObama called out Republicans for criticizing the way he discusses terrorism and extremist groups — which follows the same logic as his Republican predecessor — and he directed particular attention to the GOP's presumptive presidential nominee, Donald Trump.\nRegarding terms such as \"radical Islam\" and \"radical Islamists,\" Obama said, \"It's a political talking point. It's not a strategy.\"\nHere's a passage from today's speech:\n\"What exactly would using this label accomplish? What exactly would it change? Would it make ISIS less committed to trying to kill Americans? Would it bring in more allies? Is there a military strategy that is served by this? The answer is none of the above. Calling a threat by a different name does not make it go away. This is a political distraction.\"\nTuesday night, Trump shot back telling a rally audience in North Carolina that Obama \"was more angry at me than he was at the shooter. ... That's the kind of anger that he should have for the shooter.\"\nThe argument over how to refer to violent religious extremists has become an issue in the presidential campaign — as NPR's Brian Naylor reports for Tuesday's Morning Edition, that argument pits accusations of political correctness against charges of broad inaccuracy. Brian's story includes this historical context:\n\"In refusing to use the term 'radical Islam,' Obama was following a precedent set by his Republican predecessor, George W. Bush, who said after the Sept. 11, 2001, attacks that 'ours is not a campaign against the Muslim faith. Ours is a campaign against evil.' \"\nThe president's remarks followed a National Security Council meeting on ISIS (or, to use U.S. officials' preferred acronym, ISIL) at the Department of the Treasury.\nObama took more than 25 minutes to explore those and other ideas Tuesday; his remarks also included an update on the investigation into this past weekend's shootings in Orlando — an update he concluded by saying it should be harder for gunmen to get their hands on powerful weapons in the U.S. But it was his discussion of the \"radical Islam\" argument — and America's relationships with Muslims — that seemed to spark the most passion from the president.\nRecalling 7 1/2 years of trying to combat terrorism, Obama said, \"Not once has an adviser of mine said, 'Man, if we really use that phrase, we're going to turn this whole thing around.' Not once.\"\nAfter a pause of several seconds, Obama continued:\n\"So, someone seriously thinks that we don't know who we're fighting? If there's anyone out there who thinks we're confused about who our enemies are, that would come as a surprise to the thousands of terrorists who ... we've taken off the battlefield. If the implication is that those of us up here and the thousands of people around the country and around the world who are working to defeat ISIL aren't taking the fight seriously, that'd come as a surprise to those who've spent these last 7 1/2 years dismantling al-Qaida in the FATA, for example — including the men and women in uniform who put their lives at risk, and the special forces that I ordered to get [Osama] bin Laden and are now on the ground in Iraq and in Syria. They know full well who the enemy is.\"\nObama also cited the intelligence and law enforcement personnel who work to foil terrorist plots and to protect \"all Americans — including politicians who tweet and appear on cable news shows.\"\nThe president then explored the reasons he is careful with his language, calling it part of a strategy to defeat extremism:\n\"Groups like ISIL and al-Qaida want to make this war a war between Islam and America, or between Islam and the West. They want to claim that they are the true leaders of over a billion Muslims around the world who reject their crazy notions. They want us to validate them, by implying that they speak for those billion-plus people, that they speak for Islam. That's their propaganda. That's how they recruit. And if we fall into the trap of painting all Muslims with a broad brush, and imply that we are at war with an entire religion, then we are doing the terrorists' work for them.\"\nObama then turned to the current discussion in American politics — dismissing partisan talk about the label as \"yapping.\"\nThe president then turned his attention to the current political climate, particularly the sentiments of Donald Trump, who said in the wake of the Orlando violence to \"expand on his previous call to temporarily ban all Muslims from immigrating to the United States,\" as NPR reported Monday.\nCriticizing \"this kind of rhetoric and loose talk and sloppiness,\" Obama noted that the gunman in Orlando, one of the San Bernardino killers, and the Fort Hood killer were all U.S. citizens. He questioned where the rhetoric would stop, raising the specter of discrimination against American Muslims as one possible outcome.\nCiting the danger of \"making young Muslims in this country and around the world feel like no matter what they do, they're going to be under suspicion and under attack,\" Obama outlined the risks of such policies:\n\"It makes Muslim Americans feel like their government is betraying them. It betrays the very values America stands for. We've gone through moments in our history before when we acted out of fear, and we came to regret it. We've seen our government mistreat our fellow citizens. And it has been a shameful part of our history. This is a country founded on basic freedoms — including freedom of religion. We don't have religious tests here. Our founders, our Constitution, our Bill of Rights, are clear about that. And if we ever abandon those values, we would not only make it a lot easier to radicalize people here and around the world, but we would have betrayed the very things we are trying to protect: the pluralism and the openness, our rule of law, our civil liberties. The very things that make this country great, the very things that make us exceptional. And then the terrorists would have won. And we cannot let that happen. I will not let that happen.\"\nNear the end of his remarks, the president recalled the inspiration he felt in attending the recent graduation ceremony at the Air Force Academy. Referring to the open and inclusive atmosphere he saw that day, he praised America's military and then said, \"Those are the values that ISIL is trying to destroy. And we shouldn't help them do it. \"","url":"https://www.npr.org/sections/thetwo-way/2016/06/14/482041137/president-obama-slams-yapping-over-radical-islam-and-terrorism"}
