{"authors":["Abc News","More Jordyn"],"date_download":"2018-10-30 00:50:26","date_modify":"2018-10-30 00:50:26","date_publish":"2018-10-29 12:40:05","description":"First lady Melania Trump will accompany the president Tuesday.","filename":"data/vaneerConsumption/PresidentTrumptovisitPittsburghTuesdayinwakeofsynagogueshooting.json","image_url":"https://s.abcnews.com/images/Health/trump-2-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_president-trump-vi_cdb54f5325b359571d13346b2c15aef2_story_id=58829655_1540860626.html","title":"President Trump to visit Pittsburgh Tuesday in wake of synagogue shooting","title_page":"President Trump to visit Pittsburgh Tuesday in wake of synagogue shooting - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"President Donald Trump will travel to Pennsylvania Tuesday in the wake of Saturday's shooting at a Pittsburgh synagogue, the White House announced Monday.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\n\"Tomorrow, the president and first lady will travel to Pennsylvania to express the support of the American people and grieve with the Pittsburgh community,\" press secretary Sarah Sanders announced at the beginning of a White House press briefing, the second so far this month.\nA senior administration official told ABC News that the president's son-in-law Jared Kushner and daughter Ivanka Trump will travel with the president and first lady to Pittsburgh.\nThe details of the visit are still being worked out, the official said, but the president will likely meet with first responders, community leaders and, likely, the rabbi of the Tree of Life synagogue.\nSanders' voice cracked with emotion as she talked about the president’s connections to the Jewish community within his own family, including the president’s daughter Ivanka and her family.\n\"The president cherishes the American-Jewish community for everything it stands for and contributes to our country. He adores Jewish-Americans as part of his own family. The president is the grandfather of several Jewish grandchildren. His daughter is a Jewish-American and his son-in-law is a descendant of Holocaust survivors.\"\nBrendan Smialowski/AFP/Getty Images\n\"This atrocity was a chilling act of mass murder,\" Sanders said. \"It was an act of hatred. Above all, it was an act of evil,\" she said. \"Anti-Semitism is a plague to humanity. We all have a duty to confront anti-Semitism in all its forms and everywhere an anywhere it appears. The American people reject hatred, bigotry, prejudice and violence.\"\nQuestioned about the president’s rhetoric in the national discourse in the wake of Saturday’s attack and last week’s mail bomb scare, Sanders was defensive when questioned about whether there is any concern at the White House that a troubled individuals could take inspiration from the president’s harsh rhetoric against his opponents to take extreme actions.\n\"The very first thing that the president did was condemn the attacks both in Pittsburgh and in the pipe bombs. The very first thing the media did was blame the president and make him responsible for these ridiculous acts. That is outrageous that that would be the very first reaction of so many people across this country,\" Sanders said.\nWhile the president has blamed the news media for contributing to “great anger” in the country and attacked “The Fake News Media” as “the true Enemy of the People,” Sanders denied that the president is blaming the press and again defended the president.\nJeff Roberson/AP\n“No, the president is not placing blame,” Sanders said. “The president is not responsible for these acts. Again, the very first action of the president was to condemn these heinous acts. The very first thing the media did was condemn the president and go after and try to place blame not just on the president but everybody that works in this administration.”\nSanders also denied in the briefing that the president was referring to the media broadly when he called the “Fake News Media ... the enemy of the people\" in a Monday morning tweet.\nThere is great anger in our Country caused in part by inaccurate, and even fraudulent, reporting of the news. The Fake News Media, the true Enemy of the People, must stop the open & obvious hostility & report the news accurately & fairly. That will do much to put out the flame... — Donald J. Trump (@realDonaldTrump) October 29, 2018\n\"The president is not referencing all media. He's talking about the growing amount of fake news that exists in the country. The president's calling that out,\" Sanders said.\nPressed further, Sanders declined to specify individuals or outlets that the president is singling out but said: “I think those individuals probably know who they are.”\nWhen asked whether the president would tone down his rhetoric in the final days before the midterms, Sanders offered no commitment that he would do so, saying he would \"continue to draw contrasts\" between the two parties on policy differences.\nABC News' Jonathan Karl contributed to this report.","url":"https://abcnews.go.com/Politics/president-trump-visit-pittsburgh-tuesday-wake-synagogue-shooting/story?id=58829655"}
