{"authors":["Lisa Ryan For Dailymail.Com"],"date_download":"2018-10-23 02:48:02","date_modify":"2018-10-23 02:48:02","date_publish":"2016-01-11 15:14:25","description":"Portugese scientists said doctors should write out prescriptions to specify the type, duration, intensity and frequency of workouts adapted to each patient with type 2 diabetes.","filename":"data/vaneerConsumption/Prescribingexercisetotype2diabetespatientscouldreversecondition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B20A000000578-0-image-a-6_1452523702645.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394013_Prescribe-type-2-diabetics-EXERCISE-150-minutes-walking-swimming-running-week-helps-control-blood-sugar-insulin-insensitivity_1540262882.html","title":"Prescribing exercise to type 2 diabetes patients could reverse condition","title_page":"Prescribing exercise to type 2 diabetes patients could reverse condition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Prescribing exercise could be key to treating type 2 diabetes , scientists revealed.\nExercise has been found to improve blood sugar control, insulin sensitivity, blood pressure and cholesterol levels in people with type 2 diabetes.\nYet, most people with diabetes do not engage in regular exercise, according to a new study.\nThus, doctors should write exercise prescriptions for these patients, experts said.\nThe prescriptions should specify the type, duration, intensity and frequency of workouts, adapted to the individual.\nLead study author Dr Romeu Mendes of the Public Health Unit, ACES Douro I—Marao e Douro Norte in Portugal, told Reuters: ‘Exercise and physical activity can help to control type 2 diabetes.\nPrescribing exercise to patients with type 2 diabetes can help improve blood sugar control, insulin sensitivity, blood pressure and cholesterol levels, a new study revealed. Yet, most diabetes patients don't exercise\n‘There are many successful case-studies of patients who reversed metabolic dysfunction only with lifestyle changes (exercise plus diet)', but the benefits disappear when healthy diet and regular exercise stop.\nHe added: ‘Diabetes is a chronic disease and must be managed for life.\n‘Regular exercise and a healthy nutritional pattern are the basis for the treatment.’\nThe team of scientists analysed published recommendations and guidelines for exercise prescriptions for people with type 2 diabetes for the study.\nThose recommendations had been issued by international scientific organizations in a range of fields, including diabetology, endocrinology, cardiology, public health and sports medicine.\nFurthermore, 11 of the guidelines had been published by the European Association for the Study of Diabetes, American Diabetes Association, Francophone Diabetes Society and Swedish National Institute of Health.\nDr Mendes said: ‘We were not aware that there were so many scientific organizations issuing specific recommendations for exercise prescription in this population.’\nThe vast majority of patients with type 2 diabetes do not engage in regular exercise. This may be explained by insufficient awareness about the potential benefits of exercise and the lack of specific knowledge about current recommendations Dr Huseyin Naci, a health policy researcher at the London School of Economics\nAll of the guidelines specified that people with type 2 diabetes should accumulate at least 150 minutes of moderate to vigorous aerobic exercise per week.\nThat exercise should be spread over at least three days a week, with resistance exercise at least twice weekly.\nThe workout could include aerobic exercise, according to the guidelines, which entails brisk walking, running, cycling, swimming or other activites.\nResistance exercise should target large muscle groups with machines or free weights, the guidelines suggest.\nAdditionally, some institutions recommended flexibility training, as well.\nDr Mendes said: ‘The ultimate and most important variable for people is quality of life.’\nHe noted that exercise particularly improves health-related quality of life.\nThe medical community agrees that exercise has indisputable life-saving benefits.\nHowever, there is limited research on the benefits of exercise among people with diabetes, according to Dr Huseyin Naci, a health policy researcher at the London School of Economics.\nDr Naci, who wasn’t involved in the study, told Reuters: ‘According to our previous research, there is a bias against testing exercise.\n‘Medical research increasingly favors drug interventions over strategies to modify lifestyle.\n‘The vast majority of patients with type 2 diabetes do not engage in regular exercise.\n‘This may be explained by insufficient awareness about the potential benefits of exercise and the lack of specific knowledge about current recommendations.’\nDoctors should encourage their type 2 diabetes patients to exercise by writing prescriptions that specify the type, duration, intensity and frequency of workouts, adapted to the individual, scientists revealed\nBut, doctors must do more than just advise patients to increase their exercise levels, Dr Naci said.\nInstead, they must issue prescriptions that include specific information to the type, mode, duration, intensity and weekly frequency of the exercise.\nAlso, the exercise strategies should be adapted for each individual, based on other health conditions, contraindications and realistic personal goals.\nDr Naci said: ‘According to the US Centers for Disease Control and Prevention, roughly one third of doctors prescribe exercise in primary care.\n‘This is promising, but more doctors should discuss and give brief advice to their patients about the benefits of exercise and refer patients with diabetes to structured exercise programs.’","url":"https://www.dailymail.co.uk/health/article-3394013/Prescribe-type-2-diabetics-EXERCISE-150-minutes-walking-swimming-running-week-helps-control-blood-sugar-insulin-insensitivity.html"}
