{"authors":["Penny Starr"],"date_download":"2018-10-30 19:30:27","date_modify":"2018-10-30 19:30:27","date_publish":"2018-07-28 16:53:14","description":"USDA Secretary Sonny Perdue wrote an op-ed explaining how President Donald Trump’s trade agenda helps American farmers.","filename":"data/vaneerConsumption/PresidentTrumpStandswithAmericanFarmers.json","image_url":"https://media.breitbart.com/media/2018/07/Trump-with-Make-Farmers-Great-Again-hats-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_28__1540927827.html","title":"President Trump Stands with American Farmers","title_page":"USDA Secretary Sonny Perdue: President Trump Stands with American Farmers","title_rss":"NULL","source_domain":"breitbart.com","text":"United States Department of Agriculture (USDA) Secretary Sonny Perdue used a sports analogy in a USA Today op-ed last week to explain how President Donald Trump’s trade agenda supports American farmers.\n“In the Olympics, if opposing athletes continuously broke the rules while the officials let them get away with it, American fans would want our coaches to raise a fuss,” Perdue wrote. “That’s what has been happening in the arena of international trade, and President Donald Trump is rightly calling out our competitors for unfair play.”\nThe unfair tariffs, Perdue wrote, are coming as retaliation for Trump’s efforts to make trade more fair and free and the USDA is helping make that happen.\n“We will aid our producers in mitigating trade damages caused by retaliation, which is a short-term solution to give the president time to work on trade deals to benefit agriculture and all sectors of the American economy in the long run,” Perdue wrote.\n“President Trump is taking action on trade policy to open markets so American farmers can compete globally,” Perdue added.\nPerdue specifically pointed out China for its “bad behavior.”\n“Instead of retaliatory tariffs, the correct Chinese response would be to stop their bad behavior,” Perdue wrote. “The Trump administration’s action to stand by our agricultural producers is a clear message that China cannot bully farmers to coerce the United States to cave in.”\nPerdue announced that the USDA would put in place $12 billion in programs to help farmers — the same amount as the cost from Chinese tariffs.\n“These programs, in addition to our existing farm support programs, will help farmers meet the costs of disrupted markets resulting from unjustified retaliation,” Perdue wrote. He continued:\nThe assistance may come in three forms: incremental payments to producers impacted by the retaliatory tariffs, purchase and distribution of commodities to food banks and other nutrition programs, and trade promotion, in conjunction with the private sector, to develop new export markets.\nPerdue acknowledged that farmers want free trade, not subsidies.\n“There is no question that farmers prefer free trade over government aid,” the secretary wrote. “What we are seeking is a level playing field, where our agricultural home team will always be the best competitors and have the best chance to succeed on the world market.”\nPerdue’s commentary comes as the president’s critics say the tariffs he has put in place are hurting American farmers, which the Trump administration has explained means short-term pain for long-term gain.\n“When you have people snipping at your heels during a negotiation, it will only take longer to make a deal, and the deal will never be as good as it could have been with unity. Negotiations are going really well, be cool. The end result will be worth it!” Trump tweeted last week:\nWhen you have people snipping at your heels during a negotiation, it will only take longer to make a deal, and the deal will never be as good as it could have been with unity. Negotiations are going really well, be cool. The end result will be worth it! — Donald J. Trump (@realDonaldTrump) July 25, 2018\nFollow Penny Starr on Twitter.","url":"https://www.breitbart.com/politics/2018/07/28/usda-secretary-perdue-trump-stands-american-farmers/"}
