{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 19:50:33","date_modify":"2018-10-30 19:50:33","date_publish":"2017-03-10 16:00:35","description":"When you’re President of the United States, you can pretty much meet with whoever you want, whenever you want, whether that person is “on the schedule” or not. | Sports","filename":"data/vaneerConsumption/PresidentTrumpMeetsWithTMZsHarveyLevintoDiscussFutureAppearanceandBookingTomBradyonLevinsShow.json","image_url":"https://media.breitbart.com/media/2017/02/tom-brady5.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_03_10__1540929033.html","title":"President Trump Meets With TMZ’s Harvey Levin to Discuss Future Appearance, and Booking Tom Brady on Levin’s Show","title_page":"President Trump Meets With TMZ’s Harvey Levin to Discuss Future Appearance, and Booking Tom Brady on Levin’s Show | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When you’re President of the United States, you can pretty much meet with whoever you want, whenever you want, whether that person is “on the schedule” or not.\nSuch an unplanned, off-the-schedule meeting took place last Wednesday at the White House, where President Donald Trump sat down with TMZ President Harvey Levin, according to the New York Times. Levin and Trump have a history together, partly based around Trump’s appearance on Levin’s Fox News special “Objectified.”\nThe success of that show has now led to a spinoff series, also called “Objectified.” Levin spoke with Trump about appearing again on an episode of that series, which starts in September. However, he also asked the Commander-in-Chief to help in securing an interview with the most famous man not named Donald Trump to ever own a “MAGA” hat.\nThat of course being Tom Brady. According to the New York Times, “One of Mr. Levin’s ideal guests is Tom Brady, the New England Patriots quarterback and a friend of Mr. Trump, and Mr. Levin planned to ask the president if he would help secure the athlete’s participation, according to one of the people who described the visit.”\nAn off-the-record meeting with the leader of the free world, a probable second feature with POTUS on your TV show, then leveraging that visit to secure a better than average shot at getting an interview with greatest quarterback of all time?\nNot a bad way to spend a Wednesday afternoon.\nFollow Dylan Gwinn on Twitter: @themightygwinn","url":"https://www.breitbart.com/sports/2017/03/10/president-trump-meets-tmzs-harvey-levin-discuss-future-appearance-booking-tom-brady-levins-show/"}
