{"authors":[],"date_download":"2018-10-22 21:38:33","date_modify":"2018-10-22 21:38:33","date_publish":"2014-05-07 20:09:51","description":"President Barack Obama on Wednesday got a close-up look at the devastation wrought on Arkansas communities in the path of deadly tornadoes that struck late last month.","filename":"data/vaneerConsumption/PresidentObamaToursTornadoRavagedArkansasPledgesSupport.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427916/140507-obama-vilonia-tornado-jms-2032_c150af935a3b9261ca5f515ec61633c3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_deadly-tornado-outbreak_president-obama-tours-tornado-ravaged-arkansas-pledges-support-n99681_1540244313.html","title":"President Obama Tours Tornado-Ravaged Arkansas, Pledges Support","title_page":"President Obama Tours Tornado-Ravaged Arkansas, Pledges Support","title_rss":"NULL","source_domain":"nbcnews.com","text":"Obama first flew over a subdivision of cul-de-sacs that was destroyed, which still had visible evidence of the tornadoes’ precise path of destruction\nIn Vilonia, Obama took a walking tour of Parkwood Meadows, where just six of its 56 homes have any part still standing.\nHe also met at City Hall with families, first responders and recovery workers.\n\"I could not be more impressed with the spirit of community that's here,\" Obama said at a stop in Vilonia.\nThe president said a lot of repair and rebuilding remains to be done, but that he came to remind residents they won't be doing the work alone.\n“I'm here to make sure they know that the federal government's going to be right here until we get these communities rebuilt,\" Obama said. \"Because when something like this happens to a wonderful community like this it happens to all of us, and we got to be there for them.\"\nObama was accompanied by Democrats Gov. Mike Beebe and Sen. Mark Pryor, as well as Rep. Tim Griffin, a Republican.\nPryor is running for a third term against Republican Rep. Tom Cotton in one of the most expensive and closely watched Senate races in the country. Neither candidate faces an opponent in the May 20 primary.\nPryor's willingness to appear with Obama is notable compared to other Democrats in difficult races who have chosen to keep their distance from the president.\nObama lost Arkansas in the 2008 and 2012 elections, and polls show he remains deeply unpopular in the state.","url":"https://www.nbcnews.com/storyline/deadly-tornado-outbreak/president-obama-tours-tornado-ravaged-arkansas-pledges-support-n99681"}
