{"authors":[],"date_download":"2018-10-22 20:45:54","date_modify":"2018-10-22 20:45:54","date_publish":"2014-05-03 15:13:14","description":"The president will travel to Little Rock on Wednesday to see the tornado destruction that left 15 dead.","filename":"data/vaneerConsumption/PresidentObamaPlansArkansasVisitinWakeofTornadoDevastation.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/418141/140503-tornadoes-arkansas-mn-1130_0c046b158273c3ac7f44e296fe2069c2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_deadly-tornado-outbreak_president-obama-plans-arkansas-visit-wake-tornado-devastation-n96281_1540241154.html","title":"President Obama Plans Arkansas Visit in Wake of Tornado Devastation","title_page":"President Obama Plans Arkansas Visit in Wake of Tornado Devastation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama will take up his role as comforter-in-chief once again — this time on home soil.\nThe president plans to travel to Arkansas on Wednesday to view the devastation left by a string of tornadoes that ripped through a dozen towns last Sunday — just as Obama was travelling through Asia.\n\"I'm pleased the president is headed to Arkansas and can see the devastation firsthand,\" Sen. Mark Pryor said Saturday in announcing Obama's trip.\nThe president will tour Little Rock in response to a letter sent by Pryor.\n\"The last few years have been particularly difficult for our state,\" the senator wrote. \"We've faced dozens of damaging weather events, ranging from tornadoes to ice storms to drought.\"\nVilonia, a tiny town about 35 miles north of Little Rock, was hit hard by a tornado almost exactly three years before Sunday's twisters flattened the city.\nFifteen people were killed, more than 150 people were injured and 264 homes were damaged by the latest tornadoes in Arkansas alone, Pryor's letter said.\nObama signed an Arkansas disaster declaration on Tuesday, less than 24 hours after Gov. Mike Beebe made his request to Federal Emergency Management Agency officials for aid.\n\"Arkansans impacted by these terrible storms aren’t giving up,\" Pryor added. \"That’s because Arkansans understand the importance of coming together and pitching in to get our state back on its feet.\"\n— Elisha Fieldstadt and Kasie Hunt","url":"https://www.nbcnews.com/storyline/deadly-tornado-outbreak/president-obama-plans-arkansas-visit-wake-tornado-devastation-n96281"}
