{"authors":["Neil Munro"],"date_download":"2018-10-30 19:10:07","date_modify":"2018-10-30 19:10:07","date_publish":"2016-07-28 13:04:23","description":"By the end of June, Barack Obama had cleared the path for 214,982 “unaccompanied” youths plus 181,456 women and children to come in to the country since October 2012. That adds up to 396,428 migrants -- with three months to go before the end of the 2016 fiscal year in October. | Politics","filename":"data/vaneerConsumption/PresidentObamaAllows400000MigrantsFromCentralAmericaSince2012.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-521334000.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_28__1540926607.html","title":"President Obama Allows 400,000 Migrants From Central America Since 2012","title_page":"President Obama Allows 400,000 Migrants From Central America Since 2012 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama has allowed some 400,000 unskilled Central American migrants to pour into the nation’s schools, job-markets, welfare offices, hospitals and jails since 2012, according to government data.\nBy the end of June, he had cleared the path for 214,982 “unaccompanied” youths plus 181,456 women and children to come in to the country since October 2012. That adds up to 396,428 migrants — with three months to go before the end of the 2016 fiscal year in October.\nThe inflow is so large that it is greater than the number of African-American men who will turn 18 this year. It is equal to roughly 40 percent of the annual inflow of 1 million legal immigrants, and equal to 10 percent of all young Americans who join the workforce each year.\nJudging by prior years, the government will allow another 27,000 unskilled welfare dependent, Spanish-speaking, Central American migrants into the country by the end of October.\nThat would bring the five-year total to 423,438 migrants, who are sent into the stressed neighborhoods and struggling schools where working-class Americans live.\nOnly a handful of the economic migrants have been repatriated, despite the nation’s immigration laws, the polls, and the nation’s flooded labor market, which has left many Americans unemployed and pushed their wages downwards.\nThe migrant youths and children “are illiterate in both English and Spanish [and] the odds of us getting them to pass a 10th grade math test are negligible,” Judith Flanagan Kennedy, the mayor of Lynn, Massachusetts, said in August 2014. The migrants drive up rents, have busted the education budget — “in the last couple years, it has all fallen apart” — and some have criminal records, she said. But local residents “are very afraid to speak publicly about it, because they don’t want to be branded as a racist,” she added.\nThis week, Obama added to the northward migration by creating a process by which illegal immigrants — and other non-citizens — can get visas for their children and relatives in Central America. The process ignores Congress’ immigration laws, says Sen. Jeff Sessions.\nThe year-by-year, month-by-month inflow of Obama’s migrants is regularly noted by media outlets. But journalists rarely add up the inflow, or describe its impact on Americans, their schools, towns and budgets.\nObama has absolute legal authority to repatriate anyone who crosses the borders. Instead, However, he has chosen to let the migrants go to immigration courts and federal agencies to ask for legal residency, Green Cards and work-permits. Few of those cases have been resolved in the backlogged courts, whose dockets are filled for years ahead.\nAlso, many of the migrants have walked away from the legal system, in part, because they know that Obama’s agencies have been directed to ignore most illegals in the country and instead to just focus on violent criminals and jihadis.\nThere are two stream of Central American migrants — the so-called “Unaccompanied Alien Children” and people in “family units.”\nThe much-touted UACs are mostly older youths and young men, who declare their age to be 17 or below. Many of these youths are the children of illegal immigrants working in the United States. Once they’re arrested, they’re usually transported for free by the federal government to their foreign parents who are living in Chicago, Los Angeles, Boston or Maryland, for example.\nThe second stream consists of people in so-called “family units.” These are mostly mothers, young kids and teenage girls. The husbands and fathers are usually missing — and are likely taken the normal back routes by illegal immigrants.\nThe inflow of UACs began in 2010, and gradually accelerated to a peak in 2014 as the for-profit smugglers proved their reliability in delivering the children and young men across the border into federal transport network. But that peak may be exceeded this year prior to the possible election of Donald Trump.\nThe 2014 inflow was so out-of-control that it shifted public attitudes about immigration and then set the stage for the emergence of Donald Trump. It also forced Obama to send Americans’ taxes to Mexico to fund a new border force that reduces the flow of Central Americans migrants through Mexico’s southern border.\nObama’s welcome for migrants is rooted in his progressive views that Americans’ legal rights must be shared with all foreigners, regardless of their political beliefs, cultures and impact on the Americans’ wages. In a November 2014 speech on immigration, for example, Obama told a Chicago audience that “there have been periods where the folks who were already [Americans] here suddenly say, ‘Well, I don’t want those folks,’ even though the only people who have the right to say that are some Native Americans.”\n“Sometimes we get attached to our particular tribe, our particular race, our particular religion, and then we start treating other folks differently… that, sometimes, has been a bottleneck to how we think about immigration,” Obama said, shortly after he announced his Oval Office plan to award work-permits to roughly 4 million additional illegal immigrants, without any approval from Congress.\nIn turn, that globalist progressive view matches his political strategy of recruiting foreign migrants into the Democrats’ discordant coalition. Obama made his strategy clear in 2006, when he wrote in his autobiography that large-scale migration hurts the wages of African-Americans. “This huge influx of mostly low-skill workers provides some benefits to the economy as a whole… [but] it also threatens to depress further the wages of blue-collar Americans,” Obama admitted.\nBut those immigrants would help the Democratic Party, he wrote. “In my mind, at least, the fates of black and brown were to be perpetually intertwined, the cornerstone of a [Democratic] coalition that could help America live up to its [progressive] promise,” he wrote in “The Audacity of Hope.”","url":"https://www.breitbart.com/politics/2016/07/28/president-obama-allows-400000-migrants-from-central-america-since-2012/"}
