{"authors":["Pam Fessler"],"date_download":"2018-10-23 00:52:00","date_modify":"2018-10-23 00:52:00","date_publish":"2016-01-27 00:00:00","description":"The president will propose in his 2017 budget that families who qualify for subsidized school meals receive benefits to buy an extra $45 in groceries per child each month when school is out.","filename":"data/vaneerConsumption/PresidentObamaWantsMoreFundsToFeedLowIncomeKidsInSummer.json","image_url":"https://media.npr.org/assets/img/2016/01/26/sfsp_wide-76ac27d833a5df68fedce641e4b339dcf6e0b896.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2016_01_27_464480281_president-obama-wants-more-funds-to-feed-low-income-kids-in-summer_1540255920.html","title":"President Obama Wants More Funds To Feed Low-Income Kids In Summer","title_page":"President Obama Wants More Funds To Feed Low-Income Kids In Summer : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"President Obama Wants More Funds To Feed Low-Income Kids In Summer\nIt's a challenge making sure that low-income children who get free- and reduced-priced meals during the school year continue to get fed during the summer.\nGovernment meal programs served 3.8 million children on an average summer day last year — far fewer than the 22 million children who got subsidized meals during the school year.\nNow, the Obama administration wants to change that. The president will propose in his 2017 budget next month that families who qualify for subsidized school meals be given a special electronic benefits card that will allow them to buy an additional $45 in groceries per child each month when school is out.\n\"The reality is, obviously, we still have millions of kids that are not getting the help and assistance they need,\" says Agriculture Secretary Tom Vilsack, who oversees the program.\nVilsack says there are many reasons for the summertime drop-off in participation. It's hard to find sites where kids can be fed during the summer, when they're home and schools are closed. This is especially difficult in rural areas, where children live far from any church or public space where meals can be served. They often lack the transportation needed to get there.\nThe USDA, states and nonprofit groups have been trying for several years now to figure out how to boost participation in a summer feeding program. They've experimented with offering free meals at camps and libraries, where children are likely to show up. And they're using food trucks to deliver meals to more remote areas.\nSome states have also tried electronic benefit transfer, or EBT, cards to give families extra money for food in the summertime. It's this pilot program that the administration would like to expand to every state over the next 10 years.\n\"The president is suggesting the time has come to make a longer term, permanent commitment to making sure that all kids have access to meals during the summer,\" says Vilsack.\nBut that commitment would be costly — an estimated $12 billion over the next 10 years. That's unlikely to attract much support in the Republican-led Congress, which has been trying to cut back on such spending in recent years.\nIn fact, leading Republicans, such as House Speaker Paul Ryan and several presidential candidates, say they'd like to combine food aid and other safety net programs into block grants, and give states more flexibility over how to spend the money. They say the current programs discourage people from working and getting off government aid.\n\"I'd combine a lot of them and send that money back to the states for better poverty-fighting solutions: Require everyone who can to work. Let states and communities try different ideas. And then test the results,\" Ryan said in a speech last month.\nStill, historically, there's been bipartisan support for programs to feed needy children. The Senate Agriculture Committee approved a more limited version of the EBT plan this month, at an estimated cost of about $50 million a year. The House has yet to weigh in.\nVilsack also announced that the administration is doing something else to boost participation in the free and reduced-price lunch program. It plans to allow states to start using Medicaid data to automatically enroll qualified low-income children into the program. The idea is to reduce some of the administrative paperwork in signing kids up for food aid, and to identify those who are qualified for subsidized meals, but for one reason or another haven't been getting them.","url":"https://www.npr.org/sections/thesalt/2016/01/27/464480281/president-obama-wants-more-funds-to-feed-low-income-kids-in-summer"}
