{"authors":[],"date_download":"2018-10-30 14:14:25","date_modify":"2018-10-30 14:14:25","date_publish":"2018-07-20 00:00:00","description":null,"filename":"data/vaneerConsumption/PresscreditsJunckerfortradedealbutshouldcreditTrump.json","image_url":"https://www.americanthinker.com/images/bucket/2018-07/207974.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_07_press_credits_juncker_for_trade_deal_but_should_credit_trump_1540908865.html","title":"Press credits Juncker for trade deal but should credit Trump","title_page":"Press credits Juncker for trade deal but should credit Trump","title_rss":"NULL","source_domain":"americanthinker.com","text":"Juncker is Jean-Claude Juncker, the arrogant, sniveling Luxembourgish president of the European Commission so well regarded by anyone who's in love with the European Union.\nYesterday's Wall Street Journal headline, blared loudly, was \"How Juncker Sold Trump on Trade Deal.\" The paper has since changed it , but here we are.\nMaybe the Journal changed it because enough readers protested. Because why wasn't the headline: \"How Trump Sold the EU and Juncker the Value of Lowering Trade Barriers to the U.S.\"?\nThat was what really happened.\nIt is truly sad how one-sided the WSJ has gone on trade. No matter what Trump has done on trade, it is bad.\nIf something comes out good on trade, like the E.U. deal, it is the E.U. that gets the credit. Not Trump. Essentially, the WSJ is not at all different from CNN, MSNBC, the Huffington Post, the New York Times, and the Washington Post on trade. They are all worthless.\nMy guess is that Canada, Mexico, and China will all come to the table now, having seen what just happened with Europe, because they realize we finally have a president who is actually serious about opening up trade, instead of just another president who gives in. They've seen a lot of those. T he lack of vision by the WSJ (and others) is astonishing.\nWhen Trump gets done, we will be much closer to zero tariffs and taxes across the board than before he took office. Trump is the one for open and free trade, not a guy like Juncker.\nThe Journal is little better on immigration, or rather, open borders. The paper seems to have little or no regard for actually enforcing the laws Congress passes.\nMaybe the WSJ should just can all its journalists and replace them with fax machines and robots. When everyone repeats the same talking points, is it any wonder that readership goes down?","url":"https://www.americanthinker.com/blog/2018/07/press_credits_juncker_for_trade_deal_but_should_credit_trump.html"}
