{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:25:11","date_modify":"2018-10-30 18:25:11","date_publish":"2017-03-01 03:19:28","description":"In his address to the joint session of Congress, President Donald Trump asserted, “Education is the civil rights issue of our time.”","filename":"data/vaneerConsumption/PresidentTrumpEducationIstheCivilRightsIssueofOurTime.json","image_url":"https://media.breitbart.com/media/2017/02/Denisha-Merriweather-Congress-Joint-Session-Address-Feb-28-2017-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_28__1540923911.html","title":"President Trump: ‘Education Is the Civil Rights Issue of Our Time’","title_page":"President Trump: ‘Education Is the Civil Rights Issue of Our Time’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In his address to the joint session of Congress, President Donald Trump asserted, “Education is the civil rights issue of our time.”\nTrump invited Denisha Merriweather to be a guest in the gallery.\n“As a young girl, Denisha struggled in school and failed third grade twice,” the president said. “But then she was able to enroll in a private center for learning, with the help of a tax credit scholarship program.”\nIn an op-ed in the Wall Street Journal in October of 2014, Denisha said Florida’s tax-credit scholarship program “saved” her.\n“Today, she is the first in her family to graduate, not just from high school, but from college,” Trump continued. “Later this year she will get her masters degree in social work.”\nTrump said school choice for disadvantaged youth, “including millions of African-American and Latino children,” will “break the cycle of poverty.”\nFamilies, the president continued, “should be free to choose the public, private, charter, magnet, religious or home school that is right for them.”","url":"https://www.breitbart.com/politics/2017/02/28/president-trump-education-civil-rights-issue-time/"}
