{"authors":["Jim Zarroli"],"date_download":"2018-10-22 21:34:18","date_modify":"2018-10-22 21:34:18","date_publish":"2016-11-21 00:00:00","description":"President-elect Donald Trump apparently plans to preside over an administration where there will be few, if any, barriers between him and his considerable business interests.","filename":"data/vaneerConsumption/PresidentElectTrumpContinuesToBlurLineBetweenBusinessAndPolitics.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_21_502918065_president-elect-trump-continues-to-blur-line-between-business-and-politics_1540244058.html","title":"President-Elect Trump Continues To Blur Line Between Business And Politics","title_page":"President-Elect Trump Continues To Blur Line Between Business And Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"President-Elect Trump Continues To Blur Line Between Business And Politics\nPresident-elect Donald Trump apparently plans to preside over an administration where there will be few, if any, barriers between him and his considerable business interests.\nKELLY MCEVERS, HOST:\nThere has never been a president with such a vast network of businesses as Donald Trump, and the conflicts of interest threaten to become a major problem for the new administration. Just last week, the president-elect took time away from his transition work to meet with three business partners from India. It was another example of the blurred lines between Trump's roles as president and as businessman. To talk about this, we are joined by NPR's Jim Zarroli. Hi there.\nJIM ZARROLI, BYLINE: Hi.\nMCEVERS: So tell us about this meeting that happened last week.\nZARROLI: Well, you know, Trump has business interests in many parts of the world - you know, real estate, golf clubs, hotels. And he has five buildings in India. So last week, he met with some of the people he does business with there, you know, in India. It was a short meeting. Apparently they talked about politics. And then later these developers went on social media kind of bragging about seeing Trump. You know, they think his election is going to be good for their business.\nYou know, here is really the issue. Trump has apparently the same kind of deal with these developers that he has had in other places, which is, you know, he doesn't put his own money into the project. He puts his name on it. He leases his name, and he gets paid for that. And the fact that he is president makes, you know - makes his brand potentially worth more. It really represents a conflict.\nMCEVERS: Right. Are there other examples of potential conflicts of interest like this?\nZARROLI: Yeah. There was an example in The Washington Post. You know, Trump has a new hotel near the White House. It has apparently become a kind of place for, you know - like, a hangout place for foreign diplomats. And several of them were quoted as saying, you know, why wouldn't we come here? This is Trump's hotel.\nSo that means, you know, that's more money for the Trump organization. So Trump is really - and this is the issue. Trump is really in a position to profit from the White House in a way that really no other president has before him.\nMCEVERS: Trump has said that he won't be involved in his businesses. He says he's letting three of his grown children run them. And he says that will protect him from any conflicts of interest. Does that - do you think that will work?\nZARROLI: Well, you know, the thing is, there are all kinds of ways in which Trump's business interests bleed over into his role as president. For instance, actually today, there was a story. A very well-respected Argentinian journalist said Trump spoke to the country's president, president Macri, recently just, you know, to accept congratulations. And while he was on the phone, he allegedly asked the president of Argentina about some permitting issues at a project in Buenos Aires.\nNow, the president of Argentina's spokesmen came out right away, denied this, said it was absolutely untrue. And so did the Trump transition team. But you know, the thing is, even if Trump does what he says, he doesn't get involved in his business, he lets his kids handle it, you know the people that they deal with still know that they are Donald Trump's kids and they have big roles in the transition team, for instance.\nSo when Donald Trump's grown kids go out asking for things, they will have a kind of access and a kind of clout that they wouldn't otherwise have. And it really - it at least creates the impression that the Trumps are sort of trading on the presidency to make money.\nMCEVERS: What do Trump and his team say when they're asked about these potential conflicts of interest?\nZARROLI: Well, you know, they say there won't be a problem. Trump isn't going to be involved with the business, which, you know, means essentially, trust us; we will do the right thing. Trump's lawyers say they will make sure they're staying within the law.\nThe problem is there really aren't a lot of laws in this subject. There's a federal statute that restricts the way members of the executive branch profit off their work, but it doesn't apply to the president or the vice president. So there's really nothing to stop presidents from doing business on the side and making money except for, you know, traditions. And as we've seen with Donald Trump and his tax returns, for instance, he doesn't always feel bound by the traditions that other presidents have been bound by.\nMCEVERS: That's NPR's Jim Zarroli. Thank you.\nMCEVERS: You're welcome.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/11/21/502918065/president-elect-trump-continues-to-blur-line-between-business-and-politics"}
