{"authors":["Sara Tan"],"date_download":"2018-10-30 22:38:41","date_modify":"2018-10-30 22:38:41","date_publish":"2014-08-14 21:30:01","description":"Conventional wisdom, evolution and the media might all suggest that the more attractive a person is, the healthier they are. But a recent study conducted by Brunel University is here to prove that pretty people are not as invincible as they may…","filename":"data/vaneerConsumption/PrettyPeopleGetSickAsOftenAsTheirLessAttractiveCounterpartsSoBeautyReallyIsPainSometimes.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e70027f2-1884-4ea1-8f23-0584b733e292.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35822-pretty-people-get-sick-as-often-as-their-less-attractive-counterparts-so-beauty-really-is-pain_1540939121.html","title":"Pretty People Get Sick As Often As Their Less Attractive Counterparts, So Beauty Really Is Pain Sometimes","title_page":"Pretty People Get Sick As Often As Their Less Attractive Counterparts, So Beauty Really Is Pain Sometimes","title_rss":"NULL","source_domain":"bustle.com","text":"Conventional wisdom, evolution and the media might all suggest that the more attractive a person is, the healthier they are. But a recent study conducted by Brunel University is here to prove that pretty people are not as invincible as they may seem. Their research found that people with symmetrical facial features are just as likely to suffer from illnesses as those with asymmetrical faces — basically, traditionally pretty people don't get sick less than anyone else. This, of course, is based off the idea that those with symmetrical features are more attractive.\nDr. Nicholas Pound and his team studied a group of almost 5,000 British teenagers. They employed 3D face scans of the subjects, comparing their features with a range of common illnesses as they grew up. Pound found no link between the rate of infections (including measles, the flu, tonsilitis, mumps, etc.) and a person's facial symmetry.\nPound told the Daily Mail, \"The idea that symmetry in facial traits is associated with attractiveness because it reliably indicates good physiological health, particularly to potential sexual partners, has generated an extensive literature on the evolution of human mate choice. But overall, this study does not support the idea facial symmetry acts as a reliable cue to physiological health.\"\nPounds' findings go against a slew of studies that suggest perfect facial symmetry equates to good health. One of those studies was conducted last June and found that the more physically attractive men and women are rated, the more unlikely they are to suffer from a range of health problems. It was one of the biggest studies ever conducted on the subject.\nWhatever study you decide to side with, I think we can all agree that eating right and getting the proper amount of exercise is the key to being happy and healthy, not having a perfectly equal face. I'm sure Karlie Kloss succumbs to a seasonal cold just as often as the rest of us. Just saying.","url":"https://www.bustle.com/articles/35822-pretty-people-get-sick-as-often-as-their-less-attractive-counterparts-so-beauty-really-is-pain"}
