{"authors":["Rosie Narasaki"],"date_download":"2018-10-30 23:44:30","date_modify":"2018-10-30 23:44:30","date_publish":"2014-08-13 12:00:03","description":"Pretty Little Liars has seen a lot of awful, punny titles in its day (the recent \"March of Crimes\" and Season 4's \"Gamma Zeta Die!\" pop to mind) but \"A Dark Ali\" might just be the worst of all. Terrible pun though it may have been, there's no…","filename":"data/vaneerConsumption/PrettyLittleLiarsFashionMVPWhoWastheBestDressedinADarkAli.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a956db4a-caba-4244-b867-788a5cb68698.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35560-pretty-little-liars-fashion-mvp-who-was-the-best-dressed-in-a-dark-ali_1540943070.html","title":"'Pretty Little Liars' Fashion MVP: Who Was the Best Dressed in \"A Dark Ali?\"","title_page":"'Pretty Little Liars' Fashion MVP: Who Was the Best Dressed in \"A Dark Ali?\"","title_rss":"NULL","source_domain":"bustle.com","text":"Pretty Little Liars has seen a lot of awful, punny titles in its day (the recent \"March of Crimes\" and Season 4's \"Gamma Zeta Die!\" pop to mind) but \"A Dark Ali\" might just be the worst of all. Terrible pun though it may have been, there's no denying that it was accurate: In addition to some high-level shadiness from Melissa Hastings, the episode featured a whole lot of terrible behavior from Ali/the ever-wiggy Vivian Darkbloom.\nYep, she betrayed the girls in a major way. Her decision to lie to the police re: Cyrus/kidnapping (Spencer: \"I'm sorry, do we seriously have to remind you that you were never actually kidnapped?\") was bad, and the reveal that she was the one who set up the whole mess of a situation in the first place? Almost immeasurably worse — now, she's topping a lot of 'A' suspect lists, and she managed to very definitively sink the \"Emison\" ship.\nBut, as per usual, I'm here today to talk clothes, not who may-or-may-not be criminal mastermind 'A.' There were some stumbles this week, fashion-wise — Emily's baggy plaid shirt made me sad, and while I liked Hanna's concept of a repurposed Boy Scouts uniform paired with a denim skirt, it didn't end up working so great in practice. That said, the outfits were by and large a win this week: so let's recap some of the best!\n5. Aria's leopard print\nABC Family\nAria never met an animal print she didn't like, did she? This fun/funky T-shirt looked especially cute with her orange sherbet-colored skinny jeans (though it looked rather over the top when paired with her loud, leopard blazer).\n4. Emily's leather jacket\nYay for Emily; taking names for the second week in a row, looking (and acting) like quite the badass in leather.\nAlso, I'm going to be using the phrase \"I am so done with you\" in all future break ups.\n3. Spencer's militaristic duds\nABC Family\nOkay, so this outfit was a touch much... but I kind of loved it anyway. There was something very \"Agent Peggy Carter\" about it, no? (Maybe Troian Bellisario's gunning for a role in the upcoming miniseries — we all know she pulls off the '40s noir look off, after all).\n2. Hanna's LBD\nHanna's new lowlights were the perfect accessory to her River Song-esque drapey black dress. And for the record, Mona totally deserved that.\n1. Spencer's punk stylings\nSpencer was this week's outfit MVP by a mile: She was working that ensemble, which happens to be my personal favorite from the new Aeropostale x PLL collection. Product placement at its best, everyone.","url":"https://www.bustle.com/articles/35560-pretty-little-liars-fashion-mvp-who-was-the-best-dressed-in-a-dark-ali"}
