{"authors":[],"date_download":"2018-10-23 02:28:40","date_modify":"2018-10-23 02:28:40","date_publish":"2017-03-16 13:03:14","description":"On a Tuesday morning last month, Steve Meadows, a 66-year-old architect, actor, inventor and dabbler in art, left his home in Venice, California, with a...","filename":"data/vaneerConsumption/PricelessVanGoghsorjustplainart.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228461-1489669396-850_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320170_Priceless-Van-Goghs-just-plain-art_1540261720.html","title":"Priceless Van Goghs or just plain art?","title_page":"Priceless Van Goghs or just plain art? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Steve Meadows inspects the two paintings before shipping them to the Van Gogh Museum in Amsterdam for an authentication review\nOn a Tuesday morning last month, Steve Meadows, a 66-year-old architect, actor, inventor and dabbler in art, left his home in Venice, California, with a cargo boasting an extraordinary history.\nTrailed by documentary filmmakers and aided by a friend, he loaded two potentially precious paintings -- once at the center of an international art scandal -- into his SUV, and headed to a shipping warehouse near downtown Los Angeles.\nThe still life artworks on paper and canvas were bound for the Van Gogh Museum in Amsterdam, where long-awaited examinations may finally determine if the Dutch master painted them.\nTheir authentication would startle the art world and likely generate astronomical valuations. The canvas, measuring 68 by 52 centimeters (26.8 by 20.5 inches), would be among the largest paintings by Vincent Van Gogh confirmed genuine in recent decades.\n\"I'm feeling relief at getting them to the museum,\" Meadows said. \"I just want the truth.\"\nThe paper study is being evaluated as a possible preliminary study by Van Gogh for his \"Japanese Vase with Roses and Anemones\" -- currently hanging in the Musee d'Orsay in Paris. The canvas is a potential original still life by the artist entitled \"Japanese Fan.\"\n- Authentication quest -\nTheir inspections mark another twist in the dramatic, decades-spanning story of a contested, seemingly cursed, collection of artworks.\nBoth once belonged to controversial Dutchman Jelle de Boer, who amassed hundreds of unauthenticated pieces in the mid-20th century that he claimed were by Van Gogh. Swiss authorities confiscated many of them in 1967 on suspicion of forgery and decades of legal battles ensued.\nDe Boer died in 1970 and his heirs sold the rights to the artworks to Dutch and Belgian investors in 1992. A decade later they succeeded in finally reuniting the collection.\nMeadows acquired his two paintings from the businessmen as collateral for directing and investing in their subsequent authentication and publicity efforts in the United States. He became sole owner when that partnership ended in 2004, according to Donald Burris, his Los Angeles-based attorney.\nHe soon began his own painstaking authentication quest, eventually spending hundreds of thousands of dollars on studies, storage and legal fees as he doggedly pursued a coveted appraisal at the Van Gogh Museum, the world's foremost authority on the artist.\nSteve Meadows (right) has spent a small fortune on studies, storage and legal fees as he doggedly pursues appraisal at the Van Gogh Museum\nMeadows commissioned experts in microscopic palette analysis and canvas threads, as well as initiating infrared imaging of the paper painting. He also ordered high-resolution X-rays and transparent overlay drawings of the canvas.\nThe findings proved positive. Both palettes are consistent with Van Gogh.\nThe paper study matches in size and composition alignment to the artist's authentic \"Roses\" in Paris -- painted in June 1890, just a month before his death -- and could date back to the same period. Van Gogh is known to have made many precise duplicates of paintings using different colors.\nMeanwhile the \"Fan\" canvas has similar characteristics to three of his Paris period (1886-88) paintings and some early 1880s Edouard Manet works.\nScans showed it had been drawn, in landscape orientation, over a previously undetected floral image painted in portrait. Van Gogh often painted over his work, according to art historians.\nAs the encouraging evidence mounted, Meadows hired Burris, the attorney who helped win the high-profile \"Woman in Gold\" US Supreme Court case in 2004 concerning looted artworks of Gustav Klimt.\n- Awaiting the findings -\nIn July 2015 they sent all the paperwork to the Van Gogh Museum, and two months later it agreed to appraise the paintings in early 2017.\n\"All the reports point to them being Van Gogh works,\" Burris said. \"We're gratified the museum has agreed to review them. We realize they've made no commitments as to the outcome, but we're hopeful.\"\nIt could be months, even years, before researchers finish their evaluations, which might prove inconclusive.\nEsmee Kohler, a spokeswoman for the Van Gogh Museum, would only confirm the review is under way.\n\"During that period, the museum can't give any comments on its progress,\" she said.\nDavid Brooks, a Van Gogh catalogue specialist based in Toronto, said he would be stunned if either painting were positively verified, given the historical infamy of the de Boer collection.\n\"But it's not outside the realm of possibility,\" he added. \"A broken clock is right two times a day... the fact that they have made it through the door to the research department of the Van Gogh Museum is encouraging.\"\nMeadows draws optimism from the example of Andrew Brainerd, a Chicago attorney and art collector who bought four paintings from de Boer in 1966.\nAfter decades of tortuous efforts Brainerd convinced some experts that one was an 1859 Manet study of Diego Velazquez's 17th century portrait \"Infanta Margarita Teresa in a Blue Dress.\"\nMeanwhile Meadows waits in his Venice home -- bought from musician Eric Clapton, with a peddled flying machine he invented hanging from the lofty ceiling -- wondering if he is the owner of two priceless paintings, or just a Renaissance Man on an expensive misadventure.","url":"https://www.dailymail.co.uk/wires/afp/article-4320170/Priceless-Van-Goghs-just-plain-art.html"}
