{"authors":[],"date_download":"2018-10-22 20:52:33","date_modify":"2018-10-22 20:52:33","date_publish":"2014-06-03 13:54:05","description":"A priest accused of molesting a U.S. teenager is thriving at a South America church, highlighting the difficulties in pursuing abuse allegations.","filename":"data/vaneerConsumption/PriestAccusedofAbuseinUSRisesAgaininParaguay.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2018_41/484001/140-603-paraguay-priest-mn-1000_d83cb065512ef76607001e9882d405c5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_priest-accused-abuse-u-s-rises-again-paraguay-n121231_1540241553.html","title":"Priest Accused of Abuse in U.S. Rises Again in Paraguay","title_page":"Priest Accused of Abuse in U.S. Rises Again in Paraguay","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCIUDAD DEL ESTE, Paraguay — A hush falls across the church, broken only by the rhythmic swish of the censer as it bestows acrid incense across the faces of the congregation.\nA gaggle of monks in brown habits, their heads tonsured in repentant horseshoes, rises and begins to chant. They are joined by seminarians — priests in training — in floor-length, black soutanes, and Latin liturgy pulses over the pews. The words rise to a massive floor-to-ceiling mural that casts dozens of saintly eyes across the room.\nA noise behind the congregation. A door opening. He is here.\nFather Carlos Urrutigoity glides into the sanctuary, his ivory and scarlet robes swishing between the pews. Revered by his flock in the unruly diocese of eastern Paraguay’s Ciudad del Este, the priest will deliver his sermon to hundreds of worshippers. They will later clamor outside the church to meet the man, to receive his benediction.\nThis is a man who’s been described by bishops from Switzerland to Pennsylvania as “dangerous,” “abnormal,” and “a serious threat to young people.”\nHe has spent two decades flitting from diocese to diocese, always one step ahead of church and legal authorities, before landing in this lawless, remote corner of South America. Here, in the pirate-laden jungle near the Iguacu falls, he has risen to a position of power.\nToday, despite warnings from the bishop of Scranton, Pennsylvania, where in 2002 Urrutigoity was accused of molesting a teenage boy and sleeping with and touching other young men, this priest leads a starry-eyed cadre of young male seminarians. Despite once being accused of running what a fellow priest called a “homosexual cult” in the hills of Pennsylvania, Urrutigoity now graces the diocese website here, advertising seminars for budding young Catholics.\nUrrutigoity’s voyage from his native Argentina to Pennsylvania and back to South America represents a new chapter in the shocking story of abuse in the Catholic Church.\nIt illustrates the church’s seeming inability to prevent a priest accused of illegal acts in the United States from fleeing to a remote developing country — even one on the doorstep of Pope Francis’ homeland — and remaking himself into a powerful religious leader.\nUrrutigoity, who denies ever molesting anyone, says he’s been the victim of a smear campaign. But to those devoted to uncovering church misdeeds, the Argentine’s sustained protection by the Catholic establishment is emblematic of an ethos of cover-ups and gross negligence that continues to place young people at risk.\n“Five, 10, 15 years ago, they would move these guys from the southwest corner of the diocese to the northeast corner of the diocese,” said David Clohessy, director of the St. Louis-based Survivor's Network of those Abused by Priests or SNAP. “Nowadays, with victims being more organized and the internet, those kinds of moves are more and more risky, so sending someone abroad is a much safer way to keep them on the job.”\nTrouble will find me\nTrouble has followed Urrutigoity across the globe.\nThe first notable account of his alleged transgressions is a 1999 letter from Bernard Fellay, spiritual leader of the traditionalist Catholic society of Saint Pius X, based in Switzerland.\nUrrutigoity first served at that organization’s seminary in La Reja, Argentina, where Urrugoity was studying. In a letter to then-Bishop of Scranton William Timlin, Fellay warned about what he described as the Argentine priest’s “homosexual behavior,” stating that Urrugoity was asked to leave La Reja and was given a “second chance” at the society’s seminary in Winona, Minnesota.\nWhile in Minnesota, Urrutigoity was accused of approaching a young seminarian’s bed “for obvious dishonest acts,” the letter states. While the seminarian pretended to be sleeping, according to the letter, Urrutigoity touched him sexually.\n“Our conclusion is that there is a dangerous pattern in Fr. Urrutigoity and we feel obliged to reveal this to you,” the letter states.\nDespite the clear warning, Urrutigoity was allowed to continue living and working in the Diocese of Scranton. Two years later, he was being accused of sexual misconduct again, this time in court.\nCigars, wine and shared sleeping bags\nIn Pennsylvania, the accusations against Urrutigoity grew more extreme.\nHe had teamed up with another charismatic Catholic priest, Eric Ensey. With other like-minded leaders, they founded an ultraconservative religious group called the Society of St. John.\nIn the late 1990s, the Society of St. John found a home in an unused wing of a Catholic boy’s school, St. Gregory’s Academy. That’s when the trouble really started.\nIn a 2002 lawsuit against Urrutigoity, Ensey and the Diocese of Scranton, the two priests were accused of a pattern of sexual misconduct.\nUrrutigoity was accused of giving alcohol and cigars to teenagers, sharing beds and sleeping bags with seminarians and inappropriately touching at least two young men.\nThe alleged acts were cloaked in a bizarre dogma upon which Urrutigoity and Ensey had founded their society.","url":"https://www.nbcnews.com/news/world/priest-accused-abuse-u-s-rises-again-paraguay-n121231"}
