{"authors":[],"date_download":"2018-10-22 21:29:15","date_modify":"2018-10-22 21:29:15","date_publish":"2014-05-07 13:13:56","description":"Establishment candidates beat back Tea Party challenges in a first big primary night.","filename":"data/vaneerConsumption/PrimaryScoreboardGOPEstablishment1TeaParty0.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/425821/primary_election-jpeg-0910f_3481fadab92adfeb6207e4d7491a38b0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_primary-scoreboard-gop-establishment-1-tea-party-0-n99151_1540243755.html","title":"Primary Scoreboard: GOP Establishment 1, Tea Party 0","title_page":"Primary Scoreboard: GOP Establishment 1, Tea Party 0","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGOP Establishment 1, Tea Party 0\nThat’s the early score after state House Speaker Thom Tillis (R) surpassed the 40% needed to avoid a runoff, setting up one of the top Senate races in the country when Tillis challenges incumbent Sen. Kay Hagan (D-NC) in November. Tillis grabbed a fairly impressive 46% of the vote in the eight-person GOP Senate field, topping libertarian Greg Brannon (at 27%) and minister Mark Harris (18%). Tillis’ primary victory is the best of all worlds for the folks over at the National Republican Senatorial Committee -- 1) they get to avoid what could have been a costly and time-consuming runoff, and 2) all the coverage in this initial “re-introduction” period for the campaign has portrayed Tillis as the establishment/more-moderate-than-the-rest-of-the-GOP-field candidate, when Democrats want to argue that he’s too conservative for this swing state. As we’ve said before, Hagan-vs.-Tillis is going to be your 2014 bellwether race, in which the contest in this purple-ish state will be decided by party perception (either nationally in North Carolina, advantage GOP; or in the state, advantage Dem) and turnout, not by personality or a famous last name.\n“Divide and conquer”?\nWhile all the coverage -- including ours -- describes Tillis as the establishment candidate, Democrats are circulating a video from 2011, in which the Republican politician appears to advocate a divide-and-conquer strategy pitting the disabled against the needy. “We have to find a way to divide and conquer the people who are on assistance,” he says in the video. “We have to show respect for the woman who has cerebral palsy and had no choice in her condition… And we need to get those folks to look down at these people who choose to get into a condition that makes them dependent on the government.” Liberal writers like the Washington Post’s Greg Sargent are attempting to draw parallels between this video and Mitt Romney’s now infamous “47%” moment, when he claimed 47% of the country was dependent on the government who would never vote for him. The video does raise legitimate questions for the GOP Senate nominee. Do some poor people on Medicaid and food stamps -- particularly their children -- really have a choice about being poor? And these people should be looked down upon? As we’ve said before, Republicans are suffering from an empathy gap with Democrats. And this video doesn’t help narrow it.\nLast night’s other results\nIn the other races from last night, anti-war Rep. Walter Jones (R-NC) survived his primary against former Bush administration official Taylor Griffin. Former “American Idol” singer Clay Aiken is ahead in his Democratic congressional primary (by fewer than 400 votes), but the AP hasn’t called the race. Aiken advisers tells NBC’s Kelly O’Donnell that they are “confident” and “we think he has it,” but they are not declaring victory. Meanwhile, in Ohio, three incumbent state House members -- two Republicans and one Democrats -- went down to defeat in their primaries. And in Indiana, “voters ousted two Republican legislators who helped keep a gay marriage ban off the November ballot,” the AP says.\nFolks, the Monica news IS PROBABLY NOT going to hurt the Clintons\nYesterday’s big shiny metal object in politics was Monica Lewinsky’s article in Vanity Fair, speaking about her 1990s affair with Bill Clinton. \"It's time to burn the beret and bury the blue dress,\" she wrote. \"I, myself, deeply regret what happened between me and President Clinton. Let me say it again: I. Myself. Deeply. Regret. What. Happened.\" Much of yesterday’s discussion turned -- predictably -- to these questions: Will Lewinsky speaking hurt Hillary in 2016? Will it persuade her not to run? But there’s a different question to pose here: Has the Lewinsky episode EVER hurt the Clintons? Bill Clinton beat impeachment and is the most popular politician or ex-politician in the country. Hillary won a Senate seat just a couple of years later after the scandal; she’s the most admired female politico in the country; she the overwhelmingly front-runner for the Democratic nomination in 2016 if she runs; and the only reason she’s not in the White House today is because of issues have nothing to do with Lewinsky (Iraq war and Barack Obama). We’d argue that the only two politicians who truly suffered POLITICALLY because of Monica were Al Gore (who couldn’t handle running as Bill’s heir apparent in the scandal’s aftermath) and Newt Gingrich (who got burned by the GOP’s impeachment fervor). Of course, the one person who has truly suffered overall is Lewinsky herself, and that was painfully clear in her essay.\nIn fact, it might help them\nThe Washington Post’s Ruth Marcus takes our point one step further: Monica actually did the Clintons a big favor if Hillary decides to run in 2016. “The Lewinsky affair never really came up in 2008; the subject was too raw and too fraught, and Clinton did not make it to the ugliness of a general election campaign. It’s clear, though, that the subject will not be taboo in 2016. Sen. Rand Paul (R-Ky.) has already raised the question of whether Democrats in general, and Hillary Clinton in particular, should consort with a ‘sexual predator’ like Bill Clinton... So her piece defuses Paul’s line of attack. And it does so before any Clinton presidential announcement. If and when a Clinton presidential announcement comes, Lewinsky will be old news.” The only remaining part in this current story is Hillary’s reaction to it.\nObama goes to Arkansas, California\nToday, President Obama heads to Arkansas, where he’ll survey the damage from recent tornadoes and make a statement at 3:50 pm ET. After that, he travels to California, where he’ll raise money and attend a dinner where he’s being honored. As for the White House’s weather-related events from yesterday, they used having meteorologists at the White House to 1) use the weather to depoliticize climate change, and 2) generate local stories. Indeed, it was exactly the same event that Bill Clinton did in 1997 at the White House (when John Podesta was working for the administration).\nYesterday wasn’t a good day for Chris Christie\nFinally, since it’s been relatively quiet on the Chris Christie front in the last couple of weeks, you might be thinking, “Maybe he’s going to survive the “Bridge-gate” scandal. Well, think again: “Providing a vivid, firsthand account of how the George Washington Bridge lane closings exploded into scandal in Gov. Chris Christie’s office, a former aide to the New Jersey governor testified that the woman he cast as the central villain in the scandal was not ‘a decision maker,’ and that she did not believe that woman had planned the closings,” the New York Times writes. “The testimony of the aide, Christina Renna, portrayed a highly political operation in the governor’s office, where lines between government and Mr. Christie’s re-election often blurred, and lower-level staff members were often abruptly told not to reach out to certain mayors.” Yesterday wasn’t a good day for Christie Land.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/primary-scoreboard-gop-establishment-1-tea-party-0-n99151"}
