{"authors":[],"date_download":"2018-10-22 22:58:43","date_modify":"2018-10-22 22:58:43","date_publish":"2014-05-13 13:19:03","description":"Six states will vote on May 20, and they represent all the various national storylines this election season.","filename":"data/vaneerConsumption/PrimaryOutcomesWillHavePlentytoShowAboutMidtermMood.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/438476/matt_bevin_b4ee05fcbae278d4f6a18d5a7cfd7c8f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_primary-outcomes-will-have-plenty-show-about-midterm-mood-n104036_1540249123.html","title":"Primary Outcomes Will Have Plenty to Show About Midterm Mood","title_page":"Primary Outcomes Will Have Plenty to Show About Midterm Mood","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPreviewing next week’s “Super Tuesday” contests\nToday brings us two more states holding primaries -- Nebraska and West Virginia -- and we’ll have more on them below. But one week from now come the May 20 primaries, maybe the closest thing to a “Super Tuesday” that we’ll see before Election Day 2014. Six states will vote on that day (Arkansas, Georgia, Idaho, Kentucky, Oregon, and Pennsylvania), and they represent all the various national storylines this election season.\nBattle for Senate control: Arkansas showcases the battle for Senate control, in which Republicans need to pick up a net six seats to win control of the chamber. (Neither Democratic Sen. Mark Pryor nor Republican Tom Cotton has a primary race, though, so this race is already in general-election mode.)\nFed up with Washington: Kentucky shines the spotlight on voters’ frustrations with Congress, given Senate Minority Leader Mitch McConnell’s re-election bid. In some ways, he may be the national poster child for the “anger at dysfunctional Washington” narrative.\nEstablishment vs. Tea Party: Georgia’s Senate GOP primary, Idaho’s congressional primary (ID-2), and McConnell’s primary against Matt Bevin show the establishment-vs.-Tea Party battle inside the Republican Party. It’s a battle that, so far, appears to be going the establishment’s way.\nThe unpopular governors: Pennsylvania’s gubernatorial race highlights some of the unpopular governors running for re-election. (The action next week will be on the Democratic side for the right to challenge vulnerable incumbent Republican Gov. Tom Corbett. By the way, a surprising candidate is surging in that race, Tom Wolf -- no, not THAT Tom Wolfe.)\nGood, bad, and ugly with the health-care law: Kentucky and Oregon show us the good and bad with the health-care law (Kentucky’s implementation has gone well, Oregon’s not so much).\nThe Dem’s reliance on female candidates: Michelle Nunn in Georgia and Alison Grimes in Kentucky spotlight the Democrats’ reliance on women candidates (and of course, women supporters) to counter tough political headwinds.\nThe dynastic candidates: And Nunn, Grimes, Jason Carter in Georgia, and Mark Pryor in Arkansas represent many of the legacy/dynastic candidates who are running this election cycle.\nUncompetitive in Nebraska and West Virginia\nTurning to today’s primaries in Nebraska and West Virginia, the political world (including us) isn’t as fixated on them as next week’s Super Tuesday contests. Why? Because they’re not going to tell us much about the fall -- Republicans are a cinch to win Nebraska’s Senate and gubernatorial contests, and the GOP holds the clear advantage in West Virginia’s Senate race. But it wasn’t always like this. According to our handy 2000 Almanac of American Politics, five of the six U.S. senators from Nebraska, South Dakota, and West Virginia (all three states have Senate contests this year) were Democrats. (Chuck Hagel, now serving as Barack Obama’s Defense secretary was the lone GOP exception.) But come 2015, Democrats might have only one U.S. senator from those three states (West Virginia’s Joe Manchin). That’s a pretty significant change. And it comes when the Democratic focus on economic populism should be a winner in all three states, particularly West Virginia. What these three states highlight, though, is how culturally out of touch the Democratic Party has allowed itself to become in these states. Nationally, Democrats have been able to balance their losses in the prairie states and economic populist states (like Arkansas and West Virginia) by locking down the coasts and making MAJOR inroads in the Mid-Atlantic. Still, Democrats should still do a little soul-searching to figure out how to reconnect in these more rural states that are actually more populist and pro-government than the Washington and New York media world stereotypes them.\nPreviewing Nebraska’s primaries\nThe top contest to watch tonight is the GOP Senate primary in the race to succeed retiring Sen. Mike Johanns (R-NE). It’s become a three-man contest featuring Midland University President Ben Sasse (who’s a favorite of conservative groups), former state Treasurer Shane Osborn, and banker Sid Dinsdale. Meanwhile, Nebraska GOP voters also will be picking a Republican nominee to be their next governor, succeeding term-limited Gov. Dave Heineman (R). That race is led by businessman Pete Ricketts and Attorney General Jon Bruning, and it has attracted big outside money and some high-profile endorsements, particularly for Ricketts, whose father is a well-known billionaire donor to GOP causes (and owner of the Chicago Cubs). Ted Cruz, Paul Ryan and Scott Walker -- among others -- have backed him, while Bruning got some last-minute juice after an endorsement by Heineman. Ads in this contest have been particularly bruising too. “This has just been a really, really negative primary with lots of outside spending,” says Jennifer Duffy of the Cook Political Report. “It’s really the first taste we’ve had of outside groups playing hard in a governor’s race.”\nPreviewing West Virginia’s primaries\nVoters also head to the polls today in West Virginia. Secretary of State Natalie Tennant is expected to win the Democratic nod to face Rep. Shelley Moore Capito in the fall race for the Senate. But there’s more suspense in crowded congressional primary to replace Capito -- the three top contenders vying for the GOP nomination are former U.S. International Trade Commissioner Charlotte Lane, pharmacist Ken Reed and former Maryland GOP state chairman Alex Mooney. Mooney, who’s also got the backing of outside groups like the Senate Conservatives Fund, has outspent the rest of the field, spending over $400,000 with three weeks to go in the race. But opponents have tried to brand the recent West Virginia transplant as a carpetbagger. Former state Democratic Party chairman Nick Casey is the favorite for the Democratic nomination for the seat. Oh, and a point to make about Capito: Don’t lose sight of the fact that she avoided a true Tea Party primary. Being a pro-government Republican is the way for the GOP to win in West Virginia and so far, she’s walked that line successfully.\nThrowing the kitchen sink at Hillary\nOver the last few months, Republicans have used Benghazi and the Russia-Ukraine tensions to whack potential (but not certain) presidential candidate Hillary Clinton. They’ve also resurrected the Lewinsky scandal from 16 years ago. And now comes this news via the New York Post: Karl Rove is alleging Hillary has brain damage. From the article: “Karl Rove stunned a conference when he suggested Hillary Clinton might have brain damage. Onstage with Robert Gibbs and CBS correspondent and ‘Spies Against Armageddon’ co-author Dan Raviv, Rove said Republicans should keep the Benghazi issue alive. He said if Clinton runs for president, voters must be told what happened when she suffered a fall in December 2012. The official diagnosis was a blood clot. Rove told the conference near LA Thursday, ‘Thirty days in the hospital? And when she reappears, she’s wearing glasses that are only for people who have traumatic brain injury? We need to know what’s up with that.’” A Clinton spokesman responded, “Please assure Dr. Rove she’s 100%.” Medical records are a legitimate ask for every presidential candidate. But having Karl Rove, of all people, raise this topic -- a year before the presidential contest begins -- only politicizes it and gives her a political shield to duck this issue right away. And ask yourself this: What does it say about how Republicans feel about their ’16 chances that they’re ALREADY throwing the kitchen sink at Hillary?\nA lame duck?\n“House Speaker John Boehner says that if he has his way, he'll still be speaker of the House one year from today,” NBC’s Frank Thorp reported yesterday. “‘I'm running for reelection, I expect to be speaker,’ Boehner, R-Ohio, told Texas Tribune CEO and Editor-in-Chief Evan Smith during an interview in San Antonio. But asked if he would serve the full two years if he were to win a 13th term in November, Boehner would not commit. ‘Listen, I can't predict what's going to happen,’ Boehner said. ‘I'm going to be 65 years old in November, I never thought I'd live to be 60, so I'm living on borrowed time.’” Those comments will only fuel speculation that Boehner might not be speaker, or serve in Congress, beyond 2015 or 2016. Does he try and walk this back a tad simply to make sure he isn’t treated like a lame duck?\nClay Aiken’s challenger passes away\nFinally, here’s yesterday’s news out of North Carolina: “Keith Crisco, the Democratic candidate locked in a too-close-to-call election for a North Carolina House seat against former “American Idol” contestant Clay Aiken, died suddenly on Monday,” NBC’s Kelly O’Donnell confirmed. More from the News & Observer: \"Brad Crone, a political strategist and friend of Crisco’s for nearly three decades, said the two had talked on the phone earlier Monday to finalize plans to announce that he would concede. He had planned to call Aiken to congratulate him. Crone had already notified Aiken’s campaign staff of the plans.\"\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/primary-outcomes-will-have-plenty-show-about-midterm-mood-n104036"}
