{"authors":["Andre Walker"],"date_download":"2018-10-30 20:07:47","date_modify":"2018-10-30 20:07:47","date_publish":"2015-03-05 12:56:19","description":"David Cameron might be \"empty-chaired\" at the proposed leader's debates for the general election if he chooses not to participate in them. The discussion |","filename":"data/vaneerConsumption/PrimeMinisterCouldBeEmptyChairedAtGeneralElectionDebates.json","image_url":"https://media.breitbart.com/media/2015/02/AP61253905276.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_03_05__1540930067.html","title":"Prime Minister Could Be Empty-Chaired At General Election Debates","title_page":"Prime Minister Could Be Empty-Chaired At General Election Debates | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"David Cameron might be “empty-chaired” at the proposed leader’s debates for the general election if he chooses not to participate in them. The discussion came after Downing Street made their “final offer” to participate in just one debate with all seven leaders.\nThis was at odds with broadcasters’ plans to have two debates amongst seven party leaders and then one between just Cameron and Miliband on 30th April. But the Prime Minister’s Director of Communications, Craig Oliver, wrote to the head of the broadcasters group to say they had made “progress impossible”.\nThe letter also delivered news of Cameron’s determination to attend just one debate, leaving the broadcasters with a series of options. They could go along with what the Prime Minister has suggested, or they could continue with the three debates and empty-chair him for the two he is refusing to attend.\nThe concern amongst broadcasters is this would leave Ed Miliband on his own for 90 minutes on 30th April. He would be able to say almost anything without the challenge of having to debate another politician. One possible solution is for Nick Clegg to take the Prime Minister’s place. The Lib Dem leader is believed to be keen to join the debate.\nMr Clegg told LBC Radio: “If David Cameron is too busy or important to defend the record of this government then I offer myself. I’ll do it instead, how about that? I am assuming the role of the person who is willing to step up to the plate and defend the record of this government. I just can’t get over the lofty pomposity of the Conservatives.”\nBut even if Clegg steps in the debates might still not go ahead because the Democratic Unionist Party (DUP) are taking legal action against the broadcasters after being left out. They are the fourth largest party at the House of Commons, but so far there are no plans to include them.\nMr Oliver claimed the stumbling block was the last minute plan to invite the Scottish National Party and Plaid Cymru. In his letter he said: “You surprised us again by proposing a new seven-party structure, this time not only inviting the Greens, but Plaid Cymru and the SNP as well. Again, this was a flawed proposal – that has resulted in the DUP initiating what appears to be legitimate legal action.\n“Since this proposal has been suggested, there has been chaos. In recent weeks, you have avoided letting the parties sit in a room to hammer out proposals, making progress impossible.”","url":"https://www.breitbart.com/europe/2015/03/05/prime-minister-could-be-empty-chaired-at-general-election-debates/"}
