{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 22:09:21","date_modify":"2018-10-30 22:09:21","date_publish":"2016-08-19 02:19:55","description":"The Princeton University HR department is telling employees not to use the word \"man\" in an effort to become more gender-inclusive.","filename":"data/vaneerConsumption/PrincetonUniversityReleasesGenderNeutralLanguageGuidelines.json","image_url":"https://media.breitbart.com/media/2015/10/students-walk-across-princeton-university-campus-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_18__1540937361.html","title":"Princeton University Releases Gender-Neutral Language Guidelines","title_page":"Princeton University Releases Gender-Neutral Language Guidelines","title_rss":"NULL","source_domain":"breitbart.com","text":"The Princeton University HR department is telling employees not to use the word “man” in an effort to become more gender-inclusive.\nThe Princeton HR department released their new policy in a four-page guideline on words to use instead of “man.”\nInstead of “man,” employees are encouraged to use words such as “human beings, individuals or people.”\nInstead of “man and wife,” employees are encouraged to use “spouses or partners.” The verb “to man” is eliminated in favor of “to staff” and gendered occupations such as “cleaning lady” and “fireman” are replaced with “office cleaner” and “firefighter” respectively.\nThe department also calls for employees to eliminate all gendered pronouns in favor of repeating the noun, using second-person voice, or referring to an individual using plural pronouns.\nJohn Cramer, Princeton’s director of media relations, said the guidelines “reflect the university’s initiative of fostering an inclusive environment,” in a statement to The College Fix.\nOther universities and schools have ditched gendered pronouns in favor of gender-neutral pronouns.\nThe University of Wisconsin at Madison’s LGBT center, for example, discourages the use of “he and she” in favor of “they, ey, em, eir, eirs, ze, hir, and hirs.”\nJust recently, the Charlotte-Mecklenburg school district recommended that staff call students “scholars and students” instead of “boys and girls.”\nLast year, The University of Tennessee at Knoxville asked students and faculty to start calling students who don’t identify with a particular sex the pronouns “ze, xe, hir, hirs and zirs,” The College Fix reported.","url":"https://www.breitbart.com/politics/2016/08/18/princeton-university-hr-wipes-word-man-vocabulary/"}
