{"authors":["Bianca London For Mailonline","Rebecca English For Mailonline"],"date_download":"2018-10-22 23:16:37","date_modify":"2018-10-22 23:16:37","date_publish":"2016-01-28 11:58:29","description":"The royal couple, who toured East London attraction, Wilton's Music Hall, were left beaming as the little lady greeted them with a bright bouquet of flowers outside the attraction.","filename":"data/vaneerConsumption/PrinceCharlesandCamillaarecharmedbyalittlegirlatWiltonsMusicHall.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA5E2000000578-0-image-a-30_1453984603286.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420776_Charles-Camilla-charmed-little-girl-hands-Duchess-bunch-flowers-tour-world-s-oldest-surviving-grand-music-hall_1540250197.html","title":"Prince Charles and Camilla are charmed by a little girl at Wilton's Music Hall","title_page":"Prince Charles and Camilla are charmed by a little girl at Wilton's Music Hall | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Prince of Wales and Duchess of Cornwall were won over by a young girl as they arrived at Wilton's Music Hall on Thursday.\nThe royal couple, who toured the world's oldest surviving grand music hall, were left beaming as the little lady greeted them with a bright bouquet of flowers outside the attraction.\nCharles and Camilla learned about the restoration work, now completed, carried out on the famous East London attraction, Wilton's Music Hall.\nThe Prince of Wales, accompanied by Camilla, Duchess of Cornwall, were gvisit Wilton's Music Hall in Wapping, east London Featuring: Prince Charles, Camilla Duchess of Cornwall Where: London, United Kingdom When: 28 Jan 2016 Credit: WENN.com\nDuring the visit actor, musician and writer, Simon Callow hosted a small performance from a variety of music hall acts.\nThe production included Victorian magic from Morgan and West, a cabaret number from Gwyneth Herbert and Frances Ruffelle, and a music hall number from Bob and Barry Cryer.\nWilton's dates back to the 1850s and in its heyday could seat more than 1,500 people.\nRumour has it that the first ever can-can was performed there and promptly banned.\nThe Prince of Wales and Duchess of Cornwall were won over by a young girl as they arrived at Wilton's Music Hall on Thursday\nThe royal couple, who toured the world's oldest surviving grand music hall, were left beaming as the little lady greeted them with a bright bouquet of flowers outside the attraction\nThe Duchess of Cornwall was presented with a vibrant bouquet of flowers by the little girl\nThe Prince of Wales, accompanied by Camilla, Duchess of Cornwall, visit Wilton's Music Hall in Wapping\nPrince Charles and Camilla, Duchess of Cornwall, wait to sign a notice of their visit, at Wilton's Music Hall, as he officially opens the venue in East London\nPrince Charles makes a speech on stage with Camilla at Wilton's Music Hall, as he officially opens the venue\nPrince Charles speaks on stage about the hall, which reopened in January 1999 after work was done on the semi-derelict site and has undergone phases of work since that time\nPrince Charles and Camilla also met children from St Paul's Primary school who are taking part in an educational program at Wilton's Music Hall\nIn the mid-19th century, classical overtures, opera and operetta, choral, contemporary and folk songs were enormously popular at the hall\nIt was built by John Wilton behind his pub The Prince Of Denmark in 1858 in Graces Alley.\nWilton's Music Hall was described then as the \"Handsomest Room in Town\" and had a sun-burner chandelier with 300 gas jets and 27,000 cut crystals in its mirrored hall.\nIt reopened in January 1999 after work was done on the semi-derelict site and has undergone phases of work since that time.\nCamilla talks to British lyricist Tim Rice at Wilton's Music Hall as she sips on a glass of water\nThe Duke and Duchess met with historians and architects involved in the venue's recent repair project\nPrince Charles and Camilla Duchess of Cornwall, right, react, as they watch an act on stage at Wilton's Music Hall\nThe royal couple look impressed after watching an on-stage performance at the music hall\nCamilla looked resplendent in a chic brown suit jacket and her signature chunky pearl necklace\nThe production included Victorian magic from Morgan and West, a cabaret number from Gwyneth Herbert and Frances Ruffelle, and a music hall number from Bob and Barry Cryer\nCharles and Camilla learned about the restoration work, now completed, carried out on the famous East London attraction, Wilton's Music Hall\nIt was an altogether more cheerful visit for the Duchess of Cornwall, who was yesterday was moved to tears by the harrowing stories of women who have survived domestic abuse – and those who have lost their lives at the hands of violent partners.\nCamilla, red eyed and visibly moved, listened intently as, one by one, each woman stepped forward to recall their devastating experiences.\nAmong them was the mother and best friend of Joanna Brown, who was killed by her violently manipulative husband, British Airways Captain Robert Brown, in 2010.\nHe sensationally went on to be cleared of murder, despite admitting bludgeoning his estranged wife to death with a claw hammer within yards of their children and burying her in a grave he had dug weeks previously, but was found guilty of manslaughter on the grounds of diminished responsibility.\nThe Duchess of Cornwall was left in tears yesterday after meeting victims of domestic violence at a charity event\nCamilla struggled to hold back the tears as she heard from women about their harrowing experiences\nThe best friend of Joanna Brown also told Camilla of the shocking catalogue of emotional abuse she suffered in the years leading up to her brutal killing at the hands of her estranged husband, airline captain Robert Brown.\nWith Joanna’s quietly weeping mother sitting next to her, Hetti told of the many anguished phone calls she shared with her friend who was also threatened at knifepoint by Brown, desperate to retain a slice of his wealthy wife’s fortune.\nAfter months of harassment and intimidation he battered the ‘warm, caring and selfless’ mother her over the head with a hammer he had hidden inside his children’s homework bag. The youngsters, aged just ten and nine, were in the house when their mother was killed.\nAfter hearing the shocking account, Camilla immediately walked over to Joanna’s clearly emotional mother, Diana, to comfort her and vowed she would do anything within her power ‘to help’.\nCamilla spent time chatting to Diana Parkes, who daughter Joanna was killed by her husband Robert","url":"https://www.dailymail.co.uk/femail/article-3420776/Charles-Camilla-charmed-little-girl-hands-Duchess-bunch-flowers-tour-world-s-oldest-surviving-grand-music-hall.html"}
