{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 01:31:16","date_modify":"2018-10-23 01:31:16","date_publish":"2017-04-26 11:58:04","description":"The 14,500square-foot compound in Toronto features purple carpeting and Prince's logo as reminders that the home once belonged to the Purple Rain megastar, who died in 2016.","filename":"data/vaneerConsumption/PrinceshomeinTorontogoesupforsalefor13million.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F299000000578-0-image-a-78_1493204095962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446996_Prince-s-home-Toronto-goes-sale-13million_1540258276.html","title":"Prince's home in Toronto goes up for sale for $13million","title_page":"Prince's home in Toronto goes up for sale for $13million  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Prince's former Toronto home, which he lived in during the early 2000s, is on the market for $13million (£10million).\nThe Purple Rain megastar's former home was last listed for $9.5million (£7.4million) two years ago, before his death.\nThe 14,500square-foot compound features purple carpeting and Prince's symbol as reminders that the home once belonged to the musician.\nA 14,500square-foot compound in Toronto that once belonged to megastar Prince has gone on sale for $13million (£10million)\nIn one room of the home, there is a statue in the shape of the logo - also known as the Love Symbol - Prince changed his name to in the 1990s\nSome rooms in the home feature purple carpeting as a reminder that the Purple Rain megastar once lived in the house\nThe Purple Rain megastar's former home was last listed for $9.5million (£7.4million) two years ago, but was taken off the market shortly after his death\nWhile the home was listed for sale two years ago, the seller took it off the market shortly after Prince's death because he didn't want it to look like he was capitalizing on the star's death\nStill in the home is an iron-type desk where Prince, who died of a painkiller overdose in April 2016, wrote and read.\nWhile the home was listed for sale two years ago, the seller took it off the market shortly after Prince's death because he didn't want it to look like he was capitalizing on the star's death, TMZ reported.\nBut now, a year after Prince's death, the home - which sits in the same neighborhood as one of rapper Drake's homes - is back on sale.\nPrince lived in the home from 2001 to 2006 when he was married to his second wife, Canadian Manuela Testolini. It is not believed that the couple ever lived in the home full time.\nFiles from the couple's divorce were unsealed earlier this year, showing that they lived a luxurious lifestyle that included spending $50,000 per party after major awards ceremonies.\nThe ranch-style home sits in the same Toronto neighborhood as a home owned by rapper Drake, who is from the Canadian city\nDespite having the Toronto home for several years, Prince was known for spending much of his time at his mansion in Minnesota\nThe stunning home features wood floors, fire places and floor-to-ceiling windows that give residents a nice view of the back yard\nPrince lived in the home from 2001 to 2006 when he was married to his second wife, Canadian Manuela Testolini. It is not believed that the couple ever lived in the home full time\nThe documents do not give financial details of the final divorce settlement, but Testolini did receive a house in Toronto worth about $6million at the time and a Lexus automobile, the Minneapolis Star Tribune reported.\nThe files show Testolini said the couple threw lavish parties after the Oscars and the Grammys with Testolini hiring a $5,000-a-day stylist to do her hair and makeup.\nThe records also show the couple would spend $50,000 on food, drinks and decor for each party.\nTestolini had objected to the records being unsealed, claiming the disclosure would put her and her family at risk. Her attorney did not immediately respond to requests for comment.\n'We had accounts at boutiques including Gucci, Versace and Valentino. We had accounts at Saks. There was never any restriction on (Prince's) or my spending,' Testolini said in the divorce files.\nPrince and Testolini met when she was a consultant for his charity, Love 4 One Another. They married on Christmas Day in 2001\nBut after the couple's divorce in 2007, Testolini received a Toronto home in the settlement. It is unclear if it is the home that is on the market now\nThe documents do not give financial details of the final divorce settlement, but Testolini did receive a house in Toronto worth about $6million at the time and a Lexus automobile\nLarge bedrooms in the one-story home feature windows looking out into the home's backyard, as well as several sitting areas\nThe records also show that Prince locked Testolini out of their home in Chanhassen, Minnesota, which was not at his Paisley Park recording complex, in May 2005.\nPrince and Testolini met when she was a consultant for his charity, Love 4 One Another, the documents showed.\nThey married on Christmas Day in 2001. The couple's divorce was granted in 2007.\nTwo years after their divorce, Testolini claimed Prince had not returned several personal items, including copies of videos he made based on two songs he had written for her.\nHe also had not returned jewelry, including a Tiffany gold and diamond earring set, as well as photographs, memorabilia and scrapbooks. The items were valued at $185,000.\nPrince was representing himself at that time and did not respond to the court.\nThe musician was previously married to backup dancer Mayte Garcia.\nAlso in the home is an exercise room that has several weight machines, a television, and what appears to be a sauna room\nWhat appears to be the master bedroom in the home features a large tub, a stand-up shower, two sinks and plenty of storage space","url":"https://www.dailymail.co.uk/news/article-4446996/Prince-s-home-Toronto-goes-sale-13million.html"}
