{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 03:00:31","date_modify":"2018-10-23 03:00:31","date_publish":"2017-03-16 13:38:52","description":"Zara and Mike Tindall looked to be in a particularly jovial mood as they celebrated a win with friends including Dolly Maude at Cheltenham on Thursday afternoon.","filename":"data/vaneerConsumption/PrincessAnneZaraandMikeTindallatCheltenham.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/17/3E57102600000578-0-image-a-79_1489685269001.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320178_Zara-Tindall-arrives-Cheltenham_1540263631.html","title":"Princess Anne, Zara and Mike Tindall at Cheltenham","title_page":"Princess Anne, Zara and Mike Tindall at Cheltenham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the keenest royal racegoer around, and today Zara Tindall was in a particularly jovial mood today as she celebrated a win at Cheltenham.\nZara, 35, joined her mother Princess Anne, husband Mike and a bevvy of female friends at the Gloucestershire racecourse on St. Patrick's Thursday.\nWarding off the chill in a bulky faux fur tippet, the Queen's granddaughter oozed glamour in a double-breasted brown coat topped off with a statement hat and patent tote.\nScroll down for video\nOur luck's in! Zara and Mike celebrate with friends including Dolly Maude, third left. The group looked to be in excellent spirits on day three of the annual racing event at Prestbury Park\nIt must run in the family! Zara's mother Princess Anne, 66, looked to be in her element today as she cheered on the horses from the VIP enclosure at Cheltenham\nIt was smiles all around on the third day of the Cheltenham Festival, with Princess Anne, her daughter Zara and Zara's husband Mike Tindall all snapped in a celebratory mood\nA grinning Zara Tindall makes a stylish entrance on her third appearance at Cheltenham this week. The royal topped off her racing look with a Swarovski-adorned hat and fur tippet\nHer show-stopping hat, from Rosie Olivia Millinery, was a £565 velour trilby trimmed with Swarovski crystals.\nThe mother-of-one looked to be in good spirits as she made her way to the VIP Club Enclosure at Prestbury Park, where tickets cost around £90 per person, with companions including Dolly Maude.\nMeanwhile Anne, 66, looked elegant in a green tweed midi coat and calf length boots which she teamed with a trilby embellished with a gold flower.\nTo brighten up her look, she tied a red scarf around her neck and added a gold racing horse brooch to really look the part.\nSelfie time! The group pose for a group photo with Mike, right, inside the enclosure. There is no dress code at Cheltenham, but organisers note that fancy dress is strictly banned\nZara was joined by her mother, Princess Anne, who also donned a trilby and tweed coat as she chatted to Andrew Parker Bowles, the former husband of the Duchess of Cornwall\nThe Princess Royal, 66, added a splash of colour with a vibrant red scarf underneath her coat\nThe royal kept it simple with a pair of slouchy suede boots and black leather gloves\nZara, who is 16th-in-line to the throne, glowed as she returned to the racecourse today for the third time in a week to partake in a day of show jumping, cross country riding and dressage.\nOnce inside the venue's most exclusive enclosure she was joined by a host of VIP guests including her mother, Princess Anne, husband, rugby player Mike Tindall, and Andrew Parker Bowles - the former husband of the Duchess of Cornwall.\nThursday kicked off with the The Novices’ Chase at 1.30pm and will finish just after 5.30pm with the Challenge Cup Handicap Steeple Chase.\nThe stylish royal ensured all eyes were on her as she made her way to the VIP enclosure\nZara, 35, threw a faux fur tippet on over her brown wool coat to ward off the springtime chill\nThe royal, who competed at the Tweseldown Horse Trials in Hampshire just days ago, is a keen equestrian who competed in the London 2012 Olympic Games.\nShe fearlessly took on huge jumps when she joined fellow equestrians in competing at the Tweseldown Horse Trials in Hampshire on Sunday.\nZara displayed her athletic prowess as she competed in various rounds at the trials on two of her horses - Gladstone and Castle Black II.\nHere come the girls! Zara joins friend including Dolly Maude, second right, on Thursday\nZara can't help but crack a smile as he friend Dolly, second right, doubles over laughing\nThe fashion-conscious group were no doubt looking forward to a day of champagne and betting\nZara is a serious international equestrian competitor, having garnered a gold medal at the European Eventing Championships in 2005 in addition to attaining a silver medal at the World Equestrian Games in 2006.\nZara and her former England Rugby captain Mike Tindall are a famously sporty and health-focused couple.\nWhile her female friends kept it traditional with statement fascinators, Zara, second left, opted for a broad-rimmed hat adorned with a beaded floral decoration\nThe keen equestrian, who competed at the Tweseldown Horse Trials in Hampshire just days ago, looked to be in good spirits as she arrived at the racecourse for St Patrick's Thursday\nThe royal, who is 16th in line to the throne, first met Mike 13 years ago, in Sydney, Australia during the 2003 Rugby World Cup - after being introduced by Prince Harry.\nThe Queen gave her consent to their marriage in May 2011 and their wedding was held on July 30, 2011 at the Canongate Kirkin Edinburgh, Scotland.\nAnd now they live together in a cottage on her mother's Gloucestershire estate, Gatcombe Park, with their daughter Mia Grace.\nThe ladies appeared to get swept away in the excitement of the fixtures while Zara, centre, managed to maintain her composure\nAndrew Parker Bowles, left, joined Zara and the royals as the group sipped on champagne in the VIP enclosure","url":"https://www.dailymail.co.uk/femail/article-4320178/Zara-Tindall-arrives-Cheltenham.html"}
