{"authors":["Emma Glanfield For Mailonline","Rebecca English","Royal Correspondent For The Daily Mail"],"date_download":"2018-10-22 21:08:23","date_modify":"2018-10-22 21:08:23","date_publish":"2016-01-11 00:24:48","description":"Prince William, 33, has now finally embraced his receding hairline after opting for a new tightly-cropped hairdo as he attended a church service in Sandringham, Norfolk, with Kate and the Queen.","filename":"data/vaneerConsumption/PrinceWilliamfinallyembraceshisbaldpatchwithnewcroppedhairstyle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/3000725900000578-0-image-a-2_1452471618146.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393149_William-gets-chop-Prince-finally-embraces-bald-patch-new-tightly-cropped-hairstyle_1540242503.html","title":"Prince William finally embraces his bald patch with new cropped hairstyle","title_page":"Prince William finally embraces his bald patch with new cropped hairstyle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For many years he's been sporting a growing bald patch which has been covered only by a few tufts of hair.\nBut 33-year-old Prince William has now finally embraced his receding hairline after opting for a new tightly-cropped hairdo.\nThe Duke of Cambridge showed off his new, streamlined locks as he turned out with his wife, Kate, and his grandmother, Her Majesty the Queen, for a traditional Sunday morning service at Sandringham.\nScroll down for video\nPrince William, 33, has now finally embraced his receding hairline after opting for a new tightly-cropped hairdo as he attended church in Sandringham, Norfolk, with Kate and the Queen. Pictured: Kate and William watch the wreath laying after attending the Sunday service\nThe Duke of Cambridge showed off his new streamlined locks as he turned out with his wife, Kate (pictured together), and his grandmother, Her Majesty the Queen, for a traditional Sunday morning service at Sandringham, Norfolk, to mark the anniversary of the Gallipoli campaign\nKate, who celebrated her 34th birthday yesterday, looked calm and collected as she arrived with her husband and his newly shaved locks\nThe Duchess of Cambridge smiles broadly at her husband, Prince William, as he shows off his new tightly-cropped hairdo at the service\nPrince William protectively places a hand behind his wife Kate's back as she enters the church service in Sandringham ahead of him\nAfter celebrating Kate's 34th birthday in Norfolk over the weekend, the royal couple arrived to a packed St Mary Magdalene Church for a service to mark the 100th anniversary of the end of the doomed First World War Gallipoli campaign, which saw 58,000 Allied troops lose their lives in their bloodiest battle on foreign soil.\nWhile Kate had her hair swept back in an elegant chignon, William, appeared to have had his almost entirely shaved off.\nThe prince's decision to go for a very short and back and sides prompted approval on social media. 'At last! Nothing worse on a guy than keeping thinning hair long. Accept the inevitable!' said one.\nThe Duchess dusted off the same outfit she had worn to the church on Christmas Day - a Michael Kors tweed suite, along with a Lock & Co hat, Aquatalia boots and Kiki McDonough earrings.\nHer mother, Carole, 60 – who also joined the royal contingent - looked elegant in a mid-length skirt and boucle jacket with a fur stole and 'Jackie O'-style pillbox hat.\nMeanwhile, her sister, Pippa, 32, wore a grey coat over an extremely short dress, showing off her enviable tanned legs.\nJames Middleton, however, looked older than his 28 years with his by now familiar bushy beard, and slightly spoiled the family's scene-stealing appearance by slouching along with his hands firmly in his pockets.\nThe Duke and Duchess of Cambridge appear subdued as they pay their respects to those who were killed in the Gallipoli campaign\nThe Duchess of Cambridge is seeing curtsying the Queen after watching Her Majesty lay a wreath in memory of those who lost their lives\nThe royal couple helped mark the end of the Gallipoli campaign, which was launched in 1914 and advocated by William Churchill\nThe presence of Kate's nearest and dearest at church shows just how much the Queen has embraced them, in a way that the royal family hasn't done with previous royal brides.\nThe Queen is known to be fond of Michael and Carole, having invited them to dine privately with her at Windsor Castle and attend Royal Ascot, believing them to have handled the spotlight thrust on them by their daughter's marriage with 'impeccable dignity'.\nBut she also recognises her grand-daughter-in-law's closeness to parents and siblings to be a crucial component in the success of her marriage to William.\nYesterday, the entire Middleton clan filed into St Mary Magdalene Church after walking down in regal manner from the monarch's private home, Sandringham House with Prince Philip and William.\nThey did not, however, join the Queen - who was wearing a lilac coloured coat and matching - for her brief official engagement after the 50-minute service.\nInstead, William and Kate watched alone as the monarch and her husband paid tribute to the Sandringham staff whose deaths in the Gallipoli campaign in the First World War are still shrouded in mystery.\nKate looks chic in her winter suit as she smiles to waiting wellwishers after the Sunday service at the church of St Mary Magdalene on the Sandringham Estate in Norfolk\nThe Queen and Duke of Edinburgh were joined by the Duke and Duchess of Cambridge after morning worship at yesterday's service\nThe Duchess of Cambridge appeared sombre as she remembers those who lost their lives during the disastrous campaign 100 years ago\nA minute's silence was held in memory of those who lost their lives after the Last Post was played by a bugler.\nThe Queen and Prince Philip then stepped forward to place wreaths on the stone memorial,\nWilliam and Kate spent few minutes afterwards chatting to members of the Royal British Legion, old soldiers and the families of soldiers who fought.\nThe ceremony was a poignant one as more than 100 gardeners, gamekeepers, farm labourers and servants from the Sandringham estate fought in the ill-fated campaign as members of the Norfolk Regiment\nSeventeen of the staff including their senior officer Captain Frank Beck, 54, who was the Sandringham land agent, were listed as missing in action after an attack on Turkish troops on August 12, 2015.\nThe fate of the men became one of the enduring mysteries of the war and was known to have left the dowager Queen Alexandra and the Queen's grandfather, King George V, deeply upset at the loss of their workers, many of whom they knew personally.\nThe BBC drama All The King's Men, screened in 1999 and starring David Jason as Captain Beck, suggested that some were actually executed by Turkish soldiers.\nPrince William appears emotional as he and his wife Kate help remember those who lost their lives in the fateful battle 100 years ago\nThe Duchess wore her signature smokey eye make-up and rosy blusher for the occasion. She was joined by her husband, Prince William\nThe Queen (front left) and the Duke of Edinburgh (second left) arrive with the Duke and Duchess of Cambridge for a service to mark the 100th anniversary of the end of the doomed First World War Gallipoli campaign at the Sandringham war memorial cross, Norfolk\nThe Duchess extends a hand as she greets well-wishers and other guests at the service in Sandringham, Norfolk, yesterday morning\nKate wore her hair in a sophisticated braided low chignon and accessorised her pared-back look with a black hat and yellow drop earrings\nWhile the royals laid wreaths to pay their respects to the fallen, the Duchess's family walked back to Sandringham - presumably for lunch with the party when they returned.\nWilliam and Kate were hosting a country house party at Anmer Hall, their nearby Georgian mansion, at the weekend to mark the Duchess's 34th birthday on Saturday.\nThis is believed to have included a shooting party on the Queen's Sandringham.\nIt was likely to have been a jolly affair, for as well as Kate's family a host of pals had crammed into ten-bedroom Anmer including Kate's best friend Sophie Carter, a godparent of Princess Charlotte.\nFor church yesterday, the couple's children, Prince George, who started nursery this week, and Princess Charlotte had been left behind with their nanny, Maria Borrallo.\nThe Duke and Duchess of Cambridge are seeing arriving at church, left, and Prince William proves to be ever the gentleman as he holds the door open for his wife and lets her pass before him\nHighlights from Kate's 2015 public engagements include her inaugural Buckingham Palace state banquet - in honour of China's visiting President Xi Jinping - and her first visit to a prison, HMP Send near Guildford, Surrey\nThe Duke and Duchess of Cambridge leave the Sandringham war memorial cross where the Queen and the Duke of Edinburgh laid wreaths to mark the 100th anniversary of the end of the doomed First World War Gallipoli campaign\nThe Duke and Duchess of Cambridge join Her Majesty the Queen in laying wreaths to marks the anniversary of the final withdrawal","url":"https://www.dailymail.co.uk/femail/article-3393149/William-gets-chop-Prince-finally-embraces-bald-patch-new-tightly-cropped-hairstyle.html"}
