{"authors":["Angelica Florio"],"date_download":"2018-10-31 00:01:54","date_modify":"2018-10-31 00:01:54","date_publish":"2018-10-28 20:35:56","description":"The past couple weeks have been an exciting time for royal watchers, as the Duke and Duchess of Sussex embarked on their 16-day tour of Australia, Fiji, Tonga, and New Zealand. To begin their last leg of the trip, Prince Harry and Meghan Markle…","filename":"data/vaneerConsumption/PrinceHarryWasRewardedATopMilitaryHonorInNewZealandForAHeartwarmingReason.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/325a83a3-73bc-4c1a-9732-6f751705e38f-getty-1054546666.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_prince-harry-was-rewarded-a-top-military-honor-in-new-zealand-for-a-heartwarming-reason-13010425_1540944114.html","title":"Prince Harry Was Rewarded A Top Military Honor In New Zealand For A Heartwarming Reason","title_page":"Prince Harry Was Rewarded A Top Military Honor In New Zealand For A Heartwarming Reason","title_rss":"NULL","source_domain":"bustle.com","text":"The past couple weeks have been an exciting time for royal watchers, as the Duke and Duchess of Sussex embarked on their 16-day tour of Australia, Fiji, Tonga, and New Zealand. To begin their last leg of the trip, Prince Harry and Meghan Markle arrived in Wellington, New Zealand on Oct. 28 where they visited the Pukeahu National War Memorial Park. At the war memorial, Prince Harry received New Zealand’s highest military honor, a medal called the \"Badge in Gold,\" to honor the work Prince Harry has done with injured veterans. It was a proud moment for both of the royals, and Meghan got to participate in the ceremony by pinning the medal to Harry's suit, People reports.\nRoyal New Zealand Returned and Services’ Association president BJ Clark awarded Prince Harry with the medal, and in a picture shared by the Kensington Palace Twitter account, you can see Meghan Markle beaming proudly during the ceremony. The medal that Prince Harry received came at the perfect time, seeing as the Invictus Games just ended on Oct. 27 in Sydney, Australia, and that special event demonstrates Prince Harry's dedication to promoting rehabilitation for injured veterans.\nIn 2014, Prince Harry founded the Invictus Games, a Paralympic-like even in which injured service members compete. On the Games' website, the Invictus Games Foundation is described as one that \"promotes the importance of sport and physical activity in the rehabilitation journey of wounded, injured and ill service members and veterans.\" Both Harry and Meghan spoke at Sydney's Invictus Games 2018 closing ceremony before boarding the plane — along with New Zealand's Invictus Games team — to go to New Zealand.\nUpon arrival in New Zealand, the Duke and Duchess of Sussex were treated to a traditional Māori greeting called Haka Pōwhiri, which Kensington Palace's Twitter translates to \"the Dance of Welcome.\" But before Meghan and Harry were welcomed, they were challenged in what's called the Wero, which the Kensington Palace's Twitter states, determines \"whether visitors have come in peace or with hostile intent.\" For this one, Prince Harry took part in the Māori's traditional ceremony, and a picture of him crouching on the ground in his suit was posted by the Kensington Palace's Twitter account.\nAs much well-deserved attention as Prince Harry received on the royal couple's first day in New Zealand, Meghan Markle later took the spotlight at a celebration of the country's 125th anniversary of universal female suffrage. Markle commended New Zealand for becoming the first country in the world where all women were allowed to vote. \"Women's suffrage is about feminism, but feminism is about fairness,\" Markle said, according to the BBC. As People notes, this was the third speech that Markle gave on the royal tour, and it's been a great chance for the world to see how well the Duchess of Sussex fulfills her royal duties. Most would probably agree that she's been flawless.\nBetween Prince Harry receiving New Zealand's highest military honor and Meghan Markle's empowering speech, it seems that the Duke and Duchess's royal tour is ending on a high note. If only it could go on forever.","url":"https://www.bustle.com/p/prince-harry-was-rewarded-a-top-military-honor-in-new-zealand-for-a-heartwarming-reason-13010425"}
