{"authors":["Abc News","More Guy"],"date_download":"2018-10-30 00:56:09","date_modify":"2018-10-30 00:56:09","date_publish":"2018-10-29 08:33:49","description":"“He will be missed by all fans of the sport,\" William said of the Leicester City soccer club owner.","filename":"data/vaneerConsumption/PrinceWilliamamongthosepayingtributetobelovedLeicestersoccerclubownerkilledinhelicoptercrash.json","image_url":"https://s.abcnews.com/images/International/vichai-srivaddhanaprabha2-rt-ml-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/International_prince-willia_efbc39ff6187fe9feca6506e868d673c_story_id=58824150_1540860969.html","title":"Prince William among those paying tribute to beloved Leicester soccer club owner killed in helicopter crash","title_page":"Prince William among those paying tribute to beloved Leicester soccer club owner killed in helicopter crash - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"British Prime Minister Theresa May and Prince William have led tributes to the owner of a famous Leicester soccer club who died in a helicopter crash after watching his team play.\nInterested in Royal Family? Add Royal Family as an interest to stay up to date on the latest Royal Family news, video, and analysis from ABC News. Add Interest\nLeicester City owner Vichai Srivaddhanaprabha died along with four others when the helicopter crashed in a parking lot outside the club's stadium just after 8.30 pm on Saturday, the soccer club said in a statement.\nFormal identification has not yet taken place, but the other victims are believed to be two members of his staff, Nusara Suknamai and Kaveporn Punpar, and the private pilots Eric Swaffer and Izabela Rosa Lechowicz, police said.\nPrince William, the Duke of Cambridge, was among the most high-profile figures to express his condolences over the weekend, saying in a statement that he was “lucky enough to have known Vichai for several years.”\n“My thoughts today are with the family and friends of Vichai Srivaddhanaprabha and all the victims of the terrible crash at Leicester City Football Club,” he said. “He will be missed by all fans of the sport and everyone lucky enough to have known him.”\nA statement from The Duke of Cambridge on the tragic helicopter crash at Leicester City Football Club pic.twitter.com/UVQvzpUxBv — Kensington Palace (@KensingtonRoyal) October 29, 2018\nPrime Minister May echoed the prince’s sentiments.\n“My thoughts are with those family, friends and supporters connected to the tragic crash outside Leicester City’s stadium on Saturday night,” she said.\nMy thoughts are with those family, friends and supporters connected to the tragic crash outside Leicester City’s stadium on Saturday night. The outpouring of grief is a testament to how many people’s lives were touched by those on board. — Theresa May (@theresa_may) October 29, 2018\nBoth Srivaddhanaprabha's son and wife left a wreath for Vichai, a Thai billionaire, and the other victims at the club's stadium on Monday.\nA number of Leicester City’s current playing staff, including Ben Chilwell, Jamie Vardy and Kasper Schmeichel, have also expressed their shock over social media.\nStruggling to find the right words....but to me you are legend, an incredible man who had the biggest heart, the soul of Leicester City Football Club. Thank you for everything you did for… https://t.co/FzTaXVejUg — Jamie Vardy (@vardy7) October 28, 2018\nAn investigation into the crash has been launched by the Air Accident Investigation Branch, police said. The inspectors will look into the flight data and engineering, operational and human factors that may have been involved in the incident, although their work may be made more difficult by a fire after the crash that damaged the helicopter’s in-flight recorder.\nThough the details will not be officially known until that inquiry is complete, an eyewitness told Sky News that the accident could have been much worse were it not for the “heroic” actions of the pilot.\nSky Sports News cameraman Dan Cox was walking through the parking lot when he saw the helicopter overhead. He recalled that the aircraft was spinning and out of control.\nMichael Regan/Getty Images, FILE\n\"I don't know how the pilot did it, but he seemed to manage to slow down the spinning rotation and it drifted off into the corner part of the car park,” he said. “It could have been so much worse if the pilot hadn't done that.\"\nVichai Srivaddhanaprabha made his fortune by founding duty-free empire King Power in Thailand in 1989. The company became the biggest duty-free retailer in the country, and at the time of his death he was Thailand’s fifth-richest man with a net worth of $4.9 billion, according to Forbes.\nSrivaddhanaprabha became a much-loved figure in the Leicester community after buying the football club in 2010, according to the club’s website. The club were promoted to the Premier League in the 2013-14 season. It then miraculously won the Premier League in 2015-16, despite being 5000 to 1 outsiders, in one of the greatest underdog stories in soccer history.\nPhil Holloway, the editor of Leicester Fan TV, told ABC News that “to say the fans of Leicester City are shattered is an understatement.\"\n\"We had never dared to dream before Vichai took over our club,\" he said. \"He has been an inspiration to us all. He has transformed our club from a local sports team into a global brand.\"\nPaul Ellis/AFP/Getty Images\nSupporters have been invited to pay their respects at the King Power stadium.\n“The primary thoughts of everyone at the Club are with the Srivaddhanaprabha family and the families of all those on-board at this time of unspeakable loss,” the club said in a statement.","url":"https://abcnews.go.com/International/prince-william-paying-tribute-beloved-leicester-soccer-club/story?id=58824150"}
