{"authors":["Siofra Brennan","Rebecca English For Mailonline"],"date_download":"2018-10-23 00:08:54","date_modify":"2018-10-23 00:08:54","date_publish":"2016-01-29 12:47:33","description":"Prince Harry, 31, lent his support to Invictus Games hopefuls at athletics trials held at the University of Bath Sports Training Village today, cheering on injured service personnel and veterans.","filename":"data/vaneerConsumption/PrinceHarrycheersonathletestryingoutfor2016InvictusGames.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B20C6A00000578-0-image-a-31_1454069094959.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422608_Prince-Harry-cheers-athletes-trying-2016-Invictus-Games_1540253334.html","title":"Prince Harry cheers on athletes trying out for 2016 Invictus Games","title_page":"Prince Harry cheers on athletes trying out for 2016 Invictus Games | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's a cause that's close to his heart, and today Prince Harry lent his support to athletes competing for a spot in the 2016 Invictus Games.\nThe Royal, 31, has been the driving force behind the Games, first staged in the UK in 2014 to great acclaim from the competitors and spectators.\nThis morning he arrived at the University of Bath Sports Training Village to cheer on the injured servicemen, women and veterans competing in athletics trials.\nScroll down for video\nPrince Harry, 31, lends his enthusiastic support to athletes at the team trials for the Invictus Games Orlando, held at the University of Bath Sports Training Village\nSome onlookers seemed to be feeling the cold, but Harry was too busy getting to know the participants to worry about the winter chill\nThe Royal looked in good spirits as he shook hands with a group of runners who were preparing for their race on the athletics track, with some wounded participants competing on prosthetic blades.\nHarry was even seen patting one man on the stomach, possibly testing out whether his training had given him a six-pack.\nThe runners seemed to take it in good spirits, and laughed as they engaged in lively conversation with the Prince who himself was in the Army until last year.\nHarry also joined a group of spectators on the sidelines to watch as a female competitor took part in a trial for the shot put.\nThe Royal looked in good spirits as he shook hands with a group of runners who were preparing for their race on the athletics track\nHarry was even seen patting one man on the stomach, possibly testing out whether his training had given him a six pack\nThe runners seemed to be getting on famously with Harry as they roared with laughter during the conversation\nThe caring royal came to the aid of competitor Anna Pollock after her wheelchair blew over in strong wind.\nRAF medic Anna, 33, said: 'I saw him and thought I've got to take the opportunity to ask for a picture.\n'I was just putting my gloves back on and sat back in my chair when the wind took me over.\n'Harry said to me \"What did you do that for?\" I said, \"To show you how not to do that\".\n'He was so lovely to help me and he gives so much. He makes all the lads and the lasses feel important.'\nAnna, from Middlesborough, was competing in the 200m, 400m and 1500m cycling after a spontaneous spinal bleed left her partially paraplegic.\nRAF medic Anna Pollock, 33, from Middlesborough, was competing in the 200m, 400m and 1500m cycling after a spontaneous spinal bleed left her partially paraplegic\nThe caring royal came to Anna's aid after her wheelchair blew over in strong wind\nAnna joked that she'd been demonstrating 'what not do to' for the Prince\nOther hopefuls were training ahead of the wheelchair tennis trial, which take place later on today.\nNathan Cumberland, 31, who trained with Harry for a tour of Afghanistan in 2009 said: 'It's always good to see the ginger muppet.'\nFellow red-head Nathan said: 'He doesn't have to come here, but he does and that's great.\n'It gives everyone a boost. He's one of the lads - he's been there and done it.'\nHe added: 'I'm giving tennis a go today. Normally I do shot and power lifting but I thought I'd try some seated volleyball and tennis.'\nHarry crouched down by the net for a pep talk with tennis players who are taking part in trials later today\nOne hopeful commented that it 'gives everyone a boost' when Harry lends his support\nThe Prince helped out by catching a ball that had bounced off the court\nThe down-to-earth royal happily posed for a photograph, slinging his arm around the shoulder of a woman wearing a Help For Heroes hoodie.\nAnd while some spectators looked to be a little chilly, Harry showed no sign he was feeling the cold as he gesticulated while chatting with another competitor.\nClearly enjoying the chance to observe the trials, he was seen clapping and shouting encouragement from the sidelines.\nThe Prince also gave a rousing speech to cement his support for the competitors.\n'Guys, a lot of different faces here,' he began. 'We have taken it to a whole new level by going to a different country, to Orlando, where the weather is much nicer.\nHarry said that this year's games would take thing to 'the next level' and said there was going to be huge support for the athletes in America\nHarry joked that competitors were probably aiming for a spot at the games so they could enjoy better weather in Florida and visit Disneyland\nHarry asked the athletes to be ambassadors for what he called the 'Invictus spirit' to spread the word about the games\n'That's why most of you are here, either that or you've got an obsession with Disneyland. And looking at some you, that's probably the case,\" he said to laughter.\n'The excitement is building not just here but also across the pond. You will unbelievably amazed by the amount of support there is out there for you.\n'It's not necessarily about selection but it's about the whole piece. The way it's fixing you, whether it's mental or physical. To be able to be in this process. That's what it's all about for us, what it always has been about.\n'The chance to bring you all together so you share some stories and some banter and get yourself into a bit of trouble.'\nAnd he asked them to be ambassadors for what he called the 'Invictus spirit' to spread the word.\nThe Invictus Spirit he said was about 'selfless commitment, about heroic activities that a lot of you have been in in some shape or form.'\nAnd in his unscripted address, Harry also took the chance to give his own tribute to explorer Henry Worsley who died while trying to cross Antarctica [DASH] an expedition that was raising money for the Endeavour Fund that backs the games.\nHe called former army officer Worsley, who died of organ failure after being airlifted to Chile, the 'definition of selfless commitment'.\nThe Invictus Games aim to challenge wounded, sick or injured service personnel, and those who have left the Armed Forces, to strive for sporting excellence\nHarry cheered on the hopefuls who are competing for one of the 100 places available across 10 different sports\nThe Prince, who left the Army last year, is passionate about helping ex service personnel and has put initiatives like The Invictus Games at the forefront of his charity work\n'He put his life on the line,' Harry said. 'This person was raising funds for he Endeavour Fund so people like you can do amazing things and rediscover yourselves. Thanks to him we have huge options for more and more people.'\nHe concluded by saying: 'Guys, just look forward to it. It's going to be fantastic, it's going to be epic. I'll be out there but the most important thing is enjoy it, make the most of it and spread the word and appreciate how much support there is out there.'\nAthletes trained hard for the three-day trials which could earn them selection for the Games - a Paralympic style championship which will be held at the ESPN Wide World of Sports Complex in Orlando, Florida this May.\nThe Games aim to challenge wounded, sick or injured service personnel, and those who have left the Armed Forces, to strive for sporting excellence.\nPrince Harry launched the latest Games during a visit to the US last year, and even got the backing of President Barrack Obama.\nThe Prince launched the latest Games during a visit to the US last year, and even got the backing of President Barrack Obama\nThe Games - a Paralympic style championship - will be held at the ESPN Wide World of Sports Complex in Orlando, Florida this May\nThe trials are being run by Help for Heroes with support from the Ministry of Defence and The Royal British Legion\nDuring a White House meeting, the American leader praised the sporting event warmly.\nHe described it as: 'An initiative that is bringing together wounded warriors from around the world under the leadership of Prince Harry and others, to make sure we see not simply the sacrifices they've made, but also the incredible contributions, strength and courage they continue to display.'\nThe trials are being run by Help for Heroes with support from the Ministry of Defence and The Royal British Legion.\nThe down-to-earth royal happily posed for a photo, slinging his arm around the shoulder of a woman wearing a Help For Heroes hoodie\nHarry also joined a group of spectators on the sidelines to watch as a female competitor took part in a trial for the shot put\nThe men and women taking part will compete for one of the 100 places available on the UK team across ten sports: athletics, archery, wheelchair basketball, road cycling, powerlifting, indoor rowing, wheelchair rugby, swimming, sitting volleyball and wheelchair tennis.\nTeam members are judged on performance, ability and their commitment to training. How taking part can benefit as part of their recovery is also taken into consideration.\nToday marks 100 days to go until the start of the Invictus Games, which will be held from May 8 to 12.","url":"https://www.dailymail.co.uk/femail/article-3422608/Prince-Harry-cheers-athletes-trying-2016-Invictus-Games.html"}
