{"authors":["Charlie Moore For Mailonline"],"date_download":"2018-10-23 01:17:19","date_modify":"2018-10-23 01:17:19","date_publish":"2017-03-10 09:09:31","description":"The socialite who battled a high-profile cocaine addiction died aged 45 in her London home in January. Prince Charles led the tributes to the former It Girl whose father taught him how to ski.","filename":"data/vaneerConsumption/PrinceCharlesbrokenupbyTaraPalmerTomkinsondeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21C57A00000578-0-image-a-2_1489136324154.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300486_Prince-Charles-broken-death-TPT_1540257439.html","title":"Prince Charles 'broken up' by Tara Palmer Tomkinson death","title_page":"Prince Charles 'broken up' by Tara Palmer Tomkinson death | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Prince Charles was 'broken up' by the death of close family friend Tara Palmer-Tomkinson, Dame Joan Collins has revealed.\nThe socialite who battled a high-profile cocaine addiction died aged 45 in her London home in February.\nPrince Charles led the tributes to the former It Girl whose father taught him how to ski, saying he was 'deeply saddened' by her death.\nClose friends: Prince Charles was 'broken up' by the death of close family friend Tara Palmer-Tomkinson. The pair are pictured at a reception in 2003\nAnd now actress Dame Joan, 83, has revealed he was visibly distraught in the wake of the tragedy.\nShe told The Sun's Dan Wootton: 'It was terrible, terrible news. A lot of people were broken up. Prince Charles, too.\n'Shortly afterwards, I went to a thing for The Prince’s Trust and said to him: \"I’m so sorry, Sir, about your friend Tara\". And he looked very sad. She was his godchild.'\nTara's father Charles Palmer-Tomkinson was a former British Olympic skier who instructed Charles.\nIn 1988 her mother Patti was skiing in the Swiss Alps with the Prince when their party was hit by an avalanche which killed the Queen’s former equerry, Major Hugh Lindsay, and left Mrs Palmer-Tomkinson with serious leg injuries.\nHer parents remained close friends with the Prince of Wales and Duchess of Cornwall and she attended Prince William and Kate Middleton’s wedding.\nDame Joan Collins has revealed the Prince looked visibly distraught after Tara's death. The pair are pictured in 2016 at the launch of Dame Joan's book\nPalmer-Tomkinson, whose paternal great-great-grandfather, James Tomkinson, was a landowner and Liberal politician, once boasted she had kissed the Prince of Wales every day since the age of four.\nPalmer-Tomkinson said in November that she was being treated for a non-malignant growth in her pituitary gland and had expressed fears that she would die.\nWe are deeply saddened and our thoughts are so much with the family Prince Charles' and Camilla's tribute\nShe was diagnosed with the tumour last January after she returned from a ski trip and was also suffering with an auto-immune disease which had caused tiredness, joint pain and acute anaemia.\nShe was a regular on the London party scene in the 1990s and 2000s and made headlines for her social life, frequently appearing in the pages of both society and celebrity magazines.\nDuring her years in the spotlight, she was a newspaper columnist and television personality but also battled a high-profile cocaine addiction.\nAll smiles: Prince Charles and Prince Harry on a ski lift in Klosters with sisters Santa Palmer-Tomkinson and Tara Palmer-Tomkinson in 1997\nHaving a blast: Tara Palmer-Tomkinson shows off her skiing skills to Prince Charles and Harry\nFamed for her hard partying and exhibitionist streak, she appeared on reality TV series I’m A Celebrity … Get Me Out Of Here! in 2002 and came second to DJ Tony Blackburn.\nShe also made appearances on other TV shows including celebrity specials of Blind Date and A Place In The Sun.\nIn 2014 she said she had become a recluse after suffering a nervous breakdown and spoke about her battle with drug addiction on ITV show Jeremy Kyle: The Celebrity Specials.\nShe eventually quit drugs following a 35-day stint in an Arizona rehab clinic.\nPalmer-Tomkinson, whose great-great-grandfather was a landowner and Liberal politician, once boasted she had kissed the Prince of Wales every day. Left: Actress Denise Van Outen","url":"https://www.dailymail.co.uk/news/article-4300486/Prince-Charles-broken-death-TPT.html"}
