{"authors":["Ephraim Hardcastle For The Daily Mail"],"date_download":"2018-10-22 23:08:34","date_modify":"2018-10-22 23:08:34","date_publish":"2017-03-10 01:58:49","description":"Whatever the wedding date, it musn’t clash with the 70th wedding anniversary of the Queen and Prince Philip. And the Chancellor would prefer it on a Saturday to avoid disrupting productivity.","filename":"data/vaneerConsumption/PrinceHarrysengagementmightbeannouncedAugust4.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3BD910DD00000578-0-image-a-34_1489111026431.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-4299764_Prince-Harry-s-engagement-announced-August-4_1540249714.html","title":"Prince Harry's engagement might be announced August 4","title_page":"Prince Harry's engagement might be announced August 4 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sky’s Alastair Bruce, 56, provided an informed commentary at yesterday’s unveiling by the Queen of the new Iraq and Afghanistan wars memorial while the BBC’s Ben Brown, embarrassingly, talked over the playing of the National Anthem as HM arrived. Falklands veteran Bruce is the genuine article. An ex-Scots Guards lieutenant, he built a cairn at Sallachy, Sutherland, for his orderly, Guardsman James Reynolds, who died in the battle of Tumbledown.\nSky’s Alastair Bruce, 56, provided an informed commentary at yesterday’s unveiling by the Queen of the new Iraq and Afghanistan wars memorial\nPhilip Hammond met the Queen the night before his Budget. Other than the Prime Minister, the Chancellor is the only member of the Government to brief the Queen privately. I wonder if she questioned Hammond about his commitment to provide almost £37million a year for a decade to keep Buckingham Palace from falling down.\nI wonder if the Queen questioned Philip Hammond about his commitment to provide almost £37million a year for a decade to keep Buckingham Palace from falling down\nPrince Harry’s engagement to actress Meghan Markle might be announced on August 4. Why then? It’s Ms Markle’s 36th birthday, a date she shares with the late Queen Mother. (Possibly the only thing they share.) As for the wedding, the date musn’t clash with the 70th wedding anniversary of the Queen and Prince Philip on November 20. And Chancellor Philip Hammond would prefer it to be on a Saturday to avoid disrupting productivity.\nAugust 4 is Meghan Markle’s 36th birthday, a date she shares with the late Queen Mother.(Possibly the only thing they share.)\nRe Harry, he’s always Prince Henry of Wales – his birth name – in the Court Circular. Shouldn’t unstuffy Harry have a word with CC officials? The Princess Royal’s husband, Vice Admiral Sir Timothy Laurence, persuaded them to refer to him as Sir Tim. Why so? A naval source who served with Laurence says he was embarrassed to be likened by shipmates to comic Ronnie Corbett’s mummy’s-boy creation Timothy Lumsden, both pictured, in the BBC comedy show Sorry! It made its debut in 1981 when Laurence was serving on HMY Britannia.\nChef Marco Pierre White, 55, confesses: ‘I’m only into real food. I crave the ordinary. I don’t like 20-course little portions of fancy a la carte nonsense which are cold by the time they reach the table. Give me a ham sandwich any day.’ Now he tells us!\nNever shy about lauding his books, Jeffrey Archer, 76, now elevates himself into the pantheon of literary immortals, declaring: ‘I’m lucky to be a storyteller because they do survive longer than many established writers. For example, people are still reading (Alexandre) Dumas, (Charles) Dickens and Jane Austen, whereas there are several Nobel Prize winners who are out of print.’ No false modesty with Jeffrey.","url":"https://www.dailymail.co.uk/debate/article-4299764/Prince-Harry-s-engagement-announced-August-4.html"}
