{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 00:22:44","date_modify":"2018-10-23 00:22:44","date_publish":"2017-03-16 09:41:23","description":"This morning Prince Harry, 32, arrived at the Veterans' Mental Health Conference at King’s College London to lead a panel discussion on getting support for mental health issues.","filename":"data/vaneerConsumption/PrinceHarryattendsVeteransMentalHealthConference.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54A3A500000578-0-image-a-25_1489673450905.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319450_Prince-Harry-attends-Veterans-Mental-Health-Conference_1540254164.html","title":"Prince Harry attends Veterans' Mental Health Conference","title_page":"Prince Harry attends Veterans' Mental Health Conference | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His brother's commitment to duty is currently under scrutiny after it emerged that he went partying in the Swiss Alps instead of attending the Commonwealth Day service.\nBut Harry has been playing the part of a model royal this week, attending the service his brother missed and planting trees with local school children in Epping Forest yesterday.\nThis morning he arrived at the Veterans' Mental Health Conference at King’s College London to lead a panel discussion on getting support for mental health issues.\nPrince Harry arrives to attend the Veterans' Mental Health Conference at the King's Building in the Quad, King's College London\nHarry shares a joke with US veteran Ivan Castro who will run the Boston and London Marathons for the Heads Together Campaign\nNot a good speech Harry? Cooper, an Assistance Dog of Philip Eaglesham, yawns as the Prince leads a panel discussion\nThe royal looked smart in a grey suit jacket, something of a new look for the Prince who usually favours a dark navy.\nPrince Harry is attending as part of the Heads Together campaign to change the conversation on mental health which he leads with The Duke and Duchess of Cambridge.\nDuring the event he chatted with Major Ivan Castro lost sight in both eyes serving in Iraq, which has affected both his physical and mental health\n'Today we are fortunate to be joined by extraordinary people who have all faced mental health challenges,' he told guests.\nPrince Harry gives Heads Together head bands to US veteran Ivan Castro, centre, and UK veteran Karl Hinett, left, ahead of their marathon challenges\nThe Prince looked smart in a grey suit jacket, a departure from his usual dark navy\nPrince Harry helps former member of the US Armed Forces Ivan Castro as they arrive on stage at King's College in London\nThe Prince, who is currently dating US actress Meghan Markle was previously known as the party animal of the family.\nThe royal family were left red-faced when photos of him emerged playing naked billiards in a Vegas hotel room in August 2012.\nBut now an embarrassing series of videos, shows a 'worse for wear' 34-year-old Prince William letting loose with some 'dad dancing' while partying with friends at Farinet nightclub in Switzerland.\nHarry is greeted by Dr Paul Knapman as he arrives at King's College in London\nThis morning's engagement is Harry's third of the week after joining the royals on Commonwealth Day on Monday and planting trees with school children on Wednesday\nThe second in line to the throne is then seen gyrating as a blonde woman - believed to be Australian model Sophie Taylor who he was seen high-fiving on the side of the slopes on the weekend - 'slut drops' in front of him.\nThe father-of-two - who left Kate and his two children behind to enjoy the 'lads'' trip - then playfully steals her pink cowboy hat and puts it on his head, before continuing to dance.\nIn further footage, while dancing to Pharrell Williams's Happy, he also appears to put his hand on a woman's waist, before leaning in to talk to her.\nThe Prince will lead a panel discussion with three veterans on the benefits of having open conversations and getting the right support for a range of mental health issues\nThe future king also shared an emotional hug with the club DJ after going into his private booth while was on the decks.\nSince the start of the year, William has carried out royal duties on 13 days, according to listings in the Court Circular.\nMeanwhile, today marks his brother's 19th working day of the year.","url":"https://www.dailymail.co.uk/femail/article-4319450/Prince-Harry-attends-Veterans-Mental-Health-Conference.html"}
