{"authors":["Nicole Fabian-Weber"],"date_download":"2018-10-30 23:21:38","date_modify":"2018-10-30 23:21:38","date_publish":"2014-08-13 19:46:21","description":"Harry. Dude. What are you doing? Not long after England's most eligible prince broke up with England's biggest scrunchie lover, Cressida Bonas, he's reportedly been dating a woman named Camilla Thurlow. Now, it isn't completely crazy that Harry, a…","filename":"data/vaneerConsumption/PrinceHarrysNewGirlfriendLooksLikeKateMiddletonSoundsLikeHisStepmomPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/11/10/b4528a7d-4b68-4161-8653-99440f4ad345.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35642-prince-harrys-new-girlfriend-looks-like-kate-middleton-sounds-like-his-stepmom-photo_1540941698.html","title":"Prince Harry's New Girlfriend Looks Like Kate Middleton & Sounds Like His Stepmom - PHOTO","title_page":"Prince Harry's New Girlfriend Looks Like Kate Middleton & Sounds Like His Stepmom — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Harry. Dude. What are you doing? Not long after England's most eligible prince broke up with England's biggest scrunchie lover, Cressida Bonas, he's reportedly been dating a woman named Camilla Thurlow. Now, it isn't completely crazy that Harry, a young, single dude with a penchant for pretty ladies, would quickly move on to another gal post-Cressie, but there's something a little weird going on with his latest love. Thing is, Camilla looks exactly like Kate Middleton. Yeah. She's a beautiful woman, but not gonna lie: it's a little weird. Also, there's the fact that she has the same name as his step mother. This is all too incestuous, Harry.\nThis, of course, could all be a coinky-dink, but the one inneresting, hard-to-ignore aspect of this whole thing is: typically, Harry dates blondes. From Chelsea Davy to Cressida Bonas, when was the last time we saw the prince with a brunette? Been a while. Inspired by his brother's wife? I'd say it's definitely a possibility. (And so are other people, calling Thurlow a \"dead-ringer\" for the Duchess.) Camilla is a beautiful woman — she's a former Miss Edinburgh — but certainly a deviation from the usual tow-headed ladies we're used to seeing Harry with.\nPersonally, I think it would be great if Harry settled down with Thurlow (or anyone for that matter already!), but I could just imagine the cat fight-insinuating headlines about her and Kate that would ensue if he did.\nKate Middleton Furious Camilla Thurlow Looked at Her Hairdresser!\nKate & Pippa to Camilla at Poppy Day: \"No, You Totally Can't Sit With Us!\"\nThe Duchess of Cruelty: Kate Ice-Cold to Camilla at Christmas Dinner (And Queen Liz Joins In on the Fun!)\nGroan.","url":"https://www.bustle.com/articles/35642-prince-harrys-new-girlfriend-looks-like-kate-middleton-sounds-like-his-stepmom-photo"}
