{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 04:25:03","date_modify":"2018-10-23 04:25:03","date_publish":"2016-01-11 17:29:31","description":"Private Cheryl James, 18, died at Deepcut Barracks, Surrey, in 1995 and now her family's lawyers say they want the scope of a new inquest hearing to be widened to take into account new testimony.","filename":"data/vaneerConsumption/PrivateCherylJamesfounddeadatDeepcutmightvebeenorderedtohavesex.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D478E00000578-0-image-a-11_1452533172239.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394300_Private-died-Deepcut-told-sleep-someone_1540268703.html","title":"Private Cheryl James found dead at Deepcut might've been ordered to have sex","title_page":"Private Cheryl James found dead at Deepcut might've been ordered to have sex | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was one of four soldiers who died there amid claims of bullying\nPrivate Cheryl James, 18, died at Deepcut Barracks, Surrey, in 1995 and now her family's lawyers say they want the scope of a new inquest hearing to be widened to take into account new testimony\nNew evidence has emerged which suggests a teenage solider found dead at an army barracks more than 20 years ago may have been ordered to have sex with another private shortly before she died.\nPrivate Cheryl James, 18, died at Deepcut Barracks, Surrey, in 1995 and now her family's lawyers say they want the scope of a new inquest hearing to be widened to include new testimony which 'sheds new light' on her state of mind at the time of her death.\nAlison Foster QC, representing the teenager's family, told a pre-inquest hearing at Woking Coroner's Court they have material suggesting Cheryl 'may have been sexually coerced or raped the night before, or before the time of her death'.\nShe added: 'There is now a direct allegation that Cheryl might have been ordered to sleep with the person we are calling Witness A by someone superior in rank to her.'\nShe continued: 'This is not fraternising. This is not an illicit sexual relationship between two young people across the ranks. This is something quite different.'\nMrs Foster said the evidence may have uncovered a 'culture' of sexual abuse.\n'This new material gives a sinister and very different slant involving the pressure of third parties on persons to have sexual intercourse or other relations against their will.\n'This gives a climate or culture that can promote desperation and desperate emotions and matters highly relevant to her state of mind, and the culture in which such matters could continue,' she added.\nMrs Foster also told the coroner that she would present evidence of 'manipulation within the chain of command' at the new inquest.\nShe also referred to a system of 'pimping' or prostitution.\nPte James, 18, from Llangollen in North Wales, was found with a bullet wound to her head in November 1995 when she was undergoing initial training at the Surrey barracks.\nShe had been posted, alone and armed with an SA80 rifle, to guard a gate known as A2 at Royal Way on November 27, 1995.\nPte James, 18, was found with a bullet wound to her head in November 1995 when she was undergoing initial training at the Surrey barracks (pictured)\nShe was found at about 8.30am close to the gate in a small wooded area surrounded by trees, with a bullet wound to the front of her head and no other signs of injury.\nShe was one of four soldiers who died at the barracks between 1995 and 2002 amid claims of bullying and abuse.\nAfter the open verdict at the initial inquest - hurriedly held only three weeks after Pte James's death and lasting just one hour - the Ministry of Defence and police were accused of a cover-up.\nA second inquest was ordered into Pte James's death after High Court judges quashed an open verdict recorded in December 1995.\nCoroner Brian Barker QC said he would make a written ruling on whether to include the new material.\nPte James's parents, Des (pictured) and Doreen James have refused to accept the theory that their daughter committed suicide using her own rifle and have battled for 20 years for the truth surrounding her death\nPte James, 18, (pictured) from Llangollen in North Wales, was found with a bullet wound to her head in November 1995 when she was undergoing initial training at the Surrey barracks\nPte James's parents, Des and Doreen James, have refused to accept the theory that their daughter committed suicide using her own rifle and have battled for 20 years for the truth surrounding her death.\nAt a previous pre-inquest hearing in December Mr Barker heard that the MoD would miss its deadline to disclose all relevant documents to the coroner before Christmas.\nMrs Foster QC blasted the MoD for the 'disappointing' delays, saying the family had received precious little in terms of disclosure over the past year.\n'It is 20 years ago, really almost to the day, that Cheryl died and to the first inquest,' she added. 'The family had almost no access to information to speak of and it is with regret that we feel that that might be felt at the moment about where we are here.\nPte James's body was exhumed on August 10 ahead of the second inquest, which will consider whether a third party was involved in her death and what happened on the evening before she died\n'We come before you as really very disappointed people.'\nShe said the family also remained uncomfortable with the fact the MoD was deciding which documents were relevant, rather than the coroner.\nMrs James echoed her disappointment in a brief statement read to the preliminary hearing, adding: 'My personal experience of the MoD over the past 20 years has not been one of openness.'\nNicholas Moss, representing the MoD, said: 'It is not the case that the MoD is being the arbiter of what is relevant.\n'The criticisms are unjustified as a matter of fact. While of course it is right that it's more than a year since a new inquest was ordered, it was some time before a decision of scope was made.\n'A lot of people have been working extremely hard on disclosure.'\nThe coroner previously ruled that the inquest will take place in isolation, despite a request from Surrey Police for it to be held concurrently with those into the deaths of three other recruits at Deepcut.\nPrivates Geoff Gray and James Collinson, both aged 17 years, and 20-year-old Sean Benton, also died from gunshot wounds, sparking allegations of bullying and abuse at the barracks.\nA ballistics expert for the families of the four deceased claimed in 2003 that it was unlikely that any of the soldiers had shot themselves.\nPte James's body was exhumed on August 10 ahead of the second inquest, which will consider whether a third party was involved in her death and what happened on the evening before she died.\nAfter a second autopsy, which found metallic fragments which had been subjected to modern ballistics analysis, her body was later reburied at a small family service.\nThe upcoming inquest will also address whether there were 'shortcomings' with barrack policies on sexual behaviour, supervision of young females, drugs, alcohol and accommodation.\nCoroner Mr Baker said it was 'hugely difficult' for Cheryl's father to deal with the new proceedings and any delays, and stressed he intended to keep to the scheduled inquest date.\nAfter the pre-inquest hearing Emma Norton, Liberty Legal Officer and solicitor for Cheryl's family, said: 'We have received new evidence that Cheryl was ordered by an officer to have sex with a private the night before she died.\n'In light of that, we are asking the Coroner to consider the evidence of some other witnesses who complain of sexual coercion at Deepcut at the same time.'","url":"https://www.dailymail.co.uk/news/article-3394300/Private-died-Deepcut-told-sleep-someone.html"}
