{"authors":[],"date_download":"2018-10-22 21:39:10","date_modify":"2018-10-22 21:39:10","date_publish":"2014-06-05 21:14:00","description":"Lawmakers, White House officials and privacy advocates locked horns on Thursday over the USA Freedom Act.","filename":"data/vaneerConsumption/PrivacyAdvocatesUrgeSenatetoReinInNSADataCollection.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/490931/fisahearing_ba4d61e5b746f2cf6935b2c822831265.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_privacy-advocates-urge-senate-rein-nsa-data-collection-n123976_1540244350.html","title":"Privacy Advocates Urge Senate to Rein In NSA Data Collection","title_page":"Privacy Advocates Urge Senate to Rein In NSA Data Collection ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOn the same day that Google, Facebook and other tech companies urged stricter reforms to the National Security Agency’s surveillance policy, members of the Senate debated whether a bill passed by the House went too far or not far enough in protecting the privacy of Americans.\n\"The NSA has shown time and time again that it will seize on any wiggle room, and there is plenty of that in this bill,\" Sen. Tom Udall, D-N.M., said at a Senate Select Intelligence Committee hearing on Thursday.\nMost of the debate centered on whether language modified by the House defeated one of the major goals announced by President Barack Obama in the spring: to limit the bulk collection of data by the National Security Agency.\nThe USA Freedom Act passed by the House left the \"specific selection terms\" — which define exactly what kind of information the NSA can request — too vague and broad for some people and too restrictive for others.\n\"There is nothing in this bill that would prohibit 'Verizon' or 'Gmail' or the state of Georgia from being used as a specific selection term,\" said Harley Geiger, senior counsel with the Center for Democracy & Technology, a privacy advocacy group.","url":"https://www.nbcnews.com/tech/security/privacy-advocates-urge-senate-rein-nsa-data-collection-n123976"}
