{"authors":["Associated Press"],"date_download":"2018-10-22 21:01:08","date_modify":"2018-10-22 21:01:08","date_publish":"2016-01-28 06:18:48","description":"BAT TRANG, Vietnam (AP) — After a decade of uneven progress, foreign and local businesses hope the reshuffled leadership of Vietnam's ruling Communist Party ...","filename":"data/vaneerConsumption/PrivatebusinesshopesforbiggerroleinVietnameconomy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:027bda76a6a24523994df1a6d8901680-2vdWmEltwXfba0ce28e6324ccafe-269_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420405_Private-business-hopes-bigger-role-Vietnam-economy_1540242068.html","title":"Private business hopes for bigger role in Vietnam economy","title_page":"Private business hopes for bigger role in Vietnam economy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Private business hopes for bigger role in Vietnam economy\nBAT TRANG, Vietnam (AP) — After a decade of uneven progress, foreign and local businesses hope the reshuffled leadership of Vietnam's ruling Communist Party will double down on modernizing an economy dominated by state companies.\nOnce a much-hyped rising star among developing Asian nations, foreign perceptions of Vietnam have swung between fears it was on the verge of a financial collapse to seeing it as a rival to China as the world's factory floor.\nProblems such as episodes of high inflation, festering bad debts at state banks and riots in 2014 against Chinese-owned factories have underlined the risks of doing business. At the same time, Vietnam's young workforce, high if volatile growth rates and low wages have attracted a steady stream of long-term foreign investment involving companies from Intel to Samsung. New free trade agreements have also sent a positive signal to investors.\nIn this Jan. 22, 2016 photo, workers coat potteries with enamel in a factory in Bat Trang village, Hanoi, Vietnam. After a decade of uneven progress, foreign and local businesses hope the reshuffled leadership of Vietnam¿s ruling Communist Party will double down on modernizing an economy dominated by state companies. (AP Photo/Hau Dinh)\nA five-yearly party congress this week rearranged the deck of top leaders. Among the changes, Prime Minister Nguyen Tan Dung, who has pushed economic liberalization, was unsuccessful in maneuvering to become party general-secretary, which is defacto the No. 1 leadership position, and will leave the inner circle. The old guard incumbent, Nguyen Phu Trong, was re-elected as general-secretary. Despite the apparent strengthening of a conservative faction, Vietnam is not expected to undo closer ties with the United States and incremental adoption of free market economic policies.\nTran Minh Thang, who employs 50 workers making cheap porcelain pots, cups and dishes in historic Bat Trang outside Hanoi, said that most of all he wants the government to provide stability because \"we cannot do anything if there's no stability.\" Beyond that, he hopes the new leadership will \"speed up economic reforms.\" Because, he said, \"once the country develops, my business will also benefit.\"\nStanding in the way of development is Vietnam's biggest unresolved economic challenge. Much of the economy remains dominated by inefficient state-owned companies even after a series of market-style reforms that began in the 1980s. Like neighboring China, Vietnam's authoritarian leaders are reluctant to relinquish control over commerce, fearing that doing so could ultimately imperil their political stranglehold.\nSlowly, however, the party is being squeezed into a corner. Seeking to avoid economic domination by China, Vietnam has joined a U.S.-led trade agreement involving 12 countries that has provisions which over time will require less government involvement in the domestic economy. Hanoi has also signed trade agreements with the European Union, South Korea and its Southeast Asian neighbors.\nMuch of the recent foreign investment into Vietnam was a result of international companies realizing they would benefit by basing factories in an Asian country that has low tariff access to major Western markets. Garment exports are expected to be one of the biggest beneficiaries of Vietnam's inclusion in the U.S.-led Trans Pacific Partnership, which is awaiting ratification by its signatory nations. There are also expectations that Vietnam's membership will result in it becoming a more predictable and fairer place for foreign businesses.\nPham Chi Lan, a former economic adviser to Vietnam's government, said the trade agreements are a huge opportunity for Vietnam's development but one that could be wasted if local companies don't become more productive and most of the benefits go to foreigners.\nVietnam's leaders \"must realize these problems to have the will to carry out real reforms otherwise the country will be put into difficult position as it deepens international integration,\" she said.\nThe government forecasts the economy to grow between 6.5 percent and 7 percent a year for the next five years. It expanded 6.7 percent last year.\nMany small local businesses hope for an environment where private entrepreneurs are not crowded out by state companies and have more opportunities within Vietnam and abroad.\nLuong Van Huy's family business has been producing ceramics such as artistic vases and lamp stands for four generations. It is one of about 1,000 family businesses in Bat Trang, home to a ceramic and pottery industry for some 600 years.\nAfter initial success from venturing into exporting in the 1990s, Huy's business struggled in the aftermath of the 2009 global recession. Overseas sales have fallen from a peak of $1 million to about $300,000 a year.\n\"I can feel clearly the impact of the slowdown in the world's economy,\" he said at his showroom. \"In the past I sometimes could not meet demand from foreign clients, but now export revenues have fallen some 80 percent and I have to focus more on the domestic markets.\"\nHuy, who employs eight workers at his small workshop, said he wants the new leaders to adopt economic policies that \"open up more markets for businesses.\"\nAdam Sitkoff, executive director of the American Chamber of Commerce in Hanoi, said he doesn't expect any backsliding on the economic changes that occurred in the past three decades.\nBut what's needed now, he said, is more urgency in attending to problems such as bad debts at banks and ensuring the government is more of a referee in the economy than a player.\n\"Hopefully we'll see a faster pace of reform, not a slower pace of reform, because ultimately that's what going to be what helps the 93 million people here get better choice and higher quality and lower prices and more opportunity for their children.\"\nIn this Jan. 22, 2016 photo, worker Phuong Ly removes tea cups from shelves in a pottery factory in Bat Trang village, Hanoi, Vietnam. After a decade of uneven progress, foreign and local businesses hope the reshuffled leadership of Vietnam¿s ruling Communist Party will double down on modernizing an economy dominated by state companies. (AP Photo/Hau Dinh)\nIn this Jan. 22, 2016 photo, worker Nguyen Thanh Vuong carries a shelf of potteries, preparing them for the kiln in a factory in Bat Trang village, Hanoi, Vietnam. After a decade of uneven progress, foreign and local businesses hope the reshuffled leadership of Vietnam¿s ruling Communist Party will double down on modernizing an economy dominated by state companies. (AP Photo/Hau Dinh)\nIn this Jan. 22, 2016 photo, pottery exporter Luong Van Huy answers a customer¿s call at his showroom in Bat Trang village, Hanoi, Vietnam. Huy, who employs eight workers at his small workshop, said he wants the new leaders to adopt economic policies that ¿open up more markets for businesses.¿ (AP Photo/Hau Dinh)","url":"https://www.dailymail.co.uk/wires/ap/article-3420405/Private-business-hopes-bigger-role-Vietnam-economy.html"}
