{"authors":["Shayan Shankar For Daily Mail Australia"],"date_download":"2018-10-22 23:54:12","date_modify":"2018-10-22 23:54:12","date_publish":"2017-03-16 08:12:15","description":"At least 1000 Australian teenagers have had their private details stolen by hackers from the popular quiz app Wishbone that is a favourite amongst girls.","filename":"data/vaneerConsumption/PrivatedetailsofAussieteensexposedbyhackers.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E524D8000000578-0-image-a-21_1489648654247.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319018_Private-details-Aussie-teens-exposed-hackers_1540252452.html","title":"Private details of Aussie teens exposed by hackers","title_page":"Private details of Aussie teens exposed by hackers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At least 1000 Australian teenagers have had their personal details hacked from a popular quiz app, which is now circulating the internet.\nNames, addresses, phone numbers and email addresses have been stolen from the popular teen social networking app, Wishbone, which is a favourite of teenage girls.\nDetails of more than 2 million users around the world, were taken by hackers who accessed the application's database through unprotected software, in the massive breach of privacy.\nAt least 1000 Australian teenagers have had their private information stolen in a massive hack of the popular quiz app Wishbone\nSecurity researcher Troy Hunt who runs the hacking warning site Have I Been Pwned, which lets users find out whether their information was hacked, was given a database that belonged to Wishbone earlier in the week.\nA security flaw in the Wishbone app allowed hackers access to more than two million email addresses\nWhilst those with com.au email addresses and +61 phone numbers could be easily identified, Mr Hunt warns that the numbers of young Australians affected by the breach could be much higher.\n'Of course there'll be a lot more Aussie data in there due to the fact that so many of us use Gmail, Outlook etc and have .com email addresses,' he told News Corp Australia.\nThe makers of the app, Science Inc, issued a statement to Motherboard, confirming the breach and that the security flaw was fixed.\n'The vulnerability has been rectified', said co-founder of Science Inc Greg Gilman.\nHowever the millions of private details hacked in the breach continue to be online.\nThe app is popular with teenage girls and allows users to vote on things like celebrities and fashion\nThe app allows for users to have their own public profile with a picture and bio\nWishbone is amongst the top social networking app for the iPhone and is primarily targeted at girls under 18.\nWishbone is amongst the top ten social networking apps on the iPhone\nThe app lets teens vote on which two items they like the best, with most polls comparing celebrities or fashion.\nAfter choosing which one they prefer, the app lets the user see how others votes and comment.\nThe app also encourages more active social networking with users having their own public profile with a picture and a bio and are able to private message other users.\nChief security strategist at AsTech security company, Nathan Wenzler, cautioned parents and teenagers to take care in protecting their online identity.\n'Parents must help their children understand why protecting their identity is important, especially before they've reached adulthood and will be opening back accounts, credit lines and applying for loans,' he told News.com.au\n'Not sharing personal information when asked for it, using strong passwords and changing them on a regular basis are important concepts that should be taught.'","url":"https://www.dailymail.co.uk/news/article-4319018/Private-details-Aussie-teens-exposed-hackers.html"}
