{"authors":["Katie Mchugh"],"date_download":"2018-10-30 19:07:30","date_modify":"2018-10-30 19:07:30","date_publish":"2016-12-07 17:26:00","description":"A pro-American immigration reform group praised the coming appointment of retired General John Kelly as the head of DHS.","filename":"data/vaneerConsumption/ProAmericanImmigrationGroupPraisesTrumpDHSPickGeneralJohnKelly.json","image_url":"https://media.breitbart.com/media/2015/03/Gen-John-Kelly-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_07__1540926450.html","title":"Pro-American Immigration Group Praises Trump DHS Pick General John Kelly","title_page":"Pro-American Immigration Group Praises Trump DHS Pick General John Kelly","title_rss":"NULL","source_domain":"breitbart.com","text":"A pro-American immigration reform group praised the coming appointment of retired General John Kelly as the head of the Department of Homeland Security, saying he will bring a “renewed commitment” to controlling illegal immigration.\nThe Federation for American Immigration Reform (FAIR) applauded Kelly in a statement Wednesday immediately after reports broke that President-elect Donald Trump chose the retired general for the critical position.\nFAIR’s President Dan Stein said in the statement that Kelly “fully understands” the task at hand:\nGeneral Kelly has spent his life defending our nation and fully understands the critical role border security plays in protecting the country from the threats of terrorism, uncontrolled illegal immigration, and drugs. He will bring a renewed commitment to controlling our borders and ensuring the safety of the American homeland. General Kelly’s commitment to the nation’s security is without question, and his military expertise and experience fighting the influx of illegal drugs from Latin America gives him unique insight into the challenges faced by the nation’s immigration enforcement agents, as well as practical knowledge of border deterrents.\nStein also recommended Kansas Secretary of State Kris Kobach for an administration post:\nKris Kobach has decades of hands-on experience working both in the administration and with communities on the front lines of illegal immigration. He’s an incredibly sharp constitutional lawyer who understands the law, and knows exactly what needs to be done to quickly regain control of the nation’s borders.\nKelly reportedly accepted the position, according to CBS News, and the formal announcement will come next week.\nBefore his retirement in January at the end of a 45-year career, Kelly commanded Pentagon’s Southern Command (SOUTHCOM) and oversaw U.S. military activities from South America to the U.S.-Mexico border. He issued warnings about Islamic terrorism in Latin America and the Islamic State (ISIS) using Latin American human traffickers to smuggle jihadis into the U.S. in the midst of an illegal immigration crisis.","url":"https://www.breitbart.com/politics/2016/12/07/pro-american-immigration-group-praises-trump-dhs-pick-general-john-kelly/"}
