{"authors":["Sylvia Longmire"],"date_download":"2018-10-30 21:29:33","date_modify":"2018-10-30 21:29:33","date_publish":"2014-06-16 14:55:00","description":"TUCSON, Arizona--As more and more unaccompanied alien children (UACs) from Central America have poured into south Texas--and subsequently transferred to |","filename":"data/vaneerConsumption/ProBonoLawyersMostUnaccompaniedBorderChildrenEligibleforAmnesty.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/Big%20Border/RGV%20Border%20Patrol/riogrande4jpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_06_16__1540934973.html","title":"Pro-Bono Lawyers: Most Unaccompanied Border Children Eligible for Amnesty","title_page":"Pro-Bono Lawyers: Most Unaccompanied Border Children Eligible for Amnesty | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TUCSON, Arizona–As more and more unaccompanied alien children (UACs) from Central America have poured into south Texas–and subsequently transferred to Border Patrol facilities elsewhere along the border–US government officials are scrambling to find places to put them. However, based on current immigration and asylum laws, the vast majority of those children could be legally staying right here in the United States before long.\nUnder the authority of the Homeland Security Act, the federal government transfers custody of illegal immigrant children who are apprehended alone at our borders to the Department of Health and Human Service’s Office of Refugee Resettlement (ORR). The ORR’s primary goal is to reunite them with a family member or legal guardian already here in the US (regardless of their legal status) while the child goes through removal proceedings. As Breitbart Texas recently reported, UACs receive a bevy of assistance while in ORR custody, including classroom education, health care, socialization/recreation, vocational training, mental health services, family reunification, access to legal services, and case management. In many cases, they are treated better than US citizen children currently in the foster care system.\nThe most valuable of all those benefits is the legal assistance. ORR has an outreach program to connect immigration attorneys willing to work on a pro-bono basis with UACs as they go through removal proceedings. For adult illegal immigrants facing deportation or applying for a status adjustment through avenues like asylum or cancellation of removal, finding a pro-bono attorney is next to impossible, and even lower-priced immigration attorneys are financially out of reach for cash-strapped applicants. But in the case of UACs, there is a program designed specifically to help just them, as well as unaccompanied refugee minors.\nThe pro-bono attorneys who volunteer to help these children aren’t bottom-of-the-barrel lawyers, either; some of them work for very prestigious firms in different parts of the country. One such organization that provides pro-bono legal services for UACs is The Safe Passage Project. Their “attorneys of the week” list highlighted on their main page included a litigator who has practiced multiple areas of law, including Immigration, Foreclosure, Personal Injury, and Real Estate, for seven years and established her own law firm on Wall Street.\nWith this kind of legal firepower behind them, it shouldn’t come as a surprise that the odds of UACs being granted some kind of legal status to stay in the United States is very high. Safe Passage Project Director Lenni Benson wrote a letter to The New York Times in May 2014 in which she said, “Our organization, Safe Passage Project, finds that nearly 90 percent of the unaccompanied minors we meet who are facing deportation qualify for immigration relief, allowing them to remain in the United States legally.” She continued, “While emergency shelters provide a temporary solution for unaccompanied minors entering the United States, appointed legal counsel to enable these vulnerable young people to receive the immigration remedies for which they might be eligible would provide permanency and would truly be in their best interests.”\nBeing granted asylum as an applicant from a Central American country can be tricky, at least for adults. The attorney has to clearly demonstrate that the applicant is being persecuted on one of five protected grounds: race, religion, political beliefs, nationality, or social group. The latter is the ground most commonly used by immigration attorneys, and the strength of cases can vary considerably. Asylum approval rates among judges within the same immigration court can vary just as much, with the Cleveland court ranging from 18 percent to 75 percent between 2007-2012.\nBut UACs have more options than just requesting asylum. According to the Project’s website, “Special Immigrant Juvenile Status (SIJS) is an immigration classification available to certain undocumented immigrants under the age of 21 who have been abused, neglected, or abandoned by one or both parents. SIJS is a way for immigrants under twenty-one to apply for and obtain legal permanent residence in the United States.” There are a few legal hoops an applicant has to jump through, including being declared a dependent in court, being unable to reunite with a parent, and being unable to return to his/her own country.\nBut jumping through those hoops–probably made easier with the help of a seasoned immigration attorney working for free at the behest of ORR–is worthwhile. “SIJS waives unlawful entry, working without authorization, status as a public charge, and certain immigration violations,” the site said. “Once a minor receives SIJS, he/she will be able to adjust his/her status to that of a lawful permanent resident, obtain work authorization, and eventually apply for US citizenship.”\nThe rumors circulating throughout Central America right now don’t go into much detail about what exactly happens to UACs once they’re taken into Border Patrol custody, other than they’re being released and physically taken care of. But as UACs go through this process, word eventually reaches their family members in their home country that they get to stay. If Ms. Benson’s claim is correct that 90 percent of UACs are eligible for amnesty, then the reality on the ground and in our immigration courts flies right in the face of the rhetoric from Obama administration and DHS officials that this crisis is not of our government’s own making.\nSylvia Longmire is a border security expert and Contributing Editor for Breitbart Texas. You can read more about the evolution of cross-border migration in her new book, Border Insecurity: Why Big Money, Fences, and Drones Aren’t Making Us Safer.","url":"https://www.breitbart.com/border/2014/06/16/pro-bono-lawyers-most-unaccompanied-border-children-eligible-for-amnesty/"}
