{"authors":["Lucia Mutikani"],"date_download":"2018-10-31 00:17:22","date_modify":"2018-10-31 00:17:22","date_publish":"2018-07-11 00:00:00","description":"The producer-price index jumped in June by the most since 2011, led by an annual increase in services and vehicle costs, the Labor Department said Wednesday. Inflation is gradually rising against the backdrop of a labor market that is viewed as being near or at full employment.","filename":"data/vaneerConsumption/Producerpriceshaventbeenthishotsince2011.json","image_url":"https://amp.businessinsider.com/images/55af9b2c2acae711008b8bac-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_producer-price-index-ppi-inflation-surges-in-june-by-the-most-since-2011-2018-7_1540945042.html","title":"Producer prices haven't been this hot since 2011","title_page":"    Producer-price index surges in June by the most since 2011 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Year-over-year PPI rose 3.4%, the most since November 2011. Thomson Reuters\nWASHINGTON, (Reuters) - U.S. producer prices increased slightly more than expected in June amid gains in the cost of services and motor vehicles, leading to the biggest annual increase in 6-1/2 years.\nThe Labor Department said on Wednesday its producer price index for final demand climbed 0.3 percent last month also lifted by increases in gasoline prices. The PPI rose 0.5 percent in May. In the 12 months through June, the PPI advanced 3.4 percent, the largest gain since November 2011. Producer prices increased 3.1 percent year-on-year in May.\nEconomists polled by Reuters had forecast the PPI gaining 0.2 percent in June and rising 3.2 percent year-on-year.\nA key gauge of underlying producer price pressures that excludes food, energy and trade services rose 0.3 percent last month. The so-called core PPI edged up 0.1 percent in May.\nIn the 12 months through June, the core PPI rose 2.7 percent after increasing 2.6 percent in May.\nInflation is gradually rising against the backdrop of a labor market that is viewed as being near or at full employment.\nThe Federal Reserve's preferred inflation measure, the personal consumption expenditures (PCE) price index excluding food and energy, hit the U.S. central bank's 2 percent target in May for the first time in six years.\nIn June, the cost of services increased 0.4 percent after climbing 0.3 percent in May. A 21.8 percent jump in the index for fuels and lubricants retailing accounted for about 40 percent of the rise in the cost of services last month.\nThe cost of healthcare services rose 0.2 percent as a 1.0 percent surge in prices for hospital outpatient care offset slight declines in the cost of doctor visits and hospital inpatient care. Healthcare prices nudged up 0.1 percent in May.\nThose costs feed into the core PCE price index.\nPrices for goods edged up 0.1 percent after surging 1.0 percent in May. They were last month restrained by a 1.1 percent drop in food prices. Wholesale gasoline prices rose 0.5 percent after jumping 9.8 percent in May.\nExcluding foods and energy, goods prices gained 0.3 percent, rising by the same margin for a fourth consecutive month. Motor vehicle prices increased 0.4 percent last month.\n(Reporting By Lucia Mutikani; Editing by Andrea Ricci)","url":"https://www.businessinsider.com/producer-price-index-ppi-inflation-surges-in-june-by-the-most-since-2011-2018-7"}
