{"authors":["Barbara Kay"],"date_download":"2018-10-30 22:00:17","date_modify":"2018-10-30 22:00:17","date_publish":"2016-08-01 14:57:38","description":"David Horowitz’s new book “Progressive Racism” explores the left’s politicized betrayal of Martin Luther King, Jr.’s vision – a subject which, in Horowitz’s words, “goes to the heart of the most problematic assault on the American social contract.” | Politics","filename":"data/vaneerConsumption/ProgressiveRacismDavidHorowitzsNewBookUnveilstheLeftsAssaultonMLKsDreamandtheAmericanSocialContract.json","image_url":"https://media.breitbart.com/media/2016/08/David-Horowitz-Progressive-Racism-Flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_01__1540936817.html","title":"‘Progressive Racism’: David Horowitz’s New Book Unveils the Left’s Assault on MLK’s Dream and the American Social Contract","title_page":"‘Progressive Racism’: David Horowitz’s New Book Unveils the Left’s Assault on MLK’s Dream and the American Social Contract | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The timing for the recent release of “Progressive Racism,” Book VI in David Horowitz’s series, The Black Book of the American Left, could not be more propitious.\nThis volume, which explores the politicized betrayal of MLK’s vision in detail, is arguably the most important of the series because, as Horowitz writes in his preface, the subject “goes to the heart of the most problematic assault on the American social contract.” The book is a compilation of Horowitz’s columns on race published (mostly, with a few recent exceptions) in the late 1990s and early 2000s.\nHorowitz writes that he structured the chronologically arranged articles to,\n“form a running journal of the conflicts that accompanied the transformation of the civil rights cause. Until this transformation it had been a movement to integrate African-Americans into America’s multi-ethnic democracy. In less than a decade it had become a movement led by demagogues to refashion racial grievances into a general assault on white people and on the country they were said to ‘dominate.’ In its core agendas, the new civil rights movement was an assault on the basic American social contract, and in particular the 14th Amendment’s commitment to equal rights under the law and thus to race-neutral standards and race-neutral government practices. Post-King civil rights became a movement to institutionalize racial preferences – the same kind of discriminatory practices that characterized segregation – and to recreate a race-conscious political culture in which blacks and a handful of designated minorities were singled out as the groups to be racially privileged. On the other side of the coin, whites were made targets of exclusion, suspicion and disapprobation.”\nThe book’s first section, “Decline and Fall of the Civil Rights Movement,” begins with “Memories in Memphis” (1999) in which Horowitz challenges both the creation myth and the illusory achievements of affirmative action head-on:\n“[A]ffirmative action was not created because of white racism. It was created because of widespread black failure to take advantage of the opportunities made available when legal segregation was ended. Since the politics of the left are premised on the idea that social institutions determine individual outcomes, this failure had to be the result of institutional rather than individual factors”;\nand the alleged achievement:\n“[Affirmative Action’s] primary achievement is to have convinced black Americans that whites are so racist that some external force must compel their respect and, secondarily, that blacks need affirmative action in order to gain access to the American dream. The further consequence of this misguided remedy has been to sow a racial paranoia in the black community so pervasive and profound that even blacks who have benefited from America’s racial opportunities have been significantly affected in the way they think.”\nOne of the more vexing tropes that pervades black activist discourse is “institutional racism.” This Soviet-like abstraction, unverifiable and collectively inculpatory is, Horowitz argues, the last refuge for desperate militants running short of individual racist acts to condemn. It is on the one hand meaningless, but on the other impossible to rebut, rendering ineffectual all attempts to counter it. As Horowitz writes:\n“The belief in the power of institutional racism allows black civil rights to denounce America as a racist society, when it is actually the only society on earth – black, white, brown or yellow – whose defining creed is anti-racist; a society to which blacks from black-ruled nations regularly flee in search of opportunity and refuge. But the real bottom line is that the phantom of institutional racism allows black leaders to avoid the encounter with real problems in their own communities which are neither caused by whites nor solvable by the actions of whites.”\nThe main effect of affirmative action seems to have been to heighten awareness of and sensitivity to black self-esteem in order to make life easier for students only too conscious of the disparity in educational preparedness between them and their white peers. Blacks attending university on affirmative action tend to drop out at far greater rates than whites – at Berkeley it is nearly three times the white dropout rate – or take far longer to get their degrees. But any allusion to this reality became a forbidden subject.\nIn the following section, “Racial Correctness,” Horowitz offers examples of the many ways in which the “race card” dominates the discourse in American society on every level. When Horowitz wrote an article for Salon, “Guns Don’t Kill Black People – other Black People Do,” which put the bald facts and statistics of black crime on the table, he was told by a reader he had no business opinionating on black issues because he wasn’t black. The unspoken assumption was that facts and statistics need not be taken seriously by blacks, because their situation is unique, and they therefore aren’t bound by the same rules of logic or justice as whites.\nIn “An Academic Lynching (1997)” Horowitz tells the story of Lino Graglia, a Sicilian-born American, an attorney in the Eisenhower Justice Department, who taught constitutional law at the University of Texas in Austin for 33 years. His martyrdom is worth recounting in full because what happened to him is a template for all the ruined lives in academia that can be traced to political correctness around race.\nThe syndrome is called a “mobbing.” In a classic mobbing episode, the underlying “crime” is typically a statement that is benign or objectively unassailable. But someone or some group takes offence. The accused at first assumes his friends and colleagues will rush to defend him. But if the critics are able to cast their case in politically fashionable terms — the fight against racism or sexism, most commonly — then personal loyalties go out the window. People rush to join the torch-bearing crowd, lest the accused’s crimes tarnish them as well. Graglia was mobbed by his chancellor, 51 colleagues in the law school and state legislators. He was called a KKK supporter, a racist and “academic riff raff.” Graglia was charged by the local NAACP chapter and student groups for “racial harassment.”\nHis crime? To state his opinion in a speech to the Students for Equal Opportunity (SEO), where he was faculty advisor. The subject under discussion was the Hopwood case, which had recently ended affirmative action at the university. Twenty years before, Graglia had written a book, Disaster by Decree: the Supreme Court Decisions on Race and the Schools, which was highly critical of affirmative action programs. So it wasn’t as if Graglia had been hiding his light under a bushel. The opinion he expressed was that affirmative action cannot obscure the fact that blacks and Mexican-Americans are not academically competitive with whites and Asians.\nHe said:\n“Racial preferences are the root cause of virtually all the major problems plaguing American campuses today. They result in a student body with two groups, identifiable by race, essentially in different academic ballparks. An inability to compete successfully in the game being played necessarily results in demands that the game be changed, and thus are born demands for black and Hispanic studies and ‘multiculturalism’….Concealment and deception are therefore always essential elements of racial preference programs and thus is born insistence on political correctness and the need to suppress ‘hate speech’.”\nOne does not hear this sort of thing anymore – or at least one does not hear it emanating from the lips of academics, even those with tenure. Not because there is no truth in what Lino Graglia said, but because of what happened to him for saying it. Bad things still happen to racially incorrect academics; it is just that the triggering “offences” have been dumbed down considerably since the Graglia affair. Since those in authority at universities have given no indication so far that they will stand up for their wrongfully tarred and feathered scapegoats, we can expect the show trials of insufficiently racially correct professors and administrators to continue, and the population to swell in those gulags where mugged classic liberals with a nostalgia for freedom of speech gather to express their astonishment and lick their wounds.\nRacial correctness is at its core an endorsement of black separatism. Horowitz summarizes:\n“This cold-hearted calculus is a central thesis of what is now generously described as ‘black separatism’.” If blacks want to march behind a racist kook, fine, or want racially segregated dorms and racially segregated graduation ceremonies and racially separated curricula, fine. Basically we are back to “separate but equal”.\nPlaying the race card has done nothing to help the blacks who need help most and a great deal to harm them. One of the great paradoxes of progressive indulgence for the myth that racism is at the root of all black problems is that the elephant in the room, black crime, cannot be discussed with candor – or at all, except when the thrust is black victimization of white policemen. There are racist cops, and some of them do kill blacks under (filmed) circumstances in which they would be very unlikely to kill whites. Nevertheless, such individual tragedies, increasingly explosive in their collective emotional and political impact, often serve to obscure the more pervasive and intractable cultural problem it is racially incorrect to mention (my own recent foray into such a discussion attracted a slew of angry emails and Twitter accusations accusing me of racism).\nHorowitz wades boldly in on this subject where progressives fear to tread. In “Guns Don’t Kill People, Other Black People Do” (1999), he adduces troubling but incontestable statistics, such as the fact that black men are eight times more likely to commit murder than white men, a reality that spikes fear in police officers tasked with keeping order in high-crime areas. In another article, “Death of the Civil Rights Movement” (2000), we learn that in 2000, there were an estimated 31,000 gangs in the U.S. with a combined membership approaching one million, 80% of which were black or Hispanic. According to a 1993 Justice report, 70% of violent juvenile defendants in criminal court were black males, as well as 72% of rape defendants, 78% of robbery defendants and 61% of assault defendants (similar statistics for today can be found here). Horowitz’s refusal to play the game of racial correctness, whose first rule is to ignore inner-city cultural epidemiology, earned him vicious blowback and contributed to his professional marginalization. The fact that he is himself the grandfather of black children earns him no points with progressives.\nIn the next section, “Reparations for Slavery,” Horowitz takes aim against the most hyper-alienated of black leaders, those for whom equal rights and opportunities, even if fully realized, would never be enough. They want America to “show me the money.” Reparations is the hottest of controversial subjects on the race file, and Horowitz met the challenge with customary resolution. In response to reparations movement founder Randall Robinson’s treatise, The Debt: What America Owes to Blacks (namely more than $4 trillion), Horowitz mounted a highly-publicized rebuttal, “Ten Reasons Why Reparations are a Bad Idea,” which in turn set off a firestorm of rage and counter-rebuttal on campuses across the country.\nSome of Horowitz’s stated figures and claims in his “ten reasons” – for example, that if American blacks were a nation, they would be the tenth richest in the world – are hotly contested, but on one critical point Horowitz is, I think, unassailably right: the reparations movement is virulently anti-American.\nTo reduce the relationship of blacks and whites to a cash nexus – all blacks are “owed” and all whites must therefore “pay” – would, Horowitz argues, pit blacks against whites, but also against other ethnic groups, who have had their own struggles in making it as full Americans. It would furthermore be to deny that “[f]or all their country’s faults, African-Americans have an enormous stake in America and above all in the heritage that men like Jefferson helped to shape…The American idea needs the support of its African-American citizens. But African-Americans also need the support of the American idea.”\nReparations has never taken hold outside of a militant core. A 2002 “Millions for Reparations March” was a flop, attracting only hundreds of participants. Just as well, since the rhetoric was quite incendiary. New York City Councilman Charles Barron confessed himself so angry he felt like going up to “any white person” and “slap[ping] them.” One rapped shouted, “Show me the money, or I’ll show you my Glock.” Virulent anti-Semite and New Black Panthers “Minister of Defence” Malik Zulu Shabazz ranted: “The president wants to talk about a terrorist named bin Laden. I don’t want to talk about bin Laden. I want to talk about a terrorist called Christopher Columbus. I want to talk about a terrorist called George Washington. I want to talk about a terrorist called Rudy Giuliani. The real terrorists have always been the United States of America.”\nThe final section, “Progressive Racism,” examines the double standards black ideologues endorse for anti-social or even criminal behavior in the name of combatting an alleged systemic attitude of “white supremacy.” What would not be tolerated in whites is well tolerated in blacks. Victimization of blacks by whites is highly publicized, but not the reverse.\nWhen, in December 2000, five professional young men and women were tortured and shot in the head by sadistic black brothers, with only one survivor – the shocking incident is known as the Wichita massacre – not a single national news outlet reported the case contemporaneously (“Racial Witch Hunt,” 2001). In 2002, a white man, Ken Tillery, was lynched by four black men in Jasper, Texas, the same town where James Byrd was lynched by white men in 1998. Byrd’s name became a household word. Tillery’s not so much.\nThe book ends with a 2012 article co-authored with John Perazzo, “Black Skin Privilege and the American Dream.” Here the concepts of “white skin privilege” and “institutional racism” are unpacked as “sophistries [that] made possible new battles and continued campaigns that annually lured millions of dollars into the deep pockets of ‘anti-racist’ organizations and movements, even as racists were no longer detectable in the institutions themselves.”\n“Black privilege” rests on three main pillars.\nFirst is the progressive assumption that in any incident involving blacks and whites with abuse as the central motif, allegations of racism-motivated guilt against whites will be received as truth without – or before – substantiation to reinforce the claim, while reverse claims are meticulously interrogated or even ignored.\nA case in point is the infamous 2006 “rape” of a black stripper by three white male members of the Duke University lacrosse team, which turned out, to the utter dismay of progressives, to be a complete fabrication on the part of the accuser, Crystal Mangum, who later went to prison convicted of second-degree murder in an unrelated incident. On her word alone, a posse of 88 Duke academics charged in a notorious ad that “white male privilege” had permitted the perpetrators of “this horrific racist incident” to remain “safe under the cover of silent whiteness” and given them “license to rape, maraud, deploy hate speech and feel proud of themselves in the bargain.” Even after the accused were exonerated, none of the 88 ever apologized nor did they suffer professionally for their rush to judgment. Quite the contrary, in fact.\nThe second pillar of black privilege is the reflexive impulse in the liberal media to ignore, downplay or “explain” instances of hate crimes or hate speech by blacks against whites.\nRegarding hate crimes: In the two months following the death of Trayvon Martin in Florida, black assailants perpetrated more than a dozen brutal attacks on white victims motivated by vengeance for Martin. In Mobile, a white man was assaulted by a mob of black men armed with brass knuckles, bricks, bats and steel pipes after he asked them to stop playing basketball in front of his house. According to his sister, who witnessed the incident, as the victim lay bleeding, one of the assailants told her, “Now that’s justice for Trayvon.”\nIn Phoenix, weeks after the Martin killing, a 22-year old black motorist shot and killed mentally disabled “white Hispanic” Daniel Adkins outside a Taco Bell restaurant. The shooter claimed a “stand your ground” defence, though no weapons were found on Radkins, who may or may not have attempted to punch the shooter after an altercation. In many respects this was a mirror image of the Trayvon Martin affair, but it is doubtful that many people will recognize the name of Daniel Radkins. The shooter was not charged.\nHorowitz and Perazzo cite the book, White Girl Bleed a Lot: The return of racial violence and how the media ignore it, by Colin Flaherty, which documents a plethora of black race riots, shootings, stabbings and sexual crimes that have gone unreported by the media under the rubric of black privilege.\nAs I write in early July, Micah Johnson, a heavily armed black sniper, “upset about Black Lives Matter,” has just killed five white police officers at a peaceful Dallas march protesting police abuse (He himself was killed after a gun battle with police). His Facebook page revealed he is a supporter of the New Black Panther Party, a group that advocates violence against whites (and Jews in particular). It will be interesting to see the spin black militants and white progressives put on this affair. (One of my detractors almost instantly tweeted to me that Johnson was goaded to action by America’s systemic racism; I tweeted back asking if Lee Harvey Oswald was goaded to murder JFK by America’s “systemic communism.” I didn’t hear back.)\nAs for hate speech, a cursory perusal of some of the content in comments by anti-American and anti-Semitic black cleric Bishop Desmond Tutu or anti-white black actor Samuel L. Jackson will convince any fair-minded observer that there are consequences for white celebrity racists or anti-Semites like Mel Gibson that don’t apply to blacks in the public eye. Gibson will never be offered the 40 honorary doctorates Jackson boasts, or receive the Presidential Medal of Freedom Jackson received from Bill Clinton. Not that Gibson should have been so honored! But then neither should Jackson.\nThe third pillar is an activist judiciary that, in the spirit of “leveling the playing field,” complacently rigs the law to favor collective institutional entitlements rather than individual justice, particularly, but not only, in the area of education. As Columbia University law professor Patricia Williams (who is black) explains: “If the modern white man, innocently or not, is the inheritor of another’s due, then it must be returned.” Or, as Chief Justice Thurgood Marshall bluntly told fellow justice William O. Douglas, “You [white] guys have been practicing discrimination for years. Now it’s our turn.”\nConsequently, this past June, in a “tortured 4-3 opinion,” regarding the case of Abigail Fisher, a white student who claimed she had been rejected by the University of Texas on unconstitutional grounds, the Supreme Court voted to uphold racial preferences in U of Texas admissions. Dissenting Justices Alito, Roberts and Thomas described as “remarkably wrong” Justice Anthony Kennedy’s opinion that “[c]onsiderable deference is owed to a university in defining those intangible characteristics, like student body diversity, that are central to its identity and educational mission.” Nevertheless, the ruling finds favour with other elite universities and, of course, the Obama administration.\nThe message bruited by progressive elites that affirmative action is both ethical and legally normative has trickled down to permeate the institutional culture everywhere in the U.S. Universities, major corporations and franchises actively recruit minorities and sponsor scholarships for them, and even give bonuses to managers who successfully recruit and promote black hires. Even public services in which high standards for competence can make all the difference in public safety, as in fire departments, have signed on to aggressive affirmative action programs, sometimes with what would be entertaining results, if they were not so disquieting.\nThe left’s most beguiling argument for affirmative action is its necessity to redress past injustices: that even though the practice may cause a certain collateral damage, the benefits conferred on the formerly disadvantaged group are worth the cost to others. Horowitz and Perrazo respond that the artificial leveling of the playing field is a “totalitarian” impulse and a threat to freedom. “One standard and one justice for all…is the only equality that is not at odds with individual freedom.” Affirmative action, they say, harms more than the individuals it displaces.\n“When enforced by government and backed by law, it tears at the very fabric of the social order, regardless of whom it benefits. The wounds that the principle of separate and unequal inflicts on the community are incomparably greater than the damages incurred by individuals or the benefits that accrue to them. Building racial bias into the framework of the nation compromises the neutrality of the law that governs us all. It corrupts the standards that make a diverse community possible, and creates a racial spoils system that is the antithesis of the American dream, which was Martin Luther King’s dream as well. By corrupting the principle of neutrality, racial privilege breaks the common bond between America’s diverse communities and undermines the trust that makes the nation whole.”\nJust so. The erosion of common bonds and the undermining of trust between our communities is proceeding apace before our eyes in daily reports of encouraged or actual violence – not in spite of, but because of the erroneous progressive belief that separate and unequal treatment of citizens based on history and color is the way to bring about an equal and united citizenry.\nDavid Horowitz is once again to be commended for his unwavering resistance to reprehensible good intentions on the left and exposure of the hell to which they are the paving stones, as well as for his eloquent commitment to the fundamental conservative belief that the principle of individualism as America’s Founders conceived it is the only path to the true equality all right-thinking Americans aspire to.\nBarbara Kay is a columnist for the Canadian newspaper National Post and a member of the Board of Governors of the conservative student newspaper, princearthurherald.com.","url":"https://www.breitbart.com/politics/2016/08/01/progressive-racism-david-horowitzs-new-book-unveils-lefts-assault-mlks-dream-american-social-contract/"}
