{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:09:06","date_modify":"2018-10-30 20:09:06","date_publish":"2015-05-02 00:27:32","description":"A men's magazine, to renew interest in the rise of HIV and AIDS, is printing select covers with ink infused with HIV infected blood.","filename":"data/vaneerConsumption/ProgressiveMensMagazinePrintsCoverUsingInkMadeofHIVInfectedBlood.json","image_url":"https://media.breitbart.com/media/2015/05/Vangardist-HIV-Magazine.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_05_01__1540930146.html","title":"'Progressive' Men's Magazine Prints Cover Using Ink Made of HIV Infected Blood","title_page":"'Progressive' Men's Magazine Prints Cover Using Ink Made of HIV Infected Blood","title_rss":"NULL","source_domain":"breitbart.com","text":"A magazine that bills itself as a “progressive men’s magazine” is seeking to renew interest in the rise of HIV and AIDS in the world by printing a select number of magazine covers with ink infused with HIV infected blood.\nThe special edition of 3,000 copies was printed to remind the world that HIV has not gone away and has, in fact, only grown.\n“There’s been an 80 percent increase in HIV in the last 10 years — that’s according to the World Health Organization — and that’s pretty shocking,” said Jason Romeyko, the cover’s creator and the Executive Creative Director of Saatchi & Saatchi Switzerland. “The reason why that’s happening is people just aren’t talking about it anymore.”\nThe magazine’s publishers want to “reignite” the HIV conversation.\nThe Vienna-based magazine Vangardist created the special ink with the blood from a group of three HIV infected people who donated their blood for the project over a series of months. One is a 26-year-old gay man from Berlin, one is a heterosexual man who wished to remain anonymous, and the third is a 45-year-old mother who got infected by a husband who never told her he was HIV positive.\nDespite the virulence of AIDS, the publishers hasten to note that the covers are 100 percent safe and cannot give anyone the infection.\n“Scientifically, the virus dies naturally outside the body. It takes about 30 minutes for it to decompose,” Romeyko said.\nRegardless, after conceptualizing the cover, the publishers did report that they had a hard time finding a printing company that would take on the project. Ultimately, a small print shop owner took the job but decided to do the work himself because he didn’t want to expose his employees to any possible danger.\nBut Romeyko wanted to send a message that HIV isn’t something to completely fear. “We wanted people to actually hold the magazine and just make the comparison–there’s nothing wrong with holding someone who’s HIV positive,” he said.\nThe magazine doesn’t come out until next week, so it remains to be seen if some newsstands will refuse to sell the issue.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/the-media/2015/05/01/progressive-mens-magazine-cover-made-with-ink-from-hiv-infected-blood/"}
