{"authors":[],"date_download":"2018-10-30 00:54:02","date_modify":"2018-10-30 00:54:02","date_publish":"2017-01-06 00:00:00","description":null,"filename":"data/vaneerConsumption/ProgressivesReallyAreDeranged.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2017_01_progressives_really_are_deranged_1540860842.html","title":"Progressives Really Are Deranged","title_page":"Progressives Really Are Deranged","title_rss":"NULL","source_domain":"americanthinker.com","text":"Progressives Really Are Deranged\nIn the wake of Donald Trump's election victory, progressives have doubled down with charges that he is \"dangerous\" and \"extreme.\" Just this week, Rosie O'Donnell charged that Trump is \"mentally unstable\" – that following her earlier vow to emigrate if Trump won. (No sign of emigration yet.) Sally Field finds \"no evidence\" that Trump \"can do one single thing he said he could.\" (He's already done several, saving thousands of jobs.) An article on commondreams.org, a progressive website, finds Trump \"vindictive\" for responding to a union official who questioned his Carrier jobs numbers. And Sen. Schumer now threatens to block any Supreme Court nominee Trump might pick, thus keeping the Scalia seat and any future vacancies permanently open. In truth, it's Trump's critics who are the extremists. Their real problem isn't that Trump is dangerous or not mainstream. It's just that he's not one of them. So they're going to block anything that's not exactly what they want. That's not a political approach worthy of a democracy. It's what you would expect in Venezuela or Cuba.\nOf course, Trump has stepped on their toes. He's had the audacity to nominate businessmen and women for cabinet posts, and he speaks of America as if he really loves the place. Why should that bother progressives? Because they detest capitalism, and they disagree with America First. Nor is \"rebuilding our military\" a goal that endears a president-elect to the left. Like Obama, most progressives want to cut military budgets even more, cede control to a U.N. controlled by dictators, and permanently \"lead from behind.\" That amounts to quietism on a grand scale, and its effect is to embolden our enemies. For a great nation to withdraw from global politics is, by definition, extreme. It was tried before, with Bill Clinton's wrist-slap response to terrorist attacks of the 1990s and with Jimmy Carter's ineffectual response to the Iran hostage crisis. In both cases, our enemies gained strength from our weakness. Not using the term \"Islamic terrorism\" for eight years is also pretty extreme. Obama called the Orlando nightclub killing the result of \"extremist ideology\" but refused to call it either \"Islamic\" or \"terrorism.\" Was it ideology, or was it hatred of the West motivated by Islamic extremism? Likewise, the president has carefully danced around the term \"ISIS,\" the label commonly associated with beheadings and other particularly brutal acts. He thought that by avoiding the emotion-laden term \"ISIS,\" he could evade having to respond with force. He preferred \"ISIL,\" a more neutral term designed to bury the subject. But the bombings and executions kept coming. An Islamic terrorist by any other name is just as deadly. That degree of avoidance of reality – accompanied by Obama's plan to bring 110,000 Islamic \"refugees\" to America in just the current fiscal year – is nothing if not extreme. Actually, most progressives are even more radical – they've criticized Obama for not letting in unlimited numbers. A piece in the Huffington Post argues that the case for open borders is \"not as radical as it may seem.\" One of the author's 16 reasons for open borders is that \"Europe opened many of its borders and the sky didn't fall.\" That was written in September 2014, just ahead of the December attacks in Tours, Dijon, and Nantes, France, and with over 200 terrorist attacks occurring or plotted in 2015. Worse followed with massacres in Paris, Nice, Brussels, and Berlin. Yet progressives want to open our borders to everyone, and with their \"sanctuary cities\" to defend those here illegally. When Rahm Emanuel proclaims that \"Chicago will always be a sanctuary city,\" I have to respond, \"You cannot be serious.\" But the left is serious. Emanuel has urged illegals to dial 311 to get legal representation and other forms of taxpayer-funded support. Is that not extreme? There are over 200 sanctuary cities in the U.S., each of them threatening to ignore federal deportation orders for illegals. Nullification on this scale has not been attempted since before the Civil War, and it is unlikely to succeed, but it is important to recognize how radical the sanctuary city position actually is. According to the Supremacy Clause within Article VI of the Constitution, neither individual cities nor states can pre-empt federal law with regard to immigration and other matters clearly within federal jurisdiction. But progressives want to open our borders to tens of millions of illegal immigrants from every land. Given the evidence of what is happening in Europe, that proposition is extreme. Then there are the charges of racism and sexism. The mindset of progressives today is that anyone who does not embrace the whole radical program should expect to be charged with everything from fascism to sexism to classism, even if his only \"crime\" is philosophical disagreement. Ad hominem attack is the lowest form of rhetoric, but it is now the left's principal mode of argument. That shift in progressive tactics is a departure from every recognizable form of civilized debate, but then the left is no longer interested in debate. While familiar in totalitarian systems, the left's slash-and-burn tactics are a departure from everything we've known in the past. Hillary Clinton's strategy of demonizing her opponent with no regard for the issues was of this sort, and it almost worked. While progressives are extreme, it's Trump who comes across as grounded, even-tempered, and mainstream. Since the election, Trump has gained the trust of the people with his efforts to save jobs and his calm decision-making. His cabinet nominees are men and women of great experience and character. All of them have one thing in common: getting things done. Nothing extreme about that. As hard as it is to comprehend, progressives really do believe that Trump – a man who wants to save jobs for ordinary Americans, protect us against terrorism and other threats, and restore prosperity – is extreme and dangerous. He is dangerous because he might just make America great again. Above all else, progressives do not want to see America mighty again. They seem to want a country that has the same influence on global affairs as the Principality of Monaco. Whatever the reason, progressives are really upset this time around. They hated Reagan, and they despised George W. Bush, but their response to Trump is beyond hateful. It is deranged. Do we need to add that derangement is, by definition, extreme? Jeffrey Folks is the author of many books and articles on American culture including Heartland of the Imagination (2011).","url":"https://www.americanthinker.com/articles/2017/01/progressives_really_are_deranged.html"}
