{"authors":[],"date_download":"2018-10-30 14:22:22","date_modify":"2018-10-30 14:22:22","date_publish":"2017-01-25 00:00:00","description":null,"filename":"data/vaneerConsumption/Progressivespostelectionguilttherapy.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_progressives_postelection_guilt_therapy_1540909342.html","title":"Progressives’ post-election guilt therapy","title_page":"Progressives’ post-election guilt therapy","title_rss":"NULL","source_domain":"americanthinker.com","text":"If last Saturday’s pink-clad marchers had shown the same enthusiasm for Hillary Clinton that they now demonstrate against Donald Trump, she might be sitting pretty in the White House.\nBut they didn’t – and she isn’t. And one of the reasons is that their belated display of presumptive “solidarity” was missing when it mattered most: during the campaign. Where were the massive crowds at Hillary’s political rallies? Why was it necessary to mount carefully scripted backdrops underscoring “identity politics”? How is it possible that the Democrats greatly outspent their adversaries and still lost? And how did it come to pass that liberals, who think themselves worthy, now find themselves forced to tolerate a man they deem unworthy in the White House?\nLast weekend, we witnessed huge, orchestrated anti-Trump “women’s” marches in the nation’s capital and across the country. They were even organized in foreign cities, as if their citizens’ uninformed meddling in our politics is perfectly acceptable, even if they resent our involvement in theirs.\nIf we cannot pinpoint a clear objective behind these women’s marches, at least we can recognize them as opportunities to vent anger, fear, and disappointment on a massive, attention-getting scale. Such gatherings likely provide an “ah, I feel better now” moment. Despite the nasty rhetoric, there was a celebratory atmosphere that makes them seem like itinerant block parties, rather than substantive demonstrations. By contrast, most marches in the past have taken on a more somber cast and were centered on a specific cause or policy reform, such as the right to vote, the integration of schools and housing, better working wages and conditions, etc.\nIn the case of these solidarity marches, however, the only overriding cause seems to be the right of a woman to have an abortion. This has always struck me as one of those position papers that somehow drifted onto the wrong desk, since liberals portray themselves as inclusive, righteous respecters of all life and as staunch defenders of “the most vulnerable.”\nThat aside, a few spokespersons did mention the inequities in women’s pay and the need for a higher minimum wage. But these “issues” didn’t spring up when Trump took the oath of office. They have been thorns in some sides for a long time. And the protests about such concerns usually happened at the scene of the supposed crime: in front of carefully selected businesses such as McDonald’s and Walmart.\nIn 1995, at the United Nations’ Fourth World Conference on Women in Beijing, Hillary Clinton famously said, “Women’s rights are human rights.” I never grasped why that statement was considered either unique or memorable, but the feminists loved it, and it has been widely quoted. So it is ironic that the liberals’ current stance of solidarity seems to have narrowed their focus to women, as opposed to humans, giving them an unappealing tinge of self-promotion and even martyrdom.\nBy all societal standards, America women would seem to have it made. If the situation isn’t ideal, government policy is not to blame. So what are the compelling reasons so many women felt the urge to gather in the streets shouting slogans and obscenities? To their obvious feelings of disappointment, uncertainty, and deep-seated fear over the election results, I would add guilt. The outspoken “solidarity” liberals are now trying to project was not so clearly on display when it counted most: during the candidacy of Hillary Clinton. The reasons may be manifold. Many women supported Bernie. And although his exit from the race was a foregone conclusion, these Sandernistas nevertheless had trouble accepting it.\nAfter that, many who had felt the Bern reluctantly pledged their support to Hillary, while others simply sat out the rest of the election season. Who knows how many votes were cast for Hillary out of grudging support for her or out of hatred for Trump? Or how many weren’t cast for any candidate? After all, it didn’t seem too important back when a Trump presidency wasn’t supposed to happen. But it did, and as a result, these marches have in part become guilt trips for those who failed to take seriously the ultimate importance their level of support might play in the long run.\nThe biased media hoodwinked them into believing that a Clinton victory was inevitable, and that her opponent – whom they saw as a brash, insensitive bully – had no chance of winning. The left-leaning gurus and pollsters were adamant on this point. “Not to worry,” they all but cooed. “A virtual third term for Obama is in the bag.” They insinuated that the Republican candidate had no viable pathway to the presidency, period.\nDonald J. Trump was clearly underestimated by the scornful liberal elite, who clung to the infallibility of their proven strategy that won them the last two presidential elections. If Trump attracted tens of thousands more supporters to his rallies than Clinton did...so what? Democrats smugly trusted that their hitherto superior ground game would assure the right outcome. They naively suggested that those who showed up at Trump rallies wouldn’t necessarily show up at the polls to vote for him.\nThis liberal hubris was so pervasive that even before the first votes were tallied on the eve of the election, my daughter announced with finality, “Trump isn’t going to win.” I believed it myself. Like many Republicans, I was reluctant even to watch the returns on TV. I thought of retiring early – taking a sleeping pill, if necessary – and facing the inevitable the following morning. Fortunately, political animals tend not to go into premature hibernation.\nIn the period between the election and the inauguration, their leadership’s mantra switched to fear-mongering. Trump couldn’t be dismissed anymore, so he had to be further demonized. Even though the election loss was pinned on other outside forces, the reality of the results was sinking in on Democrats – and so was a sense of culpability.\nHaving survived shock and denial, they sprang into action on the day after Trump became president. (Not theirs, of course.) For many solidarity participants, the exercise seemed less a march than a guilt trip. They had seriously underestimated Trump; he had bested them at a political game they should have won. So if they hadn’t turned out in full force for Hillary, they would sure as hell show up in full force to turn out Trump.\nThough liberals say they abhor distinctions made along gender lines, these marches were loaded with sexually explicit displays and raunchy innuendo. Heightened by their image of Trump as a womanizer bent on smutty locker room talk, female marchers may have felt emboldened – perhaps even titillated – to do the same. Some of them even dressed up as vaginas, though this – along with crude slogans and posters – offended many of us.\nThese combined selfie love fests and Trump hate fests will likely continue for some time to come. If they do, the president must bear some of the blame. He may be the Energizer Bunny, but he gets hopping mad when he finds that – to put it mildly – not everybody likes him. As long as these thousands of chicks in cat hats can get under President Trump’s skin, they will turn out in force to do so. It’s a form of guilt therapy that’s hard to beat.","url":"https://www.americanthinker.com/blog/2017/01/progressives_postelection_guilt_therapy.html"}
