{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:10","date_modify":"2018-10-30 19:08:10","date_publish":"2018-09-11 05:30:54","description":"Anger as Sessions Orders Immigration Judges to Enforce Immigration Law.","filename":"data/vaneerConsumption/ProgressivesOutragedbyJeffSessionsProAmericanBordersPolicy.json","image_url":"https://media.breitbart.com/media/2018/08/jeff-sessions-8-9-18-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/economy_2018_09_10__1540926490.html","title":"Progressives Outraged by Jeff Sessions' Pro-American Borders Policy","title_page":"Progressives Outraged by Jeff Sessions' Pro-American Borders Policy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Immigration lawyers and progressives are furious with Attorney General Jeff Sessions’ public support for the immigration laws which help Americans first.\n“You have an obligation to decide cases efficiently and to keep our federal laws functioning effectively, fairly, and consistently,” Sessions told 44 new Immigration Judges in a Monday speech. He continued:\nMany in this country take a different view. They object to any enforcement that works. They evidence an open borders philosophy. Let me say this clearly: it is perfectly legitimate, moral, and decent for a nation to have a legal system of immigration and to enforce the system it adopts … Open borders is directly contrary to the INA [Immigration and Naturalization Act], which governs our work. The INA is not perfect, but it plainly lays out a rational scheme for immigration that tells our officers and judges who is to be admitted, how many and under what circumstances.\nSessions’ opponents quickly resorted to the “racist!” claim. Comedian Chelse Handler Tweeted:\nAnother despicable inhumane act of racism. https://t.co/k8iHXdg6wl — Chelsea Handler (@chelseahandler) September 10, 2018\nAnil Kalhan, a lawyer at Drexel University, compared the Attorney General to a Confederate general in the Civil war:\nYou know what's not \"professional,\" Beauregard? Interfering with the independence and integrity of immigration courts. Immigration judges are not your \"mass deportation agents,\" to borrow @AvidehNILC's characterization of your actions and attitude. 12/ https://t.co/FAmO9yiUuK — Anil Kalhan (@kalhan) September 10, 2018\nThe director of the immigration-lawyers trade association suggested that Sessions was violating the law:\nA shocking disregard for the principles on which our judicial system is supposed to be based. America’s formula: 2 lawyers + 1 independent judge = best chance for justice. Session’s formula: 1 star chamber = deportation for all. @CNNPolitics https://t.co/gR5ktiMSd1 — Ben Johnson (@AILAExecDir) September 10, 2018\nA former ACLU migration advocate slipped into swearing:\nwhat in the actual f. The IJs I used to work for must have been appalled by this statement from their boss. It's contrary to @TheJusticeDept mission to attack, writ large, every single lawyer who defends clients against the gvt's charges. There's not even a veneer of impartiality https://t.co/gdpGKRDgv9 — Madhuri Singh Grewal (@MadhuGrewal) September 10, 2018\nBut Sessions did not order the judges to cheat. Instead, he noted that immigration lawyers and judges have different roles. He said:\nGood lawyers, using all of their talents and skill, work every day—like water seeping through an earthen dam—to get around the plain words of the INA to advance their clients’ interests. Theirs is not the duty to uphold the integrity of the act. That is our most serious duty. Of course, we must always respect the rights of aliens who come before our courts. Just as we defend immigrant legal rights we reject unjustified and sometimes blatantly fake claims. The law is never serviced when deceit is rewarded so that the fundamental principles of the law are defeated.\nAnother immigration lawyer tried to criticize Sessions by urging lawyers to do as Sessions described:\nGood immigration lawyers also have a sacred duty to interpret the INA on behalf of the client, not to get around it as Sessions falsely claims, but to ensure that it is being applied consistent with federal case law and the refugee convention https://t.co/t0NGTryuXB — Cyrus Mehta (@cyrusmehta) September 10, 2018\nThe trade union for immigration judges complained about Sessions using his legal authority as Attorney General to direct their work. CNN reported:\n“We just find it really troubling and problematic that the AG just does not seem to appreciate the distinction that we have as immigration judges from the rest of the department, both the US attorney’s office and the Department of Homeland Security,” said Ashley Tabaddor, of the National Association of Immigration Judges. “We are not one and the same as them.” … Tabaddor and the judges’ union have long been pushing for the courts to be taken out of the Department of Justice and set up as an independent system, similar to the bankruptcy courts. Tabaddor has served as an immigration judge since 2005. While other administrations have sought to influence the courts in some ways, like how to prioritize cases, she said judges have not witnessed anything like this administration under Sessions. “We have never really seen the level of explicit and deep sort of scrutiny and use of the court consistent with the executive branch’s political policies,” Tabaddor said.\nKalhan at Drexel made the same claims:\nStill, it is particularly jarring and troubling to see Sessions engage in his Immigration Judge Dredd shtick in front of an audience of brand new immigration judges themselves. Imagine the chilling effect on their decision-making. 15/ — Anil Kalhan (@kalhan) September 10, 2018\nBut Sessions is the Attorney General and is responsible for operating the nation’s immigration laws. In his speech, he gave no concessions to his critics:\nThe American people are good and just. They rightly want a lawful system they can be proud of. They believe that persons who want to come here should file their claim and wait their turn. They believe that we should not encourage them to enter our country in a criminal manner. And, as I think you all would agree, the INA was enacted to make those principles a reality. The Department of Justice is working hard to uphold those principles. And so are our U.S. Attorneys. When I was a U.S. Attorney, I pushed for maximum production from my Assistants and our staff. And now as Attorney General, my team and I are doing the same thing—encouraging our USAOs to achieve the highest levels of excellence. The American people are good and just. They rightly want a lawful system they can be proud of. They believe that persons who want to come here should file their claim and wait their turn. They believe that we should not encourage them to enter our country in a criminal manner. And, as I think you all would agree, the INA was enacted to make those principles a reality. The Department of Justice is working hard to uphold those principles. And so are our U.S. Attorneys. When I was a U.S. Attorney, I pushed for maximum production from my Assistants and our staff. And now as Attorney General, my team and I are doing the same thing—encouraging our USAOs to achieve the highest levels of excellence.\nRead the entire speech here.","url":"https://www.breitbart.com/economy/2018/09/10/progressives-outraged-by-jeff-sessions-pro-american-borders-policy/"}
