{"authors":[],"date_download":"2018-10-22 23:25:15","date_modify":"2018-10-22 23:25:15","date_publish":"2014-09-27 00:00:00","description":"One expert says that the negotiators in the room are inclined to move faster, but the deeply opposed domestic constituencies leave both sides skittish.","filename":"data/vaneerConsumption/ProgressInNuclearTalksWithIranIsStillGlacial.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=351979054_1540250715.html","title":"Progress In Nuclear Talks With Iran Is Still Glacial","title_page":"Progress In Nuclear Talks With Iran Is Still Glacial : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nThis is WEEKEND EDITION from NPR News. I'm Scott Simon. Iran and six world powers ended another round of talks on Iran's nuclear program, noting that not enough progress has been made, but agreement is still possible.\nNPR's Peter Kenyon reports from New York that Iran's president now says that the pace of progress needs to pick up, if nuclear diplomacy is to have a chance.\nPETER KENYON, BYLINE: The optimistic scenario had this round of talks laying the groundwork for a breakthrough, with progress being overseen by top diplomats and heads of state in town for the U.N. General Assembly meetings. That never materialized. Secretary of State John Kerry and his Iranian counterpart, Mohammad Javad Zarif, did sit down again, but progress was described as slow, even by Zarif's boss, President Hassan Rouhani.\nThe two men were deeply involved in Iran's previous effort to strike a nuclear deal with the West over a decade ago. Rouhani says in all his years being around such negotiations, he's never seen as serious an atmosphere as during these New York talks. He's heard here through an interpreter.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRESIDENT HASSAN ROUHANI: (Through translator) So we do feel that the serious will does exist. But on this important path, every side must show courage.\nKENYON: Rouhani injected a note of urgency as he called for both courage and flexibility.\n(SOUNDBITE OF ARCHIVED RECORDING)\nROUHANI: (Through translator) The remaining time for reaching an agreement is extremely short. Progress that has been witnessed in the last few days have been extremely slow.\nKENYON: How to limit Iran's uranium enrichment capacity is a big issue, as is how and when to lift economic sanctions, if Iran agrees to nuclear restrictions and intrusive inspections. Rouhani publicly gave no ground on either issue, insisting on all of Iran's self-described nuclear rights and declaring that all sanctions, whether American, European, or from the U.N., must melt away once an agreement is reached.\nA senior U.S. official says while the two sides did not reach an understanding on all the major issues, they do have understandings that may help move things forward and they have an enormous amount of details to work through.\nJim Walsh with MIT's Security Studies Program says if it were a purely technical discussion, the solutions would come much more easily. It's the politics that add layers of difficulty.\nJIM WALSH: I've heard both sides tell me and I believe it - if was it was just the negotiators in the room, they could solve it today. But I think both have domestic constituencies back home. Both have hardliners and both are very sensitive about selling that deal if they get one.\nKENYON: After what appears to be a high pressure but inconclusive round of talks in New York, many will be watching to see how Iranian politicians portray the effort back home.\nIran analyst Ali Vaez, with the International Crisis Group, says if Rouhani begins to emphasize how Iran might proceed in the absence of a deal, that will be a sign that the veteran politician is on the defensive as hardliners step up their attacks.\nALI VAEZ: When Rouhani is returning to Tehran, based on the lessons learned this week and the feedback that he gets from foreign ministers and even others, he will have to pave the ground, either for success or failure. But he needs to introduce a new narrative inside the country if he wants to politically survive, one way or another.\nKENYON: Analysts expect hardliners in Tehran, Washington, Israel and elsewhere to be sharpening their knives as negotiations resume some time next month.\nPeter Kenyon, NPR News, New York.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=351979054"}
