{"authors":[],"date_download":"2018-10-30 14:21:32","date_modify":"2018-10-30 14:21:32","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/ProlifeTrumpandverbaltrickeryoftheleft.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_prolife_trump_and_verbal_trickery_of_the_left_comments_1540909292.html","title":"Pro-life Trump and verbal trickery of the left","title_page":"Blog: Pro-life Trump and verbal trickery of the left","title_rss":"NULL","source_domain":"americanthinker.com","text":"Back when Donald Trump was the unimaginable presidential candidate, preachy Catholic pundits consistently rolled their eyes at his claim to be pro-life on abortion. If voters believed that whopper, we were told, then the brainy commentators wanted to sell them a bridge – and maybe Trump Tower. Now Trump has begun to make good on his promises to pro-life voters, and the same masters of pro-life purity are telling us that it just ain’t enough. In order to be truly pro-life, they intone, Trump must now continue the cool Obama policies of ignoring U.S. immigration laws and admitting huge numbers of military-age males from Muslim-majority nations, on the grounds that they are “refugees” from something. Hogwash. Immigration and the admission of refugees are not life issues. They are not life issues even when the lives of prospective immigrants and refugees are in actual danger. The life issues are abortion, infanticide, and... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/prolife_trump_and_verbal_trickery_of_the_left_comments.html"}
assures us that it does not violate that commandment. The life issues are those involving direct attacks on innocent human life. Period. Any other way of defining them is an attempt to muddy the waters.\nTo the “consistent pro-life” crowd, everything is a life issue. The Second Amendment? You must oppose it. Otherwise, you are not truly pro-life. Violent video games? You must oppose them. Otherwise, you are not truly pro-life. Obamacare? You must support it. Otherwise, you are not truly pro-life. And the list will go on endlessly. Every species of government welfare eventually becomes a pro-life issue. You refuse to finance sex reassignment for obesity-challenged “trans” “women” in federal custody? What? Why, then, you are disregarding the value of those lives! You can’t claim to respect the value of every human life, you inconsistent anti-abortionist, you!\nIf there were an actual inconsistency in Trump’s policies, a conflict between his pro-life policy on abortion and his less than truly pro-life policies on immigration and refugees, what would it look like? Well, in order to pull even with Planned Parenthood and its supporters, Trump would have to advocate seizing immigrants and refugees, killing them, and auctioning their organs off to scientists for medical experiments. Are these the Trump policies on immigration and refugees? Nope. Therefore, there is no inconsistency. QED.\nThis is not to say there’s no reason to oppose Trump policies on these other issues. I myself like Mexicans a lot better than I like Democrat leaders. Facing the possibility of a Hillary presidency, I gave serious thought to leaving the country – not for Canada, but for Mexico. For one thing, relocation to Mexico would do a lot to improve my Spanish. Since Hillary, favored by all the experts, went down in crashing defeat, trailing vodka and F-bombs as she fell, I wouldn’t mind improving my Spanish by admitting more Mexicans to my native land, not fewer. But there are those little problems of respect for the law and preservation of national identity. These problems are not life issues – but they are values that deserve some attention even from bishops and Jesuits. Will those luminaries please give such values a little thought? If they don’t overdo, it won’t make their heads hurt.\nThe dilution of the case against abortion is, of course, something that the right-to-life movement has asked for by insisting on such adjectives as “pro-life” in the first place. Pollyannas in the movement didn’t want to be viewed as negative. They wanted to be positive, positive, positive! Maybe this is just a distinction of temperament. For my own part, I don’t mind being called anti-abortion. Not at all. Accepting such a label necessarily implies that the opposing side is pro-abortion – a fact that the more honest amongst them already concede.\nStill, “pro-lifer” is a useful abbreviation. You try saying, “Eighteen anti-abortionists ate enchiladas in the open air,” five times fast. And “pro-lifer” has now been hallowed by decades of use. In case the consistent crowd didn’t know, that’s actually how words become standard usage – not by extensive attempts at twisted logic. So I am perfectly willing also to be branded as a “pro-lifer” – with the standard meaning.\nJust don’t extend that meaning. If everything is a pro-life issue, then nothing is.\nTom Riley is well known as a poet of the formalist school and maintains a blog entitled Flammeus Gladius.","url":"https://www.americanthinker.com/blog/2017/01/prolife_trump_and_verbal_trickery_of_the_left.html"}
