{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:55:01","date_modify":"2018-10-30 21:55:01","date_publish":"2015-08-26 20:32:30","description":"We think that will put Planned Parenthood and what they do in the proper perspective and I hope this will be one more nail in the coffin.","filename":"data/vaneerConsumption/ProLifeLeadersWantMargaretSangerBustRemovedFromNationalPortraitGallery.json","image_url":"https://media.breitbart.com/media/2015/03/margaret-sanger-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_26__1540936501.html","title":"Pro-Life Leaders Want Margaret Sanger Bust Removed From National Portrait Gallery","title_page":"Pro-Life Leaders Want Margaret Sanger Bust Removed From National Portrait Gallery | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At a press conference planned for Thursday, ForAmerica chairman Brent Bozell will join other national pro-life leaders and a coalition of black pastors who will demand that the bust of Planned Parenthood founder and eugenicist Margaret Sanger be removed from the Smithsonian Institution’s National Portrait Gallery (NPG).\nAccording to a news release, Bozell will join Bishop E.W. Jackson, president of STAND and Ministers Taking a Stand, at the NPG, along with the following leaders to demand the removal of Sanger’s image from the gallery:\nSenior Pastor of Joy Christian Fellowship, Dr. Leon Threatt\nSr. Pastor of Zoe Bible Church, Pastor Iverson Jackson\nSr. Pastor of More Grace Ministries, Pastor Cecil Blye\nSenior Pastor, Kingdom Equippers Ministries, Pastor Garfield Williams\nFormer U.S. Ambassador to the UN Commission on Human Rights, The Hon. J. Kenneth Blackwell\nPresident of Global Life & Family Mission, Rev. Johnny Hunter\nChairman of the Frederick Douglass Foundation, Rev. Dean Nelson\nCo-Founder of the Radiance Foundation, Ryan Bomberger\nSenior Pastor of Hope Christian Church, Bishop Harry Jackson\nFounder of the Coalition on Urban Renewal and Education (CURE), Star Parker\nFounder of Live Action, Lila Rose\nPresident of the Susan B. Anthony List, Marjorie Dannenfelser\nFounder of Able Americans, Melissa Ortiz\nPresident of the Maryland Family Alliance, Pastor Derek McCoy\nPresident of Hosea Initiative, Terry Beatley\nAs Breitbart News reported August 14, Ministers Taking a Stand, led by president Bishop E.W. Jackson, a senior fellow for the Family Research Council, sent a letter last week to Kim Sajet, director of the NPG, asking for the removal of Sanger’s likeness “from all National Portrait Gallery exhibits.”\nThe letter stated:\nPerhaps the Gallery is unaware that Ms. Sanger supported black eugenics, a racist attitude toward black and other minority babies; an elitist attitude toward those she regarded as “the feeble minded;” speaking at rallies of Ku Klux Klan women; and communications with Hitler sympathizers. Also, the notorious “Negro Project” which sought to limit, if not eliminate, black births, was her brainchild. Despite these well-documented facts of history, her bust sits proudly in your gallery as a hero of justice. The obvious incongruity is staggering!\nIn an interview with Breitbart News, Jackson said his group received a response from the NPG, which referred to Sanger as a person who struggled for justice because she tried to make birth control and reproductive freedom available to poor women.\n“We responded back that this was not Sanger’s motivation,” Jackson asserted. “Her motivation was stopping people whom she considered ‘defective’ from having what she would call ‘defective children.’”\n“She thought that black people needed to be stopped from propagating and growing their population, and other people she called ‘feeble-minded,’” he added. Jackson said the fact Sanger is held in high esteem is “outrageous.”\n“We will not rest until it’s taken down,” he said. “We want to make sure that everybody in America knows who Margaret Sanger actually was. We think that will put Planned Parenthood and what they do in the proper perspective and I hope this will be one more nail in the coffin of Planned Parenthood.”\nAsked by Breitbart News how President Obama could be supportive of Planned Parenthood – founded by a racist – when he and his administration seem to cite racism continuously as the cause of much of what is wrong with this country, Jackson said, “Racism is only an evil to the Obama administration and those that support it when it helps their ideology and their cause. Otherwise, it should be ignored. We see that again and again.”\n“This president has demonstrated such a callous disregard for human life,” Jackson continued. “It’s almost unfathomable to me, but, of course, it’s in keeping with his record. He opposed the Born Alive Infant Protection Act – and that was nothing but infanticide, and he supported that! It doesn’t surprise me, but it still is unbelievable that a president could think that way.”\nDr. Alveda King, niece of Dr. Martin Luther King Jr., and Director of African American Outreach for Priests for Life, also told Breitbart News, “Sanger was an elitist, racist advocate of limiting, and even eradicating, those she deemed unworthy of life. She wrote of ‘weeding out the unfit,’ of preventing the birth of defectives or those who will become defective.”\n“For the President and other U.S. ‘higher ups’ like Hillary Clinton, Nancy Pelosi and the Congressional Black Caucus to sanction any praise of Sanger and her legacy is an insult to the dignity of all humanity,” she added.\nThe call to remove Sanger’s bust comes following the release of multiple undercover investigative videos, produced by the Center for Medical Progress, in which top Planned Parenthood medical officials explain their methods of harvesting the body parts of aborted babies for potential sale on the open market.\nSince the letter was published, more than 11,000 people have signed a petition calling for the removal of Sanger’s bust from the NPG.\nAdditionally, Texas Sen. Ted Cruz is the first Republican presidential hopeful to support the effort to have Sanger’s bust removed. Cruz and Rep. Louie Gohmert have drafted a letter asking their colleagues in Congress to join them in the campaign.","url":"https://www.breitbart.com/politics/2015/08/26/pro-life-leaders-want-margaret-sanger-bust-removed-from-national-portrait-gallery/"}
