{"authors":["Virginia Hale"],"date_download":"2018-10-30 20:29:04","date_modify":"2018-10-30 20:29:04","date_publish":"2016-06-18 15:54:38","description":"A leading fisherman has demanded Bob Geldof apologise for his Remain flotilla stunt which was “disrespectful to hard working communities”.","filename":"data/vaneerConsumption/ProminentFishermanCallsOnGeldofToApologise.json","image_url":"https://media.breitbart.com/media/2016/06/DSCF9137-1-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_18__1540931344.html","title":"Prominent Fisherman Calls On Geldof To Apologise","title_page":"Prominent Fisherman Calls On Geldof To Apologise","title_rss":"NULL","source_domain":"breitbart.com","text":"A leading fisherman has demanded Bob Geldof apologise for his Remain campaign flotilla stunt which was “disrespectful to hard working communities”. Skipper Jimmy Buchan added he’d never seen such a blatant attack on working class people.\nOn Wednesday UK Independence Party (UKIP) leader Nigel Farage and Labour MP Kate Hoey led a flotilla of fishing boats up the Thames supporting Brexit as better for fishermen. Interrupting the fishermen’s plea to take back control of British waters, multi-millionaire singer Geldof sought to “intercept” the Fishing for Leave flotilla.\nJimmy Buchan, a Peterhead skipper, was on one of 30 fishing boats among the flotilla and called on the celebrity activist to apologise. The Press and Journal reported that Mr. Buchan said:\n“Angry would be an understatement. We went to the Thames to make a peaceful demo to campaign for the Brexit leave campaign because fishermen have been suppressed by the EU for many years.\n“Whether it was a personal attack on Mr. Farage, at the end of the day it wasn’t a UKIP event. Mr. Farage was there supporting the fishermen.\n“Mr. Geldof’s gesturing and everything about it was so wrong. I was on the boat standing next to Nigel Farage when this happened and I could hardly speak.\n“I’ve seen a lot in my 56 years but I’ve never seen hard-working people attacked like this.\n“They were trying to torpedo our peaceful, quiet demonstration. Words fail me. I think he was completely wrong and he should apologise.”\nMr. Geldof and Remain campaigners blasted loud music from their boats to stifle the grassroots protest. The Irish celebrity was photographed giving a two finger hand gesture to the Leave campaigners. Mr. Geldof dismissed the fishermen’s concerns, claiming:\n“Here are the facts about fishing. One, Britain makes more money than any other country in Europe from fishing. Two, Britain has the second largest quota for fish in Europe after Denmark. Three, Britain has the third largest landings. Four, you are no fisherman’s friend.”\nWhile Mr. Geldof is reportedly worth more than £100 million, the job done by the fishermen at whom he sneered has been dubbed “the most dangerous job in the UK”. That means that while Mr. Geldof bathes in media praise for parroting establishment political lines, fishermen in Britain have a one in 20 chance of being killed on the job during their working lives.\nWill Clark, managing director of a Peterhead fish processing farm who supported the flotilla, said: “Considering Geldof is Irish and doesn’t pay full tax with no vote, what’s it got to do with him?\n“It’s disrespectful and he should be stripped of his titles.”","url":"https://www.breitbart.com/europe/2016/06/18/prominent-fisherman-geldof-apologise/"}
