{"authors":[],"date_download":"2018-10-22 21:57:40","date_modify":"2018-10-22 21:57:40","date_publish":"2017-03-16 02:08:13","description":"A group of prominent Australians Thursday urged India's Adani Enterprises to abandon a giant coal mine project near the Great Barrier Reef, warning it could...","filename":"data/vaneerConsumption/ProminentAustraliansurgeIndiasAdanitoabandongiantmine.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/05/wire-226549-1489642698-19_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318672_Prominent-Australians-urge-Indias-Adani-abandon-giant-mine_1540245460.html","title":"Prominent Australians urge India's Adani to abandon giant mine","title_page":"Prominent Australians urge India's Adani to abandon giant mine | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A letter from 90 prominent Australians urging Adani chairman Gautam Adani to not invest in a $16 billion mine near the Great Barrier Reef is due to be delivered, March 16, 2017\nA group of prominent Australians Thursday urged India's Adani Enterprises to abandon a giant coal mine project near the Great Barrier Reef, warning it could damage bilateral ties and even affect sporting links.\nThe controversial Aus$21.7 billion (US$16 billion) Carmichael mine -- destined to be one of the world's biggest -- is set to start construction this year after being given the green light by the federal and Queensland state governments.\nIt still faces several ongoing legal challenges, with a final investment decision by Adani reportedly pending.\nIn a letter to Adani chairman Gautam Adani, due to be hand-delivered Thursday by businessman and environmentalist Geoffrey Cousins, the 90 Australians urged him to reconsider.\nSignatories include former Australian Test cricket captains Ian and Greg Chappell, Pulitzer Prize-winning author Geraldine Brooks, Australian-based British comedian Ben Elton, and rock group Midnight Oil.\nIt cites public opposition, risks to miners' health, the potential impact on the World Heritage-listed reef, which is already suffering from climate change, and India's reputation as reasons not to proceed.\n\"We urge you to think about global warming and public health and listen to the wishes of the people,\" said the letter, designed to counter a visit to Adani headquarters by Queensland Premier Annastacia Palaszczuk this week.\n\"It would be a great shame if this one project were to damage the image of India in Australia.\n\"We understand the Adani Group has not made a final investment decision on the Carmichael coal mine. We strongly urge you to decide to abandon this project.\"\nIan Chappell suggested it could also hurt sporting ties, with the two nations arch cricketing rivals who are currently involved in a fiery Test series in India.\n\"Cricket has a bit to do with the feeling between India and Australia,\" he told the Australian Broadcasting Corporation. \"The thought that this (mine) could affect the relationship, hopefully that'll get through.\"\nThe development proposes exporting coal to India via a massive open-cut and underground coal mine 160 kilometres (100 miles) northwest of Clermont in central Queensland, and a 189-kilometre rail link to port.\nAdani forecasts it will produce 60 million tonnes of thermal coal a year for export with its Australia chief Jeyakumar Janakaraj in December insisting it would have a \"net positive impact on climate change in the world\".\n\"India is a large consumer of coal either way. So if Australia doesn't produce and give India high-quality, highly sustainable mining, it is going to rely on coal that will come from lesser reliable geographies,\" he said.","url":"https://www.dailymail.co.uk/wires/afp/article-4318672/Prominent-Australians-urge-Indias-Adani-abandon-giant-mine.html"}
