{"authors":[],"date_download":"2018-10-22 22:02:54","date_modify":"2018-10-22 22:02:54","date_publish":"2014-05-08 21:50:33","description":"When we arrived, the armed men looked amazingly calm. One of them was playing a video game on his cellphone as he guarded the door to the newsroom.","filename":"data/vaneerConsumption/ProminentUkraineTVStationTakenOverByProRussianMilitia.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/430501/050814_ukraine_armed_gunman_3c92b79516db36d7518246fd4744f6e0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_prominent-ukraine-tv-station-taken-over-pro-russian-militia-n100796_1540245774.html","title":"Prominent Ukraine TV Station Taken Over By Pro-Russian Militia","title_page":"Prominent Ukraine TV Station Taken Over By Pro-Russian Militia","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nImagine this episode of the TV show Newsroom. It’s 2 p.m. and a dozen armed men, some wearing black balaclavas, others just covering their faces with surgical masks, enter the TV network’s headquarters and calmly walk up the stairs. They enter the newsroom and hand the news director a printed letter saying the network is now controlled by forces loyal to a foreign government. The reporters lock themselves in a few rooms at the back of the newsroom and continue to work, while gunmen relax in chairs in the hallways. The police come, but do nothing. The network calls government officials, but they, too, are powerless to respond. It would be a fantastic episode that could only unfold in a nation where any semblance of law and order was lost. But this is no work of fiction. It’s exactly what happened Thursday here in the city of Donetsk, in eastern Ukraine.\nA prominent TV station was taken over by pro-Russian militiamen. When we arrived there, about an hour later, the armed men looked amazingly calm. One of them was playing a video game on his cellphone as he guarded the door to the newsroom. They didn’t even try to stop us from filming inside the station. They refused to talk to us at all.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/prominent-ukraine-tv-station-taken-over-pro-russian-militia-n100796"}
