{"authors":["Laurel Rosenhall"],"date_download":"2018-10-31 00:11:56","date_modify":"2018-10-31 00:11:56","date_publish":"2016-05-11 08:00:00","description":"In their own words “You can’t do that, man, you go to jail for that.” - Sen. Leland Yee on June 20, 2013, talking to an undercover FBI agent who offered","filename":"data/vaneerConsumption/Prop50Theweirdestmeasureontheballotthisyear.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Suspended_3-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944716.html","title":"Prop 50: The weirdest measure on the ballot this year","title_page":"Prop 50: The weirdest measure on the ballot this year | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In their own words “You can’t do that, man, you go to jail for that.” – Sen. Leland Yee on June 20, 2013, talking to an undercover FBI agent who offered him a bribe “What has happened to me could happen to anyone in public office.” – Sen. Ron Calderon on Nov. 13, 2013, after a leaked FBI affidavit accused him of taking $88,000 in bribes “Life ain’t fair.” – Sen. Rod Wright on Aug. 12, 2014, after a jury found him guilty of lying about where he lived when he ran for office in 2008\nIt’s been two years since criminal accusations against three lawmakers rocked the California Capitol. Charged with corruption and perjury in separate cases, three Democratic state senators were suspended from the Legislature in 2014 but kept earning their $95,000 annual salary for many months.\nNow, California voters will get their say on a question prompted by that spate of scandal. Proposition 50 on the June 7 ballot asks whether legislators who are suspended from duty should also have their paychecks taken away.\nIn a year of weird ballot measures – should porn actors be required to wear condoms? – Proposition 50 may be the most unusual one California voters face. Here are three reasons why:\n1. It stems from a bizarre year in the Legislature – not a widespread problem in the state.\nMost measures that make the ballot ask voters to weigh in on a question that impacts the masses: raising taxes, for example, or making marijuana legal. Proposition 50, if approved, would apply to very few people. Only 120 people serve in the Legislature in any given year, and the rules for yanking pay are unlikely to be applied very often. When the Senate suspended then-Sens. Ron Calderon (D-Montebello), Leland Yee (D-San Francisco) and Rod Wright (D-Baldwin Hills) with pay in 2014, it was the first time in state history that legislators were suspended.\nProposition 50 “is a technical but important fix to the fact that the Legislature cannot suspend its members without pay under the constitution,” said Darrell Steinberg (D-Sacramento), the former state Senate leader who carried the bill that put the measure on the ballot. “It’s nothing more, nothing less than that.”\nThe state constitution already allows legislators to be expelled. But Steinberg in 2014 said such a permanent action was inappropriate because the senators’ cases were still making their way through the justice system. Since then, Wright was sent to jail for perjury; Yee pleaded guilty to taking bribes; and Calderon pleaded not guilty in a corruption case that has yet to go to trial.\n2. No one is spending any money for or against it.\nBy the time California voters weigh in on a ballot measure, they’ve typically been bombarded by millions of dollars of advertising for and against it. Supporters and opponents of Proposition 50, by contrast, have spent so little money that they have not filed a single campaign finance report with the secretary of state. That means they’ve spent less than $2,000 on a bare-bones publicity effort that consists of arguments in the voter guide and two simple websites.\nThe lack of spending reflects a lack of big-money interests involved in this issue. There is no industry battle at play; no unions or corporations stand to win or lose. The scarcity of publicity also indicates that supporters expect the idea will be politically popular.\n“The voters will look at this and say, ‘It makes sense – you act badly you shouldn’t get paid.’ But people have to look a little deeper,” said Jessica Levinson, a professor of political law at Loyola Law School.\nThe measure sets a high bar for suspending a legislator – approval by two-thirds of the lawmaker’s house. But it doesn’t lay out specific reasons a legislator could be suspended, prompting critics to say it could be wrongly used for retribution if a lawmaker takes a political stand leaders don’t like.\n“This is going to be a great tool for them to use against people like me who stand up against the majority,” said Sen. Joel Anderson (R-Alpine).\nHe was the only senator who voted against suspending Wright, Yee and Calderon, arguing that it amounted to a paid vacation and the Senate should expel them instead. That would have stopped their paychecks and allowed voters to choose a replacement.\n3. Proposition 50 is the only change of law on the statewide June ballot.\nCalifornia’s system of direct democracy has spawned a slew of complicated policy questions voters will likely consider this year. Among them are proposals to limit the price of prescription drugs, put new controls on gun ownership and permit recreational use of marijuana.\nBut because of a change lawmakers put in place four years ago, citizen-driven initiatives must land on the November ballot. Legislature-driven measures – such as the constitutional amendment in Proposition 50 – can still make the ballot in June.\nThat means that November’s ballot will be one of the most crowded in years, with voters likely to confront about 20 initiatives. The June ballot, by contrast, asks only one policy question.","url":"https://calmatters.org/articles/prop-50-the-weirdest-measure-on-the-ballot-this-year/"}
