{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:40:04","date_modify":"2018-10-30 22:40:04","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Four decades ago, Gov. Jerry Brown","filename":"data/vaneerConsumption/Proposition57Criminalsentencing.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._57_Criminal_sentencing_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939204.html","title":"Proposition 57: Criminal sentencing","title_page":"Proposition 57: Criminal sentencing | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nFour decades ago, Gov. Jerry Brown embraced tough-on-crime laws that filled the state’s prisons. The overcrowding led the U.S. Supreme Court to rule the state must reduce its prison population and improve medical care to inmates. California has moved lower-level prison felons to county jails, and voters approved measures to limit the state’s three-strikes sentencing law and reduce some felonies to misdemeanors. But, prison overcrowding and high costs continue to plague California.\nWhat would it do?\nProp. 57 would increase the number of nonviolent inmates eligible for parole consideration and enable more inmates to earn credits for good behavior. It also lets judges decide whether to try a juvenile as an adult, likely resulting in fewer young offenders being placed in the adult system.\nWhat would it cost the government?\nReductions in prison population would lead to a savings for state government likely in the tens of millions of dollars each year, according to the state legislative analyst. Meanwhile, counties might incur a cost of a few million dollars a year.\nWhy is it on the ballot?\nGov. Jerry Brown put Prop. 57 on the ballot, arguing that the tough sentencing laws he once embraced have had unintended consequences that over-burdened the criminal justice system. The measure is a piece of his bigger plan to reduce the prison population and save the state money.\nWhat supporters say:\nProp. 57 is a long-term solution that stops wasting costly prison space on non-violent offenders who can be rehabilitated, while keeping dangerous criminals behind bars. It gives judges—instead of prosecutors—the power to decide whether a minor should be tried as an adult, which will improve juvenile justice by reducing racial bias and the number of minors sent through adult courts.\nWhat opponents say:\nProp. 57 is a deceptive measure that could endanger public safety with the early release of inmates convicted of violent crimes such as rape and assault with a deadly weapon. Though the initiative says it only applies to “nonviolent” offenders, the term is broadly defined under California law and applies to certain rapes and assaults.\nShow me the money:","url":"https://calmatters.org/articles/proposition-57-criminal-sentencing/"}
