{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:04:41","date_modify":"2018-10-30 21:04:41","date_publish":"2016-12-22 00:00:00","description":"Annual residential price growth in December ranged from 0% in the City & the fringes to as much as a 13.5% fall in Chelsea and Hyde Park.","filename":"data/vaneerConsumption/PropertypricesincentralLondonarediving.json","image_url":"https://amp.businessinsider.com/images/585c078edd0895857f8b4873-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_knight-frank-stats-on-fall-in-prime-london-house-prices-in-year-to-december-2016-2016-12_1540933481.html","title":"Property prices in central London are diving","title_page":"    Knight Frank stats on fall in prime London house prices in year to December 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Knight Frank LONDON — House prices in parts of central London have collapsed by as much as 13% over the last year, according to new figures from property consultancy and advisory Knight Frank.\nPrices in \"prime\" central London fell by 6.3% in December compared to a year earlier, Knight Frank said in a release on Thursday, despite an uptick in sales volumes. November was the second highest month for prime central London sales in 2016.\nHowever, Knight Frank says the uptick in sales is a reaction to the collapse in prices. The company says in a research note: \"The second half of 2016 was marked by a steady improvement in sales volumes as vendors lowered asking prices to reflect the changed regulatory backdrop in prime central London.\"\nThe new regulatory backdrop refers to changes to stamp duty introduced in April. The changes to the tax charged on house sales mean people pay much more than before when buying houses worth more than £1 million, while property under that value sees a tax cut on a sliding scale.\nKnight Frank argue that the \"prime\" market, where £1 million for a house counts as a bargain, has adjusted to this tax change by lowering initial asking prices, factoring in the higher tax burden that potential buyers will face.\nAnnual residential price growth in December ranged from 0% in the City & the fringes to as much as a 13.5% fall in Chelsea and Hyde Park. Knight Frank\nKnight Frank says it expects \"broadly flat price growth in 2017 as declines start to bottom out,\" but adds: \"Whether strengthening sales volumes in the second half of 2016 will provide a reliable indicator for the first six months of 2017 remains to be seen.\n\"Political uncertainty is unlikely to subside in the early part of next year as the UK triggers the process to leave the European Union, Donald Trump potentially charts a new economic course in the US and ahead of elections in several European countries.\"","url":"https://www.businessinsider.com/knight-frank-stats-on-fall-in-prime-london-house-prices-in-year-to-december-2016-2016-12"}
