{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:27","date_modify":"2018-10-31 00:04:27","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Rising healthcare costs remain at the","filename":"data/vaneerConsumption/Proposition52Hospitalfees.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._52_Hospital_fees_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944267.html","title":"Proposition 52: Hospital fees","title_page":"Proposition 52: Hospital fees | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nRising healthcare costs remain at the top of the national agenda—not just for patients but for the hospitals who treat low-income patients. Hospitals rely on both state and federal matching funds for reimbursement. In the past, however, California, has used state funds for other programs, costing hospitals federal matching dollars.\nWhat would it do?\nProp. 52 would extend the current fees hospitals pay to receive more matching Medicaid funds from the federal government. It would also make it harder for the state Legislature to divert the fees to other state programs.\nWhat would it cost the government?\nThe measure’s fiscal impact is unclear because we don’t know if the Legislature would have extended the existing hospital fee if Prop. 52 were not on the ballot. If lawmakers had declined to extend the fee, Prop. 52 would have saved the state roughly $1 billion and increased funding for public hospitals in the low hundreds of millions of dollars annually.\nWhy is it on the ballot?\nThe California Hospital Association is sponsoring Proposition 52 in a bid to stabilize and protect state funding that hospitals receive for treating low-income patients. Although the Legislature established the hospital fee in 2009 as a means to reimburse hospitals, lawmakers have diverted some of the money into the state’s general fund. Prop. 52 is one of three measures on the ballot that will boost Medi-Cal funding.\nWhat supporters say:\nIt will ensure California hospitals can continue to recover some of the money they spend to provide services to low-income patients, providing a stable revenue stream and drawing an estimated $3 billion in federal matching funds.\nWhat opponents say:\nIt will divert millions of dollars away from patients and into a health-care bureaucracy with no oversight, no accountability and no guarantee it is spent on health care.\nSupporters:\nCalifornia Hospitals Association California Hospitals Association\nDignity Health Dignity Health Opponents:\nService Employees International Union – United Healthcare Workers West (has since withdrawn opposition) Service Employees International Union – United Healthcare Workers West (has since withdrawn opposition)\nShow me the money:","url":"https://calmatters.org/articles/proposition-52-hospital-fees/"}
