{"authors":["William Bigelow"],"date_download":"2018-10-30 22:01:41","date_modify":"2018-10-30 22:01:41","date_publish":"2015-08-16 20:23:51","description":"California's Prop 47 of 2014, which changed some drug and property crimes from felonies to misdemeanors, has coincided with a rise in crime.","filename":"data/vaneerConsumption/Prop47CaliforniaHasLighterSentencesMoreCrime.json","image_url":"https://media.breitbart.com/media/2015/02/Prop-47-inmate-Madera-County-Jail-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_08_16__1540936901.html","title":"Prop 47: California Has Lighter Sentences, More Crime","title_page":"Prop 47: California Has Lighter Sentences, More Crime","title_rss":"NULL","source_domain":"breitbart.com","text":"California’s Proposition 47 of 2014, The Safe Neighborhoods and Schools Act, which changed some drug and property crimes from felonies to misdemeanors, has coincided with a rise in crime in parts of the state.\nConservative columnist Debra Saunders, who is the lone conservative columnist for the San Francisco Chronicle, argues in her latest syndicated column that the release of roughly 3,700 inmates has decreased public safety.\nSaunders cites statistics from San Francisco police spokesman Carlos Manfredi, who says that in San Francisco in 2015:\ncar theft has risen 47% from the same period in 2014;\nrobberies have increased 23%; and\naggravated assaults have risen 2%.\nIn Los Angeles in 2015, compared to the same period in 2014, Saunders says:\nthe city saw a 12.7% increase in overall crime;\nviolent offenses climbed 20.6%; and\nproperty crime increased 11%.\nAs the Los Angeles Times admitted in July, “Crime surged across Los Angeles in the first six months of this year despite a campaign by the Los Angeles Police Department to place more officers on the streets and target certain types of offenses….Part of that property crime increase, (Mayor Eric) Garcetti said, may be linked to Proposition 47, the ballot measure that downgraded felony drug possession and thefts and resulted in the release of about 3,700 inmates from state prison.”\nSaunders writes:\nSan Francisco District Attorney George Gascon was the rare prosecutor who pushed for its approval. He told the San Francisco Chronicle, “What we have been doing hasn’t worked, frankly.” Gascon spokesman Alex Bastian told me, “The voters indicated that possessing small amounts of narcotics” should not constitute a felony. Californians don’t want three-year sentences for drug possession. I don’t, either, but on the ground, the legal fix is not living up to its hype. Prop 47 has made it easier for drug offenders to avoid mandated treatment programs… “It used to be that if you were caught in the possession of methamphetamine, you would be arrested; you’d end up in drug court or in some other program, probably in custody receiving some type of treatment,” Yolo County District Attorney Jeff Reisig told the Daily Democrat. “Well, now the officers on the street just give them a ticket. So they have been arrested for a crime. The case actually gets forwarded to my office. We charge them with a crime, but they never show up to court. They get arrested again and are given another ticket for methamphetamine. And so we’ve seen that.”\nRead Saunders’s full column at RealClearPolitics.","url":"https://www.breitbart.com/the-media/2015/08/16/prop-47-california-has-lighter-sentences-more-crime/"}
