{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:42","date_modify":"2018-10-30 22:29:42","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Californians voted to increase taxes","filename":"data/vaneerConsumption/Proposition55Highearnertax.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._55_Income_taxes_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938582.html","title":"Proposition 55: High-earner tax","title_page":"Proposition 55: High-earner tax | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nCalifornians voted to increase taxes on the state’s wealthiest earners in 2012, seeking to replenish education funding accounts depleted during the recession. Four years later, the economy is recovering and the tax increase is slated to end after 2018. Education and health care advocates argue Californians can’t afford to lose the revenues from the high-earner income tax.\nWhat would it do?\nProp. 55 would extend the 2012 voter-approved tax increase on high-income earners for 12 more years, to 2030. The tax applies to earnings over $250,000 a year for individuals, or over $500,000 for couples. Most of the revenue would continue to go to K-12 education, with the remaining set aside for community colleges and low-income health care programs.\nWhat would it cost state government?\nNothing; Prop. 55 would reap billions for the state. The state could see increased revenues ranging from $4 billion to $9 billion a year from 2019 through 2030, depending on the economy and the stock market.\nWhy is it on the ballot?\nThe California Teachers Association and the California Hospital Association are bankrolling Prop. 55 and their constituencies stand to benefit from it passing. Revenues from this income tax are targeted for public schools and healthcare for low-income children. Those programs would likely see cuts if the 2012 tax increases expire.\nWhat supporters say:\nProp. 55 maintains taxes on the wealthiest of Californians, and would prevent billions of dollars of cuts to public education needed to hire teachers and reduce class sizes. Funding for community colleges would make more classes available and keep tuition rates stable while low-income children would see improved access to health care.\nWhat opponents say:\nThis measure is a broken promise to taxpayers who voted in 2012 for a temporary tax. Extending the tax by another 12 years is a power grab by labor unions that will send the state’s economy into a tailspin, forcing more businesses and jobs to leave California.\nSupporters:\nCalifornia Hospitals Association California Hospitals Association\nCalifornia Teachers Association California Teachers Association\nService Employees International Union– Local 1000 Service Employees International Union– Local 1000 Opponents:\nCalifornia Chamber of Commerce California Chamber of Commerce\nHoward Jarvis Taxpayers Association Howard Jarvis Taxpayers Association\nNational Federation of Independent Business National Federation of Independent Business\nShow me the money:\nMore information:\nCalifornia public schools are enjoying a rapid rise in state funding thanks to the temporary tax increase voters approved in 2012, reversing many recession-era cuts. But educators see financial challenges in the years ahead. CALmatters explains the big picture in this piece called the Price of Education.\nIs a tax extension needed for California schools? We walk you through the state’s education budget and its interplay with the greater economy.\nIf voters reject Prop. 55, will education really suffer a $4 billion cut in funding? Maybe not, according to this Sacramento Bee fact check of a Prop. 55 campaign ad.\nLos Angeles Times columnist George Skelton says Prop. 55 is “lousy policy” that feeds distrust of government.\nCalifornia isn’t the only state with an initiative on the ballot to increase education funding. Here is look at other state measures by Education Week.\nNewspaper Endorsements:","url":"https://calmatters.org/articles/proposition-55-high-earner-tax/"}
