{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:58:40","date_modify":"2018-10-30 21:58:40","date_publish":"2016-11-21 18:30:04","description":"TEL AVIV - Anti-Israel activists at Washington University stormed out of a guest lecture by an Israeli LGBT activist, saying his claims that the Jewish state is a “haven” for the gay community was “pinkwashing” Israel’s oppression of Palestinians. | Israel / Middle East","filename":"data/vaneerConsumption/ProPalestinianWashingtonUniversityStudentsProtestIsraeliLGBTEvent.json","image_url":"https://media.breitbart.com/media/2016/11/SJP-Washington-University-pinkwashing-protests.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_11_21__1540936720.html","title":"Pro-Palestinian Washington University Students Protest Israeli LGBT Event","title_page":"Pro-Palestinian Washington University Students Protest Israeli LGBT Event | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Anti-Israel activists at Washington University stormed out of a guest lecture by an Israeli LGBT activist, saying his claims that the Jewish state is a “haven” for the gay community was “pinkwashing” Israel’s oppression of Palestinians.\nStudents for Justice in Palestine (SJP) staged a walkout during Etai Pinkas’ lecture while wearing tape over their mouths and carrying signs that read, “No Pride in Apartheid.”\nIn an oped published in Student Life, the university’s newspaper, SJP explained that the walkout was an effort to combat the ways in which their university is “complicit in the normalization of the violent israeli [sic] occupation of Palestine.”\nBranding Israel as gay-friendly, SJP claims, serves to “normalize and distract from violations of international law: demolitions of Palestinian villages, illegal settlements in the West Bank, forced relocations and denial of the right of Palestinians to return to their homes, and an extended occupation under military rule. How can these violences, committed against Palestinians, including queer Palestinians, be considered ‘LGBTQIA*-friendly’? Do drone strikes spare gay Palestinians?”\nIsrael is consistently ranked as one of the most gay-friendly countries in the world. The IDF was also named in the top 10 LGBT-friendly armies.\nIn Palestinian society, gays are often subject to abuse and even honor killings by members of their own families. Many gay Palestinians flee to Israel to seek asylum and are given permits by the government.\nMeanwhile, sophomore Monica Sass, a member of the Hillel Leadership Council and president of Nice Jewish Queers, said that as a Jewish and queer student, “I feel disappointed that student activists chose to walk out simply because [Pinkas] was talking about his experiences as an Israeli citizen, rather than listen to an important discussion of LGBTQIA rights in the Jewish state.”\nAnother student, Sydney Shaiman, said the protest only devalued Pinkas’ activism.\n“I think it’s really disappointing that this guy does so much for his country and he’s not making a political statement about everything about his country, he’s trying to fix one issue and people come in and blame him for things he’s not doing,” Shaiman told Student Life. “He does amazing work, just like how activists in the U.S. can’t fix everything about the U.S., so I think I feel bad for him.”","url":"https://www.breitbart.com/middle-east/2016/11/21/washington-u-students-protest-israeli-lgbt-event-for-pinkwashing-oppression-of-palestinians/"}
