{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:27:55","date_modify":"2018-10-30 22:27:55","date_publish":"2016-09-29 00:52:10","description":"Background: Many Americans are angry about rising pharmaceutical prices and politicians have taken notice. Presidential candidates this year","filename":"data/vaneerConsumption/Proposition61Prescriptiondrugs.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._61_Prescription_drugs_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938475.html","title":"Proposition 61: Prescription drugs","title_page":"Proposition 61: Prescription drugs | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Background:\nMany Americans are angry about rising pharmaceutical prices and politicians have taken notice. Presidential candidates this year debated how to contain costs, and California lawmakers proposed fixes that never passed out of the statehouse. Drug prices are a big deal not only for consumers who are forced to pay more for prescriptions, but also for the state government, which spends billions on medication for public employees, retirees, prisoners and other people on public health plans.\nWhat would it do?\nProp. 61 would cap the amount the state pays for prescription drugs—generally prohibiting the state from paying any more for drugs than the lowest price paid by the U.S. Department of Veterans Affairs, which pays the lowest prices in the nation.\nWhat would it cost?\nProp. 61 could save the state some money, but it’s hard to say for certain. If drug makers responded to the measure by raising prices for the Department of Veterans Affairs, that would negate any potential savings to the state. Because the drug market reaction is unpredictable, the state’s legislative analysts concluded that the fiscal impact is unknown.\nWhy is it on the ballot?\nThe AIDS Healthcare Foundation in Los Angeles—which runs pharmacies and health clinics around the world—paid to put Prop. 61 on the ballot.\nWhat supporters say:\nProp. 61 will rein in soaring drug prices and fights back against pharmaceutical companies that reap profit from people’s illnesses.\nWhat opponents say:\nIt would limit prices only for people in certain government health plans, but could make medication more expensive for others—especially veterans—if drug companies hike prices to make up the difference.\nSupporters:\nCalifornia State Association of Occupational Health Nurses California State Association of Occupational Health Nurses\nAmerican Association of Retired Persons American Association of Retired Persons\nU.S. Sen. Bernie Sanders (D-Vermont) U.S. Sen. Bernie Sanders (D-Vermont) Opponents:\nCalifornia Chamber of Commerce California Chamber of Commerce\nPharmaceutical Research and Manufacturers of America Pharmaceutical Research and Manufacturers of America\nVeterans of Foreign Wars, Department of California Veterans of Foreign Wars, Department of California\nShow me the money:","url":"https://calmatters.org/articles/proposition-61-prescription-drugs/"}
