{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:04","date_modify":"2018-10-30 22:29:04","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Tobacco is often the target of","filename":"data/vaneerConsumption/Proposition56Tobaccotax.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._56_Cigarette_taxes_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938544.html","title":"Proposition 56: Tobacco tax","title_page":"Proposition 56: Tobacco tax | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nTobacco is often the target of politicians seeking money for state programs, with mixed success across the country. In California, voters have rejected multiple ballot box attempts over the years to raise taxes on cigarettes, and the state is among those with the lowest taxes on tobacco. The growing popularity of e-cigarettes and vapor products adds a new dynamic to the debate.\nWhat would it do?\nProp. 56 would add a $2 tax to cigarettes, electronic cigarettes containing nicotine, and other tobacco products to primarily increase funding for existing health care programs.\nWhat would it cost the government?\nNothing; this measure would add revenue to the state budget. It would provide an estimated $1 billion to $1.4 billion in 2017-18, with potentially lower revenues in future years.\nWhy is it on the ballot?\nProp. 56 is sponsored by a coalition of healthcare groups that could stand to see a boost in Medi-Cal funding if it passes. The measure is one of three on the November ballot that would increase Medi-Cal funding, which healthcare advocates say has yet to recover from cuts the Legislature made during the recession.\nWhat supporters say:\nProp. 56 is a user fee paid only by smokers to help pay for healthcare, cancer treatment, smoking prevention, and research to cure cancer and tobacco-related diseases. Taxing tobacco saves lives with a proven reduction in youth smoking. California’s current tax on cigarettes—87 cents per pack—is low compared to most states.\nWhat opponents say:\nThis measure is a tax grab by insurance companies, labor unions and hospitals, with just a fraction of the money set aside for smoking prevention. More pressing problems like the drought, education, road repairs and violent crime should benefit from any tax increases.\nSupporters:\nCalifornia Hospitals Association California Hospitals Association\nThe American Cancer Society Cancer Action Network The American Cancer Society Cancer Action Network\nAmerican Lung Association in California American Lung Association in California\nTom Steyer, major Democratic donor Tom Steyer, major Democratic donor Opponents:\nHoward Jarvis Taxpayers Association Howard Jarvis Taxpayers Association\nPhilip Morris USA Inc. Philip Morris USA Inc.\nR.J. Reynolds Tobacco Co. R.J. Reynolds Tobacco Co.\nSmoke-Free Alternatives Trade Association Smoke-Free Alternatives Trade Association\nShow me the money:\nMore information:\nProp. 56 is shaping up as one of the most expensive ballot measures this November as the San Francisco Chronicle reports.\nAt the heart of Prop. 56 is an ongoing struggle over how much the government reimburses health care professionals who treat Medi-Cal payments, the Sacramento Bee reports.\nNot all business groups oppose the tax hike in Prop. 56. Read this report by the Sacramento Business Journal.\nDemocratic mega-donor Tom Steyer says he’s supporting Prop. 56 as part of a bigger mission to use his wealth to fight corporate dominance in politics.\nWhat would Prop. 56 mean for Californians who vape? Puffing on electronic cigarettes would get a lot more costly.\nNewspaper Endorsements:","url":"https://calmatters.org/articles/proposition-56-tobacco-tax/"}
