{"authors":["Katherine Seligman","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:28:29","date_modify":"2018-10-30 22:28:29","date_publish":"2016-10-27 08:00:00","description":"The upcoming ballot is so stuffed with complicated propositions that someone had to explain them in haiku. And song. And cartoon and emoji. The surge of","filename":"data/vaneerConsumption/PropprepCalifornianstacklejumboballotwithhumor.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/COPING_Photo_1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938509.html","title":"Prop prep: Californians tackle jumbo ballot with humor","title_page":"Prop prep: Californians tackle jumbo ballot with humor | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The upcoming ballot is so stuffed with complicated propositions that someone had to explain them in haiku. And song. And cartoon and emoji.\nThe surge of creations speaks to a wave of younger, first-time and time-pressed voters who might not study the record 224-page tome that is the official California Voter Information Guide. That doesn’t even take into account the local measures: All told, voters in San Francisco have 42 ballot measures to decide and 536 official pamphlet pages to peruse—more pages than Charles Dickens needed to write Oliver Twist.\nIf you’re feeling daunted, you’re in luck: You can now find out about all 17 measures via explanatory poetry, animated films, a bluegrass ditty and more.\nOr maybe you prefer your politics up-close-and-personal? You could join other civic-minded Californians and host a proposition potluck for your own friends—dishing out assignments like “Would you bring pasta salad and a primer on Prop. 52?” If your friends aren’t game, you could plug into one of several “prop prep” sessions being hosted around the state at churches, bars and art studios.\nOr this Saturday, you could sojourn to Los Angeles City Hall, site of the first-ever Ballot Con. The free event is scheduled to run for six and a half hours at Los Angeles City Hall, and will feature advocates pro and con debating the merits of ballot propositions, along with food and live music. The event is sponsored by SeePolitical, a nonprofit that aims to demystify elections, and the Los Angles Times.\nOrganizers say they anticipate up to 1,000 people to attend the event, featuring journalists, academics and policy experts as moderators. No one is expected to wear costumes, despite the title and proximity to Halloween.\nThe same can’t be said of SeePolitical’s 90 second cartoons, where the animated characters include a green alien, an ape, a green marijuana leaf and a beer can that burps, all talking basics on the most prominent propositions in English and Spanish. Shorter cartoons cover the rest.\n“It’s hard to give a huge voter handbook to young or first-time voters,” said Nate Kaplan, SeePolitical founder, who worked with Imaginary Forces, a creative studio, and students at Otis College of Art and Design to produce the cartoons. “The way they consume information these days, it doesn’t make sense.”\nSeePolitical video on Prop. 63: Guns and Ammunition\nFor others, contemplation of the ginormous ballot went from bad to verse.\n“I read about how many propositions we were going to have and it blew me away,” said voter Damian Carroll, who’s also national director of Vision to Learn, which provides free eye care to students. “I think it’s important for people to vote the whole ballot. A lot vote for president and skip the rest, partly because they are confused.”\nSo Carroll began researching the measures, poring over legislative analyses, official websites and editorials. Then he sat down in his San Fernando Valley kitchen and, over two months of breakfasts with his 6- and 10-year old daughters, they crafted a set of haiku.\nCarroll, who’s worked in politics before but never written 17-syllable verse, was floored by the reaction. The haiku went viral soon after he posted them online.\nThe tone is neutral, with a whiff of whimsy:\nIncreasingly, people are “looking to watch things” to get information, said Kim Alexander, president and founder of the California Voter Foundation. “We live in a visual world, so it’s important to provide things that are accessible to younger, more diverse voters.”\nThis season, Alexander collaborated with local musicians on her seventh election ditty, “The Proposition Song.” Set to music that resembles “99 Bottles of Beer on the Wall,” it’s been a top feature on You Tube, performed at music festivals and in front of the state Capitol.\n“It’s the longest one we’ve ever produced,” said Alexander. “It’s five minutes. In the world of music videos, that’s long, but for propositions, it’s not.”\n2016 Proposition Song\nRobert Stern, an author of the political reform act that set up the Fair Political Practices Commission, recalls 1990 when he had to use two ballots in two separate booths to vote on 100 issues. But the breadth and complexity of the measures this time—including regulating marijuana, the death penalty, campaign finance, bilingual education, prescription pricing, plastic bags and revenue bonds—can be overwhelming.\nSo Stern, as a volunteer with the League of Women Voters of California, supervised a video project at Claremont McKenna’s Rose Institute of State and Local Government in which students researched and then explained the propositions, including information on sponsors and funding, on camera.\n“In a sense I think video is an easier way to learn,” said Stern, who also attended a house party where guests discussed the measures. “It’s not as short as the song or cartoons, but it does give you both side and pros and cons.”\nStudents at many high schools around the state have also stepped up to interpret the ballot. At Narbonne High School in Harbor City, for example, the speech and debate team explained the propositions at an evening forum that drew about 150 people. Team coach Sharon James said students prepared by reading the voter guide and then gave pro and con arguments in non-legalize for all but a few propositions.\n“We did avoid the marijuana and condom ones,” she said. “I just didn’t think those were appropriate for high school.”\nBut every single state proposition was hashed out at Church of the Good Shepherd in Arcadia at two October election events.\n“What about talking about condoms in church?” said Gary Kovacic, a former Arcadia mayor and an organizer who signed up parishioners who were lawyers or experts to present unbiased views. “You just do it. It’s on the ballot so you address it. We did it in a straightforward way.”\nCastro Valley Matters (no relation to CALmatters, although they used the organization’s voter guide) held its forum at Aran’s Art Studio, where, instead of painting ceramics, local residents gathered, with wine, beer and snacks, to consider the weighty ballot.\nMichael Kusiak, a group founder, came up with the idea after meeting with colleagues, concluding that, “Folks, this makes me want to drink.” He patterned the event on book clubs where it doesn’t matter if people read the book. No preparation needed.\nParticipants sat at art tables to discuss each proposition for up to five minutes, at which point an airhorn app sounded on Kusiak’s phone.\n“I’m impressed how engaged people were for two hours,” said Kusiak, an administrator at the University of California’s Office of the President. “There were moments where it got weird, where the discussion was too long. But people really cared about being educated.”\nFor a shorter hit, there’s a set of emoji by a graphics and data journalist at the Los Angeles Times that sequences, for example, a cigarette and tree to represent the measure on marijuana legalization.\nMore young people are registering, but they are still less likely than Baby Boomers to cast ballots, according to research from the Public Policy Institute of California.\nThe range of options available to the state’s increasingly diverse voter base is good news to Dora Rose, director of civic engagement for the League of Women Voters of California. “We want the electorate to look like the people of California,” she said. “We want to reach out to a broad demographic. With a lack of participation, we have a representation problem.”\nCALmatters contributor Katherine Seligman is a freelance journalist based in San Francisco.\nNote: Due to an editing error, an earlier version of this story contained a verb tense error in the haiku illustration.","url":"https://calmatters.org/articles/prop-prep-californians-tackle-jumbo-ballot-with-humor/"}
