{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:50","date_modify":"2018-10-30 22:29:50","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: The push for marijuana legalization","filename":"data/vaneerConsumption/Proposition64Legalizingmarijuana.json","image_url":"https://calmatters.org/wp-content/uploads/Prop64_Marijuana_Legalization_Credit__Dank_Depot_Creative_Commons.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938590.html","title":"Proposition 64: Legalizing marijuana","title_page":"Proposition 64: Legalizing marijuana | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nThe push for marijuana legalization is on the ballot in at least nine states this November, with California’s Prop. 64 the most watched. Although four other states previously have legalized recreational pot, a vote by the nation’s most populous state is likely to put pressure on Congress and the federal government to revisit the federal ban on marijuana.\nWhat would it do?\nProp. 64 would allow people 21 and older to grow up to six pot plants at home, possess up to an ounce of marijuana and use it for recreational purposes. It would allow the state, as well as cities and counties, to regulate and tax the growing and sale of non-medical marijuana.\nWhat would it cost the government?\nIt all depends on how state and local governments choose to regulate and tax marijuana, whether the federal government enforces federal marijuana laws, and the price and use of marijuana. The state’s legislative analyst concluded that taxes generated could eventually reach more than $1 billion a year. Local and state governments also could save tens of millions of dollars a year in jail costs because marijuana use would no longer be a state crime.\nWhy is it on the ballot?\nLegalization advocates are trying again after California voters shot down their last initiative to sanction marijuana in 2010. This time they’ve got an influx of cash from technology moguls and political heft from Lt. Gov. Gavin Newsom.\nWhat supporters say:\nIt would bring the state’s booming and unregulated recreational marijuana market under the rule of law, protecting consumers and the environment. It is a recognition that decades of prohibition and aggressive enforcement of criminal laws hasn’t worked.\nWhat opponents say:\nMarijuana remains illegal under federal law. Prop. 64 would lead to an increase in marijuana smoking, causing more cases of cancer, heart attacks, strokes and other health issues. Children will be exposed to marijuana advertising and the roads will be less safe.\nSupporters:\nLt. Gov. Gavin Newsom Lt. Gov. Gavin Newsom\nSean Parker, co-founder of Napster and first president of Facebook Sean Parker, co-founder of Napster and first president of Facebook\nWeedmaps Weedmaps\nAlice Huffman, President, California NAACP Alice Huffman, President, California NAACP\nU.S. Sen. Bernie Sanders (D-Vermont) U.S. Sen. Bernie Sanders (D-Vermont)\nCalifornia League of Conservation Voters California League of Conservation Voters Opponents:\nCalifornia Hospitals Association California Hospitals Association\nCalifornia Association of Highway Patrolmen California Association of Highway Patrolmen\nU.S. Sen. Dianne Feinstein (D-California) U.S. Sen. Dianne Feinstein (D-California)\nAssemblyman Jim Cooper (D-Elk Grove) Assemblyman Jim Cooper (D-Elk Grove)\nCalifornia Police Chiefs Association California Police Chiefs Association\nJulie Schauer, former college instructor Julie Schauer, former college instructor\nShow me the money:\nMore information:","url":"https://calmatters.org/articles/proposition-64-legalizing-marijuana/"}
