{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:49:07","date_modify":"2018-10-30 22:49:07","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Even though California has some of","filename":"data/vaneerConsumption/Proposition63Guncontrol.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._63_Gun_control_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939747.html","title":"Proposition 63: Gun control","title_page":"Proposition 63: Gun control | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nEven though California has some of the toughest gun restrictions in the country, political will intensified this year to pass even stiffer laws. Motivated in part by the December shooting in San Bernardino that left 14 people dead, Democrats in the Legislature advanced several gun control bills, many of which were signed into law. All the while, Democratic Lt. Gov. Gavin Newsom was leading the effort to put Prop. 63 before voters. The newly-passed laws overlap with two of the six gun-control policies included in this measure.\nWhat would it do?\nThe two parts of Prop. 63 that are similar to newly-approved state laws are provisions that would require criminal background checks for people purchasing ammunition and prohibit possession of large-capacity magazines (those that hold more than 10 bullets).\nOther pieces of Prop. 63 would make new requirements for reporting lost or stolen firearms and ammunition to authorities; prohibit people from possessing firearms if they’re convicted of stealing a firearm; establish new ways for authorities to remove guns from people who are prohibited from owning them; change theft of a gun worth $950 or less from a misdemeanor to a felony; strengthen the national criminal background check system by requiring the state to share information about people who are prohibited from owning firearms.\nWhat would it cost the government?\nTens of millions of dollars a year related to new processes for removing firearms from people who are not allowed to own them because they’ve been convicted of a crime. Millions of dollars annually to regulate ammunition sales and jail those facing stiffer penalties for certain gun crimes.\nWhy is it on the ballot?\nNewsom, who is running for governor in 2018, put forth Prop. 63 after consulting with the Law Center to Prevent Gun Violence in San Francisco.\nWhat supporters say:\nSomething must be done about gun violence, which injures or kills more than 300 Americans each day. Even in California’s Democratic-controlled statehouse, the gun lobby has successfully blocked efforts to pass some policies aimed at keeping guns and ammunition out of the wrong hands. This initiative takes those questions directly to voters.\nWhat opponents say:\nCriminals, by definition, don’t obey the law, so putting more restrictions on guns and ammunition won’t stop them—it will just burden law-abiding gun owners. This measure is a way for Newsom to boost his image before running for governor in two years.\nSupporters:\nCalifornia Democratic Party California Democratic Party\nLt. Gov. Gavin Newsom Lt. Gov. Gavin Newsom\nLaw Center to Prevent Gun Violence Law Center to Prevent Gun Violence\nU.S. Sen. Dianne Feinstein (D-California) U.S. Sen. Dianne Feinstein (D-California)\nBarbra Streisand, singer and actress Barbra Streisand, singer and actress Opponents:\nCalifornia Republican Party California Republican Party\nNational Rifle Association National Rifle Association\nCalifornia Rifle and Pistol Association California Rifle and Pistol Association\nCalifornia Police Chiefs Association California Police Chiefs Association\nShow me the money:","url":"https://calmatters.org/articles/proposition-63-gun-control/"}
