{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:31","date_modify":"2018-10-31 00:04:31","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Gov. Jerry Brown has championed two","filename":"data/vaneerConsumption/Proposition53Revenuebonds.json","image_url":"https://calmatters.org/wp-content/uploads/Prop53_credit-_Daniel_Parks_Creative_Commons.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944271.html","title":"Proposition 53: Revenue bonds","title_page":"Proposition 53: Revenue bonds | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nGov. Jerry Brown has championed two major infrastructure projects: a high-speed rail system to connect San Francisco and Los Angeles, and a pair of massive tunnels in the Delta to move water from the northern to the southern end of the state. The projects would bring jobs to inland California, but have stirred controversy among farmers and environmentalists. Many fiscal conservatives object because the projects would likely rely on borrowing billions of dollars, adding to the state’s debt load which is already more than $300 billion.\nWhat would it do?\nProposition 53 would require voter approval before any revenue bond over $2 billion can be issued by the state for state-managed projects. Few projects require bonds of that amount, but the threshold would likely complicate both of Brown’s priority infrastructure projects by requiring a public vote.\nWhat would it cost the government?\nAnalysts couldn’t determine the fiscal impact of this measure because it depends on how voters and governments respond. It could have no impact if voters approve bonds and a project proceeds as planned. It could save money if voters reject bonds and the government instead uses existing infrastructure or a less expensive financing mechanism. It could cost money if the government plans several smaller projects to avoid the $2 billion threshold or finances the large project with higher-interest loans.\nWhy is it on the ballot?\nStockton farmer Dean Cortopassi, who opposes the Delta tunnels project, put Prop. 53 on the ballot.\nWhat supporters say:\nIt would give voters a say in major infrastructure projects and could limit growth of the state’s debt load. Government debt will burden future generations, who could see reduced services or increased taxes to pay it off.\nWhat opponents say:\nIt could delay or block more public works projects than anticipated, like water storage or bridge repairs. By requiring a statewide vote, it could allow voters in faraway regions to shoot down a project supported by those in the community. The type of bonds at issue in this measure—revenue bonds—are paid back by users of the project that’s built, not by taxpayers at large.\nSupporters:\nHoward Jarvis Taxpayers Association Howard Jarvis Taxpayers Association\nDean and Joan Cortopassi, agribusiness Dean and Joan Cortopassi, agribusiness Opponents:\nCalifornia Chamber of Commerce California Chamber of Commerce\nState Building and Construction Trades Council State Building and Construction Trades Council\nGov. Jerry Brown Gov. Jerry Brown\nShow me the money:\nMore information:\nThe Mercury News explains how Proposition 53 could “have a huge impact on the governor’s legacy” by influencing California’s plans to build a bullet train and the water diversion tunnels.\nThe Sacramento Bee takes a deep look at the finances and political leanings of Dean Cortopassi, the “wealthy but little-known” backer of Proposition 53.\nIf you don’t know much about the plan to build two huge water diversion tunnels in the Delta, this piece from Water Deeply offers a clear explanation.\nLos Angeles Times reporter Ralph Vartabedian has been aggressively covering the high-speed rail project. You can keep up by following him on Twitter.\nNewspaper Editorials:","url":"https://calmatters.org/articles/proposition-53-revenue-bonds/"}
