{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:43","date_modify":"2018-10-31 00:04:43","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: School districts pay for building new","filename":"data/vaneerConsumption/Proposition51Schoolconstruction.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._51_School_bonds_Credit__Omar_Barcena_Creative_Commons.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944283.html","title":"Proposition 51: School construction","title_page":"Proposition 51: School construction | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nSchool districts pay for building new schools and updating older ones with a mix of local and state money, generally financed through bonds. It’s been a decade since California voters approved a bond measure allowing the state to borrow money for school construction. Now the state’s existing stash of school construction money is almost gone, yet local school districts report a backlog of construction projects that will cost billions to complete.\nWhat would it do?\nProp. 51 authorizes $9 billion in bonds to build new schools and modernize existing ones. Most of the money would be for K-12 schools, with about $2 billion for community colleges.\nWhat would it cost?\nBorrowing the $9 billion would cost the state an extra $8.6 billion in interest. The state would likely pay off the debt over 35 years, at a cost of about $500 million a year.\nWhy is it on the ballot?\nUsually school bonds land on the ballot because the Legislature puts them there. That hasn’t happened in recent years, so home builders, developers and school construction companies got together to put this measure on the ballot on their own.\nWhat supporters say:\nCalifornia’s aging campuses need safety repairs and tech upgrades, while growing neighborhoods want to build new schools. The bonds will provide students a better learning environment, without directly raising taxes.\nWhat opponents say:\nProp. 51 benefits suburban home builders without doing much to help schools in low-income communities. Bonds are expensive—costing almost as much in interest as the amount borrowed—and put the state further in debt.\nSupporters:\nCalifornia Parent Teacher Association California Parent Teacher Association\nCalifornia Chamber of Commerce California Chamber of Commerce\nCalifornia Building Industry Association California Building Industry Association\nCalifornia Labor Federation California Labor Federation Opponents:\nHoward Jarvis Taxpayers Association Howard Jarvis Taxpayers Association\nGov. Jerry Brown Gov. Jerry Brown\nCalifornia Taxpayers Action Network California Taxpayers Action Network\nShow me the money:\nMore information:\nGov. Jerry Brown explains to the Los Angeles Times why he’s against this school bond, calling it a “blunderbuss effort.”\nRepublican state Sen. Janet Nguyen makes the case in favor of Prop. 51, writing in The Orange County Register that the bonds will keep school districts from pursuing parcel taxes or property tax increases.\nSacramento Bee columnist Dan Walters explains how big money fuels the business of school bonds.","url":"https://calmatters.org/articles/proposition-51-school-construction/"}
