{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:39","date_modify":"2018-10-30 22:29:39","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: The U.S. Supreme Court decision known as","filename":"data/vaneerConsumption/Proposition59Campaignmoney.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._59_Campaign_finance_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938579.html","title":"Proposition 59: Campaign money","title_page":"Proposition 59: Campaign money | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nThe U.S. Supreme Court decision known as Citizens United has become a political flashpoint for Americans turned off by the billions of dollars spent to sway elections. The 2010 ruling allowed unions and corporations to spend unlimited amounts on political campaigns. It paved the way for the prevalence of “super-PACs,” groups that spend huge sums on ads supporting or opposing candidates—and do so legally, so long as the politicians have no direct involvement in their efforts.\nWhat would it do?\nNot much, in the short term at least. Prop. 59 is an advisory measure—it’s an opportunity for Californians to give their opinion but it doesn’t directly change any laws. The measure asks if voters want California’s elected officials to take steps to amend the U.S. Constitution to overturn Citizens United. Amending the Constitution is a lengthy process that generally requires, among other things, support from at least 38 states nationwide.\nWhat would it cost state government?\nNothing.\nWhy is it on the ballot?\nThe Legislature’s Democratic majority placed Prop. 59 on the ballot after lobbying by groups that oppose both Citizens United and the prevalence of money in politics. It was originally supposed to be on the ballot in 2014, but was delayed by a lawsuit challenging whether lawmakers can ask voters to weigh in on non-binding measures. The California Supreme Court ruled advisory questions are permissible.\nWhat supporters say:\nAs one piece of a passionate nationwide movement, this measure takes a step toward undercutting big-money politics. Similar measures have already passed in Montana and Colorado, and voters in the state of Washington face one in November. Even if these non-binding measures don’t lead to a Constitutional amendment, approval of Prop. 59 could influence Supreme Court justices in the future if they reconsidered Citizens United.\nWhat opponents say:\nThe measure doesn’t actually do anything but clog the ballot and potentially confuse voters. Citizens United isn’t the only ruling that governs campaign finance issues—and overturning it would still allow a lot of money to gush through the political system, including campaign spending by wealthy individuals, and corporate and union donations directly to politicians.\nSupporters:\nCalifornia Common Cause California Common Cause\nMoney Out Voters In Money Out Voters In\nState Sen. Ben Allen (D-Santa Monica) State Sen. Ben Allen (D-Santa Monica) Opponents:\nAssemblyman Katcho Achadjian (R-San Luis Obispo) Assemblyman Katcho Achadjian (R-San Luis Obispo)\nState Sen. Jeff Stone (R-Temecula) State Sen. Jeff Stone (R-Temecula)\nShow me the money:\nMore information:\nWhile Citizens United upended political campaigns at the federal level, you may be surprised to learn that it had no legal impact on state-level races in California. That’s because a similar big-money system has been accepted here for a long time.\nGov. Jerry Brown gave mixed signals when he allowed this measure to get on the ballot without signing the related bill. He said that Citizens United was “wrongly decided” but that he doesn’t want California to make a habit of cluttering the ballot with advisory measures. Read his letter to the Legislature here.\nIt’s been 124 years since Californians used the ballot to tell their representatives to change the Constitution, the Los Angeles Times reports in this story that walks through how Prop. 59 got on the ballot.\nChannels made legal by Citizens United gave a small number of wealthy families — and the companies they own — an outsized role in shaping the early stages of the presidential race, a New York Times analysis found.\nVoter backlash against big money in politics was a hot issue in the presidential campaign this year, the Washington Post reports.\nNewspaper Editorials:","url":"https://calmatters.org/articles/proposition-59-campaign-money/"}
