{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:30:20","date_modify":"2018-10-30 22:30:20","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: This is the rare ballot measure that","filename":"data/vaneerConsumption/Proposition60Condomsinfilms.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._60_Condoms_in_Porn_Credit__kedai_lelaki_creative_commons.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938620.html","title":"Proposition 60: Condoms in films","title_page":"Proposition 60: Condoms in films | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nThis is the rare ballot measure that requires you to think about sex. Because here in California—home to a $9 billion pornography industry—that most personal of acts is also a jobs issue and a public health concern. Four years ago, Los Angeles County voters approved a measure requiring adult film performers to use condoms. The longtime AIDS activist who pushed that measure has taken his fight statewide with Prop. 60.\nWhat would it do?\nProp. 60 would require porn actors to use condoms when filming intercourse. It would create a system for people to make complaints and file lawsuits if they see a sex scene that does not include a condom. It would require that adult film producers pay for performers’ vaccinations, testing and medical exams related to sexual health.\nWhat would it cost state government?\nAdditional regulations on adult film production would cost more than $1 million annually. In addition, state and local tax revenue would probably drop by several million dollars a year if productions move out of state or go underground to evade the condom mandate.\nWhy is it on the ballot?\nThe Los Angeles-based AIDS Healthcare Foundation put Prop. 60 on the ballot after failing to persuade the Legislature to pass a statewide condom requirement\nWhat supporters say:\nState law already requires adult performers to use condoms on the job, but they are exposed to disease because the provision is rarely enforced. Prop. 60 strengthens existing law by adding new enforcement mechanisms that protect workers in the porn industry.\nWhat opponents say:\nViewers don’t want to watch sex involving condoms, so porn producers will leave California or go underground if this measure passes. The state’s adult film industry already minimizes disease transmission by frequently testing performers. This measure would lead to new lawsuits.\nSupporters:\nAIDS Healthcare Foundation AIDS Healthcare Foundation\nAmerican Sexual Health Association American Sexual Health Association\nCalifornia State Association of Occupational Health Nurses California State Association of Occupational Health Nurses Opponents:\nCalifornia Republican Party California Republican Party\nCalifornia Democratic Party California Democratic Party\nSan Francisco AIDS Foundation San Francisco AIDS Foundation\nShow me the money:\nMore information:\nThe man behind Prop. 60 has a long history of AIDS advocacy that’s made him a maverick to some, anathema to others. We profile Michael Weinstein.\nThe fact-checkers at PolitiFact California examined opponents’ claim that Prop. 60 exposes adult film performers to lawsuits, and determined it is “half true.”\n“Porn is popular and fighting HIV is important.” Those are pretty much the only points of agreement on this contentious ballot measure, the Sacramento Bee reports in this thorough examination of HIV infection in the adult film industry.\nTwo years after Los Angeles voters approved a measure requiring condoms on adult film sets, permitted porn production in that county plummeted, the Los Angeles Times reported.\nNewspaper Editorials:","url":"https://calmatters.org/articles/proposition-60-condoms-in-films/"}
