{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:30:16","date_modify":"2018-10-30 22:30:16","date_publish":"2016-09-29 00:52:10","description":"1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Swept up by anti-immigrant politics","filename":"data/vaneerConsumption/Proposition58Bilingualeducation.json","image_url":"https://calmatters.org/wp-content/uploads/Prop._58_Bilingual_education_-_thinkstock.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938616.html","title":"Proposition 58: Bilingual education","title_page":"Proposition 58: Bilingual education | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nSwept up by anti-immigrant politics nearly 20 years ago, California voters approved an initiative that required school children be taught almost exclusively in English. The measure triggered anger in some immigrant communities, where it was viewed as an attack on multiculturalism. Now that the children of immigrants have assumed significant power in the state Capitol, they are calling on Californians to re-examine the decision that reduced bilingual education in public schools.\nWhat would it do?\nProp. 58 would remove restrictions voters put in place in 1998 with Prop. 227. It would allow public schools to decide how to teach English learners – choosing among English-only, bilingual, or other types of programs. It would also open the door for native English speakers to learn a second language.\nWhat would it cost the government?\nThe state legislative analyst found no notable fiscal effect on school districts or state government.\nWhy is it on the ballot?\nThe Legislature put Prop. 58 on the ballot; State Sen. Ricardo Lara (D-Bell Gardens) is spearheading the initiative.\nWhat supporters say:\nProp. 58 removes decades-old barriers to student learning and allows educators to use a variety of teaching methods to help the approximately one-fifth of California students who are not native English speakers. Schools also could more easily provide programs for native English speakers in a second language, readying them for the global economy.\nWhat opponents say:\nThe current system is working, with more California Latinos gaining admission to college and universities. Prop. 58 will force children back into Spanish-only instruction, which will hinder their ability to quickly learn English and prosper as adults.\nSupporters:\nCalifornia Federation of Teachers California Federation of Teachers\nCalifornia School Boards Association California School Boards Association\nDemocratic state Sen. Ricardo Lara (D-Bell Gardens) Democratic state Sen. Ricardo Lara (D-Bell Gardens) Opponents:\nState Sen. Joel Anderson (R-Alpine) State Sen. Joel Anderson (R-Alpine)\nRon Unz, chairman of English for the Children Ron Unz, chairman of English for the Children\nKenneth A. Noonan, former superintendent of Oceanside Unified School District Kenneth A. Noonan, former superintendent of Oceanside Unified School District\nShow me the money:\nMore information:\nThe state senator behind Prop. 58 explains how he benefited from a bilingual education in this Sacramento Bee profile.\nRon Unz, who pushed for the 1998 English-only initiative, explains why he still thinks it’s a strong approach, writing in the San Diego Union-Tribune that the “educational results were tremendous.”\nProp. 58 would offer schools variety of choices to teach non-English learners. Read about the measure in this article by The San Francisco Chronicle.\nBilingual education could return to California’s schools. The arguments for and against in this story by The Press Enterprise.\nNewspaper Editorials:","url":"https://calmatters.org/articles/proposition-58-bilingual-education/"}
