{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:46","date_modify":"2018-10-30 22:29:46","date_publish":"2016-09-29 00:52:10","description":"Prop. 62  Prop. 66 1oo percent of precincts reporting partial returns—will be updated when all results are certified. Background: Whether for or against","filename":"data/vaneerConsumption/Propositions62and66Deathpenalty.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/deathpenalty-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938586.html","title":"Propositions 62 and 66: Death penalty","title_page":"Propositions 62 and 66: Death penalty | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Prop. 62\nProp. 66\n1oo percent of precincts reporting partial returns—will be updated when all results are certified.\nBackground:\nWhether for or against the death penalty, both sides agree the criminal justice system isn’t working. Since the 1978 passage of the death penalty in California, 15 of the 930 individuals who received a death sentence have been executed. Another 103 have died prior to being executed, 64 have had sentences reduced by the courts while 748 remain in prison. The numbers illustrate the lengthy time inmates spend both waiting for court-appointed attorneys and for their cases to be heard, as well as an exhaustive appeals process intended to protect the innocent. Meanwhile, California has not carried out an execution since 2006 because of legal issues surrounding the state’s lethal injection procedures.\nWhat would they do?\nThe dueling campaigns of Propositions 62 and 66 seek to address California’s broken death penalty system—but in two very different ways. Prop. 62 would abolish the death penalty, and all current death row inmates would be resentenced to life in prison without parole. Prop. 66 attempts to reform capital punishment by shortening the time of legal challenges. It would also allow the state to house condemned men outside San Quentin, currently the only prison that has a death row for men.\nWhat would they cost the government?\nProp. 62 would save the state and counties around $150 million a year, with fewer costs related to prisons, murder trials and legal challenges to death sentences, according to the state legislative analyst. Under Prop. 66, the cost to state courts for processing legal challenges to death sentences is unknown. The measure could save tens of millions a year in prison costs.\nWhy are they on the ballot?\nFormer “M*A*S*H” actor Mike Farrell authored Proposition 62, and he has amassed celebrity support to abolish what critics describe as a failed system that doesn’t protect the innocent. Former NFL player Kermit Alexander—whose mother, sister and two nephews were murdered by a man now on death row—filed Prop. 66, the competing measure to expedite the death penalty process, and gained the support of law enforcement. Alexander was among the key critics of a failed 2012 ballot initiative that sought to abolish the death penalty.\nIf both Propositions 62 and 66 pass, the one with the most votes will prevail.\nWhat death penalty opponents say:\n(yes on Prop. 62 and no on Prop. 66)\nProp. 62 ensures convicted murderers serve a strict life sentence and abolishes a failed and biased death penalty system that has cost the state $5 billion to date. It ensures not a single innocent person would be wrongfully executed.\nProp. 66 will cost taxpayers millions of dollars, add layers of government bureaucracy that will lead to more delay, and increase the risk that California executes an innocent person.\nWhat death penalty supporters say:\n(no on Prop. 62 and yes on Prop. 66)\nAbolishing the death penalty under Prop. 62 would allow the most brutal murderers to stay alive on the taxpayer dime. Prop. 62 jeopardizes public safety, denies justice and closure to victims’ families, and rewards the most horrible killers.\nProp. 66 fixes California’s flawed death penalty system and ensures due process protections for those sentenced to death. It promotes justice for murder victims and their families.\nSupporting Prop. 62 or Opposing Prop. 66:\nFormer President Jimmy Carter Former President Jimmy Carter\nLaurene Powell Jobs, widow of Steve Jobs and founder of Emerson Collective Laurene Powell Jobs, widow of Steve Jobs and founder of Emerson Collective\nDanny Glover, actor Danny Glover, actor\nMike Farrell, actor Mike Farrell, actor\nAmerican Civil Liberties Union American Civil Liberties Union\nAntonio Villaraigosa, former Assembly speaker and mayor of Los Angeles Antonio Villaraigosa, former Assembly speaker and mayor of Los Angeles\nWillie Brown, former Assembly speaker and mayor of San Francisco Willie Brown, former Assembly speaker and mayor of San Francisco Opposing Prop. 62 or Supporting Prop. 66:\nCalifornia Correctional Peace Officers Association California Correctional Peace Officers Association\nCalifornia Association of Highway Patrolmen California Association of Highway Patrolmen\nBroadcom Corp. co-founder Henry T. Nicholas Broadcom Corp. co-founder Henry T. Nicholas\nRichard J. Riordan, former mayor of Los Angeles Richard J. Riordan, former mayor of Los Angeles\nFormer Gov. Pete Wilson Former Gov. Pete Wilson\nHouse Majority Leader Kevin McCarthy (R-Bakersfield) House Majority Leader Kevin McCarthy (R-Bakersfield)\nKermit Alexander, former NFL player Kermit Alexander, former NFL player\nShow me the money on Prop. 62:\nShow me the money on Prop. 66:\nMore information:\nRiverside County is the “death penalty capital of America,” according to this review of the justice system by The Guardian.\nThe death penalty is on the decline across the country. But 16 counties—including five in California—have used it several times in recent years. This report by the New York Times puts our ballot measures in a national context.\nWhat do death row inmates think about the two propositions on the ballot? The answers they gave the Los Angeles Times might surprise you.\nNewspaper Editorials:\nYes on 62, No on 66: San Francisco Chronicle, Sacramento Bee, Los Angeles Times, Mercury News, Press Democrat, Bakersfield Californian","url":"https://calmatters.org/articles/propositions-62-and-66-death-penalty/"}
