{"authors":[],"date_download":"2018-10-22 21:44:56","date_modify":"2018-10-22 21:44:56","date_publish":"2014-05-08 09:38:51","description":"A group calling itself the Donetsk People’s Republic said the poll was on whether to give the eastern regions more autonomy within Ukraine.","filename":"data/vaneerConsumption/ProRussiansinEasternUkraineDefyPutinWillVoteSunday.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/428481/140508-ukraine-vote-jsw-827a_30c8d5a37c3de4969109c608e2801f42.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_pro-russians-eastern-ukraine-defy-putin-will-vote-sunday-n100101_1540244696.html","title":"Pro-Russians in Eastern Ukraine Defy Putin, Will Vote Sunday","title_page":"Pro-Russians in Eastern Ukraine Defy Putin, Will Vote Sunday","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDONETSK, Ukraine -- Pro-Russian separatists in two Ukrainian cities vowed to continue with a referendum on autonomy planned for Sunday despite Vladimir Putin's call to delay the vote.\nA group calling itself the Donetsk People’s Republic seized the City Hall and said the looming vote was on whether to give the eastern regions more autonomy within Ukraine, but left open the possibility of using it to seek independence or annexation by Russia.\n\"It's going to happen and there is going to be only one question, whether you support the independence of the Donetsk republic.\"\" separatist leader Denis Pushilin told reporters.\nFellow rebel group in the eastern Ukrainian region of Luhansk, the Army of the Southeast, also rejected Putin's appeal according to Russia's state-run RIA Novosti news agency.\nMany fear that such a vote would be a flashpoint for further violence between Ukrainian troops and the militants who have seized government buildings in about a dozen cities in the east.\nThe Russian president called on Wednesday for talks between Ukraine's new pro-Western leaders and separatists in the east.\n\"We call on the representatives of southeastern Ukraine, the supporters of the federalization of the country, to postpone the referendum planned for May 11,\" Putin said, adding that this would create conditions for dialogue between the Ukrainian authorities in Kiev and the separatists.\nHowever, Kiev suggested his U-turn was evidence that international pressure on Moscow was working.\n\"The absolute priority for the government of Ukraine is a full-scale national dialogue with the participation of political forces, regional representatives and the public,\" Ukraine’s Foreign Ministry said in a statement. \"But dialogue is impossible and unthinkable with terrorists.\"\nKiev calls the pro-Russian separatists, who now control swathes of eastern Ukraine, \"terrorists\" or \"bandits\" who are supported by Russia as part of efforts to destabilize Ukraine.\nPutin also said that Russia has pulled its troops away from the Ukrainian border, but NATO and Washington said they saw no signs of this.\nDespite the push for the referendum, a strong majority of Ukrainians want their country to remain a single, unified state, even in the largely Russian-speaking east, a poll released Thursday by the Pew Research Center in Washington found.\nNationwide 77 percent of people want Ukraine to maintain its current borders, while nearly as many, or 70 percent, in the east feel the same. Only among Russian speakers does the percentage drop significantly, but it is still over half at 58 percent.\nThe central government in Kiev has the confidence of only about 41 percent of Ukrainians, with a sharp divide between the west of the country, where support is 60 percent, and the east, where it is a low 24 percent, according to the poll.\nReuters and The Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/pro-russians-eastern-ukraine-defy-putin-will-vote-sunday-n100101"}
