{"authors":[],"date_download":"2018-10-22 21:17:22","date_modify":"2018-10-22 21:17:22","date_publish":"2014-06-04 16:07:49","description":"Amid rising death tolls in eastern Ukraine, the head of a pro-Russian rebel group expressed disappointment that Putin hadn't sent in more troops.","filename":"data/vaneerConsumption/ProRussiaRebelsinUkraineSayPutinGaveUsFalseHope.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_21/451056/140519-putin-7a_a56d03d51a8b51b9f07a3fa31cd46e7d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_pro-russia-rebels-ukraine-say-putin-gave-us-false-hope-n122456_1540243042.html","title":"Pro-Russia Rebels in Ukraine Say Putin Gave Us 'False Hope'","title_page":"Pro-Russia Rebels in Ukraine Say Putin Gave Us 'False Hope'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAmid rising death tolls in eastern Ukraine, the head of a pro-Russian rebel group expressed disappointment Wednesday that Russian President Vladimir Putin hadn't sent in more troops.\n\"The only possible help for us would be if the Russian forces came,\" said Dmitry Boitsov of the Russian Orthodox Army from Slaviansk, Ukraine — where fighting has been raging for two straight days.\n\"If he doesn't bring in forces, there will be people here who would want to destroy him, because he gave us false hope.\"\nThe Russian Orthodox Army is a newly formed militia group that is one of several armed rebel groups fighting in Ukraine's chaotic east. They are in dire need of help, Boitsov said.\n\"Our fighters are mine workers and young lads who do not know how to use arms,\" Boitsov told NBC News. It feels \"like the whole world is against us.There are also many traitors amongst us.\"","url":"https://www.nbcnews.com/storyline/ukraine-crisis/pro-russia-rebels-ukraine-say-putin-gave-us-false-hope-n122456"}
