{"authors":["Associated Press"],"date_download":"2018-10-23 02:11:12","date_modify":"2018-10-23 02:11:12","date_publish":"2017-04-26 13:05:48","description":"FAYETTEVILLE, N.C. (AP) - A North Carolina prosecutor says an Army veteran and her boyfriend, who's also a soldier, can be heard laughing as they filmed...","filename":"data/vaneerConsumption/ProsecutorCouplelaughedastheyfatallyshotservicedog.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465053-1493208652-387_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447566_Prosecutor-Couple-laughed-fatally-shot-service-dog_1540260672.html","title":"Prosecutor: Couple laughed as they fatally shot service dog","title_page":"Prosecutor: Couple laughed as they fatally shot service dog | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FAYETTEVILLE, N.C. (AP) - A North Carolina prosecutor says an Army veteran and her boyfriend, who's also a soldier, can be heard laughing as they filmed themselves fatally shooting her service dog.\nThe Fayetteville Observer reports (http://bit.ly/2oILugy ) 23-year-old Marinna Rollins and 25-year-old Jarren Heng are accused of tying the dog, Cam, to a tree and shooting it multiple times with a rifle.\nCumberland County District Attorney Clark Reaves says the two can be heard giggling and laughing as the dog is being killed.\nIn this undated photo released by the Cumberland County Sheriff's Office, in Fayetteville, N.C., Marinna Rollins, poses for a photo. Rollins was arrested Tuesday, April 25, 2017, and charged with cruelty to animals. The veteran has been charged with tying her service dog to a tree and shooting it five times while a soldier filmed it. (Cumberland County Sheriff's Office via AP)\nBoth are charged with cruelty to animals.\nCourt documents show Rollins medically retired from the Army in January.\nLt. Col. Robert Bockholt said Heng is a soldier in a unit that reports to the Army Special Operations Command. Bockholt declined to give the exact unit.\nIt's unclear whether they have lawyers.","url":"https://www.dailymail.co.uk/wires/ap/article-4447566/Prosecutor-Couple-laughed-fatally-shot-service-dog.html"}
