{"authors":[],"date_download":"2018-10-22 21:06:50","date_modify":"2018-10-22 21:06:50","date_publish":"2014-05-05 22:54:09","description":"A Dallas judge's handling of a rape case and her suggestion that the 14-year-old victim was lying has outraged the city's top prosecutor.","filename":"data/vaneerConsumption/ProsecutorBlastsJudgesHandlingofRapeCase.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421916/140505-craig-watkins-1904_4a3d9bcbdb54f1a07d9b5a8632f4b4b3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_prosecutor-blasts-judges-handling-rape-case-n97696_1540242410.html","title":"Prosecutor Blasts Judge's Handling of Rape Case","title_page":"Prosecutor Blasts Judge's Handling of Rape Case","title_rss":"NULL","source_domain":"nbcnews.com","text":"Watkins said he was concerned about the potential \"that rape victims may not come forward\" due to the case.\n\"The judge basically blamed the victim for what happened to her,\" he said, adding: \"In this case, when a victim comes forward and the person that they put their trust in — the judge — calls into question their credibility ... does a disservice to our ability as prosecutors.\"\nThe judge said the teen had agreed to have sex with Young, just not at school. Howard said medical records suggested that the girl had three sexual partners and had given birth, which her mother denies.\n\"She wasn't the victim she claimed to be,\" Howard said. \"He is not your typical sex offender.\"\nShe also defended not sentencing Young to prison.\n\"There are rape cases that deserve life. There are rape cases that deserve 20 years,\" Howard told the newspaper. \"Every now and then you have one of those that deserve probation. This is one of those and I stand by it.\"\nHoward recused herself Friday, telling the Morning News last week that she did so in order to explain her decision.\nWatkins said his prosecutors had pushed for five years' prison time. He also said the judge declined to require Young to follow standard sex offender requirements such as attending treatment, undergoing an evaluation or staying away from children. Prosecutors will ask the new judge to order a full evaluation of his probation and potentially stricter conditions.\nYoung does have to register as a sex offender for the rest of his life and is spending 45 days in jail as a condition of probation.\nWatkins has previously spoken out about what he sees as the misconduct of some Dallas judges, particularly one who cited him for contempt of court last year in a high-profile mortgage fraud case. Watkins allowed six prosecutors from his office to run for judgeships in this year's primary elections.\nHoward is running unopposed for re-election this fall. Watkins said it was too late for someone to challenge her, but that \"hopefully, going forward, we'll have judges that are more responsible.\"\n- Associated Press","url":"https://www.nbcnews.com/news/us-news/prosecutor-blasts-judges-handling-rape-case-n97696"}
