{"authors":[],"date_download":"2018-10-30 14:23:37","date_modify":"2018-10-30 14:23:37","date_publish":"2017-04-28 18:51:00","description":"Scores of protesters are expected to demonstrate across Atlanta today as President Donald Trump returns to Georgia for the first time since his election.","filename":"data/vaneerConsumption/ProtestliveupdatesreactionfromAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/28/Images/image_uploaded_from_ios_720_20170428145123.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_day-prot_873b8d1f72f3a38094dd7abf522e6766__1540909417.html","title":"Protest live updates, reaction from Atlanta","title_page":"Trump at NRA: Protest live updates, reaction from Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"3:30 p.m.\nProtests against President Donald Trump have all but wrapped up for the day.\nHundreds of protesters gathered in Woodruff Park, outside of CNN Center and the Capital City Club on Friday to protest Trump, who made his first appearance in Georgia after his election.\nREAD ABOUT TRUMP’S SPEECHES\nTrump spoke at a National Rifle Association convention, which was estimated to have 80,000 people in attendance. He then went to a fundraiser for Karen Handel, who is running for former congressman Tom Price’s Sixth District congressional seat.\nAnother NRA protest is planned for Saturday, aimed at bringing attention to gun violence across the country.\n3:15 p.m.\nThere are only about 30 or so protesters left outside of the fundraiser where Trump spoke.\n3:10 p.m.\nProtesters standing outside the Handel fundraiser began shouting ‘love trumps hate.”\nProtesters against @realDonaldTrump chant \"love trumps hate\" outside a fundraiser for @karenhandel following presidents speech to @NRA pic.twitter.com/09zXDQqO0V — Meris Lutz (@merisaurus) April 28, 2017\n2:50 p.m.\nProtesters outside of the Capitol City Club broke out into a loud chant of “Not my president,” as Trump arrived to attend a fundraiser for Karen Handel.\nTRUMP: Follow the president’s speeches in Atlanta at our Political Insider live blog\nPHOTOS: See inside the NRA convention\nHandel is running in the Sixth District congressional race to replace Tom Price, who was picked by Trump to head the Department of Health and Human Services.\nREAD ABOUT THE RACE\nProtesters shouted \"Not my president,\" as President Donald Trump arrived to attend a fundraiser for Karen Handel in downtown Atlanta. (Misty Williams/Meris Lutz)\n2:35 p.m.\nTrump has wrapped up his NRA speech. He will now head to a fundraiser for Karen Handel.\n2:20 p.m.\nAs Trump spoke to thousands of NRA members, protesters outside of where he will speak next expressed frustration with Atlanta police officers asking them to move back. They chanted “not one step back.”\nProtesters gathered to demonstrate against President Donald Trump as he spoke to the National Rifle Association convention in Atlanta (Misty Williams/Kristina Torres)\nWATCH TRUMP’S SPEECH LIVE\n2:15 p.m.\nFollow Trump’s speech to the NRA convention on our Political Insider live blog.\n2:08: p.m.\nPresident Trump is taking the stage.\n1:50 p.m.\nProtesters are now gathered near the Capitol City Club at Ted Turner Drive and John Portman Boulevard.\nFollowing his speech at the NRA convention, Trump will attend a fundraiser for Karen Handel, who is running to replace fo rmer congressman Tom Price in the 6th District.\nProtesters are now heading back downtown, toward the location of Karen Handel's fundraiser where President Donald is to speak later today. (The Atlanta Journal-Constitution)\nREAD ABOUT THE RACE HERE\n1:30 p.m.\nAirforce One has landed at Hartsfield-Jackson. Gov. Nathan Deal and his wife have arrived to greet President Trump on teh tarmac.\nWATCH TRUMP’S ARRIVAL LIVE\n1:20 p.m.\nAbout 100 people are still protesting outside of CNN Center.\nPriscilla Smith attended the protest dressed as “the real Donna J. Trump.”\n\"Look at all these people who came out to support me. It's my tremendous animal magnetism,\" Smith said, remaining in character.\nPriscilla Smith, a.k.a. \"the real Donna J. Trump\" joined protesters demonstrating against President Trump, who was in town to deliver a speech at the National Rifle Association convention. (Misty Williams/Meris Lutz)\n1:15 p.m.\nThe AJC is live at Hartsfield-Jackson International Airport awaiting the arrival of President Trump.\nWATCH THE LIVE FEED\n1:00 p.m.\nProtesters at Woodruff Park are talking to police about where they can gather. They did not have a permit.\nProtesters now talking with police about where to gather ahead of President Trump's speech at the NRA convention. They did not have a permit. (Kristina Torres/The Atlanta Journal-Constitution)\nMeanwhile, a large crowd gathered outside the CNN Center and Omni Hotel area, awaiting Trump’s arrival.\n12:40 p.m.\nA couple of hundred protesters at Woodruff Park are holding a “die-in” to bring attention to gun violence and deaths in the U.S.\nThe event comes as Trump plans to address the National Rifle Association at its convention in downtown.\nProtesters held a \"die-in\" at Woodruff Park as President Donald Trump headed Friday to Atlanta to speak to the National Rifle Association annual convention. (Kristina Torres/Kristina Torres)\nThe protesters say they plan to march toward the NRA convention at the Georgia World Congress Center in downtown. An estimated 80,000 people are attending the NRA event.\nREAD MORE ABOUT THE ‘DIE-IN’\nA couple of hundred protesters at Woodruff Park held a “die-in” to bring attention to gun violence and deaths in the U.S. (Henry Taylor/AJC)\n“We’re going to have to continue airing our grievances,” said Gerald Griggs with the Georgia Alliance for Social Justice, before leading the crowd in a chant of “Flip the 6th.”\nTrump is set to speak at 1:30 p.m. You can watch the live stream here.\n12:15 p.m.\nAt Woodruff Park, protesters chanted “We are Georgia” and “Veto campus carry.”\nGovernor Nathan Deal must decide whether to sign a \"campus carry” bill that allows guns on college campuses. Lawmakers approved the measure after agreeing to Deal’s demands to bar guns from on-campus child care facilities, faculty and administrative office space, and disciplinary meetings.\nCAMPUS CARRY: Read more about it here\nMeanwhile at Centennial Park, about a dozen people have now gathered.\nChristian Lemke, who was in town from Columbia, SC, to attend the NRA convention, appealed to protesters for a dialogue.\n\"They're talking about fascism and we are against fascism too because we want less government control,\" said Lemke, who works for a political organization but declined to say which one.\nChristian Lemke, right, of Columbia South Carolina, appealed for a dialogue with protesters at Centennial Olympic Park gathering in advance of President Donald Trump's April, 28, 2017, speech at the National Rifle Association’s convention in Atlanta. (Meris Lutz/The Atlanta Journal-Constitution)\nHe said there was a \"diversity of opinion\" on gun regulation among second amendment activists and he personally was in favor of universal background checks.\n\"I don't think you should have felons walking around with guns,\" he said.\nProtester Charlie Abrams warned against being \"provoked\" by Trump supporters into a confrontation.\n\"It's always a concern,\" Abrams said. \"Trump himself has encouraged violence against protesters.\"\nAbrams said the protest was not aimed at the people attending the conference but rather at Trump himself.\n11:50 a.m.\nProtesters at Woodruff Park began gathering for a \"die-in,\" representing the number of people killed by guns each year.\nThey are protesting President Donald Trump's speech to the National Rifle Association convention in downtown Atlanta.\nRELATED: Political Insider live blog of Trump speeches\nProtesters at Woodruff Park began gathering for a \"die-in,\" representing the number of people killed by guns each year. They are protesting President Donald Trump's speech to the National Rifle Association convention in downtown Atlanta. (Misty Williams/Kristina Torres)\nTrump is expected to address the NRA at 1:30 p.m. today.\nWATCH THE LIVE STREAM\n11:45 a.m.\nProtesters around Centennial Olympic Park began chanting.\n“No KKK, no fascist USA. No Trump,” they shouted.\nJeff Bergstrom, a real estate broker from Atlanta, called Trump an \"idiot.\"\n\"He really is really bad for the country,\" he said.\nJeff Bergstrom, a real estate broker from Atlanta, called Trump an \"idiot.\" (Misty Williams/Meris Lutz)\nBergstrom said he thought the NRA provided a good platform for opposition, but added: \"We're not going to change any views.\"\n11:30 a.m.\nProtesters are beginning to gather in Woodruff Park in advance of Trump’s NRA speech. At least 300 people are expected.\nA small group of protesters have also begun to gather at the corner of Marietta Street and Andrew Young International Boulevard.\nTrump is expected to address the NRA convention at 1:30 p.m.\nWATCH THE LIVE STREAM\n[...]\nProtesters gathered in Woodruff Park Friday morning to protest President Donald Trump's speech to the National Rifle Association convention in downtown Atlanta. (Misty Williams/Kristina Torres)\n11:15 a.m.\nThe word from AJC reporters tracking planned protests around Atlanta is that crowds remain light.\nMartha Anderson drove up from Macon after seeing plans for a protest on Facebook. She said she just hopes to make her voice heard. (Misty Williams/Meris Lutz)\nMartha Anderson drove up from Macon after seeing plans for a protest on Facebook. She said she just hopes to make her voice heard.\n\"Truly, when Donald Trump was running I thought it was a joke, and now the joke's on us,\" she said. \"All the objectionable things just seem petty compared to one damn tweet causing someone to get nuked.\"\nAnderson described herself as a \"strong supporter\" of the second amendment.\n\"I'm a gun carrier myself but I do want more gun regulations,\" she said.\n11:10 a.m.\nProtest organizers at Woodruff Park suggested that they plan on blocking traffic in the area and could possibly organize a march to Centennial Olympic Park.\nDonovan Holtzclaw sets up a banner at the Georgia World Congress Center in preparation for the NRA convention. HYOSUB SHIN / HSHIN@AJC.COM\n10:30 a.m.\nNo sign of protesters yet at Centennial Olympic Park, although there were some people in town for the NRA convention.\nPaul Kwakenat flew down from St. Louis Park Minnesota with his brother and nephews. He said he's here to meet people and check out new products but probably won't make it to the presidents speech due to \"long lines.\"\n\"We're gun owners so Trump's our man,\" he said.\nKwakenat said he sees no common ground with those who want more regulation.\n\"It's just one step to taking things away,\" he said. \"It's government trying to take your rights away.\"\n10:00 a.m.\nScores of protesters are expected to demonstrate across Atlanta today as President Donald Trump returns to Georgia for the first time since his election.\nTrump will be speaking at the National Rifle Association’s convention in downtown Atlanta and attending a fundraiser for Republican Karen Handle, who is running for Congress.\nRELATED: Political Insider live blog\nPHOTOS: Scenes from the 2017 NRA convention in Atlanta\nProtesters will gather outside the Georgia World Congress Center where an estimated 80,000 people are attending the four-day NRA convention. They aim to send a pointed message.\nA “die-in” featuring 93 people lying on the grassy turf at Woodruff Park will represent what organizers say is the number of people who die daily in the U.S. from gun violence. The protesters will also demand more public meetings with GOP lawmakers.\nOrganizers expect 80,000 attendees to attend the146th NRA Annual Meetings and Exhibits, as the gathering is officially called. (Please note: twin brothers Aaron and Blaine Simpson shoot air rifle pellets in this video.) (www.accessatlanta.com)\nGeorgia U.S. Rep. John Lewis is slated to headline another rally on Saturday outside the NRA event.\nProtesters are also expected to gather today at Centennial Olympic Park\nThe AJC will be live blogging Trump’s visit and the protests around town throughout the day.\nReturn for updates.\n- Staff writer Greg Bluestein contributed to this report.","url":"https://www.ajc.com/news/breaking-news/day-protests-wraps-trump-heads-out-atlanta/ACwd4NcpKBuvigyckmMD2H/"}
