{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 21:41:23","date_modify":"2018-10-22 21:41:23","date_publish":"2016-11-28 00:00:00","description":"They're opposed to a government decision to void the country's largest-denomination bank notes. The government says the move is designed to combat corruption and target the black market.","filename":"data/vaneerConsumption/ProtestersAcrossIndiaRailAgainstCountrywideCashCrunch.json","image_url":"https://media.npr.org/assets/img/2016/11/28/gettyimages-626250630_wide-c71355edd6b4144255f150cd8abf5cd28b903bb8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_11_28_503580439_protesters-across-india-rail-against-country-wide-cash-crunch_1540244483.html","title":"Protesters Across India Rail Against Countrywide Cash Crunch","title_page":"Protesters Across India Rail Against Countrywide Cash Crunch : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Protesters Across India Rail Against Countrywide Cash Crunch\nEnlarge this image toggle caption Kiran Manjunath /AFP/Getty Images Kiran Manjunath /AFP/Getty Images\nAcross India, protesters rallied Monday against a controversial government decision to void the country's largest-denomination bank notes.\nAll existing 500- and 1,000-rupee notes have been canceled. Critics say the currency move, which was designed to combat corruption and target the black market, has been mismanaged. They say it has made life disproportionately difficult for India's poorest people because they are less likely to have a bank account.\nThe protests were organized by several different opposition parties and was billed as a \"Day of Rage,\" The Associated Press reported. But the response was \"patchy,\" according to the wire service, \"with the protests only affecting daily life in opposition-ruled states.\"\nStill, the demonstrations are a sign of the uneasy transition to \"demonetize\" the primarily cash-based economy. Three weeks ago, Prime Minister Narendra Modi declared that the government was effectively wiping out 86 percent of India's cash in terms of value overnight, NPR's Julie McCarthy reported.\nThat has caused a major cash crunch, with citizens waiting in hours-long bank lines to deposit their money. They had 50 days to do so from the time of the announcement. The amounts of new bills they can withdraw are limited and many ATMs are empty, Julie said. In short: \"Ninety-seven percent of all transactions are in cash. People don't have it. This is a problem.\"\ntoggle caption Bikas Das/AP\nOpposition parties \"stalled parliament and demanded Mr Modi should apologise for the decision\" last week, the BBC reported.\nModi announced the decision earlier this month in a televised speech, hailing it as a way to bring black market money back into the legal financial system, as The Two-Way reported.\n\"There comes a time in the history of a country's development when a need is felt for a strong and decisive step,\" Modi said. \"For years, this country has felt that corruption, black money and terrorism are festering sores, holding us back in the race toward development.\"\nReuters reported that at least $74.2 billion has been deposited into banks since the beginning of the campaign.","url":"https://www.npr.org/sections/thetwo-way/2016/11/28/503580439/protesters-across-india-rail-against-country-wide-cash-crunch"}
