{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:16:03","date_modify":"2018-10-30 20:16:03","date_publish":"2015-07-28 19:46:43","description":"Pro-lifers are attending over 70 #WomenBetrayedRally today and are calling for the defunding and investigation of Planned Parenthood.","filename":"data/vaneerConsumption/ProtestsAgainstPlannedParenthoodin70Cities.json","image_url":"https://media.breitbart.com/media/2015/07/WomenBetrayedRally-Austin-3-LS-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_07_28__1540930563.html","title":"Protests Against Planned Parenthood in 70 Cities","title_page":"Protests Against Planned Parenthood in 70 Cities","title_rss":"NULL","source_domain":"breitbart.com","text":"AUSTIN, Texas — Pro-lifers across America are gathering today at what has been dubbed “#WomenBetrayedRally.” The rallies, in more than 70 cities across the nation, come in the wake of the release of undercover videos showing Planned Parenthood executives discussing the harvesting and sale of baby body parts. They are calling on state and federal officials to investigate and defund Planned Parenthood.\nThe Center for Medical Progress released undercover videos on July 14th and July 21st which riveted the nation. The response – Governors and Congressmen have called for the defunding and investigation of Planned Parenthood. A third video was released today.\nThe national pro-life group Students for Life of America (SFLA) and a partner organization, Pro-Life Future, created the #WomenBetrayed initiative. They are being joined with other pro-life organizations in what has become a team effort to get a collective cry against the organization – calls for defunding and for criminal and other investigations.\nThe morning rally in Austin, Texas, drew approximately 200 people at the south steps of the state’s Capitol. Abby Johnson, a former director for Planned Parenthood, and now a pro-life icon in Texas, spoke at the event. Johnson worked for Planned Parenthood for eight years but that changed in 2009 when she assisted with an ultasound-guided abortion. Johnson watched as a 13-week-old baby fought for its life at the hands of an abortionist. She is now committed to exposing abortion and Planned Parenthood.\nJoe Pojman, founder and executive director of Texas Alliance for Life, touted the pro-life gains made in Texas in the legislature. He told Breitbart Texas, “The legislature has done more in the Capitol to defund Planned Parenthood, and has shifted tens of millions in tax dollars from the organization.”\nPojman says five major pro-life bills were passed in 2015, including the defunding of Planned Parenthood. The Texas legislature also increased funding for alternatives to abortion. It continued exclusions from funding for Planned Parenthood for women’s health programs, but increased funds for women’s health initiatives in clinics that do not perform abortions.\nOther measures passed included requiring abortion facility workers and volunteers to undergo training to recognize and assist victims of human sex trafficking.\nTexas lawmakers reformed pregnant minor judicial bypass procedures to stop venue shopping of judges, and heightened the standard for obtaining a bypass.\nPublic school sex education courses are also now banned from promoting abortion.\nMeasures to promote adult stem cell research and treatments in lieu of embryonic cells were also passed.\nTexas House Representative Jodie Laubenberg (R-Parker) told those at the #WomenBetrayedRally, “What is happening is no different then what happened in Nazi Germany. She said experiments were first done on older men and women, and now they are being done on babies.\nLaubenberg called Planned Parenthood, “liars and destroyers of life.” She continued, “God has heard the cry of those babies and he is speaking for them.”\nThe Texas Representative is the author of landmark pro-life legislation, House Bill2, “the Woman’s Health and Preborn Pain Act.”\nOne of the rally attendees, Elizabeth Bradford from Austin, Texas, told Breitbart Texas, “Planned Parenthood began in New York as a way of killing blacks, minorities, and Jews. She said the organization used to lure women in with the signs in front of its building. She said they even had signs in Yiddish. Bradford said it is important for people to know the true beginnings of the organization.\nHearings will be conducted in the Texas State Senate on Wednesday. The Senate Health & Human Services Committee has called a special meeting to examine the business practices and regulatory structure of Planned Parenthood affiliates in Texas. The committee will also investigate whether state or federal laws are being broken in Texas as it relates to the donation and/or sale of fetal tissue.\nThe committee will also consider recommendations to strengthen regulations on abortion providers, including further restrictions on the sale of fetal tissue.\nAs reported by Breitbart News, Planned Parenthood had a net profit of $127 million in 2013-2014.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2015/07/28/70-city-womenbetrayedrally-calls-to-defund-and-investigate-planned-parenthood/"}
