{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:15:23","date_modify":"2018-10-30 18:15:23","date_publish":"2015-05-27 13:13:02","description":"Millions of working families on low incomes are likely to see their benefits cut, thanks to Conservative pledges to protect pensioner benefits. In the |","filename":"data/vaneerConsumption/ProtectingPensionerIncomesWillInvolveToughWelfareChoicesThinkTankWarns.json","image_url":"https://media.breitbart.com/media/2015/05/Iain-Duncan-Smith.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_05_27__1540923323.html","title":"Protecting Pensioner Incomes Will Involve Tough Welfare Choices, Think Tank Warns","title_page":"Protecting Pensioner Incomes Will Involve Tough Welfare Choices, Think Tank Warns | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Millions of working families on low incomes are likely to see their benefits cut, thanks to Conservative pledges to protect pensioner benefits. In the run-up to the election Chancellor George Osborne promised to cut £12 billion out of the welfare budget, but he and his colleagues effectively ring-fenced the 40 per cent of total welfare spend that goes to pensioners.\nThe government will spend a massive £220 billion on welfare this year, more than a third of total governmental spending. Of that, £95 billion will go on state pension payments. The Conservatives promised to cut £12 billion from the budget in their manifesto, but banked on being able to water down that proposal thanks to a second coalition with the Liberal Democrats. Now they are left with the task of finding more than £10 billion in welfare budget cuts or risk missing their target.\nWelfare Secretary Iain Duncan Smith has already said that he will refuse to allow his budget to be ‘salami sliced’ – that is, a flat percentage simply removed from each pot within the budget regardless of merit. But no suggestions as to how to reach the target have yet been forthcoming from his department.\nSpecific benefits policies included in the Conservative Party manifesto hit a small number of people very hard, but deliver only a tiny proportion of the target. Reducing the benefits cap from £26,000 to £23,000, for example, will affect approximately 24,000 families, who could lose up to 11.5 percent of their income. But it will save the government just £0.1 billion.\nSimilarly, scrapping housing benefit from jobseekers aged 18-21 would hit those affected hard, but saves just £0.1 billion.\nThe Institute for Fiscal Studies has released some suggestions on how the cuts could be managed. Suggestions include insisting that housing benefit recipients pay up to ten percent of their rental costs, which would save the treasury around £2.5 billion a year, and scrapping child benefit for those earning over £30,000, which would produce a saving of around £5 billion a year.\nBut Robert Joyce, a senior economist with the Insitute has warned that a continued commitment to protecting pensioner benefits, which include free bus passes and winter fuel payments for everyone over 65 regardless of income, would mean that the cuts would fall disproportionately on younger working families.\n“The Conservative manifesto pledged to exclude more than 40% of that budget from cuts,” Mr Joyce wrote in a briefing paper. “This almost doubles the proportionate cut implied for the rest of the budget, to about 10%.\n“About 80% of entitlements to the benefits [excluding pensions] go to working-age families; and because the large majority of working-age benefits spending is means-tested, it would be very difficult to avoid hitting low-income households – particularly those with children – hardest.”\nMr Joyce predicts that tax credits and housing benefit are likely to be targeted, as together they make up more than half of the remaining welfare budget, once pensioner entitlements have been discounted. Disability and incapacity benefits account for the next third, while child benefit is the next largest accounting for £12 billion a year.\nMr Joyce points out that a fixed taper placed on child benefit in 2013 will ensnare more and more families over the next decade due to fiscal drag. He argues that it would be better to simply set a lower threshold immediately.\n“One could abolish child benefit per se and simply increase the child element of child tax credit (and its imminent replacement, universal credit) correspondingly, so as to compensate low-income families who claim their means-tested entitlements,” he says. Doing so, whilst protecting the lowest earning third of families would save the treasury approximately £5 billion.\nCutting child taxes for lower earners to “reverse some of the large increases in generosity towards this group over recent history” would also save £5 billion, and would strengthen work incentives: “families would have less tax credit income to lose by increasing their earnings or to gain by reducing their earnings.”\nOn housing benefit, introducing housing rates so that the claimant must contribute a sum “would give all tenants some incentive to shop around for cheaper housing.” In the private sector, the measure would be expected to save some £0.9 billion, whilst in the social housing sector, the same measure could reap £1.6 billion.\nUltimately, Mr Joyce concludes that the government is faced with a tough choice ahead of it: saving money by only affecting better off claimants will reduce work incentives, whilst protecting work incentives will involve hitting the poorest in society, thus raising poverty (at least in the short term). “We should soon find out the balance that the new government chooses to strike.”","url":"https://www.breitbart.com/europe/2015/05/27/protecting-pensioners-incomes-will-involve-tough-welfare-choices-think-tank-warns/"}
