{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:09:44","date_modify":"2018-10-30 19:09:44","date_publish":"2016-11-14 20:49:56","description":"About 40 people have occupied Sen. Chuck Schumer's (D-NY) Capitol Hill office to protest his ties to Wall Street, the AP reported.","filename":"data/vaneerConsumption/ProtestersOccupySenChuckSchumersCapitolHillOfficetoProtestHisTiestoWallStreet.json","image_url":"https://media.breitbart.com/media/2016/11/Chuck-Schumer-protests-Capitol-Hill-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_14__1540926584.html","title":"Protesters Occupy Sen. Chuck Schumer's Capitol Hill Office to Protest His Ties to Wall Street","title_page":"Protesters Occupy Sen. Chuck Schumer's Capitol Hill Office to Protest His Ties to Wall Street","title_rss":"NULL","source_domain":"breitbart.com","text":"About 40 people have occupied Sen. Chuck Schumer’s (D-NY) Capitol Hill office to protest his ties to Wall Street as he prepares to lead Senate Democrats in the 115th meeting of Congress, the Associated Press reported.\nU.S. Capitol Police removed the protesters, who said they want Sen. Bernie Sanders (I-VT) to lead the party instead, after a Republican sweep in the elections.\nThe protesters, who came from groups such as Black Lives Matter and Occupy Wall Street, argued that Hillary Clinton was defeated because of her ties to Wall Street and big-money donors and said that Sen. Schumer is also associated with big-money donors.\nA livestream on Facebook showed 20-25 people conducting a sit-in inside Sen. Schumer’s office, chanting, “Forward together, not one step back,” and singing songs.\nThe group that organized the protests, AllOfUs2016, hopes this is the start of many protests against Wall Street Democrats.\n“Our goal is to show the Democratic Party needs new leadership and they failed to protect us,” the group’s leader Waleed Shahid said to Roll Call. “We want Chuck Schumer to withdraw his name.”","url":"https://www.breitbart.com/politics/2016/11/14/protesters-occupy-schumers-capitol-hill-office-protest-ties-wall-street/"}
