{"authors":["Kaileen Gaul For Dailymail.Com"],"date_download":"2018-10-23 04:15:50","date_modify":"2018-10-23 04:15:50","date_publish":"2017-03-10 14:24:28","description":"Teenage boys from Grand Rapids Christian High School in Grand Rapids, Michigan were asked to stop their demonstration in favor of President Trump's immigration policies on March 3.","filename":"data/vaneerConsumption/ProTrumpstudentsSUSPENDEDafterstagingprotest.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E2379A000000578-0-image-a-2_1489159435220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301408_Students-SUSPENDED-staging-pro-Trump-protest_1540268150.html","title":"Pro-Trump students SUSPENDED after staging protest","title_page":"Pro-Trump students SUSPENDED after staging protest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Four private school teens were suspended from their high school for two days after staging a pro-Trump demonstration and making disrespectful comments towards other students.\nThe unidentified teenage boys from Grand Rapids Christian High School in Grand Rapids, Michigan were asked to stop their demonstration in favor of President Trump's immigration policies.\nOn March 3, they held signs that read 'Build the Wall' and 'Trump' in front of a banner that read 'Immigrants are a Blessing Not a Burden'. A teacher stopped them after less than a minute in footage obtained by WZZM.\nScroll down for video\nThe four teens kneel for a photo with signs reading 'Build the Wall' and 'Trump'\nBut the school is saying the students weren't suspended for supporting Trump but for making disrespectful comments at their fellow students.\nSuperintendent Thomas DeJonge tolf WZZM in a statement: 'To be clear, the students were not disciplined because of having expressed their political viewpoint.'\n'Rather, they were disciplined because of the disruption they caused and disrespect they demonstrated toward fellow students and staff.'\nThe four teenagers also said they weren't trying to make a political statement but wanted to show both sides of a hot topic according to Fox 17. They also clarified they are not against legal immigration.\nThe teens appear to be posing for a picture before a teacher runs up to stop them. They then have a calm conversation as other students walk by, oblivious to what just happened.\nThe school says they were not suspended for making a political statement but because they made rude comments towards students after the demonstration\nThe social justice group 'Love Thy Neighbor' put the banner in the common area. After the teacher left tensions were allegedly high which is why the students were suspended.\nThe school released a statement saying the four have apologized for their behavior.\nParents of the suspended students wondered why the school would put a banner supporting a controversial political issue up in the first place.\nOne parent asked: 'Why are they bringing this political nonsense into the school?'\nPresident Trump won the popular vote in Kent County on November 8. In the Republican primary, Ted Cruz won and John Kasich came in second according to Kent County data.","url":"https://www.dailymail.co.uk/news/article-4301408/Students-SUSPENDED-staging-pro-Trump-protest.html"}
