{"authors":["Breitbart London"],"date_download":"2018-10-30 22:00:53","date_modify":"2018-10-30 22:00:53","date_publish":"2017-03-25 15:58:38","description":"EU President Donald Tusk called for leadership to steer Europe out of crisis at a special summit in Rome on Saturday to mark the 60th anniversary of the bloc's founding treaties.","filename":"data/vaneerConsumption/ProveYouAreLeadersofEuropeTuskTellsRomeSummit.json","image_url":"https://media.breitbart.com/media/2017/03/wi/afp/25/34c4o6b-e1490457273992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_25__1540936853.html","title":"'Prove You Are Leaders of Europe,' Tusk Tells Rome Summit","title_page":"'Prove You Are Leaders of Europe,' Tusk Tells Rome Summit","title_rss":"NULL","source_domain":"breitbart.com","text":"ROME (AFP) — EU President Donald Tusk called for leadership to steer Europe out of crisis at a special summit in Rome on Saturday to mark the 60th anniversary of the bloc’s founding treaties.\n“Prove today that you are the leaders of Europe, that you can care for this great legacy we inherited from the heroes of European integration 60 years ago,” former Polish prime minister Tusk said in a speech.\n“Europe as a political entity will either be united, or will not be at all.”\nTwenty-seven leaders are meeting without British Prime Minister Theresa May to celebrate the signing of the European Union’s founding Treaty of Rome on March 25, 1957.\nBritain’s decision to leave the bloc is one of a host of crises facing an increasingly divided EU, along with migration, the economy, terrorism and the rise of populist and nationalist parties.\nTusk said the bloc should look back to its founding principles, rather than get distracted by controversial plans to let EU countries integrate at different speeds that the leaders are set to endorse in a special declaration in Rome.\n“Today in Rome we are renewing the unique alliance of free nations that was initiated 60 years ago by our great predecessors,” he said.\n“At that time they did not discuss multiple speeds, they did not devise exits, but despite all the tragic circumstances of the recent history, they placed all their faith in the unity of Europe.”\nHe added: “The union after Rome should be, more than before, a union of the same principles, a union of external sovereignty, a union of political unity,” Tusk said.\nTusk struck a personal note as in his speech, saying that “I was born exactly 60 years ago, so I am the same age as the European Community.”\nHe said the EU stood for values of freedom and democracy that he had seen in the West as a young man growing up in communist-ruled Poland.\n“At that time we all looked to the West, towards a free and unifying Europe, instinctively feeling that this was the very future we were dreaming about. And although tanks and troops were sent against us, those dreams lived on,” he said.\n“I lived behind the Iron Curtain for more than half of my life, where it was forbidden to even dream about those values. Back then, that really was a two-speed Europe,” he said.","url":"https://www.breitbart.com/europe/2017/03/25/prove-leaders-europe-tusk-tells-rome-summit/"}
