{"authors":["Associated Press"],"date_download":"2018-10-22 23:10:21","date_modify":"2018-10-22 23:10:21","date_publish":"2016-01-28 11:51:58","description":"PARIS (AP) — It might well be the season of all records for Paris Saint-Germain. PSG has been relentlessly crushing its rivals since the start of the campaig...","filename":"data/vaneerConsumption/PSGchasingnewrecordatSaintEtienneinFrenchleague.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420788_PSG-chasing-new-record-Saint-Etienne-French-league_1540249821.html","title":"PSG chasing new record at Saint-Etienne in French league","title_page":"PSG chasing new record at Saint-Etienne in French league | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PSG chasing new record at Saint-Etienne in French league\nPARIS (AP) — It might well be the season of all records for Paris Saint-Germain.\nPSG has been relentlessly crushing its rivals since the start of the campaign, opening a 21-point lead at the top of the standings in just 22 games in a French league it has been ruling for the past three seasons.\nThe only team to remain unbeaten from Europe's top five leagues, PSG is still on course for a second straight domestic treble. Before that, it will equal the longest unbeaten league run of 32 games set by Nantes 21 years ago if it avoids defeat at Saint-Etienne on Sunday.\n\"I think we made a great start and our opponents weren't so good, which is why there's a big gap in the standings,\" PSG defender David Luiz said. \"We have the confidence now, which is good for us.\"\nPSG, which faces Chelsea in the Champions League's last 16 next month, set a new club record midweek by reaching the League Cup final with a 2-0 win over Toulouse that extended its current winning streak to 12 matches in all competitions.\nThis was not the first milestone in PSG's season. In December PSG equaled the record for the best defense in the group stage of the Champions League, with just one goal conceded, after striker Zlatan Ibrahimovic became PSG's all-time leading scorer with his 110th goal in October. The Sweden international has since added 17 more.\nBehind PSG, the chasing teams are fighting for a runner-up finish. Monaco travels to Angers on Saturday and Nice — trailing three points further back, is at Caen on Sunday.\nHere are some other things to know about this weekend's matches:\n______\nSTAY POSITIVE\nMontpellier, the last club to win the French league before PSG's reign started, is fighting relegation this season amid coaching turmoil.\nAfter Rolland Courbis resigned during the Christmas break, the duo of Pascal Baills and Bruno Martini lasted a month and was replaced this week by Frederic Hantz.\nWith Montpellier in 18th place, the former Bastia coach has just 16 matches to turn around the club's fortunes.\n\"The leaders in the squad need to get moving, we don't have time to sit around and discuss things,\" Hantz said. \"We need to move quickly and with precision.\"\n___\nMARSEILLE'S NEW SETBACK\nArguably the best player in Marseille's unimpressive season, Lassana Diarra will be sidelined for up to 15 days because of a hamstring injury.\nDiarra, a former Chelsea, Arsenal and Real Madrid player, returned to the French league this season.\nHis strong performances earned him a recall with France in October but Diarra will miss his team's next two games against Lille and Montpellier. Eighth-place Marseille is hoping he will have recovered for the game with PSG on Feb. 7.\n___\nBYE BYE STEPHAN\nItaly forward Stephan El Shaarawy was expected to make a big impact at Monaco after joining on loan from AC Milan.\nEl Shaarawy failed to impose himself in France, scoring three goals in 24 matches, and moved to Roma on loan.\nHe has four months to convince Italy coach Antonio Conte he should be selected for the Azzurri at the European championship in June.\n___\nPRINTANT GETS FIRED\nWith a cushion of three points over the clubs in the relegation zone, Bastia coach Ghislain Printant was fired on Thursday in the wake of last weekend's 1-0 loss at Guingamp.\nFrancois Ciccolini has been appointed interim coach until the end of the season and faces a tough first game in charge against Lyon on Saturday.","url":"https://www.dailymail.co.uk/wires/ap/article-3420788/PSG-chasing-new-record-Saint-Etienne-French-league.html"}
