{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 00:38:46","date_modify":"2018-10-23 00:38:46","date_publish":"2017-04-26 10:24:24","description":"Theprit Palee, 25, was performing a traditional dance to try and impress the gathered spectators in Chiang Mai, northern Thailand, yesterday afternoon, when the stunt went wrong.","filename":"data/vaneerConsumption/Psychicaccidentallystabshimselfinheartwithsword.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9ED1FC00000578-0-image-a-2_1493200660854.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446758_Psychic-accidentally-stabs-heart-sword_1540255126.html","title":"'Psychic' accidentally stabs himself in heart with sword","title_page":"'Psychic' accidentally stabs himself in heart with sword | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man claiming to be a psychic died when he accidentally stabbed himself in the heart with a sword in a bungled act to prove his immortality.\nTheprit Palee, 25, had been performing the traditional dance in front of spectators in Chiang Mai, northern Thailand, yesterday afternoon.\nThe folk ritual is said to honour the spirits of ancestors and in previous shows he would impress onlookers by appearing superhuman when the blade broke as it was pressed against his chest.\nBut the well-known clairvoyant's act went horrifically wrong when he plunged the blade through his rib cage after it failed to snap.\nParamedics desperately try to resuscitate Theprit Palee after he stabbed himself in the heart\nTheprit Palee, 25, had been performing the traditional dance - seen in this picture - in front of spectators in Chiang Mai, northern Thailand, yesterday afternoon\nThe psychic was meant to snap the blade on his chest in the act, seen in the pictures, but instead plunged the sword deep into his chest\nCrowds gathered round the man as they attempted to revive him but he was later pronounced dead at hospital.\nResident Noom Udorn said Theprit had provided readings for several years to local people.\nHe said: 'This is a tradition that happens every year. The sword normally breaks but this time it went inside him.\n'The medium has been respected for many years. People love him. He is one of people's favourites.'\nDeputy Police Inspector Chaiwat Phan said they arrived at the San Kamphaeng district of the province at 3pm and found the medium bleeding.\nHe said: 'We were informed that a man armed with a knife had stabbed himself.\n'We are coordinating with the hospital while an autopsy is performed.\n'There were people at the scene helping Mr Palee but he died lated in hospital.\n'He had a stab wound to the chest.'","url":"https://www.dailymail.co.uk/news/article-4446758/Psychic-accidentally-stabs-heart-sword.html"}
