{"authors":["Scott Lilienfeld And Ashley Watts For The Conversation"],"date_download":"2018-10-22 23:45:38","date_modify":"2018-10-22 23:45:38","date_publish":"2016-01-28 12:59:46","description":"Scott Lilienfeld, professor of psychology at Emory University and student Ashley Watts reveal the theory behind 'successful psychopathy'.","filename":"data/vaneerConsumption/Psychopathtraitsarefoundinsuccessfulpeople.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA525500000578-0-image-a-16_1453984127012.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420708_Do-work-psychopath-Experts-reveal-traits-tell-tale-signs-successful-ambitious-people_1540251938.html","title":"Psychopath traits are found in successful people","title_page":"Psychopath traits are found in successful people | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Despite the popular perception, most psychopaths aren't coldblooded or psychotic killers.\nResearch suggests many of them live successfully among the rest of us, using their personality traits to get what they want in life.\nIt has even been claimed that some of the world's most powerful and successful people, including American presidents, exhibit traits of the behavioural disorder.\nHere, writing for The Conversation, Scott Lilienfeld, professor of psychology at Emory University and student Ashley Watts reveal the theory behind 'successful psychopathy'.\nScroll down for video\nDespite the popular perception, most psychopaths aren't coldblooded or psychotic killers (Patrick Bateman played by Christian Bale is pictured). Research suggests many live successfully among us, using personality traits to get what they want. It has even been claimed some of the world's most powerful people exhibit traits\nPsychopathy is not easily defined, but most psychologists view it as a personality disorder characterised by superficial charm with profound dishonesty, callousness, and poor impulse control.\nAccording to some estimates, psychopathy is found in about one per cent of the general population, and for reasons that are poorly understood, most psychopaths are male.\nThat number likely doesn't capture the full number of people with some degree of psychopathy.\nData suggest that psychopathic traits lie on a continuum, so some individuals possess marked psychopathic traits but don't fulfill the criteria for full-blown psychopathy.\nPSYCHOPATHIC TRAITS AT WORK Researchers have recently speculated that people with pronounced psychopathic traits may be found in certain jobs such as politics, business, law enforcement, firefighting, military services and high-risk sports. Most of those with psychopathic traits probably aren't classic 'psychopaths,' but nonetheless exhibit many features of the condition. One in particular is boldness. Boldness encompasses poise and charm, physical risk-taking and emotional resilience. In studies, researchers have found boldness is modestly tied to impulsive heroic behaviours, such as intervening in emergencies. It is also linked to a higher likelihood of assuming leadership and management positions. Several specific facets of such performance, including crisis management, agenda setting and public persuasiveness, were associated with boldness too.\nNot surprisingly, fully psychopathic individuals are more likely than other people to commit crimes.\nContrary to popular belief, only a minority are violent.\nBut because researchers tend to seek out psychopaths where they can locate them in plentiful numbers, much research on the condition has taken place in prisons and jails.\nThat's why until fairly recently the lion's share of theory and research on psychopathy focused on decidedly unsuccessful individuals, such as convicted criminals.\nBut a lot of people on the psychopathic continuum aren't in jail or prison.\nIn fact, some individuals may be able to use psychopathic traits, like boldness, to achieve professional success.\nSuccessful psychopathy is a controversial idea, but it's not a new one.\nIn 1941, American psychiatrist Hervey Cleckley was among the first to highlight this paradoxical condition in his book The Mask of Sanity.\nAccording to Cleckley, the psychopath is a hybrid creature, donning an engaging veil of normalcy that conceals an emotionally impoverished and profoundly disturbed core.\nIn Cleckley's eyes, psychopaths are charming, self-centered, dishonest, guiltless and callous people who lead aimless lives devoid of deep interpersonal attachments.\nBut Cleckley also alluded to the possibility that some psychopathic individuals are successful interpersonally and occupationally, at least in the short term.\nAccording to some estimates, psychopathy is found in about 1% of the general population. Contrary to popular belief, only a minority are violent (like Hannibal Lecter played by Anthony Hopkins in Red Dragon pictured) and because studies seek out psychopaths in prisons, many focus on only convicted criminals\nBut what's the difference between the psychopaths who get arrested and the ones who don't?\nResearch from Adrian Raine, now at the University of Pennsylvania, conducted in the 1990s sheds some light.\n'SUCCESSFUL' PSYCHOPATHY Successful psychopathy is a controversial idea, but it's not a new one. In 1941, American psychiatrist Hervey Cleckley was among the first to highlight this paradoxical condition in his book The Mask of Sanity. According to Cleckley, the psychopath is a hybrid creature, donning an engaging veil of normalcy that conceals an emotionally impoverished and profoundly disturbed core. In Cleckley's eyes, psychopaths are charming, self-centered, dishonest, guiltless and callous people who lead aimless lives devoid of deep interpersonal attachments. But Cleckley also alluded to the possibility that some psychopathic individuals are successful interpersonally and occupationally, at least in the short term. In a 1946 article, he wrote that the typical psychopath will have 'often outstripped 20 rival salesmen over a period of six months, or married the most desirable girl in town, or, in a first venture into politics, got himself elected into the state legislature'.\nRaine and his colleagues recruited men from temporary employment agencies in the Los Angeles area.\nAfter first identifying those who met the criteria for psychopathy, they compared the 13 participants who had been convicted of one or more crimes with the 26 who had not.\nRaine provisionally regarded these 26 men as successful psychopaths.\nEach man gave a videotaped speech about his personal flaws.\nRaine and his colleagues found that the men they considered successful psychopaths displayed significantly greater heart rate increases, suggesting an increase in social anxiety.\nThese men also performed better on a task requiring them to modulate their impulses.\nThe bottom line was having a modicum of social anxiety and impulse control may explain why some psychopathic people manage to stay out of trouble.\nMore recently, researchers have speculated that people with pronounced psychopathic traits may be found disproportionately in certain professional niches, such as politics, business, law enforcement, firefighting, special operations military services and high-risk sports.\nMost of those with psychopathic traits probably aren't classic 'psychopaths,' but nonetheless exhibit many features of the condition.\nPerhaps their social poise, charisma, audacity, adventurousness and emotional resilience lends them a performance edge over the rest of us when it comes to high-stakes settings.\nRecently, some researchers, have speculated that people with pronounced psychopathic traits may be found disproportionately in certain professional niches, such as politics, business, lawyers (stock image) and law enforcement, firefighting, special operations military services and high-risk sports.\nIn a study of the 42 American presidents up to and including George W. Bush (pictured), researchers found that boldness - a psychopathic trait linked with charm and manipulation - was positively, although modestly, associated with better overall presidential performance\nThe lab at Emory University, and that of collaborators at Florida State University, are investigating whether some psychopathic traits, such as boldness, predispose to certain successful behaviours.\nTOP 10 JOBS FOR PSYCHOPATHS 1. CEO 2. Lawyer 3. Media (TV/Radio) 4. Salesperson 5. Surgeon 6. Journalist 7. Police officer 8. Clergyperson 9. Chef 10. Civil Servant Source: Statista\nBoldness encompasses poise and charm, physical risk-taking and emotional resilience, and it is a trait that is well-represented in many widely used psychopathy measures.\nFor instance, in studies on college students and people in the general community, the study found that boldness is modestly tied to impulsive heroic behaviors, such as intervening in emergencies.\nIt's also linked to a higher likelihood of assuming leadership and management positions, and to certain professions, such as law enforcement, firefighting and dangerous sports.\nThere's one job in particular in which boldness may make a difference - president of the United States.\nPsychopaths occasionally tend to exhibit unconvincing emotional responses and will tell false secrets (stock image) to people to gain their complete trust. Although boldness was tied to successful actions, the study generally found other features, such as callousness, were negatively related to professional success\nIn a study of the 42 American presidents up to and including George W. Bush, the researchers asked biographers and other experts to complete a detailed set of personality items – including items assessing boldness – about the president of their expertise.\nThen, they connected these data with independent surveys of presidential performance by prominent historians.\nThey found that boldness was positively, although modestly, associated with better overall presidential performance.\nAnd several specific facets of such performance, such as crisis management, agenda setting and public persuasiveness, were associated with boldness too.\nHOW TO SPOT A PSYCHOPATH: FROM CHARM TO MANIPULATION Psychopaths display different traits depending on their disorder, but common signs include superficial charm, a grandiose notion of self-worth, the need for stimulation and impulsiveness, pathological lying, the ability to manipulate others and a lack of remorse and empathy. Experts claim people usually find psychopaths intriguing, but can’t put their finger on why. This is down to incongruous behaviour because psychopaths tend to do a lot of acting to deceive, or mimic normal reactions, sometimes changing their views and reactions quickly. For example, Mr Wells said upon meeting someone, he tries to become 'the most interesting person they know' and presumably adopts suitable interests and responses to do this. His response also gives away another common trait - a grandiose notion of self-worth - in that he can be the most interesting person in the room. Psychopaths occasionally tend to exhibit unconvincing emotional responses, with slip-ups including tone of voice or body language. This may be because they are unable to understand emotions such as fear and love, but can mimic them. Generally psychopaths' 'emotions' are shallow and short-lived and there is a manipulative ulterior motive to showing them. For example, Mr Wells said he offers to do favours and tells false secrets to people to gain their complete trust. He also displays insincere charm - another trait associated with psychopaths. He says: ‘I keep secrets, and tell them fake secrets to further gain their trust, and once they trust me enough, I ask for favours, reminding them of the favours I did them. I can get literally anything from them, which is incredibly useful.' Psychopaths typically display an incredible ability to manipulate others and sometimes take pleasure in doing so. Psychopaths often have an air of superiority about them, perhaps shown by Mr Wells' belief he can spot other psychopaths Even expert Dr Hare warns that anyone can be duped during a short interaction with a psychopath.\nThe boldest presidents were not necessarily extreme or pathological on this dimension, but boldness was markedly elevated relative to the average person.\nAlthough boldness was tied to some successful actions, the study generally found that other psychopathic features, such as callousness and poor impulse control, were unrelated or negatively related to professional success.\nBoldness may be associated with certain positive life outcomes, but full-fledged psychopathy generally is not.\nCould psychopathic traits be adaptive? Few investigators have explored the 'Goldilocks' hypothesis. Moreover, we know surprisingly little about how psychopathic traits forecast real-world behaviour over extended stretches of time.\nThe charm of the psychopath is shallow and superficial.","url":"https://www.dailymail.co.uk/sciencetech/article-3420708/Do-work-psychopath-Experts-reveal-traits-tell-tale-signs-successful-ambitious-people.html"}
