{"authors":["Associated Press"],"date_download":"2018-10-22 23:37:03","date_modify":"2018-10-22 23:37:03","date_publish":"2017-03-16 07:34:16","description":"A US Navy PT boat that sank three vessels and saw action in Europe in World War II is back in New Orleans where it was built. It is the only fully restored vessel that saw combat in the conflict.","filename":"data/vaneerConsumption/PTboatthatsawWWIIcombatrestoredinLouisiana.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/23/3E58EFBC00000578-0-image-a-41_1489706986882.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319128_PT-boat-saw-WWII-combat-restored-Louisiana_1540251423.html","title":"PT boat that saw WWII combat restored in Louisiana","title_page":"PT boat that saw WWII combat restored in Louisiana | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A US Navy PT Boat that sank three vessels during World War II is back in New Orleans as the nation's only fully restored combat ship of its type from that era.\nThe National World War II Museum said the 78-foot craft - designated PT-305 - was built in the Big Easy and launched in 1943 and saw action in Europe during the final years of the war.\nNow housed on Lake Pontchartrain, USS Sudden Jerk will begin taking paid tours next month.\nThe National World War II Museum said the 78-foot (24-meter) patrol torpedo boat - PT-305 - is the only fully restored and operational PT boat in the US that took direct part in the conflict\nTom Czekanski, director of collections and exhibits at the National World War II Museum, stands in froth of one of the surviving World War II-era PT boats as it undergoes restoration in New Orleans in this 2013 file photo\n'Normally, exhibit items are behind a piece of glass. This one you can see, feel and hear,' said Josh Schick, one of the project's two historians.\n'I always say you can't smell history in a museum. You can smell it now. You've got the exhaust going, the electrical systems, old-ship smell, a healthy vibration.'\nEven when the three 1,500-horsepower engines are just idling, their spray mists the air and it 'sets a stage better than any ... set of words could really do,' he added.\nThe New Orleans' area Lake Pontchartrain, a nearly oval tidal basin stretching about 40 miles (65 km) across and 24 miles (40 km) from north to south, offers plenty of waterway for the PT-305 to roar.\nCrew members Bob Wade (left) and Dale Casey raise an American flag during a media ride on Thursday\nA photographer (above right) takes a photo of the flag during a media ride. Built in New Orleans where it was tested in 1943 and early 1944, the famed attack vessel is housed on Lake Pontchartrain\nMalcolm Hartman docks the boat after a media ride of the PT 305, which was restored by the National WWII Museum\nDave Finney (far left), Frank Curry (center), and Warren Blackwell (right) are seen chatting after taking members of the press for a boat ride\nAn inert torpedo sings on the deck of the patrol boat. The boat that sank three vessels and saw action in Europe in World War II\nA crew member places a flag on the bow of the boat after the media ride. The PT-305 was built by Higgins Industries in New Orleans in 1943\nEven when the three 1,500-horsepower engines are just idling, their spray mists the air\nMembers of the media sit on a gun turret during a media ride on Thursday. In November 1943, the PT-305 joined other ships that were dispatched to the Mediterranean Sea\nThe New Orleans' area Lake Pontchartrain, a nearly oval tidal basin stretching about 40 miles across and 24 miles from north to south, offers plenty of waterway for the PT-305 to roar\nPainted in camouflage blues with the name USS Sudden Jerk emblazoned on its bow (above), it's set to begin paid tours April 1\nInert ammunition is seen on the boat during the media ride on Thursday. The vessel is to begin offering $15 tours and $350 rides on April 1\nSchick hasn't had a full ride yet, though he was aboard as the painstakingly restored vessel cruised slowly back and forth in a yacht basin recently.\n'It was great just to be there with the engines running, the boat running under her own power,' he said ahead of a planned media tour Thursday.\nHISTORY OF PT-305 1943 - Built by Higgins Industries in New Orleans November 1943 - PT-305 joins other ships that were dispatched to the Mediterranean Sea June 1944 - PT-305 takes active role in helping Free French forces oust Nazi Germany from the Italian island of Elba August 1944 - PT-305 takes part in invasion of southern France, which is code-named Operation Dragoon April 1945 - PT-305 sinks Italian MAS boat November 1945 - With the war over, the PT-305 is decommissioned by the military 1948 - PT-305 is sold and later converted into a civilian vessel used for oyster fishing 2001 - Boat is acquired by the Defenders of America Naval Museum 2007 - PT-305 is then adopted by the National World War II Museum in New Orleans, which undertakes massive restoration\nOne surviving member of the crews who served on the PT-305 and a man who served on a sister boat, the PT-308, are expected to attend the boat's dedication March 25, said museum spokeswoman Michelle Moore.\nThe vessel is to begin offering $15 tours and $350 rides on April 1.\nPaying guests will sit on two-person seats designed to look like ammo cases as standing is forbidden and a FAQ about the vessel notes: 'Hands must be free to hold on to safety handles.'\nThe museum provides headphones to buffer the engines' noise and carry the guide's voice.\nJust standing on the shore, Schick has been able to verify wartime accounts that the boats' three 1,500-horsepower engines could be heard idling from miles away.\n'She's loud. Oh, is she loud,' he said.\nThe 305 isn't the only working PT boat - the PT-658 also made by the Higgins Industries boatyard in New Orleans - was restored by a group of PT boat veterans in Portland, Oregon, and has been running since 2004.\nBut that boat never saw combat as it was completed in 1945, never commissioned and sold as surplus two years later.\nAlthough Higgins made 199 PT boats and the Electric Boat Co. of Bayonne, New Jersey, made 326 of a different design, more Higgins boats survive, Schick said.\nHe noted that Higgins-built boats were heavier by several thousand pounds - much of it reinforcement while Elco versions used more laminated wood than Higgins, and the glue often disintegrated over the years.\n'There's also the luck of the draw,' he said.\nSome squadrons of New Orleans-made boats that had served in Europe were in the US being refitted for Pacific service when the war ended and then sold as surplus.\n'Pretty much all the boats in the Pacific were burned on site,' he said, adding it would have been too expensive to bring them back.","url":"https://www.dailymail.co.uk/news/article-4319128/PT-boat-saw-WWII-combat-restored-Louisiana.html"}
