{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:43:58","date_modify":"2018-10-30 21:43:58","date_publish":"2016-05-23 09:10:46","description":"Irish bar Pub 71 closed yesterday after 10 years in business.","filename":"data/vaneerConsumption/Pub71closesonPeachtreeRoadinBrookhaven.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/23/Images/WPIMAGE_cmgajcfoodandmore_8449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_pu_d2b64f3f4b62913f891b25df50117d52__1540935838.html","title":"Pub 71 closes on Peachtree Road in Brookhaven","title_page":"Pub 71 closes on Peachtree Road in Brookhaven","title_rss":"NULL","source_domain":"ajc.com","text":"Irish bar Pub 71 closed yesterday after 10 years in business.\nThe bar, located at 4058 Peachtree Rd. in Brookhaven, featured more than 20 kinds of beer, Irish dishes including fish and chips and shepherd's pie and offered live music, trivia, and weekend brunch in addition to lunch and dinner.\nOwner Robert Adamo posted an explanation for the closing, as well as a thank you to customers and family on Pub 71's Facebook page:\nWell as many of you know, it is often a tradition of mine to play Andrea Bocelli famous song as we take last call and close up for the evening.\nWell, after close to 10 years of doing what we do at PUB 71 it has come time to say goodbye.\nAfter some serious consideration I have chosen to not renew my lease option and we will be wrapping things up at our current location. There are many factors that play into this decision and please feel free to ask ME about them but the most important one is my desire to be not just a good Dad to my little girl Sofia but to be a great Father.\nThere are tons of great memories, traditions and events we have held at pub over the years and we wanted to have a chance to celebrate them ALL with you our great family, regulars, customers and everyone that we have had the privilege to see walk through our doors.\nWe will be having some specials all week long as we pay tribute to everyone that has supported us over the years...\nI wanna thank every single person of my staff over the years here at PUB that has worked with me over the years. Whether you loved me or not I greatly appreciate your efforts to help me fufill something I always said I would do one day, many years ago.\nFinally, I just wanted to say that one of my favorite experiences over the many years at PUB has been seeing the look on a customers face when they receive that perfect pint of liquid gold, we call Guinness. It is with that Perfest Pint that I toast you ALL and say Cheers and THANKS for the support.\nMuch Love to ALL and peace out from Chez Robert\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instagram .","url":"https://www.ajc.com/blog/atlanta-restaurants/pub-closes-peachtree-road-brookhaven/eJ6yhVoy5d1Uz9RUxIluAK/"}
