{"authors":[],"date_download":"2018-10-30 20:49:38","date_modify":"2018-10-30 20:49:38","date_publish":"2018-08-31 10:00:00","description":"Bill Torpy writes about the intense world of public art, and a dispute that erupted over a mural painted at a skateboard park on the Atlanta Beltline.","filename":"data/vaneerConsumption/PublicartnewbielearnsalessonontheAtlantaBeltline.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/31/Images/newsEngin.22840003_ART-linda.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-the-_bec89b6030707551c6de1801c1e7ce6e__1540932578.html","title":"Public-art newbie learns a lesson on the Atlanta Beltline","title_page":"Public-art newbie learns a lesson on the Atlanta Beltline | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"Artist Linda Mitchell got a hint she was stepping into a very unfamiliar world when an aging skater dude with tons of ‘tude approached her as she worked on the largest canvas in her career.\nMitchell had been commissioned to paint the back of the concrete skateboard ramp at the Historic Fourth Ward Skatepark along the Beltline.\nMitchell, a veteran and accomplished artist, was venturing into a new venue — street art, albeit the sanctioned variety. (As in she got a few hundred bucks from the Beltline folks and some donated paint from Sherwin Williams.)\n“The first day I was there, some guy starts screaming at me, ‘What are you doing?!?’”\nShe told them she was supposed to be there, that the Beltline had OK’d it.\n“@% the Beltline!” he grumbled, stalking away. “@% gentrification!”\nMitchell shrugged and kept at it, painting 23 vertical stripes made up of 10 colors, capped by a 7-foot-tall stencil of Puppers, her trademark puppy, who was holding a balloon. After several days of work, she finished and admired her handiwork and then went home.\nFive days later, she returned to find her creation ravaged by graffiti, like almost totally covered.\nThis was no tagging, she said, “This was a big F.U.! This was, ‘We don’t want you in the skatepark.’\n“It turns out, I was an interloper. I stepped into a hornet’s nest without knowing it. I thought I was just painting a mural, not stepping on anyone’s toes or getting into a culture battle.”\nMitchell’s art covered a faded mural put up perhaps six years ago by a skater/artist named Nev. The fact that it survived that long with minimal tagging or defacing demonstrates an inherent respect in that community, respect that Mitchell obviously hadn’t earned.\nThis is the longtime Atlanta Beltline skatepark mural by a skater/artist named Nev that was painted over by Linda Mitchell, causing a street art dispute. (Courtesy of Linda Mitchell)\nWelcome to the world of street art. It’s a tough world out there for those who toil in the very transient medium of public painting. Masterpiece today. Defaced tomorrow.\nI asked Bentley Roberts, a young, rail-thin skater, to check out Mitchell’s mural. (She and some friends were able to scrub away the defacing this week because of an anti-graffiti seal she had applied.)\nRoberts shrugged. “That looks like something you’d see in a Starbucks,” he said. “Skaters are anti-establishment. If she wants to do this, she has to know what you’re getting into. This is not what skateboarding is all about.\n“People are moving in without knowing how culturally rich this area is,” he continued. “This correlates with what’s going on in the neighborhood.”\nLinda Mitchell’s completed mural at the Atlanta Beltline skatepark is not long for this world. Courtesy of Linda Mitchell\nThe skatepark was built in 2011 on land skaters had used for years. It is now the epicenter of Beltline-induced gentrification, where developers are cranking out $1,800-a-month apartments as fast as you can swing a cookie-cutter.\nThe question of who owns public art is an ongoing issue on the streets of Atlanta.\nSix years ago, in the Pittsburgh neighborhood just south of downtown, residents of the historic black community painted over a 130-foot-long by 17-foot-high mural of an alligator/serpenty thing eating a smaller creature.\nIt was an allegory of the big fish in society gobbling up its smaller fish. But locals saw it as artsy interlopers being Satanic or disrespectful or culturally insensitive.\nRELATED: Beltline apologizes for images of black inmates on trail\nRELATED: Uneasiness along Atlanta’s newest gentrification front\nMitchell, a diminutive woman who is a friend of mine, admits to alternating between rage and petulance after her foray into public art. She reached out to Nev, the artist/skater who now lives in New York and is a big deal in the street art world.\nShe found him to be pleasant, supportive and frank.\n“Nev was like, ‘You gotta get over yourself; this is how this world works. This happens all the time,’ ” she recalled. “I was stepping on the toes of his neighbors.”\nKermit Walker, who does some drumming along the Beltline under the Freedom Parkway bridge, recently watched a street artist put up a mural. (BILL TORPY / AJC)\nMitchell said she worked out a deal with Nev. She would paint over the work that she had recently reclaimed. (There probably is no other choice. The work is marked for repeated retribution.)\nNev will return in the fall and may repaint that wall. He said he would help Mitchell redo her piece elsewhere. She’s working with the Beltline folks — who also seem like newbies in the public art realm — to find another space. She says she’ll do it for nothing. She’s got 10 different colors of leftover paint.\nChilly-o, a graphic artist who has painted murals, says he feels bad for Linda Mitchell, “but there’s a rule — don’t go over pieces that have been riding.” BILL TORPY / AJC\nOff to the side of the skatepark, a man with a Mohawk and a very small bike was getting ready to do a photo shoot. The guy is a graphic artist and sometime street artist who goes as Chilly-o. Mitchell might want to come up with a funky, single-name moniker if she’s going to stay in this world.\n“I feel bad for her but there’s a rule — don’t go over pieces that have been riding,” said Chilly-o, who read the blank look on my face concerning his vernacular. “I mean, longstanding pieces. If you do, the graffiti community is going to retaliate.\n“There’s a culture that has been there. No matter what the Beltline says, there’s going to be checks and balances.”\nLinda Mitchell’s mural at the skatepark along the Atlanta Beltline will be painted over because it is targeted for destruction by fans of the prior mural by a skater/artist named Nev. Courtesy of Linda Mitchell\nChilly-o said he has been there. He was doing a commissioned piece on private property near the Krog Street tunnel when the original artist, or his fans, had a big problem with that.\n“We got into a street beef with a group of artists and it almost got physical,” he said.\nI told Mitchell she might want to take up kung fu if she stays in the genre. I asked Mitchell-o what she got out of her time in the world of public art.\nShe said it’s still all sinking in.\nShe enjoys the guttural immediacy of the give and take.\n“I like the ephemeral in art,” she said. “Things like sandcastles, Play-Doh. I didn’t think it would be THIS ephemeral. But I guess that’s all you get. All you get is a moment.”\nSometimes art does reflect life.","url":"https://www.ajc.com/news/local/torpy-large-the-world-street-art-atlanta-ain-for-the-faint/nMHMuCeOS1S405J1pfYI5O/"}
