{"authors":["Nikki Schwab","U.S. Political Reporter At The White House For Dailymail.Com"],"date_download":"2018-10-23 03:36:57","date_modify":"2018-10-23 03:36:57","date_publish":"2017-03-16 14:33:17","description":"The head of the Corporation for Public Broadcasting blasted President Trump's proposed budget cuts, which will impact PBS, the public television network best known for Big Bird.","filename":"data/vaneerConsumption/PublicbroadcastingheadcallsTrumpbudgetdevastating.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54865400000578-0-image-a-4_1489671848277.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320150_Public-broadcasting-head-calls-Trump-budget-devastating_1540265817.html","title":"Public broadcasting head calls Trump budget devastating","title_page":"Public broadcasting head calls Trump budget devastating | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The head of the Corporation for Public Broadcasting blasted President Trump's proposed budget cuts, which will impact PBS, the public television network best known for Big Bird.\n'The elimination of federal funding to CPB would initially devastate and ultimately destroy public media's role in early childhood education, public safety, connecting citizens to our history, and promoting civil discussions – all for Americans in both rural and urban communities,' said Patricia Harrison, the president and CEO of the CPB in a statement today.\nTrump's budget calls for a big boost in military spending, while CPB, which oversees PBS and NPR, would get slashed. The president also plans to do away with the National Endowment of the Arts and the National Endowment for the Humanities, moves that are already annoying prominent authors and actors.\nScroll down for video\nPresident Donald Trump's (left) proposed budget slashes funding for the Corporation of Public Broadcasting, which oversees PBS, the original home of Sesame Street. Republicans have often threatened to cut Big Bird's (right) funding\n'When you start looking at the places that will reduce spending, one of the questions that we asked was, can we really continue to ask a coal miner in West Virginia or a single mom in Detroit to pay for these programs?' Office of Management and Budget Director Mick Mulvaney said on Morning Joe today.\n'And the answer was no,' he continued. 'We can ask them to pay for defense, and we will. But we can't ask them to continue to pay for the Corporation for Public Broadcasting.'\nIn her statement, Harrison points out that Corporation for Public Broadcasting, which funds public television stations all across the country that offer free content, only costs approximately $1.35 per citizen, per year, while paying 'huge dividends to every American.'\n'From expanding opportunity, beginning with proven children’s educational content to providing essential news and information as well as ensuring public safety and homeland security through emergency alerts, this vital investment strengthens our communities,' she argued.\n'It is especially critical for those living in small towns and in rural and underserved areas,' Harrison added.\nShe also pointed out that there's no 'viable substitute' to the federal funding that the broadcasters would lose.\nShe vowed to work with the new administration and Congress 'in raising awareness that elimination of federal funding to CPB begins the collapse of the public media system itself and the end of this essential national service.'\nThe Corporation for Public Broadcasting also oversees National Public Radio, which main headquarters (pictured) is in Washington, D.C.\nActor John Lithgow (left) and writer Salman Rushdie (right) have already signed onto a petition asking Congress to preserve funding for the National Endowments\nOver at the NEA, chairman Jane Chu said expressed sadness that her agency was on the chopping block.\n'We are disappointed because we see our funding actively making a difference with individuals of all ages in thousands of communities, large, small, urban and rural, and in every Congressional District in the nation,' she wrote.\nGONE COMPLETELY The Trump budget includes a radical plan to get rid of 19 agencies in their entirety. They are: African Development Foundation Appalachian Regional Commission Chemical Safety Board Corporation for National and Community Service Corporation for Public Broadcasting Delta Regional Authority Denali Commission Institute of Museum and Library Services Inter-American Foundation U.S. Trade and Development Agency Legal Services Corporation National Endowment for the Arts National Endowment for the Humanities Neighborhood Reinvestment Corporation Northern Border Regional Commission Overseas Private Investment Corporation U.S. Institute of Peace U.S. Interagency Council on Homelessness Woodrow Wilson International Center for Scholars\nShe noted how the NEA couldn't engage in advocacy, as it's a federal agency, but employees would 'continue our practice of educating about the NEA's vital role in serving our nation's communities.'\nNational Endowment for the Humanities Chairman William D. Adams sang a similar tune in his statement, saying, 'We are greatly saddened to learn of this proposal for elimination, as NEH has made significant contributions to the public good over its 50-year history.'\nDemocratic lawmakers are already grumbling about the president's plans.\n''Even President’s Trump’s idol Andrew Jackson advocated for preserving literature and the arts in his 1832 Proclamation to the People of South Carolina,' noted Rep. Steve Cohen, D-Tenn.\nYesterday, the president visited Jackson's estate outside Nashville, to honor the late American leader.\nWhile the NEA and NEH can't publicly protest the deep cuts, activists are already getting into gear.\nPEN America, a group made up of literary figures, already launched a petition, which has been signed by actor John Lithgow, singer Roseanne Cash and writers including Salman Rushdie, Susan Orlean, Dave Eggers and Judy Blume.\nRobin Bronk, the head of the Creative Coalition, a group that often brings Hollywood celebrities to Capitol Hill to advocate for the arts said the budget cuts 'won't hurt Hollywood, it won't hurt Broadway, but it will hurt small town theaters, and museums, and countless community organizations across the country.'\nBronk touted the relationship in schools between arts and students' achievement in STEM subjects as well.\n'At-risk youth with significant arts experiences are known to stay in school, get better grades and be more civically active and engaged by voting and volunteering,' she added.\nAnd noted that the arts 'contribute to making America great,' using one of the president's favorite adjectives. Speaking to DailyMail.com Bronk noted how some NEA dollars went toward popular programs for both active duty military families and veterans, groups Trump's people says his new budget is meant to serve.\nHer group will again head to Washington at the end of April and invade Capitol Hill as part of its annual lobbying day.\nRepublicans have long looked at public media and the arts as areas that could be cut, with 2012 GOP nominee Mitt Romney memorably telling debate moderator Jim Lehrer, who worked for PBS, that he'd like to cut the budget for the public television network and do away with any funding for Sesame Street too.\n'I'm sorry, Jim. I'm going to stop the subsidy to PBS. I'm going to stop other things. I like PBS. I love Big Bird. I actually like you, too. But I'm not going to keep on spending money on things to borrow money from China to pay for it,' Romney memorably said.\nSesame Street, the television show, may not actually be in danger as tax dollars, in the form of a PBS grant, make up just a small percentage of its budget.\nIn 2015, Sesame Workshop also inked a five year deal with HBO, which now runs the program before the PBS stations, and provides Big Bird and friends with another revenue stream.","url":"https://www.dailymail.co.uk/news/article-4320150/Public-broadcasting-head-calls-Trump-budget-devastating.html"}
