{"authors":["Tammy Hughes For The Daily Mail"],"date_download":"2018-10-22 21:47:52","date_modify":"2018-10-22 21:47:52","date_publish":"2016-01-11 01:38:06","description":"In April, the Treasury will introduce measures to force workers earning £150,000 or more to pay more tax on their pension contributions, and unions are demanding pay rises for civil servants.","filename":"data/vaneerConsumption/PublicSectorunionswantincreasesoftensofthousandsofpounds.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/11F3C21E000005DC-0-image-a-11_1452476170150.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393234_Public-sector-bosses-demand-huge-pay-rises-Unions-want-increases-tens-thousands-pounds-compensate-new-taxes-pensions_1540244872.html","title":"Public Sector unions want increases of tens of thousands of pounds","title_page":"Public Sector unions want increases of tens of thousands of pounds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Public sector workers on six-figure salaries are demanding pay rises worth tens of thousands of pounds to compensate for new taxes on pensions, it was claimed last night.\nDavid Gauke, financial secretary to the Treasury, has held private talks with unions representing doctors, headteachers, civil servants and police officers.\nThose most likely to be seeking more money are expected to already have pension pots of more than £1million, according to the Daily Telegraph.\nDavid Gauke (pictured), financial secretary to the Treasury, has held private talks with unions representing doctors, headteachers, civil servants and police officers wanting loopholes or pay rises to compensate to changes to the amount of tax payable on pensions to workers earning £150,000 or more\nIn April, the Treasury will introduce measures to force workers earning £150,000 or more to pay more tax on their pension contributions by reducing the annual limit for tax relief from £40,000 to £10,000 on a sliding scale.\nAs a result, highly-paid public sector workers are looking for loopholes to be written into their contracts to escape paying the tax.\nThe same method is used at universities and academy schools, where some staff accept benefits such as chauffeured cars or free accommodation in lieu of the less tax friendly pension perks. Civil servants have also been known to enjoy similar benefits written into their contracts.\nThe Daily Telegraph estimates that a civil servant earning £210,000 could swap their employer pension contributions for a pay rise of £45,210.\nAn NHS worker earning £150,000 could enjoy an extra £18,848 a year in lieu of a pension.\nAlex Wild, research director at the TaxPayers’ Alliance, said: ‘The gall displayed by unions demanding special treatment for the upper echelons of the public sector elite is breathtaking.\n‘The tax system already allows top earners in the public sector to enjoy retirement incomes twice as high as those saving into money purchase schemes without triggering punitive tax charges.\nHighly-paid public sector workers are looking for loopholes to be written into their contracts to escape paying the pensions tax. The same method is used at universities and academy schools, where some staff accept benefits such as chauffeured cars or free accommodation\n‘The last thing we need are complicated exemptions so those fortunate enough to be members of these gold-plated schemes can enjoy even more preferential treatment.’\nBut trade bodies have argued that the loopholes are necessary because the impending lower savings limits are already stopping people applying for senior roles such as headteacher and chief police inspector.\nValentine Mullholland, policy adviser for the National Association of Head Teachers, said: ‘We are asking the Government to review this because it will really discourage people from investing in pensions.’\nA Treasury spokesman said: ‘The tapered annual allowance only impacts 2 per cent of those saving for a pension, a very small number of whom are in the public sector.","url":"https://www.dailymail.co.uk/news/article-3393234/Public-sector-bosses-demand-huge-pay-rises-Unions-want-increases-tens-thousands-pounds-compensate-new-taxes-pensions.html"}
