{"authors":[],"date_download":"2018-10-30 01:26:33","date_modify":"2018-10-30 01:26:33","date_publish":"2015-08-13 08:00:00","description":null,"filename":"data/vaneerConsumption/PublicEducationIsLearningtheHardWay.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/08/Screen20Shot202015-08-1220at204.20.2420PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862793.html","title":"Public Education Is Learning the Hard Way","title_page":"Public Education Is Learning the Hard WayThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"My career was in newspapers.\nAnd so I saw our industry grow complacent on astronomical profit margins, making us easy prey for the digital innovators that took our advertisers and readers, and along with them our revenues.\nThe free market can be as ruthless as the African Serengeti in culling out the old and the weak. Just ask Blockbuster, Borders, Circuit City, the U.S. Postal Service or, most recently, anyone involved in TV cable.\nIt can be a painful dynamic, but one that has driven American success since Cornwallis surrendered at Yorktown.\nNow imagine if public education were exposed to such forces rather than protected from them. Certainly the growing sums of money we have invested in our classrooms over the past several decades would have bought more than the meager results we see today. But somehow the narrative of spend more to get more remains stubbornly ingrained in the national conscience despite all graphs to the contrary.\nThe commitment to education in state legislatures still is measured by annual increases in funding. And if more money doesn’t move the needle, then obviously it wasn’t enough money.\nWhat does that buy you? Between 1950 and 2009, in public K-12 education, there was a 92 percent increase in the number of students and a 700 percent increase in the number or administrators and non-teaching staff.\nPublic education has taken on the characteristics of a government jobs program.\nTeachers receive the same across-the-board raises regardless of performance. An effective teacher who brings out the best in her students will be laid off in favor of the worst teacher in the school if the latter has a day of seniority. It is a system that penalizes excellence and encourages failure to hang on.\nPay scales are based on factors that research shows have no bearing on a teacher’s ability to teach, including graduate degrees and longevity.\nStudents of varying abilities are required to sit in a classroom for a set amount of time to learn the same amount of material in the same way. A student who could master Algebra I in five months sits next to a student who requires twice that amount of time. The former is bored and the latter is left behind.\nImagine adding up the wasted time in our nation’s classrooms and attaching a dollar figure to it. But the system is designed to accommodate adult schedules and adult compensation formulas, not the individual learning needs of children.\nInstead of reevaluating how money is spent, more money is demanded. We are told you can’t run public education like a business but in fact business principles very much apply. You can measure dollars spent versus results achieved. You can evaluate the effectiveness of employees. You can target resources where they will do the most good.\nLastly you can open up the market to competitors and see what innovations they bring to the table.\nInstead, most efforts are focused on limiting competition and stifling innovation, even when new models produce tremendous results. The Success Academy Charter Schools in New York operate in some of the city’s poorest neighborhoods. Yet their test stores were far above the state average and, in fact, comparable to the state’s most elite schools. The response by New York Mayor Bill de Blasio was to try and block their expansion, an effort fortunately blocked by the parents of children who excel in those schools.\nBetter to fail with the old than succeed with the new.\nChildren cannot overcome generational poverty if they are not equipped with the knowledge to do so. And America cannot lead in the 21st century global economy if we leave vast swaths of our human capital on the sidelines.\nMore and more money is not working, nor is it sustainable. A report by education researcher Matthew Ladner, Turn and Face the Strain, points out the realities of the demographic pincer movement confronting us — an onslaught of retiring baby boomers coinciding with a growing number of school-age children.\nThe elderly will be competing with the young in a battle for government resources, with a shrinking number of working-age adults left to pay for both.\nCreating more efficient, cost-effective models in public education is as necessary as it is in entitlement programs. Digital technology offers the promise of providing high-quality content as well as access to any subject to any child in any zip code. The starting price is free.\nMixing the human touch of great teachers or home school parents with high quality digital content offers potential we have seen glimpses of but have yet to fully realize because education technology still is in the DOS phase. In the Information Age, classroom walls often become barriers that shut knowledge out.\nUniversal school choice backed by measured and transparent results, combined with incentives for efficiency, is the road public education must and ultimately will travel. Our children and taxpayers can afford nothing less.","url":"https://spectator.org/63762_public-education-learning-hard-way/"}
