{"authors":["Associated Press"],"date_download":"2018-10-23 01:02:08","date_modify":"2018-10-23 01:02:08","date_publish":"2016-01-28 15:09:32","description":"SAN JUAN, Puerto Rico (AP) — Puerto Rico's power company said Thursday that it reached a new deal with bondholders as it seeks to restructure roughly $9 bill...","filename":"data/vaneerConsumption/PuertoRicopowercompanyreachesnewdealwithcreditors.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421044_Puerto-Rico-power-company-reaches-new-deal-creditors_1540256528.html","title":"Puerto Rico power company reaches new deal with creditors","title_page":"Puerto Rico power company reaches new deal with creditors | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Puerto Rico power company reaches new deal with creditors\nSAN JUAN, Puerto Rico (AP) — Puerto Rico's power company said Thursday that it reached a new deal with bondholders as it seeks to restructure roughly $9 billion in debt.\nThe agreement calls for legislators to approve a measure by Feb. 16 needed to launch the restructuring of the largest U.S. public power utility.\nThe Puerto Rico Electric Power Authority bondholder group said it and other creditors would provide $111 million through the purchase of new bonds. It said half the notes would be issued once the bill is passed and the other half once the securitization structure is submitted to an energy commission.\nThe power company said the deal requires bondholders and monoline insurers to buy 50 percent of the bonds once the bill is approved.\nThe announcement comes just days after the original deal collapsed when legislators missed a Friday deadline to approve the bill. The agreement still involves only those holding 70 percent of the power company's debt.\n\"We have a long way to go, and there remain many uncertainties, but if implemented PREPA's transformation will have a positive, lasting impact on its finances, operations and culture,\" said Chief Restructuring Officer Lisa Donahue.\nOfficials have warned that without debt restructuring, the company will run out of cash by summer, possibly leading to power cuts.","url":"https://www.dailymail.co.uk/wires/ap/article-3421044/Puerto-Rico-power-company-reaches-new-deal-creditors.html"}
