{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:19:27","date_modify":"2018-10-30 18:19:27","date_publish":"2016-04-07 16:30:59","description":"A recent column in the Washington Post called Breitbart Tech editor Milo Yiannopoulos “a jackass.”","filename":"data/vaneerConsumption/PulitzerPrizeWinningJournalistCallsMiloYiannopoulosJackass.json","image_url":"https://media.breitbart.com/media/2016/04/milo-light.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_04_07__1540923567.html","title":"Pulitzer Prize-Winning Journalist Calls Milo Yiannopoulos 'Jackass'","title_page":"Pulitzer Prize-Winning Journalist Calls Milo Yiannopoulos 'Jackass' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A recent column in the Washington Post called Breitbart Tech editor Milo Yiannopoulos “a jackass” over his criticisms of third-wave feminists, the wage-gap myth, and the Black Lives Matter movement.\nThe column, which was penned by Pulitzer Prize-winning journalist Gene Weingarten, discusses the current wave of oversensitivity amongst college-aged progressives. In the piece, Weingarten mentions Yiannopoulos’ recent stop at the University of Pittsburgh, where students were reported to be “in tears” and feeling “unsafe” after the event.\nAlthough he was critical of the current safe space culture on American campuses, Weingarten was also critical of Yiannopoulos, calling him a “rude reactionary free speech activist” and “a jackass.”\n“I just now read a story about recent events at the University of Pittsburgh, where a Republican club invited an address by a rude reactionary free-speech activist named Milo Yiannopoulos,” Weingarten wrote. “He believes, among other things, that all feminists hate men, that women are not financially discriminated against in the workplace, and that the Black Lives Matter movement is a racial ‘supremacy’ group. Milo is a provocateur and, in my mind, a jackass.”\nWeingarten returned focus to the students’ reaction to Yiannopoulos’ lecture at the University of Pittsburgh: “But after the jackass spoke and said those things, the campus went nuts,” he wrote. “The Pitt newspaper quoted a student government leader saying that his peers felt ‘in danger’ and criticizing the school for not having provided counselors and a safe room to protect students who felt ‘traumatized’ or ‘invalidated’ by Milo’s opinions. Being told of these hurt feelings at a public meeting, the president of the student government got all weepy.”\nWeingarten failed to mention the case of conservative student Doug Steeber, who was harassed by his peers at the University of Pittsburgh for his involvement in the organization of Yiannopoulos’ visit.\nTom Ciccotta writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or on Facebook. You can email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/04/07/hold-pulitzer-prize-winning-columnist-calls-milo-yiannopoulos-jackass/"}
