{"authors":["Shea Simmons"],"date_download":"2018-10-31 01:44:15","date_modify":"2018-10-31 01:44:15","date_publish":"2018-09-06 18:29:31","description":"Welcome to September where the color orange becomes everyone's favorite, and even a glance at red leaf causes pandemonium. Now, there's a new addition to the autumnal feelings of the month, and it's pumpkin spice latte deodorant. Yes, really. You…","filename":"data/vaneerConsumption/PumpkinSpiceLatteDeodorantIsAThingIfYouWantToSweatPSL.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/3536da0c-7ba6-4793-973f-23b354bf1274-screen-shot-2018-09-06-at-124938-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_pumpkin-spice-latte-deodorant-is-a-thing-if-you-want-to-sweat-psl-11776590_1540950255.html","title":"Pumpkin Spice Latte Deodorant Is A Thing If You Want To Sweat PSL","title_page":"Pumpkin Spice Latte Deodorant Is A Thing If You Want To Sweat PSL","title_rss":"NULL","source_domain":"bustle.com","text":"Welcome to September where the color orange becomes everyone's favorite, and even a glance at red leaf causes pandemonium. Now, there's a new addition to the autumnal feelings of the month, and it's pumpkin spice latte deodorant. Yes, really. You can know sweat PSL, and honestly, while it may sound weird at first, is it really such a bad thing?\nDeodorant brand Native has created a pumpkin spice scented deodorant for the second time, and it's available right now. The thing about Native isn't just that they've crafted a deodorant that smells like your favorite fall drink. They're also a non-toxic brand that creates deodorant free from aluminum and parabens, and it's made right in the United States. There's more than one reason to shop Native, but the fact that it's non-toxic and smells like pumpkin spice may just be the best one.\nCurrently, the pumpkin spice latte scented deodorant is up for grabs for on the Native website and retails for only $12. Honestly, that's kind of steal given just how good for you this deodorant actually is. You want find any of the harmful chemicals in most traditional formulas found in your local drugstore aisle. This stuff is next level.\nAs for what's inside this PSL scented deodorant, it's filled with good-for-you ingredients that will do everything you need for your under arms. The brand uses ingredients like shea butter, coconut oil, and jojoba oil for formulate their product, so if a deodorant cant actually be good for your skin, this could actually be it, and as a bonus, it totally smells like fall.\nSure, sweating out your pumpkin spice latte may sound strange, but think about how great that smell is every time you open the lid on your Starbucks cup. It's a little spicy, a bit like pumpkin, and maybe a bit of a citrus scent. Who wouldn't want to smell like pumpkin spice?\nCourtesy of Native\nOf course, if pumpkin spice isn't your thing, but Native's deodorant sounds like the perfect replacement for your current one, don't worry. They've got tons of different scents. From coconut and vanilla to cucumber and mint, there's more than enough to go around. In fact, if you'd prefer an unscented version, you can have that as well.\nThe idea that a pumpkin spice scented deodorant exists shouldn't come as too much of a surprise, though. In fact, pumpkin beauty products are kind of big deal. Brand Summer Fridays just launched their new Overtime Mask which features pumpkin to help exfoliate and hydrate your skin all at the same time. Summer Fridays isn't alone, either. Last year, brand Too Cool for School launched an entire pumpkin just in time for fall. Clearly, people can't get enough pumpkin, and Native is going them.\nIf you want your fall to be extra filled with the smell of pumpkin spice latte, Native's deodorant is here to help you out. Grab your actual PSL, your giant scarves, and your boots, and get ready for fall.","url":"https://www.bustle.com/p/pumpkin-spice-latte-deodorant-is-a-thing-if-you-want-to-sweat-psl-11776590"}
