{"authors":["Lucia Peters"],"date_download":"2018-10-31 01:40:55","date_modify":"2018-10-31 01:40:55","date_publish":"2018-08-28 14:17:10","description":"I know it seems like pumpkin spice season started ridiculously early this year, but you know what? I have no regrets about it — especially not now that I know you can get Pumpkin Spice Mickey Beignets at Disneyland during the 2018 Halloween season.…","filename":"data/vaneerConsumption/PumpkinSpiceMickeyBeignetsAtDisneylandAreComingForHalloween.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/2bbf196c-5245-49af-9632-eb04461d805b-halloween-time_disneyland_mint-julep-bar_pumpkin-spice-beignets_080618_03595dn.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_pumpkin-spice-mickey-beignets-at-disneyland-are-coming-for-halloween-10353950_1540950055.html","title":"Pumpkin Spice Mickey Beignets At Disneyland Are Coming For Halloween","title_page":"Pumpkin Spice Mickey Beignets At Disneyland Are Coming For Halloween","title_rss":"NULL","source_domain":"bustle.com","text":"I know it seems like pumpkin spice season started ridiculously early this year, but you know what? I have no regrets about it — especially not now that I know you can get Pumpkin Spice Mickey Beignets at Disneyland during the 2018 Halloween season. Available at the Mint Julep Bar in the New Orleans Square section of Anaheim, Calif.’s Disneyland Park, these beignets are everything I have ever wanted from an autumnal treat: They’re soft, they’re lightly spiced, and most importantly, they are literally shaped like Mickey’s head. That’s… actually a little weird when you think about it (is the implication that we’re eating Mickey’s severed head?); then again, though, the pastry is a Halloween exclusive, so, uh… maybe it’s just seasonally appropriate.\nOr something. Anyway, moving on.\nPro tip: New Orleans Square — the tiny area between Adventureland and Critter Country that plays host to Pirates of the Caribbean and the Haunted Mansion — has some of the best food in Disneyland Park. As you might expect, it’s all Cajun- and Creole-inspired — and there's a wide variety of places to get it: If you’re feeling fancy, you can have a full, sit-down meal with table service at the Blue Bayou (with the added bonus of being able to watch boats full of people float by on the Pirates of the Caribbean track while you eat); if you’re into a more casual (and less expensive) sit-down experience, check out Café Orleans right across the way; if you’d rather have a grab-and-go meal, the Royal Street Veranda offers a handful of lunch, dinner, and snack options from a take-out window; and if variety is the name of your game, there’s the cafeteria-style French Market Restaurant.\nThe Mint Julep Bar is actually at the back of the French Market Restaurant; often cited as one of Disneyland Park’s hidden gems, it lies tucked away from the hustle and bustle of New Orleans Square by that area’s stop on the Disneyland Railroad. It specializes in Mickey-shaped beignets, offering both traditional and strawberry-flavored pastries in packs of three or six; you can also grab a variety of drinks with which to wash down your beignets, including tea, coffee, hot chocolate, fountain beverages, and — of course — non-alcoholic mint juleps, which the menu describes as “refreshing Mint Drinks with a hint of lime.”\nPeriodically, the Mint Julep Bar plays host to special edition beignets, like the colorful Mardi Gras Beignets that arrived on the menu in January of 2018 and the adventurous Watermelon Chili Lime Beignets that popped up a few months later. As such, it’s not surprising that a fall-themed beignet would make an appearance for the Halloween season — or that this beignet would leap onto the pumpkin spice train.\nLike the beignets normally served at the Mint Julep Bar, this year’s Pumpkin Spice Mickey Beignets are fashioned after the famous mouse’s iconic silhouette and arrive dusted with powdered sugar; they are, however, slightly more orange in hue than your standard Mickey beignet (although to be fair, what other color would a pumpkin-flavored treat be?). I haven’t yet been able to dig up any reviews of the 2018 edition of the treat, but reviews of previous years’ versions describe them as “light fluffy and a hint of warm cinnamon and nutmeg” and quite “flavorful in the ‘pumpkin’ department.” Heck, and yes.\nSpeaking of, this isn’t the first time pumpkin-flavored beignets have hit the menu at Disneyland; I’ve been able to find evidence of their existence at the Mint Julep Bar dating back to 2012, with an even earlier incarnation popping up at the exclusive Club 33, which is also located in New Orleans Square, in 2011. It’s only within the past couple of years that they’ve begun specifically going by the pumpkin spice moniker, though (previously, they were just billed as Pumpkin Beignets) — and indeed, last year’s seasonal beignet at the Mint Julep Bar wasn’t pumpkin-themed at all: Instead, it was “Dreamsicle”-flavored.\nI don’t know about you, though, but “Dreamsicle” just doesn’t quite scream “HALLOWEEN!” in the same way that pumpkin spice does — so I, for one, am glad to see the pumpkin-flavored variety of pastry back on the menu this year. The seasonal beignets at the Mint Julep Bar typically cost the same amount as the regular ones, so you can expect to shell out about $5 for an order of three beignets and $8 for an order of six, per the Mint Julep Bar’s online menu. Grab ‘em while you can — they won’t be around for long. Happy haunting!","url":"https://www.bustle.com/p/pumpkin-spice-mickey-beignets-at-disneyland-are-coming-for-halloween-10353950"}
