{"authors":[],"date_download":"2018-10-22 21:47:14","date_modify":"2018-10-22 21:47:14","date_publish":"2014-05-07 19:54:46","description":"A first-ever clinical trial of the impact of therapy dogs on kids with cancer could expand the practice nationwide, backers say.","filename":"data/vaneerConsumption/PuppyLoveStudyTestsPowerofDogsAgainstCancer.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/421751/140505-childrens-hospital-vanderbilt-jhc-1712_2bb941bfc0420f0eeb9cca07367e2239.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_cancer_puppy-love-study-tests-power-dogs-against-cancer-n99651_1540244834.html","title":"Puppy Love: Study Tests Power of Dogs Against Cancer","title_page":"Puppy Love: Study Tests Power of Dogs Against Cancer","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTo almost anyone who’s cared for a child with cancer, it seems obvious: Sometimes the best medicine isn’t a drug, it’s a dog — four paws and a furry tail — that can make a kid feel better.\nDoctors say they’ve known about the value of therapy pets in hospitals for years. Parents swear by them for soothing a scared or angry child. But such reports have been largely anecdotal — until now.\nBacked by a nearly $1 million grant from veterinary health firm Zoetis, with matching funds from the Pfizer Foundation, the American Humane Association is launching what advocates say is the first clinical trial of the effects of what’s known as animal-assisted therapy, or AAT, on young cancer patients and their families.\n“It’s really this crucial exploration of the child-animal bond and how that is a crucial path to healing,” said Robin Ganzert, president and chief executive of AHA, who is scheduled to brief Congress on the “Canines and Childhood Cancer Study” Thursday morning.\nThe goal is to gather the first-ever clinical details about the physical and psychological effects of animal therapy on the child patients, their families and caregivers, said Amy McCullough, AHA’s national director of humane research and therapy.\nThey'll also study the effects of treatment on the dogs through a grant from the Human Animal Bond Research Initative Foundaton.\n“Obviously, we know that the children like to see the dogs, but the folks in risk management want some clinical data.”\nIf the results show clear benefit, as expected, they could pave the way for far wider use of some 50,000 registered therapy dogs in children’s hospitals nationwide.\n“It all comes down to access,” said McCullough. “Obviously, we know that the children like to see the dogs, but the folks in risk management want some clinical data.”\nBuilding on a small pilot study of six kids and six pets conducted last year, researchers have designed a randomized, controlled trial that will follow 100 children who are newly diagnosed with cancer, including 50 who receive targeted visits from therapy dogs, and 50 who will receive standard treatment.\nFive children’s hospitals have agreed to participate in the year-long study of kids ages 3 to 12 who get regular chemotherapy in outpatient clinics. The study will track blood pressure, heart rate and psychological responses in the kids, their families and the caregivers, McCullough said. It will also test the effect on the dogs, measuring the level of the stress hormone cortisol in the animals’ saliva before and after visits.","url":"https://www.nbcnews.com/health/cancer/puppy-love-study-tests-power-dogs-against-cancer-n99651"}
