{"authors":["Associated Press"],"date_download":"2018-10-23 05:38:06","date_modify":"2018-10-23 05:38:06","date_publish":"2017-03-10 15:19:12","description":"BRUSSELS (AP) - In the days after rogue soldiers tried to take over Turkey last year, the fax machine in the Turkish delegation's offices at NATO...","filename":"data/vaneerConsumption/PurgedTurkishofficerstellKafkaesquetalesofexile.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196655-1489159160-566_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301668_Purged-Turkish-officers-tell-Kafkaesque-tales-exile_1540273086.html","title":"Purged Turkish officers tell Kafkaesque tales of exile","title_page":"Purged Turkish officers tell Kafkaesque tales of exile | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BRUSSELS (AP) - In the days after rogue soldiers tried to take over Turkey last year, the fax machine in the Turkish delegation's offices at NATO headquarters started spitting out lists of names.\nThe lists from armed forces headquarters in Ankara often arrived on Friday evenings as personnel were packing up for the weekend, which seemed odd. Each carried 20 or 30 names at first.\nBut the one that came through more than two months after the July coup attempt stunned even seasoned Turkish officers in Belgium.\nFILE - In this Saturday, July 16, 2016 file photo, Turkish soldiers secure Istanbul's Taksim square, as supporters of Turkey's President Recep Tayyip Erdogan protest in Istanbul. In the wake of last year's coup in Turkey, scores of military officers are seeking asylum in Belgium and elsewhere in Europe. Three who spoke to AP tell Kafkaesque tales of a life in hiding, charged with crimes against the state. (AP Photo/Emrah Gurel, File)\nIt gave 221 colonels, majors and other mid-ranking officers at NATO facilities around the world three days to get back to Turkey.\n\"Normally you would be told where you are going on your next assignment, get an allowance to move your family, have some time for your children to leave school,\" one major who appeared on the Sept. 27 list told The Associated Press. \"It didn't make any sense.\"\nNow considered coup suspects, dozens of Turkish officers assigned to NATO are refusing orders from the country they spent their adult lives serving and no longer trust. Instead, they are seeking asylum abroad or have gone into hiding, fearing arrest and imprisonment as terrorists if they return.\nMore than 150,000 people have been taken into custody, fired or forced to retire from Turkey's armed forces, judiciary, education system and other institutions since the thwarted July 15 coup. Few first-person accounts have emerged, in part because the crackdown has hit news outlets in Turkey.\nThree officers, each with more than 20 years' experience in the armed forces and at least a year at NATO, shared their experiences - as well as lists, documents and photographs - with AP. Assigned to posts in Belgium while the failed power grab played out, they believe they have water-tight alibis.\nWhen the big list came in, men gathered to ponder the order's meaning. They compared notes in offices, at the cafeteria, and later in the homes of some 150 Turkish officers whose careers were about to end.\n\"Was it legal? How would it affect our lives? What was next?\" the major said. He spoke on condition of confidentiality during a cautiously arranged interview, expressing fear for his safety and the welfare of his family.\nThree days later, another fax arrived. It contained 19 more names and a new order: Return immediately. No explanation. No instructions about the city or military base to report to.\n\"It gave us only a few hours to return,\" the major recalled. \"We couldn't work out what was going on, what it meant. But from that letter, we could understand that we had already been purged.\"\nThe army was long the guarantor of secularism in predominantly Muslim Turkey. Past coups removed leaders considered too Islamist, but the military's influence has waned.\nThe excised officers assigned to NATO are well-educated men, including West Point graduates.\n\"I have a brilliant military career,\" one colonel said, producing a recommendation letter from a non-Turkish superior officer at NATO. \"We are good people, we are good officers. We are not terrorists. We are trying to understand why we were targeted.\"\nA decree handed down on Nov. 22 accuses many officers of links to terrorist groups that Turkey's National Security Council claims carried out \"activities against the national security of the state.\"\nDespite wanting to prove their innocence, they are scared to return.\nAmnesty International has documented cases of prisoners being severely mistreated, beaten or even subjected to sexual assault. Food, water, legal counsel and medical treatment are routinely denied.\n\"Some of the worst reported physical abuse was linked to military personnel,\" Amnesty researcher Andrew Gardner said. \"It's fair to assume that they were among the people targeted for the most extreme abuse.\"\nThe colonel and his family, along with about 100 other Turkish personnel, have applied for asylum in Belgium. Scores more are doing so in Germany, the Netherlands and Norway.\nTurkey alleges the coup attempt was directed from the United States by Fethullah Gulen, an Islamic cleric and former ally of President Recep Tayyip Erdogan. Erdogan says Gulen followers have infiltrated the army and much of Turkish society.\nThe officers in Belgium insist they are not supporters; they agree that Gulenists have permeated Turkish life, but argue that the purge has been arbitrary.\nEuropean intelligence officials believe the coup suspect lists were prepared in advance, according to a report by the EU Intelligence Analysis Center.\n\"Erdogan exploited the failed coup and the state of emergency to launch an extensive repressive campaign,\" the Times of London quoted the Intcen report as saying.\nThe officers remain in legal limbo. They are refused consular assistance and have seen and heard no evidence against them.\nA Turkish embassy official in Brussels declined to comment, saying only: \"We don't deal with that kind of thing.\"\nThe accused men speak highly of NATO and have been moved by private gestures of support. But NATO's official position is that their legal status is a matter for the Turkish government.\nOnly NATO's top general, Curtis Scaparrotti, has spoken of \"a degradation on my staff\" due to the loss of about 150 \"talented, capable people.\"\nDeprived of their work routines and incomes - and in some cases afraid for families still in Turkey - these officers hang on as exiles, fearful that Turkey's military attaché or the country's MIT intelligence agency might be tracking them.\nThe strain shows.\n\"My wife's family are having a hard time understanding why we are not going back. The whole society is divided,\" said a second colonel, who has chosen not to apply for asylum.\n\"We are waiting for a change to happen in Turkey because this just isn't sustainable,\" he said.\nMeanwhile, the state of emergency goes on. New lists have trickled off the fax at Turkey's NATO delegation recently, and more officers have joined the ranks seeking international protection.","url":"https://www.dailymail.co.uk/wires/ap/article-4301668/Purged-Turkish-officers-tell-Kafkaesque-tales-exile.html"}
