{"authors":["Brakkton Booker"],"date_download":"2018-10-23 00:51:47","date_modify":"2018-10-23 00:51:47","date_publish":"2015-09-15 00:00:00","description":"Later this month, Taco Bell will open two \"Cantinas\" in San Francisco and Chicago that will serve booze and shareable tapas.","filename":"data/vaneerConsumption/PushingToAttractMillennialsTacoBellWillOfferBeerAndWine.json","image_url":"https://media.npr.org/assets/img/2015/09/15/taco-bell-ap_wide-ac8e85d78728175a3052fc30bfea5abe6b063782.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_09_15_440648138_in-a-push-to-attract-millennials-taco-bell-offers-beer-and-wine_1540255907.html","title":"Pushing To Attract Millennials, Taco Bell Will Offer Beer And Wine","title_page":"Pushing To Attract Millennials, Taco Bell Will Offer Beer And Wine : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Pushing To Attract Millennials, Taco Bell Will Offer Beer And Wine\nEnlarge this image toggle caption Taco Bell via AP Taco Bell via AP\nTaco Bell wants to change its reputation — and the key is booze.\nOn Tuesday, Taco Bell announced it is launching a new concept that \"redefines fast food experience.\" The first of these \"experiences\" will open in Chicago next week, and another one will follow later this month in San Francisco.\nIn a statement, the company says:\n\"Taco Bell Cantina restaurants will be the first and only Taco Bell restaurants to serve alcohol to customers who are of legal drinking age. The San Francisco restaurant will serve beer and wine only, while Wicker Park will serve, beer, wine, sangria and twisted Freezes. Cantina restaurants will also feature a new tapas-style menu of sharable appetizers — including nachos and rolled tacos — during designated hours each evening, in addition to the standard Taco Bell Menu.\"\nThese new cantinas won't have drive-throughs and will have open kitchens, according to a press release. They will also have digital menu boards, television monitors and an option for customers to use a mobile app to order and pay for their food.\nThe fast-food chain, which has relied on ad campaigns like a talking Chihuahua that utters the catchphrase \"Yo quiero Taco Bell\" to get people inside its eateries, now hopes to attract millennials who are increasingly flocking to live in cities.\nAs USA Today reports:\n\"The company knows that its Millennial customers increasingly are attracted to urban areas, where real estate is pricey. Company officials think that selling a stiffer drink might pad the receipts — the typical Taco Bell receipt is in the $7 range — and in turn help make their urbanization push more doable. \" 'To put in a drive-thru you need land,' Neil Borkan, the Taco Bell franchisee who will operate the Chicago test location, told USA TODAY. 'Can you imagine buying an acre of land in a neighborhood like [Chicago's] Wicker Park? You couldn't afford it. As real estate becomes more and more expensive, this kind of concept makes more sense.' \"Taco Bell is treading carefully into booze. While quick-service rival Starbucks recently announced it would accelerate its push of its beer and wine program and has applied for liquor licenses for hundreds of stores across the USA in recent months, Taco Bell spokesman Rob Poetsch said the company could potentially open 10 locations selling hard drinks next year.\"\nThe Wall Street Journal reports this is not the first time Taco Bell has tried to take a bite out of Chipotle's edge in the fast-casual territory.\n\"Three years ago, Taco Bell introduced a 'Cantina Bell' line of burritos and salad bowls made with fresh avocados and cilantro dressing developed by celebrity chef Lorena Garcia, which contributed to a 13% same-store-sales gain at Taco Bell in the quarter in which they were launched.\"\nFor those of you not living in or traveling to San Francisco or Chicago anytime soon, Taco Bell's regular restaurants are still around for \"a run for the border.\"","url":"https://www.npr.org/sections/thetwo-way/2015/09/15/440648138/in-a-push-to-attract-millennials-taco-bell-offers-beer-and-wine"}
