{"authors":[],"date_download":"2018-10-22 21:45:33","date_modify":"2018-10-22 21:45:33","date_publish":"2014-06-04 19:48:33","description":"Russian President Vladimir Putin on Wednesday said Hillary Clinton’s recent comments comparing his actions to those of Adolf Hitler are a sign of weakness.","filename":"data/vaneerConsumption/PutinHillaryClintonHasNeverBeenTooGracefulinStatements.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/483181/140603-hillary-clinton-5a_565acbebaf98bf91f495cacf5c93bfe1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_putin-hillary-clinton-has-never-been-too-graceful-statements-n122776_1540244733.html","title":"Putin: Hillary Clinton Has 'Never Been Too Graceful' in Statements","title_page":"Putin: Hillary Clinton Has 'Never Been Too Graceful' in Statements","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRussian President Vladimir Putin on Tuesday said Hillary Clinton’s recent comments comparing his actions to those of Adolf Hitler are a sign of weakness, saying she “has never been too graceful” in her public statements.\n“It's better not to argue with women. But Ms. Clinton has never been too graceful in her statements,” Putin said, according to an English transcript of an interview posted on the Kremlin’s website.\nAt a private fundraiser in March, Clinton reportedly compared Putin’s move to issue Russian passports to those with Russian connections outside the country to Hitler’s efforts to protect Germans outside of Germany.\n“Now if this sounds familiar, it's what Hitler did back in the '30s,” Clinton said, according to a local newspaper report.\nPutin said, “Someday I will indulge myself and we will laugh together at some good joke. But when I hear such extreme statements, to me it only means that they don't have any valid arguments.”\nPutin and President Barack Obama on Friday are both expected to attend a luncheon hosted by French President Francois Hollande to commemorate the 70th anniversary of the D-Day invasion, though the leaders have no formal plans to meet. It will be the first time the two will be in the same room since Russia's incursion into Ukraine.\nPutin was asked if he thought \"it would be worse if you were meeting with Hillary Clinton\" given the former secretary of state's rhetoric.\n\"I think even in this case we could reach an agreement,\" Putin said. \"When people push boundaries too far, it's not because they are strong but because they are weak. But maybe weakness is not the worst quality for a woman.\"","url":"https://www.nbcnews.com/politics/politics-news/putin-hillary-clinton-has-never-been-too-graceful-statements-n122776"}
