{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-23 01:02:43","date_modify":"2018-10-23 01:02:43","date_publish":"2016-01-28 15:15:04","description":"The Pygmy Seahorse, such as these in North Sulawesi, Indonesia, only grow to become one inch from nose to tail, so has been forced to come up with the ultimate way to blend in.","filename":"data/vaneerConsumption/Pygmyfishhidesincoralbygrowingamatchingcamouflage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB164400000578-0-image-a-5_1453993219416.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421101_Can-spot-seahorse-One-inch-long-pygmy-fish-hides-coral-growing-matching-camouflage_1540256563.html","title":"Pygmy fish hides in coral by growing a matching camouflage","title_page":"Pygmy fish hides in coral by growing a matching camouflage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"By showing off camouflage skills that would make a chameleon jealous, these tiny seahorses dedicate their lives to staying hidden.\nThe Pygmy Seahorse only grow to become one inch from nose to tail, so has been forced to come up with the ultimate way to blend in.\nThe baby seahorse is born completely grey, but once it has found its 'home' coral, it starts blending in - even growing colourful 'warts' to match it.\nHidden: The pygmy seahorse is perfectly camouflaged to match the sea fan, a type of coral in which they live, in Lembeh, in North Sulawesi, Indonesia\nThe incredible photographs, which show seahorses of a variety of colours playing their best hide-and-seek game, were taken by photographer Colin Marshall in Lembeh, in North Sulawesi, Indonesia.\nThe amazing creatures camouflage themselves with their sea fan environment, almost identically matching their colour, body width and even warts.\nWith no other defence mechanisms, camouflage is their only chance of survival, but it is a successful one.\nTheir tiny size makes spotting them even more difficult for predators. They reach no more than one inch from head to tail, making them small than a paperclip.\nThey are almost impossible to raise in captivity. Until recently, there was no record of the seahorses ever living long enough to breed in an aquarium.\nPerfect match: The tiny pygmy seahorse only ever grows to become one inch from nose to tail\nThe pygmy seahorse is born grey, but once it has found its 'home' sea fan, it starts blending in - even growing colourful 'warts' to match it\nWith no other defence mechanisms, camouflage is their only chance of survival, but it is a successful one\nBecause of this, very little is known about them. They are a truly mysterious species.\nThe question of if they gain their colour or if they find the right fan was only uncovered in 2014 when biologists collected a mating pair of seahorses in the Philippines.\nThe experiment uncovered that babies are all born a dull grey colour. Then one it joins a coloured sea fan by grabbing it with their tail, it will match that colour and stay there for the rest of their lives.\nThe seahorses are too small and fragile to make it on their own, so unless they find a place to fit into perfectly, they will die.\nAmazingly, the Alcyonacea sea fan in itself is an animal, distantly related to jellyfish and the seahorses truly can not live without them.","url":"https://www.dailymail.co.uk/news/article-3421101/Can-spot-seahorse-One-inch-long-pygmy-fish-hides-coral-growing-matching-camouflage.html"}
