{"authors":[],"date_download":"2018-10-23 03:16:44","date_modify":"2018-10-23 03:16:44","date_publish":"2016-01-11 15:53:31","description":"Qatar has banned \"The Danish Girl\" movie -- about an artist who undergoes one of the world's first sex changes and which stars Oscar-winner Eddie Redmayne --...","filename":"data/vaneerConsumption/QatarbanssexchangefilmTheDanishGirl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-700re-48qEJGFphM8d437f0aaf926c24a1-978_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394131_Qatar-bans-sex-change-film-The-Danish-Girl_1540264604.html","title":"Qatar bans sex change film 'The Danish Girl'","title_page":"Qatar bans sex change film 'The Danish Girl' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Qatar bans sex change film 'The Danish Girl'\nQatar has banned \"The Danish Girl\" movie -- about an artist who undergoes one of the world's first sex changes and which stars Oscar-winner Eddie Redmayne -- from cinemas, officials announced Monday.\nThe move follows protests online about the \"depravity\" of the film, which had begun screening at some cinemas in Doha this month.\n\"We would like to inform you that we have contacted the concerned administration and the screening of the Danish film is now banned from cinemas,\" the culture ministry wrote on Twitter.\nActors Eddie Redmayne (R) and Alicia Vikander at the British premiere of the transgender tale \"The Danish Girl\" in London on December 8, 2015 ©Ben Stansall (AFP/File)\n\"We thank you for your unwavering vigilance.\"\nThe film, which is loosely based on the lives of two Danish painters in the 1920s, had first been screened in Qatar last Thursday.\nOne member of staff at a Doha cinema, who did not wish to be named, said authorities had told them to remove the film on Monday. It was immediately pulled.\nRedmayne, who won an Oscar last year for his portrayal of Stephen Hawking in \"The Theory of Everything\", plays pioneering transgender woman Lili Elbe in the movie.\nIts screening though had provoked an angry reaction among some cinemagoers.","url":"https://www.dailymail.co.uk/wires/afp/article-3394131/Qatar-bans-sex-change-film-The-Danish-Girl.html"}
