{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:53:37","date_modify":"2018-10-30 22:53:37","date_publish":"2018-07-26 00:00:00","description":"The collapse of Qualcomm's proposed $44 billion acquisition of NXP Semiconductors resulted from a lack of Chinese approval. The CEOs of both companies have suggested bigger forces are at play, strongly hinting at the negative effect of the mounting trade war.","filename":"data/vaneerConsumption/QualcommNXPSemiconductorsdealcollapseexampleoftradewarimpact.json","image_url":"https://amp.businessinsider.com/images/5b59ed5179126d19008b4624-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_qualcomm-nxp-semiconductors-deal-collapse-example-of-trade-war-impact-2018-7_1540940017.html","title":"Qualcomm, NXP Semiconductors deal collapse example of trade war impact","title_page":"    Qualcomm, NXP Semiconductors deal collapse example of trade war impact - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Rick Wilking\nQualcomm's proposed $44 billion acquisition of NXP Semiconductors hung in limbo for months, awaiting regulatory approval from China, the lone holdout.\nThen President Donald Trump's trade war took the world by storm.\nAs tensions between the US and China escalated over a series of months, any sort of cooperation that might've previously been expected fell by the wayside. In the end, Qualcomm's mega-merger — which would've been the biggest semiconductor deal in history — seems to be collateral damage, as Chinese regulators let the approval deadline pass without signing off.\nBut if trade conflict was the primary driver behind China's failure to approve the deal, it's not letting on. Gao Feng, the nation's commerce ministry spokesman, said in a briefing early Thursday that the decision to let the deadline pass was about market monopoly, not trade.\nQualcomm CEO Steve Mollenkopf doesn't sound so convinced.\n\"There were probably bigger forces at play here than just us,\" he said in an interview prior to the deadline. \"We are still fans of the deal and the logic behind the deal.\"\nRichard Clemmer, the CEO of NXP, was more pointed with his criticism of the deal's collapse, calling it a \"purely political decision.\" He also said there was \"no legal or power issue that prevented the transaction.\"\nNow both companies are left to pick up the pieces of their failed merger. Qualcomm is on the hook for the $2 billion termination fee that was previously agreed upon. In order to assuage the situation with investors, the company authorized a $30 billion share buyback program. The chip maker's stock climbed 4.3% on Thursday amid the news.\nWhere Qualcomm goes next is less clear, with the prospect of global M&A in the crucial Chinese market significantly dampened by the failed NXP deal.\n\"Our core strategy of driving Qualcomm technologies into higher growth industries remains unchanged,\" Qualcomm CEO Steve Mollenkopf said in a statement. \"We will continue to focus on our strong momentum in these growth industries.\"\nNXP CEO Clemmer is already pumping the breaks on speculation of another merger, saying \"uncertainty will keep us from doing such a deal in the near future.\" The company did say it will repurchase $5 billion of shares, and plans to unveil a new strategy at a September 11 analyst day in New York.\nTraders were less forgiving when it came to NXP, pushing its shares down more than 5% on Thursday. Prior to the deal collapse, the company's stock had climbed more than 60% since February 2016.\nSee also:","url":"https://www.businessinsider.com/qualcomm-nxp-semiconductors-deal-collapse-example-of-trade-war-impact-2018-7"}
