{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 02:39:46","date_modify":"2018-10-23 02:39:46","date_publish":"2017-03-16 13:16:07","description":"Known for her love of co-ordination, Queen Mathilde of Belgium monarch, 44, didn't disappoint as she stepped out in Holsbeek to promote Week Of Care.","filename":"data/vaneerConsumption/QueenMathildeshowsoffherfigureinHolsbeek.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54623100000578-0-image-a-130_1489670097658.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320242_Queen-Mathilde-shows-trim-waist_1540262386.html","title":"Queen Mathilde shows off her figure in Holsbeek","title_page":"Queen Mathilde shows off her figure in Holsbeek | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a hard working royal and mother-of-four, but Queen Mathilde certainly never fails to look polished.\nKnown for her love of co-ordination, the Belgian monarch, 44, didn't disappoint as she stepped out in Holsbeek to promote Week Of Care.\nThe blonde royal wore a tweedy moss green dress, which she cinched at the waist with a nude belt to accentuate her trim figure.\nKnown for her love of co-ordination, the Belgian monarch, 44, didn't disappoint as she stepped out in Holsbeek to promote Week Of Care in a green dress with neutral accessories\nShe kept her accessories neutral too, teaming her frock with suede pumps and a clutch as well as a beige shawl, which she later shrugged off.\nThe Week of Care initiative is held yearly to create public support for the care and welfare sector in Belgium.\nThe Queen visited De Switch and Centrum Molenmoes, both targeting minors and youths.\nShe was presented with a posy of flowers by a teenage boy and a book by a girl who then gave her a kiss on the cheek.\nQueen Mathilde receives a kiss on the cheek after being presented with a book by a young girl as she celebrates Week Of Care\nThe royal arrived wearing a beige coloured shawl as she was presented with a posy of flowers\nIt's been a busy time for the royal who recently made a four-day trip to Laos, where she visited communities in her role as the honorary president of Unicef Belgium.\nAs well as meeting the Minister for Foreign Affairs, the Minister for Female Affairs and the Vice President, she took time to visit Buddhist temples and schools.\nShe also travelled to villages to see how Unicef health outreach programmes are helping residents.\nThe mother-of-four meets with a young girl as she participates in the Week van de Zorg (Week of Care)","url":"https://www.dailymail.co.uk/femail/article-4320242/Queen-Mathilde-shows-trim-waist.html"}
