{"authors":["Ashleigh Davis For Daily Mail Australia"],"date_download":"2018-10-22 21:11:55","date_modify":"2018-10-22 21:11:55","date_publish":"2017-04-26 01:13:04","description":"One person has been airlifted to hospital and another 10 treated at a medical centre after their charter boat capsized off Stradbroke Island in Queensland on Wednesday morning.","filename":"data/vaneerConsumption/Queenslandwaterpolicerescue11afterboatcapsizes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/00/3F9B33EC00000578-0-image-a-2_1493164231914.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445726_Eleven-people-rescued-boat-capsized-Stradbroke-Island_1540242715.html","title":"Queensland water police rescue 11 after boat capsizes","title_page":"Queensland water police rescue 11 after boat capsizes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One person has been flown to hospital and 10 others are injured after a boat capsized between Stradbroke and Moreton Island in Queensland.\nQueensland Police told Daily Mail Australia a person on the boat called police at 6.06am on Wednesday morning, saying it had overturned between the two islands.\nThere were nine passengers and two crew on board, reported the Courier Mail.\nScroll down for video\nOne person has been flown to hospital (pictured) and 10 others are injured after a boat capsized between Stradbroke and Moreton Island in Queensland\nEmergency services including water police and a rescue helicopter attended the scene and the 11 passengers were transported to Dunwich on Stradbroke Island.\nPolice said there were a few people with injuries, including a man with a serious back injury, a man that had taken on water and a couple of people with hypothermia symptoms.\nA spokesperson for Queensland Ambulance said they assessed 10 patients at Dunwich Health Service Centre, all with on life-threatening injuries.\nThe 11th person was airlifted to Princess Alexandria Hospital in Brisbane with spinal precautions and water inhalation.\nPolice said the group were in a charter boat of some kind, and they were still trying to determine what happened.\nPolice will be interviewing the skipper in due in course.\nQueensland Police told Daily Mail Australia a person on the boat called police at 6.06am on Wednesday morning, saying it had overturned between the two islands\nThere were nine passengers and two crew on board the boat. Pictured is one occupant being attended to by paramedics\nEmergency services including water police and a rescue helicopter attended the scene and the 11 passengers were transported to Dunwich on Stradbroke Island\nA spokesperson for Queensland Ambulance said they assessed 10 patients at Dunwich Health Service Centre, all with on life-threatening injuries","url":"https://www.dailymail.co.uk/news/article-4445726/Eleven-people-rescued-boat-capsized-Stradbroke-Island.html"}
