{"authors":["Kerry Mcdermott For Mailonline"],"date_download":"2018-10-23 03:15:44","date_modify":"2018-10-23 03:15:44","date_publish":"2017-03-16 14:05:11","description":"The Spanish monarch gave a lesson in pared back chic today as she received audiences at Zarzuela Palace in Madrid wearing a simple, slim-fitting trouser suit and stiletto heels.","filename":"data/vaneerConsumption/QueenLetiziaofSpainatMadridsZarzuelaPalace.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55238600000578-0-image-a-38_1489678434987.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320120_Queen-Letizia-Spain-Madrid_1540264544.html","title":"Queen Letizia of Spain at Madrid's Zarzuela Palace","title_page":"Queen Letizia of Spain at Madrid's Zarzuela Palace | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She may be royalty, but that doesn't rule out understated dressing for Queen Letizia.\nThe Spanish monarch gave a lesson in pared back chic today as she received audiences at Zarzuela Palace wearing a simple, slim-fitting trouser suit and stiletto heels.\nLetizia wore no necklace, just a pair of drop earrings, and her hair was loose as she received audiences at the palace in Madrid.\nThe always elegant Queen Letizia opted for a pared back trouser suit with a simple, round necked jumper worn underneath\nQueen Letizia kept things simple and wore no necklace, just a pair of gold drop earrings\nLetizia chose a plain jumper in a contrasting shade of blue to her suit, and kept her neckline free of adornment.\nThe Queen, 44, also kept her makeup suitably simple to greet guests at the palace today.\nShe mingled with members of ALMA, a group established to help tackle gender violence.\nA pair of sharp black stilettos completed the Queen of Spain's sleek look at the palace\nThe brunette Queen, 44, received audiences at Zarzuela Palace in Madrid today\nThe stylish brunette, 44, is known for having fun with fashion, having showcased an edgier look just yesterday at another engagement in Madrid.\nLetizia wore a vibrant red coat with eye-catching flared sleeves over black skinny jeans to attend the Honorary Ambassadors of the Spain Brand ceremony in the capital.\nThe mother-of-two completed her look with this season's beauty must have - a statement dark lip.\nYesterday Letizia wore an unsual red coat over black skinny trousers, and showed off a statement dark berry lipstick\nLetizia shakes hands with a guest at the palace as others look on today in Madrid\nKeeping it simple: The Queen wore her shoulder length hair loose over her shoulders","url":"https://www.dailymail.co.uk/femail/article-4320120/Queen-Letizia-Spain-Madrid.html"}
