{"authors":["Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-22 22:43:35","date_modify":"2018-10-22 22:43:35","date_publish":"2017-04-26 05:31:41","description":"Natalie Alexander, from the Sunshine Coast in Queensland, has been left terrified to be home alone after she caught a man staring at her through the window when she was in the shower.","filename":"data/vaneerConsumption/Queenslandwomanleftterrifiedaftermanpeepsintohome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9C546000000578-0-image-a-53_1493180833958.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446118_Queensland-woman-left-terrified-man-peeps-home_1540248215.html","title":"Queensland woman left terrified after man peeps into home","title_page":"Queensland woman left terrified after man peeps into home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Queensland woman has been left terrified to be home alone after she caught a man staring at her through her window after she got out of the shower.\nOn Monday night, Natalie Alexander was showering at her Palmwoods on the Sunshine Coast when she heard a loud knock at the door and assumed it was her boyfriend's brother.\nBut as she walked out of the bathroom at 8pm, she saw an 'average looking' stranger aged in his 30s or 40s peeping through the window before dumping salt on the doorstep and running away.\n'I saw his face through the window,' Ms Alexander told the Sunshine Coast Daily. 'I was home alone'.\nOn Monday night, Natalie Alexander was showering at her home in Palmwoods on the Sunshine Coast when she found a stranger staring into her home\nShe said she ran into her bedroom and called her boyfriend, Wade Kelly, who drove home from the gym and went searching for the 'Peeping Tom'.\nMs Alexander said she usually keeps the front door unlocked with the security screens closed, but will make sure both are secured in future.\n'I won't be being left alone,' she said.\nPhotos taken by Mr Kelly show salt scattered at the front door next to the welcome mat.\nSalt on the front door can be used by those who are superstitious to ward away evil spirits or wish misfortune onto the residents.\nMs Alexander said she ran into her bedroom and called her boyfriend, Wade Kelly (both pictured), who drove home from the gym and went searching for the 'Peeping Tom'\nPhotos taken by Mr Kelly show salt scattered at the front door next to the welcome mat\nMr Kelly shared his horror to Facebook on Monday, saying he will not deal with 'that s*** in his town'.\n'Just letting everyone know there is a peeping tom in Palmwoods at the moment,' he wrote.\n'My partner just called me to tell me she saw a man outside her window looking in and ran away when he saw her spot him'.\nLocal police Sergeant Kevin Crowley said no official complaint had been made and was not aware of the man targeting homes in the Palmwoods area.\nMr Kelly shared his horror to Facebook on Monday, saying he will not deal with 'that s*** in his town'","url":"https://www.dailymail.co.uk/news/article-4446118/Queensland-woman-left-terrified-man-peeps-home.html"}
