{"authors":["Quentin Letts For The Daily Mail"],"date_download":"2018-10-22 21:33:03","date_modify":"2018-10-22 21:33:03","date_publish":"2017-04-26 01:59:42","description":"Jude Law shows off a fine pair of pecs and there are some smouldering sex scenes; apart from that, the Barbican’s revival of Luchino Visconti’s Obsession is ripely pretentious twaddle.","filename":"data/vaneerConsumption/QUENTINLETTSreviewofObsession.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F964ADF00000578-0-image-a-30_1493168218578.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446050_QUENTIN-LETTS-night-review-Obsession_1540243983.html","title":"QUENTIN LETTS' review of Obsession","title_page":"QUENTIN LETTS' review of Obsession  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Obsession (The Barbican, London)\nRating:\nJude Law shows off a fine pair of pecs and there are some smouldering sex scenes; apart from that, the Barbican’s revival of Luchino Visconti’s Obsession is ripely pretentious twaddle.\nWhen characters die they are sprayed with oil from a car engine suspended from on high. Spurrrrt. Aaaargh. Swab swab.\nAt moodier moments, such as when rumpy-pumpy is being had, big motion pictures are flashed on to the back walls, to the throb of ambient noise.\nAnd when characters are running from reality, they are placed on a small oblong of central stage which becomes a treadmill. Just watching them sprint is almost enough to give you a stitch.\nJude Law shows off a fine pair of pecs and there are some smouldering sex scenes; apart from that, the Barbican’s revival of Luchino Visconti’s Obsession is ripely pretentious twaddle\nHalina Reijn and Law, who plays the role of a young wife, Hanna, during the opening night at The Barbican\nGijs Scholten van Aschat trakes on the part of Hanna's husband, while Robert de Hoog (far right) plays another tramp\nObsession, made into a 1943 film, is better known as its source story The Postman Always Rings Twice. Moneyless wanderer Gino (Mr Law) visits a rural restaurant and falls instantly in lust with the owner’s bored wife. They soon conspire to murder the owner.\nThe original’s story is all about how you can get away with bad things for a while but eventually you will meet your comeuppance, even by accident. In this production, that potent story about fate comes second to gimmick and image.\nIt is always a bad sign when a director gratuitously makes a mess of the stage. In addition to the motor oil, at least three large bins of litter are scattered here and there – implausibly, pointlessly. For the last 45 minutes the actors have to step over or around, and sometimes, crunch on top of paper cups and plastic wrappers and so forth.\nIn this production, that potent story about fate comes second to gimmick and image\nThe original’s story is all about how you can get away with bad things for a while but eventually you will meet your comeuppance, even by accident\nLaw is pictured here during a bar scene with co-star Chukwudi Iwuj, but great leaps of narrative are abandoned in this production\nHalina Reijn plays the young wife, Hanna, and Gijs Scholten van Aschat takes the part of her grumpy husband. With another tramp being played by Robert de Hoog, it’s soon Netherlands 3, England 1.\nMuch as it is lovely to admire Mr Law’s 44-year-old chest (toned, tanned and even partly waxed, I think) – and to see pert Miss Reijn take a bath in nothing but her skimpies – director Ivo van Hove neglects the story-telling. Great leaps of narrative are abandoned. One moment we are told Hanna has squealed to the police. The next, she is meeting her demise under a shower of Castrol GTX.\nSub-plots about a chorus-girl (Aysha Kala, who also flashes some boob), and the gay second tramp are badly under-explained. Chukwudi Iwuji doubles up as a priest and a policeman and it is not always easy to work out which part he is playing.\nAfter the initial frisson of the love affair, it tails away into silliness long before the end, which itself arrives unexpectedly. With various plot strands unresolved, the actors just silently walk to the front of the stage and do an artsy bow. Distinctly peculiar.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446050/QUENTIN-LETTS-night-review-Obsession.html"}
