{"authors":["Kate Galbraith","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:35:13","date_modify":"2018-10-30 22:35:13","date_publish":"2015-07-18 08:00:00","description":"California's Emissions, Population and Economic Growth How will population and economic growth impact California's greenhouse gas targets? View More SHARE","filename":"data/vaneerConsumption/QuestionHowhardwillitbetomeet2030and2050greenhousegasreductiongoals.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/8732427615_f9c062b9f6_k-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938913.html","title":"Question: How hard will it be to meet 2030 and 2050 greenhouse-gas reduction goals?","title_page":"Question: How hard will it be to meet 2030 and 2050 greenhouse-gas reduction goals? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California’s Emissions, Population and Economic Growth\nHow will population and economic growth impact California’s greenhouse gas targets? View More SHARE Facebook\nTwitter\nEmail\nIn practice, however, the acceleration may not be quite so dramatic. That’s because most experts expect California to come in below its 2020 targets. If, for example, California’s emissions come in at around 400 million metric tons of carbon dioxide equivalent in 2020, rather than at 431 (the figure needed to exactly meet its 2020 goal), California would need to cut emissions roughly three times faster between 2020 and 2030 than during the preceding decade.\nBetween 2030 and 2050, emissions will also need to decline much more quickly than has been the case in recent years.\nThese calculations come with one slight caveat: the state has specified its long-term goals only in terms of percentage reductions, rather than in terms of exact emissions figures. But the exact numbers, when they are formulated, are expected to be roughly what the percentages suggest (eg, around 260 million metric tons of carbon dioxide equivalent for 2030, and 85 metric tons in 2050).","url":"https://calmatters.org/articles/how-hard-will-it-be-to-meet-2030-and-2050-greenhouse-gas-reduction-goals/"}
