{"authors":[],"date_download":"2018-10-23 05:37:36","date_modify":"2018-10-23 05:37:36","date_publish":"2015-06-02 00:00:00","description":"Auto parts supplier Takata has agreed to modify the way it makes airbags. Takata and government safety officials were on Capitol Hill Tuesday to answer questions about the massive recall effort. Some 34 million vehicles need to have new airbags installed.","filename":"data/vaneerConsumption/QuestionsRemainAboutAirbagRecallAfterTakataTestifiesBeforeHouse.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=411533526_1540273056.html","title":"Questions Remain About Airbag Recall After Takata Testifies Before House","title_page":"Questions Remain About Airbag Recall After Takata Testifies Before House : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MELISSA BLOCK, HOST:\nWe've heard the staggering number - 34 million cars with defective air bags, the largest auto recall in U.S. history. The company at the center of this is the Takata Corp. Today lawmakers grilled auto industry executives and federal safety regulators for answers. As Jason Margolis reports, members of Congress are trying to determine what caused the problem and if the replacement air bag parts are safe.\nJASON MARGOLIS, BYLINE: Are we safe, or merely safer? That was the question repeatedly posed by Congressman Michael Burgess, Republican from Texas.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMICHAEL BURGESS: We don't have any great clarity as to the root cause and how we will know when we get to that point where we are safe. Clarity and transparency are indeed needed.\nMARGOLIS: Burgess was speaking to auto executives and National Highway Traffic Safety Administrator Mark Rosekind. He updated committee members on the root cause of defective air bags.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMARK ROSEKIND: Some factors appear to have a role, such as time and absolute humidity. The full story is not yet known and a definitive root cause has not been identified. In my recent experience as an NTSB board member and a veteran of many major transportation investigations, it may be that there is no single root cause, or the root cause may never be known.\nMARGOLIS: Rosekind said part of the difficulty in testing is that there are more than 10 different configurations of the inflator.\n(SOUNDBITE OF ARCHIVED RECORDING)\nROSEKIND: That's part of the problem. In fact, there are some Takata air bags in certain manufacturers that have ruptured in some manufacturers', but not other manufacturers' cars.\nMARGOLIS: Engineers are confident the problem is caused by exposure to high heat and humidity. This can cause the chemical ammonium nitrate to degrade over time. Marsha Blackburn, a Republican from Tennessee, raised concerns about what chemicals Takata is using in replacement air bags.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMARSHA BLACKBURN: Are you satisfied with the information that Takata has provided to you on their propellant mix?\nROSEKIND: We're working our way through that information. They have been open about providing us testing data...\nBLACKBURN: OK.\nROSEKIND: ...But the information that you're asking about was millions and millions of pages.\nMARGOLIS: Takata's executive vice president of North America, Kevin Kennedy, spoke next. He struck a penitent tone, expressing deep regret for his company's defective air bags. He tried to assure committee members that replacement parts were indeed safe, but many weren't convinced, including Democrat Jan Schakowsky of Illinois. She didn't understand why ammonium nitrate was still being used by Takata.\n(SOUNDBITE OF ARCHIVED RECORDING)\nJAN SCHAKOWSKY: So the replacement could be as dangerous as the current? Why would you even replace it?\nKEVIN KENNEDY: Well, we - as I said, without really exactly understanding the root cause and continuing to test outside of the bounds of what we've already recalled, we're trying to determine that.\nMARGOLIS: The other issue is availability. There simply aren't enough kits to replace the potentially faulty air bags. Kennedy said Takata has doubled the production of replacement kits to 700,000 a month and the company is turning towards its competitors.\n(SOUNDBITE OF ARCHIVED RECORDING)\nKENNEDY: Half of the replacement kits we shipped last month contained inflators made by other suppliers. And by the end of the year, we expect that to reach 70 percent.\nMARGOLIS: Still, it's expected to be two years before there are replacement parts for all 34 million vehicles that need them. Jason Margolis, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=411533526"}
e by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/06/02/411533526/questions-remain-about-airbag-recall-after-takata-testifies-before-house"}
