{"authors":["Associated Press"],"date_download":"2018-10-23 04:49:23","date_modify":"2018-10-23 04:49:23","date_publish":"2016-01-29 20:39:08","description":"DES MOINES, Iowa (AP) — Bernie Sanders feels like the hottest candidate in the Democratic race. Thousands flock to his rallies across Iowa, screaming his nam...","filename":"data/vaneerConsumption/QuirkycaucusesposeorganizationalchallengeforSanders.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:b83730f218164793b6993122cc9e681c-4PuZeKVXE7cd9005b2c876e13a89-204_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423429_Quirky-caucuses-pose-organizational-challenge-Sanders_1540270163.html","title":"Quirky caucuses pose organizational challenge for Sanders","title_page":"Quirky caucuses pose organizational challenge for Sanders | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Quirky caucuses pose organizational challenge for Sanders\nDES MOINES, Iowa (AP) — Bernie Sanders feels like the hottest candidate in the Democratic race. Thousands flock to his rallies across Iowa, screaming his name as they \"feel the Bern.\"\nThe question is whether all that energy translates into warm bodies ready to turn out and caucus for him on that cold Monday night.\nEven Sanders admits he doesn't know the answer.\nIn this Jan. 28, 2016, photo, Democratic presidential candidate Sen. Bernie Sanders, I-Vt., pumps his fist as he walks with his wife Jane Sanders during a campaign rally at the Burlington Memorial Center in Burlington, Iowa. Sanders feels like the hottest candidate in the Democratic race. Thousands flock to his rallies across Iowa, screaming his name. The question is whether all that heat translates into bodies in a room on a cold night in Iowa next Monday. (AP Photo/Evan Vucci)\n\"No, I'm not,\" he replied when asked if he was predicting a win on caucus night. \"I am saying that we are right now in Iowa in a very, very close election.\"\nFor decades, Iowa has been a key testing ground for insurgent Democratic candidates trying to wrest the nomination from the establishment pick.\nFormer Vermont Sen. Howard Dean failed to turn early momentum into a win in the state against then-Massachusetts Sen. John Kerry. Four years later, then-Illinois Sen. Barack Obama toppled Hillary Clinton with an uplifting message and strong organization in the state, giving him an early boost that helped him clench the nomination.\n\"It's really easy to buy into crowds and see large crowds and assume that translates,\" said Democratic strategist Chris Kofinis. \"The fundamental question going into the night of the caucus is Sanders more like Dean or is he more like Obama?\"\nGoverned by arcane rules, the Iowa caucus is one of quirkiest features of American politics. Delegates — who ultimately decide the primary— are awarded proportionally, based on a complex calculation. That means that a stronger showing in any individual county doesn't necessarily translate into significantly more delegates.\nPutting together a winning campaign traditionally requires a significant amount of voter outreach and organization.\n\"The adage is organize, organize, organize, and get hot late,\" said Mitch Stewart, who directed field operations for Obama's Iowa effort in 2008. \"The question is did Sanders do enough organizing early.\"\nClinton's team arrived in Iowa early last year and quickly built up a sizable staff, led by some of the strategists who worked on Obama's 2008 bid. They've spent months doing outreach to likely voters, cultivating relationships to ensure they show up on Monday night.\n\"A fellow named Chris, bless his heart, he calls me every day,\" said Annette Bebout, a 73-year-old support who came to Clinton's rally on Thursday afternoon in Newton. \"Even today, he called me and left a message.\"\nTheir methodical approach has complicated the equation for Sanders, whose campaign has gained steam in the final weeks before voting on Monday. Unlike Clinton, who ramped up staffing in the state last spring, Sanders' organization expanded more slowly. Pete D'Alessandro, who is directing the Iowa operation for Sanders, said the staffing has grown from two people in May to over 100 today. Much of the growth has been since the fall, as Sanders' fundraising picked up.\nOne challenge is the regional concentration of his backing. The caucus system rewards wide-spread support, meaning that huge turnout in college and urban areas produces diminishing returns, given that each precinct elects only a certain number of delegates. Broader support in a larger number of smaller counties can produce a greater overall delegate tally and a more assured path to victory.\n\"Sometimes in these rural counties two or three people make a lot of difference, as opposed to two or three people in Des Moines,\" said Paul Tewes, a Democratic consultant who served as Barack Obama's Iowa director in 2008. \"You get bang for your buck in rural areas.\"\nWhile Sanders draws massive crowds across the state, about 27 percent of his backing is concentrated in three counties that are home to big universities, according a poll by the Des Moines Register.\nThe survey also showed that Sanders leads among younger voters, first time caucus goers, and independents — three groups that tend to be less likely to caucus.\nClinton, meanwhile, has strong backing among one of the reliably caucus-going demographics: Older women.\n\"They're going to come out no matter what,\" said Rep. Dave Loebsack, who's backing Clinton after supporting Obama eight years ago.\nSanders's coalition is similar coalition to the one that backed Obama, who focused significant resources on turning out younger voters.\n\"American democracy is not a football game. It is not a TV show. It is not a spectator sport,\" Sanders said. \"Democracy means that all of our people are supposed to be involved.\"\nSanders aides also say the campaign is working to help get students back to their hometowns to caucus, — a program they call \"Go Home for Bernie.\" D'Alessandro declined to say how many students there are, but said the campaign is helping to organize ride shares or van transportation, in hopes of spreading their support across the state.\nAt a caucus training event on Wednesday night, hosted by Drake University, celebrities like ice cream mogul Ben & Jerry and actor Kal Penn, mingled with students supporters, encouraging them to come out for Sanders on Monday night.\nFreshman Erin Cady and Cade Martin said they were excited to back him — but wouldn't head home to do it.\n\"We just got back to school,\" said Cady. \"We're pretty well cemented in this area right now.\"\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3423429/Quirky-caucuses-pose-organizational-challenge-Sanders.html"}
