{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-31 00:11:57","date_modify":"2018-10-31 00:11:57","date_publish":"2016-05-25 08:00:00","description":"The eight-page document reads like a contract, asking candidates seeking a seat in the Legislature to pledge support for workers organizing unions. It","filename":"data/vaneerConsumption/Quizzingthecandidatesleavesasecretpapertrail.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/SEIU-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944717.html","title":"Quizzing the candidates leaves a secret paper trail","title_page":"Quizzing the candidates leaves a secret paper trail | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The eight-page document reads like a contract, asking candidates seeking a seat in the Legislature to pledge support for workers organizing unions. It lists priority issues – including health care, immigration and retirement benefits – and asks if the candidate will be a “supporter,” “champion” or “partner” as the union pursues its agenda in Sacramento.\nThe answers are a secret paper trail left by politicians who have sought backing this year from the Service Employees International Union, one of the state’s most powerful labor groups. The union won’t share the completed documents with the public. But it will pull out candidate’s responses later when they cast votes as lawmakers.\n“We do bring the questionnaire back out and remind them that when they were running, they told our members x, y and z,” said Alma Hernandez, SEIU’s political director.\n“So there is an expectation that they vote [that way].”\nQuestionnaires from interest groups are a staple of electoral politics. They’re used by unions and business interests and others across the political spectrum, from gun-rights and anti-abortion groups on the right to environmental and gay-rights groups on the left.\nThe surveys can help sift a field of contestants as decisions are made about how to spend big campaign money. SEIU poured $14.3 million into California campaigns in 2014, according to the National Institute on Money in State Politics, and only a handful of Democrats were elected without the union’s support.\nBy locking potential legislators into a position before they’re even elected, questionnaires may also influence policy-making in a way that excludes the public and raises ethical questions. Out of view from voters, they can create private covenants between soon-to-be public officials and the groups that will lobby them.\n“It’s the smoke-filled backroom of politics,” said Sen. Steve Glazer (D-Orinda).\nHe won his seat last year after making opposition to questionnaires a cornerstone of a previous, unsuccessful run. Glazer declined to answer the questionnaires, instead posting them on his web site so the public could see what interest groups wanted.\nMany questionnaires are more open-ended than SEIU’s and do not ask for promises. Still, Glazer said, the process makes it harder for lawmakers to fairly evaluate all sides of the complex matters they act on in office.\n“It can significantly contribute to having a closed mind on matters where one really doesn’t know all the nuances of the issue,” he said.\nRepublican Joseph Rubay, who is challenging Glazer this year, said some concerns are overblown.\n“I’ve filled them out, and I’ve noticed what he’s noticed: They tend to try to take you down a path,” Rubay said. “But overall I think it’s my job to let people know my positions. I should be able to answer a questionnaire with ease, which I’ve done.”\nThe California Teachers Association questionnaire offered Rubay a learning experience. Though many Republicans favor English-only education, Rubay said, he came to appreciate a dual-immersion approach for teaching languages while going through the powerful union’s endorsement process.\nThe union has not endorsed anyone in the race. CTA spokeswoman Claudia Briggs said questionnaires are just one element in such decisions.\nThe teachers also pose questions related to state finances: Will you support new revenue for public schools and colleges? Oppose reducing of public pension plans?\nPension issues also emerge from other public employee groups as they battle efforts to curtail retirement benefits. A survey from the union AFSCME asks if candidates support traditional pensions. The California Police Chiefs Association wants to know if recent changes in the state’s pension formula – meant to reduce costs in decades ahead – will affect law enforcement’s “ability to both recruit and retain high caliber candidates.”\nBusiness groups have other questions. A healthcare coalition asks if candidates will oppose bills that would allow larger awards in malpractice lawsuits. A real estate association requests views on property taxes, rent control and evictions.\nThe California Association of Realtors, unlike SEIU, does not use questionnaires to pressure officials after they’re elected, said Laiza Garcia, the group’s political director.\n“The questionnaire … is not held up as a set of expectations for elected officials,” Garcia said by email. “In fact C.A.R. lobbyists never see the questionnaires or the responses provided.”\nLea-Ann Tratten, political director for Consumer Attorneys of California, an advocacy organization for plaintiffs’ lawyers, said her group avoided questionnaires for years, concerned about the potential for corruption. Using policy positions as a basis for campaign donations, she said, could tread close to a “quid pro quo.”\nWhen Tratten did craft a survey a few years ago, she said, she wrote it to draw out candidates’ political philosophies and perspectives on the legal system, without asking how they would vote on specific issues.\n“We believe it’s important that candidates try to keep an open mind,” Tratten said.\n“It’s risky to allow yourself to get pinned down on something before you ever reach Sacramento.”\nSee what they want\nClick here to read some of the questionnaires interest groups give to candidates for the Legislature.","url":"https://calmatters.org/articles/quizzing-candidates-leaves-secret-paper-trail/"}
