{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 00:13:13","date_modify":"2018-10-23 00:13:13","date_publish":"2016-01-11 09:10:02","description":"Attempts to reach Madaya in Syria were delayed at the last minute yesterday - but at least three trucks equipped with food and medicine have this afternoon reached the town.","filename":"data/vaneerConsumption/RacetosaveSyriasstarvinghundredsintownundersiegebyAssadsmen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300A8BEA00000578-0-image-a-11_1452527737545.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393580_Race-save-hundreds-starving-death-Syrian-town-siege-Assad-s-men-convoy-negotiate-battlefields-bring-food-families-forced-eat-pets-grass_1540253593.html","title":"Race to save Syria's starving hundreds in town under siege by Assad's men","title_page":"Race to save Syria's starving hundreds in town under siege by Assad's men | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three trucks equipped with food and medicine reached the town today\nA United Nations aid convoy has negotiated battlefields to bring food to starving families in a Syrian town under siege by President Assad's men.\nThe UN confirmed it had received 'credible reports' of people starving to death in Madaya which has been surrounded by regime troops for six months.\nAttempts to reach the community of 40,000 were delayed at the last minute yesterday - but at least three trucks equipped with food and medicine have this afternoon reached the town.\nA United Nations aid convoy will have to negotiate battlefields to save hundreds from starving to death in Madaya. The convoy is pictured setting off from Damascus this morning\nAn image supplied by activists shows a young child in the Syrian town of Madaya. The mountain border town has been besieged since early July and 23 people are thought to have starved to death\nSyrians gathered en masse as they awaited the arrival of an aid convoy in the besieged town of Madaya\nMore than 40 trucks operated by the International Committee of the Red Cross, the Syrian Red Crescent, the United Nations and World Food Programme left from Damascus to enter Madaya\nMore than 40 trucks operated by the International Committee of the Red Cross, the Syrian Red Crescent, the United Nations and World Food Programme left from Damascus to enter Madaya, where more than two dozen people are reported to have starved to death.\nIt comes amid reports some starving residents have resorted to eating pets and grass to stay alive.\nConvoys this afternoon arrived to the outskirts of the town near the Lebanese border with enough supplies to last for a month, as another convoy headed to two besieged villages in northern Syria.\nA group of residents gathered at the main entrance to Madaya, hoping to receive desperately needed food and medicine.\nChecks: A rebel fighter inspects Red Crescent vehicles on their way to Foua and Kefraya, in Idlib province\nConvoys this afternoon arrived to the outskirts of the rebel-held town near the Lebanese border\nA similar convoy reached the outskirts of the Shiite villages of Foua and Kfarya in Idlib province, both under siege by rebels seeking to oust President Bashar Assad.\nHezbollah, which is fighting in Syria alongside Assad's forces, reported on its Al-Manar television channel that 40 trucks were expected to enter the northern villages, with another 40 headed to Madaya.\nAid groups trying to reach the besieged town, near the capital Damascus, will have to negotiate at the highest level with both sides of the conflict before securing safe passage through battlefields.\nDeliveries to Madaya and to Fuaa and Kafraya which are encircled by rebels in Idlib province had been expected yesterday.\nBut the Red Cross said last night that the much-needed supplies cannot be delivered before today due to logistical problems.\nThe Red Cross said last night that the much-needed supplies cannot be delivered before today due to logistical problems\nAttempts to reach the town of 40,000 were delayed at the last minute yesterday - but there are fresh hopes the UN convoy (pictured) will reach its destination today\nAid convoys carrying food, medicine and blankets, leave the Syrian capital Damascus as they head to the besieged town of Madaya\nEmaciated Syrians besieged by President Assad's forces have made desperate pleas for food and water as more than 40,000 people face starvation. Videos posted by activists, which cannot be independently verified, show a painfully thin young boy (left) who said he hadn't eaten for a week and a baby crying in pain (right)\nThis picture posted by an activist on Twitter purportedly shows a cat about to be slaughtered for food by a starving Syrian in Madaya. However, MailOnline has not yet been able to verify the image which may simply have been used for illustration purposes by those highlighting the plight of Syrians caught up in the conflict\n'The distribution of aid will not take place on Sunday for logistical reasons; we are working hard for it to take place on Monday,' said Pawel Krzysiek, spokesman in Damascus of the International Committee of the Red Cross.\nTamam Mehrez of the Syrian Red Crescent had said 'technically we are ready to begin distribution as early as Sunday, but if there are logistical issues it will be Monday at the latest'.\nThe Syrian government agreed on Thursday to allow aid into Madaya as part of a deal that will see aid simultaneously reach 20,000 people trapped in Fuaa and Kafraya.\nAccording to Doctors Without Borders, at least 23 people have starved to death since December 1 in Madaya.\nThe UN Security Council is to discuss the matter behind closed doors on Monday, although no decision is expected.\nDesperate measures: Syrian children eat from a pan of boiled leaves and grass in Madaya\nA picture purportedly shows a Syrian man scavenging for food in a pile of rubbish in the town of Madaya which has been under siege by President Bashar Al Assad's forces since July\nStarving Syrians trapped in the besieged towns of Madaya, Kfarya and Foua are being forced to eat cats and dogs and have surgery without anesthetic after vital supplies were cut off, activists have warned\nMore than 260,000 people have been killed since the Syrian conflict erupted in March 2011 and millions have been forced from their homes but a solution to end the bloodshed has been hard to nail.\nThe UN envoy has been on a regional tour to shore up support for peace talks due to take place in Geneva on January 25 between the Syrian government and its opponents.\nThe talks are the first step in an ambitious 18-month plan, endorsed by the UN, to bring about a political transition in Syria.\nAfter talks in Riyadh this week, De Mistura met Muallem in Damascus on Saturday and is next planning on visiting Tehran.\nDe Mistura's office said the envoy had a 'useful' meeting with the Syrian foreign minister.","url":"https://www.dailymail.co.uk/news/article-3393580/Race-save-hundreds-starving-death-Syrian-town-siege-Assad-s-men-convoy-negotiate-battlefields-bring-food-families-forced-eat-pets-grass.html"}
