{"authors":["John Nolte"],"date_download":"2018-10-30 21:48:30","date_modify":"2018-10-30 21:48:30","date_publish":"2015-01-17 15:39:07","description":"Despite an also-ran Best Picture Oscar nomination and a ton of publicity surrounding all the anti-science crybabying over \"Selma's\" overall  Oscar snub, |","filename":"data/vaneerConsumption/RaceHoaxBacklashSelmaWorstBoxOfficePerformerofEveryBestPicNom.json","image_url":"https://media.breitbart.com/media/2015/01/Selma-David-Oyelowo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_01_17__1540936110.html","title":"Race-Hoax Backlash: 'Selma' Worst Box Office Performer of Every Best Pic Nom","title_page":"Race-Hoax Backlash: 'Selma' Worst Box Office Performer of Every Best Pic Nom | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Despite an also-ran Best Picture Oscar nomination and a ton of publicity surrounding all the anti-science crybabying over “Selma’s” overall Oscar snub, the dishonest Civil Rights drama stood alone in its box office free fall. Every other film nominated for Best Picture that is still in theatres out-performed “Selma,” in most cases by a humiliating margin.\nAccording to Deadline, “Whiplash” added +120 theatres and is up +145% at the box office this weekend; “The Theory of Everything” added +101 theatres and is up +41%; “Birdman” added +243 theatres and is up +141%.\n“The Imitation Game” added +45 theatres and lost only -11% over last weekend’s box office. But it’s also been in a fairly wide release for more than a month.\nThe patriotic, pro-War On Terror “American Sniper” took in more money in one day — Friday — than “Selma” has in 10 days.\n“Selma” is only in its second weekend of wide release. Regardless, despite a Best Pic nom, all that anti-science crybabying, an additional +56 screens, and this being no less than the Martin Luther King, Jr. holiday weekend, Oprah Winfrey’s Civil Rights drama lost -19% of its audience over last weekend.\n“Selma” is not only the victim of its own lack of greatness but an America tired of race hoaxes. After the Trayvon Martin and Michael Brown race-hoaxes, after Oprah’s own Swiss purse race-hoax and her dishonest Civil Rights drama “The Butler,” the country is exhausted from being lied to about race — and “Selma” lies about race.\nADDED: If you want to honor the great Dr. King this weekend, this is about as good as it gets. If you want to see two outright masterpiece’s that really were snubbed by Oscar, watch Spike Lee’s “Do The Right Thing” and “Malcolm X” — two of the greatest movies ever made. Period.\nJohn Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/01/17/race-hoax-backlash-selma-worst-box-office-performer-of-every-best-pic-nom/"}
