{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:35:02","date_modify":"2018-10-30 20:35:02","date_publish":"2016-07-10 21:12:32","description":"The lawyer for the Minnesota police officer involved in the shooting of a black man says the shooting had nothing to do with race, the presence of a gun did.","filename":"data/vaneerConsumption/RaceHadNothingtoDowithMinnesotaShootingSaysCopsLawyer.json","image_url":"https://media.breitbart.com/media/2015/12/police-crime-scene-tape.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_07_10__1540931702.html","title":"Race Had Nothing to Do with Minnesota Shooting, Says Cop’s Lawyer","title_page":"Race Had Nothing to Do with Minnesota Shooting, Says Cop’s Lawyer","title_rss":"NULL","source_domain":"breitbart.com","text":"The Minnesota police officer who shot and killed a black man after a traffic stop had nothing to do with race, the presence of a gun did, says the lawyer for the officer involved in the shooting.\nThe situation went viral and racial tensions have been inflamed by a video produced by the dead man’s girlfriend. Diamond Reynolds live streamed her bloody slumped-over boyfriend, Philando Castile (32), as he lay dying in the car.\nDuring the live stream, the girlfriend said the “police just shot my boyfriend for no apparent reason,” as reported by Breitbart News. She was also talking to the officer and told him, “You shot four bullets into him, Sir. He was just getting his license and registration, Sir.” She also said they were pulled over for a busted taillight.\nHer statements in the video were designed to strongly indicate that Castile was simply reaching for his identification in his pocket as instructed by the officer, and that he had told the officer that he had a firearm and was a concealed handgun license holder. The video is embedded in the Breitbart article.\nCastile’s mother, Valerie Castile, reportedly told CNN, “I think he was just black in the wrong place.”\nAs can be heard in the video, the officer told the girlfriend, “I told him not to reach for it. I told him to get his hand off of it.” This occurs at the 40-second mark in the video.\nFox 9 reported that there had been a “recent convenience store robbery” and that media and blog reports were comparing photos of Castile and surveillance images at the store. The Minnesota lawyer told the local Fox affiliate that “I can’t comment on that.” “But I can tell you that the stop of the vehicle for an equipment violation was not the only reason for the stop.”\nMinnesota Governor Mark Dayton asked at a press conference after the shooting, “Would this have happened if the driver and passenger were white?” He answered his own question saying, “I don’t think it would have” reported Fox 9 News in Minneapolis-St.Paul.\nAnti-cop threats and calls for violence on social media were massive after the police-involved shooting of Alton Sterling. And, as reported by Breitbart News, Twitter took no action as calls for cop-killing swept the social media platform. Breitbart’s Lee Stranahan also reported how the Institutional Left and Black Lives Matter movement, manipulate the rhetoric after a police shooting.\nThe fatal shooting on Wednesday night preceded the execution of five police officers in Dallas, Texas, on Thursday night. A sniper killed them and wounded six others in the horrific melee. Breitbart Texas reported that the suspected executioner was a member of the Houston New Black Panther Party.\nBreitbart Texas spoke with the attorney of the Minnesota police officer, Officer Jeronimo Yanez, who said he is unable to say more until an investigation into the shooting is concluded. Reuters reported on Saturday that his lawyer said, “This incident had nothing to do with the race of the driver.” He added, “It had everything to do with the presence of a gun.”\nAttorney Thomas Kelly said he is “rather restricted” until the Saint Antony Police Department, Officer’s Yanez’ employer, and the Minnesota Bureau of Crime Apprehension sign off on the investigation. He said these entities want to have control of the investigation.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2016/07/10/race-nothing-minnesota-cop-shooting-says-cops-lawyer/"}
