{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:13:03","date_modify":"2018-10-23 01:13:03","date_publish":"2016-01-28 15:24:23","description":"The television personality was centre stage in Trafalgar Square on Thursday for the unveiling of a fifth lion statue, sculpted from clock parts as part of a campaign for Big Cat Week.","filename":"data/vaneerConsumption/RachelRileyshowcasesherhourglassshapeinascarletbodycondress.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAF17700000578-0-image-a-93_1453992519743.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421039_Rachel-Riley-showcases-hourglass-shape-steps-comfort-zone-scarlet-bodycon-dress_1540257183.html","title":"Rachel Riley showcases her hourglass shape in a scarlet bodycon dress","title_page":"Rachel Riley showcases her hourglass shape in a scarlet bodycon dress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"On daytime TV, she's partial to a classic, demure dress.\nBut Countdown's Rachel Riley was dressed in a more daring fashion on Thursday, allowing her enviable curves to be on display.\nThe television personality was centre stage in Trafalgar Square that afternoon for the unveiling of a fifth lion statue, sculpted from clock parts.\nScroll down for video\nRacy in red: Rachel Riley looked gorgeous in red as she promoted a TV show in London's Trafalgar Square on Thursday\nIn spite of the cold, Rachel whipped off her ivy-coloured coat to reveal a skintight minidress; cleverly teamed with sugar-sweet heels.\nThe star swept her hair into an up-do, parted far on the left side, and teased out some soft strands loose to frame her face.\nRachel squeezed her curves into the ribbed, semi-sheer number, shooting a glimpse at her pert behind as she turned to the new London statue.\nRacy in rouge: The blonde was squeezing her curves into a particularly figure-hugging number\nRachel was lend star power to Nat Geo WILD's unveiling of a fifth temporary lion statue, ahead of their TV series Big Cat Week, which airs from February 1-7, 2016.\nThe numbers girl, famed for her mathematical mind, has kicked off 2016 with a vow to expand her vocabulary too, this time in Russian.\nSpeaking to Daily Mail, Rachel said: 'I've been learning Russian since March and I love it. It's a mathematical language, so it's fairly easy once you've cracked the grammatical rules.'\nLending her supported: Charitable Rachel was helping to raise awareness of the extinction of big cats\nThe TV mathematician met now-boyfriend Pasha Kovalev on Strictly Come Dancing when she was partnered up with the Russian professional dancer in 2013.\nDespite their strong commitment, the duo are not said to be planning any 'mini-cloning' at this time and are just enjoying each other's company.\nHe told OK! magazine last October: 'There are no plans for mini-cloning right now! With Rachel, we are having a good time.\n'We are quite serious about one another, but we’re not planning on kids yet. We’re not in that direction. We’re just enjoying each other.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421039/Rachel-Riley-showcases-hourglass-shape-steps-comfort-zone-scarlet-bodycon-dress.html"}
