{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-23 02:42:23","date_modify":"2018-10-23 02:42:23","date_publish":"2016-01-11 15:13:53","description":"She sent the rumour mill into overdrive last week after she was spotted with a glittering ring on her wedding finger.","filename":"data/vaneerConsumption/RachaelTaylorsdiamondringisnowheretobeseenatGoldenGlobesafterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B005500000578-0-image-a-15_1452522792800.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393997_Rachael-Taylor-s-diamond-sparkler-seen-attends-Golden-Globes-party-sparking-engagement-rumours_1540262543.html","title":"Rachael Taylor's diamond ring is nowhere to be seen at Golden Globes after-party","title_page":"Rachael Taylor's diamond ring is nowhere to be seen at Golden Globes after-party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She sent the rumour mill into overdrive last week after she was spotted with a glittering ring ensconced on her wedding finger.\nBut Rachael Taylor, 31, threw a spanner in the works by stepping out ring-free at the 2016 Golden Globe Awards after party in California on Monday.\nDressed in a satin top and trousers by designer Josie Natori, the actress Rachael posed with her left hand placed firmly on her hip, unabashedly displaying her naked wedding finger.\nDisappearing act! Rachael Taylor, 31, was spotted without her rumoured engagement ring as she attended the 2016 Weinstein Company and Netflix Golden Globe Awards after party in California on Monday\nThe Australian native completed her sleek outfit with a small envelope clutch bag, a pair of patent black pumps and a dark coloured ring worn on her left pinkie finger.\nHer flaxen locks were swept up into a voluminous high pony-tail, revealing her naturally-sculpted cheekbones and glowing complexion.\nRachel was joined on the red carpet by her Jessica Jones co-star, Krysten Ritter, 34, who played up her dark features with a fire engine-red gown and a slick of ruby lipstick.\nSee all the latest news from the Golden Globes 2016 with more red carpet pictures\nVa va voom! Rachel was joined on the red carpet by her Jessica Jones co-star, Krysten Ritter, 34, who played up her dark features with a fire engine-red gown and a slick of ruby lipstick\nThe pair, who play best friends on the show, displayed their real-life friendship as they cosied up while posing side-by-side with their arms wrapped around each other.\nIt comes after Rachael was spotted wearing a diamond ring on her wedding finger at last Saturday's Netflix pre-Golden Globes event in Los Angeles.\nThe actress, who has been dating her photographer boyfriend Mike Piscitelli for two years, beamed and proudly displayed her rock while posing with Krysten for photographs .\nIn good company: The pair, who play best friends on the show, displayed their real-life friendship as they cosied up while posing side-by-side with their arms wrapped around each other\nA secret engagement? It comes after Rachael was spotted wearing a diamond ring on her wedding finger at last Saturday's Netflix pre-Golden Globes event in Los Angeles\nRachael had recently spent New Year's Eve with her beau by watching the sunrise together in the park, with Mike later sharing a photo of the romantic moment on Instagram.\nCaptioning the image, in which Rachael can be seen staring out towards the rising sun, he wrote: 'Good morning 2016.'\nThe pair have been an item for two years, with Rachael previously describing him as one of the things she is 'most proud of'.\nHis muse: Rachael's boyfriend Mike Piscitelli regularly posts candid pictures of her on his Instagram feed\nGushing: The actress recently described her boyfriend as one of the things she is 'most proud of'\nThroughout their relationship she has kept the details very quiet and only confirmed that she was dating him when she spoke to Daily Life in November.\n'It's one of the things I'm most proud of, my relationship with him,' she told Daily Life in November.\nHinting that an engagement could be imminent, she added: 'This is the best time of my life at the moment.\n'This is the most comfy I've felt in my skin, and the happiest I've been. I'd love to experience being a mother.'\nHappy news? Just four weeks ago Rachel hid her left hand while snapping a selfie at work","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393997/Rachael-Taylor-s-diamond-sparkler-seen-attends-Golden-Globes-party-sparking-engagement-rumours.html"}
