{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 23:51:06","date_modify":"2018-10-22 23:51:06","date_publish":"2016-01-28 13:05:43","description":"The trio were spotted rubbing shoulders and enjoying some relaxation at the Blackmores Wellbeing Oasis, before Tim and Anna sat court side to watch a match.","filename":"data/vaneerConsumption/RachaelFinchjoinsTimRobardsandAnnaHeinrichattheAustralianOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAEC7C00000578-0-image-a-4_1453991215315.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420549_Rachael-Finch-joins-Tim-Robards-Anna-Heinrich-Australian-Open-spot-pampering-couple-sit-separated-match_1540252266.html","title":"Rachael Finch joins Tim Robards and Anna Heinrich at the Australian Open","title_page":"Rachael Finch joins Tim Robards and Anna Heinrich at the Australian Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Model and TV presenter Rachael Finch has spent time recently broadcasting from the Australian Open.\nSo she no doubt showed Bachelor couple Tim Robards and Anna Heinrich the ropes around the court, with the pair joining her down in Melbourne for the tennis event on Thursday.\nThe trio were spotted rubbing shoulders and enjoying some relaxation at the Blackmores Wellbeing Oasis, before Tim and Anna sat court side to watch a match.\nScroll down for video\nCatching up: Rachael Finch (L) and Bachelor couple Tim Robards and Anna Heinrich enjoyed meeting up at the Blackmores Wellbeing Oasis at the Australian Open in Melbourne on Thursday\nIt seems all three personalities got the dress memo, all stepping out in white tops.\nRachael wore a polo T-shirt and three-quarter trousers, while Tim looked smart in jeans and a shirt.\nAnna meanwhile wore black leather pants with her flowing strapless top, with a matching material choker.\nSee more of the latest news and updates from the 2016 Australian Open\nCouples that dress alike! Both Tim and Anna wore white tops for the day and were colour coordinated\nOn duty: Rachael has been presenting from the Australian Open and on the day sported a polo T-shirt and three-quarter trousers with runners\nLooking fresh, the trio enjoyed time with Blackmores where massages and refreshments were on offer.\nAnna and Tim - who rose to fame on the reality dating show The Bachelor - appeared to be having fun as they mucked around with large tennis balls.\nTim at one point was seen with headphones on sitting as a masseuse worked on his shoulders, and he looked like he was meditating.\nThe duo - who are based in Sydney - also shared pictures online from the Oasis, with Anna captioning one picture 'having a ball.'\nFitness buff Tim also shared a picture online of himself lifting his girl into the air as she holds a weight, and looked to struggle lifting her.\nLoving it: Anna and Tim - who rose to fame on the reality dating show The Bachelor - appeared to be having fun as they mucked around with large tennis balls\nKeeping refreshed: Massages and refreshments were on offer at the Blackmores Oasis\nAll zen! Tim at one point was seen with headphones on sitting as a masseuse worked on his shoulders, and he looked like he was meditating\nSweet: The duo - who are based in Sydney - also shared pictures online from the Oasis, with Anna captioning one picture 'having a ball'\nWorking those muscles: Fitness buff Tim also shared a picture online of himself lifting his girl into the air as she holds a weight, and looked to struggle lifting her\nJoining them in the Oasis was also a glowing Dr Joanna Mcmillan, who is a popular nutritionist and dietitian.\nDr Joanna showed off her trim figure in a printed play suit.\nAt one point of the day, she got into the spirit of tennis and happily walked around with a racket.\nFamiliar face: Joining them in the Oasis was also a glowing Dr Joanna McMillan, who is a popular nutritionist and dietitian\nGirl time! Anna also met up with her sister Andrea Heinrich on the day\nTim, Anna and Dr Joanna were later spotted sitting in the crowd court side as they watched the showdown between American star player Serena Williams and polish player Agnieszka Radwanksa, which Serena won.\nTim and Anna however were seated apart, with Dr Joanna and another woman sitting between them.\nWhether they were impressed or not about being separated, the pair put on happy faces and kept conversation going between the group.\nFor the match, Anna wore a black leather jacket to keep her bare shoulders warm.\nThe couple have previously expressed their excitement at heading to the Australian Open, with Tim recently writing online: 'Can't wait to get down to Melbs for the #AusOpen this week (sic),' in part of his post.\nReady to go! Tim, Anna and Dr Joanna were later spotted sitting in the crowd court side as they watched the showdown between American star player Serena Williams and polish player Agnieszka Radwanksa\nSeparated: Tim and Anna however spectated seats apart, with Dr Joanna and another woman sitting between them\nKeeping amused: Tim and Dr Joanna chatted as they watched the match","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420549/Rachael-Finch-joins-Tim-Robards-Anna-Heinrich-Australian-Open-spot-pampering-couple-sit-separated-match.html"}
