{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:29:38","date_modify":"2018-10-23 00:29:38","date_publish":"2017-03-10 07:07:56","description":"While there is no set premiere date yet or information released about their roles, the actresses did reveal hints about their characters on social media.","filename":"data/vaneerConsumption/RachelBilsonandKaitlinDoubledaytojoinNashville.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E206B6100000578-0-image-a-38_1489127412406.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300068_Rachel-Bilson-Kaitlin-Doubleday-join-Nashville_1540254578.html","title":"Rachel Bilson and Kaitlin Doubleday to join Nashville","title_page":"Rachel Bilson and Kaitlin Doubleday to join Nashville | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rachel Bilson is heading down south... again.\nBut this time, the O.C. alum is packing her bags to Tennessee as television series Nashville will see her in a major role for the second half of season five.\nJoining the 35-year-old actress is Kaitlin Doubleday, 32, who will be jumping from hip-hop drama Empire into the country music scene.\nScroll down for video\nWelcome to Nashville! Rachel Bilson and Kaitlin Doubleday join the second half of season five of the CMT series, announced Thursday\nThis announcement comes right after the mid-season finale aired on Thursday.\nIn a press release, executive producer and showrunner Marshall Herskovitz stated: 'We welcome Rachel and Kaitlin into our incredibly talented ensemble. We fondly anticipate the second half of the season filled with surprising twists and turns that make Nashville so beloved by the fans.'\nWhile there is no set premiere date yet or information released about their roles, the actresses did reveal hints about their characters on social media.\n'Highway 65': While very little information has been released about their roles, the stars dropped hints on social media; the 35-year-old actress shared a shot of Highway 65 to her Instagram revealing she will be in the music scene\nIconic: The 32-year-old beauty shared a shot of the iconic Bluebird Cafe to her Instagram\nThe former Hart Of Dixie star shared a photo to her Instagram of the record label, Highway 65, suggesting she'll play an integral part in the music scene.\nThe Catch Me If You Can star also posted an image to her social media account of the iconic Bluebird Cafe.\nAccording to Variety, a source revealed Rachel will be a recurring role playing a character named Alyssa.\nWay back when: This is Rachel's first major role on television after a long run on The O.C. and Harts of Dixie since 2015\nMoving on: Kaitlin will also make a jump from the hip-hop scene on Empire to the country music scene\nThe brunette beauty will also have a mini O.C. reunion with former co-star Chris Carmack who appeared on season one of the drama show.\nThe actor tweeted: 'Can't wait to work with Rachel again... it's been a while! \"Welcome to Nashville....... darlin'!\"'\nRachel and Kaitlin join the hit CMT show after Connie Britton's character, Rayna James, was killed off the show earlier this season.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300068/Rachel-Bilson-Kaitlin-Doubleday-join-Nashville.html"}
