{"authors":["Julia Sidwell For Mailonline"],"date_download":"2018-10-23 02:49:51","date_modify":"2018-10-23 02:49:51","date_publish":"2016-01-29 17:27:35","description":"Rachel Evans, 45, from South East London, said overhauling her image – including having contoured cheekbones, her jaw-line lifted and botox in her forehead – has made her happier.","filename":"data/vaneerConsumption/RachelEvansspends20000oncosmeticsurgeryandfillerstolooklikeBarbie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4568800000578-0-image-a-30_1454087225451.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422957_Single-mother-45-spends-20K-cosmetic-surgery-fillers-look-like-Barbie-lookout-Ken-toy-boy-six-pack_1540262991.html","title":"Rachel Evans spends £20,000 on cosmetic surgery and fillers to look like Barbie","title_page":"Rachel Evans spends £20,000 on cosmetic surgery and fillers to look like Barbie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman has revealed how she has spent £20,000 on cosmetic surgery and treatments on her face because she likes Barbie’s ‘frozen look’ – and has no plans to stop.\nRachel Evans, 45, from South East London, said overhauling her image – including having contoured cheekbones, her jaw-line lifted and botox in her forehead – has made her happier, and she's now on the lookout for a toy boy.\nThe blonde mother-of-one, who looks drastically different to her Gothic, black-hair persona 15 years ago, said she got ‘hooked’ from the first filler – and even goes to the gym five days a week to get the body to match.\nScroll down for video\nRachel Evans, 45, claims she is addicted to Botox and fillers and will do whatever it takes to look like Barbie\nRachel, who has also had a boob job, has also started her own business – Make Over Essex – to help women achieve the body they want\nRachel, who has also had a boob job, has also started her own business – makeoveressex.com – to help women achieve the body they want.\nShe went from a 32AA to a 32D aged 38 after she started weight training and wanted her body to be more 'in proportion'. The procedure cost £5,500 but her ex boyfriend paid half as a birthday gift.\nShe said: ‘I am completely addicted to Botox and love re-designing my face. The older I get the younger I want to look.\n‘I’ve spent £20,000 on my face so far and have no plans to stop - I’ll still be getting Botox when I’m 80!'\nRachel first started redesigning her face after she suffered depression, following the loss of her son’s identical twin brother at birth and her relationship with her partner was coming to an end.\nShe has since had fillers on her cheeks to make them plumper, a lifted jaw line, treatment to have a less angular face sharp, her crow's feet erased and under-eye bags minimised. She estimates the total cost at £20,000.\nShe said: ‘I was 30 and one of my sons was stillborn.\n‘My other son Rees only survived after being taken to intensive care and having a blood transfusion in the first week of his life. After that traumatic time, I was a broken woman and it showed.’\nRachel began suffering with anorexia, weighing just seven stone. She was so unhappy that she could barely even look at her own reflection.\nRachel, in darker days, before she found her 'true self'. She preferred the blonde look, which began a journey\nTragedy and heartbreak prompted Rachel, from South East London to make a change. The mum suffered depression, following the loss of her son's twin brother at birth and the relationship with his father ending\n‘When I looked in the mirror all I saw was death,' she said.\n'My face was gaunt and I was in denial that I had an eating disorder. I wanted rid of my black Gothic hair so I decided to cut it off and bleach it.\n‘But then the rest of it started falling out in clumps. I hated it and wouldn't go out socially for a year until my hair was bleached blonde Marilyn Monroe style.’\nIt was only then that Rachel said she felt her true self emerging. She preferred her blonde locks and it started a journey into wanting to look like Barbie.\n‘Because I was skinny, some people called me Barbie,’ Rachel said.\n‘So I decided to embrace it, knowing it would make me a happier person inside and out.’\nRachel, a fitness journalist, started working out in the gym five days a week to achieve the toned and sculpted body she desired.\nRachel then went under the knife to have breast implants and became a successful bikini athlete.\nRachel has spent £20k on redesigning her face, having fillers and Botox, and claims she and will continue until she’s an OAP. She said: I came to like the \"frozen look\" because I didn't want my face to show sadness anymore'\nBecause she was skinny, some people called Rachel Barbie, which she says made her feel happy. She then decided to embrace the look fully, knowing it would make her a happier person 'inside and out'\n‘Soon I had the body of my dreams but I needed the face to match,’ she said.\n‘That’s when I started with Botox - to erase my crow's feet and the lines on my forehead.\n‘From the second the needle went in, I was hooked. It was like ironing out a shirt to erase the creases. After that I noticed other wrinkles I hadn’t noticed before, so I got more and more done.’\nI gradually increased the face treatments and started having fillers in my cheeks and lips. By my early 40s I was having non-surgical facelifts on top of all the other treatments to maintain my youthful look\n‘I came to like the “frozen look” because I didn’t want my face to show sadness anymore. I even had the corners of my mouth lines turned upwards so I didn’t look unhappy.\n‘I gradually increased the face treatments and started having fillers in my cheeks and lips. By my early 40s I was having non-surgical facelifts on top of all the other treatments to maintain my youthful look.’\nFinally, looking like Barbie, Rachel was pleased that her new face matched her newfound, positive personality. But there was still something missing from her life - a partner.\n‘My son Rees, 15, has always comes first in my life,’ Rachel said.\n‘But now I'm on the lookout for love. I get asked on dates by 20-something men all the time. I enjoy the attention of men half my age who are as fit as me – with their amazing bodies and ripped six-packs.\nRachel, a fitness journalist, started working out in the gym five days a week to achieve the toned and sculpted body she desired. Rachel then went under the knife to have breast implants, right, and became a bikini athlete\nThe single mum, left before the surgery, says the older she gets the younger she wants to look, right, now\nWORK DONE ON RACHEL'S FACE: Botox £10,000 Cheek fillers £3,500 Lip fillers £3,000 Under eye bags £1,250 PDO Threadlift £3,000 Total cost = £20,750\n‘They seem to like my youthful body and my mature but fun nature. In fact, younger guys appreciate me more than men my own age.\n‘I think men in their 40s act too much like “old men”,’ she said.\n‘They stay in their boring comfort zones and have little or no energy. I think some of them can't handle a woman who looks after herself – they have told me they feel threatened seeing me get attention from younger men. So I’ve decided it’s definitely a toy boy I want.’\nFor now, Rachel is single and keeping her options open. She goes on nights out with her friends and has been on countless dates.\n‘I joke to my friends that “Barbie is on the love-lookout for Ken”,’ she said.\n‘I spend so much money, time and effort on how I look, why would I waste my time with a man my own age who doesn't look after himself?’\nBy transforming herself, Rachel says her depression has been replaced with happiness and self-esteem. Something she couldn’t have done without overhauling her image.\n‘These days I wake up with fresh, glowing wrinkle-free skin and I love it,’ she said. ‘I've had many life hurdles which have aged me but now I’ve managed to turn back time.\n‘My Barbie alter ego feels completely authentic to me. Some people might think because I look fake that I am fake as a person. But my friends know I have brains, so it doesn't bother me one bit.\n‘Now I’m spreading good vibes and never want to go back to the old me. I ‘buried’ that dark gothic sad person a long time ago. It’s like I’ve been re-born - from darkness to light.’","url":"https://www.dailymail.co.uk/femail/article-3422957/Single-mother-45-spends-20K-cosmetic-surgery-fillers-look-like-Barbie-lookout-Ken-toy-boy-six-pack.html"}
