{"authors":["Associated Press"],"date_download":"2018-10-23 02:29:29","date_modify":"2018-10-23 02:29:29","date_publish":"2017-03-10 11:38:32","description":"Racing 92 president Jacky Lorenzetti says former All Blacks lock Ali Williams will be fired by the Top 14 club following his arrest for buying cocaine.","filename":"data/vaneerConsumption/Racing92tofireAllBlackWilliamsovercocainearrest.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E21D8ED00000578-0-image-a-75_1489145656342.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-4300962_Racing-92-fire-Black-Williams-cocaine-arrest_1540261769.html","title":"Racing 92 to fire All Black Williams over cocaine arrest","title_page":"Racing 92 to fire All Black Williams over cocaine arrest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Racing 92 president Jacky Lorenzetti says former All Blacks lock Ali Williams will be fired by the Top 14 club following his arrest for buying cocaine.\nLorenzetti told Midi Olympique magazine that 'unfortunately, Ali Williams will soon be dismissed.'\nWilliams and former Wallabies back James O'Connor were arrested last month outside a Paris nightclub.\nFormer All Black star Ali Williams will be fired by Racing 92 after 'attempting to buy cocaine'\nRacing 92 president Jacky Lorenzetti will dismiss the 2011 World Cup winner over the incident\nParis prosecutors confirmed Williams was arrested near the Champs Elysees last month\nO'Connor was fined for cocaine use by the Paris prosecutor's office while Williams will face a hearing with the prosecutor for buying the equivalent of 2.4 grams of the drug.\nRacing 92 had already suspended the 2011 World Cup winner as a precautionary measure and apologized to fans for the incident.\nLorenzetti added that Williams, who will appear before a French rugby disciplinary hearing this month, tested negative for cocaine after his arrest.\nO'Connor, 26, the former Australia and London Irish star who plays for Toulon, has had a string of disciplinary problems during a chequered career, including once being suspended indefinitely by the Wallabies after being refused permission to board a flight to Bali from Perth.\nThe arrests came days after Racing's Dan Carter, another former All Black, apologised for 'a massive error of judgment' after allegedly failing a drink-driving test in France.\nWilliams and former Australia international James O'Connor were detained by Paris police\nThe pair were arrested outside a nightclub at Place Charles de Gaulle, by the Champs-Elysees\nJAMES O'CONNOR'S CAREER HISTORY Force: 2008-11- Rebels: 2012-13 London Irish: 2013-14 Reds: 2015 Toulon: 2015- Australia: 2008- (44 caps) HONOURS N/A","url":"https://www.dailymail.co.uk/sport/sportsnews/article-4300962/Racing-92-fire-Black-Williams-cocaine-arrest.html"}
