{"authors":[],"date_download":"2018-10-23 01:28:33","date_modify":"2018-10-23 01:28:33","date_publish":"2017-03-10 09:48:09","description":"France's Racing 92 club will fire former All Black lock Ali Williams, who was arrested in Paris last month in possession of cocaine, the Top 14 champions...","filename":"data/vaneerConsumption/Racing92tofireexAllBlackWilliamsovercocainebust.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195141-1489139291-738_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300574_Racing-92-fire-ex-All-Black-Williams-cocaine-bust_1540258113.html","title":"Racing 92 to fire ex-All Black Williams over cocaine bust","title_page":"Racing 92 to fire ex-All Black Williams over cocaine bust | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ali Williams, pictured in 2013, was arrested outside a Paris nightclub on February 25 in possession of 2.4 grams (0.08 ounces) of cocaine\nFrance's Racing 92 club will fire former All Black lock Ali Williams, who was arrested in Paris last month in possession of cocaine, the Top 14 champions said Friday.\n\"Unfortunately, Ali Williams will soon be dismissed,\" the club's president, Jacky Lorenzetti, told the Midi Olympique newspaper published Friday. The club confirmed the information to AFP.\n\"But that will not stop us from listening to him and giving him a hand outside of rugby. Personally, I just advised him to take some time out,\" Lorenzetti added.\nFrench police last month charged Williams with buying cocaine and Toulon's Australian international James O'Connor with possession of the drug.\nThe pair were arrested outside a nightclub near the Champs Elysees in possession of 2.4 grammes (0.08 ounces) of cocaine on February 25.\nBoth were suspended by their clubs.\nWilliams, 35, a World Cup winner with New Zealand in 2011, was also stripped of his ambassadorial role for Racing 92 last week.\nHe was taken on by Racing at the end of 2015 in a public relations role for Lorenzetti's wine company and as a media adviser to star fly-half Dan Carter.\nWilliams \"returned a negative test for coke,\" said Lorenzetti, contrary to O'Connor. \"I'm not saying that he's not a consumer.\nBut I saw him Monday and he was devastated. His life has dramatically shifted. Ali had a boulevard, even a highway ahead of him. He could have done great things at the New Zealand federation or elsewhere.\"\nThe two Top 14 stars will appear before a disciplinary commission of the French National Rugby League on March 29.","url":"https://www.dailymail.co.uk/wires/afp/article-4300574/Racing-92-fire-ex-All-Black-Williams-cocaine-bust.html"}
