{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:13:24","date_modify":"2018-10-30 21:13:24","date_publish":"2015-01-26 01:41:50","description":"Columnist Charles M. Blow is \"fuming\" over the fact that his black son was stopped and questioned by police on Saturday as they searched for a black robbery suspect.","filename":"data/vaneerConsumption/RacismChargesFlyAfterPoliceStopBlackYaleStudentDuringSearchforBlackRobber.json","image_url":"https://media.breitbart.com/media/2014/12/Screen-Shot-2014-12-29-at-8.51.40-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_25__1540934004.html","title":"Racism Charges Fly After Police Stop Black Yale Student During Search for Black Robber","title_page":"Racism Charges Fly After Police Stop Black Yale Student During Search for Black Robber","title_rss":"NULL","source_domain":"breitbart.com","text":"New York Times columnist Charles M. Blow is “fuming” over the fact that his black son was stopped and questioned by police on Saturday as they searched for a black robbery suspect.\nBlow’s son is student at Yale and was stopped by Yale police.\nAccording to the New Haven Independent, police received a call about a possible robbery in Trumball College by “a tall, African-American, college-aged student wearing a black jacket and a red and white hat.” While responding to the call they came across Blow’s son, drew their guns and “briefly detained” him for questioning. He was released when they determined not the suspect they were pursuing.\nYale police caught and arrested the black robbery suspect “shortly thereafter.”\nBlow responded his son being stopped by tweeting: “So, my son, a 3rd year Chem major at Yale was just accosted–at GUN POINT–by a Yale policeman [because] he ‘fit the description’ of a suspect.”He added: “This is exactly why I have no patience for [people] trying to convince me that the fear these young [black] men feel isn’t real.”\nBlow also tweeted #ICantBreathe and #Blacklivesmatter.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/01/25/racism-charges-fly-after-police-stop-black-yale-student-during-searching-for-black-robber/"}
