{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:27:23","date_modify":"2018-10-30 21:27:23","date_publish":"2016-05-27 07:01:22","description":"New York sports radio talker Mike Francesa is admittedly no fan of the sport of soccer, and he didn't let that disdain temper his criticism of Sports Illustrated for spending too many pages covering soccer's Copa América tournament. | Sports","filename":"data/vaneerConsumption/RadioTalkerMikeFrancesaRipsSportsIllustratedforExtensiveSoccerCoverage.json","image_url":"https://media.breitbart.com/media/2016/05/Mike-Francesa.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_05_27__1540934843.html","title":"Radio Talker Mike Francesa Rips 'Sports Illustrated' for Extensive Soccer Coverage","title_page":"Radio Talker Mike Francesa Rips 'Sports Illustrated' for Extensive Soccer Coverage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New York sports radio talker Mike Francesa is admittedly no fan of the sport of soccer, and he didn’t let that disdain temper his criticism of Sports Illustrated for spending too many pages covering soccer’s Copa América tournament.\nAs he warmed to his rant, Francesa fully admitted that he is no soccer guy.\n“Now, I know I get accused of knowing nothing about soccer, ‘cause I don’t. I know absolutely ZERO about soccer,” he said during his WFAN AM radio show on Wednesday. “And, that’s more than I wanna know about soccer. I have no interest.”\nDespite the admission, though, Francesa slammed SI for devoting eleven pages of its recent issue to the tournament now in its 100th year.\n“Eleven pages on this event,” Francesa exclaimed. “Eleven pages and I can’t find anybody who’s ever heard of it.”\n“Eleven pages! You’ve got to be kidding me! No wonder they can’t give the magazine away. Can’t give it away,” he continued. “This is a magazine from my childhood. This is a magazine that I never, ever didn’t as a kid read from cover to cover.”\nThe May 30 issue covering the tournament features a cover banner proclaiming this the “Summer of Soccer” and spills a lot of ink insisting that Argentinian superstar Lionel Messi will also become a superstar in the U.S.\nBut Francesa slams the venerable sports magazine for the latter contention, as well.\n“Where is he going to emblazon America this summer? Exactly where? Where is he going to, without question, just take over America?” he asked.\nThe sports talker also joked that for years people have been insisting that soccer is almost ready to storm America and become a national craze but it still hasn’t done so. Then he said that no one in mainstream America has ever heard of this tournament that has so enthralled Sports Illustrated.\n“But mainstream America doesn’t even know–if I go out and poll the newsroom right now, no one’s ever heard of this event. My guys in here didn’t even know what it is, nor did I,” he concluded.\nThe talker drew barbs from many for his bombast, though.\nAndrew Bucholtz from Awful Announcing pointedly insisted that Francesa’s proclamations about how much he hates soccer are “reminiscent of someone after a breakup telling us just how little they care about their ex.”\nFor his part, Ryan Glasspiegel noted that his site, The Big Lead, would get plenty of traffic on tournament news.\nIn any case, whether American fans will be interested or not, the Copa América will draw the interest of millions in the rest of the world. The tournament features teams from 16 nations and includes representatives of the Confederation of North, Central America and Caribbean Association Football and the South American Football Confederation.\nGames will be played in 10 cities across the country, including at MetLife Stadium in East Rutherford, New Jersey. The U.S. national team will play Colombia on June 3 at Levi’s Stadium in Santa Clara, California.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/sports/2016/05/27/sports-talker-francesa-rips-sports-illustrated-extensive-soccer-coverage/"}
