{"authors":["Sarkis Zeronian"],"date_download":"2018-10-30 20:41:16","date_modify":"2018-10-30 20:41:16","date_publish":"2015-11-07 13:56:51","description":"A 32-year-old former drug dealer radicalised in prison was arrested for plotting to attack a French Socialist MP as a means to \"serve Islam.\"","filename":"data/vaneerConsumption/RadicalisedExConPlottedToServeIslamWithAttackOnSocialistMP.json","image_url":"https://media.breitbart.com/media/2015/11/France-Politics-Assembly-Seybah-Dagoma-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_07__1540932076.html","title":"Radicalised Ex-Con Plotted To 'Serve Islam' With Attack On Socialist MP","title_page":"Radicalised Ex-Con Plotted To 'Serve Islam' With Attack On Socialist MP","title_rss":"NULL","source_domain":"breitbart.com","text":"A 32-year-old former drug dealer radicalised in prison has been arrested for plotting to attack a French Socialist MP as a means to “serve Islam.”\nThe self-proclaimed Islamic radical was released from prison in February this year. It is understood that he was radicalised during his most recent term of imprisonment as a result of which, he told investigators, he wanted to serve Islam by attacking Seybah Dagoma, the Socialist Party MP for Paris (pictured above).\nIt is not known why the radicalised Islamist wanted to attack Ms Dagoma, reports French newspaper 20 Minutes. The 37-year-old French born MP and lawyer of Chadian descent does not provide an obvious target. She serves on the administrative council of the French Office for the Protection of Refugees and Stateless Persons and had no known links to her potential attacker.\nIt is believed that the arrested man was going to carry out some form of attack on Ms Dagoma during an upcoming meeting the pair had scheduled to discuss a television project. His plan was thwarted because, for reasons as yet unknown, the man who was previously unknown to anti-terror operatives reported himself to the French authorities’ anti-terror hotline — Stop Djihadisme.\nThe man was arrested by authorities earlier this week. He became the first person to have been charged under the ‘terrorist individual enterprise’ law introduced in September last year.\nThe new law targets so-called ‘lone wolves’ who are often radicalised alone, mostly on the Internet, and go on to commit crimes without being part of a larger network. It requires several elements to be fulfilled before it can be used, such as possessing dangerous objects or hazardous substances, being trained in weapon use, and accessing websites which glorify terrorism.\nAnother factor that can be added is if the suspect stayed abroad in an area where terrorist acts, war crimes or crimes against humanity are rife. In the case of this 32-year-old Frenchman, however, that seems not to have been relevant. His radicalisation took place under the noses of prison authorities.","url":"https://www.breitbart.com/europe/2015/11/07/radicalised-ex-con-plotted-serve-islam-attack-socialist-mp/"}
