{"authors":["Brian Naylor","Soner Cagaptay"],"date_download":"2018-10-22 21:18:59","date_modify":"2018-10-22 21:18:59","date_publish":"2016-06-14 00:00:00","description":"Donald Trump has criticized President Obama for not saying \"radical Islam.\" But Obama shot back: \"Calling a threat by a different name does not make it go away.\"","filename":"data/vaneerConsumption/RadicalIslamOrRadicalIslamismItDependsWhomYouAsk.json","image_url":"https://media.npr.org/assets/img/2016/06/14/gettyimages-540088044_wide-430501c44884c8252d6f2b6a26f02d59e150bbab.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_06_14_482011041_radical-islam-or-radical-islamism-it-depends-who-you-ask_1540243139.html","title":"Radical Islam Or Radical Islamism? It Depends Whom You Ask","title_page":"Radical Islam Or Radical Islamism? It Depends Whom You Ask  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Radical Islam Or Radical Islamism? It Depends Whom You Ask\nEnlarge this image toggle caption Jim Lo Scalzo-Pool/Getty Images Jim Lo Scalzo-Pool/Getty Images\nThe Orlando shooter, Omar Mateen, claimed allegiance to the leader of the Islamic State during a phone call to 911 early Sunday. And that's reignited a debate over how to label the ideology that apparently inspired the attack.\nRepublican Donald Trump and many on the right say it's \"radical Islam.\" But Democrat Hillary Clinton used a different term: \"radical Islamism.\" It's not just a debate over semantics.\n\"What exactly would using this label accomplish?\" President Obama asked Tuesday as he spoke about his administration's fight against ISIS. He spoke at length about the language debate. \"Would it bring in more allies? Is there a military strategy that is served by this? The answer is none of the above. Calling a threat by a different name does not make it go away. This is a political distraction.\"\nWhen he hosted a White House summit on combating violent extremism last year, President Obama explained why he wouldn't use the term \"radical Islamic terrorism\" to describe groups like the self-proclaimed Islamic State or al-Qaida. Such groups, he said, did not represent Islam, nor were their leaders religious leaders. \"We are not at war with Islam,\" Obama said. \"We are at war with people who have perverted Islam.\"\nIn refusing to use the term \"radical Islam,\" Obama was following a precedent set by his Republican predecessor, George W. Bush, who said after the Sept. 11, 2001, attacks that \"ours is not a campaign against the Muslim faith. Ours is a campaign against evil.\"\nSoner Cagaptay of the Washington Institute for Near East Policy agrees the term \"radical Islamic\" is an incorrect way to refer to ISIS. \"It is not an Islamic group. It does not represent Muslims, so I think it's wrong to call it 'radical Islamic.' It's a 'radical Islamist' group.\"\nCagaptay says it is not a matter of mincing words.\nWhen you say Islamic, you are talking about an adjective of Muslims, and when you say Islamism you are talking about an ideology, a dystopian ideology that tries to recruit from among Muslims.\n\"When you say Islamic, you are talking about an adjective of Muslims, and when you say Islamism you are talking about an ideology, a dystopian ideology that tries to recruit from among Muslims,\" Cagaptay says. \"Obviously, these two things are extremely different.\"\nCagaptay points out that the vast majority of Muslims reject ISIS and have themselves been its victims.\nBut many, including Trump, say it's political correctness that keeps Obama and Democrats from using the phrase. During a speech in New Hampshire on Monday, Trump criticized Clinton, saying that she has \"for months, and despite so many attacks, repeatedly refused to even say the words 'radical Islam.' \"\nClinton still hasn't used that phrase, and has said it makes it sound like the U.S. is declaring war against a religion. Clinton told NPR Monday that \"whether you call it 'radical jihadism' or 'radical Islamism,' I think they mean the same thing. I'm happy to say either.\"\nMark Dubowitz, executive director of the right-leaning Foundation for Defense of Democracies, thinks Clinton is correct to refer to Islamism, but disagrees with Obama, and says words do matter.\n\"The president is right that it's a perversion of Islam,\" Dubowitz said, \"but the president is wrong in not describing the nature of the ideology and the theology that is being used to mobilize and motivate these adherents to carry out these terrorist atrocities.\"\nAnd whether Trump is being boldly politically incorrect by referring to \"radical Islam\" or Clinton and Obama are right that the term only legitimizes terrorists' claims that their actions are based on the Islamic faith, both sides see the language they use as a way of framing the political debate in their favor.","url":"https://www.npr.org/2016/06/14/482011041/radical-islam-or-radical-islamism-it-depends-who-you-ask"}
