{"authors":[],"date_download":"2018-10-22 22:52:12","date_modify":"2018-10-22 22:52:12","date_publish":"2014-05-12 23:04:38","description":"The family saga of ailing radio personality Casey Kasem has taken a worrisome turn. A LA judge has ordered an investigation into his whereabouts.","filename":"data/vaneerConsumption/RadioIconCaseyKasemIsIllandMissing.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/437521/140512-casey-kasem-1811_3cc006a49795d51a4e73443a1434da8d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_radio-icon-casey-kasem-ill-missing-n103681_1540248732.html","title":"Radio Icon Casey Kasem Is Ill and Missing","title_page":"Radio Icon Casey Kasem Is Ill and Missing","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLegendary disc jockey Casey Kasem is missing, a Los Angeles Superior Court judge wants to know his whereabouts, and his daughters say they're desperately worried his abrupt removal from a medical facility — done against their wishes — will kill him.\nThe 82-year-old \"Top 40\" host and radio personality is suffering from Lewy body disease, a form of dementia, according to his daughters. They told a judge during a hearing on Monday that they don't know where he is being treated.\nDuring the hearing, Judge Daniel S. Murphy ordered a court investigator to locate Kasem, after hearing conflicting information that he is either at a native American reservation in Washington or is out of the country, a court spokeswoman told NBC News.\nCasey Kasem's children have complained for months that they've been prohibited from seeing their father. Kasem's daughter, Kerri Kasem, was appointed as her father's temporary caretaker during the hearing, after her lawyer told the judge the family believes Kasem is being treated in Washington state.\nIn an interiew Monday night, Kerri Kasem told NBC News that she saw her father last Tuesday at a medical facility that she did not name. She described the \"two-to-three hour\" visit as \"incredible\" because he \"had a smile ear to ear and told us he loved us.\"\n\"Some of the staff said they’ve never seen him so animated and happy,\" Kerri Kasem said in the interview, which will be broadcast Tuesday on TODAY. \"When we went to leave, we said ‘Dad, we’re going to be back really soon.’ And he said ‘When?' That’s the last time I saw him. That night he was taken from the facility.\"\nThat warm gathering with his children, Kerri Kasem said, prompted Kasem's wife, Jean, to remove him from the facility — and then keep his location secret.\n\"She couldn’t, in my opinion, stand it, ripped him out of the facility he was getting care in. This is not a man you can just move ... He needed to be transported properly under doctor’s orders and care. And we believe he was not,\" Kerri Kasem said.\n\"So that's why we are doing this ... to find my father. If anybody has seen him, if anybody knows his whereabouts, please call the police, please help us … Facebook, Twitter, whatever, just help us find our dad. He needs to be in a proper medical facility, not in a car or on a plane, crossing state lines or out of the country,\" she added.\nCraig Marcus, who is Kasem's wife's lawyer, confused the situation even more during the hearing by saying he is not sure where Kasem is, but believes he has \"been removed from the country.\" Marcus said that Jean Kasem, who has been married to the radio icon for over 30 years, had every right to move her husband as she saw fit.\nIn addition to assigning the investigator, Murphy appointed a doctor to look into Casey Kasem's care.\nKerri Kasem's case is the second one opened by one of the former host's children to try to gain access to their father and have some oversight over his care. A previous case by his daughter, Julie Kasem, was dismissed after she reached a settlement with her stepmother, but the daughter said Monday that agreement has been breached.\nKerri, Julie and Mike are Kasem's children from his marriage to Linda Myers. \"Unfortunately the disease may be killing his body but it doesn't need to kill his spirit and his soul,\" Julie Kasem said on TODAY in October.","url":"https://www.nbcnews.com/pop-culture/celebrity/radio-icon-casey-kasem-ill-missing-n103681"}
