{"authors":["Press Association"],"date_download":"2018-10-23 03:46:12","date_modify":"2018-10-23 03:46:12","date_publish":"2016-01-11 16:45:25","description":"RAF aircraft carried out four missions against the Islamic State terror group in Syria on Sunday, using hi-tech Brimstone missiles in the country for the fir...","filename":"data/vaneerConsumption/Rafattacksistargetsinsyriawithhitechbrimstonemissiles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-d5757f24-9267-4673-8604-67ef5562bf3b-48qEJGFphM8d437f0aaf92715ac2-872_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393814_RAF-attacks-IS-targets-Syria-hi-tech-Brimstone-missiles_1540266372.html","title":"Raf attacks is targets in syria with hi-tech brimstone missiles","title_page":"Raf attacks is targets in syria with hi-tech brimstone missiles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"RAF attacks IS targets in Syria with hi-tech Brimstone missiles\nRAF aircraft carried out four missions against the Islamic State terror group in Syria on Sunday, using hi-tech Brimstone missiles in the country for the first time.\nThe attacks targeted an IS vehicle and tunnels near the town of Raqqa, as well as the Omar oilfield in the east of the country near the border with Iraq, said Downing Street.\nBrimstone is a \"fire-and-forget\" radar-guided precision weapon which can be used against moving targets, which was cited by Prime Minister David Cameron in the run-up to last month's vote on war in Syria as the kind of UK asset which would make a \"meaningful difference\" to the coalition's battle against IS.\nPrime Minister David Cameron said Brimstone missiles would make a 'meaningful difference' to the battle against IS\nThe four missions taking place over the course of Sunday involved:\n:: Two Tornado GR4 jets using a Brimstone missile to destroy a supply truck near Raqqa and targeting two IS buildings in the area, including a command and control centre, with Paveway IV laser-guided bombs;\n:: Reaper unmanned drones targeting an IS terrorist position in the Raqqa area with a Hellfire missile;\n:: Two Tornado jets striking a tunnel complex near Raqqa with four Paveway bombs.\n:: An attack on the Omar oilfield by two Tornados and a Reaper drone, which used used three Brimstones as well as Hellfire missiles to attack a number of mobile cranes brought in by IS to attempt to repair damage inflicted by previous RAF and coalition air strikes.\nOn Monday morning, an RAF Reaper flew the 1,000th drone sortie against Islamic State - also known as Daesh, Isis or Isil - since the beginning of operations in October 2014, said the Ministry of Defence.\nThe MoD also released details of strikes against IS in Iraq last week.\nTwo Tornados used Paveway bombs to strike militants attempting to mount attacks against Iraqi ground forces near the town of Haditha in western Iraq on January 6.\nThe jets then flew south to Ramadi to support Iraqi government forces fighting to eliminate remaining IS positions holding out in the city following its recapture at the end of December.\nWorking closely with other coalition aircraft, the Typhoons conducted four Paveway attacks, destroying two machine-gun positions and two armoured personnel carriers, said the MoD.\nIn northern Iraq, RAF Tornados supporting Kurdish forces used a Paveway to destroy an IS unit manning rocket launchers south of Sinjar, and six Paveways were deployed against three IS fighting positions and three accommodation blocks near Mosul.\nLater in the day, Typhoons were again in action over Ramadi, where they struck two terrorist positions, including a heavy machine-gun team firing on Iraqi troops.\nOperations over Ramadi continued on January 7, with Typhoons delivering six successful Paveway attacks on IS positions, including two more machine-gun teams.\nIn patrols over Mosul and Kisik in the north of Iraq, Tornados used Paveways against a group of IS fighters and a rocket position.\nOn January 8, RAF Tornados conducted two more Paveway attacks near Mosul, striking rocket and machine-gun teams.\nAsked whether Sunday's missions indicated the UK was stepping up the tempo of its fight against IS in Syria, Mr Cameron's official spokeswoman said: \"This is part of the ongoing operation and work we are doing with coalition partners to defeat Daesh in Iraq and Syria.\n\"We have always been clear that it is going to take time and require patience and persistence, but it reflects the fact that where we identify targets and an ability to strike them, we will do all we can to tackle Daesh.\"\nNo details were made available of casualties resulting from the raids.\nBut the PM's spokeswoman stressed that the UK military is operating under instructions to avoid civilian deaths: \"As you know, we have very clear guidelines in place for the military about their targeting and striking. This was focused on Daesh terrorists and their resources.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393814/RAF-attacks-IS-targets-Syria-hi-tech-Brimstone-missiles.html"}
