{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 01:18:22","date_modify":"2018-10-23 01:18:22","date_publish":"2016-01-11 12:00:13","description":"The specialist Brimstone missile was used in Syria for the first time as British pilots stepped up action against the terrorists. The blitz (pictured) comes after weeks of focus to reclaim the Iraqi city of Ramadi.","filename":"data/vaneerConsumption/RAFblitzesISISasFOURstrikesaremadeinonedayinSyria.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DC89600000578-0-image-a-19_1452538467040.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393772_RAF-blitzes-ISIS-FOUR-strikes-one-day-Brimstone-missile-fired-time-Syria_1540257502.html","title":"RAF blitzes ISIS as FOUR strikes are made in one day in Syria","title_page":"RAF blitzes ISIS as FOUR strikes are made in one day in Syria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The RAF has battered ISIS with four bombing attacks in a single day, launching raids on vehicles, defensive tunnels and an oil field.\nThe specialist Brimstone missile was used in Syria for the first time as British pilots stepped up action against the terrorists.\nThe blitz comes after weeks of focussing on coalition operations to reclaim the Iraqi city of Ramadi.\nScroll down for video\nFootage taken from the bombing. This image shows a Tornado flight using Brimstone missiles to attack a number of mobile cranes brought in by Daesh to attempt to repair the severe damage inflicted by previous RAF and coalition air strikes on the Omar oil field\nRevealing the new attacks, the Prime Minister's official spokeswoman said: 'This is part of the ongoing operations and work we are doing with our coalition partners to defeat Daesh in Iraq and Syria.\n'That's going to take time, it's going to require patience and persistence but it reflects the fact that where we identify targets and ability to strike them, we will do all that we can to tackle Daesh.'\nThe first strike involved two tornadoes attacking enemy positions and one vehicle near the ISIS stronghold of Raqqa. A Brimstone missile was deployed.\nThe second saw a Reaper unmanned drone targeting ISIS terrorists, also near Raqqa.\nThe Brimstone missile can be seen here circled in red\nScreen grabs taken from the footage of the bombing\nIn the third bombing raid, two Tornado jets launched an attack on tunnels around the city of Raqqa - seen as the 'capital' of the so-called Islamic State.\nThe fourth attack yesterday involved two Tornado jets and a reaper drone engaging targets at the Omah oil field in Syria.\nThree more Brimstone missiles were used in the fourth attack.\nThe spokeswoman declined to comment on casualties or whether any of the terrorists targeted were British jihadis.\nThe £100,000 missile, which was developed in Britain, first came into service in 2005\nThe specialist Brimstone missile was used in Syria for the first time\nDetailing the attacks, the Ministry of Defence said: 'On Sunday 10 January, the focus turned to a series of targets inside Syria.\n'Near Raqqa, a pair of Tornados bombed a pair of Daesh-held buildings, one of which was a confirmed command and control centre, and used a Brimstone missile to destroy a supply truck.\nPairs of Tornado jets, file picture at RAF Akrotiri in Cyprus, were involved in several of the new attacks in Syria yesterday\nTHE BRIMSTONE MISSILE: BRITAIN'S DEADLY WEAPON IS AIMED AT ISIS The £100,000 missile, which was developed in Britain, first came into service in 2005 and is used by the RAF. The laser-guided Brimstone missile, which can hit a small, fast-moving target, could be used by RAF pilots to assassinate IS leaders one by one. Britain and Saudi Arabia are currently the only two countries in the world to have invested in Brimstones. The British-designed missile destroys its target with a contained explosion that generates relatively little debris. It is far more sophisticated than the Americans’ Hellfire weapons, which generate a large and deadly field of shrapnel when they explode. The £100,000 Brimstone – which was used against Colonel Gaddafi’s regime in Libya in 2011 – can be fired from a Tornado GR4 at 20,000ft and is capable of hitting vehicles travelling at up to 70mph. It can be launched from a plane which is flying up to seven miles away from its target. Each missile has a small but highly focused explosive warhead – which reduces the chance of shrapnel hitting civilians – as well as an adjustable fuse which allows the pilot to decide exactly when it will explode. The RAF would use the state-of-the-art weaponry to take out particular targets on a British ‘kill list’ in Syria should MPs vote in favour of extending the mission this week. It is understood that Tornado planes would concentrate on hitting the ‘upper tier’ of IS leadership structure in their stronghold. IS command posts and training camps will also be identified as key targets for any British aircraft operating over Syria, according to Defence Secretary Michael Fallon. The missile’s dual-mode guidance system – with a laser designator and a sophisticated radar – makes it the ideal weapon for destroying IS fanatics driving on motorbikes or on gun trucks. It also makes the RAF a formidable force in the IS stronghold of Raqqa, where other coalition nations have struggled to take out targets for fear of civilian It is said to be especially good at targeting tanks and other heavy weaponry and uses a 'highly focused' explosive warhead to reduce shrapnel. This in turn can reduce the number of casualties.\n'A second pair of GR4s dropped four Paveway IVs on a tunnel complex, again near Raqqa, whilst a Reaper engaged a terrorist position with a Hellfire missile.\n'During the evening, a further Tornado flight and a Reaper used a combination of Brimstone and Hellfire missiles to attack a number of mobile cranes brought in by Daesh to attempt to repair the severe damage inflicted by previous and coalition air strikes on the Omar oil field.'\nThe weekend attacks come after a series of strikes last week, it also emerged.\nSix Paveway bombs were dropped on targets around Ramadi by Typhoon jets on Thursday last week, the Ministry of Defence said.\nRAF Reaper drones have now flown 1,000 missions - a mixture of bombing and surveillance - since military action against ISIS in Iraq and Syris was started\nBritain launched its first strikes in Syria on Christmas Day when an armed checkpoint was struck by Hellfire missiles.\nIn an operation note of their website, the Ministry of Defence confirmed the attack on the ISIS stronghold.\nA statement read: 'Missions continued on Christmas Day over Syria when an RAF Reaper struck a Daesh checkpoint south of Raqqa with a Hellfire missile.'\nThe attack was one of a series across Iraq and Syria over the Christmas period carried out by British forces.\nOn December 23, a Typhoon patrol in Mosul in Iraq successfully attacked six targets using eight Paveway precision guided bombs killing a group of at least 17 terrorists, who suffered a direct hit.\nAn RAF air strike on a ISIS controlled oilfield earlier this month in Syria.\nBritish forces have stepped up strikes against the terror group over Christmas\nThe oilfield is destroyed in the attack. It comes as the US-led coalitionsay 10 commanders of the terror group have been killed in the last month\nOn Christmas Eve, Typhoons operating over Mosul in Iraq destroyed ISIS held buildings with a Paveway missiles.\nAnd on Christmas Day, as well as the strike on Raqqa, Tornados used Paveway missiles against two terrorist teams who tried to attact Iraqi forces in Ramadi.\nAn MoD spokesman said: 'Operations against Daesh terrorist network have continued at a high intensity over the holiday period, with Royal Airforce aircraft conducting air strikes in Syria and Iraq, particularly in support of successful Iraq operations in Ramadi.'\nRAF Reaper drones also fired weapons at ISIS targets in yesterday's four strike blitz over Syria. They have now flown 1,000 missions against ISIS over Iraq and Syria\nAn RAF air strike on a ISIS controlled oilfield last month in Syria. British forces stepped up strikes against the terror group over Christmas before turning focus to winning back Ramadi in Iraq\nPrevious British air strikes on Syria have previously targeted oil fields controlled by the terror group.\nIt comes as the US-led coalition which has been launching attacks against ISIS in Iraq and Syria say 10 commanders of the terror group have been killed in the last month.\nOn Christmas Day, as well as the strike on Raqqa, Tornados, pictured, used Paveway missiles against two terrorist teams who tried to attact Iraqi forces in Ramadi\nAmong the dead are Abdul Qader Hakim, who was linked to the Paris terror attacks and was targeted in Mosul on Boxing Day.\nMeanwhile on Christmas Eve Charaffe al Mouadan, who was also directly linked to the Paris attacks, was killed in Syria.\nFollowing the Christmas strikes, U.S. Army Colonel Steve Warren, a spokesman for the coalition, said: 'Over the past month, we've killed 10 ISIS leadership figures with targeted air strikes, including several external attack planners, some of whom are linked to the Paris attacks.\n'Others had designs on further attacking the West.\nPart of those successes is attributable to the fact that the organization is losing its leadership.'\nHowever, he warned: 'It's still got fangs.'","url":"https://www.dailymail.co.uk/news/article-3393772/RAF-blitzes-ISIS-FOUR-strikes-one-day-Brimstone-missile-fired-time-Syria.html"}
