{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-22 20:39:57","date_modify":"2018-10-22 20:39:57","date_publish":"2016-01-28 02:39:37","description":"Raheem Sterling will not let old friendships get in the way of his pursuit of silverware when Manchester City face Liverpool in the Capital One Cup final next month.","filename":"data/vaneerConsumption/RaheemSterlingsaysitllbebusinessasusualwhenCityplayLiverpoolinCapitalOneCupfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A45E6300000578-0-image-a-22_1453948339143.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420281_Raheem-Sterling-insists-business-usual-Manchester-City-play-ex-club-Liverpool-Capital-One-Cup-final_1540240797.html","title":"Raheem Sterling says it'll be 'business as usual' when City play Liverpool in Capital One Cup final","title_page":"Raheem Sterling says it'll be 'business as usual' when City play Liverpool in Capital One Cup final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Raheem Sterling will not let old friendships get in the way of his pursuit of silverware when Manchester City face Liverpool in the Capital One Cup final next month.\nSterling left Liverpool in acrimonious circumstances last summer, joining City in a £49million deal after prolonged contract talks with the Anfield hierarchy which were played out in public.\nThe England international cited his desire to win trophies as a reason for going to City, so the fact his former club will oppose him at Wembley adds extra spice to the encounter on February 28.\nRaheem Sterling (right) will play former club Liverpool with Manchester City in the Capital One Cup final\nSterling left Liverpool to join City for £49million last summer in a controversial exit from Anfield\nSterling (centre) still has friends at Liverpool but insists it will be 'business as usual' at Wembley\nSterling has plenty of friends in the Liverpool dressing room from his time at the club but wants to make their first final under Jurgen Klopp one to forget.\n'I might get one or two (messages from Liverpool players) but it's strictly business at Wembley,' Sterling said.\n'It's why I came here, we're lucky enough to be in the final. It's really well done to Liverpool because they got to the final.\n'We'll meet in the final and may the best team win on the day.'\nSterling has already played against Liverpool once before and his City side were beaten 4-1 at home\nCity defeated Everton 4-3 on aggregate to reach the final of the Capital One Cup on Wednesday\nLiverpool overcame Stoke on penalties, after drawing 1-1 over two games, to qualify for Wembley\nCity beat Everton 4-3 on aggregate to reach Wembley, while Liverpool overcame Stoke 6-5 on penalties after drawing 2-2 across two games.","url":"https://www.dailymail.co.uk/sport/football/article-3420281/Raheem-Sterling-insists-business-usual-Manchester-City-play-ex-club-Liverpool-Capital-One-Cup-final.html"}
