{"authors":["Press Association"],"date_download":"2018-10-22 23:47:17","date_modify":"2018-10-22 23:47:17","date_publish":"2017-04-26 08:34:09","description":"The protest marked a year since the start of the dispute on Southern.","filename":"data/vaneerConsumption/RailworkersstageParliamentprotestoverdriveronlytrains.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466305-1493222053-685_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446592_Arriva-Rail-North-workers-strike-driver-trains-row-talks-fail_1540252037.html","title":"Rail workers stage Parliament protest over driver-only trains","title_page":"Rail workers stage Parliament protest over driver-only trains | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rail workers from across the country have staged a protest outside Parliament as part of a long-running campaign against controversial changes to the role of guards.\nThey held up banners which read Safety Before Profit and Keep The Guard On The Train as disputes continued to rage at three train companies.\nThe Rail, Maritime and Transport union said a 24-hour strike on Arriva Rail North will go ahead on Friday after a meeting failed to break the deadlock over driver-controlled operation for new trains, while talks with Southern will resume next week.\nThe protest marked a year since the start of the dispute on Southern, which has seen RMT members take 31 days of strike action.\nRMT general secretary Mick Cash accused the Government of causing the disputes and of “tying the hands” of companies over staffing of the railways.\nHe said Arriva had rejected a proposal to invite the Transport Department to join talks aimed at finding a solution.\n(Victoria Jones/PA)\n“The public, who support RMT’s campaign for a guarantee of a guard on their trains, will be appalled that Arriva Rail North have failed yet again to offer any kind of progress whatsoever in the talks and have instead opted to try and bulldoze through their plans regardless.\n“It is that flagrant disregard for the safety issues at the heart of the dispute which leaves us with no option but to press ahead with the campaign of strike action.”\nRichard Allan, deputy managing director of Arriva Rail North, said: “It is disappointing that RMT was unwilling to move from its current position during our talks.\n(Phil Noble/PA)\n“Our employees want us to talk about changes we need to make to the on-board role as we modernise our railway. We believe we would keep a second person on many of our services and, at some locations, we may choose to staff the station to give better support to customers.\n“In addition to protecting jobs and current pay, we are also willing to offer future, annual pay reviews for existing conductors if we can agree a deal with RMT.\n“It is hugely disappointing that RMT is making demands rather than working with us to develop our plans. There is so much to discuss and we urge them to get back round the table.”","url":"https://www.dailymail.co.uk/wires/pa/article-4446592/Arriva-Rail-North-workers-strike-driver-trains-row-talks-fail.html"}
