{"authors":["Clara Turnage"],"date_download":"2018-10-30 18:19:45","date_modify":"2018-10-30 18:19:45","date_publish":"2018-06-21 00:00:00","description":"Officers removed the body of a Little Rock Port Authority worker from beneath a train car more than four hours after the locomotive crashed into an 18-wheeler on Frazier Pike Road on Thursday morning.","filename":"data/vaneerConsumption/RailcarfallskillslongtimeLittleRockPortAuthorityworkerdayafterheannouncedretirement.json","image_url":"https://media.arkansasonline.com/img/photos/2018/06/21/resized_272427-1b-train-wreck-0622_12-24786_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_jun_22__1540923585.html","title":"Rail car falls, kills longtime Little Rock Port Authority worker day after he announced retirement","title_page":"Rail car falls, kills longtime Little Rock Port Authority worker day after he announced retirement","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Little Rock police investigate after a train crashed into an 18-wheeler crossing the railroad tracks Thursday on Frazier Pike Road in Little Rock. More photos are available at arkansasonline.com/galleries. - Photo by Thomas Metthe\nOfficers removed the body of a Little Rock Port Authority worker from beneath a train car more than four hours after the locomotive crashed into an 18-wheeler on Frazier Pike Road on Thursday morning.\nDonald Melton, 62, of Austin died Thursday morning after a Port Authority train crashed into a westbound 18-wheeler. Melton had announced his retirement after more than 22 years at the Port Authority just one day before, Port Authority executive director Bryan Day said.\nLittle Rock Police Department Lt. Steve Moore said the train was traveling backward about 9:30 a.m. Thursday when it struck just behind the cab of the truck.\nMoore said Melton and one other \"spotter\" -- workers who watch the rear of the train while it travels backward -- jumped off the train car as it neared the 18-wheeler, but the force of the collision knocked the train off the tracks and onto Melton.\nClick here for larger versions\nPhotos by Thomas Metthe\nRescue workers removed Melton's body about 2 p.m. after moving in a crane to lift the toppled rail car, Moore said.\nMoore said neither the driver of the 18-wheeler nor any other crew members were injured during the accident, which was still under investigation Thursday afternoon.\nDay said Melton had worked on rail crews for more than 22 years as a spotter and in other positions.\nSpotters use a radio to inform the engineer when an object or vehicle is obstructing the train's path, Day said.\nDay said a radio signal was sent to the engineer, but he was not sure of the details of the communication.\nHe said he wasn't sure how fast the train was traveling Thursday but that Port Authority locomotives rarely travel faster than 8-10 mph. Moore said he didn't know why the 18-wheeler did not stop before reaching the train tracks.\nDay said signs at the railroad crossing are in compliance with Federal Railroad Administration standards and that only one crossing at the Port Authority -- the main entrance -- has lights.\nMelton was the first fatality in approximately 50 years of operation, he said.\n\"We're just devastated,\" Day said. \"We're trying to get our hands around what happened.\"\nDay said the Little Rock Police Department and the Federal Railroad Administration will be investigating the fatality.\nMetro on 06/22/2018","url":"https://www.arkansasonline.com/news/2018/jun/22/rail-car-falls-kills-port-worker-201806-1/"}
