{"authors":["James Salmon","Transport Correspondent For The Daily Mail"],"date_download":"2018-10-22 21:40:14","date_modify":"2018-10-22 21:40:14","date_publish":"2017-03-16 01:45:26","description":"Services in and out of London, Birmingham, Manchester, Bristol, Glasgow and Edinburgh are among those that will be disrupted by the £70million upgrade.","filename":"data/vaneerConsumption/RailpassengersfacingEasterweekendchaosduetorepairs.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4FEBC000000578-0-image-a-6_1489626008396.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318496_Rail-passengers-facing-Easter-weekend-chaos-repairs_1540244414.html","title":"Rail passengers facing Easter weekend chaos due to repairs","title_page":"Rail passengers facing Easter weekend chaos due to repairs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Travel chaos looms for train passengers over Easter weekend as Network Rail deploys 13,000 workers to fix tracks.\nServices in and out of London, Birmingham, Manchester, Bristol, Glasgow and Edinburgh are among those that will be disrupted by the £70million upgrade.\nThe engineering works will take place from Good Friday to Easter Monday, April 14-17, with many trains subjected to speed limits and diversions.\nThe repairs – part of a £50billion project to upgrade the creaking Victorian rail network – will also cause disruption for those heading abroad for Easter.\nTravel chaos looms for train passengers over Easter weekend as Network Rail deploys 13,000 workers to fix tracks\nServices to the UK’s two biggest airports, London Heathrow and London Gatwick, will be affected. The biggest disruptions will include the closure of the line between London Liverpool Street and Essex, hitting operators such as Great Anglia and TfL Rail.\nElsewhere, bus replacement services will be used on several key services into Bristol Temple Meads, and on a number of lines in the West Midlands, affecting Birmingham New Street.\nIn Scotland, there will be no CrossCountry or Virgin Trains East Coast services between Edinburgh and Glasgow Central. ScotRail will also be running bus replacement services, with many trains diverted.\nDRIVERS VOTE ON NEW DEAL Bosses of train drivers’ union Aslef have made a second attempt to thrash out a peace deal with Southern rail in a bid to prevent further strikes. The two sides have been locked in a battle over the decision by rail bosses to change the role of guards. Last night they refused to provide any details of the agreement, which will be voted on by Aslef members. The result will be announced on April 3. It follows strikes that spread from the South East to the North on Monday, crippling Merseyrail and Northern services. Aslef’s Mick Whelan said the new terms offer ‘solutions to our concerns, as well as restoring the confidence of all parties and the travelling public’. Andy Bindon of Govia Thameslink Railway, which runs Southern, said: ‘We look forward to restoring good industrial relations with Aslef.’\nNetwork Rail takes advantage of public holidays to ramp up engineering works, because fewer people travel than on work days. But this strategy regularly causes misery for those who need to take a train to visit relatives or go on a holiday. The problem is made worse by delays to engineering.\nTwo years ago, over-running Christmas works in London left 115,000 people stuck on trains or queuing outside stations.\nSimilar incidents occurred this Christmas, with the delayed construction of a bridge causing major disruption around Rugby.\nTransport Secretary Chris Grayling has accepted that Network Rail must improve. A key part of his blueprint for the system is making operators and Network Rail work more closely together.\nThe hope is that this will make them more accountable and end the blame game between the public body and rail bosses when things go wrong for passengers.\nNetwork Rail managing director for England and Wales, Phil Hufton, said: ‘This will provide faster, better services in the long run and help relieve overcrowding.\n‘We know many people want to use the railway during the Easter holidays and the good news is that over 95 per cent of the network is unaffected by this work.\n‘But there will be some services that are impacted and so we strongly advise passengers to plan their journeys in advance.’","url":"https://www.dailymail.co.uk/news/article-4318496/Rail-passengers-facing-Easter-weekend-chaos-repairs.html"}
