{"authors":[],"date_download":"2018-10-30 20:27:09","date_modify":"2018-10-30 20:27:09","date_publish":"2015-11-09 11:21:40","description":"If you spot someone carrying a sign proclaiming “The End is Near” around metro Atlanta on Tuesday, they won’t be predicting the last days of civilization.","filename":"data/vaneerConsumption/RainrainwillgoawaysuntocomeagainsomedaylikeTuesday.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/09/Images/photos.medleyphoto.8369183.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_rain-rain-will-away_9c87181c3b2143b3e3f568b084c4f620__1540931229.html","title":"Rain, rain will go away, sun to come again someday (like Tuesday)","title_page":"Rain, rain will go away, sun to come again someday (like Tuesday)","title_rss":"NULL","source_domain":"ajc.com","text":"If you spot someone carrying a sign proclaiming “The End is Near” around metro Atlanta on Tuesday, they won’t be predicting the last days of civilization.\nThey’ll be forecasting drier weather.\nFor a while there, it seemed the former was more likely to happen than the latter, what with the constant downpour that swamped basements, flooded creeks, clogged roads, felled trees, sparked power outages and forced near everyone to huddle up inside for what seems like a month.\nThanks to that old friend, high pressure, though, the rain has moved on.\nIn the words of Channel 2 Action News chief meteorologist Glenn Burns: “Yes, it’ll be beautiful.”\nWe’re talking temperatures in the mid-60s Tuesday afternoon with sunny skies — remember them? — and even warmer temperatures and continued sun come Wednesday. There’s only a slight chance of any wet weather in the projections through next weekend, that being for Thursday, and, really, who wants to think that far ahead anyway.\nAs bright as the week ahead appears, the trauma brought on by the recent weather can’t be ignored.\nIn a worse-case scenario, the weather turned deadly in Buckhead, where a sport utility vehicle slammed into a tree that had fallen across Woodhaven Road in the predawn darkness, killing the 81-year-old driver.\nThe city’s official rain gauge at Hartsfield-Jackson International Airport has recorded rain every day so far this month, with the total of 6.87 inches eclipsing the normal total for all of November by 2.77 inches.\nRainfall totals from early Sunday through early Monday ranged from 1.11 inches in Marietta, 1.25 inches in Alpharetta and 1.27 inches in Dunwoody to 1.66 inches at Hartsfield-Jackson International Airport and 1.82 inches in Peachtree City.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter\nNow, looking ahead: Tuesday should start cloudy but turn sunny and dry, with highs in the mid-60s after morning lows in the upper 40s.\nWednesday looks to be largely sunny, with highs in the low 70s and lows in the upper 40s.\nThere is about a 30 percent chance of rain on Thursday, with highs in the mid-60s and lows in the upper 50s.\nAnd Friday should be mostly sunny, with highs in the low 60s after lows in the mid-40s.\n» Check the full forecast and track changes","url":"https://www.ajc.com/weather/rain-rain-will-away-sun-come-again-someday-like-tuesday/PdvTNswiLFmghE8YGFtiCJ/"}
