{"authors":["Ben Grounds For Mailonline"],"date_download":"2018-10-23 02:22:53","date_modify":"2018-10-23 02:22:53","date_publish":"2017-03-16 12:50:08","description":"Mino Raiola has made his first public appearance since Romelu Lukaku expressed his reluctance to sign a new contract at Everton, with the agent spotted entering the Manchester United hotel.","filename":"data/vaneerConsumption/RaiolaandWoodwardseenatManchesterUnitedteamhotel.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/17/3E571A4E00000578-0-image-a-2_1489686870053.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320036_Mino-Raiola-arrives-Manchester-United-team-hotel_1540261373.html","title":"Raiola and Woodward seen at Manchester United team hotel","title_page":"Raiola and Woodward seen at Manchester United team hotel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mino Raiola has made his first public appearance since Romelu Lukaku expressed his reluctance to sign a new contract at Everton, with the agent spotted entering the Manchester United team hotel.\nDespite keeping a low profile by refusing to comment on the ongoing saga regarding Lukaku's future at Goodison Park, the spotlight has been on Raiola since he claimed his client was '99.999 per cent' likely to sign a new five-year deal.\nIt had seemed a formality that Lukaku would become the first player in the club's history to sign a contract worth more than £100,000 a week, with negotiations going on since last summer, but he dropped a bombshell on Tuesday afternoon.\nAgent Mino Raiola arrives at the Manchester United team hotel on Thursday morning\nRaiola emerged from a black taxi before making his way into The Lowry Hotel on Tursday\nRaiola is the agent of Everton striker Romelu Lukaku who has signaled his desire for a new club\nUnited chief executive Ed Woodward pictured leaving the Lowry Hotel on Thursday\nLukaku has since spoken of his desire to win trophies and cited a lack of ambition at Everton, owing to the club's hierarchy missing out on important signings, but Raiola was more concerned about his other prestigious clients as he arrived in Manchester on Thursday.\nManchester United chief executive Ed Woodward was later pictured leaving the hotel.\nThe Dutch football agent emerged from a taxi and entered The Lowry Hotel, where Jose Mourinho and his squad were staying ahead of their second leg with Rostov in the last 16 of the Europa League.\nRaiola is the agent of Paul Pogba, Zlatan Ibrahimovic and Henrikh Mkhitaryan and he is in regular contact with his clients to ensure their needs are being met.\nHaving helped broker three major transfers to Old Trafford last summer, he will be hopeful that another can be agreed regarding Lukaku with his client wanting to prove himself in the Champions League.\nLukaku revealed on Tuesday that he thinks Everton's lack of ambition is holding the club back\nLukaku told Everton at a community event he would not be willing to agree a new deal\nThe Belgian striker was speaking at a Kick it Out event at Everton's training ground on Tuesday\nPREMIER LEAGUE GOLDEN BOOT RACE 19 - Romelu Lukaku 19 - Harry Kane 17 - Alexis Sanchez 17 - Diego Costa 15 - Zlatan Ibrahimovic\nSpeaking at an Everton in the Community event on Tuesday, the Belgium striker was asked if he could become the best forward in world football.\n'Definitely,' was his categorical response. 'But to do that, you need the platform to show yourself.\n'Then you are talking about Champions League and whatever types of games. I don’t want to go into details on that but you just follow the path that is in front of you. Whatever type of situation, I just try to deliver.'\nDespite Chelsea and Manchester United being alerted by news of the £65m-rated striker's potential availability, Everton are hopeful of renewing talks over a new contract and will do their best to persuade him to change his mind.\nUnited progressed with a 1-0 victory in Thursday night's clash courtesy of a second-half goal from Juan Mata.","url":"https://www.dailymail.co.uk/sport/football/article-4320036/Mino-Raiola-arrives-Manchester-United-team-hotel.html"}
