{"authors":["Associated Press"],"date_download":"2018-10-23 00:28:13","date_modify":"2018-10-23 00:28:13","date_publish":"2017-03-16 09:49:15","description":"TOKYO (AP) - Manny Ramirez is set to begin the next chapter of his baseball odyssey by playing for the Kochi Fighting Dogs of Japan's independent Shikoku...","filename":"data/vaneerConsumption/RamireznewhomeafarcryfromthebrightlightsofTokyo.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227595-1489658060-4_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319432_Ramirez-new-home-far-cry-bright-lights-Tokyo_1540254493.html","title":"Ramirez' new home a far cry from the bright lights of Tokyo","title_page":"Ramirez' new home a far cry from the bright lights of Tokyo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - Manny Ramirez is set to begin the next chapter of his baseball odyssey by playing for the Kochi Fighting Dogs of Japan's independent Shikoku Island League.\nRamirez is no stranger to far-flung outposts, having put in a brief stint in Taiwan in 2013. But fans will be curious to see how the former major leaguer, known for a quirky personality, adjusts to life in small-town Japan.\nKochi is the capital city of Kochi Prefecture on the Island of Shikoku. The city has an estimated population of 340,000.\nIn this March 10, 2017 photo, former major league slugger Manny Ramirez practices batting during the workout of Kochi Fighting Dogs in Kochi, western Japan. Ramirez is set to begin the next chapter of his baseball odyssey playing for the Kochi Fighting Dogs of Japan's independent Shikoku Island League. (Emi Ikeda/Kyodo News via AP)\n\"I've always wanted to play in Japan,\" the 44-year-old Dominican said in a comment posted on the team's web site. \"I really appreciate the opportunity the Kochi team is giving me to continue my career. I'm really looking forward to playing in Japan.\"\nThe Fighting Dogs open their regular season April 4 against the Tokushima Indigo Socks. In a pre-season game Thursday, Ramirez was the designated hitter and had two hits in five at-bats and one RBI in a 3-2 win over the Hideo Nomo baseball club.\nRamirez signed a contract in January. While financial terms were not released, his agreement does have some unusual perks.\nAccording to YakyuDB.com, Ramirez will get all the sushi he can eat, be chauffeured around town in a Mercedes Benz and will be put up an expensive hotel.\nBut it won't all be glamorous.\nThe Fighting Dogs will play many of their home games at the 6,000-seat Kochi Municipal Stadium. With an all-dirt infield, it's typical of many small-town baseball stadiums in Japan: clean but low on modern amenities one would find in urban stadiums. Japanese-style squat toilets are often the standard.\nAnd the city of Kochi is a far cry from the bright lights of Tokyo or Osaka.\nThe Visit Kochi website describes the prefecture as a \"hidden gem that is definitely off the beaten track. It's one of those places that lots of people say they want to go to but never really make it.\"\nThere aren't a lot of entertainment options in Kochi, so Ramirez may want to take in some of the local sites on his days off.\nIn between games, Ramirez could go see the Sugi no Osugi, the tallest cedar tree in Japan. Designated as an important natural monument, Sugi no Osugi is said to be more than 3,000 years old.\nAnother option would be the Farmer's Clock Tower. According to the Visit Kochi website, \"The Farmer's Clock has told the hour to farmers working in their fields far away. It still stands amid a rural landscape, and is loved by many people.\"\nIn terms of the weather, Ramirez had better get his umbrella ready. Kochi has a very wet, humid subtropical climate, receiving twice as much rainfall as Shikoku's other main cities Matsuyama and Takamatsu. It is also the most typhoon-prone of Japan's cities owing to its location directly exposed to the Pacific Ocean from which the storms enter the country, and has twice received more than 50 centimeters (20 inches) of rainfall in a day from a typhoon.\nRamirez finished his 19-season major league career with a .312 batting average, 555 home runs and 1,831 RBIs. A 12-time All-Star, Ramirez helped the Boston Red Sox win World Series titles in 2004 and '07, the first for the franchise since 1918.\nRamirez was suspended for 50 games in 2009 while with the Los Angeles Dodgers for using a banned substance. He retired in 2011 rather than face a 100-game suspension after testing positive for a performance-enhancing substance.\nIt may not be all hard work for Ramirez, who could have time to take in the sites in Kochi. YakyuDB.com also reports that practices are \"apparently optional.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4319432/Ramirez-new-home-far-cry-bright-lights-Tokyo.html"}
