{"authors":[],"date_download":"2018-10-30 14:20:17","date_modify":"2018-10-30 14:20:17","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/Rampantidiocyontheairwaves.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_rampant_idiocy_on_the_airwaves_comments_1540909217.html","title":"Rampant idiocy on the airwaves","title_page":"Blog: Rampant idiocy on the airwaves","title_rss":"NULL","source_domain":"americanthinker.com","text":"I heard that Nancy Pelosi said she prays for America and Trump because of what he said about voter fraud. I believe that a lot of us prayed when we had a speaker of the House who had such a reading comprehension problem that she had to pass a bill to see what was in it. Yesterday networks were complaining that the pipeline jobs are temporary. Are they so ignorant that they don’t understand that all construction jobs are temporary? They always support temporary jobs paid by taxpayers. Maybe the problem is that the pipeline jobs aren’t government jobs. A couple of days ago, the WSJ had an article about the stock market dropping a little and saying the market was uncomfortable with Trump. I guess the last two days shows they are comfortable with Trump now. I always get a kick out of pundits who explain every little five-point move. John McCain and others are saying how bad it is that Trump backed away from the TPP. They say... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/rampant_idiocy_on_the_airwaves_comments.html"}
eal with the U.S because we are the biggest fish in the pond. They need us. China can’t fill the void. The same people who say what a disaster it is to back out of TPP said Brexit would be a disaster also. Why do people write such long, cumbersome crap as the TPP and the ACA? No one understands what is in these bills, and that is intentional. A lady running for the head of the DNC said white people shouldn’t be listened to. Why are so few in the media reporting on this truly racist person? I guess it just doesn’t fit the agenda, because they are in the 100% destroy Trump mode. The writers at AT, Zero Hedge, Newsbusters, and Breitbart, and talk show hosts like Rush, have their work cut out for them, because the left-wing propagandists are out in full force and they are dangerous. Facts have not mattered to them for a long time.","url":"https://www.americanthinker.com/blog/2017/01/rampant_idiocy_on_the_airwaves.html"}
