{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:14:20","date_modify":"2018-10-30 18:14:20","date_publish":"2015-11-18 23:38:32","description":"Rand: Refugees Are 'Immediately' 'Put On Welfare,' Cut Off Arms Sales To Gulf Countries Not Accepting Refugees","filename":"data/vaneerConsumption/RandRefugeesAreImmediatelyPutOnWelfareCutOffArmsSalesToGulfCountriesNotAcceptingRefugees.json","image_url":"https://media.breitbart.com/media/2015/11/Rand-1118-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_18__1540923260.html","title":"Rand: Refugees Are 'Immediately' 'Put On Welfare,' Cut Off Arms Sales To Gulf Countries Not Accepting Refugees","title_page":"Rand: Refugees Are 'Immediately' 'Put On Welfare,' Cut Off Arms Sales To Gulf Countries Not Accepting Refugees | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Kentucky Senator and Republican presidential candidate Rand Paul stated that “refugees come here, and immediately are put on welfare” and advocated cutting off arms sales to Gulf nations “until they start accepting refugees” on Wednesday’s “Happening Now” on the Fox News Channel.\nRand said, [relevant remarks begin around 2:35] “refugees come here, and immediately are put on welfare. There are whole agencies set up to put them in government housing, government cash assistance and they’re basically put into our welfare programs. In Kentucky, we have a lot of people out of work, a lot of coal miners out of work. I’ve got disabled veterans saying to me on the phone, just as recently as last night, that they are having trouble surviv[ing] on their disability payments as veterans. They don’t understand why we’re going to take in the world’s poor, and put them on our welfare programs. So, there are some discussions we ought to have about this before we let it happen.”\nHe further stated, “One of the biggest supporters of Sunni terrorism is Saudi Arabia, Qatar is up there, the UAE is up there. Sometimes the government, sometimes private donors. What I would say is no more sales of any arms to those countries until they start accepting refugees. The Gulf states have poured gasoline on this fire, they haven’t taken a refugee. Iran’s not taking any refugees, and they’ve been an arsonist in this situation as well. So, those who live there need to step up, and we need to say we’re not going to sell arms to you anymore if you’re not willing to do your fair share.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/11/18/rand-refugees-are-immediately-put-on-welfare-cut-off-arms-sales-to-gulf-countries-not-accepting-refugees/"}
