{"authors":[],"date_download":"2018-10-30 01:13:42","date_modify":"2018-10-30 01:13:42","date_publish":"2015-02-12 00:00:00","description":null,"filename":"data/vaneerConsumption/RandomthoughtsonarandomattackbyWHpressflackJoshEarnest.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_02_the_murders_in_a_kosher_supermarket_were_random_before_they_werent_1540862022.html","title":"Random thoughts on a 'random attack' by WH press flack Josh Earnest","title_page":"Random thoughts on a 'random attack' by WH press flack Josh Earnest","title_rss":"NULL","source_domain":"americanthinker.com","text":"The verbal gymnastics of the President Barack Obama (D) administration denying that the carnage by Muslims against those who do not follow their particular Muslim brand and interpretation of their faith or those of other faith backgrounds is propelled by Islam is worthy of an Olympic Gold Medal. Carol Brown highlighted the always amazing State Department spokeswoman Jen Psaki's prize winning performance in first denying that the murder of Jews in a Jewish kosher supermarket (not, in an interesting and revealing Obama verbal slip, a deli) by a Muslim was deliberate and not \"random\" and then admitting later that \"oh yeah, it was.\"\nEarlier, during an equally prize winning performance press briefing Obama Press Secretary Josh Earnest engaged in a duel with ABC's Jon Karl over the same issue:\nRealizing this contradicted the French assessment of the situation--and everyone else's--Earnest later clarified, uhm contradicted his earlier twisted statement,\nOur view has not changed. Terror attack at Paris Kosher market was motivated by anti-Semitism. POTUS didn't intend to suggest otherwise.\nOh, of course, POTUS (President of the US) \"didn't intend to suggest otherwise\"--once he realized he couldn't get away with it.\nThat's because the French authorities were perfectly clear that the victims were all chosen because they were in a French Jewish store where a large majority of the customers were Jews even though there was a small probability that some of the customers or employees were of other backgrounds. The killer admitted it. Similarly, all the students killed by Islamic terrorists at a Jewish school in France a few years earlier were targeted specifically because they were Jewish although there might have been others around.\nBut admitting the murders were not random but deliberate and targeted by Muslims acting in fulfillment of Muslim law against Jews would upset the carefully constructed Obama and liberal narratives based on Obama's Indonesian childhood Muslim associations and friends and his adult presidential denial of facts and his official actions flowing from it.\nAlas, forced to finally grudgingly confront and admit the truth will probably not change Obama's strategy or behavior.","url":"https://www.americanthinker.com/blog/2015/02/the_murders_in_a_kosher_supermarket_were_random_before_they_werent.html"}
