{"authors":["Breitbart News"],"date_download":"2018-10-30 19:22:01","date_modify":"2018-10-30 19:22:01","date_publish":"2015-05-20 18:27:15","description":"Sen. Rand Paul (R-KY), a 2016 Republican presidential candidate, has taken control of the U.S. Senate floor to filibuster the PATRIOT Act over concerns that reauthorizing the national security bill would allow the National Security Agency (NSA) to continue the unlawful bulk collection of Americans’ personal records. Breitbart News will bring live updates as this process continues here. |","filename":"data/vaneerConsumption/RandPaulFilibustersPATRIOTACT.json","image_url":"https://media.breitbart.com/media/2015/05/rand-paul-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_20__1540927321.html","title":"Rand Paul Filibusters PATRIOT ACT","title_page":"Rand Paul Filibusters PATRIOT ACT","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Rand Paul (R-KY), a 2016 Republican presidential candidate, has taken control of the U.S. Senate floor to filibuster the PATRIOT Act over concerns that reauthorizing the national security bill would allow the National Security Agency (NSA) to continue the unlawful bulk collection of Americans’ personal records. Breitbart News will bring live updates as this process continues here.\nReaders can watch the livestream here.\nUPDTE, 11:58 PM: “I want to thank the Senate staff; I want to thank the American people for considering the arguments,” Paul said as he relinquished the floor after conducting an 11-hour filibuster.\nUPDATE, 11:43 PM: Cruz joined fellow GOP presidential candidate Sen. Rand Paul (R-KY) during the tenth hour of Paul’s filibuster against the PATRIOT Act and the bulk collection of metadata by the NSA.\nCruz defended the USA Freedom Act, saying it stops the bulk metadata collection by the NSA, but still keeps the right tools in place to stop terrorists.\nCruz addressed his Republican colleagues who would prefer to reauthorize the PATRIOT Act in its entirety.\n“It is abundantly abundantly clear that a clean authorization of the PATRIOT Act ain’t passing this body – and it certainly ain’t passing the House of Representatives.”\nCruz said Paul should be able to propose amendments to the USA Freedom Act, and the Senate should be able to have an open debate.\n“Debate is what we are supposed to do on the merits,” Cruz said.\nUPDATE, 11:39 PM: “It is abundantly clear that a clean authorization of the Patriot Act ain’t passing this body – and it certainly ain’t passing the House of Representatives,” said Cruz.\nUPDATE, 11:33 PM: Cruz says the USA Freedom Act stops the bulk collection of metadata, but still provides the tools to help prevent and combat terrorist attacks.\nUPDATE, 11:28 PM: Sen. Ted Cruz (R-TX) joins the filibuster to thank Paul for his defense of liberty. Cruz states that he doesn’t agree entirely with Paul on the issue.\nUPDATE, 11:27 PM: According to CSPAN, 10 senators have come to the Senate floor during the filibuster, including seven Democrats.\nUPDATE, 11:02 PM: Kelley Paul tweeted her support for her husband during his nine-hour filibuster against the PATRIOT Act.\nToday my husband took a stand for the Fourth Amendment and the right to privacy for every American. I'm so proud of him! #StandwithRand — Kelley Paul (@KelleyAshbyPaul) May 20, 2015\nUPDATE, 10:47 PM: Sen. Mike Lee (R-UT) returns to Senate floor, saying he wants to pass the USA Freedom Act instead of letting Sec. 215 expire.\nLee said he does stand with Paul and the American people on the need for an open debate on this issue.\nUPDATE: 10:39 PM: Matt Drudge tweeted his support for Paul’s filibuster against the NSA’s bulk data collection through the PATRIOT Act.\nWhat kind of people want the Government to spy on their phone calls? America sick. Getting sicker… #StandWithRand — MATT DRUDGE (@DRUDGE) May 21, 2015\nUPDATE, 10:18 PM: Wyden comes to relieve Paul, since he’s been on his feet for nine hours.\n“I think we’re heading into the home stretch,” said Wyden.\nHe added that he thinks they are really first and foremost interested in how this Senate in a bipartisan basis can come up with policies that protect Americans’ security and liberty.\nUPDATE, 10:13 PM: Campaign for Liberty, a 501 (c)(4) group, has tweeted its support for Paul.\nC4L Chairman @RonPaul and his wife Carol stand with their son Rand to end NSA spying. Do you? #StandWithRand pic.twitter.com/3Y8ag7iedV — Campaign for Liberty (@C4Liberty) May 21, 2015\nUPDATE, 10:07 PM: Paul in approaching hour nine of his filibuster against the PATRIOT Act.\nNational Journal reports seven Democrats have backed Paul to give him a breather.\nUPDATE, 10:06 PM: Paul’s store launched a Filibuster Starter Pack for just $30.\nIt includes a number sticker and t-shirt that reads, “The NSA knows I bought this Rand Paul T-shirt.” The pack also has a spy blocker, which is a cover for your camera on your computer.\nUPDATE, 9:50 PM: Sen. Richard Blumenthal (D-CT) joined Sen. Rand Paul (R-KY) just now on the Senate floor saying Paul has made a number of important points about surveillance and the mass collection of data.\n“Does relevant information mean all information?” Blumenthal (D-CT) asked, saying that the Second Circuit Court of Appeals answered that question in the negative when it held the NSA’s data collection is unlawful.\nUPDATE, 9:48 PM: Rep. Justin Amash tweeted his support for Paul during his filibuster against the PATRIOT Act.\nHeading to Senate to #StandWithRand in defense of liberty & the Constitution. Let's stop unlawful data collection on law-abiding Americans. — Justin Amash (@justinamash) May 20, 2015\nUPDATE, 9:14 PM: Reason Magazine’s Matt Welch lays out 10 of what he thinks are “great points” by Paul in his speech. First off, Welch says that Paul’s argument that warrants need to be “individualized.” Secondly, he says, Paul’s argument that internet, phone and data companies should put up a “unified resistance” to NSA compelling them to turn over data is strong. Read the full piece — worth looking at — here.\nUPDATE, 9:04 PM: Sen. Wyden, the Oregon Democrat, is back lambasting alongside Paul the “backdoor search loophole” as an important concern with bipartisan support. Paul is getting close to hitting hour eight of his filibuster.\nWyden says he’ll be back joining Paul soon again on the floor. Wyden said he enjoys Paul’s “stamina,” noting that he’s proud he has had the energy to go for as long as he has so far.\nIn addition, Senate sources tell Breitbart News that Paul’s filibuster of the PATRIOT Act has pushed planned votes from Senate Majority Leader Mitch McConnell on Obamatrade back to 10 a.m. tomorrow at the earliest. The votes were originally scheduled to happen late Wednesday night.\nUPDATE, 8:44 PM: A source close to Sen. Paul told Breitbart News that within the next hour or so, his campaign website’s store will be launching a “filibuster starter pack.”\nUPDATE, 7:49 PM: Rep. Thomas Massie (R-KY), a fellow libertarian and Kentuckian who’s in the Senate chamber watching Paul’s filibuster, put a meme of the Dos Equis Man “Most Interesting Man In The World” beer commercials on his Facebook page.\nA photo of Sen. Paul has text over it that reads: “I don’t always take over C-SPAN 2… But when I do people actually watch C-SPAN 2.”\nIn the Facebook post containing the picture, Massie noted that Paul is now in hour six of his filibuster—he started speaking at 1:18 p.m., and will be entering his seventh hour at 8:18 p.m.—and urges people to turn on C-SPAN 2 to watch Paul speak.\n“We need to rein in the #NSA, end warrantless surveillance of Americans, and reassert our constitutional rights,” Massie wrote. “The Founders of this great nation fought and died to stop the kind of warrantless spying and searches that the #PatriotAct and the FISA Amendments Act authorize.”\nUPDATE, 7:47 PM: The Washington Examiner’s David Drucker, who earlier Tweeted that he viewed Paul’s speech as “yapping”—clearing expressing his personal disagreement with Paul—interviewed Sen. Tom Cotton (R-AR) and Cotton explained why he disagrees with Paul.\n“I disagree with Rand on both points, the constitutionality and the effectiveness,” Cotton told Drucker. “First the constitutionality: The Supreme Court passed on this a long time ago. There’s no reasonable expectation of privacy in call data. Again, not the content of calls, not even the personally identifiable information about calls, but the call data — the two numbers called, the date and time of the call and the duration of the call, because we willfully turn it over to our telecom provider.”\nCotton, Drucker wrote, also said that the government can’t review the data it collects without a special warrant.\n“This is not a question of looking at the actual content of calls,” Cotton continued. “And, the Constitution, as ruled by the Supreme Court, doesn’t give anyone a reasonable expectation of privacy in data that the telephone companies have always had — that they can sell for marketing purposes.”\nUPDATE, 7:26 PM: Paul is closing in on six hours straight on the Senate floor, hammering how “more and more of your government is run by executive edict.” Paul is lambasting executive orders that are outside the law.\nUPDATE, 6:59 PM: Sen. Chris Coons (D-DE) and Sen. Jon Tester (D-MT) also went down to the Senate floor to back Paul’s filibuster.\nUPDATE, 6:31 PM: Generation Opportunity #StandswithRand in letting the NSA’s bulk data collection expire.\nThe Director of Policy Engagement at Generation Opportunity Luke Kenworthy said Section 215 of the Patriot Act should expire because its mass surveillance threatens Americans’ freedoms.\n“It makes sense that there is broad bipartisan support for allowing Section 215 to expire. It has been widely misinterpreted to give the government far more power than was originally intended,” said Kenworthy.“Privacy matters – it’s essential for free speech, commerce, and for holding our leaders accountable. Digital privacy is especially important to young Americans, as we use our phones, computers, and digital devices more than any other generation.”\nGeneration Opportunity is a non-profit organization that aims at helping young people succeed.\n“Our generation says: let Section 215 of the USA Patriot Act expire. It’s only the first step, but it’s necessary for Congress to prove to us that our elected officials are ready to defend our fundamental right to privacy,” said Kenworthy.\nUPDATE, 6:15 PM: Paul is coming up on five hours straight on the Senate floor. Aides tell Breitbart News that it’s going to be a long night, and he plans to keep going for hours and hours and hours — as the Senator said, until he can’t stand anymore.\nUPDATE, 6:10 PM: Sen. Joe Manchin (D-WV) is joining Paul on the floor now, saying he agrees with Paul’s filibuster and disagrees with NSA data collection.\nUPDATE, 6:04 PM: “I stand here today with the people of Montana,” said Daines. “I stand here today with my colleague from Kentucky. Now like all Americans, I understand the great risks facing our national security… but these objectives, national security and protection of our civil liberties, are not mutually exclusive — we can and we must achieve both.”\nUPDATE, 5:59 PM: Daines reads letter from his constituents asking him to vote against reauthorization of Sec. 215 of the PATRIOT Act, saying it violates Americans’ civil liberties.\nUPDATE, 5:54 PM: Sen. Steve Daines (R-MT) is standing with Rand on the Senate floor now. When he took the floor to join Paul, he noted there are five House members who have joined Paul in the Senate chamber as well.\nUPDATE, 5:49 PM: Sen. Heidi Heitkamp (D-ND) is currently in the Chamber with Sen. Martin Heinrich (D-NM) as Paul enters the fifth hour of his filibuster, according to CSPAN.\nUPDATE, 5:38 PM: Jenny Beth Martin, the head of Tea Party Group Tea Party Patriots which has joined with the liberal ACLU to target the NSA’s data collection program, told Breitbart News exclusively that she stands with Rand and thanks Lee for joining him.\n“Ending unwarranted spying and mass collection of data is an issue that unites Americans across the political spectrum. That is why we have coalesced with unlikely partners such as the ACLU and the NAACP,” Martin said in an email. “We applaud Sen. Mike Lee for offering a solution in the USA Freedom Act, and we appreciate Sen. Paul for also bringing attention to the issue.”\nUPDATE, 5:35 PM: Sen. Paul’s team has provided Breitbart News with the entire second hour transcript from Sen. Paul’s remarks, and video of them. He’s now been speaking for more than four hours:\nDo you have a right to privacy in those records? I think you can have security and freedom at the same time. But I think if we’re not careful if is going to get away from us. When they found out that nine out of ten intercepts were not the intended target, just ancillary targets they picked up, they also found that 35% contained e-mail addresses that were U.S. Citizens. Let’s say you collect a million pieces of information and you’re just goring this up and you’re intended to go after foreign targets who might be terrorists but over half of this information, much of it incidentally gained are actually U.S. Citizens. So what this is, it’s sort of an end run, they call it backdoor searches, sort of an end run that has gone around the Constitution, gone around the Fourth Amendment to collect information that we’ve actually said should be illegal to be collected that way but we’re doing it because we’ve done an end run around. Also realize that you can send an email from Virginia to South Carolina and it might go over a server in Brazil. If your email goes over a foreign server, all of a sudden boom, everything’s done, the Constitution’s out the door, they can collect that, even the content.\nRead the complete transcript of hour two here.\nUPDATE, 5:27 PM: Gaston Mooney of the Conservative Review is standing up for Paul.\n“Conservatives acknowledge the NSA has gone too far and the Patriot Act in its current form does not adequately address civil liberties concerns. Passing a clean extension isn’t an option for conservatives. Thankfully, Senator Paul has been instrumental in elevating these concerns for the average American,” Mooney said in an email to Breitbart News.\nUPDATE, 5:04 PM: Sen. Martin Heinrich (D-NM) joined Sen. Rand Paul (R-KY) on the Senate floor debating the PATRIOT Act.\nHeinrich follows both Senators Wyden and Lee who spoke earlier.\nUPDATE, 4:50 PM: Tea Party Express executive director Taylor Budowich told Breitbart News he and his organization “Stand With Rand.”\n“Senator Rand Paul has been a steadfast defender of the Bill of Rights,” Budowich said in an email. “Americans are fed-up with those in Congress that will campaign on conservative principles, yet sit silently while the liberties of millions slowly erode. Senator Rand Paul, like many of his new Tea Party colleagues, has rejected complacency. Instead, he has been every bit the champion of liberty and limited government in D.C. that he was on the campaign trail. Many voters throughout Kentucky and around the nation are taking note: ‘finally, someone that not only talks the talk, but will also walk the walk.’ Whether or not people ‘Stand with Rand,’ Senator Paul is proving he will stand with the people.”\nUPDATE, 4:36 PM: Former Florida Gov. Jeb Bush backs his brother’s legislation.\nKirsty Campbell, spokesperson for former Florida Gov. Jeb Bush and likely GOP presidential candidate, provided his comment regarding the Patriot Act during Sen. Rand Paul’s filibuster Wednesday afternoon.\n“In light of the growing terrorist threat to the United States, Governor Bush supports extending responsible intelligence and law enforcement authorities — including the NSA metadata program — in order to help keep us safe against the asymmetric terrorist threats facing our country.”\nUPDATE, 4:29 PM: Sen. Mike Lee (R-UT) has joined Paul on the Senate floor to back his filibuster.\nUPDATE, 4:23 PM: Sen. Rand Paul’s team has provided Breitbart News with a transcript of his first full hour of the filibuster, which is now close to entering its third hour and has bipartisan support. Here’s a video and transcript, courtesy of Sen. Paul’s office.\nWATCH:\nRead the complete transcript here:\nMr. President, there comes to a time in the history of nations when fear and complacency allow power to accumulate and liberty and privacy to suffer. That time is now. And I will not let the patriot act, the most un-patriotic of acts, go unchallenged. At the very least we should debate, we should debate whether or not we are going to relinquish our rights or whether or not we are going to have a full and able debate over whether or not we can live within the constitution or whether or not we have to go around the constitution. The bulk collection of all Americans’ phone records all of the time is a direct violation of the fourth amendment. The second appeals court has ruled it legal. The president began this program by executive order. He should immediately end it through executive order. For over a year now, he has said the program is illegal and yet he does nothing. He says, well, congress can get rid of the patriot act. Congress can get rid of the bulk collection and yet he has the power to do it at his fingertips. He began this illegal program. The court has informed him that the program is illegal. He has every power to stop it and yet the president does nothing. Justice Brandeis wrote that the right to be left alone is the most cherished of rights, most prized among civilized men. The Fourth Amendment incorporates this right to privacy. The Fourth Amendment incorporates this right to be left alone. When we think about the bulk collection of records, you might ask, well, maybe I’m willing to give up my freedom for security. Maybe if I just give up a little freedom I’ll be more safe.\nUPDATE, 3:58 PM: Rand Paul’s presidential campaign blasted out an email on Wednesday afternoon detailing how he has “SHUT DOWN” the Senate.\n“Senator Paul has SHUT DOWN the Senate,” Paul’s campaign wrote to supporters. “He’s in hour 2 of his filibuster to stop illegal domestic spying.\nPaul’s campaign added that establishment politicians in Washington—like Senate Majority Leader Mitch McConnell, Paul’s Kentucky colleague—are “fuming.”\n“Establishment politicians in Washington are fuming,” Paul’s campaign wrote. “They were counting on jetting back home after sneaking through a renewal of the so-called ‘PATRIOT Act’ and the NSA’s illegal bulk data collection program ahead of a holiday weekend.”\nPaul, his campaign wrote, “is holding the floor because the Bill of Rights is non-negotiable.”\n“He’s standing for our right not to have our phone records illegally intercepted by the government,” his campaign wrote. “He’s standing for our right to be free from warrantless search and seizure.”\nUPDATE, 3:57 PM: An aide to Sen. Mike Lee (R-UT) told Breitbart News that the Utahan, one of the key conservative movement leaders in the Senate, supports Paul’s filibuster and will be joining him on the Senate floor around 4 p.m.\nUPDATE, 3:50 PM: The filibuster has become bipartisan. Sen. Ron Wyden (D-OR) has joined Paul on the floor. “Liberty and security are not mutually exclusive,” Wyden said when he noted he’s “very pleased” with Paul standing up for Americans’ civil liberties against the government. “We can have both.”\nWyden is also talking about the Obamatrade bill — which may be in jeopardy because of this effort by Paul — and warned that Senate Majority Leader Mitch McConnell may try to “sneak” through the Senate an extension of the PATRIOT Act’s controversial Section 215, the source of the NSA’s bulk data collection program.\nUPDATE, 3:45 PM: The Justice Department sent a notification on Wednesday to lawmakers, which warned National Security Agency “will have to wind down its bulk collection of Americans’ phone records by the end of the week if Congress fails to reauthorize the Patriot Act.”\nThe Associated Press reports that the law expires June 1, and the notification sent by the DOJ listed the powers that will expire, along with actions the NSA must take to avoid legal challenges.\nUPDATE, 3:35 PM: Sen. Rand Paul’s tie has become an issue of discussion on social media during his filibuster.\nPillar of Law Institute’s Stephen Klein and a Federalist Society Member says he is nearly certain that Paul is wearing a Federalist Society James Madison tie. Others on Twitter suggested he was wearing the Leadership Institute’s Adam Smith tie.\n“Federalist Society does not take positions on issues but provides an important forum for discussing them. Members’ opinions span from being wholeheartedly for the Patriot Act to staunchly opposing it. But I think everyone will agree it’s an important topic for discussion, and welcome Senator Paul sporting James Madison’s silhouette this afternoon on the Senate floor,” Klein told Breitbart News.\nUPDATE, 3:22 PM: Randy Barnett, Georgetown law professor, Director of Georgetown Center for the Constitution, and author of Restoring the Lost Constitution is known for his challenge of Obamacare.\nHe has latched on to Sen. Rand Paul’s filibuster, tweeting on the issue every few minutes since the filibuster began.\nIt is kind of impressive how much a doctor like @RandPaul has learned and thought about constitutional law. — Randy Barnett (@RandyEBarnett) May 20, 2015\n>@RandPaul is now going after civil asset forfeiture, mainly used against the poor. Praises the Institute for Justice @IJ — Randy Barnett (@RandyEBarnett) May 20, 2015\n>@RandPaul is criticizing Smith v. Maryland which has been interpreted to allow govt to seize any 3d party business record without a warrant — Randy Barnett (@RandyEBarnett) May 20, 2015\nHad to order room service lunch here at 10th Cir. Judicial Conference in Sante Fe so I can listen to @RandPaul filibuster bulk data seizure. — Randy Barnett (@RandyEBarnett) May 20, 2015\nUPDATE, 3:18 PM: Paul has now crossed the two full hour mark, having first taken the floor at 1:18 p.m. It’s unclear how long Paul is planning to go for, but he has said he will speak as long “as my legs can stand.”\nUPDATE, 3:15 PM: According to a poll released on Monday, most Americans oppose the Patriot Act.\nThe NSA has used it as a basis to permit spying, arguing that it is not illegal.\nRoughly 60 percent of Americans say the Patriot Act should be reformed “to limit government surveillance and protect Americans’ privacy.”\nStill, 34 percent of Americans support the Act. They believe “it has been effective in keeping America safe from terrorists and other threats to national security like ISIS or Al Qaeda.”\nRNIF reported on the poll Tuesday:\n“Signed into law by former President George W. Bush, USA PATRIOT Act (Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism Act of 2001) is an Act of Congress that followed September 11 attacks in New York City. US officials maintain that the practice is limited purely to tracking terrorists. Unless the Congress acts, the act would expire on June 1.”\nUPDATE, 3:05 PM: The hawkish Rep. Peter King (R-NY) scoffed at Paul:\nRand Paul's rant on senate floor vs NSA more irrational than ever – very damaging to American security! Why does anyone listen to him? — Rep. Pete King (@RepPeteKing) May 20, 2015\nPaul highlighted the Drudge Report’s lead:\nUPDATE, 3:00 PM: Establishment Republicans are terrified of Paul on both drones and NSA surveillance of Americans. Sen. Lindsey Graham (R-SC), who is considering running for president with the express goal of trying to stop Paul in his home state of South Carolina, said this past weekend that he would be 100 percent open to using drones against Americans on American soil.\n“If I’m president of the United States and you’re thinking about joining al-Qaeda or ISIL [Islamic State], I’m not gonna call a judge,” Graham said, essentially attacking Paul’s last filibuster from 2013 against drone strikes against Americans on American soil. “I’m gonna call a drone and we will kill you.”\nPaul won that fight, forcing now former but then Attorney General Eric Holder to admit in writing that the federal government does not have the authority to use a drone to kill an American citizen on American soil.\nEarlier this week, New Jersey Gov. Chris Christie—another establishment politician considering running for president—defended the NSA bulk data collection of Americans with outside-the-mainstream rhetoric in New Hampshire on Monday.\n“All these people are talking about liberty,” Christie said, according to Scott Conroy of the Huffington Post. “How did that attack steal our liberty? We acted differently. We conducted our lives differently. We were reticent. We were scared.”\nChristie went further in his follow-up comments.\n“And there are going to be some who are going to come before you and are going to say, ‘Oh, no, no, no. This is not what the Founders intended,’” he said. “The Founders made sure that the first obligation of the American government was to protect the lives of the American people, and we can do this in a way that’s smart and cost-effective and protects civil liberties. But you know, you can’t enjoy your civil liberties if you’re in a coffin.”\nIt’s no doubt that both Graham’s and Christie’s comments were directed squarely at Paul—the only 2016 Republican presidential hopeful who’s been consistently competitive with former Secretary of State Hillary Clinton in polling. It’s unclear how those establishment Republicans will react to Paul’s newest filibuster, but Paul blew them all away last time.\nUPDATE, 2:59 PM: See video of Paul explaining the filibuster shortly before he took to the Senate floor:\nUPDATE, 2:54 PM: Rand Paul’s campaign email to supporters:\n“Senator Paul is a staunch defender of liberty and believes Americans have a right to privacy. The U.S. government has no place conducting these warrantless searches and should focus on gathering intelligence on suspected terrorists and foreign actors.”\nUPDATE, 2:50 PM: Paul’s ex-attorney Brian Darling writes a birthday wish on Human Events, the conservative newspaper:\n“It is my birthday today. I only want a few presents for my birthday. First, I want the government to stop issuing General Warrants so they can’t look at whom I call and for how long. Next I would like the battle of Kentucky raging right now between Senators Rand Paul versus Mitch McConnell to result in a big win for Rand Paul and the Bill of Rights. Finally, I would like an America where all citizens are treated as free people, not as possible terrorist threats. Is that too much to ask?”\nUPDATE, 2:44 PM: Rand Paul calls for “rebellion” against government over this, and people should be saying “enough’s enough.”\n“Where is the outrage?” Paul asked. He noted that he thinks “young people” in America tend to get it, as well. He also asked Americans if they want the government to know everything about everybody all the time.\nUPDATE, 2:41 PM: Sen. Rand Paul (R-KY) is filibustering the Patriot Act to stop NSA spying and has been on the Senate floor for roughly one hour.\nAccording to the Daily Caller, Rand Paul supporters got a campaign email, which was posted on Twitter by a reporter from Time magazine, issuing a statement from the Senator.\n“I will not rest. I will not back down. I will not yield one inch in this fight so long as my legs can stand,” Paul’s statement read.\nThe GOP presidential candidate has made the Fourth Amendment and the Right to Privacy major issues during his presidential campaign.\nJust this week, Paul held a press conference in Philadelphia Monday where he called for President Obama to end the NSA spying program.\n“Here in front of Independence Hall, I call for the president to obey the law,” Paul said. “The court said last week that it is illegal to collect all of your phone records, all of the time, without a warrant with your name on it. I call on the president today to immediately end the bulk collection of our phone records.”\nUPDATE, 2:23 PM: Sen. Rand Paul (R-KY) tweeted out notifying his supporters — #StandWithRand — that he launched his filibuster to end NSA spying roughly 40 minutes ago.","url":"https://www.breitbart.com/politics/2015/05/20/live-updates-rand-paul-takes-control-of-senate-floor-to-filibuster-patriot-act/"}
