{"authors":[],"date_download":"2018-10-30 14:31:28","date_modify":"2018-10-30 14:31:28","date_publish":"2015-07-01 00:00:00","description":null,"filename":"data/vaneerConsumption/RandPaulsolicitsdonationsfromdrugdealers.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_rand_paul_solicits_donations_from_drug_dealers_1540909888.html","title":"Rand Paul solicits donations from drug dealers","title_page":"Rand Paul solicits donations from drug dealers","title_rss":"NULL","source_domain":"americanthinker.com","text":"In the movie Scarface, Colombian drug lord Alberto Sosa hires Tony Montana to kill someone who is about to expose his connections to politicians. Back in those days, it didn't look good for politicians to be seen receiving money from drug dealers, for obvious reasons.\nRepublican presidential candidate Rand Paul courted donors from the new marijuana industry Tuesday, making the Kentucky senator the first major-party presidential candidate to publicly seek support from the legal weed business. Paul's fundraiser at the Cannabis Business Summit - tickets started at $2,700, the maximum donation allowed for the primary contest - came as the marijuana industry approached its first presidential campaign as a legal enterprise. The candidate entered the closed-door fundraiser through a private hallway, instead of visiting the convention floor or meeting pot business owners who weren't donating to him. In public remarks after the fundraiser, Paul didn't mention marijuana and didn't take questions from most reporters\nWhat do you think the drug dealers are expecting for their donations?\nPaul has embraced state marijuana experiments, while other candidates have either taken a wait-and-see approach or expressly vowed to challenge state legalization efforts.\nMany studies have shown medical marijuana to be a fraud. It's all about getting high.\nPaul has joined Democrats in the Senate to sponsor a bill to end the federal prohibition on the use of medical marijuana. He also backs an overhaul of federal drug-sentencing guidelines, along with a measure to allow marijuana businesses to access banking services.\nPaul wants to make it easier for pot dealers to do business, and he wants to release a lot of drug dealers, not just ones who were caught selling pot.\nI think of marijuana as the \"gateway crime.\" Once we legalize that, people will call to legalize all kinds of dangerous drugs because, after all, don't people have the right to control their own bodies? The problem with that, of course, is that these substances are highly addictive, prevent people from holding down jobs, and give strong chemical incentives for people to commit crimes to support their habits.\nIf Rand is so proud of his pot dealer friends, why do you think he made \"closed door\" remarks and refused to take questions from reporters?\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/rand_paul_solicits_donations_from_drug_dealers.html"}
