{"authors":[],"date_download":"2018-10-30 18:05:36","date_modify":"2018-10-30 18:05:36","date_publish":"2016-03-15 17:55:00","description":"Can art save the world?That’s Rand Suffolk’s stretch goal.The new Nancy & Holcombe T. Green Jr. director of the High Museum of Art, Suffolk arrived last fall to take the reins of the Southeast’s largest art museum.","filename":"data/vaneerConsumption/RandSuffolknewdirectoratHighMuseumpaintsabeautiful.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/15/Images/photos.medleyphoto.9025379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_1fc1ff1a94896ea74b77d9c86179cfde__1540922736.html","title":"Rand Suffolk, new director at High Museum, paints a beautiful...","title_page":"Rand Suffolk, new director at High Museum, paints a beautiful...","title_rss":"NULL","source_domain":"ajc.com","text":"Can art save the world?\nThat’s Rand Suffolk’s stretch goal.\nThe new Nancy & Holcombe T. Green Jr. director of the High Museum of Art, Suffolk arrived last fall to take the reins of the Southeast’s largest art museum.\nHe’s still debriefing his curators, exploring the High’s 15,000-piece permanent collection and learning the lay of the Midtown landmark. But he’s already overseen a rash of acquisitions, and has set his sights on some lofty aims.\n“What happens if the High becomes the one place in Atlanta where all Atlantans will feel comfortable coming together?” said Suffolk, 48, during a conversation in a meeting room of the Renzo Piano wing of the High. He was nicely turned out in a pin-neat jacket and tie, as sharp and coordinated as the Ellsworth Kelly color-field painting in the High’s atrium.\nThe High could be that kind of meeting place, Suffolk said.\nArt museums can introduce people to alternative viewpoints, generate conversation, promote creativity, spark empathy — “these are the traits of all good human beings,” Suffolk said. “Art museums have an opportunity to effect positive social change in the community,” and that’s what he wants to see happen in Atlanta.\nSuffolk came to Atlanta from the Philbrook Museum of Art in Tulsa, Okla., a museum housed in an Italianate mansion built in 1927 by an oil millionaire. His wife Susan Weber Suffolk (nicknamed “Sweb”) and his daughter Piper should arrive in Atlanta shortly.\nThe Philbrook is distinguished by its 23 acres of gardens and by its signature architecture. The Philbrook also did a good job of creating a connection between the museum and the community. That’s Suffolk’s overarching goal for the High.\nSuffolk arrived last Nov. 2 to replace Michael Shapiro, who had been director for the previous 15 years, leading the High through a period of rapid growth.\nShapiro mentioned, at the time, that he might write a book about the path that draws art lovers into the role of museum directorship. Shapiro did write the book, and visited the High last month to talk about it.\nSuffolk has a few key areas he wants to focus on:\nCapturing a bigger audience:\n“We’re averaging 350,000, 400,000 attendance for the past decade,” while metro Atlanta has added a few million in population. “It should have expanded,” said Suffolk.\nCreating ‘multiple gateways’\nA year ago last fall, the museum won a Luce Foundation grant to digitize part of its American Art collection. Since then the High has created a database of about 1,000 high-resolution images — including many 360-degree images — that will allow viewers around the world to see parts of the collection remotely.\nSuch a database is one “arrow in the quiver” to get people familiar with the High. “We want people to have access,” said Suffolk.\nShowcase the permanent collection\nThe High has attracted large audiences for traveling shows, such as the two that the museum is hosting currently, one on Jean-Michel Basquiat and the other on Brazilian photographer Vik Muniz.\nThis won’t change. “We will always have a lot of stuff going on,” said Suffolk. But the permanent collection “is the anchor for who we are, and lends distinction to the organization.”\nHe praised Shapiro for almost doubling the collection. “We’ve added 6,000 objects in the last 10 years,” he said. “That’s a lot of material to be brought in.”\nOne of those works was a photograph by Muniz, “Vik, 2 Years Old.” The artist created an image of his own youthful face by assembling (and photographing) a collage of found photos. The Muniz print was one of several purchases announced during the museum’s annual “Collector’s Evening,” held in January.\n“I think the organization is very well-positioned for the future,” said Suffolk. “People are moving in to town, there is a lot of positive energy. Midtown is getting 6.1 million tourists a year. How can we do a more effective job of getting into that?”","url":"https://www.ajc.com/entertainment/arts--theater/rand-suffolk-new-director-high-museum-paints-beautiful-picture/AvRC0QeoIHSxz4V4hyUhUP/"}
