{"authors":[],"date_download":"2018-10-22 22:59:23","date_modify":"2018-10-22 22:59:23","date_publish":"2014-06-11 17:35:08","description":"\"We're trapped in a word that means different things to different people,\" he said Wednesday.","filename":"data/vaneerConsumption/RandPaulAmnestyaMuddledTermthatHasTrappedGOP.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/502681/republicans_rand_paul-jpeg-04ff3_0a8aa638d40db0838d635192c1c80e1b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_immigration_rand-paul-amnesty-muddled-term-has-trapped-gop-n128611_1540249163.html","title":"Rand Paul: 'Amnesty' a Muddled Term that Has 'Trapped' GOP","title_page":"Rand Paul: 'Amnesty' a Muddled Term that Has 'Trapped' GOP ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKentucky Republican Sen. Rand Paul said Wednesday that the term \"amnesty\" –- a charge often levied in clashes between the Tea Party and pragmatic wings of the GOP -- has \"trapped\" the Republican Party.\n\"I think we’ve been somewhat trapped by rhetoric and words, and amnesty is a word that's kind of trapped us,\" Paul told reporters on a conference call organized by the Partnership for a New American Economy, a pro-immigration reform group.\n\"We're trapped in a word that means different things to different people, and the people who are opposed to all reform think amnesty means everything, and then other people think amnesty means another thing,\" Paul added. \"And I really think that some of it is we're trapped in is rhetoric and that we have to get beyond that.\"\nPaul, who supports some aspects of an immigration overhaul but voted against the bipartisan Senate reform bill passed last year, said he stands by his position on the issue. And he disputed the notion that the surprising defeat of top Republican Eric Cantor in Tuesday night’s primary is a clear-cut sign that immigration reform is too politically fraught for Republicans this year.\nCantor lost to little-known Tea Party candidate Dave Brat, who used the majority leader’s support for a moderate immigration proposal as a wedge issue in the campaign.\nBut Paul pointed to last night’s other big primary contest in South Carolina, where Sen. Lindsey Graham – an original backer of the Senate’s comprehensive immigration bill – easily defeated six primary challengers.\n\"Maybe the issue [immigration] isn't a paramount issue and so maybe it's hard to draw complete conclusions just on the one issue,” he said.\nNBC's Carrie Dann contributed.","url":"https://www.nbcnews.com/politics/immigration/rand-paul-amnesty-muddled-term-has-trapped-gop-n128611"}
