{"authors":["Ian Hanchett"],"date_download":"2018-10-30 19:21:58","date_modify":"2018-10-30 19:21:58","date_publish":"2015-05-22 03:32:20","description":"Rand Paul argued that the NSA's broad surveillance \"is what our Founding Fathers fought the Revolution over\"","filename":"data/vaneerConsumption/RandNSASurveillanceLikeWhatOurFoundingFathersFoughttheRevolutionOver.json","image_url":"https://media.breitbart.com/media/2015/05/Rand-521-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_21__1540927318.html","title":"Rand: NSA Surveillance Like 'What Our Founding Fathers Fought the Revolution Over'","title_page":"Rand: NSA Surveillance Like 'What Our Founding Fathers Fought the Revolution Over' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Kentucky Senator and Republican presidential candidate Rand Paul argued that the NSA’s broad surveillance “is what our Founding Fathers fought the Revolution over” on Thursday’s “Hannity” on the Fox News Channel.\nRand said, “This is what our Founding Fathers fought the Revolution over is that the government shouldn’t be allowed to have a blanket warrant or a generalized warrant to collect all of our records. And so, I think if we have enough influence, and enough people go to randpaul.com, I think we can have an influence. Already, they said they weren’t going to give us any amendments. Now it looks like maybe we will get to amend the Patriot Act.”\nRand also responded to Jeb Bush’s defense of the Patriot Act, stating, “Well, I think the violation of our civil liberties is in the collection of the data. We’re not alleging that the people who work in the NSA are bad people, that they have bad motives, that they’re unpatriotic. We’re just alleging that the government, on occasion, has historically abused the rights of citizens. We did it during the Civil Rights Era to civil rights leaders. We did it during the Vietnam Era. We did it to Japanese-Americans during World War II. So, the danger is in letting government collect so much information. And also, the danger is that the Fourth Amendment, which our Founders were very proud of, said that you have to write an individual’s name on the warrant, and that if you write the name Verizon, and you collect all the records from the company Verizon, that’s not a very specific way of doing things, it’s not individualized. And you’re not going after people we’re suspicious of, we’re just going after everybody’s records, and that’s an invasion of privacy.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/05/21/rand-nsa-surveillance-like-what-our-founding-fathers-fought-the-revolution-over/"}
