{"authors":["Tony Lee"],"date_download":"2018-10-30 18:53:04","date_modify":"2018-10-30 18:53:04","date_publish":"2014-08-15 02:27:00","description":"After another night of violent confrontations between police and demonstrators in Ferguson, Missouri, Sen. Rand Paul (R-KY) argued Thursday that big |","filename":"data/vaneerConsumption/RandPaulPoliceMilitarizationMakesAmericansEspBlacksFeelGovtIsTargetingThem.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Law-Enforcement/ferguson-swat-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_08_14__1540925584.html","title":"Rand Paul: Police Militarization Makes Americans, Esp. Blacks, Feel 'Gov't Is Targeting Them'","title_page":"Rand Paul: Police Militarization Makes Americans, Esp. Blacks, Feel 'Gov't Is Targeting Them' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After another night of violent confrontations between police and demonstrators in Ferguson, Missouri, Sen. Rand Paul (R-KY) argued Thursday that big government has gone too far in militarizing local police forces.\nAhead of a potential 2016 presidential run, it was another chance for Paul’s liberty-centered philosophy to appeal to libertarians and black voters.\nAfter police shot and killed an unarmed black teenager over the weekend, Ferguson residents rioted, looted, and protested this week. The police response has escalated each day, with police on Wednesday firing pepper spray and tear gas and arresting two D.C. journalists.\n“Americans must never sacrifice their liberty for an illusive and dangerous, or false, security,” he wrote in a Thursday op-ed for Time. “The outrage in Ferguson is understandable–though there is never an excuse for rioting or looting. There is a legitimate role for the police to keep the peace, but there should be a difference between a police response and a military response. The images and scenes we continue to see in Ferguson resemble war more than traditional police action.”\nPaul noted that he has championed the cause of more liberty for years and said that “not surprisingly, big government has been at the heart of the problem” because “Washington has incentivized the militarization of local police precincts by using federal dollars to help municipal governments build what are essentially small armies–where police departments compete to acquire military gear that goes far beyond what most of Americans think of as law enforcement.”\n“When you couple this militarization of law enforcement with an erosion of civil liberties and due process that allows the police to become judge and jury–national security letters, no-knock searches, broad general warrants, pre-conviction forfeiture–we begin to have a very serious problem on our hands,” he wrote. “The militarization of our law enforcement is due to an unprecedented expansion of government power in this realm. It is one thing for federal officials to work in conjunction with local authorities to reduce or solve crime. It is quite another for them to subsidize it.”\nPaul said that “it is almost impossible for many Americans not to feel like their government is targeting them,” and “given the racial disparities in our criminal justice system, it is impossible for African-Americans not to feel like their government is particularly targeting them.”\n“Anyone who thinks that race does not still, even if inadvertently, skew the application of criminal justice in this country is just not paying close enough attention,” he argued. “Our prisons are full of black and brown men and women who are serving inappropriately long and harsh sentences for non-violent mistakes in their youth.”\nPaul, who has spoken at historically black colleges and universities and has supported sentencing reforms with Sen. Cory Booker (D-NJ), said much of the militarization has been “done in the name of fighting the war on drugs or terrorism.” He cited the Heritage Foundation’s Evan Bernick, who wrote that “the Department of Homeland Security has handed out anti-terrorism grants to cities and towns across the country, enabling them to buy armored vehicles, guns, armor, aircraft, and other equipment.” That has, according to Bernick, enabled “federal agencies of all stripes, as well as local police departments in towns with populations less than 14,000, [to] come equipped with SWAT teams and heavy artillery.”\nPaul said that had he “been told to get out of the street as a teenager, there would have been a distinct possibility that I might have smarted off. But, I wouldn’t have expected to be shot.”\n“Let us continue to pray for Michael Brown’s family, the people of Ferguson, police, and citizens alike,” he concluded.","url":"https://www.breitbart.com/politics/2014/08/14/Rand-Paul-Police-Militarization-Makes-Americans-Esp-Blacks-Feel-Gov-t-Is-Targeting-Them/"}
