{"authors":["John Mcgarry For The Scottish Daily Mail"],"date_download":"2018-10-22 21:03:42","date_modify":"2018-10-22 21:03:42","date_publish":"2016-01-11 00:08:59","description":"EXCLUSIVE - JOHN MCGARRY: Rangers manager Mark Warburton hopes to add 17-year-old Barnet striker Matt Stevens to his list of summer recruits.","filename":"data/vaneerConsumption/RangersbossMarkWarburtonplotstolandBarnetsteenagestrikerMattStevens.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/22/2FFE709D00000578-0-image-a-6_1452466072128.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393073_Rangers-boss-Mark-Warburton-plots-land-Barnet-s-teenage-striker-Matt-Stevens_1540242222.html","title":"Rangers boss Mark Warburton plots to land Barnet's teenage striker Matt Stevens","title_page":"Rangers boss Mark Warburton plots to land Barnet's teenage striker Matt Stevens  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rangers manager Mark Warburton hopes to add Barnet striker Matt Stevens to his list of summer recruits.\nThe 17-year-old has broken into the Hive’s first-team squad this season after being prolific with the club’s youth team but is out of contract in the summer.\nWarburton — whose side booked their place in fifth round of the Scottish Cup on Sunday with a comfortable 5-1 victory over Cowdenbeath — hopes to persuade the player to join Josh Windass and Matt Crooks at Ibrox after the pair agreed to join once their deals with Accrington Stanley expire.\nRangers manager Mark Warburton hopes to add Barnet striker Stevens to his list of summer recruits\nStevens has only made a handful of appearances for Martin Allen’s League Two side but already he is being touted as a player with a huge future in the game.\nSwansea had a £250,000 bid for him turned down last year while both Manchester United and Manchester City are believed to be tracking him although neither club has yet formalised their interest.\nThe teenager is the identikit of the players Warburton is attempting to build his Ibrox tenure on – young with potential that offer good future value in the transfer market.\nThe acquisitions of former Wigan pair James Tavernier and Martyn Waghorn have been the highlights of his dealings so far.\nIn fact, such is Waghorn’s impact that he has now set his sights on becoming the first Rangers player since Ally McCoist to score 40 goals in a season after reaching the quarter-century mark with a hat-trick on Sunday.\nThe 25-year-old has reached 25 goals quicker than anyone else in senior British football this term but still feels he has much more to come.\nAsked if he could reach the 40-mark – a feat last achieved at Ibrox by McCoist in season 1992-93 – Waghorn replied: ‘I think I could. There are still a lot of games to be played. It’s up to me how clinical I am with the chances I get.\n‘I’m going to take one game at a time. I’ll leave the door open to see how many I can get.\n‘When I came here, I targeted 20 to 25 for the season and I am pleased that I can go past that.\n‘I think was about eight years old when I last scored 25 goals in a season! That was probably back in the day at Sunderland’s academy. I’ve not done it in my professional career. My most was 12 or 13.\nMartyn Waghorn (right) scored a hat-trick as Rangers beat Cowdenbeath 5-1 on Sunday\nWaghorn slots his second penalty of the afternoon in the Scottish Cup fourth-round clash at Ibrox\n‘It’s very pleasing for me but I felt I could have had more today. I want to keep working to get better and hopefully improve on that tally.’\nWarburton, who declined to comment on a move for Brentford midfielder Toumani Diagouraga, hailed Waghorn’s progress.\n‘The more often he plays, the greater his belief in his ability and he’ll get better and better,’ said the Ibrox manager.","url":"https://www.dailymail.co.uk/sport/football/article-3393073/Rangers-boss-Mark-Warburton-plots-land-Barnet-s-teenage-striker-Matt-Stevens.html"}
