{"authors":["Stephen Mcgowan For The Scottish Daily Mail"],"date_download":"2018-10-22 22:15:11","date_modify":"2018-10-22 22:15:11","date_publish":"2017-03-10 00:25:53","description":"Three years as an assistant in Portuguese football grants Cathro a greater insight into the pitfalls facing the new manager of Rangers than most. Caixinha is due to take over next week.","filename":"data/vaneerConsumption/RangersnewbossCaixinhahastoadaptsaysIanCathro.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3DF4F98C00000578-0-image-a-138_1489105532794.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4299546_Rangers-new-boss-Caixinha-adapt-says-Ian-Cathro_1540246511.html","title":"Rangers' new boss Caixinha has to adapt, says Ian Cathro","title_page":"Rangers' new boss Caixinha has to adapt, says Ian Cathro  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Asked what aspect of Scottish life might test Pedro Caixinha most, Ian Cathro's response is unexpected.\n'The fact it's difficult to go somewhere and have a really good Espresso at eight or nine o'clock at night,' he says. 'The fact that life ends here at 5pm.\n'If you don't cram in everything you need to do here before 5 o'clock, you've had it. There is no more life after that time.'\nAl Gharafa have given Pedro Caixinha permission to become the new Rangers manager\nThe head coach of Hearts is joking. Partly.\nYet three years as an assistant in Portuguese football grants Cathro a greater insight into the pitfalls facing the new manager of Rangers than most.\nBetween 2012 and 2014, the 30-year-old Scot worked for Rio Ave in the Portuguese league. Then spent a year in La Liga with Valencia.\nCathro's recollections of the new Rangers manager are vague to non-existent. He suspects they might have crossed paths as opposing coaches once, but can't be sure.\nNeither does he profess to know a great deal about the riskiest managerial appointment in Ibrox history. Or how the new man might work.\nDrawing on his taste of continental coaching, however, Cathro already knows this much. To the outsider, Scottish football can be a culture set in its ways.\nAlly McCoist, a Rangers icon, has already expressed the view that a planned restructuring of the Ibrox management to incorporate a director of football is 'absolute garbage.' By publicly suggesting the Rangers board should have turned to Derek McInnes, former manager and chairman Walter Smith came as close as he might to a mild rebuke.\nThe Qatari club suggested allowing Caixinha to join Rangers made financial sense\nWhere Caixinha is concerned, former players - including most vocally Derek Ferguson - are sceptical. Media reaction has been lukewarm at best. Supporters are underwhelmed.\nOf all the concerns expressed, one is more persistent than most. Coaches with little or no experience of British football or the intense, throbbing pressure which comes with managing Rangers have a tendency to flounder. The ghost of Paul Le Guen hovers over Caixinha's shoulder.\nCathro was born and bred in Dundee. After re-learning football through the Portuguese eyes of former colleague Nuno Espirito, however, he admits the readjustment to Scottish football has been a testing business. The game here is unique.\n'The ball being in the sky a little bit more often takes some getting used to,' he adds. 'But a lot of the time it's simple life things.\n'You come in to the football club at first and you will get that coffee, because you will be in the office. You just make it yourself.\n'But life is different here. It's certainly different.'\nCathro has spent little time fretting over the guessing game surrounding Caixinha's arrival date, even if he did contribute hugely to the demise of Mark Warburton the night his Hearts side inflicted a humiliating 4-1 defeat on Rangers.\nIan Cathro, the Hearts coach, says Caixinha will struggle to adapt to Scottish lifestyle\nHe is more reluctant to contribute to the debate over Caixinha's arrival or whether it might work.\nWhen he landed the Hearts job, Cathro was met with something close to hostility. An intense, heated debate over Scottish football's 'old guard' ensued. Without saying a word, the former SFA coach found himself at the heart of an idealistic debate over the future of Scottish football.\nThe restructuring at Rangers could have a similar impact, forcing people once more to overcome their suspicion of directors of football.\nOn Caixinha, however, Cathro offers nothing stronger than a shrug.\n'I have not followed the story closely. I might have been involved in a game against him once when he was assistant. I'm not sure.\n'But I have not crossed paths with him to any great degree.'\nHe is more forthcoming on the difficulties facing a Portuguese in Scotland.\n'The media scrutiny is probably similar,' he ponders.\nSeason at a glance Live tables\nFixtures\nScores Scottish Premiership\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\n'But in Portugal you have three daily newspapers (A Bola, O Jogo, Record) which are solely about football.\n'They talk more about actual football.\n'Everyone's tactics and teams and technical ways are placed under more scutiny than here and talked about by more people.\n'Forgive me if this sounds negative, but here we are more headline-driven. Story driven.\n'They have three daily newspapers they have to fill with football alone so naturally they have to go a bit deeper into things.\n'There is more discussions of tactics, line-ups, systems.'\nCaixinha's media strategy will be one of the main fascinations following his arrival. In conducting background checks, directors heard time and again that the 46-year-old takes no nonsense. He can be spiky when he needs to be and fights his corner, but bears a thicker skin than his sensitive predecessor Warburton.\nAsked if he has any specific advice for the new man, Cathro shakes his head.\n'I'm the 30-year-old rookie. I'm not about to give anybody advice.\n'Anybody coming into our place is nothing to do with me. It's for them to deal with.'\nGraeme Murty will take charge of his final game as Rangers interim manager against Celtic\nEven so, there can be no denying a basic fact. After his communication skills and personality were queried by fellow pros Kris Boyd, Stephen Craigan and Jamie Fullarton, Cathro knows how it feels to have the finger of suspicion jabbing his way.\n'Yeah, of a Scot in Scotland...' he grins. 'Suspicion does exist.\n'But most people who have come into that situation are not coming into that for the very first time.\n'Most people who come here from outside have already been some place else. These guys are ready to deal with these things. They can handle it.'\nCaixinha has worked in Greece, Mexico, Saudi Arabia and Qatar. Coaches who opt for the lucrative Middle East circuit face more suspicion than most. A career graveyard.\nNow Caixinha has been granted the kind of opportunity to manage a major European club which looked beyond him. His career, bearing 10 jobs in 12 years, shows a reluctance to settle anywhere. He doesn't hang around jobs long.\nYet senior Rangers figures explain their choice in simple terms.\nAfter years in the lower leagues, this is where they are. The club must accept its limitations. Rangers can't land Jose Mourinho or even Ronald de Boer. Caixinha rarely hangs around anywhere too long, yet Rangers have a clear view on this. If the Portuguese can give them two good years before the feet start itching once more, it's a gamble worth taking.","url":"https://www.dailymail.co.uk/sport/football/article-4299546/Rangers-new-boss-Caixinha-adapt-says-Ian-Cathro.html"}
