{"authors":["Mark Wilson For The Scottish Daily Mail"],"date_download":"2018-10-22 22:07:25","date_modify":"2018-10-22 22:07:25","date_publish":"2017-03-10 00:22:20","description":"Celtic will be going for their fourth win in a row in the fixture under Brendan Rodgers, having also beaten Rangers 1-0 in the League Cup semi final in October and 2-1 at Ibrox in the league on Hogmanay.","filename":"data/vaneerConsumption/RangersGraemeMurtyurgesnofearatOldFirmDerby.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E09CC3B00000578-0-image-a-17_1489105282813.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4299510_Rangers-Graeme-Murty-urges-no-fear-Old-Firm-Derby_1540246045.html","title":"Rangers' Graeme Murty urges no fear at Old Firm Derby","title_page":"Rangers' Graeme Murty urges no fear at Old Firm Derby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rangers caretaker boss Graeme Murty urged his side not to be fearful as they return to Parkhead and the scene of their heaviest defeat of the season.\nUnder Mark Warburton, the Ibrox side were defeated 5-1 in September with Moussa Dembele grabbing the first Old Firm league hat-trick since 1966.\nOn Sunday, rampant Celtic will be going for their fourth win in a row in the fixture under Brendan Rodgers, having also beaten Rangers 1-0 in the League Cup semi final in October and 2-1 at Ibrox in the league on Hogmanay.\nRangers caretaker boss Graeme Murty urged his side not to be fearful as they return to Celtic\nIt's believed stand-in boss Murty has been told he will almost certainly remain in charge for the clash, with incoming manager Pedro Caixinha set to watch the showdown from a seat in the main stand at Celtic Park before being unveiled next week.\nAnd former Scotland and Reading defender Murty has called on his players to be mentally tough and make sure they don't wilt in the white-hot atmosphere in the east end of Glasgow.\n'It's not rocket science,' said the 42-year-old. 'You have to cope with what they (Celtic) are going to bring to the party and it's down to players supporting one another and actually embracing the challenge and not being fearful.\n'I've got a clear understanding of what it's going to take. I've got a clear understanding of some of the principles that I would like to instil in the players and a clear understanding in my mind of what it's going to take to get a positive result.\nIncoming manager Pedro Caixinha set to watch the showdown from a seat in the main stand\n'Regardless of any tactical changes or formations or anything, it's about players standing up at Parkhead. That's going to be vitally important.\n'The more I see of this game the more I'm convinced that we need to embrace more advanced techniques in getting into players' minds and their mind set and hoping they will be mentally stronger and be better decision makers under pressure - because that is what it comes down to.\n'The best players in the world make the best decisions 99 per cent of the time and that's why they are at the top of their profession.'\nMurty insists the Rangers players have learned tough lessons from their last visit to Parkhead. But he expects to see a different Celtic side, even stronger in certain areas, than in that 5-1 thrashing.\n'The game previously at Parkhead isn't something to be fearful of or to shy away from,' he told RangersTV.\n'It is something to learn from. If you are going to learn the lessons and move forward then that is really important. I do think, however, that Celtic have changed since then. I think they've evolved.\n'I think they've strengthened in certain areas. They do things slightly differently, so we have to just take what they are going to bring but try and understand that it's going to be about us and how we manage our expectations of our group.\n'I'm a big believer in acknowledging what other teams are good at to prepare fully. So you look at what they are good at and say: 'Fantastic' but then you say: 'This is what they are going to try and do and this is where their strengths are'. Then you make the players and yourself accountable to what happens after that.'\nMurty claims he has not given too much thought about taking the team at Parkhead for the biggest game of his fledgling coaching career.\nBut the interim boss - who became a social media sensation after doing a headstand in frustration during defeat at Dundee - has vowed to keep his own emotions in check.\n'I've just been thinking about making sure we get this week right, making sure we get players rested right and making sure we start to up the tempo of work right.\n'The closer the game comes, the more I will have to look at it. But I'll just carry on and make sure the players get what they need, because I'm sure that if I'm in the dugout there will be loads of emotions washing through me.\n'I have to make sure that the players get what they need. When I walk away from this role and I do whatever role I'm going to do, I have to take that lesson away. That the players who walk onto the football pitch get what they need 100 per cent of the time.\n'I've been guilty as a coach sometimes of being selfish and getting my frustrations out and you can't do that.'","url":"https://www.dailymail.co.uk/sport/football/article-4299510/Rangers-Graeme-Murty-urges-no-fear-Old-Firm-Derby.html"}
