{"authors":["Mark Wilson For The Scottish Daily Mail"],"date_download":"2018-10-22 20:12:52","date_modify":"2018-10-22 20:12:52","date_publish":"2016-01-29 00:41:32","description":"Billy King admits he is desperate to impress at Rangers after moving on loan from Hearts until the end of the season. The Scotland Under-21 man became Mark Warburton’s third signing of the window","filename":"data/vaneerConsumption/RangersnewboyBillyKingitchingtomakeanimpressionafterfinalisingseasonlongloanmovefromHearts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE216400000578-0-image-a-17_1454027689036.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421917_Rangers-new-boy-Billy-King-itching-make-impression-finalising-season-long-loan-Hearts_1540239172.html","title":"Rangers new boy Billy King itching to make an impression after finalising season-long loan move from Hearts","title_page":"Rangers new boy Billy King itching to make an impression after finalising season-long loan move from Hearts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Billy King admits he is desperate to impress at Rangers after moving on loan from Hearts until the end of the season.\nThe Scotland Under-21 winger became Mark Warburton’s third signing of the January window last night, undergoing a medical at Murray Park before finalising the quick-fire switch.\nKing made 20 appearances for the Tynecastle club this term, including 11 starts, but was anxious for more regular football.\nThe 21-year-old now hopes to shine in the Ibrox side’s push to reach the Premiership, which could potentially give Warburton food for thought over a permanent deal.\nRangers have announced the signing of Billy King from Heartson a loan deal until the end of the season\n‘As most people know, I wasn’t getting that much game time at Hearts and I was getting a little frustrated,’ said King, under contract at Hearts until 2017.\n‘I asked the gaffer [Robbie Neilson] if I could go on loan, and everything really just came about today.\n‘I’m delighted to be here, this is a massive club and it is a big opportunity for myself. I am on-loan until the summer, so hopefully I can make a big impression and we will see what happens then.’\nKing won the Championship with Hearts last term and follows Danny Wilson and Jason Holt in becoming the third ex-Tynecastle player to sign for Warburton.\nThe Ibrox boss had been seeking to recruit a further attacking option following Nathan Oduwa’s return to Tottenham.\nThe Scotland Under-21 winger arrived at Murray Park on Wednesday before completing a quick-fire switch\nHe became Mark Warburton’s third signing of the January window last nightcafter undergoing a medical\nRangers have had two bids rejected for St Johnstone’s Michael O’Halloran and it remains to be seen whether landing King means they will now wait until the summer before rekindling that interest.\nThe Hearts academy product goes straight into the squad for tomorrow’s crucial meeting with Falkirk, which gives the second-tier leaders a chance to open up an eight-point lead.\n’It will be brilliant and it will be a different experience for me,’ King told the Rangers website.\n‘It’s a massive stadium, the fans are brilliant and it’s always got a great atmosphere. I just can’t wait to get started.’\nKing is ineligible for Rangers’ Scottish Cup campaign – which continues against Kilmarnock next weekend – after coming off the bench in Hearts’ fourth round win over Aberdeen earlier this month. But he hopes his adaptability will suit Warburton’s system as they strive to attain a top-flight return.\nKing made 20 appearances for the Hearts this term, with 11 starts, but was anxious for more regular football\n‘I’ve come here with an open mind,' he added. 'I’ll work hard, do my best in training and give 100 per cent to hopefully get into the team.\n‘At Hearts I played wide, but there the gaffer usually only played one wide player. Here the manager likes to play two wide players and I think I have a good chance if I work hard in training.\n‘I can play anywhere behind the striker, too, in the “hole” position if you want to call it that, or I can play on the right or the left.’\nWarburton has already signed winger Harry Forrester from Doncaster and Polish goalkeeper Maciej Gostomski this month, but lost out on Toumani Diagouraga to Leeds United.\nRangers have also agreed pre-contract deals for Accrington Stanley midfielders Josh Windass and Matt Crooks to join in the summer.","url":"https://www.dailymail.co.uk/sport/football/article-3421917/Rangers-new-boy-Billy-King-itching-make-impression-finalising-season-long-loan-Hearts.html"}
