{"authors":["Brian Marjoribanks For The Scottish Daily Mail"],"date_download":"2018-10-22 20:17:31","date_modify":"2018-10-22 20:17:31","date_publish":"2016-01-29 00:59:25","description":"Mark Warburton has expressed trust in Rangers chairman Dave King and stated he is happy with the money available in the current transfer window. Rangers signed Hearts' Billy King on Thursday.","filename":"data/vaneerConsumption/RangershavethemoneybutwewontpayovertheoddsinsistsbossMarkWarburton.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AA501D00000578-0-image-a-78_1454028572658.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422031_Rangers-money-won-t-pay-odds-insists-boss-Mark-Warburton_1540239451.html","title":"Rangers have the money... but we won't pay over the odds, insists boss Mark Warburton","title_page":"Rangers have the money... but we won't pay over the odds, insists boss Mark Warburton | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mark Warburton has expressed trust in Rangers chairman Dave King and stated he is happy with the money available in the current transfer window.\nThe Ibrox club completed their third January signing on Thursday as Hearts winger Billy King agreed a loan deal until the end of the season.\nRangers’ ability in the transfer market had come under scrutiny recently after key midfield target Toumani Diagouraga joined Leeds United.\nRangers manager Mark Warburton is happy with the money available in the current transfer window\nRangers have announced the signing of Billy King from Heartson a loan deal until the end of the season\nA deal for St Johnstone’s Michael O’Halloran also appears to have stalled following two unsuccessful bids.\nThose issues led former Rangers striker Kris Boyd to warn this week that the club risked losing Warburton at the end of the season unless he was given more financial backing.\nThe 53-year-old is adamant, however, that he will only seek to complete transfers at a price he thinks is right.\n‘Any player we get has to be value,’ said Warburton. ‘Everyone is aware of the tough time the club has been through over the last four or five years.\n‘The last thing we can do is spend money inappropriately. The money is there. We are happy with that. If we find a player at the right value who will add quality, then we’ll move.\n‘But what we won’t do is pay over the odds for a player. Compare it to a house. If you are happy with the price, you go and move in. But you don’t pay over the top.\n‘If the house is worth £200,000 and they want £250,000, you are not going to pay it. You’ve got another £100,000 in the bank and you could go to £300,000, but you won’t do it.\n‘Why? Because if you do, then the next deal you do they will go a little bit more again. This is how we do our business. We have a valuation which we think is fair and, if you don’t want to do it, then no problem. You can’t show your hand.\nRangers chairman King has been in Scotland this week for a board meeting\n‘What we’ve been good at in the past, Frank (McParland), David (Weir) and myself, is bringing in young players who we think represent good value. We did it in the summer. I’m not saying that in an arrogant way.’\nChairman King has been in Scotland this week for a board meeting. Warburton confirmed he had met with their South African-based businessman to discuss their plans, with a focus on building ‘strong foundations’.\nThe former Brentford manager stressed during Thursday's Press conference that he trusted his existing squad to get the job done.\nHearts winger King agreed a loan deal with Rangers until the end of the season on Thursday\nAsked if he extended a similar trust to his chairman, Warburton replied: ‘Yes, of course. I haven’t lost a player I’ve asked for yet.\n‘If I had gone for five in the summer, got three, lost two and been arguing about others, then I could understand where you are coming from.\n‘But I wanted Wes Foderingham, Rob Kiernan, James Tavernier, Martyn Waghorn, Andy Halliday and Jason Holt. I got them.’\nIt was pointed out that Scott Allan surely qualified as one who got away, with Rangers having failed in three bids for the Hibernian midfielder before he joined Celtic.\nRangers’ ability in market had come under scrutiny after key target Toumani Diagouraga joined Leeds United\n‘If we think a player is worth a certain figure, then fine,’ responded Warburton. ‘If his club thinks otherwise, then no problem. What was being asked for the player wasn’t right, in our opinion.\n‘There was no issue there. The selling club has a right to put a price on it.’\nWarburton refused to expand on whether the same stance could be applied to Diagouraga.\n‘I’m never going to talk about players until they are here,’ he said. ‘That wouldn’t be right.’\nThe Ibrox boss also claimed to be unfussed by Boyd speculating about his future. Former Hearts midfielder Michael Stewart had offered a similar opinion earlier in the week.\n‘Pundits are pundits, they are being paid to say what they say,’ said Warburton. ‘For every pundit like Kris and Michael who said what they said, there are others lining up to say the manager and coaches are lucky to be at the club.\n‘There are loads of managers out of work, loads of good guys on the street not working.\n‘My job is to do the best for Rangers. This is not a profession where you can say I’ll be here in 10 years’ time. At one point down south, the average manager was lasting eight months in the Championship.\n‘This is a fantastic club and we’ve got a great opportunity here. If all parties get it right, we’ll be in a good place.’\nAndy Halliday banned for the Championship clash with Falkirk following a bizarre red card\nWarburton, meanwhile, is awaiting feedback from the SFA referees’ chief John Fleming over the bizarre dismissal that leaves Halliday banned for the Championship clash with Falkirk.\nThe midfielder was shown a second yellow card after referee Barry Cook deemed his clenched- fist celebration during Monday evening’s 2-0 win at Morton was a gesture that could ‘incite’ home fans.\n‘If you have a player cautioned for celebrating a goal, any player who pumps their fist, puts their fingers to their lips, runs down the middle of the park — it’s a farcical situation,’ said Warburton.\n‘I don’t want to see players picking up yellow cards and that’s why I’m using that word clarity. It’s important. We talk about referees and the one word we use as media, managers, coaches and players is consistency.","url":"https://www.dailymail.co.uk/sport/football/article-3422031/Rangers-money-won-t-pay-odds-insists-boss-Mark-Warburton.html"}
