{"authors":["John Nolte"],"date_download":"2018-10-30 18:46:15","date_modify":"2018-10-30 18:46:15","date_publish":"2015-10-06 13:11:36","description":"At an event honoring her \"Girls\" collaborator Judd Apatow, Lena Dunham stood before those gathered at the Rape Foundation Annual Brunch and complained |","filename":"data/vaneerConsumption/RapeHoaxerLenaDunhamComplainsAboutBacklashToHerOwnLies.json","image_url":"https://media.breitbart.com/media/2015/09/Lena-Dunham-Interview-2014-Emmy-Awards-Video.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_06__1540925175.html","title":"Rape-Hoaxer Lena Dunham Complains About 'Backlash' To Her Own Lies","title_page":"Rape-Hoaxer Lena Dunham Complains About 'Backlash' To Her Own Lies | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At an event honoring her “Girls” collaborator Judd Apatow, Lena Dunham stood before those gathered at the Rape Foundation Annual Brunch and complained about the “backlash” she faced after the serial lies about her alleged sexual assault were exposed. Like she was the victim of those lies, and not the man falsely accused in her memoir, Dunham said:\nWhen I decided to write about my experience with sexual assault, Judd was one of the first people that I shared the essay with. His notes were kind and considerate, and made the work infinitely stronger just as his support made me infinitely stronger when the story was met with backlash[.]\nIn her memoir, “Not That Kind of Girl,” Dunham claimed to have been raped by a campus Republican named Barry while attending Oberlin College.\nThe description of her rapist in the memoir, that pointed to a very real person, was all lies.\nAfter the evidence became incontrovertible, Dunham later confessed that it was all lies; that Barry was innocent.\nDunham also stood silently by for weeks as her highly publicized memoir indicted an innocent man for her alleged rape.rape,\nDunham knew her memoir had put an innocent man under a false suspicion, and she said nothing.\nWithout the backlash Dunham is currently crybabying about, a completely innocent man would still be living under Dunham’s false allegation that he was her rapist.\nNonetheless, despite her lies, despite her standing criminally and unforgivably silent as she got richer off book sales, Dunham is taken seriously and feted by sexual assault activists.\nA proven liar who falsely accuses an innocent of rape and who refuses to press charges against her actual rapist is a craven opportunist, not a sexual assault activist.\nAnd shame on People Magazine for reporting Dunham’s words without reporting the context behind the backlash. Stenography is not journalism.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/10/06/rape-hoaxer-lena-dunham-complains-about-backlash-to-her-own-lies/"}
