{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:00:47","date_modify":"2018-10-30 21:00:47","date_publish":"2015-06-24 18:45:36","description":"Rick Ross is in trouble with the law again. |","filename":"data/vaneerConsumption/RapperRickRossArrestedonKidnappingAggravatedAssaultCharges.json","image_url":"https://media.breitbart.com/media/2015/06/rapper-rick-ross-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_24__1540933247.html","title":"Rapper Rick Ross Arrested on Kidnapping, Aggravated Assault Charges","title_page":"Rapper Rick Ross Arrested on Kidnapping, Aggravated Assault Charges | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rick Ross is in trouble with the law again.\nThe rapper, real name William Leonard Roberts, 39, was arrested Wednesday morning at his Fayetteville, Georgia home along with his bodyguard, Nadrian James, 42, according to a Fayette County Sheriff’s Office release.\nRoss was arrested on charges of kidnapping, aggravated assault and aggravated battery, while James was arrested on kidnapping and aggravated battery charges.\nThe pair were arrested for an incident that happened on June 7, according to Atlanta CBS affiliate CBS46. Ross allegedly forced a man into a guest house at his home and held him there for several hours. The rapper allegedly beat the victim with a handgun.\nCBS reports that the as-yet-unidentified victim has lost the ability to chew food due to a severely injured jaw, and also has chipped teeth, a neck injury, and several cuts and bruises.\nAccording to Complex, the victim was a groundskeeper doing repairs on the rapper’s house.\nRoss and James were being held Wednesday at the Fayette County Jail. The Atlanta Journal-Constitution reports that both men have been denied bond, and will remain in jail until their initial hearing on July 1.\nThis is the second time in two weeks that Ross has had a run-in with the law; the rapper was arrested on June 10 for misdemeanor marijuana possession after authorities pulled over his Bentley for a tinted-windows violation and smelled marijuana in the car. Ross was also arrested on marijuana-related charges in 2008 and 2011.","url":"https://www.breitbart.com/entertainment/2015/06/24/rapper-rick-ross-arrested-on-kidnapping-aggravated-assault-charges/"}
