{"authors":[],"date_download":"2018-10-30 18:39:56","date_modify":"2018-10-30 18:39:56","date_publish":"2016-03-05 14:15:08","description":"At first, Paul Springer thought they were fireworks. “It was rapid fire,” he said Saturday, walking his dog near the crime scene at northwest Atlanta’s Street Execs Studios.","filename":"data/vaneerConsumption/RapperBankrollFreshkilledinshootingatAtlantastudio.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/05/Images/photos.medleyphoto.8903803.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_rapper-bank_b361700b3d022c45b3831af761705f37__1540924796.html","title":"Rapper Bankroll Fresh killed in shooting at Atlanta studio","title_page":"Rapper Bankroll Fresh killed in shooting at Atlanta studio","title_rss":"NULL","source_domain":"ajc.com","text":"At first, Paul Springer thought they were fireworks.\n“It was rapid fire,” he said Saturday, walking his dog near the crime scene at northwest Atlanta’s Street Execs Studios. “After a while, that quieted down, then there was some loud booms that I recognized as being gunfire. And machine guns.”\nThere were dozens of shots fired — and at least one hit popular Atlanta rapper Bankroll Fresh, killing him.\nAtlanta police spokesman Donald Hannah said officers responded to the recording studio on Defoor Place NW shortly after 11 p.m. Friday, finding “a large crowd of people fleeing the location.” Authorities later learned that the 28-year-old rapper, whose birth name is Trentavious White, had been taken to Hughes Spalding Children’s Hospital after leaving the scene “in an unknown vehicle.”\nHe died just before midnight.\n“We are not aware of anyone else being wounded (in the shooting),” Hannah said in an email.\nA possible motive was unclear. It was also unclear if any arrests had been made. Hannah said Homeland Security responded to the scene and “recovered video evidence.”\nWhite, best known for his single “Hot Boy,” was affiliated with another local rapper, 2 Chainz. He and other members of the hip hop community took to social media Saturday to mourn and offer condolences.\n“#LongLiveBankroll” was trending on Twitter in Atlanta.\nSpringer and other neighbors said police met with leaders in the Underwood Hills neighborhood after another shooting at Street Execs Studios about a year ago. Since then, the only trouble has been parking during events at the studio, he said.\nThe front door and an upper-level window had been boarded up at the studio Saturday morning, and a woman retrieved a car seat from a Mitsubishi SUV that had both of its front windows shot out. Across the street, workers boarded up the front door of a salon that had been hit by gunfire as well. Caution tape covered the back of neighboring homes as investigators continued finding more shell casings and searching for other evidence.\nFriday’s shooting was at least the fifth involving recording studios in the general area in less than two years.\nIn April 2014, a drive-by shooting was reported at a studio on Forrest Street, less than a mile south of Street Execs. Last July, several luxury cars were shot up outside the Defoor Hills Road studio of rapper Rick Ross. That location is less than two miles north of Street Execs.\nAbout a month later, two men were shot after leaving 11th Street Studios, about two miles south of Street Execs and not far from the Georgia Tech campus.\nDespite that, Springer said he’s not worried about violence taking over.\n“Honestly, it doesn’t bother me that much,” he said. “It’s a problem that needs to get solved. But we live in Atlanta. There’s a lot of this going on.”","url":"https://www.ajc.com/news/crime--law/rapper-bankroll-fresh-killed-shooting-atlanta-studio/9eKeoGee74l7C5rZmzAc2O/"}
