{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 20:59:07","date_modify":"2018-10-30 20:59:07","date_publish":"2016-04-18 20:34:51","description":"Rapper Rick Ross visited the White House on Friday as an ambassador for President Obama's black and Latino youth program -- and his court-ordered ankle monitor reportedly went off shortly after the president concluded a speech. | Entertainment","filename":"data/vaneerConsumption/RapperRickRosssAnkleMonitorGoesOffDuringMinortyYouthEmpowermentProgramatWhiteHouse.json","image_url":"https://media.breitbart.com/media/2016/04/GettyImages-493494314-e1461010879103.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_04_18__1540933147.html","title":"Rapper Rick Ross's Ankle Monitor Goes Off During Minorty Youth Empowerment Program at White House","title_page":"Rapper Rick Ross's Ankle Monitor Goes Off During Minorty Youth Empowerment Program at White House | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rapper Rick Ross visited the White House on Friday as an ambassador for President Obama’s black and Latino youth program — and his court-ordered ankle monitor reportedly went off shortly after the president concluded a speech.\nAccording to the Associated Press, the “Hood Billionaire” rapper joined fellow artists Alicia Keys, Common, Nicki Minaj, Busta Rhymes, Janelle Monae, Ludacris, Chance the Rapper and others at the White House on Friday, where the group met with the president to discuss the administration’s “My Brother’s Keeper” initiative, which focuses on empowering black and Latino youth.\nBut according to TMZ, Ross’s ankle monitor, which he must wear as a condition of his release on kidnapping and assault charges last summer, beeped loudly shortly after the president concluded a speech.\nRoss was arrested in June 2015 on kidnapping, aggravated assault and aggravated battery charges after allegedly pistol-whipping a man who had been doing repair work on his house. The kidnapping charge was added after it was alleged that the man was physically prevented from leaving Ross’ house.\nObama has previously enlisted the help of the music industry to promote the”My Brother’s Keeper” initiative, which aims to provide access to higher education to black and Latino youth. In January, Obama met with rapper Kendrick Lamar in the Oval Office, where the two discussed problems facing inner city youth and the importance of mentorship programs.\nWATCH:\nKeys has also been an outspoken advocate for criminal justice reform. In February, the Grammy-winning singer sent Republican House Speaker Paul Ryan a steamy Valentine’s Day message urging him to allow a vote on criminal justice reform legislation in the current session of Congress.\nThe parents of the late Trayvon Martin, who straddled neighborhood watch volunteer George Zimmerman and repeatedly bashed his head against concrete before Zimmerman shot him in self-defense, helped Obama kick off the “My Brother’s Keeper” program in 2014.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/04/18/rapper-rick-rosss-ankle-monitor-goes-off-during-minorty-youth-empowerment-program-at-white-house/"}
