{"authors":[],"date_download":"2018-10-22 20:45:58","date_modify":"2018-10-22 20:45:58","date_publish":"2014-05-03 15:45:00","description":"A shrimp fisherman made one of the rarest catches in 14 years — a goblin shark. They're known for their flat, elongated snouts.","filename":"data/vaneerConsumption/RareGoblinSharkSnaggedByFishermanOffFloridaWaters.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/418186/140503-shark-mn-1205_c33a9de1d92db40dcc8bc260e98f1df0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_rare-goblin-shark-snagged-fisherman-florida-waters-n96301_1540241158.html","title":"Rare Goblin Shark Snagged By Fisherman Off Florida Waters","title_page":"Rare Goblin Shark Snagged By Fisherman Off Florida Waters","title_rss":"NULL","source_domain":"nbcnews.com","text":"After returning to shore Wednesday, Moore reported his finding to the National Oceanic and Atmospheric Administration.\nGoblin sharks have been found in the Pacific, off the coasts of Japan and California, and in ocean depths of up to 5,000 feet. The latest sighting has surprised researchers.\n“This is a very rare finding,” John Karlson, a research biologist at NOAA, told NBC News on Saturday. “We don’t know very much about these animals.”\nKarlson said they can range up to 10 to 13 feet, although Moore’s goblin shark was around 18 feet.\n“From the photographs, we are assuming this is a female shark,” he added.\nMoore said he was flabbergasted by his find.\n“When it came up, I didn’t know what it was,” Moore told NBC News. “I didn’t measure him because his head was slashing around, and he had some mean-looking teeth and I didn’t want to get caught up in those.”\nAfter snapping pictures of the shark, he quickly released it back into the water, he said.\n“As ugly as it was, I don’t think I’d bite into it.”\nThe World Conservation Union lists the sharks as a minimal concern to humans because of how seldom people come into contact with them. They’re also not considered endangered or threatened.\nNOAA is using information gathered from sightings to build a database about the elusive species. Those will eventually be submitted to a scientific journal, Karlson said.\nMoore, meanwhile, has caught other sharks during his 15 years as captain — just never one this rare.","url":"https://www.nbcnews.com/news/us-news/rare-goblin-shark-snagged-fisherman-florida-waters-n96301"}
