{"authors":[],"date_download":"2018-10-22 22:10:24","date_modify":"2018-10-22 22:10:24","date_publish":"2014-06-08 18:26:19","description":"After spending nearly a month in the hospital's neonatal intensive care unit, the identical twins went home on Saturday.","filename":"data/vaneerConsumption/RareOhioMonoMonoTwinsHomeforFathersDay.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/435301/140511-mono-twins-jms-2102_c3ef73752a3371eeed52e99c5f3c6508.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_kids-health_rare-ohio-mono-mono-twins-home-fathers-day-n125696_1540246224.html","title":"Rare Ohio 'Mono Mono' Twins Home for Father's Day","title_page":"Rare Ohio 'Mono Mono' Twins Home for Father's Day","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA set of rare \"mono mono\" twins photographed holding hands after they were born are home in time for Father's Day. Jenna and Jillian Thistlethwaite were born May 9 sharing an amniotic sac and placenta at Akron General Medical Center in northwest Ohio.\nJenna and Jillian Thistlethwaite were born at 33 weeks on May 9 sharing an amniotic sac and placenta at Akron General Medical Center in Ohio. Jenna was born at 4 pounds, 2 ounces, with Jillian following less than a minute later at 3 pounds, 13 ounces. A photo showing the twins holding hands moments after they were born went viral.\nThe twins spent nearly a month in the hospital's neonatal intensive care unit gaining weight and getting stronger.\nAt nearly 6 pounds now, they were cleared to be released from the hospital on Saturday and went home with their parents and their big brother, 15-month-old Jaxon. Their parents, Sarah and Bill Thistlethwaite, had been splitting their time at home with Jaxon and at the hospital 40 minutes away with the twins.\n\"It's just nice to have everyone under the same roof,\" Sarah Thistlethwaite told The Associated Press. \"It was really stressful — you want to pay attention to the little one at home and you just gave birth to two little babies. It was a pull and a tear as to where to go.\"\nThe twins' rare birth condition is called monoamnioitic, or \"mono mono.\" Doctors say they occur in about one of every 10,000 pregnancies.\nThistlethwaite, a 32-year-old eighth-grade teacher, said she's already noticed a unique bond between the twins.\n\"When I try to feed them on the feeding pillow, they gradually migrate toward each other,\" she said. \"And when I lay them on the floor, they scoot toward each other. It's pretty cool to see them doing.\"\nShe said her mother, grandparents and her husband's grandparents all came to their house Saturday night to welcome the little ones. The family spent Sunday trying to relax and enjoy each other.\n\"We were so excited and kept thanking God we made it to that point,\" she said. \"Having them here is amazing, but having them here so healthy when they were premature, it's absolutely phenomenal.\"\nThistlethwaite said she's grateful that her and her husband's biggest worry now is telling the twins apart. She plans to solve that problem with pink nail polish for one and purple for the other.\nA second pair of mono mono twins born at Akron General the week after Jenna and Jillian, both girls, are still at the hospital and doing well, hospital spokeswoman Amy Kilgore said.\n\"All four girls are progressing as hoped, if not even better than hoped,\" she said.\n—Associated Press","url":"https://www.nbcnews.com/health/kids-health/rare-ohio-mono-mono-twins-home-fathers-day-n125696"}
