{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:28:37","date_modify":"2018-10-30 19:28:37","date_publish":"2015-11-16 20:23:11","description":"On Sunday afternoon a tornado ripped through a small town in California’s Central Valley damaging buildings and power and gas lines.","filename":"data/vaneerConsumption/RareTornadoHitsCaliforniasCentralValley.json","image_url":"https://media.breitbart.com/media/2015/11/Screen-Shot-2015-11-16-at-12.16.45-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_16__1540927717.html","title":"Rare Tornado Hits California's Central Valley","title_page":"Rare Tornado Hits California's Central Valley | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Sunday afternoon a tornado ripped through a small town in California’s Central Valley, damaging buildings and essential power and gas lines.\nEvidence from video and witness accounts confirm that the tornado hit the community of Denair around 2 p.m. according to the National Weather Service.\nThe San Francisco Chronicle reported that the storm traveled from the Gulf of Alaska before touching down.\nArea resident Sabina Woodard was quoted in the Chronicle saying, “What I thought was a bunch of birds was a bunch of debris.” Woodard and her husband hunkered down under a bed in the midst of furnishings flying about their living room. Mrs. Woodard compared the scene to a “remake of that Alfred Hitchcock movie The Birds.”\nFurther verification that at least a funnel cloud had come through the area came from Stanislaus County Sheriff Deputy Anthony Bejeran an ABC 10 News report recorded. The strength of the tornado is expected after meteorologists complete a storm survey scheduled for Monday.\nCalifornia saw a reported 413 tornados between January 11, 1951 and December 12, 2014. The statistics cited on the Tornado History Project website indicate there have never been deaths from a California Tornado. The largest number of injuries for one incident stands at 30 and total injuries at 88 over more than 50 years.\nAn estimated 80 per cent of California tornadoes are defined as weak, ABC 10 reported in 2014, citing statistics that spanned from 1950 to 2004. The report also cited a report by tornado expert John Monteverdi, and stated, “In July 2004, the highest-elevation tornado ever observed in the USA was photographed along Rockwell Pass in the Sequoia National Park.” That tornado was recorded at approximately 12,000 feet elevation.\nDenair sits approximately 13 miles southeast of the city of Modesto.\nShelter is available at the Denair Elementary School’s gymnasium at 3773 Madera Avenue, according to 10 News.\nWinds reached 60 mph and are expected at up to 80 mph in some California regions through Monday, the Los Angeles Times reported. ABC 10 reported that no injuries had been reported as of Sunday night.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/11/16/rare-tornado-california/"}
