{"authors":[],"date_download":"2018-10-22 21:17:14","date_modify":"2018-10-22 21:17:14","date_publish":"2014-05-06 19:12:44","description":"Mile for mile, there are almost as many earthquakes rattling Oklahoma as California this year.","filename":"data/vaneerConsumption/RareEarthquakeWarningIssuedforOklahoma.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/420386/140505-thailand-earthquake-jsw-1031a_b582fed78a85df59a511dd56d5174556.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_rare-earthquake-warning-issued-oklahoma-n98496_1540243034.html","title":"Rare Earthquake Warning Issued for Oklahoma","title_page":"Rare Earthquake Warning Issued for Oklahoma","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMile for mile, there are almost as many earthquakes rattling Oklahoma as California this year. This major increase in seismic shaking led to a rare earthquake warning this week from the U.S. Geological Survey and the Oklahoma Geological Survey.\nIn a joint statement on Monday, the agencies said the risk of a damaging earthquake — one larger than magnitude 5.0 — has significantly increased in central Oklahoma.\nGeologists don't know when or where the state's next big earthquake will strike, nor will they put a number on the increased risk. \"We haven't seen this before in Oklahoma, so we had some concerns about putting a specific number on the chances of it,\" Robert Williams, a research geophysicist with the USGS Earthquake Hazards Program in Golden, Colorado, told Live Science. \"But we know from other cases around the world that if you have an increasing number of small earthquakes, the chances of a larger one will go up.\" [Watch 2500+ Oklahoma Earthquakes Since 2012 (Video)]\nThat's why earthquakes of magnitude 5 and larger are more frequent in states such as California and Alaska, where thousands of smaller temblors hit every year.\nThis is the first time the USGS has issued an earthquake warning for a state east of the Rockies, Williams said. Such seismic hazard assessments are more typically issued for Western states following large quakes, to warn residents of the risk of damaging aftershocks, he said.\nThe geological agencies took action after the rate of earthquakes in Oklahoma outpaced that of even California for the first few months of 2014. (California regained the lead in April.) [The 10 Biggest Earthquakes in History]\n\"The rate of earthquakes increased dramatically in March and April,\" Williams said. \"That alerted us to examine this further and put out this advisory statement.\"\n- Becky Oskin, LiveScience\nThis is a condensed version of a report from LiveScience. Read the full report. Email Becky Oskin or follow her @beckyoskin. Follow us @OAPlanet, Facebook and Google+. Original article at Live Science's Our Amazing Planet.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/environment/rare-earthquake-warning-issued-oklahoma-n98496"}
