{"authors":["James Draper For Mailonline"],"date_download":"2018-10-23 01:21:47","date_modify":"2018-10-23 01:21:47","date_publish":"2017-03-16 11:14:15","description":"Jasmin Floyd, from Connecticut, suffers with Fibrodysplasia Ossificans Progressiva - a rare muscle disorder which has only 800 recorded cases worldwide.","filename":"data/vaneerConsumption/RareconditioncausesBONEtoforminwomansmuscles.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E535B6100000578-0-image-a-22_1489661070724.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4319478_Rare-condition-causes-BONE-form-woman-s-muscles_1540257707.html","title":"Rare condition causes BONE to form in woman's muscles","title_page":"Rare condition causes BONE to form in woman's muscles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 23-year-old woman is turning into 'stone' due to a rare condition that makes bone form in her muscles.\nJasmin Floyd, from Connecticut, suffers with Fibrodysplasia Ossificans Progressiva - a rare muscle disorder which has only 800 recorded cases worldwide.\nThe painful disease causes her muscles, tendons and ligaments to become calcified, effectively creating a 'second skeleton' of rigid tissue.\nDoctors first diagnosed her with the disorder aged five after she complained of agonising pains in her neck.\nSurvivor: Jasmin Floyd suffers from the rare condition Fibrodysplasia Ossificans Progressiva\n'I was complaining of stiffness on the way to kindergarten, but my parents just thought it was how I slept and was nothing to worry about,' she said.\n'At the end of the school day my neck seemed abnormally positioned and it looked stiffer than normal.'\nOver time, it has caused her to lose mobility in her jaw, neck, shoulders, elbows and hips, while restricting her ability to eat and speak.\nSadly, the condition also means she is slowly being restricted to a wheelchair.\n'The extra bone that has grown in my joints is causing severe limited mobility,' she added.\n'They describe it as bone forming over the joints, locking them in and impairing movement.\nRigid: The painful disease causes her muscles, tendons and ligaments to become calcified, effectively creating a 'second skeleton' of rigid tissue\nImmobile: Gradually, the condition will cause Miss Floyd to be permanently wheelchair-bound\nYoung patient: Doctors first diagnosed her with the disorder aged five after she complained of agonising pains in her neck\n'My spine is severely affected with scoliosis and, due to FOP's progression, I've lost full mobility in my neck and jaw, plus partial mobility in my shoulders, elbows and hips.\nOne of the hardest parts is trying not to be afraid of this condition, it's so unpredictable that I can never expect what will happen next. Jasmin Floyd, 23, from Connecticut\n'Last summer I went through an elbow flare-up and couldn't unbend it without easing it with an ice pack. At the same time, I was also losing mobility in my jaw, which made everything much more difficult.\n'Right now I can only open my mouth by a centimetre and can't open it any further.'\nBut, undeterred by her problems, she's determined to fulfill her bucket list of traveling and experiencing new things before her condition fully immobilises her.\nMiss Floyd said: 'I try to be as independent as I can, but I can only raise my arms to my forehead and they don't move away from my body.\nPainful: The bones throughout Miss Floyd's spine are gradually duplicating inside her body\nStill smiling! The brave woman is now planning to travel across the world while she still can\nWHAT IS FOP? Fibrodysplasia Ossificans Progressiva (FOP) is one of the rarest, most disabling genetic conditions known to medicine. It causes bone to form in muscles, tendons, ligaments and other connective tissues. Ridges of extra bone develop across joints, progressively restricting movement and forming a second skeleton that imprisons the body in bone. There are no other known examples in medicine of one normal organ system turning into another. FOP eventually results in death when the cartilage holding the ribs together also solidifies, making it impossible to breathe. Patients eventually suffocate or suffer a cardiac arrest as their bodies attempt to get enough oxygen. Source: US National Library of Medicine\n'I have a hard time bending and can tell I'm losing the ability to move as easily.\n'One of the hardest parts is trying not to be afraid of this condition, it's so unpredictable that I can never expect what will happen next.\n'It's important to not be totally blindsided if something does happen, I try to figure out a way to adapt around things and figure out my new normal.'\nTo combat this, she has specially adapted tools to help her with everyday tasks. 'I have something that I'm able to use to turn the stove top on, since I can't reach to turn the knobs,' she added.\n'I've been able to adapt to some things with tools, like I have an extended bent hairbrush that my dad made for me so that I can brush my hair independently.'\nMiss Floyd is fundraising to purchase mobility aids that will enable her to travel easier as well as ease her daily life.\n'It would make me feel way more independent and allow me to travel more. These aids will mean, I'll be able to keep up with people easier and not need to take breaks when I'm walking.\n'I also will be able to plan more trips and do as much as I can while I'm able.'\nTo donate visit: www.gofundme.com/jasminfloyd","url":"https://www.dailymail.co.uk/health/article-4319478/Rare-condition-causes-BONE-form-woman-s-muscles.html"}
