{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:39:36","date_modify":"2018-10-30 21:39:36","date_publish":"2016-12-19 00:00:00","description":"Michael Hoare is joining as head of risk analytics and retail credit. The platform's chief risk officer left weeks ago after just six months in the job.","filename":"data/vaneerConsumption/RateSetterboostsriskteamwithPayPalhireafterchiefriskofficersdeparture.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ratesetter-risk-team-paypal-uk-michael-hoare-surprise-departure-hsbc-2016-12_1540935576.html","title":"RateSetter boosts risk team with PayPal hire after chief risk officer's departure","title_page":"    RateSetter boosts risk team with PayPal hire after chief risk officer's departure - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Michael Hoare. RateSetter LONDON — Peer-to-peer lending platform RateSetter has appointed a new head of risk analytics and retail credit, just weeks after the surprise departure of the platform's chief risk officer.\nMichael Hoare is joining RateSetter from PayPal UK where he was chief credit risk officer. In the absence of a chief risk officer at RateSetter, Hoare and the risk team will report to RateSetter's risk committee, chaired by former HSBC executive Jim Gunner.\nHoare's appointment follows news earlier this month that chief risk officer Cyrille Salle de Chou has left the peer-to-peer lender after just six months. He joined RateSetter from Lloyds in June but left to become chief risk officer of HSBC's European retail operation, the Financial Times reported.\nA spokesperson for RateSetter confirmed that Hoare is not a direct replacement for Salle de Chou and said the company is actively recruiting for his replacement.\nHoare says in an emailed statement: \"I'm excited to be joining RateSetter at a key moment in its growth. The company has proved genuinely innovative in the six years since it launched and has a great track record in helping investors manage risk - I look forward to helping it build on that record.\"\nRateSetter founder and CEO Rhydian Lewis says in an emailed statement: \"Managing risk is central to what RateSetter does, and we're pleased to welcome an experienced specialist like Michael to our team. He will play a key role in helping us grow sustainably over the long term.\"","url":"https://www.businessinsider.com/ratesetter-risk-team-paypal-uk-michael-hoare-surprise-departure-hsbc-2016-12"}
