{"authors":["Matt Turner","Andy Kiersz"],"date_download":"2018-10-31 00:09:34","date_modify":"2018-10-31 00:09:34","date_publish":"2016-12-02 00:00:00","description":"The rates business has been a standout on Wall Street in 2016, with revenue at $21 billion for the first nine months of the year, according to Coalition.","filename":"data/vaneerConsumption/Ratestraderstogetbiggestbonuses.json","image_url":"https://amp.businessinsider.com/images/583f3c48ba6eb671018b6e32-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_rates-traders-to-get-biggest-bonuses-2016-11_1540944574.html","title":"Rates traders to get biggest bonuses","title_page":"    Rates traders to get biggest bonuses - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Miley Cyrus performing at the opening night of her Bangerz Tour in Australia at Rod Laver Arena in 2014 in Melbourne, Australia. Scott Barbour/Getty Images Rates traders are making it rain.\nThe rates business has been the standout performer on Wall Street in 2016, with revenue at $21 billion for the first nine months of the year, according to Coalition, up 24% from the same period.\nAnd early indications suggest total compensation will increase for the top performers.\nAccording to an annual survey by the Wall Street recruiting firm Options Group, total compensation for rates traders in the US will be up 9% from last year on average. For rates salespeople, compensation will be up 5% on average.\nThe survey takes in the views of the top 25% of performers at the top 10 firms in each business line. They are asked what they expect to earn for 2016, which includes their base salary through 2016 and the bonus paid out in early 2017 for work through 2016.\nThat means there are some caveats to the numbers, which take in the views of only the top performers and could be overly optimistic or pessimistic on bonus payouts. The numbers also don't reflect activity since the US election, as the survey research was conducted before Donald Trump won the presidency.\nOptions and Treasurys traders will see the biggest bump, with Treasurys traders focused on the long end of the curve expecting a 15% jump in compensation.\n\"Usually that seat is super hard to fill and very profitable,\" one rates specialist told Business Insider. \"The flows are technical and large.\"\nAnother senior fixed-income executive pointed out that here had been a large variance in the yields of long-dated bonds in 2016, with yields on 30-year Treasurys starting the year at 3%, dropping to 2.1%, and then rebounding to 3.1%. He said that range was \"pretty enormous\" and had most likely helped long-end traders.\n\"There has been nothing like that in the last three or four years,\" he said.\nHere is the breakdown of total compensation expectations for US rates traders and salespeople from Options Group's survey:","url":"https://www.businessinsider.com/rates-traders-to-get-biggest-bonuses-2016-11"}
