{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 01:59:46","date_modify":"2018-10-23 01:59:46","date_publish":"2017-04-26 12:47:02","description":"A Taiwanese man posted photos that showed a poor rat with its head and both its front legs locked in the stocks - a medieval form of punishment.","filename":"data/vaneerConsumption/RatSHACKLEDbyaresidentinTaiwan.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9D3B1C00000578-0-image-a-17_1493206025050.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447212_Rat-SHACKLED-resident-Taiwan_1540259986.html","title":"Rat SHACKLED by a resident in Taiwan.","title_page":"Rat SHACKLED by a resident in Taiwan. | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"These disturbing and utterly bizarre photos show how one man decided to shackle a grey rat and put it in the stocks after he caught the rodent snooping around his home.\nA Taiwanese man named Lee Wei-chin posted the photos to social media and has received several thousand likes and just as many comments.\nThe resident of Taichung City in West Taiwan wrote: \"I finally caught it!\"\nThe man decided to shackle the grey rodent and put it in stocks after he caught it in his home\nLee Wei-chin admitted he released the rat the same day... but did not reveal where he managed to get hold of miniature stocks\nTwo accompanying photos showed the poor animal with its head and both its front legs locked in the stocks - a medieval form of punishment.\nBut amazingly Lee managed not only to find a version of the stocks so small that it could lock up the rat's head and arms so it would not get away, he somehow also got one made of metal.\nThe look of the custom-made tool makes it clear just how desperate the homeowner was to nab the pesky rodent.\nNetizens on social media have shared the photo more than 1,000 times, but some have also expressed sympathy towards the creature.\n'Kill it or let it go,' one netizen wrote.\nLee said he released the rat later the same day.\nBut he did not say how he got his hands on the miniature rodent stocks.","url":"https://www.dailymail.co.uk/news/article-4447212/Rat-SHACKLED-resident-Taiwan.html"}
