{"authors":[],"date_download":"2018-10-30 00:55:24","date_modify":"2018-10-30 00:55:24","date_publish":"2016-08-03 01:06:24","description":null,"filename":"data/vaneerConsumption/RavitchRightonCommonCoreWrongonEverythingElse.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Ravitch2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860924.html","title":"Ravitch Right on Common Core, Wrong on Everything Else","title_page":"Ravitch Right on Common Core, Wrong on Everything ElseThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Diane Ravitch, a well-known school choice opponent, has gotten something right: “The Common Core Costs Billions and Hurts Students.”\nThe quote comes from the title of Ravitch’s recent New York Times article, but while Ravitch’s title thesis — that Common Core has been a disaster — holds true, her arguments are supported neither by fact nor by the author’s own credo.\nThe Common Core State Standards (CCSS), a set of national academic standards dictating what students should know at the end of each grade level, has been a monumental failure. As Ravitch points out, average math and reading scores have either remained stagnant or declined almost everywhere Common Core has been enacted, and children are not better educated. In fact, they are often left frustrated and unprepared.\nAdopting the standards has cost the nation billions of dollars and has deprived local school districts of their authority. A ballooning number of lawmakers are now moving to rid their states of the standards and to expel the state tests aligned to CCSS. Even the Gates Foundation, an outspoken proponent and huge financial backer of the standards, admitted the implementation of CCSS did not go as planned.\nI applaud Ravitch for recognizing the shortcomings of nationalized testing, but why doesn’t she acknowledge nationalized education, a top-down “solution” Ravitch supports, is subject to the same flaws?\nRavitch writes the main causes of low student achievement are “poverty and racial segregation,” yet she is making it her life’s work to promote failing public schools and impede school choice programs that have been proven to benefit poor and minority students the most.\nStanford University’s 2015 Urban Charter School Study “found positive results for nearly all student subgroups and especially strong [results] for students who are minority and in poverty.”\nSimilarly, a 2005 study in the Fordham Law Review, titled “School Choice to Achieve Desegregation,” concluded, “[S]chool choice, when carefully designed and properly implemented, can play an important role in advancing the goal of equality stated in [Brown v. Board of Education] over fifty years ago.”\nThe Journal of Public Economics published a study in 2015 on the “estimated impacts of school vouchers on college enrollment and degree attainment,” and the Harvard Kennedy School of Government reported the study found low-income minority students in New York City “who received a school voucher to attend private elementary schools in 1997 were, as of 2013, 10 percent more likely to enroll in college and 35 percent more likely than their peers in public school to obtain a bachelor’s degree.”\nMartin R. West, associate professor of education at the Harvard Graduate School of Education, wrote in his study Schools of Choice, released earlier this year, “The chief beneficiaries of policies that expand parental choice appear to be urban minority students.”\nThe list goes on. There’s far too much evidence supporting the claim school choice benefits all students — whether they be wealthy, impoverished, or of minority status or whether they live in cities, the rural countryside, or in city suburbs — to summarize them all here. One would think such an overwhelming amount of evidence would be difficult for an education historian such as Ravitch to ignore.\nContrary to Ravitch’s claims, the main cause of low student achievement is that public education has been transformed over the past 50 years (or more) into a one-size-fits-all, government-run monopoly. Ravitch herself acknowledges the tremendous shortcomings of nationalized testing in her op-ed, but she chooses to ignore the facts that don’t align with her allegiance to public education.\nRavitch writes in her book The Death and Life of the Great American School System: How Testing and Choice Are Undermining Education, “[R]elinquishing control of the public education policy agenda to private foundations” is “fundamentally antidemocratic.” With such a stance, it’s no wonder she chooses to dismiss study after study showing school choice benefitting students.\nParents, by the way, want choice. Brilliant Corners Research and Strategies found in 2015 78 percent of African-American parents support using state education tax dollars to send their children to the school of their choice. Isn’t it “fundamentally antidemocratic” to deny parents the right to choose how to educate their own children?\nIf Ravitch really cared about “improving the education of all students,” she would promote choice programs, which enable poor and minority students to escape the poverty and crime forced upon them by ZIP-code-based public learning schemes.","url":"https://spectator.org/ravitch-right-on-common-core-wrong-on-everything-else/"}
