{"authors":["Press Association Reporter"],"date_download":"2018-10-22 22:57:11","date_modify":"2018-10-22 22:57:11","date_publish":"2016-01-29 10:29:49","description":"Ryan ten Doeschate, previously the county side's limited-overs skipper, will step up to club captain in place of James Foster with Ravi Bopara inheriting the role in the short formats.","filename":"data/vaneerConsumption/RaviBoparaandRyantenDoeschatenamedasEssexcaptainsfor2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/0C58BB3100000514-0-image-a-25_1454063376977.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3422512_Ravi-Bopara-Ryan-ten-Doeschate-named-Essex-captains-2016_1540249031.html","title":"Ravi Bopara and Ryan ten Doeschate named as Essex captains for 2016","title_page":"Ravi Bopara and Ryan ten Doeschate named as Essex captains for 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Essex have announced their new captains after James Foster was relieved of the role last month.\nRyan ten Doeschate, previously the county side's limited-overs skipper, will step up to club captain with Ravi Bopara inheriting the role in the short formats.\nFoster led Essex for five years before losing the captaincy just before Christmas. The former England wicketkeeper has since signed a new two-year contract, however.\nRavi Bopara has been handed the captaincy of Essex's limited overs team ahead of the new season\nThe England batsman is entering the IPL auction and could miss the opening NatWest T20 Blast match\nTen Doeschate has led the county's limited-overs teams for the last two seasons and, with no Indian Premier League commitments this year, will lead the team in the County Championship.\nHead coach Chris Silverwood said: 'Ryan will bring many things to the role; he is always a calm head on the field and has shown as limited-overs captain how capable he is.\n'We are aiming not just for promotion but to be competitive in Division One, and Ryan is the man to lead us there.'\nRyan ten Doeschate will now lead the team in the County Championship after James Foster's demotion\nBopara - who is entering the IPL auction and could miss the opening NatWest T20 Blast match if his side in India reach the final - has extensive experience in England's limited-overs sides.\nSilverwood continued: 'Ravi is at the stage of his career where he is looking to take on more responsibility, and this is the perfect opportunity to give him that. He has played a lot of cricket around the world and will bring that experience into his new role.\n'We have realistic aims to win a limited-overs competition this year and Ravi is excited about the challenge.'","url":"https://www.dailymail.co.uk/sport/cricket/article-3422512/Ravi-Bopara-Ryan-ten-Doeschate-named-Essex-captains-2016.html"}
