{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:47:56","date_modify":"2018-10-30 21:47:56","date_publish":"2014-11-07 15:22:11","description":"As one tipster claimed on Tuesday, the once famous Peter Chang Chinese Cui...","filename":"data/vaneerConsumption/RaysRioBravosettoopeninSandySprings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/11/07/Images/WPIMAGE_cmgajcfoodandmore_1856.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ra_aa42606c9a59364f33f1f9cebc05fa7f__1540936076.html","title":"Ray’s Rio Bravo set to open in Sandy Springs","title_page":"Ray’s Rio Bravo set to open in Sandy Springs","title_rss":"NULL","source_domain":"ajc.com","text":"As one tipster claimed on Tuesday, the once famous Peter Chang Chinese Cuisine in Sandy Springs will become Rio Bravo reborn as Ray's Rio Bravo .\nThe details and words from original owner Ray Schoenbaum in the press release:\nFans of the former Rio Bravo rejoice as Ray Schoenbaum, original owner of Rio Bravo and founder of Ray’s Restaurants, announces he will open a Ray’s Rio Bravo in Sandy Springs in the former Peter Chang’s space by Cinco de Mayo 2015. Schoenbaum made the decision to open the restaurant after high demand from customers requesting the return of the restaurant’s iconic dishes.\n“Everyone over the years has always said, ‘why don’t you bring it back, I remember going there when we were kids,’ and I’m thrilled to do that,” said Schoenbaum. “I’m sorry I ever sold it, but now I am very excited to bring back the original Rio Bravo concept, giving everyone exactly what they know and love about Rio Bravo.”\nThe restaurant plans to be a perfect return of the former restaurant, providing fans with the same dishes that helped launch the restaurant into popularity more than 30 years ago. Among the coveted returning items are the fajita platters made with freshly prepared tortillas created on “The Machino,” the famous tortilla press. Guests can expect the same recipe for the cheese dip, guacamole and other traditional Rio Bravo dishes.\nThe original recipes and in-house prepared items were a large component of the success of Rio Bravo. Schoenbaum confirms the new restaurant will continue the tradition of creating high-end Mexican cuisine with ingredients all prepared from scratch.\nIn addition to its full lunch and dinner menus, Ray’s Rio Bravo will also feature a selection of special margaritas, including seasonal fruit flavors like strawberry, blackberries and kiwi.","url":"https://www.ajc.com/blog/atlanta-restaurants/ray-rio-bravo-set-open-sandy-springs/QqoNAzY2RV5XjEfjNrHYtO/"}
