{"authors":[],"date_download":"2018-10-22 20:37:54","date_modify":"2018-10-22 20:37:54","date_publish":"2014-06-02 16:23:46","description":"R&B singer Chris Brown was released from jail Monday after completing his sentence for a probation violation.","filename":"data/vaneerConsumption/RBsingerChrisBrownCompletesSentenceReleasedFromJail.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_11/254156/140314-140314-chris-brown-court-mef-1920_e51bc8682a02f986a9834a79f828f61f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_r-b-singer-chris-brown-completes-sentence-released-jail-n120361_1540240674.html","title":"R&B singer Chris Brown Completes Sentence, Released From Jail","title_page":"R&B singer Chris Brown Completes Sentence, Released From Jail","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSinger Chris Brown was released from a Los Angeles jail Monday after serving 108 days for a parole violation, according to the Los Angeles County Sheriff's Office.\nThe 25-year-old R&B star has been in rehab or jail since November, after a judge ruled he violated the terms of his probation in his 2009 assault case for his attack on former girlfriend and singer Rihanna. Upon his release, Brown tweeted three short messages expressing his relief and gratitude.\nIn November, Brown was ordered to a 90-day live-in anger-management treatment program, where he would have to complete three eight-hour days of community service each week and undergo periodic drug tests. But prosecutors in February asked a Los Angeles judge to send Brown back to jail because of new evidence they said investigators obtained from witnesses to an altercation Brown allegedly had in Washington in October. The singer faces a misdemeanor assault charge in Washington, D.C for allegedly hitting a man trying to take a picture of him outside a hotel.\nBrown was sent back to jail in March after he was kicked out of the Malibu rehabilitation facility and he admitted his role in the Washington, D.C. fight. Brown was receiving treatment for anger management, substance abuse and issues related to bipolar disorder before he was dismissed in March, it was revealed in court.","url":"https://www.nbcnews.com/pop-culture/celebrity/r-b-singer-chris-brown-completes-sentence-released-jail-n120361"}
