{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 20:31:21","date_modify":"2018-10-30 20:31:21","date_publish":"2016-12-30 00:00:00","description":"Royal Bank of Scotland's smaller shareholders are lobbying the bank to set up a special committee so that they have more control over pay for directors.","filename":"data/vaneerConsumption/RBSshareholdersproposeremunerationcommittee.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_rbs-shareholders-propose-remuneration-committee-2016-12_1540931481.html","title":"RBS shareholders propose remuneration committee","title_page":"    RBS shareholders propose remuneration committee - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A worker sweeps in the foyer of a Royal Bank of Scotland office in the City of London August 6, 2010. Lower impairment losses helped Royal Bank of Scotland's second quarter operating profit rise from the first quarter, and the part-nationalised group expected good medium-term prospects for its business. REUTERS/Luke MacGregor Royal Bank of Scotland's smaller shareholders are lobbying the bank to set up a special committee so that they have more control over pay for directors, the BBC reported.\nThe committee would also be able to \"scrutinise\" the bank's long-term strategy as well as senior appointments, according to the report.\nShareholders' groups are pushing for the idea to be put to an investor vote at next year's annual general meeting.\nA spokesman for RBS told the BBC: \"We have not yet received the final draft resolution. Once it has been delivered we will look closely to ensure that it complies with all corporate governance and listing guidelines.\"\nThe move comes as chief executive officers come under scrutiny for their increasingly generous pay packets.\nPay for corporate chief executives has increased by 82% in the past 13 years, but the average company generated less than 1% return for investors, according to a report by the CFA Institute published on Thursday.\nThe median CEO at a FTSE-350 firm earned £1.5 million, with pay increasing on \"an otherwise linear trend halted only by the financial crisis in 2008-2009 when pay levels slipped back to 2006 levels,\" the organisation said.\nWill Goodhart, chief executive of CFA UK, said: \"Remuneration committees have spent more time than ever before this year in reaching out to shareholders and stakeholders to discuss compensation structures.\n\"There is an intense focus on pay levels coupled with calls to find better ways of aligning senior executives' incentives with long-term value creation, which for our members is more often measured through economic profit than through accounting profit,\" Goodhart said.\nPay has become a political issue. Prime Minister Theresa May proposed earlier this year to introduce binding shareholder votes on CEO pay every year for each company.","url":"https://www.businessinsider.com/rbs-shareholders-propose-remuneration-committee-2016-12"}
