{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:45:11","date_modify":"2018-10-30 23:45:11","date_publish":"2016-12-05 00:00:00","description":"Shareholder groups claim the bank 'misled' them on the state of its finances when RBS raised £12 billion in 2008, just months before its bailout.","filename":"data/vaneerConsumption/RBStopayupto800milliontosettle2008rightsissuecase.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_rbs-settles-2008-rights-issue-case-2016-12_1540943111.html","title":"RBS to pay up to £800 million to settle 2008 rights issue case","title_page":"    RBS to pay up to £800 million to settle 2008 rights issue case - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"RBS CEO Ross McEwan. Andrew Milligan PA Wire/PA Images LONDON — Royal Bank of Scotland is paying out up to £800 million ($1.01 billion) to try and settle a lawsuit that alleges the bank mislead investors when raising money in 2008.\nRBS reached the settlement with three out of the five shareholder groups pursuing action against it. The settlement represents 77% of the claims by value in the 2008 Shareholder Rights Issue litigation.\nThe shareholder groups allege that the bank misled them on the true state of the bank's finances when raising money through a share issue in 2008. RBS raised £12 billion through a rights issue in April 2008 but required what became a £45 billion bailout from the government in October of the same year.\nRBoS Shareholder Action, one of the group's taking action against RBS, claims the bank \"acted improperly by misrepresenting the underlying strength of the bank at the time and by omitting critical information from the Prospectus. This led to tens of thousands of shareholders taking part at an over-inflated price.\"\nThe case claims that advisors Goldman Sachs and Deloitte were both concerned that the documents involved in the 2008 cash call could potentially be misleading.\nWhile only three of the five groups have agreed to settle, RBS says the £800 million is earmarked for all the claimants. The £800 million is covered by existing settlement provisions.\nCEO Ross McEwan says in an emailed statement: \"We have been very clear that we wanted to deal with as many of our legacy litigation issues as possible during 2015 and 2016. We are pleased to have reached this agreement and hope that it will be accepted by the remaining claimant group(s) so that this long course of complex and costly litigation can now be concluded.\"\nRBS says the settlement is \"to minimise further material litigation expense and management distraction and without any admission of liability.\" It adds that it will \"continue to be vigorously defended\" if the two outstanding shareholder groups do still decide to pursue legal action. A court date for the remaining two claimant groups in in the case is set for March 2017.","url":"https://www.businessinsider.com/rbs-settles-2008-rights-issue-case-2016-12"}
