{"authors":[],"date_download":"2018-10-30 01:15:52","date_modify":"2018-10-30 01:15:52","date_publish":"2014-10-31 08:00:00","description":null,"filename":"data/vaneerConsumption/ReadingtheReformistManifesto.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/10/9343843843_13fe34dc16_z2028129.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862152.html","title":"Reading the Reformist Manifesto","title_page":"Reading the Reformist ManifestoThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Room to Grow: Conservative Reforms For a Limited Government and a Thriving Middle Class\nBy Peter Wehener, Yuval Levin, et al.\n(YG Network, 121 pages, Free)\nConservatism, properly understood, requires a healthy respect for the past as well as a clear-eyed appraisal of the present. So on paper, reform conservatism—billed by proponents as a movement to find new ways to apply conservative principles to contemporary problems—should appeal.\nMany conservatives, however, find reform conservatism elitist, if they think of it at all. In the movement’s earliest iterations shortly after Barack Obama was elected president, it seemed to be pitched as a self-conscious alternative to the kind of conservatism embodied by the Tea Party.\nThese reform conservatives were seen as an ivory tower phenomenon rather than a grassroots one. While they were supposed to be re-creating the winning formula pioneered by Ronald Reagan and the old domestic-policy neoconservatives, instead the kind of people who wrote at David Frum’s Frum Forum website mostly sounded like they were pining for the way Republicans used to lose elections before Reagan—decisively, but civilly and moderately.\nIf the Tea Party was a little too Michele Bachmann for some people’s tastes, reform conservatism was Jon Huntsman all the way—without Huntsman’s most attractive feature, his critique (however restrained) of George W. Bush’s foreign policy.\nIn fact, what criticism of Bush existed in early reform conservatism concentrated more on his style—especially the red-state identity he shared with Bachmann and Sarah Palin—than his policies. There was a certain amount of warmed-over compassionate conservatism and not much rethinking of the Bush-era overspending and foreign-policy Wilsonianism—two areas that cried out for true conservative reform.\nAll that said, Room to Grow, a free collection of essays about reform conservatism hailed as the movement’s manifesto, suffers from few of these defects. It is a smart introduction to some reformist ideas mostly centered on the following insight: conservative economic policy has become sharply divorced from the actual financial anxieties experienced by the middle class; but that conservatives need not morph into low-budget liberals in order to appeal to voters in Ohio.\nYuval Levin, founding editor of National Affairs and one of the intellectuals who spearheaded this project, deserves a lot of credit for helping to make reform conservatism congenial to the Tea Party. He acknowledges the importance of constitutionally limited government and the right’s reticence to merely tinker with the leviathan. He is especially thoughtful when writing about the left’s use of the welfare state to “liberate” us from real family and communal ties, so we may all live the Life of Julia.\nRamesh Ponnuru of National Review also contributes a solid essay on constitutionalism to Room to Grow. The takeaway is that the Constitution is too important to be left just to judges. Popularly elected officials must also make judgments about the constitutionality of laws and programs, defending the document from unconstitutional encroachments.\nBoth of these points are important to rescue reform conservatism from the charge that it is simply interested in replacing Democratic technocrats with Republican ones. A smaller federal government that is more obedient to the Constitution and a more robust civil society are the main goals.\nSomeone who helped make this point is Senator Mike Lee of Utah. Lee isn’t a Room to Grow author, but he is quoted in the collection and he is the member of Congress most likely to act on its policy recommendations. A dedicated constitutional conservative and major Tea Party figure, Lee has proposed limited-government solutions to everything from college costs to family flex time.\nLee is no Bush-league compassionate conservative. He teamed with Ted Cruz in last year’s attempt to defund Obamacare and he has joined forces with Rand Paul on civil liberties. He was elected by unseating a Republican incumbent who voted for the Wall Street bailout. The son of a Reagan solicitor general, Lee has written that many federal entitlement programs are hard to square with Washington’s enumerated powers. His interest in reform conservatism could help it reach the grassroots.\nSome of the proposals will need his help. In Room to Grow, Robert Stein makes the case for cutting taxes for families, chiefly by expanding the child tax credit. Lee has in fact introduced legislation advancing a version of this idea, and you would think that a pro-family tax cut in the classic fusionist sense would be universally popular among conservatives.\nYou would think wrong. Many conservatives and libertarians, rightly concerned about cluttering up the tax code with credits and carve-outs, view this as “social engineering.” Others feel that expanding credits detracts from the supply-side emphasis on marginal rates and economic growth. Finally, there is the Mitt Romney “47 percent” fixation. Is it wise to further decrease the share of Americans who pay income taxes, which expanding the credit would do?\nStein ably rebuts most of these objections. The truth is that cutting the current 39.6 percent tax rate would have significantly smaller supply-side effects than did cutting the 70 percent rate Reagan found when he took office in 1981. We’ve seen this in practice. Compare the clear-cut growth and the favorable shift in incentives to work, save, and invest caused by the Reagan tax cuts to the more ambiguous results following subsequent fluctuations in the top rate.\nIt is difficult to meaningfully cut middle-class taxes in a revenue-neutral way by focusing only on marginal rates. Moreover, such rate cuts would also have little effect on the work incentives of someone whose income tops out in, say, the 15 percent bracket. The end result is that quadrennial Republican tax plans are viewed skeptically by the middle class and can easily be portrayed by Democrats as tax cuts for the rich.\nThe tax code has always recognized the burden of supporting dependents. This is not social engineering. Stein merely proposes that the tax code do this more effectively for families with children, while recognizing our entitlement programs’ implicit tax on childrearing. Writes Stein: “Even as the old-age pension system collectively depends on a population of productive young workers, it diminishes the incentive for adults to raise them—and so undermines its own sustainability.”\nPace Romney, there is zero evidence that working people whose tax liabilities have been wiped out by Republican tax policy—including the Reagan, Gingrich, and Bush tax cuts—vote for big government. There is a lot of evidence, however, that married parents of children vote Republican. And who believes it is more conservative or libertarian to spend money on the government than on supporting your own kin?\nSimilarly, James Capretta makes valuable points in his chapter on health care, where rising costs have gobbled up growth in cash wages for much of the middle class. By allowing themselves to be seen as defenders of the pre-Obamacare health care status quo—which, Capretta reminds us, was no small-government, free-market wonderland—conservatives have made it easier for liberals to grow government. He sketches some helpful, genuinely free-market alternatives.\nRoom to Grow is unfortunately silent on foreign policy. The author who has previously been most outspoken on the issue, Peter Wehner, served under Bush and has never given the impression he thinks his former boss’s approach to world affairs needs reform. (Wehner’s chapter is a fine discussion of conservatism and the middle class.)\nOverall, Room to Grow is a decent first step toward a solutions-oriented conservatism that won’t make red-blooded Tea Partiers automatically want to tune it out. That may not sound like a ringing endorsement, but it is.","url":"https://spectator.org/60785_reading-reformist-manifesto/"}
