{"authors":["Reader Reactions","Guest Commentary","Dan Morain"],"date_download":"2018-10-30 23:16:01","date_modify":"2018-10-30 23:16:01","date_publish":"2016-05-25 21:50:22","description":"This letter was written in response to Why your signature is worth more than ever.I run a signature gathering firm in Oregon. In Oregon, we have a","filename":"data/vaneerConsumption/ReaderreactionCaliforniashouldlookatOregonmodelfordirectdemocracy.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941361.html","title":"Reader reaction: California should look at Oregon model for direct democracy","title_page":"Reader reaction: California should look at Oregon model for direct democracy | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In 2002 we passed Ballot Measure 26 that prohibits pay-by-signature. Instead of hiring mercenaries — independent contractors that work multiple campaigns, driving up the cost to get to the top of their clipboard — we pay hourly employees who carry only for one. Sometimes we do two if both measures agree to be on the same clipboard, but the incentive is the shared payroll hour cuts their costs.\nOregon also requires all signature gatherers to be background checked and badged by the elections office. We turn in all payroll records that match with the sheets gathered by each circulator.\nIf California were to adopt a pay-by-hour model and start badging circulators, you would overnight see a return to sanity. Unethical and fraudulent operators will always be trying to game the system, but having an ethical approach works. For one, voters stop feeling like they’re being “spare changed” for a signature.\nStacey Dycus\nThis letter was written in response to Why your signature is worth more than ever .I run a signature gathering firm in Oregon. In Oregon, we have a solution that not only puts more integrity into the system, but it removes the transaction that makes your signature worth money.","url":"https://calmatters.org/articles/reader-reaction-california-should-look-at-oregon-model-for-direct-democracy/"}
