{"authors":[],"date_download":"2018-10-30 01:01:47","date_modify":"2018-10-30 01:01:47","date_publish":"2018-08-15 00:05:28","description":null,"filename":"data/vaneerConsumption/ReaganLibraryShowsAmericaatItsBest.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/View_of_Air_Force_One_Pavilion_at_the_Reagan_Library-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861307.html","title":"Reagan Library Shows America at Its Best","title_page":"Reagan Library Shows America at Its BestThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Fresh on the heels of lamenting the Aug. 6 death of former U.S. Sen. Paul Laxalt, known as Ronald Reagan’s “best friend in politics,” I found myself last Friday looking at a hand-written sentence from Reagan to Laxalt.\nOn an otherwise routine response to a policy-inquiry message from Laxalt to the White House, Reagan wrote that “Nancy joins me in sending our love to [Laxalt’s wife] Carol” — thoughtfully insisting, amidst a host of other paperwork, on adding that personal touch.\nThat personal touch of Reagan’s is evident throughout the Ronald Reagan Presidential Library and Museum in Simi Valley, California, which I visited for the first time last week. The museum is a wonderful facility — well organized, engagingly presented, intellectually stimulating, emotionally powerful, and beautifully designed to present an expansive, soul-warming vista of the hill-surrounded valley stretching 15 miles to the Pacific.\nThe exhibits do a fine job telling the story of Reagan’s remarkable life. Many of them expertly capture his buoyant personality, his infectious optimism, and especially his love for wife Nancy. Yet this isn’t one of those postmodern, vapid substitutions of personal ephemera for real history. Instead, the personal material is seamlessly and appropriately integrated into the important account of Reagan’s world-altering public life and presidency. Never does a visitor lose sight of why there is a museum for Reagan — of what he believed, what he did in office, and why his presidency mattered.\nAs a confirmed Reaganophile for more than 40 years (and an editor of a major book on Reagan’s ascension to the presidency), I already was quite familiar with much of Reagan’s story. Even so, the museum provided copious, important details, including many little grace notes, which were entirely new to me.\nWhat first really captivated me were the collections of Reagan’s famous hand-written speech-note cards. I had imagined these index-cards, with which he built so many of his addresses and radio commentaries, as being large-lettered, bullet-pointed, quick-glance visual cues. Not at all. Painstakingly written in almost tiny cursive that filled the lines entirely (virtually no white space), the cards — hundreds of them — gave evidence of a rigorous, nuanced intellect.\nLater, through the museum, it is the copious hand-written material which most vividly brings Reagan to life, while destroying the myth that the man was a celluloid simpleton reading others’ lines.\nParticularly moving was the actual, hand-written draft of the famous letter he wrote, from his post-assassination-attempt hospital bed, to hideous Soviet leader Leonid Brezhnev. Still in rather precarious health, and against the advice of some aides (and doctors), Reagan insisted — in his own hand, scratching out words along the way that weren’t quite right — on both making a heartfelt plea for peace and, characteristically, insisting that the American, freedom-centered worldview was superior to Soviet repression.\nThe letter was the unfiltered essence of Reagan, strong-willed and insistent that his principles were correct, but magnanimous and eager to find common ground.\nAlso moving was the audio of Reagan himself describing, in retrospect, his famous series of meetings with Soviet semi-reformer Mikhail Gorbachev. The account is made more deeply personal by his own voice. Indeed, throughout the museum, the use of audio and video is superb, with Reagan “coming to life” as a vibrant, compelling figure.\nIt’s also worth noting — I won’t belabor the point — that I was literally brought to tears to see and hear again how a president should speak and act, how a certain dignity and decency were once considered essential characteristics to model. True, some presidents (Kennedy, Johnson, Nixon, Clinton) didn’t exactly excel at that task, especially in private, but at least they usually attempted in public to pay homage to those expectations. One wonderful thing about Reagan, indisputably apparent throughout these exhibits, is that those behavioral virtues emanated from Reagan without artifice. They were part of his essence, a part lamentably lacking in today’s politics.\nOf course, no review of the Reagan Museum can fail to mention its three most famous exhibits: a full-sized model of the Oval Office, meticulously re-created exactly as it was in Reagan’s day; the actual Air Force One plane used throughout the Reagan presidency; and the multi-colored piece of the Berlin Wall next to which, in a famous photo, Reagan and Polish hero Lech Walesa posed together in celebration of freedom’s victory over Sovietism.\nAll three exhibits inspire awe. To actually walk through the former Air Force One is fascinating: At only about a third the size of the current 747, this old 707 was far more humble and even homey (but not homely) than one would expect. There was something remarkably unpretentious, for example, about the tiny little cot on which Nancy Reagan grabbed some shut-eye on long journeys.\nBut for those of us of a certain age and older (I’m 54), the piece of the Berlin Wall was the most chill-inducing. For those just a few years younger (much more so for Millennials and whatever they call the generation after that), it is hard to imagine what an ominous presence that wall was, physically and emotionally, for the first quarter century of our lives. Had Reagan not been president, there is good reason to think the monstrosity would still be standing in Berlin, rather than having one piece of it peacefully overlooking a lovely valley, not many steps from the grave of the great American president who worked to tear it down.\nBack inside the museum, the final large-ish room of the tour features an audio-visual montage of some of Reagan’s finest moments and speeches. Right at the end, most inspiringly, is the simple clip from his final Republican National Convention Address (in 1992, four years after he left office): “Whatever else history may say about me when I’m gone, I hope it will record that I appealed to your best hopes, not your worst fears; to your confidence rather than your doubts.”\nThe Reagan Library and Museum reminds us that Reagan’s wish is the real American way. Here’s hoping we recapture it.\nQuin Hillyer (@QuinHillyer) is a Senior Editor of The American Spectator, and is the author of The Accidental Prophet trilogy of recently published satirical, literary novels.","url":"https://spectator.org/reagan-library-shows-america-at-its-best/"}
