{"authors":[],"date_download":"2018-10-22 22:49:43","date_modify":"2018-10-22 22:49:43","date_publish":"2014-05-12 00:00:00","description":"Israel accuses Iran of using nuclear negotiations as a stalling tactic while it pursues nuclear weapons.","filename":"data/vaneerConsumption/RealityasItIsIsraelStickstoHardLineonIransRouhani.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/429251/140508-netanyahu-mn-1106_c73a6fc85a5e81165fd351b48d30a677.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_twitter-diplomacy_reality-it-israel-sticks-hard-line-irans-rouhani-n101556_1540248583.html","title":"'Reality as It Is': Israel Sticks to Hard Line on Iran's Rouhani","title_page":"'Reality as It Is': Israel Sticks to Hard Line on Iran's Rouhani - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"TEL AVIV, Israel - In Israel, history is always close at hand, and its current prime minister regularly invokes the past to warn of what is to come.\nIn a speech to mark this year's Holocaust Memorial Day on April 27, Benjamin Netanyahu compared today's Iran to the Germany of the 1930s. Those who tried to warn the world about the Nazis were, he said, dismissed as “prophets of doom” and “warmongers.” According to Netanyahu, the international community is making the same mistake right now as the appeasers did back then.\nWorld leaders must see “reality as it is, not as how they would like it to be',” Netanyahu said.\nPlay Facebook\nTwitter\nEmbed Chapter 4: A Promising Start 7:38 autoplay autoplay Copy this code to your website or blog\nAt issue are nuclear negotiations between Iran, and the United States, France, Germany, Britain, China and Russia. The so-called P5+1 are intent on ensuring that Iran does not develop nuclear weapons. Tehran, meanwhile, maintains that its nuclear program is peaceful and is looking to end or ease sanctions crippling its economy.\nThe election of centrist Hassan Rouhani as president last June ushered in dramatically improved relations with much of the rest of the world and renewed hopes that a nuclear agreement could be signed. But while the P5+1 appear to be moving briskly towards some sort of deal with Iran, Netanyahu accuses Tehran of using the talks as a stalling tactic while it pursues nuclear weapons.\nSimply put, Rouhani is a “wolf in sheep’s clothing,” he says.\nNetanyahu and other officials say Iran has called for the destruction of Israel and continues to enrich uranium, builds facilities to extract plutonium and develops weapons systems which can deliver nuclear payloads. Contrary to Israeli claims, Rouhani’s government has not called for Israel’s destruction.\nIn short, an interim agreement signed in November leaves Iran very close to getting a bomb, and that's why it’s a “historic mistake,” according to Netanyahu. His claim that Iran is close to developing a nuclear bomb is widely disputed.\nPlay Facebook\nTwitter\nEmbed Netanyahu critiques President Rouhani 1:20 autoplay autoplay Copy this code to your website or blog\nSo what options does Israel –- which is widely assumed to have a nuclear arsenal, even though it has never admitted it openly -- have if an agreement on Iran’s nuclear program is announced?\nNot many, according to Simon Schiffer, chief diplomatic commentator at Yedioth Ahronoth newspaper.\n“Netanyahu has lost this fight,” he said. “The Americans have no intention of taking military action against Iran, and it’s impossible for Israel to attack unilaterally. Negotiations are the only game in town –- further agreements will be signed.”\nFor Schiffer, Netanyahu has been left out in the cold by the P5+1’s stance on Iran, while the diplomacy heats up. Netanyahu issues his warnings, and watches “a succession of European diplomats visit Tehran, and Western businesses rush to sign contracts there.”\nPlay Facebook\nTwitter\nEmbed Iran’s Rouhani: ‘We do not seek war with any country’ 1:32 autoplay autoplay Copy this code to your website or blog\nWhile the prime minister appears to be plowing a lonely furrow diplomatically, there can be frustration in Israel with the perception that it is isolated on the Iran issue.\n\"Too often this gets framed in terms of Israel versus the world, when really it's Iran versus the world,\" said Emily Landau, Ph.D., a fellow of Israel's Institute for National Strategic Studies. \"No one wants to see Iran get the bomb.\"\nAnd while there may be nothing Israel can do independently while the United States is leading negotiations, Landau says it has to work with America to make sure it doesn't strike a bad deal.\n\"There's another worry that's out there,\" she adds. \"That what President Obama might be interested in is just getting to the end of his administration having prevented a nuclear Iran on his watch.\"\nPlay Facebook\nTwitter\nEmbed Kerry and Zarif Hash it Out On Their Own 2:28 autoplay autoplay Copy this code to your website or blog\nWhile Obama has made clear that the military option isn't off the table, Israel continues to prepare to take action in its own.\nOthers in Israel -- usually military types –- say that Israel might be able to take decisive unilateral action against Iran's nuclear infrastructure. After having had years to prepare for such a strike, and in an age of cyber warfare, the old assessment that Israel doesn't have enough planes or powerful enough bombs might be outdated, they say.\nAnd then there's what the Tel Aviv-based political analyst Daniel Nisman likes to call Netanyahu's “old school” commitment to doing whatever it takes to prevent a second Holocaust.\n\"If the prime minister has a choice between Iran having the bomb, and not pissing off the Americans, and Iran not having the bomb, he's going to choose the latter,\" he said.","url":"https://www.nbcnews.com/feature/twitter-diplomacy/reality-it-israel-sticks-hard-line-irans-rouhani-n101556"}
