{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:24:20","date_modify":"2018-10-30 21:24:20","date_publish":"2014-09-08 12:39:09","description":"Truancy, it conjures up images of the 1930's and Depression Era under-aged hooligans playing hooky in back alleys, but wait, truancy is alive and well and |","filename":"data/vaneerConsumption/ReallyTexasTruantOfficers.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/09/6/Empty%20Classroom%20(1).jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_09_08__1540934660.html","title":"Really Texas, Truant Officers?","title_page":"Really Texas, Truant Officers? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Truancy, it conjures up images of the 1930’s and Depression Era under-aged hooligans playing hooky in back alleys, but wait, truancy is alive and well and on the books in the freedom and liberty loving Lone Star state where the delinquency is still criminalized but really Texas, truant officers?\nThese days, most agree it is time decriminalize it. Some argue the current truancy law infringes on parental rights, others, on student rights.There are even those who believe it is just a cash cow that rakes in up to $500 per penalty. Regardless, many parents feel that truancy laws are redundant and overly punitive.\nThe Texas Education Code (TEC) 25.085 demands compulsory school attendance that is waived only by the provisions of Section 25.086 meaning, private or parochial school attendance “that includes in its course a study of good citizenship.” Likewise, homeschoolers fought hard for their rights. Homeschooling falls under the jurisdiction of private schools in Texas but even the Texas Homeschool Coalition (THSC), a major player in the battle for parental rights in the education of children, tells parents what to do in case of a visit from the truant officer.\nChapter 25 of the TEC lists all truancy offenses, including any unexcused absence by a public school or absence of 10 or more days or even parts of days in a six month period and the school district by law must file charges on the student.\nWorse, a school district may file charges on your child if there are unexcused absences of 3 or more days or parts of days in a four week period, according to the Texas Truancy Laws pamphlet. Even worse than that, charges can be brought up against parents under “Parent Contributing to Non-Attendance” if the child aged 12 up through 17, is required to attend school by law.\nIf convicted, it is a Class C misdemeanor with that $500 fine. It is also a conviction that can land on the minor and the parent’s records as a violation of the TEC or the Family Code. Yet, Class C is the lowest on the chain of criminal crimes, on par with a traffic ticket.\nLike deferred adjudication for speeding, there are expunctions and dismissals for truancy. A $30 filing fee and legal procedure that “essentially erases thelegal effects of a criminal conviction,” also according to the state Truancy Guide.\n“Truancy is currently a criminal offense in Texas. As a part of my commitment to finding the best ways to educate young Texans, I have directed the Committee on Jurisprudence to explore the implications of current law and make recommendations on an approach that is best for Texas families as they go about educating their children, ” Lt. Governor David Dewhurst told Breitbart Texas.\nOn August 8, 2014, Dewhurst issued the call to end truancy as an offense in Texas schools in the “Interim Charges Relating to Business and Commerce, Criminal Justice, Intergovernmental Relations, Jurisprudence, Natural Resources, Education, State Affairs, and Transportation,” asking for a Jurisprudence committee to study and make recommendations on the “feasibility of removing failure to attend school as a Class C misdemeanor and determine the feasibility of adjudicating juvenile truancy as only a civil offense.”\nTexas is only one of two states that continues to criminalize truancy. It was supposed to be decriminalized through Senate Bill (SB) 393 during the 83rd Legislative session. The bill, authored by Sen. Royce West (D-Dallas), axed it along the way, leaving truancy alive and kicking.\nPerhaps, the legislation got bogged down in the Dallas Commissioners Court, home to the now indicted John Wiley Price and Democrat Judge Clay Jenkins, who sought to shelter up to 2,000 illegal immigrant minors in Dallas County.\nAccording to a 2013 Texas Tribune article, the Dallas County Court created a specialized truancy court about a decade ago. “Before that, justices of the peace, who often lacked juvenile justice experience, handled truancy cases. Students ‘stood in line along with everyone else waiting for speeding tickets,'” Jenkins said.\nAlthough Jenkins retooled the county’s truancy charges down to $100, he argued to keep the special truancy court, claiming that Dallas ISD numbers indicated that “93.6 percent of all students who appear in truancy courts either graduate or stay enrolled in school. The district’s dropout rate, he said, has fallen from almost 26 percent in 2007 to 12 percent in 2011,” the Tribune reported, also citing that truancy cases “made up more than 113,000 Class C misdemeanor cases against children ages 12 to 17 in fiscal year 2012.”\nA large percentage of students who faced Class C charges, in general, came from low-income families, who could not afford to pay the fines.\nMeanwhile, all kinds of disrespectful and out-of-control behavior starting with chewing gum in schools, disrupting class, foul language, fighting with other students, talking back to the teacher, failure to follow school rules and the reckless damaging of school property were decriminalized down to complaint status, left up to school police officers to decide whether or not to pursue further as a crime because of SB 393, the Tribune also pointed out.\nConservative think-tank, the Texas Public Policy Foundation (TPPF), looked at truancy nationwide through their Center for Effective Justice report “Kids Doing Time for What’s not a Crime: the Over-Incarceration of Status Offenders.” They determined that truancy was among a very small percentage of offenses that, in fact, declined over a decade they examined beginning in 2001.\nFolding truancy into a variety of other minor juvenile infractions, the TPPF report recommended that “Given the non-serious nature of those offenses and the fact that community based alternatives are much less-expensive, more-effective, and avoid the damage incarceration and other types of residential placement does to status offenders, the continued confinement of thousands of youth for status offending represents one of the major shortcomings of the nation’s juvenile justice systems.”\nThey were not the only ones to think so. Texas Appleseed, the social and economics justice advocacy organization that stands firmly on the left side of political aisle, filed a 2013 complaint with the US Department of Justice, asking the feds to investigate truancy as a violation of students’ constitutional and civil rights.\nAppleseed approached their claim from the perspective that the majority of convicted truants were low-income youth who could not pay the fines, or disabled. They called truancy practices “cruel and unusual punishment.” Their claim was on behalf of students in four Metroplex school districts — Dallas, Garland, Mesquite, and Richardson.\nHowever, what about the Collin County family who in 2011 returned from an extended Christmas vacation only to be served with a court summons for potential criminal neglect. The Dallas Morning News reported on the Pate family’s personal experience straddling the line between school authority and parental rights.\n“The law exists to solve a truancy problem, not instigate one,” the article stated; however, the way the current law is structured, it tramples over parent’s rights, intervening after day 10 of a school absence.\nThe New York Times reported in a pickup of a Texas Tribune article, “Eliminating the crime of truancy as a Class C misdemeanor was the original intent of Senate Bill (SB) 1234, which would require that cases be handled only by school districts and juvenile courts.”\nSenator John Whitmire, (Houston) who authored the SB 1234 said he had heard of students who wanted to attend school but could not because of medical or other reasons. The bill passed in the last legislative session but was vetoed by Governor Perry.\nIn a June 14, 2013 news release, the Governor’s office explained that SB 1234 overlapped with SB 393 “concerning which truancies are considered a ticketable offense.” There was also disagreement on handling truancy through behavioral improvement plans.\n“While these plans are meant to hold students accountable for attendance for behavior management, they do not track the child from district to district and are lost as a student transfers from one school to another, which is common for chronically truant students,” the release read.\nIt came down to tracking students? Decriminalizing truancy also faced opposition from some school district administrators, who said the threat of fines was necessary to keep students from skipping school.\nHowever, in handling the underlying issues behind truancy, districts like Houston ISD and Midlands ISD did just that with aggressive retentionprograms. They re-engaged dropouts and delinquents as Breitbart Texas reported. The Tribune article on truancy also noted similar efforts and results for Garland ISD.\nIn the end, the 83rd Legislature’s unfinished business of decriminalizing truancy will fall on the shoulders of the next session to do the right thing.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2014/09/08/really-texas-truant-officers/"}
