{"authors":["Elaine Donnelly"],"date_download":"2018-10-30 19:04:33","date_modify":"2018-10-30 19:04:33","date_publish":"2015-04-15 13:06:07","description":"In 2013, the Obama Administration announced the President's intent to repeal regulations exempting military women from direct ground combat units such as the infantry. The Marine Corps dutifully began a multi-phased research program to determine whether women could meet male physical standards. Two and a half years later, reality is setting in. |","filename":"data/vaneerConsumption/RealityCheckforWomeninCombat.json","image_url":"https://media.breitbart.com/media/2015/01/dempsey.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_15__1540926273.html","title":"Reality Check for Women in Combat","title_page":"Reality Check for Women in Combat | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In 2013, the Obama Administration announced the President’s intent to repeal regulations exempting military women from direct ground combat units such as the infantry. The Marine Corps dutifully began a multi-phased research program to determine whether women could meet male physical standards. Two and a half years later, reality is setting in.\nSince 2012, 29 female Marine officers tried but did not succeed on the Infantry Officer Course. Only four survived beyond the first day on the course, which involves extraordinarily tough challenges that prepare men to lead others into battle.\nMore than 90 female volunteers did succeed on the less-demanding infantry course for enlisted personnel, but the Marines had to suspend an experimental requirement of three pull-ups in boot camp because 55% of the female enlistees could not meet that minimum standard.\nMarine proxy strength test results in 2013, which the Center for Military Readiness analyzed in an Interim Special Report, confirmed wide gender-related disparities. Field experiments and Ranger training tests are underway, but unease continues to grow. In an official Army survey, 92.5% of women said they would not serve in the combat arms.\nMeanwhile, the British Ministry of Defence has produced a 29-page Review Paper, which presents specific data and findings exposing the negative consequences of co-ed combat. The document, recently analyzed by CMR, explicitly defines what infantry, armor, artillery and Special Operations Forces actually do when they “close with and kill the enemy.”\nGoing beyond the experience of being “in harm’s way,” ground close combat (GCC) involves “the requirement to deploy on foot over difficult terrain, carrying substantial weight, to engage in close quarter fighting, recuperate in the field and then do the same again repeatedly over an extended period.”\nFurthermore,\nThe nature of conflict is immutable; GCC will remain an intense, visceral and unavoidably physical activity [involving] violent death, injury, all-pervading concussive noise, horror, fear, blood and high levels of emotion . . . Combat exposes inadequacies and applies manifold stresses [that] . . . are likely to occur repeatedly throughout combat operations and require high levels of both mental and physical endurance.\nBritish experts studied the impact of gender integration on 21 factors affecting combat effectiveness. Ten factors, with the exception of “courage,” were inconsequential, unknown, or “multi-directional.” Of 11 factors expected to have “negative” effects on combat effectiveness, three “cannot be mitigated by changes to structure or training.” The three show-stoppers were “Survivability & Lethality, Deployability, and Morbidity” (vulnerability to injury or illness).\nNumerous facts in the British report contradict “Equality Analysis” claims that pre-screening, special training, nutritional supplements, and “cultural change” could “mitigate” all problems. For example, “[W]omen have smaller hearts, about 30% less muscle, and a slighter skeleton with wider pelvic bones resulting in less explosive power and upper body strength.” These physiological differences “disadvantage women by 20 to 40%; so for the same output women have to work harder than men.”\n“Output” means “survivability and lethality” – staying alive and killing the enemy. Deficiencies in strength and endurance are likely to result in “early onset of fatigue [and] a distinct cohort with lower survivability in combat . . .Similar research points to a reduced lethality rate; in that combat marksmanship degrades as a result of fatigue when the combat load increases in proportion to body weight and strength.”\nDisproportionate injury rates are a major concern. “[T]he rate of trauma and overuse lower limb MSK (musculoskeletal injury) remains two-fold higher. . . and the rate of hip and pelvic stress fractures is ten-fold higher in women.” Some female athletes can outrun men, but not with 83 pound combat march loads on their backs.\nThe risk of MSK injury is even greater during the first twelve months after giving birth. And in the more extreme combat roles, “potential chronic risks may include irreversible bone fragility and infertility.” British officials noted that female “physical elites” are strong, but still would be “more susceptible to acute short term injury than men.”\nLand combat on the same involuntary basis as men would promote ideology, not women. In 2011, the Pentagon-endorsed Military Leadership Diversity Commission recommended co-ed land combat to advance “gender diversity metrics,” meaning “quotas.” Demographic group rights would replace merit-based standards with lower-but-equal “gender-neutral” standards.\nAccording to AP, about 9,000 Special Operations Forces Command (SOCOM) personnel said in a recent RAND survey that they do not believe women can meet the physical and mental demands of their commando jobs. They also fear that department leaders would “capitulate to political pressure, allowing erosion of training standards.”\nIn January 2013, Joint Chiefs Chairman General Martin Dempsey called for a “critical mass” or “significant cohort” of women in the combat arms, and suggested that high standards beyond female capabilities would be questioned. Under the “Dempsey Rule” (If it is too hard for women, it is probably too hard), tough standards eventually will erode to “equal but lower” levels.\nPresident Obama’s deadline for implementing women-in-combat plans is January 2016, but the service chiefs may request exceptions. Reality-based evidence makes the case for retaining high standards and sound policies. How will military leaders handle the truth?\nElaine Donnelly is President of the Center for Military Readiness, an independent public policy organization that reports on and analyzes military/social issues.","url":"https://www.breitbart.com/politics/2015/04/15/reality-checks-momentum-for-women-in-land-combat/"}
