{"authors":["Nicholas Godden For Mailonline"],"date_download":"2018-10-22 22:58:12","date_modify":"2018-10-22 22:58:12","date_publish":"2016-01-29 10:38:01","description":"Real Madrid are set to agree terms on a new kit deal with sportswear giant adidas that will see the La Liga giants net a staggering £106m a year, according to reports in Spain.","filename":"data/vaneerConsumption/RealMadridandadidasclosetonew106mayearkitdealthatwouldeclipsethe750m10yeardealManchesterUnitedsigned.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/308AD45900000578-0-image-a-34_1454065325114.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422543_Real-Madrid-adidas-close-new-106m-year-kit-deal-eclipse-750m-10-year-deal-Manchester-United-signed_1540249092.html","title":"Real Madrid and adidas close to new £106m-a-year kit deal that would eclipse the £750m 10-year deal Manchester United signed","title_page":"Real Madrid and adidas close to new £106m-a-year kit deal that would eclipse the £750m 10-year deal Manchester United signed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Real Madrid are set to agree terms on a new kit deal with sportswear giant adidas that will see the La Liga giants net a staggering £106m a year, according to reports in Spain.\nThe deal would be the biggest of its kind, eclipsing the agreement adidas signed with Manchester United in the summer of 2014.\nThe Old Trafford club, who started wearing adidas shirts at the start of this season after a 13-year association with Nike, agreed a 10-year deal worth £750m with the German brand.\nReal Madrid are close to agreeing the biggest kit deal in club football with adidas\nThe front page of Marca on Friday reads: 'The most expensive shirt in the world'\nMOST LUCRATIVE KIT DEALS 1. Real Madrid – adidas: £106m per season over 10 years 2. Man United – adidas: £75m, 11 years 3. Bayern Munich – adidas: £60m, 15 years 4. Chelsea – adidas: £30m, 10 years 5. Arsenal – Puma: £30m, 5 years 6. Liverpool – New Balance: £24m, 6 years 7. Barcelona – Nike: £24m, 10 years 8. Juventus – adidas: £20m, 8 years 9. Milan – adidas: £18m, 10 years 10. PSG – Nike: £18m, 11 years\nBut, if figures published in Marca on Friday are correct, Real Madrid's new deal will blow United's out of the water and will be the biggest kit agreement in club football.\nIt is thought Real and adidas are close to agreeing terms on what would be a 10-year deal, smashing the £1billion mark.\nMarca's front page features a picture of the Real Madrid shirt with the headline: 'The most expensive shirt in the world.'\nThe deal would see Real Madrid regain their position at the top of the most lucrative kit agreements after losing it to Manchester United in 2014.\nTo put it in perspective Real Madrid's new kit deal would be worth more than Chelsea, Arsenal and Liverpool's combined.\nReal Madrid only signed a new deal with adidas in 2012 which was due to run until 2020 but the new agreement would replace that one at the end of the current season.\nReal Madrid are close to agreeing a new kit deal with adidas for a staggering £106m a year\nManchester United signed a massive £750m 10-year deal with German sportswear brand adidas in 2014\nBundesliga giants Bayern Munich signed a 15-year deal with adidas last summer which is worth £60m per season.\nThe contract negotiated by United chief executive came after a season in which United failed even to qualify for Europe but adidas justified their huge outlay by predicting £1.5billion worth of replica shirt sales over the term of the contract, which will begin next year.\nUnited's previous kit manufacturer Nike did not take up their right to match adidas’s offer and continue a partnership with United worth £30m a year for 13 years because they no longer consider it value for money.\nManchester United have struggled this season with the club recently dropping out of the Champions League places and concerns over the playing style under Louis van Gaal lead to criticism earlier this month from adidas chief executive Herbert Hainer.\n''Business with Man United is going very well,' he told Suddeutsche Zeitung. 'We sell more jerseys than expected, the foreign share is 60 percent.","url":"https://www.dailymail.co.uk/sport/football/article-3422543/Real-Madrid-adidas-close-new-106m-year-kit-deal-eclipse-750m-10-year-deal-Manchester-United-signed.html"}
