{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-22 22:49:11","date_modify":"2018-10-22 22:49:11","date_publish":"2016-01-29 10:17:34","description":"Real fur is making a comeback with fans taking to Instagram and devoting accounts to their passion with names such as Fur Fetish Love and Fur Heart, prompting a backlash from animal lovers.","filename":"data/vaneerConsumption/RealfurmakesacomebackasfansboastonInstagram.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/02/01/17/30AC645000000578-0-image-a-21_1454348031573.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421750_Real-fur-makes-comeback-fans-boast-love-animal-pelts-social-media_1540248551.html","title":"Real fur makes a comeback as fans boast on Instagram","title_page":"Real fur makes a comeback as fans boast on Instagram | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Post selfies wearing real fur and give advice on where to buy\nThere are more than 28,000 posts with the hashtag #realfur on Instagram\nValue of fur industry has increased year-on-year over past decade\nThanks to paint-wielding protesters at fashion shows and campaigns by celebrities and a burgeoning anti-cruelty movement, fur became a taboo fashion item throughout the Nineties and Noughties.\nBut now it is creeping back on the catwalk, as well as being worn by stars and fashionista alike, and it's becoming so accepted that fans are taking to Instagram and Twitter to boast about their love of wearing genuine pelts - sparking backlash from animal rights campaigners.\nAnd experts say that social media is to blame for fur's resurgence. There are currently more than 28,000 posts with the hashtag #realfur on Instagram and devotees are creating accounts with usernames such as Fur Fetish Love, The Fur Lover, Fur Heart and Beautiful Fur to show off their selfies, posing in coats and wraps made from fox, mink and rabbit.\nScroll down for video\nThere are currently more than 28,000 posts with the hashtag #realfur on Instagram\nUK-born Louise Tsang, 24, who now lives in Ireland describes herself as a 'fur and handbag addict' and has just launched a blog dishing out fashion advice for fellow enthusiasts.\n'So I'm trying to plan my outfit for my cousin's wedding coming up in February,' she writes. 'I've absolutely no clue what to wear. All I know is; go naked, have a nice pair of sexy patent heels and a luscious silver fox collar.'\nAnother recommendation is to 'wrap yourself in a beautiful emerald green mink. Embrace your fur pieces with love.' She also advises people to accessorise with 'a simple satchel crossbody bag' and 'a touch of lush fur accessories'.\nDevotees are creating accounts with usernames such as Fur Fetish Love, The Fur Lover, Fur Heart and Beautiful Fur to show off their selfies, posing in coats and wraps made from fox, mink and rabbit\n'Wearing real fur is a very personal thing,' Louise told FEMAIL. 'It expresses one’s feelings in terms of an individual’s sense of style and their outlook on fashion.\n'Real fur also expresses an aura of elegance, style, sexiness and femininity. When you actually put on a real fur piece, the first thing you notice is that the experience is very sensual. Just the sleek grazing of the fur on your skin gives you a very sensational feeling.\nI think it’s that experiential moment that makes so many individuals love real fur. That’s why; in my opinion, people (particularly women) are interested in wearing real fur again is that it expresses \"the woman, the lady and timeless elegance\".'\nLouise believe the trend has also been driven by Fendi’s Fur Collection, Monster Accessories and The Karlito or Louis Vuitton’s Fox Tail Accessories.\n'The smaller fur accessories are great for first time fur buyers,' she said. Then once the trend of people wearing the Fendi monsters or the real fur pom-poms appeared; almost every woman had to have one.\nLouise Tsang (left) has set up a blog to dispense real fur fashion tips, while Coconut Couture added the hashtag 'real fur' to this selfie to her followers would know her collar and cuffs are the real deal\n'Therefore the fur trend became a snowball effect where people wanted more and more real fur.'\nShe's glad to see more people sharing their love of fur on social media, saying: 'I truly respect those individuals who kindly share their passion for real furs because it is an area within society that is shunned.'\nLouise herself has been on the receiving end of some negative feedback.\n'A while back I posted a picture on Instagram of a super cute poncho in rabbit fur and one account holder made very negative comments about it.\nI found it very offensive, that another individual is trying to force their opinions and beliefs onto me. The way I see fur is something luxurious, precious and beautifully elegant. It is a forever piece that every individual takes good care of.\nI strongly believe that there are ethical ways to go about within the fur industry and it is something that furrier businesses need to show the world how they operate. You can see the quality in the real fur is much different to those who don’t look after their animals. Bad treatment towards the animals results in lower quality pelts.'\nBirkin_adorin has devoted her Instagram account to sharing her love of genuine animal fur with her 15,000 followers. She posted this image of herself 'chinchillin' in real chinchilla fur\nBirkin_adorin is another enthusiast who has devoted her Instagram account to sharing her love of genuine animal fur with her 15,000 followers.\nHer bio reads: 'I adore luxe, Chanel, La Perla and fur (there I said it) and, of course...Hermes .'\nShe's captioned one of her pictures: 'Sable is love. Fairly difficult to buy in England but try Harrods.'\nAnother recent selfie shows her posing in a long sleeveless grey coat made from Chinchilla,\n'Again Chinchillin',' she joked to her followers.\nShe also praised a photo of a catwalk model wearing a jacket made from alligator skin, with a sable collar.\nLola Gidi describes herself as a 'fur lover' and has shared dozens of selfies in a wide variety of real fox fur coats\nThe increased visibility of fur on social media appears to be fuelled by the fashion industry's newfound acceptance of the material after years of shunning it.\nKarl Lagerfeld dedicated his 50th anniversary collection at Fendi to fur last year, Gucci launched a kangaroo fur lined slipper.\nFur featured heavily in the Autumn/Winter collections from many of the big design houses last year, and at the recent men's fashion weeks fur was a major trend.\nAccording to research by the International Fur Federation more than 60 per cent of the designers used the material in their offerings for winter 2016.\nIn London 28 out of 60 designers including Burberry and Coach sent models down the catwalk in real fur clothing.\nAlevgold posed in a vibrant coat trimmed with green fur and assured her follower is was real\nIn Milan the figure was 35 out of 38, with Dolce & Gabbana featuring fur coats and Marni and Giorgio Armani sporting fur stoles.\nThe global value of the fur industry stands at around $40 billion and has been increasing year-on-year for over a decade, rising 70 per cent since 2001.\nNick Ede, brand expert and creative director of EdenCancan, says that despite previous outrage over wearing real fur, celebrities and designers have been gradually reintroducing the trend.\n'Fur and fashion have gone hand in hand for years,' he said. 'Men's and women's styles have used fur as a luxury item that '\"makes\" an outfit. Whether it's trim, scarves or full coats fur has always had a place.\nIn recent years many designers have boycotted the use of fur and some like Stella McCartney only use vegan products. Charities like Peta have targeted the fashion industry for many years and successfully saw a decline in the use of fur.\nFairycake urged Beautifulfur to think of the animals who had been killed to make her stole\nCarjj90 described Beautifulfur as 'a psychopath' for her decision to support real fur\n'But in the past year there has been an increase in the use of fur for fashion and it's almost as if the designers are testing the water to see if the controversy is still there.\n'We have seen many celebrities in real fur and it's not caused the outrage it would have a few years ago.'\nNick believes that the rise of social media is to blame as it's created a new marketplace in a time when you're unlikely to see a fur retailer on your local high street.\n'With the advent of Instagram and Twitter there is a really business of selling fur coats online that would never have been acceptable before,' he said.\n'It seems that in most countries there is no issue with really fur being worn or sold but here in the UK it still remains controversial but the demand is increasing.\n'The reason for this is trend and luxury combined. People want bragging rights and now \"real\" has become a by word for success, wealth and trend.'\nA model walks the runway in a fur coat at the Burberry show during The London Collections Men AW16 at Kensington Gardens\nMarni sent male models down the catwalk sporting real fur scarves and stoles\nAt London Men's Fashion week recently 60 per cent of the designers used authentic fur in their collections\nIndeed, it certainly appears to be seen as a status symbol on social media.\nOn Instagram Fur_Heart encourages people to send her their selfies wearing fur to be featured on her page. One user who was keen to be featured was Aleksandra Godlewska-Kołodziej, who shared a photo of herself posing in a grey hooded fur waistcoat.\nMeanwhile Beautifulfur is similarly dedicated to 'sharing some of the most beautiful fur clothing'.\nBut not everyone is impressed by Beautifulfur's posts.\nOne shows a woman in a white dressed with a large fur stole falling down her arms.\n'Wow. Those poor animals,' fairycake commented.\nThe blunt response from Beautifulfur was: 'Shut up.'\nWild_fur shared a photo of a young girl in a new rabbit fur coat with a star decoration\nVegan Eve criticised Wild_Fur for allowing a young child to wear real fur, saying they couldn't expect her to grw up to be an ethical adult\nAnother user asked Beautifulfur what's 'wrong' with her to enjoy wearing fur, while Carjj90 commented, 'She's a psychopath, clearly.'\nBut despite the criticisms some fans have endured, Lolagidi has shown no hesitation in sharing her enthusiasm with followers on social media.\nDescribing herself as 'fur lover' she's posted dozens of photos of herself in different coats to showcase her collection - with fox pelt seeming to be her material of choice.\nMeanwhile, fur enthusiast Alevgold has been sharing her passion with her young daughter.\nAs well as sharing a selfie in which she's dressed in a vibrant green fur trimmed coat, she posted a picture of her in an outfit of a fur collared coat, a mini Prada bag and Chelsea boots.\nHer picture caption included the hashtags #fashionista #babygirl #dressedbetterthanme #realfur and #welovefurs.\nA model in fox fur walks the runway during the Yiqing Yin Haute Couture Spring Summer 2016 show as part of Paris Fashion Week\nHowever, another shot of a youngster in a pink rabbit fur coat with a star pattern provoked controversy when it was uploaded by Wild_Fur.\n'Bringing up you child to think that wearing the tortured skin of another being is ignorant and disgusting,' Vegan.Eve commented.\n'How can you expect her to be an ethical adult when she's been taught this is OK?'\nWild_fur was having none of her criticisms though and hit back, saying: 'I found annoying your vegan propaganda here at my page. Please keep it to yourself or go to Fendi show with a paint bucket.'\nCommenting on the trend PETA UK's Director Mimi Bekhechi said she believes that despite the surge in posts on social media, most people still favour faux fur over real.\n'Furriers and their few fans are trying to create a trend that belies reality, and most people are rolling their eyes at the very idea that being ignorant, arrogant and cruel is anything to boast about,' she said.\n'Showing yourself dressed up in the skins of dead animals seems like a rather desperate bid for attention for your failed business, as there is nothing stylish or creative about looking like a caveperson.'\nShe points to research that shows the British public is still totally opposed to real fur.\n'Recent studies show that 95 per cent of UK shoppers wouldn't touch the stuff and also consider even a bit of fur trim to be tat,' she said.\n'Respected designers such as British icons Stella McCartney and Vivienne Westwood and fresh emerging talents like Vika Gazinskaya don't pretend to be edgy by using a taboo material.","url":"https://www.dailymail.co.uk/femail/article-3421750/Real-fur-makes-comeback-fans-boast-love-animal-pelts-social-media.html"}
