{"authors":[],"date_download":"2018-10-30 20:35:18","date_modify":"2018-10-30 20:35:18","date_publish":"2015-04-04 15:27:57","description":"Police have released the identity of a suspect arrested Friday for impersonating a law enforcement officer and are seeking others he might have encountered.","filename":"data/vaneerConsumption/RealpoliceidentifymansuspectedofimpersonatingDEAagent.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/04/04/Images/photos.medleyphoto.7068394.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_real-police-identify-m_36c312ac9cfa22b7d22d9a1ed69c1aa6__1540931718.html","title":"Real police identify man suspected of impersonating DEA agent","title_page":"Real police identify man suspected of impersonating DEA agent","title_rss":"NULL","source_domain":"ajc.com","text":"Police have released the identity of a suspect arrested Friday for impersonating a law enforcement officer and are seeking others he might have encountered.\nDaniel Harbison, 40, was arrested around 9:30 p.m. Friday after his vehicle was recognize by officers who saw the description in an email sent out to law enforcement agencies by Doraville police.\nPolice believe Harbison was the person who initiated a traffic stop on an off duty Doraville officer earlier in the day.\nThe officer was driving with his daughter when another driver flashed green and white LED lights on the dashboard of his Dodge Charger while the officer and his daughter were on Homeland Drive near Ga 141, said Doraville Officer Gene Callaway.\nThe Charger driver approached and flashed a “realistic” DEA ID badge. The off-duty officer said he was having a patrol unit come out to check the man’s credentials, Callaway said. That prompted the man to say he had to check on something in his car and then to speed off, Callaway said.\nAnyone who might have been subjected to a traffic stop by Harbison is asked to contact Doraville police.","url":"https://www.ajc.com/news/real-police-identify-man-suspected-impersonating-dea-agent/Ght5anO55jHwME36xyhRJP/"}
