{"authors":["Pete Jenson For Mailonline"],"date_download":"2018-10-23 03:53:33","date_modify":"2018-10-23 03:53:33","date_publish":"2016-01-29 19:13:41","description":"It now seems Real Madrid will be free to pursue the likes of David De Gea, Eden Hazard, Robert Lewandowski and Paul Pogba this summer after FIFA temporarily lifted the transfer ban.","filename":"data/vaneerConsumption/RealMadridandAtleticoMadridhavetransferbanssuspendedbyFIFAandmaybeallowedtosignplayersthissummer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/308AEF4A00000578-0-image-a-12_1454094818102.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423310_Real-Madrid-Atletico-Madrid-recent-transfer-bans-suspended-FIFA_1540266813.html","title":"Real Madrid and Atletico Madrid have transfer bans suspended by FIFA... and may be allowed to sign players this summer","title_page":"Real Madrid and Atletico Madrid have transfer bans suspended by FIFA... and may be allowed to sign players this summer  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It now seems Real Madrid will be free to pursue the likes of David De Gea, Eden Hazard, Robert Lewandowski and Paul Pogba this summer after FIFA temporarily lifted the transfer ban imposed on the Spanish side and their city neighbours Atletico Madrid.\nFIFA’s appeals committee will now study both clubs’ appeals in the coming months and the young players alleged to have broken regulations regarding under-age signings are free to continue playing.\nReal and Atletico are not completely off the hook – FIFA have said that if they come to a ‘definitive decision’ and reject the appeals before June then the transfer ban would be imposed once again.\nReal Madrid and Atletico Madrid have been given a boost after FIFA temporarily lifted their transfer bans\nDiego Simeone will be hoping that he can strengthen his side but that depends on the appeals\nBut this temporary lifting of the ban slows the whole appeals process down and that massively helps both clubs.\nIf FIFA were to reject the Madrid clubs’ appeals with just a couple of months to go before the summer they could then go to the Court of Arbitration for Sport (CAS) and CAS would almost certainly grant them the summer transfer window to sign players while they study their appeal, as they did to Barcelona in 2014.\nManchester United keeper David De Gea is a long-term target for Real and this could affect his future\nZidane is known to be a big fan of Chelsea midfielder Eden Hazard and could now make a move\nThe ramifications for the Premier League could be far-reaching. Madrid’s new coach Zinedine Zidane is an admirer of Hazard and Real still hold out some hope of bringing Spain No 1 De Gea to the club after last summer’s botched transfer collapsed on deadline day.\nThey would also be under less pressure to keep unhappy players with James Rodriguez a possible Manchester United target. Cristiano Ronaldo’s future would once more depend on Paris Saint Germain’s determination to sign him. And if Ronaldo and Rodriguez stayed Manchester United could again test Gareth Bale’s resolve to remain in Spain.\nAtletico will also be affected by the decision. Antoine Griezmann and his manager Diego Simeone are both wanted by Chelsea. A transfer ban next summer had increased the club’s determination to keep both at all costs.","url":"https://www.dailymail.co.uk/sport/football/article-3423310/Real-Madrid-Atletico-Madrid-recent-transfer-bans-suspended-FIFA.html"}
