{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 01:25:37","date_modify":"2018-10-23 01:25:37","date_publish":"2016-01-29 15:20:36","description":"On Thursday it was revealed her former Real Housewives Of New Jersey cast mate Danielle Staub is penning a tell-all book. 'I’m breaking my silence,' the former bad girl of Bravo tweeted","filename":"data/vaneerConsumption/RealHousewivesDanielleStaubpromisestospillsecretsaboutTeresaGiudice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3AC2B00000578-0-image-a-12_1454080760309.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422916_Danielle-Staub-RHONJ-promises-spill-secrets-Giudices-tell-all_1540257937.html","title":"Real Housewives' Danielle Staub promises to spill secrets about Teresa Giudice","title_page":"Real Housewives' Danielle Staub promises to spill secrets about Teresa Giudice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Teresa Giudice was just released in December after a year behind bars because of fraud charges and has a new book to promote: Turning The Tables: From Housewife to Inmate And Back Again.\nBut she's not the only Bravo beauty active in the book business.\nOn Thursday it was revealed her former Real Housewives Of New Jersey cast mate Danielle Staub, 53, is penning a tell-all book.\nScroll down for video\nHer turn to talk: On Thursday it was revealed her former Real Housewives Of New Jersey cast mate Danielle Staub, 53, is penning a tell-all book; here she is seen in 2014\n'I’m breaking my silence,' the former bad girl of Bravo tweeted.\nThe TV personality, who is known for fighting with Teresa on the series, added: 'And writing my tell all including the \"Reality of #RHONJ\" the impact on mine and my family's life's @Andy @bravotv.'\nIt is not known why she singled out both Bravo and Andy Cohen in her tweet, but left off the names of the cast members she feuded with, including Jacqueline Laurita and Caroline Manzo.\nShe did not mix well: Staub was invited on the series by Laurita, but did not get along with the other ladies. She often took pot shots at Teresa and was involved in the infamous scene where Giudice flipped a table in a restaurant that aired in 2009; here is a cast shot from season one\nHer words: 'I’m breaking my silence,' the former bad girl of Bravo tweeted. The beauty, who is known for fighting with Teresa on the series, added: 'And writing my tell all including the \"Reality of #RHONJ\" the impact on mine and my family's life's @Andy @bravotv'\nStaub was invited on the series by Laurita, but did not get along with the other ladies.\nShe often took pot shots at Teresa and was involved in the infamous scene where Giudice flipped a table in a restaurant that aired in 2009.\nThen there was the time when Danielle got her hair pulled by Laurita’s daughter Ashley.\nDanielle, a mother of two, left the franchise in 2012 after just two seasons.\nAt the time, she told UsWeekly, 'I'm way too good for this. They have used me about as much as I can be used.'\nBut everyone can't get enough of... : Teresa has landed her first interview with Good Morning America. The interview has been done already with Amy Robach. It took place in Giudice's Montville Township mansion and will air on February 9,\nThis is not Staub's first book.\nIn 2010 she came out with The Naked Truth: The Real Story Behind the Real Housewife of New Jersey - In Her Own Words that covered her alleged criminal past that was highlighted in the book Cop Without A Badge.\nAccording to amazon.com, the book is 'fraught with tragedy and heartache, low-lifes and high society.\n'From living the good life as a model in Miami, spending a stint in the Big House after getting mixed up with mobsters and the FBI, stripping and fighting for her life in New York, to finally settling down in New Jersey with her daughters, Danielle thought she had already seen it all, but in reality, her second act was just beginning.'\nTheir drama: Giudice finishes her sentence on February 5, although she was released into home detention just before Christmas. Husband Joe reports to the Federal Correctional Institution at Fort Dix in March to serve his 41-month sentence; here they are seen at court in 2014\nMeanwhile, Teresa has landed her first interview with Good Morning America.\nThe interview has been done already with Amy Robach.\nIt took place in Giudice's Montville Township mansion and will air on February 9, the same day her memoir Turning The Tables: From Housewife to Inmate And Back Again is released.\nGiudice finishes her sentence on February 5, although she was released into home detention just before Christmas.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422916/Danielle-Staub-RHONJ-promises-spill-secrets-Giudices-tell-all.html"}
