{"authors":["Brittany Valadez For Dailymail.Com"],"date_download":"2018-10-23 05:27:44","date_modify":"2018-10-23 05:27:44","date_publish":"2016-01-28 21:25:06","description":"Real Housewives of Atlanta star Kandi Burruss, 39, shared of photo of her breastfeeding son Ace, three weeks, while getting her hair washed by a friend.","filename":"data/vaneerConsumption/RealHousewivesofAtlantasKandiBurrussbreastfeedssonAceinsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD71FD00000578-0-image-a-10_1454015808006.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421602_Real-Housewives-Atlanta-s-Kandi-Burruss-breastfeeds-son-Ace-candid-snap-husband-Todd-tastes-sample-milk_1540272464.html","title":"Real Housewives of Atlanta's Kandi Burruss breastfeeds son Ace in snap","title_page":"Real Housewives of Atlanta's Kandi Burruss breastfeeds son Ace in snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Motherhood is quite the juggling act - just ask Kandi Burruss.\nThe Real Housewives of Atlanta star, 39, shared a photo of herself breastfeeding son Ace Wells Tucker while getting her hair washed on Wednesday.\nThe reality star gave birth to her child just three weeks ago on January 6.\nScroll down for video\nHungry child: Real Housewives of Atlanta star Kandi Burruss, 39, shared a photo of herself breastfeeding son Ace Wells Tucker on Wednesday\nIn the snapshot, Kandi is seen lying on a salon chair, hair pulled back and in the sink.\n'This #breastfeeding stuff is no joke. @sewjodie came over to my house to wash my hair & while she was washing @acewellstucker started going crazy! He doesn't care that I have a head full of shampoo. He wants to eat now!, she exclaimed.\nThe reality mom had her blue tank top pulled up, exposing her bra. Son Ace was lying on his mom's chest.\n'Lol! This pic might be a bit much to share on the gram but this is my reality right now. Save your negative comments... #KandiKoatedMilk,' she wrote.\nHe just wants food! In his own Instagram post, young Ace, who claims close to 83,000 followers, was seen crying while his father Todd Tucker held a bottle of milk\nFather's turn: 'I'm about to try some breast milk,' says Todd, as his son continues to cry\nIn an Instagram post set up in young Ace's name, the baby was seen crying over a case of drunk milk.\nIn a video posted to the infant's profile, his father Todd takes a sip of the liquid from his bottle.\n'I'm about to try some breast milk,' he says, as his son's cries increase.\nTasty! He then swished the liquid in his mouth. It's kinda sweet!' he concludes\n'Ace is probably crying 'cause he wants it. But it's my time. Lets see,' he says as he proceeds to drink the milk.\nHe then swished the liquid in his mouth, in an attempt to decipher the flavor.\n'It's kinda sweet!' he concludes.\nDate night: Later that evening, Kandi, who's also the mother to daughter Riley, 13, shared a photo of a fun evening out with her husband\nLater that evening, Kandi, who's also the mother to daughter Riley, 13, shared a photo of a fun evening out with her husband.\n'Our first date night since having #Ace. I pumped enough #KandiKoatedMilk for @todd167 & I to get out for a little while. #Hawks game,' she wrote.\nThe reality star first met husband Todd when he was a line producer on her show. They were married April 4, 2014.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421602/Real-Housewives-Atlanta-s-Kandi-Burruss-breastfeeds-son-Ace-candid-snap-husband-Todd-tastes-sample-milk.html"}
