{"authors":["Sami Mokbel For Mailonline"],"date_download":"2018-10-23 02:22:16","date_modify":"2018-10-23 02:22:16","date_publish":"2017-04-26 13:22:15","description":"Gareth Bale will rely on altitude training to ensure he comes back stronger than ever from his latest injury set-back. The Real Madrid ace has been ruled out for four weeks with a calf injury.","filename":"data/vaneerConsumption/RealMadridmanGarethBaleturnstoaltitudemask.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F897800000578-0-image-a-31_1493208802736.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447582_Real-Madrid-man-Gareth-Bale-turns-altitude-mask_1540261336.html","title":"Real Madrid man Gareth Bale turns to altitude mask","title_page":"Real Madrid man Gareth Bale turns to altitude mask | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gareth Bale will rely on altitude training to ensure he comes back stronger than ever from his latest injury set-back.\nThe Real Madrid star has been ruled out for up to four weeks with a calf injury leaving him in a race against time to play again this season.\nAnd Bale will use a gruelling altitude training regime to ensure he returns fitter than ever.\nGareth Bale has turned to a gruelling altitude training regime to solve his injury woes\nThe Wales international has struck up a partnership with Altitude Mask - a Dubai-based company specialising in producing the state-of-the-art training kit.\nThe mask - which aids resistance training - will form a crucial part of Bale’s rehabilitation programme in the coming weeks.\nBale isn’t the only high-profile sports star to using the ultramodern Altitude Mask to aid training.\nThe Welshman has partnered with altitude-mask in hope of returning before the season ends\nThe mask has formed a crucial part of Anthony Joshua’s preparations ahead of Saturday’s heavyweight title fight against Vladimir Klitschko.\nSimilarly, Crystal Palace have used the mask to improve fitness levels in their fight to stay in the Premier League.\nAnd now Bale hopes to benefit from the Altitude Mask in the coming weeks as he looks to play again this season.","url":"https://www.dailymail.co.uk/sport/football/article-4447582/Real-Madrid-man-Gareth-Bale-turns-altitude-mask.html"}
