{"authors":["Harry S. Dent Jr.","Economy"],"date_download":"2018-10-31 00:25:38","date_modify":"2018-10-31 00:25:38","date_publish":"2018-07-10 00:00:00","description":"Housing prices are clearly on the rise around the US, and this can be negative for obvious reasons. But there’s another side effect — birth rates tend to fall when bubbles make it unaffordable to raise a child.","filename":"data/vaneerConsumption/RealestateHousingpriceshighdecliningbirthrate.json","image_url":"https://amp.businessinsider.com/images/5b33d2361ae66234008b498d-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_real-estate-housing-prices-high-declining-birth-rate-2018-7_1540945538.html","title":"Real estate: Housing prices high, declining birth rate","title_page":"    Real estate: Housing prices high, declining birth rate - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Joe Raedle/Getty Images\nI've been ranting for weeks now about it… People don't understand that sky-high home prices are bad for countries, cities, businesses, and consumers.\nAnd only the 62% of people who already own homes are feeling the \"bliss\" of the bubble. They're the ones who want prices to keep going up so they get something for next to nothing…\nThere's another side effect of this housing bubble. We've seen it in the bubbliest areas for years…\nBirth rates fall when bubbles make it even more unaffordable to raise a child.\nEconomy & Markets\nLong-term data is crystal clear on this. People who move from rural to urban areas, and become more affluent as a result, have fewer kids. They strive to educate and raise them better as a result.\nIn rural areas, housing costs are much lower and the kids often help on the farms - even after elementary school, historically speaking.\nBut in urban areas, the cost of living is much higher - along with real estate prices - making it costlier to raise kids in the city. That cost then increases as they get older, especially if they decide to go to college.\nBut there's more recent evidence to support this as the second housing bubble rears its head…\nBirths have fallen substantially with home prices rising again in recent years.\nThe five lines in this chart represent the five quintiles of degrees of housing appreciation. The darker the line, the higher the housing appreciation.\nThe highest quintile, or top 20% for home appreciation, have seen a whopping 13% decline in birth rates between 2010 and 2016. The next highest quintile has seen an 8% decline. The lowest three quintiles have seen between 5% and 6.5% declines.\nIt's perfectly clear: Rising home prices correlate with falling birth rates, and the higher, the greater!\nThat's just what we need with already falling birth rates and long-term demographic stagnation/decline in the developed countries: A housing bubble that makes that trend even worse.\nThe sooner this housing bubble crashes, the better…\nDespite how difficult it will be for the banks, businesses, and households that own real estate, it'll be a Godsend for the younger families that are our future. It'll help lower costs for businesses as well.\nAll you can do is get out of the way of this inevitable - and ultimately healthy - reset in home prices, which is likely to hit us in 2019, or as late as 2025.","url":"https://www.businessinsider.com/real-estate-housing-prices-high-declining-birth-rate-2018-7"}
