{"authors":[],"date_download":"2018-10-30 18:26:58","date_modify":"2018-10-30 18:26:58","date_publish":"2016-10-24 20:16:00","description":"Equipment malfunctions, imprecise billing systems and human mistakes are causing excessive water bills in DeKalb, according to a report from the county.","filename":"data/vaneerConsumption/ReasonsforhighDeKalbCountywaterbillsrevealed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/24/Images/newsEngin.16567929_100716-dek-high-bills-bs4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_r_d53396e9da02c082e2523adece246754__1540924018.html","title":"Reasons for high DeKalb County water bills revealed","title_page":"High DeKalb County water bills caused by bad meters and mistakes","title_rss":"NULL","source_domain":"ajc.com","text":"Equipment malfunctions, imprecise billing systems and human mistakes are causing excessive water bills in DeKalb, according to a report from the county.\nIn some cases, homeowners are receiving bills of more than $1,000 and disputing the charges with the county government.\nDeKalb Chief Operating Officer Zach Williams identified six problems that contribute to billing inaccuracies during a presentation Friday.\n1. Unread meters: County employees whose job it is to record water usage often fail to get a reading from meters. The county’s daily “exception rate” — the amount of the time the county doesn’t obtain a meter reading — is about 25 percent, compared to a national average of 1 percent.\nWhen meters can’t be read, bills can be delayed as charges pile up.\nMeters don’t get read when they’re blocked by cars or bushes, and when dogs or bees prevent an employee from getting close.\n“We will definitely be getting to the bottom of it because I don’t think we have more dogs or bees than the national average,” Williams told county commissioners.\n2. Water meter malfunctions: Digital meters manufactured before July 2014 can generate incorrect consumption readings when water gets inside, creating inflated bills. The DeKalb Commission voted earlier this month to stop installing the iPerl meters made by Sensus.\nCounty employees will check each of the 46,000 digital meters that lack the ability to wirelessly transmit data, Williams said. About 25,000 digital meters that send usage information to antennas can be monitored remotely.\n“We’re literally putting eyes on each of these meters and promptly repairing or addressing that,” he said.\nAnother 110,000 customers still have mechanical meters installed, and more than half of them have exceeded their 15-year life expectancy, making them more susceptible to inaccuracies.\n3. Water meter misreads: When employees view a meter and then transcribe consumption figures, they can make mistakes. The county is instituting stronger “accountability systems” to ensure meter readers are doing their jobs, he said.\n4. Incorrect multiplier: Water meters that are installed incorrectly can cause the county’s billing computers to miscount water usage. For example, a meter could show 10 gallons of water consumption as 100 gallons, leading to an inflated bill. Williams said the county is verifying that meters have the right multipliers.\n5. Multi-cycle billings: Unusually high bills often aren’t sent to customers while the county evaluates the problem. But then when bills are mailed, they cover a longer period, resulting in bills with more total consumption. The additional water usage may be charged at a more expensive rate, and customers then get elevated bills.\n6. Customer service: The county is working to reduce long wait times and improve communications from customer service representatives, Williams said.\n“People will forgive an honest mistake … but when it seems like we don’t care and have no empathy, that’s a problem,” he said.\nClick here to view the DeKalb water billing update presentation.","url":"https://www.ajc.com/news/local-govt--politics/reasons-for-high-dekalb-county-water-bills-revealed/wNhCiPpSbexWPESyxwFZ3M/"}
