{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-23 01:21:40","date_modify":"2018-10-23 01:21:40","date_publish":"2017-03-16 11:14:17","description":"On Thursday, Rebecca Judd made her return to the runway after two years at the Virgin Australia Melbourne Fashion Festival - and her family were there to cheer her on","filename":"data/vaneerConsumption/RebeccaJuddmakesherrunwayreturnaftertwoyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E5391EC00000578-0-image-a-40_1489662604309.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319722_Rebecca-Judd-makes-runway-return-two-years_1540257700.html","title":"Rebecca Judd makes her runway return after two years","title_page":"Rebecca Judd makes her runway return after two years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the model-turned-TV personality who recently gave birth to twin boys.\nAnd on Thursday, Rebecca Judd made her return to the runway after two years at the Virgin Australia Melbourne Fashion Festival.\nThe 34-year-old WAG was supported by her husband Chris Judd and their eldest children, Oscar and Billie, who had front row seats.\nMummy's big day! On Thursday, Rebecca Judd made her return to the runway after two years at the Virgin Australia Melbourne Fashion Festival - and her family were there to cheer her on\nHe sure looks proud! The 34-year-old AFL WAG was supported by her husband Chris Judd and their eldest children, Oscar and Billie, who had front row seats\nRebecca, a weather presenter for Channel Nine, modelled a variety of stylish outfits for Next.com.au outside Melbourne Museum.\nPhotos from the event capture her five-year-old son Oscar and daughter Billie, three, smiling as their mother confidently posed on the catwalk.\nRetired AFL player Chris, 33, also beamed with pride as his wife-of-six-years flaunted her curves at the exclusive fashion event.\nLook at mummy! Photos from the event capture her five-year-old son Oscar and daughter Billie, three, smiling as their mother confidently posed on the catwalk. The family were also dressed by Next.com.au for the event\nMaking a comeback! Retired AFL player Chris, 33, also beamed with pride as his wife-of-six-years (pictured) flaunted her curves at the exclusive fashion event\nIt marks something of a comeback for Rebecca, who welcomed identical twin boys six months ago, as she has not walked in a parade for two years.\n'I love the feeling of walking in a runway show. There's the music and the crowd, it's exciting,' she told the Herald Sun on Thursday.\nThe Postcards host added: 'It's great for the whole family. It's fun to have mine here.'\n'I love the feeling of walking in a runway show': It marks something of a comeback for Rebecca, who welcomed twin boys six months ago, as she has not walked in a parade for two years\n'It's great for the whole family. It's fun to have mine here': Chris, Oscar, and Billie certainly appeared to be enjoying themselves in the crowd during the Next runway show\nIt is the first time Billie has watched her mother on the catwalk and Rebecca admits she could one day follow in her footsteps.\n'She loves the attention, so who knows,' she said.\nMeanwhile, Chris and Rebecca's youngest children, twins Tom and Darcy, appeared to stay at home for the event.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319722/Rebecca-Judd-makes-runway-return-two-years.html"}
