{"authors":[],"date_download":"2018-10-30 14:32:35","date_modify":"2018-10-30 14:32:35","date_publish":"2018-08-15 04:00:00","description":"Recipes: Honey can add special touch to bell peppers, fried chicken, panna cotta","filename":"data/vaneerConsumption/RecipesthatusehoneyfromAtlantachefs.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/15/Images/newsEngin.22439602_081618-Honey-9-U61360624161lkw-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_sweet-surprise__1540909955.html","title":"Recipes that use honey from Atlanta chefs","title_page":"Recipes that use honey from Atlanta chefs","title_rss":"NULL","source_domain":"ajc.com","text":"The Winnie-the-Pooh exhibit at the High Museum of Art has me thinking “honey.” After all, Pooh spent much of his time in a pretty single-minded pursuit of the sweet sticky stuff.\n“Winnie-the-Pooh” author A.A. Milne wrote that his small bear believed, “… the only reason for being a bee that I know of is making honey. …. And the only reason for making honey is so I can eat it.”\nOne of my favorite scenes from the tales of Pooh is when he covered himself in mud so he could impersonate a small black rain cloud. He thought he would hitch a ride on a balloon and get close enough to a hive to steal a little “smackerel” of honey. I thought that was most ingenious even if the plan ultimately failed.\n>> RELATED: Winnie-the-Pooh and Christopher Robin at the High Museum\n>> RELATED: Art review: A kinder, gentler time recalled in Winnie-the-Pooh exhibit\nBrandon Tai of Candler Park-based Honey Next Door has firsthand experience with bears and honey. He’s been keeping bees and extracting honey since 2004. Early on, he had 20 hives in the North Georgia mountains hoping to capture nectar from sourwood trees. “But bears took out all my hives. It was during the 2007 drought and the bears were starving. I’d like to think my bees and their honey saved a few of those bears.”\nNo report that the bears wore any disguise while stealing all that honey.\n>> RELATED: ‘Christopher Robin’ showcases the wisdom and heart of Winnie-the-Pooh\nTai decided to keep his hives closer to home and now has 70 hives in 10 locations inside the Perimeter.\nHe keeps hives in the neighborhoods of Virginia-Highland, Candler Park, Buckhead, Brookhaven, Inman Park, Morningside, Oakhurst, Decatur, Druid Hills and Pittsburgh. Next year, he hopes to add three to five more locations. “I have folks ask if I’ll put a hive in their backyard. I tell them I can’t do one hive, but if there’s room for between five and 10 hives, it might work.”\nHe sells his honey on Facebook and Nextdoor and at local farmers markets. You can find him throughout the week at the Ponce City, Decatur and East Atlanta Village markets, with a table full of honey, each jar labeled by the neighborhood where the hives are located. He also sells to local restaurants including Brezza Cucina in Ponce City Market, which uses his honey in lots of dishes including its Stuffed Baby Bell Peppers.\n“People come to our booth and they’ll sample all the neighborhood honeys and they’ll tell me, ‘I like this one best.’ But then they buy the one that’s from their neighborhood.”\nHoney gets its taste from the nectar source. If you’re buying single source honey, like sourwood or tupelo, the bees are getting most of their nectar from that one source. Tai, who’s in the wine business, describes honey like he might a bottle of wine.\n“Sourwood honey is smooth and buttery and tastes of cinnamon. Tupelo tastes of lime and tangerine zest with nutmeg, cinnamon and jasmine flowers. Buckwheat is pitch black, almost molasses-like, a dark, spicy flavor. Orange blossom tastes like the zest of an orange.”\nTo extract honey from these specific plants, beekeepers take their hives to the source. As Tai’s hives in North Georgia were positioned to take advantage of the nectar flow from sourwood trees, a beekeeper can place his hives in an orange grove or a field of buckwheat in order to have most of the honey come from that source.\nBut local Atlanta honey is going to come predominantly from the mix of plants — trees, shrubs, perennials, annuals, down to the clover and dandelion in the lawn — that grows around us.\nTrees are the biggest source. Tulip poplar, maple, holly, black locust — all take their turn in the progression of when their flowers open, producing what’s called the “nectar flow.” Generally speaking, these same trees are growing throughout the metro Atlanta area.\nSo Honey Next Door produces “wildflower” honey, a mix of whatever was blooming at the time. And the differences in flavor between one neighborhood’s honey and another is determined by both what’s been blooming and the strength of the hive when flows are producing.\n“A hive that’s off to a strong start in early spring will be gathering nectar from the plants that bloom earliest like holly and maple. That makes a more floral honey. A hive that strengthens later in the season will be gathering nectar from later-blooming plants like tulip poplar and black locust.”\nSpring is high season for producing honey in metro Atlanta. “In an urban setting, most of the honey is produced February through May with the most in March and April. There are a few plants that produce nectar during the summer, but mostly it’s ornamental plantings, invasive species and vegetable gardens that provide nectar for the bees. Then comes fall with goldenrod and asters. That produces a really strong, ‘sweaty sock’ kind of honey and we don’t harvest that. We leave it for the bees for the winter.”\nFor people interested in local honey in order to deal with allergies, the variety of honey is not important. “What they want is honey that captures the essence of local flora, what they’re living in. When you’re walking around in spring and you see flowers, that’s where the bees are.”\nRECIPES\nHoney. It’s good for so much more than sweetening a cup of tea. You can serve honey in everything from apps to dessert. And if you want to serve local honey, check out our list online at https://on-ajc.com/2MaAjwY for local honey producers and where to find their products.\nStuffed Baby Bell Peppers with Goat Cheese & Fennel Pollen-Infused Honey at Brezza Cucina in Ponce City Market. CONTRIBUTED BY HENRI HOLLIS\nBrezza Cucina’s Stuffed Baby Bell Peppers with Goat Cheese & Fennel Pollen-Infused Honey\nChef Andrew Cacioppo of Brezza Cucina at Ponce City Market created this recipe to use hyperlocal honey from Honey Next Door and local produce. “We start with baby bell peppers from Grant Wallace and Carolyn Reis Farm, which is about 20 minutes southeast of the city. They produce these really delicious small bell peppers.”\nTo test the recipe, we used baby bell peppers available in packages in your grocery’s produce department. These baby peppers weigh about 2 ounces each. Or you can use the mini-peppers that are also available.\nConsider the quantities here a guide. Cacioppo suggests you taste the filling as you go and adjust the quantities and herbs to suit your palate. He also suggests you use chopped pistachios rather than breadcrumbs if you want to make this dish gluten-free.\nAt Brezza Cucina, they roast the peppers in their wood-burning oven, but a broiler works just fine. The filling will stay in your peppers if you use a skillet just large enough to hold them upright.\n<","url":"https://www.ajc.com/lifestyles/food--cooking/sweet-surprise/eqTHAqC54S2lUggQ6s4rBM/"}
