{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:33:41","date_modify":"2018-10-30 18:33:41","date_publish":"2016-05-01 13:02:16","description":"An extensive report into anti-Semitism has detailed a ‘record breaking’ spike in anti-Jewish hatred in the UK.","filename":"data/vaneerConsumption/RecordBreakingSpikeInAntiSemitism.json","image_url":"https://media.breitbart.com/media/2016/05/Screen-Shot-2016-05-01-at-12.50.54.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_05_01__1540924421.html","title":"‘Record Breaking’ Spike In Anti-Semitism","title_page":"Report: ‘Record Breaking’ Spike In Anti-Semitism","title_rss":"NULL","source_domain":"breitbart.com","text":"An extensive report into anti-Semitism has detailed a ‘record breaking’ spike in anti-Jewish hatred in the UK, recorded over the same time frame that the hard left took control of the Labour party.\nThe landmark report warns that politicians and the police are “failing to enforce the law”, which could leave some British Jews “convinced that they have no choice but to emigrate”. One explanation given is that Anti-Semitism is now a “core” part of the hard left ideology of Labour’s leadership.\nYesterday, it was reported that Labour leader Jeremy Corbyn has commissioned an inquiry into anti-Semitism within his party, after an MP was suspended for having previously called for the “transportation” of Jews from the Middle East and the former Labour Mayor of London refused to apologise for claiming Hitler was a “Zionist”.\nHowever, Mr. Corbyn has refused to acknowledge there is a “problem” or “crisis” within his party, and once praised “friends” from Hezbollah and Hamas — an organisation committed to driving the “Jewish race” into the “sea”.\nThis morning, the Campaign Against Anti-Semitism released their national crime audit, which explained: “In 2014, antisemitic crime broke all previous records. Many linked the surge in Jew-hatred across Britain to fighting between Israel and Hamas, and expected antisemitic crime levels to fall to a background level. That is not what happened.”\nThe audit details the alarming rise in violent and non-violent crimes committed against Jews continuing over the past two years, which the police appear to be failing to control. The report claims:\nPolice forces recorded a 25.7% increase in hate crime against Jews, making it the worst year on record for antisemitic crime. The level of antisemitic crime was consistently high throughout the year.\nViolent antisemitic crime jumped by 50.8%. In 2014 violent acts accounted for 16.9% of all antisemitic crime, but by 2015 violent acts accounted for 20.3% of antisemitic crime.\nDespite the growth in antisemitic crime, police forces charged 7.2% fewer cases in 2015 than in 2014, meaning that only 13.6% of cases resulted in charges being brought.\nThere was no change in the non-criminal antisemitic acts reported to the police, meaning that in 2015 a higher proportion of the antisemitic acts reported to the police were criminal.\nDespite the overall rise in hatred, there was actually a fall in anti-Semitism in many rural parts of the UK. Inner city and ‘multicultural’ parts of the country, however, experience a drastic rise.\nAccording to the report, one possible explanation is “that there are not necessarily more antisemites, but that those engaging in antisemitic acts are doing so more often, or more aggressively. This would be explained by the growth in antisemitism as a core part of far-left and Islamist ideology”.\n“This data should alarm those responsible for enforcing the law: they are failing British Jews badly,” adds the reports. Continuing:\n“Britain has the political will to fight antisemitism and strong laws with which to do it, but in too many cases, those responsible for tackling the rapidly growing racist targeting of British Jews are failing to enforce the law.\n“If the situation continues to deteriorate, the Jewish community will be faced with the kind of rampant antisemitism seen in other European countries, which has left Jews feeling fearful and abandoned, many of them convinced that they have no choice but to emigrate.”\nOn Friday UKIP leader Nigel Farage said that the Labour anti-Semitism row is linked to the party trying to win Muslim votes.\nHe said Labour was was engaging in “sectarian” politics in Bradford, where suspended MP Naz Shah sits as MP, in order to win the growing number of Muslim votes there.\n“I think what has happened in Bradford, is that left-wing support and sympathy for anti-Israel/anti-Israeli views has now become allied to a very big growth in the Muslim vote in this country”, he commented on LBC Radio.\nAdding: “I’m worried that the left of the Labour party have always had this view; they’re now linking it in a desperate attempt to get all the Muslim votes in this country, and I think they’re in a bad place.”","url":"https://www.breitbart.com/europe/2016/05/01/report-record-breaking-spike-anti-semitism-core-part-far-left-islamist-ideology/"}
