{"authors":["Linette Lopez"],"date_download":"2018-10-30 21:34:09","date_modify":"2018-10-30 21:34:09","date_publish":"2016-12-20 00:00:00","description":"Trump's tax plan does not play well with others.","filename":"data/vaneerConsumption/ReconciliationmakesTrumpinfrastructureplanharder.json","image_url":"https://amp.businessinsider.com/images/5859985dca7f0c1e058b6cd0-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_reconciliation-makes-trump-infrastructure-plan-harder-2016-12_1540935249.html","title":"Reconciliation makes Trump infrastructure plan harder","title_page":"    Reconciliation makes Trump infrastructure plan harder - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Obama meets with President-elect Trump to discuss transition plans in the White House Oval Office, November 10, 2016. REUTERS/Kevin Lamarque Hindsight is 20/20. And using that view, many analysts have said that President Obama used too much political capital passing Obamacare and sacrificed the rest of his legislative agenda.\nA President Trump could easily do the same thing, sacrificing one of his key policy promises — a $550 billion infrastructure stimulus.\nIf congressional Republicans and party loyalists get their way, the new administration's first priority will be repealing Obamacare, then passing tax reform.\nTackling those issues leaves little political room for infrastructure development, in part because of what he wants to do, and also in part because of how House Republicans want to do it.\nReconciliation\nHouse Republicans have said that they plan on passing tax reform and other budget-related policies (like repealing Obamacare) using a tool called \"reconciliation.\" It allows them to avoid a filibuster, which is the Democrats' last line of defense against a Republican majority legislature in both houses of Congress.\nThe thing is, when budget policy is passed using that tool, it has to be revenue neutral. That is to say, it can't grow the deficit.\nWhen discussing the votes needed to pass tax reform in \"the House we have a majority and we are a majoritarian body, so all I need is 218 votes and I can pass something, that doesn't work like that in the Senate,\" House Speaker Paul Ryan (R-WI) said on Fox News earlier this month.\n\"As you know the Senate has a filibuster except for budget reconciliation ... but here's the point, for you to be able to use reconciliation to not have a filibuster, it has to be deficit neutral and so we have to have deficit neutral tax reform.\"\nThat means Republicans will have to raise some revenue as they cut taxes, especially since the plan is to cut corporate taxes from 35% to 20%.\nExpect this to be a dogfight. House Speaker Paul Ryan's plan balances tax cuts with closing big loopholes, like the net-interest deduction. That deduction can mean the difference between being cash-rich and cash-broke for some companies. Lobbyists will be fighting to protect their clients' interest.\nNow, remember that Trump's infrastructure plan is largely a series of tax cuts meant to incentivize companies to invest in infrastructure projects. If infrastructure development is folded into the larger tax plan, it will make overall tax reform harder to pass through reconciliation.\nAnd that's even if Republicans use dynamic scoring, a practice which basically allows the government to estimate the future benefit of tax cuts to the economy after making a load of assumptions — including about what a future government might do in response to falling tax revenue.\nAs analysts at Morgan Stanley put it in a recent note, \"further offsets will be required, even in a dynamic framework.\"\nThat means the infrastructure plan will have to be handled separately, outside the rules of reconciliation. And likely without grudging (if any) support from deficit hawks in the GOP.\n\"Although Republicans are demonstrating unity at the moment, the tax debate makes plain a new division in the party, which is key to understanding how tax reform will come together,\" Morgan Stanley wrote. \"The fiscal hawks in the House of Representatives have reiterated that all tax reform must be revenue neutral; the de facto 'Keynesian' in the Trump orbit are willing to prioritize growth plans over short-term deficit concerns, if need be.\"\nSplintering\nThat means that if Trump wants to pass his infrastructure plan, he'll have to do it with the Democrats' help and likely after having already cut taxes twice — directly through tax code reform and indirectly by repealing Obamacare— and gutting some major programs supported by Democrats.\nThere won't be a lot of good will to go around at that point. And while it could be easier to get Democrats on board with spending, it will be harder to get them on board with the huge part of Trump's infrastructure plan that involves tax cuts to incentivize wealthy developers to invest in projects.\nWhat's more, infrastructure experts have largely panned Trump's plan because they simply don't think it works.\n\"No amount of tax break will encourage investment in an asset that doesn't produce revenue,\" wrote veteran infrastructure investor Joel Moser, CEO of Aquamarine Investment Partners. \"No one will invest in the replacement of defective bridges that have no tolls, regardless of the tax abatement, unless a revenue stream is attached to those assets.\"\nNow, analysts at Deutsche Bank see this shaking out differently. They think Republicans could split tax reform and pass personal reform first and then work on corporate tax reform (including tax breaks for infrastructure development). That, however, would make it harder for Republicans to bypass Democrats using the reconciliation process, which seems central to their plan.\nPlus, if Trump's choice to head the budget office is any indication, he's going to be getting a lot of advice from deficit hawks. And those hawks, Ryan included, have never said anything in support of infrastructure spending. They basically don't talk about it, as if they hope the whole idea will go away.\nWhat all of this means, ultimately, is that an infrastructure plan may end up lower on the political totem pole than Trump has made it sound throughout his campaign. He and congressional Republicans are about to spend a lot of political capital before they can tackle an infrastructure plan that lacks bipartisan (or even some partisan) appeal.\nMaking sure tax reform is \"revenue neutral\" will be hard enough; following that up with another tax cut for big business will be even harder.","url":"https://www.businessinsider.com/reconciliation-makes-trump-infrastructure-plan-harder-2016-12"}
