{"authors":[],"date_download":"2018-10-22 20:31:57","date_modify":"2018-10-22 20:31:57","date_publish":"2014-06-02 00:10:20","description":"Rescuers likely know the resting place of six climbers who set out last week to attempt one of the most grueling routes to the peak of Mt. Rainier","filename":"data/vaneerConsumption/RecoveringFallenMtRainierClimbersTooDangerousOfficial.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/480516/140601-rainier-jms-1932_9909a500fa9cd809c6729b4b8f3d5382.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_recovering-fallen-mt-rainier-climbers-too-dangerous-official-n119931_1540240317.html","title":"Recovering Fallen Mt. Rainier Climbers Too Dangerous: Official","title_page":"Recovering Fallen Mt. Rainier Climbers Too Dangerous: Official","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRescuers likely know the final resting place of six climbers who set out last week to attempt one of the most technical and physically grueling routes to the peak of Mount Rainier in Washington state.\nBut the danger of recovering the bodies of the two guides and four climbers believed to have fallen 3,300 feet from their last known location is too great, park officials say.\n\"People are very understanding that we cannot risk another life at this point,\" Patti Wold, a Mount Rainier National Park spokeswoman, said Sunday.\nThe climbers were last heard from at 6 p.m. Wednesday when the guides checked in with their Seattle-based company, Alpine Ascents International, by satellite phone. The group failed to return Friday as planned.\nThey are presumed dead in one of the worst alpine accidents on Rainier since 1981, when 11 people were struck and killed by a massive ice fall on the Ingraham Glacier.\nFamily and friends of the dead climbers arrived at the mountain Sunday to meet with park officials.\n\"They're just devastated,\" Wold said.\nIt's unclear whether the climbers were moving or camping at the time of the accident, Wold said. Searchers located camping and climbing gear and detected signals from avalanche beacons buried in the snow at the top of the Carbon Glacier at 9,500 feet in elevation.\nIt's also not known what caused the climbers to fall from their last known whereabouts at 12,800 feet on Liberty Ridge, whether it was rock fall or an avalanche.\nGlenn Kessler, the park's acting aviation manager, said \"they are most likely buried,\" making recovery efforts even more challenging. They may be in an area too hazardous for rescuers to reach on the ground.\nContinuous ice fall and rock fall make the avalanche-prone area too dangerous for rescuers, Wold said. The area will be checked periodically by air in the coming weeks and months, she said. They will also evaluate the potential for a helicopter-based recovery as snow melts and conditions change.\nWold initially said that the park on Sunday would release the names of the six who died but later said the park cannot release the names for privacy reasons.\n- Associated Press","url":"https://www.nbcnews.com/news/us-news/recovering-fallen-mt-rainier-climbers-too-dangerous-official-n119931"}
