{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:52:45","date_modify":"2018-10-30 21:52:45","date_publish":"2016-12-20 22:45:59","description":"Ohio issued 25,474 concealed carry permits during the 3rd quarter of 2016, a \"59 percent\" increase over the number of permits issued during the same period in 2015. | Politics","filename":"data/vaneerConsumption/RecordOhioIssuesNearly26000ConcealedPermitsin3rdQuarter.json","image_url":"https://media.breitbart.com/media/2015/02/gun-purse-ladys-hand-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_20__1540936365.html","title":"Record: Ohio Issues Nearly 26,000 Concealed Permits in 3rd Quarter","title_page":"Record: Ohio Issues Nearly 26,000 Concealed Permits in 3rd Quarter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ohio issued 25,474 concealed carry permits during the 3rd quarter of 2016, a “59 percent” increase over the number of permits issued during the same period in 2015.\nThe total number of permits issued in the 3rd quarter 2015 was 16,000.\nThe Columbus Dispatch reports that 93,851 permits were issued during the first nine months of 2016, bringing the total number of Ohio concealed carry permits to 574,000. Attorney General Mike DeWine said this means the state has reached a point where “about one in 16 adults…has a concealed-carry permit.”\nBuckeye Firearms Association president Jim Irvine observed that gun ownership is “becoming mainstream” in Ohio. And as it does, carrying a gun for self-defense is a natural next step. Irvine said, “Concealed carry used to be mostly hard-core shooters, but it has become increasingly popular with soccer moms and others who just want to be safe in their everyday life.”\nThe 3rd quarter surge in permits came just in time for Ohio’s expansion of concealed carry. On December 19, Governor John Kasich (R) signed Senate Bill 199, thereby removing state prohibitions against concealed carry in the unsecured public portions of airports and also lifting bans on concealed carry in daycares, colleges, and universities. Now individual daycares and college and university systems can chose to allow concealed carry on their premises/campuses for self-defense.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/12/20/record-ohio-issues-nearly-26000-concealed-permits-3rd-quarter/"}
