{"authors":[],"date_download":"2018-10-23 02:00:49","date_modify":"2018-10-23 02:00:49","date_publish":"2017-03-19 00:00:00","description":"NPR's Lulu Garcia-Navarro talks to author and record producer Chuck Granata about Chuck Berry, who has died at age 90.","filename":"data/vaneerConsumption/RecordProducerChuckGranataRemembersChuckBerry.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=520715734_1540260049.html","title":"Record Producer Chuck Granata Remembers Chuck Berry","title_page":"Record Producer Chuck Granata Remembers Chuck Berry : NPR","title_rss":"NULL","source_domain":"npr.org","text":"LOURDES GARCIA-NAVARRO, HOST:\nWe continue our remembrance of rock and roll legend Chuck Berry. He died on Saturday at the age of 90. And to talk more about his influence on American music, we turn now to music historian Chuck Granata. He joins us on the line. Good morning.\nCHUCK GRANATA: Good morning, Lulu.\nGARCIA-NAVARRO: So Chuck Berry is known, of course, as the father of rock and roll. How do you think he shaped the genre?\nGRANATA: Wow (ph). That is such a difficult thing to really quantify because when you when you think of rock music, you think of - or rock and roll music - you think of Elvis Presley.\nGARCIA-NAVARRO: Right.\nGRANATA: But Chuck Berry was really setting the trend a year or two before Elvis. So we really need to look to him as the architect - the person who created the framework for what we know as rock and roll - early rock and roll music.\nGARCIA-NAVARRO: The real father of rock and roll.\nGRANATA: The real father - yeah.\nGARCIA-NAVARRO: How did Chuck Berry, the person - the way he lived - personify the rock and roll lifestyle?\nGRANATA: Well, you know, I always thought that Chuck Berry was one of the unlikeliest people to emerge and become this legendary figure because he started out in a segregated neighborhood where he grew up. And he had some problems early on with petty crimes, and he did some jail time. And he really didn't come to the music until later in life. You know, he worked as a beautician - as a hairstylist.\nGARCIA-NAVARRO: I didn't know that.\nGRANATA: He did. And it wasn't until he decided that he wanted to go from playing in small clubs to recording that he consulted Muddy Waters. And Muddy brought him to Leonard Chess of Chess Records, which was an early R&B label that was regional, but, certainly due in large part to Chuck Berry, became a sensational force in the music business.\nBut he always had this air of defiance. So, you know, he lived life on the edge. And that's what we hear in his music because that's really the element that he brought to rock and roll - the element that turned the music world on its ear, so to speak. The sharp aggressive attack on the guitar, you know, his defiant flipping of the bird...\nGARCIA-NAVARRO: (Laughter).\nGRANATA: If you think of \"Roll Over, Beethoven,\" he essentially flips the bird to ho-hum pop music of the time. And, you know, he got that because his sister was a classical pianist student, and she was playing this stuff. And this was Chuck's way of saying, hey, screw that music. You know, his message was I've arrived.\nGARCIA-NAVARRO: (Laughter) I've arrived. So...\nGRANATA: Yeah. And if you think of the lyric - roll over, Beethoven. Tell Tchaikovsky the news. That's a pretty amazing statement to make back in the mid-'50s.\nGARCIA-NAVARRO: An amazing musician - and thank you for discussing him. Music historian Chuck Granata, thanks again.\nGRANATA: Thank you, Lulu.\n(SOUNDBITE OF SONG, \"LITTLE QUEENIE\")\nCHUCK BERRY: (Singing) Go, go, go, go, little queenie. Go, go, go, little queenie. Go, go, go, little queenie. Let's get it. Get ready.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=520715734"}
