{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 01:35:06","date_modify":"2018-10-23 01:35:06","date_publish":"2016-01-11 12:42:21","description":"In a new thread on Reddit, airline and airport workers were asked to reveal their secrets, and they offered tips to save money on airfare and explained how luggage is left behind or 'lost'.","filename":"data/vaneerConsumption/Redditusersrevealthesecretsairlinepassengersdontknow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3009909300000578-0-image-a-3_1452513892232.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3393697_Reddit-users-reveal-secrets-airline-passengers-don-t-know_1540258506.html","title":"Reddit users reveal the secrets airline passengers don't know","title_page":"Reddit users reveal the secrets airline passengers don't know | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Travellers may be surprised to learn the locks on their bags are useless\nUsers have offered a range of tips that can help passengers on their travels\nPassengers may want to avoid wearing headphones supplied by airlines, skip the coffee and be careful when they lock the lavatory door on their next flight.\nThat’s the advice of anonymous employees of airlines and airports who have taken to the web to reveal some shocking and amusing secrets, which also include the limited amount of air available through the oxygen masks and how the pilots often have different meals for security reasons.\nIn a new thread on the social-networking website Reddit, users offered a range of tips that can help travellers save money on airfare or even prevent them from falling ill.\nOne anonymous Reddit advised told passengers to skip the coffee when the drink cart comes round\nIn one confession, a Reddit user named ichigo29 suggested passengers bring their own headphones on board because the ones provided by airlines are reused.\nThey wrote: ‘The headsets that are given to you are not new, despite being wrapped up. They are taken off the flight, “cleaned” and then packaged again.’\nAnother user, WorseToWorser, told readers to skip the coffee when the drink cart comes round, adding: ‘The coffee is absolutely disgusting because no one washes the container that goes out every morning.\n‘The station agents who get paid way too little don’t give a s*** about cleaning it. I certainly didn’t when I worked for AA.\n‘Also, because we weren’t given the proper supplies to clean it we pretty much just rinsed it out and dumped coffee into it.’\nOn long-haul flights where passengers are served breakfast, lunch or dinner, pilots are served different meals and cannot share, in case of food poisoning.\nAnother user wrote that there is a hidden latch on lavatory doors that can be opened even when it is locked\nWhen nature calls at 35,000ft, the lock on the lavatory door may not keep other passengers out.\nA user named anony_meows claimed there is a hidden latch on the door that will open the door when pulled, even when it’s locked.\nIt turns out the locks on suitcases may be just as useless.\nAn employee who uses the Reddit handle nunswithknives wrote: ‘Locks on zippered bags are useless. You can pop a zipper with a pen and drag the locked zipper pulls around the bag to close them back up.\n‘I’ve done this many times to identify bags that are tagless and locked.’\nFor those who travel with their beloved pets, a user revealed what happens after cats, dogs or other animals are checked in and separated from their owners.\nThey wrote: 'If you checked your dog there's about a 30 per cent chance it's terrified before it even gets on the plane, who knows how scared it gets during the actual flight.\n'Bag room agents will usually try to comfort a scared animal, but all we can really do is talk to it, so if you write your pet's name on their carrier it usually helps a lot.\n'I've never seen a cat who was scared in the bag room, cats don't give a f***.'\nA Redditor named RabbitMix, who works at an airport bag room, revealed how luggage gets left behind or ‘lost’.\nThe most common case is when a bag is pulled for extra screening and doesn’t make it to the plane on time, he wrote.\nOther causes include someone in the bag room making a mistake and sending the suitcase to the wrong plane, luggage getting snagged on the bag belt, or bags falling off the cart as they are driven to the aircraft, he added.\nOne user suggested passengers bring their own headphones because those provided by airlines are reused\nPassengers may be surprised to learn that the locks they use on their suitcases may be useless\nThis 'secret' revealed by a Reddit user may make passengers a bit nervous the next time they use the loo\nPlatinumAero, a Redditor who claims to be an air traffic controller, offered an interesting take on how airlines fly their planes differently.\nThey wrote: ‘Southwest for example tends to climb like bats out of hell, and then request direct routing/shortcuts from us, and we are often able to approve them and send them direct, since they're above most conflicting traffic. It's one of their signature tricks, and it usually works.\n‘This can cut significant time off the flight, which of course has numerous advantages.\n‘In contrast, American Airlines on the other hand tends to be gentle for efficiency and passenger comfort, and they always report chop and turbulence when other guys say it's smooth.\n‘Things like this are actually so profound, it can affect how we control traffic. You can usually count on guys like Southwest to climb and descend fast for you, for example.\nPassengers who sit in the aisle seat may find it annoying when the outer armrest doesn’t raise, but there is a way around that.\nAccording to one user, the outer armrest can be raised via a small button in a divot on the underside, although some flight attendants may order you to put it back in place.\nIf the cabin were to depressurise, there would only be 12 minutes of oxygen available from the masks, a user named oraclexzf wrote.\nThat would give the flight crew enough time to descend to a safe altitude of 10,000ft.\nRedditors also explained why it pays to be nice to airline staff.\nA user named ihatcoe, who claimed to be a flight attendant, said: ‘The nicer you are to us, the more we can do for you.\n‘Ran out of beef? Ask politely and we will get you a fillet mignon from first class.\n‘Your neighbour is noisy? Tell us nicely and we might be able to get you a better seat.\n‘More often than not when passengers are aggressive and nasty we’d render minimal service and not extend more help than need be.’\nThe user WorseToWorser added: ‘Be nice to the ticket agent and they will pretty much always let you get away with overweight bags.’\nFor travellers, one of the age-old questions is when is the best time to book a flight?","url":"https://www.dailymail.co.uk/travel/travel_news/article-3393697/Reddit-users-reveal-secrets-airline-passengers-don-t-know.html"}
