{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-22 22:25:45","date_modify":"2018-10-22 22:25:45","date_publish":"2016-01-28 10:20:30","description":"Chrisflynn85, thought to be from Pennsylvania, shared the image on Reddit with the caption: 'This is my wife's \"don't f****** touch me I'm on my period\" outfit.' It has been viewed two million times.","filename":"data/vaneerConsumption/Reddituserindeeptroubleafterpostingphotoofhiswifesperiodoutfit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A902F800000578-0-image-a-28_1453974513948.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420572_Man-deep-trouble-posting-candid-photo-wife-s-period-outfit_1540247145.html","title":"Reddit user in deep trouble after posting photo of his wife's 'period outfit'","title_page":"Reddit user in deep trouble after posting photo of his wife's 'period outfit' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's the time in the month when women allow themselves a bit of comfort.\nSo no one would blame this man's poor wife for cosying up in a fleecey snowman dressing gown, baggy pyjama trousers and fluffy socks.\nBut after her husband - known only as chrisflynn85 and believed to be from Pennsylvania - took a candid snap of her outfit while she wasn't looking and posted it online, he may be in for a whole world of pain.\nScroll down for video\nReddit user chrisflynn85 posted the image on Imgur and Reddit of his wife in her 'period' outfit of a fleecey dressing gown, pyjama bottoms and fluffy socks, where it has notched up 2 million views and 2,000 comments\nChrisflynn85 shared the image on Reddit on 27 January with the caption: 'This is my wife's \"don't f****** touch me I'm on my period\" outfit.'\nWhat was most likely meant as a harmless joke quickly spiralled out of control as the image notched up more than 2 million views in just one day along with almost 2,000 comments.\nAnd the hapless husband may now be wishing he had never posted it in the first place, as it quickly developed into a heated debate over the correct choice of lounge wear for women at that time of the month. He later admitted: 'If she sees this, pms is going to move to defcon 5'.\nReddit users seemed divided over whether the photo was amusing or just cruel.\nOne wrote: 'I love this observation,' while the unnamed wife even won herself some fashion fans.\nGiftofgab24 wrote: 'I love how she's got the PJ bottoms tucked into the socks. That's a great look.'\nAnother user agreed, writing: 'I do that. hate when pajama pants push up and expose my calves to the cold air,' while z0rz added: 'Looks so comfy. I want to start dressing like this now.'\nFemale user Odyssa wrote: 'Honestly, with how much uncomfortable, non-functional and ill-conceived clothing is out there for women to choose from, putting on an outfit like this at the end of a long day is one of the best feelings.'\nOne female user wrote: 'With how much uncomfortable, non-functional and ill-conceived clothing is out there for women to choose from, putting on an outfit like this at the end of a long day is one of the best feelings'\nAfternoonofthefaun leapt to the wife's defence, saying sarcastically: 'What, pajamas? Do people normally walk around the house in lingerie or something?'\nJessthePest also sympathised, writing: 'Mine's a pink onesie with a hood. When I was pregnant I looked like a f****** telletubby. And I would totally share that pic with y'all here and now, if I could find it.\n'And figure out how to blur my face. My hubs takes on [sic] look at it and is, like, \"Sooooo..... No sex tonight, then?\" I don't even have to say anything.'\nCartoonassassin joked: 'My wife has had the same outfit for the last 25 years.'\nA male user also defended the man's wife, saying: 'I'm a 25 year old male and aside from this print, I wear nearly exactly that every single day when I get home from work. I am wearing it right now.'\nQwerty464 wrote: 'Blaming her wrath on PMS instead of your own misdeed... that'll really activate her PMS.'\nAnothre user asked: 'What would she do to you if she found out you posted this on reddit?'\nChrisflynn85 admitted: 'S*** didn't realize this would get so many upvotes.... If she sees this, pms is going to move to defcon 5.'\nHe later joked that he had Googled divorce lawyers. It is not known whether his wife has seen the post yet.","url":"https://www.dailymail.co.uk/femail/article-3420572/Man-deep-trouble-posting-candid-photo-wife-s-period-outfit.html"}
