{"authors":["Sara Tan"],"date_download":"2018-10-30 22:46:12","date_modify":"2018-10-30 22:46:12","date_publish":"2014-08-14 19:30:04","description":"Your high school years are infamous for being the time in your life where you can playfully experiment with your image, from the style of clothes you wear (punk, prep, etc.) to how you wear your hair. Unfortunately for one Alabama teen, her teachers…","filename":"data/vaneerConsumption/RedheadedTeenSentHomefromSchoolforDisruptiveHairPlus9CelebrityStylesThatAreActuallyDistracting.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7fd81a5a-b8f6-440b-b13b-2793e2028e45.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35781-redheaded-teen-sent-home-from-school-for-disruptive-hair-plus-9-celebrity-styles-that-are-actually_1540939572.html","title":"Redheaded Teen Sent Home from School for \"Disruptive Hair,\" Plus 9 Celebrity Styles That Are Actually Distracting","title_page":"Redheaded Teen Sent Home from School for \"Disruptive Hair,\" Plus 9 Celebrity Styles That Are Actually Distracting","title_rss":"NULL","source_domain":"bustle.com","text":"Your high school years are infamous for being the time in your life where you can playfully experiment with your image, from the style of clothes you wear (punk, prep, etc.) to how you wear your hair. Unfortunately for one Alabama teen, her teachers thought otherwise. According to WUSA9, Hayleigh Black was sent home on the first day of school for her \"distracting\" red hair color.\nPerhaps the strangest part about all of this is that Hayleigh has had the same hair color for the last three years and never experienced a problem with school officials before. Her mother, Kim Boyd, told reporters: \"Nothing was ever said last year. Never got any calls, never sent home, anything saying it had to be changed up until today.\" And in all those years, Black has never received any negative feedback from her peers about her hair. \"I have never had anybody come up to me and say, 'Maybe you shouldn't have this color,' or, 'Do you think that's a bad color?'\"\nSo, why all of a sudden? Why this year? There doesn't seem to be a real, concrete answer, except for that Muscle Shoals High School just felt like it this time around. Superintendent Dr. Brian Lindsey addressed the hair color controversy, stating that it was a clear violation of the student code of conduct. \"The dress code section of the Muscle Shoals High School Student Handbook states, 'Students will not be allowed to attend classes if their attire includes the following:' Item #6 specifies, 'Hair which has been dyed a bright or distractive color. Dyed hair will be permitted only if the hair is dyed a natural human color.\"\nBlack, an A and B student who is also a member of the marching band, says she'll change her hair color so she can be readmitted to school.\nSo much for self-expression! I think it's such a huge bummer that Black had to give in to the Man, but I hope that when she graduates, she'll bring back the incredibly bright, Ariel-inspired red hue.\nHey, Muscle Shoals High — before you go sending other kids home from school, take a look at these 9 celebrities demonstrating what distracting hair truly looks like.\n1. Nicki Minaj\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\n2. Lady Gaga\nDavid Becker/Getty Images News/Getty Images\n3. Katy Perry\nJason Merritt/Getty Images Entertainment/Getty Images\n4. Christina Aguilera\nFrank Micelotta/Getty Images Entertainment/Getty Images\n5. Miley Cyrus\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\n6. Rita Ora\nMichael Buckner/Getty Images Entertainment/Getty Images\n7. Ke$ha\nDave Benett/Getty Images Entertainment/Getty Images\n8. Gwen Stefani\n9. Hayley Williams\nKevin Winter/Getty Images Entertainment/Getty Images","url":"https://www.bustle.com/articles/35781-redheaded-teen-sent-home-from-school-for-disruptive-hair-plus-9-celebrity-styles-that-are-actually"}
