{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:30:31","date_modify":"2018-10-30 18:30:31","date_publish":"2018-07-08 00:32:23","description":"The Virginia restaurant that refused service to White House Press Secretary Sarah Huckabee Sanders reopened Thursday night to protesters.","filename":"data/vaneerConsumption/RedHenRestaurantthatRefusedtoServeSarahSandersReopenstoProtests.json","image_url":"https://media.breitbart.com/media/2018/07/Red-Hen-Protest.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_07__1540924231.html","title":"Red Hen Restaurant that Refused to Serve Sarah Sanders Reopens to Protests","title_page":"Red Hen Restaurant that Refused to Serve Sarah Sanders Reopens to Protests | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Lexington, Virginia, restaurant that refused service to White House Press Secretary Sarah Huckabee Sanders reopened Thursday night to a crowd of protesters carrying signs.\nA dozen protesters stood outside the Red Hen restaurant holding signs that read, “Hey Red Hen, Go Cluck Yourself,” and “No Civility, No Peas” while supporters of the restaurant entered through the patio, WDBJ reported.\nThe restaurant opened to a full house, as a sign in the restaurant’s front window stated that it was completely booked. The Red Hen is reportedly only accepting reservations and is not accepting walk-in guests.\n“We’re here today because actions have consequences,” Paul Brockman, a spokesman for the Second Amendment group Patriot Picket, told WDBJ. “We think the place for political statements is at the ballot box, not at the dinner table.”\nDespite the protests, customers quietly entered the restaurant through a patio entrance.\nOne of the customers who dined at the restaurant that evening called the left-wing owner’s actions “brave” and showed up in support of the owner.\n“I thought it was very brave what the owner did,” customer Don Mandelkorn told the Roanoke Times. “It probably didn’t come easy. It was probably a difficult decision, but we wanted to support what she did, the actions she took.”\nTwo weeks ago, the Lexington restaurant got thrust into the spotlight when its owner, Stephanie Wilkinson, booted Sanders from the establishment because she worked for Trump.\nSanders left the restaurant without incident, but former Arkansas Gov. Mike Huckabee said on the Laura Ingraham Show that the owner continued to harass her friends as they dined elsewhere.\nWhen President Trump heard that the owner of the Red Hen refused to serve Sanders and her friends, he trashed the “dirty” restaurant on Twitter.\n“The Red Hen Restaurant should focus more on cleaning its filthy canopies, doors and windows (badly needs a paint job) rather than refusing to serve a fine person like Sarah Huckabee Sanders,” Trump wrote.\nProtesters swarmed the restaurant over the next few days with harsh words for the Red Hen and its owner, causing the restaurant to shut its doors temporarily.\nWilkinson resigned from the Main Street Lexington Business Group amidst the fallout from her clash with the White House press secretary.","url":"https://www.breitbart.com/politics/2018/07/07/red-hen-restaurant-refused-serve-sarah-sanders-reopens-protests/"}
