{"authors":[],"date_download":"2018-10-22 22:47:00","date_modify":"2018-10-22 22:47:00","date_publish":"2014-06-10 23:51:13","description":"Doctors have long warned that red meat is linked to colon cancer and pancreatic cancer, but less was known about its role in breast cancer.","filename":"data/vaneerConsumption/RedMeatPossiblyLinkedtoBreastCancerStudySuggests.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_cancer_red-meat-possibly-linked-breast-cancer-study-suggests-n127921_1540248420.html","title":"Red Meat Possibly Linked to Breast Cancer, Study Suggests","title_page":"Red Meat Possibly Linked to Breast Cancer, Study Suggests","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWomen who often indulge their cravings for hamburgers, steaks and other red meat may have a slightly higher risk of breast cancer, a new study suggests.\nDoctors have long warned that a diet loaded with red meat is linked to cancers including those of the colon and pancreas, but there has been less evidence for its role in breast cancer.\nIn the new study, researchers at Harvard University analyzed data from more than 88,000 women aged 26 to 45 who had filled in surveys in 1991. Their red meat intake varied from never or less than once a month, to six or more servings a day. Initial results of the study were first published in 2006 and showed a preliminary link between eating red meat and breast cancer after 12 years; the new research confirmed the earlier findings.\nUsing a statistical model, scientists estimated that in women who ate the most amount of red meat, there were an extra 6.8 cases of breast cancer for every 1,000 women over 20 years of follow-up. The researchers couldn't rule out the possibility that other factors might explain the apparent link between red meat and breast cancer.\nIn developed countries, women have about a 12.5 percent chance of developing breast cancer.\nScientists suspect proteins in red meat speed up cell division and tumor growth; chemicals such as nitrates in processed meats are already classified as probable carcinogens.\nThe study was carried out mainly among educated, white American women, and researchers said that the results were not necessarily applicable to women of other races. It was paid for by the U.S. National Institutes of Health and published online Tuesday in the British journal, BMJ.\n\"This underlines the importance of having a healthy diet,\" said Sally Greenbrook, a senior policy officer at the U.K. charity Breakthrough Breast Cancer, who was not part of the research. She said women should focus on reducing their chances of breast cancer by staying slim, and exercising and drinking in moderation.\nOthers said diet is notoriously difficult to measure, and that the link between eating red meat and breast cancer appeared weak. Valerie Beral, a cancer expert at the University of Oxford, pointed out that vegetarians don't have a lower risk of breast cancer than meat-eaters.\n— The Associated Press","url":"https://www.nbcnews.com/health/cancer/red-meat-possibly-linked-breast-cancer-study-suggests-n127921"}
