{"authors":["Sami Mokbel For Mailonline","Jack Gaughan For Mailonline"],"date_download":"2018-10-23 03:46:19","date_modify":"2018-10-23 03:46:19","date_publish":"2016-01-28 19:23:12","description":"EXCLUSIVE: West Ham wonderkid Reece Oxford’s loan move to Charlton is on the brink of collapse. The 17-year-old had agreed a temporary switch to the Valley, but the transfer has hit the skids.","filename":"data/vaneerConsumption/ReeceOxfordsloanmovetoCharltonindoubtwithJoseRigaunsureabouttheWestHamstarlet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/0E52606D00000514-0-image-a-15_1454008647587.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421561_Reece-Oxford-s-loan-Charlton-doubt-Jose-Riga-unsure-West-Ham-starlet_1540266379.html","title":"Reece Oxford's loan move to Charlton in doubt with Jose Riga unsure about the West Ham starlet","title_page":"Reece Oxford's loan move to Charlton in doubt with Jose Riga unsure about the West Ham starlet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"West Ham wonderkid Reece Oxford’s loan move to Charlton is on the brink of collapse.\nThe 17-year-old had agreed a temporary switch to the Valley, but the transfer has hit the skids.\nSportsmail understands that Addicks manager Jose Riga vetoed the move because he did not know enough about the player.\nWest Ham midfielder Reece Oxford's loan move to Charlton is on the brink of falling through\nThe 17-year-old had agreed a move to the Valley, but the move has been vetoed by Charlton boss Jose Riga\nSportsmail understands that Riga has cancelled the move, as he doesn't know enough about Oxford\nOxford is widely-regarded to be one of the best young prospects in English football at the moment.\nThere was suggestions that Oxford was apprehensive about the switch given Charlton’s lowly league position.\nBut it is understood Charlton called off the deal, due to the fact Riga was unaware that Oxford was incoming.\nThere is hope that the deal could be revived, but it remains to be seen whether the loan switch can still materialise.\nThe Addicks first enquired about the youngster last summer, but their approach was turned down by the Hammers.\nThe teenager started West Ham’s first two Premier League games, including the euphoric 2-0 win at Arsenal in which he received high praise for nullifying Mesut Ozil.\nBut he has found first-team chances few and far between ever since; making just three more substitute appearances.","url":"https://www.dailymail.co.uk/sport/football/article-3421561/Reece-Oxford-s-loan-Charlton-doubt-Jose-Riga-unsure-West-Ham-starlet.html"}
