{"authors":[],"date_download":"2018-10-30 20:38:12","date_modify":"2018-10-30 20:38:12","date_publish":"2015-10-14 02:29:52","description":"One by one, Atlanta residents stood up at a packed town hall meeting in Midtown Tuesday to tell Mayor Kasim Reed about their experiences with crime.","filename":"data/vaneerConsumption/Reedlaysoutplantocombatuptickincrime.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/14/Videos/4557711052001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_r_02dcba9ef259c9df6bad8baa4603c1ed__1540931892.html","title":"Reed lays out plan to combat uptick in crime","title_page":"Reed lays out plan to combat uptick in crime","title_rss":"NULL","source_domain":"ajc.com","text":"One by one, Atlanta residents stood up at a packed town hall meeting in Midtown Tuesday to tell Mayor Kasim Reed about their experiences with crime. Carjackings. Peeping Toms. Multiple break-ins. Robbery at gunpoint, in broad daylight, even in a nail salon.\nThey also spoke of frustration with the police department’s response to what they say have become routine problems in their communities.\n“I’ve been robbed twice. I’ve been assaulted. I’ve walked into the precinct of where I live to be ignored by the police department,” said Tone Lane, who lives in the Pittsburgh community. “I don’t want to feel this way and I don’t want to continue to invest in my house.”\nReed — who pledged to visit Pittsburgh with Lane next week — and a number of Atlanta council members called the meeting at Grace United Methodist Church to address the city-wide crime surge. The problem has come into sharper focus in Midtown especially, following the armed robbery of a mother of four in front of her young daughter in recent weeks. That’s on top of a slight increase in murder, rape and auto theft city-wide since last year.\nThe mayor laid out a multi-pronged plan to push back against the crime uptick. Beginning in coming weeks, the Atlanta Police Department will deploy supervisors to increase the number of sworn officers patrolling the streets. APD is also standing up a “special police” detail that will conduct sweeps through Piedmont Park and patrol the area with flashing blue lights at night to increase their visibility.\nReed also spoke of a plan to address a problem with repeat offenders. A recent report found that 461 people in Atlanta account for more than 14,400 arrests for crimes including murder, aggravated assault, robbery and gun offenses, he said. But of those people, only 16 saw prison time.\n“The most powerful thing we can do is make sure when our women and men arrest somebody and they are convicted; that just like they do everywhere else in the metro area but Atlanta, that they actually serve time for their crimes,” Reed said. “Right now if somebody doesn’t kill you, it’s highly unlikely they will see one day in jail.”\nReed said he’s sought approval from the Superior Court of Fulton County to allow Atlanta’s Municipal Court to adjudicate criminal cases and to house offenders at the city jail in order to keep more criminals off the streets. APD has also created a repeat offender tracking unit in order to monitor those individuals following their arrests, Reed said.\nAndrew Adler, who lives in Midtown, criticized officials for offering few solutions for how residents can protect themselves.\n“You guys are talking politics and social programs,” Adler said. “These people are afraid they’re going to get killed in their driveway.”\nThe mayor won clear support, however, from the majority of the crowd when he spoke of his desire to shut down the Peachtree-Pine homeless shelter.\nReed has said he wants to use eminent domain to take control of the property and build a police and fire station in its place. He’s also identified the shelter as a problem for the community and a hub for tuberculosis infection. Shelter operators have denied those charges and vowed to fight any attempts on its closure.\nReed was joined at the meeting by his command staff and several council members including President Ceasar Mitchell, Andre Dickens, Kwanza Hall, Mary Norwood and Alex Wan.","url":"https://www.ajc.com/news/local-govt--politics/reed-lays-out-plan-combat-uptick-crime/YasvMsbHLmX2spiphD0XQO/"}
