{"authors":["Associated Press"],"date_download":"2018-10-22 20:55:29","date_modify":"2018-10-22 20:55:29","date_publish":"2016-01-28 05:02:42","description":"HANOI, Vietnam (AP) — Vietnam's re-elected leader, a 71-year-old Communist Party ideologue, made it clear Wednesday that one-party rule was here to stay, ins...","filename":"data/vaneerConsumption/ReelectedVietnamcommunistbossdefendsonepartyrule.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:5b1cd9effc944c9ab11f9f40c8ef6a90-4vVdYopwYQ7f641721b07a8dbda4-683_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420314_Re-elected-Vietnam-communist-boss-says-lot-work-ahead_1540241729.html","title":"Re-elected Vietnam communist boss defends one-party rule","title_page":"Re-elected Vietnam communist boss defends one-party rule | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Re-elected Vietnam communist boss defends one-party rule\nHANOI, Vietnam (AP) — Vietnam's re-elected leader, a 71-year-old Communist Party ideologue, made it clear Wednesday that one-party rule was here to stay, insisting that the collective leadership he heads is a far better alternative to what he called authoritarianism disguised as democracy.\nGeneral Secretary Nguyen Phu Trong (pronounced Noo-yen Foo Chong) was re-elected Wednesday as head of the party and the leader of a 19-member Politburo that will govern Vietnam for the next five years. The decisions were made at the end of a weeklong congress of the 4.5-million-member party, which rules the lives of 93 million Vietnamese.\n\"Vietnam's Communist Party is one-party rule but we also have principles of democracy and accountability of the leaders. Otherwise the faults would be blamed on the entire group and merits would be credited to the individual,\" he said.\nNewly re-elected Vietnam Communist Party General Secretary Nguyen Phu Trong arrives at National Convention Center for the last day of the 12th National Congress of the party in Hanoi, Vietnam, Thursday, Jan. 28, 2016. (Luoing Thai Linh/Pool Photo via AP)\n\"The principle of the Communist Party of Vietnam is collective leadership with accountability and responsibility of the individual, which can never become authoritarian. Elsewhere in the world, there are examples where they say they follow democracy but decisions are made by one person,\" he said.\nApparently justifying the iron-fisted rule of the Communist Party, Trong said the country needs discipline to meet its goal of becoming a modern, industrialized society\n\"However, a country without discipline would be chaotic and unstable ... Democracy should go alongside discipline. There should be no imbalance. We should not go to either extreme. We need to balance between democracy and law and order. \"\nAlong with Trong, a new crop of leaders were elected to the Politburo and the 180-member Central Committee, the other key component of the ruling structure.\nThe renewal of the leadership means little change for Vietnam, where the people have no direct role in selecting the party leaders.\nTrong is expected to continue to push the economic reforms led by outgoing Prime Minister Nguyen Tan Dung. The prime minister is the de facto No. 2 in the hierarchy, and the post now will be held by Deputy Prime Minister Nguyen Xuan Phuc.\nDespite having a reputation for being pro-China, Trong is not likely to be totally subservient to Beijing as that would risk massive anger from ordinary Vietnamese who harbor a deep dislike and historical suspicion of China.\n\"Many people were afraid that a conservative trend would prevail if Mr. Trong is re-elected. But ... whoever they may be, and however conservative they may be, when they are at the helm they are under pressure to carry out reforms,\" Le Hong Hiep, a visiting Vietnamese fellow at the Institute of Southeast Asia Studies in Singapore, told The Associated Press.\nTrong's re-election was an expected outcome, even though he was briefly challenged by Dung in what had become a relatively public power struggle. Trong's camp has accused Dung of corruption and mismanagement, but analysts believe that the accusations were an excuse since the widespread corruption that seeps through the system is not likely to vanish overnight with Dung's departure.\nAddressing that question, Trong said there was a need to \"particularly sustain the accountability and responsibility of the leaders and supervise power to ensure corruption and wastefulness are brought under control.\"\nEven though Trong's re-election was a foregone conclusion, in his opening remarks at the press conference said he had not expected to be re-elected.\n\"I was re-elected as general secretary with almost 100 percent of the vote. And I am very surprised by that. Because I am quite old. I am the oldest member in the leadership of Vietnam. I myself asked to be retired but due to responsibility tasked on me by the party I had to accept.\"\nTrong said there is \"a lot of work ahead of us.\"\n\"The responsibility is enormous. And in the current domestic and international context, there are a lot of opportunities and challenges,\" he said.\nThe third most important member elected to the Politburo was Minister of Public Security Tran Dai Quang, who will be the country's new president.\nNewly re-elected Vietnam Communist Party General Secretary Nguyen Phu Trong, center left in front, flanked by Politburo members Tran Dai Quang, front left, Nguyen Xuan Phuc, center right in front, and Nguyen Thi Kim Ngan, claps as he poses with the new party's central committee members at the closing ceremony the national congress of the party in Hanoi, Vietnam Thursday, Jan. 28, 2016 . (Hoang Dinh Nam/Pool Photo via AP)\nVietnamese Deputy Prime Minister Nguyen Xuan Phuc, center, arrives at the National Convention Center to attend the closing ceremony of the Vietnam's Communist Party 12th Congress in Hanoi, Vietnam Thursday, Jan. 28, 2016. (AP Photo/Na Son Nguyen, Pool)\nVietnamese Public Security Minister Gen. Tran Dai Quang arrives at the National Convention Center to attend the closing ceremony of the Vietnam's Communist Party 12th Congress in Hanoi, Vietnam Thursday, Jan. 28, 2016. (AP Photo/Na Son Nguyen, Pool)\nVietnamese Foreign Minister Pham Binh Minh arrives at the National Convention Center to attend the closing ceremony of Communist Party's congress in Hanoi, Vietnam Thursday, Jan. 28, 2016. (AP Photo/Na Son Nguyen, Pool)\nNewly re-elected Vietnam Communist Party General Secretary Nguyen Phu Trong arrives at National Convention Center for the last day of the 12th National Congress of the party in Hanoi, Vietnam, Thursday, Jan. 28, 2016. (Luoing Thai Linh/Pool Photo via AP)\nVietnamese Gen. Ngo Xuan Lich, chief of the General Department of Politics under the Vietnam People¿s Army poses for photo at the National Convention Center as he attends the closing ceremony of the Vietnam's Communist Party 12th Congress in Hanoi, Vietnam Thursday, Jan. 28, 2016. (AP Photo/Na Son Nguyen, Pool)\nVietnamese Minister of Public Security Tran Dai Quang, second right, arrives at National Convention Center for the last day of the 12th National Congress of Vietnam's Communist Party in Hanoi, Vietnam, Thursday, Jan. 28, 2016. (Minh Hoang/Pool Photo via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420314/Re-elected-Vietnam-communist-boss-says-lot-work-ahead.html"}
