{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:33:40","date_modify":"2018-10-30 22:33:40","date_publish":"2014-08-15 11:52:49","description":"Okay, hear me out. Of all the reality television shows out there, some of them starring celebrities, dancing, and celebrities dancing, how has no one devised an entire concept around Awkward Celebrities Awkwardly Dancing yet? Yeah, yeah, sure,…","filename":"data/vaneerConsumption/ReeseWitherspoonsAwkwardDanceMovesWouldMakeTaylorSwiftJealousVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/cad5e07c-1c4b-4954-afe8-39b3d2d5a257.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35893-reese-witherspoons-awkward-dance-moves-would-make-taylor-swift-jealous-video_1540938820.html","title":"Reese Witherspoon's Awkward Dance Moves Would Make Taylor Swift Jealous - VIDEO","title_page":"Reese Witherspoon's Awkward Dance Moves Would Make Taylor Swift Jealous — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Okay, hear me out. Of all the reality television shows out there, some of them starring celebrities, dancing, and celebrities dancing, how has no one devised an entire concept around Awkward Celebrities Awkwardly Dancing yet? Yeah, yeah, sure, Dancing with the Stars is amazing (and not just because Maksim Chmerkovskiy and Meryl Davis were on it) and everyone is so talented, but imagine how much better it would be if they all danced just like you and me? Imagine how much harder it would be to select a winner? This is television gold here. The latest celebrity to show the world that stars are people too is Reese Witherspoon. TMZ acquired a video of Reese Witherspoon dancing at an event in Italy, like full on rocking out to \"I Will Survive\". Seriously, she Taylor Swift-ed hard at that party.\nTMZ describes the event as \"wedding-related\" and Witherspoon was toting a glass of champagne for a bit before she threw her hands in the air and waved them like she just didn't care. She looked, like most awkward dancers look, as if she was having more fun than any of us will ever have. In fact, she was having so much fun that she might just have stolen the dancing crown from Taylor Swift.\nSwift, as we all know, is the queen of audience dancing. Whether she's on stage at an Ingrid Michaelson concert, in the audience of an Ed Sheeran concert, or onstage at one of her own shows, Swift has no shame about showing off her silky smooth dance moves that include everything from whipping her hair back and forth to waving her hands in the air to shoulder wiggling almost as good as Beyoncé. (Okay, nowhere near as good as Beyoncé, but, come on, it's Beyoncé.)\nWhen you compare Witherspoon's dancing video with one of Swift's many, many dancing videos, who would win in a dance-off between the two of them? Will it be Reese \"I Will Survive\" Witherspoon, whose arm flailing game is so strong that Swift would cower before it? Or would it be Taylor \"Dance Like the Wind\" Swift, whose jiggling shoulders would drive Witherspoon to run away with her tail between her legs?\nThe correct answer is that the only winner in a dance-off between Witherspoon and Swift is the audience of people watching because it would be epic. Unless, of course, the audience of people watching decide not to film it. Then there would only be losers in that dance-off and those losers would be all of us who need to see this happen right now.","url":"https://www.bustle.com/articles/35893-reese-witherspoons-awkward-dance-moves-would-make-taylor-swift-jealous-video"}
