{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-22 23:10:54","date_modify":"2018-10-22 23:10:54","date_publish":"2016-01-28 11:54:37","description":"Shooting in Monterey, California, the 39-year-old actress maintained her typically sprightly demeanour as she joked incessantly with her fellow actresses.","filename":"data/vaneerConsumption/ReeseWitherspoonhangswithNicoleKidmanandShaileneWoodleyonBigLittleLiesset.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9B8EB00000578-0-image-a-20_1453981839507.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420752_Reese-Witherspoon-displays-slender-legs-trench-coat-provides-entertainment-Nicole-Kidman-Shailene-Woodley-Big-Little-Lies-set_1540249854.html","title":"Reese Witherspoon hangs with Nicole Kidman and Shailene Woodley on Big Little Lies set","title_page":"Reese Witherspoon hangs with Nicole Kidman and Shailene Woodley on Big Little Lies set | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They say you shouldn't mix business with pleasure.\nBut Reese Witherspoon proved that motto wrong as she larked about on the set of upcoming TV show Big Little Lies with co-stars Nicole Kidman and Shailene Woodley on Tuesday.\nShooting in Monterey, California, the 39-year-old actress maintained her typically sprightly demeanour as she joked incessantly with her fellow actresses.\nScroll down for video\nLeaving them laughing: Reese witherspoon provided the entertainment on the set of upcoming TV show Big Little Lies with co-stars Nicole Kidman and Shailene Woodley on Tuesday\nShowing off some leg in a mini dress and oxblood trench coat with extensive button detailing, the Wild star looked to provide the on set entertainment as she pulled a plethora of silly faces while her co-stars looked on in amusement.\nReese's blonde locks were worn in a sleek style around her pretty face, which looked to be sporting a neutral make-up palette, as she spent another day portraying mother Madeline MacKenzie.\nWhile it's not known exactly what scene the trio were filming, Reese was seen falling over on the street in one scene before briskly getting herself back up.\nPlayful: Shooting in Monterey, California, the 39-year-old actress maintained her typically sprightly demeanour as she joked incessantly with her fellow actresses\nChic: Nicole looked equally stunning, having gone back to her auburn roots, as she cavorted on set in a tan turtle-neck jumper and beige trench coat to help characterize her role as mother-of-two Celeste Wright\nSvelte: The Moulin Rouge! actress highlighted her lithe legs in a pair of skinny jeans, which she layered beneath brown knee-high boots as they spent the day filming by a picturesque river\nNicole looked equally stunning, having gone back to her auburn roots, as she cavorted on set in a tan turtle-neck jumper and beige trench coat to help characterize her role as mother-of-two Celeste Wright, the wife of a violent banker, Perry, played by Alexander Skarsgård.\nThe Moulin Rouge! actress highlighted her lithe legs in a pair of skinny jeans, which she layered beneath brown knee-high boots as they spent the day filming by a picturesque river.\nShailene Woodley - who stars as single mother Jane Chapman in the pending HBO series - was dressed the most casual of all in skinny jeans, combat boots and a double-breasted jacket.\nShe's Wild! Showing off some leg in a mini dress and oxblood trench coat with extensive button detailing, the Wild star looked to provide the on set entertainment as she pulled a plethora of silly faces\nKeeping it down: At one point, she was seen tugging at her dress\nA beauty: Reese's blonde locks were worn in a sleek style around her pretty face, which looked to be sporting a neutral make-up palette\nMind your step! While it's not known exactly what scene the trio were filming, Reese was seen falling over on the street in one scene before briskly getting herself back up\nHer skin looked to be sporting minimal make-up while her tresses were tied away from her face in an effortless ponytail.\nThe anticipated comedy series centers on three mothers who all have young children, and their perfect lives take a dark turn for the worst, when they all become tangled in a murder.\nThe TV series looks to be quite the star-studded affair as it also stars Jurassic Park's Laura Dern, Shailene's Divergent co-star Zoe Kravitz and Adam Scott, of Parks and Recreation fame.\nPared-down: Shailene Woodley - who stars as single mother Jane Chapman in the pending HBO series - was dressed the most casual of all in skinny jeans, combat boots and a double-breasted jacket\nPlot: The anticipated comedy series centers on three mothers who all have young children, and their perfect lives take a dark turn for the worst, when they all become tangled in a murder\nFancy: The TV series looks to be quite the star-studded affair as it also stars Shailene's Divergent co-star Zoe Kravitz and Adam Scott, of Parks and Recreation fame","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420752/Reese-Witherspoon-displays-slender-legs-trench-coat-provides-entertainment-Nicole-Kidman-Shailene-Woodley-Big-Little-Lies-set.html"}
