{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 21:58:37","date_modify":"2018-10-22 21:58:37","date_publish":"2017-03-16 02:22:19","description":"The 40-year-old actress and entrepreneur modeled her southern-inspired Draper James apparel collection to perfection when she stepped out in Beverly Hills on Wednesday.","filename":"data/vaneerConsumption/ReeseWitherspoondonsentireDraperJamesensemble.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E5061CE00000578-0-image-a-26_1489630831237.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318642_Reese-Witherspoon-dons-entire-Draper-James-ensemble_1540245517.html","title":"Reese Witherspoon dons entire Draper James ensemble","title_page":"Reese Witherspoon dons entire Draper James ensemble | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her strict workout regimen.\nSo Reese Witherspoon was sure not to miss a sweat session before heading into work at her southern-inspired company, Draper James on Wednesday.\nThe 40-year-old actress and entrepreneur was her own best advert in an entire ensemble from the apparel line while strutting her stuff through Beverly Hills.\nScroll down for video\nSouthern belle! Reese Witherspoon modeled her Draper James line perfectly when she stepped out in Beverly Hills on Wednesday\nThe Academy Award-winning star looked preppy chic in the Nassau Navy Scallop Sweater Dress which retails for $235.\nShe showcased her toned pins in the short frock which included white trim throughout.\nA pair of bubblegum pink high heels added extra height to the Wild starlet's petite 5ft 1in frame.\nHer own best advert! The 40-year-old actress and entrepreneur wore an entire ensemble from the apparel line including a $235 Navy Scallop Sweater Dress\nReese matched her fancy footwear and promoted her brand with a colorful pink Peabody Perforated Tote for a pricey $225.\nThe blonde beauty kept her piercing blue eyes concealed behind a pair of Faded Pink Tortoise Sunglasses which run for $175 although they are currently out of stock according to the company's website.\nEarlier in the day, Reese burned calories during her morning run as she went make-up free, highlighting her natural beauty and flawless complexion.\nShe motivated herself with a grey tee that read, 'Feeling It' and paired the look with multi-colored floral cropped leggings.\nPink purse: The Academy Award winner stepped out in cute heels and matching tote which retails for $225\nHer golden tresses were swept back into a ponytail and covered beneath a black baseball cap.\nThe Louisiana-born beauty's company focuses on fashion, accessories and home décor inspired by the American South, according to the brand's site.\nReese stated on their website: 'I started this company to honor my Southern heritage and in particular my grandparents who were, and still are, the greatest influences in my life.'\n'My grandmother, Dorothea Draper and my grandfather, William James Witherspoon... taught me everything I know about gracious Southern living.'\nShady: The blonde beauty kept concealed behind a pair of Faded Pink Tortoise Sunglasses which run for $175 although they are currently out of stock according to the company's website\n'From them I learned to dress and act like a lady, to take pride in my home, to reach out to help a neighbor, and to always invite everyone in for a visit.'\nMeanwhile Reese has been making big waves producing and starring as Madeline Mackenzie in Big Little Lies.\nThe HBO series also stars Nicole Kidman, Laura Dern, Shailene Woodley, and Alexander Skarsgard.\nBased on Liane Moriarty's 2014 novel, Big Little Lies centers on a group of mothers 'whose perfect lives begin to unravel.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318642/Reese-Witherspoon-dons-entire-Draper-James-ensemble.html"}
