{"authors":["Tyler Atwood"],"date_download":"2018-10-30 23:09:55","date_modify":"2018-10-30 23:09:55","date_publish":"2014-08-13 23:00:02","description":"Reese Witherspoon is quite the modern Southern Belle. In addition to occasionally pulling out a thick southern accent to illustrate a point and naming the latest adorable addition to her family Tennessee, Witherspoon loves to celebrate her roots by…","filename":"data/vaneerConsumption/ReeseWitherspoonOnInstagramLooksLikeAVintageSouthernBelleStealHerStyleIn4Steps.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5c73b6aa-a384-4e2d-af1e-53fd2dda1bce.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35666-reese-witherspoon-on-instagram-looks-like-a-vintage-southern-belle-steal-her-style-in-4_1540940995.html","title":"Reese Witherspoon On Instagram Looks Like A Vintage Southern Belle - Steal Her Style In 4 Steps","title_page":"Reese Witherspoon On Instagram Looks Like A Vintage Southern Belle — Steal Her Style In 4 Steps","title_rss":"NULL","source_domain":"bustle.com","text":"Reese Witherspoon is quite the modern Southern Belle. In addition to occasionally pulling out a thick southern accent to illustrate a point and naming the latest adorable addition to her family Tennessee, Witherspoon loves to celebrate her roots by channeling what can only be referred to as an avant-garde style with vintage undertones. The actress loves a pop of color almost as much as she loves her jeans, and can't resist a good hat when the opportunity to wear one presents itself.\nSo when Witherspoon took a trip down memory lane in her native Nashville and posted an Instagram snap of her decidedly bold neon pink checkered ensemble, it was no surprise that the actress's outfit brought vintage southern style into the 21st century. Though Witherspoon's garb in the photo is not for the faint of heart, its sweet color palette and tailored fit ensure that the look doesn't stray too far from convention. And with the addition of chic sunglasses and lightly tousled curls, the effect was one of irreverent glamour. So if you're in the mood for a style switch-up this summer, read on for the four chic items you'll need to steal Witherspoon's fresh look.\n1. BOXY PRINTED TOP\nStart off your ensemble with a boxy, printed top in a simple palette of black and white or pink and white. Try Forever21's Boxy Abstract Printed Top for an elegant, refined look.\n2. PRINTED SHORTS\nTry to find a pair of shorts with the exact pattern of your top, or a pattern that closely mimics it to achieve a cohesive look like Reese's. See By Chloe's Palm Print Shorts offer beautifully subtle patterned panels to complement the palette and print of your top.\n3. STATEMENT SUNGLASSES\nDon't limit the patterns in your look to just your clothing; a pair of patterned, statement sunglasses in black and white is a glamorous addition to any ensemble. Try Karen Walker's Siouxsie Sunglasses for a splash of Hollywood style.\n4. GLOSSY FINISHING SPRAY\nTo achieve a head of lustrous, lightly windblown locks like Reese's, a shine-inducing finishing spray is a must. Aveda's brilliant Emollient Finishing Gloss lends hair a brilliant, natural sheen without weighing down locks.\nImages: reesewitherspoon/Instagram; Forever21 Boxy Abstract Printed Top, $17.90, forever21.com; See By Chloe Cotton Palm Print Shorts, $72, stylebop.com; Karen Walker Siouxsie Sunglasses, $259, matchesfashion.com; Aveda brilliant Emollient Finishing Gloss $28, shop.nordstrom.com","url":"https://www.bustle.com/articles/35666-reese-witherspoon-on-instagram-looks-like-a-vintage-southern-belle-steal-her-style-in-4"}
