{"authors":[],"date_download":"2018-10-22 21:16:30","date_modify":"2018-10-22 21:16:30","date_publish":"2016-07-26 00:00:00","description":"NPR's Emily Harris reviews the past three years in the Palestinian-Israeli conflict, which have been marked by a lack of serious peace talks and new, sometimes extreme, approaches by both sides.","filename":"data/vaneerConsumption/ReflectingOnThreeYearsInJerusalem.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=487522793_1540242990.html","title":"Reflecting On Three Years In Jerusalem","title_page":"Reflecting On Three Years In Jerusalem : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nThe possibility of a solution to the Israeli-Palestinian conflict is as dim as at any time in decades. Over the past three years, attempts at peace talks have failed. There have been periods of calm followed by violent outbreaks. NPR's Emily Harris has been our Jerusalem correspondent during those three years, and she is just now finishing that assignment. I asked her what people there think about the lack of serious peace talks.\nEMILY HARRIS, BYLINE: Well, they don't really think that peace talks would go anywhere if they were happening. There's been real giving up on that as a path forward. There's a drift away, and there's no sense that something would be agreed on or decided by both sides. So they're tending toward different tactics.\nFor example, some Palestinians are pushing harder for a one-state solution where everyone would have the same rights. Many Israelis see that idea, though, as a fundamental threat to the existence of Israel as a homeland for Jewish people. And Palestinians are also emphasizing diplomatic recognition or economic pressure on Israel, and Israel's fighting back against any hints of economic pressure tooth and nail.\nMCEVERS: As the two sides come up with their own ideas, it sounds like they're getting further apart. How is that playing out?\nHARRIS: I think you see a lot of signs of extremism taking further root there. Palestinians point to deep anger and frustration, saying that that has what led to the increased wave of deadly Palestinian attacks against Israelis that started last fall. They often cite the increasing number of Israeli buildings that go up in the West Bank. They say this is changing the status quo and then, going back to the peace talks idea, affecting the possibility of negotiations, even as those peace talks are stagnant.\nBut then Israelis, especially many settlers, see this building which has become sort of a new battleground as a response to violence. This is what one settler, Davidi Perl, told me after three Israeli teens were kidnapped and then killed by Palestinians and Israel appropriated land in the West Bank to make a memorial to them.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDAVIDI PERL: We have to show them that we are strong enough, and one of the way to show that we are strong and we will be here even though they don't want us to be is to build more.\nHARRIS: To build more, he says. So you can see there's always some kind of movement going on even in this stagnant peace talks and cycle of no progress in negotiations but violence continuing.\nMCEVERS: Are there times when people come together?\nHARRIS: There are some times when people come together, less than in the past. I wrote a story, for example, about an American-Jewish college student who lived in Ramallah, a Palestinian city in the West Bank, for a semester. And she had to mix her own political support for a Palestinian state with hearing people dismiss or misunderstand the Holocaust.\nBut a lot of interaction is actually hidden, and it's really fraught. For example, people like to say - they love to say that Israelis and Palestinians do business together just fine. But I was at a session at Google in Tel Aviv that was specifically designed to introduce West Bank Palestinian programmers to Israeli companies, and the whole panel discussion fell apart over politics.\nMCEVERS: What's the one story you'll remember the most?\nHARRIS: Oh, for sure I'll most remember covering the 2014 war. I was in Gaza for much of that and the aftermath maybe even more so. Afterwards I was talking to people about how they explain war to children, and I interviewed an Israeli woman who had lost her brother and had to tell her own young daughter that he was gone. And she said she just told her that a bomb hit the car by Arabs who wanted to kill Jews.\nAnd then in Gaza, I talked to a 14-year-old boy. His name's Kareem Aloul. He was born in Gaza but grew up in Canada, and then he - his family moved back to Gaza after the war, mostly for personal family reasons and also because his dad was having a hard time getting a good job in Canada. And this 14-year-old was trying to imagine, you know, when the next war was coming, and he compared himself to his war-hardened peers.\n(SOUNDBITE OF ARCHIVED RECORDING)\nKAREEM ALOUL: They - as I told you, they're not so scared as much. But for me, I'm, like, so scared because I haven't lived one. So I'm going to try it.\nUNIDENTIFIED MAN: Hopefully not.\nHARRIS: Or maybe not.\nKAREEM: Yeah, hopefully.\nHARRIS: So you know, there's a 14-year-old kid. He loves hockey, and he loves math. And he's sitting on the couch in his living room saying, I'm going to try war. And I guess that's what will stick with me this cycle - that it is so familiar that kids can predict that war is coming.\nMCEVERS: That's NPR's Emily Harris. She recently wrapped up three years in Jerusalem covering the Israeli-Palestinian story. Thank you so much for your work.\nHARRIS: Thanks, Kelly.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=487522793"}
