{"authors":[],"date_download":"2018-10-30 01:00:26","date_modify":"2018-10-30 01:00:26","date_publish":"2015-01-22 06:00:00","description":null,"filename":"data/vaneerConsumption/ReflectionsonRoeWhenMargaretSangerSpoketotheKKK.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/01/1024px-KKK_night_rally_in_Chicago_c1920_cph.3b12355.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861226.html","title":"Reflections on Roe: When Margaret Sanger Spoke to the KKK","title_page":"Reflections on Roe: When Margaret Sanger Spoke to the KKKThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As liberals excoriate Republican Congressman Steve Scalise for speaking to a group with a reported connection to David Duke, former KKK member, I’m reminded today—on the anniversary of Roe v. Wade—of a moment that liberals will never dare acknowledge: a 1926 speech to the KKK by one of their most revered ideological darlings, Planned Parenthood founder Margaret Sanger.\nUnlike Scalise, Sanger did not unwittingly speak to a group with a link (direct or indirect) to the KKK through a member. No, Margaret knowingly went directly to the Real McCoy—straight to the dragon’s mouth. In May 1926, a hopeful spring day, this progressive icon, this liberal hero, this founding mother of one of liberalism’s most sacred organizations, Planned Parenthood, an organization that liberals demand we fund with tax dollars, went directly to a KKK meeting and spoke at length to the faithful.\nThere’s no excuse for not knowing that Sanger did this, other than the routine self-censorship and self-imposed ignorance that liberals excel at imposing on themselves. Sanger openly wrote about in her 1938 autobiography published by W.W. Norton, one of the leading New York publishing houses.\nThere, on pages 366 and 367, Sanger began by immediately justifying her acceptance of the invitation: “Always to me any aroused group was a good group, and therefore I accepted an invitation to talk to the women’s branch of the Ku Klux Klan at Silver Lake, New Jersey.” (Imagine a modern Republican saying roughly the same thing: “Always to me any passionate group is a good group, and therefore I accepted an invitation to talk to the [fill-in-the-blank] branch of the Ku Klux Klan….”\nSanger called it “one of the weirdest experiences I had in lecturing,” apparently because of the highly secretive way she was transported and escorted: “My letter of instruction told me what train to take, to walk from the station two blocks straight ahead, then two to the left. I would see a sedan parked in front of a restaurant.” This might have seemed a little scary to a woman traveling alone, but Planned Parenthood’s founder was undeterred, doing exactly what the klanswomen had ordered: “I obeyed orders implicitly, walked the blocks, saw the car, found the restaurant, went in and ordered come cocoa, stayed my allotted ten minutes, then approached the car hesitatingly and spoke to the driver. I received no reply. She might have been totally deaf as far as I was concerned. Mustering up my courage, I climbed in the back and settled back. Without a turn of the head, a smile, or a word to let me know I was right, she stepped on the self-starter. For fifteen minutes we wound around the streets. It must have been towards six in the afternoon. We took this lonely lane and that through the woods, and an hour later pulled up in a vacant space near a body of water beside a large, unpainted, barnish building.”\nA barn—good choice.\nAgain, this must have been a little unnerving, frightening. Was Sanger not concerned? Apparently not enough to be turned away from an exciting chance to speak to the KKK.\nShe continued: “My driver got out, talked with several other women, then said to me severely, ‘Wait here. We will come for you.’ She disappeared. More cars buzzed up the dusty road into the parking place. Occasionally men dropped wives who walked hurriedly and silently within. This went on mystically until night closed down and I was alone in the dark. A few gleams came through chinks in the window curtains. Even though it was May, I grew chillier and chillier.”\nAmazingly, after waiting for what she said was three hours, Sanger entered the den. She was “summoned at last and entered a bright corridor filled with wraps. As someone came out of the hall I saw through the door dim figures parading with banners and illuminated crosses. I waited another twenty minutes. It was warmer and I did not mind so much. Eventually the lights were switched on, the audience seated itself, and I was escorted to the platform, was introduced, and began to speak.”\nSanger relayed little of what she shared with the klanswomen at their rally, though apparently she was extremely successful and satisfied with herself: “I believed I had accomplished my purpose. A dozen invitations to speak to similar groups were proffered. The conversation went on and on, and when we were finally through it was too late to return to New York…. I could not even send a telegram to let my family know whether I had been thrown in the river or was being held incommunicado. It was nearly one before I reached Trenton, and I spent the night in a hotel.”\nThe Planned Parenthood founder’s KKK talk was apparently a smash hit. Not only did it go very late, after a very long wait, but no less than “a dozen invitations to speak to similar groups were proffered.” Wow.\nLiberals, of course, will excuse all of this, as they do for all their icons, especially on matters of race, from Woodrow Wilson’s actions toward blacks to FDR’s internment of the Japanese (just for starters).\nMaybe Maggie’s feminist cheerleaders can eagerly assure us that the Planned Parenthood matron and her white-hooded sisters simply exchanged cooking recipes or “went on and on” talking about their hair and boys and how much they hate math.\nYes, there was hate in that room that day alright, but it was of a different sort. There’s no denying it: this feminist icon spoke to the KKK in New Jersey in May 1926. That alone would place any conservative or Republican directly in liberal hell, with no chance for redemption. But a progressive icon like Margaret Sanger? Hey, no problem: Launching Planned Parenthood, America’s largest abortion provider, is apparently suitable penance in the liberal church.\nOne might ask, why would the KKK be so interested in Ms. Sanger? The reasons are obvious, a natural fit.\nSanger was a passionate racial-eugenicist with a crowning vision for what she openly called “race improvement.” The Planned Parenthood founder lamented America’s “race of degenerates.” The nation’s landscape needed to be purged of its “human weeds” and “the dead weight of human waste.” This included the “feeble-minded,” the “insane,” and the just plain “idiots.” Sanger shared the disparaging view of humanity held by another progressive icon, Supreme Court Justice Oliver Wendell Holmes, who declared that “Three generations of imbeciles are enough.” Like Holmes, and, for that matter, like Adolf Hitler—who was an obviously more aggressive racial-eugenicist—Sanger hoped to finesse and refine the “gene pool.” She would do so not with gas chambers and concentration camps but with birth-control pills, eliminating human life before conception rather than after birth. Thus, her Planned Parenthood, which was originally called the American Birth Control League.\nOne of Sanger’s favorite slogans, so much so that it adorned the masthead of her Birth Control Review, was this: “Birth Control: To Create a Race of Thoroughbreds.”\nIn this Sangerian vision, blacks were singled out.\nProgressives today dare not raise the alarming specter of Sanger’s “Negro Project,” or her correspondence with Dr. Clarence Gamble, one of her Negro Project collaborators. In a remarkable December 10, 1939 letter today held in the Sanger archives at Smith College (I have a photocopy), Sanger urged Gamble: “We do not want word to go out that we want to exterminate the Negro population.”\nI’ve written about that letter here before. To be fair, Sanger’s exact meaning isn’t entirely clear, but it seemed clear enough for the boys (and gals) in the white hoods. Thus, she had an open-invitation from the KKK. For the guys and gals at the Klan, what wasn’t there to like?\nNeedless to say, this is disturbing and infuriating at so many levels, especially the rank hypocrisy.\nCan you imagine if a conservative or right-of-center organization—an ideological equivalent to Planned Parenthood—had been founded by a leader who had spoken to the KKK? Imagine if, say, the founder of the NRA or National Right to Life had spoken to the KKK. How long would it take the liberal (and pro-choice) media to completely discredit that group forever simply via guilt-by-association with its founder? The group would instantaneously cease to exist. It would not last another year, maybe not even survive a news cycle.\nBut liberals can get away with this stuff. Worse, they can flip it on its head. Amazingly, they viciously denounce not those who support Planned Parenthood but those who don’t. Remember the debate in 2011? When Republicans sought to cut federal funding of Planned Parenthood, Senate Majority Leader Harry Reid said Republicans had placed a “bull’s eye on women in America.” Congresswoman Barbara Lee (D-CA) asserted, “This is a war on women.” Senator Dianne Feinstein insisted that defunding efforts were “nothing more than an opportunity for the right wing in the House to sock it to women.” Senator Barbara Boxer described Republican efforts as a “vendetta” against women. Former House Speaker Nancy Pelosi called it a “very dangerous situation for… women across our country.” Pelosi told reporters: “It’s degrading to women; it’s disrespectful.” She said Republicans were using Planned Parenthood as a “whipping boy.”\nHow ironic that Nancy Pelosi would use Planned Parenthood and “whipping boy” in the same sentence. Planned Parenthood founder Margaret Sanger spoke to the KKK’s whipping boys—or at least the whipping boys’ wives.\nBut again, no problem for liberals. They don’t know any of this history. They don’t teach it. They won’t even be bothering with this article. I would be shocked if even a hundred liberals read this article from start to finish.\nLiberals not only hail Planned Parenthood but lionize its “race-improvement” founder. When Hillary Clinton was adorned with the glorious Margaret Sanger Award by Planned Parenthood, she glowed, expressing her “awe” of the racial-eugenicist. Obviously, no one at the New York Times zinged Hillary for being in awe of a woman who addressed the women’s branch of the KKK. And no liberal said the same of Nancy Pelosi when she gleefully accepted the Sanger Award.\nIn fact, only a culture and education system so numbingly ignorant from one-sided liberal indoctrination could produce a liberal African-American president who likewise stands in awe of Sanger’s legacy. “Thank you, Planned Parenthood,” said Barack Obama tearfully in an April 2013 speech to the Planned Parenthood faithful, “God bless you.” The black president promised he will always be there with Planned Parenthood “every step of the way.”\nToday, Planned Parenthood is the single leading killer of unborn African-American babies, whose lives it snuffs out at a percentage far higher than white babies. That’s the real racial legacy of Margaret Sanger. On January 22, 1973, Roe v. Wade would give her Planned Parenthood its mandate, and liberals would sanctify its work with taxpayer funding.\nSo, when liberals wail and gnash their teeth over Steve Scalise, ask them if they give a rip that one of the charter members of the progressive hall of fame, a forever-revered icon-in-good-standing, Saint Margaret Sanger, had a Negro Project, preached “race improvement,” and spoke to the KKK. Don’t be surprised when they respond in complete denial, complete anger, or complete bewilderment.","url":"https://spectator.org/61552_reflections-roe-when-margaret-sanger-spoke-kkk/"}
