{"authors":[],"date_download":"2018-10-30 01:24:17","date_modify":"2018-10-30 01:24:17","date_publish":"2015-08-27 08:00:00","description":null,"filename":"data/vaneerConsumption/ReformReplaceRestartorInnovate.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/08/Screen20Shot202015-08-2620at202.38.0420PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862657.html","title":"Reform, Replace, Restart, or Innovate?","title_page":"Reform, Replace, Restart, or Innovate?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Editor’s Note: Debra J. Saunders is off. The following column is by Veronique de Rugy.\nWisconsin Gov. Scott Walker recently released his replacement plan for the Affordable Care Act and jump-started the presidential debate about how to wind down Obamacare.\nIn his book Overcoming Obamacare, the Washington Examiner’s Philip Klein catalogs the three main schools of thought regarding post-ACA policy: reform, replace, and restart. The restart school needs a little explaining. It would repeal the ACA and implement reforms as lawmakers would have at 2009 spending levels, had they a chance.\nThe main difference among the three approaches is how much their proponents favor the government’s role in providing health insurance. The plans formulated by the restart school are often the ideologically purest of them all. Its biggest current advocate in the presidential race is Louisiana Gov. Bobby Jindal. Walker, on the other hand, belongs to the replace school.\nUnfortunately, its replacement option remains very tolerant of government intervention. For instance, it would offer large health care tax credits for those who aren’t covered through their employers. The tax credit would be refundable so that low-income individuals could receive cash to buy private insurance. The hope is that once freed from the many ACA rules of the insurance exchanges, people would see their coverage costs go down and actually be able to buy more affordable insurance.\nIt would pay for the subsidies by capping the employer health care tax exclusion and reforming Medicaid. But it still would add to the deficit. According to the Manhattan Institute’s senior fellow Avik Roy, an adviser to former Texas Gov. Rick Perry’s presidential campaign, the plan wouldn’t reform Medicare; hence, an ACA repeal would increase Medicare spending by more than $800 billion over 10 years.\nWalker argues that the use of tax credits would allow him to reach more low-income consumers and minimize the disruptions to the 12 million people who bought insurance through government exchanges. It also would make the changes more politically feasible.\nBut as a result, it is also best described as “Obamacare Lite,” says the Cato Institute’s Michael Cannon. When I asked him about the plan, he replied: “Supporters cry slander when you say health insurance tax credits are Obamacare Lite. But tax credits function exactly like an individual mandate. Either way, the IRS takes more of your money if you choose not to buy a government-designed health plan.” He continued, “When Walker’s plan says that a family of four can get a tax credit of up to $7,800, it means that’s the amount of the effective penalty that families will have to pay if they don’t buy a government-designed health plan.”\nUnder this plan, he added, “Washington will retain as much control over your health plan as it does under Obamacare’s individual mandate.” In this case, “Congress would define what level of coverage lets you avoid a tax credit’s implicit penalty. Special interests would have the same incentive and ability to force you to buy coverage you don’t want.”\nKlein told me: “Walker’s plan restricts the tax credits to those who aren’t offered insurance through their employers and thus limits choice. I understand he did this out of fear of disrupting the employer-based insurance system, but we aren’t ever going to get to a really free market system if consumers don’t have control over health care dollars.”\nThis plan also shows that Republicans still don’t understand that health care coverage is different from health care. If they did, their goal would be to produce better health care (not health insurance) for more people at a lower cost, year after year. This requires freeing all health care suppliers from regulations at the state and federal levels that currently prevent the kinds of revolutionary innovation in the health care industry that we’ve seen in other fields, such as information technology. It requires allowing consumers to choose treatments, even high-risk ones.\nBringing revolutionary innovation and consumer choice to health care would break the health care cost curve to bits — making the need for health insurance much less important or moot in many cases. The Walker plan wouldn’t do that.\nCOPYRIGHT 2015 CREATORS.COM","url":"https://spectator.org/63895_reform-replace-restart-or-innovate/"}
