{"authors":["Associated Press"],"date_download":"2018-10-22 21:47:44","date_modify":"2018-10-22 21:47:44","date_publish":"2016-01-11 01:38:12","description":"ATHENS, Greece (AP) — Greece's conservative opposition New Democracy party elected a reformist on Sunday as its new leader. Former administrative reform mini...","filename":"data/vaneerConsumption/ReformistlawmakerelectedGreekoppositionleader.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:47b0cc8f2f0c4dbe9e2bb410b862494f-56CX32zFKLb7123928b84c8821ee-187_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393025_Reformist-lawmaker-elected-Greek-opposition-leader_1540244864.html","title":"Reformist lawmaker elected Greek opposition leader","title_page":"Reformist lawmaker elected Greek opposition leader | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Reformist lawmaker elected Greek opposition leader\nATHENS, Greece (AP) — Greece's conservative opposition New Democracy party elected a reformist on Sunday as its new leader.\nFormer administrative reform minister Kyriakos Mitsotakis defeated party stalwart Evangelos Meimarakis in a leadership contest open to all party members. With only partial results available, Meimarakis called Mitsotakis to congratulate him on his victory.\nBoth candidates were seen as moderate, but Mitsotakis, the 47-year-old son of former New Democracy leader and prime minister Constantine Mitsotakis, was considered the change candidate. Mitsotakis is more clearly a market-friendly politician and less likely to use populist rhetoric.\nCandidate Kyriakos Mitsotakis, center, waves to supporters as he leaves a polling station at Kifissia suburb, north of Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nAnd while Meimarakis has been an unsparing critic of left-wing premier Alexis Tsipras' government, Mitsotakis has promised an even tougher opposition line against what he called late Sunday a \"populist...incompetent government.\"\nTsipras called Mitsotakis to congratulate him and invite him to a meeting this coming week, an invitation the new opposition leader accepted. But it is unlikely that their relationship will remain as courteous. Tsipras' Syriza party and their government partners, the right-wing Independent Greeks, have repeatedly portrayed Mitsotakis as too willing to do the bidding of Greece's creditors.\n\"New Democracy will now become a hardline neo-liberal party that will only do the bidding of the oligarchs, losing any connection with the people,\" the Independent Greeks said in a statement.\nEven Mitsotakis' opponents, however, largely refrained from referring to his status as a political family scion, at a time when nepotism and political dynasties have been convenient scapegoats for the ills of crisis-ridden Greece. Mitsotakis has created a profile of his own, distinct from his father's, and that of his elder sister, Dora Bakoyannis, who herself had unsuccessfully sought the party leadership in 2009.\nNonetheless, the family patriarch, 97, was there Sunday to congratulate his son and wish him to become prime minister in his turn.\nWith 70 percent of polling prednellcincts reporting, New Democracy officials announced that Mitsotakis was leading Meimarakis, 51 percent to 49 percent. The final results will be announced Monday. About 400,000 people were eligible to vote.\nIn the first round, held on Dec. 20, Meimarakis had led Mitsotakis, 39.8 percent to 28.5 percent. Two other candidates were eliminated.\nMeimarakis, 62, is a former minister and parliamentary speaker. He served as the New Democracy interim leader from July to November 2015.\nCandidate Vangelis Meimarakis, center, greets a member of an election comittee inside a polling station in Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nCandidate Vangelis Meimarakis, center, makes statements inside a polling station in Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nVoters prepare to cast ballots inside a polling station at Kifissia suburb, north of Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nA voter casts a ballot inside a polling station at Kifissia suburb, north of Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nA voter casts a ballot inside a polling station at Kifissia suburb, north of Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nCandidate Kyriakos Mitsotakis, center, casts a ballot inside a polling station at Kifissia suburb, north of Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nCandidate Kyriakos Mitsotakis, center, goes to cast a ballot inside a polling station at Kifissia suburb, north of Athens, on Sunday, Jan. 10, 2016. Greece's conservative New Democracy party conducts a nationwide voting to elect a new leader. (AP Photo/Yorgos Karahalis)\nNewly-elected President of the New Democracy party Kyriakos Mitsotakis, center, listens to associates outside his office in Athens, Monday, Jan. 11, 2016. Greece's conservative opposition New Democracy party has elected the reformist as its new leader. Former administrative reform minister Mitsotakis has defeated party stalwart Evangelos Meimarakis in a leadership contest open to all party members. (AP Photo/Yorgos Karahalis)\nNewly-elected President of the New Democracy party Kyriakos Mitsotakis, center, hugs an associate outside his office in Athens, Monday, Jan. 11, 2016. Greece's conservative opposition New Democracy party has elected the reformist as its new leader. Former administrative reform minister Mitsotakis has defeated party stalwart Evangelos Meimarakis in a leadership contest open to all party members. (AP Photo/Yorgos Karahalis)\nNewly-elected President of the New Democracy party Kyriakos Mitsotakis, center, is cheered by supporters outside his office in Athens, Monday, Jan. 11, 2016. Greece's conservative opposition New Democracy party has elected the reformist as its new leader. Former administrative reform minister Mitsotakis has defeated party stalwart Evangelos Meimarakis in a leadership contest open to all party members. (AP Photo/Yorgos Karahalis)","url":"https://www.dailymail.co.uk/wires/ap/article-3393025/Reformist-lawmaker-elected-Greek-opposition-leader.html"}
