{"authors":[],"date_download":"2018-10-22 23:18:34","date_modify":"2018-10-22 23:18:34","date_publish":"2016-04-10 00:00:00","description":"A farming education program aims to help people fleeing violence and persecution establish new roots — figuratively and literally.","filename":"data/vaneerConsumption/RefugeesPlantTheSeedsOfANewCommunityInKansasCity.json","image_url":"https://media.npr.org/assets/img/2016/04/10/beh-paw-gaw-at-ki-ko-ko-overview_wide-402dc6a1382eb30f643755eddcb16be979e30b05.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=473721841_1540250314.html","title":"Refugees Plant The Seeds Of A New Community In Kansas City","title_page":"Refugees Plant The Seeds Of A New Community In Kansas City : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MICHEL MARTIN (HOST): We've been talking about farming quite a bit this weekend, so we have one more story we'd like to tell you about, this time from Kansas. We're going to look at how farming is helping a group of refugees bridge the divide from their old homes to their new lives in the United States.\nIn Kansas, there's program called New Roots for Refugees. It aims to teach the basics and business of farming over the course of four years. At the end, many graduates are ready to start farms of their own. Oluwakemi Aladesuyi has the story.\nOLUWAKEMI ALADESUYI (BYLINE): Juniper Farm is a nine-acre spread on the Kansas side of Kansas City. It's in the midst of boxy yellow and brown public housing, beyond the highway and past empty grain elevators. As their children play on the grassy knoll behind us, four women sit at a plastic picnic table.\nThey're students at a program called New Roots for Refugees. It's a joint effort between Catholic charities and a nonprofit called Cultivate Kansas City, which encourages locally-grown food and urban agriculture.\nDHAN RAI: It is like practical education here, so I love it very much.\nALADESUYI: Like Dhan Rai, a first-year farmer, many of the men and women at New Roots come from Bhutan or Burma. Some were farmers in their homelands. But farming on the outskirts of Kansas City is different - the land, the crops, even the weather. Still, this brisk morning is the perfect time to work outside.\nAs a train passes, Sisi Cho plants zucchini seeds and baby heads of kale in her quarter-acre plot behind the greenhouse. Earlier this month, she sold spinach, spring garlic and radishes at a local farmer's market. She is the first New Roots farmer to sell produce this season.\nSisi Cho picks a deep red radish. She rinses it off and hands it to me. It's bitter, but has a sweet aftertaste, much like the journey that brought her and the other refugees here. They fled ethnic violence and military oppression that made their people victims of torture, systemic rape and forced labor.\nFor some, escape meant enduring years in cramped refugee camps. Entire families shared one-room shelters covered with roofs made of plastic sheeting. So while many who have come here are struggling economically, like Sisi Cho they're happy to be in the U.S.\nSISI CHO: Yeah, America government is good, yeah. No separate color or race. Yeah, everything good.\nALADESUYI: But it doesn't mean that the transition is easy. Sam Davis is here to help. The students call him Mr. Sam. He's a site manager who teaches how to farm, manage a small business and navigate a new life in America. Mr. Sam says he understands. His family moved here from Arkansas about 60 years ago.\nSAM DAVIS: We were Americans coming to Kansas, and it was like going to another country. For the first - you know, you had to fight your way to school, you had to fight your way home (laughter).\nALADESUYI: Fitting in was hard for Mr. Sam because he spoke a different dialect. It's one way that he relates to the refugees.\nDAVIS: The language I don't understand. The expression, most of the time, I understand. But - morning - but that's how - that's actually how I communicate with them, you know? And I don't give up.\nALADESUYI: It's that kind of spirit that encourages people like August Gaw. She's 25 years old and often translates for her mother, Beh Gaw, who graduated from New Roots a few years ago.\nAUGUST GAW: Even if they don't know the English that much, when they speak, Sam will understand my mom.\nALADESUYI: August used to come here to help her mom out. But now Beh Gaw has her own 3-acre farm which she farms with her sister. Last year, the operation made over $10,000. Mr. Sam says the benefits of New Roots go beyond the farmers.\nDAVIS: They can keep doing what they did in their homeland. And if they get enough land, they're already set up for market, and it continues to go on. It feeds back into the community, the neighborhood.\nALADESUYI: A neighborhood where many of these refugees are starting to feel at home. Here's August Gaw.\nGAW: My mom came to work here, and then she met other people here. And we feel very, like, close to each other and then feel much better.\nALADESUYI: What's brought them together in Kansas City is farming, but what's keeping them together is community. For NPR News, I'm Oluwakemi Aladesuyi.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=473721841"}
