{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 18:19:03","date_modify":"2018-10-30 18:19:03","date_publish":"2016-08-16 18:54:40","description":"The refugee resettlement industry is accelerating its propaganda campaign to increase Muslim refugees in the US with a D.C. rally on Aug. 28.","filename":"data/vaneerConsumption/RefugeeResettlementIndustrysPropagandaCampaignAccelerateswithDCRally.json","image_url":"https://media.breitbart.com/media/2016/08/DCRally4Refugees-TShirt-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_16__1540923543.html","title":"Refugee Resettlement Industry's Propaganda Campaign Accelerates with DC Rally","title_page":"Refugee Resettlement Industry's Propaganda Campaign Accelerates with DC Rally","title_rss":"NULL","source_domain":"breitbart.com","text":"The politically powerful refugee resettlement industry is accelerating its propaganda campaign to significantly increase the number of Muslim refugees allowed into the United States with a rally in Washington, D.C., on August 28.\n“You have got to hand it to them (to the likes of George Soros and big progressive funders like the Tides Foundation), they know how to promote a propaganda campaign,” Ann Corcoran of Refugee Resettlement Watch says of the August 28 event.\nThe financial backers of the rally include most of the big political players in the lucrative refugee resettlement industry, where government funded “voluntary agencies” [VOLAGs] receive more than $1 billion from taxpayers annually to resettle on average 70,000 refugees each year in the United States.\nAmong those rally sponsors on the VOLAG federal gravy train are the U.S. Committee for Refugees and Immigrants (whose local affiliate is currently embroiled in the Twin Falls, Idaho refugee rape controversy), Church World Service, the International Rescue Committee, World Relief, HIAS (formerly known as the Hebrew Immigrant Aid Society), the Episcopal Church, and the Ethiopian Community Development Council, Inc.\nOther well known far-left groups sponsoring the event include the American-Arab Anti-Discrimination Committee, the George Soros-funded National Immigration Forum, Sojourners, and the Southern Poverty Law Center.\nAccording to its website, “In the midst of the greatest refugee crisis since WWII, advocates from across the country will gather at DCRally4Refugees, August 28, 2016 at the outdoor Sylvan Theater at the Washington Monument on the National Mall in Washington, DC, . . . (rain or shine)”:\nThe rally will raise awareness about the magnitude of the global refugee crisis, encourage advocacy and U.S. action to alleviate suffering through relief efforts and support, and stand in solidarity with refugees and displaced people worldwide. Anyone is encouraged to join the #SeaOfOrange, buy a T-shirt, attend the historic rally and use #DCRally4Refugees to show support. Steps from the U.S. Capitol, DCRally4Refugees will call on the U.S. to provide more refugee resettlement and increased support to countries and organizations already involved, support proven relief efforts overseas, and offer resources for those who wish to help, raising a collective voice against intolerance.\nThe organizers claim that “DCRally4Refugees was inspired by Americans who traveled to Greece and volunteered directly with refugees fleeing war and violence in Syria and other countries”:\nAfter bearing witness to the suffering of millions and hearing the voices of fear and intolerance at home, they felt compelled to do everything possible to raise awareness, stand up against the voices of intolerance, and show the world that America cares about the greatest refugee crises since World War II.\nAs Refugee Resettlement Watch’s Corcoran notes, “They are promoting their rally as a ‘collective voice against intolerance,'” but the rally is really intended to influence Congress to increase the number of refugees resettled in the United States from the 70,000 that arrived in FY 2015 to more than 200,000 in FY 2017.\n“[I]n September Barack Hussein Obama will be leading a major effort at the United Nations to open our gates even wider for hundreds of thousands of third world migrants to be placed in your towns,” Corcoran points out.\nRobert Carey, director of the Office of Refugee Resettlement (and until recently an executive with one of the largest VOLAGs, the International Rescue Committee) said on an August 9 press call the Obama administration wants to double the refugee resettlement budget in FY 2017 and resettle more than 200,000 “humanitarian arrivals” in the United States in the fiscal year that begins on October 1:\nThe President’s fiscal year 2017 budget requests include $2.2 billion for ORR programs and that represents the cost of maintaining services for additional refugees and other entrance and unaccompanied children primarily from Central America. The President’s budget request would support a total of 213,000 humanitarian arrivals including 100,000 refugees in 2017. Once a refugee arrives in the US they are eligible to access the same benefits as American citizens who are here legally including temporary aide to newly families [sic], Medicaid, SSI, and SNAP.\nAs Breitbart News reported, Carey is only the most recent director of the Office of Refugee Resettlement to participate in the revolving door between the federal funder of the VOLAGs who resettle refugees and the VOLAGs who benefit from that taxpayer largesse.\nLavinia Limon, the current head of the U.S. Committee for Refugees and Immigrants, and Eskinder Negash, that organization’s vice president for Global Development, both served previously as director of the Office of Refugee Resettlement in Democratic administrations.\nAs a recent poll found, most Americans oppose increasing the number of Syrian refugees resettled in the United States.\nHistorically, as Gallup reports, “Americans have a general reluctance to accept refugees into the U.S., even in response to situations that are clearly oppressive.” In light of the recent increase in Islamist terrorist attacks in the United States and around the world, that reluctance among most Americans has now developed into an attitude of outright resistance.\nDespite that widespread opposition to refugee resettlement, the VOLAGs are seeking to keep the federal refugee resettlement gravy train rolling in their direction, at an even greater level, through the use of propaganda and community organizing events, as Ann Corcoran points out:\nSeptember is also the month when the Administration (Obama and Sec. of State Kerry) will make their final determination for the US Refugee Admissions Program and submit their plan for fiscal year 2017. They said last year that they were shooting for 100,000 refugees for FY17, but we expect the number to be much higher. The buck stops with Speaker Paul Ryan! And, frankly there is only one person who is now in the catbird seat to stop them this fall!—Speaker Paul Ryan. (I know your hearts are sinking, but that is the cold hard truth.) Only Congress can stop them by not granting the money needed to place hundreds of thousands of needy people, some from countries that hate us, in over 350 American towns. Now here they go attempting to soften up Congress by rallying in Washington for refugees on August 28th!\nGeorge Soros has his fingerprints all over efforts to promote refugee resettlement through a number of organizations he funds. As Breitbart reported recently, George Soros’ Open Society Foundation “spends millions promoting Somalian migrants”:\nDocuments show that George Soros’ Open Society Foundations has spent 1.8 million dollars to improve the image of Somalians in Europe and to combat Islamophobia. Newly leaked documents from the Open Society foundation by site DC Leaks show the organized web of funding that George Soros and Open Society have become infamous for. One particular report shows funding for an initiative to promote the image of Somalians in Europe who, according to the report are in the top ten most discriminated people on the continent. According to the foundations the real problem is the image of Somalians in the media and not the problems that have led to the creation of that image. “Political and media coverage of Somalis was largely negative, focusing on piracy, terrorism, FGM, and abuse of the welfare system,” the report states. Somali men have garnered this image due to discrimination, according to the report. While piracy along the horn of Africa is well known, there have been many cases of Somalians being involved in sexual assaults on minors, and people trafficking.\nThose leaked documents also reveal “a number of startling revelations about the work of the NGO when it comes to combating what they refer to as ‘xenophobic parties’ in countries around Europe”:\nAccording to at least one document, the foundations has been calling for the censorship of language in the European parliament they term as hateful and have been actively working with various socialist members of the European parliament to train them on how to combat “xenophobic populism.”\nThat same strategy now appears to be deployed in the United States, where it will be on full display in the August 28 DCRally4Refugees.","url":"https://www.breitbart.com/politics/2016/08/16/refugee-resettlement-industrys-propaganda-campaign-accelerates-with-d-c-rally/"}
