{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:05:51","date_modify":"2018-10-30 23:05:51","date_publish":"2016-10-12 08:00:00","description":"Sure, this presidential campaign has been nasty, divisive and frequently in need of parental control settings. But for how hard it’s been to stomach at","filename":"data/vaneerConsumption/RegistrationsurgesbutGOPsshareshrinks1in3newvotersisLatino.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/newvoters_7dHU7IX-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940751.html","title":"Registration surges but GOP's share shrinks-1 in 3 new voters is Latino","title_page":"Registration surges but GOP's share shrinks—1 in 3 new voters is Latino | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Sure, this presidential campaign has been nasty, divisive and frequently in need of parental control settings. But for how hard it’s been to stomach at times, this election season may be producing a civic upside: Californians are registering to vote at rates not seen in 20 years.\nThe state’s voter rolls are surging. Nearly three-quarters of those eligible to vote are now registered, the highest rate at this point in the election cycle since a different Clinton was running for president in 1996 (because of the ebb and flow of voter registration rolls, it’s best to compare registration counts at the same point in election cycles). According to the most recent estimates from the Secretary of State’s office, California now boasts more than 18 million registered voters—more than the population of 46 states. That number is likely to grow before California’s registration date cutoff on Oct 24.\nA CALmatters analysis of voter registration data estimates that up to 2.2 million people who are likely new to the California political process have joined the state’s voter rolls since primary season began in earnest in January of this year. These new voters reflect major growth in the number of Latinos and Asian-American voters, who—along with younger voters registering for the first time—are steering clear of the GOP.\nCalifornia’s swelling voter registration could have profound implications for election results next month. Here is some context:\nWatch the GOP share of California voters shrink\nContinuing the long-term trend, California’s new voters tend not to register as Republicans.\nData limitations make it difficult to parse out exactly who is joining California’s electorate for the first time. But, courtesy of Sacramento-based data warehousing and consulting firm Political Data Inc., we can separate out voters who have registered since January 1 of this year and have never voted in an election between 1992 and the June primary. This group will contain some long dormant voters who have re-registered in recent months, but it should serve as a decent proxy for new voters (you could also argue that a long dormant voter re-registering could be viewed as a sign of renewed political interest, although people re-register for a variety of reasons).\nThe proportion of California voters who register Republican has been in relatively steady decline since the 1990s, with a steepening drop over the past four years. New California voters who have registered since January are also resisting the GOP—only 15 percent of all new voters are Republican.\nA couple of factors help explain why: Millennials, who make up the bulk of new voters, aren’t very conservative, and California is already a very blue state.\nBut it does appear that this election may be helping Democrats pick up voters in California at a higher clip. About half of new voters who registered after January registered Democrat, while 30 percent registered independent.\nLatinos lead surge in 2016 California registration\nWhat’s perhaps the most common question in California political circles? Whether GOP presidential nominee Donald Trump’s anti-immigration rhetoric will mobilize California Latinos.\nThe answer thus far appears to be yes. About one in three new California voters is Latino.\nAsian-American registration has also climbed significantly.\nNew Latino and Asian voters trend away from GOP\nLatino and Asian-American voters new to the political process in California are both less likely to register Republican than those already registered.\nAgain, part of that trend is simply generational, as young Latino and Asian-American voters mirror white millennials in their resistance to the GOP. The pattern of California Asian-Americans trending Democrat possibly in response to Trump may also be reflecting a national trend of increasing concern to Republicans.\nBut interestingly, new Latino voters are registering Democrat at roughly the same rate as current Latino voters. In what could be seen as a missed opportunity for Democrats, a significantly higher percentage are registering independent.","url":"https://calmatters.org/articles/states-voter-rolls-are-surgingand-1-in-3-new-voters-is-latino/"}
