{"authors":["Press Association"],"date_download":"2018-10-23 01:34:04","date_modify":"2018-10-23 01:34:04","date_publish":"2016-01-11 12:36:19","description":"Defending champion Shaun Murphy was dumped out of the Masters in the first round by Mark Allen at Alexandra Palace. Murphy, who beat Neil Robertson in the fi...","filename":"data/vaneerConsumption/Reigningchampionshaunmurphydumpedoutofthemastersatfirsthurdle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-69c09ab8-8570-4370-8627-cf3829660b4e-48qEJGFphM8d437f0aaf924c8b13-991_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3392739_Champion-Shaun-Murphy-goes-Masters_1540258444.html","title":"Reigning champion shaun murphy dumped out of the masters at first hurdle","title_page":"Reigning champion shaun murphy dumped out of the masters at first hurdle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Reigning champion Shaun Murphy dumped out of the Masters at first hurdle\nDefending champion Shaun Murphy was dumped out of the Masters in the first round by Mark Allen at Alexandra Palace.\nMurphy, who beat Neil Robertson in the final last year, fought back from 5-2 to 5-4 but both men made errors in a scrappy 10th frame that eventually went the way of Allen as he secured a 6-4 victory.\nAfter the first two frames were shared, Allen moved ahead with a break of 137 in the third and then made it 4-2 when Murphy forfeited the frame following three misses.\nMark Allen beat Shaun Murphy, pictured, in the first round of the Masters\nMurphy stood by his decision to try the same shot for a third time. Because he was not snookered, his third miss meant he automatically lost the frame.\nHe said on worldsnooker.com: \"It's the rule. You don't see it very often. Normally you would look for an alternative on the third go. I couldn't see a Plan B.\n\"All other options left him a guaranteed chance so I had to man up, take a deep breath and play the right shot. Unfortunately I got it completely wrong.\n\"Did I lose the match because of it? No, I don't think so. There were plenty of other frames.\n\"I thought it was a really good match played in very good spirit. That match could have been the final of any tournament. Unfortunately for me it was the first round and I'm on my way home.\"\nAnother century of 104 put Allen one frame away and, although Murphy managed a break of 100 in the ninth frame, he could not complete the comeback.\nAllen was delighted to get the better of his good friend at one of snooker's biggest tournaments, saying: \"Shaun is the defending champion here, under a lot of pressure, and it was a big match for me playing him on the big stage.\n\"I'm very happy with the way I played, I scored heavily, took my chances well and got over the line in the end.\"\nAllen will face either Barry Hawkins or Joe Perry in the quarter-finals.\nStuart Bingham missed out on a 147 break on the way to a 6-4 against Ding Junhui.\nBingham had fought back after losing the first frame to level and was on a break of 120 in frame three when a missed yellow cost him his chance at a maximum.\nHe still took the frame 124-0 and claimed the fourth as a break of 60 secured a 70-21 success to lead 3-1.\nDing took the next two frames to level at 3-3 before Bingham won the seventh frame 80-5. A break of 71 brought Ding level again but Bingham won the next to edge 5-4 ahead.\nAnd the reigning world champion edged a scrappy 10th frame to get over the line and book his place in the last eight of the Masters for the first time in his career.","url":"https://www.dailymail.co.uk/wires/pa/article-3392739/Champion-Shaun-Murphy-goes-Masters.html"}
