{"authors":[],"date_download":"2018-10-30 20:33:16","date_modify":"2018-10-30 20:33:16","date_publish":"2015-11-09 23:20:53","description":"A Reinhardt University professor who resigned after being accused of sexual battery involving a student has been acquitted.","filename":"data/vaneerConsumption/Reinhardtprofessoracquittedofsexualbatteryagainststudent.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_reinhardt-p_8df928acf8d654ba895dbd94d2e3d883__1540931596.html","title":"Reinhardt professor acquitted of sexual battery against student","title_page":"Reinhardt professor acquitted of sexual battery against student","title_rss":"NULL","source_domain":"ajc.com","text":"A Reinhardt University professor who resigned after being accused of sexual battery involving a student has been acquitted.\nMichael David Gregory’s lawyer, Kim Keheley Frye, said a Cherokee County jury took less than 20 minutes Friday to find the former band director not guilty on sexual battery.\nGregory was alleged to have had “inappropriate contact” with a student. After administrators at the university in Waleska received the results of a Cherokee County Sheriff’s Office investigation in December, he submitted his resignation, which was accepted, school spokeswoman Marsha White said.\n“I never was given an opportunity to refute or rebut or say my side,” Gregory told Channel 2. He added that he was “professionally and personally devastated.”\nIn a statement, Reinhardt said it respected the jury’s verdict.\n“In the 45 years that I’ve worked with students, and the thousands and thousands of students I’ve come in contact (with) … not one impropriety has been reported; not one complaint has been filed,” Gregory said.\nHis attorney said anyone could face such an accusation.\n“I think everybody thinks it can’t happen to me, that this could never happen to me because I’m not going to do anything wrong,” she told Channel 2. “Doctor Gregory did nothing wrong.”","url":"https://www.ajc.com/news/crime--law/reinhardt-professor-acquitted-sexual-battery-against-student/lZZBK6GzLngmSMHGsreIHL/"}
