{"authors":["Charlie Spiering"],"date_download":"2018-10-30 17:56:30","date_modify":"2018-10-30 17:56:30","date_publish":"2016-07-22 02:52:21","description":"Republican National Committee Chairman Reince Priebus took the stage at the convention warning Americans that Hillary Clinton is unfit to be president. | Politics","filename":"data/vaneerConsumption/ReincePriebusHillaryClintonViewstheOvalOfficeasaCashCow.json","image_url":"https://media.breitbart.com/media/2016/07/Reince-Wave-Conv-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_21__1540922190.html","title":"Reince Priebus: Hillary Clinton Views the Oval Office as a ‘Cash Cow’","title_page":"Reince Priebus: Hillary Clinton Views the Oval Office as a ‘Cash Cow’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Republican National Committee Chairman Reince Priebus took the stage at the convention warning Americans that Hillary Clinton is unfit to be president.\n“Hillary Clinton has perfected the art of politics for personal gain,” he said.\nHe criticized the Clintons for using positions of power to enrich their family for decades.\n“She used her post as Secretary of State to grease the wheels for Democrat lobbyists, special interests ,and political insiders connected to the corrupt Clinton machine,” Preibus said, referring to the millions raised by the Clintons for their foundation and corrupt tradeoffs. “For Hillary Clinton, the oval office is just another cash cow.”\nAmericans, he explained, were sick of corruption and cronyism from their politicians.\n“This election is our chance to stop it, and Donald Trump is the right man to lead that charge,” he said.\nPriebus appeared grateful that Trump had brought millions of Americans into the Republican party, listening to Americans who were eager to change.\n“This is our moment to set a new course for an America as strong and confident as we’ve ever been,” he said. “Let’s stand united as Republicans.”","url":"https://www.breitbart.com/politics/2016/07/21/reince-priebus-hillary-clinton-views-the-oval-office-as-a-cash-cow/"}
