{"authors":["Frances Martel"],"date_download":"2018-10-30 20:41:57","date_modify":"2018-10-30 20:41:57","date_publish":"2015-06-05 17:27:14","description":"Relatives of missing passengers of the Eastern Star, a cruise ship that capsized on the Yangtze River on Monday night, are alleging that Chinese police intimidated, wrestled, and beat them when approached for answers on what happened to their family members and why the ship chose to travel through tornado winds. |","filename":"data/vaneerConsumption/RelativesofCapsizedChineseCruiseShipPassengersClaimPoliceBeatThem.json","image_url":"https://media.breitbart.com/media/2015/06/China-Boat-Sinks-Chinatopix-via-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_05__1540932117.html","title":"Relatives of Capsized Chinese Cruise Ship Passengers Claim Police Beat Them","title_page":"Relatives of Capsized Chinese Cruise Ship Passengers Claim Police Beat Them | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Relatives of missing passengers of the Eastern Star, a cruise ship that capsized on the Yangtze River on Monday night, are alleging that Chinese police intimidated, wrestled, and beat them when approached for answers on what happened to their family members and why the ship chose to travel through tornado winds.\nReuters reports that the alleged police brutality occurred on Wednesday, when a large group of family members who do not yet know the fate of those onboard the ship rallied in Shanghai to raise awareness of their plight and demand police more thoroughly explain the circumstances surrounding the disaster. One relative who spoke to Reuters questioned even the large and imposing presence of police in a congregation of families mourning mostly elderly tourists: “Why are they using taxpayers’ money to bully us? Why are all these police here?”\nIn addition to protests in Shanghai, some relatives traveled to the scene of the ship’s sinking– Jianli county in central Hubei– to protest. There, too, they report, they found opposition from police, encouraging them to go back and stop congregating. They were eventually allowed to see the sight of the disaster, but journalists were barred from going with them.\nReuters notes that videos had surfaced online showing police wrestling with and attacking family members. Most of those videos have been removed by the Chinese government, though some with milder scenes of police physically engaging relatives of the lost remain:\nRelatives demanding answers have also reported being ignored at the offices of the travel agency that booked the ride:\nThe South China Morning Post reports that some relatives of the victims have claimed that even those authorities sent to help them, like medical staff and officials working on the bureaucratic issues surrounding the disaster, have been less than accommodating. “They just tried to prevent us from complaining and protesting,” said one man whose mother was on the ship, adding that he felt they “treat us as enemies.”\nSCMP found one man, Zhang Wenzhong, willing to go on the record to say he was beaten by police. Zhang said a policeman beat him when he and 20 other relatives of those on the Eastern Star approached a government office in People’s Square. The newspaper adds that local media were banned from discussing the relatives at all.\nThis behavior stands in stark contrast to the startling permissiveness the Chinese government displayed last year towards the relatives of the victims of Malaysia Airlines flight 370, which disappeared without a trace in March 2014. Beijing allowed 200 relatives to congregate at the Malaysian embassy in the capital, demanding the government of Malaysia do more to find the plane. The target of public ire in that instance, however, was notably not the Chinese government, whose officials too criticized Malaysia for their execution of rescue operations.\nThe Associated Press notes that the Chinese Communist Party has explicitly warned officials to be especially mindful of maintaining public order, as the potential for relatives becoming increasingly unruly grows. Police have been reportedly advised to “understand the sorrow of the families” but “concretely preserve social stability.” This has grown especially important as the news surfaced that the Eastern Star had been cited for safety violations in the past, and that weather reports clearly indicated dangerous weather ahead, so much so that many other ships had anchored for the night, while the Eastern Star sailed on.\nIn the aftermath of Eastern Star, state media has focused on providing positive information as it surfaces from the disaster, such as the fact that 14 survivors have been rescued and the ship is now, finally, upright. State outlet Xinhua ran a testimony by one of the lucky 14, who managed to open the window in his cabin and swim out to shore.\nReuters adds that relatives believe there is a concerted online effort in progress to praise the police by “fake” victims’ relatives online. Messages thanking the authorities for their work by people allegedly related to the victims have suspiciously sprouted on online forums in such a way that those confirmed to be related to the ship’s passengers have questioned whether they are who they claim to be. “Why would a grief-stricken family member be posting such positive messages about what a great job government officials are doing in Jianli?” asked one relative.\n103 bodies have been found since the search began, and 14 people were rescued alive. 456 people were on the ship’s manifest, however, indicating that hundreds remain trapped in the ship.","url":"https://www.breitbart.com/national-security/2015/06/05/relatives-of-capsized-chinese-cruise-ship-passengers-claim-police-beat-them/"}
