{"authors":[],"date_download":"2018-10-30 01:00:35","date_modify":"2018-10-30 01:00:35","date_publish":"2018-07-08 00:05:20","description":null,"filename":"data/vaneerConsumption/ReligiousPersecutionAgainRisesWorldwide.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Secularism_In_Flame.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861235.html","title":"Religious Persecution Again Rises Worldwide","title_page":"Religious Persecution Again Rises WorldwideThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Religious persecution is on the rise worldwide. Real persecution, including death and prison for people of faith.\nAmerican Christians fear that they are glimpsing their future. Activists hostile to religion are using control of cultural institutions, business, and government bureaucracies to punish believers. Still, what happens elsewhere is different in kind. Every year hundreds or thousands of people are martyred for their faith.\nThe latest Pew Forum report on international religious restrictions details the bad news for 2016. For the second year in a row, the number of nations with significant limits on believers rose. Increasing nationalism fueled the worsening attacks.\nPew is unique among monitoring organizations in looking at both government restrictions and private actions. The number of nations with significant limits overall rose from 80 to 83, accounting for 42 percent of countries. The increased persecution largely reflected government controls. The percentage of states doing the latter rose from 50 to 55 nations, or 25 percent to 28 percent. Those with significant social hostility rose from 53 to 54, or 27 percent.\nThe status of religious liberty has been worse only once over the last decade, in 2012. The improvement was particularly dramatic in 2014, but since then trends have reversed.\nPersecution remained generally steady in many nations, particularly Muslim states, around the world. However, “in many countries, restrictions on religion resulted from actions taken by government officials, social groups or individuals espousing nationalist positions. A major increase of this sort of activity directed at Muslims came in Europe.”\nNationalism also intensified in other regions, such as Asia. Attacks on religious minorities, both Christians and Muslims, flared in India, for instance. In Brazil and Peru, Jews came under increased attacks.\nUnsurprisingly, the worst government persecution occurred in the Middle East and North Africa. The attacks were mostly Muslim on Christian/Jew/Bahai/other and majority Muslim on minority Muslim (most Muslims are Sunni, but three countries have Shia majorities). Next came the Asia-Pacific, dominated by China and India, both of which persecute, but for different reasons and in different ways.\nEurope followed, with Sub-Saharan Africa (mostly Christian and traditional) and the Americas lagging — in a good sense. Of course, even Latin America is not exempt from repression. Cuba still is controlled by unrepentant communists who restrict religion, especially Christianity.\nSocial hostility shows a similar relationship. The Middle-East/North Africa again is well in the lead. The Americas are far behind, again in a good sense. The other three regions are more closely bunched together. More significantly, in the last couple of years, Europe has edged ahead of the Asia-Pacific.\nObviously, people of faith are most at risk where they face both state persecution and private abuse. Muslim nations are famous for combining both. Among the worst are Egypt, Bangladesh, Pakistan, Turkey, and Indonesia. In other cases, public and private treatment diverge greatly. For instance, government restrictions on religion are high and rising in China, but there is little public concern about believers, other than from Communist Party apparatchiks. In contrast, India, especially at the national level, imposes few controls on religious believers. However, social hostility is very high, especially among Hindu fundamentalists. Religious minorities worry that the ruling (Hindu nationalist) party might try to strengthen its popular support with new restrictions on minority faiths.\nOverall, Christians remain the most persecuted faith, though the negative upsurge affects other believers as well. Reported Pew: “harassment of the world’s two largest groups — Christians and Muslims — by government and social groups continued to be widespread around the world, with both experiencing sharp increases in the number of countries where they were harassed in 2016. There was also a jump in the number of countries where Jews were harassed in 2016 following a small decrease in 2015.”\nChristians faced discrimination and persecution in 144 nations, a jump of 16 over 2015, the largest increase in the last decade. Muslims suffered in 142 countries, an increase of 17. Jews were harassed in 87, up 13. The antagonism toward Jews is particularly notable since they constitute only .2 percent of the world population. Mistreatment of other faiths also rose, but not as dramatically.\nTo combat persecution, it helps to know what it stems from. In general, there are three sources of mistreatment/hostility. One is communist/former communist/authoritarian regimes. China, Cuba, Laos, North Korea, and Vietnam all purport to carry on Marx’s and Lenin’s legacies. One of those is suppressing, if possible, all private loyalties, especially belief in godly obligations which transcend demands by the state. There are even more former communist states, most notably once part of the Soviet Union or among its Eastern European satellites. Russia combines a tendency toward authoritarianism with Orthodoxy, which typically unites with the resident government when possible.\nThere also is a potpourri of nations — Buddhist and Hindu nationalist, secularist (once Christian Europe), secular-Jewish (Israel), Christian oddities (Fiji, Mexico) — which rank badly on at least one of the two scales. They matter particularly because of India’s size. They also surprise: Europeans who believe in nothing much have been simultaneously targeting Christians and Muslims, though in different ways. And contra Buddhism’s peaceful reputation, its practitioners are as prepared as anyone else to persecute those who believe differently.\nHowever, the most consistent measure of both government restrictions and social hostility is Islam. Of course, not all Muslims treat other people of faith (as well as atheists) badly. But virtually every Muslim nation does so. In some Islamic countries the discrimination is modest: in Kuwait, for instance, Christian churches operate and have a working relationship with the government. However, there is no proselytizing and faiths not “of the Book,” such as Hinduism, have a tougher time. Pew found that Senegal, an African majority-Muslim state, has remarkably few government restrictions or social hostility (the State Department report on religious liberty there is correspondingly brief). But, sadly, Senegal is a lone exception.\nAt the other extreme, Saudi Arabia bans public worship by any other religion and in practice interferes with private worship when discovered. Violence against religious minorities is common throughout the Middle East and in Indonesia, Pakistan, and other majority-Muslim countries. Indeed, 18 of the 25 worst states in terms of government restrictions were Muslim. Six of the nine with the highest social hostility were Muslim. There are few Muslim nations where the state is anything close to neutral and the people are fully accepting.\nWhat to do in response? The U.S. government can highlight abuses with its annual report and prod foreign nations to do better with its special ambassador, currently former Senator and Governor Sam Brownback, the highest profile occupant of that position ever. Washington should make religious liberty part of any human rights dialogue and use any “special relationships,” such as with vicious oppressors Afghanistan and Saudi Arabia, to push for greater respect for freedom of conscience.\nHowever, religious liberty is never likely to be a lead priority for the U.S. government. Geopolitics — aggressive war, nuclear proliferation, Islamic terrorism, energy security, and more — inevitably takes the lead position. That has been evident with Washington’s approach to the Middle East.\nPresident George W. Bush unleashed a wave of murderous persecution with the invasion of Iraq but did nothing to help Christians and other religious minorities who suffered so grievously. The Trump administration has shut off the flow of even Christian refugees to America and apparently said nothing to the Saudis or Emiratis about their oppressive religious practices despite slavishly carrying out their agenda regarding Iran and Yemen. After all, arms merchants have high-price wares to peddle.\nThe responsibility for acting therefore must fall on average people, both as individuals and through churches, activist organizations, and more to make religious liberty a priority. Regimes that persecute should be embarrassed through boycotts and protests. Believers and others of goodwill should use whatever opportunities they have as tourists, athletes, academics, customers, and investors to encourage people in other nations to treat religious minorities with decency, tolerance, and fairness.\nAnd we should do the same in America. The more we practice our own values at home, the more persuasive we will be as advocates for them abroad.\nReligious repression is likely to be ever with us. Persecution is a reality throughout much of the world. Hostility is growing in America. Now is the moment for vigilance and action.\nDoug Bandow is a Senior Fellow at the Cato Institute. A former Special Assistant to President Ronald Reagan, he is author of Beyond Good Intentions: A Biblical View of Politics.","url":"https://spectator.org/religious-persecution-again-rises-worldwide/"}
