{"authors":[],"date_download":"2018-10-30 19:48:37","date_modify":"2018-10-30 19:48:37","date_publish":"2018-08-03 15:30:00","description":"Leon Williams got the maximum sentence possible Friday morning in the drowning death of his adopted autistic son, Kentae, 10.","filename":"data/vaneerConsumption/ReliefafterDeKalbdadgetsmaximumtimefordrowningautisticson.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/05/16/Images/18443742_518649158525270_1008817139848577024_n.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_breaking-dekalb-_c483d32b48f70ada8b4e41ed412ac9d9__1540928917.html","title":"Relief after DeKalb dad gets maximum time for drowning autistic son","title_page":"DeKalb dad gets maximum sentence for drowning adopted autistic son, 10","title_rss":"NULL","source_domain":"ajc.com","text":"Jaire Granderson used to think she could pick out the liar.\nThis was important for a worker at the Division of Family and Children Services, where she helped decide who got to adopt a kid and who didn’t. She looked for dangers in the home, signs of some hidden darkness within the applicants’ hearts, and she thought she could always find such things in another person.\nOn Friday morning, she sat in a DeKalb County courtroom to learn the fate of a man she believes proved her wrong.\nLeon Williams, 44, a former state worker with no prior criminal record, was sentenced to life without parole for killing his adopted son, Kentae. Judge Daniel Coursey Jr. also added 65 years, the maximum possible for the convicted murderer’s various other charges.\nThe boy was 10, autistic, had been in state custody since the day he was born and wanted nothing more than a permanent family. But a few months after Granderson helped oversee the boy’s adoption to Williams, Kentae angered his new dad.\nHe died in scalding bathtub water, prosecutors said, after the dad held Kentae’s head under while lecturing him about acting out in school.\n“He tortured, hurt that kid. He was supposed to give him the most beautiful life,” Granderson said in the hall after the hearing, her eyes glistening. “And he did the complete opposite.”\nEven a year later – and after sitting through the trial –Granderson doesn’t understand how she and so many others could’ve been wrong about Williams.\n‘I fully trusted Leon’\nDefense attorney Daryl Queen spoke softly to the jury at the beginning of the July trial, explaining his client.\nWilliams, Queen said, wanted a son to fill a “void” in his life and decided he had enough love and patience to handle Kentae. Williams had seen the child on a website that connects potential parents with kids in need of adoption, and became interested in the boy, in spite of his autism, communication issues and myriad mental challenges.\nMan Who Adopted 10-Year-Old Autistic Boy Killed Him, Attorney Says\nWilliams and Kentae met at an “adoption party,” a gathering of kids and potential parents, at Stars and Strikes bowling alley and arcade in Henry County. They began building a relationship, under Granderson’s supervision, until the adoption finalized in November 2016.\nGranderson loved Kentae. He called her Mom sometimes. She considered adopting him herself, but that would’ve meant she’d have to quit Fulton County DFCS.\nSo he went to Williams, who held advanced degrees and worked for various state agencies, most recently the Department of Administrative Services. In the apartment off Glen Hollow Drive outside Decatur, Granderson saw nothing to make her worried.\n“I fully trusted Leon,” she recalled. “Finding him a father was the best thing ever.”\nLies and death\nOn Kentae’s last day, April 28, 2017, Williams was angry.\nThe dad had been on Jekyll Island speaking at a conference and heard Kentae got in trouble at school for calling a teacher a name.\nWilliams lied repeatedly when telling police what happended that day, but this much seems not in dispute:\nA neighbor overheard him telling the child he was “going to die tonight” when they were walking into their apartment. Williams was lecturing Kentae about his behavior when the boy went under water in the bathtub and stopped breathing.\nIn homicide cases, there is a common belief that a suspect should be able to produce another suspect if he or she wants to be acquitted. Speaking with DeKalb police, the suspect Williams thought of was Kentae. He told the detectives the child had “self-harming behaviors” and could’ve killed himself.\nThen he admitted he was lying, that he had pushed Kentae under the water for 30 to 45 seconds twice, that it could’ve killed him.\nOn the tape of his conversation with police, Williams was crying hard when he said, “I don’t want to go to jail.”\nRemembering Kentae\nThe fallout from the death hit DFCS quickly. It was yet another case where a child had died after interactions with the agency.\nIt wasn’t just that they’d signed off on the adoption; in early 2017, after Granderson was no longer involved in the case, DFCS was notified of alleged abuse of the boy by Williams.\nThe adoptive father blamed it on Kentae’s self-harming behaviors, and the state let him keep the boy.\nDFCS later fired three workers for allegedly not properly handling the accusations.\nMORE | DFCS sued over homicide drowning Kentae Williams\nGranderson was crushed when she found out Kentae was dead. She knew now she’d missed something in Williams. But if she couldn’t trust a man like him, who could she trust?\nShe’s still trying to find an answer.\n“I don’t second guess myself; it’s more that he’s not the person he portrayed himself to be,” she said. “It makes it so much harder to trust people now because you just don’t know what their motives are, what they’re capable of.”\nWhen she sees someone in the grocery store yelling at their child, she looks at them suspiciously. She finds herself wanting to step in. Sometimes she does.\nAnytime she sees an ambulance or a man who looks even vaguely like Williams, visions of what happened to Kentae come to mind.\nShe tries to fight them off and remember Kentae as she would prefer: that smile and laugh through all the disappointments of a life as a ward of the state and all his troubles.\nSandra Willis, who was Kentae’s foster parent for four years until he was 7, remembers the same things. She remembers the boy as troubled and complex, someone who needed a lot of help.\n“He deserved great parents,” Willis said.\n“He always wanted to hug, hold your hand, sit on your lap, be next to you every second of every day,” Granderson said.\nShe wonders if she’ll ever get over the loss. Or if she’ll be able to trust again.\nAfter the hearing, Granderson stood around the hall with Willis, prosecutor Dalia Racine and others remarking on the sentence, the maximum allowed under the law.\nThey smiled.\nLike DeKalb County News Now on Facebook | Follow on Twitter","url":"https://www.ajc.com/news/local/breaking-dekalb-dad-gets-maximum-time-for-killing-autistic-son/dGtdQ1AlLjZW5rpCHAATWP/"}
