{"authors":["Associated Press"],"date_download":"2018-10-23 05:11:48","date_modify":"2018-10-23 05:11:48","date_publish":"2017-03-10 15:14:14","description":"NEWARK, N.J. (AP) - The leader of the state's largest Roman Catholic archdiocese bowed his head and prayed with a man who entered the U.S. illegally decades...","filename":"data/vaneerConsumption/Religiousleaderheadsefforttohelpmanfacingdeportation.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/23/wire-198597-1489189462-668_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301648_Newark-archbishop-leading-rally-man-facing-deportation_1540271508.html","title":"Religious leader heads effort to help man facing deportation","title_page":"Religious leader heads effort to help man facing deportation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEWARK, N.J. (AP) - The leader of the state's largest Roman Catholic archdiocese bowed his head and prayed with a man who entered the U.S. illegally decades ago before the man walked into a federal building to face possible deportation, a high-profile example of how religious leaders are responding to recent immigration enforcement actions under Republican President Donald Trump.\nCardinal Joseph Tobin, the head of the Newark archdiocese, led a rally Friday to support Catalino Guerrero, portraying him as embodying the human cost of a broken immigration policy. Guerrero, whose immigration issues began before Trump took office this year, was given a 60-day extension to seek a stay of deportation.\nGuerrero, who's from Union City and has four children and four grandchildren, \"puts a face\" to what is often treated as \"statistics or demons,\" Tobin said before the hearing.\nCatalino Guerrero, center left, stands with U.S. Sen. Bob Menendez, left, and Newark Archbishop Cardinal Joseph Tobin, center right, during a rally outside of the Peter Rodino Federal Building before attending an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, is facing deportation. Organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\n\"You can see what Catalino looks like, and you've heard how he has lived,\" Tobin said. \"We're now going to ask the officials determining his fate to not only see his face but ours as well.\"\nThe U.S. Conference of Catholic Bishops has issued a steady stream of criticisms of Trump's restrictions on refugees and immigrants. Other faith groups, including a network of 37 Protestant and Orthodox denominations that work with the aid group Church World Service, are mobilizing their congregations to fight Trump's policies.\nHundreds of houses of worship around the country have joined the sanctuary movement, which provides support or housing to people facing deportation.\nGuerrero, who's 59, came to the U.S. illegally from Mexico in 1991 and has worked consistently and paid taxes, owns his house and has no criminal record, Democratic U.S. Sen. Bob Menendez said. He applied for a work permit several years ago but filled out a form incorrectly and mistakenly applied for asylum, Menendez said.\nA U.S. Immigration and Customs Enforcement spokesman said Guerrero was ordered removed from the U.S. in 2009 and must periodically report to ICE as a condition of his release.\nAttorney Cesar Estela, representing Guerrero, said Guerrero has diabetes and suffered a stroke several years ago. Estela said he will use the extension to file paperwork to seek to put Guerrero on a path to get a green card.\nGuerrero has had his deportation delayed primarily due to his medical condition, Estela said. At a meeting with ICE officials last month, though, Guerrero was told to plan to surrender his passport Friday. Estela said he sought a year's stay of removal for Guerrero on Friday but was denied. The next hearing is May 22.\nAfter leaving Friday's hearing, Guerrero enveloped one of his granddaughters in a hug.\n\"He is a very good man. He has no reason to go back,\" said another granddaughter, 10-year-old Lizbeth Perez, fighting back tears. \"He is not a criminal or anything. I feel really sad that they're doing this to him because he didn't do anything.\"\nMenendez said he hopes Guerrero's case and others like it around the country will spur renewed efforts at immigration reform. Menendez and Democratic U.S. Sen. Cory Booker wrote to the acting head of ICE to ask him to consider Guerrero's case and use the agency's resources on people who pose a safety risk.\n\"I hope President Trump is watching because Catalino Guerrero is not a bad hombre,\" Menendez said, referring to a characterization made by Trump of people who would be targeted for deportation.\nTrump has said his immigration and refugee policies are necessary to protect the nation.\nTobin has been critical of Trump's policies and squared off against Vice President Mike Pence when, as governor of Indiana, Pence wanted to prevent Syrian refugees from settling in the state. Tobin was the archbishop of Indianapolis at the time.\nLast month, Tobin called Trump's executive order temporarily banning immigrants from seven Muslim-majority countries \"misbegotten\" and said it was \"playing on irrational fears of people.\" He said lawmakers should focus on fixing immigration laws rather than on large-scale deportation.\nThrough Catholic Charities and other programs, American bishops consistently resettle the largest number of refugees annually in the U.S. and provide support nationwide for immigrants. Among others leading protests are U.S. Muslim and Jewish groups, including the Union for Reform Judaism, the largest American synagogue movement.\n___\nAssociated Press National Religion Writer Rachel Zoll contributed to this story from New York.\nCatalino Guerrero, center, talks to Newark Archbishop Cardinal Joseph Tobin, right, as U.S. Sen. Bob Menendez, left, looks on moments before Guerrero entered the Peter Rodino Federal Building for an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, is facing deportation. Organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, center, walks with U.S. Sen. Bob Menendez, left, and Newark Archbishop Cardinal Joseph Tobin, center left, during a rally outside of the Peter Rodino Federal Building before attending an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, is facing deportation. Organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, right, hugs his granddaughter Elizabeth Perez, 7, inside Grace Episcopal Church were supporters of Guerrero gathered after his immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, was granted a 60-day extension to seek a stay of deportation. Religious organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, center right, is hugged by a religious organizer during a rally for him at Grace Episcopal Church after his immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, was granted a 60-day extension to seek a stay of deportation. Religious organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, center, walks with U.S. Sen. Bob Menendez, left, and Newark Archbishop Cardinal Joseph Tobin, right, during a rally outside of the Peter Rodino Federal Building before attending an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, is facing deportation. Organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, center, walks with U.S. Sen. Bob Menendez, left, and Newark Archbishop Cardinal Joseph Tobin, center left, during a rally outside of the Peter Rodino Federal Building before attending an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, is facing deportation. Organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, bottom center, is surrounded by family and supporters as they pray at Grace Episcopal Church during a gathering after his immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, was granted a 60-day extension to seek a stay of deportation. Religious organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero pauses while talking to reporters about his experience during an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, was granted a 60-day extension to seek a stay of deportation. Religious organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero, bottom center, is surrounded by family and supporters as they pray at Grace Episcopal Church during a gathering after his immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, was granted a 60-day extension to seek a stay of deportation. Religious organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)\nCatalino Guerrero looks on during a news conference outside the Peter Rodino Federal Building before attending an immigration hearing, Friday, March 10, 2017, in Newark, N.J. Guerrero, who arrived in the U.S. illegally in 1991, is facing deportation. Organizers claim he is an upstanding citizen and should not be deported. (AP Photo/Julio Cortez)","url":"https://www.dailymail.co.uk/wires/ap/article-4301648/Newark-archbishop-leading-rally-man-facing-deportation.html"}
