{"authors":[],"date_download":"2018-10-23 00:47:30","date_modify":"2018-10-23 00:47:30","date_publish":"2016-04-08 00:00:00","description":"Voters in Washington, Ill., talk about their experience surviving and rebuilding after a devastating tornado. FEMA said the city didn't qualify for assistance, based on a complicated formula.","filename":"data/vaneerConsumption/RememberingThe2013TornadoNPR.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=473477565_1540255650.html","title":"Remembering The 2013 Tornado : NPR","title_page":"The View From Washington, Ill.: Remembering The 2013 Tornado : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nNow, on this Friday morning we've been listening to that and other stories on the program from here in Peoria, Ill. We're beginning a project called The View From Here, and this morning, here is I Know You Like a Book, a bookstore in Peoria. And there's been such generosity here. I Know You Like a Book has welcomed us. A local florist has put bluebells - these beautiful purple flowers native to Illinois - on the bookshelves. A local coffee shop brought us coffee - very important. So it's been just wonderful, and we really appreciate it. You know, we just heard that story about faith, and here in the state of Illinois, we've been learning a story about faith in government. And it's a story of what went wrong and how people responded a short distance from this place, in Washington, Ill. In the fall of 2013, a tornado approached that community. Resident Mark Wells (ph) was at home with his daughter and captured the moment on video.\n(SOUNDBITE OF ARCHIVED RECORDING)\nJOSIE WELLS: Don't go out there.\nMARK WELLS: No, not yet.\nJ. WELLS: Don't. Stay here.\nGREENE: The destruction happened in just a matter of seconds, and then he went outside.\n(SOUNDBITE OF ARCHIVED RECORDING)\nM. WELLS: Oh my God, Josie. The neighbors' houses are gone. Damn, I hope nobody's hurt. Don't stay there.\nGREENE: Three people died in that tornado. Hundreds of homes were destroyed or badly damaged. Miraculously, most people escaped unscathed, including that father and daughter and the residents I met this week. They included Kay Grillio (ph) and Patti Hesse (ph).\nKAY GRILLIO: This was our whole neighborhood and a lot of the town. And it was hard - hard to even comprehend all that had happened.\nPATTI HESSE: Well, it's funny because we have all moved on. We really have. We are so grateful for our rebuilding and the way that we did it. But here we are bringing that day back of that devastation that Kay spoke about.\nGREENE: Some residents there of Washington, Ill. Now, the mayor of Washington is Gary Manier, and we spoke to him in city hall. Homes in his neighborhood were destroyed, but his was not.\nGARY MANIER: I feel blessed. And then obviously you go through the guilt of, why not me? You know, why didn't it happen to our house? And I think it was Thursday we had a town hall meeting and I made that statement. And some lady came up to me and said, mayor, if your house was hit, what would you be doing? You know, you wouldn't be worried about all of us. You would be worried about your own home. And I never really looked at it like that. And she kind of said, well, maybe God spared you and your house for reason.\nGREENE: It sounds like you learned a lesson in an leadership in a way, and in how people look to you.\nMANIER: I think that's probably true. Obviously, you know, faith was probably first and foremost in our entire community. Not only did I pray at that town hall meeting and wasn't worried about separation of state and - you know, religion and state at the time because I thought it was important as we came together as community, but I think as the days went on and all of the people that showed up - a lot of them were faith-based organizations that came from all over the place to rake yards and pick up debris\nGREENE: Now, the community was hoping the federal government might help with all of that clean-up, but the Federal Emergency Management Agency, FEMA, said Washington, Ill. did not qualify for help based on this complicated formula. The mayor said President Obama could have offered an exemption but didn't. And the mayor then watched lawmakers talk for months about rewriting the FEMA formula. They did not. Manier doesn't have faith in that other Washington to solve anyone's real problems.\nMANIER: I can tell you what I did learn. People have, you know, said, hey, are you going to run for senator or state rep? And after what I went through, I would want any part of Springfield or D.C.\nGREENE: And in this election cycle, the mayor says he is backing Donald Trump.\nMANIER: I think what Trump's bringing is the heart of America and, you know, make-America-great-again-type thing. So I think he'd look at a community like Washington, Ill., and I think he'd really try to help.\nGREENE: Because he would see the devastation and not care about the rules, the bureaucracy...\nMANIER: Exactly.\nGREENE: He would just say, I'm going to make this happen.\nMANIER: I think he's an independent thinker from that standpoint.\nGREENE: OK, that's Washington, Ill., mayor Gary Manier. And joining me here at the bookstore in Peoria, Kay and John Grillio (ph). You heard Kay's voice a few moments ago. The couple's home was destroyed in the tornado. And I am so sorry for what you have been through the last few years. Thank you for coming in to talk about it.\nJOHN GRILLIO: You're welcome.\nK. GRILLIO: You're welcome.\nGREENE: So your home is rebuilt. I was there. I visited a couple days ago. And I noticed the American flag that is out on the front lawn. That has to be something that is important when you are rebuilding a place so important to you.\nJ. GRILLIO: Well, after 9/11 we put up a very nice flagpole in our front yard and raised the flag. And we flew it every day and have lights on it. And when the tornado, this flagpole went along with everything else. It was just gone - no evidence of it that was left. And so we reinstalled it in roughly the same spot, and we're proudly re-flying American flag. And so it's up 24/7.\nGREENE: Kay?\nK. GRILLIO: The flag's kind of a - I wouldn't say a landmark - that's a little too much - but it's a way in which people would find our house. And that's how they found it before, and now, with so much of the trees gone and all the houses are different, people would call me and say, I can't find your house. And I could say, we still have the - or, the flagpole is back; look for the big flag.\nGREENE: You do notice that as soon as you come to your house. I can see why people sort of know your house in that way. Let me just ask you, Kay, where do you put your faith in a moment of crisis like you've been through?\nK. GRILLIO: Oh, you put your faith in God. That's the only thing that gets you through this kind of thing - first, you know, God. And then the community was phenomenal, and the faith-based groups that came - Catholic Charities. All of the churches in town were places where people could go and receive food and supplies and comfort. It's really phenomenal. We live in a great, great community.\nGREENE: OK, thank you both for coming in and talking about what you've been through, and best of luck as I know the rebuilding in Washington, Ill., continues and goes on today. That is Kay and John Grillio (ph) from Washington, Ill. And we'll be hearing many more poor voices from Peoria and also from around the state of Illinois this morning. We are at I Know You Like A Book, a bookstore in Peoria. It is the first stop in a series we have started on MORNING EDITION, The View From Here. We'll be going to many other places in the country.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=473477565"}
