{"authors":[],"date_download":"2018-10-30 14:34:21","date_modify":"2018-10-30 14:34:21","date_publish":"2015-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/RememberwhenGeorgeBushsranchgotbuzzedbyaUFO.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_flying_the_friendly_lies_1540910061.html","title":"Remember when George Bush's ranch got buzzed by a UFO?","title_page":"Remember when George Bush's ranch got buzzed by a UFO?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Remember when George Bush's ranch got buzzed by a UFO?\nIf what follows sounds like a scene from the sci-fi disaster flick Independence Day, imagine what President George W. Bush must have thought on the night of January 8, 2008 as he contemplated his ranch home in Crawford, Texas. At around 8:00 pm, an enormous, hovering craft with ridiculously bright lights, at least 1,000 feet long (though some witnesses said a mile long), was tracked on multiple radars heading straight for the president's ranch at low speed. The craft lacked a required transponder, was totally unidentified, did not respond to any attempts at communication, and was flying through restricted airspace.\nThe craft had been observed during the previous hour and a half by a multitude of witnesses, including a constable, a former air traffic controller, the chief of police, and a private pilot. It was apparently doing the impossible. The object was alternately hovering, slowly cruising at low altitude, and suddenly accelerating to over 2,000 miles per hour. No known aircraft of any nation is remotely this size or can perform maneuvers like this. The private pilot, Steve Allen, told the local paper that \"[w]e all flipped out. I didn't sleep a wink last night.\" Allen had been at the home of Mike Odom in Selden about 6:15 p.m. when they suddenly noticed flashing lights about \"3,500 feet above ground level.\" Mr. Allen estimated the speed of the craft at \"about 3,000 miles per hour,\" heading toward Stephenville. President Bush must surely have expressed some frustration at the response of the United States Air Force. Later FOIA requests for radar data and flight logs from Carswell Air Station revealed that a squadron of F-16 Fighting Falcons was in the air nearby for 71 minutes during the incident. So was an AWACS surveillance jet, which did loitering figure-8s over the area for four whole hours. Were they tracking the object? Sure. Radar data clearly shows the object being \"skin painted\" by multiple sources. But at no time did the ten F-16s actually intercept the craft or attempt to force it to land. Basically, the unidentified craft was buzzing the Western White House, for reasons wholly unknown. The president must have expressed some chagrin over the laxity of his protection, and that of the public, only seven years after 9/11. At first, the Air Force denied that any jets at all were up in the air at the time in question. Nearly two weeks later, facing a public outcry, spokesman Maj. Karl Lewis had to reverse himself, admitting that there were indeed ten F-16s in the vicinity. \"In the interest of public awareness, Air Force Reserve Command Public Affairs realized an error was made regarding the reported training activity of military aircraft,\" his news release said. And the craft sighting? Oh, it was only the lights from the F-16s themselves, said the Air Force. But where, seven years later, are the pilots who were monitoring, but pointedly not intercepting, the UFO? We haven't heard from any of them. The national media, after only Larry King raised the matter on his nightly CNN show, never expressed so much as a whine of interest in whether the president's house was going to be, or could have been, bombed to smithereens in January of 2008. If you've not heard of this incident, or the Chicago O'Hare sighting above United Gate C-17 of November 2006, or the gonzo flight of Japan Air Lines Flight 1628 above Alaska in 1986, it is because no one in the U.S. media sees fit to cover these cases, or interview the pilots, radar controllers, base commanders, or anyone else about them. There is a conspiracy, all right – one of silence. Time to end it. Christopher S. Carson, formerly with the American Enterprise Institute, holds a master's in national security studies from Georgetown University.","url":"https://www.americanthinker.com/blog/2015/04/flying_the_friendly_lies.html"}
