{"authors":[],"date_download":"2018-10-30 01:08:09","date_modify":"2018-10-30 01:08:09","date_publish":"2015-03-20 00:00:00","description":null,"filename":"data/vaneerConsumption/RememberwhenDemocratssupportedtheIraqWar.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_remember_when_democrats_supported_the_iraq_war_1540861689.html","title":"Remember when Democrats supported the Iraq War?","title_page":"Remember when Democrats supported the Iraq War?","title_rss":"NULL","source_domain":"americanthinker.com","text":"For example, why didn't ISIS exist when we had troops as late as 2011? Is it just a coincidence that ISIS filled the vacuum that our departure created?\nPresident Obama recently said that ISIS is the consequence of our invasion of Iraq. Unfortunately, the interviewer did not challenge him or ask a couple of follow-up questions.\nYesterday was the 12th anniversary of President Bush starting the 2nd Iraq War:\nOn this day in 2003, the United States, along with coalition forces primarily from the United Kingdom, initiates war on Iraq. Just after explosions began to rock Baghdad, Iraq’s capital, U.S. President George W. Bush announced in a televised address, “At this hour, American and coalition forces are in the early stages of military operations to disarm Iraq, to free its people and to defend the world from grave danger.”\nAfter President Bush spoke that night, a bunch of Democrats ran to the microphones and news shows to support the invasion. These are the same Democrats who looked at the information and came to the same conclusion about weapons of mass destruction.\nBy the way, where was Barack Obama that night? I don't know, but he had the luxury of not having to make a decision about the war, unlike Hillary Clinton and John Kerry, who had to vote one way or the other on the issue.\nThe tragedy of the Iraq War is that it was shamefully politicized by Democrats and the postwar period terribly mishandled by President Obama.\nWe did not leave a military force and created the vacuum that ISIS filled and continues to fill.\nWhat if we had walked away from Korea after the 1953 truce? Or Germany after the war ended in 1945?\nThe answer is that we would have lost South Korea to the communists, and Europe would have drifted into chaos and potential intervention of Soviet troops. The bottom line is that the Korean peninsula and Western Europe would have had a very different timeline if we had come home too soon to fulfill some misguided campaign promise.\nThankfully, we had leaders and statesmen like Harry Truman and Dwight Eisenhower, who saw the big picture rather than just telling people what they wanted they hear.\nWhat's worse than a war? The answer is ending a war irresponsibly, as President Obama did with Iraq.\nLast but not least, we remember today the sacrifice of the soldiers and their families, especially those who were killed.\nOne of these young men was Nathan Aguirre, from our community and church.\nP.S. You can hear my show (CantoTalk) or follow me on Twitter.","url":"https://www.americanthinker.com/blog/2015/03/remember_when_democrats_supported_the_iraq_war.html"}
