{"authors":[],"date_download":"2018-10-22 22:23:15","date_modify":"2018-10-22 22:23:15","date_publish":"2014-05-09 23:37:45","description":"The former 'Three's Company' star recently was inducted into the Direct Response Hall of Fame for her infomercial success.","filename":"data/vaneerConsumption/RemembertheThighMasterSuzanneSomerswinshonors.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_remember-thighmaster-suzanne-somers-wins-honors-n101961_1540246995.html","title":"Remember the ThighMaster? Suzanne Somers wins honors","title_page":"Remember the ThighMaster? Suzanne Somers wins honors","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBack in 1977, Suzanne Somers was one of the most famous women in Hollywood. The then-31-year-old, sexy star of \"Three's Company\" played Chrissy Snow, a ditzy blonde. Somers, however, was not ditzy. Even back then, she was thinking like an entrepreneur.\n\"The character Chrissy was so huge,\" she said. \"I went to the producers, and I said, 'You know, this character is so flamboyant ... we should merchandise her. We should sell Chrissy hot pants and T-shirts and snap-on ponytails.' \"\nThese days studios are constantly looking for new revenue streams for their \"content,\" but Somers was ahead of her time. She also broke ground demanding to be paid salaries similar to those of male TV sitcom stars, which led to an acrimonious firing by ABC.\nBest thing that ever could have happened to her.\nAfter leaving network television, Somers worked in Las Vegas for a while. It was a grueling schedule. So she and her husband, Alan Hamel, decided to start branding products she could sell and create passive income.\nIn 1990, they began selling the ThighMaster, and the rest is infomercial history. Somers' empire of books and products aimed at helping women has made her far more successful than if she'd stayed in acting. \"At one time we were manufacturing over a thousand products,\" Somers said, adding that she stopped counting how many ThighMasters sold \"after 10 million.\"\nLast week in San Diego, Somers was inducted into the Direct Response Hall of Fame. \"Direct response\" is another name for an infomercial, which, technically, is a program that explains and demonstrates what a product does and then requires a direct response from you, the consumer — either call or go online and make your purchase.\nHer secret to successful selling?\n\"Always tell the truth,\" she replied. \"The public is smart, and they can smell BS.\"","url":"https://www.nbcnews.com/business/business-news/remember-thighmaster-suzanne-somers-wins-honors-n101961"}
