{"authors":[],"date_download":"2018-10-22 21:16:53","date_modify":"2018-10-22 21:16:53","date_publish":"2014-05-06 18:27:45","description":"Jack Agüeros, a longtime advocate of New York City's Puerto Rican and Latino community and a force behind El Museo del Barrio, passed away.","filename":"data/vaneerConsumption/RememberingJackAguerosaPuertoRicanTrailblazer.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/424196/140506-jack-agueros-240p_6e667423fea753f71de60442411d27d6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_remembering-jack-agueros-puerto-rican-trailblazer-n98441_1540243013.html","title":"Remembering Jack Agueros, a Puerto Rican Trailblazer","title_page":"Remembering Jack Agueros, a Puerto Rican Trailblazer ","title_rss":"NULL","source_domain":"nbcnews.com","text":"NEW YORK, NY --The children who bask in the annual Three Kings Parade in New York City's El Barrio and the tourists who visit El Museo del Barrio might not know Jack Agüeros' name, but many Puerto Ricans and New York City Latinos remember him as a key figure in both of those New York City institutions.\nJack Agüeros, a former director of El Museo del Barrio, as well as a poet, writer,translator and community activist, passed away Sunday, May 4th. He was part of a generation of Puerto Ricans in New York who pushed for increased representation in city government, and went on a five-day hunger strike in 1968 until city leaders met some of his demands, as New York Times' David Gonzalez reports.\nAgüeros was also the driving force behind ensuring El Museo del Barrio's current Fifth Avenue location in Manhattan, at the end of Museum Mile, and insisted the Museum expand beyond Puerto Rican and Caribbean art into Latin American art. “We are too culturally rich to force ourselves into ghettos of narrow nationalism,” Agüeros said in 1978, according to Gonzalez.","url":"https://www.nbcnews.com/news/latino/remembering-jack-agueros-puerto-rican-trailblazer-n98441"}
