{"authors":[],"date_download":"2018-10-30 17:55:04","date_modify":"2018-10-30 17:55:04","date_publish":"2018-09-10 15:57:00","description":"Around metro Atlanta on Tuesday, there are memorial services, commemorations and tributes planned for the 2018 Sept. 11 anniversary.","filename":"data/vaneerConsumption/Remembering911AroundupofmetroAtlantaeventsceremonies.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/KRMG/2018/09/05/Images/Flag.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_metro-atlanta-cities-host-events-remembring__1540922104.html","title":"Remembering 9/11: A roundup of metro Atlanta events, ceremonies","title_page":"Remembering 9/11: A roundup of metro Atlanta events, ceremonies","title_rss":"NULL","source_domain":"ajc.com","text":"Nearly 3,000 people died on Sept. 11, 2001 when terrorists hijacked four commercial planes and crashed them in New York City, Washington D.C. and Stonycreek Township, Pennsylvania.\nAnd 17 years later, people across the United States are remembering and honoring those who perished in the attacks.\nAround metro Atlanta on Tuesday there are memorial services, commemorations and tributes planned for the anniversary.\nRoswell\nThe city and its rotary club will host a memorial service beginning at 8:30 a.m. at the Mike Gann memorial by the Roswell Area Park Lake. The event’s keynote speaker is Travis Ellis, a Georgia native who co-founded Shepherd’s Men, which works to prevent suicide among veterans. Mayor Lori Henry, police chief Rusty Grant and fire chief Ricky Burnette will also speak.\nMilton\nStudents at Milton High School have planted flags containing the names of victims from the 9/11 attacks. At 7:30 a.m. Tuesday, students and community leaders will gather to remember the victims. Milton fire and police personnel are expected to attend. First responders will share their stories.\nMarietta\nThe VFW and Auxiliary Post 2681 will gather at Marietta Square from 11 a.m. to 1 p.m. on Tuesday for a “We Remember” salute. An honor guard will present the colors and the keynote speaker is John F. Gwizdak, the former Veterans of Foreign Wars commander for Georgia. The event will feature other speakers and presentations.\nSmyrna\nThe city’s police and fire departments are co-hosting a remembrance ceremony at the 20th Century Veterans Memorial in downtown Smyrna at 8:30 a.m. Speakers at the event include public safety and elected officials. It will also feature an honor guard presentation and live music.\nLawrenceville\nThe Gwinnett County Department of Fire and Emergency Services will host its 9/11 remembrance ceremony at 8:30 a.m. Tuesday at the Gwinnett Fallen Heroes Memorial, located in the front parking lot of the Gwinnett Justice and Administration Center in Lawrenceville. The event will include a presentation of colors and a ceremonial wreath laying. Local officials and representatives from public safety agencies will share remarks and reflections.\nTucker\nAt 8:46 a.m. on Tuesday — the time the first plane hit the North Tower of the World Trade Center — the DeKalb County Fire Rescue and Police Departments will honor the 9/11 anniversary in the courtyard of the DeKalb County Public Safety Complex. A wreath will be laid, a moment of silence will be held and the national anthem and “America the Beautiful” will be played.\nRome\nGeorgia Highlands College will be hosting a “Tomb of the Unknown Soldier” exhibit on the Floyd campus in the Lakeview Building Art Gallery on Tuesday and Wednesday, from 8 a.m. to 5:30 p.m. The display is open to the public. The replica of the tomb was created by local Rome artist Chuck Schmult and it has been shown around the country to more than 10,000 people during a tour that spanned six states.\nJohns Creek\nThe city will host an event beginning at 8:30 a.m. at the Mark Burkhalter Amphitheater. Public safety officials will speak and the Autrey Mill Middle School Choir will perform. Donations will be accepted for the Johns Creek Public Safety Foundation.\nREAD | Here’s how first responders get into Legoland Atlanta free this month\nREAD | Sandy Springs alters noise ordinance, limiting hours of construction\nREAD | Roswell Mill project expected to be complete by November\nREAD | Verizon study: Alpharetta among best cities to start a small business\nLike North Fulton County News Now on Facebook | Follow on Twitter\n﻿MORE...","url":"https://www.ajc.com/news/local/metro-atlanta-cities-host-events-remembring/sN9EhbHl3rJeS3DmMqAwKN/"}
