{"authors":[],"date_download":"2018-10-30 20:34:15","date_modify":"2018-10-30 20:34:15","date_publish":"2015-01-28 16:44:00","description":"It's been one year ago today since a paralyzing January storm blew through the metro Atlanta area, catching many residents -- and officials -- off guard.","filename":"data/vaneerConsumption/RememberingSnowJam2014Bythenumbers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/10/Images/photos.medleyphoto.10100427.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_remembering-snow-jam-2014-the-numbers__1540931655.html","title":"Remembering Snow Jam 2014: By the numbers","title_page":"Remembering Snow Jam 2014: By the numbers","title_rss":"NULL","source_domain":"ajc.com","text":"A paralyzing January storm blew through the metro Atlanta area in 2014, catching many residents -- and officials -- off guard.\nThe story of that weather, which stranded motorists and froze interstates, was actually a story of many stories: of government responses, of hours-long commutes, of snow and ice and freezing cold.\nChannel 2 Chief Meteorologist Glenn Burns reports (www.accessatlanta.com)\nHere is the simplest story of Snow Jam 2014: a look the numbers.\nNine: How many hours after the Weather Channel first upgraded its winter storm warning for metro Atlanta (3:38 a.m) that the snow first started falling (12:30 p.m.)\nMore than 1,200: How many traffic accidents were reported, according to CBS News\nFive: How many hours after the first snow fall that Gov. Nathan Deal declared a state of emergency (5:28 p.m.)\n2.3: How many inches of snow fell, according to CNN meteorologist Chad Myers\nAlmost 18: How many hours before traffic returned to normal\n11 hours and 20 minutes: How long it took one AJC photographer to get home\n\"More than 500\": How many cars one wrecking service said it towed following the storm\nAt least $10 million: Value of the property losses, including damaged cars and burst pipes\nAbout 1,000: How many homeowners filed insurance claims, according to the state's insurance commissioner\n$69,500: How much Cobb County paid out for overtime to emergency workers and transportation workers, as well as in gravel and salt\n$2,766: How much Cherokee County paid out for food to feed stranded students\n\"Authorities had no estimate\": How many people were stranded, according to NBC News\nMore related news:","url":"https://www.ajc.com/weather/remembering-snow-jam-2014-the-numbers/xGVwkyBhoebgNaTAmfGfUO/"}
