{"authors":["Press Association"],"date_download":"2018-10-23 02:54:37","date_modify":"2018-10-23 02:54:37","date_publish":"2016-01-11 15:19:01","description":"Boss Remi Garde hopes Aston Villa owner Randy Lerner and chief executive Tom Fox will break their silence soon. The manager also insisted he understands supp...","filename":"data/vaneerConsumption/Remigardecallsonrandylernerandtomfoxtospeakupforastonvilla.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-5a85e33d-5be0-4524-81d8-93d3d931ef41-48qEJGFphM8d437f0aaf92641ee0-432_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393828_Remi-Garde-calls-Randy-Lerner-Tom-Fox-speak-Aston-Villa_1540263277.html","title":"Remi garde calls on randy lerner and tom fox to speak up for aston villa","title_page":"Remi garde calls on randy lerner and tom fox to speak up for aston villa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Remi Garde calls on Randy Lerner and Tom Fox to speak up for Aston Villa\nBoss Remi Garde hopes Aston Villa owner Randy Lerner and chief executive Tom Fox will break their silence soon.\nThe manager also insisted he understands supporters' anger after he and the players were mercilessly abused by fans.\nGarde revealed he has asked owner Lerner to talk to the fans - and believes he will speak soon - with the club in disarray and fury spilling over with Villa bottom of the Barclays Premier League.\nAston Villa's Micah Richards, right, speaks to furious fans during their 1-1 FA Cup draw at Wycombe\nGarde and the squad were abused as they boarded the coach after Saturday's 1-1 FA Cup draw at Wycombe, while Micah Richards also spoke to supporters to calm tensions during the game.\nAmerican Lerner has barely spoken to the media in five years and Garde expects he and chief executive Tom Fox, who is in New York to hold talks with Lerner about the club's January transfer plans, to address Villa's situation.\nHe said: \"This is something I asked from them a fortnight ago, or something like that. Not to take the pressure off me - if I didn't want the pressure I wouldn't have this job.\n\"It's more because I'm facing you (the media) every week but actually I know Villa from inside for only 10 weeks now.\n\"At some point I cannot explain and I am not in the position to judge what happened before and whether it was right or wrong because I wasn't here.\n\"At some point it is important that the Aston Villa voice is not only mine.\n\"This is not to avoid my responsibilities at all. I will do it as long as I am in this position at this club.\"\nVilla host Crystal Palace on Tuesday marooned at the bottom of the league and 11 points from safety.\nThey are seven points behind second bottom Sunderland and tensions boiled over after Villa failed to beat League Two Wycombe on Saturday.\nVideos of the manager and players being abused after the game were posted on social media while substitutes Brad Guzan and Joleon Lescott were also accused of playing a game involving chewing gum during the match.\nGarde tried to move on from the weekend but conceded he expected the reaction.\nHe said: \"I know football, in every country it's the same. I understand completely the fans' frustration. I am not surprised because I know that from situations from different clubs I have played and worked for.\"\nThe boss said he was not aware of the reported issue with Lescott and Guzan but reminded all players of their responsibilities.\nHe added: \"What I can say is, as a professional player, you need to behave in the right way with respect for everybody. It doesn't matter if you are top of the table or bottom. It's just a question of being respectful to everybody.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393828/Remi-Garde-calls-Randy-Lerner-Tom-Fox-speak-Aston-Villa.html"}
