{"authors":["Laurie Whitwell For The Daily Mail"],"date_download":"2018-10-23 02:30:29","date_modify":"2018-10-23 02:30:29","date_publish":"2016-01-11 14:43:26","description":"Aston Villa boss Remi Garde has asked owner Randy Lerner to speak out and explain some of the reasons behind the club's catastrophic season.","filename":"data/vaneerConsumption/RemiGardecallsonownerRandyLernertobreakhissilenceoverAstonVillasfuture.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/2FF29FC400000578-0-image-a-56_1452523318956.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394026_Aston-Villa-boss-Remi-Garde-calls-owner-Randy-Lerner-break-silence-club-s-future_1540261829.html","title":"Remi Garde calls on owner Randy Lerner to break his silence over Aston Villa's future","title_page":"Remi Garde calls on owner Randy Lerner to break his silence over Aston Villa's future | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Aston Villa boss Remi Garde has asked owner Randy Lerner to speak out and explain some of the reasons behind the club's catastrophic season.\nLerner is set to make a rare public statement in the coming days to take some of the focus off the Frenchman, who was heckled by fans in the 1-1 FA Cup draw at Wycombe.\nGarde is understood to feel uncomfortable answering questions on issues that pre-date his two-month tenure or on how the club is prepared to approach the January transfer window.\nRemi Garde has called on Aston Villa owner Randy Lerner to break his silence over the club's future\nThe club's American owner Lerner has barely spoken to the media in the past five years\nOn Monday, Lerner held a meeting in New York with chief executive Tom Fox and sporting director Hendrik Almstadt, with Garde desperate for funds to attract players who can improve Villa's disastrous form. Lerner is expected to address these matters.\n'This is something I asked from the board a fortnight ago,' said Garde. 'Not to take the pressure off me — if I didn't want the pressure I wouldn't have this job. It's more because I'm facing journalists every week but actually I know Villa from inside for only 10 weeks. I cannot explain, and am not in the position to judge, what happened before.\n'It is important for now that the Aston Villa voice is not only mine. This is not to avoid my responsibilities. I will do it as long as I am in this position at this club. But I feel you need to explain some things at some point in your history. I don't have all the answers to those questions about Villa.'\nLerner has not made a public announcement since putting the club up for sale in May 2014, though he gave a newspaper interview ahead of last season's FA Cup final.\nGarde, who took over from Tim Sherwood in early November, is yet to win in 10 games in charge and will face further scrutiny from supporters at Villa Park during tonight's visit of Crystal Palace.\nFans have discussed holding a protest before the Barclays Premier League game, with Villa on course for relegation with a miserly eight points from 20 games. Some fans are planning to meet in the North Stand car park by the players' entrance to chant their displeasure, with Lerner the primary target after five seasons of struggle.\nBut a large-scale demonstration seems a faint possibility and even a repeat of the ugly scenes witnessed at Adams Park is unlikely, as the home crowd have generally been more tolerant of their team's dire situation.\nGarde expects Lerner and chief executive Tom Fox to address the club's perilous situation\nGarde and the squad were abused as they boarded the coach after Saturday's 1-1 FA Cup draw at Wycombe\nGarde has told his squad to be respectful of the club's followers after a group was incensed at the Wycombe tie by Brad Guzan and Joleon Lescott allegedly joking around on the substitutes' bench, engaging in a bizarre chewing gum spitting contest.\n'What I can say is as a professional player you need to behave in the right way with respect for everybody,' said Garde. 'It doesn't matter if you are top of the table or bottom of the table.'\nGarde will take a hard line with players who refuse to engage with the team ethic and wants backing to get rid of those who fail to knuckle down.\nMicah Richards spoke to some of Villa's travelling supporters to calm tensions during the game\nHe plans to talk to Gabriel Agbonlahor, who is currently out with a back problem. Garde will listen to offers for the 29-year-old striker in a bid to raise funds to bring in his own recruits. 'Like every player under contract in this club they have to be prepared to play, but I have to see that they are fully committed to the team and that they want to help,' said Garde.\n'They have to not only say that but to have the behaviour every time to show that.'\nMicah Richards is expected to recover from his foot injury to start against Palace but Jack Grealish will be out as he continues his medication to get over tonsillitis.","url":"https://www.dailymail.co.uk/sport/football/article-3394026/Aston-Villa-boss-Remi-Garde-calls-owner-Randy-Lerner-break-silence-club-s-future.html"}
