{"authors":[],"date_download":"2018-10-30 14:38:53","date_modify":"2018-10-30 14:38:53","date_publish":"2018-09-14 12:30:00","description":"Preview: “Treasures From the Frederic Remington Art Museum and Beyond” at Booth Western Art Museum in Cartersville, Ga. through Jan. 13, 2019","filename":"data/vaneerConsumption/RemingtonexhibitatBoothMuseumrealityandlegend.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/14/Images/newsEngin.23009991_Remington---Red-Cloud-Buttes-north-of-Fort-Robinson-Nebraska--00-U16324312363xBi-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_d3e07b5774f4270eb8f85c4aad8354d9__1540910333.html","title":"Remington exhibit at Booth Museum: reality and legend","title_page":"Preview: Frederic Remington exhibit at Booth Western Art Museum","title_rss":"NULL","source_domain":"ajc.com","text":"Like the Wild West itself, Frederic Remington was a mix of legend and reality, but as they said in “The Man Who Shot Liberty Valance,” “This is the West, sir. When the legend becomes fact, print the legend.”\nRemington (1861-1909) painted, sculpted and printed the legend. His scenes of Indian scouts, Buffalo Soldiers, cowboys and campfires are the way we remember the vanishing frontier.\n“Buffalo Hunter Spitting a Bullet Into a Gun” demonstrated Frederic Remington’s familiarity with the Old West. It’s among the 70 paintings, sculptures and artifacts that are on display at the Booth Western Art Museum in an exhibit titled ‘Treasures From the Frederic Remington Art Museum and Beyond.” CONTRIBUTED BY BOOTH WESTERN ART MUSEUM\nSome 70 of those paintings, sculptures and personal Remington artifacts are currently on display at the Booth Western Art Museum, in an exhibit titled “Treasures From the Frederic Remington Art Museum and Beyond.” The exhibit runs through Jan. 13, 2019. Hurricane evacuees get in free.\nMost of the work was loaned by the Remington Art Museum in Ogdensburg, N.Y., the border town that was Remington’s boyhood home.\nThat town is not far from Canada, and about six hours from New Rochelle, the posh New York City suburb where Remington moved at age 29. His enjoyment of city pleasures contributed to a life-threatening obesity — he weighed nearly 300 pounds when he died, at age 48, of a burst appendix.\nHis rotund shape didn’t square with his image as a rough-riding explorer, and, in fact, Remington lived most of his life in the cosseted confines of the city.\nFrederic Remington journeyed through the Western frontier as a young man, but stayed in the East for most of his adult life. CONTRIBUTED BY BOOTH WESTERN ART MUSEUM\nOn the other hand, as a young man, Remington spent several years in the West, determined to start a cattle ranch in Montana, then trying various enterprises in Kansas, including a sheep farm, then a hardware store, then a saloon. All along, he continued to sketch images and write stories about his experiences.\nFailing at these businesses, he returned east to become an illustrator. As his profile grew, he made several more forays to Indian country, writing and illustrating stories for Harper’s magazine about the U.S. government’s war against Geronimo, and providing illustrations for his friend Theodore Roosevelt’s book on ranching in the West.\nBy the time he was chosen to ride along with Roosevelt to report on the Spanish-American War for a newspaper owned by William Randolph Hearst, “he was getting disillusioned about the West becoming developed and civilized and not being the romantic place he remembered,” said Seth Hopkins, executive director at the Booth.\nHe was also numbed by the large-scale carnage of the war, said Hopkins. “It kind of punched a hole in his idea of the glamour of war and the gallantry of soldiering.”\nWhile his reality didn’t match the unpolished cowboy image that he affected, Remington had firsthand knowledge of the region.\n“The Bronco Buster” was Frederic Remington’s first and most famous sculpture, a medium in which he did not experiment until late in his career, after thousands of paintings and illustrations. CONTRIBUTED BY BOOTH MUSEUM OF WESTERN ART\nHe is known today as a sculptor of bronzes, a medium he adopted late in his career. His first sculpted work, “The Bronco Buster,” became his most popular, and the Booth Museum has three versions in the exhibit, showing three different levels of detail.\nThe sand-cast version is good while the lost-wax version is great, said Hopkins. The third copy is a modern reproduction, and while you can see veins beneath the skin on the hand in Remington’s lost-wax casting, in the modern version the hand “looks like a chunk of melted chocolate.”\nAlso in the exhibit is a re-creation of Remington’s studio, which was festooned with baskets, war bonnets, buckskin shirts and other artifacts of the West that he kept around for inspiration. The Booth’s re-creation includes several items that actually belonged to Remington, including a bear-claw necklace and an Apache blanket.\nIn that mock-up studio is a real Remington painting, the last one he was working on when he died, a nocturnal scene around a campfire that Remington scholars call “The Cigarette.”\nThis recreation of Frederic Remington's studio is part of an extensive exhibit of Remington's art at the Booth Museum in Cartersville . CONTRIBUTED: THE BOOTH MUSEUM OF WESTERN ART\nIt shows a bit of the impact of the impressionists on Remington’s style. “He was consciously headed in that direction with his painting in the last three or four years of his life,” said Hopkins. “If he’d lived another five or 10 years, he’d have been another Claude Monet — that’s where his painting was developing.”\nRemington was hoping for acceptance as not just a Western artist but as an artist, full stop. “And he was just about ready to declare victory,” said Hopkins. “He was achieving his life’s goal, when his life ended.”\nEXHIBIT PREVIEW\n“Treasures From the Frederic Remington Art Museum and Beyond”\nThrough Jan. 13, 2019. Open 10 a.m.-5 p.m. Tuesdays-Wednesdays and Fridays-Saturdays; 10 a.m.-8 p.m. Thursdays; 1-5 p.m. Sundays. $12; 65 and older, $10; students, $9; 12 and younger, free. Booth Western Art Museum, 501 Museum Drive, Cartersville. 770-387-1300, boothmuseum.org.","url":"https://www.ajc.com/entertainment/arts--theater/remington-exhibit-booth-museum-deals-reality-and-legend/mk1Tl9qIxPdyWcQjHk31jI/"}
