{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:48:16","date_modify":"2018-10-30 22:48:16","date_publish":"2016-05-03 08:00:00","description":"Our Partners Budgeting from the Blacktop - KQED A Day With a Sixth Grader - KQED One School's Unique Program Faces Uncertainty - KQED Is Extra Funding","filename":"data/vaneerConsumption/RemindingJerryBrownofJerryBrown.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/3-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939696.html","title":"Reminding Jerry Brown of Jerry Brown","title_page":"Reminding Jerry Brown of Jerry Brown | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"More than 50 civil rights and education reform groups are using Jerry Brown to remind Jerry Brown of his pledge to help black and Latino students following an interview with CALmatters in which he suggested that disparities will persist despite government intervention.\nIn a letter dated May 3, dozens of advocacy groups asked Brown to recommit to closing the academic achievement gap for high-need students as he considers an opening on the State Board of Education and a new plan for measuring school performance later this year.\n“California’s continued prosperity hinges on how well we educate our students,” the letter reads. “As you’ve clearly stated, the risks of not doing so are far too great.”\nCivil rights, education groups respond to Gov. Brown\nDuring his interview, Brown had said he hopes his signature education policy, the Local Control Funding Formula, will help some students improve by sending more money to schools with students who don’t speak English or come from low-income families. But he said, “the gap has been pretty persistent. So I don’t want to set up what hasn’t been done ever as the test of whether LCFF is a success or failure.”\nThat left many worried that the governor and the people he appointed to the state school board aren’t prioritizing low-income and English-learner students because some are destined to be waiters and window washers.\n“We are troubled by the suggestion that achievement and opportunity gaps are acceptable, and exist because of individual differences and meritocracy,” the letter stated.\nIt was signed by social justice groups like Californians for Justice and The Greenlining Institute, as well as education advocates like Ed Voice and Students Matter pushing for greater school and teacher accountability.\nThey reminded the governor of his pledge when he signed the school funding overhaul and in his 2013 State of the State address where he warned the perils of failing to educate children: “we will sow growing social chaos and inequality that no law can rectify.”\nMichael Kirst, president of the State Board of Education, recently defended the governor, saying the system-wide transformation is designed to help low-achieving students be ready for college or a career.\n“At the core of the change are higher academic standards for all students, regardless of their achievement level, socioeconomic status, ethnicity or family background,” Kirst wrote.","url":"https://calmatters.org/articles/letter-to-gov-brown-on-equity-and-gaps/"}
