{"authors":["Scott Detrow"],"date_download":"2018-10-22 21:18:57","date_modify":"2018-10-22 21:18:57","date_publish":"2016-06-13 00:00:00","description":"\"The only reason the killer was in America in the first place is because we allowed his family to come here,\" Donald Trump said on Monday.","filename":"data/vaneerConsumption/RenewsCallForMuslimImmigrationBanAttacksHillaryClintonNPR.json","image_url":"https://media.npr.org/assets/img/2016/06/13/gettyimages-539920698_wide-c29be5830e02ac2689609777b86f3d942d80ab1c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_06_13_481910989_trump-expands-immigration-ban-to-countries-with-proven-history-of-terrorism_1540243137.html","title":"Renews Call For Muslim Immigration Ban, Attacks Hillary Clinton : NPR","title_page":"Donald Trump On Orlando Shooting: Renews Call For Muslim Immigration Ban, Attacks Hillary Clinton : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Calls To Ban Immigration From Countries With 'Proven History Of Terrorism'\nEnlarge this image toggle caption Darren McCollester/Getty Images Darren McCollester/Getty Images\nResponding to the Orlando shootings in a New Hampshire speech Monday, presumptive Republican presidential nominee Donald Trump used the appearance to expand on his previous call to temporarily ban all Muslims from immigrating to the United States.\n\"The only reason the killer was in America in the first place is because we allowed his family to come here,\" Trump said. \"That is a fact, and a fact we need to talk about.\"\nThat policy proposal, one of the main planks of Trump's campaign, would not have stopped Omar Mateen, the man allegedly responsible for the deadliest mass shooting in United States history. Mateen was born in New York City and was a U.S. citizen.\nTrump's proposed temporary ban on Muslim immigration would also have not affected one of the two perpetrators of the December 2015 mass shooting in San Bernardino. Syed Farook was born in the United States, although his wife, Tashfeen Malik, was born in Pakistan.\n\"I called for a ban after San Bernardino and it was met with great scorn and anger,\" Trump said, before appearing to change the terms of his proposal. \"When I am elected, I will suspend immigration from areas of the world when there is a proven history of terrorism against the United States, Europe, or our allies, until we understand how to end these threats.\"\nTrump also criticized \"Muslim communities,\" as he put it, for failing to tell law enforcement agencies about potential terrorist threats.\n\"They have to work with us,\" Trump said. \"They know what's going on. They know that [Mateen] was bad. They knew the people in San Bernardino were bad. But you know what, they didn't turn them in. and we had death and destruction.\"\nTrump's speech came shortly after his fall opponent, presumptive Democratic nominee Hillary Clinton, delivered her own address responding to the Orlando shootings. In her speech Clinton did not name Trump himself but spoke out against \"inflammatory anti-Muslim rhetoric.\"\nReferencing the days after the Sept. 11, 2001, attacks, Clinton recalled President George W. Bush's visit to a Muslim community center. \"To anyone who wanted to take out their anger on our Muslim neighbors and fellow citizens, he said, that would not and should not stand in America.\"\n\"It is time to get back to the spirit of those days,\" Clinton said.\nTrump repeatedly criticized existing immigration policies as dangerous and ineffective. \"Our government has been admitting ever-growing numbers [of Middle Eastern immigrants], year after year, without any effective plan for our security.\"\nTrump said that allowing more Syrian refugees to enter the United States \"could be a better, bigger version of the legendary Trojan horse.\"\nIn fact, as NPR reported in the wake of last year's Paris terrorist attacks, screening for refugees is a lengthy process that can take up to two years to complete.","url":"https://www.npr.org/2016/06/13/481910989/trump-expands-immigration-ban-to-countries-with-proven-history-of-terrorism"}
