{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:10:58","date_modify":"2018-10-30 20:10:58","date_publish":"2015-01-24 01:11:04","description":"In an exclusive interview with conservative and Christian advocate Professor Robert George at the Students for Life conference Friday, George told Breitbart News the recent failure of the House Republican leadership to pass the Pain Capable Unborn Child Protection Act was nothing less than “a tragedy.” |","filename":"data/vaneerConsumption/ReneeEllmersShouldBePrimaried.json","image_url":"https://media.breitbart.com/media/2015/01/Elmers-McCarthy-J.-Scott-Applewhite-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_23__1540930258.html","title":"Renee Ellmers Should Be Primaried","title_page":"Robert George: Renee Ellmers Should Be Primaried","title_rss":"NULL","source_domain":"breitbart.com","text":"In an exclusive interview with conservative and Christian advocate Professor Robert George at the Students for Life conference Friday, George told Breitbart News the recent failure of the House Republican leadership to pass the Pain Capable Unborn Child Protection Act was nothing less than “a tragedy.”\nGeorge, who received the 2015 Defender of Life Award by Students for Life of America during the organization’s conference in the Washington, D.C. area, said the bill “was a wonderful opportunity to actually defend the lives of unborn babies and to begin rolling back the abortion laws.”\nThe holder of the McCormick Chair in Jurisprudence at Princeton University, founding director of the James Madison Project, and founder of American Principles Project, George, like many pro-life conservatives, observed the failure of Rep. Renee Ellmers (R-NC) to live up to the pro-life pledge she made to her constituents. Ellmers led a group of Republicans in a successful attempt to have the bill pulled from a vote by the House.\n“My understanding is that Rep. Ellmers voted for exactly the same bill last year,” George asserted. “I see no justification for the position that she took, especially for someone who has represented herself as pro-life, and who has accepted money from pro-life donors precisely because of her pledge to support the pro-life cause.”\n“I think this is, if I can use the term in the political sense, ‘unforgiveable,’” he continued. “So I hope that she will be subjected to a strong primary challenge in the next election by someone who is genuinely pro-life and that our movement to protect the lives of unborn children at all stages and in all conditions will now move forward.”\nAt the Students for Life conference, George told pro-life leaders that he tells his students, “It’s a tragedy that they live at a time when an innocent child can be literally torn limb from limb in his or her mother’s womb,” and that “we live in a culture that has allowed that to happen.”\nGeorge added, however, that members of the pro-life community should feel “honored that God has placed us in a position at a time when we can stand up for the greatest cause – we can serve the greatest cause of mankind – and that is the cause of the profound dignity of every member of the human family.”","url":"https://www.breitbart.com/politics/2015/01/23/exclusive-conservative-professor-robert-george-states-renee-ellmers-should-be-subjected-to-strong-primary-challenge/"}
