{"authors":[],"date_download":"2018-10-30 01:05:00","date_modify":"2018-10-30 01:05:00","date_publish":"2017-04-06 00:00:00","description":null,"filename":"data/vaneerConsumption/RenewedattacksonGorkahaveearmarksofSovietpropagandaplaybook.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_renewed_attacks_on_gorka_have_earmarks_of_soviet_propaganda_playbook_1540861500.html","title":"Renewed attacks on Gorka have earmarks of Soviet propaganda playbook","title_page":"Renewed attacks on Gorka have earmarks of Soviet propaganda playbook","title_rss":"NULL","source_domain":"americanthinker.com","text":"After disgracing itself once with its thoroughly discredited attack on Dr. Sebastian Gorka last month, getting egg all over its face, The Forward, incredibly, has leaped back up for more dishonor, like a swamp thing flinging itself up from its ooze again to spray its slime of lies all over.\nLast March, The Forward tried to smear Dr. Gorka as an anti-Semitic closet Nazi, citing an old Hungarian pin he wore in honor of his father, a leading freedom-fighter from Hungary's 1956 uprising against Soviet barbarism, and the claim of some standing Nazi (they call that a credible source?) who admits he never met the man but says he heard from someone else that Gorka had a relative who swore eternal fealty to Nazi principles or something like that. And they reported this as straight news! Naturally, the Jewish people who knew Dr. Gorka stepped forward and called it for the garbage it was.\nNow The Forward is back with more grotesquely false attacks, not the least bit concerned about its reputation. They've cooked up a heavily spliced and edited news video, dating from 2006, when Dr. Gorka was a Hungarian citizen in Hungary. At the time, he correctly defended the principle of citizen militias in the face of a broken-down, tumble-down military, which afflicted then-socialist Hungary at the time. Yet Gorka carefully separated Nazi actions and the nationalist fervor of a couple of far-right parties, one of which rules Hungary today, from the constitutional principle itself. Those are the parts The Forward edited out, apparently with their teeth, as it was so crudely done. Dr. Gorka made these temperate statements in Hungarian on Hungarian TV a decade ago (he became a U.S. citizen in 2012), doing this when he couldn't have known that fate would take him to the states and his position as President Trump's top counter-terrorism adviser. He just did it because it was the right thing.\nBut slice and dice as you like – and this one, according to Hungarian-origin David Harsanyi, who is also Jewish, was a doozy of crudely atrocious, bottom of the barrel-standard \"journalism\" unworthy of any word but \"despicable.\"\nI was immediately suspicious when watching the two-minute snippet of an 11-minute interview with Gorka provided by Forward. (Only later did the publication add the full video of the 2007 interview to the bottom of the page.) The conversation seems to cut off at a pretty important point. So I sent the video to someone fluent in the language. If the translation I was given is correct – and after comparing it to the video, I have no reason to believe it isn't – it turns out that the contention that Gorka \"publicly supported a violent racist and anti-Semitic paramilitary militia that was later banned as a threat to minorities by multiple court rulings\" is only true in the most risible sense.\nHarsanyi points out that The Forward completely distorted his words, cherry-picking the parts they could claim amounted to Nazi support and leaving out the parts that absolutely exculpated him from any such charge.\nMoreover, in the interview, Gorka clearly states that he supports an armed citizenry in principle. Gorka goes on to explain how self-defense works in places like Switzerland, Israel, and America. He argues that there is nothing inherently wrong with militias. But, more importantly, he then goes out of his way to point out that forming this particular group was a cynical political ploy by the two parties involved. Gorka says, \"there was a growing need among the Hungarians to defend the country's honor. I believe Jobbik has decided to politically exploit and politically benefit from a popular call for self-defense. And the most important thing is that, I stress, the most important thing is that this is has nothing to do with our party, the UDK, rather it's Fidez who is behind the plan\" (emphasis added).\nDoes that sound like an endorsement?\nWhatever was left of The Forward's credibility was then blown apart by Gorka's friend, David Goldman, the estimable writer known as Spengler, writing:\nDr. Gorka takes issue with the interviewer, accusing FIDESZ of using the Jobbik Party (an explicitly extremist organization) for its own purposes: I don't believe that FIDESZ itself wished to create any sort of quasi-military organization but it now sees the potential to exploit it [Jobbik's proposal] as a tool. The interviewer countered: \"Excuse me, but FIDESZ could not be this stupid,\" to which Gorka replied: Why not? It failed twice during recent elections. Gorka not only denounced the militia proposal as it came from the extreme-right Jobbik Party, but denounced the notionally respectable FIDESZ (the party that has ruled Hungary since 2010) for allying with Jobbik to advance its own agenda. He took precisely the opposite position that the Goebbelistas at the Forward attributed to him, and attacked not only the explicitly anti-Semitic extremists but the notionally respectable centrists who used the extremists.\nWhat is one to make of these insane fact-free attacks?\nIt might just come down to something out of the old Soviet desinformatsiya playbook: to smear the Eastern Europeans, any Eastern European, anyone who opposed the Soviets, as a monster of anti-Semitism. The Soviets got started with it during the Russian civil war of 1921, when they painted the White Guard resistance – these were people fighting to the death to save Russia from the stunning evil of Lenin's atheistic materialistic communism – as systematic anti-Semites, walking pogroms, their every flaw magnified and exaggerated, particularly with the anti-Semitic card. They extended their Big Lie, as Goldman points out, by smearing the starved out, Gulag-ized, desperately brutalized people of the Ukraine by depicting their resistance leader, one General Andrei A. Vlasov, with the Nazi collaborator card. This, by the way, was denounced by none other than Aleksandr Solzhenitsyn in his masterpiece, the Gulag Archipelago, as a colossal lie of the Soviets. Solzhenitsyn considered those men who resisted Stalin's communism heroes – and he knew some personally in the Siberian camps. Yes, Vlasov collaborated with the Nazis – the Soviets were murdering his people, literally. What would you do?\nDid Vlasov subscribe to Nazism? He did not. He just defected to where he could defect and had no choice but to use one side against the other, as Solzhenitsyn noted, because there were no other choices. The anti-Semitism card against Eastern Europe got very well developed by the Soviets and picked up in the West after that.\nWhile I rather like RT News, I still see this strain of Soviet-style propaganda cropping up in some of its reporting on Ukraine. This is the one area where you can really see the outlines of propaganda – in the anti-Semitism card against the Eastern Europeans. The Ukrainians who oppose Russia taking over parts of their country are always depicted as boobs; clowns; corruptus maximuses (some of this is true; it's why it's so effective as propaganda); and, of course, closet Nazi anti-Semites. When I see one of those stories, I need a second source.\nNow the same line of anti-Semitic smears are being directed at Dr. Gorka – not by Soviets, and not by Russians, but by a left-wing secular Jewish publication that ought to know better. It's a nonstop barrage of constant, baseless, failed attacks, modeled on the classic Soviet smear. What they are doing is creating a sort of Black Legend of hate against Eastern Europeans and those of Eastern European origin, the better to undermine the U.S. alliance with these countries. What are they accomplishing? Nothing. Dr. Gorka is the best friend Israel has. The Forward apparently can't stand the idea of Israel having a friend.","url":"https://www.americanthinker.com/blog/2017/04/renewed_attacks_on_gorka_have_earmarks_of_soviet_propaganda_playbook.html"}
