{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:04:06","date_modify":"2018-10-31 00:04:06","date_publish":"2016-03-09 08:00:00","description":"Owning a home in California could get more complicated starting next year with a new law intended to cut energy consumption, partly by increasing the","filename":"data/vaneerConsumption/Renovatingahomeisabouttocostmore.json","image_url":"https://calmatters.org/wp-content/uploads/17627514404_8f7ff7d886_k.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944246.html","title":"Renovating a home is about to cost more","title_page":"Renovating a home is about to cost more | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Owning a home in California could get more complicated starting next year with a new law intended to cut energy consumption, partly by increasing the efficiency of home heating, cooling and lighting systems.\nThe legislation requires a doubling of statewide energy savings by 2030. All sectors of California’s built environment — state buildings, commercial and industrial structures and schools — will be asked to do their part, along with 9 million single-family homes.\nMajor renovations on existing homes will have to be undertaken with energy efficiency in mind, using products and systems that meet an updated state building code. California’s code is already among the strictest in the nation.\nAbiding by the revised code will come with an increased price tag. State officials say that homeowners’ up-front costs will be recouped over time in lower monthly power bills and added resale value. But do Californians typically stay in their homes long enough to reap these benefits?\nNew homes will also be required to meet higher energy standards. By 2020, each home built in California should produce as much power as it consumes. At least one builder estimates that advanced energy systems will add $50,000 to the cost of a new, super-efficient home. What will that mean in a state where low-cost housing is in short supply?\nIs state leaders’ wish to save energy and reduce greenhouse gas emissions worth the added cost? Do you think the savings over time will offset the initial sticker shock?","url":"https://calmatters.org/articles/renovating-a-home-is-about-to-cost-more/"}
