{"authors":["Press Association"],"date_download":"2018-10-23 02:03:32","date_modify":"2018-10-23 02:03:32","date_publish":"2016-01-28 16:47:21","description":"Reoffending rates among young criminals are at the highest level for more than 10 years, new figures show. Of 42,000 juvenile offenders cautioned, convicted ...","filename":"data/vaneerConsumption/Reoffendingratesforyoungcriminalsathighestlevelformorethan10years.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-6a67579f-56e5-4b97-983b-7b6dcf426ce3-2vdWmEltwXfba0ce28e632ab9d6e-661_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421223_Reoffending-rates-young-criminals-highest-level-10-years_1540260212.html","title":"Reoffending rates for young criminals 'at highest level for more than 10 years'","title_page":"Reoffending rates for young criminals 'at highest level for more than 10 years' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Reoffending rates for young criminals 'at highest level for more than 10 years'\nReoffending rates among young criminals are at the highest level for more than 10 years, new figures show.\nOf 42,000 juvenile offenders cautioned, convicted or released from custody in 2013/14, some 16,000 - or 38% - went back to crime in the next 12 months.\nThis was the highest proportion since the current data records began in 2002, and an increase of 1.9 percentage points compared with the previous year.\nReoffending rates among young criminals are at the highest level for more than 10 years\nRe-offences committed by juveniles fell from 165,000 to 50,000 and the total number of individuals responsible has also fallen, but youngsters who did offend again were responsible for 3.12 new crimes each, the highest rate for a decade.\nOverall, 26.2% of offenders across all age groups went on to commit a new crime within a year, a level which has remained stable in recent years.\nOfficial figures also revealed that criminals who were cautioned, given a non-custodial sentence or released from custody in 2013/14 had an average of 12 previous offences to their name - a jump of more than a third (36.8%) compared with 10 years earlier.\nThe Ministry of Justice (MoJ) labelled reoffending figures \"shocking\" and said they \"show why our reforms are so important\".\nA spokesman said: \"Reoffending has been too high for too long which is why we have reformed the way offenders are managed in the community.\n\"Almost all offenders now receive targeted support on release, getting the help they need to turn away from crime and keeping communities safer.\"\nAlthough youth crime is down, reoffending rates are \"far too high\", the spokesman added.\nHe said: \"S upervision of young offenders in custody is not good enough.\n\"We are working hard to improve training and education for young people while in custody and on release to make sure they have the skills and self-discipline they need to turn their lives around and stop offending.\"\nOther figures showed there were 11,975 sentenced sex offenders in the prison popu lation as of December - 9% higher than 12 months before.\nIt reflects a recent surge in the number of reported sex crimes and a jump in the prison terms given to perpetrators.\nThe data, published on Thursday, also gave an update on the number of criminals who are still at large despite breaking their release terms.\nA total of 1,247 offenders recalled to custody after breaching the conditions of their licence between 1984 and September had not been returned to custody as of the end of last year.\nOf these, 16 were originally in prison for murder and 38 were sex offenders.\nThe figures also showed that nearly 3,000 serious violent or sexual crimes were committed by offenders within a year of a caution, non-custodial conviction or release from prison for a previous offence.\nThe number - 2,926 - represents a fall of more than a fifth compared with 2003 but a rise of 5.7% on the previous year.","url":"https://www.dailymail.co.uk/wires/pa/article-3421223/Reoffending-rates-young-criminals-highest-level-10-years.html"}
