{"authors":["Mark Davis The Dallas Morning News"],"date_download":"2018-10-30 18:39:51","date_modify":"2018-10-30 18:39:51","date_publish":"2017-03-10 02:14:00","description":"Those of us who have advocated for the repeal and replacement of Obamacare have been frustrated by the lack of a specific Republican strategy to actually achieve this. We could define our individual wish lists, but that's not the same as saying our party has its act together with an actual plan.","filename":"data/vaneerConsumption/Repealandabouttime.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_10_repeal-and-about-time-20170310__page=2_1540924791.html","title":"Repeal, and about time","title_page":"Repeal, and about time","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Those of us who have advocated for the repeal and replacement of Obamacare have been frustrated by the lack of a specific Republican strategy to actually achieve this. We could define our individual wish lists, but that's not the same as saying our party has its act together with an actual plan.\nWell, there's a plan now, but it will usher in a wave of new arguments.\nThe repeal is of the individual mandate, which was always the most noxious element of the so-called Affordable Care Act, which proved to have quite the opposite effect for millions of Americans.\nThat mandate was always a grotesque government over-reach. The notion of requiring citizens to make a purchase is an affront to basic liberty. The ill wisdom of intentionally living uninsured does not change that fact.\nBut Obamacare needed premiums from every paying human being it could compel in order to fill the coffers with subsidies for others. Republicans apparently went to great pains to preserve the two elements of the law adored by large majorities: coverage for pre-existing conditions, which is understandable, and the capacity to keep our idle offspring on our policies until they are 26, which is ridiculous.\nRefundable tax credits will free up money to buy better coverage in a freer marketplace, but TV screens will soon fill with people who will lament that the coverage they had yesterday may not exist in the same form tomorrow.\nThat's exactly the point. Obamacare was always, from the starting blocks, unsustainable.\nThere was never going to be enough money from other people to pay the freight for tens of millions seeking subsidies. There is a cynical chorus that says this was the plan all along, that it would have enabled the Bernie Sanders wing of the Democratic party to say, \"Hey, we tried,\" and pivot to straight-up single-payer government health care.\nThere were obviously people who benefited from Obamacare, and they made their way dutifully to various town halls. But their stories do not outweigh the countless families burdened by skyrocketing premiums and deductibles. This is simple math. Free stuff paid for by other people is a road to economic ruin.\nWith the big reveal of a repeal plan, get ready for obsessions over Congressional Budget Office scoring, as if the CBO knows what the market effects will be when insurance companies can compete across state lines, and when doctor-patient relationships are freed from the ACA's various government shackles. (Hint: it will be a joy to behold.)\nCompeting factions will throw sharp elbows on Medicaid restructuring, tensions will brew over whether the new measure is bold enough, and some voices may even have the courage to speak a harsh truth: that the promise of funding pre-existing conditions will make even the noblest GOP retool almost as unsustainable as Obamacare was.\nReal reform means getting government's hands off of our health care, even in the ways that many Americans have grown fond of. The good news is that statewide high-risk pools and state-by-state competition can provide hope and help in addressing any conditions, pre-existing or not.\nBut the journey to that clarity will not be smooth. With Barack Obama as president, countless repeal measures were dead on arrival.\nNow that the path is cleared for a bill to actually see a presidential signature, the process of crafting that bill will be decidedly messy.\n------------v------------\nMark Davis is a Texas radio host and columnist for the Dallas Morning News.\nEditorial on 03/10/2017","url":"https://www.arkansasonline.com/news/2017/mar/10/repeal-and-about-time-20170310/?page=2"}
