{"authors":[],"date_download":"2018-10-30 01:11:23","date_modify":"2018-10-30 01:11:23","date_publish":"2016-08-22 00:28:12","description":null,"filename":"data/vaneerConsumption/RepealofObamacareWillConfirmTrumpsGreatnesss.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/TrumpGreatness.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861883.html","title":"Repeal of Obamacare Will Confirm Trump’s Greatnesss","title_page":"Repeal of Obamacare Will Confirm Trump’s GreatnesssThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Donald Trump can become one of the greatest Presidents in American history, if he can lead adoption of just a few desperately needed changes in federal policies and law that America urgently needs to get right. Trump has already pledged to adopt these changes, while Hillary has pledged to oppose them.\nThis is the third in a four part series on those desperately needed changes: Repeal and Replace Obamacare. Trump has long promised to lead the Republican Congress to enact that. Speaker Paul Ryan has developed an excellent health reform plan to do so, which the Republican House Majority has already endorsed, and the Republican Senate is favorably disposed to support. Hillary, of course, would veto it.\nEvery promise President Obama made to win enactment of Obamacare has proven false:\nPresident Obama promised that under his health plan, the cost of family health insurance would decline by $2,500 per year on average. But under Obamacare, those costs have gone up, not down. Up by $2,900 per year on average. These premium increases were the predictable results of the costly overregulation and tax increases imposed by Obamacare.\nPresident Obama famously promised, ad nauseam, that if you like your health insurance under Obamacare you could keep your health insurance. But that turned out to be if Obama likes your health insurance, you could keep your health insurance, as millions of Americans lost health insurance they were perfectly happy with because it failed to meet all the costly Obamacare regulatory requirements.\nMillions more such health insurance cancellations are still to come, as more Obamacare requirements become effective. Or as Obamacare’s mandated costs force more health insurers to leave the Obamacare Exchanges to cut unmanageable losses. Witness Aetna’s recent withdrawal across the nation.\nPresident Obama famously promised repeatedly that if you like your doctor, you could keep your doctor. But millions of Americans lost their doctor as they lost their health insurance, and discovered that the narrow networks that insurers have adopted under Obamacare to try to keep costs down exclude their favorite doctors and specialists.\nUnder Obamacare, the quality of health care is threatened by waves of consolidation by doctors, clinics, hospitals, and others, and the accompanying decline of independent medical practices, which reduces health care freedom of choice and competition for working people and their families. That is again the predictable result of the costly overregulation of Obamacare.\nAmerica’s seniors will increasingly suffer declining quality of health care under Medicare as the $800 billion in cuts to Medicare adopted by Obamacare begin to have their effect. Obamacare’s Independent Payment Advisory Board (IPAB), which has yet to go into effect, will have the power to cut Medicare still more.\nObamacare did not even deliver the universal health insurance coverage that was supposed to be the whole point. CBO has estimated that 30 million Americans would still be uninsured 10 years after Obamacare has been fully implemented!\nSpeaker Ryan organized six House Republican Majority Task Forces to prepare reports this year on six major issues, including repealing and replacing Obamacare. In June, the Health Reform Task Force issued a thorough report proposing a Republican plan to replace Obamacare, which the public will overwhelmingly favor.\nUnder the Republican Majority Plan, workers and their families will be free to choose and keep the health insurance plan they each like, rather than the health plan Obama likes and imposes on them under the Obamacare mandates. Both the employer and individual Obamacare mandates would be abolished by the House Republican reform proposal.\nUnder the Republican reforms, everyone without employer provided health insurance would receive a refundable Universal Health Insurance Tax Credit of $2,500 per year, which workers and their families could use to help pay for the health insurance they each like and choose in a competitive marketplace. The tax credit effectively extends the tax preference for employer provided health insurance to everyone on equal terms.\nThe poor would be liberated by long overdue reform of Medicaid, which would be returned to control by 50 competing and experimenting states, similar to the 1996 Reagan federalist “block grant” model for welfare reform. States would be free to choose to provide Medicaid benefits through health insurance “premium assistance” vouchers the poor could use, in addition to the Universal Health Insurance Tax Credit, to help pay for the health insurance they each choose, including money saving, cost reducing Health Savings Accounts (HSAs). States would also be free to adopt work requirements for Medicaid for the able bodied.\nHealth insurers would be liberated to sell across state lines, creating a nationwide competitive market. Those uninsured with pre-existing conditions would be assured of coverage by extending the continuous coverage protections, proven workable in the employer health insurance market, to the individual market. State run Uninsurable Risk Pools would provide “backstop” coverage for everyone, even for pre-existing conditions.\nFinally, under the House Republican Majority Plan, Obamacare would be repealed in its entirety, including its trillions in taxes, costly federal regulations, and unnecessary government spending. That would include a 16 percent reduction in the capital gains tax and the tax on corporate dividends, and nearly a 25 percent reduction in the top Medicare payroll tax rate.\nRepeal would also eliminate the employer mandate, effectively a tax on jobs, and the individual mandate, effectively a tax increase on the middle class and working people, contrary to Obama’s promises never to increase their taxes. All of this would be enormously pro-growth, which makes it a centerpiece of Trump’s economic growth plan. By liberating booming economic growth, consumer choice, and cost saving incentives and competition, the House Republican Majority Plan would assure health insurance coverage to millions more Americans than Obamacare.\nThis is a ready-made plan, already supported by the Republican House majority, that Trump can and should embrace for the repeal and replacement of Obamacare. This is an issue on which the differences between Donald Trump and Hillary Clinton could not be more clear. With Hillary, you know America will be stuck with increasingly dysfunctional Obamacare for at least four more years.","url":"https://spectator.org/repeal-of-obamacare-will-assure-trumps-greatnesss/"}
