{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 21:43:55","date_modify":"2018-10-30 21:43:55","date_publish":"2015-10-06 19:39:19","description":"Rep. Jim Jordan (R-OH) says that the House of Representatives will impeach IRS Commissioner John Koskinen this session.","filename":"data/vaneerConsumption/RepJimJordanSaysHouseWillImpeachHeadofIRS.json","image_url":"https://media.breitbart.com/media/2015/02/jim-jordan.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_06__1540935835.html","title":"Rep. Jim Jordan Says House Will Impeach Head of IRS","title_page":"Rep. Jim Jordan Says House Will Impeach Head of IRS | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Jim Jordan (R-OH) says that the House of Representatives will impeach IRS Commissioner John Koskinen this session.\n“It is something that has to be done,” the Washington Examiner reports Jordan, chair of the conservative House Freedom Caucus, told members of the Young Americans Foundation. “If we don’t hold some people accountable in the executive branch for the executive overreach we’ve seen in [the Obama] administration, then they’ll never get the message.”\nThree months ago Jordan, chairman of the Subcommittee on Health Care, Benefits and Administrative Rules of the House Oversight and Government Operations Committee, was only willing to say that the House “should consider impeaching” Koskinen.\nTwo months ago, in July, Jordan said the House should impeach Koskinen if President Obama doesn’t fire him.\nWith the resignation of Speaker Boehner, Jordan has changed verbs.\nNow, instead of calling for the House to “consider impeaching” Koskinen, he is saying it “will impeach” Koskinen.\n“He’s very passionate about this issue,” a source familiar with Rep. Jordan’s thinking tells Breitbart News.\nArticle 2 Section 4 of the Constitution gives the House of Representatives the authority to impeach any “all civil officers of the United States,” in addition to the President and Vice President:\nThe President, Vice President and all civil Officers of the United States, shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors.\nIn a July 27 op-ed at the Wall Street Journal titled “The Stonewall at the Top of the IRS,” Jordan and fellow Oversight Committee member Rep. Ron De Santis (R-FL) wrote:\nIf the president doesn’t remove Mr. Koskinen from his post, then Congress should remove him through impeachment. The impeachment power is a political check that, as Alexander Hamiltonwrote in Federalist No. 65 in 1788, protects the public against “the abuse or violation of some public trust.” Supreme Court Justice Joseph Story echoed Hamilton in 1833 when he distinguished impeachable offenses from criminal offenses, noting that they “are aptly termed political offenses, growing out of personal misconduct or gross neglect, or usurpation, or habitual disregard for the public interests . . . They must be examined upon very broad and comprehensive principles of public policy and duty.”\nA cabinet member has been impeached only once using this authority.\nIn 1876, President Grant’s Secretary of War, William Belknap, was impeached by the House of Representatives on charges of corruption. Belknap resigned before the Senate acquitted him of the charges. Historians are virtually unanimous in their assessment that Belknap was guilty of the charge.\nThe first step will likely come when the proposal to impeach Koskinen is addressed by the Oversight Committee on which Jordan sits, though a specific date for such consideration has not yet been proposed.\nIn their Wall Street Journal op-ed, Jordan and De Santis explained why the House should impeach Koskinen if President Obama does not fire him:\nInternal Revenue Service Commissioner John Koskinen needs to go. When it was revealed in 2013 that the IRS had targeted conservative groups for exercising their First Amendment rights, PresidentObama correctly called the policy “inexcusable” and pledged accountability. He even fired the then-acting IRS commissioner because he said it was necessary to have “new leadership that can help restore confidence going forward.” Unfortunately, Commissioner Koskinen, who took over in the wake of the IRS targeting scandal, has failed the American people by frustrating Congress’s attempts to ascertain the truth. A taxpayer would never get away with treating an IRS audit the way that IRS officials have treated the congressional investigation. Civil officers like Mr. Koskinen have historically been held to a higher standard than private citizens because they have fiduciary obligations to the public.\nThe bill of indictment against Koskinen set forward by Jordan and DeSantis was compelling:\n• Destruction of evidence. Lois Lerner, at the time the director of the IRS’s exempt-organizations unit, invoked the Fifth Amendment on May 22, 2013, when appearing before Congress; her refusal to testify put a premium on obtaining and reviewing her email communications. On the same day the IRS’s chief technology officer issued a preservation order that instructed IRS employees “not to destroy/wipe/reuse any of the existing backup tapes for email, or archiving of other information from IRS personal computers.” Several weeks later, on Aug. 2, the House Oversight Committee issued its first subpoena for IRS documents, including all of Ms. Lerner’s emails. On Feb. 2, 2014, Kate Duval, the IRS commissioner’s counsel, identified a gap in the Lerner emails that were being collected. Days later, Ms. Duval learned that the gap had been caused in 2011 when the hard drive of Ms. Lerner’s computer crashed. Despite all this—an internal IRS preservation order, a congressional subpoena, and knowledge about Ms. Lerner’s hard-drive and email problems—the Treasury inspector general for tax administration discovered that the agency on March 4, 2014, erased 422 backup tapes containing as many as 24,000 emails. (Congress learned of the discovery only last month.) Ms. Duval has since left the IRS and now works at the State Department, where she is responsible for vetting Hillary Clinton’s emails sought by congressional investigations of the Benghazi attacks. • Failure to inform Congress. Mr. Koskinen was made aware of the problems associated with Ms. Lerner’s emails the same month Ms. Duval discovered the gap. Yet the IRS withheld the information from Congress for four months, until June 13, 2014, when the agency used a Friday news dump to admit—on page seven of the third attachment to a letter sent to the Senate Finance Committee—that it had lost many of Ms. Lerner’s emails. During that four-month delay, Mr. Koskinen testified before Congress under oath four times. On March 26, 2014, he appeared before the Oversight Committee and pledged that the IRS would produce all of Ms. Lerner’s emails, not mentioning that the IRS already knew of the problems with her emails and hard drive. Mr. Koskinen deliberately kept Congress in the dark. Based on testimony received by the committee, we now know that the IRS appears to have spent the four months working with the Obama administration to fine-tune talking points to mitigate the fallout. • False testimony before Congress. Mr. Koskinen made statements to Congress that were categorically false. Of the more than 1,000 computer backup tapes discovered by the IRS inspector general, approximately 700 hadn’t been erased and contained relevant information. But Mr. Koskinen testified he had “confirmed” that all of the tapes were unrecoverable. He also said: “We’ve gone to great lengths, spent a significant amount of money trying to make sure that there is no email that is required that has not been produced.” In reality, the inspector general found that Mr. Koskinen’s team failed to search several potential sources for Ms. Lerner’s emails, including the email server, her BlackBerry and the Martinsburg, W.Va., storage facility that housed the backup tapes. The 700 intact backup tapes the inspector general recovered were found within 15 days of the IRS’s informing Congress that they were not recoverable. Employees from the inspector general’s office simply drove to Martinsburg and asked for the tapes. It turns out that the IRS had never even asked whether the tapes existed. Three weeks after the 422 other backup tapes were destroyed by the IRS, Mr. Koskinen told the committee that he would produce “all” Lerner documents. This statement was clearly false—you can’t give Congress “all” of the material if you know that you have already destroyed some of it. • Failure to correct the record. After his false statements to Congress under oath, Mr. Koskinen refused to amend them when given the opportunity at a public hearing earlier this year. If a lawyer makes a false statement to a court, he has a duty to correct it. Civil officers like Commissioner Koskinen have a duty to the American people to revise their testimony when it contains inaccuracies. • Failure to reform the IRS to protect First Amendment rights. Mr. Koskinen hasn’t acted on the president’s May 2013 promise to “put in place new safeguards to make sure this kind of behavior cannot happen again.” A Government Accountability Office report released last week found that the IRS continues to lack the controls necessary to prevent unfair treatment of nonprofit groups on the basis of an “organization’s religious, educational, political, or other views.” In other words, the targeting of conservative groups may very well continue.\nSources tell Breitbart News that the three candidates vying to replace Speaker Boehner—Rep. Jason Chaffetz (R-UT), Rep. Daniel Webster (R-FL) , and House Majority Leader Rep. Kevin McCarthy (R-CA)—are likely to face questions about whether they support Jordan’s call to impeach the IRS’s Koskinen when they meet behind closed doors to answer questions from their GOP colleagues in Washington this evening.\nIRS Commissioner Koskinen may not be the only “civil officer of the United States” to face impeachment by the House of Representatives this session.\nGlenn Reynolds, a professor of Constitutional Law at the University of Tennessee and popular blogger at Instapundit, recently wrote that the House should impeach EPA Administrator Gina McCarthy.\nOutgoing Speaker John Boehner gave away much of Congress’s power to constrain the Obama administration’s unconstitutional actions when he and Senate Majority Leader Mitch McConnell (R-KY) took impeachment of President Obama and the power of the purse off the table earlier this year.\nWith Boehner’s departure, conservative members of the House of Representatives may now be willing to challenge President Obama’s usurpations of Congressional power through this rarely used Constitutional mechanism to replace his out-of-control appointees.\nThe list of Obama administration officials who have conducted themselves in a manner that is worthy of impeachment is likely to keep growing.","url":"https://www.breitbart.com/politics/2015/10/06/rep-jim-jordan-says-house-will-impeach-head-irs/"}
