{"authors":["Pam Key"],"date_download":"2018-10-30 21:44:56","date_modify":"2018-10-30 21:44:56","date_publish":"2015-06-26 13:45:45","description":"Rep. Jim Jordan: Republicans Consider Impeaching IRS Chief","filename":"data/vaneerConsumption/RepJimJordanRepublicansConsideringImpeachingIRSChief.json","image_url":"https://media.breitbart.com/media/2015/06/jord.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_06_26__1540935896.html","title":"Rep. Jim Jordan: Republicans Considering Impeaching IRS Chief","title_page":"Rep. Jim Jordan: Republicans Considering Impeaching IRS Chief | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Friday on Fox News Channel’s “Fox & Friends,” Rep. Jim Jordan (R-OH) said House Republicans are considering impeaching John Koskinen the head of the IRS.\nJordan said, “Every time Mr. Koskinen comes to testify, we subsequently learn that something he said wasn’t accurate. So you go back to last year, we first had a subpoena requesting all information regarding the targeting of conservative groups. There was also a preservation order to protect all the documents that were part of the targeting of conservative groups. His chief council knew in February of last year they had missing e-mails and problems with Lois Lerner’s hard drive. So John Koskinen comes in front of our committee March 26 last year, and assures the committee they will get us all the information, all the emails, all the documents. And yet three weeks before he said that, just three weeks before, earlier is that same month, they already destroyed 422 tapes. So there’s a preservation order and subpoena to make sure we get the information. The preservation order said keep the information, protect the information and the IRS destroys it. Three weeks later John Koskinen testifies we’re going to get it to you. Those kind of actions are something we have to look into seriously. That’s what the committee is doing.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2015/06/26/rep-jim-jordan-republicans-consider-impeaching-irs-chief/"}
