{"authors":["Breitbart News"],"date_download":"2018-10-30 20:59:02","date_modify":"2018-10-30 20:59:02","date_publish":"2016-05-21 02:56:55","description":"George Zimmerman said he has sold the gun he used to kill unarmed black teenager Trayvon Martin in Florida in 2012 for $250,000, television stations in Orlando and Las Vegas reported on Friday. | Pre-Viral","filename":"data/vaneerConsumption/ReportGunUsedtoKillTrayvonMartinSoldfor250000.json","image_url":"https://media.breitbart.com/media/2016/05/trayvon-gun-DSCN0254_20120517174547_640_480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/pre-viral_2016_05_20__1540933142.html","title":"Report: Gun Used to Kill Trayvon Martin Sold for $250,000","title_page":"Report: Gun Used to Kill Trayvon Martin Sold for $250,000 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"From Reuters:\nGeorge Zimmerman said he has sold the gun he used to kill unarmed black teenager Trayvon Martin in Florida in 2012 for $250,000, television stations in Orlando and Las Vegas reported on Friday.\nZimmerman could not be reached to verify the reports by KTNV in Las Vegas and WOFL in Orlando.\nHis offer to sell the Kel-Tec PF9 9mm handgun on UnitedGunGroup.com drew praise from gun rights supporters and scorn from critics who accused him of seeking to profit from the 17-year-old’s death.\nZimmerman was acquitted of second-degree murder and manslaughter charges in the shooting, which sparked heated debates over race relations, gun control and justice in the United States.\nIn a statement on Twitter after the bidding closed on Wednesday, United Gun Group defended its decision to host the auction and said it would have no further comments.\nOn his own website that day, Zimmerman said the auction had “raised funds for several worthy causes.” He has said he would use proceeds to counter violence against law enforcement officers by the group Black Lives Matter and to fight Democratic presidential hopeful Hillary Clinton’s “anti-firearm rhetoric.”","url":"https://www.breitbart.com/pre-viral/2016/05/20/gun-used-kill-trayvon-martin-sold-250000/"}
