{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:39:11","date_modify":"2018-10-30 19:39:11","date_publish":"2016-07-17 07:14:52","description":"Two days before the anniversary of the nuclear agreement between Iran and world powers, the Islamic Republic attempted to launch a new type of ballistic missile using North Korean technology, multiple intelligence officials tell Fox News.","filename":"data/vaneerConsumption/ReportIranConducts4thMissileTestSinceSigningNukeDeal.json","image_url":"https://media.breitbart.com/media/2016/04/iran-ballistic-missile-program.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_17__1540928351.html","title":"Report: Iran Conducts 4th Missile Test Since Signing Nuke Deal","title_page":"Report: Iran Conducts 4th Missile Test Since Signing Nuke Deal","title_rss":"NULL","source_domain":"breitbart.com","text":"Fox News reports: Two days before the anniversary of the nuclear agreement between Iran and world powers, the Islamic Republic attempted to launch a new type of ballistic missile using North Korean technology, multiple intelligence officials tell Fox News.\nThe test, in violation of a UN resolution, failed shortly after liftoff when the missile exploded, sources said. The effort occurred on the evening of July 11-12 near the Iranian city of Saman, an hour west of Isfahan, where Iran has conducted similar ballistic missile tests in the past.\nIt would be at least the fourth time Iran has launched or attempted to launch a ballistic missile since the nuclear accord was signed on July 14, 2015.\nIran is barred from conducting ballistic missile tests for eight years under UN Resolution 2231, which went effect July 20, 2015, days after the nuclear accord was signed.\nIran is “called upon not to undertake any activity related to ballistic missiles designed to be capable of delivering nuclear weapons, including launches using such ballistic missile technology,” according to the text of the resolution.\nRead more here.","url":"https://www.breitbart.com/middle-east/2016/07/17/report-iran-conducts-4th-missile-test-since-signing-nuke-deal/"}
