{"authors":["John Hayward"],"date_download":"2018-10-30 20:36:51","date_modify":"2018-10-30 20:36:51","date_publish":"2015-07-22 02:26:28","description":"As everyone looks for the motive behind the shooting of four Marines and a Navy petty officer in Chattanooga, a few more clues have come up.","filename":"data/vaneerConsumption/ReportChattanoogaShooterThoughtISISWasStupidPreferredalQaeda.json","image_url":"https://media.breitbart.com/media/2015/07/Tennessee-Shooter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_21__1540931811.html","title":"Report: Chattanooga Shooter Thought ISIS Was 'Stupid,' Preferred al-Qaeda","title_page":"Report: Chattanooga Shooter Thought ISIS Was 'Stupid,' Preferred al-Qaeda | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As the U.S. government and mainstream media rack their brains to figure out the motive behind last week’s shooting of four Marines and a Navy petty officer in Chattanooga, Tennessee, a few more clues to this inscrutable mystery have come up.\nABC News reports the FBI has found evidence that Mohammad Youssef Abdulazeez was following al-Qaeda guru Anwar al-Awlaki, whose other noteworthy fans include Fort Hood murderer Nidal Hasan.\nAbdulazeez was reportedly using his personal electronics, now in the hands of FBI technicians, to peruse Awlaki videos in search of “militant Islamist guidance on committing violence.” (According to Reuters, he preferred to use his smartphone for such purposes, and did not have a laptop.)\nThe UK Daily Mail adds that Abdulazeez referenced Awlaki in some of the “writings” reporters have been encouraged not to regard as a “diary.”\nABC News is eager to reassure readers there is no evidence that Abdulazeez was “inspired or directed by ISIS.” These new revelations make that even less likely, because ISIS “publicly split” from its progenitors in al-Qaeda over recent years and are considered rival groups.\nA friend named James Petty said Abdulazeez “believed that ISIS was not a group to go towards,” and didn’t think they were “even Islamic.” CNN adds Petty’s recollection that Abdulazeez thought ISIS was “doing wrong,” a “stupid group” that “was completely against Islam.”\nReuters adds that a source close to the investigation said there was “evidence that the suspected gunman had online exposure to general jihadist propaganda that may have inspired the rampage.”\nThe Daily Mail reports that the shooter’s maternal uncle, Assad Ibrahim Assad Haj Ali, was taken into custody in Jordan on the day after the attack. Abdulazeez visited his uncle during a trip to Jordan last year, from which it has been said he returned with a keener interest in Middle Eastern affairs. It’s not clear from the report if the uncle has been formally charged with anything by Jordanian authorities.\n“I don’t think that there is any evidence it was [ISIS]-inspired. He may have been seeking some religious guidance to conduct an act. He could readily find that anywhere online,” a senior official told ABC News. “We may never know what his ultimate motivation was.”\nABC adds the reassuring thought that “many jihadis who oppose killing innocent civilian ‘disbelievers’ still view the military as a legitimate target because U.S. troops are the nation’s blunt instrument of foreign policy.”","url":"https://www.breitbart.com/national-security/2015/07/21/report-chattanooga-shooter-thought-isis-was-stupid-preferred-al-qaeda/"}
