{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 20:36:47","date_modify":"2018-10-30 20:36:47","date_publish":"2015-07-21 12:36:40","description":"Mohammad Youssuf Abdulazeez, the 24-year-old who carried out an attack in Chattanooga last week that killed five U.S. servicemen and wounded several others, researched the late radical American cleric Anwar al-Awlaki before carrying out his mass murder, authorities say. |","filename":"data/vaneerConsumption/ReportChattanoogaKillerViewedalAwlakiVideosBeforeMurders.json","image_url":"https://media.breitbart.com/media/2015/01/awlaki-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_21__1540931807.html","title":"Report: Chattanooga Killer Viewed al-Awlaki Videos Before Murders","title_page":"Report: Chattanooga Killer Viewed al-Awlaki Videos Before Murders | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Mohammad Youssuf Abdulazeez, the 24-year-old who carried out an attack in Chattanooga last week that killed five U.S. servicemen and wounded several others, researched the late radical American cleric Anwar al-Awlaki before carrying out his mass murder, authorities say.\nThe New York Times reported on Monday that “authorities who were examining Mr. Abdulazeez’s computer found that he had viewed material connected to Anwar al-Awlaki, the radical American-born cleric who was killed in Yemen by an American drone strike in 2011, according to a person with knowledge of the investigation.”\nAl-Awlaki, who studied in San Diego, had connections to the 9/11 hijackers and communicated with “lone wolf” terrorists, including Nidal Malik Hassan, who carried out an attack at the Army base at Fort Hood in 2009.\nThe link to al-Awlaki is the first definitive connection between Abdulazeez and a radical Islamic terror organization, though there is no sign yet that he was acting at the specific behest of a particular group.\nAbdulazeez also abused drugs and had mental health issues, reports say.","url":"https://www.breitbart.com/politics/2015/07/21/report-chattanooga-killer-viewed-al-awlaki-videos-before-murders/"}
