{"authors":["Charlie Nash"],"date_download":"2018-10-30 21:33:32","date_modify":"2018-10-30 21:33:32","date_publish":"2017-02-21 20:51:31","description":"According to a report by the San Diego Union-Tribune, the wave of increasing automation is about to put military jobs in jeopardy.","filename":"data/vaneerConsumption/ReportRobotstoTakeOverWideRangeofMilitaryJobs.json","image_url":"https://media.breitbart.com/media/2017/02/military-bot-eod-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_02_21__1540935212.html","title":"Report: Robots to Take Over 'Wide Range' of Military Jobs","title_page":"Report: Robots to Take Over 'Wide Range' of Military Jobs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to a report by the San Diego Union-Tribune, the wave of increasing automation is about to put military jobs in jeopardy.\nThe San Diego Union-Tribune reports, “Driver-less vehicles poised to take taxi, train and truck driver jobs in the civilian sector also could nab many combat-support slots in the Army.” Additionally, “Warehouse robots that scoot goods to delivery vans could run the same chores inside Air Force ordnance and supply units.”\n“New machines that can scan, collate and analyze hundreds of thousands of pages of legal documents in a day might outperform Navy legal researchers,” they continued. “Nurses, physicians and corpsmen could face competition from computers designed to diagnose diseases and assist in the operating room… Frogmen might no longer need to rip out sea mines by hand — robots could do that for them.”\n“Just as in the civilian economy, automation will likely have a big impact on military organizations in logistics and manufacturing,” said University of Pennsylvania professor Michael Horowitz. “The U.S. military is very likely to pursue forms of automation that reduce ‘back-office’ costs over time, as well as remove soldiers from non-combat deployments where they might face risk from adversaries on fluid battlefields, such as in transportation.”\nHenrik Christensen, the director of the Institute for Contextual Robotics at UC San Diego, added that “the jobs that are most boring will be the ones that get replaced.”\n“Robots will continue to replace the dirty, dull and dangerous jobs, and this will affect typically more uneducated and unskilled workers,” said Christensen. “You need to look at the mundane things. Logistics tasks will not be solved by people driving around in trucks. Instead, you will have fewer drivers. The lead driver in a convoy might be human, but every truck following behind will not be. The jobs that are the most boring will be the ones that get replaced because they’re the easiest to automate.”\nDuring an interview with Quartz last week, Microsoft founder Bill Gates called for a robot tax to offset the jobs lost from automation.\n“Certainly there will be taxes that relate to automation. Right now, the human worker who does, say, $50,000 worth of work in a factory, that income is taxed and you get income tax, social security tax, all those things,” declared Gates. “If a robot comes in to do the same thing, you’d think that we’d tax the robot at a similar level.”\n“There are many ways to take that extra productivity and generate more taxes. Exactly how you’d do it, measure it, you know, it’s interesting for people to start talking about now,” he continued. “Some of it can come on the profits that are generated by the labor-saving efficiency there. Some of it can come directly in some type of robot tax. I don’t think the robot companies are going to be outraged that there might be a tax. It’s OK.”\nGates also added that “you ought to be willing to raise the tax level and even slow down the speed of that adoption somewhat to figure out, ‘OK, what about the communities where this has a particularly big impact? Which transition programs have worked and what type of funding do those require?’”\nBillionaire and entrepreneur Mark Cuban also claimed on Sunday that robots are going to “cause unemployment,” posting, “Automation is going to cause unemployment and we need to prepare for it,” to Twitter on Sunday, while in November, Tesla and SpaceX founder Elon Musk also predicted that automated robots would lead to mass unemployment, which he claimed could eventually create a universal wage from the government.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/tech/2017/02/21/report-robots-take-wide-range-military-jobs/"}
