{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:15:57","date_modify":"2018-10-30 19:15:57","date_publish":"2016-11-20 17:33:59","description":"Future First Lady Melania Trump and son Barron will not be moving to the White House come January when Donald Trump is inaugurated, the New York Post reports. | Politics","filename":"data/vaneerConsumption/ReportMelaniaBarronTrumpWillNotMoveintoWhiteHouseAfterInauguration.json","image_url":"https://media.breitbart.com/media/2016/11/wi/afp/20/3cu3qvf-e1479663232599.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_20__1540926957.html","title":"Report: Melania, Barron Trump Will Not Move into White House After Inauguration","title_page":"Report: Melania, Barron Trump Will Not Move into White House After Inauguration | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Future First Lady Melania Trump and son Barron will not be moving to the White House come January when Donald Trump is inaugurated, the New York Post reports.\nThe president-elect’s 46-year-old wife and 10-year-old son will be staying put at Trump Tower so Barron can continue attending his private school on the Upper West Side of New York City, sources told the Post.\nJason Miller, Trump’s communications director for the transition team, was asked about the report that Melania and Barron are not moving to the White House during a reporter call Sunday morning.\n“No formal statement has been released yet,” he responded, saying one will be coming.\n“There’s obviously a sensitivity to pulling their ten year old out of school in the middle of the school year,” Miller added.\n“Melania is extremely close to Barron, and they have become closer during the campaign,” said a source close to Trump’s transition team. “The campaign has been difficult for Barron, and she is really hoping to keep disruption to a minimum.”\nAnother source said that Melania’s primary focus is on Barron, although she will travel to the White House as needed.\nThere is a possibility that Melania and Barron will move into the White House full time at the end of the school year, according to multiple sources.\nNEW: I'm also told to expect that @MELANIATRUMP and son Barron are expected to move to White House at end of school year — Kelly O'Donnell (@KellyO) November 20, 2016\nTheir decision to remain at Trump Tower will cause an increase in security around their Midtown Manhattan residence, with both Secret Service and the NYPD expected to be involved, a high-level security expert told the Post.\nTrump Tower has had heightened security measures since July, but security has tightened following the presidential election.\nShoppers have to go through security screenings and are subject to bag checks, and W 56th Street is closed to all traffic between Fifth and Madison Avenues.\nAn unknown number of secret service agents will be assigned to Melania and Barron, and a driver and an armored vehicle will take Barron to school, said security expert Jim Reese.\nHe added that agents will arrive at the school ahead of time to make sure its safe.","url":"https://www.breitbart.com/politics/2016/11/20/report-melania-barron-will-not-moving-white-house/"}
