{"authors":[],"date_download":"2018-10-30 21:09:28","date_modify":"2018-10-30 21:09:28","date_publish":"2016-12-29 15:38:00","description":"Stewart Schell of Austell was arrested after a police report said he was high on \"almost every category of drug\" when he pistol-whipped a woman.","filename":"data/vaneerConsumption/ReportManhighonalmosteverycategoryofdrugpistolwhipswoman.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/28/Images/StewartSchell_1240x698.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_report-man-high-_6f20caae8f6582cc2c44d78563cb5880__1540933768.html","title":"Report: Man high on ‘almost every category of drug’ pistol-whips woman","title_page":"Report: Man high on ‘almost every category of drug’ pistol-whips woman","title_rss":"NULL","source_domain":"ajc.com","text":"An Austell man high on “almost every category of drug” repaid a woman who gave him a drink of water by beating and shooting at her before she managed to escape her own home, according to a police report.\nStewart Schell, who turned 36 a few weeks ago, was arrested on charges of aggravated assault, false imprisonment, possessing a weapon as a felon and using it during a crime.\nCobb County police said Schell did not know the 25-year-old woman before he showed up at her South Gordon Road home Dec. 22.\nHe asked her if a truck parked outside her home was for sale, explaining that he’d just been in a car accident, which police confirmed in an incident report.\nHe asked to come inside to get a drink of water and use her phone. She agreed.\nOnce inside the woman’s home, Schell accused her of stealing his wallet. That’s when the beating began.\nSchell slammed her to the ground, punched her in the face multiple times and started pistol-whipping the woman’s head.\nIn the struggle, she bit Schell’s arm and “squeezed his groin area” to escape.\nAfter that, Schell shot a Kel-Tec .40-caliber pistol at the woman’s feet, the report said. She “busted out the window” and ran to a neighbor’s house to call 911.\nPolice found the woman hysterically crying and bleeding from her head.\nPolice pursued and found Schell hiding behind a refrigerator in a neighboring backyard, where he was arrested.\nThat’s also where officers found the gun. The woman’s hair was still stuck to the bottom of the gun’s magazine.\nThe cops took Schell to WellStar Cobb Hospital because they said he was obviously under the influence of drugs.\nAnd they were right.\n“The head nurse informed us later than Mr. Schell was under the influence of almost every category of drug,” the report reads. That included meth, heroin and cocaine.\nSchell remains in Cobb County jail without bond, as he is wanted in Carroll County for a marijuana possession charge from earlier this month.\nCobb police offered these tips when it comes to strangers at your door:\n♦ If someone comes to your door, and you do not know them, it’s okay to call 9-1-1 and have the operator on the phone until you can understand the stranger’s intentions.\n♦ If someone asks to use your phone, tell them that you can make the phone call for them and ask what information they need you to pass along.\n♦ If something does not seem right, it probably is not right.","url":"https://www.ajc.com/news/local/report-man-high-almost-every-category-drug-pistol-whips-woman/v2VlY6R38Ab24aFJktu1qL/"}
