{"authors":["Chriss W. Street"],"date_download":"2018-10-30 22:12:35","date_modify":"2018-10-30 22:12:35","date_publish":"2017-01-19 16:02:28","description":"The sections of California in severe drought have shrunk from 42.66 percent a year ago to just 2.13 percent on January 10.","filename":"data/vaneerConsumption/ReportOnly2ofCaliforniainSevereDroughtAfterStorms.json","image_url":"https://media.breitbart.com/media/2017/01/Nicaso-Reservoir-California-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_19__1540937555.html","title":"Report: Only 2% of California in Severe Drought After Storms","title_page":"Report: Only 2% of California in Severe Drought After Storms","title_rss":"NULL","source_domain":"breitbart.com","text":"With three new storms hitting this week, the sections of California in severe drought have shrunk from 42.66 percent a year ago to just 2.13 percent on January 10.\nThe proportion of California in severe drought saw an extraordinary one week drop from 18.31 percent on January 3 to just 2.13 percent on January 10. Accuweather.com predicts that with three more storms slamming the state from January 18 through the 24, severe drought could be completely eradicated and the big weather concern could be flooding, especially in the south.\nCalifornia’s brutal five-year drought is completely over in Northern California, and the area of severe drought has shriveled to mostly Ventura County, following a “plethora of Pacific storms and moisture slammed into California and most of the West, dumping copious amounts of precipitation on the northern two-thirds of the state and Sierra Nevada,” according to the U.S. Drought Monitor.\nThe Drought Monitor reported that the average precipitation for this Water Year that began on October 1,“was above or much above normal at nearly every major basin, while basin average snow water content was at or above normal in most Western basins.”\nStorms hitting in the first week of January poured over a foot of precipitation on the Sierra Nevada Mountains, with Strawberry Valley, CA picking up 20.7 inches. As of January 17, California’s reservoir storage system is above normal for this time of year for the first time in over four years.\nU.S. Geological Survey monitored streams were at or near record high flow rates, and the state’s snow water content was at 135 percent on January 10. As a result, major drought improvements were made not only to California but also across the West, including parts of Nevada, Utah, Oregon, Idaho, Montana, Wyoming, and Colorado.\nAn unusually warm and slow-moving Pacific jet stream has brought plumes of moisture associated with an “atmospheric river” that caused widespread flooding and the Sacramento River’s Yolo Basin opening for the first time in years. But this week’s storm train will see cold winter weather usually associated with the Pacific jet stream.\nThe third storm this week, expected beginning on Sunday, January 22, could bring intense rainfall and up to 3 feet of snow in Southern California at elevations above 6,500 foot level.\nAn “extreme mountain snowfall” warning has been issued, with potential closures of Interstate 15 through the Cajon Pass and Interstate 8 through the San Diego County Mountains. An additional concern regarding the third storm is a developing “strong surface low” that is expected to bring very strong winds.\nA persistent flood warning was issued late on January 17 by the U.S. National Weather Service, with the Sacramento River at Tehama Bridge just south of Redding already above the 213 foot danger level and expected to rise much higher.\nSouthern California could also see flooding in Long Beach, Malibu, Acton, Rancho Palos Verdes, Whittier, Burbank, Redondo Beach, Pasadena, Woodland Hills, downtown Los Angeles, Palmdale, and Santa Monica, according to the National Oceanic and Atmospheric Administration (NOAA).\nHigh surf advisory warnings have been posted by NOAA for most Southern California beaches. Surf is expected to build from 4 to 8 feet on Thursday morning 10 to 16 feet by Saturday. NOAA cautioned that impacts from powerful waves will include dangerous rip currents and breaking waves on rocks and jetties. Damage to piers is possible, and Ventura Harbor will have large waves breaking across the entrance.","url":"https://www.breitbart.com/local/2017/01/19/u-s-drought-monitor-california-severe-drought-2/"}
