{"authors":["Michael Lucchese"],"date_download":"2018-10-30 19:58:35","date_modify":"2018-10-30 19:58:35","date_publish":"2015-06-10 14:27:36","description":"New reports released by the federal government indicate the suicide rate for women veterans is six times higher than that of civilian women.","filename":"data/vaneerConsumption/ReportFemaleVeteransSixTimesMoreLikelytoCommitSuicideThanCivilians.json","image_url":"https://media.breitbart.com/media/2015/04/Kelli-Serio-Veteran-Vision-Project.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_10__1540929515.html","title":"Report: Female Veterans Six Times More Likely to Commit Suicide Than Civilians","title_page":"Report: Female Veterans Six Times More Likely to Commit Suicide Than Civilians | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New reports released by the federal government indicate that the suicide rate for women who have served in the military is six times higher than that of women who have not.\nAccording to the statistics newly released by the Veterans Affairs Department, the rates are even higher for young female veterans. Women ages 18 to 29 who served in the military are twelve times more likely to commit suicide than those who have not served.\nOver 2,500 women who served in the military have committed suicide over the last 11 years.\nIn 2010, a similar study was done by psychiatrists for the VA, and they found that female veterans ages 18 to 34 were three times more likely than civilians to commit suicide.\nBreitbart News attempted to reach the VA’s press office, but representatives were unavailable for comment.\nEarlier this year, an Air Force veteran, Capt. Jamie Brunette, committed suicide. Her friends and family are using her story to raise awareness about post-traumatic stress disorder (PTSD) and other psychological problems some in the military suffer, which may lead them to suicide. Brunette, the youngest of five from Milwaukee, served two tours of duty in Afghanistan. When she came home, she suffered from depression and PTSD and went to her local VA hospital for counseling.\n“One time, I asked Jamie to tell me about an average day in Afghanistan. She told me it was pretty scary. Her troop was under mortar attack on a daily basis,” Brunette’s roommate Heather Milner said. “Death was just like a normal thing.”\nPolice found her dead on February 9 from an apparent self-inflicted gunshot wound. She did not leave a suicide note, and questions continue to surround her death. Some family members have even claimed she may have been a victim of sexual assault, though little evidence has surfaced to corroborate the claim, and no singular reason has been sufficient to explain her death.\nWomen have not historically served in the armed forces, so many healthcare professionals are struggling to adapt their techniques and treatments for the growing number of women serving in the military.\nAccording to a study from the Disabled American Veterans Charity, there are massive gaps in service for servicewomen. The study suggests that the Veteran Affairs Department and the Department of Defense are unprepared for the needs of female troops.\nNot only that, but recent surveys show that women who served feel “unappreciated,” like they are not taken seriously as “real veterans.”\nSuicide prevention is becoming one of the most important missions of the VA. About 20 percent of all people who commit suicide in a given year are veterans. A 2012 report by the VA said that 22 veterans commit suicide every day.\nA major factor in suicides among veterans is post-traumatic stress disorder. Research undertaken by the VA suggests that those suffering from PTSD are at increased risk of suicidal and self-harming behaviors. Veterans, who often serve in intense conditions, often return from tours of duty suffering from PTSD.\nSome have suggested that women are at an increased risk of coming home from service with PTSD due to a phenomenon the VA calls military sexual trauma—MST. About a quarter of former servicewomen the VA interviewed said they were victims of unwanted, non-consensual sexual activity. In February, Congress passed the Clay Hunt Suicide Prevention for American Veterans Act, which aspires to free up resources to make it easier for suicidal veterans to get help from the VA.\n“If you are hurting, you are not forgotten. You are not alone. America is there for you,” President Obama said when he signed the bill into law. “Hopefully now we’re going to begin the downturn in veterans’ suicides,” VA Secretary Bob McDonald said at the same event.","url":"https://www.breitbart.com/national-security/2015/06/10/report-female-veterans-six-times-more-likely-to-commit-suicide-than-civilians/"}
