{"authors":["Will Martin"],"date_download":"2018-10-30 20:45:34","date_modify":"2018-10-30 20:45:34","date_publish":"2016-12-28 00:00:00","description":"The Daily Telegraph reported on Tuesday evening that the lender could be subject to an inquiry from the Bank of England's Prudential Regulation Authority.","filename":"data/vaneerConsumption/REPORTPRAcouldinvestigateRBSWilliamsGlynsale.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_report-pra-could-investigate-rbs-williams-and-glyn-sale-2016-12_1540932334.html","title":"REPORT: PRA could investigate RBS Williams & Glyn sale","title_page":"    REPORT: PRA could investigate RBS Williams & Glyn sale - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Ross McEwan, Chief Executive of RBS (Royal Bank of Scotland) speaks to reporters and investors on February 27, 2014 in London, England. Getty Royal Bank of Scotland's attempt to divest the Williams & Glyn arm of its business have hit yet another obstacle.\nThe Daily Telegraph reported on Tuesday evening that the lender could be subject to an inquiry from the Bank of England's Prudential Regulation Authority over its so far failed attempts to sell W&G.\nRBS must sell W&G as a condition of returning excess capital and dividends to investors. The bank is still almost three-quarters owned by the British government, despite the government gradually selling off small portions of the bank in the past two years.\nAccording to The Telegraph, RBS and the PRA have held discussions about the authority potentially launching a \"skilled persons report, also known as a section 166 report\" should RBS manage to sell Williams & Glyn to either challenger bank Clydesdale, or FTSE 100-listed Santander.\nThe business includes around 1.8 million personal banking customers and 250,000 small business accounts, but as it stands, neither Clydesdale or Santander is willing to purchase the entirety of the unit.\nThe Telegraph's report suggests that any potential inquiry could centre on RBS' current failures to sell the whole of the Williams & Glyn business, as well as the likely IT issues that could occur in the event of the sale.\nRBS' computer systems are often said to be pretty antiquated, and the PRA is thought to be worried that \"the complex integration of the RBS business could destabilise the computer systems of the buyer.\" In 2012 Santander pulled out of a deal to buy W&G at the last minute because of fears about a breakdown in IT.\nRBS must find a buyer for Williams & Glyn and complete the sale before the end of 2017, or could face a substantial fine, or a forced sale of the business by the European Commission.\nThe Commission mandated that Williams & Glyn must be divested from RBS' core business as a condition of the bailout it received during the financial crisis, when the British government stepped in to prevent the lender — which at one point was the biggest bank in the world in terms of total assets— from collapsing.\nRBS has already acknowledged that it if things change it won't manage to sell all of Williams & Glyn by its deadline of the end of 2017, saying in its third quarter results at the end of October:\n\"None of the proposals under discussion can deliver full separation and divestment by 31 December 2017. RBS is therefore in discussion with HM Treasury, and expects further engagement with the European Commission, to agree a solution with regards to its State Aid obligations.\"","url":"https://www.businessinsider.com/report-pra-could-investigate-rbs-williams-and-glyn-sale-2016-12"}
