{"authors":["John Hayward"],"date_download":"2018-10-30 20:28:53","date_modify":"2018-10-30 20:28:53","date_publish":"2015-06-05 02:05:15","description":"A report has been released on the RCMP's response to the jihadi attack on Parliament Hill last October that killed Corporal Nathan Cirillo.","filename":"data/vaneerConsumption/ReportCanadianPoliceMissedOpportunitiestoStopParliamentHillShooter.json","image_url":"https://media.breitbart.com/media/2015/06/canada-rcpm-watch-footage-of-parliament-hill-shooting-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_04__1540931333.html","title":"Report: Canadian Police Missed Opportunities to Stop Parliament Hill Shooter","title_page":"Report: Canadian Police Missed Opportunities to Stop Parliament Hill Shooter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Ontario Provincial Police have completed a report on the Royal Canadian Mounted Police (RCMP) response to jihadi gunman Michael Zehaf-Bibeau, who attacked Parliament Hill last October and murdered Corporal Nathan Cirillo.\nPrepared at the RCMP’s request, the report recognizes exemplary action from a number of law enforcement officers in addition to the widely-celebrated sergeant-at-arms Kevin Vickers, but it’s also extremely critical of the Mounties on several points.\nAs described by CBC News, the report faults the RCMP for poor “operational preparedness,” describes the approach to security on Parliament Hill as “highly inadequate,” and finds last October’s shooting “a grim reminder that Canada is ill-prepared to prevent and respond to such attacks.”\nThe first officer to spot Zehaf-Bibeau’s approach was reportedly distracted by a civilian and sent a warning message too “garbled” to be of use. This was said to make it difficult for other officers to understand which approaching vehicle contained the shooter. As it happened, he was driving a stolen cabinet minister’s car—a familiar vehicle, not immediately recognized as a threat. With a bit more situational awareness and more resources in place, it was concluded that the RCMP could have stopped Zehaf-Bibeau before he entered the parliament building, through such expedient measures as ramming his car.\nThe report found RCMP officers were unnecessarily delayed by confusion over whether they were permitted to enter the building with guns—they actually waited a few precious seconds for a supervisor to give them permission to move in. The RCMP was criticized for relying too heavily on reservists and overtime, due to budget cuts, and not training more frequently with Ottawa police and Commons and Senate security forces.\nAccording to the CBC, many of the police recommendations included in the OPP report have already been implemented. No individual officers have been faulted or disciplined for “human error”; the problems are all classified as “systemic errors.”\nThe Star paints an even more alarming picture of the OPP report and other security reviews, noting that the Ontario Provincial Police concluded it was “fortunate” the attack was the work of a “disorganized” individual.\n“If we consider the organized attack in France that occurred in January 2015, anything similar at Parliament Hill with the present security in place would have devastating results,” said the OPP, referring to the massacre at Charlie Hebdo magazine and subsequent rampage through Paris.\nThe Star calls the RCMP’s response “initially hapless.”\n“No RCMP cruiser was positioned at the empty East Gate entrance where he ran up onto Parliament Hill,” writes the Star. “One Mountie in a patrol car was reading a report on an expected demo and not watching the gate.”\nThe Star also notes that the report portrays the shooter as “a more determined, ruthless and seemingly unstoppable gunman than Canadians have glimpsed so far.” He waded through a hail of 56 bullets from police and security forces, and was struck by 31 of them… but was still on his feet when he came dangerously close to a group of tourists who could have been taken hostage. If he had been wearing body armor, things might have gone much worse.\nIt is apparently not clear whether hero sergeant-at-arms Vickers actually fired the shot that brought Zehaf-Bibeau down—it might have been the RCMP officer beside him and, in any event, several of his wounds would have eventually been fatal.\nOn a positive note, the Star finds praise in the OPP report for “a far more effective team response by Commons guards and, eventually, the RCMP officers who joined them, inside than has been previously detailed.” The first bullet hit the attacker within seven seconds of his entry into the building, and his injuries prevented him from using his own weapon, a Winchester .30-.30 rifle, more effectively.","url":"https://www.breitbart.com/national-security/2015/06/04/report-canadian-police-missed-opportunities-to-stop-parliament-hill-shooter/"}
