{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:20:20","date_modify":"2018-10-30 20:20:20","date_publish":"2017-03-19 13:48:20","description":"TEL AVIV –Princess of Pop Britney Spears will reportedly give her first ever performance in Israel this summer as part of her upcoming world tour. | Israel / Middle East","filename":"data/vaneerConsumption/ReportBritneySpearsToGiveFirstEverPerformanceInIsrael.json","image_url":"https://media.breitbart.com/media/2016/08/britney-spears-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_19__1540930820.html","title":"Report: Britney Spears To Give First Ever Performance In Israel","title_page":"Report: Britney Spears To Give First Ever Performance In Israel | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV –Princess of Pop Britney Spears will reportedly give her first ever performance in Israel this summer as part of her upcoming world tour.\nA date has not been set but Channel 2 reported Saturday night that Spears will give a single show in Tel Aviv’s HaYarkon Park in early July.\nRumors that Spears would perform in Israel have surfaced in previous years but have yet to be realized. However, the report said music producers in Israel have been working intensely to include an Israel date on the “Glory” world tour.\nSo far, her website and social media feeds have not included mention of an Israel date.\nSpears will join a host of megastars scheduled to perform in Israel over the summer including Justin Bieber, Aerosmith, Radiohead, Tears for Fears, Rod Stewart, Nick Cave and Gun N’ Roses.\nNo doubt that once the confirmation comes through, Boycott Divestment and Sanctions activists will pressure the pop princess to cancel the concert, as they have done with almost every artist coming to Israel.\nVociferous Israel-basher and former Pink Floyd front man Roger Waters, who is the music industry’s self-appointed leader of the anti-Israel campaign, has been accused of using bullying tactics to persuade other musicians not to perform in Israel.\nThe “Hit Me Baby One More Time” singer has a Las Vegas residency with her headlining act at the Axis.","url":"https://www.breitbart.com/middle-east/2017/03/19/report-britney-spears-to-give-first-ever-performance-in-israel/"}
