{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:37:02","date_modify":"2018-10-30 20:37:02","date_publish":"2014-10-28 13:47:25","description":"A prominent Chechen commander has been dispatched by the Islamic State to the fight in the strategic town of Kobani along the Syria-Turkey border where |","filename":"data/vaneerConsumption/ReportChechenISISLeaderDeployedtoKobaniWhereGroupHasSufferedHeavyFatalities.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Middle-East/Iraq/omar-al-shishani-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_10_28__1540931822.html","title":"Report: Chechen ISIS Leader Deployed to Kobani Where Group Has Suffered Heavy Fatalities","title_page":"Report: Chechen ISIS Leader Deployed to Kobani Where Group Has Suffered Heavy Fatalities | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A prominent Chechen commander has been dispatched by the Islamic State to the fight in the strategic town of Kobani along the Syria-Turkey border where the jihadist group has suffered heavy fatalities, Kurdish media network Rudaw reported.\nAn unnamed source inside Islamic State (IS, also known as ISIS and ISIL) headquarters in Syria’s Raqqa province told Rudaw that Abu Omar al-Shishani, a prominent Chechen fighter, “has been ordered to leave Shingal area in Iraq, where ISIS forces are currently laying siege to thousands of Yezidi civilians protected by Yezidi brigades and Kurds from Iraq, Syria, and Turkey.”\nThe Chechen fighter was appointed IS commander of northern operations in 2013 and is “considered one of their most powerful military leaders,” reported the Kurdish news outlet.\nAccording to the source, a large number of IS jihadists will be deployed to Kobani from Raqqa.\nIS militants have laid siege to the strategic Syrian town of Kobani for over a month. The town has been defended by Kurdish fighters with the help of consistent U.S.-led coalition airstrikes.\nKurdish fighters have been able to seize back most of the town from ISIS militants.\nThe source spoke to Rudaw about infighting within ISIS saying “foreign fighters, known as Muhajirin, were complaining that their Syrian counterparts were not bearing the brunt of the organization’s high-casualty attacks.”\nISIS is preparing to deploy reinforcements to “Idlib province, southeast of Aleppo, to try to dilute the concentration of US-led coalition airstrikes in Kobane,” Rudaw reported.\nSeizing Kobani would give IS militants control of 60 miles of land from Raqqa to the Turkish border. That would facilitate the entrance of foreign fighters into Syria through Turkey.\nThe U.K.-based Syrian Observatory for Human Rights reported on Sunday that 815 people were killed in Kobani between September 16, the day IS began attacking the border town, and October 25.\nIS jihadists and Syrian Kurdish fighters suffered most of the fatalities.\nOver half (481) of those killed were IS jihadists. Meanwhile, there were also 302 fatalities involving Syrian Kurdish fighters.","url":"https://www.breitbart.com/national-security/2014/10/28/report-chechen-isis-leader-deployed-to-kobani-where-group-has-suffered-heavy-fatalities/"}
