{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:51:17","date_modify":"2018-10-30 18:51:17","date_publish":"2016-08-31 15:05:52","description":"A report from Yale University claims that the Ivy League campus is almost as dangerous for women as some of the worst neighborhoods in Detroit.","filename":"data/vaneerConsumption/ReportClaimsYalesCampusAlmostasDangerousasDetroitforWomen.json","image_url":"https://media.breitbart.com/media/2016/08/Vanderbilt_Hall_spring.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_08_31__1540925477.html","title":"Report Claims Yale's Campus Almost as Dangerous as Detroit for Women","title_page":"Report Claims Yale's Campus Almost as Dangerous as Detroit for Women | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A report from Yale University claims that the Ivy League campus is almost as dangerous for women as some of the worst neighborhoods in Detroit.\nAccording to the Spangler report, which is an analysis of the half-year crime statistics on campus, the annual violent crime rate for women at Yale is 1.9 percent, which falls just below the rate for crime-ridden Detroit. On top of this, Brooklyn College Prof. KC Johnson, who has analyzed the Spangler Report, believes that Yale’s misconduct complaints represent “only a fraction of the instances of sexual misconduct at Yale,” meaning that it is potentially more dangerous to be a female Yale student than to roam the streets of Detroit at night.\nAlthough it is wholly unclear whether lower standards for sexual misconduct have contributed to the extreme findings of the Spangler report, the reports claims that Title IX coordinators at Yale investigated students for “unwanted attention” and “unwanted advances” towards female students.\nAn article from the Yale Daily News details the complaints made by students between January 1 and June 30 of 2016:\nThe University saw a record 88 complaints of sexual misconduct between Jan. 1 and June 30, 2016, according to Yale’s latest semi-annual Report of Complaints of Sexual Misconduct, released Tuesday. That figure surpasses the previous high — 78 complaints between July 1 and Dec. 31, 2015 — since the University began publishing the reports in 2011. Of the 88 complaints, 30 fall under sexual assault and 44 are sexual harassment allegations. The three other categories of sexual misconduct listed in the report — intimate partner violence, stalking and other — make up the rest.\nBreitbart Tech editor Milo Yiannopoulos has argued that the blame for these issues should be directed at the liberals who have run American universities over the past 30 years: “Liberals and progressives have run campuses unopposed for 30 years, and now liberals are telling us that spaces run by liberals are hotbeds of sexism, racism, homophobia, transphobia, and rape. Maybe it’s time to switch things up in the faculty.”\nTom Ciccotta is a libertarian who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/08/31/report-suggests-yales-campus-almost-dangerous-detroit/"}
