{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:53:50","date_modify":"2018-10-30 20:53:50","date_publish":"2016-02-17 10:42:52","description":"The number of convictions handed to European Union (EU) migrants has shot up by nearly 40 per cent in five years.","filename":"data/vaneerConsumption/REPORTOver700UKCrimesAWeekAreCommittedByEUMigrants.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-503011298.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_17__1540932830.html","title":"REPORT: Over 700 UK Crimes A Week Are Committed By EU Migrants","title_page":"REPORT: Over 700 UK Crimes A Week Are Committed By EU Migrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The number of convictions handed to European Union (EU) migrants in the United Kingdom has shot up by nearly 40 per cent in five years, such that more than 700 offences are now being committed every week.\nThe number of convictions handed to EU citizens leapt from around 27,000 in 2010 to around 37,000 in 2016, official police figures obtained by Leave.EU suggest.\nMeanwhile, the number of European nationals living in Britain in that period rose by 30 per cent, from 2.3million to 3 million.\nThe bulk of the convictions involved Polish and Romanian migrants who accounted for almost 17,000 offences. Migration restrictions on citizens from Romania and Bulgaria were lifted in 2014. Lithuanians were convicted of 6,249 offences.\nOne interesting side effect of Polish immigration has been a rise in neo-Nazi activity in the UK.\nDespite the growing amount of migrant crime, only a fraction of the criminals were deported. In 2014, the most recent year figures were available, a total of 5,286 migrants were deported – the bulk of them, however, were from outside the EU.\nThe shocking revelations come on the day Prime Minister David Cameron returns to Brussels to plead with European leaders not to water down and accept his ‘re-negotiation’.\nMr. Cameron, however, has repeatedly defended the principle of free movement, despite widespread public concern brought into focus by high levels of migrant crime.\nA Leave.EU spokesman told the Telegraph: “The public are being endangered and the law-abiding majority of immigrants are being given a bad name, worsening tensions in society – yet all the Prime Minister proposes to do is request a meaningless brake on the trivial question of EU passport-holders’ access to in-work benefits.”\nEU migrants can only be deported from Britain if they pose a “threat to public security, public policy or public health”.\nFor those that have been in Britain for more than five years the risk has to be considered “serious” for deportation to take place, while for those who have been in Britain for more than a decade the risk has to be considered “imperative”.\nSpeaking to the Telegraph, David Davis, a Tory MP and former shadow home secretary, said: “This is just a demonstration that freedom of movement means we can’t keep out people who we would wish to keep out in the public interest, or expel people we would wish to keep out in the public interest.\n“It is just one single example of the dysfunctional way the European Union works, in that it puts an esoteric principle ahead of the real interests of ordinary people.”","url":"https://www.breitbart.com/europe/2016/02/17/eu-migrant-crime-up-40-per-cent-700-offences-every-week/"}
