{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:23:24","date_modify":"2018-10-30 20:23:24","date_publish":"2015-05-08 20:03:12","description":"Pop singer Justin Bieber could have traded in his soft boy image to become a macho man pro wrestler last year, according to former World Wrestling Entertainment (WWE) creative team member Kevin Eck. |","filename":"data/vaneerConsumption/ReportJustinBieberCouldDebutasWWEWrestler.json","image_url":"https://media.breitbart.com/media/2015/05/Bieber-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_05_08__1540931004.html","title":"Report: Justin Bieber Could Debut as WWE Wrestler","title_page":"Report: Justin Bieber Could Debut as WWE Wrestler | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Pop singer Justin Bieber could have traded in his soft boy image to become a macho man pro wrestler last year, according to former World Wrestling Entertainment (WWE) creative team member Kevin Eck.\nOkay, maybe “macho” is an overreach, but Eck reported this week that Biebs was interested in stepping into a WWE ring last August to make his wrestling debut with stars John Cena and Big Show as part of a six-man match at the big SummerSlam event in Los Angeles, CA.\nTalks fell through, but Eck, who was part of the booking team working on a potential Bieber deal, did admit they were serious enough to leave him with concerns about the singer’s bad boy reputation, and said he feared the “Baby” singer’s involvement in a match could reflect negatively on both WWE and Cena.\nEck wrote:\nMy concern at the time was that Cena teaming up with Bieber — who was making headlines for all the wrong reasons and most definitely would have been booed unmercifully by the WWE audience — would not have done Cena, the face of the company, any favors. To address that concern, the creative suggestion was that Cena would become increasingly annoyed by Bieber in the weeks leading up to the match, but Big Show, who would be portrayed as Bieber’s friend, would repeatedly play peacemaker.\nWhile arguably no script could help 5′ 9″ Bieber believably attain champion status in the sport, Eck states an idea for the match would have seen Cena give Biebs an “attitude adjustment” after Biebs would take credit for a victory over the “babyfaces,” which likely would have been a more probable outcome in eyes of fans.\nBoxer and friend Floyd Mayweather’s fondness for the 21-year-old also reportedly quelled concerns about whether a potential Bieber match would be a bad PR move for the company. Eck reported: “The feeling from the powers that be was that if Mayweather liked him, then Bieber must be OK.”\n(Ironic, as Mayweather doesn’t exactly have a clean record, and according to Deadspin, has been the defendant in at least seven assault cases against five women that resulted in either arrests or citations.)\nEck also pointed out that Bieber’s name was mentioned on Raw a week ago, when wrestler Kane referred to wrestler Seth Rollins as the “Justin Bieber of WWE.”\nWhile there are no plans for a match, the former creative team member finished: “It certainly wouldn’t surprise me to see Bieber do something with WWE at some point.”","url":"https://www.breitbart.com/entertainment/2015/05/08/report-justin-bieber-could-debut-as-wwe-wrestler/"}
