{"authors":["David Martosko","Us Political Editor For Dailymail.Com In Des Moines"],"date_download":"2018-10-23 05:15:21","date_modify":"2018-10-23 05:15:21","date_publish":"2016-01-29 21:05:53","description":"'I heard it was awful! Really, just awful!' a well known GOP campaign communications consultant said Thursday. 'I mean, what are we going to do, have space heaters? On the ICE?'","filename":"data/vaneerConsumption/ReporterscoveringRepublicandebatewillhavetoworkinuniversityshockeyrinkAGAIN.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B5270B00000578-0-image-a-19_1454101539712.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423428_Back-Siberia-Reporters-covering-Republican-debate-week-work-university-s-frigid-hockey-rink-AGAIN_1540271721.html","title":"Reporters covering Republican debate will have to work in university's hockey rink AGAIN","title_page":"Reporters covering Republican debate will have to work in university's hockey rink AGAIN | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When reporters traveling to Manchester, New Hampshire arrive next week at the site of the next Republican primary debate, they might feel a familiar chill in the room.\nABC News and the Republican National Committee will park journalists in the frigid hockey rink at St. Anselm College, where they were forced to work during the December 19 Democratic debate.\n'Yes,' ABC spokeswoman Julie Townsend told DailyMail.com, 'the filing center and spin room are again in the Sullivan Arena at St Anselm.'\nThat's the scene of frozen toes and visible breath – and cold-cut catering – that reporters endured last time around, drawing hoots and hollers from journalists on Twitter.\nNOT AGAIN! This was the scene of the 'press filing center' for the Democratic debate on December 19 in Manchester, NH: a hockey rink where temperatures reached into the low 50s\nNOT A JOKE: ABC News foresaw the unpopularity of banishing reporters to Siberia, so it bought cases of artificial hand and foot warmers along\nBUNDLE UP: Journalists will be warned again to 'dress warmly' in the Sullivan Arena at St. Anselm College on February 6 when the Republican White House hopefuls square off\n'Bring a scarf!' tweeted one broadcaster.\n'It's so cold in the press filing center on the hockey rink at the dem debate they gave us toe warmers,' an online editor carped.\nABC did, in fact, provide artificial air-activated heat packs, and Townsend said in a cheerful email: 'We'll have hand warmers and foot warmers again!'\nInside the significantly balmier Republican debate headquarters Thursday afternoon in Des Moines, Iowa, GOP communications strategist Rick Gorka first let the cat out of the bag.\n'We're back on the ice rink next week,' he said with a grimace.\n'It's back to Siberia!' muttered a reporter nearby who asked not to be named.\nRecalling conversations he had with journalists in late December, Gorka shook his head and grimaced: 'I heard it was awful! Really, just awful!'\n'I mean, what are we going to do, have space heaters? On the ICE?'\nGorka is a veteran of the Romney and McCain presidential campaigns, and was familiar to reporters in the fall as he ran communications for the Ohio Republican Party when the GOP's first 2015 debate was held in Cleveland.\nAsked if he was aware he had just given birth to a news story about reporters being treated badly, Gorka's face broadened into a Grinch-like grin.\n'Go for it,' he said. 'Put some pressure on ABC.'\n'NOT A GOOD SIGN': Reporters hoping to come in from the cold in December quickly found out they would need to learn how to type while wearing winter gloves\nTHEY'LL BE WARMED UP: The eight presidential candidates who debated Thursday night will be toasty-warm on stage while reporters' teeth chatter on Feb. 6\n'YES': Trump intends to debate his rivals in New Hampshire, he said aboard his private Boeing 757 in Des Moines\nThe St. Anselm Hawks men's and women's ice hockey teams will both be playing road games on the day of the Feb. 6 debate. The men's squad will need the ice in solid playing condition by the 9th.\nThe first time ABC forced reporters to work atop a wooden floor dropped atop the ice rink, the network slipped the news into an otherwise boring press release two days ahead of time.\n'In order to accommodate everyone, the media filing center is on St. Anselm's hockey rink in the Sullivan Arena,' ABC advised. 'Please remember to dress warmly.'\nOne source of chilly temperatures reporters won't likely see is a cold shoulder from GOP front-runner Donald Trump, who boycotted Friday's debate in Iowa over claims that Fox News anchor Megyn Kelly had treated him unfairly.","url":"https://www.dailymail.co.uk/news/article-3423428/Back-Siberia-Reporters-covering-Republican-debate-week-work-university-s-frigid-hockey-rink-AGAIN.html"}
