{"authors":["John Nolte"],"date_download":"2018-10-30 18:18:34","date_modify":"2018-10-30 18:18:34","date_publish":"2018-07-10 14:38:00","description":"Supreme Court nominee Brett Kavanaugh allegedly mouthed the word \"bitch\" at an image of Hillary Clinton in 1997.","filename":"data/vaneerConsumption/ReportSCOTUSNomineeKavanaughAllegedlyCalledHillaryBtch20YearsAgo.json","image_url":"https://media.breitbart.com/media/2016/08/dil.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_10__1540923514.html","title":"Report: SCOTUS Nominee Kavanaugh Allegedly Called Hillary 'B*tch' 20 Years Ago","title_page":"Report: SCOTUS Nominee Kavanaugh Allegedly Called Hillary 'B*tch' 20 Years Ago | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Supreme Court nominee Brett Kavanaugh allegedly mouthed the word “bitch” at an image of Hillary Clinton during former President Bill Clinton’s 1997 State of the Union address.\n“I saw one of Ken Starr’s deputies, Brett Kavanaugh, who was sitting across from me, mouth the word bitch when the camera panned to Hillary,” Media Matters founder David Brock wrote in his 2002 book Blinded by the Right.\nThe excerpt from the book was tweeted by Robert Costa, a far-left reporter at the anti-Trump Washington Post.\nJudge Brett Kavanaugh is at or near top of SCOTUS list, per several people close to President Trump. But oppo research for possible hearings already moving fast. Sources pt'ing to David Brock's book \"Blinded by the Right.\" Kav alleged to have mouthed an expletive re HRC. Pg. 306. pic.twitter.com/k10MbCm4RR — Robert Costa (@costareports) July 2, 2018\nKavanugh would have been 32-years-old at the time, and according to Brock, he was sitting among friends at State of the Union viewing party held at Laura Ingraham’s town house.\nMouthing expletives at a television image of any politician, including Hillary Clinton, only proves that Kavanaugh is no different from 330 million other Americans.\nIt should be interesting to watch the establishment media attempt to gain some traction from this, the same establishment media that have now normalized the use of “cockholster” and “feckless cunt” over the last year; a media that have allowed their audiences to boo rape victims; a media that encourages and justified countless acts of violence against Trump supporters.\nThe other thing the media will never understand is this…\nMouthing “bitch” at an image of Hillary Clinton proves to the American people that Kavanaugh is human, is one of us; it makes him insanely relatable.\nThis is something the media have never grasped when it came to any public figure, and Trump is an excellent example.\nRegardless of whether you like Trump’s personality, regardless of his flaws, he is always Trump, always authentic, always 100 percent comfortable in his own skin. He is not pre-programmed like a Hillary or Marco Rubio, he is not a product of consultants like a John Kerry or Mitt Romney. Trump is Trump, and if you go back to the 1960 presidential election between John Kennedy vs. Richard Nixon, when television first began to truly matter, the alpha male who projects the most authenticity always wins.\nWhat’s more, does anyone believe Bill Clinton has not mouthed “bitch” at an image of Hillary now and again?\nNow try to imagine what Hillary has said about Bill.\nThe real headline here is “Trump Supreme Court Pick Kavanaugh Is Just Like the Rest of Us,” and in an era where the establishment media have lost all of their moral authority, all of their power to command the narrative, this desperate lurch at a man more than qualified to serve on the nation’s highest court is only going to help him.\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.","url":"https://www.breitbart.com/politics/2018/07/10/report-scotus-nominee-kavanaugh-allegedly-called-hillary-btch-20-years-ago/"}
