{"authors":["Neil Munro"],"date_download":"2018-10-30 19:09:08","date_modify":"2018-10-30 19:09:08","date_publish":"2018-06-29 20:05:25","description":"'A Sweeping and Thorough Revamp of Asylum' Rules to Block Migrants","filename":"data/vaneerConsumption/ReportAGSessionsIsRewritingAsylumRegulations.json","image_url":"https://media.breitbart.com/media/2018/06/central-american-asylum-seeking-family-stopped-border-patrol-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_06_29__1540926548.html","title":"Report: AG Sessions Is Rewriting Asylum Regulations","title_page":"Report: AG Sessions Is Rewriting Asylum Regulations | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Attorney General Jeff Sessions is drafting a regulation that will narrow the asylum rules and likely deter many people from taking the costly and risky step of migrating towards the United States, according to Vox.com.\nVox reported that read a draft of the regulation, which could be enacted by the end of the year:\nUnder the plan, people would be barred from getting asylum if they came into the US between ports of entry and were prosecuted for illegal entry. It would also add presumptions that would make it extremely difficult for Central Americans to qualify for asylum, and codify — in an even more restrictive form — an opinion written by Sessions in June that attempted to restrict asylum for victims of domestic and gang violence. … But as it exists now, the proposal is a sweeping and thorough revamp of asylum — tightening the screws throughout the asylum process. One source familiar with the asylum process but not authorized to speak on the record described the proposed changes as “the most severe restrictions on asylum since at least 1965” — when the law that created the current legal immigration system was passed — and “possibly even further back.”\nThe rules would deny asylum to Central Americans who did not seek asylum in Mexico, to people who enter the country illegally, and would narrow the definition for membership of s persecuted group, such as victims of spousal abuse or gang threats, according to Vox.com.\nThe rewrite may help deter and prevent most migrants from exploiting the 1997 Flores settlement and other “catch and release” loopholes which are now being used by huge numbers of Central American to move into the United States.\nMigration advocates voiced their hostility to the proposed reform.\n“Hard to express just how outraged I am at reading this,” said a tweet by Greg Siskind, an immigration lawyer. “It’s obscene and should upset any American who has an ounce of decency in them.”\n“Remember: the goal is just fewer immigrants and asylum seekers – period,” tweeted Todd Schulte, director of the FWD.us advocacy group for more white-collar immigration. He continued:\nNot legal or illegal Not actually fixing the asylum system Not about deporting “bad hombres” It is fewer immigrants and to make life as hard as possible for those here.\nSessions’ new regulations would not change the federal asylum law — but would merely the agencies’ interpretation of the law. He has already used his authority to change many aspects of the asylum process as he tries to reduce the backlog of 600,000 asylum cases.\nThe loose asylum process is favored by Democratic politicians because it ensures continued migration to the United States, and by business because it provides companies with more workers and more customers.\nIn 2017 and 2018, Democrats, business groups, and cheap-labor Republicans have blocked pro-American reform proposals in Congress.","url":"https://www.breitbart.com/midterm-election/2018/06/29/report-ag-sessions-rewriting-asylum-regulations/"}
