{"authors":["Trent Baker"],"date_download":"2018-10-30 21:27:00","date_modify":"2018-10-30 21:27:00","date_publish":"2015-06-16 16:05:47","description":"St. Louis Cardinals Under FBI Investigation for Hacking Houston Astros","filename":"data/vaneerConsumption/ReportStLouisCardinalsUnderFBIInvestigationforHackingHoustonAstros.json","image_url":"https://media.breitbart.com/media/2015/06/Cardinals616.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_06_16__1540934820.html","title":"Report: St. Louis Cardinals Under FBI Investigation for Hacking Houston Astros","title_page":"Report: St. Louis Cardinals Under FBI Investigation for Hacking Houston Astros | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The St. Louis Cardinals front office is being investigated by the FBI for hacking the internal database of the Houston Astros, named Ground Control, in order to steal information regarding players, according to The New York Times.\nInvestigators have uncovered evidence that the database, which was created by Astros general manager Jeff Luhnow, who used to work with the Cardinals and ran a similar database in St. Louis, has been hacked. It also appears that Luhnow used the same passwords in both places, making it easier to be hacked:\nThe intrusion did not appear to be sophisticated, the law enforcement officials said. When Mr. Luhnow was with the Cardinals, the organization built a computer network, called Redbird, to house all of their baseball operations information — including scouting reports and player personnel information. After leaving to join the Astros, and bringing some front-office personnel with him from the Cardinals, Houston created a similar program known as Ground Control. Investigators believe Cardinals officials, concerned that Mr. Luhnow had taken their idea and proprietary baseball information to the Astros, examined a master list of passwords used by Mr. Luhnow and the other officials who had joined the Astros when they worked for the Cardinals. The Cardinals officials are believed to have used those passwords to gain access to the Astros’ network, law enforcement officials said.\nMajor League Baseball has since issued a statement:\n“Major League Baseball has been aware of and has fully cooperated with the federal investigation into the illegal breach of the Astros’ baseball operations database. Once the investigative process has been completed by federal law enforcement officials, we will evaluate the next steps and will make decisions promptly.”","url":"https://www.breitbart.com/video/2015/06/16/report-st-louis-cardinals-under-fbi-investigation-for-hacking-houston-astros/"}
