{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:03:24","date_modify":"2018-10-30 20:03:24","date_publish":"2015-10-08 18:35:12","description":"Former Full House star John Stamos will be charged with driving under the influence of the date rape drug GHB, TMZ reports.","filename":"data/vaneerConsumption/REPORTJohnStamostobeChargedwithDrivingUndertheInfluenceofDateRapeDrug.json","image_url":"https://media.breitbart.com/media/2015/10/John-Stamos-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_08__1540929804.html","title":"REPORT: John Stamos to be Charged with Driving Under the Influence of Date Rape Drug","title_page":"REPORT: John Stamos to be Charged with Driving Under the Influence of Date Rape Drug | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Full House star John Stamos will be charged with driving under the influence of the date rape drug GHB, TMZ reports.\nStamos was arrested June 12 in Beverly Hills, CA after police spotted him driving erratically. The actor was reportedly “so out of it” he was handcuffed by police and then taken to an area hospital by paramedics.\nWhile hospitalized, he was cited for misdemeanor DUI, however it has been determined the common date rape drug GHB, along with another unnamed nonnarcotic, was found in his system.\nGHB is a narcotic sedative that is both odorless and colorless, and is often combined with alcohol and given to victims prior to sexual assaults, however the drug is also used to treat narcolepsy in small doses.\nSources close to Stamos told TMZ the actor was using the drug as a fitness supplement to “lean out mass.”\nGHB is often used by body builders, as it is believed the drug helps to stimulate growth hormones and help muscles recover.\nTMZ reports a criminal case against Stamos will be filed by the District Attorney soon, and documents from the case will outline which drugs were in his system at the time of his arrest.\nStamos wrote on Twitter the day after his arrest:\nThanks to everyone for their love & support. I'm home & well. Very appreciative of the BHPD & Cedars for their care. — John Stamos (@JohnStamos) June 13, 2015\nHe later spent a month in a rehab facility.\nStamos will reprise the role of Uncle Jesse Katsopolis on the upcoming Netflix reboot of the family-friendly show Fuller House.\nThe 52-year-old currently stars as Jimmy Martino, a lifelong bachelor who finds out he is both a father and a grandfather, on Fox network’s Grandfathered.","url":"https://www.breitbart.com/entertainment/2015/10/08/report-john-stamos-to-be-charged-with-driving-under-the-influence-of-date-rape-drug/"}
