{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:52:30","date_modify":"2018-10-30 19:52:30","date_publish":"2015-10-04 13:55:08","description":"Police have arrested four teenagers in Tuolumne, California in connection with a plot to shoot students at Summerville High School.","filename":"data/vaneerConsumption/ReportPoliceFoilCaliforniaSchoolShootingPlot.json","image_url":"https://media.breitbart.com/media/2015/10/Summerville-High-School-Band-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_04__1540929150.html","title":"Report: Police Foil California School Shooting Plot","title_page":"Report: Police Foil California School Shooting Plot | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Police have arrested four teenagers in Tuolumne, California in connection with a plot to shoot students at Summerville High School. The four allegedly had a list of intended victims and had planned to stockpile weapons, USA Today reports.\nThe students were arrested directly from school as they were identified. Stunned parents learned of the plot in the wake of the deadly mass shooting at Umpqua Community College in Roseburg, Oregon, though the plot was foiled beforehand.\nAccording to Tuolumne County Sheriff Jim Mele, the police were notified after fellow students at the high school noticed their classmates behaving oddly last Wednesday. Administrators notified law enforcement, who discovered a shocking plan. “They were going to come on campus and shoot and kill as many people as possible on the campus, said Mele, according to the Modesto Bee.\nMel said that there were no weapons found, but that the plot had been very near completion. “(They were) pretty dog-gone close. (Close) enough to keep me up last night, to keep my detectives and lieutenants up last night.” He credited trust within the community for enabling law enforcement to foil the plot, according to the Bee.\nTuolumne is a small town of fewer than 2,000 people in the eastern, mountainous region of the state.\nThis article’s opening paragraph has been corrected to reflect the fact that the suspects allegedly “planned to stockpile” weapons but had not yet actually done so.","url":"https://www.breitbart.com/politics/2015/10/04/report-police-foil-california-school-shooting-plot/"}
