{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:14:56","date_modify":"2018-10-30 21:14:56","date_publish":"2016-03-30 17:57:24","description":"As American TV studios continue to roll out racially diverse programming and explore methods for making the industry more inclusive of women, minorities, |","filename":"data/vaneerConsumption/ReportHollywoodDiversityPushFailsAbroadEmpireaGlobalFlop.json","image_url":"https://media.breitbart.com/media/2015/08/ap_taraji-p-henson-lee-daniels_ap-photo-e1459370440428-1024x796.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_03_30__1540934096.html","title":"Report: Hollywood Diversity Push Fails Abroad; 'Empire' a 'Global Flop'","title_page":"Report: Hollywood Diversity Push Fails Abroad; 'Empire' a 'Global Flop' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As American TV studios continue to roll out racially diverse programming and explore methods for making the industry more inclusive of women, minorities, and the LGBT community, global audiences are tuning out.\nA story published in the April 8 issue of The Hollywood Reporter magazine notes that Hollywood’s crusade to make TV more diverse has not been well received by foreign audiences, and popular TV programs, such as Fox’s mostly black Empire, have failed to catch on.\nAccording to THR, which describes Empire as a “global flop,” the show has been a colossal failure in international markets:\nIn the U.K., the first season drew a middling 717,000 viewers on Channel 4’s youth-oriented E4 network, a mere 3 percent share, and season 2 has been worse, averaging a 2.2 percent share with 595,000 viewers. The show first season averaged 181,000 viewers on Australia’s Channel Ten, prompting a shift to the smaller Eleven network, where season two has averaged just 77,000 viewers an episode. In Canada, broadcaster Rogers Media moved Empire off its free-TV network City after season two ratings dipped to 208,000 viewers, shifting the second half of the season to its online streaming service Shomi. While in Germany, Empire, which aired in primetime on Pro7, one of the country’s leading free-TV networks, attracted less than 1 million viewers per show and fewer than 4 percent of the national audience, a fraction of the channel’s regular draw.\nStateside, Empire has been a ratings juggernaut for Fox. At the end of the show’s first season in 2015, it was the first TV series in 20 years to increase its viewership week-over-week for the entire duration of a season.\nThe season finale was watched by an estimated 21.92 million people.\nDespite shows like Empire failing to secure an audience abroad, Sony Pictures TV casting director Dawn Steinberg praised Hollywood for embracing “color-blind casting.”\n“There used to be a time when it had to be written that way to look for an actor with a specific ethnicity,” said Steinberg. “Now it’s just who is the best actor for the role.”\nMarion Edwards, the president of international TV at Fox network, was among a group of TV insiders who told the publication international audiences are yearning for traditional American shows and have resisted the trend of color-blind casting.\nEdwards told THR: “These shows are a reflection of our society, but [they are] not a reflection of all societies … Having a diverse cast creates another hurdle for U.S. series trying to break through; it would be foolish not to recognize that. We are telling our units that they need to be aware that by creating too much diversity in the leads in their show means … problems having their shows translating to the international market.”\nRudiger Boss, whose company ProSiebenSat.1 acquired Empire for German TV, told the industry outlet he was disappointed the success of the show in the U.S. failed to translate to Germany.\n“I love the show and we took a big risk on it. But our courage was not rewarded,” said Boss.\nAside from the issue of diversity, a great deal of American programs have moved on from uncomplicated, episodic TV shows in favor of continuing story arcs, which are less popular in Europe, another insider explains.\nPhilipp Steffens, who heads one of Germany’s leading commercial networks, told THR: “Diversity is an issue with our audience, but it’s also the kind of shows coming out of the U.S. now — almost everything is serial, with long multi-episode story arcs, [and] that doesn’t work for us.”\nSteffens added he hopes eventually his audience will “get the kind of shows we used to from the U.S.”\nDespite their lack of international success, projects written specifically for non-white actors have exploded in recent months, and the trend does not appear to be going anywhere.\nNetflix announced in January that it had ordered a 13-episode all-Latino remake of Norman Lear’s classic series One Day At a Time, while earlier this month, CBS cast Person of Interest actress Sarah Shahi as the lead in its upcoming diverse Nancy Drew reboot pilot.\nShahi, who is of Iranian and Spanish ancestry, will play the classic white, teen character in a modern reboot, in which she will star as a NYPD detective in her mid-30s.\nCBS Entertainment president Glenn Geller had previously announced that white actresses were not being considered for the role of Nancy Drew.\n“She is diverse, that is the way she was written,” Geller told The Hollywood Reporter in January.\nStarz will also soon debut three new all-Latino television series. One of those shows, which is described as a supernatural thriller, will be set in Cuba.\nMeanwhile, CBS’s Rush Hour will debut on March 31.","url":"https://www.breitbart.com/entertainment/2016/03/30/report-foreign-audiences-resist-hollywood-diversity-push-empire-a-global-flop/"}
