{"authors":["Frances Martel"],"date_download":"2018-10-30 20:42:46","date_modify":"2018-10-30 20:42:46","date_publish":"2015-02-05 17:59:00","description":"Spain's new radical leftist party, Podemos (Spanish for \"We Can\"), is embroiled in a new corruption scandal, this time accused in a complaint by the attorney coalition Clean Hands (\"Manos Limpias\") funding itself with \"undeclared\" Venezuelan money acquired during \"diplomatic\" trips to the socialist nation. |","filename":"data/vaneerConsumption/ReportSpanishSocialistPartyFundedbyIllicitVenezuelanMoney.json","image_url":"https://media.breitbart.com/media/2015/02/podemos-iglecias-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_05__1540932166.html","title":"Report: Spanish Socialist Party Funded by Illicit Venezuelan Money","title_page":"Report: Spanish Socialist Party Funded by Illicit Venezuelan Money | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Spain’s new radical leftist party, Podemos (Spanish for “We Can”), is embroiled in a new corruption scandal, this time accused in a complaint by the attorney coalition Clean Hands (“Manos Limpias”) funding itself with “undeclared” Venezuelan money acquired during “diplomatic” trips to the socialist nation.\nThe complaint by Manos Limpias, notes El Universo, alleges that Venezuelan money helped fund Podemos’ “revolutionary propaganda,” and that it was introduced into Spain illicitly. “[Podemos Party Leader Pablo] Iglesias has made trips to Venezuela with the only objective of receiving undeclared funding… to support revolutionary propaganda activities,” said the group. The Venezuelan money “is remitted to Spain through diplomatic luggage and Venezuelan bureaucrats,” they allege.\nThe accusation shines an unfavorable light on Podemos in a two-fold way: as an anti-austerity, socialist party, its leaders have often called for higher taxes and redistribution of wealth. “Undeclared” money is not taxed, rendering their call for others to pay more hypocritical. Furthermore, ties with the Venezuelan government– whose socialist leader, Nicolás Maduro, has spent more than a year arresting political opponents and oppressing free speech– make Iglesias, who already has ties to the brutal Iranian regime, appear even more unsavory.\nThe complaint accuses Iglesias of ten different crimes, among them membership in a criminal organization, violations of labor laws, and “illicit association.” Regarding the funding of Podemos, the attorneys also allege that Iglesias has used his organization Mano Izquierda (“Left Hand”) as a “screen” to mask “diverse irregularities,” including employing individuals without notifying the Social Security office and violations of laws regarding non-profit organizations.\nThis is not the first time Podemos has been accused of such corruption. In June, Spain’s largest newspaper, El Pais, reported that Iglesias’ Center of Social and Political Studies organization had accepted at least 3.7 million Euros from the Venezuelan government since 2002. At the time, Iglesias denied that any money entering his organization was even funneled into Podemos, despite multiple individuals being members of the leadership of both.\nIglesias’s partner, Tania Sánchez– who is a member of the United Left party– has also been accused of corruption, initially denying and later admitting that she channeled a 137,000 Euro contract to her brother and a 425,000 Euro contract to an associate using her position in public office at the time (2008).\nThe corruption charges snowballing against Podemos could not arrive at a worse time for the leftist coalition. With the victory of the Coalition of the Radical Left (Syriza) in Greece, Podemos appeared poised to capitalize on the anti-EU, anti-austerity attitude that had made a man so far to the left that he named his son after Che Guevara to become Prime Minister of Greece. Last weekend, Podemos managed to attract up to 100,000 people to a rally in Madrid. Polls show, however, that they are not close to defeating the center-right Popular Party in the next election cycle, and a news cycle full of corruption for a party selling itself as the solution to the corruption of political elites may be its death knell.","url":"https://www.breitbart.com/national-security/2015/02/05/report-spanish-socialist-party-funded-by-illicit-venezuelan-money/"}
