{"authors":["Ian Hanchett"],"date_download":"2018-10-30 19:57:22","date_modify":"2018-10-30 19:57:22","date_publish":"2015-03-14 00:31:12","description":"Drew Griffin expanded on his prior report on VA wait times in Los Angeles, saying thousands were waiting months for an appointment","filename":"data/vaneerConsumption/ReportThousandsofVAPatientsWaitingMoreThan3MonthsforAppointment.json","image_url":"https://media.breitbart.com/media/2015/03/CNN-VA-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_03_13__1540929442.html","title":"Report: 'Thousands' of VA Patients Waiting More Than 3 Months for Appointment","title_page":"Report: 'Thousands' of VA Patients Waiting More Than 3 Months for Appointment | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN Senior Investigative Correspondent Drew Griffin expanded on his prior report on VA wait times in Los Angeles, saying that “thousands of patients at the greater Los Angeles veterans medical centers have been waiting more than 3 months just for an appointment” on Friday’s “AC360”\n“Thousands of patients at the greater Los Angeles veterans medical centers have been waiting more than 3 months just for an appointment. The detailed evidence comes from the VA’s own documents obtained by CNN and confirmed by medical and administrative sources inside the greater LA VA hospital system. New patients seeking care are forced to wait the longest, sometimes months to see a doctor. Records show this January 15th, more than 1600 veterans who were new patients were waiting 60 to 90 days for an appointment. Another 400 veterans had been waiting up to six months, and the documents provided to CNN show the lengthy wait times are still happening” Griffin stated.\nHe also reported that claims made by LA VA official Dr. Skye McDougall in her testimony before Congress that the average wait time for a new patient was four days is “simply not true. According to these VA documents, and a half dozen doctors and administrators within the hospital who spoke to CNN, the average wait time is ten times greater. It’s not four days. it’s 44 days. The delays are even taking place at the Los Angeles clinic for mental health, where documents show more than 300 veterans seeking mental health care have been waiting 30, 60, even 90 days.”\nGriffin added that McDougall’s claims that the average wait time for new mental heath patients is also “not true. This chart shows as of March 1st new mental health patients in Los Angeles are waiting an average of 36 days just to get an appointment.”\nHe concluded, “Los Angeles, VA officials wouldn’t talk to CNN about the discrepancies, instead, sent a statement explaining the report given to CNN ‘does not include same-day appointments or in some cases, same-week appointments for those veterans who need care quickly.’ ‘New patients,’ the v.a. told us, ‘typically account for less than 10% of all Veteran appointments and are not representative of the whole patient population.’ The VA also is sticking by its own math that new vets waited just 4 days for appointments in January, just 8 days in March. The real truth, say the doctors and administrators CNN has interviewed, is wait times for patients at the Los Angeles VA medical centers extends into weeks and months, and are a serious problem.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2015/03/13/report-thousands-of-va-patients-waiting-more-than-3-months-for-appointment/"}
