{"authors":["Portia Crowe"],"date_download":"2018-10-30 23:16:10","date_modify":"2018-10-30 23:16:10","date_publish":"2016-12-08 00:00:00","description":"The stock jumping on the news.","filename":"data/vaneerConsumption/REPORTTimeInchiresbankerstofieldtakeoveroffers.json","image_url":"https://amp.businessinsider.com/images/5849c2f5e02ba734008b82b8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_time-inc-hires-bankers-2016-12_1540941370.html","title":"REPORT: Time Inc hires bankers to field takeover offers","title_page":"    REPORT: Time Inc hires bankers to field takeover offers - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Rick Wilking Time Inc., the publisher of People, Fortune, and Sports Illustrated magazines, has hired Morgan Stanley and Bank of America to help it deal with takeover offers, The Wall Street Journal reports.\nThe stock jumped more than 8% on the news.\nTime Inc was reportedly approached by the billionaire investor Edgar Bronfman Jr. in November but rejected the takeover offer.\nBronfman, together with billionaire Len Blavatnik's Access Industries and the Israeli businessman Ynon Kreiz, offered $18 per share, the New York Post reported, valuing Time Inc. at $1.78 billion. That's a 30% premium to Time's closing price of $13.80 before the offer.\nMarkets Insider\nBronfman is a managing partner at the private-equity firm Accretive LLC. A former chief executive of Warner Music Group, he has a long history in the media and entertainment world. His family made its fortune from Seagram's, once the largest distiller of alcoholic beverages in the world.\nTime Inc., like many publishers, has been hit by a decline in print ad sales as advertisers spend more on other media and readers increasingly move online.\nDigital advertising has been the lone bright spot for the company, with revenue rising 63% in the latest quarter.","url":"https://www.businessinsider.com/time-inc-hires-bankers-2016-12"}
