{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:06","date_modify":"2018-10-30 17:53:06","date_publish":"2016-09-05 23:30:31","description":"Nigerian President Muhammadu Buhari declared that the war against Boko Haram was \"over,\" but they still struggle against their influence.","filename":"data/vaneerConsumption/ReportBokoHaramLargelyResponsibleforPolioResurgenceinNigeria.json","image_url":"https://media.breitbart.com/media/2016/09/polio-vaccine-nigeria-ap-images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_05__1540921986.html","title":"Report: Boko Haram 'Largely Responsible' for Polio Resurgence in Nigeria","title_page":"Report: Boko Haram 'Largely Responsible' for Polio Resurgence in Nigeria | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Nigerian President Muhammadu Buhari may have declared that the war against Boko Haram was “over” in December, but the nation continues to struggle against the Islamic State affiliate’s influence in the region. In addition to experiencing waves of terror attacks and abductions, northern Nigeria is seeing a growing number of polio cases this year.\nThe Associated Press (AP) confirms, citing the World Health Organization (WHO), that Nigeria has documented its third case of polio this year in northeastern Borno state, the operating headquarters of Boko Haram. AP\nAP notes that the third case joins two confirmed in August, “Nigeria’s first reported polio cases in more than two years.” Nigeria had only recently been declared officially polio-free, though the WHO has clarified that the discovery of these cases suggests that the virus “has been circulating for five years” in the region, during the beginning of Boko Haram’s reign of terror.\nIn a report from the ground in Nigeria, AP notes that Boko Haram’s presence in the region is a driving factor in the resurgence of the disease, which affects children and causes severe paralysis. Before Boko Haram, Muslim leaders were responsible for a polio resurgence after imams began preaching to their mosques that Western polio vaccines were part of a secret plot to sterilize Muslims.\n“Boko Haram is largely responsible for the insecurity that has hamstrung vaccination efforts in Nigeria,” the intelligence agency Stratfor confirmed in a report cited by the AP. Boko Haram has taken over large areas of Borno State, abducting women and children and hiding them in the dense Sambisa forest, where they receive no medical care and can easily infect each other with polio or any other virus.\nThe Nigerian government has responded to the return of polio with plans for a major vaccination campaign. The Nigerian newspaper Vanguard quotes UNICEF spokesperson Priyanka Khanna as stating that Buhari’s government has “moved into emergency outbreak response mode” and will be sending out medical teams to vaccinate children in remote, rural locations near the Lake Chad area, where the Islamic State affiliate is present.\nBoko Haram, whose name roughly translates to “Western education is forbidden,” oppose Western medicine and have attacked medical convoys to prevent vaccination in the past. They now officially goes by the name “Islamic State West Africa Province” (ISWAP) since pledging allegiance to Islamic State caliph Abu Bakr al-Baghdadi.\nThe concern that an Islamist terrorist insurgency would set back medical advances in the region has been present for years and was especially vocal in the aftermath of the abduction of hundreds of schoolgirls from Chibok, Borno, in April 2014. Abuja has yet to find and liberate the girls, with their families receiving only periodic updates on their well-being in the form of propaganda videos. In the latest video, the terrorists displayed the bodies of girls they claim had been killed by Nigerian government airstrikes on Boko Haram positions.\n“The problems [of Boko Haram and polio] are intertwined,” medical anthropologist Elisha Renne told Canada’s CBC in 2014. “The solution to one is going to contribute to the solution of the other.” At the time, Nigerian officials were touting significant progress in the fight against polio, but experts were concerned that Boko Haram would attack medical workers and prevent them from reaching at-risk areas.\nThat scenario is now playing out in Borno. “Each case of paralysis caused by polio usually means there are at least another hundred cases of polio without symptoms nearby,” Vice News reported in August when the first two polio cases in Borno were reported. There is no way to estimate how many children among those abducted by Boko Haram or born to their sex slaves are affected by this potential outbreak.\nThat Boko Haram is a significant, if not the most significant, factor in the resurgence of polio in Borno challenges the Nigerian government’s repeated claims that they have been defeated and are no longer a threat to Nigeria. Upon assuming the office of the presidency in 2015, President Buhari gave the military an ultimatum: they had to eradicate Boko Haram by December. That month, Buhari told the BBC that “technically, we have won the war” against Boko Haram.\nIt took less than a month for Boko Haram to stage another series of raids in Borno’s remove villages, forcing the Nigerian army’s chief of staff Lt. General Tukur Buratai to issue a statement assuring Nigerians that the attacks did not mean that Boko Haram was not “defeated.” The terrorists have been defeated; these criminals may rear their ugly heads through other means. We will continue to maintain vigilance,” Buratai claimed.\nThe ISIS affiliate continued to attack in the marketplaces of Borno’s capital, Maiduguri, and in the remote villages. By the summer, the Nigerian military began declaring victory against Boko Haram all over again, rather than reasserting the victory claim in December. “We have come to the point that we can beat our chest and decisively say we have dealt with Boko Haram,” spokesman Col. Sani Usman said in July, with no mention of the similar declaration in December. A month later, army officials claim Abubakar Shekau, the leader of Boko Haram, had been “fatally wounded” — a claim the Nigerian military has made dozens of times since 2009 — though that claim was later rescinded.","url":"https://www.breitbart.com/national-security/2016/09/05/boko-haram-conquests-lead-spread-polio-nigeria/"}
