{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:10","date_modify":"2018-10-30 17:53:10","date_publish":"2015-07-28 16:39:49","description":"Boko Haram has reportedly requested \"peace talks\" of Nigeria, hoping to trade in weapons for some clemency from President Muhammadu Buhari.","filename":"data/vaneerConsumption/ReportFactionofBokoHaramApproachesNigeriaforPeaceTalks.json","image_url":"https://media.breitbart.com/media/2015/01/Boko-Haran-Leader-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_28__1540921990.html","title":"Report: 'Faction' of Boko Haram Approaches Nigeria for Peace Talks","title_page":"Report: 'Faction' of Boko Haram Approaches Nigeria for Peace Talks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A group of Boko Haram fighters has reportedly approached the Nigerian government requesting “peace talks,” hoping to trade in their weapons for some clemency from President Muhammadu Buhari, despite the group’s mass murder of thousands of Nigerians in village raids and suicide bombings.\nReuters is reporting that a person claiming to represent a faction of Boko Haram has contacted the Buhari government requesting peace negotiations. “A faction of the Boko Haram group came forward claiming to have the mandate to negotiate with the government,” according to presidential spokesman Garba Shehu. He noted that the government had yet to confirm whether the group was a legitimate wing of Boko Haram and the representative was, in fact, tied to the group, but that officials were working to “verify these claims.”\n“It is now left for them to show proof that they have the mandate, but they made it clear that they are representing a faction of Boko Haram that wants peace,” Shehu added.\nWhile Reuters claims the government has been merely approached by a group asking to sit at a negotiating table, some Nigerian outlets are claiming that talks have already begun. Nigeria’s Daily Post, citing The Nation, reports that “preliminary talks” between some Boko Haram leaders and the Buhari administration are underway. That report claims that up to 500 Boko Haram jihadists “in a neighboring country” have decided they want to hand over their arms and stop fighting, but are seeking to negotiate their freedom before they put down their weapons. Buhari, it continues, is hesitant to begin negotiations and hopes to avoid the “costly mistakes of the past administration of ex-President, Goodluck Jonathan.” Jonathan attempted talks with Boko Haram multiple times and failed.\nBoko Haram attempted to establish talks with Nigerian officials in 2012, talks that eventually collapsed. At the time, a Boko Haram representative identified as Abu Mohammed Ibn Abdulaziz demanded the talks be brokered by a perennial presidential candidate and long-forgotten military ruler: Muhammadu Buhari.\nBoko Haram has since experienced a major shift in leadership. Its nominal leader, Abubakar Shekau, has not been seen in videos for months, following a claim by the Nigerian military that they had killed him. Even if they have not, the group is no longer a rogue jihadist operation, but a wing of the world’s largest terrorist organization, the Islamic State, and has since been renamed Islamic State West Africa Province (ISWAP). Whether the individuals hoping to establish talks with the government are defecting because of the new administration is unknown.\nAs a presidential candidate, Buhari categorically denied that he would ever entertain peace talks with Boko Haram. “Boko Haram is not interested in peace – if they are interested in peace how can they kill 13,000 Nigerians?” he said in an interview with the BBC in February. Since he become president, his high-ranking officials have hinted at the possibility of talks. Senior adviser Femi Adesina told the BBC in early July that the government “can’t rule out” peace talks: “if they were willing, why not?” He added the caveat that he did not believe Boko Haram would, in good faith, want peace talks with Nigeria.","url":"https://www.breitbart.com/national-security/2015/07/28/report-faction-of-boko-haram-approaches-nigeria-for-peace-talks/"}
