{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:23:34","date_modify":"2018-10-30 18:23:34","date_publish":"2018-08-13 16:00:34","description":"Google reportedly tracks your physical movements even if you select privacy settings which are supposed to stop it from doing so.","filename":"data/vaneerConsumption/ReportGoogleIsTrackingYourLocationEvenifYouTellIttoStop.json","image_url":"https://media.breitbart.com/media/2017/01/google-eye-reflection-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_13__1540923814.html","title":"Report: Google Is Tracking Your Location Even if You Tell It to Stop","title_page":"Report: Google Is Tracking Your Location Even if You Tell It to Stop | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Google is reportedly tracking your physical movements with your smartphone even if you select privacy settings which are supposed to stop it from doing so.\nAccording to the Associated Press, who launched an investigation into the tracking, it “found that many Google services on Android devices and iPhones store your location data even if you’ve used a privacy setting that says it will prevent Google from doing so.”\n“Computer-science researchers at Princeton confirmed these findings at the AP’s request,” it continued, adding that, “Storing your minute-by-minute travels carries privacy risks and has been used by police to determine the location of suspects — such as a warrant that police in Raleigh, North Carolina, served on Google last year to find devices near a murder scene.”\nDespite Google claiming that you can turn off the tracking, the Associated Press revealed that this is not true, and even “with Location History paused, some Google apps automatically store time-stamped location data without asking.”\n“If you’re going to allow users to turn off something called ‘Location History,’ then all the places where you maintain location history should be turned off,” expressed Jonathan Mayer, a former chief technologist for the Federal Communications Commission. “That seems like a pretty straightforward position to have.”\nIn a statement, Google defended their tracking, and proclaimed, “There are a number of different ways that Google may use location to improve people’s experience, including: Location History, Web and App Activity, and through device-level Location Services. We provide clear descriptions of these tools, and robust controls so people can turn them on or off, and delete their histories at any time.”\nIn February 2018 Tucker Carlson revealed that placing an Android phone in airplace mode or disconnecting it from the network would not stop it from tracking location.\nThe governments of South Korea and the U.K. investigated Google for tracking users’ locations without their knowledge in 2017. Breitbart News has reported on the issue of cell phone tracking for years and will continue to explore the ways in which the Masters of the Universe attempt to gather an ever-increasing range of data on its users.","url":"https://www.breitbart.com/tech/2018/08/13/report-google-is-tracking-your-location-even-if-you-tell-it-to-stop/"}
