{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:47:17","date_modify":"2018-10-30 19:47:17","date_publish":"2015-02-25 15:23:13","description":"Saudi Arabia officials have expressed in private that they may be willing to help out in an Israeli attack on Iran’s nuclear facilities in the near future, according to European sources who told Israel’s Channel 2 News. |","filename":"data/vaneerConsumption/ReportSaudisExpressInterestinAidingIsraelAttackOnIranNukeSites.json","image_url":"https://media.breitbart.com/media/2015/02/Iran-nuke-reactor-bike-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_25__1540928837.html","title":"Report: Saudis Express Interest in Aiding Israel Attack On Iran Nuke Sites","title_page":"Report: Saudis Express Interest in Aiding Israel Attack On Iran Nuke Sites | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Saudi Arabia officials have expressed in private that they may be willing to help out in an Israeli attack on Iran’s nuclear facilities in the near future, according to European sources who told Israel’s Channel 2 News.\nSaudi Arabia’s eastern border with the Persian/Arabian Gulf is located only about 100 miles from Iranian territory, including its Bushehr nuclear site. The Saudis may allow the Israel Air Force (IAF) to fly over their tactically-important airspace as part of its cooperative efforts, according to reports.\nThe TV report added,“The Saudis have declared their readiness for the Israeli Air Force to overfly Saudi airspace en route to attack Iran if an attack is necessary.”\n“The Saudi authorities are completely coordinated with Israel on all matters related to Iran,” a European official in Brussels told Channel 2 on Tuesday, before adding that Israel and Saudi Arabia are actively sharing intelligence on the progress of the Iranian nuclear program.\nThe report adds that in order for the Saudis to sign off on any deal, they would want to first see “some sign of progress” in the ongoing peace talks between Israeli and Palestinian officials.\nRegional governments have long been concerned that if Iran were to develop nuclear weapons, the result would inevitably be that massive nuclear proliferation would occur throughout the Middle East. Several countries, including Saudi Arabia, Egypt and Jordan, have all spoken to the possibility that an uncertain future may necessitate the acquisition of nuclear weapons.\nThe news comes as the P5+1 world powers have been seeking to seal a comprehensive agreement with Iran in hopes that a diplomatic approach would stop the Ayatollah’s regime from developing nuclear weapons. They face a March 31 deadline to agree to a basic framework for the agreement.\nIsraeli Prime Minister Benjamin Netanyahu is set to address a joint session of Congress on March 3rd, where he will reportedly warn about the grave threat posed by a nuclear-weaponized Iranian regime.","url":"https://www.breitbart.com/national-security/2015/02/25/report-saudis-express-interest-in-aiding-israel-attack-iran-nuke-sites/"}
