{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:47:55","date_modify":"2018-10-30 19:47:55","date_publish":"2015-03-12 02:26:52","description":"At least 12 Democratic Congressmen agreed to meet Iranian officals at the behest of NIAC President Trita Parsi, according to Hassan Dai.","filename":"data/vaneerConsumption/ReportDemRepsMetwithIranianRegimetoSabotageGeorgeWBush.json","image_url":"https://media.breitbart.com/media/2015/03/National-Iranian-American-Council-President-Trita-Parsi-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_11__1540928875.html","title":"Report: Dem Reps Met with Iranian Regime to Sabotage George W. Bush","title_page":"Report: Dem Reps Met with Iranian Regime to Sabotage George W. Bush | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Between 2006 and 2007, at least twelve Democratic Congressmen agreed to meet with Iranian officials in the Ayatollah’s regime at the behest of National Iranian American Council (NIAC) President Trita Parsi, according to a report by Hassan Dai of the Iranian American Forum.\nParsi allegedly solicited the help of current Iranian Foreign Minister Javad Zarif, who was Iran’s Ambassador to the UN at the time. Zarif is now one of the lead negotiators for Iran’s nuclear program on behalf of the Islamic republic.\nThe NIAC leader—who, this report claims, was actively engaged in sabotaging American foreign policy with regard to Iran—said at the time:\nThese [Democratic Party] members are very disillusioned with the Bush foreign policy and are tired to sit on the sidelines as Bush undermines the US’s global position. As a result, they are willing to take matters in their own hands and they accept the political risk that comes with it.\nThe aforementioned email correspondence was only made available after NIAC attempted to sue Iranian journalist Hassan Dai for defamation. Dai’s work demonstrated, quite convincingly, that NIAC had allegedly become the Washington D.C. political lobby for the Iranian regime.\nIn 2006, Parsi and his group started a campaign called the “Iran Negotiation Project,” where NIAC would help to link up Democratic Congressmen with the state-sponsor of terrorism. Dai reports that NIAC arranged for a group of 12 Democrat “Congress members that opposed Bush’s policy toward Iran” and that they “met regularly to coordinate their efforts and planned to meet members of the Iranian parliament.”\nRecently, NIAC bought a full page ad in the New York Times in a failed attempt to pressure Congress to oppose Israeli Prime Minister Benjamin Netanyahu’s March 3 speech to Congress. “In a slimy ad, pro-Iranian pressure group plays the disloyalty card,” Jeff Jacoby of the Boston Globe described the NIAC smear campaign against Israel.\nBreitbart News has reported on NIAC’s troubling ties to the Iranian regime. Leaders of Iran’s Green Movement and other anti-regime organizations have often described NIAC as “following the path of the regime” and “lobbying secretly” for “the Islamic republic.”","url":"https://www.breitbart.com/national-security/2015/03/11/report-dem-reps-met-with-iranian-regime-to-sabotage-george-w-bush/"}
