{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:18:50","date_modify":"2018-10-30 21:18:50","date_publish":"2017-02-09 18:56:50","description":"A Palestinian terrorist who wounded five people when he opened fire was reportedly subdued by Israeli civilians using a sewing machine.","filename":"data/vaneerConsumption/ReportPalestinianTerroristSubduedwithSewingMachine.json","image_url":"https://media.breitbart.com/media/2017/02/sewing-machine.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_09__1540934330.html","title":"Report: Palestinian Terrorist Subdued with Sewing Machine","title_page":"Report: Palestinian Terrorist Subdued with Sewing Machine","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A Palestinian terrorist who wounded five people when he opened fire near an outdoor market and bus stop was reportedly subdued by Israeli civilians using a sewing machine.\nThe attack took place in the central Israeli city of Petah Tikva, located about eight miles from Tel Aviv.\nThe terrorist was identified as an 18 year old Palestinian resident of the northern West Bank city of Nablus, which is a known stronghold for militants associated with Palestinian Authority Mahmoud Abbas’s Fatah Party. There was no immediate claim of responsibility for the attack.\nThe Times of Israel reported that the man’s weapon jammed multiple times during the attack:\nThe Palestinian teenager used a Carlo-style submachine gun, a comparatively cheap improvised firearm, which is prevalent in the West Bank. Carlos, which are often cobbled together from water pipes and spare parts, are notoriously unreliable, and the weapon used in the attack apparently jammed multiple times.\nWhat is normally an automatic weapon was only able to fire a shot every few seconds, according to videos from the scene. An eyewitness told Walla news that the gunmen also entered a shop and tried to open fire, but his gun wouldn’t work at all.\nThe incident occurred at the entrance to the city’s busy central market, which was crowded with people shopping ahead of Shabbat.\nIsrael’s Ynetnews website reported the terrorist opened fire at civilians waiting at a bus station and strolling at an outdoor market before he was subdued using a sewing machine.\nYnet reported:\nHe then turned right on Montefiore, continuously shooting. People chased him down, attempting to neutralize him. When the terrorist reached a sewing machine shop, he started attacking people with a screwdriver after his firearm, a makeshift rifle, jammed.\nSome of the people finally managed to neutralize the terrorist by throwing a sewing machine at him. Eye witnesses said that while he was lying on the ground, neutralized, he kept screaming, “Help, help.”\n… “I heard gunfire and people shouting ‘Terrorist, terrorist!’ The terrorist ran and I chased him for two or three blocks with four other people,” Avi Asaf, who was stabbed by the terrorist, recounted from his hospital bed.\nThe terrorist entered a sewing machine store and Asaf followed. “He took two screwdrivers and tried to stab me. I took a chair to stop him. Somehow he managed to stab me in the ear and neck.”\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2017/02/09/report-palestinian-terrorist-subdued-sewing-machine/"}
