{"authors":["Valentina Za"],"date_download":"2018-10-31 00:16:38","date_modify":"2018-10-31 00:16:38","date_publish":"2016-12-02 00:00:00","description":"Italy is discussing the terms of a state bailout of the ailing bank Monte dei Paschi that could be launched next week if needed, Corriere della Sera reports.","filename":"data/vaneerConsumption/REPORTTheworldsoldestbankcouldbeonthebrinkofabailout.json","image_url":"https://amp.businessinsider.com/images/58417a21dd089538448b46db-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_reports-suggest-the-italian-government-has-asked-to-bailout-monte-dei-paschi-di-siena-2016-12_1540944998.html","title":"REPORT: The world's oldest bank could be on the brink of a bailout","title_page":"    Report: Italian government seeks Monte dei Paschi di Siena bailout - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The headquarters of Banca Monte dei Paschi di Siena. Will Martin/Business Insider MILAN — Italy is discussing with the European Commission the terms of a state bailout of the ailing bank Monte dei Paschi that has already been requested and could be launched next week if needed, the Italian daily Corriere della Sera reported on Friday.\nItaly's third-largest bank needs to raise 5 billion euros ($5.3 billion) by the end of the year to plug a capital shortfall identified by European Central Bank stress tests or face the risk of being wound down.\nQuoting sources with knowledge of the matter, Corriere said Italy had already filed a request to launch a public recapitalization of Monte dei Paschi as early as next week.\nThe newspaper reported that the Commission was willing to limit the burden on shareholders and subordinated bondholders and that it was being discussed to what extent retail investors who held subordinated bonds could be spared.\nA Commission spokesman declined to comment. Treasury representatives were not reachable for immediate comment.\nThe bank's finance chief, Francesco Mele, said this week that the Commission was expected to agree that only shareholders and junior bondholders share the bank's losses before Monte dei Paschi is given any state aid.\nNew EU rules on state aid to banks require investors to take a hit before lenders tap public money, but a lighter version of the rules can apply in cases such as Monte dei Paschi's.\nSources told Reuters last week that authorities would apply European Union rules with flexibility with regard to a Monte dei Paschi bailout to avoid damage to the entire Italian banking system.\nA debt-to-equity swap aimed at reducing the size of a share sale ends Friday, with Monte dei Paschi planning to launch its share issue after Italy's referendum on constitutional reform this Sunday.\nThe share sale is widely expected to be shelved if Italian voters reject the proposed reform, prompting the government to resign and fueling political instability and market jitters.","url":"https://www.businessinsider.com/reports-suggest-the-italian-government-has-asked-to-bailout-monte-dei-paschi-di-siena-2016-12"}
