{"authors":["Caroline May"],"date_download":"2018-10-30 22:15:23","date_modify":"2018-10-30 22:15:23","date_publish":"2016-01-28 20:29:47","description":"The Hillary Clinton presidential campaign abruptly changed the location of a recent fundraiser when it realized that the Hillsborough, CA home organizers |","filename":"data/vaneerConsumption/ReportClintonCampaignMovedFundraiserfromSteinleFamilyLawyersHome.json","image_url":"https://media.breitbart.com/media/2016/01/hillary-clinton-DAVID-BECKER-REUTERS-and-Kathryn-Steinle.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_28__1540937723.html","title":"Report: Clinton Campaign Moved Fundraiser from Steinle Family Lawyer’s Home","title_page":"Report: Clinton Campaign Moved Fundraiser from Steinle Family Lawyer’s Home | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Hillary Clinton presidential campaign abruptly changed the location of a recent fundraiser when it realized that the Hillsborough, CA home organizers initially chose to host the event belonged to an attorney suing the city of San Francisco on behalf of the family of Kathryn Steinle.\nThe San Francisco Chronicle reports organizers for the $1,000 per person “Hillary for America” fundraiser hosted by former President Bill Clinton had chosen to hold the event at the home of Frank Pitre.\nPitre is a lawyer for the family of Kathryn Steinle, the 32-year-old woman who was murdered last summer on a San Francisco Pier. The alleged shooter is a multiple deportee, multiple felon illegal immigrant who the San Francisco Sheriff’s Department had released from custody after ignoring an immigration hold.\nThe murder sparked a national uproar over sanctuary city policies and criminal immigrants. The largely Republican-led outcry led to anti-sanctuary city legislation and helped to bolster GOP presidential candidate Donald Trump’s arguments against illegal immigration. The Steinle family has since sued the local and federal entities they say contributed to her murder.\nThe Chronicle reports that the Secret Service had even inspected the home when organizers realized Pitre’s connection to the Steinle case and quickly looked to move the event. “Faster than you can yell ‘Fox News,’ the Clinton campaign was on the phone with local organizers to find someplace besides Pitre’s home for the fundraiser Monday night,” the paper said.\nInstead of the Steinle lawyer’s home, Clinton fundraiser was held at Rep. Jackie Speier’s (D-CA) house. According to the Chronicle, “No matter the location, Speier tells us, Bill Clinton ‘met everyone’s expectations and then some’— speaking nonstop for 45 minutes, plus spending an hour posing for photos and answering questions in a rope line.”","url":"https://www.breitbart.com/politics/2016/01/28/clinton-campaign-moved-fundraiser-from-steinle-family-lawyers-home/"}
