{"authors":["John Hayward"],"date_download":"2018-10-30 19:17:09","date_modify":"2018-10-30 19:17:09","date_publish":"2018-06-27 17:33:04","description":"An analysis of satellite imagery by watchdog group 38 North published on Tuesday concluded that “improvements to the infrastructure at North Korea’s Yongbyon Nuclear Scientific Research Center are continuing at a rapid pace,” even as North Korea ostensibly negotiates a denuclearization agreement.","filename":"data/vaneerConsumption/ReportNorthKoreaContinuesUpgradingNuclearReactorDuringNegotiations.json","image_url":"https://media.breitbart.com/media/2018/03/wi/ap/28/3jvf1f_north-korea-nuclear-site-60266-in-27-2008-file-photo-television-60-foot-tall-e1522265560326.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_06_27__1540927029.html","title":"Report: North Korea Continues Upgrading Nuclear Reactor During Negotiations","title_page":"Report: North Korea Continues Upgrading Nuclear Reactor During Negotiations","title_rss":"NULL","source_domain":"breitbart.com","text":"An analysis of satellite imagery by watchdog group 38 North published on Tuesday concluded that “improvements to the infrastructure at North Korea’s Yongbyon Nuclear Scientific Research Center are continuing at a rapid pace,” even as North Korea ostensibly negotiates a denuclearization agreement.\n38 North cushioned the blow of this observation by noting that while new construction has clearly been undertaken at the site, the operational status of the reactor is “difficult” to determine. Some of the new construction appears to be office facilities, including what might be a new hospitality building for senior officials, but a modification to the reactor’s cooling system has also been completed.\nDredging and earthmoving operations around the Kuryong River, which provides cooling water to the reactor, appear to be ongoing as well. This would suggest engineers want to provide more water if the reactor’s activity level is increased in the future.\nActivity has been noted at the facility where plutonium for weapons is separated from spent reactor fuel, but it was difficult for analysts to determine exactly what the trucks parked outside were doing.\n38 North’s analysts pointed out that since detailed information about the layout of the reactor site and previous activities is hard to come by, it is exceptionally difficult to deduce the purpose of new construction. In other words, since the exact purpose of many existing structures is unknown, it is tough to say what the new buildings are for.\nAndrea Berger of the Middlebury Institute of International Studies gave the Wall Street Journal a pessimistic read on 38 North’s report:\nThese infrastructure developments provide limited insight into the future direction of North Korea’s nuclear program. However, they highlight the likelihood that North Korea has not pressed pause on its general nuclear and missile activities while talks are ongoing.\n38 North’s conclusions were slightly less grim, effectively chalking the construction up to North Korean bureaucratic inertia, saying, “Continued work at the Yongbyon facility should not be seen as having any relationship to North Korea’s pledge to denuclearize. The North’s nuclear cadre can be expected to proceed with business as usual until specific orders are issued from Pyongyang.”\n38 North Managing Editor Jenny Town split the difference between optimism and pessimism by stating the new satellite photos underscore “the reason why an actual deal is necessary, not just a statement of lofty goals.”\nA corollary of this observation is that North Korea has every reason to keep its nuclear pots simmering until it gets such a deal. Kim is unlikely to give anything up without getting paid. Driving a few trucks around Yongbyon and throwing up a couple of new buildings is an easy way for him to make that point without taking excessively provocative action.","url":"https://www.breitbart.com/national-security/2018/06/27/north-korea-continues-upgrading-nuclear-reactor-during-negotiations/"}
