{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:14:14","date_modify":"2018-10-30 19:14:14","date_publish":"2016-11-26 23:37:08","description":"President Barack Obama called Hillary Clinton on election night and urged her to concede the election to Donald Trump, according to an upcoming book on Clinton's defeat. | Politics","filename":"data/vaneerConsumption/ReportObamaCalledClintononElectionNightUrgedHertoConcede.json","image_url":"https://media.breitbart.com/media/2016/11/Clinton-Fist-AP-640-x-480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_26__1540926854.html","title":"Report: Obama Called Clinton on Election Night, Urged Her to Concede","title_page":"Report: Obama Called Clinton on Election Night, Urged Her to Concede | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama called Hillary Clinton on election night and urged her to concede the election to Donald Trump, according to an upcoming book on Clinton’s defeat.\nObama made the call as Clinton and her campaign watched election results trickle in from the Rust Belt states of Wisconsin, Pennsylvania, and Michigan, according to the Hill, citing the forthcoming book by Amie Parnes and Jonathan Allen.\n“You need to concede,” Obama reportedly told her.\nClinton allies were hoping for a turnaround in Wisconsin, Pennsylvania, and Michigan.\n“There was a lot of discussion about Michigan and Wisconsin and whether the numbers could flip it,” said one of the sources to the authors.\nBecause the election was so close in those Rust Belt states, some within Clinton’s campaign wanted to hold off on conceding the election.\n“If anybody knew what actually happened that night, no one would have conceded,” the source said.\nClinton eventually took Obama’s advice and called Trump, but not before Clinton campaign chair John Podesta told supporters waiting at the Jacob Javits Center in New York City to “go home” when many thought Clinton would be giving a victory speech that night.\n“Just give me the phone,” she said in frustration to campaign staffers. “I’m calling him.”\nDespite Clinton’s efforts to concede the election, Green Party candidate Jill Stein is pushing for recounts in Wisconsin, Pennsylvania, and Michigan.\nComputer scientists and election lawyers have also pushed Clinton to challenge the election results in the same three states, claiming that the results were either manipulated or hacked.\nBut Dan Pfeiffer, former Obama White House Communications Director, called the efforts to challenge the results a “waste.”\nThe amount of Democratic energy and money being wasted on recounts instead of trying to win the Louisiana Senate Race is mind boggling — Dan Pfeiffer (@danpfeiffer) November 24, 2016\n“The amount of Democratic energy and money being wasted on recounts instead of trying to win the Louisiana Senate Race is mind boggling,” he tweeted on Thursday.","url":"https://www.breitbart.com/politics/2016/11/26/report-obama-called-clinton-election-night-urged-concede/"}
