{"authors":["Ali Waked"],"date_download":"2018-10-30 20:29:34","date_modify":"2018-10-30 20:29:34","date_publish":"2017-04-22 13:48:42","description":"Egyptian authorities have found the body of a Coptic Christian teenager who was murdered in the Bnei Swef district in southern Egypt.","filename":"data/vaneerConsumption/ReportEgyptianAuthoritiesDiscoverBodyofMurderedChristianTeenager.json","image_url":"https://media.breitbart.com/media/2017/03/crucifix-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_22__1540931374.html","title":"Report: Egyptian Authorities Discover Body of Murdered Christian Teenager","title_page":"Report: Egyptian Authorities Discover Body of Murdered Christian Teenager","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Egyptian authorities have found the body of a Coptic Christian teenager who was murdered in the Bnei Swef district in southern Egypt.\nAn Egyptian security source told the Al-Arabiya news agency that the body of 16-year-old Jamal Bishay was found discarded on the side of the road in his town, Kay. According to the source, security and police forces have opened an investigation into the killing.\nThe teenager’s family said that on the day he disappeared he was on his way home from the private school where he was a student and that in their last conversation he said he was on his way home.\nThe incident occurred a week after the Islamic State suicide bombings of two Coptic Christian churches on Palm Sunday, killing over 40 Christians. It was not initially clear if Bishay’s murder was due to his Christian religion.\nMeanwhile, the wife of Mahmood Hassan Mubarak, the terrorist who carried out the attack on the church in Alexandria, continued to claim that her husband “loved these people and his neighbors, helped everyone” and that his neighbors would “testify that he helped everyone.”\nAccording to Mubarak’s wife, she still does not believe that he carried out the attack, claiming he told her he was leaving home for Nigeria to perform a work-related task for an electric company. She said that he used to call from Egyptian telephone numbers. “He used to use a special application that allowed him to make calls from Egyptian numbers.”\nShe also said that her husband did not hate Christians and he used to address his Coptic neighbors positively. If he had hated them, she said, she would have noticed. “I feel that it’s not my husband who carried out the attack.”","url":"https://www.breitbart.com/middle-east/2017/04/22/report-egyptian-authorities-discover-body-of-murdered-christian-teenager/"}
