{"authors":["Frances Martel"],"date_download":"2018-10-30 20:36:09","date_modify":"2018-10-30 20:36:09","date_publish":"2015-05-04 17:12:00","description":"ISIS is reportedly closing in on Kurdish border town Kobani after the Peshmerga's departure.","filename":"data/vaneerConsumption/ReportISISClosinginonKurdishBorderTownKobaniAfterPeshmergaDeparture.json","image_url":"https://media.breitbart.com/media/2015/05/Kobani-ISIS-destruction-boy-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_04__1540931769.html","title":"Report: ISIS Closing in on Kurdish Border Town Kobani After Peshmerga Departure","title_page":"Report: ISIS Closing in on Kurdish Border Town Kobani After Peshmerga Departure | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Syrian news outlet is reporting that Kobani, the Turkish/Syrian Kurdish border town that became the focal point of the war against the Islamic State before the terror group was ousted in January, is once again being targeted for capture now that the Iraqi Kurdish Peshmerga have evacuated.\nThe town was reportedly left in ruins after the prolonged battle between Kurdish and Islamic State forces. Kurdish authorities in February, following the full removal of Islamic State entities from the area, planned a “tent city” to replace the residences destroyed until renewed construction could begin.\nNow, Syrian media outlet ARA News reports that gangs of Islamic State terrorists have begun attacking areas surrounding Kobani and inching closer to the ravaged town. The remaining Kurdish force in the area, the YPG, and the Free Syria Army reportedly “repelled an attack launched from several directions by militants of the Islamic State (IS/ISIS) south of the city of Kobane, northern Syria, military sources reported on Saturday.”\nOne fighter told ARA News that the jihadists appeared to be attempting to gain ground south of Kobani and moving north. The YPG issued an official comment confirming that Islamic State forces were mobilizing south of Kobani, attacking numerous towns on the road north.\nKobani’s location–straddling the border of Syria and Turkey and potentially bridging, from north to south, several Islamic State-controlled areas–makes it a pivotal location for ISIS. With control of Kobani, the terrorist group would control most of the border between the two nations, allowing jihadists from abroad easier passage into Syria.\nIslamic State forces appear to be attempting to capitalize on the departure of the Peshmerga–the official forces of Iraqi Kurdistan–from the town last week. Reportedly, 124 soldiers have left Kobani; the Peshmerga are generally much better equipped for battle than the YPG.\nThe Associated Press describes post-ISIS Kobani as a “ghost town” to which few former residents wish to return. Noting that the loss in Kobani was “the Islamic State’s bloodiest defeat to date in Syria,” the news service notes that most buildings in the town are destroyed, and there is no electricity or running water. It is believed that the Islamic State dispatched Omar al-Shishani, one of its highest-ranking military strategists, to Kobani to win the battle and are still recovering from losses.\n“First, Islamic State fighters were holed up in our home and then the American planes bombed it,” one resident told the AP. An estimated 70,000 refugees from Kobani live in the surrounding areas.\nA group of Kurdish officials is expected to convene this month to discuss the reconstruction of Kobani. “A delegation of four people from different backgrounds is in the city of Amed to participate in the conference, which will be held for two days,” said Kurdish parliamentary Secretary Fakhradin Qadir to news outlet Rudaw. Kobani is an ethnically Kurdish city.","url":"https://www.breitbart.com/national-security/2015/05/04/report-isis-closing-in-on-kurdish-border-town-kobani-after-peshmerga-departure/"}
