{"authors":["Edwin Mora"],"date_download":"2018-10-30 21:09:20","date_modify":"2018-10-30 21:09:20","date_publish":"2015-05-07 04:14:09","description":"Sudan’s army reportedly claimed that it shot down an Israeli drone that infiltrated its air space, denying Arab media reports that the unnamed aerial vehicle (UAV) struck a weapons facility near the Sudanese city of Omdurman.","filename":"data/vaneerConsumption/ReportSudanArmyClaimsItShotDownIsraeliDrone.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo8.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_06__1540933760.html","title":"Report: Sudan Army Claims It Shot Down Israeli Drone","title_page":"Report: Sudan Army Claims It Shot Down Israeli Drone","title_rss":"NULL","source_domain":"breitbart.com","text":"Sudan’s army reportedly claimed that it shot down an Israeli drone that infiltrated its air space, denying Arab media reports that the unnamed aerial vehicle (UAV) struck a weapons facility near the Sudanese city of Omdurman.\nThe London-based Arabic-language Al-Araby Al-Jadeed and other Arab news sources, quoting officials and residents of Omdurman, reported on Wednesday that foreign warplanes believed to be from Israel attacked a military installation nearby Tuesday night.\nFollowing Arab media reports, Col. Al-Sawarmi Khalid Sa’ad, a spokesman for Sudan’s army, said “the military toppled a UAV that infiltrated its air space from the east, calling it an Israeli drone carrying two missiles,” reported Israel’s Haaeretz.\n“Sa’ad denied reports of a strike, saying the rumors were meant to hurt the Sudanese people’s morale,” added the article.\nIsrael’s military has not officially commented on the reports.\nThe Sudanese spokesperson initially confirmed that anti-aircraft had been fired at “an object in the sky” resembling a missile or a jet, reports The Times of Israel.\nLater on Wednesday, the Sudanese military alleged that it had shot down a drone from Israel.\nThe Sudanese army spokesman reportedly said that the drone entered the air space from the direction of the Red Sea and that the Sudanese authorities were investigating the incident\nCiting eyewitnesses in Omdurman, Al-Araby reported that they saw and heard large explosions at a military facility near the city\nOmdurman is located across the Nile River from the Sudanese capital Khartoum.\nIsrael has been blamed for airstrikes in Sudan in the past.\n“Early unconfirmed reports of the strike indicated the jets may have targeted a missile depot holding arms destined for terror group Hamas in the Gaza Strip,” reported The Times of Israel.\n“According to foreign reports, Israeli airstrikes targeted a number of Gaza-bound weapons convoys and Hamas smuggling operatives within Sudan in recent years,” added Haaertz. “Sudan has cast blame on Israel following some of these incidents. Israel hasn’t officially responded.”","url":"https://www.breitbart.com/national-security/2015/05/06/report-sudan-army-claims-it-shot-down-israeli-drone/"}
