{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:40:11","date_modify":"2018-10-30 19:40:11","date_publish":"2017-04-21 11:04:58","description":"A Hezbollah commander on Thursday guided a group of journalists on a tour of the Israel-Lebanon border, according to media reports.","filename":"data/vaneerConsumption/ReportHezbollahLeaderGuidesJournalistsonTourofIsraelLebanonBorderDeclaresThisIsOccupiedPalestinianLand.json","image_url":"https://media.breitbart.com/media/2016/09/lebanese-israeli-border.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_21__1540928411.html","title":"Report: Hezbollah Leader Guides Journalists on Tour of Israel-Lebanon Border, Declares ‘This Is Occupied Palestinian Land’","title_page":"Report: Hezbollah Leader Guides Journalists on Tour of Israel-Lebanon Border, Declares ‘This Is Occupied Palestinian Land’","title_rss":"NULL","source_domain":"breitbart.com","text":"The Algemeiner reports: A Hezbollah commander on Thursday guided a group of journalists on a tour of the Israel-Lebanon border, according to media reports. “This is occupied Palestinian land,” the commander was quoted as saying by the Hebrew news site Walla as he pointed across the border toward the northern Israeli kibbutz of Hanita.\nThe purpose of the tour, he said, was to provide a look at the “topography of the territory, the military deployment of the Zionist enemy and the defensive measures it has taken recently, including engineering works, fortifications and the installation of surveillance and spying devices.”\nThe commander pointed out segments of the fence he said Israel had built as of late to prevent infiltrations, due to the threat posed by potential Hezbollah efforts in future wars to capture border communities in the Galilee region.\nRead more here.","url":"https://www.breitbart.com/middle-east/2017/04/21/report-hezbollah-leader-guides-journalists-tour-israel-lebanon-border-declares-occupied-palestinian-land/"}
