{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:46:26","date_modify":"2018-10-30 19:46:26","date_publish":"2016-12-09 17:27:30","description":"Gary Cohn would be the first Trump appointee who currently works at the Wall Street bank that was bailed out by the federal government in 2008. He earned total compensation of $21 million from Goldman Sachs in 2015, according to TIME. | Politics","filename":"data/vaneerConsumption/ReportDonaldTrumpSelectsGoldmanSachsPresidentAsNationalEconomicCouncilDirector.json","image_url":"https://media.breitbart.com/media/2016/12/GettyImages-626480392.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_09__1540928786.html","title":"Report: Donald Trump Selects Goldman Sachs President As National Economic Council Director","title_page":"Report: Donald Trump Selects Goldman Sachs President As National Economic Council Director | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump will select Goldman Sachs president & COO Gary Cohn to serve as National Economic Council Director in his administration, according to a report from CNBC. A Trump campaign spokesperson declined to confirm the news.\nCohn would be the first Trump appointee who currently works at the Wall Street bank that was bailed out by the federal government in 2008. He earned total compensation of $21 million from Goldman Sachs in 2015, according to TIME.\nTrump’s team already has four people connected to the bank, although they left the firm before it was bailed out by Washington.\nTrump’s choice for Treasury Secretary Steve Mnuchin was a Goldman Sachs partner and spent 17 years at the bank before leaving in 2002. Trump adviser Anthony Scaramucci also worked for the bank for a period of time. Former Breitbart Executive Chair Stephen K. Bannon, who is now Trump’s senior adviser, also worked for the bank in the 1980s.","url":"https://www.breitbart.com/politics/2016/12/09/donald-trump-goldman-sachs-gary-cohn-5691267/"}
