{"authors":["Kristin Tate"],"date_download":"2018-10-30 21:14:23","date_modify":"2018-10-30 21:14:23","date_publish":"2014-05-22 18:07:00","description":"Everything is bigger in the Lone Star State, including the cities. New data released by the U.S. Census Bureau show that Texas cities are leading the nation in population growth.","filename":"data/vaneerConsumption/ReportTexasHometoFastestGrowingCitiesinNation.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/TexasFlagjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_05_22__1540934063.html","title":"Report: Texas Home to Fastest Growing Cities in Nation","title_page":"Report: Texas Home to Fastest Growing Cities in Nation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Everything is bigger in the Lone Star State, including the cities. New data released by the U.S. Census Bureau show that Texas cities are leading the nation in population growth.\nThree of the nation’s top five fastest-growing cities, and seven of the top 15, are located in Texas. According to the Census Bureau, Texas is the only state that is home to more than one city in the top 15. San Marcos, which ranked number one, Frisco, and Cedar Park all made the top five. South Jordan, Utah and Clarksville, Tennessee also made the top five.\nSan Marcos, which is located between Austin and San Antonio, “had the highest rate of growth among all U.S. cities and towns with at least 50,000 people,” the Census Bureau reported. The city reportedly grew by 8 percent between July 2012 and 2013.\nAn Associated Press (AP) report pointed out that San Marcos has been the fastest-growing U.S. city for two years in a row now. One major employer in the city is Texas State University, which more than 35,000 students attend.\nDaniel Guerrero, Mayor of San Marcos, told the AP, “We have an immaculate natural beauty to our community, certainly the spring-fed river … San Marcos River… historic neighborhoods, a growing and beautified downtown that we’ve been investing in heavily over the last few years.”\nTexas’ low taxes, healthy job market, and pro-business policies are likely behind the state’s population surge. Many additionally equate the boom with the thriving oil and gas industry–while oil and gas certainly bolsters the Texas economy, the state has successfully diversified in terms of the industries it supports.\nTexas-based gas and oil economist Karr Ingham told Breitbart Texas in a related interview, “The oil and gas industry has not gotten smaller–rather, the overall Texas economy has gotten bigger. The state economy is now a powerhouse. It is more than just an oil and gas economy; it is an industrial economy, a tech economy, a business economy, a manufacturing economy… Texas has a lot going for it.”\nVance Ginn, an economist at the Texas Public Policy Foundation, told Breitbart Texas, “The [state’s] economy as a whole is blossoming–there are more Fortune 500 companies moving to Texas than anywhere else in the nation. The Texas model of low taxes, modest government spending, and stable regulations creates an environment where businesses have incentives to move to the state.”\nFollow Kristin Tate on Twitter @KristinBTate.","url":"https://www.breitbart.com/border/2014/05/22/report-texas-home-to-fastest-growing-cities-in-nation/"}
