{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:36:02","date_modify":"2018-10-30 20:36:02","date_publish":"2015-06-27 03:29:37","description":"ISIS reportedly attacked the Syrian border town of Kobani from Turkey, an allegation that Ankara “strongly” denies.","filename":"data/vaneerConsumption/ReportTurkeyDeniesISISAttackedKobanifromWithinItsBorders.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo1745-1024x728.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_26__1540931762.html","title":"Report: Turkey Denies ISIS Attacked Kobani from Within Its Borders","title_page":"Report: Turkey Denies ISIS Attacked Kobani from Within Its Borders | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS/ISIL) reportedly attacked the Syrian border town of Kobani from Turkey, an allegation that Ankara “strongly” denies.\nTanju Bilgic, a spokesman for Turkey’s foreign ministry, indicated that the ISIS jihadists, who launched an attack on the Kurdish town of Kobani in Syria on Thursday that left scores of people dead and wounded, did not come from Turkey, adding that claims to the contrary are “lies,” Reuters reports.\nISIS launched a wave of car bombs and an assault that killed at least 75 people, reports Kurdish media service Rudaw.\nAmong the dead were 45 civilians and 30 ISIS jihadists, according to the Kurdish People’s Protection Units (YPG).\nCNN notes that the ISIS militants who infiltrated Kobani were disguised as Kurdish security troops.\n“They were wearing YPG (Kurdish security forces) uniforms, so when people saw them they did not fear them, and they (ISIS) opened fire. Many civilians lost their lives,” Idriss Nasan, a spokesman for the Kurds in Kobani, told CNN.\nQuoting eyewitnesses, Nasan revealed that the ISIS militants in disguise spoke Kurdish and knocked on doors, telling residents to come out.\n“People rushed out and were killed,” added the Kurdish spokesman.\nThe Guardian reports that ISIS launched the offensive in Kobani under the cloak of darkness.\nISIS jihadists were disguised as members of the Free Syrian Army, a rebel group, not Kurdish security forces, according to The Guardian.\nKobani is located along the Syria-Turkey border. It is strategically valuable to ISIS, which was expelled from the city in January by a Kurdish offensive supported by U.S.-led coalition airstrikes.\n“Around the same time as the Kobani attack, the group launched an assault on the north-eastern city of Hasakah, aided by militias previously aligned with the Syrian president, Bashar al-Assad. Western districts were seized and the Syrian army pushed into the city center,” notes The Guardian.\n“The surprise, two-pronged offensive came as Isis reels from several high-profile defeats near Raqqa, the capital of its self-declared caliphate and its seat of power in Syria,” it adds.","url":"https://www.breitbart.com/national-security/2015/06/26/report-turkey-denies-isis-attacked-kobani-from-within-its-borders/"}
