{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 22:05:03","date_modify":"2018-10-30 22:05:03","date_publish":"2016-11-28 12:46:40","description":"Italy continues to suffer from a steadily declining birthrate, especially among native Italians, with live births falling by 20,000 in 2015.","filename":"data/vaneerConsumption/ReportItalianBirthrateContinuestoPlummet.json","image_url":"https://media.breitbart.com/media/2016/11/1443-bambini-grazie.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_28__1540937103.html","title":"Report: Italian Birthrate Continues to Plummet","title_page":"Report: Italian Birthrate Continues to Plummet","title_rss":"NULL","source_domain":"breitbart.com","text":"Italy continues to suffer from a steadily declining birthrate, especially among native Italians, with live births falling by nearly 20,000 in 2015.\nAccording to the latest data released Monday by Italy’s National Institute of Statistics (Istat), 485,780 live births were registered in 2015, representing a drop of some 17,000 children relative to 2014. This is just the latest confirmation of a downward trend, with the yearly birthrate declining by 91,000 since 2008.\nThe decline was far sharper in births to couples both of whom are Italian citizens. Children born to Italian couples sank to 385,014 in 2015 (a drop of over 95,000 over the last seven years). Istat attributed the trend to two factors: ever fewer Italian women at childbearing age and an increasing unwillingness to have children among those who could.\nBirths to couples where at least one of the members is a non-Italian have continued to climb relative to births to Italian couples, and now make up 20.7 percent of the total yearly births nationwide, or just over one fifth.\nThe Institute also highlighted a precipitous drop in the marriage rate, with 52,000 fewer marriages in 2015 than in 2008. The birthrate within marriages has dropped even more than among the general population (a decline of nearly 120,000 births in just 7 years). At the same time, out-of-wedlock births have risen steadily as a percentage of all births, representing 28,7 percent of the total in 2015.\nSumming up, Istat notes that the average number of children per woman has dropped to 1.35 in 2015 from 1.46 in 2010. Italian women have on average 1.27 children whereas foreign women residing in Italy give birth to an average of 1.94 children per woman.\nItaly’s birthrate has fallen further and further below the replacement rate of roughly 2.1 children per woman. Globally, Italy is ranked 211 out of 223 countries for new live births as a percentage of the total population.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/europe/2016/11/28/report-italian-birthrate-continues-plummet/"}
