{"authors":["Breitbart Tech"],"date_download":"2018-10-30 18:20:40","date_modify":"2018-10-30 18:20:40","date_publish":"2016-10-05 14:11:58","description":"Yahoo secretly built a custom software program to search all of its customers' incoming emails for specific information provided by U.S. intelligence.","filename":"data/vaneerConsumption/ReportYahooSecretlyScannedCustomerEmailsforUSIntelligence.json","image_url":"https://media.breitbart.com/media/2016/07/wi/afp_fd0f972bd2ba6f6b959cfa592abb89a5f1f88e5f-e1475676702304.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_10_05__1540923640.html","title":"Report: Yahoo Secretly Scanned Customer Emails for U.S. Intelligence","title_page":"Report: Yahoo Secretly Scanned Customer Emails for U.S. Intelligence | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(Reuters) — Yahoo Inc last year secretly built a custom software program to search all of its customers’ incoming emails for specific information provided by U.S. intelligence officials, according to people familiar with the matter.\nThe company complied with a classified U.S. government demand, scanning hundreds of millions of Yahoo Mail accounts at the behest of the National Security Agency or FBI, said three former employees and a fourth person apprised of the events.\nSome surveillance experts said this represents the first case to surface of a U.S. Internet company agreeing to an intelligence agency’s request by searching all arriving messages, as opposed to examining stored messages or scanning a small number of accounts in real time.\nIt is not known what information intelligence officials were looking for, only that they wanted Yahoo to search for a set of characters. That could mean a phrase in an email or an attachment, said the sources, who did not want to be identified.\nRead the rest of the story at Reuters.","url":"https://www.breitbart.com/tech/2016/10/05/report-yahoo-secretly-scanned-customer-emails-u-s-intelligence/"}
