{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:23:07","date_modify":"2018-10-30 18:23:07","date_publish":"2018-08-11 00:52:27","description":"According to the New York Times, the order to ban Alex Jones and Infowars from Facebook came from the very top.","filename":"data/vaneerConsumption/ReportFacebookCEOMarkZuckerbergPersonallyMadeDecisiontoBanAlexJones.json","image_url":"https://media.breitbart.com/media/2018/05/wi/afp/01/3760bc_facebook-chief-mark-zuckerberg-was-grilled-by-us-congress-month-but-one-e1525454097477.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_10__1540923787.html","title":"Report: Facebook CEO Mark Zuckerberg Personally Made Decision to Ban Alex Jones","title_page":"Report: Facebook CEO Mark Zuckerberg Personally Made Decision to Ban Alex Jones | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When an ordinary account gets banned on Facebook, it’s possible that no human was ever involved in the decision. Not so for Alex Jones and Infowars. According to the New York Times, the order to ban the radio host came from the very top.\nCiting sources from inside Facebook, The New York Times reported on the process that led to Jones’ suspension.\nThe situation was volatile enough that Mr. Zuckerberg got personally engaged, according to two people involved in Facebook’s handling of the accounts. He discussed Infowars at length with other executives, and mused privately about whether Mr. Jones — who once called Mr. Zuckerberg a “genetic-engineered psychopath” in a video — was purposefully trying to get kicked off the platform to gain attention, they said. Mr. Zuckerberg, an engineer by training and temperament, has always preferred narrow process decisions to broad, subjective judgments. His evaluation of Infowars took the form of a series of technical policy questions. They included whether the mass-reporting of Infowars posts constituted coordinated “brigading,” a tactic common in online harassment campaigns. Executives also debated whether Mr. Jones should receive a “strike” for each post containing hate speech (which would lead to removing his pages as well as the individual posts) or a single, collective strike (which would remove the posts, but leave his pages up).\nThe article goes on to highlight that Zuckerberg took his decision to Apple, which was the first major tech platform to enact mass censorship against Infowars. Following the lead of Tim Cook’s company, who earlier this year publicly trash-talked both Facebook and Zuckerberg personally, would be a humiliation for Zuckerberg.\nLate Sunday, Apple — which has often tried to stake out moral high ground on contentious debates — removed Infowars podcasts from iTunes. After seeing the news, Mr. Zuckerberg sent a note to his team confirming his own decision: the strikes against Infowars and Mr. Jones would count individually, and the pages would come down. The announcement arrived at 3 a.m. Pacific time.\nThe rest of the Times’ article is a flurry of contradictions. It simultaneously calls fears of censorship “overblown” while acknowledging that users of the platforms must now “tip-toe around” controversial topics to avoid being banned. At the same time, the piece grudgingly admits that “both fans and critics of Infowars can probably agree that a system in which one executive can decide to shut off a news organization’s access to a large portion of its audience is hardly ideal.”\nAllum Bokhari is the senior technology correspondent at Breitbart News. You can follow him on Twitter, Gab.ai and add him on Facebook. Email tips and suggestions to allumbokhari@protonmail.com.","url":"https://www.breitbart.com/tech/2018/08/10/report-facebook-ceo-mark-zuckberg-personally-made-decision-to-ban-alex-jones/"}
