{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:10:39","date_modify":"2018-10-30 20:10:39","date_publish":"2015-10-09 19:57:45","description":"Rep. Renée Ellmers said rumors that she had an affair with House Majority Leader Kevin McCarthy were “completely false accusations.”","filename":"data/vaneerConsumption/RepReneEllmersAddressesFalseAccusationsAndInnuendoOfMcCarthyAffair.json","image_url":"https://media.breitbart.com/media/2015/01/Renee-Ellmers-AP-PHOTO-HARRY-HAMBURG.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_09__1540930239.html","title":"Rep. Renée Ellmers Addresses ‘False Accusations’ And ‘Innuendo’ Of McCarthy Affair","title_page":"Rep. Renée Ellmers Addresses ‘False Accusations’ And ‘Innuendo’ Of McCarthy Affair | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Renée Ellmers is calling rumors that she had an affair with House Majority Leader Kevin McCarthy “completely false accusations.”\nAs Breitbart News reported Thursday, McCarthy abandoned his bid to become House Speaker. That was a day after a letter sent by Rep. Walter Jones that warned Speaker candidates to exit the race if they had any private indiscretions that could embarrass the Republican Party.\nThe offices of both Ellmers and McCarthy have denied the ongoing rumors of an affair, reports the Washington Examiner.\n“As someone who has been targeted by completely false accusations and innuendo, I have been moved by the outpouring of support and prayers from my colleagues, constituents and friends,” she said. “Now I will be praying for those who find it acceptable to bear false witness.”\nEllmers recently made headlines for an apparent push to obtain a seat on the new House Select Investigative Panel that will examine Planned Parenthood’s activities following the release of videos exposing its practice of selling the body parts of aborted babies.\nIn January, Ellmers was effective in having GOP House leadership withdraw the Pain-Capable Unborn Child Protection Act – a measure that would ban abortions after the fifth month of pregnancy – as the annual March for Life gathered in Washington, D.C. She objected to rape-reporting language in the bill, even though it was the same language she voted for in 2013 when the bill passed the House.\n“The North Carolina congresswoman has thoroughly discredited herself with pro-lifers [and] she is angling for a position on a committee that will investigate Planned Parenthood,” said a statement from Kristan Hawkins, president of Students for Life of America. “What a complete farce.”\nEllmers will once again have a primary challenge next year from conservative economist Frank Roche, who tells Breitbart News, “Rep. Ellmers continues to try and dig herself out the hole she dug in January when she blocked the Pain-Capable abortion legislation.”\n“Her surrogates are appearing in the district to address grassroots activists talking only about one thing: how Rep. Ellmers is pro-life, pro-family, and very much against Planned Parenthood,” he added. “It is painfully transparent, and most audiences seem to recognize the same.”\n“There is no action she can take now to win back the trust of pro-life Republicans in the second district,” Roche said. “The leaders of North Carolina’s anti-abortion advocacy groups have turned their backs on Renee and openly encourage voters do the same.”","url":"https://www.breitbart.com/politics/2015/10/09/rep-renee-ellmers-addresses-false-accusations-innuendo-mccarthy-affair/"}
