{"authors":["Dan Riehl"],"date_download":"2018-10-30 19:59:08","date_modify":"2018-10-30 19:59:08","date_publish":"2017-03-16 15:53:10","description":"Congressman Phil Roe (R-TN), chairman of the House Veterans’ Affairs Committee, spoke with Breitbart News Daily SiriusXM host Alex Marlow on Thursday | Radio","filename":"data/vaneerConsumption/RepRoeVAAccountabilityFirstActEmpowersVASecretarylikeaPrivateSectorCEO.json","image_url":"https://media.breitbart.com/media/2015/09/Veterans-Administration-AP-Photo-Rich-Pedroncelli.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2017_03_16__1540929548.html","title":"Rep. Roe: VA Accountability First Act Empowers VA Secretary 'like a Private Sector CEO'","title_page":"Rep. Roe: VA Accountability First Act Empowers VA Secretary 'like a Private Sector CEO' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Congressman Phil Roe (R-TN), chairman of the House Veterans’ Affairs Committee, spoke with Breitbart News Daily SiriusXM host Alex Marlow on Thursday regarding the VA Accountability First Act, which is being supported by fifteen major veteran’s service organizations.\nRoe penned a recent op-ed for Fox News, entitled “The VA Must Be Held Accountable.“\nRoe said Thursday, “Right now, through the Civil Service, it’s virtually impossible … to fire anybody.” Roe then listed multiple “egregious examples” of professional misconduct by VA employees which took two years or more for action against the employee.\n“The secretary [of Veterans Affairs] and I had lunch yesterday,” said Roe. “The first thing out of his mouth was, ‘Give me the ability to terminate people who are not doing their job.'”\nAs for the bill, Roe said, “It shortens the time. It still keeps people, gives them their due process rights. … We just shorten the time frame dramatically” in which the VA can act.\nIn essence, the bill “gives the secretary the tools to act like a private sector CEO,” concluded Roe.\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/radio/2017/03/16/rep-roe-va-accountability-first-act-empowers-va-secretary-like-private-sector-ceo/"}
