{"authors":[],"date_download":"2018-10-22 23:23:35","date_modify":"2018-10-22 23:23:35","date_publish":"2016-01-29 11:05:27","description":"Republican White House hopefuls jostled for the limelight in the absence of master showman Donald Trump, who snubbed the last debate before the party nominat...","filename":"data/vaneerConsumption/RepublicansdebateasnoshowTrumptauntsfromafar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h2v1-3bmscybNe842cce83474b54a4f70-663_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422151_Republicans-debate-without-Trump-taunts-afar_1540250615.html","title":"Republicans debate as no-show Trump taunts from afar","title_page":"Republicans debate as no-show Trump taunts from afar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Republicans debate as no-show Trump taunts from afar\nRepublican White House hopefuls jostled for the limelight in the absence of master showman Donald Trump, who snubbed the last debate before the party nomination votes begin and upstaged his rivals with a dueling event.\nTrump gambled big when he announced he was boycotting the debate in Des Moines because of a feud with Fox News, plunging the presidential race into uncharted waters just days before Iowa votes on February 1.\nStraight out of the gate, the seven debaters turned to \"the elephant not in the room\" as he was wryly described by Megyn Kelly -- the Fox anchor who Trump accuses of bias against him.\nDonald Trump speaks during a campaign rally raising funds for US military veterans at Drake University in Des Moines, Iowa ©William Edwards (AFP)\nTop adversary Ted Cruz used Trump-like language to jokingly belittle himself and rivals -- and take a pot shot at the absentee himself.\n\"I'm a maniac and everyone on this stage is stupid, fat and ugly. And Ben, you're a terrible surgeon,\" Cruz said, looking mischievously at retired neurosurgeon Ben Carson.\n\"We've gotten the Donald Trump portion out of the way,\" he quipped.\nNationally, Trump keeps soaring. A recent CNN/ORC poll of Republican voters has Trump at 41 percent to 19 percent for Cruz, with more than two-thirds of Republicans saying they believe the billionaire developer will be the party's presidential candidate.\nBut Trump has a genuine battle on his hands in Iowa with ultra-conservative Cruz who trails by about five percentage points in the RealClearPolitics average of recent Iowa polls.\nCruz, who has won endorsements from key evangelicals and anti-abortion figures who tout his religious values, insists the race against Trump is winnable and has blanketed Iowa with 12,000 volunteers and staff.\nAll eyes are now on the heartland state, where 12 Republican candidates and three Democratic hopefuls including Hillary Clinton are vying for both bragging rights and momentum as the primary race heads next to New Hampshire, South Carolina and Nevada.\n- Trumpless -\nTrump had taunted Fox and his rivals, saying a main debate without him present would be a \"total disaster\" with low ratings.\nThe real estate mogul doubled down, in a game of political chicken, scheduling a rival event for military veterans just a few miles (kilometers) from the venue where his party was showcasing its candidates to Iowa voters.\nEven absent, Trump's shadow loomed large -- and he was snatching many of the headlines.\nVisibly delighting in the upset caused by his no-show, the tycoon took the stage at his own event about 15 minutes after the main debate began.\n\"I said I'm not going to do the debate out of respect for myself,\" he said to cheers from the overflow crowd.\n\"But I love Iowa. I'm here.\"\nShortly before the debate Trump told CNN that top Fox officials had called him to apologize. Trump said he was mulling a last-minute appearance, but that his veterans event \"took on a life of its own\" and he felt compelled to appear there instead.\nAdding to the spectacle, rival Mike Huckabee, the former Arkansas governor who is languishing in polls, joined Trump at his veterans event, as did low-polling former senator Rick Santorum.\nBoth won the Iowa caucuses in previous election cycles, but they appeared Thursday as minnows swimming behind the Trump shark.\n- Political theater -\nAnalysts have been riveted by the unexpected drama and disruption to the typical Iowa political playbook. The last major candidate to skip a pre-Iowa caucus debate was Ronald Reagan, in 1980.\n\"Wow. What a chess game,\" Iowa State University political science professor Steffen Schmidt declared of the political theater.\nWith the combustible frontrunner out of their hair, Cruz and his rivals on stage zeroed in on policy.\nCruz sparred over immigration with Senator Marco Rubio, who accused his fellow senator of flip-flopping on the issue to gain support.\n\"The truth is, Ted, throughout this campaign you've been (willing) to do or say anything to get votes,\" Rubio said, in some of their sharpest exchanges so far.\nThere were drawn-out debates on foreign policy, and the battle against Islamic State extremists.\nThe Republicans did train their collective sights on the Democratic frontrunner, Hillary Clinton, with New Jersey Governor Chris Christie arguing that as a former federal prosecutor, \"there is no one on this stage better prepared to prosecute the case against Hillary Clinton than I am.\"\n\"The days of the Clintons in public housing are over,\" he steamed.\nFormer Florida governor Jeb Bush, whose campaign has struggled to gain traction, recalled the divisive threat by Trump to ban Muslims, saying such irrational moves would create a \"toxic\" environment in America.\nHe also hit the frontrunner for his disparaging remarks about women and Hispanics, and for mocking people with disabilities.\n\"That's not a sign of strength,\" Bush said.\nStraight out of the gate the seven debaters turned to the elephant-not-in-the-room, with top adversary Ted Cruz, pictured, using Trump-like language to humorously belittle himself and rival Republican presidential candidates ©Jim Watson (AFP)\nUS election primaries: opinion polls ©Alain Bommenel, Kun Tian (AFP)\nWith Donald Trump out of the way Republican presidential candidates launched into spirited debate about foreign policy and tackling the jihadist threat ©Jim Watson (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3422151/Republicans-debate-without-Trump-taunts-afar.html"}
