{"authors":["Associated Press"],"date_download":"2018-10-22 20:53:25","date_modify":"2018-10-22 20:53:25","date_publish":"2016-01-29 04:42:35","description":"DES MOINES, Iowa (AP) — Republican presidential candidates strained to take advantage of a rare opportunity to step out of front-runner Donald Trump's shadow...","filename":"data/vaneerConsumption/RepublicanrivalsmockTrumptrytomakemostofabsence.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:7004e0663eae4679843ab38d8e180bf3-3bmscybNe842cce83474b505e4bc-317_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420384_Trump-looks-grab-attention-Republican-rivals-debate_1540241605.html","title":"Republican rivals mock Trump, try to make most of absence","title_page":"Republican rivals mock Trump, try to make most of absence | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Republican rivals mock Trump, try to make most of absence\nDES MOINES, Iowa (AP) — Republican presidential candidates strained to take advantage of a rare opportunity to step out of front-runner Donald Trump's shadow in Thursday night's debate — a policy-heavy contest that offered a glimpse of what the party contest might have been without the unpredictable businessman.\nStill, the candidates couldn't resist mocking Trump for boycotting the final debate before voting kicks off in the 2016 campaign on Monday. That's when Iowa residents will choose among the Republican and Democratic candidates in the first of a series of state-by-state contests to choose delegates to each party's convention.\nTexas Sen. Ted Cruz, who is locked in a tight contest with Trump in Iowa, opened the debate with a sarcastic impression of the real estate mogul's frequent insults of his opponents.\nRepublican presidential candidate Sen. Marco Rubio, R-Fla., center, answers a question as Sen. Ted Cruz, R-Texas, left, and former Florida Gov. Jeb Bush, right, listen during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\n\"I'm a maniac and everyone on this stage is stupid, fat and ugly,\" Cruz said. Then he thanked his fellow candidates for showing Iowa voters respect by showing up.\nFormer Florida Gov. Jeb Bush, a frequent target of Trump, said with a wry smile, \"I kind of miss Donald Trump; he was a teddy bear to me.\"\nNever one to go quietly, Trump was holding a competing rally elsewhere in Des Moines, an event his campaign said was raising money for military veterans.\n\"When you're treated badly, you have to stick up for your rights,\" Trump said in explaining he was skipping the debate because he felt Fox News had dealt with him unfairly. Broadening his point, he said, \"We have to stick up for ourselves as people and we have to stick up for our country if we're being mistreated.\"\nTrump's absence put the spotlight on Cruz, who is challenging for the lead in Iowa, as well as on Florida Sen. Marco Rubio, who needs a strong showing in the state to stay competitive.\nThe two senators engaged in a lengthy debate on immigration, one of the most contentious issues among Republicans. Both have been accused of shifting their stances on legalizing some of those in the United States illegally, a position opposed by many GOP voters.\nCruz accused Rubio of making a \"politically advantageous\" decision to support a 2013 Senate bill that included a pathway to citizenship, while the Florida senator said his rival was \"willing to say or do anything to get votes.\"\nIn a rare standout debate moment for Bush, the former Florida governor sharply sided with Cruz in accusing Rubio of having \"cut and run\" on the Senate immigration bill.\n\"He cut and ran because it wasn't popular with conservatives,\" Bush said.\nWith their White House hopes on the line, the candidates worked hard to cast themselves as best prepared to be commander in chief and take on terror threats emanating both from abroad and within the United States.\nRubio struck an aggressive posture, pledging that as president he would go after terrorists \"wherever they are. And if we capture them alive, we're sending them to Guantanamo.\" Rubio also stood by his previous calls for shutting down mosques in the U.S if there were indications that the Muslim religious centers were being used to radicalize terrorists.\nKentucky Sen. Rand Paul — back on the main debate stage after being downgraded to an undercard event because of low poll numbers earlier this month — warned against closing down mosques. A proponent of a more isolationist foreign policy, Paul also raised concerns about the U.S. getting involved militarily in Syria, where the Islamic State group has a stronghold.\nThe candidates largely sidestepped direct confrontations with each other, focusing some of their most pointed attacks on Democratic front-runner Hillary Clinton.\n\"She is not qualified to be president of the United States,\" New Jersey Gov. Chris Christie said. \"What we need is someone on that stage who has been tested who has been through it.\"\nChristie is part of a crowded field of more mainstream candidates who have struggled to break through in an election year where Trump, and increasingly Cruz, have tapped into voter anger with the political system. Party leaders have grown increasingly antsy for some of the more traditional candidates to step aside after the first contests to allow one to rise up and challenge for the nomination.\nAsked whether the crowded establishment lane was putting Trump in position to be the nominee, Bush said, \"We're just starting out. The first vote hasn't been counted. Why don't we let the process work?\"\nBush also defended the flurry of critical advertisements his well-funded super PAC has launched against Rubio and other rivals.\n\"It's called politics,\" Bush said. \"That's the way it is. I'm running hard.\"\nTrump pulled out of the debate this week, citing unfair treatment from host Fox News. He's feuded with the network for months, particularly anchor and debate moderator Megyn Kelly.\nIt's unclear whether Trump's unusual move will hurt his standing with Iowa voters. But his absence did give his rivals more time to make their case to voters.\nJeb Bush, right, talks to Rand Paul during a commercial break at a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nBen Carson, right, talks to Chris Christie during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nJohn Kasich speaks during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nMarco Rubio and Jeb Bush laugh together after a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate Sen. Ted Cruz, R-Texas, walks across the stage after the Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nMarco Rubio, right, laughs as Ted Cruz makes a point during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nJeb Bush speaks as Marco Rubio, right and John Kasich listen during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nMarco Rubio makes a point as Jeb Bush listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nJeb Bush argues a point during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nAudience members listen to the Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nTed Cruz, left, smiles as Marco Rubio makes a point during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate Sen. Ted Cruz, R-Texas, answers a question as Sen. Marco Rubio, R-Fla., looks on during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nJohn Kasich, right, speaks as Jeb Bush listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate New Jersey Gov. Chris Christie answers a question as retired neurosurgeon Ben Carson listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nMarco Rubio argues a point as Jeb Bush smiles during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nJeb Bush argues a point during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate retired neurosurgeon Ben Carson answers a question as Sen. Ted Cruz, R-Texas, looks on during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nRepublican presidential candidate former Florida Gov. Jeb Bush answers a question as Ohio Gov. John Kasich listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nRepublican presidential candidates (L-R) Sen. Rand Paul, R-Ky., New Jersey Gov. Chris Christie, retired neurosurgeon Ben Carson, Sen. Ted Cruz, R-Texas, Sen. Marco Rubio, R-Fla., former Florida Gov. Jeb Bush, and Ohio Gov. John Kasich stand on the stage during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nRepublican presidential candidate Ohio Gov. John Kasich, right, answers a question as (L-R) Sen. Rand Paul, R-Ky., New Jersey Gov. Chris Christie, retired neurosurgeon Ben Carson, Sen. Ted Cruz, R-Texas, Sen. Marco Rubio, R-Fla., and former Florida Gov. Jeb Bush listen during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nChris Christie argues a point during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nRepublican presidential candidate Sen. Ted Cruz, R-Texas, answers a question during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nPresidential candidates Rand Paul, Chris Christie, Ted Cruz, Marco Rubio, Jeb Bush and John Kasich appear during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)","url":"https://www.dailymail.co.uk/wires/ap/article-3420384/Trump-looks-grab-attention-Republican-rivals-debate.html"}
