{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 00:25:06","date_modify":"2018-10-23 00:25:06","date_publish":"2016-01-28 14:15:32","description":"GOP representative Cliff Rosenberger has apologized for interrupting B.J. Van Aman's long-winded opening remarks after he had been addressing the Ohio House for five minutes.","filename":"data/vaneerConsumption/RepublicanOhioHouseSpeakercutsoffpastorsopeningprayer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAED4D00000578-0-image-a-22_1453990670265.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421040_Republican-Ohio-House-Speaker-cuts-pastor-s-opening-prayer-saying-amen-ushering-stage_1540254306.html","title":"Republican Ohio House Speaker cuts off pastor's opening prayer","title_page":"Republican Ohio House Speaker cuts off pastor's opening prayer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One woman was heard on a microphone saying: 'That was a sermon'\nThe GOP politician has since apologized, but has insisted he gave the pastor 'due\nVanAman said: 'You were pleased with Solomon, may you be pleased with us,' before Rosenberger finally interjected\nRosenberger opened his eyes and looked anxious at four minutes\nThe clergyman had been speaking for five minutes before he was stopped\nAs Ohio's Speaker Of The House, Cliff Rosenberger is used to cutting off politicians if they go on too long.\nBut the Republican stirred controversy on Tuesday when he interrupted a pastor during his opening prayer.\nThe representative for Clarksville, who has been speaker for less than a month, intervened and said 'Amen' five minutes into B.J. Van Aman's long-winded grace before quickly ushering him off of the stage.\nA woman at the front of the statehouse is then heard in one of the microphones saying: 'That was a sermon.'\nThe GOP politician has since apologized for his actions, but insists he gave the clergymen 'due diligence'.\nIn an interview with the Columbus Dispatch, Rosenberger said: 'I didn’t mean to be rude and I feel terrible.\n'It’s just that I felt that I gave it its due diligence. When I thought it was enough I didn’t know really how best to do it, so I just said \"amen\" and here we go.'\nVideo footage shows Rosenberger opening the session and then inviting Van Aman to the stage.\nRep. Tim Schaffer had welcomed the religious leader from his district to make the opening remarks.\nMost prayers go on for around 90 seconds, but Van Aman's message continued for five minutes.\nPastor B.J. Van Aman is seen giving his opening prayer to the Ohio House of Representatives\nSpeaker Of The House Cliff Rosenberger (far right) is seen first opening his eyes after about three minutes\nPoll Should the Speaker have stopped the pastor mid-prayer? Yes No Should the Speaker have stopped the pastor mid-prayer? Yes 64 votes\nNo 26 votes Now share your opinion\nRosenberger is seen first opening his eyes after about three minutes, before shutting them again and carrying on.\nJust before the four-minute mark, he starts to look anxious about the length and trying to decide the right way to end it.\nThen, around five minutes in, he cuts him off.\n'You were pleased with Solomon, may you be pleased with us,' Van Aman said.\n'Amen,' Rosenberger said. He then thanked the pastor for being there before ushering him off the stage.\nRosenberger then led the members of the House in the Pledge of Allegiance.\nSince there are microphones on the desks of House members, one female member could be heard saying, 'That was a sermon.'\nDaily Mail Online has contacted Van Aman for comment .\nJust before the four-minute mark, he starts to look anxious about the length and trying to decide the right way to end it. Then, around five minutes in, he cuts him off by saying 'Amen'\nHe then thanked the pastor for being there before ushering him off the stage","url":"https://www.dailymail.co.uk/news/article-3421040/Republican-Ohio-House-Speaker-cuts-pastor-s-opening-prayer-saying-amen-ushering-stage.html"}
