{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:08:48","date_modify":"2018-10-30 18:08:48","date_publish":"2015-10-22 17:43:12","description":"Paul Ryan spoke to members of the RSC on Wednesday, then the group voted overwhelmingly to endorse Ryan for Speaker of the House.","filename":"data/vaneerConsumption/RepublicanStudyCommitteeEndorsesPaulRyanforSpeakeroftheHouse.json","image_url":"https://media.breitbart.com/media/2015/01/Paul-Ryan-Reuters-e1421103401857.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_22__1540922928.html","title":"Republican Study Committee Endorses Paul Ryan for Speaker of the House","title_page":"Republican Study Committee Endorses Paul Ryan for Speaker of the House | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Republican Study Committee (RSC) is encouraging House Ways and Means Committee Chairman Rep. Paul Ryan (R-WI) to run for Speaker of the House. Chairman of the RSC, Rep. Bill Flores (R-TX), says he is “confident” that Ryan “is the right person” for the job.\nIn a press release, Flores wrote:\nAfter hearing Paul lay out his vision for the future of the Republican conference, I am confident that he is the right person to lead the House going forward. He has the policy expertise, conservative principles and strong values we need in our next Speaker. He is a member of the Republican Study Committee and has shown he is willing to work with fellow conservatives to address our policy and process goals. I personally worked closely with Paul on the House Budget Committee from 2011-2014 to craft four transformational budgets and believe he will lead with the bold, fresh ideas that America needs.\nRyan spoke to members of the RSC on Wednesday. The press release states that following the meeting, members of the RSC overwhelmingly voted to endorse Ryan for Speaker of the House.\nRyan had said he would only run for Speaker of the House if the conference united behind him. He spent part of the day on Wednesday meeting with conservative groups, including the House Freedom Caucus which Breitbart’s Matthew Boyle reports was given promises by Ryan in exchange for support.\nRyan gave the conservative groups until Friday to decide whether or not they would support his run for Speaker. The only other candidate officially running for Speaker of the House is Rep. Dan Webster (R-FL).","url":"https://www.breitbart.com/politics/2015/10/22/republican-study-committee-endorses-paul-ryan-speaker-house/"}
