{"authors":["John Binder"],"date_download":"2018-10-30 19:07:28","date_modify":"2018-10-30 19:07:28","date_publish":"2018-08-01 19:52:18","description":"The Republican-approved DHS Appropriations bill includes a quasi-amnesty for illegal aliens who are currently enrolled in DACA.","filename":"data/vaneerConsumption/RepublicanDHSFundingBillIncludesQuasiAmnestyforDACAIllegalAliens.json","image_url":"https://media.breitbart.com/media/2018/08/AmericaRunsOnImmigrants_Getty_2018-e1533152981693.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_01__1540926448.html","title":"Republican DHS Funding Bill Includes Quasi-Amnesty for DACA Illegal Aliens","title_page":"Republican DHS Funding Bill Includes Quasi-Amnesty for DACA Illegal Aliens","title_rss":"NULL","source_domain":"breitbart.com","text":"The GOP-approved 2019 homeland security funding bill includes a quasi-amnesty for the nearly one million illegal aliens who are currently enrolled in the President Barack Obama’s Deferred Action for Childhood Arrivals (DACA) program.\nThe quasi-amnesties for DACA illegal aliens and foreign nationals who are in the United States on Temporary Protected Status (TPS) was slipped into the appropriations bill by Rep. Pete Aguilar (D-CA) and approved by Rep. Kevin Yoder (R-KS).\nEssentially, the amendments to the funding bill prohibit DHS from using any funds or resources from detaining any DACA illegal aliens or foreign nationals who have TPS.\nDan Cadman, a fellow with the Center for Immigration Studies, says the Aguilar amendments approved by Yoder and the House Republicans are a “stealth amnesty” for DACA illegal aliens and the thousands of TPS foreign nationals.\nCadman writes:\nHaving gotten his way on the prohibition against deporting DACA veterans, which was probably a great surprise to him, Aguilar then introduced a more broad-based amendment. This one prohibits expenditure of funds to detain or deport any DACA or even Temporary Protected Status (TPS) program recipients. (Note the rapidly expanding pool of illegal alien beneficiaries of Aguilar’s amendments.) This is a stealth amnesty for both populations of aliens that would number into the hundreds of thousands, possibly over a million. [Emphasis added] A number of the TPS programs have been terminated by the Trump administration with forward-projected end dates, as was DACA, whose recipients are for the moment protected by an injunction at the lower court level. However, the administration has appealed the district court decision and it is a reasonable expectation that it will ultimately prevail at the Supreme Court. If so, then it seems likely that the outcome of Aguilar’s second amendment would be to burden the United States with a permanent underclass of aliens who have no lawful status as theirs expires, but who cannot be removed since DHS would be prohibited from spending funds to do so. If Congress wishes to bestow benefits on these individuals, then the appropriate mechanism is to do so via amnesty, which to date it has declined to do. It is incredible that the House Appropriations Committee would permit such an amendment to pass on a voice vote. [Emphasis added]\nImmigration experts told Breitbart News that the quasi-amnesties for DACA illegal aliens and TPS foreign nationals would act as a barrier for President Trump and the Justice Department in the courts. Currently, the administration is fighting to end DACA. The amendments, though, codify the policy, making the Obama-created program that much harder to terminate.\nThis week, Trump threatened to shut down the federal government if he did not receive funding for his proposed border wall along the U.S.-Mexico border, Breitbart News reported.\nThe DHS funding bill includes $5 billion for the border wall, but the House Republicans — including Rep. Martha Roby (R-AL), who said she was “proud” to vote for the bill — have tied the wall funding to a number of open borders policies that would give a global right to migrate for any foreign national claiming domestic abuse or fearing gang violence.\nAsylum Rules Would Allow Migrating Foreign Populations to Fill Half of Midwesthttps://t.co/Bbtn2Oubjp — John Binder 👽 (@JxhnBinder) July 27, 2018\nAs Breitbart News noted, the GOP-run House appropriations committee voted to revive Obama’s Catch and Release policies — where illegal aliens and asylum seekers are caught at the border, then released into the U.S. general public — by deliberately defunding Attorney General Jeff Sessions’s return to the traditional, narrow interpretation of asylum laws.\nEfforts to codify the Catch and Release policy into law would give the entire populations of El Salvador, Guatemala, and Honduras — 32 million Central Americans — the right to migrate to the U.S., as well as any other foreign nationals who travel to the country and claim they are fleeing gangs or domestic violence. This translates to a foreign population at least half the size of the American Midwest being given the right to migrate to the country under the GOP’s Homeland Security funding measure.\nThe border wall funding has also been tied to a green card giveaway for at least 200,000 Indian nationals who are in the U.S. on guest worker visas, Breitbart News reported, along with a tripling of the number of H-2B visa workers who let into the country and allowed to take U.S. blue collar jobs and an expansion of the H-2A visa program, which would deliver more cheap foreign workers to farms across the country.","url":"https://www.breitbart.com/politics/2018/08/01/republican-dhs-funding-bill-includes-quasi-amnesty-for-daca-illegal-aliens/"}
