{"authors":["Krishnadev Calamur"],"date_download":"2018-10-23 01:10:24","date_modify":"2018-10-23 01:10:24","date_publish":"2014-11-07 00:00:00","description":"He told supporters in Springfield, Va., that the gap in the number of votes between him and the Democratic incumbent, Sen. Mark Warner, had grown and \"I know that a change in outcome is not possible.\"","filename":"data/vaneerConsumption/RepublicanEdGillespieConcedesVirginiaSenateRace.json","image_url":"https://media.npr.org/assets/img/2014/11/07/ap700248838341_wide-1c33eb729392c919737f3d8b2c91c59f60acd78e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_11_07_362330486_republican-ed-gillespie-concedes-virginia-senate-race_1540257024.html","title":"Republican Ed Gillespie Concedes Virginia Senate Race","title_page":"Republican Ed Gillespie Concedes Virginia Senate Race : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Republican Ed Gillespie Concedes Virginia Senate Race\nRepublican challenger Ed Gillespie has conceded to Democratic incumbent Mark Warner in the U.S. Senate race in Virginia. The contest was one of two Senate races left undecided in Tuesday's midterms.\n\"I've called Mark Warner this morning to congratulate him on his re-election, to thank him for his public service to our commonwealth and to wish him and his family well,\" Gillespie, a former chairman of the Republican National Committee, said today in Springfield, Va.\nGillespie said he was \"proud of the campaign\" that he had run, but that the gap in the number of votes between him and Warner had grown since Tuesday and stood at more than 16,700.\n\"In my head and in my heart, I know that a change in outcome is not possible,\" he added. \"The numbers just aren't there, and it's time to accept the decision of my fellow Virginians.\"\nFormer Republican National Committee Chairman Ed Gillespie concedes his bid for the U.S Senate on Friday in Springfield, Va. YouTube\nIn a statement posted on Twitter, Warner commended Gillespie on the campaign.\n\"Voters sent a clear message that Congress must get to work,\" Warner said. \"I hear this loud and clear. We will get the Senate back to solving problems.\"\nWarner, a popular former governor of Virginia, was seen as a shoo-in for re-election, with polls consistently placing him comfortably ahead of Gillespie, the Republican. But as results came in on Tuesday night, the story was different: The two men were separated by less than 1 percentage point. Warner claimed victory on election night, but Gillespie refused to concede.\nResults posted on the Virginia Department of Elections website today showed that Warner captured 49.12 percent of the vote, Gillespie had 48.36 percent and Libertarian candidate Robert Sarvis won 2.43 percent.\nRepublicans dominated Tuesday's midterm elections, retaking control of the Senate and bolstering their majority in the House of Representatives.\nResults for the Senate race in Alaska, the other state that was not called on Tuesday, are likely to take some time.","url":"https://www.npr.org/sections/thetwo-way/2014/11/07/362330486/republican-ed-gillespie-concedes-virginia-senate-race"}
