{"authors":["Patrick Howley"],"date_download":"2018-10-30 21:37:58","date_modify":"2018-10-30 21:37:58","date_publish":"2016-09-23 19:19:11","description":"Top Hillary Clinton aide Cheryl Mills signed an immunity deal with the Obama administration to participate in the FBI's Hillary Clinton investigation. Republicans are not happy about it. | Politics","filename":"data/vaneerConsumption/RepublicansBashCherylMillsImmunityDealHandingOutImmunityDealsLikeCandy.json","image_url":"https://media.breitbart.com/media/2016/09/cheryl-mills-hillary-clinton-Getty-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_23__1540935478.html","title":"Republicans Bash Cheryl Mills' Immunity Deal: 'Handing Out Immunity Deals Like Candy'","title_page":"Republicans Bash Cheryl Mills' Immunity Deal: 'Handing Out Immunity Deals Like Candy' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — Top Hillary Clinton aide Cheryl Mills signed an immunity deal with the Obama administration to participate in the FBI’s Hillary Clinton investigation. Republicans are not happy about it.\nMills slipped up in the Clinton civil case and admitted that Clinton’s emails were not available to people pursuant to federal records laws. In the FBI case, she and two other State Department employees had immunity, it was revealed Friday.\nThe Trump campaign was quick to throw cold water over all of it.\n“Revelations that three additional individuals, including Cheryl Mills, were granted immunity from prosecution in Hillary Clinton’s email scandal shows this was without a doubt a criminal scheme,” said Trump senior communications adviser Jason Miller in a statement to Breitbart News. Miller said:\nAt its heart, Clinton’s secret server was an end run around government transparency laws designed to hide corruption between the Clinton Foundation and her State Department, an arrangement which ultimately put our national security and sensitive diplomatic efforts at risk. No one with judgment this bad should be allowed to serve as President of the United States or hold any public office. What has become abundantly clear is that the Obama Administration is protecting Hillary Clinton from accountability at all costs because she will keep the rigged system in Washington in place. In light of this development, Hillary Clinton must immediately come forward and promise the American people that none of these individuals will ever serve in any capacity in her administration.\nHouse Oversight Committee chairman Rep. Jason Chaffetz also expressed frustration.\n“No wonder they couldn’t prosecute a case,” Chaffetz said. “They were handing out immunity deals like candy.”","url":"https://www.breitbart.com/politics/2016/09/23/republicans-bash-cheryl-mills-immunity-deal-handing-out-immunity-deals-like-candy/"}
