{"authors":[],"date_download":"2018-10-30 01:25:55","date_modify":"2018-10-30 01:25:55","date_publish":"2016-04-22 02:22:15","description":null,"filename":"data/vaneerConsumption/RepublicanBruceRaunerIsPlannedParenthoodsBestFriend.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/04/Rauner_inauguration_002.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862755.html","title":"Republican Bruce Rauner Is Planned Parenthood's Best Friend","title_page":"Republican Bruce Rauner Is Planned Parenthood's Best FriendThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Watching the train wreck of the GOP presidential race, it’s easy to miss what’s been happening with Illinois’ crony Republican Gov. Bruce Rauner.\nBack in 2014, I warned conservatives about Rauner , who was supported by the national GOP establishment:\nIf a candidate with Rauner’s history can buy political absolution with donations, after being a major donor to the Democratic Party, Planned Parenthood, and the ACLU, then why bother with the seemingly petty exercise of living by a conservative creed?\nIn the sixteen months since he assumed office, Rauner could have redeemed himself. Instead, he has spent millions of dollars attacking pro-life Republican incumbents and candidates.\nRauner could have been a white knight rescuing Illinois from its precarious fiscal cliff. Instead, this Governor is on a quest for absolute power and control and a little thing like a deficit isn’t going to stand in his way. The state’s budget impasse is now in its tenth month, saddling Illinois taxpayers with $8 billion in debt and growing.\nYet Rauner made certain his Planned Parenthood pals still received their state paychecks.\nAccording to Breitbart:\nAt the start of the state’s fiscal crisis in June, when spending authority expired, the Comptroller [appointed by Rauner] signed off on $1.5 million in grants to Planned Parenthood. This amount was five times greater than the amount awarded to the abortion provider the previous month. In late August, while the abortion provider was embroiled in a national scandal over its alleged “harvesting” of baby organs, Munger [the Comptroller] authorized another $200,000 for the group. Since the start of 2015, the Comptroller has approved $3.6 million in grants to Planned Parenthood, far above the $700k sent to the group for “contracted payments.”\nThere’s more.\nBack in March, Rauner’s proxy war with Democrat House Speaker Michael Madigan shattered state spending records: $13 million was spent on three local primary races alone.\nOne of the key races involved Rep. Ken Dunkin, a liberal Democrat with a criminal record for battery and violating protection orders who is — wait for it — a big Rauner ally and defector on key votes.\n“Recruited” by Rauner, Dunkin quietly skipped town during a crucial labor bill vote to override the Governor’s veto in late 2015 and incurred Madigan’s wrath. (In 2009, Dunkin also skipped the vote to impeach former Gov. Rod Blagojevich — opting instead for a Caribbean cruise.)\nNot exactly the stuff GOP dreams are made of.\nStill, Rauner surrogates at the Illinois Opportunity Project, run by Cicero political operativeDan Proft, and IllinoisGo spent $4.1 million desperately trying to save Dunkin’s sorry hide.\nWhile Rauner was hustling to re-elect Dunkin the Democrat, his PACs were launching attacks on pro-life Republican Sen. Sam McCann and scores of other GOP candidates with negative TV ads and political mailers disguised as weekly newspapers.\nMcCann became a thorn in Rauner’s side when he threatened to run a third-party bid for governor in 2014. Rauner’s large donations to Democrats, relationship with Mayor Rahm Emanuel, and support for abortion were a concern to many conservative voters and McCann was their voice. But McCann’s lone Republican vote against Senate Bill 1299 — though inconsequential — gave the Governor the pretext he needed to make an example of the GOP state senator.\nEnter Rauner’s partner, billionaire investor Sam Zell.\nAfter Zell donated $4 million to Rauner’s Turnaround Illinois committee, $1.8 million wastransferred to Liberty Principles PAC (run again by Rauner’s lieutenant, Dan Proft) to launch attack ads against McCann.\nEvery pro-life group in Illinois endorsed McCann — not that it mattered to Gov. Rauner.\nNational Right to Life News has called out Zell as part of “elite circle that pours in major money to an affiliate of the largest abortion provider in the world.”\nAccording to a Crain’s business profile, Zell and his wife, Helen, donated more than $600,000 to Planned Parenthood Illinois in an attempt to counter efforts by the tea party and other social conservatives to eliminate “women’s health services.” The Zells have also donated hundreds of thousands more to the Chicago arm of the American Civil Liberties Union’s Reproductive Rights Project.\nGov. Rauner, too, shares a similar history with Zell.\nIn a letter to supporters, Rauner’s wife wrote:\nHe [Bruce] won the [GOP] primary despite his pro-choice stance, in part by convincing pro-lifers to put aside their views on this issue in favor of economic ones…. Bruce has been one of the largest supporters of the ACLU Reproductive Rights Project for over 20 years. He has been a major supporter of Planned Parenthood both locally and nationally for a similar time, such that Cecile Richards told her local staff in Illinois earlier this year, “if I hear anything negative about Bruce Rauner my head will explode.”\nIn the end, Rauner’s surrogates spent $9 million in the three key races and lost them all. The Governor spent $3 million to defeat McCann in his tiny state senate district and failed.\nAs one Springfield blogger put it, “Everyone with even semi-honest eyes could see that Rauner was a big loser. He [Rauner] won several other [GOP] primary races, but he basically steamrolled a bunch of unprepared [GOP] amateurs with overwhelming financial resources and (in most cases) viciously negative ads.”\nIs this the kind of Republican acceptable to the establishment? A GOP governor bankrolled by Planned Parenthood donors?\nIf this election cycle reveals anything, it’s how far the Grand Old Party has fallen from its formerly Reaganesque principles.\nWith “Republicans” like Rauner in charge, who can blame the people for revolting?","url":"https://spectator.org/republican-bruce-rauner-is-planned-parenthoods-best-friend/"}
