{"authors":["Elizabeth Castillo","Karin Klein","Dan Morain","Ricardo Cano"],"date_download":"2018-10-30 22:45:56","date_modify":"2018-10-30 22:45:56","date_publish":"2018-08-14 22:24:55","description":"California's Legislature is downsizing a plan to require ethnic studies for high school graduation—and not for the reason you might think. A bill working through the California Legislature, authored by Assemblymember Jose Medina, could require high school students to take ethnic studies.","filename":"data/vaneerConsumption/RequireethnicstudiestograduatehighschoolCaliforniainchesclosertotheidea.json","image_url":"https://calmatters.org/wp-content/uploads/Graduation_Robbie-Short_1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939556.html","title":"Require ethnic studies to graduate high school? California inches closer to the idea","title_page":"Require ethnic studies to graduate high school? California inches closer to the idea | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As a teacher in Los Angeles county, Jose Lara has fought for years to have ethnic studies taught in high schools across the state. He’s taught the course for 13 years and says he’s seen his students transform by studying their history—whether learning about Cesar Chavez, who led the farmworkers movement in the ’60s, or about Angel Island, a port of entry near San Francisco that limited Chinese immigration in the early 1900s.\n“Ethnic studies helps students develop an academic identity,” he said. “It really builds empathy cross-culturally as well so it brings communities that may be different from one another closer together.”\nBut skeptics say the state couldn’t afford to require such a course. Some critics go even further, insisting the state shouldn’t reinforce “identity politics” and instead should laser-focus on shrinking the academic achievement gap for black and Latino students.\nThis week the Legislature—which had been considering a bill to make California the first state to require ethnic studies for high school graduation—backed away from creating such a statewide mandate, citing costs estimated to top $400 million. Sponsors settled on a pilot program instead.\nThe pilot would cover 10 to 15 school districts across the state that will opt in to have ethnic studies as a graduation requirement. Schools would begin applying next year and the program would create the requirement for some students as early as 2022, with schools reporting their findings in 2024.\nA state law passed in 2016 already encourages high schools to offer an elective course in ethnic studies, and requires the state to create a model curriculum for the class by 2020. Currently only 1 percent of California’s public high school students take ethnic studies.\nOther states, including Indiana and Oregon, have also boosted instruction of ethnic studies in recent years.\n“This needs to be taught,” said the bill’s author, Democratic Assemblymember Jose Medina of Riverside. “I don’t know how a person can say they’re educated without knowledge of other groups, other cultures, other histories.”\nDemocrats who control the state Capitol—and even some Republicans—had voted for the statewide mandate, but its price tag led the California School Boards Association to oppose it. The new changes that water it down to a pilot program may help the bill overcome a key hurdle this week when the Senate Appropriations Committee will kill many bills that propose costly new programs.\nBut even the weaker version is unlikely to mollify critics who say schools shouldn’t impose another graduation requirement when so many students are struggling with English and math. Just 32 percent of 11th graders met math standards on state exams last year, and 60 percent met standards for reading and writing.\n“We have a very large segment of our black population, specifically they are boys who by a certain age in their educational career can’t read and write at the same level as their white counterparts,” said Republican Assemblywoman Melissa Melendez of Lake Elsinore, who voted against the bill.\n“I think more of a focus on the essentials, the basics, for students is where the focus should be.”\nBut with students of color making up more than 70 percent of California’s public school population, some educators say a class in ethnic studies could boost student success.\n“I believe this is critical to allow schools districts to adapt their courses to reflect the pupil demographics in their communities as an innovative strategy to constructively impact students both socially and academically,” state Superintendent Tom Torlakson said in a statement.\nMedina and Lara pointed to research that found students enrolled in an ethnic studies course fare better in other coursework as well. The study followed 1,400 9th graders in the San Francisco Unified School District and found that for students taking ethnic studies, attendance increased by 21 percent, and their grade point averages improved by 1.4 points.\nIn the Los Angeles Unified School District, the ethnic studies curriculum covers ethnic identities including African-American, Latino American, American Indian and Asian American. The course includes a PBS documentary on the Trail of Tears, where thousands of Native Americans died while being forcibly removed by the federal government in the 1830s. It also covers contemporary developments, such as President Barack Obama’s 2013 speech on Trayvon Martin, a 17-year-old unarmed African American fatally shot by George Zimmerman, a 28-year old neighborhood watch volunteer in Florida.\nA model curriculum for the statewide course would include lessons on the student protests at San Francisco State University that first ignited the ethnic studies movement in 1968.","url":"https://calmatters.org/articles/high-school-ethnic-studies-requirement/"}
