{"authors":[],"date_download":"2018-10-22 22:23:41","date_modify":"2018-10-22 22:23:41","date_publish":"2014-05-10 11:01:45","description":"\"They're headed back to ... the same area they were in to continue the search around the towed pinger locator detections that were made earlier.\"","filename":"data/vaneerConsumption/RerunMH370SearchersHeadtoSiteofFirstPing.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/433771/bluefin_e5605b1b5ef5d9611469d785ab096485.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_rerun-mh370-searchers-head-site-first-ping-n102071_1540247021.html","title":"Rerun? MH370 Searchers Head to Site of First 'Ping'","title_page":"Rerun? MH370 Searchers Head to Site of First 'Ping'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn Australian naval vessel carrying the Bluefin-21 underwater drone involved in the search for the missing Malaysia Airlines jet left port on Saturday on its second mission to scan part of the Indian Ocean where the longest sonar \"ping\" was heard over a month ago.\n\"They're headed back to ... the vicinity of the same area they were in to continue the search around the towed pinger locator detections that were made earlier last month,\" U.S. Navy Captain Mark Matthews told journalists at a naval base near Perth.\nA signal was first located and heard for about two hours on April 5, some 1,000 miles northwest of Perth.\nNo trace of missing MH370 has been found despite the more than two dozen countries that have been involved in hunting for the flight that vanished from radar after taking off from Kuala Lumpur for Beijing with 239 people on board.\nThe search for the Boeing 777 had been concentrated on a 121-square-mile area around the second \"ping\" detected and monitored for about 13 minutes on April 5, and which search authorities identified as their strongest lead.\nWith the search of that area complete, the focus is shifting to the area where the first, and longer, signal was detected the same day, Matthews said.\n\"What you do is you go look at your best indications and you pursue them until they're exhausted,\" he said. \"These things don't happen fast. These searches don't happen on the hours or days cycle. These happen on the weeks and months cycle.\"\n- F. Brinley Bruton, with Reuters","url":"https://www.nbcnews.com/storyline/missing-jet/rerun-mh370-searchers-head-site-first-ping-n102071"}
