{"authors":[],"date_download":"2018-10-22 22:29:04","date_modify":"2018-10-22 22:29:04","date_publish":"2014-06-10 07:38:30","description":"A rescue team has reached the experienced 52-year-old cave researcher in the Riesending cave system near Berchtesgaden in Germany.","filename":"data/vaneerConsumption/RescuersScrambletoSaveGermanMountaineerTrappedinAlpsCave.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/498441/140610-germany-cave-rescue-330a_c80c6b2d7996c34c65c3206b792ccd31.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_europe_rescuers-scramble-save-german-mountaineer-trapped-alps-cave-n127091_1540247344.html","title":"Rescuers Scramble to Save German Mountaineer Trapped in Alps Cave","title_page":"Rescuers Scramble to Save German Mountaineer Trapped in Alps Cave","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"We'll try to start the rescue today,\" he said. \"Lots of questions still exist, but we currently plan that the recovery operation would last about a week dependent on the situation of the patient.\"\nSchneider said it was a one-of-a-kind rescue operation, even for the experienced Alpine rescue teams. Swiss specialists are expected to arrive at the injured by mid-day and other international teams have been asked to join the rescue effort.\nSchneider said conditions inside the cave remain difficult, but that efforts to improve communication with the teams underground have been made.\nSpecialists have been able to install a radio system that allows direct communication about 500 meters down.\n\"Because of the radio system, we've gained five hours in communication,\" Schneider said, explaining that it is a 10 to 12 hour climb to reach the mountaineer.\nThe complex nature of the cave system, as well as its depth, is making the operation even more hazardous, officials said.\n\"We have shafts that go straight down 350m [1,150 ft], where you have to abseil down and climb back up on a rope,\" rescue official Klemens Reindl told German TV.\n- Carlo Angerer","url":"https://www.nbcnews.com/news/europe/rescuers-scramble-save-german-mountaineer-trapped-alps-cave-n127091"}
