{"authors":[],"date_download":"2018-10-22 22:35:41","date_modify":"2018-10-22 22:35:41","date_publish":"2014-06-10 16:34:48","description":"Officials said they have made progress in rescuing a researcher who was seriously injured more than 3,000 feet inside a deep cave in the German Alps.","filename":"data/vaneerConsumption/RescuersRacetoSaveInjuredResearcherStuckinGermanCave.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/499651/140610-cave-1-1215_c9d2227ee54e6932566ec527b95d782d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_rescuers-race-save-injured-researcher-stuck-german-cave-n127436_1540247741.html","title":"Rescuers Race to Save Injured Researcher Stuck in German Cave","title_page":"Rescuers Race to Save Injured Researcher Stuck in German Cave ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBERCHTESGADEN, Germany — With a communication system in place and a doctor on the way, officials said Tuesday that they have made major progress toward rescuing a researcher who was seriously injured more than 3,000 feet inside a deep cave in the German Alps.\nThe experienced climber, whose name was not released, has been fighting for his life after falling stones hit him on Sunday morning.\nThe severe head injuries he sustained would be difficult to treat above the surface, but inside the cave, rescue crews face even more difficulties including tight passageways, long vertical drops, and underground waterways. His rescue is still days away and remains risky, officials said.\nStefan Schneider with Bavaria’s mountain rescue team said Tuesday afternoon that the injured researcher was communicating with the rescuers who first reached him Monday, and was able to stand up and make a few steps with the help of others.\n“That’s very, very important and positive for us,” Schneider said.","url":"https://www.nbcnews.com/news/world/rescuers-race-save-injured-researcher-stuck-german-cave-n127436"}
