{"authors":[],"date_download":"2018-10-23 03:40:55","date_modify":"2018-10-23 03:40:55","date_publish":"2016-01-29 18:50:26","description":"Zika virus is spreading rapidly through the Americas leaving researchers scrambling to understand the very basics, including how to prevent, treat and diagno...","filename":"data/vaneerConsumption/ResearchersscrambletofightbrandnewZikavirus.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6k0-3bmscybNe842cce83474b58e5b50-873_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422182_Researchers-scramble-fight-brand-new-Zika-virus_1540266055.html","title":"Researchers scramble to fight 'brand new' Zika virus","title_page":"Researchers scramble to fight 'brand new' Zika virus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Researchers scramble to fight 'brand new' Zika virus\nZika virus is spreading rapidly through the Americas leaving researchers scrambling to understand the very basics, including how to prevent, treat and diagnose the emerging mosquito-borne threat.\nThere is no vaccine against Zika, which top US health authorities described Thursday as a \"brand new\" virus that has expanded swiftly in recent years and been linked to brain damage in babies.\nNo matter how fast the world acts, it will be years before a vaccine is widely available, said Anthony Fauci, head of the National Institute for Allergy and Infectious Diseases (NIAID).\nThere is no vaccine against Zika, which top US health authorities described as a \"brand new\" virus that has expanded swiftly in recent years and been linked to brain damage in babies ©Juan Barreto (AFP)\n\"This is a brand-new virus so we, prior to this time, have really not spent anything on Zika,\" Fauci said.\nNor is there any vaccine on the market yet against dengue virus, which comes from the same family of flaviviruses.\nThe US government is appealing for all kinds of research on Zika and will draw from a pool of $97 million to fund studies on everything from how it spreads to how it causes disease to how to control the mosquitoes that spread it.\n\"NIAID researchers are working on vaccine candidates to prevent Zika virus infection,\" he added.\n\"It is to our advantage that we already have existing vaccine platforms to use as a sort of jumping off point,\" he said, mentioning two avenues of study based on prior research into West Nile and dengue vaccines.\n\"While these approaches are promising, it is important to understand that we will not have a widely available, safe and effective Zika vaccine this year and probably not even in the next few years.\"\n- Mild to severe -\nZika was first identified in 1947, causing its first human case in 1952 in Uganda. However, most cases were mild, resulting in rash, fever, and red eyes in a small fraction of cases.\nHealth authorities barely took notice until an outbreak on the Micronesian island of Yap in 2007.\nAn outbreak that began last year in Brazil has been blamed for a surge in birth defects in Brazil, where thousands of babies have been born with small heads, an incurable and sometimes fatal condition known as microcephaly.\n\"Zika virus's spread in the Americas and its effect on pregnancy are new developments that we are working with partners to better understand,\" said Anne Schuchat, principal deputy director of the US Centers for Disease Control and Prevention.\nHealth authorities are also probing an increase in Guillain Barre syndrome, a rare neurological disorder in which a person's own immune system damages nerve cells, leading to muscle weakness and sometimes paralysis, she said.\n\"The virus is spreading throughout the Americas and we expect more countries to be affected,\" warned Schuchat.\n- Sexual transmission? -\nResearchers are also aware of two cases in the past several years which suggest the virus could be spread through sexual contact -- one case in which Zika was detected in a man's semen after it disappeared from his bloodstream, and another in which a man infected in Senegal may have infected his wife back in Colorado.\nHowever, Schuchat added that \"the science is very clear to date: that Zika virus is primarily transmitted to people through the bite of an infected mosquito. So that is really where we are putting the emphasis right now.\"\nOther researchers are calling for an increased focus on preventing mosquito bites, particularly in impoverished areas.\n\"We need to look at historical successes to embark on similar programs in Zika-affected countries,\" said Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine.\nHotez called for new studies on technologies -- such as insecticides, genetically modified mosquitoes, bed net use and mass drug treatment with antiparasitic ivermectin -- as potential ways to prevent the virus and kill the Aedes aegypti mosquito which carries it.\nThe Zika virus ©Adrian Leung/John Saeki (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3422182/Researchers-scramble-fight-brand-new-Zika-virus.html"}
