{"authors":[],"date_download":"2018-10-22 20:46:25","date_modify":"2018-10-22 20:46:25","date_publish":"2014-06-03 00:12:24","description":"Several big-time websites are planning an online protest of NSA snooping, hoping to get people to lock their own data down.","filename":"data/vaneerConsumption/ResettheNetWebsitesPlanOnlineProtestAgainstNSASnooping.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/482896/reset_772c7368f6faba3b952d7c717d042b04.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_reset-net-websites-plan-online-protest-against-nsa-snooping-n120841_1540241185.html","title":"'Reset the Net': Websites Plan Online Protest Against NSA Snooping","title_page":"'Reset the Net': Websites Plan Online Protest Against NSA Snooping","title_rss":"NULL","source_domain":"nbcnews.com","text":"According to organizers, everyone has something they can do, however small: Site owners can add an NSA-foiling security feature, apps can check that their advertisers and permissions aren't invasive, and users can download one of the many privacy-enhancing apps and browser add-ons out there.\nVarious resources and links are being made available at the Reset the Net website, and a big social media push is planned for Thursday.\nBut while the tone may be similar to 2012's widespread online efforts to protest SOPA, the scale isn't quite at the same level. No Google this time: Reddit is by far the largest website signed up for Reset the Net, although dozens of advocacy groups and privacy-conscious service providers have joined up.\nParticipants include Wordpress.org, DuckDuckGo, Mozilla, the Electronic Frontier Foundation and the ACLU.\nWhile it may end up being a modestly sized protest, Reset the Net may help raise the visibility of some lesser-known tools and techniques for fighting back against surveillance. We'll see on Thursday.","url":"https://www.nbcnews.com/tech/security/reset-net-websites-plan-online-protest-against-nsa-snooping-n120841"}
