{"authors":[],"date_download":"2018-10-22 21:02:03","date_modify":"2018-10-22 21:02:03","date_publish":"2014-06-03 22:04:39","description":"For a team at Florida Atlantic University, 2,048-acres of sandy bottom in the Atlantic Ocean is perfect or a first-of-its-kind experiment.","filename":"data/vaneerConsumption/ResearcherstoTestOceanTurbineGeneratorsOffFloridaCoast.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485561/140603-wave-florida-1802_fd6dd24b8c3792b68bfe05879d94359e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_researchers-test-ocean-turbine-generators-florida-coast-n121771_1540242123.html","title":"Researchers to Test Ocean Turbine Generators Off Florida Coast","title_page":"Researchers to Test Ocean Turbine Generators Off Florida Coast","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFORT LAUDERDALE, FLORIDA -- For a team at Florida Atlantic University, 2,048-acres of sandy bottom in the Atlantic Ocean is the perfect location for a first-of-its-kind experiment testing water-powered turbines that could contribute to the future of energy.\nApproximately thirteen miles off the coast of Fort Lauderdale, there’s a steady flow of ocean current called the Gulf Stream.\nThe researchers’ plan: lower a turbine into that Gulf Stream and position the equipment so the flow of water from south to north spins a propeller that in turn produces electricity.\nThink of it as a sort of windmill 100 to 160 feet below the surface.\n“The ocean current is consistent. It flows 365 days a year. There is some variability which is what we’re hoping to better understand,\" says Sue Skemp, director of the Southeast National Marine Renewable Energy Center at FAU.\nUnlike windmills or solar panels that have lulls when the wind stops blowing or at night when there is no sun, Skemp believes that if the equipment operates in the saltwater as it does in computer models, someday a portion of our energy needs could come from the always flowing gulf stream.\nAn unknown remains: Might the spinning blades of an underwater turbine end up killing fish, and turtles that also use the Gulf Stream as their underwater highway?\n“What happens when we put a device in the water? How does it interact with turtles? That information is sparse,” says Skemp.\nThe 10-foot-long blades spin approximately one revolution every second. Scientists say they will monitor what’s happening via underwater cameras. At first, Skemp says the turbine will run only during daylight hours.\nIf a slow-moving turtle is headed into the carbon-fiber blades, engineers say they have an “emergency off” button to prevent those endangered species from being chopped up. But Skemp says there is no way of knowing until they launch whether turtles and other marine life may simply swim around the danger.\nThe turbines are scheduled to be positioned in the Gulf Stream early this winter.\nThe U.S. Department of the Interior is responsible for leasing underwater plots of land. What was once the domain of oil and mineral companies is slowly finding a different group of “renters.”\nEnergy companies near Massachusetts, Rhode Island, Delaware and Virginia have already won leases for sometimes controversial off-shore windmills. Those plots of land will be used to anchor the above water windmills.\nTracey Moriarty, at the US Bureau of Ocean Energy Management, says this underwater turbine is “the first project that we have in federal waters for hydro-kinetic technology testing. It’s too early to know where this goes. Right now it’s about getting the data.”\nEngineers have already conducted “tow tests” where an underwater turbine is pulled behind a boat. This will be the first time a turbine is lowered into a stationary position to spin on the ocean currents.","url":"https://www.nbcnews.com/science/environment/researchers-test-ocean-turbine-generators-florida-coast-n121771"}
