{"authors":["Lara O'Reilly"],"date_download":"2018-10-30 20:49:14","date_modify":"2018-10-30 20:49:14","date_publish":"2016-12-27 00:00:00","description":"The Resolution Foundation says only 51% of families own their own home, compared to ONS data that suggests a home ownership level of 64%.","filename":"data/vaneerConsumption/ResolutionFoundationsayshomeownershipfiguresoverstated.json","image_url":"https://amp.businessinsider.com/images/58626095dd08954f7f8b487f-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_resolution-foundation-says-home-ownership-figures-overstated-2016-12_1540932554.html","title":"Resolution Foundation says home ownership figures overstated","title_page":"    Resolution Foundation says home ownership figures overstated - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Alan Cleaver/Flickr CC Home ownership rates in the UK could be a lot lower than official government figures suggest, according to new research from living standards thinktank The Resolution Foundation.\nData from the Office of National Statistics (ONS) suggests family home ownership in the UK has fallen to 64% in the past decade (from levels of more than 70% in the mid-2000s), but The Resolution Foundation believes only around 51% of families in the UK own their own homes.\nIt's all down to a flaw in the ONS' counting methodology.\nThe official figures are counting the proportion of properties that are owned by an occupier, whereas The Resolution Foundation thinks we should really be looking at the proportion of people who own their own homes.\nFor example, a person could buy a house, live there, and rent out their rooms to three lodgers. This counts as an owner-occupied household, but those three tenants \"drop out of the picture,\" according to The Resolution Foundation.\nHere's another scenario that might warp the figures: Five unrelated people could all be sharing a house — but that house would be counted as simply one rented household, rather than the five people being counted as five individual renters.\nIndividuals also fall off the radar if they come back home to live with their parents.\nWhen looking at home ownership through the lens of families (a single adult, or a couple with dependent children), The Resolution Foundation concludes the home ownership peak of 71% in 2004 was actually far smaller, at around 58%, and currently stands at just over half of families in the UK owning their own home.\nThe Resolution Foundation The Resolution Foundation also provides data on where the UK lives. The home ownership and social rented sector has declined, while the private rental sector has expanded.\nThe Resolution Foundation\nThe Resolution Foundation says there are some 5.8 million families who neither own their property, rent privately nor live in the social rented sector who are missed from the official home ownership statistics. It believes the family measure of tenure provides a \"richer understanding\" of the way the UK lives.","url":"https://www.businessinsider.com/resolution-foundation-says-home-ownership-figures-overstated-2016-12"}
