{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:20:52","date_modify":"2018-10-30 21:20:52","date_publish":"2018-08-20 21:05:00","description":"Take a look inside Restaurant Holmes, the new restaurant located in Alpharetta City Center.","filename":"data/vaneerConsumption/RestaurantHolmesinAlpharetta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/20/Images/082218firstlook_09.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_fi_5551a07085ed154270eeccd85e4a9b2e__1540934452.html","title":"Restaurant Holmes in Alpharetta","title_page":"First Look: Restaurant Holmes in Alpharetta","title_rss":"NULL","source_domain":"ajc.com","text":"Restaurant Holmes from chef Taylor Neary debuted in early July — the first of 11 restaurants set to open this year at Alpharetta City Center, a new development in downtown Alpharetta, with a mix of retail and office spaces, apartments and single-family homes.\nNeary, who is a Roswell native and graduate of Le Cordon Bleu College of Culinary Arts in Atlanta, worked in the kitchens at Roux on Canton, Little Alley Steak, Opulent, St. Cecilia and Marcel, before finally having the opportunity to open a place of his own.\nLocated in the historic Jones House on South Main Street, the design was a collaboration between Neary, MT Studio Architecture and Couch Construction Services. The extensive renovation preserves the bungalow-style architecture of the former family home while creating inviting interior and outdoor spaces for drinking and dining.\nRestaurant Holmes interior. Photo credit- Mia Yakel.\nThe entrance features a cozy bar area, and beyond, a series of seating sections juxtapose vintage and modern elements, with exposed brick, hardwood floors, leather banquettes, pendant lights and bold murals by local artist Greg Mike.\nCurrently open for dinner seven days a week, with lunch on the horizon, Neary’s consecutively numbered small plate menu changes often, and regularly features seasonal ingredients from nearby Levity Farms in Milton.\nAmong the recent shareable offerings: coal-roasted beets with avocado, chile agrodolce, peach, and asparagus; tuna crudo with blueberry, avocado, baby cucumber, olive oil, and red currants; and glazed pork belly with smoked poblano, pineapple, avocado, and salsa verde.\nSam Schlif, who previously worked at Local Three and Seed Kitchen & Bar, leads the bar program, which features local beers, a concise wine list, and six cocktails showcasing house-made ingredients. The Danny Trejo is mixed with smoked tequila, tepache, lime and agave nectar, and served with a straw in a topless Scofflaw Basement IPA can.\nLast week, Neary sat down at the bar at Restaurant Holmes to talk about the food and drink, and what he hopes to achieve there.\nChef Taylor Neary at the bar at Restaurant Holmes. Photo credit- Mia Yakel.\n“I’ve opened a few restaurants as a chef, but opening a restaurant as the chef and owner adds way more layers and X factors from both sides,” Neary said. “At the same time, at a lot of restaurants I worked at, I didn’t have any say in the front, so it didn’t matter. So it was eye-opening to see how much of that stuff needed to be paid attention to every single day.\n“So a historic building preserved by the city, and a year and a half build-out. They pretty much had say in anything external. So paint color, trim, front porch, patio, elevation, landscaping. Turning a house that was built in 1914 into a high-volume professional restaurant was a long process. We had to reinforce the floors just to roll the kitchen equipment in.”\nAs to the overall concept, Neary said it was more or less the culmination of his personal and professional experiences.\n“It’s just kind of me,” he said. “And I’m expressing that through the food and the drinks and the decor. But this is something new, and we’re trying to push the envelope a little bit for the area. I knew I wanted to do the small plate format. I hate going to a restaurant and eating 10 percent of the menu. Here, two people can easily have almost half of the menu.\n“We have three categories: hot, cold and vegetable. The cold is geared toward first or second course. The veg can go either way or be a side. We have people who are vegetarians who go crazy on that, which is fun. But the menu can be customized, based on allergies, or just the way people like to eat. And sometimes we have a four-top that says send us one of everything, and that’s 20 items. But it goes hand in hand with the beer and wine and cocktails. The food is very sessionable and fresh. We’ve been open for a little over a month, and this is my 15th menu. We never want to be stagnant.”\n50 S. Main St., Alpharetta. 678-691-8320, restaurantholmes.com.\nScroll down to see more photos from Restaurant Holmes:\nCoal Roasted Beets with avocado, chili agrodolce, peach, and asparagus. Photo credit- Mia Yakel.\nTuna Crudo with blueberry, avocado, baby cucumber, olive oil, and red currants. Photo credit- Mia Yakel.\nSpaghetti alla Chitarra with Cacio E Pepe, lemon oil, and parmesan. Photo credit- Mia Yakel.\nPork Belly with proper glaze, smoked poblano, pineapple, avocado, and salsa verde. Photo credit- Mia Yakel.\nDanny Trejo cocktail with smoked tequila, Scofflaw tepache, lime, and agave. Photo credit- Mia Yakel.\nYoung Theo cocktail with rye whisky, blood orange, and apple bitters. Photo credit- Mia Yakel.\nRELATED:\nMore first looks at metro Atlanta restaurants\nMore recently opened metro Atlanta restaurants\nMore North Fulton dining news\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/first-look-small-plates-rule-restaurant-holmes-alpharetta/1m2WbxRg1IZXMJ5hGhSwxJ/"}
