{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:08:45","date_modify":"2018-10-30 21:08:45","date_publish":"2017-02-15 19:48:34","description":"U.S.-Israel relations were restored to their customary warmth; Trump and Netanyahu also indicated five new directions for future policy.","filename":"data/vaneerConsumption/Restored5WaysTrumpNetanyahuImprovedUSIsraelRelations.json","image_url":"https://media.breitbart.com/media/2017/02/Netanyahu-Trump-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_15__1540933725.html","title":"Restored: 5 Ways Trump, Netanyahu Improved U.S.-Israel Relations","title_page":"Restored: 5 Ways Trump, Netanyahu Improved U.S.-Israel Relations","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump hosted Israeli Prime Minister Benjamin Netanyahu at the White House on Wednesday — the fourth visit by a foreign leader, less than four weeks into the new administration.\nAt their joint press conference, it was clear that U.S-Israel relations are once again on solid ground, after eight years of hostility from the Obama administration. Not only were relations restored to their customary warmth, but the two leaders also indicated five new directions for future policy.\n1. The two-state solution is no longer the only option. President Trump said that while the two-state solution once seemed “easier,” he was also open to a one-state solution — presumably meaning Israeli annexation of the West Bank — and that he would accept whatever solution Israelis and Palestinians themselves chose. An Israeli journalist challenged Netanyahu as to whether he still accepted the two-state solution. He replied that his goal was not a “label,” but a peace in which Palestinians recognized the Jewish state, and where Israel had full security control of the area west of the Jordan River. The shift from “two states at any price” is a fundamental change in U.S. policy and places new (and overdue) pressure on the Palestinians.\nA new era.\nNew ideas.\nNo need for 3rd Palestinian state beyond Jordan & Gaza.\nBig day for Israelis & reasonable Arabs.\nCongrats. — Naftali Bennett בנט (@naftalibennett) February 15, 2017\n2. The U.S. opposes new settlements, but accepts existing ones. Trump asked Netanyahu, publicly, to “hold back” on settlements (to which Netanyahu joked, “That’s the art of the deal”). The implication is that the U.S. now accepts existing Israeli settlements. That is a stark contrast to the attitude of the Obama administration, which argued that the entire Israeli presence across the 1949 armistice lines — including the Jewish Quarter of the Old City of Jerusalem — was illegal. The settlements will no longer be regarded by the U.S. as an excuse for Palestinians to avoid negotiations and concessions.\n3. The U.S. and Israel will aim at a regional peace involving Arab states. Netanyahu mentioned that plan, which the two leaders had apparently discussed in private. The rise of Iran as a regional aggressor has certainly created common interests between Israel and Sunni regimes like Saudi Arabia, but Netanyahu’s suggestion that those common interests could become formal alliances, under American leadership, was a new direction. Trump seemed to be on board with the idea as well.\n4. Both countries are now focused on “radical Islamic terror.” Netanyahu explicitly thanked Trump for identifying the enemy clearly (which President Barack Obama refused to do throughout his time in office). It is a definition that takes in Sunni terror groups as well as state-sponsored Iranian terror. Both also criticized the “one-sided” treatment of Israel by the United nations, and both expressed a shared opposition to any attempts to boycott Israel, at the UN and in other forums.\n5. The relationships between the U.S. and Israeli governments are warm, and personal. One of the most powerful moments in the press conference was when Israeli journalist Moav Vardi challenged Trump’s campaign rhetoric and implied that he was responsible for an alleged spike in antisemitism in the U.S., accusing him of “xenophobia, and maybe racist, tones.” Trump answered rather vaguely, referring to divisions in the country as a whole; pointing out his Jewish son-in-law and grandchildren; and promising: “You’re going to see a lot of love.” But Netanyahu went out of his way to defend the U.S. president: “I’ve known President Trump for many years … There is no greater supporter of the Jewish people and the Jewish state than President Donald Trump. I think we should put that to rest.” Trump looked, and sounded, genuinely appreciative.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/middle-east/2017/02/15/restored-5-ways-trump-netanyahu-improved-u-s-israel-relations/"}
