{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 00:22:37","date_modify":"2018-10-23 00:22:37","date_publish":"2017-03-16 09:39:57","description":"Ashley Brown, 40, who forced teenager Max Slipper into his upmarket bar in Greater Manchester and threatened to cut off his toes, had been jailed for 14 months at Manchester Crown Court.","filename":"data/vaneerConsumption/Restaurantbosstookteenagerhostageinsidecocktailbar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5346E500000578-0-image-a-30_1489659100570.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319312_Restaurant-boss-took-teenager-hostage-inside-cocktail-bar_1540254157.html","title":"Restaurant boss took teenager hostage inside cocktail bar","title_page":"Restaurant boss took teenager hostage inside cocktail bar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ashley Brown, 40, pictured, was jailed for 14 months after admitting assault and false imprisonment against Max Slipper, 19\nA restaurant boss has been jailed after taking a 'terrified' teenager hostage inside his cocktail bar during a 'paranoid meltdown' fuelled by cocaine and red wine.\nAshley Brown, 40, bundled 19-year old Max Slipper into his upmarket restaurant and threatened to cut off his toes when he spotted the youngster walking passed the premises late at night, a court heard.\nDuring a 45 minute ordeal, Brown forced the teenager to remove his coat, shoes and socks and also roll up his trouser leg before he began swinging a kitchen knife at him.\nThe father-of-one also repeatedly punched Mr Slipper about the head then moments later tried to hug him and shake his hand.\nThe teenager - who worked as a barman at a nearby pub - eventually escaped when he kicked through the glass front door of the bar.\nAt Manchester Crown Court Brown admitted false imprisonment and assault and was jailed for 14 months.\nThe court heard Brown, of Wilmslow, Cheshire, tried to give him a bundle of £20 notes saying: 'I want to die,' as Mr Slipper fled the scene.\nBrown, who runs a wine bar in Hale, Greater Manchester, later blamed cocaine use and red wine for him suffering a 'paranoid delusion' and claimed he mistakenly thought his victim was a drug dealer.\nMr Slipper - who lived just a few streets away from Brown's bar - said he no longer felt safe in the wealthy village, which is home to Premiership footballers and Coronation Street stars.\nThe victim, now 20, who escaped with minor injuries, told police: 'I have had many sleepless nights as I wake up thinking about what happened and what could have happened that night.\n'I was in fear for my life and I really did believe he was going to cause me serious harm.\nBrown, pictured, forced the teenager into his upmarket bar in Greater Manchester and held him hostage, threatening to cut off his toes\nMr Slipper, left and right, now 20, escaped after smashing through a glass door, and said Brown 'tried to hug him' and 'offered him £20 notes' as he fled the scene\n'To me the whole thing just seemed like a nightmare and I would not want anyone else to through what I did.\n'I have lived in Hale for over seven years and always felt safe but I now feel nervous when I am out late at night and feel uncomfortable walking back from work.\n'Just after it happened I felt I didn't even want to stay in Hale and went to live with my brother for over a week. It also had an adverse effect on my mother as she was very worried about me.\n'I will remember that night in Hale Wine Bar for the rest of my life and I am just grateful I was not more seriously injured.'\nPassing sentence Mr Recorder Neville Biddle told Brown he subjected the teenager to a 'terrifying ordeal'.\nHe said: 'You had been drinking and you took drugs as well and you began to suffer from some degree of paranoid delusion.\n'I have watched the CCTV of what went on that evening and your behaviour was strange.\n'Max was made to sit at the bar and at 4.25am you hit him and then straight after that you hugged him.\nThe court heard Brown had used cocaine and drunk red wine before the incident and blamed the substances for his 'paranoid meltdown'\n'At 4.45 you hit him with three forceful punches and a minute later four more punches and this is when you got a knife and threatened to cut his toes off.\n'It does not take a genius to think about how this would have made him feel. Then at 4.48am you hugged him again and let him out and shook his hand and he ran away from the bar as quickly as he could.'\nThe incident took place last October just ten months after Brown opened the bar using money from his wealthy father, having earlier been Operations Director at the former celebrity nightspot Brasingamens in Alderley Edge.\nAt the time of opening Brown boasted to a local online magazine of his cocktail bar being 'very high-end, high-standard' adding: 'All the businesses I've run in the past have been successful, and I know what I'm capable of - people will walk in and go 'wow'.'\nMr Slipper had been on his way to meet a friend in the early hours after working a shift when he walked passed Brown's bar.\nProsecuting, Nicola Carroll said: 'Mr Brown banged on the window and beckoned him inside.\n'But as Max walked over to the front door the Mr Brown said, 'get in here' and grabbed him by the top of his coat. He forced him to sit down and the Brown locked the front door.\n'Max caught sight of some white powder and a £20 note on the bar along with a bottle of red wine.\n'Mr Brown then asked Max if he 'had any coke' on him. The defendant's behaviour was extremely erratic - one minute he was very aggressive and the next he was friendly and tried to hug Max.\n'He kept Max locked in for 45 minutes subjecting him to his erratic behaviour. Mr Brown forced him to empty his pockets and put all his belongings into the table.'\nThe father-of-one, pictured, said he 'did not recognise' the person he was on the night of the incident\nHe opened Hale Wine Bar, pictured, in Hale, Greater Manchester, 10 months before and had pledged to run a 'high-end, high-standard' business\nShe added: 'He also forced him to remove his coat, his shoes and socks and got him to roll up his trouser leg. He went off and came back back brandishing a large kitchen knife whilst holding Max's foot.\n'The defendant swung the knife at the complainant's foot but he managed to pull away. The defendant then tried to give him a bundle of £20 pound notes but Max declined which seemed to be the catalyst.\n'He started assaulting the complainant mainly on the left side of his head as he cowed in fear.\n'He threw punches when Max tried to leave, walked him to the door and and then changed his mind. He then told Max that he wanted to die and that he was going to get the knife.\n'Max at that point feared for his life and saw an opportunity and kicked the glass panel of the door causing it to crack.\n'The defendant allowed the complainant to leave the bar. He ran to meet his friend and called the police.'\nThe court the incident was filmed on Brown's own CCTV cameras which was seized by police. He had three previous convictions including an offence of battery.\nBrown's lawyer Guy Mathieson said: 'When Mr Brown was presented with the CCTV footage he was supremely shocked. The person that was subjecting the complainant to intimidation and violence is not someone that he recognises.\n'He is a businessman and a family man with a daughter. There are a number of references that have been provided from people who him and respect him. The contrast between who he is on that CCTV to what he is everyday is markedly different.\n'He has in the past been subject to criminal activity and when in the early hours of the morning he has seen what he thought was someone hanging around outside his property he confronted him about it. He is not a man without his demons.'","url":"https://www.dailymail.co.uk/news/article-4319312/Restaurant-boss-took-teenager-hostage-inside-cocktail-bar.html"}
