{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-22 21:33:12","date_modify":"2018-10-22 21:33:12","date_publish":"2017-04-26 01:57:14","description":"Felix Ngole, 39, from South Yorkshire, said he had been lawfully expressing a traditional Christian view and Sheffield University bosses stopped him completing a degree.","filename":"data/vaneerConsumption/REteachertofightdecisiontothrowhimoffcourse.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B32E800000578-0-image-a-2_1493167755815.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446052_RE-teacher-fight-decision-throw-course_1540243992.html","title":"RE teacher to fight decision to throw him off course","title_page":"RE teacher to fight decision to throw him off course | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Felix Ngole, 39, has been given the go-ahead to argue his case in the High Court\nA religious education teacher has won the right to challenge a university which threw him off a degree course after he suggested same-sex marriage was a sin.\nFelix Ngole, 39, of Barnsley, South Yorkshire, said he had been lawfully expressing a traditional Christian view during an online discussion and complained that bosses at Sheffield University unfairly stopped him completing a postgraduate degree in social work.\nHe has now been given the go-ahead to argue his case in the High Court.\nA judge on Tuesday gave Mr Ngole permission to mount a judicial review of the university's decision following a preliminary High Court hearing in London.\nDeputy High Court Judge James Lewis said it could be argued that the decision was disproportionate.\nLawyers said a judge would probably decide whether the decision should be overturned after a trial in the autumn.\nSheffield University bosses had argued that Mr Ngole's judicial review claim should be blocked.\nLawyers for the university said the decision to remove him from the course had been fair and proportionate.\nThey said Mr Ngole was taking a 'professionally qualifying degree' with the aim of becoming a social worker and argued that what he had said would affect gay people he might work with.\nMr Ngole, who works as a supply teacher and comes from Cameroon, said afterwards that the case had implications for others.\n'I am excited,' he said. 'This is not just about me.'\nMr Ngole said he had been lawfully expressing a traditional Christian view and complained Sheffield University unfairly stopped him completing a postgraduate degree\nMr Ngole, who said he sometimes preached at St George's Church in Barnsley, added he hoped to be able to complete the masters degree social work course if he overturned the decision.\nHe is being backed by the Christian Legal Centre - which is part of the campaign group Christian Concern.\n'The university's treatment of Felix fundamentally violates its responsibilities under human rights legislation,' said Christian Legal Centre chief executive Andrea Williams.\n'The university has failed to protect his freedom of speech...and his freedom of religion.'\nShe added: 'Felix has worked with people who identify as homosexual, treating them with respect and kindness. What he shared on his Facebook page simply reflects biblical teaching on sexual behaviour.\n'Unless he wins this case he will be forever barred from social work. Felix is entitled to express his views, especially ones shared by millions of people around the world.\n'There is no evidence that Felix's views adversely impacted his work. Quite the contrary, he was a hard-working student who would be an asset to the profession.\n'Sadly, this is yet another case of Christians being punished in the public arena, and of censorship of views.'\nBarrister Paul Diamond, who represented Mr Ngole, had told Judge Lewis: 'This case is another case in a long list of cases where a Christian adherent has expressed the traditional view on sexual sin.\n'It is submitted that such speech is disfavoured by the state and expressions of such viewpoints evince disproportionate sanction. It is the duty of the court to robustly protect British freedoms.'\nHe had added: 'The expression that homosexuality is a 'sin', or even use of the strong Biblical term of 'abomination', is a lawful religious expression.'\nMr Diamond said Mr Ngole, who had been in the first year of his course, had 'effectively lost' his social work career.\nMr Ngole had been taking part in an 'open debate' on a Facebook page about Kim Davis, a state official in Kentucky, US, who refused to register same-sex marriages, in 2015 when he expressed the view that 'the Bible and God identify homosexuality as a sin', Mr Diamond told the judge.\nBarrister Sarah Hannett, who represented Sheffield University, said Mr Ngole had been taking a two-year 'professionally qualifying degree' which was regulated by the Health and Care Professions Council.\n'(He) posted comments on a publicly accessible Facebook page that were derogatory of lesbians, gay men and bisexuals,' she said.\n'The views expressed are likely to undermine the trust and confidence that lesbian, gay and bisexual clients are entitled to have in (Mr Ngole) in his professional role as a social worker (and in the social work profession more widely).'\nShe said the problem was not that Mr Ngole held such views but the manner in which he had expressed them.\nMs Hannett said a university 'fitness to practise' committee had decided to exclude Mr Ngole in early 2016 and that decision had been upheld by an appeals committee.","url":"https://www.dailymail.co.uk/news/article-4446052/RE-teacher-fight-decision-throw-course.html"}
