{"authors":["Dana Varinsky"],"date_download":"2018-10-30 23:45:31","date_modify":"2018-10-30 23:45:31","date_publish":"2016-12-04 00:00:00","description":"Donald Trump has placed himself in staunch opposition to environmentalists. But both sides actually oppose the Trans-Pacific Partnership.","filename":"data/vaneerConsumption/Rethinkingfreetradeagreementscouldbegoodfortheenvironment.json","image_url":"https://amp.businessinsider.com/images/5840a2d6ba6eb603688b61b0-2560-1280.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_rethinking-free-trade-environment-2016-12_1540943131.html","title":"Rethinking free trade agreements could be good for the environment","title_page":"    Rethinking free trade agreements could be good for the environment - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Donald Trump hugs a U.S. flag as he comes onstage to another rally with supporters in Tampa, Florida on October 24. REUTERS President-elect Donald Trump has placed himself in staunch opposition to environmentalists by denying climate change and threatening to dismantle the EPA. But there's one area in which the two sides agree: both oppose the Trans-Pacific Partnership.\nIn a recent YouTube video about his plans for his first 100 days in office, Trump promised to take steps towards withdrawing from the TPP, which would have been the largest regional trade deal in history. And some environmentalists suggest that killing the TPP could have a small silver lining for the climate.\nOpposition to free trade agreements was a centerpiece of Trump's campaign — he often claimed that deals like the TPP and NAFTA hurt American workers by sending manufacturing jobs overseas where labor is cheaper. He attacked Hillary Clinton for her initial support of the TPP, and suggested the North American Free Trade Agreement (NAFTA) was \"the single worst trade deal ever approved in this country\" (most trade experts disagree with this claim). According to a memo that Trump's transition team gave to CNN, he also plans to consider formally withdrawing from NAFTA within his initial 200 days.\nFree trade agreements have traditionally been embraced by Republicans, since they reflect the principles of free-market capitalism. Economists also generally agree that trade deals lead to overall economic growth, and give American consumers access to more goods and services at lower prices.\nAP Photo/J. Scott Applewhite The TPP would establish new terms for investment and trade between the US and 11 other countries, including Japan, Singapore, Vietnam, Mexico and Canada. China is not included in the deal, since the TPP is meant to connect other countries as a way to fortify them against China's growing global power.\nEnvironmentalists' anti-TPP arguments are less about jobs and more about the incentives the deal would create for fossil fuel companies and the animal agriculture industry. It now seems the TPP is dead, and Kyle Ash, Greenpeace's senior legislative representative, tells Business Insider that's for the best.\n\"In practice, trade deals are about opening up borders so big companies can profit from larger markets,\" says Ash. Corporations that produce and sell fossil fuels are included in that list.\n\"To a huge degree the trade negotiations have refused to discuss climate impacts,\" he says.\nThose impacts can be separated into three main categories. First, environmentalists say, trade agreements expand the global market for fossil fuels, which then encourages oil, gas and coal companies to extract and burn more fuel.\nThat's especially true for natural gas producers. The Department of Energy must generally authorize any gas exports before they can proceed, but a clause added to the Natural Gas Act in 1992 requires the department to automatically approve exports to countries that have free trade agreements with the US. The TPP would have extended that privilege to many new countries, giving gas companies more incentive to engage in fracking and other forms of extraction.\nShutterstock Second, because the US subsidizes farmers who produce meat and grow crops like corn and soy that are used as animal feed, expanding free trade would put the US in a competitive position to export beef and pork.\nIncreasing meat production would accelerate climate change, since animal agriculture has been found to make up between 10% and 25% of all greenhouse gas emissions. Methane, a common agricultural byproduct, has been found to accelerate global warming much faster than carbon dioxide.\nThird, both NAFTA and the TPP establish provisions for corporations or investors to settle their disputes with states in a special court outside the traditional legal system. In practice, that gives a foreign corporation the right to sue the US for creating regulations that hurt its potential profits — and the case would never be heard in US courts.\n\"They have this idea that you can create a court where only the investors have access,\" Ash says. \"There's no public recourse.\"\nEnvironmental advocates suggest that this dispute settlement system allows companies to challenge environmental regulations that hurt their business. And indeed, that's currently happening with the Keystone XL pipeline, which President Obama rejected in 2015. TransCanada, the company behind the pipeline, has filed a $15 billion lawsuit against the US for not allowing the pipeline to move forward. They can do that because of arbitration provisions established by NAFTA.\nAsh complains that US trade representatives sometimes attempt to reassure critics of this dispute settlement framework by reminding them that the US has never lost a case. But we could very well lose to TransCanada, Ash says.\nVeto supporters rally in front of the White House on the day President Obama vetoed a bill approving the Keystone XL oil pipeline, February 24, 2015. REUTERS/Larry Downing Finally, environmentalists highlight a symbolic point about the TPP: It never once mentions climate change. Ash says the WTO has claimed it doesn't want to get involved in climate discussions, and that trade negotiations have also historically steered clear of the subject. But especially in light of the international commitment made in the Paris agreement, environmentalists were furious that the issue wasn't acknowledged.\n\"It is ridiculous that in 2015, twelve of the world's nations would construct a trade deal of this magnitude and not even consider the effects of climate change on industries like agriculture or fishing, or ways to prevent worsening global warming through our own economic activities,\" Jamie Rappaport Clark, President and CEO of Defenders of Wildlife, wrote in a 2015 statement.\nAsh says he was glad Trump's campaign prompted more discussion about free trade agreements in general. \"If we don't have such a conversation, we'll probably continue to have this problem,\" he says.\nBut there are counterpoints to these environmental objections to free trade. Joshua Meltzer, a senior fellow at the Brookings Institution's Global Economy and Development program, says that the TPP would still be a positive step for the environment, since it could lower tariffs on some environmentally-friendly products. Plus, he says, it adds some new clarifications about what kinds of dispute claims corporations can file, and actually acknowledged the environment a little more than NAFTA did.\nIn response to the argument that free trade agreements encourage more fossil fuels production and animal agriculture, Meltzer says other countries will simply satisfy their demand for coal or beef another way if they can't import those goods. He cites Japan as an example, since the country is interested in importing both meat and gas from the US. Without the TPP, he says, Japan will likely raise its own beef — and its agricultural processes could be less energy efficient than those of the US. And though natural gas certainly isn't the answer to our climate problems, he says, it's at least significantly cleaner than other fossil fuels.\nGleb Garanich/Reuters \"Providing Japan access to cheaper natural gas is good because the alternative is they're just going to burn more coal and oil,\" he says.\nMeltzer also argues that free trade can help reduce global emissions in the long run by improving economic growth and increasing access to new technologies.\nMeltzer acknowledges, however, that there's a lot more free trade agreements could and probably should do to protect the environment. They could further reduce tariffs on climate-friendly goods to make them more widely available and affordable, or could add language outlining subsidies for climate-friendly outcomes like emissions reductions or the use of renewable energy sources. They could even impose standards around energy efficiency.\nBut based on Trump's current environmental stance, it's unlikely that these types of provisions will get incorporated into whatever new trade deals —if any — the new administration negotiates.\n\"My concern with the Trump administration would be that you're going to end up with a vastly inferior outcome than what we've got at the moment,\" Meltzer says.","url":"https://www.businessinsider.com/rethinking-free-trade-environment-2016-12"}
