{"authors":["Ben Christopher","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:59:26","date_modify":"2018-10-30 23:59:26","date_publish":"2017-03-30 19:30:21","description":"See correction below California’s grand plan to extend retirement security to millions of workers, a cornerstone of the economic agenda put forward by","filename":"data/vaneerConsumption/RetirementsavingsforallCaliforniavowstoproceeddespitenewDCobstacle.json","image_url":"https://calmatters.org/wp-content/uploads/PENSION-Photo-2-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943966.html","title":"Retirement savings for all? California vows to proceed despite new D.C. obstacle","title_page":"Retirement savings for all? California vows to proceed despite new D.C. obstacle | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"See correction below\nCalifornia’s grand plan to extend retirement security to millions of workers, a cornerstone of the economic agenda put forward by state Democrats, is looking a little bit less secure.\nThat’s because California leaders are concerned that Republicans in the U.S. Senate will roll back a little-known Obama administration regulation, putting California’s “Secure Choice Retirement Savings Program” in jeopardy.\nFor years, state Democrats have been constructing the Secure Choice system, which would automatically enroll private-sector workers who aren’t offered workplace pensions or 401ks into a state-administered retirement savings plan. Last month, the House voted, over the objections of Gov. Jerry Brown, to nix the regulation, with all the California Republicans voting against the regulation.\nThe White House has promised that President Trump would sign that bill, asserting that state-administered retirement programs put forward by California and seven other states “would lack important federal protections” and “give a competitive advantage to these public plans.”\nThe American Association of Retired Persons, which has been a strong advocate for these plans across the country, said it was “deeply disappointed with the Senate vote discouraging local flexibility to offer workplace savings for the 55 million Americans who currently lack access to retirement savings plans at work.”\nThe State Treasurer’s Office, tasked with overseeing the program, promises to keep advancing what it calls “the most ambitious push to expand retirement security since the passage of Social Security.”\n“We’re not going to throw in the towel,” Treasurer spokesperson, Marc Lifsher, said before the Thursday vote. “We’re going to press ahead—even if the Senate goes south on us and the whole thing probably ends up with the courts.”\nThat outcome is looking increasingly likely. Secure Choice has long been in the cross hairs of the financial services industry, which considers it an unwelcome intrusion of government into their business. Reversing the Obama-era rule that provided regulatory cover for the program would make an ultimate legal challenge all the more likely.\nAs devised by Senate President Pro Tem Kevin de León, California’s Secure Choice program would automatically enroll the approximately 6.8 million eligible workers into individual retirement accounts. Participating employees would see 3 percent of each paycheck placed into a state-wide coffer, which would be overseen by a board chaired by the State Treasurer, but managed by a private investment manager. Eligible workers will have the option to bow out of the program. But by placing all eligible participants into the program by default from the get-go, the program’s designers hope to provide the California workforce with a helpful nudge toward financial prudence.\nSecure Choice is meant to address what some economists and advocates call a national “retirement savings crisis.”\n“Social Security is definitely not enough and it’s really not enough in California,” says Nari Rhee, the director of the Retirement Security Program at the UC Berkeley Center for Labor Research and Education.\nThe average annual Social Security retirement benefit in California is $13,758. This puts a retiree at 116 percent of the federal poverty line, unless that retiree has additional savings. In the coming years, many aren’t likely to.\nAccording to an analysis of federal data by Rhee, a little over 61 percent of all working-aged Californians in the private sector do not have access to workplace retirement plans. Meanwhile one-in-three working adults—and over half of those making less than $40,000 a year—report having “no retirement savings or pension whatsoever.”\n“What is going to happen to state and local budgets and services if all of these workers go into retirement without these resources to sustain themselves?” says Rhee. “You can help people save for retirement or you’re going to get stuck with a bill down the line.”\nBut the prospect of getting stuck with a bill is exactly what has some Republicans so worried. Last December, GOP state Sen. John Moorlach of Costa Mesa introduced a state constitutional amendment that would prevent Sacramento from stepping in if the Secure Choice plan runs into financial trouble.\n“You can see legislators running in to save it to save face,” he says. “I think it’s something that Kevin de León should support if he’s sincere.”\nThe loss of legal cover from the federal government would only add to the state’s legal and financial concerns.\nLast August, the Obama Labor Department ruled that state-administered retirement plans like Secure Choice would not be subject to a strict set of pension regulations known as the Employee Retirement Income Security Act (ERISA).\nERISA (rhymes with “Marissa”) is meant to prevent employers from “using the pension plan as a cookie jar,” explains Bruce Wolk, a professor emeritus at the UC Davis School of Law and an expert on pension law. Thus, the law saddles employers with strict reporting requirements and places them on the legal and financial hook if anything should go wrong with the plan.\nTo get around ERISA—and the objections of business groups like the Chamber of Commerce—Sen. de León structured Secure Choice to ensure that federal regulators would not consider it an “employer pension benefit plan.” Namely, employers would not be asked to contribute to, accept money from, or endorse Secure Choice plans in anyway. Likewise, employee participation would be “completely voluntary.”\nMaybe.\nUnder the Secure Choice program, eligible workers are automatically enrolled into the system, but given the option to opt out. It’s an idea that harnesses the widely-observed human tendency to go with the flow: Researchers have found that simply switching from a savings program that requires workers to proactively opt in to one where participation is set as the default can double the share of workers socking money away. Still, auto-enrollment is an ERISA red flag.\n“What does ‘completely voluntary’ mean? Nobody knows,” says Wolk. “That was one of the reasons that everyone wanted the Department of Labor to issue a ruling.”\nBut then the 2016 election happened.\nSince taking control of both chambers of Congress, Republicans have been making ample use of the Congressional Review Act, which allows lawmakers to roll back any executive rule with a simple majority as long as it was enacted within the last 60 Congressional business days. This is how Obama’s ERISA-waiver was undone in the House and how it may meet its end in the Senate.\nBut even if both the Senate and the White House were to defy all expectations and not roll back the regulation, the fate of Secure Choice is likely to be decided in the courts, says Wolk,\n“Even if the Department of Labor blesses this, it’s still possible that someone could challenge it,” he says. “I think it’s likely that someone will.”\nCorrection: An earlier version of this article incorrectly stated that the U.S. Senate voted Thursday, March 30 to reverse an Obama-era regulation relating to state-administered retirement plans (HRJ 66). The vote taken by the Senate Thursday related to retirement programs administered by cities (HRJ 67). The vote relating to state administered plans, which threatens a program planned in California, is expected soon.","url":"https://calmatters.org/articles/retirement-savings-california-vows-proceed-despite-new-d-c-obstacle/"}
