{"authors":[],"date_download":"2018-10-30 18:08:55","date_modify":"2018-10-30 18:08:55","date_publish":"2016-02-26 18:00:24","description":"Not too long ago Michael E. Shapiro, the loquacious chief executive who led the High Museum through two decades of surging growth, found himself with time on his hands.","filename":"data/vaneerConsumption/RetiredHighartdirectordiscussesbooktoday.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_ba62cfeb573f2028512ab5ac484e788f__1540922935.html","title":"Retired High art director discusses book today","title_page":"Retired High art director discusses book today","title_rss":"NULL","source_domain":"ajc.com","text":"Not too long ago Michael E. Shapiro, the loquacious chief executive who led the High Museum through two decades of surging growth, found himself with time on his hands.\nIt was late 2014 and he had announced his coming retirement from his leadership of the High without another post in the immediate horizon.\nHe was asked: What will you do? Where will you go? He was not concerned about the answer. “I have led, for the last 20 years, a very structured life,” said Shapiro, during a long and thoughtful interview that preceded his departure. “So it’s nice to just contemplate some reduction in that.”\nShapiro did mention one project: “One thing I’m intrigued about is how people become art museum directors.”\nIt is in fact a curious job: one part manager, one part aesthete, one part fund-raiser.\nHe mentioned his own story, and thought about interviewing other directors. It’s a small world and apparently they all know each other. There are only about 200 directors of major museums in this country.)\n“I’m thinking about focusing on the role of mentors or turning points,” he said. “It could be a book.”\nIt is a book. Shapiro will speak about “Eleven Museums, Eleven Directors: Conversations on Art and Leadership,” from 2-3 p.m. today in the High Museum’s Hill Auditorium, with a book signing to follow in the High Museum Shop.\nShapiro’s book begins with his own story, and includes long interviews with such individuals as Maxwell Anderson, former director of the Michael C. Carlos Museum in Atlanta and Glenn D. Lowry, director of the Museum of Modern Art in New York.","url":"https://www.ajc.com/entertainment/arts--theater/retired-high-art-director-discusses-book-today/pVW0jqum0dEzYZ5PIxPXpO/"}
