{"authors":[],"date_download":"2018-10-30 22:27:04","date_modify":"2018-10-30 22:27:04","date_publish":"2018-08-03 14:13:51","description":"Our favorite characters from the Hundred Acre Wood are coming to a theater near you today as an all-grown-up Christopher Robin reunites with Winnie the Pooh and the gang.","filename":"data/vaneerConsumption/Returningtothe100AcreWoodWinniethePoohandChristopherRobinHitTheaters.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/standard/images/christopherrobin_si.jpg?itok=FLEkda-v","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_entertainment_2018_august_returning-to-the-100-acre-wood-winnie-the-pooh-and-christopher-robin-hit-theaters_1540938424.html","title":"Returning to the 100 Acre Wood: Winnie the Pooh and Christopher Robin Hit Theaters","title_page":"Returning to the 100 Acre Wood: Winnie the Pooh and Christopher Robin Hit Theaters | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"Our favorite characters from the Hundred Acre Wood have returned to a theater near you.\nIn the new Disney film \"Christopher Robin,\" Actor Ewan McGregor plays an all-grown-up Christopher Robine, reunited with Winnie the Pooh and the gang. CBN News' Studio 5 sat down with the stars and filmmakers to bring you a first look at the movie.\nSo, how did they make Winnie the Pooh relevant today?\n\"It's almost 100 years ago when he was created and he has the iconic figure who is, in my opionion, timeless because he has humor, he has wisdom, has playfulness like a kid and at the same time he has warmth and love. Even the red sweater represents the heart and the love and I think that is something we need more than ever,\" Director Marc Forster explains.\nThe movie is all about how Christopher Robin is all grown up with a family of his own. What's happened to him?\n\"He's not having a very good time at the beginning of the film,\" explains Ewan McGregor. \"He's fought through the second World War and then he's come back home to his wife and his daughter, who is seven. And he's not very connected.\"\nPooh's job is to help him with that problem.\nOn a lighter note, CBN News was allowed to speak with Pooh himself about making this movie.\n\"Well, I was allowed to do my own stunts. And sometimes, even on purpose. Before we keep going, you wouldn't happen to have any honey, would you?\" the Pooh bear said.\nAnd we spoke with Eeyore too.\n\"So, Eeyore, what drew you to this project?\" CBN's Studio 5 asked the curmudgeonly donkey.\n\"Well, it's not like I am that busy, anway,\" Eeyore replied.\nOf course, no Winnie the Pooh story would be complete without Tigger.\nThe aging yet still jovial Tigger told us, \"Well, it's like the role was written for me. I mean stripes and all, which is why I never read the script. Why mess with perfection? (laugh)\"","url":"http://www1.cbn.com/cbnnews/entertainment/2018/august/returning-to-the-100-acre-wood-winnie-the-pooh-and-christopher-robin-hit-theaters"}
