{"authors":[],"date_download":"2018-10-30 01:25:49","date_modify":"2018-10-30 01:25:49","date_publish":"2014-07-03 08:00:00","description":null,"filename":"data/vaneerConsumption/ReturntoMississippiSummer1964.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/07/fsms1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862749.html","title":"Return to Mississippi Summer, 1964","title_page":"Return to Mississippi Summer, 1964The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In 1964, at the age of 22 and just out of college, I went to Mississippi as part of the Freedom Summer effort that broke the back of Jim Crow society, setting off what I still think was probably the most radical and abrupt social transformation in American history.\nI was not a leader of the effort or even particularly brave. I was just a mere foot soldier. I suspect the real reason I went was to impress an old girlfriend who had broken up with me the year before. Years later someone sent me a copy of my application form and I had listed her along with my relatives as the people I wanted notified of my mission. But why does anyone go off to war at age 22? For that’s what it felt like.\nBefore more than half the 700 volunteers who assembled in Oxford, Ohio, had left for the South, word came that three of the volunteers — James Chaney, Andrew Goodman and Michael Schwerner — were missing and probably dead. It took tremendous courage to follow through at that point, but nearly everyone did. I chose to go to Holly Springs, a college town near Memphis where the danger was not acute. But people in my group went straight to McComb, the legendary town in the delta where even the authorities couldn’t control the violence. Later in the summer, someone blew the side off the McComb Freedom House in a dynamite explosion.\nLast week I went to the 50th anniversary celebration of Freedom Summer at Tougaloo College in Jackson. It is hard to describe the changes half a century have brought. In 1964 Mississippi was a tense, violent state governed by the elaborate protocols and formalities that separated the races. Cross certain lines and you were risking your life. “When you’re in Mississippi it’s hard to imagine the rest of America and when you’re in the rest of America, it’s hard to imagine what goes on in Mississippi” was the way everyone put it.\nToday Mississippi is indistinguishable from the rest of America — except perhaps for the notably prominent role played by black politicians. Jackson Airport is now Medgar Wiley Evers Airport, named for the NAACP leader assassinated in front of his house in 1963. The FBI building is the Chaney-Schwerner-Goodman-Moore Building. (Roy K. Moore is the FBI agent who tracked their killers.) The stretch of highway near Philadelphia where the three volunteers disappeared is the Chaney-Goodman-Schwerner Highway. Mississippi now has more black elected officials than any other state.\nIn the sports bar where I had dinner one night, blacks and whites mingled without the slightest self-consciousness. The scantily clad waitresses, black and white, regularly paraded across the floor in a conga line to wish someone happy birthday. This is in a state where fifty years ago whites often declined to touch something that had been handled by a “Negro” — where Bob Moses, the Harvard-educated civil rights pioneer who went into McComb all by himself in 1961 to register voters could have been strung up from a lamppost in broad daylight and nobody would have done a thing about it.\nNo question about it, Freedom Summer, then and now, had a decidedly left-wing tinge. At one point the Holly Springs newspaper carried a banner headline announcing that that the brother of one of our project leaders was a member of the Community Party. This was hardly surprising, since half the people in our group were members of one of the left-wing organizations that were beginning to appear on campus at the time. Mario Savio, who led the Berkeley Free Speech rebellion a few months later, was a Mississippi volunteer. So was Abbie Hoffman. Fifty years later, several panelists and one documentary movie were still plugging Fair Play for Cuba.\nBut all this only illustrates how tone-deaf these left-wingers could be to the people they were proselytizing. I remember one night the volunteers gathering all the local black teenagers at the Freedom House in Holly Springs to preach to them about the evils of “red-baiting.” They were as bored and bewildered as I was. But those teenagers had minds of their own. One of them, a bright 15-year-old named Roy DeBerry, went on to become a special assistant to the Governor of Mississippi on education. (He was appointed state secretary of education but the teachers’ union blocked it because he didn’t have a teaching certificate!) One of our group got him into Brandeis and he later appeared on the cover of Anthony Lukas’s book, Don’t Shoot—We Are Your Children! We’ve kept up over the years and it was a joy to see him again.\nAlmost 5,000 people attended the general sessions in the cavernous Tougaloo field house. They were beautifully orchestrated. One featured a solemn roll call of the 50 or so black activists and civil rights workers who were murdered in Mississippi before 1964 — with only a handful ever prosecuted. There was also the appearance of the family of Vernon Dahmer, a 58-year-old NAACP chapter head who was killed in 1966 when the Ku Klux Klan firebombed his house and then pinned him inside with rifle fire. Dahmer had four sons in the military at the time. All four were there for the reunion. (Five KKK members were eventually convicted on that one.)\nAfrican Americans unquestionably held the moral superiority during that era. Since then, however, things have become a little more ambiguous — which is undoubtedly why so many blacks and their liberal white supporters want to insist that nothing much has changed. A couple of times I wanted to stand up and shout, “Look, you’ve been singing ‘I woke up this mornin’ with my mind on Freedom’ for 50 years. Well, this is it! You’ve got it! Freedom doesn’t guarantee you happiness, only the pursuit of happiness. It doesn’t guarantee you economic success, only the right to compete on a relatively level playing field in a very competitive world.” This probably wouldn’t have gone over very well.\nNear the end of the four-day event, however, I did get my chance. On Saturday there was a panel, “Our Southern Strategy: Where do we go from here?” featuring Eleanor Holmes Norton, the District of Columbia’s Delegate in Congress, and Representatives Bennie Thompson of Mississippi and Cedric Richmond of Louisiana. There was lots of talk about the Tea Party, the “suppression of black votes,” and concerns about next November’s election. (They’re very worried). Finally during the question-and-answer period I stood up and declared my presence.\n“I was a volunteer in Holly Springs,” I said, “but I’m also a conservative and a Republican.” Loud chorus of boos so that it was uncertain whether I would be able to continue. But Eleanor Holmes Norton graciously quieted the crowd. “We’ve got to listen to both sides,” she told them.\n“I don’t think Republicans are wrong about everything,” I said. “Look at charter schools. There’s a school in Harlem that has the highest math and science scores in New York State and it’s an entirely black and Hispanic student body. When Mayor de Blasio came to office he said he was going to close down charter schools and the first thing he encountered was 10,000 black parents and children marching across the Brooklyn Bridge to protest his actions.\n“And I think you’re misreading the Tea Party,” I continued. (Huge catcalls here.) “The Tea Party isn’t racist. It doesn’t even care about race. Their concern is big government. And I’ll tell you why. Washington, D.C. is now the richest metropolitan area in the country. Seven of the wealthiest counties are D.C. suburbs. The median income in the District is twice the national average. Half the District’s population is African-American and I can guarantee you, they’re not the ones making all that money. If you want to talk about income inequality, the worst inequality in the nation is in Washington, D.C.”\nWell, the panelists responded as you might expect. Congressman Richmond said that charter schools might be good but they only educate about 5 percent of all students. (So why not build more of them?) Eleanor Holmes Norton responded with what has become the standard line of everybody in Washington: “We have the most highly educated population in the country. Why is it so surprising they’re making such high salaries?” (Yes, but what do they do to earn those salaries, except trying to tell everybody else in the country what to do.)\nAs always happens, a couple of people came over afterwards and whispered, “I want to congratulate you for standing up and saying those things. That took real courage.” (As Herman Cain used to say, “Why are you whispering?”) One young black who said he was a labor organizer at the Jackson Nissan plant said, “You know I’ve been reading some of that Tea Party stuff and they’re right about a lot of things.” There’s always hope.\nLater, walking across the lawn with Roy DeBerry, we stopped to talk to a thirty-something black woman with an Afro who he knew peripherally. She turned out to be a municipal judge in Jackson.\n“Isn’t that amazing,” I said as we walked away. “Fifty years ago she wouldn’t have been allowed to buy a sandwich at a lunch counter. Now she’s a public official.”\n“Sometimes it’s hard to convince some of the younger people what it was like down here in 1964,” said Roy. “A lot of it is almost completely forgotten.”\nTo me, that made it all worthwhile.\n(William Tucker’s play, “Freedom Summer,” was shown in a DVD performance at the 50th Freedom Summer Reunion.)","url":"https://spectator.org/59855_return-mississippi-summer-1964/"}
