{"authors":["Matthew Boyle"],"date_download":"2018-10-30 21:15:54","date_modify":"2018-10-30 21:15:54","date_publish":"2015-07-12 02:05:08","description":"LAS VEGAS, Nevada — Real estate magnate and 2016 GOP presidential candidate Donald Trump has skyrocketed to Republican frontrunner status, as a new poll from Reuters/Ipsos has Trump tied for first place with former Florida Gov. Jeb Bush. The rest of the pack is far behind them all.","filename":"data/vaneerConsumption/ReutersTrumpBushLockedinDeadHeatRubioSinkstoTenthPlace.json","image_url":"https://media.breitbart.com/media/2015/03/rubio2-gageskidmore.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/immigration_2015_07_11__1540934154.html","title":"Reuters: Trump, Bush Locked in Dead Heat; Rubio Sinks to Tenth Place","title_page":"Reuters: Trump, Bush Locked in Dead Heat; Rubio Sinks to Tenth Place","title_rss":"NULL","source_domain":"breitbart.com","text":"LAS VEGAS, Nevada — Real estate magnate and 2016 GOP presidential candidate Donald Trump has skyrocketed to Republican frontrunner status, as a new poll from Reuters/Ipsos has Trump tied for first place with former Florida Gov. Jeb Bush. The rest of the pack is far behind them.\nTrump pulled in 15.8 percent, compared to Bush’s 16.1 percent in the poll of 404 self-identified Republicans taken from July 6 to July 10. Since the poll’s credibility interval is 5.7 percent, that puts both Bush and Trump in a league of their own atop the field, as the next best candidate, New Jersey Gov. Chris Christie, doesn’t even break 10 percent.\nWhat is perhaps most interesting is that Florida Sen. Marco Rubio has begun sinking heavily in the polls, as he is behind most of the Republican candidates—now in tenth place, well out of contention—clocking in at just 3.9 percent in this poll.\nThis is a significant crash in the polls for Rubio, too, since back in late April, just after he announced his presidential campaign, he was in second place behind Bush. In a Wall Street Journal and NBC News poll from April, Rubio was at that time at 18 percent, right behind Bush’s 23 percent. No other candidate even got close to them, as Walker was four more points back at 14 percent in that poll of 251 Republican primary voters conducted April 26 to April 30 with a margin of error 6.19 percent.\nIn this latest Reuters poll, Rubio is well behind most of the rest of the field.\nChristie, who is the latest entrant into the field, comes in a distant third with 9.5 percent, while Kentucky Sen. Rand Paul places fourth with 8.1 percent. Dr. Ben Carson is next with 7.2 percent, and Wisconsin Gov. Scott Walker comes after that with 5.8 percent.\nFormer Arkansas Gov. Mike Huckabee gets 5.5 percent, former Texas Gov. Rick Perry gets 5.3 percent, Texas Sen. Ted Cruz gets five percent, Louisiana Gov. Bobby Jindal takes 2.1 percent, former New York Gov. George Pataki gets two percent, former Pennsylvania Sen. Rick Santorum and former Hewlett-Packard CEO Carly Fiorina both poll at 1.6 percent. Ohio Gov. John Kasich and South Carolina Sen. Lindsey Graham round out the field with 1.4 and 1.3 percent, respectively.\nIn the whole field, according to the Reuters/Ipsos poll, that means Rubio is in tenth place behind the following candidates: Trump, Bush, Christie, Paul, Carson, Walker, Huckabee, Perry, and Cruz. If he keeps sinking like this, Rubio could be in danger down the road of losing a place on the debate stage for various networks who have limited the space to 10 GOP candidates per debate—and are basing their decisions on polling data.\nThis is not the only poll that shows Rubio in a free fall. The latest Economist/YouGov poll out last week showed Rubio slipping as well. That poll, like this one, has Trump in the lead, even out ahead of Jeb Bush.\nWhen looking at the cross tab information published by the polling firm, 18 percent said they wanted Trump as the GOP nominee. Ten percent wanted Paul, nine percent for Bush, eight percent for Carson, Huckabee, and Walker; while only six percent chose Rubio. That means in that poll—which was conducted a few days before the Reuters poll—Rubio placed seventh.\nRubio’s nosedive comes after a lackluster performance in a speech to Freedom Fest—a gathering of libertarians here in Las Vegas—where he made no specific policy recommendations and ducked off the stage, skipping a planned question-and-answer session with the audience.","url":"https://www.breitbart.com/immigration/2015/07/11/reuters-trump-bush-locked-in-dead-heat-rubio-sinks-to-tenth-place/"}
