{"authors":[],"date_download":"2018-10-30 18:03:47","date_modify":"2018-10-30 18:03:47","date_publish":"2018-08-08 13:25:00","description":"Braves owner Liberty Media disclosed the team’s financial results for the first three full mon...","filename":"data/vaneerConsumption/Revenueandprofitareup.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/02/20/Videos/4380489.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_braves-quarterly-fin_d19c8683e30a2e2b58841369c50c4f9c__1540922627.html","title":"Revenue and profit are up","title_page":"Braves' quarterly financial results: Revenue and profit are up","title_rss":"NULL","source_domain":"ajc.com","text":"Braves owner Liberty Media disclosed the team’s financial results for the first three full months of the season Wednesday, showing a slight increase in revenue and a strong surge in profit.\nThe Braves posted revenue of $182 million for the April-through-June quarter, up three percent from $176 million in the same period last year. Their operating profit before depreciation and amortization was $64 million for the quarter, up 129 percent from $28 million in the same period last year.\nAfter depreciation and amortization, the Braves’ quarterly profit was $37 million, up from a loss of $1 million in the corresponding period in 2017.\n“We are in the blessed position of actually having a profitable team, partly based on it being well run and partly based on some of the other things we’ve done around things like The Battery,” Liberty Media CEO Greg Maffei said during a conference call with Wall Street analysts Wednesday.\nThe Braves’ increased profits in the most recently completed quarter were “primarily driven by higher revenue and reduced operating expense from lower player salaries due to the acceleration of player salary expense in previous quarters as a result of released and injured players,” Liberty Media said in its financial disclosures.\nThat was a reference to the combined $37.5 million that the Braves are paying released players Adrian Gonzalez and Scott Kazmir for this season. Those expenditures were fully accounted for in previous quarters’ financial reports.\nOf the Braves’ $182 million in revenue during the April-June quarter, Liberty Media attributed $172 million to baseball and $10 million to development.\nDevelopment revenue, which was $3 million in the second quarter of 2017, is derived from The Battery Atlanta mixed-use complex and primarily includes rental income, Liberty said.\nThe Braves had three fewer home games in the second quarter of 2018 than in the same period last year. Because of that, baseball revenue decreased slightly, from $173 million to $172 million. But average revenue per home game increased from $4.3 million to $4.6 million “due to increased ticket sales with better attendance and higher concessions per turnstile,” Liberty Media said.\nMaffei said the Braves’ ticket sales have increased more than two percent in the team’s second season at SunTrust Park, compared to their inaugural season there. An increase “is fairly unusual” for a second season in a new stadium, he noted.\nIn addition to tickets, concessions and other stadium operations, the Braves’ “baseball revenue” includes local and national broadcast rights, licensing deals and other shared MLB revenue streams.\nThe Braves continue to carry considerable debt -- $629 million as of June 30, Liberty Media chief financial officer Mark Carleton said Wednesday. The debt is primarily from costs associated with the construction of SunTrust Park and The Battery.\nThe Braves are one of the few North American sports teams with publicly traded stock, which requires them to disclose financial data that most teams keep private.","url":"https://www.ajc.com/sports/braves-quarterly-financial-results-revenue-and-profit-are/7bYTP2CEwqjHLgSPvgWywI/"}
