{"authors":[],"date_download":"2018-10-30 00:55:07","date_modify":"2018-10-30 00:55:07","date_publish":"2016-12-14 00:04:32","description":null,"filename":"data/vaneerConsumption/RevengeoftheAdjunctProfessors.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/12/TrumpAdjunct-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860907.html","title":"Revenge of the Adjunct Professors","title_page":"Revenge of the Adjunct ProfessorsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Assuming Congress confirms President-elect Donald Trump’s Cabinet picks, the new Trump Administration will represent arguably the most dramatic shift in leadership the United States has ever seen.\nAs a rule, the Obama administration is staffed by the crème de la crème of academically trained policy and legal scholars. Harvard is the number one school represented. Columbia is second. Law schools and schools of public administration are the majority. A vast (and we mean vast) portion of the current administration’s work experience has been in politics and government. In other words, they are professional bureaucrats, trained by academics in the process of government.\nThe Trump administration is virtually the opposite. Military, medical, and business backgrounds are the norm. These individuals went to school all over the country — Alabama, Kansas, Ohio, Michigan, and South Carolina to name a few. Some have spent time in politics, and some went to liberal strongholds like Harvard and Yale, but these pedigrees are the exception rather than the rule. For the most part, the Trump administration are the type of people you would see as adjunct professors — the ones who come into a classroom to help bridge the gap between theory and the real world.\nAt 240 years old, the United States is still relatively young in a historical sense. China has multiple millennia under its belt. Europe, to generalize about a block of countries, has centuries of institutional history. Both Europe and China have special academic structures (universities, academies, schools, etc.) in place to train government bureaucrats and public policy leaders. This process institutionalizes and “professionalizes” government. In recent decades, the U.S. has been following in their footsteps.\nAll of this centralization of government training feeds on itself. Professional bureaucrats want what any manager wants — more power and control, bigger budgets, and a larger staff. These bureaucrats use political arguments to make their case, and the entire system supports these efforts.\nJohn Maynard Keynes used his intellectual perch to argue that professional management of an economy was achievable. It was music to the ears of government bureaucrats. If more spending, and more economic manipulation, actually made people better off, then there was an academic justification to grow power and control.\nThis mindset has invaded every institution of government and is fed by a non-stop treadmill of (at times even government-sponsored) academic research, political support for the findings, and a media that overlooks inconsistent results when theory is put into practice. When the economy hits a crisis, even though it is clear that government was deeply involved in the events leading to that crisis, politicians and media blame the private sector. This, then, creates a feedback loop that argues for more government management.\nNo one ever seems to stop and assess whether this system has worked. After centuries (or just decades) of teaching, practicing, and propagating all this professional bureaucracy, why is it that so many people still complain that the economy isn’t doing well? If government really could create heaven on earth, why hasn’t it happened yet?\nThe reason it hasn’t happened is that no person or bureaucracy can create heaven on earth. In fact, there is a great deal of evidence that government can help only up to a point. After government grows too much, it moves from a support to burden on the economy. It’s clear that much of the world has gone well beyond that point. Europe has been in a “malaise” for decades. The U.S. is now growing so slowly that many economists are calling what is happening the “Great Stagnation.”\nThe result is a revolution of sorts. Voters in America decided it’s time for a new strategy. In effect, those voters said, “Let’s stop counting on the professional, academic-elite bureaucrats and put this country in the hands of someone who has actually succeeded in the real world of business or the military.”\nAnd that’s what happened. The Trump administration is shaping up to look like an immensely qualified group of adjunct professors — the kind of leaders most parents would want their children to learn from.\nWhat we hope is that these captains of industry will put their real-world experience in decision-making and leadership to work in their new positions of power. We are certain that some of them were hands on, Type-A control freaks, but for the most part, it is impossible to run large, complex institutions without being able to delegate decision-making throughout their respective organizations.\nFor the economy, what creates wealth is individual initiative and proper incentives, not centralized bureaucratic planning. Delegating decision-making for education to the family, for healthcare to the individual, and for business to the actual owners is the opposite of managing everything from the ivory towers of Washington, D.C.\nLet’s hope the Adjunct Professors remember their roots and push government back toward a system that has faith in individuals and not just the bureaucratic elite.","url":"https://spectator.org/revenge-of-the-adjunct-professors/"}
