{"authors":["Jack Montgomery"],"date_download":"2018-10-30 20:28:50","date_modify":"2018-10-30 20:28:50","date_publish":"2016-12-12 20:30:46","description":"British Influence, a 'think tank' chaired by Peter Wilding, who has previously worked for the European Commission, are launching a fresh bid to derail Brexit in the High Court","filename":"data/vaneerConsumption/REVEALEDLatestBrexitChallengeLaunchedbyTaxDodgeProEUCelebLawyer.json","image_url":"https://media.breitbart.com/media/2016/12/GettyImages-628236272.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_12_12__1540931330.html","title":"REVEALED: Latest Brexit Challenge Launched by Tax Dodge, Pro-EU, Celeb Lawyer","title_page":"REVEALED: Latest Brexit Challenge Launched by Tax Dodge, Pro-EU, Celeb Lawyer","title_rss":"NULL","source_domain":"breitbart.com","text":"British Influence, a ‘think tank’ chaired by Peter Wilding, who has previously worked for the European Commission, are launching a fresh bid to derail Brexit in the High Court.\nThe group aims to demonstrate that the British government needs permission from Members of Parliament not just to activate Article 50, the legal mechanism for leaving the European Union (EU), but must also seek a separate authorising vote on leaving the ‘Single Market’, in the form of the European Economic Area (EEA).\nThe EEA was set up to facilitate the transition of Norway, Iceland, and Liechtenstein from EU candidate countries to full member-states, but the process was arrested when the Norway and Iceland rejected full membership in popular referendums.\nUnlike EU members, countries in the EEA retain a degree of autonomy over their farming policies, fisheries, and international trade, but are still subject to Single Market rules which enable large-scale tax avoidance by multi-nationals and prohibit meaningful controls on immigration.\nWilding claims the British Influence case is was not devised to “derail, delay or discredit” the Brexit process, but his claims ring hollow when the group’s co-presidents are taken into consideration.\nOne is Peter Mandelson, appointed to the European Commission after being forced to resign from government twice and due a very lucrative EU pension, and the other is Ken Clarke, the only Conservative Party MP who voted against the Article 50 vote last week, who once said “I look forward to the day when the Westminster parliament is just a council chamber in Europe”.\nMandelson has supported calls by his former boss, Tony Blair, for MPs to back a second referendum if the Brexit deal doesn’t suit them.\nThe Article 127 case will be orchestrated by Joylon Maughaum, a controversial QC who has previously represented Eclipse 35, one of several film investment schemes branded as fronts for tax avoidance by the Court of Appeal.\nThe schemes were popular with a number of super-rich, pro-EU celebrities, including Bob Geldof and Gary Lineker.\n“I was for the alleged tax avoiders” Maugham admitted, when questioned on the schemes. “I was was trying to do the best by my clients”.\nThe tax avoidance issue is one that is beginning to loom especially large in relation to the EU debate, with Breitbart London revealing last week that pro-EU corporates dodge at least 10 billion GBP per year in taxes via Britain’s EU membership.","url":"https://www.breitbart.com/europe/2016/12/12/former-euro-commissioner-mp-wanted-parliament-reduced-council-chamber-behind-latest-brexit-challenge/"}
