{"authors":[],"date_download":"2018-10-30 01:26:20","date_modify":"2018-10-30 01:26:20","date_publish":"2016-11-19 00:00:00","description":null,"filename":"data/vaneerConsumption/ReversingObamassocialjusticesailorsfundamentalchanges.json","image_url":"https://www.americanthinker.com/images/bucket/2016-11/197451.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_11_reversing_obamas_social_justice_sailors_fundamental_changes_1540862780.html","title":"Reversing Obama's social justice sailor's fundamental changes","title_page":"Reversing Obama's social justice sailor's fundamental changes","title_rss":"NULL","source_domain":"americanthinker.com","text":"Reversing Obama's social justice sailor's fundamental changes\nObama appointee Ray Mabus, über-liberal head of our Navy, has been a very busy lefty during his time in the Pentagon, much to the chagrin of almost all sailors, active and veterans, particularly old retired salts with twenty years or more. It is doubtful any person in the puzzle palace is more despised than the smug Mabus, a social justice warrior of the first order. He makes no secret of the fact that his goal was to break the back of the Old Navy culture and install his politically correct dogmas and he has made every effort to accomplish that goal with edicts that have brought joy to the hard left while infuriating most of the force he theoretically leads. Here's the future SecNav in his fierce sailoring days. He certainly doesn't look like a future hard left, social justice warrior, now does he?\nFuture Social Justice Sailor The secretary of the Navy's most egregious edict, which Navy Times labeled a tectonic shift, came recently when he ordered a revamping of the Navy's enlisted ratings titles to make them gender-neutral, in effect changing aspects of everyday naval language, which in some cases dates back to the Continental Navy. He has imposed mandatory cultural training to compel male sailors to be more accepting of their female, homosexual, and transgendered shipmates, as well as same-sex marriage and civil unions, training time that most sailors would agree could be better spent in preparation to fight a real, not social, war.\nBut the most maddening of Mabus's busybody social justice meddling comes in his decision to name new naval vessels after heroes of the LGBT movement like Harvey Milk, a gay San Francisco city supervisor who was assassinated by fellow supervisor, Daniel White, a former police officer and troubled Vietnam veteran who later committed suicide. Like Mabus, Milk served briefly, without particular distinction, as a junior officer aboard a small vessel in San Diego during the Korean War. The class of ships to which the USS Harvey Milk belongs is called the John Lewis class of oilers, Mr. Lewis being the same John Lewis who currently serves Georgia as a very leftist and demonstrably dishonest Democrat congressman, as even Daily Kos says. Somehow the oiler class seems fitting for Lewis. Others who will have ships in that class named for them are those ever popular feminist figures, Lucy Paul and Sojourner Truth, whom the left seems hell-bent on our recognizing, wanting them on our currency as well. Another class of ships that bears Mabus's banner of social justice around the globe is that of the Lewis and Clark dry cargo ships, most of which will wear the names of naval heroes such as Admiral Byrd and Commodore Perry or aviation pioneers, astronauts and other figures of distinction...well, except that Mabus just had to slip in two more icons of the left. Those would be labor organizer Cesar Chávez and Medgar Evers. I think most of us could live with that, knowing that Chávez is an icon to many Hispanics and Evers, a civil rights movement leader, is a hero to blacks, if either had made any significant contribution to the Navy, which neither has. Ditto the ship named for the Lewis and Clark expedition's female Indian guide, Sacajawea, giving Mabus a twofer: female and minority. Another ship in this class is named for an enlisted sailor, Master Chief Boatswain's Mate Carl Brashear, of notable naval accomplishment, being the first black to become a U.S. Navy master diver despite having only one leg. Most sailors should have no problem with there being a USNS Carl Brashear, as that is a ship upon which American crews of all backgrounds can serve proudly, knowing it is named in the proudest traditions of the United States Navy; but the USS Harvey Milk? Let us hope that whomever Donald Trump selects to be the new SecNav will be more traditional in his ship-naming policies by sticking to a pool of valiant sailors and marines who have served this country with distinction and valor since its beginning. And just as, if not more, importantly, let's hope our new SecNav, following the lead of his commander in chief, shows little tolerance for social justice engineering in our Navy and puts a quick end to the forced political correctness imposed by the worst SecNav ever, who, in turn, was appointed by inarguably the very worst commander in chief ever. As for the few now serving in the military who like and profit from all this social engineering... Hey! Elections have consequences!","url":"https://www.americanthinker.com/blog/2016/11/reversing_obamas_social_justice_sailors_fundamental_changes.html"}
