{"authors":[],"date_download":"2018-10-30 00:50:55","date_modify":"2018-10-30 00:50:55","date_publish":"2018-09-05 00:01:56","description":"I was watching Fox’s coverage of the Aretha Franklin funeral last week and enjoying the celebration. I thought Stevie Wonder was particularly good and very moving. He is a marvelous singer, but for my money he is an even greater pianist. He really trips his fingers across the keys and too gorgeous effect. At any rate, the ceremony was a fitting tribute to a woman who for decades has entertained us all.","filename":"data/vaneerConsumption/RevEllisYouHaveDoneNothingWrong.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/GrandeEllis-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860655.html","title":"Rev. Ellis, You Have Done Nothing Wrong","title_page":"Rev. Ellis, You Have Done Nothing WrongThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nI was watching Fox’s coverage of the Aretha Franklin funeral last week and enjoying the celebration. I thought Stevie Wonder was particularly good and very moving. He is a marvelous singer, but for my money he is an even greater pianist. He really trips his fingers across the keys and too gorgeous effect. At any rate, the ceremony was a fitting tribute to a woman who for decades has entertained us all.\nAlas, the ceremony was also marred. On Sunday I read in the Washington Post that the officiating pastor, Charles H. Ellis III, has been accused of “groping” one of the participants in the ceremony on stage. Yes, he is alleged to have done it right in front of not only Aretha’s adoring thousands, but also right in front of scores of dignitaries, including Louis Farrakhan, Al Sharpton, Jesse Jackson, and Bill Clinton. That is right, Bill Clinton was there, and he was later accused of fixing his eyes on an entertainer’s bottom. That story was carried on the Drudge Report, which, I guess is where you would expect it, but back to the Rev. Ellis.\nApparently the woman whom the Rev. Ellis touched is named Ariana Grande, and she had just performed the Aretha Franklin hit from years gone by “You Make Me Feel Like A Natural Woman.” In congratulating her the Rev. Ellis, according to the Post, “wrapped his hand around her, high above her waist in an act that many are calling a groping.” Now, I am no expert in such maneuvers. I am certainly not as practiced as Bill Clinton — he of the wandering eye — but I would not think the Rev. Ellis’s embrace constituted “groping.” Not when he touched her “high about her waist,” and in front of thousands.\nHowever, the Rev. Ellis’ wrongdoing went beyond the mere tactile. There is more. The Post reported that the Rev. Ellis felt he had to apologize to “the singer, an army of her outraged fans, and the Hispanic community.” I can understand his apology to the singer and her army of outraged fans, but why the Hispanic community? Ms. Grande is not Hispanic. She is famously Italian American. The Post never explained the discrepancy. Nor did it explain why the Rev. Ellis, “a much older man,” was more at fault for where he put his errant hands than someone else, say a much younger man?\nActually there is a lot more in this news story that could be explained but let me settle on this simple point. Some Americans have become much too touchy. I am not referring to where they put their hands but to where they put their sources of irritation. The Rev. Ellis was presiding over a funeral. It is unthinkable that he would touch a singer indecently in public. Or that he would knowingly offend any community, Hispanic or otherwise. Or that he, a man of some 60 years, has to follow a protocol for touching people that other Americans are not barred from.\nNorman Podhortez, the former editor of Commentary, made the observation decades ago that some Americans have become too touchy. It is as though they are eager for a chance to be irritated. This is the cause of the Washington Post story.\nThe Rev. Ellis appears in public to soothe people in their grief and suddenly an avalanche of opprobrium come down upon him, because he is accused of offensive and indecent behavior, indecent and offensive behavior that is also unthinkable. It is unthinkable that the Rev. Ellis would commit the acts that he is accused of. He had no reason to apologize.\nIt is an example of political correctness that is out of control. One of the reasons that Donald Trump won the presidency is that political correctness is seen as a bully club to harass ordinary Americans. It is used to shut down free speech. One does not even have to say anything that is in questionable taste or do anything that is in questionable taste to be charged with misbehavior. The other day in the Washington Post the Rev. Ellis apologized for indiscretions that he could not possibly have committed. Now who is going to apologize to him?","url":"https://spectator.org/rev-ellis-you-have-done-nothing-wrong/"}
