{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 21:39:28","date_modify":"2018-10-30 21:39:28","date_publish":"2016-12-19 00:00:00","description":"The 2016 Volvo V60 Polestar is Sweden's answer to high-performance beasts from BMW, Mercedes, and Audi.","filename":"data/vaneerConsumption/ReviewVolvoV60PolestaraCaroftheYearfinalist.json","image_url":"https://amp.businessinsider.com/images/57cf6eaa09d29330008b650e-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_volvo-v60-polestar-wagon-review-coty-2016-12_1540935568.html","title":"Review: Volvo V60 Polestar, a Car of the Year finalist","title_page":"    Review: Volvo V60 Polestar, a Car of the Year finalist - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The 2016 Volvo V60 Polestar is Sweden's answer to high-performance beasts from BMW, Mercedes, and Audi. Hollis Johnson\nEditorial note: Business Insider just named its 2016 Car of the Year, the Acura NSX. There were 15 contenders for the award, and that was narrowed to six. We named five runners-up, but we also tested dozens of vehicles this year, not all of which we could consider for COTY. But some of them certainly made a lasting impression. So each member of the BI Transportation team is revisiting the car they couldn't get out of their head. For transportation reporter Benjamin Zhang, it was the 2016 Volvo V60 Polestar — a Swedish station wagon with the soul of a racer.\nThere are few cars that represent middle-class suburbia better than a midsize Volvo station wagon. For decades, the boxy Swedish wagons have offered dependable, no-frills transportation for the masses. But while its more mundane siblings were on school-run duty, some Volvo wagons were getting the performance treatment.\nOver the past 20 years, Volvo's high-powered wagons have earned the company great critical acclaim. (One was even raced in the British Touring Car Championships.) For its latest hot wagon, Volvo turned to the specialists at Polestar Racing — the same people responsible for the company's racing program. As expected, Polestar took the standard V60 wagon and turned it into a full-on performance machine. The partnership worked so well that Volvo purchased Polestar's tuning division in 2015.\nEarlier this year, Volvo dropped off a black V60 Polestar wagon for Business Insider to check out. Our $61,600 test car came clad in onyx black metallic paint. Here's a closer look.\nPhotos by Hollis Johnson unless otherwise credited.","url":"https://www.businessinsider.com/volvo-v60-polestar-wagon-review-coty-2016-12"}
