{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:51:24","date_modify":"2018-10-30 18:51:24","date_publish":"2015-03-25 12:53:59","description":"Tweet your latest selfie from a #BlackLivesMatter protest. Go to Starbucks and order a \"tall blonde, black\" and engage your barista in a serious conversation about race. Once you're feeling suitably guilty--or adequately entitled--head over to your local movie theater, and go see Get Hard, the new comedy out Mar. 27 featuring Will Farrell and Kevin Hart--preferably after midnight, when the audience will be (ahem) more inclined to talk back to the screen. And laugh the P.C. police away. |","filename":"data/vaneerConsumption/ReviewGetHardistheAntidotetoEliteRacialHysteria.json","image_url":"https://media.breitbart.com/media/2015/03/Screen-Shot-2015-03-25-at-5.50.10-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_03_25__1540925484.html","title":"Review: 'Get Hard' is the Antidote to Elite Racial Hysteria","title_page":"Review: 'Get Hard' is the Antidote to Elite Racial Hysteria | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tweet your latest selfie from a #BlackLivesMatter protest. Go to Starbucks and order a “tall blonde, black” and engage your barista in a serious conversation about race. Once you’re feeling suitably guilty–or adequately entitled–head over to your local movie theater, and go see Get Hard, the new comedy out Mar. 27 featuring Will Farrell and Kevin Hart–preferably after midnight, when the audience will be (ahem) more inclined to talk back to the screen. And laugh the P.C. police away.\nGet Hard is a genuinely funny movie. It pokes fun, mercilessly, at America’s racial politics–which is precisely why the left is telling itself to hate the film. At the South by Southwest Film Festival in Austin, one audience member–evidently in need of a humor transplant–arose during the Q&A to offer the enlightened opinion that “This film seems racist.”\nReally? And in related news, a teacher in L.A. was suspended for using the “n-word” in appropriate historical context. We’ve come that far.\nThere is nothing racist about the film–though it satirizes racial stereotypes, as well as the absurd racial and class themes of contemporary politics.\nThe story is about a white fund manager (Ferrell) who is sentenced to maximum security prison for fraud, and asks the car wash attendant (Hart), whom he assumes has already been to prison, to help him prepare. His fear is being sexually assaulted in prison–which leads, yes, to some edgy gay humor, redeemed in the end by a gay friendship.\nFor daring to tackle these politically-charged themes, debut director Etan Cohen (full disclosure: a college friend) has, ridiculously, fallen under a cloud of suspicion. The Associated Press notes that Cohen co-wrote Tropic Thunder–“a film that memorably flirted with racially sensitive territory.”\nCohen’s film also includes a (funny) joke that compares a Compton street gangster to a “young Ronald Reagan.” If I should have been offended, as a conservative, I forgot to notice. I just laughed.\nYou will, too.","url":"https://www.breitbart.com/entertainment/2015/03/25/review-get-hard-is-the-antidote-to-elite-racial-hysteria/"}
