{"authors":["Matthew Debord"],"date_download":"2018-10-30 20:32:08","date_modify":"2018-10-30 20:32:08","date_publish":"2016-12-30 00:00:00","description":"Even after Cadillac revolutionized its styling to be more aggressive, it had to tackle the impression that the Germans were better at going fast.","filename":"data/vaneerConsumption/REVIEWBusinessInsider.json","image_url":"https://amp.businessinsider.com/images/56a9237d58c32348008b5b13-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cadillac-cts-v-review-again-2016-12_1540931528.html","title":"REVIEW - Business Insider","title_page":"    Cadillac CTS-V: REVIEW - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Matthew DeBord/Business Insider\nCadillac is General Motors' luxury brand and has been for over 100 years — and it's undergoing a major reinvention. Sales and marketing operations were moved to New York City in 2014 in order to make Caddy seem hip and fresh and of the global-luxury conversation.\nBut Cadillac has been in the throes of transformation for more than a decade. For much of its history, it sat at the peak of GM's famous-brand ladder: You entered your automotive life with a Chevy and closed it with one. Back then, during the US auto industry's golden age and even into its crisis years in the 1970s and '80s, Cadillac produced big, comfortable cars that were designed to surround passengers in swaths of soft leather and ample ashtrays.\nTaking one hard turn into a corner wasn't something that entered any Cadillac owner's mind, as he or she piloted the barge down a freeway with Sinatra flowing from the FM radio. The invasion of German sports sedans disrupted this settled arrangement. \"Luxury\" now had to include \"performance.\" And to up the ante, BMW in particular began to advance its \"ultimate driving machine\" pitch with street-legal competition-derived cars from its M Sport division. This was German performance — plus!\nEven after Cadillac revolutionized its styling to be more aggressive, it had to tackle the impression that the Germans were better at going fast. This led to a synthesis of Cadillac and Corvette. Posh met performance, and \"performance\" was a big V8 engine with enough horsepower to make you think you're not just driving — you're being propelled forward at alarming velocity by a thick column of fire. The V-Series was born.\nCaddy has been refining this formula for about a decade now, and Johan de Nysschen, the brand's boss, stressed to Business Insider how important the V-cars are to the future of the the brand. \"[They're] very stunning and are exciting people around the brand,\" he said. \"They draw people into showrooms who would never consider Cadillac.\"\nA Caddy with the heart of a Corvette? Sounds pretty tasty, and maybe just a little bit rude. So we sampled the core of the V lineup: the 2016 CTS-V sedan.","url":"https://www.businessinsider.com/cadillac-cts-v-review-again-2016-12"}
