{"authors":[],"date_download":"2018-10-23 05:53:03","date_modify":"2018-10-23 05:53:03","date_publish":"2015-11-27 00:00:00","description":"Some financial experts want to bring back tontines, a retirement planning tool. People pool their cash to buy a bond that makes regular payments. The catch: You have to be alive to collect the payout.","filename":"data/vaneerConsumption/RevivingTontinesAnIdeaForIncomeInOldAgeNPR.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=457392597_1540273983.html","title":"Reviving Tontines, An Idea For Income In Old Age : NPR","title_page":"Live Long And Prosper: Reviving Tontines, An Idea For Income In Old Age : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nSome financial experts want to introduce a tool to help people plan for retirement better. It's actually a very old tool, discarded and almost forgotten. For centuries, it was used to build bridges, fancy meeting halls and to provide people with income in their old age. Then it was undone by fraud and ghoulish portrayals in popular culture. Know what it is? Here's NPR's Uri Berliner as part of our series Your Money and Your Life.\nURI BERLINER, BYLINE: If you've ever heard of this tool, it's probably because of shows like \"The Simpsons.\"\n(SOUNDBITE OF TV SHOW, \"THE SIMPSONS\")\nHARRY SHEARER: (As Mr. Burns) How many of you are familiar with the concept of a tontine? All right, Ox, why don't you take us through it?\nBERLINER: A tontine - a group of people, they pool their cash and pitch in together to buy into an unusual sort of betting club. What they're betting on is how long they'll live because the tontine pool makes payments to all the people who bought in.\nMOSHE MILEVSKY: With the minor proviso that you have to be alive in order to get those dividends.\nBERLINER: That's Moshe Milevsky. He teaches finance at York University in Toronto and has written extensively about tontines. The name comes from a Neapolitan banker, Lorenzo de Tonti, who lived in the 17th century.\nMILEVSKY: He suggested this to Louis XIV as a way to raise money for the government to fight its wars, to pay for his mistresses, to finance deficits and so on and so forth.\nBERLINER: Now, let's get back to the people who invest in the tontine and that proviso that Milevsky just mentioned. It's an important one. You have to be alive to collect.\nMILEVSKY: As people start to pass away in this group, the survivors are getting payments that are increasing.\nBERLINER: You see where this is going. Certain participants in the tontine are doubly unlucky - they die early and they collect less money. The lucky ones who live a long time, their earnings just keep growing. For centuries before Social Security, before 401(k)s, when hardly anyone had a pension, the tontine was a way to earn income in old age.\nMILEVSKY: Historians have documented that by the early part of the 20th century, it was the most popular investment held by U.S. households, so it became extraordinarily popular about 120, 130 years ago.\nBERLINER: Tontines in the U.S. were offered through insurance companies, and they were pretty dodgy. Kent McKeever is the director of the library at Columbia Law School. He's written a short history of tontines.\nKENT MCKEEVER: It ended up sort of falling apart when the insurance companies paid out less than they said they would.\nBERLINER: In 1905, New York State launched an investigation, and that was basically the end. The tontines were banned, maybe worse was the beating they took in popular culture. In novels and movies, a standard tontine plot line emerged.\nMCKEEVER: The person who thinks they're going to benefit by everybody else dying starts killing everybody else.\nBERLINER: They were scorned on the TV show, \"The Wild Wild West.\"\n(SOUNDBITE OF TV SHOW, \"THE WILD WILD WEST\")\nROBERT EMHARDT: (As Grevely) We all forgot that the tontine invites mans or womans scurrilous nature to come to the fore.\nBERLINER: The tontine, a scurrilous scheme that inspires the worst human impulses, at least that's how it's portrayed. So why would finance professor Moshe Milevsky say this?\nMILEVSKY: I believe, yes, it has a role to play in financing retirement.\nBERLINER: He says more people today are living well into their 90s, past 100, living 30 years or more after they stop working.\nMILEVSKY: I think that this is a really good way to protect yourself against living much, much longer than your resources.\nBERLINER: He says a 21st century tontine would be computerized. It would include a large group of people putting in small sums of money with none of the lured aspects of earlier tontines.\nMILEVSKY: We could anonymize it. Technology today would be able to make it so that you don't quite know who's in the pool with you, so you wouldn't quite know when you read the obituaries whether, hey, my tontine payment is going to go up this month.\nBERLINER: And Milevsky says a 21st century tontine wouldn't have the expenses of similar products sold today by insurance companies. It would cut out the middleman. Milevsky says he's not alone here. He says about a dozen other academics also want to bring tontines back from the dead. Uri Berliner, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=457392597"}
