{"authors":["Associated Press"],"date_download":"2018-10-23 03:24:42","date_modify":"2018-10-23 03:24:42","date_publish":"2016-01-28 18:50:00","description":"Buddy Miller & Friends, \"Cayamo Sessions at Sea\" (New West) Put Buddy Miller on a cruise ship, and outlaw country becomes Caribbean country. Miller's a popul...","filename":"data/vaneerConsumption/ReviewBuddyMillercapturescollaborativespiritofcruise.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:a5913efa2fdb47738667df7eeee12035-2vdWmEltwXfba0ce28e632bb9e99-664_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421483_Review-Buddy-Miller-captures-collaborative-spirit-cruise_1540265082.html","title":"Review: Buddy Miller captures collaborative spirit of cruise","title_page":"Review: Buddy Miller captures collaborative spirit of cruise | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Review: Buddy Miller captures collaborative spirit of cruise\nBuddy Miller & Friends, \"Cayamo Sessions at Sea\" (New West)\nPut Buddy Miller on a cruise ship, and outlaw country becomes Caribbean country.\nMiller's a popular perennial performer on the Cayamo music cruise, and during voyages to such destinations as St. Croix and Tortola in 2014 and 2015, he organized recording sessions aboard the ship with some of the other headliners. Here's the result: 11 songs capturing the collaborative spirit that's a big part of Cayamo's success.\nThis CD cover image released by New West Records shows \"Cayamo Sessions at Sea,\" a release by Buddy Miller & Friends. (New West via AP)\nThe ever-deferential Miller remains in the background much of the time but makes sure the atmosphere is relaxed, and the song selection is typical of his big-tent approach. Shawn Colvin, always masterful at covers, beautifully tenderizes the Rolling Stones' \"Wild Horses.\" Kris Kristofferson reprises his best tune, \"Sunday Morning Coming Down,\" the lyrics all the more poignant coming from someone approaching 80.\nDoug Seegers evangelizes on the persuasive original \"Take the Hand of Jesus,\" and for those who worship John Prine, Brandi Carlile and the Lone Bellow bring gospel fervor to \"Angel from Montgomery.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3421483/Review-Buddy-Miller-captures-collaborative-spirit-cruise.html"}
