{"authors":["Andy Battaglia"],"date_download":"2018-10-23 02:00:11","date_modify":"2018-10-23 02:00:11","date_publish":"2015-10-14 00:00:00","description":"The Depeche Mode frontman's second album with Soulsavers sets his anguished cry against a sparse desert-rock sound that's far from the music for which he's known.","filename":"data/vaneerConsumption/ReviewDaveGahanSoulsaversAngelsGhosts.json","image_url":"https://media.npr.org/assets/img/2015/10/13/davegahansoulsaver2015_gullick2475_wide-f0636e2e3ca7745edd07edfd3785af1754550213.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_10_14_447246900_first-listen-dave-gahan-soulsavers-angels-ghosts_1540260011.html","title":"Review: Dave Gahan & Soulsavers, 'Angels & Ghosts'","title_page":"Review: Dave Gahan & Soulsavers, 'Angels & Ghosts' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Review: Dave Gahan & Soulsavers, 'Angels & Ghosts'\nNote: NPR's audio for First Listens comes down after the album is released. However, you can still listen with the Spotify playlist at the bottom of the page.\nEnlarge this image toggle caption Courtesy of the artist. Courtesy of the artist.\nDave Gahan has sung about a soul that needs saving since his earliest murmurings as the frontman of Depeche Mode. Now, he's recorded his second collection of collaborative songs with Soulsavers since teaming up with the U.K. production enterprise in 2012. The first release was solely a Soulsavers project by virtue of its billing, with Gahan presented as a contributor of vocals to all songs that weren't instrumentals. But Angels & Ghosts puts Gahan's name — and his searching, dependably anguished cry — out front for all to behold.\nAngels & Ghosts is nothing like a Depeche Mode album in terms of atmosphere, with a dusty, sparse desert-rock sound that couldn't be less electronic. Earthiness is the gambit instead, with Gahan humming in the opening few seconds as if he's a weathered old bluesman readying his throat for an exorcism. \"Shine\" sets the template from the start: gritty guitar riffs, loping rhythms and a spirit that glows (\"There's light here, and it shines on you\") through even the darkest moods. \"You Owe Me\" moves even more slowly, with Gahan sounding a bit like the ghost of Jim Morrison in a trippy, menacing cantina before \"Tempted\" fills out around a snaky guitar part and vocal harmonizing that evokes younger guns like Sharon Van Etten and Midlake.\nMost of the album revolves around a formidable mix of electric guitar and electric piano, with gospel-inspired backing vocals summoning a sense of scale that swells. \"Don't Cry\" calls on all the elements at a forlorn speed that allows each of the pieces to make for maximum rock drama.\nThere's plenty of space for Gahan to haunt with words that tip toward both loss and salvation. In \"All Of This And Nothing,\" after equating himself with the dirt, the sun, a river and a storm, he sings, \"I'm all of this and nothing\" as if the chance to voice such a realization makes up for the ambiguity within it. In \"One Thing,\" he's on to singing about \"life on Mars\" with a spirited sense of communion. But Earth, with all its grit and grief and grace, seems to be where he remains most at home.","url":"https://www.npr.org/2015/10/14/447246900/first-listen-dave-gahan-soulsavers-angels-ghosts"}
