{"authors":["Associated Press"],"date_download":"2018-10-23 00:25:58","date_modify":"2018-10-23 00:25:58","date_publish":"2016-01-29 13:16:00","description":"Independent video-game designers have hit upon a fascinating way to create buzz: Don't give players all the answers. That opens up a game beyond the game, wi...","filename":"data/vaneerConsumption/ReviewCleverinfuriatingpuzzlesleadTheWitness.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:ba84bd3d8e6c4d429caf2c0d9a35c9e7-3bmscybNe842cce83474b55d880a-180_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422743_Review-Clever-infuriating-puzzles-lead-The-Witness_1540254358.html","title":"Review: Clever, infuriating puzzles lead 'The Witness'","title_page":"Review: Clever, infuriating puzzles lead 'The Witness' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Review: Clever, infuriating puzzles lead 'The Witness'\nIndependent video-game designers have hit upon a fascinating way to create buzz: Don't give players all the answers. That opens up a game beyond the game, with players flocking at online message boards to debate the deeper meanings of what they've just experienced. I'd guess that many of the people who have bought recent indie hits like \"Her Story,\" ''Soma\" and \"Journey\" have spent more time arguing about them than playing them.\nOne of the pioneers of this trend is Jonathan Blow, whose time-warping puzzle game \"Braid\" baffled millions in 2008. The story in \"Braid\" was unapologetically ambiguous, and interpretations ranged from a tale of love gone sour to a retelling of the creation of the atomic bomb.\nBlow has taken his time crafting a follow-up, but has finally re-emerged with \"The Witness\" (Thekla, for the PlayStation 4, PC, $39.99). It's even more bewildering than \"Braid\" — and while some Blow fans will adore it, many will find it infuriating.\nThis image released by Thekla Inc. shows a scene from \"The Witness,\" a video game set in a mysterious island with hundreds of puzzles. (Thekla Inc. via AP)\n\"The Witness\" is set on a lush tropical island dotted with the ruins of a vanished civilization. Scattered across the island are hundreds of electrified panels, each of which contains a small, two-dimensional puzzle. The vast majority are mazes, and the first few simply ask you to draw a line from start to finish. But they quickly grow more complex: You may need to separate colored boxes, or draw the line so it creates certain shapes in the grid.\nThe devilish gimmick here is that the designers never explain the rules, so when triangles and stars pop up in the mazes you have no idea what they mean. The only way to interpret them is by experimenting — and once you figure out one symbol, Blow has another in his pocket.\nRewards vary. Most of the time your prize for solving a puzzle is ... another puzzle. Some panels unlock doors or create bridges to new areas. If you solve enough mazes, you'll activate lasers that converge at a mountaintop, where you'll find — well, let's not spoil too much. Older gamers will be reminded of the 1990s classic \"Myst\" (indeed, one of the designers is a \"Myst\" veteran), although the mythology here isn't quite as elaborate.\nAs a die-hard puzzle addict, I initially found \"The Witness\" disappointing. The puzzles are generally well-designed, but they're almost all mazes, and I would have liked a bit more variety. But it has grown on me, and I've found it's better appreciated in short sessions. Tinker with a few panels until you get stuck, and then play something less nerve-racking, like \"Call of Duty.\"\nWebsites have already started posting solutions to some of the most vexing puzzles, so there's nothing to stop you from seeking help. And I'm looking forward to finding out what players think of the broader mystery embedded in the island. \"The Witness\" demands intense levels of patience and concentration — and I still don't know if the payoff is worth the effort. Three stars out of four.\n__\nOnline:","url":"https://www.dailymail.co.uk/wires/ap/article-3422743/Review-Clever-infuriating-puzzles-lead-The-Witness.html"}
