{"authors":["Matthew Debord"],"date_download":"2018-10-30 20:49:52","date_modify":"2018-10-30 20:49:52","date_publish":"2016-12-26 00:00:00","description":"The type of intense racket that race cars generate can be very bad for your hearing.","filename":"data/vaneerConsumption/REVIEWEtymoticER20XShighdefearplugs.json","image_url":"https://amp.businessinsider.com/images/5834afe1e02ba72a008b5df4-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_review-etymotic-er-20-xs-high-def-earplugs-2016-12_1540932592.html","title":"REVIEW: Etymotic ER-20 XS high def earplugs","title_page":"    REVIEW: Etymotic ER-20 XS high def earplugs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Loud! Matthew DeBord/Business Insider For the past few years, I've been rather frequently attending car races, and I've discovered that an indispensable piece of equipment is a set of earplugs.\nWith the 2017 motorsports season about to kick off with some races in Florida, now is a good time to start thinking about upgrading your gear.\nAs a member of the media, I usually have some sort of access to the pit stops, where the race cars pull in to get tire changes and to be refueled. The noise they make, up close, it literally eardrum-obliterating.\nBut even if you don't get down close to the action, the type of intense racket that race cars generate can be very bad for your hearing.\nIn the past, I've usually made do with disposable foam earplugs, which dampen the wail of screaming engines, but also muffle everything else.\nThen a company called Etymotic, which makes a range of earphones and hearing-protection devices, offered to let me sample a pair of ER-20 XS high-definition earplugs designed specifically for motorsports.\nI had a great test in mind for the product: the 24 Hours of Le Mans auto race, held every June southwest of Paris in the French countryside.\nHow'd they do? Read on to find out:","url":"https://www.businessinsider.com/review-etymotic-er-20-xs-high-def-earplugs-2016-12"}
