{"authors":["Patrick Jarenwattananon"],"date_download":"2018-10-23 00:06:42","date_modify":"2018-10-23 00:06:42","date_publish":"2016-04-21 00:00:00","description":"To the extent that Snarky Puppy has a core sonic idea, it's an intricate melody over a multifaceted groove, as generated by multiple horn players, guitarists, keyboardists and percussionists.","filename":"data/vaneerConsumption/ReviewSnarkyPuppyCulchaVulcha.json","image_url":"https://media.npr.org/assets/img/2016/04/19/snarky-2016-group-shot-1_wide-278b8b9041dd550fb9c37eac260299672e994dd3.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_04_21_474878387_first-listen-snarky-puppy-culcha-vulcha_1540253202.html","title":"Review: Snarky Puppy, 'Culcha Vulcha'","title_page":"Review: Snarky Puppy, 'Culcha Vulcha' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Review: Snarky Puppy, 'Culcha Vulcha'\nNote: NPR's First Listen audio comes down after the album is released. However, you can still listen with the Spotify playlist at the bottom of the page.\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\nHigh among the variously outstanding qualities of the band Snarky Puppy is its fecundity. This new music heard here isn't even the first Snarky record to come out this year — that would be the live album and concert film of collaborations called Family Dinner Vol. 2, released in February. Count back and you arrive at seven full-length releases in the last five years, 11 in total. Then there are the familial side projects (more of those to come this year, too), the international touring schedule of an improbably successful band, and the many other gigs to which any given member commits. Snarky Puppy is on its hustle.\nAt the center of this churn is bassist, chief composer and ringleader Michael League. Remarkably, he's herded such quantity from a many-humaned band, one whose general largeness is also an aesthetic one. To the extent that Snarky Puppy has a core sonic idea, it's an intricate melody over a multifaceted groove, as generated by multiple horn players, multiple guitarists, multiple keyboardists and multiple percussionists. It gathers ideas openly and avidly from all over the world and throughout the Afro-American popular music continuum, blending freely. Few might have predicted that such a maximalist, stylistically unbound ensemble — an instrumental funk band on the precipice between intricate and noodly — could sustain itself beyond personal passion. Yet League and the band have grown a rabid fan base of depth and diversity: young and old, jazz people and laypeople, black, white, neither. A second Grammy Award arrived earlier this year.\ntoggle caption Courtesy of the artist\nThis record happens to be called Culcha Vulcha; read approvingly, it acts as a general modus operandi. Snarky Puppy's very DNA is recombinant, first barking when League was a Led Zeppelin-obsessed bass student in the University of North Texas jazz program. Its finishing school was the gospel-church gigs and R&B production of nearby Dallas, where a deeper idiomatic negritude set in. Big ears fill in the rest. League recently explained to Jazz Night In America that one of his most famous tunes, \"Shofukan,\" was written in a Japanese cultural center in the Netherlands during Christmas, based on a misheard groove from Lebanon.\nA more timely example: The record starts off with \"Tarova,\" where South Asian percussion meets Southern amplitude; the effect comes off vaguely like go-go. The adverb \"vaguely\" arises often, really. An anguine, vaguely Brazilian melody defines the next tune, \"Semente.\" \"Gemini\" feels vaguely Motown but slower, and with extra synth. \"Grown Folks\" is anchored by a vaguely New Orleans parade beat, and so on. To be clear, the vagaries aren't intended pejoratively, unless you want them to be; they're just signifying suggestions, elements to build upon. There's too much sincerity here to not take it seriously; a lot of virtuosos — particularly the many keyboard players — have fully committed to the one-nation-under-a-groove family.\nIt is everything and nothing, but it is certainly now a thing. Culcha Vulcha is Snarky Puppy's first true studio record in many years, with no studio audience or guest-star collaborators. Given their work ethic, it's hard to imagine that League and the \"family\" would commit such a document to tape haphazardly; it certainly sounds more post-produced than their typical live-to-tape recordings. The intentional nature of the project seems to surface something more at the core of their ethos. At very least, Culcha Vulcha is big, rich and funky — maybe that's enough.","url":"https://www.npr.org/2016/04/21/474878387/first-listen-snarky-puppy-culcha-vulcha"}
