{"authors":["Lloyd Schwartz"],"date_download":"2018-10-23 05:35:18","date_modify":"2018-10-23 05:35:18","date_publish":"2015-05-26 00:00:00","description":"In the 1940s, recording engineers perfected new sound techniques that were used in World War II — and which launched a hi-fi revolution. Lloyd Schwartz reviews the new 53-CD Decca box set.","filename":"data/vaneerConsumption/RevisitingTheCrystalClarityCreatedByTheDeccaSoundRevolution.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_05_26_409722917_revisiting-the-crystal-clarity-created-by-the-decca-sound-revolution_1540272918.html","title":"Revisiting The Crystal Clarity Created By The 'Decca Sound' Revolution","title_page":"Revisiting The Crystal Clarity Created By The 'Decca Sound' Revolution : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Revisiting The Crystal Clarity Created By The 'Decca Sound' Revolution\nIn the 1940s, recording engineers perfected new sound techniques that were used in World War II — and which launched a hi-fi revolution. Lloyd Schwartz reviews the new 53-CD Decca box set.\nTERRY GROSS, HOST:\nThis is FRESH AIR. The Decca label, which began as a British record company, pioneered high-fidelity sound and the long-playing record. A new 53-CD box called \"Decca Sound,\" celebrating the early days of hi-fi, has just been released. Classical music critic Lloyd Schwartz has an appreciation.\n(SOUNDBITE OF SONG, \"PETRUSHKA\")\nLLOYD SCHWARTZ, BYLINE: Who would've thought that technology developed by audio engineers associated with Decca Records during World War II to distinguish British from German submarines would lead to a revolution in the recording industry? These new sound techniques are the immediate ancestors of Decca Records' full frequency range recordings. The familiar FFRR initials next to the drawing of an ear - that was the Decca logo.\nA new 53-disc CD box called \"Decca Sound\" celebrates the history of Decca's pre-stereo recordings from the early 1950s. It was just around this time that Columbia Records in the U.S. introduced the long-playing, or LP, record, spinning on a turntable at 33-and-a-third revolutions per minute on an unbreakable vinyl disc. And the introduction of magnetic tape not only allowed longer recording takes than the four minutes for each side of an old 78 RPM shellac, but a new ease in editing out bad takes. And fortunately for listeners, Decca, which was known in this country as London Records, also had a distinguished roster of performers. The music you heard at the beginning of my review was the scintillating opening of Stravinsky's \"Petrushka,\" led by the Swiss conductor Ernest Ansermet. It was the very first Decca LP, released in 1950 - a mono recording that still sparkles in its crystal clarity.\n(SOUNDBITE OF SONG, \"PETRUSHKA\")\nSCHWARTZ: There are countless legendary musicians included on these discs - violinist Mischa Elman, the Vienna Philharmonic Orchestra and great British artists like the pianist Clifford Curzon or the Griller and Amadeus String Quartets. Benjamin Britten conducts one of his earliest recordings of his own music. The brilliant Spanish conductor Ataulfo Argenta, who died in his 40s, leads a wonderful disc devoted to Spanish composers.\nI could go on and on, but I'd like you to hear one of my favorite recordings in this Pandora's box. The British composer Sir William Walton is probably best known for his stirring soundtrack to Laurence Olivier's \"Henry V.\" But in 1922, he composed \"Facade,\" a witty performance piece for orchestra and two people reading Dame Edith Sitwell's eccentrically musical poems. Walton called it \"An Entertainment.\" In 1954, Decca made a recording with Sitwell herself and tenor Peter Pears, Benjamin Britten's life partner, reciting the poems. I'd been hoping to find a copy for years. Here's Edith Sitwell reading her poem \"Polka\" in William Walton's \"Facade.\"\n(SOUNDBITE OF POEM, \"POLKA\")\nEDITH SITWELL: Tra-la-la-la-la-la-la-la (ph). See me dance the polka, said Mr. Wagg like a bear, with my top hate and my whiskers that - tra (ph) - trap the fair. Where the waves seem chiming haycocks, I dance the polka. Stand Venus' children in their gay frocks - maroon, marine. And stare to see me fire my pistol through the distance blue as my coat.\nLike Wellington, Byron, the Marquis of Bristol, busbied (ph) great trees float, while the wheezing hurdy-gurdy (ph) of the marine wind blows me to the tune of \"Annie Rooney,\" sturdy, over the sheafs of the sea. And bright as a seedsman's packet, with zinnias, candytufts, chill, is Mrs. Marigold's jacket, as she gapes at the inn door still, where at dawn in the box of the sailor, blue as the decks of the sea, Nelson awoke, crowed like the cocks. Then back to the dust sank he.\nAnd Robinson Crusoe rues so the bright and foxy beer. But he finds fresh isles in a negress' smiles - the poxy, doxy (ph) dear. As they watch me dance the polka, said Mr. Wagg like a bear, in my top and my whiskers that - tra (ph) - trap the fair. Tra-la-la-la-la-la, tra-la-la-la-la-la, tra-la-la-la-la-la-la-la-la, la, la (ph).\nSCHWARTZ: Even though Sitwell's diction is impeccable, I still wish the set included the text of her poems. What does come with the box - it's an actual box - is a booklet that tells the fascinating Decca story, gives all the recording details and reproduces amusing original ads for these newfangled LPs. The cardboard CD sleeves duplicate each original album cover, though there are no liner notes. Still, given everything on these discs, this is a great bargain.\nGROSS: Lloyd Schwartz teaches poetry in creative writing MFA program at the University of Massachusetts, Boston, and writes for the web journal New York Arts. He reviewed the 53-CD set \"Decca Sound: Mono Years, 1944 to 1956.\"\n(SOUNDBITE OF ORCHESTRAL MUSIC)\nGROSS: Tomorrow on FRESH AIR, our critic-at-large John Powers tells us about some of the best and worst films he saw at the Cannes Film Festival and actress Maria Bello talks about her new memoir describing how her life has changed since entering a committed relationship with another woman. She thinks traditional labels describing relationships don't fit anymore.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/05/26/409722917/revisiting-the-crystal-clarity-created-by-the-decca-sound-revolution"}
