{"authors":["Geoff Earle","Deputy U.S. Political Editor For Dailymail.Com"],"date_download":"2018-10-23 03:29:54","date_modify":"2018-10-23 03:29:54","date_publish":"2017-03-16 14:25:32","description":"Secretary of State Rex Tillerson gave indicated while traveling in Japan that he is willing to swallow the massive budget cuts that President Trump's first budget is imposing on his agency.","filename":"data/vaneerConsumption/RexTillersonwontcondemnslashingcutstoagencybudget.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54956F00000578-0-image-a-16_1489674280312.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320464_Tillerson-won-t-condemn-slashing-cuts-agency-budget_1540265394.html","title":"Rex Tillerson won't condemn slashing cuts to agency budget","title_page":"Rex Tillerson won't condemn slashing cuts to agency budget | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Secretary of State Rex Tillerson indicated while traveling in Japan that he is willing to swallow the massive budget cuts that President Trump's first budget is imposing on his agency, saying he accepts the challenge 'willingly.'\nTillerson, the former Exxon CEO who has dined frequently with Trump during his early tenure, did not push back publicly after it was revealed State would absorb a 29 per cent cut – more than any agency except the Environmental Protection Agency, which is despised by some conservatives.\nAsked about the cuts, which run from U.S. contributions to UN peacekeeping to direct aid programs to some of the world's poorest nations, Tillerson said the agency's budget had grown to large due to overseas conflicts.\n'The level of spending that the State Department has been undertaking, particularly in the past year, is simply not sustainable,” Tillerson said.\nSecretary of State Rex Tillerson said in Japan that he takes on the challenge of cutting his agency budget 'willingly'\n'I take the challenge that the President has given us on willingly and with great expectation that with everyone in the State Department’s assistance, we’re going to deliver a much better result for the American people in the future.'\nState would absorb a $10.9 billion cut in the next fiscal year under the Trump budget proposal.\nFunding would drop from 38 per cent to 27.1 per cent – making the agency the biggest loser other than the EPA, an agency despised by some conservatives.\nThe 'Budget Blueprint to Make America Great Again' provides $2.2 billion for new embassy construction, and $3.1 billion in aide to Israel. It eliminates a Global Climate Change initiative, shifts foreign assistance from grants to loans in some cases, and shifts funds to areas with the 'greatest strategic importance.' It also reduces funds for cultural exchanges, and eliminates funds for small institutions like the East-West Center.\nRex Tillerson, U.S. Secretary of State, left, shakes hands with Fumio Kishida, Japan's foreign minister, during a joint news conference in Tokyo, Japan, on Thursday\nAn Indonesian UNIFIL peacekeeper waves a UN flag on the border between Lebanon and Israel in the southern Lebanese village of Adaisseh on November 30, 2009. President Trump's budget slashes funding for UN peacekeeping\nRear Admiral Michael Franken, left, commander of Combined Joint Task Force Horn of Africa, Kumsa Baysa, principal of Gende Gerada Primary School, Molly Phee, deputy chief of mission at the US Embassy in Ethiopia. The budget calls for shifting aide to areas of the 'greatest strategic importance'\nUSAID blankets being distributed by Mercy Corps wait to be loaded onto trucks at Chaklala airport October 31,2005 in Islamabad, Pakistan. Diplomats argue that 'soft power' can reduce the chance of conflicts\nThe State Department got hammered with a 29 per cent cut in the Trump administration's first budget proposal\nExplaining the cuts, Tillerson said: 'As time goes by, there will be fewer military conflicts that the U.S. will be directly engaged in. And second .. as we become more effective in our aid programs, that we will also be attracting resources from other countries, allies, and other sources as well to contribute in our development aid and our disaster assistance.'\nTillerson, who got a $180 million package when he left Exxon, hailed the agency's staff. 'The men and women in the State Department are there for one reason. They’re not there for the glory. They’re not there for the money, obviously. They’re there because they’re extraordinarily dedicated to the mission and dedicated to ensuring America’s national security, economic security.'\nThe big cuts don't appear to be reflective of Tillerson's relationship with the president. He was dining at Trump's luxury hotel when Trump went out there to dinner there last month, and the two men visited.\nSecretary of State Rex Tillerson (L) looks on as President Donald Trump speaks to the press before he meets with his cabinet in the Cabinet Room at the White House in Washington, DC, on March 13. He has dined with Trump on several occasions\nSecretary of State Rex Tillerson looks on before his meeting with Japanese Prime Minister Shinzo Abe at Abe's official residence in Tokyo on March 16, 2017\nState was the second-biggest agency loser in the 'America First' budget\nOn Sunday, Trump had dinner with Tillerson and his national security advisor at the White House.\nHe said the agency would be undertaking a 'very comprehensive examination of how programs are executed, a very comprehensive examination of how we are structured, and I’m confident that with the input of the men and women of the State Department, we are going to construct a way forward that allows us to be much more effective, much more efficient, and be able to do a lot with fewer dollars.'\nHe continued: 'So it’s challenging. We understand the challenge. I take the challenge that the President has given us on willingly and with great expectation that with everyone in the State Department’s assistance, we’re going to deliver a much better result for the American people in the future.'","url":"https://www.dailymail.co.uk/news/article-4320464/Tillerson-won-t-condemn-slashing-cuts-agency-budget.html"}
