{"authors":[],"date_download":"2018-10-30 17:55:27","date_modify":"2018-10-30 17:55:27","date_publish":"2018-10-30 17:00:00","description":"Theater review: Actor's Express has been there, done that in ‘Reykjavik’","filename":"data/vaneerConsumption/ReykjavikatActorsExpress.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.22663383_Reykjavik_2-U67436161352Rcw-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_24802207b3a68f58bb80537213330049__1540922127.html","title":"‘Reykjavik’ at Actor's Express","title_page":"Theater review: ‘Reykjavik’ at Actor's Express","title_rss":"NULL","source_domain":"ajc.com","text":"Steve Yockey’s “Reykjavik,” the latest presentation in the National New Play Network’s “rolling” world premiere program, marks a homecoming of sorts for the former Atlanta playwright (now based in Los Angeles). Ahead of productions at other theaters in Dallas, New Orleans and Washington, D.C., the play is currently running at Actor’s Express, which has a proven track record with his earlier works: “Octopus” (2008), “Wolves” (2012), “Pluto” (2013) and “The Thrush and the Woodpecker” (2015) among them.\nRELATED: What you’ll find at theaters around metro Atlanta in the 2018-19 season\nDirected by Melissa Foulger, who also staged the last three of those earlier shows, “Reykjavik” very much follows in an established Yockey fashion — i.e., another supernatural psychological allegory, often replete with sordid and ominous sexual overtones, a mystical animal motif, and/or climaxes of implied violence, if not cascades of actual bloodshed.\nPerhaps now would be as good a time as any to admit that my favorite Yockey plays happen to be two of his most uncharacteristic: the plucky satirical piece “Cartoon,” locally produced by Out of Hand Theater in 2006; and the poignant Alzheimer’s drama “Blackberry Winter,” which was performed at the Express in repertory with “The Thrush and the Woodpecker.”\nWhat both of those shows made so perfectly clear is how much more there is to Yockey’s talent and skill than always meets the eye. It’s not to suggest that he’s some kind of a one-trick pony, then, simply to mention that he is up to a lot of his same old theatrical tricks in “Reykjavik.” Even the Express’ own marketing campaign has admiringly (and accurately) referred to it as an example of the playwright functioning “at his Yockiest.”\nAudience members who have previous experience with any of those like-minded Yockey efforts can gauge their interest levels accordingly. Those who don’t should take heed that “Reykjavik” isn’t for all tastes.\nGil Eplan-Frankel appears in “Reykjavik” at Actor’s Express. CONTRIBUTED BY CASEY GARDNER (For the AJC)\nThe play is comprised of several ostensibly interconnected scenes that unfold over roughly 80 intermission-free minutes, featuring an ensemble of six actors in multiple roles — Gil Eplan-Frankel, Stephanie Friedman, Eliana Marianes, Joe Sykes, Ben Thorpe and Michael Vine, some of whom are better equipped than others with regard to delineating between their characters.\nIn a noisy gay bar, where the dialogue is cleverly translated with supertitles projected against a back wall of the set, an American tourist in Iceland to check out the Northern Lights runs afoul of a pair of sinister S&M types with brutal fantasies of rape and murder on their minds. They may or may not be the same guys who appear in a couple of later scenes, involving an arguably willing sex slave held hostage in a basement cell, and the various captors or protectors who share a certain “rescue complex.”\nIn an upscale hotel room, one gay couple rendezvous for a regular afternoon tryst, under the watchful eyes of a flock of ravens perched outside the window, who eventually start issuing cryptic messages to the men via the hotel’s chirpy concierge staff. Another gay couple meets in another hotel room, for a revealing conversation about their individual “origin stories.”\nYet another, vacationing in Reykjavik, bicker outside that bar, where they are soon forced to (rather savagely) defend themselves against a potential assault by a hateful gay basher. Two women meet there, too, although it’s strangely possible they’ve already made contact in many different times and places. And two separated siblings reunite to finally behold the magical sight of the aurora borealis — with a little help from their guardian elves.\nOf all the thematic dichotomies that abound in “Reykjavik,” the most dramatic of them might be that, however intent the play is to venture off the beaten path, in the end it’s essentially par for the course by the playwright’s own tried-and true standards and pre-existing conditions.\nTHEATER REVIEW\n“Reykjavik”\nThrough Nov. 18. 8 p.m. Wednesdays-Saturdays; 2 p.m. Sundays. $20-$35. Actor’s Express (at King Plow Arts Center), 887 W. Marietta St. NW, Atlanta. 404-607-7469, actors-express.com.\nBottom line: Pure Steve Yockey, any way you look at it.\nIN OTHER NEWS:","url":"https://www.ajc.com/entertainment/arts--theater/review-actor-express-has-been-there-done-that-reykjavik/nRhxwaacdeBxqPuD8gMPFN/"}
