{"authors":["Press Association Reporter"],"date_download":"2018-10-23 01:50:57","date_modify":"2018-10-23 01:50:57","date_publish":"2017-03-10 10:22:49","description":"The RFU will continue to resist pressure from Six Nations Ltd to follow in the footsteps of Wales by hosting games in a Friday evening slot that is popular with broadcasters.","filename":"data/vaneerConsumption/RFUrulesoutstagingFridaynightmatchesatTwickenham.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E0DA21300000578-0-image-a-31_1489141357079.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4300618_RFU-rules-staging-Friday-night-matches-Twickenham_1540259457.html","title":"RFU rules out staging Friday night matches at Twickenham","title_page":"RFU rules out staging Friday night matches at Twickenham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Rugby Football Union has confirmed it will not be staging Friday night England matches at Twickenham.\nThe RFU will continue to resist pressure from Six Nations Ltd to follow in the footsteps of Wales by hosting games in a slot that is popular with broadcasters.\n'You keep pushing the door and eventually the door will open,' Six Nations Ltd chief executive John Feehan told The Times.\nTwickenham will host England vs Scotland on Saturday, but the RFU don't want night games\n'Would I like more Fridays? Yes. Will I get them? Probably, in time, but it will take time.'\nTwickenham staged a Friday night match during the 2015 World Cup - England's tournament opener against Fiji - but the RFU views the global showpiece as a one-off event.\n'Our position hasn't changed. We don't generally support Friday night matches at Twickenham for a variety of reasons, not least the challenges our fans have getting to and from the match,' an RFU spokesperson said.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4300618/RFU-rules-staging-Friday-night-matches-Twickenham.html"}
