{"authors":["Kristie Rohwedder"],"date_download":"2018-10-31 01:51:59","date_modify":"2018-10-31 01:51:59","date_publish":"2018-09-13 21:19:46","description":"It’s time to bid farewell to a Real Housewives of Orange County newcomer — and no, this isn’t about rookie Real Housewives Gina Kirschenheiter and Emily Simpson. Bravo power couple Tamra and Eddie Judge are selling the home they moved into less than…","filename":"data/vaneerConsumption/RHOCStarsTamraEddieJudgeAreSellingTheirHouseForAPotentiallyEerieReason.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/cb83b7e9-8b8d-4f33-8215-0032bd7bfce9-getty-174572394.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_rhoc-stars-tamra-eddie-judge-are-selling-their-house-for-a-potentially-eerie-reason-11913917_1540950719.html","title":"'RHOC' Stars Tamra & Eddie Judge Are Selling Their House For A Potentially Eerie Reason","title_page":"'RHOC' Stars Tamra & Eddie Judge Are Selling Their House For A Potentially Eerie Reason","title_rss":"NULL","source_domain":"bustle.com","text":"It’s time to bid farewell to a Real Housewives of Orange County newcomer — and no, this isn’t about rookie Real Housewives Gina Kirschenheiter and Emily Simpson. Bravo power couple Tamra and Eddie Judge are selling the home they moved into less than a year ago. So you know that house that gave the Judges a mess of plumbing trouble at the top of Season 13? The RHOC duo is officially ready to cut ties with the property.\nBravo's The Daily Dish called it a \"jinxed\" property, but while a jinx has not been proven, Tamra and Eddie's ownership of this house sure has coincided with a spate of unfortunate events. And now they're ready to close that door. Wednesday evening, Tamra announced on Instagram that their Ladera Ranch abode is on the market. The RHOC star shared a slideshow of photos of the home, writing,\n“Yes, This is happening. After a very emotional year we have decided to make a change. I love the process of remodeling & decorating and enjoyed ever step of the way. I can’t wait for you you to see what’s next . We are very excited about the next chapter of our life.... stay tuned #godisgood. * I LOVE THE “SPECULATIONS” OF WHY WE ARE MOVING. KEEP THEM COMING SO YOU CAN FEEL LIKE A REAL A** WHEN YOU FIND OUT”\nTamra and Eddie’s recently renovated house is up for just under $1.8 million. You can check out the listing here. Oh, and you can watch Tamra's tour of the house below.\nBravo on YouTube\nThe Judges got the keys to their soon-to-be former home in December 2017, and less than a year later, they are ready to give those keys to someone else. Now, the Bravolebrities’ decision to relocate did not come out of the blue: Tamra recently told Bravo’s The Daily Dish that she believes the home “doesn’t like [them]” and so they “might be moving.” Tamra also said Eddie said he “[didn’t] have a good feeling about this house” when they bought the place. Eesh, that's spooky.\nUnfortunately, it sounds like Eddie's intuition was right. As Tamra explained to The Daily Dish,\n\"Since we moved in, it's just been one thing after another. We moved in under construction, which was stressful. Then, our dog got cancer. Then, our guinea pig died. Then, I broke my foot the same day the guinea pig died.”\nTamra added that her husband underwent his first heart procedure right when they moved in, too. She told The Daily Dish,\n“The day before [Eddie] went into the hospital, he tried to put the TV on the wall and hit a fire sprinkler and flooded the whole house after we had just done a lot of construction. So it's just been one thing after another.”\nAnd that was his first of six operations. Again, all of these difficult things happened to Eddie and Tamra after they moved into the house. And that was only nine months ago. Eddie's original feeling about the house sure is eerie.\nNo, Tamra didn’t share the reason why they’re selling the house, but it’s hard not to suspect they are over living in a home that “doesn’t like [them].” Whatever their reason for moving may be, may their next home bring them a series of fortunate events.","url":"https://www.bustle.com/p/rhoc-stars-tamra-eddie-judge-are-selling-their-house-for-a-potentially-eerie-reason-11913917"}
