{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 22:40:56","date_modify":"2018-10-22 22:40:56","date_publish":"2016-01-28 10:50:18","description":"Last week, theatre star Rhonda Burchmore seemed to confirm she was going to appear on the upcoming series I'm A Celebrity...Get Me Out of Here Australia, with a telling Instagram post","filename":"data/vaneerConsumption/RhondaBurchmorehintedtobeheadingtoSouthAfricaforImaCelebrity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9D78F00000578-0-image-a-12_1453981985128.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420445_Julia-Morris-drops-MAJOR-hint-theatre-star-Rhonda-Burchmore-heading-South-Africa-m-Celebrity-Here_1540248056.html","title":"Rhonda Burchmore hinted to be heading to South Africa for I'm a Celebrity","title_page":"Rhonda Burchmore hinted to be heading to South Africa for I'm a Celebrity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Last week, theatre star Rhonda Burchmore seemed to confirm her participation on the upcoming series I'm A Celebrity...Get Me Out of Here with a telling Instagram post.\nBut while the contestants identities remain a closely guarded secret, co-host Julia Morris, 47, inadvertently dropped a major hint on Thursday morning by suggesting the actress will be taking part.\nJulia appeared on Rove and Sam and was asked directly by Rove how Rhonda is 'dealing with it all,' after having spoken about life in the jungle and Julia implied she was going on the show.\nScroll down for video\nLetting slip? I'm A Celebrity...Get Me Out Of Here! co-host Julia Morris appeared to confirm speculation that Rhonda Burchmore is heading into the jungle during a radio appearance\n'I don't know how she is going to go I have to be honest,' Julia said. 'I am hoping she does alright - she's already pretty slim and this is a show where you drop a bit of beef in the jungle.\n'So if she does turn side-lines halfway through you might not be able to see her,' Julia said with a laugh.\nRove went on to further quiz Julia about Rhonda, 55, and asked if she was in South Africa.\nWhat's the go? Last week, theatre star Rhonda Burchmore seemed to confirm she was going to appear on the upcoming series I'm A Celebrity...Get Me Out of Here Australia, with a telling Instagram post\n'We were seeing Instagram feeds of Rhonda being in the jungle. Has she landed? Is she there? Is she a spare? Is she a third wheel? Is she officially going in?,' he said.\nJulia appeared to back track her comments, answering: 'That's the thing they don't tell me anything until the last day because I get a bit over excited and slip up - so I could easily say \"Oh God they are all coming in - everyone mentioned has come in.\"\n'But from all reports though, I have been told that hardly any of the guesses are right so far. And that's what happened last year - people were convinced someone was coming in and then there was another whole group of people.'\nJulia went on to explain that the celebrities who are going into the jungle are already in South Africa.\nHints: Julia went on to explain that the celebrities who are going into the jungle are already in South Africa. She is seen here with co-host Dr Chris Brown\n'They are not near our set yet, they are all in individual accommodation right around the area and it's an extensive area so they don't see each other until they start what is known as the walk in.'\nRhonda - who is well known for her role in the 1982 flick The Pirate Movie, her many stage performances in Australia and overseas and who has released a number of albums - last week seemed to confirm she was heading to the jungle.\nShe shared a picture of herself to her Instagram page, alongside her daughter Lexie on the plane, writing: 'About to say goodbye to Melbourne and head off into the jungle'.\n'About to say goodbye to Melbourne and head off into the jungle': Rhonda took to Instagram last week and seemed to confirm her appearance on the show\nHowever, it seems Rhonda possibly meant the concrete jungle, to which New York City in the US is commonly referred to.\nShe and her daughter jetted to NYC and have shared a number of images online of their time there, from shopping sprees to rugging up in warm winter coats after the blizzard hit the city.\nHer latest Instagram post came on Thursday, where she shared a picture of herself in a deli.\nThe big apple! She and her daughter jetted to NYC and have shared a number of images online of their time there, from shopping sprees to rugging up in warm winter coats after the blizzard hit the city\nTravelling soon? Her latest Instagram post came on Thursday, where she shared a picture of herself in a deli\nThe show is set to air on January 31, which could give the star time to jet to South Africa.\nIn the clues released from the series, a theatre star is listed.\nAnthony Callea is the latest celebrity rumoured to be heading into the jungle, after a live Q&A on the show's Twitter page this week.\nReady for a stint on TV? Anthony Callea is the latest celebrity rumoured to be heading into the jungle, after a live Q&A on the show's Twitter page this week\nThe mystery contestant revealed they 'first kicked off my career publicly on a TV series' while adding they were 'Gen Y'.\nOther clues included they had an 'other half' and had 'flown in from USA.'\nAnthony, 33, indeed had recently been seen in Hollywood and is married to Tim Campbell. He also began his career on Australian Idol.\nDaily Mail Australia exclusively revealed last week Shane Warne as one of the contestants.\nThe news of the sportsman's participation was confirmed by a media industry source.\nShane fills the aforementioned category of 'cricket player' - a clue which was previously revealed by the network.\nHe's going in! Daily Mail Australia exclusively revealed last week Shane Warne as one of the contestants","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420445/Julia-Morris-drops-MAJOR-hint-theatre-star-Rhonda-Burchmore-heading-South-Africa-m-Celebrity-Here.html"}
