{"authors":["Kayla Hawkins"],"date_download":"2018-10-31 00:11:10","date_modify":"2018-10-31 00:11:10","date_publish":"2014-08-12 20:07:17","description":"After a season so long it felt like a marathon, Real Housewives of New York City is finally coming to a close. This could very well be the last time we see this cast, and almost certainly seems like the last time we'll see Aviva Drescher, since…","filename":"data/vaneerConsumption/RHONYAvivaHeathersFeudJustMakesAvivaLookEvenWorseThanSheAlreadyDoes.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/14052b04-b053-4f56-8aff-43ea1302c232.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35380-rhony-aviva-heathers-feud-just-makes-aviva-look-even-worse-than-she-already-does_1540944670.html","title":"'RHONY' Aviva & Heather's Feud Just Makes Aviva Look Even Worse Than She Already Does","title_page":"'RHONY' Aviva & Heather's Feud Just Makes Aviva Look Even Worse Than She Already Does","title_rss":"NULL","source_domain":"bustle.com","text":"After a season so long it felt like a marathon, Real Housewives of New York City is finally coming to a close. This could very well be the last time we see this cast, and almost certainly seems like the last time we'll see Aviva Drescher, since she's had about as bad a season as any Housewife in history. But Aviva won't go down easy. She threw her leg, she disparaged Carole's career, and now, she's taking on the Queen of Rationality, Heather Thomson. While most of the other women have taken Aviva's bait, Heather always ends up shaking her head and walking away — except for in the finale, when she yelled at Aviva for being a grown woman who decided to throw her body parts while at work. Heather has never sunk to Aviva's level. She's willing to put it out there: She \"just [doesn't] like you that much.\"\nBut Aviva wouldn't be Aviva if she didn't try to scoop some \"word on the street,\" so she's coming after Heather to \"out\" her for coming from a middle class background but trying to act, in Aviva's gross words, \"ghetto.\" I was surprised when they dropped Ramona's tiff with Andy in the second reunion episode, so they must be saving something pretty good for the final installment — maybe Heather takes Aviva's paper-thin point and beats her over the head with it.\nI'm a big Heather fan (and a total Carole stan), so I'm biased. But even if I were an Aviva supporter, I'd be hard pressed to stick up for her in this one (cough, this is why no one is an Aviva fan). Heather doesn't seem like she harbors any illusions about being \"from the ghet-to, girl.\" She started her career working for Bad Boy Entertainment, and eventually moved on to working for J.Lo and Beyoncé's fashion lines. So before she started her own shapewear company in 2008, she spent 10 or so years working for and with people in the entertainment industry. And lest we forget, everybody talked like Heather then. Listen to how Justin Timberlake used to talk in 2002. She's not putting on airs. If anything, she's reminiscing. Through the elimination of g's at the end of her words. Reminiscin'.\nLook, Heather's love of very dated early 2000s hip hop slang is pretty embarrassing. But it's embarrassing like your mom dancing like she's an extra in Saturday Night Fever at your wedding is embarrassing. It isn't hurting anybody, it's just proof that all formerly cool people eventually get out of touch. I would bet money that Diddy talks to his friends exactly like Heather does to hers. The fact that Aviva thinks Heather should be ashamed for throwing in a few \"y'alls\" but finds it totally acceptable to carry her entire medical history to a dinner party?\nGross. And that's not even bringing up all of the racist and classist connotations to her argument, like Heather is speaking in a way that's beneath her somehow. It strikes me that despite having a black stepmother, Aviva is the type of person to classify anything that's not explicitly white and upper middle class as \"urban.\" At least Heather's there to set her straight like she did with Ramona last week.\nGo home, Aviva Drescher. You're drunk.*\n*a terrible person\nImages: Peter Kramer/Bravo; Giphy (2)","url":"https://www.bustle.com/articles/35380-rhony-aviva-heathers-feud-just-makes-aviva-look-even-worse-than-she-already-does"}
