{"authors":[],"date_download":"2018-10-30 18:19:05","date_modify":"2018-10-30 18:19:05","date_publish":"2014-06-23 20:52:17","description":"The Rialto Center for the Arts bills itself as “Where Atlanta Meets the World,” and the mix of global culture it is importing in 2014-15 is about to become richer.","filename":"data/vaneerConsumption/RialtoaddsIslamicfilmsperformanceintoglobalmix.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/06/23/Images/photos.medleyphoto.5412730.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_rialto-adds-i_fd173169239150445534d5f95eb26417__1540923545.html","title":"Rialto adds Islamic films, performance into global mix","title_page":"Rialto adds Islamic films, performance into global mix","title_rss":"NULL","source_domain":"ajc.com","text":"The Rialto Center for the Arts bills itself as “Where Atlanta Meets the World,” and the mix of global culture it is importing in 2014-15 is about to become richer.\nThe Georgia State University downtown Atlanta performing arts center is announcing, exclusively in The Atlanta Journal-Constitution, that it has been selected as one of four national hosts of “Caravanserai: A Place Where Cultures Meet,” a three-part program of Islamic arts.\nLaunched with support from the Building Bridges program of the Doris Duke Charitable Foundation for Islamic Art to increase engagement with Muslim culture in the post-9/11 era, “Caravanserai” focuses on a different part of Islamic culture each arts season.\nThe tour coming to Atlanta beginning this fall brings top music, film and puppetry artists from Malaysia for major presentations as well as a series of smaller exchanges with community groups during weeklong residencies. All of the programs will be offered free to the public.\nThe Diplomats of Drum global-fusion band will perform at the Rialto Oct. 23. A program of socio-political short films titled 15Malaysia will be presented Jan. 29, featuring an appearance by filmmaker Pete Teo, at Kopleff Recital Hall on GSU’s campus.\nAnd the Wayang Kulit puppet troupe will perform “The Shadow Play of Kelantan” March 7 at a site to be announced. This outfit employs hand-crafted leather puppets to project shadows onto a screen, creating plays based on the Hindi epic the Ramayana. Behind the screen is a puppet master who uses dozens of voices and leads a folk music ensemble that plays a variety of hand drums, gongs, cymbals and wind instruments.\nRialto Director Leslie Gordon told the AJC that she jumped at the chance to apply for a “Caravanserai” hosting role because it dovetails with the Rialto’s long-term commitment to showcase international artists.\n“The opportunity for the ‘Caravanserai’ artists to be in residence allows us to work with campus and community partners, bringing deeper understanding of Malaysian culture and society to our region,” Gordon said. “It is our hope that through the encounters with these gifted artists we will learn to appreciate our differences and celebrate our commonalities.”\nThe arts center’s previously announced 2014-15 Rialto Series includes appearances by Israel’s Vertigo dance troupe, French jazz from the Laurent Coq Trio, Brazilian musician Milton Nascimento, the Japanese drum troupe Kodo and German piano virtuosi Andreas Kern and Paul Cibis.\n“Caravanserai” will be presented separately from the subscription series, which mixes international and domestic talent, but they will be promoted together.\nDavid Fraher, president and CEO of Arts Midwest, the regional arts nonprofit that produces “Caravanserai,” said the program name references historic stopping places for caravans along Far East trade routes.\n“They were safe places to sit around the fire, come together and exchange stories,” Fraher said. “The name evokes that imagery of travelers in a safe haven, in a place where cultures meet.”\nThe cultural meetings in the metro area and beyond will involve Rialto community partners the Clarkston Community Center, Sautee Nacoochee Center, the Newnan Carnegie library, the Islamic Speakers Bureau of Atlanta and Perkerson Elementary School. The Rialto is doing this outreach with support from the Georgia Humanities Council and the Community Foundation for Greater Atlanta.\nThe Rialto website (rialto.gsu.edu) will have more specifics about events and reservations in coming months.","url":"https://www.ajc.com/entertainment/rialto-adds-islamic-films-performance-into-global-mix/QEjnFgJAuYHIDTegzNrCVO/"}
