{"authors":["Marc Jackson For Mailonline"],"date_download":"2018-10-23 01:17:26","date_modify":"2018-10-23 01:17:26","date_publish":"2017-03-10 09:12:47","description":"Ricci Guarnaccio insists that he is not going down the favoured route of piling on the pounds ahead of a DVD release - blaming his fuller frame on 'enjoying life too much' instead","filename":"data/vaneerConsumption/RicciGuarnaccioblamesfullerframeonenjoyinglife.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/15/3E1CBD1800000578-0-image-a-114_1489072625203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300490_Ricci-Guarnaccio-blames-fuller-frame-enjoying-life_1540257446.html","title":"Ricci Guarnaccio blames fuller frame on 'enjoying life'","title_page":"Ricci Guarnaccio blames fuller frame on 'enjoying life' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He shocked fans by looking a world away from his muscle-bound self.\nBut Ricci Guarnaccio insists that he is not going down the favoured route of piling on the pounds ahead of a DVD release - blaming his fuller frame on 'enjoying life too much' instead.\nSpeaking to Lizzie Cundy and Stephen Leng on Fubar Radio, Ricci admitted: 'I've been enjoying life too much. I'm gonna get back in the gym and get my eight pack back. I'll be real tasty again for the summer.\nScroll down for video\nMomentary lapse: Ricci Guarnaccio insists that he is not going down the favoured route of piling on the pounds ahead of a DVD release - blaming his fuller frame on 'enjoying life too much' instead\n'I will not be bringing out a fitness DVD!'\nWhile his different look was the main topic, Ricci couldn't resist taking a swipe at his former fiancée Vicky Pattison once again, lashing out at her 2014 book, Nothing But The Truth.\nHe said: 'It still burns us upside. That book was a pile of dog s**t. It coincided with me going into the Big Brother House.'\nThe interview comes after the reality star, 30, looked almost unrecognisable as he hit the beach in Sydney in just a pair of skimpy swimming trunks.\nCandid: Speaking to Lizzie Cundy, Ricci admitted: 'I'm gonna get back in the gym'\nWhile they once would have shown off his ripped abs, the barely-there budgie smugglers made way for the Geordie Shore alumni's heavier frame.\nThe former fiancé of Vicky Pattison looked unconcerned about his stomach as he sat on the sand and chowed down on a Big Mac before slurping on a soft drink.\nHe then looked full as he stood up and showed off his new frame in all its glory.\nDuring his stint on the MTV show, Ricci famously worshipped the gym and had the toned torso to prove it.\nGym fan: During his stint on Geordie Shore, Ricci famously worshipped the gym and had the toned torso to prove it - and he's determined to get it back\nHis physique was one of the qualities which caught the eye of then co-star Vicky Pattison, who he proposed to in 2012.\nThe pair had a tumultuous romance leading to their split the next year before they had an explosive showdown during the first series of Ex On The Beach in 2014.\nRicci has since relocated Down Under, where Geordie Shore has a massive following.\nAnd it seems he's pining for his previous shape - the star shared a snap of him looking lean and mean on Instagram this week, writing: 'Summer bod... on route!'\nMeanwhile, Ricci's ex Vicky has overhauled her own health and fitness and has built an empire on the back of it.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300490/Ricci-Guarnaccio-blames-fuller-frame-enjoying-life.html"}
