{"authors":["Breitbart News"],"date_download":"2018-10-30 21:32:07","date_modify":"2018-10-30 21:32:07","date_publish":"2015-09-18 15:55:04","description":"Richard Sherman's admonition to African Americans that \"we need to deal with our own internal issues before we move forward and start pointing fingers\" elicited a rebuttal from teammate Michael Bennett. |","filename":"data/vaneerConsumption/RichardShermanTeammateDisagreesSaysPeopleJustDontUnderstandBlackLivesMatter.json","image_url":"https://media.breitbart.com/media/2015/08/black-lives-matter-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_09_18__1540935127.html","title":"Richard Sherman Teammate Disagrees, Says 'People Just Don’t Understand' Black Lives Matter","title_page":"Richard Sherman Teammate Disagrees, Says 'People Just Don’t Understand' Black Lives Matter | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“We had a conversation about it,” the Seattle Seahawks defensive end says of a discussion of Black Lives Matter with Sherman. “His opinion is different from mine.”\nBennett explained at a media availability:\nOh yes, I was reading Richard Sherman’s quotes yesterday. I would like to say I disagree with some of the things that he said yesterday. I think when people talk about the black lives matter thing, I think he’s misinterpreting it, that black people kill black people, white people kill white people. People kill people every day.\nI think the black lives thing is more about the social injustice, not so much the injustice of people killing within the community, it’s about the social injustice of the people that is supposed to protect them,and building the community through the black community. Not just black people too, because you see a lot of people within the Black Lives Matters organization that are white, Spanish, they are all dealing with the same type of hardships that are going on around the world.\nI think sometimes people don’t take the time to look into what things really believe, or what’s really going on in the world, and I think when you say something and are in the position he is in, I think sometimes people take it and run with it. I think there are a lot of murders in a lot of communities, but a lot of time it deals with the segregation within the communities around the world. You look around, there is a white neighborhood, a black neighborhood, a Spanish neighborhood, instead of just calling them all American neighborhoods, or American communities. I think a lot of times people just get intertwined with different people and they don’t understand about what is going on in the world.\nI think black lives matter a lot, and I agree with the Black Lives Matter movement. And I think a lot of times of people just don’t understand the movement or things that are going on, and it’s all about education and things like that too.","url":"https://www.breitbart.com/sports/2015/09/18/richard-sherman-teammate-disagrees-says-people-just-dont-understand-black-lives-matter/"}
