{"authors":["Regina F. Graham For Dailymail.Com"],"date_download":"2018-10-22 20:48:56","date_modify":"2018-10-22 20:48:56","date_publish":"2016-01-29 04:04:19","description":"Award-winning actor Richard Dreyfuss has formed quite the opinion o fraudster Bernie Madoff since playing him in the upcoming ABC miniseries called Madoff.","filename":"data/vaneerConsumption/RichardDreyfussdoesntthinkBernieMadoffcaredwhenbothofhissonsdied.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30AFF54400000578-0-image-a-2_1454048306128.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422158_He-didn-t-hoot-hell-anybody-including-family-Actor-Richard-Dreyfuss-doesn-t-think-Bernie-Madoff-cared-sons-died_1540241336.html","title":"Richard Dreyfuss doesn't think Bernie Madoff cared when both of his sons died","title_page":"Richard Dreyfuss doesn't think Bernie Madoff cared when both of his sons died   | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Award-winning actor Richard Dreyfuss has formed quite the opinion of fraudster Bernie Madoff.\nDreyfuss is starring in ABC's Madoff mini-series as the former Nasdaq chairman who orchestrated one of the largest financial Ponzi schemes in American history.\nSpeaking at the Skirball Center premiere, the 68-year-old actor said that he thinks Madoff is a sociopath.\n'He was amoral,' Dreyfus told the New York Daily News. 'Most people don't realize that there's moral, immoral and amoral.\nScroll down for video\nAward-winning actor Richard Dreyfuss (left) is starring in ABC's Madoff miniseries as Bernie Madoff (right), who is the former Nasdaq chairman that orchestrated one of the largest financial Ponzi schemes in America\nSpeaking at the Skirball Center premiere, the 68-year-old actor said that he thinks Madoff (above after a court hearing in 2009) is a sociopath\n'He was not only amoral, he was a sociopath, which means that ultimately, if you scratch the surface, he didn't give a hoot in hell about anybody including his family.\n'Nothing. Nothing penetrated him. And I think when his sons died, he went, 'Oh, well.''\nHowever, a letter written by Madoff a year ago that was obtained by NBC News said that he endured a lot of pain when he lost his sons, Mark and Andy.\n'As difficult as it is for me to live with the pain I have inflicted on so many, there is nothing to compare with the degree of pain I endure with the loss of my son's (sic) Mark and Andy,' he wrote in January 2015.\nAndrew Madoff died after a long battle with lymphoma in September of 2014 at a New York City hospital. He was the last surviving son of Bernie Madoff. Above he is pictured in 2011\nMark Madoff (above) committed suicide in 2010, exactly two years to the day that his father was arrested\nHis son Mark committed suicide in 2010, exactly two years to the day Madoff was arrested. Andrew died after a long battle with lymphoma in 2014.\nDreyfuss, who is an Oscar winner, also said that he had friends who lost money thanks to Madoff.\nHe added that he thinks the imprisoned criminal did have compassion for one person - his wife.\n'I think he had one feeling, other than money, and that was for his wife,' Dreyfuss told the Daily News. 'He loved his wife.'\nIn an interview with NPR, Dreyfuss said that he thinks there's a little bit of Madoff in everyone.\n'Madoff is universally despised, as well he should be,' Dreyfuss told NPR. 'All you have to do is find that part of you that has been despicable, and you can find it if you look hard enough.'","url":"https://www.dailymail.co.uk/news/article-3422158/He-didn-t-hoot-hell-anybody-including-family-Actor-Richard-Dreyfuss-doesn-t-think-Bernie-Madoff-cared-sons-died.html"}
