{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 02:12:37","date_modify":"2018-10-23 02:12:37","date_publish":"2017-03-16 12:38:42","description":"Richard Wilson, 80, was looking happy and healthy as he stepped out in London on Thursday, enjoying a casual outing.","filename":"data/vaneerConsumption/RichardWilsonstepsoutforfirsttimesinceheartattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53FAF900000578-0-image-a-20_1489666325751.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320018_Richard-Wilson-steps-time-heart-attack_1540260757.html","title":"Richard Wilson steps out for first time since heart attack","title_page":"Richard Wilson steps out for first time since heart attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was left 'fighting for his life' following a heart attack last August.\nAnd Richard Wilson, 80, was looking happy and healthy as he stepped out in London on Thursday, enjoying a casual outing.\nThe One Foot In The Grave star, who has been taking it easy since the incident, was aided by a walking stick as he strolled along.\nScroll down for video\nRoad to recovery: One Foot In The Grave's Richard Wilson, 80, was aided by a walking stick as he was pictured looking happy and healthy after he was left 'fighting for his life' following a heart attack last August\nThe TV favourite as spotted out and about in North London with the help of a walking stick.\nWrapped up in a bright red padded jacket, the veteran comedic performer wore a scarf around his neck, and sported a purple jumper underneath.\nHe kept things comfy in a pair of loose slacks and trainers, and donned a pair of shades to avoid squinting his way through the sunny London spring weather.\nHe looked wonderfully healthy and smiled to himself has he crossed the street.\nBack on his feet: The Victor Meldrew actor was spotted out and about in North London with the help of a walking stick\nThe accident occurred right before he was due to bring Victor Meldrew back for a one man show at the Edinburgh Festival.\nFans were eagerly anticipating the one man show, given the fact that they never thought they'd see Victor alive again thanks to his One Foot In The Grave death.\nBut the sad turn of events saw the show cancelled, with Richard instead rushed to hospital after suffering a cardiac arrest.\nVeteran Scottish actor Richard Wilson, who was born in Greenock, Renfrewshire, is believed to be in a stable condition in hospital after suffering cardiac arrest\nAt the time, a source told The Sun: 'Richard had a really nasty fall and hit his head.\n'He was on life support in the hospital in the intensive care unit. He’s stable but very ill and in a serious condition. It’s been a very difficult time for his friends and family.'\nHis 86-year-old sister Moira told the Mirror: 'I am praying he’s OK. We haven’t seen each other. I can’t travel.'\nRichard, who was born in Greenock, Renfrewshire, had recently revealed he originally turned down his most famous role, playing Victor Meldrew in One Foot In The Grave.\nThe Scottish actor made his name playing the cantankerous protagonist but said he had to be talked into it because he thought he was too young for the part.\nHe told Radio Times: 'I was in my early 50s and Victor was 60. I turned it down.\n'I think Les Dawson was being considered. A very funny man but I don't know if he could have played Victor.'\nProducer/director Susan Belbin continued to pursue Wilson and, after reading more scripts, he was convinced.\nHe went on to play the pensioner at war with middle-class suburbia for five series from 1990 to 1995, before returning for a final run in 2000.\nHis 12-night run at the Edinburgh Fringe Festival was due to start on a matter of days before the heart attack took place.\nBut concerns about his health were raised when it emerged he had pulled out of the run of shows, with his agent then confirming he had been taken ill.\nWilson had planned to re-create writer David Renwick's script for a 1993 episode called The Trial, which sees Victor waiting in the house, on a rainy day, on call for jury duty.\nHalf an hour with Victor would have been followed by half an hour with Wilson himself, answering questions from the audience.\nThe actor promised fans that the OAP - known for the catchphrase 'I don't believe it!' - would not have mellowed with age.\nHe said: 'I think Victor is around 80 now. But I am playing him roughly 74.\n'He has not changed one bit. In fact, it's quite hard to get back to my normal, affable, lovable self after being him, even for half an hour.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320018/Richard-Wilson-steps-time-heart-attack.html"}
