{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 21:31:57","date_modify":"2018-10-30 21:31:57","date_publish":"2017-01-05 12:51:24","description":"Seahawks cornerback Richard Sherman has launched a boycott of the media. Well, he’s launched a boycott of all media not named Ed Werder. According to Curtis Crabtree of KJR and Pro Football Talk, Sherman said the media ticked him off, so from now on Sherman will only speak to ESPN’s Ed Werder, and on social media. | Sports","filename":"data/vaneerConsumption/RichardShermanSaysMediaTickedHimOffRestrictsNearlyAllMediaAccess.json","image_url":"https://media.breitbart.com/media/2016/12/richard-sherman.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_01_05__1540935117.html","title":"Richard Sherman Says Media Ticked Him Off, Restricts Nearly All Media Access","title_page":"Richard Sherman Says Media Ticked Him Off, Restricts Nearly All Media Access | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Seahawks cornerback Richard Sherman has launched a boycott of the media. Well, he’s launched a boycott of all media not named Ed Werder.\nAccording to Curtis Crabtree of KJR and Pro Football Talk, Sherman said the media ticked him off, so from now on Sherman will only speak to ESPN’s Ed Werder, and on social media. However, Sherman disputes the notion he’s boycotting the media. It sure sounds like it.\nThough Sherman’s reasoning for no longer talking to the media remains less of a mystery. Sherman came under scrutiny from the media two weeks ago for his loud, on-the-field criticism of Seahawks coaching staff, specifically over the team’s play calling in the red zone.\nAfter a recent press conference where he faced questions from the media for openly criticizing his coaches, Sherman threatened to “ruin” the career of a reporter by having his media pass pulled. Sherman then apologized on Twitter, citing his understanding of the role the media plays.\nThis makes his sudden boycott of the media very interesting. Did Sherman not tell the truth when expressing regret for getting angry and saying that he understood the role of the media? Or, did Sherman launch his boycott because the media has changed their role with him, hitting him with hard questions over his antics instead of acting like he can do no wrong?\nSomeone should ask him that question. I guess that someone would have to be Ed Werder.\nFollow Dylan Gwinn on Twitter: @themightygwinn","url":"https://www.breitbart.com/sports/2017/01/05/richard-sherman-says-media-ticked-him-off-restricts-nearly-all-media-access/"}
