{"authors":[],"date_download":"2018-10-30 01:06:55","date_modify":"2018-10-30 01:06:55","date_publish":"2014-08-16 00:00:00","description":null,"filename":"data/vaneerConsumption/RichardNixonwasnoBarackObama.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_08_richard_nixon_was_no_barack_obama_1540861615.html","title":"Richard Nixon was no Barack Obama","title_page":"Richard Nixon was no Barack Obama","title_rss":"NULL","source_domain":"americanthinker.com","text":"Richard Nixon was no Barack Obama\nLike the antithesis of Jacob Marley's ghost, wrapped in chains and dutifully dragging his sins in lockboxes behind him, the Left -- once again -- has trotted out their perennial conservative go-to bogeyman, Richard Nixon, just in time to commemorate the 40th anniversary of his presidential resignation. Nixon might have been under the misconception that his resignation in 1974 or his successor Gerald Ford's subsequent pardon might have put an end to his disgraceful role in the cover-up of the botched burglary of the Democratic National Committee's office in the Watergate complex, but history has proven otherwise. Indeed, not even 20 years after his death has history stopped kicking Mr. Nixon around for his multitude of sins. One only need look to the Washington Post to recently see advertised five new books priced between $24.99 and $37.50 dollars peddling the promise of \"new, deeper\" accounts of presidential wrongdoing. Naturally, I refer to Nixon's -- not Obama's. Just for kicks, I stopped by my town's own small, local library and found eleven books addressing Nixon and Watergate. They were free for check-out, though apparently these volumes somehow don't cover the scandal quite so completely. Indeed, the term \"Watergate\" is so synonymous with political malfeasance and/or sexual scandal that variations on the word like Monica-gate and Weiner-gate are among dozens of others permeating our modern American cultural landscape. At present, there is so much corruption in play in the federal government that an umbrella term doesn't seem to cover it all: Obama-gate. From Obamacare to Fast and Furious to Benghazi-gate; to Snowden-gate, Bergdahl-gate and Border-gate; to IRS targeting, CIA spying and HHS corruption the list of scandals seems endless. In fact, there seem to be so many 'gates' that any one of them would, and did, doom any Republican administration. Nixon had his enemies list and, per Article 2 of the Articles of Impeachment, it was charged that he “endeavored to obtain from the Internal Revenue Service, in violation of the constitutional rights of citizens, confidential information contained in income tax returns for purposes not authorized by law, and to cause, in violation of the constitutional rights of citizens, income tax audits or other income tax investigation to be initiated or conducted in a discriminatory manner.” Such use of the IRS to target political adversaries, among other crimes, would have undoubtedly led to the removal of Mr. Nixon from office if he hadn't resigned first. If Lois Lerner had been around at the time, I suspect she would have happily fallen in line with the program. Even darker, while Nixon had his enemies list, Mr. Obama has his \"disposition matrix\" in which he orders the assassination of overseas Americans alleged to be terrorists without the due process of law. Is it just me that sees an eerie and shadowy parallel between what Nixon did then and what Mr. Obama is doing now?\nWhen seven years dead Jacob Marley made his spectral visitation to his corrupt business partner Ebenezer Scrooge on Christmas Eve, the purpose was to reform him; to save his soul. However, when the liberal press drags Mr. Nixon out of the grave to animate its pages they have no such noble intentions. Mr. Nixon now symbolizes the embodiment of hubris and political corruption in the American psyche. And, not incidentally, he is Republican. Therefore, when Richard \"I'm-not-a-crook\" Nixon makes his appearance, it is to subtly smear his fellow Republicans while also providing the perfect distraction to the far greater sins of our current leaders.","url":"https://www.americanthinker.com/articles/2014/08/richard_nixon_was_no_barack_obama.html"}
