{"authors":["Richard Kemp Former Commander Of British Forces"],"date_download":"2018-10-22 21:05:56","date_modify":"2018-10-22 21:05:56","date_publish":"2017-04-26 01:06:40","description":"If the allegations against law firm Leigh Day turn out to be true, it would be another appalling indictment of the legal profession and those who have made millions out of hounding British troops.","filename":"data/vaneerConsumption/RICHARDKEMPonthelawyershoundingBritishtroops.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F8E64D900000578-0-image-a-34_1493165111475.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445898_Lawyers-hound-troops-deserve-dock_1540242356.html","title":"RICHARD KEMP on the lawyers hounding British troops","title_page":"RICHARD KEMP on the lawyers hounding British troops | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Phil Shiner of Public Interest Lawyers led a witch-hunt against British troops in Iraq\nThere cannot be many more heinous crimes than helping to frame those who risk their lives for their country.\nIt takes a particularly warped mind to do such a thing — to assist our enemies in falsely accusing the bravest of soldiers of rape, murder and torture.\nIt takes an even more twisted mind to profit from drawing up such allegations to the tune of many millions of pounds.\nBut for the past decade, that’s exactly what some unscrupulous lawyers are accused of doing.\nThe one who’s been shamed, Phil Shiner of Public Interest Lawyers (was ever a firm more grossly misnamed?), led a witch-hunt against British troops in Iraq, making false claims they brutally and, in some cases, fatally ill-treated civilians.\nCharges\nEarlier this year, following the closure of his firm last summer, Shiner was finally struck off after being convicted of a string of professional misconduct charges.\nNow, Martyn Day of law firm Leigh Day is up against the Solicitors Disciplinary Tribunal — along with his colleagues Sapna Malik and Anna Crowther.\nThe firm faces 19 professional misconduct charges for the way it brought claims against British soldiers for supposed ‘war crimes’ in Iraq.\nOn Monday, the scale of its alleged wrongdoing was revealed by Tim Dutton QC, who is representing the Solicitors Regulation Authority.\n‘Over a period of more than seven years, Martyn Day, Sapna Malik and Leigh Day made and maintained allegations that soldiers in the British Army had murdered, tortured and mutilated innocent Iraqi civilians,’ said Mr Dutton.\n‘The allegations were false and should never have been advanced in public.\nFrom left: Anna Crowther, acting senior partner Russell Levy, Martyn Day, Sapna Malik and managing partner Frances Swaine from law firm Leigh Day, arriving at a Solicitors Disciplinary tribunal\n‘If the respondents had discharged their duties, British soldiers and their families would not have had to endure torment and years of worry arising from false allegations endorsed by solicitors and members of the profession, made not just in claims but to the world’s media.’\nAs if these claims were not shocking enough, the tribunal also heard that Martyn Day himself suspected some allegations were false.\nIt is alleged he expressed his concern that one client’s testimony ‘sounds like complete b******s’.\nLeigh Day and solicitors Martyn Day and Sapna Malik deny the 19 misconduct charges. Anna Crowther also denies one allegation of misconduct. The case for their defence will be heard in due course — and they may yet be proven innocent.\nBut if these allegations do turn out to be true, it would be another appalling indictment of the legal profession and those within it who have made millions out of hounding British troops for doing their duty.\nDay and his team earned their law firm nearly £10 million of taxpayers’ money by pursuing cases against the Ministry of Defence, and caused incalculable grief to those they accused.\nMartyn Day, faces being struck off if found guilty. Leigh Day faces 19 charges, which will be discussed during a seven-week disciplinary hearing\nAs a former soldier, I have some personal experience of such treatment. I should stress that what I went through is not on the same level as that endured by so many of our brave young men and women, but it at least gives me an idea of what they have experienced.\nOne day in 2000, I received a phone call out of the blue from the civilian police, who informed me they wished to question me for my suspected role in the killing of a leading republican when I was serving as a young captain in Northern Ireland in the late Eighties.\nAt the time of the call, I was in my late 30s and a lieutenant-colonel commanding a battalion of around 800 men. Despite my seniority and military experience, I was shocked. I knew I was innocent, but there’s always a fear people will think there is no smoke without fire.\nThe interview lasted three hours and I can assure you that being accused of murder is a deeply stressful experience. Above all, there is a huge worry it will affect your career, your marriage — your entire life.\nIn the end, I never faced any formal charges and the case was eventually dropped. So I can only imagine the sheer hell endured by the 1,500 soldiers who have been charged — and, in some cases, all but destroyed — due to the callous actions of the likes of Phil Shiner.\nThose outside the services can have little inkling of what a devastating impact such accusations have on soldiers, many of whom are already suffering from post-combat stress. The costly inquiries launched as a result of the allegations brought by Shiner, Day and their like involve soldiers being closely questioned, just as I was.\nSuch interrogations have a hugely divisive impact on the bonds of brotherhood that link those who fight together.\nTrust is essential, and it is fatally undermined if you are uncertain about what your comrades may have said about you to an investigator.\nAn Army unit that lacks trust among its members will lack morale and be weaker for it. The weaker the unit, the higher the casualties in combat.\nDevastating\nBut false allegations not only imperil soldiers’ lives through reducing their effectiveness.\nBy claiming so publicly and vehemently that troops are up to no good, hucksterish lawyers also play into the hands of terrorists and jihadis desperate to find ‘evidence’ that British soldiers are the fount of all evil.\nIf British troops are seen as a bunch of rapists and murderers, then it makes it easier for our enemies to radicalise potential recruits to their cause (pictured, a UK troop in Basra, Iraq)\nIf British troops are seen as a bunch of rapists and murderers, then it makes it easier for our enemies to radicalise potential recruits to their cause.\nWhen my regiment returned from Afghanistan, it held a parade through Luton. Signs labelled the soldiers ‘baby killers’.\nThese placards were the direct consequence of false allegations given the oxygen of publicity. Nothing could serve as a better recruiting sergeant for those who want to kill us.\nIt is no exaggeration, to my mind, to draw a direct line from Shiner to the murder of Drummer Lee Rigby in Woolwich in 2013, and of PC Keith Palmer in the Westminster Bridge attack last month.\nRichard Kemp was a former commander of the British forces in Afghanistan\nBut the buck does not stop with the lawyers. It goes much further. I also blame politicians, senior civil servants and senior Army officers, all of whom could have done more to prevent false allegations against our soldiers being taken seriously enough to launch inquiries that caused great harm.\nCrimes\nAnd let’s not forget that the millions earned by the likes of Public Interest Lawyers came from the public purse, so in essence, taxpayers were unwittingly funding cases based on false allegations against the very men and women who are paid to protect us all.\nThe Government could have stopped this, but it didn’t, so keen was it to show that we were as tough on the crimes supposedly committed by our troops as we were on those committed by our enemies. The people who paid the price for this muddled thinking were, of course, the soldiers.\nAgain, I say, Day and his team may well be found innocent — though I have no sympathy for them after the way they have treated our soldiers.\nAnd if they are found guilty, I believe Martyn Day should be at the very least struck off — just like Phil Shiner, who has now also declared bankruptcy — and face the full wrath of the law if the evidence exists to put him in the dock.\nReassuringly, the National Crime Agency last month confirmed that it had opened a ‘number of lines of inquiry’ into Shiner. And I dearly hope he is prosecuted — nothing would better boost the morale of our troops.\nFor, make no mistake, it is utterly criminal to falsely accuse our soldiers of committing murder and torture if the accusers knew such heinous claims to be false.","url":"https://www.dailymail.co.uk/news/article-4445898/Lawyers-hound-troops-deserve-dock.html"}
