{"authors":["Brittany Valadez For Dailymail.Com"],"date_download":"2018-10-23 01:35:39","date_modify":"2018-10-23 01:35:39","date_publish":"2016-01-28 15:57:43","description":"Rich Kids of Beverly Hills star EJ Johnson, 23, made quite the statement in a sheer ensemble while out for dinner at Craig's in West Hollywood with co-star Morgan Stewart, 27.","filename":"data/vaneerConsumption/RichKidsofBeverlyHillsEJJohnsonwearsseethroughensembleoverunderwear.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB09F300000578-0-image-a-8_1453991959457.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421064_Rich-Kids-Beverly-Hills-star-EJ-Johnson-wears-ensemble-black-underwear_1540258539.html","title":"Rich Kids of Beverly Hills' EJ Johnson wears see-through ensemble over underwear","title_page":"Rich Kids of Beverly Hills' EJ Johnson wears see-through ensemble over underwear | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has his own street style.\nAnd on Wednesday, Rich Kids of Beverly Hills star EJ Johnson, 23, made quite the statement in a sheer ensemble while out for dinner at Craig's in West Hollywood with co-star Morgan Stewart, 27.\nThe son of basketball legend Magic Johnson, 56, often wears eccentric outfits while filming his E! reality show or simply while out on the town.\nScroll down for video\nOut on the town: Rich Kids of Beverly Hills star EJ Johnson, 23, made quite the statement in sheer ensemble while out in West Hollywood. He was joined by co-star Morgan Stewart\nEJ paired a sheer top with matching bell bottom trousers, complete with small pleats, over pair of high-waisted underpants. .\nThe fashion forward reality star finished off the look with a black blazer and a Hermes Birkin bag, which is said to be worth around $100,000 .\nBold: EJ paired a sheer top with matching bell bottom trousers\nSince 2014, EJ has been one of the main cast members of the E! reality series, Rich Kids of Beverly Hills.\nThe show follows wealthy spawns of millionaires and billionaires in the 90210 area code including Dorothy Wang, 27, Morgan Stewart, 28, fiance Brendan Fitzpatrick, 27, and Jonny Drubel, 28.\nThe\nIn November 2015, Variety announced that the show had been renewed for a fourth season, featuring eight episodes.\nStyling it out: The reality star's black underwear was on show\nThe latest will widely follow the wedding prep of Morgan and Brendan, who became engaged in March of last year.\nAdditional story lines will highlight Dorothy's dating life, and Jonny's attempts at becoming a successful DJ.\nAs for EJ, who lost 180 pounds from gastric bypass surgery, the show will follow his venture into achieving work as a model and an actor.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421064/Rich-Kids-Beverly-Hills-star-EJ-Johnson-wears-ensemble-black-underwear.html"}
