{"authors":["Belinda Grant Geary For Daily Mail Australia"],"date_download":"2018-10-22 23:44:31","date_modify":"2018-10-22 23:44:31","date_publish":"2016-01-11 07:22:45","description":"A man who is wanted by police has not been seen or heard from since he swam out into the ocean in the middle of the night after officers approached him on a Noosa beach, on the Sunshine Coast.","filename":"data/vaneerConsumption/RickyGardnerevadespolicebyrunningintotheseaanddisappearingintothesurf.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005A89300000578-0-image-a-143_1452496517139.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393489_Wanted-man-evades-police-running-ocean-disappearing-surf-authorities-try-work-drowned-run_1540251871.html","title":"Ricky Gardner evades police by running into the sea and ‘disappearing into the surf’","title_page":"Ricky Gardner evades police by running into the sea and ‘disappearing into the surf’ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"search but have not been able to find him\nA man who is wanted by police has not been seen or heard from since he swam out into the ocean in the middle of the night after officers approached him on the beach.\nPolice are unsure if Ricky Gardner, 37, made it out of the water after he attempted a daring escape from authorities at Main Beach in Noosa, on Queensland's Sunshine Coast, just after midnight on Saturday.\n'Police were engaging with Mr Gardner and during that conversation he has run away from them and swum out to sea,' Superintendent Darryl Johnson said on Monday.\nScroll down for video\nPolice are unsure if Ricky Gardner, 37, made it out of the water after he attempted a daring escape from authorities at Main Beach in Noosa after midnight on Saturday\n'Police lost sight of the person about 80 metres from shore,' he added.\nIt is not known if the 37-year-old was able to make it to shore or if he drowned.\nSupt Gardner said Mr Gardner is wanted on a number of outstanding warrants including one for his return to prison, which police suspect is the reason he fled.\nHe said water police, surf lifesavers and helicopters 'thoroughly' searched the area during the night and again the next morning but were unable to find Mr Gardener.\n'Police were engaging with Mr Gardner and during that conversation he has run away from them and swum out to sea,' Superintendent Darryl Johnson said\nPolice last saw Mr Gardner around 80 metres from shore and are unsure if he made it out of the water alive\nPolice found a 2001 Holden Commodore station wagon that was linked to Mr Gardner in New South Wales but ruled it out of the investigation into his disappearance after a member of the public came forward and said it had been there for some time.\nSupt Gardner said police have followed a 'number of inquiries' into Mr Gardner's whereabouts and believe if he made it back to shore he will be around the Sunshine Coast or Brisbane's south.\n'The primary objective for the Queensland Police at present time is to ensure that he is alive an safe and we can cease the resources looking in places that he is not,' he said.\nSupt Gardner said police have followed a 'number of inquiries' into Mr Gardner's whereabouts and believe if he made it back to shore he will be around the Sunshine Coast or Brisbane's south\nPolice found a vehicle tied to Mr Gardner in New South Wales but ruled it out of the investigation into his disappearance after a member of the public came forward and said it had been there for some time\nPolice said Mr Gardner is not dangerous, but have urged anyone who has seen him or who has information on his whereabouts not to approach him and contact police.\nMr Gardner is described as Caucasian, approximately 178 centimetres tall, slim build and has light complexion.","url":"https://www.dailymail.co.uk/news/article-3393489/Wanted-man-evades-police-running-ocean-disappearing-surf-authorities-try-work-drowned-run.html"}
