{"authors":["Danielle Gusmaroli For Daily Mail Australia"],"date_download":"2018-10-23 02:20:04","date_modify":"2018-10-23 02:20:04","date_publish":"2016-01-11 14:09:43","description":"Ricki-Lee Coulter and husband Richard Harrison watch a crocodile and bird show from the stands of Australia Zoo in Queensland on Saturday.","filename":"data/vaneerConsumption/RickiLeeCoulterandhusbandRichardHarrisonpullfunnyfacesatAustraliaZoo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300AA86D00000578-0-image-a-22_1452519781026.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393943_Ricki-Lee-Coulter-pulls-series-funny-faces-husband-Richard-Harrison-watch-crocodile-bird-Australia-Zoo_1540261204.html","title":"Ricki-Lee Coulter and husband Richard Harrison pull funny faces at Australia Zoo","title_page":"Ricki-Lee Coulter and husband Richard Harrison pull funny faces at Australia Zoo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She wowed fans as she took to the stage at Australia Zoo for a special performance at the weekend.\nAnd hours later on Saturday, it was singer Ricki-Lee Coulter's her turn to be entertained as she and husband Richard Harrison watched a crocodile and bird show at the Queensland Zoo.\nMouth gaping open, the 30-year-old singer whooped and cheered as she took in the spectacle from the edge of her seat in the stands on Saturday afternoon.\nScroll down for video\nIt's show time: Singer Ricki-Lee Coulter and husband Richard Harrison watched a crocodile and bird show from the stands of Australia Zoo in Queensland on Saturday\nLeaning forward she was keen not to miss a trick and at one stage removed her sunglasses to focus more on the show.\nIn one image she could not contain her excitement as she giggled excitedly.\nWearing a khaki wraparound dress over leggings, the songstress appeared relaxed and carefree as she made the most of the afternoon after taking centre stage herself earlier in the day.\nWhat's this? Keen not to miss a trick, she removed her sunglasses to focus more on the show\nWearing her hair twisted into a high bun, she was giggled with her beau as both sipped bottled mineral water.\nFor his part, Richard wore a black T-shirt and shorts and kept cool beneath a cap and behind dark sunglasses.\nEarlier in the day, Ricki-Lee entertained fans as she took to the stage at the zoo for a special performance which saw her cover up her all-black ensemble with a metallic coat.\nShe worked her way across the stage as she belted out a selection of her hits in the sleeveless, flowy outwear which was fastened by a belt around her waist.\nRiveted: The newlyweds were thrilled by the crocodile and bird show\nTaking to Instagram after her performance, she shared a snap of herself hugging a koala.\nThe thrilled singer captioned the image saying: ‘I had THE most amazing day at @australiazoo today!!!! I could've cuddled this little guy all day’.\nThe Raining Diamonds hitmaker then posted another picture of her and her niece and nephew posing alongside an echidna.\n'I could've cuddled this little guy all day': Taking to Instagram after her performance, she shared a snap of herself hugging a koala\nShe then followed it up with a snap of herself holding a stunning blue and yellow Macaw bird named Queto.\nRicki-Lee and husband Richard Harrison were married in France last August and enjoyed an extended honeymoon sightseeing and tasting across Europe.\nSpeaking to Daily Mail Australia in an interview ahead of McHappy Day, she gushed: 'Going to Italy and eating pretty much nothing but pizza and pasta was definitely a shock to the system.\nClose and personal: The Raining Diamonds then posted another picture of herself and her niece and nephew with an echidna\nGetting all ruffled: She then followed it up with a snap of herself holding a stunning blue and yellow Macaw bird named Queto\n'But we'd wake up in the morning and Rich and I would go to the gym or I would go for a run around, whether we were in Milan or Lake Como, so I'd go for a run in the morning or go to the gym.\n'I think that was the most important thing, to wake up and get a workout in and then go and eat,' the fitness fanatic admitted.\nThe pair are as loved up as ever, posting smitten snaps across social media as they shared their first Christmas together as man and wife.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393943/Ricki-Lee-Coulter-pulls-series-funny-faces-husband-Richard-Harrison-watch-crocodile-bird-Australia-Zoo.html"}
