{"authors":[],"date_download":"2018-10-30 21:59:54","date_modify":"2018-10-30 21:59:54","date_publish":"2016-02-24 11:55:25","description":"Austria hosts talks Wednesday with countries along the well-trodden migrant path through the western Balkans to northern Europe.","filename":"data/vaneerConsumption/RiftsInEuropeAsGreeceProtestsAtAbsenceFromAustrianHostedBalkansMigrantTalks.json","image_url":"https://media.breitbart.com/media/2016/02/A-man-and-a-woman-help-a-child-board-a-train-as-migrants-and-refugees-prepare-to-travel-to-Serbia-after-crossing-the-Greek-Macedonian-border-near-Gevgelija-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_24__1540936794.html","title":"Rifts In Europe As Greece Protests At Absence From Austrian-Hosted Balkans Migrant Talks","title_page":"Rifts In Europe As Greece Protests At Absence From Austrian-Hosted Balkans Migrant Talks","title_rss":"NULL","source_domain":"breitbart.com","text":"Austria hosts talks Wednesday with countries along the well-trodden migrant path through the western Balkans to northern Europe, as tighter border controls raise fears of a humanitarian crisis, particularly in Greece.\nBut Athens has angrily protested at being excluded from the ministerial meeting in Vienna, underscoring the rifts in Europe over how to tackle the crisis.\nThe talks come after figures showed that Europe’s migrant headache was continuing to rage, with over 110,000 people arriving in Greece and Italy so far this year alone, following more than one million in 2015.\nAccording to the International Organization for Migration, 31,000 of this year’s arrivals were fleeing the Syrian civil war. A total of 413 people lost their lives on the journey, including 321 on the way to Greece.\nThe influx has fuelled unease in Europe, boosted populist parties, driven a wedge among many of the 28 members of the European Union and thrown into doubt the continent’s cherished passport-free Schengen Zone that is crucial for commerce.\nAmnesty International hit out Wednesday at Europe’s “shameful” response, saying most EU countries had “simply decided that the protection of their borders is more important than the protection of the rights of refugees”.\nWith all EU attempts so far failing to halt the influx, countries through the western Balkans from Greece, as well as Austria, have begun unilaterally to impose border restrictions.\nIn the latest such move, Macedonia has closed its frontier to Afghans and introduced more stringent document checks for Syrians and Iraqis seeking to travel to northern and western Europe.\nThe move caused a bottleneck at the Greek-Macedonian border — where nearly 4,000 people were waiting to get through on Tuesday — and forced Greek police to keep hundreds of others from travelling to the frontier.\nOn the Greek side, Afghan families boarded nearly a dozen buses for the long trip back to the capital, where they will be temporarily housed in relocation camps, police said.\nSkopje said its move followed decisions by countries further up the western Balkan migrant route to turn back groups of Afghans, while Serbia announced a similar stance.\n“There is no sense in expecting Serbia to agree to receive migrants about whom we receive clear signals from Austria, Slovenia and Croatia that they will not be allowed in these countries,” Serbian Interior Minister Nebojsa Stefanovic said.\n– ‘Chaos and confusion’ –\nEU migration commissioner Dimitris Avramopoulos and Dutch Migration Minister Klaas Dijkhoff said they were “concerned” by developments in the Balkans and by the “humanitarian crisis that might unfold”.\nTheir fears were echoed by Filippo Grandi, the new head of the UN refugee agency UNHCR on a visit Tuesday to the Greek island of Lesbos, a main landing point after the perilous sea crossing for migrants from Turkey.\n“I am very worried about the news that we are getting about increasing closures of European borders along the Balkans route because that will create further chaos and confusion,” Grandi said.\nCash-strapped Greece, struggling to cope as the main entry point for migrants into the EU, was however not invited to the Vienna meeting of ministers from Albania, Bosnia, Bulgaria, Croatia, Kosovo, Macedonia, Montenegro, Serbia and Slovenia.\n“Through this one-sided and not at all friendly move towards our country, there is an attempt to take decisions in Greece’s absence that directly affect Greece and Greek borders,” the Greek foreign ministry complained.\nAustria, which controversially last week imposed a daily limit of 80 asylum claims, retorted that it was a “fixed” meeting format and its summary would be available to EU interior and justice ministers when they meet on Thursday in Brussels.","url":"https://www.breitbart.com/europe/2016/02/24/rifts-in-europe-as-greece-protests-at-absence-from-austrian-hosted-balkans-migrant-talks/"}
