{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:23:26","date_modify":"2018-10-30 18:23:26","date_publish":"2018-08-09 16:31:55","description":"Far left website Salon credited Jared Holt of Right Wing Watch, along with Matt Rivitz's anti-conservative harassment campaign Sleeping Giants, for catalyzing the purge of Alex Jones and Infowars from major tech platforms earlier this week.","filename":"data/vaneerConsumption/RightWingWatchAuthorIWasJealousthatSpotifyRejectedMyPodcastandNotInfowars.json","image_url":"https://media.breitbart.com/media/2018/08/jared-holt-cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_09__1540923806.html","title":"'Right Wing Watch' Author: I Was Jealous that Spotify Rejected My Podcast and Not Infowars'","title_page":"'Right Wing Watch' Author: I Was Jealous that Spotify Rejected My Podcast and Not Infowars' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Far left website Salon credited Jared Holt of Right Wing Watch, along with Matt Rivitz’s anti-conservative harassment campaign Sleeping Giants, for catalyzing the purge of Alex Jones and Infowars from major tech platforms earlier this week. Holt’s involvement appears to be motivated by jealousy — he stated, “I guess I was a little bit offended that Alex Jones was able to get on the air and I wasn’t.”\n“The timing isn’t random. In recent weeks, a group of progressive activists has dialed up efforts to pressure these distribution platforms to drop Infowars” wrote Salon author Amanda Marcotte. “That pressure, which comes at a time when court proceedings against Jones have finally begun in earnest, created the momentum that led to this decision.”\nHolt explained to Salon that he decided to target Spotify first because he was “offended” that he had to work to get his podcast listed on the platform.\nWhen I found Infowars, I was surprised — mostly because of my own experience as someone who has a podcast, aside from my work with Right Wing Watch. I experienced a personal struggle to get Spotify to list my own podcast. I guess I was a little bit offended that Alex Jones was able to get on the air and I wasn’t.\nThe left-wing activist explained that he was aided by Sleeping Giants, a previously-anonymous and unaccountable harassment campaign aimed at smearing conservative websites and harassing their advertisers, in his mission to get Infowars kicked off the platform. Sleeping Giants previously led campaigns aimed at cutting off advertising revenue from Breitbart News, The Rebel Media, and Laura Ingraham. The campaign regularly smears conservatives and conservative websites as “white supremacist.”\nHolt hinted that InfoWars would not be the end of his campaign for greater tech censorship, and that “the problem is bigger than Infowars.”\nIt’s reassuring to see them finally take action. I think it’s a little unfortunate that it took a public outrage campaign to do it, but ultimately I think it’s a step in the right direction. I hope these platforms realize that the problem is bigger than Infowars and that users are counting on them to follow through with the promises they made to counter this kind of misinformation.\nAllum Bokhari is the senior technology correspondent at Breitbart News. You can follow him on Twitter, Gab.ai and add him on Facebook. Email tips and suggestions to allumbokhari@protonmail.com.","url":"https://www.breitbart.com/tech/2018/08/09/far-left-media-credits-jared-holt-sleeping-giants-with-infowars-purge/"}
