{"authors":[],"date_download":"2018-10-30 14:07:30","date_modify":"2018-10-30 14:07:30","date_publish":"2018-07-27 00:05:35","description":"In the referendum known as Proposition A, voters will have the final word on whether Missouri does, or does not, enact right-to-work (RTW) legislation.","filename":"data/vaneerConsumption/RighttoWorkinPerilintheShowMeState.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/RighttoWork2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908450.html","title":"Right to Work in Peril in the Show-Me State","title_page":"Right to Work in Peril in the Show-Me StateThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The most closely watched contest in the Aug. 7 elections in Missouri will not be any of the political races; it will be the resolution of an important policy question. In the referendum known as Proposition A, voters will have the final word on whether Missouri does, or does not, become the nation’s 28th state to enact right-to-work (RTW) legislation.\nMissouri has a RTW law — passed by the Missouri Legislature and signed by the governor in early 2017. It was supposed to take effect on Aug. 28, 2017. However, on Aug. 18, organized labor groups collected enough signatures to give voters the choice of implementing the law (with a “yes” vote on Prop A) or rejecting it (with a “no” vote). A simple majority wins.\nAt a labor rally in St. Louis on June 23, AFL-CIO President Richard L. Trumka joined with other labor leaders in proclaiming that RTW would set off a “race to the bottom” for all workers, not just union members. He said: “Proposition A will lower wages, destroy jobs, (and) increase poverty.”\nNaturally, no union boss who can limit the supply of labor to members of his own union wants to give up control over the labor market. Who wants competition — when you are in the cushy position of not having to compete? But the idea that competition is bad for growth and job creation is complete nonsense.\nIn fact, RTW states have consistently outperformed forced-union states in job growth, personal income growth, and economic growth. That’s not a matter of opinion; it comes from hard data provided by three federal bureaus (Census, Labor Statistics, and Economic Analysis) over the ten-year period from 2004 to 2014.\nDuring this period, average job growth in the 22 states with RTW laws in place for most or all of that period was more than twice as fast (at 9.1 percent) as in the 28 forced-union states. The RTW states also had considerably faster growth in personal income (at 54.7 percent compared to 43.5 percent), and much stronger economic growth (50.7 percent compared to 38.0 percent).\nAnd there were other ancillary benefits, including faster population growth — more than double that of forced-union states. From 2004 to 2014, many Americans voted with their feet in moving into RTW states and out of forced-union states.\nIt is not just employers who benefit from right to work. It is anyone and everyone who seeks employment. Compulsory unionization represents an unfair and counterproductive abridgement of the freedom of people to offer their services to the highest bidder; they are locked out of an opportunity because a union has been granted a broad monopoly over the supply of labor.\nHow Compulsory Unionization Helped to Put U.S. Automakers on the Road to Ruin\nThe devastation that befell the U.S. auto industry during and after the 1980s exemplifies the adverse consequences that ensue when companies are kept from responding to market forces as a result of compulsory unionization, forced to pay an artificially high price for labor, and forced to absorb “legacy” costs (health care and pensions) they cannot possibly afford over the long run.\nDuring the Great Recession of 2008-2009, two of the three big automakers — GM and Chrysler — would have collapsed but for government bailouts totaling billions of dollars of taxpayer money. Meanwhile, Toyota and other foreign manufacturers that had opened plants in RTW states continued to perform well without bailouts.\nIn an article in Forbes on May 28, 2009 (“They Can Build Them; Why Can’t We?”), Jerry Flint observed:\nToyota solved its problems, while the Detroit automakers collapsed. One reason: the unions. The Detroit auto plants are all unionized (United Auto Workers), and union stewards are on the company payroll at every car plant, at a cost of millions of dollars. The UAW works to keep the production down. One transplant manager who used to work for Detroit figures that his people were working 10% faster than at a Detroit plant. Detroit pay and benefits ran about $55 an hour, vs. an average of $45 for the transplants. Those “legacy” costs — health care and pension payments to retirees — added another $16 an hour to the domestics’ costs. So Detroit’s total labor runs about $70 to $75 an hour, vs. $49 for Japanese transplants.\nIn 2012, Michigan — the state that gave birth to the United Auto Workers union — became the 24th state to adopt RTW. Gov. Rick Synder said that he believed that the legislation would lead to “more and better jobs for Michiganders.”\nUpcoming Missouri Election\nThat is not to say that voters in Missouri will follow the example of Michigan and other RTW states. According to a recent report from the Missouri Ethics Commission, anti-RTW forces have raised more than $5.4 million during the last quarter — or more than three times as much as the three groups campaigning in favor of RTW over the same period. According to a story in the Columbia Missourian, the money has flooded into Missouri from out-of-state unions from New York to California.\nAccording to a recent poll, only 34 percent of Missouri voters said they would vote “yes” on RTW against 59 percent who said they would vote “no.”\nAndrew B. Wilson, a long-time contributor to The American Spectator, is Resident Fellow and Senior Writer at the Show-Me Institute.","url":"https://spectator.org/right-to-work-in-peril-in-the-show-me-state/"}
