{"authors":[],"date_download":"2018-10-23 03:25:07","date_modify":"2018-10-23 03:25:07","date_publish":"2016-01-28 18:55:25","description":"Rihanna has called her long-awaited new album \"Anti\" and the name is fitting. The superstar has broken away from club tunes in favor of somber ballads on the...","filename":"data/vaneerConsumption/Rihannareturnsasvoiceofempowermentandnumbness.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h3xz-2vdWmEltwXfba0ce28e632bc3dfe-265_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421505_Rihanna-returns-voice-empowerment--numbness_1540265107.html","title":"Rihanna returns as voice of empowerment -- and numbness","title_page":"Rihanna returns as voice of empowerment -- and numbness | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rihanna returns as voice of empowerment -- and numbness\nRihanna has called her long-awaited new album \"Anti\" and the name is fitting. The superstar has broken away from club tunes in favor of somber ballads on the toughness needed, and caused, by bad love.\nRihanna's rollout of her first album in more than three years also ran \"anti\" to conventional wisdom on music promotion.\nShe signed a multimillion-dollar deal with Samsung which in November unveiled a site for its smartphones to build anticipation for \"Anti,\" which landed with a comparative sputter late Wednesday more than two months later.\nBarbadian singer Rihanna performs on the stage of the Stade-de-France in Saint-Denis, north of Paris, on June 8, 2013 ©Bertrand Guay (AFP/File)\nThe Barbados-born singer, whose R&B and dance pop has made her one of the 21st century's best-selling artists, is making her eighth album available exclusively for the first week on Tidal, the streaming site led by rap mogul Jay Z in which she holds a stake.\nRihanna put out a first single on Wednesday -- \"Work,\" a collaboration with star rapper Drake set to tropical house, the light-feeling electronica genre that has emerged in the past year as a top trend in dance music.\nBut \"Work\" is again an anti. Little else on the album carries a dance feel, with the album instead dominated by moody synthesized backdrops as Rihanna makes the most of the dark and deep low notes of her three-octave range.\nThe songs lyrically delve into the notoriously complicated romantic life of the 27-year-old, who finds herself alternating between empowerment and emotionally numbness.\nOn \"Needed Me,\" a mid-tempo ballad characteristic of the album, Rihanna warns a lover not to \"get it twisted\" as he tries to \"fix your inner issues with a bad bitch.\"\n\"You needed me / To feel a little more and give a little less / Know you hate to confess,\" she sings.\nOn \"Never Ending,\" Rihanna sings of how she \"can't feel my body now\" but concludes: \"It doesn't have to feel so strange to be in love again.\"\n\"Never Ending\" was co-written by Dido and musically bears resemblance to the British singer's 2000 hit \"Thank You.\"\nRihanna makes an unexpected choice for a cover with \"Same Ol' Mistakes,\" picking not a classic but a song released just last year by the Australian psychedelic rockers Tame Impala that explores how difficult it can be to turn a new personal page.\n- Message to Chris Brown? -\nRihanna broke into the music industry while just a teenager after she was discovered by the American producer Evan Rogers when he was vacationing in Barbados.\nAfter her 2005 debut, she put out albums almost annually for the next seven years and has triumphed commercially, becoming the only artist ever to sell more than 100 million singles digitally.\nBut Rihanna's personal life came under intense scrutiny in 2009 when she canceled her performance at the Grammy Awards after being beaten by her then boyfriend, rapper Chris Brown. She later resumed a relationship with Brown even though he pleaded guilty to a felony assault.\nOn \"Anti,\" Rihanna questions herself over her persistent pull to Brown on \"Love on the Brain\" -- the title perhaps a play on his song \"Heart Ain't a Brain.\"\n\"It beats me black and blue but it fucks me so good / And I can't get enough,\" Rihanna sings, in a powerfully ascending ballad with echoes of Al Green or Prince.\n\"Must be love on the brain / And it keeps cursing my name,\" she sings.\nYet Rihanna shows a bolder side on \"Woo\" -- a collaboration with rapper Travis Scott, with whom she has been more recently linked romantically.\nAs in much of \"Anti,\" Rihanna describes a lifestyle of ample drugs and drink -- and she wonders just how much her lover is consuming.\n\"Tell me how you think without the drugs,\" she sings.\nThe song ends with Rihanna and Scott singing together but with a sense of complete independence: \"I don't even really love you / I don't even really care about you.\"\nRapper Drake and singer Rihanna perform in Los Angeles on February 20, 2011 ©Kevork Djansezian (Getty/AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3421505/Rihanna-returns-voice-empowerment--numbness.html"}
