{"authors":["Karishma Sarkari For Daily Mail Australia"],"date_download":"2018-10-23 01:40:25","date_modify":"2018-10-23 01:40:25","date_publish":"2016-01-28 16:02:27","description":"Rihanna's long-awaited eighth studio album dropped on Thursday with one very unexpected surprise.","filename":"data/vaneerConsumption/RihannasnewalbumANTIfeaturescoverofTameImpalassong.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB596B00000578-0-image-a-58_1453995924706.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421085_Rihanna-s-new-album-ANTI-features-cover-Tame-Impala-s-song_1540258825.html","title":"Rihanna's new album ANTI features cover of Tame Impala's song","title_page":"Rihanna's new album ANTI features cover of Tame Impala's song | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rihanna's long-awaited eighth studio album dropped on Thursday with one very unexpected surprise.\nANTI, the RnB queen's follow-up to 2012's Unapologetic, was released for free via streaming service Tidal owned by her record company boss Jay Z, but that wasn't what surprised fans most about the offering.\nOn the album, the 27-year-old Bajan beauty covered a song by Australian psych-rock band Tame Impala, called New Person, Same Old Mistakes.\nSurprise for fans! Rihanna released her new album ANTI on Thursday with the free album downloads not the only surprise, with the 27-year-old covering a song by Tame Impala\nMake no Mistake, she's a fan! The RnB queen's rendition of the Australian psych-rock band's song New Person, Same Old Mistakes sits at number nine on the album\nThe track that closes out their Grammy-nominated 2015 release Currents, features at number nine on Ri-Ri's new release with a tweak to the title.\nListed as Same Ol' Mistakes, the song features a highly produced electro-pop sound that is very different to her first single off the album Work, featuring Drake.\nNo word yet on what Tame Impala's think of the version of their song, however, Daily Mail Australia has contacted the group for comment.\nAnother song set to appear on the soon-to-be released deluxe edition of ANTI, Goodnight Gotham, samples Florence and the Machine's Only If For A Night.\nSee more of the latest news and video updates on Rihanna's new album ANTI\nHighly ANTI-cipated! The singer dropped her long-awaited eighth studio album on streaming service Tidal a week ahead of it's general release\nCollaboration: Rihanna's first single off the album is her collaboration with Drake, called Work\nInterestingly for fans, the singer's biggest hits of last year didn't make the cut - with B**** Better Have My Money, American Oxygen and FourFiveSeconds (with Kanye West and Paul McCartney) all left off the track-list.\nRihanna's interpretation of the Tame Impala track is just the latest in a series of big wins for the band from Perth.\nKevin Parker, Jay Watson, Cam Avery, Dominic Simper, Julien Barbagallo and Nick Allbrook collected five trophies at the Australian Record Industry Association (ARIA) Awards in November.\nWinning big! The band won five Australian Record Industry Association (ARIA) Awards last November\nThey won Album of the Year for Currents, Best Group and Best Rock Album among others.\nNext month, the group's third studio album will be up for a Grammy Award for best alternative album, going up against the likes of the Alabama Shakes, Bjork, My Morning Jacket and Wilco.\nThe 58th Annual Grammy Award winners will be announced on February 15 from the Staples Centre in Los Angeles.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421085/Rihanna-s-new-album-ANTI-features-cover-Tame-Impala-s-song.html"}
