{"authors":["Justin Enriquez","Jj Nattrass For Mailonline"],"date_download":"2018-10-22 20:30:37","date_modify":"2018-10-22 20:30:37","date_publish":"2016-01-29 01:57:42","description":"The 27-year-old singer gave away new record ANTI 1 million times in just 14 hours via Samsung and Tidal on Wednesday and Thursday.","filename":"data/vaneerConsumption/RihannasalbumANTIreaches1mfreedownloadsafterJayZsTidalleaksLP.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30A84E3100000578-0-image-a-5_1454032547223.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422053_Rihanna-s-album-ANTI-reaches-1-million-free-downloads-14-hours-Jay-Z-streaming-service-Tidal-accidentally-leaks-LP_1540240237.html","title":"Rihanna's album ANTI reaches 1m free downloads after Jay Z's Tidal leaks LP","title_page":"Rihanna's album ANTI reaches 1m free downloads after Jay Z's Tidal leaks LP | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She decided to give away her album for free after it was leaked by streaming service Tidal.\nAnd Rihanna's fans certainly seem to be enjoying the gift.\nThe 27-year-old singer gave away new record ANTI 1 million times in just 14 hours via Samsung and Tidal on Wednesday and Thursday.\nFans had the opportunity to receive the album for free after a tweet from the Diamonds hit maker included a promo code.\nScroll down for video\nHitting the high notes: Rihanna's new album reached 1 million downloads in 14 hours after giving her new album ANTI away for free via collaboration with Samsung and Tidal on Wednesday\nPosting a picture of ANTI's now well-known artwork, the singer announced the move to her fans (the navy), writing: 'A gift to my navy! #ANTI is available right now!!!'\nThe promotion is now over after hitting the mark but ANTI can still be downloaded through the streaming service.\nFans hoping for even more Rihanna will be pleased to know that she officially released the deluxe version of the album on iTunes with three bonus songs including Goodnight Gotham, Pose and Sex With Me.\nThis comes just after Rihanna's eighth studio album began streaming in full on Jay Z's Tidal, apparently by mistake on Wednesday evening - just hours after the singer had debuted new single, Work.\nSee Rihanna updates as album ANTI reaches 1 million free downloads in 14 hours\nOops! After months of careful teasing and a hyped build up the 27-year-old singer's new record was unceremoniously leaked by streaming service Tidal\nThe decision to release ANTI for free appears to have been made following the accidental Tidal leak, as despite taking the songs down pirated versions had already been copied and digital versions were surfacing online.\nSoon after the mistake became evident Tidal made the album officially available for purchase with all thirteen songs ready for download.\nDailyMail.com has reached out to reps for both Rihanna and Roc Nation for comment.\nOOPS! Thirteen songs from Rihanna's eighth studio album began streaming on Jay Z's Tidal apparently by mistake on Wednesday evening, just hours after the singer had debuted new single, Work\nOne Twitter user wrote upon the official release: 'Tidal f***ed up the initial upload but a two hour leak isn’t bad at all. Gotta give em that.'\nANTI - TRACKLISTING 1. Consideration - featuring SZA 2. James Joint 3. Kiss it Better 4. Work - featuring Drake 5. Desperado 6. Woo 7. Needed Me 8. Yeah. I Said It 9. Same Ol' Mistakes 10. Never Ending 11. Love On The Brain 12. Higher 13. Close To You\nEarlier that same morning, the chart-topping singer finally unveiled the first track from her latest offering.\nTaking to her social media sites on Wednesday, the singer uploaded the link to her new song - Work, featuring Drake - alongside the cover photo, which sees the star posing topless.\nShe captioned the smouldering image: ‘FIRST SINGLE #WORK ft. @champagnepapi from #ANTI out now.’\nThe artwork sees the superstar flashing a glowing smile, while her hands were placed delicately over her face, and with her arms squeezed on to her ample assets.\nFollowing the post, the Umbrella hitmaker's song immediately shot straight to number one in 70 countries worldwide.\nAmongst Rihanna's own work on her eighth studio album, she has also reworked Tame Impala's New Person, Same Old Mistakes, titling the track, Same Ol' Mistake.\nSee more of the latest on Rihanna as she unveils her first track from her album ANTI\nA teaser: Just hours before the leak, Rihanna uploaded a teaser video for the final door of her ANTIdiary, which saw the singer rocked an imperial yet edgy look - wearing a gold crown and black leather dress\nQueen of the night: Seen clambering on to a bed to lay next to a sleeping child, the singer carefully lays her head down so as not to wake the sleeping youngster before staring wistfully up at the moon through a skylight\nRIHANNA - ALBUM SALES Music Of The Sun (2005): 2m worldwide A Girl Like Me (2006): 4m worldwide Good Girl Gone Bad (2007): 3m worldwide Rated R (2009): 3m worldwide Loud (2010): 8m worldwide Talk That Talk (2011): 5.5m worldwide Unapologetic (2012): 4m worldwide\nShe also collaborates with singer-songwriter SZA, real name Solana Rowe, on opening track Consideration.\nFor fans wishing to get their hands on a physical copy of ANTI, the album will be available to purchase on February 5.\nJust hours before the leak, Rihanna uploaded a teaser video for the final door of her ANTIdiary.\nSharing the news in a slick video clip on her Instagram, the singer rocked an imperial yet edgy look, as she donned a gold crown and black leather dress, which featured tassled detailing.\nSeen clambering on to a bed to lay next to a sleeping child, the singer carefully lays her head down so as not to wake the sleeping youngster.\nCutting to a shot of the moon through a skylight, she can be seen staring witfully up at the pale globe in the night sky, before the video cuts to a promotion clip fro the ANTIdiary website.\nThe wait is over! Rihanna, 27, revealed that she's finally finished her eighth album, Anti, in spectacular fashion, posting a snap of herself wearing an opulent gold crown and bedazzled headphones\nLong awaited: Rihanna revealed the artwork for her album at the AMA Gallery back in October, but kept fans waiting as the LP was originally expected for release in November\nThe EX factor: Rihanna has reunited with her former flame Drake (pictured performing at the 2011 Grammy Awards) for her latest track, Work\nEarlier this week, Rihanna took to Twitter to share the news that the album was finally finished in spectacular fashion - it was originally scheduled to be dropped in November.\nWearing an opulent Dolce & Gabbana gold crown and bedazzled headphones - worth a staggering $8,895 – the singer oozed heaps of style and glamour in the teasing picture.\nGazing seductively down the lens, the Bajan beauty appeared to be deep in concentration as she listened to the new tracks.\nWith her raven coloured locks left loose and tousled down her shoulders, the star's décolletage was on display, suggesting she had either gone topless or chosen a strapless outfit for the selfie.\nRihanna last released an album in 2012, the critically acclaimed, Unapologetic. But she has been teasing her new material for several weeks with her #ANTIdiaRy campaign.\nSee you later: Rihanna was pictured giving her friend a hug goodbye as she leaves the Sunset Marquis hotel in West Hollywood, California on Wednesday\nLots to celebrate? She appeared to be in high spirits as she wore a big smile on her face\nBubbly: She got down on one knee at one point as she and a friend bonded over a glass of champagne\nLoving life: She appeared to be in deep conversation as she was surrounded by a group of people\nPosting several clips of herself unlocking different rooms, she's been keeping her fans updated with her progress.\nRecently she also revealed that her good friend Kanye West was no longer involved as the executive producer on her album.\nIn a Twitter exchange with a fan, she wrote: 'FYI Kanye is not EPing Anti!!! We’re both working on our own projects right now!'\nWorth the wait? Rihanna last released an album in 2012, the critically acclaimed, Unapologetic. But she has been teasing her new material for several weeks with her #ANTIdiaRy campaign\nThe rapper is currently working on his own album, Swish, which is due to be released in February.\nMeanwhile, Rihanna has a busy few months ahead of her, as she'll be joining Coldplay for their Super Bowl half-time show on February 7th.\nThe week after, on the 15th, the Diamonds hitmaker is also believed to be performing in front of her peers at the Grammy Awards.\nWith just a few days rest in between, the star will then kick off her Anti World Tour on February 26 in San Diego, California which will last for six months and see RiRi perform for 69 shows.\nReady to play! Meanwhile, Rihanna has a busy few months ahead of her, as she'll be joining Coldplay for their Super Bowl half-time show on February 7th, as revealed in the sizzling CBS promo video","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422053/Rihanna-s-album-ANTI-reaches-1-million-free-downloads-14-hours-Jay-Z-streaming-service-Tidal-accidentally-leaks-LP.html"}
