{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 02:05:05","date_modify":"2018-10-23 02:05:05","date_publish":"2016-01-29 16:24:38","description":"Her new album was downloaded 1million times within 14 hours of its release. And while Rihanna didn't make a penny from it, there was still plenty of cause for celebration on Thursday","filename":"data/vaneerConsumption/RihannaandJustinBieberleave1OAKaftercelebratingthereleaseofnewalbum.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B4053D00000578-0-image-a-14_1454083764468.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423069_Rihanna-Justin-Bieber-leave-1OAK-West-Hollywood-celebrating-release-new-album_1540260305.html","title":"Rihanna and Justin Bieber leave 1OAK after celebrating the release of new album","title_page":"Rihanna and Justin Bieber leave 1OAK after celebrating the release of new album | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her new album was downloaded 1million times within 14 hours of its release.\nAnd while Rihanna didn't make a penny from it, there was still plenty of cause for celebration on Thursday night.\nThe 27-year old was spotted partying with Justin Bieber at West Hollywood hot spot 1Oak for a friend's private birthday party the night of ANTI's unveiling.\nScroll down for video\nLaunch party: Rihanna and Justin Bieber were both spotted leaving 1OAK in West Hollywood after celebrating at a private birthday party on Thursday night\nDespite both wearing baseball caps it didn't take fans outside long to figure out who was emerging from the club.\nThe pair were swarmed by followers - or as swarmed as their minders allowed - as they left the celeb haunt.\nJustin, with his unmistakable new platinum hair peaking out and neck tattoos on show, stopped to shake hands with a few admirers en route.\nRihanna surprised her fans when she gave away the eagerly awaited record for free, hours after it began streaming on Jay Z's Tidal service, supposedly by accident.\nSee Justin Bieber updates as he and Rihanna celebrate the release of her new album\nSpotted: Despite both wearing baseball caps it didn't take fans outside long to figure out who was emerging from the club\nNice guy: Justin, with his unmistakable new platinum hair peaking out and neck tattoos on show, stopped to shake hands with a few admirers en route\nAltruism: Rihanna surprised her fans when she gave away the eagerly awaited record for free, hours after it began streaming on Jay Z's Tidal service, supposedly by accident\nPosting a picture of ANTI's now well-known artwork, the singer announced the move to her fans - the navy - writing: 'A gift to my navy! #ANTI is available right now!!!'\nShe also officially released the deluxe version of the album on iTunes with three bonus songs including Goodnight Gotham, Pose and Sex With Me.\nOn Wednesday, the chart-topping singer finally unveiled the first track from her latest offering.\nVia her social media accounts, she uploaded the link to her new song - Work, featuring Drake - alongside the cover photo, which sees the star posing topless.\nNice view: The pair were previously spotted out together In 2011 at NBA All-Star Game at the Staples Center in LA\nGame on? They sparked romance rumours when they engaged in some heavy flirting while sitting next to each other courtside\nShe captioned the smouldering image: ‘FIRST SINGLE #WORK ft. @champagnepapi from #ANTI out now.’\nFollowing the post, the Umbrella hitmaker's song immediately shot straight to number one in 70 countries worldwide.\nIt's not the first time the Rihanna and Bieber have been spotted out together. In 2011 they sparked romance rumours when they engaged in some heavy flirting while sitting next to each other courtside at the NBA All-Star Game at the Staples Center in LA.\nBlonde: The 21-year-old debuted his new hairstyle when he rocked up to Bryson Tiller's concert at the Wiltern theater earlier that day\nHitting the high notes: ANTI reached 1 million downloads in 14 hours after its release via collaboration with Samsung and Tidal","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423069/Rihanna-Justin-Bieber-leave-1OAK-West-Hollywood-celebrating-release-new-album.html"}
