{"authors":[],"date_download":"2018-10-22 21:07:08","date_modify":"2018-10-22 21:07:08","date_publish":"2014-05-05 13:07:39","description":"Rhode Island officials have sent the equipment that failed during Sunday's Ringling Bros. show to a lab for analysis.","filename":"data/vaneerConsumption/RinglingBrosCircusAccidentInvestigatorsProbeSteelRing.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/419536/140504-hair-hanging-jms-2245_eff90c28512b63162caa59cfdf049a66.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_circus-accident_ringling-bros-circus-accident-investigators-probe-steel-ring-n97121_1540242428.html","title":"Ringling Bros. Circus Accident Investigators Probe Steel Ring","title_page":"Ringling Bros. Circus Accident Investigators Probe Steel Ring","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA mid-air platform holding eight circus performers came crashing down because one steel ring connecting the apparatus to a cable snapped, officials said Monday.\nThe cause of the failure is still under investigation, and investigators said the D-ring carabiner would be sent to a lab for analysis.\n\"It was a single piece of equipment that failed. It snapped,\" said Paul Doughty, an investigator for the Providence, Rhode Island, Fire Department.\nThe 5-inch long ring, which has three solid sides and one side with a spring-loaded and self-locking gate, was supposed to be able to hold 10,000 pounds.\nThe aerialists suspended by their hair and the circular platform — designed to resemble a \"human chandelier\" — together weighed only about 1,500 pounds.\nThe ring broke along its solid spine while the performers were 35 feet in the air during a morning show at the Dunkin' Donuts Center.\nAll of the women were badly injured, and a male performer on the ground was banged up when he was hit by the metal frame.\nCircus workers told investigators they visually inspected all the rigging, including the carabiner, before the show. Doughty said it's possible some structural weakness would not have been visible.\nHe declined to speculate on what might cause the ring to snap. Fire Chief Clarence Cunha said technicians at a lab should be able to solve the mystery.\n\"It's like CSI,\" he said.\nSteve Payne, a spokesman for Feld Entertainment, the parent company of Ringling Bros. and Barnum and Bailey, said the circus' own investigation has not been completed.\n\"It’s premature to go down that road and say whether that clamp was a contributing factor or not,\" he said.\nThe federal Occupational Safety and Health Administration is in charge of the probe, which scuttled the rest of the Providence dates for the Ringling Legends tour. Performances in Hartford, Connecticut, begin Thursday.\nFour of the acrobats are in serious condition and four are in good condition, hospital officials in Providence reported Monday night.\nTwo of them had surgery, including Widny Neves, 25, whose father told NBC News that it was a miracle everyone survived the collapse.\nThe fall was captured on video by a ticket-holder. It shows that after a curtain dropped, the performers began a ballet act while hanging from their hair about 35 feet from the floor.\nSeconds later, the platform dropped unexpectedly and the performers, who were working with no net, plunged to the floor with it.\nThe rigging for the show was designed by the troupe's founder, Andre Medeiros, whose wife was in the air and is among the injured.\nJeffrey Feld, the circus' chief executive, flew into Providence last night to meet with the victims and their families, Payne said.\n— Tracy Connor","url":"https://www.nbcnews.com/storyline/circus-accident/ringling-bros-circus-accident-investigators-probe-steel-ring-n97121"}
