{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 01:46:01","date_modify":"2018-10-23 01:46:01","date_publish":"2016-01-11 12:58:15","description":"Ringling Bros. and Barnum & Bailey Circus will permanently retire all its elephant acts to a Florida sanctuary in May - a year-and-a-half ahead of schedule.","filename":"data/vaneerConsumption/RinglingBrostoretireallitselephantsinMayayearandahalfearly.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DFDF900000578-0-image-a-2_1452541677704.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393831_Ringling-circus-elephants-retire-May_1540259161.html","title":"Ringling Bros. to retire all its elephants in May a year-and-a-half early","title_page":"Ringling Bros. to retire all its elephants in May a year-and-a-half early | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Circus brought forward retirement by a year-and-a-half ahead of plan to retire elephants by 2018\nDecision follows mounting public concern over treatment of the creatures and pressure from animal\nAfter more than a century, a famous American circus announced it will stop using elephants in its shows amid mounting concern over mistreatment of the animals.\nRingling Bros. and Barnum & Bailey Circus will permanently retire all its elephant acts to a Florida sanctuary in May - a year-and-a-half ahead of its plan to do so by 2018.\nThe decision follows decades of protest from animal rights groups who have campaigned for a ban on the use of wild animals for entertainment.\nScroll down for video\nAfter more than a century, a famous American circus announced it will stop using elephants in its shows (pictured) amid mounting concern over mistreatment of the animals\nRingling Bros. and Barnum & Bailey Circus will permanently retire all its elephant acts to a Florida sanctuary (pictrued) in May\nRingling Bros will continue to use other animals - such as lions, tigers, horses, camels, and dogs - in its performances.\nFeld Entertainment, the circus's parent company, said that the elephants now on tour will be sent to the company's Center for Elephant Conservation in central Florida.\n'They'll be joining the rest of the herd,' said Alana Feld, Ringling's executive vice president and show producer.\nLast year, Feld Entertainment, which owns the largest herd of Asian elephants in North America, had announced that its elephants would be phased out and eventually retired by 2018.\nOnce the company began planning, it realized it could retire the elephants a lot sooner, Feld said.\nIn recent years, some cities and counties have passed laws banning the use of elephants for entertainment, which has complicated the show's tours, company president Kenneth Feld.\nAfter more than a century, Ringling Bros. and Barnum & Bailey Circus has agreed to stop using elephants (pictured being lead from their enclosure to a rehearsal at the American Airlines Arena in Miami last week) in its shows amid mounting concern over mistreatment of the animals\nRingling Bros. and Barnum & Bailey Circus will permanently retire all its elephant acts to a Florida sanctuary in May - a year-and-a-half ahead of schedule\nCircus executives have always insisted that their methods were a humane way to guide the animals and did not inflict harm\nLast November, Hawaii became the first U.S. state to ban the use of elephants, bears and other exotic wild animals for entertainment purposes.\nAnimal right activists have long protested the use of the elephants in live shows, claiming they face physical abuse and suffer mentally.\nIn 1995, a documentary by ABC revealed circus trainers and animal handlers using metal 'bullhooks' to control elephants and teach them tricks.\nCircus executives have always insisted that their methods were a humane way to guide the animals and did not inflict harm.\nHowever, the People for the Ethical Treatment of Animals (PETA) have long argued that the use of elephants in the circus is cruel, and have accused Ringling of mistreating their animals.\nIn 2014, Feld Entertainment won $25.2 million in settlements from a number of animal-rights groups, including the Humane Society of the United States, ending a 14-year legal battle over allegations that Ringling circus employees mistreated elephants.\nPETA have welcomed the plans to retire the elephants many of which they claim are 'painfully arthritic' and carry TB.\nAlana Feld, Ringling Bros. and Barnum & Bailey Circus' executive vice president and show producer, said that all of the iconic elephants will be permanently retired to the company's 200-acre Center for Elephant Conservation in central Florida\nAnimal rights groups have campaigned for a ban on the use of wild animals for entertainment\nElephants Bonnie (L) and Kelly Ann are two of the Ringling Bros. and Barnum & Bailey Circus elephants to be retired in May\nThe gentle giants have been used for more than 100 years by the circus to perform tricks for the crowds\nProtesters say using wild animals for entertainment is wrong and the methods with which they are trained are cruel\nPresident Ingrid Newkirk said: 'Because of failing financial returns from a public that lost a taste for abusive elephant acts long ago and legislatures that are banning them on the grounds of cruelty, it's no surprise that Ringling Bros. will pull elephants off the road in May, 18 months earlier than announced.\n'Years of living in shackles, held immobile on concrete floors, has left many elephants lame and sick.'\nThe organisation is now calling on the circus to end all animal acts, 'particularly in light of video footage released last month showing how tigers are trained to perform.'\nElephants have been featured acts in Ringling's three-ring circuses for the last 145 years and are viewed as the highlight of the show.\nIn a statement announcing their plans to retire the animals. Feld Entertainment said it had not been 'an easy decision' and insisted it was 'in no way a validation of the attacks by animal rights groups.'\n'There's been somewhat of a mood shift among our consumers,' said Alana Feld, the company's executive vice president in March. 'A lot of people aren't comfortable with us touring with our elephants.'\nTrudy Williams washes down an Asian elephant named Icky at the Ringling Bros. and Barnum & Bailey Center for Elephant Conservation in Polk City, Florida","url":"https://www.dailymail.co.uk/news/article-3393831/Ringling-circus-elephants-retire-May.html"}
