{"authors":["Lisa Ryan For Dailymail.Com"],"date_download":"2018-10-23 05:02:07","date_modify":"2018-10-23 05:02:07","date_publish":"2016-01-29 20:49:21","description":"London surgeon, Dr Massimiliano Marcellino, told Dailymail.com penis enlargement ops are on the rise - with fast procedures that add an inch in girth and two in length.","filename":"data/vaneerConsumption/RiseofthelunchbreakpenoplastyOnehouropseessurgeonsinjectfatfromthelegsorstomachtoincreasegirthandtheycanalsoboostlengthwithaligamentsnip.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B50DCD00000578-0-image-a-12_1454098059332.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3423373_Rise-lunch-break-penoplasty-One-hour-op-sees-surgeons-inject-fat-legs-stomach-increase-girth-boost-length-ligament-snip_1540270927.html","title":"Rise of the lunch break penoplasty: One-hour op sees surgeons inject fat from the legs or stomach to increase girth (and they can also boost length with a ligament snip)","title_page":"Rise of the lunch break penoplasty: One-hour op sees surgeons inject fat from the legs or stomach to increase girth (and they can also boost length with a ligament snip) | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most men spend their lunch hour picking up a sandwich at the local deli.\nBut, others choose to spend their lunch break in a more ‘enhancing’ way.\nA one-hour procedure to increase the girth of a penis is becoming increasingly popular, Dr Massimiliano Marcellino, a London plastic surgeon, told Dailymail.com.\nMany men are opting for penis enhancing surgeries to increase their length, girth or both, a leading London plastic surgeon told Daily Mail Online. The girth-enhancing procedure takes an hour and involves injecting fat into the penis, while cutting a ligament can help add length to the penis\nThat procedure, called lipofilling, entails injecting fat from a patient's stomach or legs into the penis – adding one inch in circumference.\nLipofilling can also be performed alongside a penoplasty that increases the length of a penis by one to two inches.\nWith that procedure, the surgeon cuts a ligament in the penis, which allows it to drop and look longer.\nSO WHY ENHANCE YOUR PENIS?\nDr Marcellino told Daily Mail Online penis size has long been a 'significant factor' of male anxiety.\nHe said: ‘For many men seeking penis enlargement, particularly in special cases when the penis is just below the average size, they want to feel good naked in front of women or their partner.\n‘Some men also simply want to be able to shower in the changing rooms or gym without this playing on their mind.’\nAs a result, these surgeries are becoming more and more popular – even in men who have ‘normal-sized’ penises.\nWhen he first started offering penoplasty, Dr Marcellino noticed that only 50 per cent of patients he was seeing actually had small penises.\nAnd, while 30 per cent had penises within the normal range, they are often considered too small by the man themselves.\nFurthermore, 15 per cent had penises larger than average – and five per cent had what is medically considered ‘a micro-penis,’ the doctor said.\nWHAT DOES PENOPLASTY ENTAIL?\nLipofilling, the girth-boosting procedure, involves harvesting fat from the patient and then injecting it into the penis.\nDoctors can utilize platelet-rich plasma (PRP) – which is commonly used in facial rejuvenation – to increase a penis's girth, as well.\nWith lipofilling - the girth-enhancing procedure - platelet-rich plasma (PRP) are used. PRP takes blood from the patient and mixes it with growth factors and fat. The length-enhancing penoplasty involves cutting ligament in the penis, so that it can drop and look longer (File photo)\nPRP takes blood from the patient – with the plasma and platelets enriched with growth factors, mixed with fat.\nDr Marcellino explained that he uses stem cells in his penoplasty procedures – injecting them into the penis.\nThe doctor said: ‘Fat is the most abundant source of pluripotent stem cells that have the ability to convert to a number of different tissue types and hence they are so useful to tissue repair and regeneration.’\nIS PENOPLASTY WORTH IT?\nPenoplasty procedures to increase girth start from £4,500 ($6,400), according to Dr Marcellino.\nMeanwhile, penoplasty procedures for increased girth and length starts from £6,500 ($9,250).\nFurthermore, the PRP treatment is an additional £800 ($1,140) and bank storage of fat for top-up procedures £1,800 ($2,561).\nBut despite the hefty cost, Dr Marcellino also told Daily Mail Online that procedures to increase the length only have to be performed once – and are permanent.\nPenoplasty procedures for increased girth and length starts from £6,500 ($9,250). But despite the cost, the surgeon says the operation is worth it. The length procedure is permanent, while the girth one can last years\nYet, procedures to increase girth may only last up to a few years.\nDr Marcellino said: ‘On average you can expect results to last a few years.\n'However if the fat is reabsorbed, a straightforward top up treatment can be provided using the additional fat harvested and stored from the original procedure, which is a very quick procedure.’","url":"https://www.dailymail.co.uk/health/article-3423373/Rise-lunch-break-penoplasty-One-hour-op-sees-surgeons-inject-fat-legs-stomach-increase-girth-boost-length-ligament-snip.html"}
