{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:50:07","date_modify":"2018-10-30 22:50:07","date_publish":"2015-10-13 08:00:00","description":"HALF MOON BAY -- It’s a lovely place to do business. Ocean waves crash into rocky cliffs. Pelicans flap along the shoreline. And on the golf resort","filename":"data/vaneerConsumption/RiseoftheBusinessDemocrat.json","image_url":"https://calmatters.org/wp-content/uploads/golfcourse1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939807.html","title":"Rise of the Business Democrat","title_page":"Rise of the Business Democrat | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"HALF MOON BAY — It’s a lovely place to do business.\nOcean waves crash into rocky cliffs. Pelicans flap along the shoreline. And on the golf resort overlooking it all, a powerful bloc of legislators hit the links recently with donors who paid up to $40,000 for the opportunity to join them.\nThis was the annual fundraiser benefitting the legislators who call themselves “moderate Democrats.” Since last month, when the group unexpectedly killed a centerpiece of Gov. Jerry Brown’s climate change plan, the moderate Democrats have been getting much more scrutiny, particularly about those who pay for their elections and attend their fundraisers.\nSince 2013, the group’s political action committee has taken in more than $4 million, with nearly one-third of that coming from Chevron, PG&E and other oil and gas companies. Other major donors include Wal-Mart, a hospital association and a realtors group. Only 1 percent of the committee’s money came from labor unions.\nBy contrast, organized labor provided more than a quarter of the money the California Democratic Party raised in the same time period, and oil and gas companies made up about 6 percent. The liberal-leaning party, which also benefits from fundraisers at swanky golf resorts, has traditionally declined contributions from Wal-Mart because of its anti-union policies.\nThe business money to the moderate Democrat committee helped several candidates — like Assemblyman Jim Cooper (D-Elk Grove) — prevail last year over more liberal opponents. Cooper was critical of the governor’s failed climate change plan to cut fuel consumption in half by 2030, but he said money from business sources did not influence his decision.\n“I tell everybody: I’m not going to be with you 100 percent of the time,” Cooper said. “One day we’ll be together on a bill, another day we’ll be at odds.”\nOverall, the moderate Democrat committee has spent $2.3 million on campaign efforts since 2013 – more than half of it focused on five legislative races in the Central Valley, Orange County and Los Angeles. Voters elected three of the five candidates on which the committee spent the most in the last election — the other two seats went to Republicans.\nThe effort to elect moderate Democrats started more than a decade ago with Sacramento political consultant David Townsend. Back then, the Legislature had more Republicans and fewer centrist Democrats. The centrists complained to him that the party’s liberal wing wielded too much influence in the Capitol. So Townsend set up the political action committee that accepts unlimited donations from wealthy interests and spends the money urging voters to choose moderate Democrats.\nThe effort was helped in 2010 when voters approved an initiative that was designed to elect more moderates — a change Townsend spearheaded. Since then, the top two vote getters in the June primary move to the November general election even if they are from the same party.\nToday, Townsend’s committee is one of several that pour corporate dollars into campaigns for Democrats. But it wasn’t always that way.\n“When we started out, it was pretty lonely,” Townsend said, recalling that the moderate committee’s first fundraiser included just a half-dozen lawmakers and 25 donors. “Now when we have an event, we’ll have 25 or 30 legislators and over 100 people attending.”\nWhich brings us back to the seaside golf course an hour south of San Francisco, where Townsend’s committee raises money by inviting donors to mingle with lawmakers for two days each fall.\nOn Friday, an AT&T lobbyist golfed with two lobbyists from Sacramento’s highest-earning firm. Nearby, Assemblyman Jim Frazier (D-Oakley) chatted on a sunny patio. Assemblywoman Susan Bonilla (D-Concord) ate lunch at a table overlooking the ocean as Assemblywoman Susan Eggman (D-Stockton) walked by. Assemblyman Mike Gipson (D-Carson) checked email in the hotel’s business center before leaving the resort.\nOrganizers of the mod Dems’ annual event won’t talk about how much it raises for the PAC or who attends. A flyer distributed to Sacramento lobbyists advertises ticket packages ranging from $5,000 to $40,000 that include dinner, golf, spa treatments and lodging at the Ritz-Carlton.\nUnlike the organization that raises money to elect centrist Democrats, the legislators who make up the party’s moderate caucus are a loosely affiliated bunch that ranges from 9 members to 24 depending on the issue. Bonilla and Eggman, for example, broke from the moderates by voting in favor of a bill to cut greenhouse gas emissions — though it still fell short of passing. Many of these Democrats represent poor inland areas like Fresno, Bakersfield and San Bernardino and say they make policy decisions based on what’s best for job creation.\nSo far the group has made its mark by casting key votes with Republicans, killing or watering down legislation backed by liberal Democrats. As the moderate Democrats’ clout grows, many will be watching whether they become a force that advances new policy in the Legislature – or if they’ll express power just by voting “no.”\nCorrection: An earlier version of this story incorrectly said Assemblywoman Susan Eggman finished a round of golf.","url":"https://calmatters.org/articles/rise-of-the-business-democrat/"}
