{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 00:39:22","date_modify":"2018-10-23 00:39:22","date_publish":"2017-04-26 10:28:34","description":"She's not afraid to show her sexy side on social media - and singer Rita Ora did just that when she shared a new racy snap on Instagram on Wednesday.","filename":"data/vaneerConsumption/RitaOracaresseshercleavageinsexysnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9D9E9800000578-0-image-a-9_1493198890844.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446868_Rita-Ora-caresses-cleavage-sexy-snap_1540255162.html","title":"Rita Ora caresses her cleavage in sexy snap","title_page":"Rita Ora caresses her cleavage in sexy snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's not afraid to show her sexy side on social media - and singer Rita Ora did just that when she shared a new racy snap on Instagram on Wednesday.\nThe 26-year-old looked sexy as she caressed her ample bosom in her latest black and white post, while teasingly pulling down her top.\nFlashing a series of inkings, she held a professional camera in her hand as she got snapping.\nScroll down for video\n'Me, by me!': Rita Ora caressed her cleavage as she teasingly pulled down her top in very racy Instagram selfie posted on Wednesday\nShe captioned the image with the words: 'Me by Me.'\nWith her platinum tresses worn in a tousled style with loose curls running throughout, Rita jazzed up her look with a diamond necklace.\nThe hitmaker has been in Hollywood all week, where she has been snapped visiting various high-end establishments wearing a variety of designer garments.\nThis is How She Do: Rita teamed a vintage Gucci blouse with GARISH green satin wide-leg trousers for a night out at The Nice Guy with friends in Hollywood on Monday night\nOn Monday night, Rita teamed a vintage Gucci shirt with bright green satin wide-leg trousers as she headed to The Nice Guy with pals.\nThe night before, she paid tribute to the late George Michael, wearing a T-shirt with his face on as she headed to a sushi restaurant.\nRita's appearance comes amid claims she was a 'target' of Mel B and her estranged husband Stephen Belafonte, who were keen for the singer to engage in group sex with them.\nTribute: She made a style statement as she paid tribute to the late George Michael in a vintage T-shirt bearing his image as she left a sushi restaurant in Los Angeles on Sunday night\nAccording to the Sun On Sunday newspaper, Rita met the couple - who are currently in the midst of a bitter divorce battle - at a 'networking' dinner in LA back in 2014.\nAfter hitting it off, a source claimed that Mel and Stephen had invited Rita back to their home - but the America's Next Top Model host had declined, in order to keep matters between them professional.\nAn insider told the publication: 'Rita was one of Mel and Stephen’s targets. When they asked her back to theirs, she was surprised.'\n'She was there purely for work reasons, anything else was out of the question. So she made her excuses politely and went home.'\nRita is currently hard at work on her second studio album, a follow-up to 2012's Ora.\nThe singer revealed last September that she was recording the album in London, adding that she's 'desperate to get my music out'.\nShe told the Evening Standard newspaper: 'It's just everything from my personal life to what I couldn't do due to previous situations and now being free. I've never been freer than I am right now.'\nRita reportedly made £3million last year, despite the fact she hasn't released any new music for nearly two years.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446868/Rita-Ora-caresses-cleavage-sexy-snap.html"}
