{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:15:48","date_modify":"2018-10-30 20:15:48","date_publish":"2015-07-29 16:24:16","description":"RiteAid, Food Lion, Hannaford Stores to Place Cosmopolitan Behind Blinders","filename":"data/vaneerConsumption/RiteAidFoodLiontoPlaceCosmopolitanBehindBlinders.json","image_url":"https://media.breitbart.com/media/2015/07/nicki-minaj-cosmopolitan-magazine.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_29__1540930548.html","title":"RiteAid, Food Lion to Place Cosmopolitan Behind Blinders","title_page":"RiteAid, Food Lion to Place Cosmopolitan Behind Blinders","title_rss":"NULL","source_domain":"breitbart.com","text":"Several major supermarket chains will place Cosmopolitan Magazine behind blinders in their stores as a result of a campaign launched in April to protect young children and adolescents from the blatant sexual material on the magazine’s cover.\nSupermarket chains RiteAid and Delhaize America – which owns Hannaford Stores and Food Lion – will be placing Cosmopolitan behind blinders, a decision that counts as a major victory for the campaign to protect minors initiated by the National Center on Sexual Exploitation (NCSE) and Victoria Hearst, granddaughter of William Randolph Hearst, who founded the corporation that publishes the magazine.\n“I congratulate RiteAid and Delhaize America…for their sincere promise to immediately put Cosmopolitan Magazine behind blinders in all of their stores,” said Victoria Hearst in a statement in a press release. “It will protect underage children from being exposed to the magazine’s sexually explicit covers showing scantily clad female celebrities and article titles with the words “sex” and “orgasm!”\n“Since these two companies are now clearly aware of Cosmopolitan’s pornographic content, I pray that they will do the right thing and either stop selling the magazine or obey the Material Harmful To Minors laws in each state which forbid the sale of magazines like Cosmopolitan to anyone under 18 years old,” she added.\nIn an interview with Breitbart News in April, Hearst was about to launch the campaign titled Cosmo Harms Minors.\nShe said she had tried for years to talk to fellow family members on the board of directors of the Hearst Corporation about the fact that Cosmo is harmful to young people, but to no avail.\n“Minors shouldn’t be able to buy Cosmo, it’s adult content and minors shouldn’t be exposed to it,” Hearst said. “Apparently, my family members in authority in the Hearst Corporation don’t care about corrupting and harming children. They only care about money.”\nOn its website, the Hearst Corporation states, “Cosmopolitan is the best-selling young women’s magazine in the U.S., a bible for fun, fearless females that reaches more than 18 million readers a month.”\nBut Victoria Hearst doesn’t buy into that philosophy.\n“Cosmo is anti-God, anti-Christian, anti-marriage, and promotes a deviant lifestyle centered on sex,” she said. “It promotes promiscuity – with its risks of getting STDs, being raped or murdered, and its promise of emotional and psychological damage, including suicide.”\nHearst stated her campaign has no intention of limiting the First Amendment rights of the Hearst Corporation, but warned most states have “harm to minors” laws that should prevent the display of such blatant sexual content at the checkouts of stores where children can readily be exposed to it.\n“If they want to put sexually explicit materials and words on the covers of Cosmo, and if they want to fill their magazine with photos of sexual positions and articles about how to enjoy anal sex, knock themselves out,” Hearst said, “but have it where other adult material like Playboy and Penthouse is sold – not where children and adolescents can be exposed to it.”\nNCSE launched its campaign against Cosmopolitan magazine in 2013 when the publication was named to its Dirty Dozen List, a list of the top twelve organizations contributing to sexual exploitation. In NCSE’s nationwide poll, the majority of Americans agreed that Cosmo‘s front cover is not appropriate for all ages.\n“We are thankful to RiteAid and Delhaize America for not allowing this harmful material to be in plain view of minors at their stores, and we encourage other chains to follow suit, and to refuse to sell this pornographic magazine to minors,” said Dawn Hawkins, NCSE executive director.","url":"https://www.breitbart.com/politics/2015/07/29/riteaid-food-lion-hannaford-stores-to-place-cosmopolitan-behind-blinders/"}
