{"authors":["Sylvia Longmire"],"date_download":"2018-10-30 22:19:16","date_modify":"2018-10-30 22:19:16","date_publish":"2015-03-11 13:44:21","description":"n one of the most turbulent areas affected by Mexico’s drug war, more violence is expected after two rival militia leaders were exonerated by a judge for acting in self-defense.","filename":"data/vaneerConsumption/RivalMilitiaLeadersReleasedfromPrisoninMexicoViolenceExpected.json","image_url":"https://media.breitbart.com/media/2015/03/Michocan-Militia-Reuters-Alan-Ortega.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_03_11__1540937956.html","title":"Rival Militia Leaders Released from Prison in Mexico, Violence Expected","title_page":"Rival Militia Leaders Released from Prison in Mexico, Violence Expected","title_rss":"NULL","source_domain":"breitbart.com","text":"In one of the most turbulent areas affected by Mexico’s drug war, more violence is expected after two rival militia leaders were exonerated by a judge for acting in self-defense.\nThe March 10 ruling resulted in the release from prison of Hipólito Mora, founder of one of the first so-called autodefensa groups in the town of La Ruana, Michoacan, along with 26 of his men, according to a Vice News report. Luis Antonio “El Americano” Torres, leader of the rival Buenavista group, was expected to be released very soon.\nThe Mexican state of Michoacán and neighboring Guerrero have been plagued with drug-related violence as a result of conflicts between the Knights Templar cartel, remnants of La Familia Michoacana, and the up-and-coming Cartel de Jalisco Nueva Generación (CJNG). Vigilante groups began to form in earnest in these states in the absence of any effective government or military efforts to mitigate the rampant kidnappings and murders.\nInitially the militias were effective, driving the Knights Templar out of many communities in Michoacan—so much so that the Mexican government reached out to create formal agreements for cooperation with some of these militias. However, evidence soon emerged indicating many militias had been infiltrated by cartel members looking to kill rivals and take advantage of the government assistance.\nNow the imminent proximity of these two men and their bands of supporters are putting many residents on edge. Mora and his supporters in Michoacán already warned on Tuesday that there could be more violent confrontations if “El Americano” is also allowed to return to the region, per Vice News.\nSylvia Longmire is a border security expert and Contributing Editor for Breitbart Texas. You can read more about Mexican cartel activities in her latest book, Border Insecurity: Why Big Money, Fences, and Drones Aren’t Making Us Safer.","url":"https://www.breitbart.com/border/2015/03/11/rival-militia-leaders-released-from-prison-in-mexico-violence-expected/"}
