{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-22 23:59:06","date_modify":"2018-10-22 23:59:06","date_publish":"2017-03-16 08:22:36","description":"Torrential rain in Colombia left conditions so treacherous during their Copa Libertadores group match on Wednesday night the teams had to be taken off at one point for their own safety.","filename":"data/vaneerConsumption/RiverPlateplayCopaLibertadoresgameintorrentialrain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E528C9D00000578-0-image-a-36_1489652660809.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319210_River-Plate-play-Copa-Libertadores-game-torrential-rain_1540252746.html","title":"River Plate play Copa Libertadores game in torrential rain","title_page":"River Plate play Copa Libertadores game in torrential rain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If Manchester United thought they had it bad when they played on a bumpy pitch in Rostov last week, then spare a thought for the players of Independiente Medellin and River Plate.\nTorrential rain in Colombia left conditions so treacherous during their Copa Libertadores group match on Wednesday night the teams had to be taken off at one point for their own safety.\nGreat splashes of water were sent up every time a player touched the ball at the sodden Estadio Atanasio Girardot as giant puddles covered the surface.\nIndependiente and River Plate played out their Copa Libertadores game in horrendous weather in Medellin on Wednesday night\nTorrential rain in the Colombian city made playing conditions very treacherous\nReferee Wilton Sampaio took the players off at one stage as the conditions worsened\nIt was evidence from the first whistle that playing any kind of good football would be impossible and, after 27 minutes, conditions were so bad that the referee decided to suspend the match.\nBrazilian official Wilton Sampaio decided to give it 30 minutes to see if the monsoon-like rain died down, but they were actually back underway within 10 minutes.\nAlmost immediately, River Plate took the lead when Lucas Alario converted a penalty, before Sebastian Driussi doubled their lead on 33 minutes.\nGround staff at the Estadio Atanasio Girardot try to clear some of the surface water\nAfter a 10-minute delay, the match did continue with River Plate going on to win 3-1\nHeavy rain in Medellin led to a poor playing surface, with large puddles of standing water\nHuge splashes of water were sent up every time a player slid in to make a tackle\nThe referee talks to players from both teams as he decided whether to take them off\nWhen play resumed, River Plate took the lead through Lucas Alario's first-half penalty\nThe visitors from Argentina doubled their advantage when Sebastian Driussi scored\nThey made sure of a perfect start to their Libertadores campaign six minutes into the second-half when Martinez Quarta added a third, meaning that Juan Fernando Quintero's late penalty for Independiente was a mere consolation.\nWith this good start to their group campaign, and Ecuador side Emelec and Peruvians Melgar to come, River will fancy their chances of reaching the knockout stage.","url":"https://www.dailymail.co.uk/sport/football/article-4319210/River-Plate-play-Copa-Libertadores-game-torrential-rain.html"}
