{"authors":["Abigail Miller For Dailymail.Com"],"date_download":"2018-10-22 23:27:06","date_modify":"2018-10-22 23:27:06","date_publish":"2017-03-10 03:07:46","description":"Police arrested Theodore Childers, pictured, less than 24 hours after they released CCTV footage of the incident in Riverside, California. Childers will appear in court at 8am on Monday morning.","filename":"data/vaneerConsumption/Riversidemantriestotemptyounggirlintotherestroom.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E219C4500000578-0-image-a-12_1489135409183.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299858_Older-man-tries-tempt-young-girl-restroom_1540250826.html","title":"Riverside man tries to tempt young girl into the restroom","title_page":"Riverside man tries to tempt young girl into the restroom | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police have arrested a 'creepy man' who tried to lure a six-year-old girl into a supermarket restroom following a public appeal.\nRiverside Police in California released CCTV footage of the incident on Wednesday and within 24 hours they had made an arrest.\nThe man, named as Theodore Childers was detained by detectives who were investigating the February 15 incident.\nRiverside Police Department arrested Theodore Childers, left, after they released CCTV footage, right, of an incident on February 15 where he was accused of trying to lure a six-year-old girl into the men's restroom of a supermarket. Childers is due up in court on Monday\nRiverside Police said Childers tried to offer the girl 'a treat' to convince her to come with him\nAccording to police: ' A male suspect attempted to lure the juvenile towards him by telling her he would give her a treat. He also motioned for her to come towards him while he was standing near the entrance to the men’s restroom. The incident was caught on the store's surveillance system.'\nThe incident happened at the Food4Less supermarket in Riverside, California.\nThe security footage then shows the man motioning to her to come towards him.\nVideo shows her stop talking to the man after he beckons her, and pushes the women's bathroom door open to enter.\nShe was shopping with her grandma at the time of the encounter, and was entirely unharmed.\nThough the incident happened last month, police released footage recently because they had exhausted all prior leads.\nChilders is currently being held in the Robert Presley Detention Center on a misdemeanor charge of annoying or molesting children.\nBail has been set at $5,000.\nChilders is due to appear at the Riverside Hall of Justice on Monday at 8am.","url":"https://www.dailymail.co.uk/news/article-4299858/Older-man-tries-tempt-young-girl-restroom.html"}
