{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 17:50:39","date_modify":"2018-10-30 17:50:39","date_publish":"2018-10-30 15:17:50","description":"An ad launched Friday by Tom Steyer compares Trump to Saddam Hussein. Ironically, Steyer accused Trump Sunday of \"name-calling.\"","filename":"data/vaneerConsumption/RNCCondemnsTomSteyerAdComparingTrumptoSaddamHussein.json","image_url":"https://media.breitbart.com/media/2018/06/Tom-Steyer-Need-to-Impeach-Associated-Press-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30__1540921839.html","title":"RNC Condemns Tom Steyer Ad Comparing Trump to Saddam Hussein","title_page":"RNC Condemns Tom Steyer Ad Comparing Trump to Saddam Hussein | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Republican National Committee (RNC) has condemned an ad by billionaire left-wing mega-donor Tom Steyer that compares President Donald Trump to the late Iraqi tyrant Saddam Hussein and other dictators.\nThe ad, according to the Daily Caller, was published last Friday by Steyer’s “Need to Impeach” organization, which has been spending tens of millions of dollars to encourage Democrats to impeach the president. The ad also refers to Trump as a “malignant narcissist,” and calls his behavior “self-centered … anti-social, volatile, ruthless, paranoid, and most disturbingly, sadistic.”\nIronically, on Sunday, Steyer criticized Trump on Twitter for “name-calling.”\n.@realdonaldtrump just tweeted at me in his typical insulting style after watching @CNNsotu. It is unthinkable that in the midst of the horrible political violence our president would resort to name-calling instead of repairing the damage to the fabric of our country. — Tom Steyer (@TomSteyer) October 28, 2018\nFox News reports that RNC spokesman Steve Guest blasted the ad: “This disgusting ad has no place running on Facebook and the absurd comparison should be condemned by all Americans,” he said.\nOn Sunday, Steyer accused House Majority Leader Kevin McCarthy (R-CA) of antisemitism for criticizing his efforts to “buy” American democracy, though Steyer is Episcopalian and that term is common across both parties.\nSteyer also told CNN’s Jake Tapper that it was wrong to suggest both sides of the political divide were contributing to division, and that Democrats were just defending themselves against “political violence.”\nHis definition of “political violence” included McCarthy’s criticism, directed at him and fellow donors George Soros and Michael Bloomberg.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2018/10/30/rnc-condemns-tom-steyer-ad-comparing-trump-to-saddam-hussein/"}
