{"authors":["Ian Hanchett"],"date_download":"2018-10-30 20:24:06","date_modify":"2018-10-30 20:24:06","date_publish":"2015-10-15 00:49:52","description":"RNC Chair Priebus: Dems Will Have 'Coronation' For Hillary Unless Biden Runs, Hillary's 'Calling The Shots'","filename":"data/vaneerConsumption/RNCChairPriebusDemsWillHaveCoronationForHillaryUnlessBidenRunsHillarysCallingTheShots.json","image_url":"https://media.breitbart.com/media/2015/10/Priebus-1014-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540931046.html","title":"RNC Chair Priebus: Dems Will Have 'Coronation' For Hillary Unless Biden Runs, Hillary's 'Calling The Shots'","title_page":"RNC Chair Priebus: Dems Will Have 'Coronation' For Hillary Unless Biden Runs, Hillary's 'Calling The Shots' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"RNC Chairman Reince Priebus argued the Democratic Party will “have a coronation” for former Secretary of State Hillary Clinton unless Vice President Joe Biden enters the race, and argued Clinton is “calling the shots” in the Democratic Party on Wednesday’s “On the Record with Greta Van Susteren” on the Fox News Channel.\nPriebus said, “they’re basically going to have a coronation unless Joe Biden gets in the race. you saw that last night. I mean, the fact that today people are discussing, who won the debate, did Hillary win the debate, how big did she win the debate, just kind of shows you where they’re at, that they are actually have a conversation about whether Hillary Clinton won a debate against a 74-year-old socialist, and three other people that most people can’t name. I mean, this is where they are at.”\nWhen asked about the number of debates, Priebus stated, “I think that you have your presumptive nominee in Hillary Clinton, and the only person that can upend that is Joe Biden, and so I think they make a calculation and say, look, we’ve got our nominee, what does Hillary Clinton’s camp think about the debate schedule? They chime in and say I think there should be as few as possible.”\nHe added, “I don’t know if the fix is in, but it would appear Hillary Clinton’s calling the shots, and if you’re the only real serious candidate on that particular side, then at some point, she’s going to call the shots. I mean, that’s what’s going on over there.”\nPriebus also argued that Clinton is “competing against a bunch of folks that don’t really register on the Richter Scale, and she’s losing to [Sen.] Bernie Sanders (I-VT) in Iowa and New Hampshire. I think she should win.” He continued that Clinton “did what she had to do”\nHe concluded, “if you look it at the opinion polls afterwards, they said that Bernie Sanders actually won, all the opinion polls, the focus groups. It was the same thing that happened in ’08, the pundits came on immediately after and said, oh, Hillary Clinton won the debate. Hillary Clinton won the debate, then the focus groups, the opinion polls, the online money, went to who? It went to Barack Obama.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/10/14/rnc-chair-priebus-dems-will-have-coronation-for-hillary-unless-biden-runs-hillarys-calling-the-shots/"}
