{"authors":["Press Association Reporter"],"date_download":"2018-10-23 05:36:57","date_modify":"2018-10-23 05:36:57","date_publish":"2017-03-16 16:25:21","description":"Road To Respect stormed to victory in the Festival Plate at Cheltenham on Thursday afternoon with Bryan Cooper riding the six-year-old clear in the final stretches.","filename":"data/vaneerConsumption/RoadToRespectwinsFestivalPlateatCheltenham201.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E55998E00000578-0-image-a-159_1489681515638.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_racing_article-4320854_Cheltenham-2017-Road-Respect-wins-Festival-Plate_1540273017.html","title":"Road To Respect wins Festival Plate at Cheltenham 201","title_page":"Road To Respect wins Festival Plate at Cheltenham 201 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Road To Respect recovered from a bad mistake at the first fence to run away with the Brown Advisory & Merribale Stable Plate Handicap Chase.\nThe six-year-old, trained by Noel Meade, stormed up the hill in the hands of Bryan Cooper to give owners Gigginstown House Stud their third Festival win of the week.\nBaron Alco kept on well for second place, as Road To Respect (14-1) came home six lengths clear. Bouvreuil was a length and three-quarters back in third with Thomas Crapper fourth.\nBryan Cooper celebrates after leading Road To Respect to victory despite a bad mistake\nJockey Cooper on Road To Respect wins the Brown Advisory & Merriebelle Stable Plate\nCooper, who struck on Tuesday with Apple's Jade, said: 'He travelled really well, he's been running in good novice races all winter long and I was a bit worried if he lacked the experience.\n'He didn't jump the first great, but after that I gave him a bit of room to get his confidence. It was a messy race but he bolted up.\n'Noel is a great person to ride for. I had a lot of luck for him early in my job. I've struggled to ride a winner for him the last couple of years, but he does a great job.\nRoad to Respect (second left) rides clear of the pack on his way to winning the Festival Plate\n'It's great to get another one on the board.'\nWinning owner Michael O'Leary said: 'He's related to Road To Riches so he wants good ground, but he's been running against all the best novices in Ireland.\n'I didn't think he had much of a chance, but Bryan gave him a great ride, he was in the right place the whole way.\n'Someone told me it's Noel's first win over fences here which just goes to show if you keep banging your head something will give.'\nCooper managed to control Road to Respect after a bad mistake on the very first fence\nMeade said: 'I thought we had three good chances to be in the money today, Disko was third (in the JLT), I was a little disappointed with Snow Falcon in the Stayers', and this fellow.\n'I was telling a few people in Ireland I quite fancied him to be honest.\n'I actually wanted to run in the RSA but Gigginstown had Alpha Des Obeaux in that and it makes sense the way the handicap was.\n'The ground was a big help and we've always thought he was nice. He was obviously well handicapped.'","url":"https://www.dailymail.co.uk/sport/racing/article-4320854/Cheltenham-2017-Road-Respect-wins-Festival-Plate.html"}
