{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 01:10:59","date_modify":"2018-10-23 01:10:59","date_publish":"2017-03-16 10:58:38","description":"Lynne Mason, 52, told Amy Galley 'I am going to f****** kill you' after she parked her Ford Focus on her driveway in Newcastle while dropping a colleague home from work.","filename":"data/vaneerConsumption/Roadragewomantriedtochokemotoristoutsidehome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E526D8E00000578-0-image-a-43_1489661689617.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319674_Road-rage-woman-tried-choke-motorist-outside-home_1540257059.html","title":"Road rage woman tried to choke motorist outside home","title_page":"Road rage woman tried to choke motorist outside home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lynne Mason, 52, pictured, was handed 100 hours of unpaid work after admitting assaulting driver Amy Galley after she parked outside her home in Newcastle\nA woman launched an astonishing 'road rage' attack on a motorist who parked their car on her driveway, threatening to 'rip her throat out'.\nLynne Mason, 52, shouted 'I'm going to f****** kill you' and grabbed Amy Galley by the neck after she briefly parked her Ford Focus outside Mason's home in Newcastle while dropping a colleague home from work.\nMason then tried to choke the shocked victim and started pulling out clumps of her hair and banged her body against a car, a court was told.\nThe terrifying assault only came to an end when a resident on the street came to her rescue and pulled Mason away.\nNow, Mason, of Camperdown, Newcastle, has been ordered to do 100 hours of unpaid work after pleading guilty to assault by beating at North Tyneside Magistrates' Court.\nClare Irving, prosecuting, said the incident, which happened at around last October, was 'best described as road rage'.\nShe said: 'Miss Galley gives a colleague a lift home after work.\n'She stops her Ford Fiesta outside the defendant's address and it's accepted Miss Galley had parked over the defendant's driveway as she was dropping her off.\n'Miss Galley heard a car horn and saw a Qashqai near the rear of her car and her friend said that it was her neighbour.\n'Miss Galley reversed her vehicle a short distance backwards and the defendant pulled up alongside her, gesticulating with her hands and shouting.'\nThe court heard the victim reversed again but, because of 'fear of Mason', hit a works van in a panic to move.\nIt was then, prosecutors said, that Mason turned even more aggressive and shouted: 'What the f**k have you done? I'm going to f*****g kill you. You better stay there, I'm going to rip your throat out.'\nMs Irving added: 'She [the defendant] races towards Miss Galley. She pointed her finger into her face, making contact with her face.\n'Miss Galley pushed her hand away. The defendant then grabbed Ms Galley by the throat, pulling her head downwards.\n'Both of the defendant's hands are clasped around her throat. Miss Galley says her breathing is restricted. The defendant then begins to hit the left side of her body off Miss Galley's car.\n'Miss Galley was struggling for breath and putting her arms out to get the defendant to release her.'\nNorth Tyneside Magistrates' Court, pictured, heard Mason threatened to 'rip Miss Galley's throat out' and pulled out her hair and 'banged her against a car'\nThe court heard it was a female resident on the street who eventually came to the victim's rescue and pulled Mason away.\nMs Galley, a healthcare assistant at North Tyneside District Hospital, suffered loss of clumps of hair, bruising around her neck, strained neck muscles and soft tissue damage to her ribs.\nIn a statement read to the court, she said she had suffered from anxiety in the past, which had been improving up until the attack.\nShe said: 'This assault has caused my anxiety to worsen. It is having a continuing impact on my day-to-day life.'\nJack Lovell, defending, said Mason, who has no previous convictions and works as an administrator, had been having issues with people parking in front of her driveway.\nHe said: 'On one occasion, she was late for work because of it.\n'She's shown genuine remorse and is devastated to be 52 years old and come before a court for this.'\nMason was given a 12-month community order and will have to do 100 hours of unpaid work.\nShe was also ordered to pay £300 compensation, costs and a victim surcharge.","url":"https://www.dailymail.co.uk/news/article-4319674/Road-rage-woman-tried-choke-motorist-outside-home.html"}
