{"authors":["Brandon Riddle"],"date_download":"2018-10-30 14:31:15","date_modify":"2018-10-30 14:31:15","date_publish":"2018-08-28 12:28:00","description":"A roadside assistance worker was robbed Saturday night after being called to help someone who reported he had been locked out of his vehicle, he told Little Rock police.","filename":"data/vaneerConsumption/RobbedafterbeingcalledtohelpsomeonelockedoutofvehicleroadsideassistanceworkertellsLittleRockpolice.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_28_roadside-a_96a22a7f348954095af89930f292b03e__page=1_1540909875.html","title":"Robbed after being called to help someone locked out of vehicle, roadside assistance worker tells Little Rock police","title_page":"Robbed after being called to help someone locked out of vehicle, roadside assistance worker tells Little Rock police","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A roadside assistance worker was robbed Saturday night after being called to help someone who reported he had been locked out of his vehicle, Little Rock police said.\nThe holdup happened shortly before 10:40 p.m. in the 1300 block of Madison Street, according to a report from the city’s Police Department. It was reported to authorities Monday night.\nThe 27-year-old employee of Jack Rabbit Roadside Assistance, contracted through Allstate Insurance, had been called to assist one of the company’s customers, he said.\nOnce he arrived at the address, six people — four males and two females — were surrounding a vehicle, the report states. When the worker opened it, one of the males approached him, demanded “everything he had” and threatened to shoot him, police said. An officer noted that no weapon was ever shown.\nListed as stolen was an OtterBox-enclosed gold Apple iPhone 7 that had been turned off and was inaccessible for tracking.\nThe 27-year-old told police that when he asked the person he thought had called him to the location why he did it, the stranger responded: “Get the hell out of here before I f--- you up\".\nNo suspects were named, and no arrests had been made at the time of the report.","url":"https://www.arkansasonline.com/news/2018/aug/28/roadside-assistance-worker-robbed-while-trying-hel/?page=1"}
