{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 02:47:36","date_modify":"2018-10-23 02:47:36","date_publish":"2017-03-10 12:04:45","description":"The hilarious footage shows expert Robert Kelly being interviewed, handling serious questions on the South Korean president, Park Geun-hye, being ousted from power.","filename":"data/vaneerConsumption/RobertKellysliveBBCinterviewgatecrashedbyhiskids.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22B4AF00000578-0-image-a-21_1489147901210.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300896_BBC-expert-s-live-interview-gatecrashed-children_1540262856.html","title":"Robert Kelly’s live BBC interview gatecrashed by his kids","title_page":"Robert Kelly’s live BBC interview gatecrashed by his kids | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Live television always leaves room for hilarious gaffes - which is exactly what happened when a BBC debate on South Korea was interrupted by the interviewee's children.\nThe hilarious footage shows expert Robert Kelly, an associate professor of Political Science at Pusan National University in Busan, handling serious questions on the country's president, Park Geun-hye, being ousted from power.\nBut suddenly, a toddler bursts into the room in a bright yellow top and performs a comical dance behind the Cleveland, Ohio, native.\nThe interviewees toddler bursts into the room in a bright yellow top and performs a hilarious dance behind him\nKelly, 44, who was born and studied in the US before moving to Korea as a political science professor, focuses entirely on the camera as he attempts to blindly hand off his daughter, who is clearly curious as to who he is talking to.\nAnd his parental problems soon double as a baby also excitedly makes his way into the room under his own power in a walker.\nTo complete the farce, his wife Jung-a Kim then comes skidding through the threshold.\nShe grabs the two youngsters and attempts to drag them out of the door, but one of them can be heard wailing and the baby's walker suddenly won't fit back through the door.\nBoth parties try to keep their cool despite the hilarious interruption from his young child\nHis parental problems soon double as a baby also excitedly makes his way into the room in a stroller\nEventually, she manages to get them both out, and the interview continues.\nWhen the interview finishes, broadcaster James Mernendez says: 'There's a first time for everything. I think you've got some children who need you!'\nAnd after the segment had finished, the presenter admitted on Twitter that he had struggled to keep it together.\nHe posted a link to the video, with the words: 'Hard to keep a straight face.'\nAfterwards, he added: 'It was the desperate reach for the door at the end that nearly did it for me.'\nTo complete the farce, his wife comes skidding through the threshold to collect the children\nShe grabs the two youngsters and attempts to drag them out of the door, but one of them can be heard wailing and the baby's walker suddenly won't fit back through the door\nMore formal pose: Robert Kelly and his wife Jung-a Kim and daughter Marion - who started the interruption which created a viral sensation.\nThe hilarious footage was first tweeted by BBC producer Julia MacFarlane, who promptly deleted it 20 minutes later.\nShe wrote: 'When the kids interrupt you in the middle of live TV...A lovely moment and masterfully handled by our guest this morning on South Korea'.\nA BBC spokesman told MailOnline: 'We're really grateful to Professor Kelly for his professionalism. This just goes to show that live broadcasting isn't always child's play.'\nA highly respected expert on South Korean politics, Prof Kelly has written for outlets including Foreign Affairs, The European Journal Of International Relations and The Economist.\nHe earned his bachelors degree in political science from the University of Miami and completed his PhD at Ohio State.\nKelly moved to Korea in 2008, and married Jung-a Kim, a former yoga teacher who is now a stay-at-home mother to their two children, Marion, four, and James, nine-months.\nAnd after the segment had finished, the presenter admitted on Twitter that he had struggled to keep it together during the episode\nNo sooner had the interview been broadcast that people were clamoring to share the clip online\nSome Twitter users took a more serious approach to reassure viewers that Professor Kelly is a voice of authority as well as a source of fun\nThe stuff of memes: The internet was quick to react to the hilarious clip with Twitter users uploading and sharing memes\nThe Seinfeld themed meme drew comparisons with character Kramer's famous entrances and little Marion marching into the room mid-broadcast\nAnother meme captured the exact moment despairing Professor Kelly realised his daughter was in the room and tried to nudge her out of shot\nJournalist Victoria Craw couldn't contain her joy at the hilarious interview\nKelly's mother Ellen told DailyMail.com the clip was 'hilarious' and that she had spoken to her son just as it started to become an internet sensation.\n'First my sister called and then we spoke to Robert, who was a little disturbed - probably just embarrassed,' she said.\nMrs Kelly added that she thought 'the best part' of the video was when his wife, Jung-a, came skidding through.\n'It was just fantastic,' Mrs Kelly said. 'Robert will be in for a real treat when he wakes up the morning.'\nAs Korea is 14 hours ahead of the U.S., Mrs Kelly did not know if her son is fully aware of his internet fame - most of which grew when he would normally be asleep.\nEllen Kelly, 72, with her husband, Joseph, spoke to DailyMail.com and said she could be the reason behind the gaffe. She said that she regularly Skypes with the children and that 'the kids probably heard voices coming from the computer and assumed it was grandma'\nBut Facebook posts on the professor's wall, congratulating him on his 'performance' and calling him a 'star', are flooding in.\nMrs Kelly, of University Heights, just outside Cleveland, Ohio, told DailyMail.com that she is exceptionally proud of her son and all of his accomplishments, and added that he is a 'wonderful' and committed father.\nShe and her husband Joseph usually Skype with Robert, his wife Jung-a Kim and the two children from the same place as he was carrying out the BBC interview.\n'Robert usually Skypes with us from his home office, which is where he did the interview.\n'The kids probably heard voices coming from the computer and assumed it was us,' she said laughing. 'It was just hilarious'.\nMrs Kelly, 72, explained that her 44-year-old son, who is an expert on South Korean politics, has done a number of interviews on network television for other outlets, including CNN, as well as CNBC, Sky News, and ITN.\nShe said: 'I just hope that he gains recognition for his expertise rather than for this - as great as it all is.'\n'Life happens,' she said, laughing. 'The lesson is to lock the door!'\nSince the clip has gone viral, social media has been awash with users in hysterics at the event.\nOne user, GothicFrog‏, said: 'I love the speed of the child minder! She just drags them out!'\nLee Sherry added: 'Did anybody just watch BBC world news interview regarding Korean president… children walked in. Maid dragged children out? Hilarious'.\nTony Brown added: 'I just can't stop watching it on repeat.'","url":"https://www.dailymail.co.uk/news/article-4300896/BBC-expert-s-live-interview-gatecrashed-children.html"}
