{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 03:59:42","date_modify":"2018-10-23 03:59:42","date_publish":"2016-01-11 16:55:36","description":"Robert Griffin III, who after a stellar rookie season faltered in his second year and was replaced by Kirk Cousins, never returning to his post as starting quarterback, is done with the Washington Redskins.","filename":"data/vaneerConsumption/RobertGriffinIIIcleanshislockerafterWashingtonRedskinspaid35mforhim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CEFA800000578-0-image-a-26_1452531238894.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394122_Robert-Griffin-III-cleans-locker-four-years-Washington-Redskins-paid-whooping-35million-quarterback-played-just-one-season_1540267182.html","title":"Robert Griffin III cleans his locker after Washington Redskins paid $35m for him","title_page":"Robert Griffin III cleans his locker after Washington Redskins paid $35m for him | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Robert Griffin III is saying goodbye to the Washington Redskins.\nFour years after signing a $21.1million four-year contract with the team, that came with a $13.8million signing bonus, Griffin was seen cleaning out his locker for the final time following the Redskins loss to the Green Bay Packers in the first round of the playoffs on Sunday.\nIt was a difficult four years for Griffin, who after a stellar rookie season in during which he earned the nickname Superman faltered in his second year and was replaced by Kirk Cousins, never returning to his post as starting quarterback.\nGriffin gave no interviews in the locker room on Sunday and left behind a Bible verse and a quote that is often attributed to Mother Theresa but is in fact a paraphrase of a poem called The Paradoxical Commandments by Kent M. Keith.\nScroll down for video\nHe's out: Robert Griffin III is seen cleaning out his locker in a photo shared by Carol Maloney of NBC Washington\nSupertstar: Griffin (above in August) was drafted by the team in 2012, signing a $21.1million four-year contract with the team, that came with a $13.8million signing bonus\nNew star: He was replaced at the end of his second season by Kirk Cousins (above in November) following an injury\nThe Redskins revealed earlier this season they would be resigning Cousins, meaning that Griffin is on his way to a new home in the NFL, with many now wondering if he will be able to revive his once promising career.\nGriffin was a superstar in his first season with the Redskins in 2012, leading the team to the NFC East title and being named NFL Offensive Rookie of the Year.\nHe also earned millions in endorsements before ever stepping foot on the field, from brands including Adidas, Gatorade and Subway.\nHe also managed to make headlines off the field after his rookie year when he became involved in a cheating scandal.\nA Hooters waitress, Meredith Barber, revealed text messages that Griffin had sent to her including a shirtless photo that the quarterback shared with the young lady on his wedding day.\nGriffin married his college girlfriend Rebecca Liddicoat in July 2013.\nBarber emailed Busted Coverage after they posted the text messages between the two asking that they take the story down and then offering to sell them 'inappropriate' pictures of Griffin, including one of his penis.\nThe site said they had no desire for a photo of Griffin's penis but would pay her $500 for each of the other photos, a price the young woman scoffed at saying it was 'no where near' what she was looking for in exchange for the pictures.\nGirl: Griffin married his college girlfriend Rebecca Liddicoat (above) in July 2013\nFarewell: Griffin also left a Bible verse in his locker in this photo shared by Carol Maloney of NBC Washington\nFan for life: Griffin declined interviews as he left but did happily pose for a selfie\nWhat set Griffin apart from other quarterbacks was his ability to run, something that also led to injuries as a result of being tackled by opponents.\nDespite being sidelined for almost all of the past two seasons and the final three games of his second season, Griffin was an amazing team player, showing up to all Redskins games and engaging with fans throughout the past few seasons.\n'We all know one thing about this game: Things change fast,' former Redskins running back Clinton Portis told ESPN.\n'Robert did great things for the franchise and the city in 2012. But it's Kirk's team now. That's just the way it is.'\nSantana Moss, a former wide receiver with the team, said; 'He's going to get a second chance and he should get one.'\nHe later added; 'That first year, man, Robert was a rock star. Then different things happened. But he can take all those things, learn from them and get better.\n'If Robert is like any of the best people in the history of this game, then he'll use it all as motivation.\n'But you look at a lot of these quarterbacks out there, and you mean to tell me Robert ain't gonna get another chance?'","url":"https://www.dailymail.co.uk/news/article-3394122/Robert-Griffin-III-cleans-locker-four-years-Washington-Redskins-paid-whooping-35million-quarterback-played-just-one-season.html"}
