{"authors":["Press Association"],"date_download":"2018-10-22 23:46:12","date_modify":"2018-10-22 23:46:12","date_publish":"2016-01-29 12:08:02","description":"Everton manager Roberto Martinez has rejected accusations his team is underachieving and will not be distracted by growing criticism of his reign. Wednesday'...","filename":"data/vaneerConsumption/Robertomartinezcomesoutfightingbutwarnstherewillbepainbeforeglory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-b5b9e0e5-d30b-424d-804f-d36fcbdf5c78-3bmscybNe842cce83474b552c947-356_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422586_Roberto-Martinez-comes-fighting-warns-pain-glory_1540251972.html","title":"Roberto martinez comes out fighting but warns there will be pain before glory","title_page":"Roberto martinez comes out fighting but warns there will be pain before glory | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roberto Martinez comes out fighting but warns there will be pain before glory\nEverton manager Roberto Martinez has rejected accusations his team is underachieving and will not be distracted by growing criticism of his reign.\nWednesday's Capital One Cup semi-final exit to Manchester City was a turning point for many fans, with many expressing their lack of confidence in the Spaniard.\nDespite having arguably one of the best squad of the last 20 years, Everton are 12th in the Premier League having won just six matches all season with just one in the last 10.\nEverton manager Roberto Martinez rejects accusations of underachievement\nMartinez has won just 30 of his last 81 matches in charge since the start of the 2014-15 season, keeping only 21 clean sheets, and the FA Cup - which Martinez famously won with Wigan in 2013 - now represents their only realistic chance of success this season.\nFans argue a team which boasts striker Romelu Lukaku, who has scored 19 goals already this season, former Barcelona prodigy Gerard Deulofeu, and England internationals Ross Barkley and John Stones should be doing much better.\nHowever Martinez, who faces a tricky trip to League Two's Carlisle in the FA Cup on Sunday, disagrees.\n\"You cannot be underachieving when this team is new; this team has been formed over the last two and a half years and we are developing something that is going to be very powerful for the future,\" he said.\n\"That process is not going to be overnight or straightforward. You need to go through painful experiences to develop the know-how of a winning team.\n\"In my eyes we have one of the most competitive squads in the league with four or five players with the best potential in Europe and that has been down to a clear strategy.\n\"We have achieved this squad not having the blank cheque of £500million, which other clubs have had to become a competitive team overnight.\n\"It would be very easy for us to say we can't really compete against the top four and accept where we are and fight every short-term target but we have an overall approach of wanting to get into the top four and we are showing signs we are starting to do that.\n\"Are we going to do that overnight? One hundred percent no. You have to learn as a team how you can compete in those matches and we are right in the middle of that process.\n\"I understand expectations and the history and heritage at Everton and I think we are getting very close to getting back to the glory years that we had but it is not going to be easy or pain-free.\"\nCriticism towards Martinez has been growing all season but the midweek defeat to City - they had a 2-0 aggregate lead with 72 minutes remaining in the tie - appeared to be the final straw for plenty of supporters.\nHe understands why opinions have changed but asked for more patience from fans in order for him to be able to get things right.\nThe chances of him being sacked are slim, Everton are not a club who dispense with their managers readily, and Martinez will be given time to get things right - even if that will anger supporters.\n\"That is football. As a manager you need to accept that we need to get wins,\" he said.\n\"I will never come out with excuses and try to justify lack of wins.\n\"I am extremely aware of the potential we have in the club and we should be working under the expectation of winning games and titles.\n\"I feel we are close to getting what the fans deserved but I'll accept any criticism and I'll be the one fronting that because I share their frustrations at a lack of wins.\n\"But I am the first one who has a strong belief we will be successful at the end of it.\"\nEverton fans have raised more than £7,000 to support a campaign helping Carlisle with their vital community outreach work in the wake of the devastating floods that hit the region last month.\nThe Blues' Fans' Forum will donate the money, including a £5,000 donation to the Just Giving Fund from Everton Football Club, to the League Two club to divide equally with its official charity partners Carlisle Key, which works closely with disadvantaged and homeless young people, and Hospice at Home, which helps families dealing with serious illnesses and conditions.\n\"Like Everton, Carlisle are a beacon of their community and we believe our upcoming game presents an opportunity for us, the fans, to play our part,\" Everton Fans' Forum chairman Nick Mernock said.","url":"https://www.dailymail.co.uk/wires/pa/article-3422586/Roberto-Martinez-comes-fighting-warns-pain-glory.html"}
