{"authors":["Dominic King For Mailonline"],"date_download":"2018-10-22 23:28:50","date_modify":"2018-10-22 23:28:50","date_publish":"2016-01-29 11:15:03","description":"Everton have not won in the Premier League since December 26 and their only victories in the last 12 matches came against Manchester City in the Capital One Cup and Dagenham in the FA Cup.","filename":"data/vaneerConsumption/RobertoMartinezinsistshewillnotmakeexcusesforEvertonspoorformasclublooktosalvageseasonwithFACuprun.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30A48E8E00000578-0-image-a-17_1454065695483.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422589_Roberto-Martinez-insists-not-make-excuses-Everton-s-poor-form-club-look-salvage-season-FA-Cup-run_1540250930.html","title":"Roberto Martinez insists he will not make excuses for Everton's poor form as club look to salvage season with FA Cup run","title_page":"Roberto Martinez insists he will not make excuses for Everton's poor form as club look to salvage season with FA Cup run | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roberto Martinez insists he will not make excuses for Everton's spiralling results as he vowed to meet mounting criticism head on.\nThough the controversy over Everton's elimination from the Capital One Cup continues to linger, Martinez accepts the poor run of form his side have been cannot continue.\nEverton have not won in the Barclays Premier League since December 26 and their only victories in the last 12 matches came against Manchester City in the first leg of the Capital One Cup semi-final and a facile success against Dagenham and Redbridge in the FA Cup.\nLeighton Baines and Ross Barkley (left to right) look dejected during Everton's defeat by Manchester City\nEverton manager Roberto Martinez says he will not make excuses for the club's poor run of form\nThose results have caused supporters to become increasingly restless and Martinez is aware of their feelings. He is adamant, though, that the tide will turn.\nHe said: 'As manager, I need to accept that we need to get wins and I won't ever be a manager coming out with excuses and trying to justify not winning.\n'I'm aware of the huge potential we have. We have huge expectations. I will accept any sort of criticism but I am first to have strong belief we will be successful at the end of it.\n'I share their (the fans) frustration because our football has deserved a lot more. Small margins need to be addressed and I am looking forward to making fans proud of our club.'\nSome supporters have accused Martinez of underachieving given the talent available to him, but the Spaniard insists he is developing a squad capable of winning trophies in the years to come.\nThe Toffees face League Two Carlisle in the fourth round of the FA Cup on Sunday, with captain Phil Jagielka admitting the competition could make the club's season.\nSergio Aguero (second from left) celebrates after scoring in City's Capital One Cup semi-final win this week\nRomelu Lukaku and Arouna Kone (left to right) prepare to take kick-off at the Etihad on Wednesday night\n'We are not underachieving because we never won the title in the last three or four seasons,' Martinez added.\n'Not that we are a group who has reached a level of winning constantly. What we are is an exciting group with the best potential in years of winning something.\n'Won't be overnight and straight forward. We need to get through painful experiences as individuals and as a team to get the know-how.\nMartinez embraces winger Gerard Deulofeu after replacing him with Kone in the second half against City\n'We have made progress, been in a semi-final and a team like City did not swipe us aside. We're showing signs we're getting really close.\n'But we cannot be underachieving when the team has been developing for only two years and we are creating something that will be very powerful in the future.","url":"https://www.dailymail.co.uk/sport/football/article-3422589/Roberto-Martinez-insists-not-make-excuses-Everton-s-poor-form-club-look-salvage-season-FA-Cup-run.html"}
