{"authors":["Robert Hardman For The Daily Mail"],"date_download":"2018-10-22 20:54:51","date_modify":"2018-10-22 20:54:51","date_publish":"2017-03-16 00:11:48","description":"ROBERT HARDMAN: After 40 years of making and selling pies, the Earl of Bradford is now chucking them at internet giant TripAdvisor, where people post online reviews of restaurants and the like.","filename":"data/vaneerConsumption/RobertHardmanEarlwhowenttowarwithTripeAdvisor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/0D5BD89700000578-0-image-a-11_1489623057285.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318344_Robert-Hardman-Earl-went-war-Tripe-Advisor_1540241691.html","title":"Robert Hardman: Earl who went to war with Tripe Advisor!","title_page":"Robert Hardman: Earl who went to war with Tripe Advisor! | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After 40 years of making and selling pies, the Earl of Bradford enjoys throwing a few, too.\nAnd right now, Britain’s poshest restaurateur is cheerfully chucking them — by the plateful — at the multi-billion pound internet giant which, he believes, is guilty of a monstrous injustice against his profession.\nHis target is Tripadvisor, the website where people can post their own reviews of restaurants, hotels, etc., around the world.\n‘How can it be right that people can go on Tripadvisor, make up a name and then write malicious or even made-up reviews about your restaurant?’ asks Lord Bradford, scowling at his laptop. ‘And even when you can prove they are wrong, Tripadvisor does nothing about it.’\nAfter 40 years of making and selling pies, the Earl of Bradford is now chucking them at internet giant TripAdvisor, where people post online reviews of restaurants and the like\nWe are sitting in Porters, a bustling restaurant in the Hertfordshire market town of Berkhamsted. There are no disgruntled customers here today, with the notable exception of the owner.\nLord Bradford has just delivered a broadside in the industry magazine, The Caterer, in which he accuses Tripadvisor of being inaccurate, negligent and ‘almost universally disliked by restaurant and hotel owners’, before issuing a plea for an industry ombudsman to ensure fair play.\nHe turns to an email he has received from rival online restaurant site Yelp, having alerted them to a rude review about his business. Lord Bradford has done some detective work and found the photograph accompanying the review is not of a diner, but from a Mexican immigration website. ‘The review is equally fake,’ he snorts.\nThe Earl makes a point of responding to all online criticism of his own restaurants, however mild. ‘We all make mistakes and I have no problem with people saying so if they are genuine. If someone is unhappy, we’d like to know why.’\nBut when people chuck what he regards as unfounded insults at his food or his staff, he gives it straight back.\nAnd, as a former chairman of the Restaurant Association, Richard Bradford — as he is known in the trade — likes to stand up for any restaurant he feels has suffered an warranted attack.\nOr at least he used to. Then some reviewers started complaining. And for the past three years, Tripadvisor has banned him from sending messages to members of the public using the website.\n‘We felt strongly that Mr Bradford was abusing the messaging function on our site,’ a spokesman for Tripadvisor informs me, ‘and as such we took firm action to ban him from using the tool in future.’\nThe website has supplied me with examples of the Earl’s outbursts against what he calls ‘Tripeadvisor’.\nIn one message, Lord Bradford calls a hostile reviewer a ‘creep’. In another, he defends the owner of another restaurant, saying that she does not deserve ‘idiotic reviewers like you’.\nIt might not be the most diplomatic language, but compared with the vitriol which reviewers merrily tip over the best restaurants, it is baby talk.\nFor example, a trawl of this month’s Tripadvisor traffic includes a review of a well-known Indian restaurant in London’s West End under the headline: ‘Food-poisoned salmonella’. ‘I ordered chicken biryani and thought it tasted a little strange but didn’t think much of it. For the week after, I had salmonella from it.’\nThat is the full extent of a review from someone calling themselves sarahw3896. It is about the most damning charge anyone could make against a restaurant — on a par with watching a panto and then writing: ‘Dick Whittington’s a child molester.’\nThere is not a shred of supporting evidence. If this appeared in a newspaper, the lawyers would erupt. Yet there it sits for Trip-advisor’s 400 million users to see.\n‘How are we supposed to respond?’ asks Lord Bradford, 69, closing his laptop and handing me a menu. Time for lunch. As far as he is concerned, there is nothing new about the much talked-about ‘fake news’ phenomenon that has been obsessing the media.\nIt has, he says, been plaguing his industry ever since Tripadvisor and its rivals set up shop around ten years ago.\nIt does not appear to have done any harm to Porters, though.\nIndeed, some may wonder why the Earl even wants to publicise the problem. The five-star reviews for his restaurant outnumber the one-star stinkers by 20 to one. The food is excellent, if my ham hock pie (£10 with a free glass of prosecco) is anything to go by.\nLord Bradford originally set up Porters in London’s Covent Garden in 1979 and moved it to Berkhamsted with his right-hand man, Neil Wornham, two years ago when the lease expired.\nAs Viscount Newport, son of the 6th Earl of Bradford, he grew up knowing he was likely to take over the family’s Shropshire pile, Weston Park, and its 11,000 acres. After school at Harrow, he studied agriculture at Cambridge and was working on a family farm in Australia when he was badly hurt in a car crash.\nHe returned home and decided to open a restaurant. A few small ventures were followed by Porters, specialising in pies and English grub. Two years later, his father died and he inherited the earldom, the estate — and a bill for £8 million in death duties which would prove insurmountable.\nLord Bradford did a deal with the government and handed his stately home to a charitable trust. The family still own a lot of farmland in the area, but he has no further connection with the family seat. ‘I was thinking of holding my 70th birthday there, but they wanted to charge me an extra £20 for every bottle of wine I brought in,’ he says. ‘So I’ll just put up a marquee in a field.’\nSince then, home has been Chiswick in West London with his wife Penny, the second Countess, who is a consultant obstetrician.\nHe has three grown-up sons and a daughter by his first wife, Joanne. Along the way, he has been a restaurant critic, president of the Guild of Masterchefs and once stood as Ukip parliamentary candidate for Stafford.\nLord Bradford is also the driving force behind faketitles.com, a website which exposes bogus toffs — but his attacks on the fake title merchants, he believes, is partly responsible for some of the abuse against his restaurant.\nWhat infuriates him particularly about Tripadvisor, he says, is its reluctance to hear appeals.\nHe points to a recent reviewer who composed a long rant about an unhappy meal at Porters under the headline ‘Never Again!!!’.\nLord Bradford accused Tripadvisor of being inaccurate, negligent and ‘almost universally disliked by restaurant and hotel owners’\nIt details every stage of an apparently disastrous evening, adding tartly that the party then abandoned Porters for a rival establishment. However, in this case, the reviewer had used a real name which matches a reservation on the night in question.\nAnd because the police now insist that restaurants should install CCTV if they want a licence, Lord Bradford has been able to monitor every stage of the meal. ‘It shows a completely different story,’ he says.\nHe cannot contact the reviewer directly because of his ban from using Tripadvisor, but he has posted a detailed minute-by-minute rebuttal of the review on the website. ‘We are able to show exactly how and why this review is wrong — but Tripadvisor say that they will not adjudicate. So how do you get justice?’\nI hear the same story the following day when I meet two more of Britain’s leading restaurateurs over lunch at Boulestin, the classic French restaurant across the road from St James’s Palace.\nIts founder and boss, Joel Kissin, used to run Sir Terence Conran’s restaurants. He was in charge of the Pont de la Tour, next to Tower Bridge, on the night the Blairs brought the Clintons to dinner.\nAlso present is Mike Gottlieb, who has founded and run so many well-known places that he is ‘president emeritus’ of the Restaurant Association. He has noticed a trend among hostile reviewers. ‘They tend not to have written very many reviews. And even when we have offered them another meal free of charge, not a single one has replied,’ he says.\nJoel adds that bad reviews can be particularly demoralising for his staff and that he once complained to Tripadvisor about an attack on his ‘Parisian’ waiters that was ‘borderline racist’. He says he never got a response.\nSo here we have three eminent restaurateurs who, between them, have notched up more than 100 years in the trade and have operated numerous restaurants, from burger joints to world- class haute cuisine. They do not make these charges lightly. But they are all concerned at the lack of redress for more vulnerable members of the industry whose livelihoods, they say, can be threatened by casual abuse and pure fiction.\nAnd if Tripadvisor really does have safeguards in place, how was the Irish Mail on Sunday able to expose the racket by managing to get a listing for what was a derelict house in Roscommon and use fake reviews to propel it to No. 1 ahead of some 60 genuine restaurants?\nWhen I put Lord Bradford’s charges to Tripadvisor, a spokesman insists that the U.S. company is ‘the industry leader in review fraud detection’, adding: ‘We are confident in our systems and processes, and we work tirelessly to ensure we stay one step ahead of the fraudsters.’\nSo what about a review plainly contradicted by film footage?\n‘That is a subjective opinion that any genuine diner is entitled to express,’ says the spokesman.\nFor his part, Lord Bradford says he will carry on fighting. ‘We just want fairness and transparency,’ he says firmly.\nThen something rather odd happens. No sooner have I raised Lord Bradford’s case with Trip-advisor, than the very next day, his three-year ban on responding to reviewers is mysteriously lifted.\nPerhaps that upper crust has finally found its target.","url":"https://www.dailymail.co.uk/news/article-4318344/Robert-Hardman-Earl-went-war-Tripe-Advisor.html"}
