{"authors":[],"date_download":"2018-10-22 21:28:55","date_modify":"2018-10-22 21:28:55","date_publish":"2014-05-07 12:46:06","description":"A week after taking a leave of absence, crack-smoking Toronto Mayor Rob Ford told a Canadian newspaper, \"Rehab is amazing.\"","filename":"data/vaneerConsumption/RobFordLovesRehabSaysItRemindsMeofFootballCamp.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_27/422946/140506-rob-ford-file-jsw-927a_804ef912b3e8a564ead2aa3633fb1cd9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_rob-ford-loves-rehab-says-it-reminds-me-football-camp-n99101_1540243735.html","title":"Rob Ford Loves Rehab, Says It 'Reminds Me of Football Camp'","title_page":"Rob Ford Loves Rehab, Says It 'Reminds Me of Football Camp'","title_rss":"NULL","source_domain":"nbcnews.com","text":"“I will be on the ballot for mayor in October, guaranteed, and I will do well,” he said. “On Oct. 28, there will be no need to change the locks. There will be no need to clean out my office because I am coming back.”\nFord did not reveal where his rehab is, or even whether it's in Canada. Last week, he was reportedly turned away from the U.S. while boarding a plane for Chicago on his way to a substance-abuse center.\nBut he gave other details about his treatment: He said he participates in meetings with four to eight people, then has a meal before his one-on-one sessions.\n“I am working out every day and I am learning about myself, my past and things like that,” he told the Sun.\nThe treatment center treats \"addictions to alcohol and other things,\" he said, and is helping him realize he needs to change.\n“I think alcohol is the worst drug of all. It makes you do things that you would never do or say things that you wouldn’t,” he said.\nTwo doctors and a professional athlete are among the others getting treatment with him, he said.\n“There are terrific people in my group. We are all supporting each other. We are connecting in a weird way.”\nFord called going to rehab the best decision he ever made.\n“I said to myself, ‘Am I going to try to cover it up for the rest of your life or deal with it and go to professional help?’ ” he said. “I decided to get help.”\n—Elizabeth Chuck","url":"https://www.nbcnews.com/news/world/rob-ford-loves-rehab-says-it-reminds-me-football-camp-n99101"}
