{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 05:51:47","date_modify":"2018-10-23 05:51:47","date_publish":"2017-03-16 16:30:40","description":"The 40-year-old star was clad in an a black suit as he indulged in a spot of lunch at Nobu in Malibu with his 22-year-old girlfriend.","filename":"data/vaneerConsumption/RobinThickestepswithAprilLoveGearyforMalibulunch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E555F7000000578-0-image-a-66_1489679453947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320934_Robin-Thicke-steps-lunch-April-Love-Geary_1540273907.html","title":"Robin Thicke steps with April Love Geary for Malibu lunch","title_page":"Robin Thicke steps with April Love Geary for Malibu lunch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The sun was shining in Los Angeles but Robin Thicke was all business on Wednesday.\nThe 40-year-old star was clad in an a black suit as he indulged in a spot of lunch at Nobu in Malibu with girlfriend April Love Geary.\nRobin emerged from the sushi eatery carrying some leftovers as the pretty 22-year-old model followed close behind chatting on her phone.\nSunny outing: Robin Thicke and girlfriend April Love Geary were spotted having lunch at Nobu on Wednesday\nApril wore a black crop top with flirty mini skirt and donned a leather biker jacket.\nShe kept the look pretty casual as she teamed it with some white sneakers.\nOver the weekend the couple celebrated Robin's 40th birthday with a party at Catch LA.\nApril wore a revealing little black dress with cut-outs on the skirt all the way up to her torso.\nLast week TMZ reported Robin and ex Paula Patton have decided to co-parent their son Julian, six, and 'are far along in working out the details of their custody arrangement.'\nThe 40-year-old singer was suited up in black and carried leftovers back to his car as his 22-year-old girlfriend followed closely behind\nThe former couple met when she was 15 and he was 14, and dated for 10 years before getting married in 2005. She filed for divorce in October 2014.\nBut things still remain tense following the release a dramatic 911 phone call obtained by TMZ last week.\nThe explosive phone conversation revealed his son was trying to avoid his custodial visits 'like the plague'.\nIn an audio clip of a call made to 911 by Paula Patton, 41, and the child's nanny, the pair ask police to intervene and 'enforce a restraining order' because Julian was 'crying and praying to the angels' at the thought of the visit.\nThe Blurred Lines hitmaker also swung by his son's school but left alone. He and his ex-wife Paula Patton are reportedly working on a custody agreement\nNight on the town: The couple celebrated Robin's 40th birthday on Friday at trendy Catch LA\nThe 76-second recording features a female complainant, understood to be Julian’s nanny, requesting police assistance after the child allegedly expressed reluctance to go to a local park with his father.\n'This child is literally begging me and everyone else to call 911. That’s how much he does not want to go,' explained the caller.\nIt is unclear exactly when the call was placed, but it appears to have been sometime after January 26 when a judge granted Patton a temporary retraining order against her ex.\nThe pair were originally scheduled to return to court Monday March 13, but have since postponed the hearing in hopes of finalizing a custody agreement.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320934/Robin-Thicke-steps-lunch-April-Love-Geary.html"}
