{"authors":["Caitlyn Callegari"],"date_download":"2018-10-30 23:09:56","date_modify":"2018-10-30 23:09:56","date_publish":"2014-08-13 23:13:32","description":"The Mark Kaye Show, a radio talk show, just did something fairly interesting, and to their credit, oddly creative, but I'm just not quite sure how I feel about it yet. You see, they've taken some of Robin Williams' greatest movie quotes and combined…","filename":"data/vaneerConsumption/RobinWilliamsEulogizesHimselfThroughHisIconicCharactersVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bbe8cfce-52d7-43f5-8cfc-686f6020d9f4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35699-robin-williams-eulogizes-himself-through-his-iconic-characters-video_1540940996.html","title":"Robin Williams Eulogizes Himself Through His Iconic Characters - VIDEO","title_page":"Robin Williams Eulogizes Himself Through His Iconic Characters — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"The Mark Kaye Show, a radio talk show, just did something fairly interesting, and to their credit, oddly creative, but I'm just not quite sure how I feel about it yet. You see, they've taken some of Robin Williams' greatest movie quotes and combined them together to form a coherent and emotional eulogy for Robin Williams. I can't decide whether it's a beautiful tribute or perhaps it's a bit exploitative of his tragic death. I suppose when an actor of this caliber and with the level of fame he achieved, one is always bordering on that line between what is a mere expression of admiration or when it's simply too much. After all, as much as we feel like did, we didn't know Williams. We knew the actor, not the human, and maybe we should leave the eulogizing up to those who did.\nBut, you can be the judge. You may notice the video starts out almost harshly, with the radio host beaming through the microphone. Then, as it goes on, the tone starts to shift into a more sentimental one. And you realize the quotes from those beloved movies had a definite poignancy to the life of the actor who said them. The eulogy itself is morose, but the inflection is almost optimistic and it leaves you feeling a bit unsettled after having heard it — Much like the news of Williams' untimely death.\nWatch the tribute below:","url":"https://www.bustle.com/articles/35699-robin-williams-eulogizes-himself-through-his-iconic-characters-video"}
