{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:47:20","date_modify":"2018-10-30 23:47:20","date_publish":"2014-08-13 11:30:06","description":"The Internet can be a place of great community and support, but it can also be an unnecessarily dark place. The sudden and tragic death of Robin Williams has apparently brought both sides out to play during this difficult time. That would be well…","filename":"data/vaneerConsumption/RobinWilliamsDaughterZeldaWilliamsQuitsSocialMediaAfterHorrificHarassmentFromInternetTrolls.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/713df716-28d7-4d29-b173-73bff2f88c32.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35564-robin-williams-daughter-zelda-williams-quits-social-media-after-horrific-harassment-from-internet-trolls_1540943240.html","title":"Robin Williams' Daughter Zelda Williams Quits Social Media After Horrific Harassment From Internet Trolls","title_page":"Robin Williams' Daughter Zelda Williams Quits Social Media After Horrific Harassment From Internet Trolls","title_rss":"NULL","source_domain":"bustle.com","text":"The Internet can be a place of great community and support, but it can also be an unnecessarily dark place. The sudden and tragic death of Robin Williams has apparently brought both sides out to play during this difficult time. That would be well and good — or as good as it can get considering how the Internet is best approached with a sense of resignation about the fact that some people are going to use the anonymity it provides to be jerks — but this is taking it way too far. Robin Williams' daughter Zelda Williams quit Twitter and Instagram after being harassed by Internet trolls and there is absolutely no excuse to be a jerk to a grieving woman, especially on the subject of her father's death.\nThe general reaction to Robin Williams' death has been great sadness and an outpouring of love and support to the family he left behind. Some fans have made memorials in Robin Williams' honor, celebrities have opened up about how much Robin Williams meant to them, and tributes of every kind have been made to commemorate the passing of a truly amazing man. However, some people actually took the time to, according to US Weekly, \"post horrific comments and pictures\" on Zelda Williams' Twitter page in a stunt that goes beyond simple cruelty. In fact, cruelty is an understatement.\nWilliams at first simply requested that her followers report the trolls, but, eventually, US Weekly reports that she deleted the tweet she had been getting such negative messages in response to and replaced it with another tweet announcing her break from Twitter. Thankfully, Williams didn't delete her Twitter entirely so the trolls didn't completely win. Taking a well-justified break from something that's causing you unnecessary pain during an already hard time is understandable, but Williams didn't empower the trolls by deleting something that's also brought her great happiness and support, especially in the last few days, either. That says wonders about her strength of character and spirit.\nShe followed this with a final Instagram message declaring her intent to step back from that website as well: \"I will be leaving this account for a [bit] while I heal and decide if I'll be deleting it or not. In this difficult time, please try to be respectful of the accounts of myself, my family and my friends. Mining our accounts for photos of dad, or judging me on the number of them is cruel and unnecessary. There are a couple throughout, but the real private moments I shared with him were precious, quiet, and believe it or not, not full of photos or 'selfies'.\"\n\"I shared him with a world where everyone was taking their photo with him,\" the message continued. \"But I was lucky enough to spend time with him without cameras too. That was more than enough, and I'm grateful for what little time I had. My favorite photos of family are framed in my house, not posted on social media, and they'll remain there. They would've wound up on the news or blogs then, and they certainly would now. That's not what I want for our memories together. Thank you for your respect and understanding in this difficult time. Goodbye.\"\nIt's incredible to believe that anyone would actually be needlessly cruel enough to harass a woman in mourning, especially when it becomes clearer with each and every passing day that Robin Williams touched so many lives in the time he's been acting and even before, but Zelda Williams said it best in her personal statement. To \"those who are sending negativity, know that some small, giggling part of him is sending a flock of pigeons to your house to poop on your car. Right after you’ve had it washed.\"\nImage: zeldawilliams/Instagram","url":"https://www.bustle.com/articles/35564-robin-williams-daughter-zelda-williams-quits-social-media-after-horrific-harassment-from-internet-trolls"}
