{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:49:17","date_modify":"2018-10-30 22:49:17","date_publish":"2014-08-14 18:48:41","description":"This is heartbreaking. According to a just-released statement from late comedic legend Robin Williams' wife, Susan Schneider, Williams was suffering from the early stages of Parkinson's disease at the time of his death earlier this week, and he…","filename":"data/vaneerConsumption/RobinWilliamsHadParkinsonsDiseaseAttheTimeofHisDeathHisWifeSays.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/471519d6-ce47-4336-8daa-71a842588d09.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35824-robin-williams-had-parkinsons-disease-at-the-time-of-his-death-his-wife-says_1540939757.html","title":"Robin Williams Had Parkinson's Disease At the Time of His Death, His Wife Says","title_page":"Robin Williams Had Parkinson's Disease At the Time of His Death, His Wife Says","title_rss":"NULL","source_domain":"bustle.com","text":"This is heartbreaking. According to a just-released statement from late comedic legend Robin Williams' wife, Susan Schneider, Williams was suffering from the early stages of Parkinson's disease at the time of his death earlier this week, and he hadn't been ready to share his diagnosis publicly just yet. The actor, who was also struggling with bipolar disorder and depression, died on Monday at the age of 63 of an apparent suicide by asphyxia.\nWilliams had long supported efforts to raise money for charities that support Parkinson's disease research, and starred in a film back in 1990 called Awakenings that involved Parkinson's disease as well. Additionally, Williams had been admitted to a rehab facility about a month ago to help with his depression.\nSchneider's statement, via Deadline , encourages those who are suffering from issues like depression to seek help for their struggles:\nRobin spent so much of his life helping others. Whether he was entertaining millions on stage, film or television, our troops on the frontlines, or comforting a sick child — Robin wanted us to laugh and to feel less afraid. Since his passing, all of us who loved Robin have found some solace in the tremendous outpouring of affection and admiration for him from the millions of people whose lives he touched. His greatest legacy, besides his three children, is the joy and happiness he offered to others, particularly to those fighting personal battles.\nThe statement goes on to reveal Williams' struggle with Parkinson's out of the public eye:\nRobin’s sobriety was intact and he was brave as he struggled with his own battles of depression, anxiety as well as early stages of Parkinson’s Disease, which he was not yet ready to share publicly. It is our hope in the wake of Robin’s tragic passing, that others will find the strength to seek the care and support they need to treat whatever battles they are facing so they may feel less afraid.","url":"https://www.bustle.com/articles/35824-robin-williams-had-parkinsons-disease-at-the-time-of-his-death-his-wife-says"}
