{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:28:59","date_modify":"2018-10-30 22:28:59","date_publish":"2014-08-15 15:38:21","description":"During his time in Hollywood, Robin Williams had one of the most stellar, amazing careers any actor could have hoped for. The comedic legend's ability to mix the truly moving and emotional with the zany and lighthearted was genius, and his screen…","filename":"data/vaneerConsumption/RobinWilliamsTributeIsTouchingWillRemindYoutoMakeYourLifeSpectacularVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e4acd3ac-e94c-4e03-a031-f101878453a0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35933-robin-williams-tribute-is-touching-will-remind-you-to-make-your-life-spectacular-video_1540938539.html","title":"Robin Williams Tribute Is Touching & Will Remind You to \"Make Your Life Spectacular\" - VIDEO","title_page":"Robin Williams Tribute Is Touching & Will Remind You to \"Make Your Life Spectacular\" — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"During his time in Hollywood, Robin Williams had one of the most stellar, amazing careers any actor could have hoped for. The comedic legend's ability to mix the truly moving and emotional with the zany and lighthearted was genius, and his screen presence was like none other anyone has seen. He will truly be missed. To honor the late actor, who passed away earlier this week at the age of 63, YouTube channel ModernGreen has put together a touching tribute video for Robin Williams, which includes one of Williams' most memorable monologues from his 1996 film Jack (in which he played a rapidly aging young boy), coupled with scenes from his films, including everything from Hook to Patch Adams to Good Will Hunting to Mrs. Doubtfire.\n\"...We start to worry , thinking, \"What am I gonna do? Where am I gonna be in ten years?\" But I say to you, \"Hey, look at me!\" Please, don't worry so much. Because in the end, none of us have very long on this Earth. Life is fleeting. And if you're ever distressed, cast your eyes to the summer sky when the stars are strung across the velvety night,\" the quote reads. \"And when a shooting star streaks through the blackness, turning night into day... make a wish and think of me. Make your life spectacular. I know I did.\"\nO captain, my captain...you will be missed.","url":"https://www.bustle.com/articles/35933-robin-williams-tribute-is-touching-will-remind-you-to-make-your-life-spectacular-video"}
