{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:56:42","date_modify":"2018-10-30 22:56:42","date_publish":"2014-08-14 16:19:43","description":"One of Robin Williams' final films, Merry Friggin' Christmas, isn't set to be released until November, but to honor the late actor who passed away earlier this week at the age of 63, the studio has already released a new clip from the project. The…","filename":"data/vaneerConsumption/RobinWilliamsMerryFrigginChristmasClipIsTrulyEmotionaltoWatchVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c5dbb3bc-ea58-42ca-b094-8484de47680d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35780-robin-williams-merry-friggin-christmas-clip-is-truly-emotional-to-watch-video_1540940202.html","title":"Robin Williams' 'Merry Friggin' Christmas' Clip Is Truly Emotional to Watch - VIDEO","title_page":"Robin Williams' 'Merry Friggin' Christmas' Clip Is Truly Emotional to Watch — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"One of Robin Williams' final films, Merry Friggin' Christmas, isn't set to be released until November, but to honor the late actor who passed away earlier this week at the age of 63, the studio has already released a new clip from the project. The clip is short (only running at about 43 seconds in length), but manages to capture exactly what made Williams such a memorable, amazing on-screen presence: He gave off such a genuine warmth in any role he took on. As difficult as it's been to accept the fact that Williams is no longer with us, watching this clip does bring some much-needed comfort.\nThe film, which is set for release on November 7, also stars Lauren Graham and Joel McHale as a couple named Luanne and Boyd Mitchler, who are roped into spending Christmas with Boyd's wild family, including Williams as his father. In the clip, we get a look at just how wild they are: When all the cookies and milk are gone, leaving nothing to give to Santa, Williams' character suggests bourbon and asparagus. Classic.\nYou can check out the clip below. In addition to Merry Friggin' Christmas, Williams also left behind three other films set for release in the near future: Night at the Museum: Secret of the Tomb, Absolutely Anything, and Boulevard.\nEntertainment Tonight on YouTube\nImage: YouTube","url":"https://www.bustle.com/articles/35780-robin-williams-merry-friggin-christmas-clip-is-truly-emotional-to-watch-video"}
