{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:50:10","date_modify":"2018-10-30 23:50:10","date_publish":"2014-08-12 23:05:23","description":"Oof. When someone like Robin Williams dies, it can feel at moments like the whole world's taken a break to mourn him. That's not true, of course — the world doesn't really know how to stop, even when it should. But there's a lot of reminiscence…","filename":"data/vaneerConsumption/RobinWilliamsLouisCKInLouieSeason3SharedaBittersweetTellingMomentVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bc6c3385-9a1c-43d2-9438-47d14ea0482f.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35522-robin-williams-louis-ck-in-louie-season-3-shared-a-bittersweet-telling-moment-video_1540943410.html","title":"Robin Williams & Louis CK In 'Louie' Season 3 Shared a Bittersweet & Telling Moment - VIDEO","title_page":"Robin Williams & Louis CK In 'Louie' Season 3 Shared a Bittersweet & Telling Moment — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Oof. When someone like Robin Williams dies, it can feel at moments like the whole world's taken a break to mourn him. That's not true, of course — the world doesn't really know how to stop, even when it should. But there's a lot of reminiscence happening right now, in fitting with the legacy a legend like Williams leaves behind. This is amplified, it would seem, when some of what the departed left behind dealt explicitly with death — like Robin Williams' episode of Louie .\nCentered around the death of a (not particularly well-liked) club owner, Williams and Louis C.K. share a moment at the end of he episode wherein they promise to attend each other's funerals. Given the obvious circumstances, the moment's going a bit viral following Williams' passing.\nOne video title proclaimed this a \"foreshadowing of Williams's death\" — but considering that all of us die eventually, let's consider this more of a melancholy acknowledgment of mortality between peers. Considering these peers are comedians — AKA people who devoted their lives to a career of making people laugh — it just makes it all the more bittersweet.\nYou can see screenshots of the scene below, and video below that:\nYouTube\nImages: FX, 9Gag","url":"https://www.bustle.com/articles/35522-robin-williams-louis-ck-in-louie-season-3-shared-a-bittersweet-telling-moment-video"}
