{"authors":["Elizabeth Ballou"],"date_download":"2018-10-30 23:36:04","date_modify":"2018-10-30 23:36:04","date_publish":"2014-08-13 16:18:55","description":"If your Facebook news feed is anything like mine, you've seen a particular image show up once, twice, 10, 20 times over the past two days since Robin Williams' death. It's a picture of Aladdin's Genie, whom Robin Williams voiced, hugging the titular…","filename":"data/vaneerConsumption/RobinWilliamsSuicideIsGenieYoureFreeTouchingOrHarmful.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/55d3033e-774c-4af2-b06b-a18d4f4cb6a2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35589-robin-williams-suicide-is-genie-youre-free-touching-or-harmful_1540942564.html","title":"Robin Williams' Suicide: Is \"Genie, You're Free\" Touching Or Harmful?","title_page":"Robin Williams' Suicide: Is \"Genie, You're Free\" Touching Or Harmful?","title_rss":"NULL","source_domain":"bustle.com","text":"If your Facebook news feed is anything like mine, you've seen a particular image show up once, twice, 10, 20 times over the past two days since Robin Williams' death. It's a picture of Aladdin's Genie, whom Robin Williams voiced, hugging the titular character and smiling peacefully. The caption is: \"Genie, you're free.\" Originally tweeted by the Academy of Motion Picture Arts and Sciences, it's been retweeted 319,504 times and shared on Facebook, Tumblr, and other social media sites as well. Williams was a major creative force behind movies like Aladdin, Good Will Hunting, Dead Poets' Society, and many others, so it seems appropriate at first blush.\nBut here's a question we might want to be asking ourselves: In the wake of Williams' suicide, do those three words send an appropriate message?\nAccording to Christine Moutier, the chief medical officer at the American Foundation for Suicide Prevention, they have the potential to do more harm than good. In essence, they could be interpreted as making suicide seem like a viable choice. “If it doesn't cross the line, it comes very, very close to it. Suicide should never be presented as an option,\" she said. \"That’s a formula for potential contagion.” Though the Aladdin quote likely seems innocuous to those who are not suffering from any kind of mental illness that could involve suicidal thoughts, those who do have depression, bipolar disorder, borderline personality disorder, and other afflictions could see it in a different light.\n\"Suicide should never be presented as an option.\"\nAccording to Healthline, one in 10 Americans experiences depression, or about 31.8 million people. About 2.6 percent of the population is affected by bipolar disorder, or about 5.5 million people, while 1.6 percent is affected by borderline personality disorder (BPD). Those and a host of other mental illnesses (such as addiction and substance abuse, schizophrenia, and anxiety disorders) can lead to suicidal ideation, or a preoccupation with suicide. For all those affected by such illnesses, \"Genie, you're free\" and similar messages could lead to consideration of, and even attempts at, suicide. It presents suicide as a way to free oneself from the shackles of mental illness.\nAwareness of such \"copycat suicides,\" in which a death that attracts a lot of media attention and viral sharing can set off a chain reaction among similarly affected groups, is especially important for those within Williams' age cohort. According to the Centers for Disease Control and Prevention (CDC), suicide rates among adults 45 to 64 rose 40 percent between 1999 and 2011, making them the top at-risk group.\nAlex Crosby, an epidemiologist at the CDC, said that this may be because suicide prevention efforts are most often aimed at the young and the elderly. \"Middle-aged adults got kind of left out in the thinking of where to focus resources for suicide prevention. It's important for us to examine [them] more closely and put more resources into that population.\"\nTherefore, having a positive, helpful conversation about Williams' death ought to include two factors: promoting suicide helplines and resources like the National Suicide Prevention Lifeline, instead of suggesting it as a solution (even unintentionally) and being especially aware of the potential for suicide among the middle-aged. Focusing media attention on the impact of Williams' life, rather than the details of his death, is not only mentally healthier but also reflects how his family wants us to discuss him:\n\"On behalf of Robin's family, we are asking for privacy during our time of profound grief. As he is remembered, it is our hope the focus will not be on Robin's death, but on the countless moments of joy and laughter he gave to millions.\" - Susan Schneider, his wife\nImage: Wall Street Journal","url":"https://www.bustle.com/articles/35589-robin-williams-suicide-is-genie-youre-free-touching-or-harmful"}
