{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:04:51","date_modify":"2018-10-30 23:04:51","date_publish":"2014-08-14 11:26:56","description":"At this point, we've seen a lot of different tributes and memorials from a lot of different people — fans and celebrities alike — in honor of Robin Williams. When Williams died, the world was shocked and devastated to have lost such a bright talent…","filename":"data/vaneerConsumption/RobinWilliamsMemoryHonoredByBroadwaysAladdinCastwithGorgeousFriendLikeMeSingAlongVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/dddd02b2-db49-48a3-bbec-66e765bc5699.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35727-robin-williams-memory-honored-by-broadways-aladdin-cast-with-gorgeous-friend-like-me-sing-along-video_1540940691.html","title":"Robin Williams' Memory Honored By Broadway's 'Aladdin' Cast with Gorgeous \"Friend Like Me\" Sing-Along - VIDEO","title_page":"Robin Williams' Memory Honored By Broadway's 'Aladdin' Cast with Gorgeous \"Friend Like Me\" Sing-Along — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"At this point, we've seen a lot of different tributes and memorials from a lot of different people — fans and celebrities alike — in honor of Robin Williams. When Williams died, the world was shocked and devastated to have lost such a bright talent that brought such joy to so many lives. From turning the Good Will Hunting bench into a memorial to on-air tributes done by Conan O'Brien, Jimmy Fallon, and Seth Meyers, there seems to be no person or thing that Williams has not impacted over the course of his decadeslong career. One such impact is the current Broadway show, Aladdin, which owes a lot to Williams for the success of the film that inspired it. Naturally, Broadway's Aladdin cast honored Williams' memory with a tribute of their own that's more than worthy of recognition.\nOn Tuesday night, the first time an Aladdin show was performed after Williams' death, audience members found the lyrics to the film version of \"Friend Like Me\" tucked into their playbills. After the show was over, James Monroe Iglehart, who plays Genie in the production, made a beautiful speech in Williams' honor which ended with the words, \"Yesterday, we lost one of the greatest — not comedians but one of the greatest entertainers of all time. So, we're only going to do this once because we don't want to drag something on, because . . . we want to give our hearts and our prayers and our thoughts to his family. Because he's a husband and a father first and an entertainer second.\"\nThen he encouraged everyone to open their playbills, remove their copy of the \"Friend Like Me\" lyrics, and sing the first verse with him and the other case members.\nAssociated Press on YouTube\nAfter Iglehart strode up and down the stage making sure that every person in the audience was singing at the top of their longs, he closed out the sing-along by pointing to the sky as if to say, \"This one's for you, Robin.\" In addition to the Broadway Aladdin cast's beautiful tribute, Broadway marquee lights were dimmed for a full minute at 7:45 p.m on Wednesday, a traditional custom that Broadway uses to honor the passing of an on-stage legend.\nWilliams might not have starred in Broadway's Aladdin himself, or been known for his work on the stage, but he did, in fact, perform on Broadway and off-Broadway in Waiting for Godot in 1988, Robin Williams: Live on Broadway in 2002, and Bengal Tiger at the Baghdad Zoo in 2011. As far as Broadway is concerned, he is one of their legends just as much as he is a legend in film, television, and stand-up comedy. That they should commemorate his legacy in a way that combined tradition with heartwarming respect was truly beautiful.","url":"https://www.bustle.com/articles/35727-robin-williams-memory-honored-by-broadways-aladdin-cast-with-gorgeous-friend-like-me-sing-along-video"}
