{"authors":["Sofia Barrett-Ibarria"],"date_download":"2018-10-30 22:35:54","date_modify":"2018-10-30 22:35:54","date_publish":"2014-08-15 00:17:45","description":"In the wake of Robin Williams' passing, much has been written about his Oscar-winning performances and iconic film roles, many of which have come to symbolize essential moments in pop-culture history. Though Williams was most widely recognized as a…","filename":"data/vaneerConsumption/RobinWilliamsMostMemorableTVRolesFromMorkMindytoFriendsVIDEOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/cc67b4f3-6ebf-4036-8539-2be76bd4b438.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35859-robin-williams-most-memorable-tv-roles-from-mork-mindy-to-friends-videos_1540938954.html","title":"Robin Williams' Most Memorable TV Roles: From 'Mork & Mindy' to 'Friends' - VIDEOS","title_page":"Robin Williams' Most Memorable TV Roles: From 'Mork & Mindy' to 'Friends' — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"In the wake of Robin Williams' passing, much has been written about his Oscar-winning performances and iconic film roles, many of which have come to symbolize essential moments in pop-culture history. Though Williams was most widely recognized as a dynamic film actor known for portraying a vast array of diverse personalities with incredible skill and precision, he also enjoyed a successful career in television. In fact, Williams got his start on TV. His celebrity and success as an actor can be traced back to his breakout role on the TV series Mork & Mindy.\nAn engaging performer, stand-up comedian, and voiceover professional, Williams could do it all, but one of his most under-appreciated achievements was his success in television. Williams' absence will no doubt be deeply felt at the upcoming 66th Annual Emmy Awards, as his death has had a profound effect on the entertainment community to which Williams belonged. Williams' passing represents a great loss to the world of television acting as he himself was an Emmy-nominated actor.\nAs this years Emmys approach, the awards show will pay tribute to Robin Williams and honor his amazing achievements in television. A look back on Williams' most memorable television roles and appearances show that he was just as hilarious and dynamic on TV as he was in his famous film roles:\nMork & Mindy\nYouTube\nRobin Williams nabbed his breakthrough role was on the ABC sitcom Mork & Mindy, also starring Pam Dawber. Williams played a space alien named Mork who travels to Earth in an egg-shaped spacecraft from the planet Mork. The series earned Williams his first Emmy nomination for lead actor in a comedy series.\nHomicide: Life On The Street\nSleepingThroughHell on YouTube\nWilliams played Robert Ellison, whose wife is shot and killed in front of him and their children. The role earned him an Emmy nomination for Guest Actor in a Drama Series.\nFriends\nFRIENDSaddicts on YouTube\n\"He's got access.\"\nLaw & Order: SVU\nRhymePhile on YouTube\nLike many before him, Williams appeared on an episode of Law & Order: SVU as Merritt Rook, audio engineer with a dark side.\nWilfred\nYouTube\nWhen Elijah Wood’s Ryan goes insane, Williams appeared as his Good Will Hunting-quoting therapist.\nLouie\nYouTube\nIn this poignant funeral scene, Williams' and Louis C.K's characters bond over the death of a mutual acquaintance.\nThe Crazy Ones\nEdwin fonseca on YouTube\nWilliams gave a hilarious performance as the head of a Chicago ad agency. Classic Robin Williams comedy at its best.","url":"https://www.bustle.com/articles/35859-robin-williams-most-memorable-tv-roles-from-mork-mindy-to-friends-videos"}
