{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:49:26","date_modify":"2018-10-30 22:49:26","date_publish":"2014-08-14 17:58:01","description":"Not only was Robin Williams a tremendous actor and comedian, but he was an incredibly talented improviser. It's evident from clips from Williams' appearances on Whose Line Is It Anyway that he was a master of improv. His quick wit is apparent, and…","filename":"data/vaneerConsumption/RobinWilliamsWhoseLineIsItAnywayEpisodeShowsOffHisGenerousSpiritVIDEOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/fbd83281-d1b6-4d82-b58d-bf321c080b93.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35796-robin-williams-whose-line-is-it-anyway-episode-shows-off-his-generous-spirit-videos_1540939766.html","title":"Robin Williams' 'Whose Line Is It Anyway' Episode Shows Off His Generous Spirit - VIDEOS","title_page":"Robin Williams' 'Whose Line Is It Anyway' Episode Shows Off His Generous Spirit — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"Not only was Robin Williams a tremendous actor and comedian, but he was an incredibly talented improviser. It's evident from clips from Williams' appearances on Whose Line Is It Anyway that he was a master of improv. His quick wit is apparent, and it's clear that he was a generous player, feeding off of the idea that was given to him in the short form games or in the longer, more involved scenes.\nWatching Williams in some of his Whose Line clips is an excellent way to remember the actor because yes, while we will remember his most poignant, powerful, and hilarious roles, it's in his stand-up from his earlier days and in his improv work that we get to see him. And yes, while it's still somewhat of a stage persona, it's really just him, the audience, and in this case, the people with whom he's working. Or more aptly, with whom he's playing.\nAnd that's the one thing in particular that makes revisiting some of Williams's Whose Line appearances so particularly poignant. You can see that the people with whom he's working — Ryan Stiles, Wayne Brady, Colin Mochrie, and Drew Carey — are having so much fun with him. That's improv in a nutshell: saying \"yes\" and being generous to the person with whom you're playing. It's about fun and sharing a moment with other people. To be a master of improv you need to be a master of generosity.\nPerhaps, like myself, you've spent the week revisiting some of Wiliams' old movies, but take some time to also revisit his improv. You can watch a clip of a very memorable \"Scenes from A Hat\" segment below:\n2012boy on YouTube\nYou can view some more clips here:","url":"https://www.bustle.com/articles/35796-robin-williams-whose-line-is-it-anyway-episode-shows-off-his-generous-spirit-videos"}
