{"authors":["Alanna Bennett"],"date_download":"2018-10-30 22:36:00","date_modify":"2018-10-30 22:36:00","date_publish":"2014-08-14 23:09:56","description":"The tributes to the late, great comedian Robin Williams will continue into this weekend, it seems, and fittingly enough. Flipping through the channels the weekend of Aug 15 and 16, Disney channels will be airing Aladdin in honor of Williams. A…","filename":"data/vaneerConsumption/RobinWilliamsToBeHonoredOnDisneyNetworksWithAladdinButThatsNottheEndoftheStory.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d64caf0c-4dd0-4818-b3e8-a4044c63e0a7.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35863-robin-williams-to-be-honored-on-disney-networks-with-aladdin-but-thats-not-the-end-of_1540938960.html","title":"Robin Williams To Be Honored On Disney Networks With 'Aladdin' But That's Not the End of the Story","title_page":"Robin Williams To Be Honored On Disney Networks With 'Aladdin' But That's Not the End of the Story","title_rss":"NULL","source_domain":"bustle.com","text":"The tributes to the late, great comedian Robin Williams will continue into this weekend, it seems, and fittingly enough. Flipping through the channels the weekend of Aug 15 and 16, Disney channels will be airing Aladdin in honor of Williams. A tribute, and a reminder: He may be gone, but his presence isn't going anywhere.\nWilliams' voice work as the Genie is just one beloved work in an entire career of beloved work — and it's also a good reminder, amidst the revelations about his health and his death, of just how amazingly talented this man was. Williams' Genie's as iconic a performance as animated film's seen in a century.\nIt's interesting to remember, though, that Williams' relationship with his animators was not uncomplicated — and that's not even to mention the arguably questionable tweet the Academy sent out after his death. But Williams and Disney had a complicated past. As The Daily Beast's Kevin Fallon wrote, recalling a Today Show interview Williams once gave:\n“The one thing I said was I will do the voice. I’m doing it basically because I want to be part of this animation tradition,” [Williams] said. “I want something for my children. One deal is, I just don’t want to sell anything—as in Burger King, as in toys, as in stuff.” Naturally, the Genie did appear in copious amounts of marketing for the film, with Williams’s voice used in some commercials.\n[...] “You realize when you work for Disney why the mouse has only four fingers—because he can’t pick up a check,” he said at the time. He claimed that his work as Genie was a favor to company, which he considered the “Rolls-Royce of animation.” He said that he was under the impression that he’d be required for a day of work, but ended up having to record for weeks. Then, when his voice was used in marketing, he said “it was like a violation of a trust.”\nA notable part of Williams' career took place with characters who lived lives that could be considered very anti-authority. Dead Poets Society, Good Morning Vietnman — even Genie himself. So watch Aladdin on one of Disney's channels this weekend, if it moves you — it's a movie worth remembering. But remember, as you do it, what Robin Williams really represented.\nImage: Disney","url":"https://www.bustle.com/articles/35863-robin-williams-to-be-honored-on-disney-networks-with-aladdin-but-thats-not-the-end-of"}
