{"authors":["Anna Klassen"],"date_download":"2018-10-30 23:50:01","date_modify":"2018-10-30 23:50:01","date_publish":"2014-08-13 01:48:08","description":"Robin Williams' children must be going through Hell. Their father pasted away Monday morning of an apparent suicide, and they are coping as best they can. The children of Robin Williams have each released a statement about their father that will…","filename":"data/vaneerConsumption/RobinWilliams3ChildrenReleaseTouchingStatementsAboutTheirLateFather.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/08925c22-094e-4465-ada4-0cde6a71f9c2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35546-robin-williams-3-children-release-touching-statements-about-their-late-father_1540943401.html","title":"Robin Williams' 3 Children Release Touching Statements About Their Late Father","title_page":"Robin Williams' 3 Children Release Touching Statements About Their Late Father","title_rss":"NULL","source_domain":"bustle.com","text":"Robin Williams' children must be going through Hell. Their father pasted away Monday morning of an apparent suicide, and they are coping as best they can. The children of Robin Williams have each released a statement about their father that will likely bring a tear to your eye. As we try to cope with our own grief surrounding the beloved comedian, his children have been brave enough to let us know exactly what he meant to each of them. Their statements are below.\nZachary Williams\n“Yesterday, I lost my father and a best friend and the world got a little grayer. I will carry his heart with me every day. I would ask those that loved him to remember him by being as gentle, kind, and generous as he would be. Seek to bring joy to the world as he sought.”\nZelda Williams\n“My family has always been private about our time spent together. It was our way of keeping one thing that was ours, with a man we shared with an entire world. But now that’s gone, and I feel stripped bare. My last day with him was his birthday, and I will be forever grateful that my brothers and I got to spend that time alone with him, sharing gifts and laughter. He was always warm, even in his darkest moments. While I’ll never, ever understand how he could be loved so deeply and not find it in his heart to stay, there’s minor comfort in knowing our grief and loss, in some small way, is shared with millions. It doesn’t help the pain, but at least it’s a burden countless others now know we carry, and so many have offered to help lighten the load. Thank you for that.\nTo those he touched who are sending kind words, know that one of his favorite things in the world was to make you all laugh. As for those who are sending negativity, know that some small, giggling part of him is sending a flock of pigeons to your house to poop on your car. Right after you’ve had it washed. After all, he loved to laugh too…\nDad was, is and always will be one of the kindest, most generous, gentlest souls I’ve ever known, and while there are few things I know for certain right now, one of them is that not just my world, but the entire world is forever a little darker, less colorful and less full of laughter in his absence. We’ll just have to work twice as hard to fill it back up again.”\nStephen Shugerman/Getty Images Entertainment/Getty Images\nCody Williams\nThere are no words strong enough to describe the love and respect I have for my father. The world will never be the same without him. I will miss him and take him with me everywhere I go for the rest of my life, and will look forward, forever, to the moment when I get to see him again.”","url":"https://www.bustle.com/articles/35546-robin-williams-3-children-release-touching-statements-about-their-late-father"}
