{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:43:08","date_modify":"2018-10-30 22:43:08","date_publish":"2014-08-14 20:34:04","description":"It's a scene ingrained in the memories of all '90s kids and their parents: Robin Williams, his hair in curlers but his makeup undone, plopping his face into a icing-covered cake in order to prevent a visitor from discovering his true identity. Mrs.…","filename":"data/vaneerConsumption/RobinWilliamsFamousMrsDoubtfireSceneInspiresaFantasticNewSuicidePreventionCampaignVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/20c735cc-7531-44a5-8b05-164188434fa2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35839-robin-williams-famous-mrs-doubtfire-scene-inspires-a-fantastic-new-suicide-prevention-campaign-video_1540939388.html","title":"Robin Williams' Famous 'Mrs. Doubtfire' Scene Inspires a Fantastic New Suicide Prevention Campaign - VIDEO","title_page":"Robin Williams' Famous 'Mrs. Doubtfire' Scene Inspires a Fantastic New Suicide Prevention Campaign — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"It's a scene ingrained in the memories of all '90s kids and their parents: Robin Williams, his hair in curlers but his makeup undone, plopping his face into a icing-covered cake in order to prevent a visitor from discovering his true identity. Mrs. Doubtfire was a movie filled with fantastic moments, but this short scene is particularly memorable — and now it's the inspiration for a challenge called \"Doubtfire Face,\" a new campaign meant to honor the memory of Robin Williams and spread awareness for those suffering from depression.\nWith just a little under 1,500 likes so far, a Facebook page called \"Doubtfire Face for Suicide Prevention\" wants participants to re-enact Williams' famous scene, dipping their faces in frosting (or shaving cream, or whipped cream) and imitating his iconic \"helloooooo!\" Similar to the \"Ice Bucket Challenge\" currently going around Facebook, those who do the \"Doubtfire Face\" are suggested to nominate friends, mention the campaign, and encourage viewers to donate to the American Foundation for Suicide Prevention.\n\"In the United States, a person dies by suicide every 13.7 minutes claiming more than 38,000 lives each year (AFSP, 2014),\" the page states. \"In order to spread awareness for suicide prevention, we honor the late Robin Williams with the iconic #DoubtfireFace.\"\nThe group hopes to raise $500,000 for the organization, and so far, just $145 has been counted. Once the videos spread, though, as they surely will, the donations should pour in much more quickly.\nIt's a great idea, and one that'll undoubtedly have major effects. After all, the Ice Bucket Challenge has helped raise hundreds of thousands of dollars for ALS in a matter of days, and that campaign wasn't inspired by the recent death of a beloved celebrity. With Williams' memory as the motivation, I expect people doing the \"Doubtfire Face\" to soon become just as common a sight on Facebook feeds as those dumping ice over their heads, and for suicide prevention to receive major, necessary awareness.\nSo, if you have a bowl of frosting and a camera nearby, get to work; \"Doubtfire Face\" is about to be the next big thing, and you won't want to miss out on this (tasty), important chance to honor the legendary Robin Williams and bring attention to an incredibly worthy cause.\nCheck out a sample video below:\nJoseph Pitt on YouTube\nAnd here's Williams' iconic scene:\nGreat Stag on YouTube\nImage: 20th Century Fox","url":"https://www.bustle.com/articles/35839-robin-williams-famous-mrs-doubtfire-scene-inspires-a-fantastic-new-suicide-prevention-campaign-video"}
