{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:52:36","date_modify":"2018-10-30 22:52:36","date_publish":"2014-08-14 17:29:59","description":"Robin Williams' role in Good Will Hunting is generally remembered for its seriousness — the grief over his wife, the counseling of Will (Matt Damon), the beloved, famous \"it's not your fault\" speech. Yet according to producer Harvey Weinstein,…","filename":"data/vaneerConsumption/RobinWilliamsPrankonGoodWillHuntingCoStarStellanSkarsgardWasPerfect.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/fa5e26f6-8927-4a79-a36a-c20fdcbf0ae6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35795-robin-williams-prank-on-good-will-hunting-co-star-stellan-skarsgard-was-perfect_1540939956.html","title":"Robin Williams' Prank on 'Good Will Hunting' Co-Star Stellan Skarsgard Was Perfect","title_page":"Robin Williams' Prank on 'Good Will Hunting' Co-Star Stellan Skarsgard Was Perfect","title_rss":"NULL","source_domain":"bustle.com","text":"Robin Williams' role in Good Will Hunting is generally remembered for its seriousness — the grief over his wife, the counseling of Will (Matt Damon), the beloved, famous \"it's not your fault\" speech. Yet according to producer Harvey Weinstein, off-set, Williams was all laughter — specifically, pulling pranks on his co-stars, including, most memorably, a joke he played on actor Stellan Skarsgard.\nAs Weinstein recalled in a Thursday interview, Skarsgard, who played Professor Lambeau in the 1997 film, had just arrived in the U.S. prior to the movie's production and was unfamiliar with making American movies. Williams took the opportunity to play a joke on the actor, telling Weinstein and director Gus Van Sant that he wanted to make Skarsgard think in filming Good Will Hunting, the key to any scene was an extensive use of improv.\n\"Robin says to Gus and me, 'Let's welcome him to America. I'm going to change the script, and Gus, you tell him it's all about improvisation,'\" Weinstein said.\nSo they did — and, as one could imagine, the result was total chaos.\n\"So here's this scene about mathematic formulas, and Robin comes out and goes, 'Jack Nicholson.' And then he does Jack Nicholson,\" recalled the producer. \"And then Gus, he's pointing to Stellan, and he's in a state of shock like a deer, and then he does Jack and he does Bob DeNiro doing the scene, and he's like doing 15 things, and the crew is totally straight-faced while Gus is shooting, and then Stellan starts to ad lib this Swedish gibberish, because he's so lost in the scene. And then when Gus yells 'Cut,' 180 members of the crew exploded with laughter, and Stellan looked around and goes 'What happened to me?'\"\nIt's easy to picture the look of horror on Skarsgard's face as his American co-star burst into impressions, all while the cast and crew acted like it was a totally normal occurrence, not to mention how impressed the others must've been, watching the comedy legend do take after take of improv. According to Weinstein, \"every day was like that\" with Williams, and over time, the filmmakers factored in his love of improv by doing two takes of each scene, \"one for Robin, one for us.\"\n\"Just a brilliant mind at work,\" Weinstein added.\nThursday's interview wasn't the first time the producer had paid tribute to the late actor; at Monday night's premiere of The Giver, Weinstein said that Williams was \"well missed and well loved.\"\n\"Whatever the circumstances are,\" Weinstein said, \"he was a giant in our industry and more importantly, a great man.\"\nImages: Miramax (2)","url":"https://www.bustle.com/articles/35795-robin-williams-prank-on-good-will-hunting-co-star-stellan-skarsgard-was-perfect"}
