{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:09:52","date_modify":"2018-10-30 23:09:52","date_publish":"2014-08-13 23:57:15","description":"If you were wondering how long the public mourning of Robin Williams would last, the answer is somewhere between \"a few weeks more\" and \"eternity.\" It'll definitely still be present at this year's Emmys, as it's been officially confirmed that Robin…","filename":"data/vaneerConsumption/RobinWilliamsWillGetAMeaningfulRemembranceDuringtheEmmysAsHeShould.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ec7b4f5d-eb8a-4563-b4e5-65c845f49f31.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35703-robin-williams-will-get-a-meaningful-remembrance-during-the-emmys-as-he-should_1540940992.html","title":"Robin Williams Will Get A \"Meaningful Remembrance\" During the Emmys - As He Should","title_page":"Robin Williams Will Get A \"Meaningful Remembrance\" During the Emmys — As He Should","title_rss":"NULL","source_domain":"bustle.com","text":"If you were wondering how long the public mourning of Robin Williams would last, the answer is somewhere between \"a few weeks more\" and \"eternity.\" It'll definitely still be present at this year's Emmys, as it's been officially confirmed that Robin Williams will be included in the evening's In Memoriam segment, if not more than that.\nIt's no surprise that Williams would be included in the Emmys In Memoriam: He may have spent much of his life as a star of film, but he also spent some key time on television. One of his first IMDb credits is from The Richard Pryor show, after all, and one of his major introductions to fame was through the role of Mork on Happy Days and then Mork & Mindy. More recently, he made a return to television in the vastly underrated (and prematurely canceled) The Crazy Ones , where he played opposite Buffy's Sarah Michelle Gellar. He was a TV vet, that one, so an Emmys night without a mention of that loss wouldn't be one done right.\nThe people in charge of the Emmys seem extremely aware of that. As Emmys Executive Producer Don Mischer told People: \"While we are all still coming to terms with this week's tragic news, we are working to give Robin Williams the proper and meaningful remembrance he so well deserves.\"","url":"https://www.bustle.com/articles/35703-robin-williams-will-get-a-meaningful-remembrance-during-the-emmys-as-he-should"}
