{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-22 20:08:44","date_modify":"2018-10-22 20:08:44","date_publish":"2016-01-29 00:34:50","description":"The previously Instagram-phobic member of the arguably the world's most famous family took to the social media platform on Thursday and posted a shot of himself in the gym.","filename":"data/vaneerConsumption/RobKardashianhitsthegymasTygagivesblessingtorelationshipwithBlacChyna.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE36DB00000578-0-image-a-53_1454029140302.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421989_Pumping-iron-Rob-Kardashian-hits-gym-Tyga-gives-blessing-relationship-ex-Blac-Chyna-saying-Everybody-deserves-happy_1540238924.html","title":"Rob Kardashian hits the gym as Tyga gives blessing to relationship with Blac Chyna","title_page":"Rob Kardashian hits the gym as Tyga gives blessing to relationship with Blac Chyna | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They say that when a new relationship blossoms, it helps some people get in shape.\nAnd it seems that Rob Kardashian's blossoming romance with Blac Chyna is doing just that.\nThe previously Instagram-phobic member of the arguably the world's most famous family took to the social media platform on Thursday and posted a shot of himself in the gym.\nScroll down for video\nHe wants to get trim for his lady? Rob Kardashian was hitting the gym on Thursday in a bid to get in shape\nThe 28-year-old could be seen bench pressing.\nIt seems he has been spurred on to get in shape by Blac Chyna, the ex fiancee of Kylie's current squeeze Blac Chyna.\nHours earlier, UsWeekly spoke to her online personal trainer, Chris Jinna, who claims she's asked him to come up with a 'diet and workout plan' to get Rob back in shape.\nThe man who might get Rob in shape: UsWeekly spoke to Chyna's online personal trainer, Chris Jinna, who claims she she's asked him to come up with a 'diet and workout plan' for Rob\n'She does refer to him as her boyfriend, yes,' Jinna, 27, said. 'They both have the same goals - they just want to basically get in shape, kind of shred a little bit, just have a healthier life, live a healthier lifestyle.'\nShe said she needed assistance with their 'health regimen.'\n'They want to shred a little bit,' said Jinna.\n'She came to me recently, maybe a week ago,' he added. 'She just asked some type of tips for Rob, to get him a meal plan. So I created a plan for them and sent it over.'\nFamily meeting time: Rob was seen with his new girlfriend as they headed to his mother Kris Jenner's house in Hidden Hills on Thursday\nTheir new looks: Rob was sporting a bushy beard and the model was wearing her hair blonde\nJinna started working with Chyna in November. 'They’re really taking this stuff pretty serious,' added the diet pro.\n'They’re supposed to be going to the gym at least five times a week together. I’m not sure if all the time if they’re actually going together, but since Rob asked for that plan, I would assume that they would be, at least motivating each other.'\nJinna told Chyna Rob had to 'basically stay away from the red meat, lower his salt intake, and just have moderation.'\nFacing the music: Rob was headed for a sit down with momager and E! producer Kris, 60, who is seen here at the Hollywood Today LIVE event on Tuesday\nStabilizing blood sugars is also important to keep Rob's diabetes in check.\nThe only male in the Kardashian and Jenner clan has caused waves with his romance, which has seen him move in with his new lady.\nHe was seen heading to his mother Kris Jenner's house on Thursday, seemingly summoned to talk through exactly what was going on.\nGiving his blessing: Meanwhile Tyga seemed to be saying he was ok with Rob dating his ex telling E! ;Everybody deserves to be happy' - he is seen here appearing on Kocktails With Khloe on Wednesday night\nKeeping out of it: Meanwhile another source said Kylie was refusing to get drawn into anything - she is seen here in a post on her website\nHowever, whatever Kylie and the rest of her sister's are making of their relationship, it seems Blac Chyna's ex is pretty unfazed by their union.\nHe told E! News on Thursday: 'Everybody deserves to be happy.'\nMeanwhile a source said of Kylie she wasn't going to get drawn into anything adding that she didn't 'want to give her (Blac Chyna) the attention she so obviously wants.\n'Ky is ignoring her antics.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421989/Pumping-iron-Rob-Kardashian-hits-gym-Tyga-gives-blessing-relationship-ex-Blac-Chyna-saying-Everybody-deserves-happy.html"}
