{"authors":["Gavin Lesnick"],"date_download":"2018-10-30 19:18:44","date_modify":"2018-10-30 19:18:44","date_publish":"2014-09-10 00:00:00","description":"An annual high school robotics competition is expected to draw a big crowd to its new home in Little Rock, where it will hold its first event at Barton Coliseum at the Arkansas State Fairgrounds next year.","filename":"data/vaneerConsumption/RoboticscompetitiontodrawteamstoLittleRock.json","image_url":"https://media.arkansasonline.com/img/photos/2014/09/10/Screen_Shot_2014-09-10_at_11.04.58_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_sep_10__1540927124.html","title":"Robotics competition to draw teams to Little Rock","title_page":"Robotics competition to draw teams to Little Rock","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Gov. Mike Beebe speaks beside a Mountain Home High School robot while announcing a high school robotics competition set to come to Little Rock next year. - Photo by Gavin Lesnick\nAn annual high school robotics competition is expected to draw a big crowd to its new home in Little Rock, where it will hold its first event at Barton Coliseum at the Arkansas State Fairgrounds next year.\nOfficials including Gov. Mike Beebe and Little Rock Mayor Mark Stodola were on hand Wednesday at the state Capitol to announce the Arkansas Rock City Regional FIRST Robotics Competition. The event, which in previous years was held in Fayetteville and Searcy, pits high school teams from throughout Arkansas and other states against one other in the design and construction of robots.\nMeredith Novak, regional director for FIRST in Arkansas and a mentor for the Mountain Home High School robotics team, said the competition is a great way to get students interested and excited in math and science.\n\"As a parent, it's just the most valuable thing a kid can be involved in next to church,\" she said.\nAlso on hand at the news conference in Beebe's large conference room was Nighthawk, a robot built by the Mountain Home High School robotics team designed to pick up a large ball and then toss it up to 50 feet through the air.\nAfter Mountain Home senior John Taylor Novak, 18, made sure the governor was alright with the robot launching in the confines of the formal conference space, Beebe and Stodola took a few turns standing on the opposite end of the room and catching the large ball Nighthawk tossed with a quick whoosh of its gears.\nThe event next year at Barton Coliseum — virtually the only indoor space big enough to hold the growing competition, Meredith Novak said — is expected to draw more than 60 teams and 3,000 students, family members, teachers and others. It's set for March 4-7.\nBeebe said it's a positive program because it helps address the state's \"dearth of qualified folks in science, technology, engineering and mathematics\" in a fun way that that helps overcome possible initial resistance to those fields.\n\"A lot of times, young people — I can speak from experience because I was one of them — are scared to death of math, scared to death of some of that stuff, so you gravitate away from it before you even have a chance to be exposed to it, before you even have a chance to understand you might be pretty good at it,\" he said. \"And so by exposing young people to the fun stuff that's also highly technical and highly sophisticated and requires a significant amount of intelligence in the fields they're going to be able in the future to go on in and exploit ... is something neat to see.\"","url":"https://www.arkansasonline.com/news/2014/sep/10/robotics-competition-draw-teams-little-rock/"}
