{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 05:11:12","date_modify":"2018-10-23 05:11:12","date_publish":"2017-03-16 16:10:54","description":"The TV presenter, 27, treated fans to a heartwarming photo of her husband Marvin Humes and their newborn daughter on Thursday, a week after announcing the birth of their new arrival.","filename":"data/vaneerConsumption/RochelleHumessharessweetphotoofMarvinandnewborn.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55211200000578-0-image-a-144_1489678326048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320750_Rochelle-Humes-shares-sweet-photo-Marvin-newborn_1540271472.html","title":"Rochelle Humes shares sweet photo of Marvin and newborn","title_page":"Rochelle Humes shares sweet photo of Marvin and newborn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They are currently settling into life as a family of four.\nAnd Rochelle Humes, 27, has been treating fans to a slew of photos on social media following the birth of her daughter Valentina Raine Humes last week.\nTaking to Instagram on Thursday, the TV presenter shared a sweet snap with her 1million followers that showed her husband Marvin, 31, being a doting father and cradling their new arrival in his arms.\nScroll down for video\n'Baby bubble': Rochelle Humes, 27, posted a heart melting photo of husband Marvin, 31, and their newborn daughter Valentina to Instagram on Thursday\nValentina's face was slightly turned away from the camera, but she still looked adorable in a sparkling white all in one.\nGushing about the married couple's first moments with their little girl, Rochelle added the caption: 'Days like these....'\nShe included the hashtag: '#babybubble.'\n'Our world is now complete': The Ninja Warrior UK host confirmed the arrival of Valentina Raine Humes on March 10 via social media\nMany of the Saturdays singer's fans were quick to comment on the heartwarming post, with one claiming it was 'priceless'.\nThey said: 'Priceless pic of father and daughter absolutely beautiful.'\nAnother added: 'Gorgeous. Huge congrats.'\n'Now I'm in love with three': Marvin had posted his first photo with his youngest child last week, adorably gushing he is now in love with three girls\nRochelle's latest post comes after she and Marvin announced the arrival of their youngest daughter on March 10.\nThe Ninja Warrior UK host uploaded a beautiful shot of her still in her hospital bed holding Valentina in her arms.\nRochelle said: 'Our world is now complete Valentina Raine Humes - Happy birthday little one...'\nMarvin, meanwhile, adoringly claimed he is now in love with 'three girls' while sharing the first picture of himself and Valentina to the social media app.\n'I never thought I'd fall in love with more than one girl... now I'm in love with three,' he said.\n'Four men, one boy and a little lady': The X Factor star introduced Valentina to his former JLS bandmates just days after her birth\nParenting duties! Marvin proved he is every inch the hands-on father by sharing photo evidence of him changing his baby's nappy\nHe and Rochelle are already parents to their three-year-old daughter Alaia-Mai.\nWhile the couple have received a slew of congratulations since welcoming Valentina into the world, Rochelle and Marvin were subject to some criticism after deciding to have their baby's umbilical cord framed.\nRochelle divided opinion when she revealed she'd had her placenta turned into pills and had Valentina's dehydrated umbilical cord shaped into the word 'love'.\nWhile placenta pills are coming to be an increasingly popular trend, it seems the umbilical cord art irked some of Rochelle's followers, who penned: 'High five to the tablets but the picture just no... I'm sorry but that picture is horrible! The tablets I can understand but I just couldn't have that picture!'\nDividing fans: Rochelle came under some criticism after revealing she'd had Valentina's dehydrated umbilical cord framed\n'I would give the pills a go but the picture. i think i just got a little bit sick in my mouth. but i wouldnt want to keep the cord, baby teeth, hair any of that stuff makes me heave. oh wants to keep all that shiz, this house is divided (sic).'\nOther fans however threw their support behind the products.\nOne commented: 'Some people have to have their say on everything and anything... a picture made from the placenta, the cord that was used to supply her baby with food and everything else it needed to survive for 9 months inside.'\nAnother claimed: 'It's really none of your business! Surely every one is entitled to making their own personal choice! Leave her to get on with caring for her newborn. Negative comments are all a new mum needs.'\nFamily of four! The Saturdays singer and Marvin are already parents to three-year-old daughter Alaia-Mai","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320750/Rochelle-Humes-shares-sweet-photo-Marvin-newborn.html"}
