{"authors":["Leith Huffadine For Daily Mail Australia"],"date_download":"2018-10-22 22:27:41","date_modify":"2018-10-22 22:27:41","date_publish":"2016-01-29 09:31:53","description":"Rochelle and Carter Nitschke are the ultimate mother-and-son duo. Together, they run a pet shop in Brisbane, which Ms Nitschke bought so Carter, who has special needs, could have a job.","filename":"data/vaneerConsumption/RochelleNitschkeandherspecialneedssonCarterrunCritterspetstoretogether.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B0168900000578-0-image-a-12_1454049214051.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420376_Heartwarming-tale-mother-special-needs-son-run-pet-store-together_1540247261.html","title":"Rochelle Nitschke and her special needs son Carter run Critters pet store together","title_page":"Rochelle Nitschke and her special needs son Carter run Critters pet store together | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Like most mothers, Rochelle Nitschke agonised over what sort of job her son Carter would be able to find after he finished high school.\nFor Ms Nitschke, from Brisbane, her worries were compounded by the fact Carter, now 20, has a speech disability - meaning he has problems with speaking, and used to be too scared to talk to people - and would not be able to attend university or have a mainstream job.\nMs Nitschke noticed that when Carter took part in work experience at his special needs school, he loved helping out at a vet practice because he had no problem communicating with animals.\nSoon, he was telling people how he wanted to open up a pet store one day - called Carter's Critters.\nRochelle Nitschke and her son Carter, 20, who together run Carter's Critters pet store Brisbane\nCarter Nitschke, 20, who runs Carter's Critters pet shop in Brisbane with his mother, is pictured with two puppies\nWhen he finished school, he needed a job - and so did Ms Nitschke.\nShe used all of the money she received from the settlement after she separated from her husband to buy a pet store and set up the business Carter's Critters in Sunnybank Hills, in southern Brisbane.\nBecause she taught at his school, she would have had to quit anyway, in order to be with him at home.\nCarter chose the shop's name, logo, colours - his favourites, hot pink and lime green - and has a say in whether people are up to scratch to be pet owners.\nCarter serves a customer at his pet store, which his mother bought so they could both be together and employed\nIt's not always a breeze, though.\n'All small business... I think, is struggling. We have a good day which might be followed by three bad days,' Ms Nitschke said.\nBut she is proud of her son.\nFor Carter, who begun speaking much later than other children, animals make sense.\nThe family dog's name - Nipper - was the first word he ever spoke.\n'Even from a young age animals were his thing. They don't judge you... they just know you love them so they love you back,' Ms Nitschke said.\n'He [Carter] has come a long way from a little five-year-old who could not say anything. When he started [at the pet store] he would be too scared to talk to people.'\nWorking in the store had improved Carter's communication skills and given him independence.\nMs Nitschke said it was easy to get attached to some of the animals that came into the store, and Carter was always ensuring pets went to a good home\nRochelle and Carter Nitschke in their store\nBut 95 percent of customers were understanding.\nWhen they realised there was something different about Carter they gave him time and were patient.\nBut it's not just Carter who the store is helping.\nOther youths with special needs come to the store to volunteer and get work experience, like Carter once did.\nAnd children with other disabilities come to the store to interact with the animals and build confidence.\nCarter said - of course - working with animals was the best part of the job, however, he did get attached to them.\nHe might also get away with a few liberties like an extra half hour at lunch here and there - the benefits of working with your mother.\nMs Nitschke hopes that some day Carter will manage the store himself.","url":"https://www.dailymail.co.uk/news/article-3420376/Heartwarming-tale-mother-special-needs-son-run-pet-store-together.html"}
