{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 05:25:28","date_modify":"2018-10-23 05:25:28","date_publish":"2017-03-10 15:16:13","description":"The Saturdays singer and the former JLS star - who are already parents to three-year-old daughter Alaia-Mai - have named their new arrival Valentina Raine.","filename":"data/vaneerConsumption/RochelleandMarvinHumeswelcomesecondchild.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/16/3E23E50D00000578-0-image-a-4_1489162586288.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301654_Rochelle-Marvin-Humes-welcome-second-child_1540272328.html","title":"Rochelle and Marvin Humes welcome second child","title_page":"Rochelle and Marvin Humes welcome second child | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rochelle Humes has welcomed a baby girl with her husband Marvin.\nThe Saturdays singer and the former JLS star - who are already parents to three-year-old daughter Alaia-Mai - have named their new arrival Valentina Raine.\nRochelle shared the good news on social media, posting a heartwarming snap of herself cradling her newborn child.\nScroll down for video\nBaby joy: Rochelle Humes has given birth to her second child, welcoming a baby daughter into the world with her husband Marvin\n'The Our world is now complete Valentina Raine Humes - Happy birthday little one', the caption read.\nMarvin also posted the same snap on Twitter, enthusing, 'Couldn't be a happier or prouder man, what another incredible blessing! My beautiful wife gave birth to our 2nd girl Valentina Raine Humes x'.\nA source told The Sun's Bizarre column: 'They’re delighted. Everything went really well and they can’t wait to get home.'\nMailOnline has contacted Rochelle's representative for comment.\nRochelle and Marvin have been an item since May 2010, tying the knot at Blenheim Palace in 2012.\nWelcome to the world: The Saturdays singer enthused, 'The Our world is now complete Valentina Raine Humes - Happy birthday little one'\nRochelle recently revealed that whilst they chose not to find out the sex of their unborn child, Marvin was under the impression it would be a boy.\nShe said on Loose Women: 'I'm carrying differently this time. It's more up here [pointing to her cleavage] They've changed. He likes it more than I do.'\nThe star also said that she had been suffering with terrible morning sickness in her first trimester.\nShe explained: 'I felt horrendous and no one offers you the chair because they don't know. Now you can see the bump but I feel fine.'\nPower couple: Rochelle and Marvin have been an item since May 2010, tying the knot at Blenheim Palace in 2012\nThe beauty said she was thrilled that she got to keep her second pregnancy a secret for six months.\n'We wanted to keep it quiet for as long as possible. We told some close friends and they kept their mouth shut so I was impressed', she said.\nRochelle appeared well and truly ready for labour in a recent social media snap, showing off her bare bump.\nThe songstress took to the photosharing site to grill her 1million followers over a groove extending along the front of her stomach - as she asked her fans what the mark was.\nOh my! Rochelle appeared well and truly ready for labour in a recent social media snap, showing off her bare bump\nRochelle and Marvin announced their baby news in November, when the songstress was already six months pregnant.\nGiven her advanced big reveal, the stunning star is finally able to reveal her bump as she sought advice from her fans on what exactly had appeared on her stomach.\nShe added a curious caption on the image reading: 'Okay what is this line down my tummy and does it have a purpose?! Or is it a pointless little trail?'\nThe line extending down the belly is called the linea nigra and runs from the navel to the pubic bone. The skin darkens during pregnancy while stretching vertically down your belly from the pubis to the umbilicus.\nThe happy couple: The beauty said she was thrilled that she got to keep her second pregnancy a secret for six months\nIn an interview with MailOnline, Marvin was candid about the pregnancy.\nHe said: 'She's getting zero sleep at night so it could be any day. With Alaia we found out (the sex) early on but with this one we thought we'd keep it a surprise as there's so little you can keep a surprise in life and really this is life's most beautiful surprise.\n'We're really excited, I had a dream the other night that we had a boy and on the same night she had a dream we had a girl. We definitely planned to have number two. We've been quite lucky with the timing.\n'With Alaia being nearly four when the baby's here it's not too bigger or smaller gap. She's very understanding and is very conscious of Rochelle's bump. Hopefully she won't be too jealous'.\nHappier than ever: Rochelle and Marvin appear to be the perfect couple, with beaming grins, dazzling careers and an incredible home life\nRochelle and Marvin appear to be the perfect couple, with beaming grins, dazzling careers and an incredible home life - all ready for their new addition.\nYet Marvin insists his marriage to his pregnant wife Rochelle is 'far from perfect', although admits they are 'incredibly lucky' to have one another. The doting husband proved just how dedicated he is to his wife while discussing her pregnancy.\nHe said: 'We're far from perfect. There's times when we have crossed words but we're totally honest with each other and that's the key to a strong relationship.'\nThe couple started dating at the start of 2010 and were married two years later in an idyllic ceremony in Blenheim Palace. Rochelle gave birth to Alaia in May the next year and announced the most recent baby news.\nGorgeous! Rochelle gave birth to Alaia-Mai in May in 2013, and the couple strive to keep her out of the limelight\nOf this pregnancy journey, Marvin said: 'She's done so well. Pregnancy is not a joke. The body needs to go through so much in the period. It's the most natural experience. This second one has gone a lot faster.\n'You're a lot more relaxed - sometimes too relaxed. Last time we were organised five months in but we're still prepping now. She's done incredibly well and I'm so happy. It's such a whirlwind time for all pregnant women.\n'They go through body changes and hormones and it's such a big part of your life and of course they'll be times she'll try on a dress that no longer fits and it's a tricky time with going out and feeling confident. She's always been great with that.\n'When I'm helping her out, she's done amazing and she's a real trooper. Seven years doesn't feel long. It feels like we've been together longer. We're lucky to have each other. We're lucky to have children and be happy.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301654/Rochelle-Marvin-Humes-welcome-second-child.html"}
