{"authors":["Associated Press"],"date_download":"2018-10-22 22:45:09","date_modify":"2018-10-22 22:45:09","date_publish":"2017-03-16 04:39:15","description":"CLEVELAND (AP) - The Rock and Roll Hall of Fame will celebrate 50 years of Rolling Stone magazine in a new exhibit set to open this spring in Cleveland.The...","filename":"data/vaneerConsumption/RockHalltocelebrate50yearsofRollingStonemagazine.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228491-1489669775-412_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318846_Rock-Hall-celebrate-50-years-Rolling-Stone-magazine_1540248309.html","title":"Rock Hall to celebrate 50 years of Rolling Stone magazine","title_page":"Rock Hall to celebrate 50 years of Rolling Stone magazine | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CLEVELAND (AP) - The Rock and Roll Hall of Fame will celebrate 50 years of Rolling Stone magazine in a new exhibit set to open this spring in Cleveland.\nThe Rock Hall says the exhibit will explore the magazine's archive of award-winning music and political and cultural reporting. It will open in conjunction with the release of the book, \"50 Years of Rolling Stone.\"\nThe exhibit will include rarely heard stories, original manuscripts, music reviews and audio interviews that spotlight the artists, writers and others who shared a special partnership with the magazine that debuted in 1967.\nFILE - This April 24, 2016, file photo shows the Rock and Roll Hall of Fame and Museum, located on the shores of Lake Erie in downtown Cleveland. The Rock and Roll Hall of Fame will celebrate 50 years of Rolling Stone magazine in a new exhibit set to open this spring in Cleveland. Highlights of cover images reaching back to rock 'n' roll pioneers such as Elvis Presley and Chuck Berry also will be included in the exhibit that opens May 5, 2017. (AP Photo/Beth J. Harpaz, File)\nHighlights of cover images reaching back to rock 'n' roll pioneers such as Elvis Presley and Chuck Berry also will be included in the exhibit that opens May 5. It will close in November 2017.","url":"https://www.dailymail.co.uk/wires/ap/article-4318846/Rock-Hall-celebrate-50-years-Rolling-Stone-magazine.html"}
