{"authors":["Associated Press"],"date_download":"2018-10-22 22:20:32","date_modify":"2018-10-22 22:20:32","date_publish":"2017-04-26 04:15:20","description":"HOUSTON (AP) - James Harden had 34 points and his supporting cast helped the Houston Rockets overcome a 47-point game by Russell Westbrook to get a 105-99...","filename":"data/vaneerConsumption/Rocketsadvancewith10599winoverThunder.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/04/wire-463101-1493177426-831_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446208_Rockets-advance-105-99-win-Thunder_1540246832.html","title":"Rockets advance with 105-99 win over Thunder","title_page":"Rockets advance with 105-99 win over Thunder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"HOUSTON (AP) - James Harden had 34 points and his supporting cast helped the Houston Rockets overcome a 47-point game by Russell Westbrook to get a 105-99 victory over the Oklahoma City Thunder on Tuesday night to advance to the Western Conference semifinals.\nThe Thunder head home a year after advancing to the Western Conference finals after Houston took this series 4-1.\nThe Rockets used a 5-1 run, with all their points coming on free throws, to pull away from the Thunder and make it 98-91. Victor Oladipo threw a pass about 5 feet above Westbrook's head and out of bounds on the next possession and Harden made a layup on the other end with about 3 minutes left.\nHouston Rockets' James Harden (13) goes up for a shot as Oklahoma City Thunder's Andre Roberson defends during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Houston. (AP Photo/David J. Phillip)\nThe Rockets began eating up the clock after that and Oklahoma City missed shot after shot that could have closed the gap.\nOklahoma City Thunder's Russell Westbrook (0) goes up for a shot as Houston Rockets' Trevor Ariza (1) defends during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Houston. (AP Photo/David J. Phillip)\nHouston Rockets' James Harden (13) drives toward the basket as Oklahoma City Thunder's Andre Roberson, second from left, defends during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Houston. (AP Photo/David J. Phillip)\nOklahoma City Thunder's Alex Abrines (8) goes up for a shot as Houston Rockets' James Harden (13) watches during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Houston. (AP Photo/David J. Phillip)\nHouston Rockets' Patrick Beverley (2) shoots as Oklahoma City Thunder's Andre Roberson defends during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Houston. (AP Photo/David J. Phillip)\nOklahoma City Thunder's Russell Westbrook (0) passes the ball as Houston Rockets' Trevor Ariza, left, and Patrick Beverley (2) defend during the first half in Game 5 of an NBA basketball first-round playoff series, Tuesday, April 25, 2017, in Houston. (AP Photo/David J. Phillip)","url":"https://www.dailymail.co.uk/wires/ap/article-4446208/Rockets-advance-105-99-win-Thunder.html"}
