{"authors":[],"date_download":"2018-10-22 22:50:09","date_modify":"2018-10-22 22:50:09","date_publish":"2017-04-26 05:46:20","description":"James Harden scored 34 points and the Houston Rockets withstood a furious effort from Oklahoma City star Russell Westbrook to oust the Thunder from the NBA...","filename":"data/vaneerConsumption/RocketsoustThunderinNBAplayoffsSpursandJazzclosein.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/07/wire-463699-1493188883-906_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446362_Rockets-oust-Westbrooks-Thunder-NBA-playoffs_1540248609.html","title":"Rockets oust Thunder in NBA playoffs, Spurs and Jazz close in","title_page":"Rockets oust Thunder in NBA playoffs, Spurs and Jazz close in | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"James Harden of the Houston Rockets drives around Andre Roberson of the Oklahoma City Thunder in Game Five of the Western Conference quarter-finals during the 2017 NBA Playoffs, at Toyota Center in Houston, Texas, on April 25\nJames Harden scored 34 points and the Houston Rockets withstood a furious effort from Oklahoma City star Russell Westbrook to oust the Thunder from the NBA playoffs on Tuesday.\nThe Rockets beat the Thunder 105-99 to win their best-of-seven Western Conference first-round series four games to one.\nRockets reserve Lou Williams scored 10 of his 22 points early in the fourth quarter as the Rockets responded to a sensational third quarter from Westbrook, who carried his team to a 77-72 lead going into the final period.\nWestbrook scored 10 straight points in one stretch and finished with 20 points, five rebounds and three assists in the third.\nBut Williams opened the fourth with two free throws, and added three more from the line along with a three-pointer as the Rockets regained the advantage with Westbrook on the bench - and they held on even after Westbrook re-entered the game as the Thunder missed a string of shots.\nOklahoma City's Russell Westbrook finished with 47 points, 11 rebounds and nine assists\nWestbrook finished with 47 points, 11 rebounds and nine assists, but connected on just two of his 11 shots in the final period.\nThe defeat brought a close to a historic season for Westbrook, who joined Oscar Robertson as the only players in NBA history to average a triple-double and beat Robertson's 55-year-old record for most triple-doubles in a regular season with 42.\nIn withstanding Westbrook, the Rockets showed they have plenty of defensive ability to go with their free-wheeling offense.\n\"We're not just a three-point shooting team,\" said Harden, who scored 13 of his 34 points in the final eight minutes. \"We get after it on the defensive end. We're overlooked. We have been all year. But we're not really worried about it. We go out there and compete at a high level on both ends of the floor.\"\nThunder coach Billy Donovan agreed, calling the Rockets defense \"underrated.\"\nThat included their defense on Westbrook, said the Rockets' Patrick Beverly, who took exception to Westbrook's taunt that \"no one can guard me.\"\nKawhi Leonard (R) of the San Antonio Spurs fights for the ball with Mike Conley of the Memphis Grizzlies in Game Five of the Western Conference quarter-finals during the 2017 NBA Playoffs, at AT&T Center in San Antonio, Texas, on April 25\nThe two received double technical fouls for jawing at each other during the game, but Beverly said the Rockets did what they set out to do against Westbrook.\n\"We did a great job on him,\" Beverly said. \"We tried to make him take a ton of tough shots.\"\nIn the second round the Rockets will face either the San Antonio Spurs or Memphis Grizzlies.\n- Spurs, Jazz in command -\nThe Spurs, seeded second in the West behind the Golden State Warriors, seized a 3-2 lead in their series Tuesday with a 116-103 victory in San Antonio.\nKawhi Leonard scored 28 points, Patty Mills added 20 and Tony Parker chipped in 16 as the Spurs bounced back from a heartbreaking overtime loss to the Grizzlies in game four.\nGordon Hayward of the Utah Jazz lays up a shot past DeAndre Jordan of the Los Angeles Clippers in Game Five of the Western Conference quarter-finals, at Staples Center in Los Angeles, California, on April 25, 2017\nReserve point guard Mills made five three-pointers, four of them in the fourth quarter en route to his career-high playoff scoring total.\nThe effort from Australia's Mills helped thwart a Grizzlies rally. Memphis trailed by 18 with less than two minutes to play in the third quarter, but a 17-3 scoring run saw them pull within four points with nine minutes to play.\n\"We made shots, that's what we didn't do the last game,\" said Spurs coach Gregg Popovich, whose team will try to wrap up the series in game six on Thursday in Memphis.\nThe Utah Jazz are also closing in on a second-round berth after a 96-92 victory over the Clippers in Los Angeles.\nGordon Hayward scored 27 points and pulled down eight rebounds for the Jazz, who took a 3-2 series lead with game six in Salt Lake City on Friday.\nRodney Hood scored 16 points and Joe Johnson produced nine of his 14 in the fourth quarter for Utah, who had 11 points and 11 rebounds from French big man Rudy Gobert.\nChris Paul scored 28 points for the Clippers, who played their second game without standout scorer Blake Griffin, who will miss the rest of the playoffs with a right big toe injury.\nThe winners of the series will face the Warriors, who swept the Portland Trail Blazers in four games.","url":"https://www.dailymail.co.uk/wires/afp/article-4446362/Rockets-oust-Westbrooks-Thunder-NBA-playoffs.html"}
