{"authors":["Pam Key"],"date_download":"2018-10-30 19:39:21","date_modify":"2018-10-30 19:39:21","date_publish":"2014-12-21 17:02:44","description":"Mike Rogers: Intel Community Was Ready to Respond to North Korea Hacking Attack but Didn't Get Decision from President Obama","filename":"data/vaneerConsumption/RogersObamaIndecisionStalledIntelCommunityResponsetoNKorea.json","image_url":"https://media.breitbart.com/media/2014/12/rogers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2014_12_21__1540928361.html","title":"Rogers: Obama Indecision Stalled Intel Community Response to NKorea","title_page":"Rogers: Obama Indecision Stalled Intel Community Response to NKorea | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On “Fox News Sunday,” the outgoing chair of the House Intelligence Committee Rep. Mike Rogers (R-MI) said out intelligence community has the capacity to respond to the North Korean hacking attack on Sony Pictures but President Barack Obama has stalled on a decision.\nRogers said, “What you saw was a nation-state who engaged in trying to really destroy an American company and then took it to the broader level of using threats of violence in order to get their political will. This was a nation-state attack on the United States, and saying aloha and getting on an airplane going to Hawaii is not the answer really the world needs, let alone America.”\nHe added, “Trust me, our intelligence services, the folks who would be responsible for at least the first wave of trying to make sure they don’t have the capability to do this again, were ready. They have the capability. They were ready to go. The problem here was not the fact that we didn’t have a capability to do something nearly in immediate time. We just didn’t get a decision from the president of the United States.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2014/12/21/rogers-obama-indecision-stalled-intel-community-response-to-nkorea/"}
