{"authors":["Mike Dickson For Mailonline"],"date_download":"2018-10-22 23:24:13","date_modify":"2018-10-22 23:24:13","date_publish":"2016-01-29 11:09:30","description":"The Laver Cup, named after Australia's 11-time major champion Rod Laver, will be a three-day event pitting a European team against the rest of the world.","filename":"data/vaneerConsumption/RogerFedererleadsdriveforRyderCuprivalryintennisbyplanningnewannualtournamentTheLaverCup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B0F27400000578-0-image-a-8_1454065574858.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3422525_Roger-Federer-leads-drive-Ryder-Cup-rivalry-tennis-planning-new-annual-tournament-Laver-Cup_1540250653.html","title":"Roger Federer leads drive for Ryder Cup rivalry in tennis by planning new annual tournament 'The Laver Cup'","title_page":"Roger Federer leads drive for Ryder Cup rivalry in tennis by planning new annual tournament 'The Laver Cup' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roger Federer is behind a new event planned for tennis that will try and emulate the success of the Ryder Cup in golf.\nThe Swiss and his management company, Team8, have persuaded Australian legend Rod Laver to put his name to a three-day match – The Laver Cup - that will attempt to pit the six best players from Europe against the best six from the rest of the world.\nThe planned launch is 2017, with a date in late September pencilled in after the US Open and Davis Cup semi-finals. The venue for the first event will be a major European city.\nThe Laver Cup, named after 11-time Grand Slam winner Rod (centre) will see Europe face rest of the world\nAndy Murray could join forces with the likes of Novak Djokovic in new Ryder Cup-style tournament\nWhile there is an inevitable comparison with the Ryder Cup, a more accurate parallel may well be more like golf’s President’s Cup.\nThe idea, which will not have ranking points, may yet struggle to gain credibility and go beyond mere exhibition status, as guaranteeing a top-class turnout cannot be assured with the sport’s already busy calendar.\nJapanese Kei Nishikori, at No 7, is the only player currently ranked inside the top-10 that would be eligible for the rest of the world team while John Isner (USA) , Kevin Anderson (South Africa), Milos Raonic (Canada) and Bernard Tomic (Australia) all feature in the top-20.\nSeventeen-time Grand Slam champion Roger Federer is behind the Laver Cup initiative\nThere could be concern that the new event could tread on the toes of the Davis Cup, won by GB last year\nThere might also be obstacles thrown up by other player management companies who are not part of the action. Prize money details are set to be announced in coming months.\nLaver said: 'I can see this becoming a very important part of the experience of being a top global player, with the world's best longing to earn the right to participate and thriving in this style of competition.\n'It's so good to see the sport of tennis finally develop a proper counterpart event to the Ryder Cup.'","url":"https://www.dailymail.co.uk/sport/tennis/article-3422525/Roger-Federer-leads-drive-Ryder-Cup-rivalry-tennis-planning-new-annual-tournament-Laver-Cup.html"}
