{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 01:22:12","date_modify":"2018-10-23 01:22:12","date_publish":"2017-03-16 11:16:55","description":"The long-time Trump supporter insisted a tinted Sedan tried to 'off' him when it crashed into his car in Pompano Beach, Miami, on Wednesday morning.","filename":"data/vaneerConsumption/RogerStonewastargetedbyRussiansinhitandrun.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E537AA100000578-0-image-a-44_1489662819016.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319760_Roger-Stone-targeted-Russians-hit-run_1540257732.html","title":"Roger Stone was ‘targeted by Russians in hit-and-run'","title_page":"Roger Stone was ‘targeted by Russians in hit-and-run' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roger Stone has claimed a hit-and-run driver tried to 'bump him off' ahead of next week's congressional probe into the Russian hacking scandal\nRoger Stone claims he may have been targeted by Russians in a hit-and-run crash ahead of next week's Congressional probe into the hacking scandal.\nThe outspoken Trump supporter said a tinted sedan tried to 'bump him off' when it crashed into his car in Pompano Beach, Miami, on Wednesday morning.\nStone speculated that someone didn't want him to testify in the investigation over Russia's influence on the presidential election, which begins on Monday.\nThe advisor, who had been heading to Orlando to promote his latest book on Trump, said the incident 'certainly could be' linked to the Russian hacking scandal.\nThe controversial Republican told Infowars host Alex Jones that his car was 'T-boned' by 'deep state' actors.\n'They have poisoned me, they have smeared me, and someone in a car tried to kill me,' he said.\n'I am a consistent critic of the \"deep state\" - that's why I think I'm targeted.'\nDescribing the crash, he told CBS4 News: 'They just came at us full force. The driver then threw it in reverse and took off.\n'Out of nowhere we were T-boned essentially by a late model four-door what I'm now told was a Pontiac.'\nStone, who said he was sitting in the passenger seat, was not seriously injured as airbags deployed on his side.\n'I'm bruised but I'm OK,' he confirmed, adding that his vision is blurry.\nStone is one of several associates of President Trump who have come under scrutiny for possible contact with Russian intelligence officials during the year leading up to the presidential election.\nHe said in a statement that he has hired two attorneys to try to get the government to 'either charge me or admit they have no case whatsoever.'\nThe long-time Trump supporter insisted a tinted Sedan tried to 'off' him when it crashed into his car in Pompano Beach, Miami, on Wednesday morning\n'You could make the case that the Russians want to off me because they do not want me to testify because it would show their hand. That would be obvious,' Stone said.\nHe claimed it was more probable that a different group orchestrated the crash to make it look like Russians were trying to 'bump him off'.\n'I think it's more likely that someone would like it to look like the Russians tried to bump me off,' he said.\n'It happens on a day when the ranking Democrat on the Intelligence Committee calls for me,' Stone added. Earlier that day, Congressman Adam Schiff, the ranking Democrat on the House Intelligence Committee, had mentioned Stone.\n'I have to guess that somebody doesn't want me to testify at those hearings,' he explained.\n'If I testify, it is going to prove that this whole narrative on which I believe surveillance of the president was based, i.e. that the Trump campaign was infiltrated by the Russians, is false.'\nStone said he has done nothing wrong and would love to 'clear the air on this whole thing' by testifying.\nStone speculated that someone didn't want him to testify in the investigation over Russia's influence with the presidential election, which begins on Monday (pictured, scene of the crash)\nStone has previously admitted to communicating with WikiLeaks founder Julian Assange and admitted last week that he was in contact last year with the hackers who are suspected of breaking into the Democratic National Committee's computer and email accounts, though he says the discussions were 'completely innocuous.'\nRoger Stone told the Washington Times that he exchanged 'completely innocuous' messages online with the Twitter handle that is believed to be behind the hack of Hillary Clinton's presidential campaign chief John Podesta.\n'It was so perfunctory, brief and banal I had forgotten it,' Stone told the Times on Friday.\nThe Broward Sheriff's Office confirmed there was a hit-and-run crash at the time and location described by Stone - however, the report doesn't mention Stone being a passenger.\nStone said this is because he left before police arrived - 70 minutes after the crash - and ordered an Uber to take him home while his driver stayed behind.\nHe showed CBS4 News a copy of his Uber receipt.\nHis driver John Kakanis, who works as an aide to Stone on his book tour, said he was 'pretty shaken' and that the incident 'looked kind of intentional'.\nStone, who said he was sitting in the passenger seat, was not seriously injured as airbags deployed on his side\nThe incident report shows there was extensive damage to the passenger side of Kakanis' car and that it had to be towed from the scene.\nStone's clams come as The New York Times claimed call records and intercepted conversations show 'members of Donald J. Trump's 2016 presidential campaign and other Trump associates had repeated contacts with senior Russian intelligence officials in the year before the election'.\nThe Times said its allegations are based on interviews it has carried out with four 'current and former American officials'.\nIt claims US intelligence was worried because the alleged contact was taking place as then-candidate Trump continued to praise Russian President Vladimir Putin on the campaign trail.\nThe Kremlin said, however, that the report was not based on any fact.\nIt comes as Stone sensationally claimed he was poisoned by political enemies who wanted to kill him before he could 'debunk' their 'lie' that he knew Russians would hack the US election.\nIt comes as Stone sensationally claimed he was poisoned by political enemies who wanted to kill him before he could 'debunk' their 'lie' that he knew Russians would hack the US election\nHe claimed to have been told by doctors that a mysterious and debilitating virus he was suddenly struck with in December was in fact polonium poisoning.\nAt the time, Stone had just been accused by the Obama administration of having prior knowledge that Vladimir Putin was planning to meddle in the election.\nHe says the poisoning was an attempt to stop him from testifying at a Congressional Hearing where he claimed he could prove the accusation was a lie.\n'I believe I was poisoned to stop me from exposing the Russian Hacking LIE b4 the Congressional Investigation,' Stone, 64, told his Twitter followers.\nAppearing on fellow Trump loyalist Infowars, he said he was targeted by the 'deep state' who wanted to stop him from revealing the truth.\n'I became extremely ill. This manifested itself in over 14 days of high fever, delirium, night sweats, I had lesions on my chest and my face...\n'The general consensus is I was poisoned. I was poisoned with polonium or a substance that has the characteristics of polonium and this made me exceedingly ill,' he said.\nPolonium is a rare and highly radioactive chemical. It was used in the 2006 murder of Russian spy Alexander Litvinenko who is believed to have been slipped the substance in a cup of tea.","url":"https://www.dailymail.co.uk/news/article-4319760/Roger-Stone-targeted-Russians-hit-run.html"}
