{"authors":["Breitbart News"],"date_download":"2018-10-30 18:51:09","date_modify":"2018-10-30 18:51:09","date_publish":"2016-08-09 11:41:34","description":"The English novelist Kingsley Amis once observed that much that was wrong with the 20th century could be summed up in the word “workshop.” On American campuses today, I suspect that the operative word is “committee.” | Politics","filename":"data/vaneerConsumption/RogerKimballSJWsMeetElihuYaleSlaveTraderExtraordinaire.json","image_url":"https://media.breitbart.com/media/2016/03/Screen-Shot-2016-03-03-at-15.15.57.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_09__1540925469.html","title":"Roger Kimball: SJW's Meet Elihu Yale, Slave Trader Extraordinaire","title_page":"Roger Kimball: SJW's Meet Elihu Yale, Slave Trader Extraordinaire | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Roger Kimball writes at the Wall Street Journal:\nThe English novelist Kingsley Amis once observed that much that was wrong with the 20th century could be summed up in the word “workshop.” On American campuses today, I suspect that the operative word is “committee.”\nOn Aug. 1, Yale University president Peter Salovey announced that he is creating a Committee to Establish Principles on Renaming. There has been a craze for renaming things on college campuses the last couple of years—a common passion in unsettled times.\nIn the French Revolution, leaders restarted the calendar at zero and renamed the months of the year. The Soviets renamed cities, erased the names of political enemies from the historical record, and banned scientific theories that conflicted with Marxist doctrine.\nAt Princeton, Stanford, Georgetown, Harvard and elsewhere, students have demanded that buildings, programs and legacies be renamed to accommodate modern sensitivities. Amherst College has dropped Lord Jeffrey Amherst as its mascot because the colonial administrator was unkind to Indians. Students at the University of Missouri have petitioned to remove a statue of the “racist rapist” Thomas Jefferson. This is part of a larger effort, on and off campuses, to stamp out dissenting attitudes and rewrite history to comport with contemporary prejudices.","url":"https://www.breitbart.com/politics/2016/08/09/roger-kimball-sjws-meet-elihu-yale-slave-trader-extraordinaire/"}
