{"authors":["Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-23 01:01:49","date_modify":"2018-10-23 01:01:49","date_publish":"2016-01-28 15:08:06","description":"Speaking during an Australian Open press conference in Melbourne, Roger Federer dubbed reporter's question 'stupid' after he suggested Novak Djokovic does not have same rivals he did.","filename":"data/vaneerConsumption/RogerFedererlosesitatareporterwhoasksaboutqualityofcurrentplayers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB314200000578-0-image-a-44_1453993669918.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420985_Cranky-Roger-Federer-loses-reporter-asks-quality-current-players-crushing-defeat-hands-Novak-Djokovic-Australian-Open-semi-final_1540256509.html","title":"Roger Federer loses it at a reporter who asks about quality of current players","title_page":"Roger Federer loses it at a reporter who asks about quality of current players | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roger Federer has dubbed a reporter's question 'stupid' after they suggested Novak Djokovic does not have the same calibre of rivals that the Swiss player did in the mid-2000s.\nAfter being defeated by the Serbian player in the semi-finals of the Australian Open in Melbourne on Thursday 6-1 6-2 3-6 6-3, Federer sat down for a post-match press conference.\nA reporter asked whether he felt Djokovic will be 'more dominant' than he himself had been, suggesting the world No. 1 does not have to face the same level of opponents that Federer had to face in the past.\nAfter shooting the crowd a bewildered look and pausing for a few moments, he responded: 'You've got to be careful how you phrase the question.'\nScroll down for video\nRoger Federer (pictured) has dubbed a reporter's question 'stupid' after they suggested Novak Djokovic does not have the same rivals as the Swiss player did in the mid-2000s\nFederer was defeated by Djokovic (pictured) in the semi-finals of the Australian Open in Melbourne on Thursday 6-1 6-2 3-6 6-3\n'You don't want to be rude to the other players. I don't have to face them, you have to face them.\n'I don't ask them stupid questions like that,' he said before shaking his head.\nThe reporter appeared unfazed by Federer's response as during Djokovic's press conference a short time later, he asked the same question.\nThe defending champion responded by saying: 'It is hard to know what the future is going to bring.'\n'Obviously tennis is different from when I was growing up and it is more difficult.'\nSocial media users did not appreciate the reporter' suggestion that players back when Federer was No.1 were fiercer competitors and praised the tennis champion for shutting it down.\n'Love Federer's response to one of the journo's Qs in the presser: \"I don't like stupid questions like that #served,' one person shared on Twitter.\n'Great response from Roger Federer with stupid questions in press conference tonight,' another wrote.\nA reporter asked whether he felt Djokovic will be 'more dominant' than he himself had been, suggesting the world No. 1 does not have the same calibre of opponents Federer has had in the past\nAfter shooting the crowd a bewildered look and pausing for a few moments, he responded: 'You've got to be careful how you phrase the question'\n'I don't ask [the other players] stupid questions like that,' he said before shaking his head\nSocial media users did not appreciate the reporter' suggestion that players back when Federer was No.1 were fiercer competitors and praised the tennis champion for shutting it down\nThe reporter appeared unfazed by Federer's response as during Djokovic's press conference a short time later, he asked the same question\nWhile the 34-year-old was disappointed with his performance, he still believes he is capable of turning the tables on his younger rival.\n'I have self-confidence ... that doesn't fade away very quickly,' Federer said.\n'I know it's not easy. I never thought it was easy. But best-of-three (sets), best-of-five ... I can run for four or five hours - it's not a problem.\n'I know you guys (in the media) make it a different case - I get that because you think I'm old and all that - but it's no problem for me. It doesn't scare me when I go into a big match against any player who's in their prime right now.\n'It's disappointing, but at the same time I'm going deep in slams right now - I'm having great runs.\n'Novak right now is a reference for everybody. He's the only guy that has been able to stop me as of late.\n'It's okay. I wish I could have played a bit better, and who knows what would have happened, but today Novak was very, very good - there's no doubt about it.'\nThe four-time Australian Open champion thrilled the crowd when he fought back to claim the third set, and received rapturous applause when he won the point of the match, and possibly the tournament, with a sublime backhand passing shot on the run in the fourth set.\nHe received a standing ovation as he departed Rod Laver Arena and assured local fans he would be back looking for his fifth Australian Open crown next year.\nWhile the 34-year-old was disappointed with his performance, he still believes he is capable of turning the tables on his younger rival\nDjokovic will play the winner of Friday night's second semi-final between Scottish world No.2 and four-time runner-up Andy Murray or big-serving Canadian 13th seed Milos Raonic\nFederer received a standing ovation as he departed Rod Laver Arena and assured local fans he would be back looking for his fifth Australian Open crown next year\n'I talk about it every time ... how thankful I am for the crowd,' he said.\n'It's a big part of why I'm still playing today. I spend a lot of hours on the practice courts for exactly moments like these where you feel like you're appreciated, you're being pushed forward - they want to see you win.\n'I wish I could have one more chance to play another match here this week, but I don't, so of course I'm disappointed maybe for parts of my fans and also for myself.\n'But I definitely walk away from a place like this and say, 'I want to come back next year'. I want to re-live it again.'\nDjokovic will play the winner of Friday night's second semi-final between Scottish world No.2 and four-time runner-up Andy Murray or big-serving Canadian 13th seed Milos Raonic.\n'Right now, I feel like I'm at the peak of my career and I'm trying to cherish every moment on court,' Djokovic said.\n'Definitely I played an unbelievable first two sets but that's what is necessary against Roger.\n'He's been playing a very high level in this tournament. He's been playing very aggressively.\n'I came up with the right intensity. I executed everything perfectly.\n'Obviously with a two-set lead is more comfortable, but it was a battle in the end.'\n'Right now, I feel like I'm at the peak of my career and I'm trying to cherish every moment on court,' Djokovic said","url":"https://www.dailymail.co.uk/news/article-3420985/Cranky-Roger-Federer-loses-reporter-asks-quality-current-players-crushing-defeat-hands-Novak-Djokovic-Australian-Open-semi-final.html"}
