{"authors":["Associated Press"],"date_download":"2018-10-23 00:19:53","date_modify":"2018-10-23 00:19:53","date_publish":"2016-01-29 13:09:56","description":"MELBOURNE, Australia (AP) — Rohit Sharma and Virat Kohli struck brisk half-centuries as India beat Australia by 27 runs in their second Twenty20 to take a wi...","filename":"data/vaneerConsumption/RohitKohligiveIndiawinningleadvsAustraliainT20s.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:f09c6a70d6b1409e98f12cbfa60925dd-4PuZeKVXE7cd9005b2c876a38b02-320_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422709_Rohit-Kohli-India-winning-lead-vs-Australia-T20s_1540253993.html","title":"Rohit, Kohli give India winning lead vs Australia in T20s","title_page":"Rohit, Kohli give India winning lead vs Australia in T20s | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rohit, Kohli give India winning lead vs Australia in T20s\nMELBOURNE, Australia (AP) — Rohit Sharma and Virat Kohli struck brisk half-centuries as India beat Australia by 27 runs in their second Twenty20 to take a winning 2-0 lead in the three-game series on Friday.\nOpener Rohit struck 60 off 47 deliveries and Kohli an unbeaten 59 off just 33, as India posted a challenging 184-3 after being put in to bat.\nAustralia, which made six changes to the team that lost the opening game at Adelaide by 37 runs, fell short at 157-8 in reply at the Melbourne Cricket Ground despite a fine 74 off 48 balls from captain Aaron Finch.\nIndian batsman Rohit Sharma hits a six during their T20 International match against Australia at the MCG in Melbourne, Friday, Jan. 29, 2016. (Photo/David Crosling/AAP Via AP) AUSTRALIA OUT, NEW ZEALAND OUT, PAPUA NEW GUINEA OUT, SOUTH PACIFIC OUT, NO SALES, NO ARCHIVES\nKohli exhibited the fine touch that saw him make 90 not out in the first T20, to help seize the initiative in the middle overs.\nHe played a couple of dot deliveries then went for the boundaries, hitting one six and seven fours.\n\"I always like coming to Australia,\" Kohli said. \"There is good pace and good bounce. We get good Indian crowds as well. Nothing is different from back home. I am very happy I could contribute at an important time to help seal the series today.\"\nRohit, who hit two centuries and a 99 in the preceding one-day series that Australia won 4-1, was run out for 60 after smashing two sixes and five fours.\nRohit partnered in a 97-run opening stand with left-hander Shikhar Dhawan, who struck a career-best 42 off 32 deliveries with two sixes and three fours.\nDhawan, whose highest in nine previous T20s was 33, was caught at point trying a reverse-sweep off spinner Glenn Maxwell.\nCaptain Mahendra Singh Dhoni produced a nine-ball 14 and was out in the last over - caught at long off off pace bowler Andrew Tye, one of three T20 debutants for Australia along with offspinner Nathan Llyon and seam bowler Scott Boland.\nThe Australian reply started strongly but the Indian spinners gradually take back control.\nFinch, who added 94 for the opening stand with left-hander Shaun Marsh, was dropped deep on the leg side off successive deliveries from spinner Ravichandran Ashwin, when on 62 and 64.\nBut Marsh's wicket in the same over triggered a mini collapse as Chris Lynn (2) and Glenn Maxwell (1) fell, and Australia suddenly lost its grip on the chase at 101-3 in the 12th over.\nThe pressure built as left-arm spinners Yuvraj Singh and Ravindra Jadeja bowled some fine overs.\nFinch's run out dismissal pegged Australia back to 124-5 in 15.2 overs, and a turnaround looked difficult from this stage with the experienced Shane Watson (15) already gone to a superb return catch by Jadeja.\n\"We made a good start but lost our way,\" Watson said. \"Their spinners are very skilled. Even when it is not turning they are effective.\"\nThe final game is in Sydney on Sunday.\nIndia's Virat Kohli, right, turns to see his teammate Suresh Raina saved from a run out as Australia's Andrew Tye, left, is unable to handle the ball at the stumps during their T20 Match against Australia in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rick Rycroft)","url":"https://www.dailymail.co.uk/wires/ap/article-3422709/Rohit-Kohli-India-winning-lead-vs-Australia-T20s.html"}
