{"authors":["Benjamin Zhang"],"date_download":"2018-10-31 00:35:56","date_modify":"2018-10-31 00:35:56","date_publish":"2016-12-01 00:00:00","description":"Rolls-Royce just unveiled the first photos of its new Project Cullinan SUV prototype.","filename":"data/vaneerConsumption/RollsRoycenewSUVprototypePICTURES.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_rolls-royce-new-suv-prototype-pictures-2016-12_1540946156.html","title":"Rolls-Royce new SUV prototype: PICTURES","title_page":"    Rolls-Royce new SUV prototype: PICTURES - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Rolls-Royce Project Cullinan prototype. Rolls-Royce On Thursday, Rolls-Royce announced the latest development of its much-anticipated SUV — codenamed Project Cullinan.\nAccording to Rolls-Royce, the company's first SUV prototype will begin road testing in public on Friday.\n\"This is an incredibly exciting moment in the development of Project Cullinan both for Rolls-Royce and for the patrons of luxury that follow us around the world,\" Rolls-Royce Motor Cars CEO Torsten Müller-Ötvös said in a statement.\n\"Bringing together the new four-wheel drive system and the new 'architecture of luxury' for the first time sets us on the road to creating a truly authentic Rolls-Royce which, like its forebears, will reset the standard by which all other luxury goods are judged.\"\nRolls-Royce engineers will put the new Cullinan prototype through its paces in a series of grueling tests set around the world. Shortly after Christmas, Rolls will take the Cullinan to the Arctic Circle for cold weather testing. In 2017, the prototype is expected travel to the Middle East for heat endurance and desert testing.\nRolls-Royce The venerable English luxury brand first announced its intentions to build what it called a \"high-bodied car\" in February of 2015. In April of that year, the company showed off a production mule based on the Phantom limousine designed to test out the Cullinan's all-aluminum chassis and new all-wheel-drive system.\nRolls-Royce is latest über-luxury or performance brand to join in on the SUV craze. The Bentley Bentayga, Jaguar F-PACE, and Maserati Levante are already on the market while the Lamborghini Urus is expected to arrive in the near future.","url":"https://www.businessinsider.com/rolls-royce-new-suv-prototype-pictures-2016-12"}
