{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:48:28","date_modify":"2018-10-30 21:48:28","date_publish":"2015-04-23 18:59:26","description":"The Republican-dominated Senate has allowed Loretta Lynch to be confirmed as the next U.S. Attorney General, 56-43. Roll Call now says the GOP will suffer with “scars from the long, tortured confirmation process of the first African-American woman nominated to fill the post.”","filename":"data/vaneerConsumption/RollCallGOPtoSufferScarsfromLongTorturedConfirmationofFirstAfricanAmericanWomanAG.json","image_url":"https://media.breitbart.com/media/2015/01/AP124250231731.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_23__1540936108.html","title":"Roll Call: GOP to Suffer ‘Scars from Long, Tortured Confirmation of First African-American Woman’ AG","title_page":"Roll Call: GOP to Suffer ‘Scars from Long, Tortured Confirmation of First African-American Woman’ AG | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Republican-dominated Senate has allowed Loretta Lynch to be confirmed as the next U.S. Attorney General, 56-43. Roll Call now says the GOP will suffer with “scars from the long, tortured confirmation process of the first African-American woman nominated to fill the post.”\nThe Senate voted Thursday morning to officially end a filibuster of Lynch’s nomination, 66-34, and Lynch was confirmed as the nation’s next Attorney General and successor to Eric Holder Thursday afternoon.\nLynch supports President Obama’s executive amnesty order and signed an amicus brief in favor of partial-birth abortion.\nBreitbart News’ Mike Flynn explained how the GOP handed Senate Democrats yet another victory after Democrats held up a human sex trafficking bill in order to protect the abortion industry:\nOn its own, the Senate Democrat position was untenable, as a strong majority of Americans oppose public funding of abortions. Senate Minority Leader Harry Reid used the trafficking impasse to argue that Republicans were blocking a vote on Loretta Lynch. President Obama, as has often been the case, followed Reid’s lead with his own rhetorical attack on Senate Republicans. No Republican outlined the radical nature of the Senate Democrats’ demand. The messaging on the trafficking bill was created, controlled and concluded on Democrat terms. The Republicans quietly negotiated some kind of compromise language where both parties can claim victory. The Senate Democrats were able to escape an extreme abortion position with a tactical victory.\nRepublicans who opposed a filibuster on Lynch were Sens. Kelly Ayotte (NH), Richard Burr (NC), Ron Johnson (WI), Mark Kirk (IL), and Rob Portman (OH).\nRepublicans who also voted to advance Lynch include the Senate Majority Leader Mitch McConnell (KY) and Sens. Lamar Alexander (TN), Shelly Moore Capito (WV), Thad Cochran (MS), Susan Collins (ME), Bob Corker (TN), John Cornyn (TX), Jeff Flake (AZ), Cory Gardner (CO), Lindsey Graham (SC), Orrin Hatch (UT), Pat Roberts (KS), Mike Rounds (SD), John Thune (SD), and Thom Tillis (NC).\nRegarding Lynch’s prior support of Planned Parenthood, Graham was the keynote speaker at the pro-life Susan B. Anthony List’s annual gala last week and claims to be pro-life, yet said he would vote to confirm Lynch, who agreed in 2006 that the term “living fetus” is “hopelessly vague.”\nGOP presidential candidates Sens. Marco Rubio (FL), Ted Cruz (TX), and Rand Paul (KY), as well as Sens. Patrick Toomey (PA) and John McCain (AZ), voted to filibuster Lynch’s nomination.\nAs the Wall Street Journal reports, Cruz criticized fellow Republicans for confirming Lynch, saying:\nThis nominee has given every indication she would continue the Holder Justice Department’s lawlessness. There are more than a few voters back home that are asking what exactly is the difference between a Democratic and Republican majority when the exact same individual gets confirmed as attorney general.\nUsing Lynch’s race as a factor, Sen. Richard Durbin (D-IL) attacked Senate Republicans last month for delaying Lynch’s confirmation, saying the GOP is asking her to “sit in the back of the bus.”\nThe WSJ reports that, following her confirmation, Sen. Patrick Leahy (D-VT) said, “After this extended delay, I can only hope that Senate Republicans will show Loretta Lynch more respect as attorney general of the U.S. than she has received as a nominee.”","url":"https://www.breitbart.com/politics/2015/04/23/roll-call-gop-to-suffer-scars-from-long-tortured-confirmation-of-first-african-american-woman-ag/"}
