{"authors":["Associated Press"],"date_download":"2018-10-22 22:16:07","date_modify":"2018-10-22 22:16:07","date_publish":"2016-01-11 02:48:15","description":"NEW YORK (AP) — It was a big scoop, and one Rolling Stone may well regret. The magazine made stunning news over the weekend by revealing that actor Sean Penn...","filename":"data/vaneerConsumption/RollingStonefacescriticismoverElChapointerview.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:eb599378d59547cbb3cf5c630699814b-3bWLCvS3pZb5eb4fce05c5f42c28-560_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3392983_Rolling-Stone-faces-criticism-El-Chapo-interview_1540246567.html","title":"Rolling Stone faces criticism over 'El Chapo' interview","title_page":"Rolling Stone faces criticism over 'El Chapo' interview | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rolling Stone faces criticism over 'El Chapo' interview\nNEW YORK (AP) — It was a big scoop, and one Rolling Stone may well regret.\nThe magazine made stunning news over the weekend by revealing that actor Sean Penn landed a rare interview last fall with the notorious drug lord Joaquin \"El Chapo\" Guzman while Guzman was on the run after escaping through a tunnel from a maximum-security Mexican prison. Guzman was recaptured Friday in Mexico after a shootout that killed five of his associates and wounded one marine.\nPenn's long and often rambling essay, widely mocked on social media, included comments from Guzman on everything from his childhood to his thoughts on the drug trade.\nFILE - In this Oct. 8, 2015 file photo, Sean Penn speaks during a forum with young entrepreneurs during the IMF and World Bank annual meeting in Lima, Peru. Late Saturday, Jan. 9, 2016, Rolling Stone magazine published an interview that Guzman apparently gave to Penn in his hideout in Mexico months before his recapture. In the article and interview, Penn describes the complicated measures he took to meet the legendary drug lord. (AP Photo/Rodrigo Abd, File)\nIt also raised questions of ethics and judgment, namely whether Penn should have met secretly with one of the world's most-wanted fugitives, whether the actor crossed the line by giving Guzman approval over the article before it was published, and whether Penn trivialized El Chapo's murderous past by asking him such questions as \"Do you have any dreams?\" and \"If you could change the world, would you?\"\nA Rolling Stone spokeswoman did not immediately return requests for comment.\nPenn's story ran nine months after Rolling Stone retracted its discredited story about a gang rape at a fraternity party at the University of Virginia. The magazine was strongly criticized for relying too strongly on the account of the alleged victim and failing to carry out basic fact-checking. It is being sued for tens of millions of dollars by the fraternity, former frat members and a university administrator.\nWriting for Rolling Stone, Penn acknowledged that Guzman was granted prior approval over the article (Guzman requested no changes, according to the actor), a violation of the commonly held rules of journalistic integrity.\n\"Allowing any source control over a story's content is inexcusable. The practice of pre-approval discredits the entire story — whether the subject requests changes or not,\" Andrew Seaman, chairman of the ethics committee of the Society of Professional Journalists, said in a blog post titled \"Rolling Stone Gathers No Accolades.\"\n\"The writer, who in this case is an actor and activist, may write the story in a more favorable light and omit unflattering facts in an attempt to not to be rejected.\"\nPenn, an Oscar-winning actor who played a drug dealer in the 1985 movie \"The Falcon and the Snowman,\" has had news-making encounters in other countries. In 2002, as the U.S. was threatening war against Saddam Hussein's Iraq, Penn visited the country and met with senior officials. He has also spoken with such foreign critics of the U.S. as Fidel Castro and Venezuelan leader Hugo Chavez.\nRolling Stone has long mixed aggressive investigative and political reporting with coverage of rock stars and other celebrities. Former staff writers such as Greil Marcus and Jim DeRogatis have accused publisher Jann Wenner of allowing undue input from interview subjects or interfering with music reviews he found too negative about artists he likes.\n\"It's unfortunately in keeping with Jann's tendency to ignore professional scruples in an effort to curry favor with celebrities,\" said Robert Draper, a correspondent for GQ and author of \"Rolling Stone Magazine: The Uncensored History,\" said of the El Chapo story.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3392983/Rolling-Stone-faces-criticism-El-Chapo-interview.html"}
