{"authors":["Associated Press"],"date_download":"2018-10-23 00:09:52","date_modify":"2018-10-23 00:09:52","date_publish":"2017-04-26 09:25:23","description":"BUCHAREST, Romania (AP) - Hundreds of taxi and bus drivers protested outside Romania's government offices on Wednesday to demand that Uber and other online...","filename":"data/vaneerConsumption/RomaniahundredsoftaxisbusesprotestagainstUber.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465297-1493211357-517_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446776_Hundreds-taxis-buses-park-outside-govt-protest-Uber_1540253392.html","title":"Romania: hundreds of taxis, buses protest against Uber","title_page":"Romania: hundreds of taxis, buses protest against Uber | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BUCHAREST, Romania (AP) - Hundreds of taxi and bus drivers protested outside Romania's government offices on Wednesday to demand that Uber and other online ride service be outlawed.\nDrivers parked some 200 taxis and buses outside the office buildings in the capital, disrupting transport in the already crowded city, and blew vuvuzela horns.\nThe protest, which had been planned to last all day, ended early after the government agreed to pass an ordinance within days better regulating taxi services.\nA taxi drivers covering his ear, as others use vuvuzelas, sits in his car during a protest outside the government headquarters in Bucharest, Romania, Wednesday, April 26, 2017. Some 200 taxis and buses have parked outside the government offices in Romania's capital, Bucharest, demanding that Uber and other online taxi services be outlawed in the country. (AP Photo/Vadim Ghirda)\nMinister for Public Consultation and Social Dialogue Gabriel Petrea met with some of the protesters and the two sides signed a protocol where the government pledged to pass the ordinance within 30 days.\nThere were no details immediately available how Uber would be affected.\nThe Confederation of Licensed Transport Operators says it wants \"online technology platforms that provide unauthorized taxi services to be outlawed,\" to protect licensed carriers.\nUber says it is a ride-sharing service with transparent costs and its drivers pay taxes. It says some 250,000 clients have used its services in the Romanian capital and other major cities in the past two years.\nTaxi drivers blow into vuvuzelas pointing at a microphone during a protest outside the government headquarters in Bucharest, Romania, Wednesday, April 26, 2017. Some 200 taxis and buses have parked outside the government offices in Romania's capital, Bucharest, demanding that Uber and other online taxi services be outlawed in the country. (AP Photo/Vadim Ghirda)\nTaxi drivers blow into vuvuzelas during a protest outside the government headquarters in Bucharest, Romania, Wednesday, April 26, 2017. Some 200 taxis and buses have parked outside the government offices in Romania's capital, Bucharest, demanding that Uber and other online taxi services be outlawed in the country. (AP Photo/Vadim Ghirda)\nTaxi drivers hold vuvuzelas during a protest outside the government headquarters in Bucharest, Romania, Wednesday, April 26, 2017. Some 200 taxis and buses have parked outside the government offices in Romania's capital, Bucharest, demanding that Uber and other online taxi services be outlawed in the country. (AP Photo/Vadim Ghirda)","url":"https://www.dailymail.co.uk/wires/ap/article-4446776/Hundreds-taxis-buses-park-outside-govt-protest-Uber.html"}
