{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:34:23","date_modify":"2018-10-30 20:34:23","date_publish":"2015-12-26 13:55:51","description":"Members of Roma community and African migrants fought a running battle on the streets of a small Spanish town on Christmas day.","filename":"data/vaneerConsumption/RomaAndAfricanMigrantRiotOnChristmasDay.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-26-at-13.08.54.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_26__1540931663.html","title":"Roma And African Migrant Riot On Christmas Day","title_page":"WATCH: Roma And African Migrant Riot On Christmas Day","title_rss":"NULL","source_domain":"breitbart.com","text":"Members of the Roma community and African migrants fought a running battle on the streets of a small Spanish town on Christmas Day, following the murder of a Guinean man. Police were attacked, petrol bombs thrown and roads blocked.\n“Garbage bins are being burned, cars have been burned, windows have been shattered,” said Manolo Garcia, a local city councilor describing the scenes on radio news station Cadena Ser.\nThe disturbances, in the small town of Roquetas del Mar in the province of Almeria, began after police found the body of a murdered 41-year-old Guinean migrant in the street in the early hours of Friday, Christmas eve.\nPolice said they suspected the was victim had been stabbed following a dispute over a traffic accident, local media reported.\nSources close to central government told Spanish news site El Pais that the assailants are thought to be Roma. Protests held by the African migrants broke out into violence when they reached the primarily Roma neighbourhood of Cortijos de Marin later that night.\nThe newspaper El Ideal reported in the early hours of this morning that petrol bombs had been throw, police attacked and roads blocked off. A reporter wrote:\n“At present the situation is very critical, as noted by witnesses who are in the area, who have pointed out that the deceased friends and countrymen have attacked several riot police, thrown Molotov cocktails at official vehicles and have even mounted barricades in the area Cortijos de Marin”.\nAround 30-40 people are thought to have taken part in the unrest, which police have since brought under control, the assistant deputy of the national government in Almeria, Andres Garcia Lopez, told Cadena Ser radio.\n“At this moment the situation is back to normal,” he said, confirming that no one had been injured in the riot and no arrests were made.\nFollowing the riot, police have maintained a heavy presence in the Cortijos de Marin neighbourhood in an attempt to prevent further clashes between Roma and African migrants.\nThe town has a large migrant population, most of whom work in the local farming industry in the many thousands of large greenhouses across the area. Unemployment stand at 31 per cent in the province, higher than national rate of 21 per cent.\nThere was a similar incident in Roquetas del Mar in 2008, when African migrants set fire to cars and houses and attacked police and firefighters with stones after a 28-year-old Senegalese man was stabbed to death.","url":"https://www.breitbart.com/europe/2015/12/26/watch-roma-and-african-migrants-riot-on-christmas-day/"}
