{"authors":["Silvia Recchimuzzi","Agnieszka Slupska"],"date_download":"2018-10-23 04:07:38","date_modify":"2018-10-23 04:07:38","date_publish":"2016-01-11 17:05:23","description":"Fracesco Totti made his Roma debut in 1992 and the 39-year-old has played for the club ever since, becoming captain in 1998. He has the third most appearances in Serie A history.","filename":"data/vaneerConsumption/RomaVeteranFrancescoTottivowstoplayonfortwomoreyears.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/2FF5E60C00000578-0-image-a-6_1452531772651.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394279_Francesco-Totti-vows-play-two-years-Roma-veteran-wishes-former-team-mate-Daniele-Conti-happy-birthday_1540267658.html","title":"Roma Veteran Francesco Totti vows to play on for two more years","title_page":"Roma Veteran Francesco Totti vows to play on for two more years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Veteran Roma forward Francesco Totti vowed to play on for another two years in a light-hearted birthday message to his former team mate Daniele Conti.\nTotti, 39, has spent his entire career at the Italian capital club while the 37-year-old Conti left Roma to join Cagliari in 1999.\n'You're getting old... I've heard that you're training to become a coach... I'm playing two more years, so if you want me to play (for you), I'm coming,' Totti said.\nFrancesco Totti has vowed to play on for another two years despite being 39-years-old\nThe Roma striker (right) broke into the team when Milan manager Sinisa Mihajlovic was at the club\nTotti made his Serie A debut in 1992 and became Roma captain in 1998.\nHe has played 592 games in Italy's top flight, third on the all-time list behind AC Milan's Paolo Maldini (647) and Inter's Javier Zanetti (615).\nTotti returned to action in Roma's 1-1 draw against AC Milan on Saturday following a thigh injury that had kept him out of the team since late September.\nThe Roma legend was part of Italy's 2006 World Cup winning squad and is his club's all-time top goalscorer with 300 goals in all competitions.\nTotti also has the honour of being the Champions League's oldest ever goalscorer, last netting against CSKA Moscow last season as a 38-year-old.","url":"https://www.dailymail.co.uk/sport/football/article-3394279/Francesco-Totti-vows-play-two-years-Roma-veteran-wishes-former-team-mate-Daniele-Conti-happy-birthday.html"}
