{"authors":[],"date_download":"2018-10-22 21:45:36","date_modify":"2018-10-22 21:45:36","date_publish":"2014-08-22 00:00:00","description":"If I Stay is based on the best-selling novel by Gayle Forman. Chloë Grace Moretz plays a 17-year-old girl, in a coma after a car wreck, who has to choose between life or death.","filename":"data/vaneerConsumption/RomanceFansWillFallForCharactersInIfIStay.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=342354084_1540244736.html","title":"Romance Fans Will Fall For Characters In 'If I Stay'","title_page":"Romance Fans Will Fall For Characters In 'If I Stay' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\n\"If I Stay\" is the latest film that's based on a best-selling young adult novel. But this is no dystopian adventure. It is a romance. Here's film critic Kenneth Turan.\nKENNETH TURAN, BYLINE: The nominal question at the heart of \"If I Stay\" is whether 17-year-old Mia, suspended between life and death after a dreadful car accident, will choose to stay on earth or follow that inevitable tunnel of light to the next world. But that's not what keeps us watching - not really. Rather, the pleasure of this film for romance fans is watching the interplay between Mia, played by Chloe Grace Moretz, and boyfriend Adam, British actor Jamie Blackley, as their dreamy relationship unfolds onscreen in a series of flashbacks. She's a phenomenal cello player, and he's a hot young rocker. No wonder he's distraught at the thought of her death.\n(SOUNDBITE OF FILM, \"IF I STAY\")\nJAMIE BLACKLEY: (As Adam) I'll do whatever you want, just please stay. You're my home, Mia. I don't care where we are. I just care that we're together.\nTURAN: It's the conceit of Gayle Forman's best-selling book that Mia emerged from that car wreck in an out-of-body state - walking and talking and aware of everything but invisible to everyone. The choice of whether she lives or dies is hers, and her relationship with Adam is a big part of her decision. \"If I Stay\" tries to convince us that these two high school students live in vastly different worlds because of their musical tastes. But both young people are so attractive and well-mannered, it's impossible not to think of them together. And it doesn't hurt that Adam always knows just what to say when Mia is feeling insecure.\n(SOUNDBITE OF FILM, \"IF I STAY\")\nBLACKLEY: (As Adam) Don't you get it? The you you are now is the same you I was in love with yesterday, the same you I'll be in love with tomorrow.\nTURAN: For a story like this to succeed, you have to be willing to invest heavily in these characters to enjoy living the dream with them. It should make you happy to see Mia and Adam happy. And when these two are looking into each other's eyes, if you love romance, that's what you're going to be.\nGREENE: Kenneth Turan reviews movies for MORNING EDITION and for The Los Angeles Times. This is NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=342354084"}
