{"authors":["Corey Charlton For Mailonline"],"date_download":"2018-10-23 01:35:14","date_modify":"2018-10-23 01:35:14","date_publish":"2016-01-28 15:54:38","description":"Mother-of-two Roxana Elena Onu, 24, from the commune of Varasti in southern Romania, was arrested last week after Romanian police received a tip-off from the FBI.","filename":"data/vaneerConsumption/Romanianmotherpaid7000toabuseher11montholddaughter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAF55600000578-0-image-a-80_1453991376234.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421053_Romanian-mother-paid-7-000-abuse-11-month-old-daughter-online-British-paedophiles-said-thought-okay-just-game-girl_1540258514.html","title":"Romanian mother 'paid £7,000 to abuse her 11-month-old daughter'","title_page":"Romanian mother 'paid £7,000 to abuse her 11-month-old daughter' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was arrested last year on child pornography and exploitation charges\nImages were found by the FBI during investigation into Brandon Gressette\nOnu told police it was harmless because it was just a 'game' to the girl\nShe is accused of taking £7,000 in 13 payments from Europe and the U.S.\nA mother accused of sexually abusing her 11-month-old baby online in return for payment from British and U.S. paedophiles has been arrested in Romania.\nMother-of-two Roxana Elena Onu, 24, from the commune of Varasti in southern Romania, was arrested last week after Romanian police received a tip-off from the FBI.\nImages of Onu abusing her baby were discovered by U.S. authorities during an investigation into Brandon Gressette, 31, who was arrested last year for charges related to sexual exploitation of children and child pornography.\nOnu Roxana Elena (pictured) thought it was okay to sexually abuse her daughter because the child thought it was 'just a game'\nOnu was tracked down during an FBI investigation following the arrest of Brandon Gressette (pictured) last year\nThe FBI informed Romanian authorities that the woman was operating under the username brunetelovex2 and had allegedly received money from Gressette via Western Union.\nFurther investigations revealed that between June 2014 and October 2015 she received a total of £7,000 through 13 transfers from seven people in the USA, the UK, Belgium and Holland.\nOnu told prosecutors she carried out the abuse believing the baby would not be emotionally affected because she was only 11 months old.\nShe added she avoided involving her three-year-old boy in the video chat activities, because 'he is older and he could have been affected emotionally'.\nShe said: 'I agreed to do these things with my daughter because I thought that she couldn't have suffered any trauma. I thought that it was all just a game.'\nShe added that she had been video-chatting before becoming pregnant but since December 2014 decided to also involve her child.\nShe said: 'After graduating high-school I got involved in video-chat activities. It was my idea to involve my baby girl.\n'Some of my clients knew that I had been giving birth to a baby. They asked me to undress her and to touch her.\n'I agreed to do that in exchange of money. Some of them were paying me with $500, others with 100.'\nIf found guilty, Onu could face up to 15 years in jail.\nOnu told prosecutors she carried out the abuse believing the baby would not be emotionally affected. The mother-of-two, from the Varasti commune in southern Romania, was arrested last week","url":"https://www.dailymail.co.uk/news/article-3421053/Romanian-mother-paid-7-000-abuse-11-month-old-daughter-online-British-paedophiles-said-thought-okay-just-game-girl.html"}
