{"authors":[],"date_download":"2018-10-22 21:38:22","date_modify":"2018-10-22 21:38:22","date_publish":"2014-05-07 15:40:25","description":"Romanians living in Washington state are kicked out of the country, leaving behind many questions and millions in missing gold and silver coins.","filename":"data/vaneerConsumption/RomaniansExtraditedLeavingDoomsdayBunkerandBuriedTreasure.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/425061/140506-radu-diana-nemes-jms-2112_0ad170dac7812dd1ffed2480b9b054ef.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_romanians-extradited-leaving-doomsday-bunker-buried-treasure-n99326_1540244302.html","title":"Romanians Extradited, Leaving 'Doomsday Bunker' … and Buried Treasure?","title_page":"Romanians Extradited, Leaving  'Doomsday Bunker' … and Buried Treasure?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Romanian couple is being kicked out of the U.S. over an alleged tax evasion scheme, leaving behind an arsenal of weapons, a “fully stocked doomsday bunker,” six properties, including a $3 million log cabin, and nearly $2.7 million in possible “buried treasure.”\nRadu and Diana Nemes, who is pregnant with the couple’s third child, have both waived extradition to Romania and will soon be deported, according to court documents filed in in U.S. District Court for Western Washington this week.\nThe Nemes are wanted in Romania in connection with a $68 million tax evasion scheme, according to the documents. According to Romanian authorities quoted in U.S. court filings, Radu Nemes and his alleged co-conspirators -- including some top Romanian government officials -- allegedly sold nearly a million tons of diesel fuel, but reported that their product was lower-grade industrial and maritime fuel, thereby saving millions in taxes.\nRadu and Diana Nemes. Interpol\nDiana Nemes is portrayed in court papers filed in the U.S. as the author of a complex money-laundering operation that funneled the ill-gotten Romanian gains into banks in Dubai and then to the United States after the couple obtained visas and moved here in 2012 -- shortly before charges were filed in their homeland. Their U.S. visas have expired.\nThe defense asked the court to throw out the extradition request, arguing that the Nemes have never been formally charged with a crime in Romania. Essentially, the Nemes’ lawyers said, Romania was seeking to have them deported over a tax dispute in another country.\nProsecutors countered by arguing that Diana Nemes continued her money-laundering activities after arriving in the U.S. Citing an FBI investigation, they argued in a document opposing her attempts to be released on bail that she and her husband used funds from various accounts in Dubai to “purchase real estate, automobiles, at least one yacht, construction equipment, precious metals … and to fund their living expenses.”\nAmong their purchases, according to the document, were four properties in Yelm, Wash., about 50 miles south of Seattle, and a two-thirds interest in the Eagleview Hill Winery in Rainier, Wash.\nThe Nemes were building a large log home on one of the sites, according to the document. When FBI agents swept in on March 18 to search the property, they also found “a fully equipped and furnished underground bunker,” complete with kitchen, living room, bathroom, multiple bedrooms and enough food and supplies for many months.\n“The bunker entrance was controlled by steel doors which could be sealed from the inside and the bunker itself contained multiple diesel generators, solar power processing, a battery back-up system, water filtration and other basic life-support systems,” it said.\nThe bunker found when FBI agents served a search warrant on a property owned by Radu and Diana Nemes in Yelm, Wash., had enough food and supplies for several months, plus generators, solar power and water filtration. Department of Justice\nAuthorities also found four pistols and two rifles, including an AR-15-style assault rifle, on the property -- weapons the Nemes were not legally allowed to possess, according to the document.\nThe precious metals included millions of dollars’ worth of gold and silver coins purchased from coin dealers in the U.S., the document said. FBI agents interviewed two neighbors who reported that they had helped the Nemes bury some of the gold on their property. They also helped dig it up at a later date so the Nemes could use it for various investments, it said.\nBut when an FBI forensic accountant added up the coins recovered at the Nemes’ home and properties with their coin purchases, then subtracted the sales, he found that gold coins worth $2.622 million and silver coins valued at $126,000 could not be accounted for. And searches of the Nemes’ properties with ground penetrating radar found no sign of any buried treasure.\nProsecutors used the missing coins to argue against Diana Nemes’ release from a federal detention facility, saying they increased the likelihood she would flee. They also are seeking forfeiture of the Nemes’ U.S. real estate.\nFollow NBC News Investigations on Twitter and Facebook.\nIn seeking release, Nemes’ cited her pregnancy and her role as caretaker for the couple’s other two children as special circumstances justifying her release on bail.\nU.S. Magistrate Judge Karen Strombom ruled against her, finding that she presented a flight risk and had not cleared the special circumstances hurdle.\nNeil Fox, the Nemes’ lawyer in Seattle, declined to comment on the couple’s decision to waive extradition. “Our position is reflected in our legal filings,” he said.","url":"https://www.nbcnews.com/news/investigations/romanians-extradited-leaving-doomsday-bunker-buried-treasure-n99326"}
