{"authors":["Associated Press"],"date_download":"2018-10-23 01:32:01","date_modify":"2018-10-23 01:32:01","date_publish":"2017-03-16 11:39:16","description":"BUCHAREST, Romania (AP) - Some 1,000 police officers protested Thursday in Romania's capital to demand higher salaries, saying tens of thousands of officers...","filename":"data/vaneerConsumption/Romania1000policeofficersprotesttodemandhigherpay.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-228829-1489673668-692_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319820_Romania-1-000-police-officers-protest-demand-higher-pay_1540258321.html","title":"Romania: 1,000 police officers protest to demand higher pay","title_page":"Romania: 1,000 police officers protest to demand higher pay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BUCHAREST, Romania (AP) - Some 1,000 police officers protested Thursday in Romania's capital to demand higher salaries, saying tens of thousands of officers are earning the minimum wage or less.\nOfficers from various areas of Romania gathered outside the interior ministry on Thursday, yelling \"You thieves!\" Some blew whistles or vuvuzelas and waved Romanian flags.\nMarius Barbulescu, leader of the Mihai Viteazul police union, said officers should be paid a minimum monthly salary of 1,450 lei ($340), and on top of that should receive other benefits in line with other public servants.\nRomanian police officers shout slogans during a protest outside the Interior Ministry in Bucharest, Romania, Thursday, March 16, 2017. Some 1,000 police officers protested in Romania's capital to demand higher salaries, saying their work is not adequately remunerated. (AP Photo/Vadim Ghirda)\nBarbulescu told the Agerpres national news agency: \"We are dealing with humiliation that is hard to describe in words.\" He said police \"are public employees, with a special status.\"\nLast month, some 38,000 police officers and interior ministry employees had monthly salaries between 1,250 lei and 1,450 lei ($295 to $340) - the minimum wage or less.\nIn October the Diamant police trade union sent a memo to President Klaus Iohannis, the interior ministry and others saying that about 7,000 young police officers were being paid below the minimum wage.\nUnion leaders met with Interior Minister Carmen Dan later Thursday to discuss their demands.\nRomanian police blow horns during a protest outside the Interior Ministry in Bucharest, Romania, Thursday, March 16, 2017. Some 1,000 police officers protested in Romania's capital to demand higher salaries, saying their work is not adequately remunerated.(AP Photo/Vadim Ghirda)\nA Romanian police officer holds his hat and a horn during a protest outside the Interior Ministry in Bucharest, Romania, Thursday, March 16, 2017. Some 1,000 police officers protested in Romania's capital to demand higher salaries, saying their work is not adequately remunerated.(AP Photo/Vadim Ghirda)","url":"https://www.dailymail.co.uk/wires/ap/article-4319820/Romania-1-000-police-officers-protest-demand-higher-pay.html"}
