{"authors":[],"date_download":"2018-10-23 00:55:47","date_modify":"2018-10-23 00:55:47","date_publish":"2016-03-08 00:00:00","description":"Percussionist Roman Diaz arrived in New York from Havana in 1999 and has since become a mainstay in the avant-garde jazz and Afro-Cuban music communities. Critic Milo Miles reviews his debut album.","filename":"data/vaneerConsumption/RomanDiazMakesASpiritualStatementWithLDFnBt.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=469650427_1540256147.html","title":"Roman Diaz Makes A Spiritual Statement With 'L'ó Dá Fún Bàtá'","title_page":"Roman Diaz Makes A Spiritual Statement With 'L'ó Dá Fún Bàtá' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TERRY GROSS, HOST:\nThis is FRESH AIR. Master percussionist Roman Diaz has releases his debut album as a leader called \"L'o Da Fun Bata.\" Diaz arrived in New York from Havana, Cuba in 1999 and has since become a mainstay in the avant-garde jazz and Afro-Cuban music communities. Milo says this new album is the best presentation he's ever heard of musical ceremonies honoring deities transplanted from Nigeria to Cuba.\n(SOUNDBITE OF SONG, \"ELEGUA\")\nROMAN DIAZ: (Singing in foreign language).\nMILO MILES, BYLINE: It's easy to forget when oceans of music are available for streaming at any time but certain powerful styles are tough to make effective as straight recordings. Muslim Sufi music, for instance, can be mildly engrossing as pure sound but only clicks when it's experienced along with the whirling, hypnotic dancers. For me, an even more confounding example are musical ceremonies attached to the Afro-Cuban religious practice known as Santeria or Lucumi or Osha, originally transported from the Aruba people of Nigeria. Roman Diaz's version of the style, like all others, is purely voices and percussion.\n(SOUNDBITE OF SONG, \"OGGUN\")\nDIAZ: (Singing in foreign language).\nMILES: Over the years, I've heard more than a few albums that featured or at least included Lucumi ceremonies. Now, what I call drum and chant records are intrinsically challenging to get across to an audience that cannot see the performance and does not speak the language. There seemed to be too much emphasis on simplicity and authenticity. These are works you could study but not enjoy. You felt like a tourist, not a captivated listener. This is not the case with Roman Diaz's \"L'o Da Fun Bata,\" which is a joy for those unfamiliar with the tradition. Diaz introduces most tracks by reciting brief oracle poetry in the Afrocubanismo style developed during the Harlem Renaissance in the 1920s and '30s. The biggest surprise of the record is that these passages do not break up the flow but enhance the rhythmic texture.\n(SOUNDBITE OF SONG, \"OBATALA\")\nDIAZ: (Singing in foreign language).\nMILES: It's tricky to pin down exactly why \"L'o Da Fun Bata\" excels at being both a spiritual statement and essential work of art. The tracks present nonstop variety, as though the personalities of the Osha deities are more vividly detailed than on other recordings. Perhaps the choir work is more frankly melodic, and it's certainly impeccably harmonized. I would single out the soaring Nina Rodriguez as my favorite voice. The most likely explanation is that \"L'o Da Fun Bata\" never feels like sequences of bata drums, choirs, solo sings, more bata drums, but a mesh of all the players. As Diaz himself puts it, we are molecules in one nucleus. We all work together as one. If you are the least interested in this venerable African, Cuban, American tradition, \"L'o Da Fun Bata\" is where to begin.\nGROSS: Milo Miles reviewed the new album \"L'o Da Fun Bata\" led by percussionist Roman Diaz. Tomorrow on FRESH AIR, inside the East Bay Rats, an Oakland motorcycle club with a reputation for boozing and brawling. Our guest will be writer Alex Abramovich who wrote about the Rats after discovering that one of the members was the guy who bullied him years ago when they were kids. Abramovich has a new book called \"Bullies: A Friendship.\" I hope you'll join us.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=469650427"}
