{"authors":["Will Griffee For Mailonline"],"date_download":"2018-10-22 23:48:26","date_modify":"2018-10-22 23:48:26","date_publish":"2017-03-16 08:06:34","description":"Neymar is already at the same elite level as Cristiano Ronaldo and Lionel Messi according to Brazil legend Ronaldinho. He dubbed his compatriot as Brazil's greatest idol today.","filename":"data/vaneerConsumption/RonaldinhoclaimsNeymarissamelevelasworldsbest.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E170E8300000578-0-image-a-33_1489651448403.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319154_Ronaldinho-claims-Neymar-level-world-s-best_1540252106.html","title":"Ronaldinho claims Neymar is same level as world's best","title_page":"Ronaldinho claims Neymar is same level as world's best | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Neymar is already at the same elite level as Cristiano Ronaldo and Lionel Messi according to Brazil legend Ronaldinho.\nThe 25-year-old striker impressed recently for Barcelona in their remarkable Champions League comeback against PSG.\nRonaldinho believes it is a matter of time before his compatriot rules world football. He told Gulf News: 'Neymar is a close friend and he is Brazil's greatest idol today.\nNeymar is already among the best players in the world according to his friend Ronaldinho\n'He's already at the same level as Cristiano Ronaldo and Lionel Messi and we truly hope that one day he can get the Ballon d'Or and continue his success, but he's already among the top and it's just a matter of time.'\nDespite lavishing praise on Neymar, Ronaldinho was reluctant to draw parallels between his own Barcelona and Brazil teams.\n'I never like comparisons, we were a great team with great players and individuals, and today's side also has a great team with great players and individuals,' he added.\nRonaldinho refused to be drawn into comparisons with his own Barcelona team\n'I was successful, my team was successful and we won a lot of trophies and today's Barca side are the same, they are also very successful, so I want to wish the best to them. I don't like comparisons, I just know we should continue.'\nNeymar is worshipped in his native Brazil and is likely to have a decisive role for Luis Enrique's side as they push for honours this season.\nWith their Champions League aspirations still alive and renewed hopes of defending their La Liga crown, Neymar will have the chance to prove Ronaldinho correct in his claims.","url":"https://www.dailymail.co.uk/sport/football/article-4319154/Ronaldinho-claims-Neymar-level-world-s-best.html"}
