{"authors":["Jack Gaughan For The Daily Mail"],"date_download":"2018-10-23 03:44:01","date_modify":"2018-10-23 03:44:01","date_publish":"2017-03-16 14:51:06","description":"JACK GAUGHAN: Everton's final push for Europa League qualification will start on Saturday with the future of Ross Barkley in serious doubt.","filename":"data/vaneerConsumption/RonaldKoemanwarnsRossBarkleytosignnewEvertondeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54CBE200000578-0-image-a-143_1489674976143.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320476_Ronald-Koeman-warns-Ross-Barkley-sign-new-Everton-deal_1540266241.html","title":"Ronald Koeman warns Ross Barkley to sign new Everton deal","title_page":"Ronald Koeman warns Ross Barkley to sign new Everton deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Everton's final push for Europa League qualification will start on Saturday with the future of Ross Barkley in serious doubt after Ronald Koeman fired a warning shot in his direction.\nKoeman was already furious at Romelu Lukaku after the striker this week revealed he will not sign a new contract worth in excess of £130,000.\nLukaku claimed his ambitions are not matched by Everton as he hunts for silverware and the club will discuss suitable punishment for the 23-year-old over the international break.\nRoss Barkley's deal with Goodison Park outfit Everton expires at the end of next season\nEverton manager Koeman on Thursday made it clear to Barkley that he must pen terms on a longer deal or risk being sold this summer.\nBarkley's current contract runs out next year and Everton do not appear ready to allow their academy graduate to enter the final season without a resolution one way or another.\n'Ross is a boy from Everton and what we need to show him are reasons to stay,' Koeman said. 'Normally you make decisions at the end of the season, and you need to sign a new contract or you sell the player.\nKoeman will be hoping Barkley impresses again when Everton play Hull on Saturday afternoon\n'I spoke to Ross about a new contract and it is up to the board to get that contract over the line.\n'At Southampton we had Nathaniel Clyne. He didn't sign a new contract and then we sold him in the summer.\n'It is football. You need to make a decision for the club, so the club knows what will happen next year.'\nKoeman's comments suggest Barkley is more likely to depart Goodison Park than Lukaku if a compromise cannot be found with either.\nBelgian striker Romelu Lukaku has recently said that he wants to seek a new challenge\nLukaku told Everton he does not want to remain on Merseyside and suggested they were not inspiring enough in the transfer window.\n'Of course I am not happy about that interview,' Koeman said. 'If Everton weren't an ambitious club I would not be manager.\n'But I am not afraid about his situation because he has more than two years on his contract.'\nLukaku will start against Hull on Saturday after talks with the Dutchman, while Manchester United — who had earmarked Harry Kane as Zlatan Ibrahimovic's eventual successor — are likely to have followed the latest developments with interest.\nThe Belgium international is expected to start against Hull in the Premier League on Saturday\nEverton slapped a £65million price tag on Lukaku last summer and could demand more given that their man is the Premier League's joint top scorer with Kane on 19 goals this season.\nKoeman, however, admitted they are not currently in a position to fend off interest from those with added financial clout.\n'Normally you don't sell your best player to those clubs, but we are not at that level,' he said.\n'The people in the club are really strong. If we go in that direction it's the final decision for the board of the club.'","url":"https://www.dailymail.co.uk/sport/football/article-4320476/Ronald-Koeman-warns-Ross-Barkley-sign-new-Everton-deal.html"}
