{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:39:48","date_modify":"2018-10-30 21:39:48","date_publish":"2015-10-13 12:21:40","description":"Ron Eyester, the chef/owner of\nDiner in Atlantic Station\nand founder of...","filename":"data/vaneerConsumption/RonEyesterconfirmsRosebudandFamilyDogareclosedwithsalespend.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/13/Images/WPIMAGE_cmgajcfoodandmore_4796.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ro_516a9f65d2c5336b2f0bf3596b42e200__1540935588.html","title":"Ron Eyester confirms Rosebud and Family Dog are closed with sales pend","title_page":"Ron Eyester confirms Rosebud and Family Dog are closed with sales pend","title_rss":"NULL","source_domain":"ajc.com","text":"Ron Eyester, the chef/owner of Diner in Atlantic Station and founder of Grateful Tables restaurant group, confirmed the closing and pending sales of his two original Morningside/ North Highland Ave. restaurants, Rosebud and the Family Dog. Eyester closed his third Morningside restaurant, Timone’s, in July.\n“I’ve been in the process of selling both Rosebud and the Family Dog for the past couple months, Eyester said during a candid phone call. “The reason is, we got overextended. Even with the closing of Timone’s, which stopped the bleeding on a certain level, there’s still blood to contend with. We got to the point where the whole structure lost its stability on all levels.\n“Rosebud and the Family Dog were both doing pretty well. But they weren’t doing quite what they’ve done in the past, mostly due to the fact that my attention has been has been dominated by dealing with challenges, rather than doing what I know how to do best as a restaurateur.”\nIn addition to his business struggles, Eyester, who may be most famous as the Angry Chef on his Twitter account, cited recent personal struggles as part of those challenges.\n“I got divorced, I got sober, and I’ve been sober for 14 months,” he said. “That was huge, and it continues to be a process. \"To be honest, how I haven’t gone off the wagon through all this is pretty miraculous.”\nHere’s more of what Eyester had to say:\nOn the status of Diner\n“I have Diner to consider and the stability of Diner is not great right now. But my saving grace is that the Hines group, who just bought Atlantic Station, are very supportive of the concept. And they really want to see me make it work.\n“The fact that I was able to tell them that I was ready to part ways with North Highland Ave. and exclusively focus my attention on Diner, I think showed them the commitment I have to that space.”\nOn the sales of Rosebud and Family Dog\n“People ask me why I don’t sell Diner and keep Rosebud. The reason is, Diner isn’t worth anything at this point. Even though we are just a couple of steps away from solidifying deals for Rosebud and the Family Dog, both deals are right at the doorstep.\n“Rosebud is being sold to a very well established restaurateur, who is planning to keep it closed for the next couple of months and then plans to rebrand sometime in January.\n“The deal for the Family Dog is still pending. We’re working through some parts and there’s a chance I may stay on in a limited capacity for the transition.”\nOn his appearance on the 12th season of “Top Chef”\n“Me being away for six weeks certainly did not help the situation. I’m trying not to let myself look back to that exact point in time and hold that responsible, because I think that’s a fallacy.\n“Again, I don’t want to assign all the blame to Timone’s. But financially, that was definitely the crossroads that caused the most severe pain. Basically we would have some more capital that would have made getting Diner open much easier. Getting Diner open was almost an act of God at that point.”\nOn his decisions to open Timone’s and Diner\n“If we never opened Timone’s and I never entertained the idea of doing Diner then chances are we wouldn’t be having this conversation.\n“But, again, I can’t undo that at this point. I have two options. I can grab what little opportunity I have in front of me and try to make the best of it. Or I can just completely fold and fall off the radar.”\nOn the Angry Chef\n“This has been a humbling experience. But I don’t think I’ve ever been an arrogant person. Do I say things that can be a bit abrasive? Of course.\n\"The people who know me, know my character. I’m not passionate about the Angry Chef. That’s a sideshow. It’s humor and a vent for me and its humor for other people.\n“Being sober for 14 months has given me clarity that I can’t even describe. And that’s probably been the biggest adjustment for me. I was always the guy who was spearheading the party.\"\nOn the future\n“I still have a passion for this business. My personality has not undergone any radical transformation. I’m still going to be vocal in certain areas. And I want to re-emerge as a relevant figure in this dining scene — and not for the benefit of just being out there.\n“But if you look back, we did a lot of good. We were very instrumental with Field of Greens. We were one of the first restaurants involved with the Giving Kitchen. We were always involved with Morningside and other farmers markets.”\nOn summing it all up\n\"The moral of the story is we grew too fast. We got overextended and I got too enamored with the idea of growing on a grassroots level. The reality is, you can’t do it without money. You’ve got to have money behind you.\n\"Moving forward, I always need to keep in mind that there’s not a set recipe for success. What you did in one space isn’t necessarily going too translate to another.\n\"But I’m not going to change who I am. I’m dealing with this situation and trying to keep my sense of humor and trying very hard to not let it shape me personally. I think there’s a difference between learning from something and allowing it to take you over.”\n.","url":"https://www.ajc.com/blog/atlanta-restaurants/ron-eyester-confirms-rosebud-and-family-dog-are-closed-with-sales-pending-diner-will-stay-open/2zrPpeu2d51mYKY7m7pMuI/"}
