{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:36:12","date_modify":"2018-10-30 21:36:12","date_publish":"2016-03-02 08:27:38","description":"Ron Eyester, the chef/owner of Diner and founder of Grateful Tables restaurant group, confirmed that...","filename":"data/vaneerConsumption/RonEyesterconfirmsDineratAtlanticStationhasclosed.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ro_2ec68ac51f13c15ef093b8b39d7e6bde__1540935372.html","title":"Ron Eyester confirms Diner at Atlantic Station has closed","title_page":"Ron Eyester confirms Diner at Atlantic Station has closed","title_rss":"NULL","source_domain":"ajc.com","text":"Ron Eyester, the chef/owner of Diner and founder of Grateful Tables restaurant group, confirmed that his Atlantic Station restaurant has officially closed for business, after being shuttered for HVAC problems for nearly a month.\nIt's the culmination of a troubled time professionally, financially and emotionally for Eyester, who appeared on season 12 of “Top Chef” in Boston in 2014, but still may be most famous as the Angry Chef on his Twitter account.\nBack in October 2015, Eyester closed, then sold his two original Morningside/ North Highland Ave. restaurants, Rosebud and the Family Dog . Eyester closed another, short-lived Morningside restaurant, Timone’s, in July of 2015.\nBenjie Shirah and South Capital Partners reopened the Family Dog in January under the same name, with an extensive remodel and a new menu.\nIn early April, Tom Murphy and the team behind Murphy’s in Virginia-Highland and Paces & Vine in Vinings plan to open a new concept called Morningside Kitchen in the former Rosebud space .\nIn a telephone conversation, Eyester reflected on the demise of Diner and the period of Grateful Tables restaurant closings that preceded it.\n“I’m physically and emotionally exhausted from this whole process,” Eyester said. “It’s one of those situations where I was basically pushing a boulder up a hill every day. You could say that when it hit the fan, so to speak, I definitely lost a pretty significant amount of credibility.”\nEyester said his financial difficulties carried over to Diner, a concept that never quite came together in the way he envisioned it, while it received some very bad reviews, including in the AJC .\nHere’s more of what Eyester had to say:\nOn shuttering Diner\nThe whole thing with the HVAC was real. You can’t open a restaurant when it’s 35-degrees inside the building. The heating situation was a lingering problem. People would come in for breakfast and just leave. There are some serious problems with the building. And honestly, if I had the financial means to really pursue it legally, I would have some legs to stand on. But unfortunately I don’t have those resources available to me now.\nOn his efforts to save Diner\nI was actually in the process of trying to rebrand the Diner concept. I wanted to eliminate the bar area and build out a food court and market area. And I wanted the ability to capture more grab-and-go business. The busiest place for lunch in Atlantic Station is the deli at Publix.\nOn landing at Atlantic Station\nI think Atlantic Station has made tremendous improvements on a lot of fronts. Do I wish I’d never gone in there? Yeah, of course I do. But hindsight is 20-20. Do I think, given the right amount of money, I could have made Diner work there? Yeah, I do. I really do.\nOn his reputation\nI know that I’m going to have to find Ron 2.0. But I also know that my reputation has definitely been soiled to a certain degree, particularly as a restaurateur. So I think it might be smart to explore other kinds of entrepreneurial projects that are food-related.\nOn how he’s doing now\nWhen we talked about all this stuff four months ago, it was much harder to digest, because I had so much more invested with Rosebud and Family Dog — and not just financially. That was a real sense of loss. Those places were really part of the neighborhood.\nI feel really bad about what transpired at Diner because I never really gave it the opportunity to succeed. But I’m still sober. And sobriety every day has enhanced my level of clarity. I still have a lot of anxiety, especially on the financial front, but I’m in a better place to handle it and be in control.\nOn his plans for the future\nI’ve got a few irons in the fire. I’m working on curating some off-premise events. Honestly, I haven’t taken a pay check in two years, so I need to start getting paid for something. I don’t really see myself going back into a kitchen full time right now, not to say that I never will.\nSome parting thoughts\nSuch is life. I think what Atlanta has watched me go through for the past year is kind of a microcosm for life. I obviously regret how this has affected other people. If this had only affected me, I would say there was no other fitting way for me to fail as spectacularly as I did. When we were successful, we did it in a loud and sometimes obnoxious manner, depending on who you were and where you watching from. I feel like I failed in the same fashion.\nComing soon\nLook for Eyester at a Dinner Lab event later this month. And watch for a return of the 'Big Nasty' Rosebud brunch menu at a pop-up at a downtown restaurant.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/ron-eyester-confirms-diner-atlantic-station-has-closed/kMwFzQPLpD67LjGQ5ZvEHO/"}
