{"authors":["Press Association"],"date_download":"2018-10-23 04:43:23","date_modify":"2018-10-23 04:43:23","date_publish":"2017-04-26 16:19:23","description":"Despite a break of 146, the five-time champion lost to Ding Junhui.","filename":"data/vaneerConsumption/RonnieOSullivanbowsoutofworldchampionship.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/20/wire-467467-1493234052-519_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448290_Ronnie-O-Sullivan-makes-146-break-Crucible-fight-against-Ding-Junhui_1540269803.html","title":"Ronnie O´Sullivan bows out of world championship","title_page":"Ronnie O´Sullivan bows out of world championship | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ronnie O’Sullivan denied he snubbed the chance of a maximum break as he crashed out of the Betfred World Championship to Ding Junhui.\nChinese superstar Ding brilliantly saw off the five-time champion, winning through 13-10 and setting up a clash with Mark Selby in the semi-finals – a repeat of last year’s final match-up.\nO’Sullivan made a thrilling 146 break – just the third in Crucible history – as he battled in vain to stay in the tournament.\nRonnie O'Sullivan (right) (Martin Rickett/PA)\nRidiculous from Ronnie! @ronnieo147 laughing on the way to making a rare 1⃣4⃣6⃣ break at the Crucible! #ilovesnooker @Betfred pic.twitter.com/KdCLkJQaCP — World Snooker (@WorldSnooker) April 26, 2017\nAnd by taking pink from the 13th red when a perfect 147 looked a formality, O’Sullivan sparked debate over whether he had spurned the opportunity because of the low prize-money on offer.\nO’Sullivan said: “I was playing for the black but I just didn’t get on it. I don’t take this stuff too seriously.\n“I like to entertain, I like to put on a good show, and I like to have fun and I like to enjoy myself. In a world where everything’s so serious, I like to make it fun.”\nRonnie says he WAS playing for that black in the 146. Clearly didn't want to make the story about him in his presser. Great praise for Ding. — John Skilbeck (@JohnESkilbeck) April 26, 2017\nTwenty years ago O’Sullivan pocketed £165,000 for a World Championship maximum that took just five minutes and 20 seconds, but this year the 41-year-old’s reward would have been £15,000, made up of a high-break prize of £10,000 and a £5,000 147 bonus.\nWhen O’Sullivan was pressed on the financial rewards for the 147, and whether he was trying to make a point, he added: “I’m just having a bit of fun. Let’s not go down that route, let’s just enjoy the match and wish Ding the very best.”\nAt last year’s Welsh Open, O’Sullivan turned down the chance of a maximum – snooker’s greatest single-frame exploit – when he learned the prize-money was £12,000. He said at the time he “didn’t think the prize was worthy of a 147”, and was criticised by World Snooker chairman Barry Hearn.\nAt the 2010 World Open in Glasgow he had to be pressed by referee Jan Verhaas to pot the black to complete a maximum after being told there was no bonus on offer.\nHearn, who has this month flatly rejected O’Sullivan’s claims of “bullying” over a disciplinary dispute, was by coincidence paying the Crucible a visit on Wednesday.\nHearn was in no mind to stoke up another row with O’Sullivan over the 146 though, saying: “It’s his choice. He can do what he likes. If he doesn’t want a 147, don’t have a 147.”\nThe masterful break from O’Sullivan had trimmed his arrears to 11-9, but Ding would not be denied and finished off with an ice-cool 117, his third century of the match.\nO’Sullivan offered 30-year-old Ding a warm hug in the arena.\nA thrilled Ding said: “I played great, kept my form from the first frame to the last frame. I put Ronnie under pressure. I don’t know if Ronnie felt the pressure but I tried to do it.”\nExplaining what O’Sullivan had told him afterwards, Ding added: “He just said that I looked a different player, how I looked stronger. I’m proud to have support from Ronnie. Every year I’m here trying to win the title. This year I have more confidence to come through.”","url":"https://www.dailymail.co.uk/wires/pa/article-4448290/Ronnie-O-Sullivan-makes-146-break-Crucible-fight-against-Ding-Junhui.html"}
