{"authors":["Peter Carline For Mailonline"],"date_download":"2018-10-22 21:05:23","date_modify":"2018-10-22 21:05:23","date_publish":"2017-04-26 01:01:00","description":"Ronnie Ekelund made his debut for Brondby aged 15, is one of only four Danes to play for Barcelona and is regarded by Matthew Le Tissier as the best team-mate of his career.","filename":"data/vaneerConsumption/RonnieEkelundonforgingoneofthegreatdoubleacts.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/00/3F90B74E00000578-0-image-a-110_1493164668754.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4445936_Ronnie-Ekelund-forging-one-great-double-acts_1540242323.html","title":"Ronnie Ekelund on forging one of the great double acts","title_page":"Ronnie Ekelund on forging one of the  great double acts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ronnie Ekelund made his debut for Brondby aged 15, is one of only four Danes to play for Barcelona and is regarded by Matthew Le Tissier as the best team-mate of his career.\nThe pair played just 17 Premier League games together at Southampton as Alan Ball coaxed the mercurial Channel Islander into the form of his life, but Ekelund also flourished under the World Cup-winner, who died 10 years ago this week.\n‘From day one when I met Alan Ball, I felt that I clicked with him as a manager and what he was trying to do with the team. I was a piece of that puzzle and fitted it nicely,’ Ekelund said.\nRonnie Ekelund played 17 Premier League games together for Southampton from 1995 to 96\n‘Alan had a good feeling for when to step it up a little bit more in practices and when to back off when the guys had been working hard and the schedule was tough. I felt he had a very good sense of that.\n’He had a little bit of something going on with the man management with each player and motivating the whole team.\n‘He was good at the social aspect of things to get everybody on the same page and be more cohesive as a team.’ During Ball’s 18-months at The Dell, an electric Le Tissier scored 45 goals in 65 games. The message was simple: pass to Le Tissier. Ekelund, who chipped in with five Premier League goals, recalls his time there fondly.\n‘Le Tiss and I were on the same page and Alan recognised that very early on. He kind of went to the team, “Get the ball to Le Tiss and Ronnie”. And we were trying to find those pockets and create the plays from there.\nEkelund (left) is regarded by Matthew Le Tissier (right) as the best team-mate of his career\n‘He was one of the first managers at that level that recognised that, at least verbally said that out loud in meetings.\n'I grew with confidence and I’m sure Le Tiss did as well.’ The received wisdom is that Ekelund joined Southampton after a chance meeting between Ball and Johan Cruyff in August 1994 in a hotel in Doorwerth, Holland.\nThe pair knew each other from their NASL days and the story goes that Cruyff asked Ball if he needed anything over dinner. ‘A left-sided midfielder,’ came the reply. The next morning Ekelund was waiting in the lobby to join Southampton on loan. But Ekelund insists there was a little more to it.\n‘I had asked to look at exploring moving on from Barcelona - I was probably thinking more in the Spanish league at the time - but I was presented with the opportunity at Southampton and asked whether that was something I wanted to explore. I said yes.\n’It so happened that the Barcelona team was moving on to the next stage of the pre-season and I could choose to check out Southampton and Alan Ball could have a look at me.\nEkelund flourished under the management of World Cup-winner Alan Ball\n‘I really enjoyed what I saw and clicked with both Alan Ball and Le Tissier, but we had a great team.’ Ekelund should know. He played alongside some of the world’s best: Peter Schmeichel was at Danish champions Brondby, while there was an embarrassment of riches at Johan Cruyff’s all-conquering Dream Team.\nWith Ekelund’s idol Michael Laudrup in his prime, Romario, Hristo Stoichkov, Ronald Koeman and Richard Witschge put Ekelund, just 19 when he joined the Catalan giants in 1992, down the pecking order.\nThere was, as Ekelund puts it, ‘half the Spanish national team’ there too, with Guillermo Amor, Pep Guardiola, Jose Mari Bakero, Andoni Goikoetxea and Txiki Begiristain also among his team-mates.\nFrustrated by a three-foreigner rule which led to a solitary La Liga appearance (he replaced Bakero against Racing Santander in March 1994), Ekelund was training with the best, but playing for the club’s B side.\nThe Dane scored five goals for Southampton during his one year loan spell at the club\n‘Practices were so much at a higher level. You had half the Spanish national team and all these superstars, and then the 19-year-old kid.’\n‘It was incredible. Playing certain possession games in Barcelona you are on a team and you lost the ball. And they were so good that you didn’t see it for 20 minutes. They just didn’t give it away!’\nCapped at every level by Denmark up to Under 21s, Ekelund joined Barcelona after the 1992 Olympics. Denmark didn’t make it out of their group (‘We weren’t very successful, it was too hot for the vikings to go into Spain and play!’, he said), but it was a good tournament for Ekelund individually.\nBarcelona had been tracking him at Brondby and he moved straight from Denmark’s base in Zaragoza to the Catalan club. As Ekelund was settling in, Spain won gold in front of almost 100,000 people at the Nou Camp.\nEkelund's time at Southampton was ended by a back injury he followed Ball to Manchester City\n‘Guardiola and Albert Ferrer were in the Spanish Olympic team which went all the way. At the time he was a young player but he could hold his own on the Dream Team.\n‘There were a lot of strong characters and leaders on that team. You would imagine Guardiola, Koeman and Stoichkov would always go that way (into management).’ Calling the shots was another strong character. A chain-smoking Dutchman had just become the third person to win the European Cup as a player and manager.\n‘Cruyff was an amazing player still, joining in on short games,’ Ekelund recalled. ‘He had his strengths and his weaknesses as a manager. He had a certain way about him of getting the players to perform.\n‘He was strategically very good. It sort of amazed me, the weaknesses of the other team didn’t matter, where it was on the pitch. He’d put stronger players to face those weaker opponents.’ Despite such characters and experiences, he wanted to move on. I felt my internship was over and I looked for the next step,’ he said.\nHis time at Southampton was ended by a troublesome back injury and after following Ball to Manchester City (again on loan), he played four times before another loan at Ron Atkinson’s Coventry.\nEkelund of the San Jose Earthquakes kisses the MLS cup after beating Chicago Fire in 2003\n‘Big Ron brought me in and Gordon Strachan took over, and I think they were slightly different philosophies! Big Ron had plans with me, but Strachan changed that as soon as he arrived! I fell in between two chairs on that one!’\nEkelund returned to his homeland with Lyngby (loan) and Odense before short spells at Toulouse and Walsall. In 2001 he moved to the San Jose Earthquakes, who won two MLS Cups in three years.\nEkelund still lives in California with his English wife Claire. The couple have their own company, Bebe au Lait, which sells a range of nursing goods.\nAs he looks back on his remarkable career, his short, sweet cameo at Southampton which forged one of the Premier League’s great double acts still brings a smile to his face.\n‘Le Tiss and I from day one - even when I joined the team at the training camp in Holland and met them there. It was very early on, I thought, “We’re on the same page here”, which was nice.’","url":"https://www.dailymail.co.uk/sport/football/article-4445936/Ronnie-Ekelund-forging-one-great-double-acts.html"}
