{"authors":["Jeff Poor"],"date_download":"2018-10-30 22:18:37","date_modify":"2018-10-30 22:18:37","date_publish":"2016-06-06 13:54:14","description":"Monday on MSNBC's \"Morning Joe,\" former Rep. Ron Paul (R-TX), who previously had been a presidential candidate both as a Republican and a Libertarian, | Video","filename":"data/vaneerConsumption/RonPaulNotOverlyEnthralledWithRepublicanDemocraticorLibertarianPresidentialCandidates.json","image_url":"https://media.breitbart.com/media/2016/06/RonPaul66.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_06_06__1540937917.html","title":"Ron Paul: 'Not Overly Enthralled' With Republican, Democratic or Libertarian Presidential Candidates","title_page":"Ron Paul: 'Not Overly Enthralled' With Republican, Democratic or Libertarian Presidential Candidates | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Monday on MSNBC’s “Morning Joe,” former Rep. Ron Paul (R-TX), who previously had been a presidential candidate both as a Republican and a Libertarian, criticized the current field of presidential candidates, which not only included presumptive Republican presidential nominee Donald Trump and Democratic presidential front-runner Hillary Clinton, but Libertarian Party nominee Gary Johnson as well.\nPartial transcript as follows:\nBREZINSKI: There is a third-party option. Do you think it is worth talking about?\nPAUL: Well, I guess you’re talking about the Libertarian Party maybe?\nBRZEZINSKI: Yeah, maybe. What do you think?\nPAUL: Well, I’m looking for a second party because I see the Republicans and Democrats and all the fighting and screaming at each other. Policies never change. The size and scope of the executive branch which is a big concern for me keeps growing no matter which candidate, whether quite frankly it’s Hillary or Trump. I think they believe in a strong executive and that’s opposite of libertarianism. The libertarian principle of nonaggression, that is where government can’t use force to mold a society or the economy or tell other people how to live around the world, I would say that’s a great principle. I’m not overly enthralled with the candidates but that principle is worthwhile and the opposite of what we’ve been live with and opposite of the ideas that have brought us to this point where we are now facing bankruptcy and nobody is talking about the seriousness of the economy and the bankruptcy we face.\nBRZEZINSKI: In fact, what they are talking about is they are both attacking each other and it’s almost a race to how low things can go based on the Trump side. I know you don’t feel these candidates who are in — Gary Johnson, Bill Weld are really more than a shrug. Is there any possibility for anybody else at this point?\nPAUL: Not really. I think the people are left with very poor choices and no real contest. We send hundreds of thousands of people and spend trillions of dollars going overseas saying we’re going to overthrow your dictator and force you have to democracies and elections. In this country, we do not really have democracy. Even if we were really, really super happy with the Libertarian candidate, you would think they’d get into the debates. The debates are run by the Republicans and Democrats. They’d find a way of excluding them. That’s not going to happen unless you’re a billionaire and can put enough pressure on the media to capitulate and say maybe we ought to talk to a third-party candidate.\nOverall, foreign policy won’t change with each party in a significant way. Spending is going to continue. Government intervention with the Federal Reserve is going to keep manipulating interest rates and never face up to the fact this country has lived way beyond its means and the debt is incomprehensible and all we know is it’s going to grow and grow. And I think the personal fighting is a distraction from the real issue which is personal liberty and the bankruptcy of this country and the failure of our foreign policy. That’s where the problem is.","url":"https://www.breitbart.com/video/2016/06/06/ron-paul-not-overly-enthralled-with-republican-democratic-or-libertarian-presidential-candidates/"}
