{"authors":["Mia De Graaf For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 04:07:31","date_modify":"2018-10-23 04:07:31","date_publish":"2017-03-10 14:19:39","description":"A Chicago-based group that establishes work standards for U.S. medical school graduates has voted to eliminate a 16-hour cap for first-year residents.","filename":"data/vaneerConsumption/Rookiedoctorscanwork24HOURSaday.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/14/wire-196425-1489155868-135_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4301458_Rookie-docs-work-longer-24-hour-shifts-new-rules_1540267651.html","title":"Rookie doctors can work 24 HOURS a day","title_page":"Rookie doctors can work 24 HOURS a day | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rookie doctors can work up to 24 hours straight under new work limits taking effect this summer.\nA Chicago-based group that establishes work standards for U.S. medical school graduates has voted to eliminate a 16-hour cap for first-year residents.\nSupporters say the move will enhance training for new medics - but critics warn it will do just the opposite.\nThe Accreditation Council for Graduate Medical Education announced the move on Friday as part of revisions that include reinstating the longer limit for rookies - the same maximum allowed for advanced residents.\nAn 80-hour per week limit for residents at all levels remains in place under the new rules.\nCambridge Hospital first-year residents Samantha Harrington, center, and Vikas Gampa, right, talk about their patients during shift change. Effective this summer, rookie doctors can work up to 24 hours straight under new extended limits, after the 16-hour limit was removed\nDr. Anai Kothari, a third-year resident on a council panel that recommended the changes, says he only occasionally works 24-hour shifts.\nThe extra hours give him time to finish up with patients instead of being sent home in the middle of a case, said Kothari, who works at Loyola University Medical Center near Chicago.\nBut first-year resident Dr. Samantha Harrington thinks it will endanger the safety of residents and patients.\nHarrington says her 14-hour shifts this winter at Cambridge Hospital near Boston are already plenty long. To stay awake while driving home after work, she sometimes rolls down the window to let the freezing air blast her in the face.\nHarrington says the grueling hours are 'based on a patriarchal hazing system,' where longtime physicians think 'I went through it, so therefore you have to go through it too'.\nShe is a member of the Committee of Interns and Residents, a union group that opposes the work-shift changes. So does the American Medical Student Association.\nDr. Kelly Thibert, the group's president, says putting a 16-hour cap on all residents' work shifts would be a safer way to even the playing field.\nThere are more than 120,000 U.S. doctors-in-training including rookies.\nThe accreditation council has for years wrestled with ensuring that doctors are adequately trained but not over-worked.\nThe 1984 death of an 18-year-old college student in a New York hospital while under the care of medical residents working long hours put a national spotlight on the issue.\nMedication error and inadequate supervision were cited in that case, which prompted a lengthy investigation and state limits for residents' work hours.\nIn 2003, the council implemented national standards that established the 24-hour shift cap and 80-hour work week for all residents.\nAfter an Institute of Medicine report raised additional safety concerns about sleep-deprived residents, the council in 2010 shortened work shift caps for first-year residents to 16 hours and strongly recommended 'strategic napping.'\nCritics of the shorter limit said it short-changed rookie doctors. Dr. Karl Bilimoria, a Northwestern University surgery professor, said some residents have complained that they've had to leave work in the middle of surgeries.\nBilimoria led a study published last year suggesting that first-year residents could work longer without endangering patient safety or their own well-being.\nThe research was among published findings that helped persuade panel to recommend lifting the 16-hour cap.\nCritics say the grueling hours are 'based on a patriarchal hazing system'\nThe council's board approved the recommendation in a vote last month. The group delayed announcing the vote until its annual education conference, which ends Sunday in Orlando, Florida.\n'We all agree that nobody wants tired physicians' said Dr. Rowen Zetterman, board chairman.\nHe said the new rules give training programs more flexibility, help eliminate abrupt handoffs of patients and will enhance teamwork among new doctors and their supervisors.\nThe rules say rookie doctors must have supervisors nearby, and those more experienced doctors can step in if a new resident is exhausted, Zetterman said.\nU.S. doctor training generally includes an undergraduate science-related degree followed by four years of medical school.\nAfter that, newly minted doctors pursue several years of on-the-job training as medical residents, usually in hospitals. Fellowships or extra training in medical specialties may follow after that.","url":"https://www.dailymail.co.uk/health/article-4301458/Rookie-docs-work-longer-24-hour-shifts-new-rules.html"}
