{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:44:44","date_modify":"2018-10-22 23:44:44","date_publish":"2016-01-11 07:31:48","description":"Nine-year-old Jacob stars as Golden Globe winner Brie Larson's son in the hit drama movie, which was nominated for Best Picture at the awards.","filename":"data/vaneerConsumption/RoomsJacobTremblaysfatherbecomesasocialmediastudatGoldenGlobeAwards2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005A23B00000578-0-image-a-77_1452496850469.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393452_He-s-just-hot-Social-media-swoons-tween-Room-star-Jacob-Tremblay-s-police-detective-dad-handsome-hunk-turns-unlikely-pin-up_1540251884.html","title":"Room's Jacob Tremblay's father becomes a social media stud at Golden Globe Awards 2016","title_page":"Room's Jacob Tremblay's father becomes a social media stud at Golden Globe Awards 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An unlikely heartthrob emerged during the Golden Globes on Sunday night in the form of tween Room star Jacob Tremlbay's handsome police detective father.\nThe rugged hunk has been making a number of red carpet appearances in recent weeks, acting as a chaperone to his nine-year-old son, who is being hailed as one of Hollywood's brightest young stars thanks to his emotional performance alongside actress Brie Larson in Room.\nBut the young star has competition in the popularity stakes from his own dad, who has been hailed on social media as one of the most handsome hunks to make an appearance on the Golden Globes red carpet - high praise given the number of A-list actors also in attendance at the star-studded event.\nScroll down for video\nHeartthrob: Nine-year-old actor Jacob Tremblay's father, pictured with his son, has become a social media sensation thanks to his rugged good looks\nMysterious: Little is known about the Canadian police detective, who is pictured with his son at an event earlier this month, but that hasn't stopped his star from rising on social media\n'Is Jacob Tremblay's dad taken or...?' one person posted on Twitter, while another added: 'Jacob Tremblay's dad is so [hot],' before using a series of fire emojis in order to really hammer home their point.\nOthers noted that Mr Tremblay is following in the footsteps of other unlikely red carpet heartthrobs such as Michael Keaton's son, or Julianna Margulies' husband, both of whom were turned into social media pin-ups during previous award ceremonies.\nMr Tremblay first rose to prominence mere weeks ago when he stepped out on the red carpet alongside his son at the 27th Annual Palm Springs International Film Festival Awards Gala, and then again at the event's after party.\nHowever this time around - much to the disappointment of his fans at home - Mr Tremblay let his son walk the red carpet alone, opting to take more of a background role, before joining the youngster at his table during the awards ceremony.\nA man in uniform: A few weeks ago, Jacob shared these images of his father, including one with his two sisters Emma and Erica, left, on Instagram, describing the police officer as his 'hero'\nHigh praise: Dozens of people took to Twitter to voice their feelings of lust for Mr Tremblay\nTo the point: This woman used few words to describe her feelings for the police detective - but still managed to get her opinion across\nPopular: Many compared Mr Tremblay to other unlikely heartthrobs who have emerged from award ceremonies in the past, such as Michael Keaton's son\nMaking waves: Another person described the doting dad as the 'new Julianna Margulies's husband'\nAnd as if that wasn't bad news enough, unfortunately for all of those lusting after Mr Tremblay, who reportedly works as a police detective in Canada, where he and his family are based, appears to be taken - and is thought to still be in a happy relationship with young actor Jacob's mother, with whom he has two other children.\nStardom seems to run in the family however so Mr Tremblay's sudden brush with fame might well come as no surprise to his nearest and dearest.\nIn addition to Jacob's rising star, both of Mr Tremblay's daughters, Emma, who is older than Jacob, and Erica, who is the youngest, are forging careers as actresses and look set to be as successful as their brother.\nEmma has appeared in a series of big screen hits already, including Elysium alongside Matt Damon, and The Giver alongside Meryl Streep.\nAs for Jacob, while the tween star was not nominated for an award himself at Sunday night's Golden Globes, his Room co-star Brie made sure to give him a shout-out during her acceptance speech.\nRising star: The young actor is being hailed as one of Hollywood's hottest tween talents after his emotional performance in Room\nCo-stars: Jacob stars alongside Brie Larson in the hit movie Room\nWinner! Brie scooped the gong for Best Performance By An Actress In A Motion Picture Drama for her role as Jacob's mother, Ma, who was kidnapped and repeatedly raped in a shed, which she calls Room\nBrie scooped the gong for Best Performance By An Actress In A Motion Picture Drama for her role as Jacob's mother, Ma, who was kidnapped and repeatedly raped in a shed, which she calls Room.\nIn the movie, she gives birth to a son, Jack, played by Jacob, and tries to use creativity and imagination to create a fulfilling life for her five-year-old son.\nAfter the mother-son duo escape, the boy's eyes are opened as he finally gets to see the outside world.\nDuring her emotional acceptance speech, Brie praised Jacob for his performance in the movie, referring to the young actor as: 'Half of this award! Half of my performance!'\nLater on during her post-win press conference, the actress said of her young co-star that he couldn't wait to celebrate the award with her, and did so in the most heart-warming of ways.","url":"https://www.dailymail.co.uk/femail/article-3393452/He-s-just-hot-Social-media-swoons-tween-Room-star-Jacob-Tremblay-s-police-detective-dad-handsome-hunk-turns-unlikely-pin-up.html"}
