{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 22:29:54","date_modify":"2018-10-22 22:29:54","date_publish":"2017-03-16 03:47:47","description":"She plays Claire Temple in the Marvel series. But Rosario Dawson looked more like a Mayan one at the Iron Fist premiere in New York on Wednesday. The 37-year-old rocked a VERY colorful dress","filename":"data/vaneerConsumption/RosarioDawsonflashesherlegsatIronFirstNYCpremiere.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53050800000578-0-image-a-239_1489655389042.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318678_Rosario-Dawson-rocks-colorful-dress-Iron-Fist-premiere_1540247394.html","title":"Rosario Dawson flashes her legs at Iron First NYC premiere","title_page":"Rosario Dawson flashes her legs at Iron First NYC premiere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is seldom seen to put a sartorial foot wrong.\nAnd Rosario Dawson yet again nailed the style stakes on Wednesday as she arrived at the Iron Fist premiere in New York, while rocking a stunning, floor-sweeping gown.\nThe 37-year-old rocked the colourful gown to perfection, yet shunned the initially prim appearance of the look as she hiked up the hemline to offer a flash of her endless legs for the vying cameras.\nScroll down for video\nFlash: Rosario Dawson yet again nailed the style stakes on Wednesday as she arrived at the Iron Fist premiere in New York, while rocking a stunning, floor-sweeping gown\nHer fabulous figure was lost under the overlapping skirts, with only her head and forearms peeking out of the mass of material.\nYet she gave a stunning touch by flashing her endless pins from beneath the floor-sweeping dress as she also sported wellies from underneath.\nShe was joined on the red carpet by co-stars Finn Jones, Jessica Stroup, Jessica Henwick and Tom Pelphrey.\nNurse Temple is one of the characters connecting the four Netflix Marvel series: Daredevil, Jessica Jones, Luke Cage and now Iron Fist.\nMayan Temple! The 37-year-old rocked the colourful gown to perfection, yet shunned the initially prim appearance of the look as she hiked up the hemline to offer a flash of her endless legs for the vying cameras\nMade for walking: she revealed a pair of black flat-soled boots\nShe has more than a nurse-patient relationship with Matt Murdoch's blind vigilante (Charlie Cox) who became romantically involved having saved one another on more than one occasion.\nMeanwhile, it was Jones who brought her into contact with Cage in her season one finale, when the supposedly unbreakable hero was seriously wounded.\nIn Iron Fist, she comes into contact with the titular hero (Finn Jones) when they both join the dojo run by Colleen Wing (Jessica Henwick).\nWow: She rocked a VERY colorful loose fitting tribal-style dress of oranges, greens, black and white\nUnderneath your clothes: Her fabulous figure was lost under the overlapping skirts, with only her head and forearms peeking out of the mass of material\nIn Iron Fist, she comes into contact with the titular hero when they both join the dojo run by Colleen Wing, played by Jessica Henwick\nSpin it: Rosario showed how both she and the dress could twirl\nThey were joined on the red carpet by co-stars (L-R) Jessica Stroup, Tom Pelphrey and Finn Jones\nIron Fist - AKA Danny Rand - is a master martial artist and wielder of the mystical force he is named after, which allows him to focus his chi - or natural energy force - to move or strike at devastating speed, or even heal himself or others.\nHe and his other three fellow Marvel heroes are set to unite for Netflix's upcoming crossover project, The Defenders.\nStroup and Pelphrey meanwhile play sister and brother Joy and Ward Meachum, who are childhood friends of Danny, and whose father Harold (David Wenham) was business partners with Danny's parents when they died.\nFlower power: Jessica Stroup looked stunning in a brown and white patterned maxi dress\nStunning: The 30-year-old actress accentuated her porcelain skin with complimentary make-up including a swipe of shiny pink lip\nPartner in crime: She was arm-in-arm with co-star Tom Pelphrey\nRavishing in red: Jessica Henwick wore a lowcut crimson number\nDapperL FinnJones rocked a burgundy suit but dressed it down a bit with his grey dress shirt unbuttoned at the collar and sleeves","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318678/Rosario-Dawson-rocks-colorful-dress-Iron-Fist-premiere.html"}
