{"authors":["Kelli Serio"],"date_download":"2018-10-30 18:52:56","date_modify":"2018-10-30 18:52:56","date_publish":"2015-06-25 18:17:44","description":"Actress Rose McGowan announced Wednesday she was dropped from her acting agency because she criticized a wardrobe description for a role she planned to audition for in an upcoming Adam Sandler film. |","filename":"data/vaneerConsumption/RoseMcGowanSaysShewasFiredbyAgentforCallingOutHollywoodsSexistBullsht.json","image_url":"https://media.breitbart.com/media/2015/06/rose-mcgowan-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_25__1540925576.html","title":"Rose McGowan Says She was Fired by Agent for Calling Out Hollywood's Sexist 'Bullsh*t'","title_page":"Rose McGowan Says She was Fired by Agent for Calling Out Hollywood's Sexist 'Bullsh*t' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Actress Rose McGowan announced Wednesday she was dropped from her acting agency because she criticized a wardrobe description for a role she planned to audition for in an upcoming Adam Sandler film.\nThe Jawbreaker actress shared a note from casting last week that explained how the actresses auditioning for the same part were asked to dress, which included “form fitting tank that shows off cleavage (push up bras encouraged).”\n“casting note that came w/ script today. For real. name of male star rhymes with Madam Panhandler hahahaha I die,” wrote McGowan to her nearly 600,000 Twitter followers.\nApproximately one week later, the actress tweeted she had been fired by her “wussy” acting agent over the post.\n“I just got fired by my wussy acting agent because I spoke up about the bullshit in Hollywood. Hahaha. #douchebags #awesome #BRINGIT,” she wrote.\nIn a new interview published by Entertainment Weekly, McGowan explained why she was so put off by the casting notice.\n“It was just so dumb. I was offended by the stupidity more than anything. I was offended by the fact that went through so many people’s hands and nobody red flagged it. This is normal to so many people. It was probably even a girl that had to type it up. It’s institutionally okay,” she said.\nMcGowan also claimed she was not trying to vilify Sandler with her tweet, but is fed up with the “institutional stupidity and the institutional infantilization of actresses.”\n“They’re not going to want me in that role! That’s okay because I don’t want to do it anyways. So there,” she concluded.\nMcGowan’s tweets can be seen below.\ncasting note that came w/script I got today. For real. name of male star rhymes with Madam Panhandler hahahaha I die pic.twitter.com/lCWGTV537t — rose mcgowan (@rosemcgowan) June 18, 2015\nI just got fired by my wussy acting agent because I spoke up about the bullshit in Hollywood. Hahaha. #douchebags #awesome #BRINGIT — rose mcgowan (@rosemcgowan) June 25, 2015\nThe awesome thing about being an artist? You can't be fired from your own mind. #FREEDOM — rose mcgowan (@rosemcgowan) June 25, 2015\nMcGowan’s talent agent Shelia Wenzel has now departed Innovative amid the controversy surrounding her client’s tweets.\nThe Hollywood Reporter confirmed the news through a phone call to the agency’s Santa Monica office on Thursday.\nPer a tweet issued by McGowan Thursday, Wenzel’s departure had been in the works for weeks and had nothing to do with McGowan’s termination from the agency.\nThis post has been updated.","url":"https://www.breitbart.com/entertainment/2015/06/25/rose-mcgowan-says-she-was-fired-by-agent-for-calling-out-hollywoods-sexist-bullsht/"}
