{"authors":["Luciana Lopez","Jennifer Ablan"],"date_download":"2018-10-31 00:19:49","date_modify":"2018-10-31 00:19:49","date_publish":"2014-09-11 00:00:00","description":"\"We are in some kind of corrective phase in the stock market but it's not the end of the world.\"","filename":"data/vaneerConsumption/ROSENBERGStillAFundamentalBullMarket.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-david-rosenberg-us-stocks-in-correction-but-bull-market-intact-2014-9_1540945189.html","title":"ROSENBERG: Still A Fundamental Bull Market","title_page":"    ROSENBERG: Still A Fundamental Bull Market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"David Rosenberg WealthTrack via YouTube NEW YORK (Reuters) - The U.S. stock market has entered into a corrective phase, but the underlying bull market remains in place, David Rosenberg, chief economist and strategist of Canadian asset manager Gluskin Sheff, said on Thursday.\n\"We are in some kind of corrective phase in the stock market but it's not the end of the world,\" Rosenberg told Reuters, saying that valuations are expensive but not necessarily in bubble territory.\n\"I think we're still in a fundamental bull market,\" said Rosenberg, a long-time leading bear on Wall Street who had turned bullish about two years ago.\nRosenberg, whose Toronto-based firm had $7.5 billion in assets under management at the end of the second quarter, had changed his bearish outlook shortly after writing in mid-2012: \"I do see a light at the end of the dark tunnel. Don't be surprised if I end up turning bullish ahead of the pack.\"\nSince the financial crisis, U.S. stocks have shot up. Last year the benchmark S&P 500 rose about 30 percent; so far this year the index is up about 8 percent.\nThe S&P has now gone about three years without a correction of at least 10 percent, an unusually long period that's caused unease among investors who are convinced that a decline must be coming.\nBut Rosenberg said that such a correction could bring more buyers into the market, because there are few attractive alternatives to stocks these days. He noted that money has been quick to come back into the market on previous smaller dips.\nNothing is cheap at the moment, but some sectors could gain more, he said, noting the impact of an upswing in capital spending.\n\"Capital spending is finally emerging as a big positive story in this country,\" he said, as companies move to replace aging infrastructure, lower utilization rates hovering around 80 percent, and boost productivity.\nIndustrials, technology and financials will all benefit from that kind of spending, he said.\nIn contrast, Rosenberg said, the bull market in U.S. Treasuries has been over for more than two years.\nA broader uptrend of higher interest rates has begun, he said, with the U.S. Federal Reserve taking a more permissive stance toward inflation as it seeks to boost wage growth among a broader swath of the United States.\nThe U.S. 10-year Treasury note , which is a major benchmark for global credit and derivatives markets, is now yielding about 2.53 percent.\nWhile that is off the high of around 3 percent toward the end of last year, the yield has yet to repeat its lows near 1.4 percent in July 2012.\n\"Bonds are just a speculative trade as far as I'm concerned,\" Rosenberg said. \"I see the bond market more overvalued than the stock market.\"\n(Reporting by Jennifer Ablan and Luciana Lopez; Editing by Leslie Adler)","url":"https://www.businessinsider.com/r-david-rosenberg-us-stocks-in-correction-but-bull-market-intact-2014-9"}
