{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:12:03","date_modify":"2018-10-30 21:12:03","date_publish":"2015-02-12 20:18:05","description":"Comedienne, radical, and staunch Israel and democracy supporter Roseanne Barr took to Twitter this week in response to a vote by UC Davis to divest from a slew of American companies doing business in Israel. |","filename":"data/vaneerConsumption/RoseanneBarrSaysUCDavisShouldBeNukedforAntiIsraelVote.json","image_url":"https://media.breitbart.com/media/2015/02/Roseanne-Barr-Reuters.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_02_12__1540933923.html","title":"Roseanne Barr Says UC Davis Should Be 'Nuked,' for Anti-Israel Vote","title_page":"Roseanne Barr Says UC Davis Should Be 'Nuked,' for Anti-Israel Vote | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Comedienne, radical, and staunch Israel supporter Roseanne Barr took to Twitter this week in response to a vote by UC Davis to divest from a slew of American companies doing business in Israel.\nBarr had tweeted, “I hope all the jews leave UC Davis & it then it gets nuked,” on Tuesday, before deleting her tweet, according to the Sacramento Bee.\nShe sent out the following tweets the next day:\nBarr was soon met with a slew of anti-Semitism from individuals she described as “Jew haters”:\nProud to have spam blocked 25k Jew haters today! #UCDavisDivest toads — Roseanne Barr (@therealroseanne) February 11, 2015\nThis past Sunday, UC students passed a similar resolution in addition to another resolution calling for divestment from America and much of the world.\nUC Davis spokesman Andy Fell reportedly declined to respond to Barr’s tweets by telling the Bee “I think the tweets speak for themselves.”\nHowever, Barr issued a tweet directed at journalists, intending to clarify her intention behind her “nuking UC Davis” tweet, saying it was a critique of the school’s “racist structure”:\nnote2 ‘journalists’ who r pretending not2 know that my comments R a direct critique of th racist structure at #UCDavis: inform yourselves. — Roseanne Barr (@therealroseanne) February 12, 2015\nUC Davis Chancellor Linda Katehi issued an online statement on Friday acknowledging the divestment vote while noting that “This, however, does not reflect the position of UC Davis or the the University of California System.”\nThe next day two swastikas were painted on to the exterior of a Jewish fraternity (AEPi) at UC Davis in what police are now investigating as a hate crime.\nBarr’s tweets have caused her trouble before. In 2012, she tweeted the home address and telephone number of George Zimmerman’s parents–an act for which she was sued last year.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/entertainment/2015/02/12/roseanne-barr-says-uc-davis-should-be-nuked-for-anti-israel-vote/"}
