{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-22 20:11:49","date_modify":"2018-10-22 20:11:49","date_publish":"2016-01-29 00:39:44","description":"With her honey coloured locks scraped back into a bun, the 28-year-old's fresh faced complexion was on full display, radiating with a healthy glow.","filename":"data/vaneerConsumption/RosieHuntingtonWhiteleygoesmakeupfreeasshestunsingreycoat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30AE051E00000578-0-image-a-67_1454024934347.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421926_Rosie-Huntington-Whiteley-goes-make-free-stuns-grey-coat_1540239109.html","title":"Rosie Huntington-Whiteley goes make-up free as she stuns in grey coat","title_page":"Rosie Huntington-Whiteley goes make-up free as she stuns in grey coat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of the world's most beautiful supermodels.\nSo it came as no surprise that Rosie Huntington-Whiteley didn't need much make-up to make a striking impression on Thursday, turning heads as she walked through Kings Cross St Pancras station in London.\nWith her honey coloured locks scraped back into a bun, the 28-year-old's fresh faced complexion was on full display, radiating with a healthy glow.\nScroll down for video\nBarefaced beauty! It came as no surprise that Rosie Huntington-Whiteley didn't need much make-up to make a striking impression on Thursday, turning heads as she walked through Kings Cross St Pancras station\nBut whilst she was proud to display her almost bare face, the runway star kept her left hand firmly under wraps, hiding her stunning diamond engagement ring.\nRosie - who announced her engagement to long-term partner Jason Statham earlier this month at the Golden Globes - hid her new rock beneath a cosy-looking grey cocoon coat that bundled up her lithe frame.\nAdding some glamour in a pair of thigh high black boots, the lingerie model looked set to travel in style as she wheeled her suitcases through the station.\nNatural beauty! With her honey coloured locks scraped back into a bun, the 28-year-old's fresh faced complexion was on full display, radiating with a healthy glow\nFeeling shy? Whilst she was proud to display her bare face, the runway star kept her left hand firmly under wraps, hiding her stunning diamond engagement ring\nBundled up: Rosie - who announced her engagement to long-term partner Jason Statham earlier this month at the Golden Globes - hid her new rock beneath a cosy-looking grey cocoon coat that bundled up her lithe frame\nThe demure ensemble comes after Rosie flashed a tad more than she bargained for whilst walking in the Versace show for Paris Fashion Week on Sunday.\nEnsuring all eyes were on her as she hit the runway in a thigh high split cobalt gown, the blonde beauty accidentally exposed her underwear as the flowing gown fell to one side.\nEver the professional, she continued with her sultry strut in the show, acting none the wiser to the embarrassing incident.\nStylish: Adding some glamour in a pair of thigh high black boots, the lingerie model looked set to travel in style as she wheeled her suitcases through the station\nHurrying through: Rosie seemed in a rush to board her train, keeping her head down and striding forward\nPensive: The striking star seemed deep in thought and will no doubt be busy juggling her career commitments with planning her wedding to her boyfriend of five years, Jason\nFeeling chilly: The blonde beauty appeared to feel the cold, wrapping up in her cosy looking coat\nMixing it up: The star went fresh faced for the journey after launching her new make-up line\nMeanwhile, the striking star will no doubt be busy juggling her career commitments with planning her wedding to her boyfriend of five years, Jason.\nRosie has also made her desire to have children be known, and she previously stated she imagined she'd become a mother before becoming a wife.\nSpeaking to SELF magazine in April, she explained: 'For any couple that’s been together for a certain amount of time, there’s a massive amount of pressure to get married.'\n'I totally believe in marriage, but being in a happy relationship is much more important to me...\n'[Kids are] something that’s more realistic in the near future.'\nKnickerflasher glory! The demure ensemble came after Rosie flashed a tad more than she had bargained for whilst walking in the Versace show for Paris Fashion Week on Sunday","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421926/Rosie-Huntington-Whiteley-goes-make-free-stuns-grey-coat.html"}
