{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-22 22:12:00","date_modify":"2018-10-22 22:12:00","date_publish":"2016-01-29 09:08:26","description":"The supermodel, 28, has shared the secrets to her natural glow with A-list cosmetics queen Lisa Eldridge in a new video tutorial, which showcases products from her new M&S make-up range.","filename":"data/vaneerConsumption/RosieHuntingtonWhiteleystarsinabeautytutorialwithLisaEldridge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/22/30AD928A00000578-0-image-a-12_1454018743978.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421520_Rosie-Huntington-Whiteley-stars-beauty-tutorial-Lisa-Eldridge-showing-exactly-gets-enviable-glow_1540246320.html","title":"Rosie Huntington-Whiteley stars in a beauty tutorial with Lisa Eldridge","title_page":"Rosie Huntington-Whiteley stars in a beauty tutorial with Lisa Eldridge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her flawless, glowing skin and pink pillowy pout.\nNow beauty icon and model Rosie Huntington-Whiteley has teamed up with make-up artist friend Lisa Eldridge to share the secrets behind her seemingly effortless look in a new video tutorial.\nIt sees the model reveal some of the brand new products from her make-up range for M&S, which launched this week and give tips on how you can use them to emulate her look.\nScroll down for video\nRosie Huntington Whiteley has filmed a beauty tutorial with make up guru Lisa Eldridge to share her tips and introduce her new 51-piece make-up collection for M&S\nYouTube star Lisa, who has worked with Kate Winslet, Cara Delevingne and Keira Knightley, welcomed the newly-engaged Rosie into her home studio at the behest of fans.\n'I get so many requests to do a Rosie Huntington-Whiteley make-up tutorial,' she explains. 'I can see why. She's a goddess. It's not a difficult job when you've got such a beautiful face to make-up.\n'But she's also really lovely and I like the fact that she genuinely loves make-up.'\nLisa explains that she's going to be creating the 'signature Rosie look', which is a 'natural day look' that's 'very glowy' - the 'Rosie look on Rosie'.\nLisa begins by applying a layer of Rosie's new radiance cream using a Tom Ford make-up brush\nShe uses a Lancome foundation but says she doesn't need to apply it everywhere as Rosie has such naturally good skin\nHer first step is to apply some of the radiance cream from Rosie's new 51-piece range, costing from £10 for an eyebrow pencil, using it like a primer to help the make-up stick.\nLisa explains that additionally it's moisturising and gives 'a nice glow to the skin'.\n'I would typically use my moisturiser underneath or my sun scream as I like to wear SPF every day,' Devon-born Rosie, 28, explains as Lisa applies the radiance cream with a brush.\n'Or I would wear it under my foundation or even on top as it gives that real natural healthy glow that we all strive for. We don't always have it.'\nLisa then applies Lancome's Teint Visionnaire Foundation, using a brush to even it out here and there.\nLisa pats on concealer under Rosie's eyes as the model admits she prefers using her fingers to apply her make-up rather than brushes. She then uses a brush to blend the concealer and hide any small blemishes\nRosie's cheekbones are accentuated with highlighter, a product Rosie admits she uses all over her face and on her collarbone to get a glowing look\nLisa chooses a Stila cream blush and mixes it with radiance cream to give Rosie's cheeks a flush of delicate colour\nHowever, Rosie says that she goes through phases, sometimes using a brush or a sponge. But she prefers to use her fingers\n'I like to apply all my make-up with my fingers,' she says. 'I like to be able to touch my skin. I blur my eyeshadow with my fingers. And my blushers.'\nLisa adds that she doesn't need to apply foundation all over because Rosie's skin is so good.\n'Every time I see you your skin looks wonderful,' she tells the model.\n'I do try to look after it,' Rosie agrees. 'Very well. I am very diligent with my skincare regime.'\nRosie likes to keep her eye make-up natural and Lisa applies a light wash of taupe over her entire eyelid\nLisa adds chocolate brown liner, making the line thicker as she progresses along the lash line\nShe finished with a coat of Bourjois black mascara. Rosie admits that it's her beauty essential and says her 'days would be different' if she was without her mascara\nLisa then applies the new Rosie for Autograph concealer under the model's eyes and to cover some tiny blemishes and blends with a brush.\nOpening up about her love of beauty, Rosie explains: 'I've always loved make-up and how transformative it is. And I love that time in the morning getting ready or before I go out in the evening, because it's my time. And it's putting your war paint on, your mask.'\nTo highlight Rosie's cheekbones, Lisa blends some of Rosie's radiance cream with cream blush to create a dewy finish. Then she adds highlighter to the top of her cheekbones and pats it in with her fingers.\n'I love highlighter,' Rosie explains. 'I apply it all over the top lip, centre of nose, corner of my eyes, and on my collarbone.'\nLisa's next step is to add a light dusting of T Le Clerc loose powder to set the concealer, before turning her attention to Rosie's eyes. Using her eyeshadow quad, she applies a light wash of mid taupe all over the lids.\nAiming to give a 3D look and a natural glow, Lisa applies bronzer under Rosie's cheekbones\nUsing a concealer brush, Lisa adds a light coating of pink lipstick to Rosie's already plump pout\n'Then I'm going to add more of the chocolatey brown shade,' Lisa explains. 'I'm going to go slightly into the socket line and come out to the outer edge and blend. Now I'm going to add the coppery shade just to the outer edge and centre.'\nShe dampens the brush to make the pigment stronger, and then applies a chocolate brown liner.\n'Thin at the inner corner and thicken up as we go along, working into the roots of Rosie's eyelashes,' Lisa says. 'I like you with that elongated eye shape. That almond shaped eye. You really suit it.\n'Using the same pencil I'm going to go in the lashes in the outer corner and meet up there with a nice sweep.'\nLisa points out that keeping the eyeliner at the outer edges gives a feline look.\nFor defining Rosie's brows she applies a few strokes of Pür Minerals Wake Up Brow pencil.\nThe model is delighted to show off the finished results after her session with Lisa who complimented her on her new beauty products, which went on sale this week\n'Do you spend a lot of time on your brows?' she asks Rosie.\n'I don't pluck them much,' she replies. 'There's a couple of stray hairs here and there. I like a natural brow. I like them combed, looking full and natural. It's a youthful look.\n'The one thing I do before I leave the house is brush my brows up and make them look nice and full. I get really OCD about my brows and other people's. It's the first thing I look at.'\nAs Lisa applies black mascara Rosie admits it's her top beauty essential.\n'I don't know what I'd do without mascara,' she reveals. 'My days would be different.'\n'It would not be good. Everyone need to curl their lashes and wear black mascara, Lisa agrees.\nTurning her attention back to Rosie's skin, Lisa applies bronzer to 'warm up and give you that really lovely 3D look.'\nShe finishes by applying a light coat of pale pink Rosie for Autograph lipstick in Love Lace followed by a Bourjois gloss.\n'I know you love make-up so I can see exactly why, of all the people I know, would do a make-up range,' Lisa tells Rosie.\n'I've always played with make-up since I was very young,' Rosie agrees. 'Creating the line was all about on-the-go, innovative products that can be used every day for everyday women, and really versatile and buildable colours. And creating natural beauty","url":"https://www.dailymail.co.uk/femail/article-3421520/Rosie-Huntington-Whiteley-stars-beauty-tutorial-Lisa-Eldridge-showing-exactly-gets-enviable-glow.html"}
