{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 02:47:30","date_modify":"2018-10-23 02:47:30","date_publish":"2017-03-10 12:05:07","description":"Ross Craig, 34, was hit in the legs yet still managed to chase the gunman down Shawhill Road in Glasgow yesterday morning but the assailant jumped in a waiting getaway car and sped off.","filename":"data/vaneerConsumption/RossCraigwhofledtoCyprustoavoidjailisshot.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E227D4500000578-0-image-a-40_1489147231687.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300854_Florist-fled-Cyprus-avoid-jail-shot_1540262850.html","title":"Ross Craig who fled to Cyprus to avoid jail is shot","title_page":"Ross Craig who fled to Cyprus to avoid jail is shot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A florist jailed for six years for slashing two men in the street with a seven-inch knife before fleeing to Cyprus has been shot in his driveway.\nRoss Craig, 34, was hit in the legs yet still managed to chase the gunman down Shawhill Road in Glasgow yesterday morning but the assailant jumped in a waiting getaway car and sped off.\nToday he is being comforted at home by his fiancée Anna Handzel, 33, after being released from the city's Queen Elizabeth University Hospital and Police Scotland say they are treating the attack as attempted murder.\nThe businessman, who owns the Regal Roses florists in the city, was jailed in 2010 after he carried out two late-night knife attacks in Glasgow four years earlier.\nAfter his arrest he jumped bail and fled to Cyprus where he hid before returning to Britain to face justice.\nManhunt: Police in Glasgow are searching for the gunman who fired on florist owner Ross Craig as he got in his car, pictured left, and right with his fiancee Anna Handzel\nProbe: Police in Glasgow are treating the attack as attempted murder - and despite getting shot Mr Craig still chased his attacker down the road despite the gunshot wound\nThe 'targeted' attack, which is being treated as attempted murder, happened in Shawlands, Glasgow, at about 8.10am yesterday - it is not clear if it was linked to his own criminal past.\nPolice said the 34-year-old man was getting into his vehicle outside his home in the residential area when he noticed someone standing at the bottom of his driveway.\nAfter going to investigate he was shot once in the leg.\nDespite his injury the victim chased the suspect, who got away in a dark-coloured vehicle that was waiting for him on St Ronan's Drive. The injured man was treated at the city's Queen Elizabeth University Hospital. He has since been released.\nDetective Inspector Colin Hailstones said: 'I know that local residents will be concerned by this incident. We understand that this was a targeted and isolated attack. It is being treated as attempted murder.'\nThe attacker is described as 5ft 7in and was wearing dark clothing and a dark beanie hat.\nExtensive inquiries are ongoing in the area to establish the exact circumstances surrounding the shooting - one of four serious ones in Glasgow in recent months.\nChief Inspector Hilary Sloan said: 'I completely understand that people will be concerned by this incident and we will have an increased uniformed presence in the area.\n'I would ask local residents to approach those officers with any information or concerns that they have.\n'You may have heard a disturbance, witnessed the chase or heard a car speeding off.'\nVictim: The 'targeted' attack, which is being treated as attempted murder, happened in Shawlands, Glasgow, at about 8.10am - it is not clear if it was linked to his criminal past\nMr Craig has enjoyed a jetset life with his glamorous fiancee Anna Handzel and runs a successful flower business since his release from prison.\nIn 2006 he fled the country after attacking a soldier and his friend in the centre of Glasgow.\nFresh start: Mr Craig has enjoyed a jetset life with his glamorous fiancee Anna Handzel and runs a successful flower business since his release from prison\nRoss Craig stabbed and slashed them as they tried to get a cab home after a night out.\nHe first started a fight with Mr McLean and stabbed him twice on the back and thigh and slashed his face. Mr Picken then tried to his friend, he was slashed in the chest.\nPolice called to the scene chased Craig, who was carrying a seven inch lock knife.\nCraig, then 28, was arrested but then bailed and fled to Cyprus to avoid court.\nAfter returning to Britain in 2010 he admitted attacking Robert Picken and Craig McLean at\nCraig then began to fight with Mr McLean and stabbed him twice on the back and thigh and slashed his face. Mr Picken moved to help his friend and was also slashed and wounded in the chest.\nHis defence QC Paul McBride said: 'He left to go to Cyprus but I don't think he falls into the Asil Nadir category. He was working in a bar.'\nBut he was jailed for six and a half years, and sentencing judge Lord Bannatyne told him: 'Both of these are in my view unprovoked attacks on two individuals who happened to be in the city centre at this particular time. Both of the assaults involved the use if a deadly weapon, namely a knife.'\n'The assaults have significantly impacted in the lives of both victims.\n'At the time of these offences you were subject to no less than four recent bail orders.'\nAnyone with information about yesterday's shooting is asked to contact Police Scotland on 101 or can contact Crimestoppers anonymously 0800 555 111.","url":"https://www.dailymail.co.uk/news/article-4300854/Florist-fled-Cyprus-avoid-jail-shot.html"}
