{"authors":[],"date_download":"2018-10-30 17:57:00","date_modify":"2018-10-30 17:57:00","date_publish":"2018-08-30 16:55:00","description":"A project at Roswell’s historic mill that will add trail access and connectivity to other trails in the city is expected to be complete by November, the city says.","filename":"data/vaneerConsumption/RoswellMillprojectexpectedtobecompletebyNovember.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/30/Images/roswell%20mill_649x406.PNG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_roswell-mill-project-expected-complete-november__1540922220.html","title":"Roswell Mill project expected to be complete by November","title_page":"Roswell Mill project expected to be complete by November","title_rss":"NULL","source_domain":"ajc.com","text":"A project at Roswell’s historic mill that will add trail access and connectivity to other trails in the city is expected to be complete by November, the city says.\nPhase III of the Old Mill Park Trail Extension project began this past spring, but a tough terrain and rain has slowed construction. However, the city says the project is more than 50 percent complete.\nThe project will expand the existing trail system near the mill, and add boardwalks and overlooks that will be accessible for pedestrians. The trails will also comply with the Americans with Disabilities act, making it accessible for folks in wheelchairs.\nREAD | Three Atlanta breweries named among ‘the hottest’ in America\nREAD | Ben Carson, Karen Handel tour affordable senior housing in Roswell\nREAD | Edible Arrangements moving main HQ from Connecticut to Sandy Springs\nThe trail expansion will connect to the historic mill ruins south of the covered bridge in Old Mill Park, located at 95 Mill View Ave.\nThe elevated boardwalk will allow visitors to view a section of the mill that featured a turbine that powered the mill up until 1975.\nConstruction of the original mill dates to 1836. The mills, founded by Roswell King, produced cotton, wool, flour and other goods. During the Civil War, they produced supplies for the Confederacy.\nIn 1864, much of the mills were destroyed by Union soldiers carrying out the orders of General William T. Sherman during the Civil War. Sherman also ordered his soldiers to arrest and deport the roughly 400 women who were working in the mills.\nThe mills were rebuilt, but then destroyed again by fire in 1926. They were rebuilt once more and continued producing cotton until 1975.\nLike North Fulton County News Now on Facebook | Follow on Twitter\n﻿MORE...","url":"https://www.ajc.com/news/local/roswell-mill-project-expected-complete-november/emVsx99E7taOfat99p0MdK/"}
