{"authors":[],"date_download":"2018-10-30 18:23:53","date_modify":"2018-10-30 18:23:53","date_publish":"2016-11-17 18:39:00","description":"Roswell City Council approved a special election to fill the term of Kent Igleheart, who resigned after accusations of relationship with a minor.","filename":"data/vaneerConsumption/RoswellOKsspecialelectiontoreplacecouncilmember.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/17/Images/newsEngin.16830372_Donald-J-Horton-350x223.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_roswell-oks-spec_5a4bc966fac881495213908097489045__1540923833.html","title":"Roswell OKs special election to replace council member","title_page":"Roswell OKs special election to replace councilman Kent Igleheart","title_rss":"NULL","source_domain":"ajc.com","text":"The Roswell City Council has named Council Member Donald J. Horton its new mayor pro tem for the remainder of 2016 and called a special election to fill he unexpired term of another member who resigned.\nHorton was elected 5-0 to replace Kent Igleheart. The mayor pro tem performs the duties of mayor in the mayor’s absence.\nIgleheart resigned Nov. 1 after he was arrested and charged with sexual exploitation of a minor, enticing a child for indecent purposes and furnishing alcohol to a minor.\nThe Council also approved a resolution calling for a special election March 21 to fill to fill the remainder of Igleheart’s term, which expires Dec. 31, 2017, and to contract with Fulton County to conduct the election. The date for qualifying is to be decided by Mayor Jere Wood and the Council at the next Council meeting, Nov. 28.\nIt was not immediately known how much the special election would cost Roswell, but an agenda report prepared for Monday’s Council meeting by City Attorney David Davidson said Fulton’s cost to conduct the November 2015 municipal election was $121,578, and the FY 2016 budget allows up to $131,306 for an election.","url":"https://www.ajc.com/news/local/roswell-oks-special-election-replace-council-member/bRk5gq37mYmu4ZZIuDmgWI/"}
