{"authors":[],"date_download":"2018-10-30 19:00:49","date_modify":"2018-10-30 19:00:49","date_publish":"2018-10-29 21:12:00","description":"Roswell police are among the multiple Georgia law enforcement agencies who want to arrest Brad Cox, according to Channel 2 Action News. The landscape architect contractor is accused of taking thousands of dollars from customers and never finishing the work as promised.","filename":"data/vaneerConsumption/RoswellcopslookforlandscaperaccusedofconningfolksalloverGa.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/06/05/Images/WPIMAGE_cmgajccommuting_372.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_roswell-cops-loo_5c97e702c3bc6c1e6e19c2851dbea81d__1540926049.html","title":"Roswell cops look for landscaper accused of conning folks all over Ga.","title_page":"Roswell cops look for landscaper accused of conning folks all over Ga.","title_rss":"NULL","source_domain":"ajc.com","text":"Roswell police are among the multiple Georgia law enforcement agencies who want to arrest Brad Cox, according to Channel 2 Action News.\nThe landscape architect contractor is accused of taking thousands of dollars from customers and never finishing the work as promised.\nHe is wanted in not only Fulton but Lowndes, Lee and Peach counties. Authorities in Tallahassee, Florida, also have a warrant for his arrest.\nJeff Rosenfeld in Albany told Channel 2 about his interaction with Cox.\nREAD | Roswell tow truck bandit has stolen, stripped several cars, police say\nREAD | KSU changes policies after director allegedly stole, sold computers\n“We were looking for someone to do paving work, to put pavers down in our backyard around our pool,” he told the station.\nRosenfeld hired Cox’s company Earthrones to do the work.\n“We signed a little contract, gave him the $3,400 and he said he would start in a few days,” he said.\nAmount police say a landscaping contractor stole from a local family: $8k\nAmount I spent on this paver to use as a prop: $0.84\nWarning Potential victims: Priceless pic.twitter.com/syPNPrUpPo — Mike Petchenik (@MPetchenikWSB) October 29, 2018\nAfter a dozen calls and seeing that the crew never came back to pick up their equipment, he realized the worst had happened. “We never heard from him again other than fake promises that he was going to repay me the money.”\nRosenfeld said Cox made excuses like that his car was broken down or that he needed to attend to his children.\n“He’s a good talker and he convinced me how great things were going to be and I went along with it and made a big mistake,” Rosenfeld said.\nLike North Fulton County News Now on Facebook | Follow on Twitter\nIn other news...","url":"https://www.ajc.com/news/local/roswell-cops-look-for-landscaper-accused-conning-folks-all-over/dp28CoAaEposbTr7slhrcN/"}
