{"authors":["Breitbart London"],"date_download":"2018-10-30 18:28:59","date_modify":"2018-10-30 18:28:59","date_publish":"2014-08-29 12:29:09","description":"A Rotherham care worker has told the BBC that staff were reluctant to stop Pakistani men grooming young girls every night for fear of being labelled racist","filename":"data/vaneerConsumption/RotherhamCareWorkerWeCouldntStopChildGroomingForFearofBeingLabelledRacists.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/08/29/Screen%20Shot%2020140829%20at%20132543.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_08_29__1540924139.html","title":"Rotherham Care Worker: We Couldn't Stop Child Grooming For Fear of Being Labelled 'Racists'","title_page":"Rotherham Care Worker: We Couldn't Stop Child Grooming For Fear of Being Labelled 'Racists' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Rotherham care worker has told the BBC that staff were reluctant to stop Pakistani men grooming young girls every night for fear of being labelled racist.\nThe worker, who carried out her job in the scandal-hit town for 4 years, said that men in taxis would arrive at care homes every night and drive young girls away. The girls, likely to have been brainwashed by their abusers, would escape from the homes and meet the men “around the corner” or directly outside the children’s homes.\nThe revelations follow the report this week at over 1400 children were victims of abuse by gangs of mostly Pakistani men. As yet, the area’s police commissioner has refused to resign over the crisis, despite almost all major political leaders calling for him to go.\nThe careworker who remains anonymous said that taxis were used to take girls from the carehome to school, but the drivers began to groom them – effectively making their abuse government funded.\n“Sometimes, [the men] would phone and they would pick up around the corner, but sometimes they would just turn up and pick up at the children’s home… It depended on how brazen they were or how much heat they thought was on at the time.\n“They did genuinely think who was on shift, who would be likely to go outside the children’s unit. I used to make a deliberate attempt to let them know that I had clocked their car, that I was taking their registration plate.”\n“They would sometimes say that they would have you stabbed or shot by one of their associates.\n“They led us very much on a merry dance and there wasn’t much we could do apart from keep documenting.\n“And we documented every single night, and we spoke to social workers. The social workers were passing that on.\n“Everything we passed on, nothing seemed to go further in any way shape or form.”\nSouth Yorkshire’s Police and Crime Commissioner Shaun Wright this week resigned from the Labour Party but is still clinging on to his £85,000 a year, taxpayer-funded job replete with its generous pension plan. A petition calling for him to go has over 2000 signatures, and the Home Secretary, Prime Minister, and leader of the Opposition have all asked him to resign.","url":"https://www.breitbart.com/europe/2014/08/29/rotherham-carer-says-no-one-stopped-men-for-fear-of-racism/"}
