{"authors":[],"date_download":"2018-10-23 02:20:54","date_modify":"2018-10-23 02:20:54","date_publish":"2016-01-11 14:26:28","description":"President Hassan Rouhani pledged Monday that Iran was about to enter \"a year of economic prosperity\", with sanctions lifted, and said his government had deli...","filename":"data/vaneerConsumption/RouhanipromisesyearofprosperityforIranians.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z9rv-56CX32zFKLb7123928b84cfa8f47-454_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393998_Rouhani-promises-year-prosperity-Iranians_1540261254.html","title":"Rouhani promises 'year of prosperity' for Iranians","title_page":"Rouhani promises 'year of prosperity' for Iranians | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rouhani promises 'year of prosperity' for Iranians\nPresident Hassan Rouhani pledged Monday that Iran was about to enter \"a year of economic prosperity\", with sanctions lifted, and said his government had delivered on its promises.\nHis comments referred to last July's nuclear deal with world powers that is finally expected to be implemented soon, possibly within days.\nSpeaking near Bushehr, a southern port city on the Gulf, Rouhani, a moderate cleric, also drew attention to elections on February 26 in which his allies are looking to make gains in parliament.\nIranian President Hassan Rouhani says the country is about to enter \"a year of economic prosperity\" ©Atta Kenare (AFP/File)\n\"I promise the nation of Iran that next year, with sanctions behind us and by young people's efforts, will be a year of economic prosperity,\" he said in a speech broadcast on state television.\nThe government is this week expected to outline its budget for the next Persian year, which starts March 20, and like last year will do so at a time of plunging oil prices.\n\"This government is running the country with $30 oil and not with $147 dollar oil,\" he said, comparing the current price of crude to its value during the era of his hardline predecessor Mahmoud Ahmadinejad.\n\"The government is running the country under sanctions not under normal circumstances. God willing, in the coming days we will witness a wrapping up of the sanctions scroll in this country.\"\nRouhani said his cabinet \"was proud to have been able to curb inflation despite all difficulties\" and said the economy will be shown to have grown by the end of the current year.\nInflation was more than 40 percent when Rouhani came to power in August 2013 but it has since fallen to 13 percent, according to the national statistics agency.\nOn the back of the deal on Iran's nuclear programme -- the Islamic republic has always denied seeking a bomb but agreed to curbs on its atomic activities in return for sanctions relief -- Rouhani wants to make greater inroads in domestic policy.\nIf the president's allies poll well they could swing the balance of power away from conservatives in the 290-member parliament, potentially leading to social and political reforms he promised before being elected in 2013.\nBut Rouhani has faced criticism from hardline groups about the nuclear deal, with opponents warning it could lead to \"infiltration\" by the United States and derailment of Iran's revolutionary principles.\nThe US led the nuclear talks, which also involved Britain, China, France, Russia and Germany.\nOn the same day as the parliamentary polls, the electorate will pick 88 members for the Assembly of Experts, a committee of clerics that monitors the work of Iran's supreme leader Ayatollah Ali Khamenei.\nThe Assembly has the power to dismiss Khamenei, who is 76 and has led the Islamic republic since 1989. But its more likely and most crucial role will be to pick his successor.\nThe existing Russian-built nuclear power reactor at Bushehr in southern Iran ©Majid Asgaripour (Mehr News/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393998/Rouhani-promises-year-prosperity-Iranians.html"}
