{"authors":["Simon Kent"],"date_download":"2018-10-30 20:47:26","date_modify":"2018-10-30 20:47:26","date_publish":"2018-07-03 11:26:35","description":"Middle East oil supplies could be cut off if the U.S. continues to isolate Tehran’s oil from the market, Iranian President Rouhani warned.","filename":"data/vaneerConsumption/RouhaniWarnsUSofConsequencesforPushAgainstIranOil.json","image_url":"https://media.breitbart.com/media/2018/07/Hassan-Rouhani.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_07_03__1540932446.html","title":"Rouhani Warns U.S. of ‘Consequences’ for Push Against Iran Oil","title_page":"Rouhani Warns U.S. of ‘Consequences’ for Push Against Iran Oil | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Middle East oil supplies could be cut off if the United States continues to work with allies to isolate Tehran from global markets, Iranian President Hassan Rouhani warned Tuesday.\nRouhani spoke to Iranian expatriates in Switzerland during his visit there on Monday, AP reports. Part of that dialogue included the observation that the U.S. has threatened stop Iran from exporting its oil. The Iranian state TV broadcast Rouhani ‘s remarks, made as part of his official visit to Switzerland and Austria.\nRouhani didn’t elaborate on what measures were available, but Iran has previously threatened to close the strategic Strait of Hormuz though which one third of the world’s oil supply passes if it didn’t get its way.\nIran is OPEC’s second-largest crude exporter with more than 2 million barrels a day and the global price of oil has long been a point of contention for U.S. President Donald Trump.\nOil prices are too high, OPEC is at it again. Not good! — Donald J. Trump (@realDonaldTrump) June 13, 2018\nOil prices are set, for the most part, by Saudi Arabia and, to a lesser extent, its OPEC partners including Iran.\nAfter Mr. Trump tweeted his unhappiness with the price of oil as recently as June, the price of oil fell.\nWashington has been pushing allies to cut oil imports from Iran altogether by November in the wake of Mr. Trump collapsing the previous Iran nuclear deal.","url":"https://www.breitbart.com/middle-east/2018/07/03/rouhani-warns-u-s-of-consequences-for-push-against-iran-oil/"}
