{"authors":[],"date_download":"2018-10-22 23:01:19","date_modify":"2018-10-22 23:01:19","date_publish":"2014-05-13 13:53:47","description":"“I never used that phrase,” Rove said during an appearance on FOX News.","filename":"data/vaneerConsumption/RoveIDidntSayHillaryClintonHasBrainDamage.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/438671/karl_rove_4d11a14e386b7569d87dbee85b092046.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_rove-i-didnt-say-hillary-clinton-has-brain-damage-n104111_1540249279.html","title":"Rove: I Didn't Say Hillary Clinton Has 'Brain Damage'","title_page":"Rove: I Didn't Say Hillary Clinton Has 'Brain Damage' ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKarl Rove disputed Tuesday that he said Hillary Clinton had suffered from brain damage after a 2012 health issue.\n“I never used that phrase,” Rove said during an appearance on FOX News.\nThe New York Post's Page Six reported Monday that Rove, appearing at a conference near Los Angeles, said that voters should be aware that Clinton was hospitalized after a 2012 fall that caused a blood clot. “When she reappears, she’s wearing glasses that are only for people who have traumatic brain injury?” the paper said Rove asked the crowd. “We need to know what’s up with that.”\nOn Tuesday, the GOP strategist said he did not use the phrase “brain damage” but reiterated that Clinton will have to answer questions about her “serious health episode” if she runs for president in 2016.\nClinton spokesperson Nick Merrill said Rove and others on the right have \"politicized\" Clinton's health while \"continuing to get the facts wrong.\"\n\"All he wants to do is inject the issue into the echo chamber, and he's succeeding. It’s flagrant and thinly veiled,\" Merrill said in a statement. \"They are scared of what she has achieved and what she has to offer. What he’s doing is its own form of sickness. But she is 100%, period.\"\nWhen asked about the comments Tuesday, White House spokesman Jay Carney questioned Rove’s own “cognitive capacity,” referring to the Fox News commentator’s on-air disagreement with the cable network over calling Ohio for President Barack Obama on election night 2012.\n“Here's what I would say about cognitive capacity, which is that Dr. Rove might have been the last person in America on election night to recognize and acknowledge that the president had won re-election, including the state of Ohio, so we'll leave it at that,” Carney said.\nFormer Bush communications director Nicole Wallace said on MSNBC’s Morning Joe Tuesday that the comments, while off base, may be part of a grander plan the GOP has to shape its message against Clinton heading into 2016.\n\"This, I think, is a strategy. He may have been trying it out on behalf of the party, on behalf of the eventual nominee,” Wallace said. “While his comments may have been off, her health -- regardless of why she was in the hospital or whether she was in the hospital -- questions about a candidate's health are not only legitimate, they are always part of a presidential campaign.\"","url":"https://www.nbcnews.com/politics/elections/rove-i-didnt-say-hillary-clinton-has-brain-damage-n104111"}
