{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-22 20:37:35","date_modify":"2018-10-22 20:37:35","date_publish":"2016-01-28 02:19:11","description":"The Mr Bean star met his comedy actress girlfriend in 2012 and it is claimed they have now taken the next step in their relationship by moving in together","filename":"data/vaneerConsumption/RowanAtkinsonmovesgirlfriendLouiseFordintohisLondonhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A7948C00000578-0-image-a-15_1453967642959.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420264_Meant-Bean-Rowan-Atkinson-60-moves-girlfriend-Louise-Ford-32-4-65M-London-cottage-just-weeks-divorce_1540240655.html","title":"Rowan Atkinson 'moves girlfriend Louise Ford into his London home'","title_page":"Rowan Atkinson 'moves girlfriend Louise Ford into his London home' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rowan Atkinson has reportedly moved in with his girlfriend of two years, Louise Ford.\nThe Sun reports that the 60-year-old funnyman is shacking up with his actress partner, 32, after she moved into his £4.65million cottage in North London.\nThe Mr Bean star is said to have taken the next step in his relationship by moving in with Miss Ford just weeks after his divorce from Sunetra Sastry, his wife of 24 years.\nScroll down for video\nShackin up: Rowan Atkinson has reportedly moved in with his girlfriend of two years, Louise Ford (pictured with the comedian, left) just weeks after his divorce from Sunetra Sastry, his wife of 24 years (right)\nMiss Ford is thought to have moved into Atkinson's £4.65million cottage in North London (pictured)\nInsiders tell the publication that 'Miss Ford's role in Channel 4 sitcom Crashing is helping boost her career and also enhance her relationship due to the duo's comedic symmetry.\nThe source said: 'Rowan and Louise are both incredibly private people. But this shows they are obviously serious about their relationship.'\nAtkinson and Miss Ford went public with their romance in 2014, after his 23-year marriage to Ms Sastry came to an end.\nEnamoured: Insiders tell the publication that Louise's role in Channel 4 sitcom Crashing is helping boost her career and also enhance her relationship due to the duo's comedic symmetry\nAt the time of the couple's split in 2014, they were building an £11million home in Oxfordshire, however the Blackadder star relocated to the London cottage while Ms Sastry is living in a £21million mansion in the capital.\nThe funnyman, who is estimated to be worth £70million, shares son Ben, 22 and 20-year-old daughter Lily with his ex-wife, whom he married in 1990.\nHe first met Ms Sastry, the daughter of an Indian engineer from Ealing, West London, in the late Eighties, when she was working as a make-up artist for the BBC, and was previously in a relationship with Men Behaving Badly star Leslie Ash.\nAtkinson met Miss Ford when they appeared together in 2012 in the West End comic play Quatermaine's Terms.\nAtkinson and Ms Sastry pictured together in 2012 (left). The couple met in the 1980s (they are pictured right in 1987) and have two children together, Ben, 22 and 20-year-old daughter Lily\nThe former family home in Oxfordshire. The five-bedroom property is believed to have sold for £2.9m\nDream home: At the time of the couple's split in 2014, they were building an £11million home in Oxfordshire, (pictured), however the Blackadder star relocated to the London cottage while Sunetra is living in a £21million mansion in the capital\n'Louise is doing really well with her role in Crashing and wants to be in more comedy roles while Rowan has been busy with lots of other projects,' the source told the Sun. 'They work as a couple because they’re both comedy actors and understand each other’s work.'\nShortly before he met and fell for Miss Ford, the actor revealed in an interview he had a certain kinship with the lonely, single characters he portrays, saying: 'I've played quite a few of these sad, isolated bachelor figures — Bean is the most obvious. And I think I do identify with them, or aspects of them.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420264/Meant-Bean-Rowan-Atkinson-60-moves-girlfriend-Louise-Ford-32-4-65M-London-cottage-just-weeks-divorce.html"}
