{"authors":["Nelson Groom","Kate Darvall For Daily Mail Australia"],"date_download":"2018-10-23 03:02:06","date_modify":"2018-10-23 03:02:06","date_publish":"2017-03-10 12:33:16","description":"A former patient of the fugitive who allegedly posed as a doctor in Australia for 11 years says he was abusive when she visited him at Sydney's Manly Hospital with back pain in 2012.","filename":"data/vaneerConsumption/RoxanneHolmessaysfakeIndiandoctorabusedheratManly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22ADE300000578-0-image-a-39_1489147749020.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300976_Roxanne-Holmes-says-fake-Indian-doctor-abused-Manly_1540263726.html","title":"Roxanne Holmes says fake Indian doctor abused her at Manly","title_page":"Roxanne Holmes says fake Indian doctor abused her at Manly | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roxanne Holmes said frauster Shyam Acharya abused her when she sought treatment for back pain at Manly Hospital in 2012\nA former patient of the fugitive who allegedly posed as a doctor in Australia for 11 years has opened up on her horror after learning about his scam.\nRoxanne Holmes said Shyam Acharya, who went under the name Dr Sarang Chitale, abused her when she visited him at Sydney's Manly Hospital with back pain in 2012.\nAuthorities believe the Indian fraudster fled overseas after a decade pocketing a six-figure salary working in NSW hospitals under the stolen identity.\n'I'm still shocked to know this man that treated me was a fake, like how does that happen?' Ms Holmes told 7News.\nShe recalled Acharya, who was working as the treating doctor in the emergency department, was difficult and abusive, refusing to give her pain relief and evicting her from the hospital.\n'He just simply refused to treat me, he was very abusive to me… He actually said to me, \"I'm going to call security if you don't leave.\"'\nMs Holmes lodged an official complaint but said the hospital failed to follow the matter up.\n'A normal doctor shouldn't treat a patient like that, I was horrified,' she said.\nThe real Sarang Chitale - a real doctor in Manchester, UK - is reportedly appalled by the identity theft.\nCopies of his hospital ID, driver license, and fraudulent passport all surfaced on Thursday, documents that successfully fooled authorities and allowed him to go undetected from 2003 until 2014.\nThe documents falsely stated Acharya, 41, had earned a Bachelor of Medicine, Bachelor of Surgery, and was a fellow of the Royal College of Physicians.\nAcharya also used his six-figure salary to take him on holidays across the world as photos of him posing in front of the Louvre in Paris emerge on his private WhatsApp profile.\nScroll down for video\n'Fake' doctor Shyam Acharya, 41, fled overseas after a decade pocketing a six-figure salary working in NSW hospitals under the stolen identity\nAcharya also used his six-figure salary to take him on holidays across the world, as photos of him posing in front of the Louvre in Paris emerge on his private WhatsApp profile\nAuthorities believe Acharya may have fled overseas when his alleged fraud was discovered.\nHe also left a wife and five-year-old daughter living in North Ryde behind when he went on the run, The Daily Telegraph reported.\nAcharya's alleged trail of crime reportedly started under the Indian Government's watch when he was granted a legitimate passport under the name he allegedly stole from a qualified doctor.\nBut while the ruse started in India, New South Wales Health was reportedly responsible for allowing it to continue for 11 years.\nMs Holmes said Acharya, who was working as the treating doctor in the emergency department, was difficult and abusive\nCopy of Shyam Acharya's fake passport (pictured) registered under the name Sarang Chitale\nCopy of Shyam Acharya's driver license (pictured) under the fraudulent name Sarang Chitale\nNSW Health sponsored his move to Australia in 2003, recruiting him on a skilled migration program.\n'It's just simply shocking to know that he got through our border protection system on someone else's documents pretending to be something he (wasn't) and of course we empathise with all those patients who were under his care,' NSW Premier Gladys Berejiklian told The Daily Telegraph.\nAcharya's 11-year-long ruse only came to an end in September last year when his employer started to question his identity.\nWhen Novotech, a private medical research company, learned Acharya was not who he said he was, the company immediately notified the police.\nNSW Health Minister Brad Hazzard said it was shocking someone was able to bypass Australia's health system and pose as a legitimate doctor for so long.\nHe allegedly worked at Manly (pictured), Hornsby, Wyong and Gosford hospitals under the name Sarang Chitale, where he went undetected for 11 years\nAcharya is also alleged to have worked at Gosfor Hospital during his 11 year stint as a doctor","url":"https://www.dailymail.co.uk/news/article-4300976/Roxanne-Holmes-says-fake-Indian-doctor-abused-Manly.html"}
