{"authors":["Helen Turnbull For Mailonline"],"date_download":"2018-10-22 20:34:51","date_modify":"2018-10-22 20:34:51","date_publish":"2016-01-28 01:56:35","description":"Roxanne, 33, turned heads on arrival to the Palace Theatre as she slipped into the bright pink number which cinched her waist while the length billowed in the wind on Wednesday evening.","filename":"data/vaneerConsumption/RoxannePallettinapinksatinmaxiskirtattheatrepressnightinManchester.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A5FFFA00000578-0-image-a-27_1453946192164.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420253_Roxanne-Pallett-pink-satin-maxi-skirt-theatre-press-night-Manchester_1540240491.html","title":"Roxanne Pallett in a pink satin maxi skirt at theatre press night in Manchester","title_page":"Roxanne Pallett in a pink satin maxi skirt at theatre press night in Manchester | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roxanne Pallett pulled out all the stops to ensure she stood out among the soap-star attendees at a theatre press night in Manchester on Wednesday evening.\nThe former Emmerdale actress appeared to have taken inspiration from traditional Chinese dress as she picked out a satin skirt for the night at Palace Theatre where the opening of Mary Poppins was being celebrated.\nRoxanne, 33, turned heads on arrival to the event as she slipped into the bright pink number which cinched her waist while the length billowed in the wind.\nStealing the style spotlight: Roxanne Pallett pulled out all the stops to ensure she stood out among the soap-star attendees at a theatre press night in Manchester on Wednesday evening\nThe statement skirt was adorned with a delicate floral pattern which exuded femininity but her choice of top could be questioned.\nShe ensured all eyes were on the billowing one-piece by teaming it with a plain black polo-neck jumper which offered her some much-needed warmth.\nThe garment became partially see-through under the glare of the flashbulbs, showing a glimpse of the pretty brunette's underwear as she headed into the venue.\nWest meets East: Roxanne, 33, appeared to have taken inspiration from traditional Chinese dress as her outfit had a distinct Oriental theme for the evening at Palace Theatre where the opening of Mary Poppins was being celebrated\nMaking the most of her figure: The former Emmerdale actress highlighted her petite frame as the statement skirt pulled in her waist\nMind your step: She was careful not to slip on the steps in her billowing maxi skirt\nRoxanne was in good company as she was joined at the press night by a handful of familiar faces from the soap world.\nThe Coronation Street actresses were out in force with Tina O'Brien, Jenny McAlpine and Faye Brookes all putting in appearances.\nThe Sarah-Louise Platt star, 32, cut a comparably low-key figure and brought her seven-year-old daughter Scarlett and a friend along for the fun evening.\nFun for all the family: Tina O'Brien brought her seven-year-old daughter Scarlett and a friend along to the event\nMother-on-duty uniform: Tina, 32, cut a low-key figure in a little black dress which she paired with a staple camel coat\nLess is more: The Sarah Platt actress favoured little to no make-up for the low-key evening out\nRed carpet queens: Scarlett and her friend looked to be thoroughly enjoying themselves as they had a taste of Tina's life in the limelight\nTina favoured a less is more approach to the dress code and looked suitably stylish in a little black dress which she offset with a camel-coloured blazer coat.\nShe made sure to wrap up warm by teaming the simple outfit with a pair of thick black tights while a pair of heeled booties elongated her petite frame.\nMeanwhile, Jenny McAlpine - who plays Fiz Brown in the long-running ITV soap - was seasonally styled in a pair of black skinny jeans and a red top which she topped off with a black coat, featuring a multi-coloured fur collar.\nSeasonally styled: Jenny McAlpine - who plays Fiz Brown in the long-running ITV soap - was suitably styled in black jeans, red top and fur-collar coat\nBeating the chill: The Corrie favourite looked snug as she posed on arrival to the venue\nAdditionally, Gareth Gates' girlfriend Faye Brookes was a vision of effortless chic in a plunging printed dress which skimmed her thighs and exposed a glimpse of her pert cleavage.\nShe teamed the simple but sexy look with a pair of heeled thigh-high boots which lifted her petite frame.\nThe raven-haired star threw a long brown coat over her ensemble while her haired was poker straight and her make-up professionally-applied.\nSimply stunning: Gareth Gates' girlfriend Faye Brookes was a vision of effortless chic in a plunging printed dress which skimmed her thighs and exposed a glimpse of her pert cleavage","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420253/Roxanne-Pallett-pink-satin-maxi-skirt-theatre-press-night-Manchester.html"}
