{"authors":["Jabeen Waheed For Mailonline"],"date_download":"2018-10-23 03:16:24","date_modify":"2018-10-23 03:16:24","date_publish":"2017-03-10 12:44:16","description":"Roxanne Pallett made full use of her rare down time as she emerged from Preen Hair and Beauty Salon in Dublin, Ireland on Thursday.","filename":"data/vaneerConsumption/RoxannePallettflasheshertrimmidriffinsportsbra.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22B86E00000578-0-image-a-129_1489148088003.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301062_Roxanne-Pallett-flashes-trim-midriff-sports-bra_1540264584.html","title":"Roxanne Pallett flashes her trim midriff in sports bra","title_page":"Roxanne Pallett flashes her trim midriff in sports bra | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's in town for her musical The Wedding Singer, alongside former X Factor star Ray Quinn.\nAnd Roxanne Pallett made full use of her rare down time as she emerged from Preen Hair and Beauty Salon in Dublin, Ireland on Thursday.\nThe 34-year-old former Emmerdale star flashed her enviably trim midriff in a multi-coloured sports bra as she showed off the results of her pamper session.\nScroll down for video\nStepping out: Roxanne Pallett, 34, made full use of her rare down time as she emerged from Preen Hair and Beauty Salon in Dublin, Ireland on Thursday\nThe actress teamed the minuscule top with a pair of skin-tight matching leggings which flashed a peek of her toned legs.\nShe threw on an unzipped grey hoodie for further warmth and kept it comfortable in a pair of white and pink trainers.\nA slouchy bag draped on her arm completed the whole sports chic look.\nDespite opting for a more casual ensemble, Roxanne worked her freshly styled brunette mane, which complemented her bronzed make-up look.\nSports chic: The former Emmerdale star flashed her enviably trim midriff in a multi-coloured sports bra and matching leggings\n'Feel like a goddess now': She even took to Instagram to document her time at the salon with a fun collage alongside hairdresser Gerard Mcloughlin\nShe even took to Instagram to document her time at the salon with a fun collage alongside hairdresser Gerard Mcloughlin.\nShe captioned it: 'Merci @hairxger for an idyllic morning of pampering @preenhairandbeautydublin ~ Cupcakes, coffee & a massage while having a haircut. Feel like a goddess now.\n'The only place to go in Dublin! Thank you for turning me into a pink flamingo after I walked in feeling like an exhausted pigeon. #pampered #preenhairandbeautydublin.'\nMeanwhile, Dublin-based fans will be able to catch her show The Wedding Singer at Bord Gáis Energy Theatre.\nIt officially launched in Leicester on February 10 and will culminate with a farewell performance in Wolverhampton on October 7.\nExciting venture: She's in town for her musical The Wedding Singer, alongside former X Factor star Ray Quinn\nThe stage show is an adaptation of the 1998 film starring Adam Sandler and Drew Barrymore.\nThings have not been all plain sailing for Roxanne, however, after a costume seamstress from a previous work endeavour asked her to lose weight so she could fit into her on-stage outfit adequately.\nThe star - who was on the famous ITV soap from 2005 to 2009 - told ITV's Lorraine last month, 'I was asked to lose weight by a costume seamstress that couldn’t be bothered to alter the costume,' she continued before defiantly stating: 'And I didn’t do it, Lorraine!'\n'I had a coffee and a bagel instead and thought the costume needs to fit me – not I need to fit the costume,' the brunette revealed.\nOutraged: Last month Roxanne told Lorraine that a seamstress from a previous work endeavour had asked her to lose weight\nShe went on to say: 'There’s a difference between adapting your image for the role and just doing it for the laziness of someone not wanting to let the seams out.'\nClearly feeling an understandable disdain for the seamstress in question, Roxanne went on: 'This woman measured me but when it came to putting on the costume she couldn’t zip it up.\n'It fit the previous actress and she hoped it would fit me but it didn’t. The last actress was obviously a different shape. I’m petite but curvy and I’ve got hips, boobs, thighs and a bum.'\nRoxanne is only a size 8 and stands at 5ft 2in - possibly the reason Lorraine couldn't understand why this had even happened.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301062/Roxanne-Pallett-flashes-trim-midriff-sports-bra.html"}
