{"authors":["Benge Nsenduluka For Daily Mail Australia"],"date_download":"2018-10-22 23:07:03","date_modify":"2018-10-22 23:07:03","date_publish":"2017-04-26 06:32:18","description":"She recently suffered an embarrassing wardrobe malfunction during a routine workout on Tuesday.","filename":"data/vaneerConsumption/RoxyJacenkosuffersANOTHERwardobemalfunctioninSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C86F200000578-0-image-a-7_1493184634974.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446296_Roxy-Jacenko-suffers-wardobe-malfunction_1540249623.html","title":"Roxy Jacenko suffers ANOTHER wardobe malfunction in Sydney","title_page":"Roxy Jacenko suffers ANOTHER wardobe malfunction in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently suffered an embarrassing wardrobe malfunction during a routine workout on Tuesday.\nAnd just a day later, Roxy Jacenko raised eyebrows yet again during a dress fitting in Sydney.\nThe prominent Sydney socialite was pictured trying on a $6,500 Oglia-Loro couture gown on Wednesday, in preparation for the annual Children's Hospital fundraiser the Gold Dinner next week.\nNot again! Roxy Jacenko exposed her black underwear during a $6,500 couture gown fitting on Monday\nIn a snap shared to Instagram, the PR queen appeared to have everything in place as she posed for photos in the elegant red gown.\nBut upon closer inspection, another wardrobe malfunction saw her underwear visible through the sheer material.\n'When this talent visits from Melbourne @oglialorocouture,' she captioned a snap shared with her thousands of followers - seemingly oblivious to the fashion faux pas.\nElegant: The prominent Sydney socialite was pictured trying on a $6,500 Oglia-Loro couture gown on Wednesday, in preparation for the annual Children's Hospital fundraiser the Gold Dinner next week\nOh no! Roxy inadvertently revealed more than she bargained for during a routine workout on Tuesday\nRoxy will be among hundreds of wealthy attendees expected to attend next week's exclusive charity event.\nShe is expected to attend with heiress Francesca Packer, who is flying in from Los Angeles to support the Children's Hospital.\nIn 2015, Roxy signed Francesca, who is the 21-year-old niece of billionaire James Packer, to her successful talent agency Ministry of Talent, according to The Daily Telegraph.\nIn September last year, the duo were pictured having a lunch meeting in the ritzy suburb of Double Bay, where Roxy's Sweaty Betty office is located.\nLast year's lavish Gold Dinner saw the likes of Channel Nine star Lisa Wilkinson and Aussie Home Loans founder John Symonds shell out upwards of $1.6 million for sick kids.\nOrganisers reportedly had $3 million worth of plants alone trucked in for the VIP soiree.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446296/Roxy-Jacenko-suffers-wardobe-malfunction.html"}
