{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 21:28:09","date_modify":"2018-10-22 21:28:09","date_publish":"2017-03-16 01:15:15","description":"Roxy Jacenko teaches Pixie how to pout for elevator selfie","filename":"data/vaneerConsumption/RoxyJacenkoteachesPixiehowtopoutforelevatorselfie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FB76E00000578-0-image-a-4_1489625289170.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318084_Roxy-Jacenko-teaches-Pixie-pout-elevator-selfie_1540243689.html","title":"Roxy Jacenko teaches Pixie how to pout for elevator selfie","title_page":"Roxy Jacenko teaches Pixie how to pout for elevator selfie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her love of elevator selfies.\nAnd on Wednesday, PR guru Roxy Jacenko taught her daughter how to perfect her pout for the perfect elevator snap.\nTaking to Instagram, the 36-year-old shared a picture of herself with her daughter Pixie, five, pouting as the posed in a lift.\nScroll down for video\nSweet: On Wednesday, PR guru Roxy Jacenko taught her daughter how to perfect her pout for the perfect elevator snap\n'Teaching her all the important things,' Roxy captioned the snap, adding a crying with laughter emoji.\nRoxy wore a white Dior T-shirt and black jeans, teaming the look with a black Balenciaga bag.\nPixie wore a pink princess-style dress with a white cardigan.\nQuality time: She also shared another image where she blows a kiss at her little girl, as Pixie smiles\nSelfie queen! Roxy is known for her elevator selfies\nIt's believed the pair enjoyed heading to the Justin Bieber concert at ANZ Stadium that evening, with Roxy posting online from the event.\nShe also shared another image where she blows a kiss at her little girl, as Pixie smiles.\nRoxy captioned the shot: 'Nights with my Pix.'\nTraining hard: Roxy recently wowed fans when she flaunted her incredibly toned figure and washboard abs at the gym\nRoxy recently wowed fans when she flaunted her incredibly toned figure and washboard abs at the gym.\nThe personality - who has recently shed an impressive 10kg - wore leggings and a crop top as she worked out with her personal trainer.\nRoxy - who recently battled breast cancer - told Daily Mail Australia about her fitness regime, saying she's made a lifestyle change for better health.\n'When I got diagnosed with cancer earlier this year, my Oncologist, Prof. Eva Segalov stressed the importance of exercise during my four weeks of daily radiation and thereafter living on tamoxifen,' she said.\nNew leaf: Roxy - who recently battled breast cancer - told Daily Mail Australia about her fitness regime, saying she's made a lifestyle change for better health\n'So I started to ensure that I was doing everything I could get better and have stayed on the regime since, it's become a way of life now.'\nRoxy said: 'I'm VERY careful with what I eat - basically a sashimi sushi diet daily, washed down with a couple of green juices a day.'\n'Cheat days are almost non-existent!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318084/Roxy-Jacenko-teaches-Pixie-pout-elevator-selfie.html"}
