{"authors":["Chloe-Lee Longhetti","Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-22 21:38:43","date_modify":"2018-10-22 21:38:43","date_publish":"2017-04-26 02:05:32","description":"Roxy Jacenko showcases her new workout gear after suffering an embarrassing wardrobe malfunction in her snake print leggings","filename":"data/vaneerConsumption/RoxyJacenkosnewworkoutgearafterwardrobemalfunction.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B649A00000578-0-image-a-13_1493166610808.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445854_Roxy-Jacenko-new-workout-gear-wardrobe-malfunction_1540244323.html","title":"Roxy Jacenko's new workout gear after wardrobe malfunction","title_page":"Roxy Jacenko's new workout gear after wardrobe malfunction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She suffered a wardrobe malfunction in her white snake print leggings on Tuesday.\nAnd on Wednesday, PR buff Roxy Jacenko shared her favourite lift selfie showcasing another pair of leggings after the mishap.\nThe blonde took to Instagram to share a snap of herself in striped navy tights, with no wardrobe malfunction in sight.\nScroll down for video\nNothing to see here! On Wednesday, PR buff Roxy Jacenko shared her favourite lift selfie showcasing another pair of leggings after the wardrobe malfunction\nThe mother of two can be seen in the snap wearing a white singlet that was tied up at the waist, along with a chic navy puffer vest on top.\nShowcasing a golden tan, Roxy appeared to have makeup on and ditched her wedding bands ahead of a workout.\nShe tagged a personal trainer in the post, saying it was the 'last session for the week,' presumably on her way to a workout.\nAwkward: On Tuesday, the blonde got more than she bargained for when she revealed her wardrobe malfunction\nOn Tuesday, Roxy posted a snap of herself in white snake-print exercise gear as she did weight training, getting more than she bargained for when she revealed her wardrobe malfunction.\nThe mother-of-two posted a workout selfie snapped at Flow Athletic, a yoga, strength and spin studio in Sydney's Paddington.\nIn an image she posted to Instagram earlier that day, Roxy's wardrobe malfunction was also seen as she posed in a Bieber shirt and the Lorna Jane Active tights.\nSnapping away: In an image she posted to Instagram earlier that day, Roxy's wardrobe malfunction was also seen as she posed in a Bieber shirt and the Lorna Jane Active tights\nThe PR maven had another slip up in her favourite snakeskin workout gear, earlier this month.\nThe Sydney-based publicist recently revealed that she had shed a whopping 10kgs thanks to her intense exercise regime and a strict diet of 'basically sashimi sushi daily.'\nThe Sweaty Betty PR founder told Daily Mail Australia in January she weighed in at 50kg, having shed 10kg.\nFit! The Sydney-based publicist recently revealed that she had shed a whopping 10kgs\nNew lease on life: Roxy's two young children, five-year-old Pixie and two-year-old Hunter, were the major motivation for her lifestyle change\nRoxy revealed in January: 'I'm VERY careful with what I eat - basically a sashimi sushi diet daily, washed down with a couple of green juices a day.'\n'Cheat days are almost non-existent!'\nHer decision to begin a healthy new lifestyle came after being diagnosed with breast cancer last year, following her husband Oliver Curtis' conviction for insider trading.\nRoxy's two young children, five-year-old Pixie and two-year-old Hunter, were the major motivation for her lifestyle change.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445854/Roxy-Jacenko-new-workout-gear-wardrobe-malfunction.html"}
