{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 21:41:06","date_modify":"2018-10-22 21:41:06","date_publish":"2017-03-16 01:54:59","description":"Justin Bieber may technically be old enough to be his dad but three-year-old Hunter Curtis is taking fashion tips from the pop star.","filename":"data/vaneerConsumption/RoxyJacenkossonHunterdresseslikeJustinBieber.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E50143900000578-0-image-a-21_1489627763356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318508_Roxy-Jacenko-s-son-Hunter-dresses-like-Justin-Bieber_1540244466.html","title":"Roxy Jacenko's son Hunter dresses like Justin Bieber","title_page":"Roxy Jacenko's son Hunter dresses like Justin Bieber | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Justin Bieber may technically be old enough to be his dad but three-year-old Hunter Curtis is taking fashion tips from the pop star.\nOn Thursday, an image of the toddler was uploaded to his Instagram account in which he wore an outfit very like Justin tends to wear.\n'Channeling @justinbieber' read the caption, presumably written by Hunter's mum Roxy.\nLook alikes! Justin Bieber may technically be old enough to be his dad but three-year-old Hunter Jacenko is taking fashion tips from the pop star\nHunter posed in a pair of trendy sweat pants, silver running shoes and a baggy white T-shirt.\nThe trendy tot had his hands raised in the air, his index fingers pointed upwards and a serious look on his face, a pose is reminiscent of Justin's stances on stage.\nHunter may not want to imitate a very different hand gesture Justin was making during a run-in with a news crew at his Queensland based private island.\nDuring the incident, which occurred on Tuesday, Canadian told Channel Seven's staff to 'f*** off, mate' before giving them the one-finger salute.\nStyle hunter: On Thursday, an image of the toddler was uploaded to his Instagram account in which he wore an outfit very like Justin tends to wear\nDon't copy this, Hunter! The three-year-old may not want to imitate a very different hand gesture Justin made during a run-in with a news crew at his Queensland based private island\nThe Love Yourself hitmaker went on to yell more expletives from a distance.\n'F*** you. What's wrong with you?' he continued as he stood on the water's edge at Makepeace Island, which he'd rented from Sir Richard Branson for his stay.\nRoxy attended Justin's concert at ANZ Stadium in Sydney on Wednesday night but it's unclear if she took Hunter along.\nMum's night out: Roxy attended Justin's concert at ANZ Stadium in Sydney on Wednesday night but it's unclear if she took Hunter along\nThe mother of two recently revealed she took son Hunter to visit her husband Oliver Curtis in prison, but left daughter Pixie at home.\nRoxy told Mia Freedman on the latest episode of the No Filter podcast, 'I didn't tell Pixie because it's my duty to protect her. She's 5, she understands separation - to have taken her into that environment and then have had to go...no.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318508/Roxy-Jacenko-s-son-Hunter-dresses-like-Justin-Bieber.html"}
