{"authors":["Daily Mail Australia Reporter"],"date_download":"2018-10-23 02:46:14","date_modify":"2018-10-23 02:46:14","date_publish":"2017-03-16 13:21:11","description":"On Thursday night, Roxy Jacenko stayed up late with her young son Hunter - who presumably couldn't sleep","filename":"data/vaneerConsumption/RoxyJacenkostaysuplatewithHuntertowatchcartoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5464DA00000578-0-image-a-26_1489670455606.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320228_Roxy-Jacenko-stays-late-Hunter-watch-cartoon_1540262774.html","title":"Roxy Jacenko stays up late with Hunter to watch cartoon","title_page":"Roxy Jacenko stays up late with Hunter to watch cartoon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She always loves spending time with her two children.\nAnd on Thursday night, Roxy Jacenko stayed up late with her young son Hunter - who presumably couldn't sleep.\nThe three-year-old's normal bedtime is 7:30pm, but he was still up at 10.35pm watching Bubble Guppies cartoons with mum Roxy.\nScroll down for video\nStaying up? Roxy Jacenko stayed up late with her young son Hunter on Thursday night, who presumably couldn't sleep\nAs expected, social media enthusiast Roxy shared some photos of their late night shenanigans to Instagram.\nIn the first photo, which showed the mother-son duo under the sheets, she wrote: 'What 7.30pm bed time?'\nIn the next photo, posted later in the night, she wrote: 'Mother of the year. 10.35pm = bubble guppies.'\nUp late: The three-year-old's normal bedtime is 7:30pm, but the youngster was still up at 10.35pm watching Bubble Guppies cartoons with mum Roxy\nRoxy's husband Oliver Curtis was sent to jail for insider trading in June last year. It is expected he will serve 12 months in prison.\nAnd rumours surrounding their marriage continue to plague the PR queen, who told Mia Freedman's No Filter podcast she is 'still angry' at her husband's crime.\nThe 36-year-old also spoke about the couple's children - Pixie, five, and Hunter - saying 'they shouldn’t have to be in this situation.'\n'(The children) shouldn’t have to be in this situation': Roxy recently spoke about family life after her husband Oliver Curtis was sentenced to jail for insider trading in June last year\n'I wouldn’t have had children until this situation was sorted out, because it’s not right': Roxy even claimed she would have waited to have children if she knew Oliver would serve jail time\n'If I had the choice, I probably would’ve done things very differently,' the founder of Sweaty Betty PR claimed.\n'I wouldn’t have had children until this situation was sorted out, because it’s not right.\n'I would forego my own happiness for my children's happiness,' she added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320228/Roxy-Jacenko-stays-late-Hunter-watch-cartoon.html"}
