{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 02:48:21","date_modify":"2018-10-23 02:48:21","date_publish":"2016-01-11 15:16:03","description":"Royal guests from all over Europe gathered to help the Grand Duke Jean of Luxembourg celebrate his milestone birthday - and posed together for a huge photo to mark the occasion.","filename":"data/vaneerConsumption/RoyalsgatherfortheGrandDukeJeanofLuxembourgs95thbirthday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300A819B00000578-0-image-a-65_1452527525120.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393825_The-cream-continent-s-royals-gathered-Grand-Duke-Jean-Luxembourg-s-95th-birthday-recognise_1540262901.html","title":"Royals gather for the Grand Duke Jean of Luxembourg's 95th birthday","title_page":"Royals gather for the Grand Duke Jean of Luxembourg's 95th birthday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Grand Duchy of Luxembourg doesn't get a lot of turns in the spotlight.\nIt's an independent country tinier than Rhode Island, the smallest U.S. state, and it would fit inside Germany, its neighbour to the east, 138 times with room to spare.\nBut as the Grand Duke of Luxembourg celebrated his 95th birthday this weekend, it was the tiny country's turn to shine.\nRoyal guests from all over Europe gathered to help the Grand Duke Jean of Luxembourg celebrate his milestone birthday - and posed together for a huge photo to mark the occasion.\n1. Hereditary Grand Duchess Stéphanie of Luxembourg, 2. Hereditary Grand Duke Guillaume of Luxembourg, 6. Queen Mathilde of the Belgians, 9. King Philippe of the Belgians, 14. Princess Beatrix of the Netherlands, 20. Grand Duke Henri of Luxembourg, 27. Grand Duke Jean of Luxembourg with his great-grandson Prince Gabriel, 22, and Prince Noah in front of him, 36, Grand Duchess Maria Teresa of Luxembourg, 35, 41. Queen Sofia of Spain, 44. King Constantine of Greece, 50. Queen Anne-Marie of Greece, 53. Princess Irene of Greece. Second row: 5. Princess Claire of Luxembourg, 11. Prince Félix of Luxembourg, 15. Countess Diane de Nassau, 19. Prince Jean of Luxembourg, 25. Archduchess Marie-Astrid of Austria, 31. Archduke Carl-Christian of Austria, 38. Princess Margaretha of Liechtenstein, 43. Prince Nikolaus of Liechtenstein, 47. Prince Guillaume of Luxembourg, 49. Princess Sibilla of Luxembourg, 52. Prince El Hassan bin Talal of Jordan, 56. Princess Sarvath of Jordan Third row: 3. Princess Charlotte de Nassau, 7. Princess Maria-Anunciata of Liechtenstein, 8. Archduchess Kathleen of Austria, 12. Archduke Imre of Austria, 17. Princess Alexandra of Luxembourg, 24. Prince Louis of Luxembourg, 21. Princess Tessy of Luxembourg, Prince Sebastien of Luxembourg, 40. Princess Tatiana Radziwiłł, 45. Jean Fruchaud, 48. Archduchess Anna Gabriele of Austria, 54. Archduchess Adélaïde of Austria, 55. Archduke Christoph of Austria. Back rows: 4. Prince Paul-Louis de Nassau, 10. Prince Carl de Nassau, 13. Archduke Alexander of Austria, 16. Princess Marie-Gabrielle of Austria, Prince Jean de Nassau, 37. Archduchess Marie-Christine of Austria, 23, Archduchess Gabriella of Austria, Count Rodolphe de Limburg-Stirum, Chevalier Charles de Fabribeckers de Cortils et Grâce, Princess Anne de Ligne, 33. Prince Josef of Liechtenstein (with Countess Antonia of Holstein-Ledreborg hidden behind him, 32), Archduchess Katharina of Austria, 39. Prince Wenceslas de Nassau, 42. Princess Marie-Astrid of Liechtenstein, Prince Constantin de Nassau, Prince Léopold of Nassau\nAs well as the Hereditary Grand Duchess Stéphanie of Luxembourg and Hereditary Grand Duke Guillaume of Luxembourg, Queen Mathilde and King Philippe of the Belgians were on hand to help ring in his birthday, reports Luxarazzi.\nQueen Sofia of Spain and King Constantine and Queen Anne-Marie of Greece also made an appearance in the snap.\nElsewhere, Prince El Hassan bin Talal of Jordan and Princess Sarvath of Jordan can be spotted posing near Archduchess Marie-Astrid of Austria and Princess Margaretha of Liechtenstein.\nHis friends and family joined him at a concert at the Philharmonie, where the Philharmonic Orchestra sang happy birthday to the Grand Duke Jean before presenting him with a birthday cake.\nJean, who lives at Fischbach Castle, reigned as Grand Duke of Luxembourg between 1964 and 2000. He abdicated and made way for his son, Grand Duke Henri, to take over as ruler.\nGrand Duke Jean is the son of Grand Duchess Charlotte and of Prince Félix of Bourbon-Parma, and Pope Benedict XV was famously one of his godparents.\nFormer Grand Duke Jean (Front-C) poses with family members and guests for a group photo at the Grand Ducale Palace in Luxembourg, 09 January 2016, to mark his 95th birthday on 05 January. (First row) Crown Princess Stephanie of Luxembourg (L), Crown Prince Guillaume of Luxembourg (2-L), Grand Duke Henri of Luxembourg (6-R) and Grand Duchess Maria-Teresa (5-R)\nJean (C), former Grand Duke of Luxembourg, cuts the cake as he celebrates his 95th birthday at the Philharmonie Luxembourg surrounded by his family and royal friends\nAfter studying at a British boarding school, he was styled 'Hereditary Grand Duke', recognising his status as heir apparent and then became Grand Duke when his mother abdicated in 1964.\nHe played a pivotal role in WW2, joining the British Army as a volunteer in the Army Air Corps in November 1942. Working as a captain, he participated in the Battle for Caen and the liberation of Brussels.\nHe also served as Colonel of the Regiment of the Irish Guards and was often seen riding behind Queen Elizabeth II at the Sovereign's Birthday Parade.\nLuxembourg's monarchy is one of the youngest in Europe and began in 1815 following the Congress of Vienna at the end of the Napoleonic Wars.\nFull independence under the Grand Dukes came just under 20 years later, when the Treaty of London enshrined Luxembourg's existence in international law and ended years of rule by the Burgundians, French, Prussians and the Dutch.\nAlthough part of Luxembourg was later incorporated into what would, in 1839, become Belgium, the country remained intact through the Franco-Prussian War of 1870 and the First and Second World Wars.\nPrince Paul Louis of Nassau (L), Prince Constantin of Nassau (2-L), Princesse Maria-Annunciata of Lichtenstein (3-L) Archduchess Marie-Christine of Austria of Limburg-Stirum, Royal Highness Crown Prince Guillaume of Luxembourg, deliver a speech before the concert of the Luxembourg Philharmonic Orchestra\nFormer Grand Duke Jean of Luxembourg (C) listens to the concert of the Luxembourg Philharmonic Orchestra in the Grande-Duchesse Josephine-Charlotte Concert Hall at the Philharmonie Luxembourg\nThe monarchy made headlines in July 2014 when Luxembourg's little Princess Amalia was born.\nHer parents, Prince Felix - Grand Duke Jean's grandson - and Princess Claire, smiled as they walked from the venue in the south east town of Saint-Ferréol-de Lorgues, cradling the newborn in their arms.\nAlongside the proud parents at the intimate ceremony was Grand Duke Henri, the monarchical head of state, and his wife Grand Duchess Maria Teresa, as well as Hartmut and Gabriele Lademacher, the mother and father of the bride.\nPrincess Amalia, her parents' first child, joins a busy royal nursery that already contains Prince Gabriel of Nassau and Prince Noah of Nassau.\nThey are the two sons of Prince Felix's younger brother, Prince Louis, 29, and his 30-year-old wife Princess Tessy.\nThe royal brood of Luxemburg looks likely to grow: Prince Guillaume has been married to Belgian countess Stéphanie de Lannoy since 2012, while Grand Duke Henri and Grand Duchess Maria Teresa have two further children.\nGrand Duke Jean, seen cutting his birthday cake, is the son of Grand Duchess Charlotte and of Prince Félix of Bourbon-Parma and Pope Benedict XV was one of his godparents\nFormer Grand Duke Jean (R) and Grand Duke Henri (L) of Luxembourg arrive. Jean, who lives at Fischbach Castle, reigned as Grand Duke of Luxembourg between 1964 and 2000. He abdicated and made way for his son, Grand Duke Henri, to take over as ruler\nGrand Duke Jean, Prince Guillome and Grand Duke Henri of Luxembourg pose for a photo at the Palais Grand Ducal on the occasion of Grand Duke Jean's 90th birthday back in 2011\nPrince Felix of Luxembourg and Princess Claire of Luxembourg pose with their daughter Princess Amalia of Luxembourg after her Christening ceremony, at the Saint Ferreol Chapel in Lorgues on July 12, 2014 in Lorgues, France","url":"https://www.dailymail.co.uk/femail/article-3393825/The-cream-continent-s-royals-gathered-Grand-Duke-Jean-Luxembourg-s-95th-birthday-recognise.html"}
