{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:50:04","date_modify":"2018-10-30 19:50:04","date_publish":"2015-07-14 13:20:51","description":"Rep. Ed Royce (R-CA), Chair of the House Foreign Affairs Committee, reacted to the nuclear deal reached with Iran in Vienna on Tuesday morning by warning that the terms of the deal violated the conditions laid down by 367 members of Congress in a letter earlier this year. |","filename":"data/vaneerConsumption/RoyceIranDealViolatesCongresssConditions.json","image_url":"https://media.breitbart.com/media/2015/07/Ed-Royce-Win-McNamee-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_14__1540929004.html","title":"Royce: Iran Deal Violates Congress's Conditions","title_page":"Royce: Iran Deal Violates Congress's Conditions | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Ed Royce (R-CA), Chair of the House Foreign Affairs Committee, reacted to the nuclear deal reached with Iran in Vienna on Tuesday morning by warning that the terms of the deal violated the conditions laid down by 367 members of Congress in a letter earlier this year.\n“Congress has repeatedly made clear that a final agreement must effectively block Iran’s ability to develop a nuclear weapon. 367 Members of Congress are on record stating that a deal must last for multiple decades and include full disclosure of Iran’s past efforts to build a nuclear weapon, a dramatic reduction in the number of centrifuges, as well as intrusive inspection and verification measures,” Royce said.\nThe deal limits Iran’s uranium enrichment for only eight years, includes only limited inspections, and has no disclosure of Iran’s past efforts.\nRoyce continued:\nWhile these details are key, the overall outcome of today’s agreement is clear: Iran is not required to dismantle key bomb making technology, but is permitted a vast enrichment capacity, and will continue its research and development to gain an industrialized nuclear program in as little as ten years or so. That is hardly “decades.” Even Iran’s heavily fortified underground nuclear facility – which the United States had vowed to shut – stays open. Iran is still able to ‘mass produce’ its ballistic missiles, as the Supreme Leader has ordered. And the terrorist state of Iran will be flush with cash. Iran won’t even have to cheat on this agreement to be a small step away from the bomb, dominate the region and boost its oppressive regime at home. The international sanctions Congress drove for years had this regime on the ropes. Iran’s regime is now claiming to be a winner.\nRoyce added that he will immediately begin the process of analyzing the nuclear deal in his committee hearing scheduled Tuesday morning.","url":"https://www.breitbart.com/politics/2015/07/14/royce-iran-deal-violates-congresss-conditions/"}
