{"authors":["Press Association"],"date_download":"2018-10-23 01:34:28","date_modify":"2018-10-23 01:34:28","date_publish":"2016-01-11 12:39:22","description":"Ruben Loftus-Cheek has branded the FA Cup \"a competition we've got to win\" as Chelsea fight to save their season. The teenage midfielder fired his first seni...","filename":"data/vaneerConsumption/Rubenloftuscheekupforthecup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-1b2a4582-759d-4167-857e-8bd7f87fb812-56CX32zFKLb7123928b84ceb90e8-369_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393763_Ruben-Loftus-Cheek-cup_1540258468.html","title":"Ruben loftus-cheek up for the cup","title_page":"Ruben loftus-cheek up for the cup | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ruben Loftus-Cheek up for the cup\nRuben Loftus-Cheek has branded the FA Cup \"a competition we've got to win\" as Chelsea fight to save their season.\nThe teenage midfielder fired his first senior goal as Chelsea eased past Scunthorpe 2-0 at Stamford Bridge on Sunday, booking their place in the fourth round.\nDiego Costa's fourth goal in three games set the Blues on course before Loftus-Cheek sealed the win in the second half.\nRuben Loftus-Cheek has been tipped to force his way into regular selection at Chelsea\nGuus Hiddink guided Chelsea to FA Cup glory in his first short-term Stamford Bridge stint in 2009 and now Loftus-Cheek believes the Blues must throw everything at helping the Dutchman repeat that triumph.\n\"Even if we were doing really well in the Premier League it's still a competition we'd want to win,\" Loftus-Cheek told Chelsea TV.\n\"But this season I think we should really want to win it.\n\"The Premier League hasn't gone that well, so I think this is a competition we've got to win.\"\nInterim boss Hiddink admitted Loftus-Cheek could be called into more regular action in the weeks and months ahead after impressing in training.\nChelsea's 19-year-old academy product joked he would play in defence to get onto the field, before thanking the club's supporters for their strong backing.\n\"Right now I'm happy to play anywhere - right-back, left-back, wherever!\" said Loftus-Cheek, when asked his preferred midfield role.\n\"I just want to get on the pitch, get some minutes and enjoy my football.\n\"The fans have been so supportive of me, right through from when I joined the first team.\n\"I feel a bond with the fans and it's a really good feeling to have them behind me.\"\nDefender Gary Cahill echoed Loftus-Cheek's sentiments in calling on Chelsea to focus on cup glory this year, to atone for the horrendous Premier League form that cost Jose Mourinho his job.\n\"I think the FA Cup and the Champions League can be two massive competitions for us, and two that we want to go as far as we possibly can in,\" Cahill told Chelsea TV.\n\"Every game's important, but the FA Cup is definitely important for us this year.\"\nScunthorpe boss Mark Robins hailed his team for finding their feet and refusing to be overawed taking on the reigning Premier League champions.\nRobins challenged his players to harness the confidence to kick-start a climb up the League One rankings.\n\"Moving forward we can take a lot of positives for the second half of the season,\" said Robins.\n\"You've got a feeling they are just toying with you and at any one moment they can open you up, but for the majority they didn't.","url":"https://www.dailymail.co.uk/wires/pa/article-3393763/Ruben-Loftus-Cheek-cup.html"}
