{"authors":[],"date_download":"2018-10-22 20:46:34","date_modify":"2018-10-22 20:46:34","date_publish":"2014-06-03 01:25:05","description":"Florida Sen. Marco Rubio rallied supporters at a cookout in Iowa Monday night alongside U.S. Senate candidate Joni Ernst.","filename":"data/vaneerConsumption/RubioStumpsforErnstonEveofIowaPrimary.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/482996/140602_rubio-ernst-iowa_8e444c05736e8c3f631db0d1c306e009.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_rubio-stumps-ernst-eve-iowa-primary-n120896_1540241194.html","title":"Rubio Stumps for Ernst on Eve of Iowa Primary","title_page":"Rubio Stumps for Ernst on Eve of Iowa Primary","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nURBANDALE, Iowa -- Florida Sen. Marco Rubio rallied supporters at a cookout in Iowa Monday night alongside U.S. Senate candidate Joni Ernst on the eve of that state’s primary election.\n“[Ernst] is an exceptional candidate,” Rubio told the crowd. “Come November, the whole country may be up late watching the returns from Iowa because the choice you make here could very well be the difference between another two years with [Nevada Sen.] Harry Reid as majority leader or a new day for our country. We have the opportunity to reclaim the American dream.”\nAs attendees munched on pork sandwiches in the parking lot outside the Ernst campaign headquarters, Rubio spent time making his way through the crowd, shaking hands and signing autographs.\nThis campaign event was Rubio’s first trip back to Iowa since keynoting the annual birthday bash in honor of longtime Iowa Gov. Terry Branstad just days after the 2012 election -- helping fuel speculation about his 2016 presidential ambitions.\nAsked about his return to Iowa Monday, Rubio denied having scheduled any other meetings in the state, noting he was only there to help Ernst get elected.","url":"https://www.nbcnews.com/politics/first-read/rubio-stumps-ernst-eve-iowa-primary-n120896"}
