{"authors":["Jeff Poor"],"date_download":"2018-10-30 20:24:23","date_modify":"2018-10-30 20:24:23","date_publish":"2015-10-14 14:24:21","description":"Rubio: Dem Debate Basically 'Liberal vs Liberal' --- 'Who Was Going to Give Away the Most Free Stuff'","filename":"data/vaneerConsumption/RubioDemDebateBasicallyLiberalvsLiberalWhoWasGoingtoGiveAwaytheMostFreeStuff.json","image_url":"https://media.breitbart.com/media/2015/10/Rubio1014.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_14__1540931063.html","title":"Rubio: Dem Debate Basically ‘Liberal vs Liberal’ — ‘Who Was Going to Give Away the Most Free Stuff’","title_page":"Rubio: Dem Debate Basically 'Liberal vs Liberal' --- 'Who Was Going to Give Away the Most Free Stuff' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wednesday on Fox News Channel’s “Fox & Friends,” Sen. Marco Rubio (R-FL) offered his thoughts on Tuesday’s Democratic presidential debate broadcasted on CNN.\nRubio criticized the participants of that debate for making overtures about expanding government handouts, which he said was reminiscent of the Democratic Party of the 1980s.\n“If it wasn’t for hi-def, you’d think it was from 1985,” he said. “If you watched that debate last night it looked like something from the early ’80s. It was basically a liberal versus liberal debate about who was going to give away the most free stuff. Free college education, free college education for people illegally in this country, free health care, free everything. Their answer to every problem in America is a government program and a tax increase. That’s all they prescribe time and time again.”\n“This is stuff from the ’80s, the mid ’80s, and we’re back there,” Rubio added. “As I said before the debate, it became exactly what I predicted it would be: a race to the left to see who’d be the most radically liberal, the most big government. And that’s what this whole primary is going to be for the Democratic side.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/politics/2015/10/14/rubio-dem-debate-basically-liberal-vs-liberal-who-was-going-to-give-away-the-most-free-stuff/"}
