{"authors":["Associated Press"],"date_download":"2018-10-23 00:12:19","date_modify":"2018-10-23 00:12:19","date_publish":"2016-01-11 08:52:05","description":"BEDFORD, N.H. (AP) — Marco Rubio is increasingly portraying immigration as a national security issue rather than a question of what to do with millions of pe...","filename":"data/vaneerConsumption/Rubioshiftsimmigrationfocustonationalsecurityconcerns.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:c6a991d3b10a4f5b9d0c6af697b0405d-56CX32zFKLb7123928b84cc82f70-225_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393548_Rubio-shifts-immigration-focus-national-security-concerns_1540253539.html","title":"Rubio shifts immigration focus to national security concerns","title_page":"Rubio shifts immigration focus to national security concerns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rubio shifts immigration focus to national security concerns\nBEDFORD, N.H. (AP) — Marco Rubio is increasingly portraying immigration as a national security issue rather than a question of what to do with millions of people in the country illegally, a sign of his evolving stance on a topic that remains one of his liabilities with conservative voters.\n\"The issue is not the same one we had a few years ago,\" Rubio told voters recently in New Hampshire. \"This issue's different now; we have radical jihadist groups that are using our immigration system against us.\"\nAs he seeks to emerge as a top contender in the GOP's crowded presidential field, Rubio still finds himself explaining his past support for an immigration overhaul bill that included a path to citizenship.\nRepublican presidential candidate, Sen. Marco Rubio, R-Fla. speaks during a town hall campaign stop, Friday, Jan. 8, 2016, in Concord, N.H. (AP Photo/Jim Cole)\nTexas Sen. Ted Cruz, one of his chief rivals, tries to use the bill to brand Rubio as too soft on the issue. And on the campaign trail, Rubio is often asked about immigration, either by skeptical voters or those simply seeking an explanation of where he stands.\n\"He still hasn't made up with me yet regarding the Gang of Eight,\" said David Merritt, a Massachusetts voter who came to see Rubio in Atkinson, New Hampshire. Merritt's comments refer to the immigration bill Rubio co-authored. \"I'm not 100 percent sure that I trust him,\" Merritt said.\nThe overhaul bill passed the Senate, with Rubio's help, but he later backed off the proposal as it began to draw fire from the conservative right. Asked to explain, he says he now favors a one-piece-at-a-time approach.\nHe says the federal government needs to boost border security and modernize the legal immigration system before it deals with the 11 million people here illegally. He says the government must do better at tracking the millions who overstay visas and must make mandatory the e-verify system, an Internet-based program that allows employers to check the eligibility of prospective employees through federal databases.\nBut in recent weeks, Rubio also has shifted the conversation, starting the immigration segment of his stump speech by painting gaps in the U.S.-Mexico border and the existing legal immigration system as a national security threat. And he's taken to telling voters that the Islamic State group is actively recruiting fighters to send to the United States posing as doctors, students and investors.\n\"Radical jihadist groups, the same people who carried out the attacks in Paris, who inspired the attacks in California, are trying to use our immigration system against us,\" Rubio said Thursday to a crowd packed into a Bedford home.\n\"They've already gotten someone into this country as a fiancee,\" he said, referring to Tashfeen Malif, the wife accused in the California shootings. A Pakistani citizen, she was allowed into the country in 2014 to marry a U.S. citizen. The FBI said after the shooting that Malif and her husband had been radicalized for some time, but the FBI also said recently there's no evidence of outside actors in coordinating the shooting.\nRubio says if the government doesn't know \"100 percent\" who someone is or why they are coming into the United States, they won't be allowed in under his administration.\n\"This has become a national security issue, and when an issue changes, so must your policies,\" he said.\nBut Rubio's stance on immigration was fluid long before the Islamic State was a concern.\nAs Florida's House speaker in 2008, Rubio came under fire from GOP colleagues for not bringing several bills aimed at discouraging illegal immigration to the House floor for a vote, including bills to increase employer verification requirements and require police to report those suspected of being in the country illegally.\nHe began to shift rightward when he ran for the Senate in 2010 as a tea party favorite, pledging to oppose any legislation that would grant amnesty to the millions here illegally.\nPressed about what to do with millions already here illegally, Rubio said then that they would return to their homelands and re-enter once the federal government enforced a legal immigration system \"that works.\" He also opposed a 2007 comprehensive immigration reform bill authored by Sen. John McCain because it included \"amnesty\" for millions. Yet the bill he helped craft in 2013 included a path to citizenship.\nRubio's shifting stance isn't a problem for some voters. Cindy Coutu of Bedford considers immigration a top concern, and she appreciates his focus on the issue from a national security perspective.\n\"Who's coming in? Who are you? Where are you from? Let's get a better idea, and then start dealing with who is already here,\" she said. \"That makes sense.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393548/Rubio-shifts-immigration-focus-national-security-concerns.html"}
