{"authors":[],"date_download":"2018-10-30 14:34:05","date_modify":"2018-10-30 14:34:05","date_publish":"2015-05-08 00:00:00","description":null,"filename":"data/vaneerConsumption/RubioPaulCruzvotetoallowObamatoliftIransanctions.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_rubio_paul_cruz_vote_to_allow_obama_to_lift_iran_sanctions_comments_1540910045.html","title":"Rubio, Paul, Cruz vote to allow Obama to lift Iran sanctions","title_page":"Blog: Rubio, Paul, Cruz vote to allow Obama to lift Iran sanctions","title_rss":"NULL","source_domain":"americanthinker.com","text":"As many of you know, I'm a big fan of Ted Cruz, but when he does something wrong, it's important to call him on it. In this case he, along with Marco Rubio and Rand Paul, voted for a bill that will effectively allow the President to lift sanctions on Iran. Normally, here's how treaties work: the President negotiates a treaty with another country, like the deal he is negotiating with Iran over its nuclear weapons development. Once the treaty is negotiated, it's submitted to the Senate. Two thirds of the Senate has to vote to approve, or ratify, the treaty. If two thirds do not support it, it is not binding. But the bill the Congress sent to the President turns things on its head. It will allow the President to lift sanctions on Iran, and unless Congress objects with a 2/3 vote within 30 days, the President's actions are allowed to stand. See the reversal? Formerly, the President needed a 2/3 vote to act, and now the Congress needs a 2/3 vote to stop him from... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/rubio_paul_cruz_vote_to_allow_obama_to_lift_iran_sanctions_comments.html"}
 and Paul fought this measure procedurely, at first... but then voted for it on final passage. Totally inexplicable. And totally wrong, from a policy and constitutional perspective. Paradoxically, this bill is being sold as one that will give Congress more oversight and control over the negotiations. In practice it will do the opposite, and starts to raise questions about the national security judgment of Rubio, Paul, and Cruz. Only Tom Cotton of Arkansas ended up voting against the final bill. That's right--only one vote against. Always beware of near-unanimous votes in the Congress, because they are nearly unanimously bad results. As an attorney (who attended the same law school as Obama and Ted Cruz, and actually at the same time as the former), my personal opinion is that this vote of Congress is probably unconstitutional. Congress cannot vote to give away the powers granted it under the Constitution. The treaty ratifying power is given to the Senate under the Constitution and the Senate cannot waive it, no matter how much Harry Reid and Mitch McConnell want to. Practically speaking, of course, it no longer matters very much what is or is not constitutional, as the courts are curiously uninterested in limiting executive power and the legislative branch is intent on giving it up, so there is no one to challenge it and no effective forum to challenge it in. This article was produced by NewsMachete.com , the conservative news site.","url":"https://www.americanthinker.com/blog/2015/05/rubio_paul_cruz_vote_to_allow_obama_to_lift_iran_sanctions.html"}
