{"authors":[],"date_download":"2018-10-22 22:42:26","date_modify":"2018-10-22 22:42:26","date_publish":"2014-05-12 14:01:51","description":"\"I do not believe that human activity is causing these dramatic changes to our climate the way these scientists are portraying it,\" he says.","filename":"data/vaneerConsumption/RubioHumanActivityIsntCausingClimateChange.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/436081/marco_rubio_13cade6c4bee2328d86d18701c6bcc95.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_rubio-human-activity-isnt-causing-climate-change-n103061_1540248146.html","title":"Rubio: Human Activity Isn't Causing Climate Change","title_page":"Rubio: Human Activity Isn't Causing Climate Change","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA potential contender for the GOP presidential nomination says he doesn’t believe human activity is causing changes to the global climate.\n“I do not believe that human activity is causing these dramatic changes to our climate the way these scientists are portraying it,” Sen. Marco Rubio, R-Fla., told ABC News on Sunday. “And I do not believe that the laws that they propose we pass will do anything about it. Except it will destroy our economy.”\nRubio also said that he disputes “the notion that some are putting out there, including scientists, that somehow there are actions we can take today that would actually have an impact on what's happening in our climate.”\nAn early rising star of the Tea Party, Rubio lost some of his luster with the conservative base after embracing a bipartisan immigration reform bill. His stance against the existence of man-made climate change will win praise from those in the GOP who question scientific research on global warming, but it could prove harmful if he pulls out a primary win and has to win over the general electorate.\nA Pew Research poll from last year showed that 66 percent of Democrats believe that human activity is the main cause of global warming, compared to 43 of independents and just 24 percent of Republicans.\nRubio’s interview with ABC News also appeared to put to rest any doubt about whether he is seriously considering a 2016 run.\nAsked if he is ready to be president, Rubio replied: “ I do,” adding that others in the party are also prepared but touting his 14-year record of public service.\nAnd he said that he will not seek reelection to the Senate if he decides to make a run for the White House.\n“You don't run for president with some eject button in the cockpit that -- that -- that allows you to go on an exit ramp if it doesn't work out,” he said.","url":"https://www.nbcnews.com/politics/politics-news/rubio-human-activity-isnt-causing-climate-change-n103061"}
