{"authors":["Matthew Boyle"],"date_download":"2018-10-30 20:45:58","date_modify":"2018-10-30 20:45:58","date_publish":"2015-12-29 19:39:50","description":"Rubio-Bush War Intensifies With Ad Hitting Marco’s Choice To Fundraise While Skipping Security Briefings","filename":"data/vaneerConsumption/RubioBushWarIntensifiesWithAdHittingMarcosChoiceToFundraiseWhileSkippingSecurityBriefings.json","image_url":"https://media.breitbart.com/media/2015/11/Rubio-Bush-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_29__1540932358.html","title":"Rubio-Bush War Intensifies With Ad Hitting Marco’s Choice To Fundraise While Skipping Security Briefings","title_page":"Rubio-Bush War Intensifies With Ad Hitting Marco’s Choice To Fundraise While Skipping Security Briefings","title_rss":"NULL","source_domain":"breitbart.com","text":"The war between former Florida Gov. Jeb Bush and Sen. Marco Rubio (R-FL), a fight between mentor and protege, is intensifying with the release of a new Super-PAC ad from Team Bush excoriating Rubio over his decision to fundraise instead of attending critical national-security briefings.\n“Days after the Paris attacks, Senators came together for a top secret briefing on the terrorist threat,” an announcer says in the opening of the ad, just out from Right to Rise, the Super-PAC backing Bush for president.\n“Marco Rubio was missing, fundraising in California instead. Two weeks later, terrorists struck again in San Bernardino. And where was Marco? Fundraising again in New Orleans. Over the last three years, Rubio has missed important national security hearings and missed more total votes than any other senator. Politics first, that’s the Rubio way.”\nThe brutal advertisement—30 seconds in length—is all factually correct.\nIn fact, throughout the ad, sources such as the Tampa Bay Times are cited. The Times reported on Nov. 18 a headline from its Washington bureau chief, Alex Leary, that blared: “Rubio Misses Paris Hearing For Fundraising: Did Attend Classified Briefing Tuesday.”\nIn the article, Leary shreds Rubio with the facts.\n“At 10 a.m. Wednesday, the Senate Foreign Relations Committee went behind closed doors for a briefing titled, ‘The Aftermath of Paris: America’s Role,’” Leary wrote. “But Sen. Marco Rubio was not there. The Florida Republican is on his way to California for fundraising. The absence illustrates how Rubio is not just missing floor votes but also key hearings on national security and foreign policy — issues he has presented as chief credentials of his presidential campaign. He’s also skipping a Paris briefing this afternoon for all senators. His office said he attended an Intelligence Committee meeting on Paris held Tuesday.”\nLeary’s piece includes a screen shot of the fundraiser invitation in Newport Beach, California, that shows Rubio was not at the Paris briefing in the Senate.\nDuring the San Bernardino attack, Rubio was fundraising in New Orleans, Louisiana, confirmed by reports from both the Times-Picayune and the Advocate newspaper in Louisiana.\nTo the claim that Rubio has missed more briefings and votes than any other senator in the U.S. Senate—the final claim in the ad—the Bush Super PAC also has good sourcing: Politico, BuzzFeed and the Huffington Post have all had reports detailing it.\nThe Politico story, from then-Politico reporter Manu Raju—who’s since left for CNN—ran in July of 2015 under a brutal headline for Rubio: “Marco Rubio, Absentee Senator: The Florida senator grilled Obama officials on Iran last week, but he’s been playing hooky more than the rest of the 2016 class.”\n“Rubio has skipped votes during high-profile fights over national security, trade, energy and education policy,” Raju wrote.\nHe has missed private hearings during a critical stage in the Iran talks, a public forum on China and a private briefing on the U.S. strategy on the Islamic State. Last month, a California congressional candidate tweeted a picture with Rubio in Los Angeles on the same day the Florida senator missed a closed-door Foreign Relations Committee session on Iran and a procedural vote on the Export-Import Bank’s future, a flash point in the presidential campaign.\nThe BuzzFeed piece, from Andrew Kaczynski, ran on April 7 under a headline: “Rubio Skipped Closed-Door Briefings On ISIS For Fundraising Trip.”\n“While Sen. Marco Rubio was on a big fundraising swing through California, he missed a top secret intelligence briefing on ISIS from the Senate Foreign Relations Committee and two closed Intelligence Committee briefings from that period, according to records,” Kaczynski wrote.\nRubio spent a week in California for what was deemed an ‘aggressive’ fundraising trip. On the day of one hearing Rubio appeared at a $1,000 per-person admission Beverly Hills fundraiser. The trip benefited the Rubio Victory Committee, which is a joint fundraising committee of Rubio’s Senate campaign and Reclaim America PAC, according to Los Angeles’ CBS-affiliate. The closed briefing on the ‘Campaign against ISIS,’ featured Nicholas J. Rasmussen, the directer of the National Counterterrorism Center, Christine Wormuth, the Under Secretary of Defense for Policy, retired general John R. Allen, the special presidential envoy for the global coalition to counter ISIS, and Major General Steven M. Shepro the vice director for strategic plans and policy.\nRubio’s team’s excuse for skipping those briefings on ISIS wasn’t very convincing.\n“He is seriously considering running for president and taking the necessary steps to field a competitive campaign, and it’s not unusual for presidential candidates to occasionally miss Senate business,” a Rubio spokesperson told Kaczynski back then.\nThe Huffington Post piece, from that publication’s senior political editor Sam Stein, ran on Oct. 26, 2015, under another brutal headline: “Marco Rubio Missed Intel Hearing Just Days Before Defending Attendance Record.”\nStein wrote that Rubio has taken “some liberties” in his defensiveness about his “spotty” attendance record in the Senate, and that just days before that CNN interview in late October he had skipped another classified briefing in the Senate Intelligence Committee to fundraise.\nOn Thursday, Oct. 22, the panel held a closed-door hearing (the second of the week, after the Tuesday session Rubio referred to) at 2:30 p.m, according to its website,” Stein wrote. “That same day, a major fundraiser was held for the Rubio campaign in Los Angeles, co-hosted by, among others, producer Burt Sugarman and his wife, former Entertainment Tonight host Mary Hart. Rubio’s campaign has ignored repeated emails requesting comment as to whether he attended that fundraiser. But a Los Angeles Times item from Oct. 22 reported: ‘Marco Rubio arrives in L.A. for a fundraiser even as some have assailed him for missing votes in Washington.’ The Washington Post also reported that after a bill of Rubio’s failed to pass Tuesday, the senator ‘was done for the week, missing the next three votes.’\nDespite the fact that the Bush Super PAC Ad is entirely factually correct, Rubio’s team blasted out a “fact-check” accusing Team Bush of being dishonest about Rubio’s poor attendance record in the Senate.\n“Bush’s team dishonestly omits that Marco is on the Senate’s Intelligence Committee, where he attended the highest level briefings on the Paris attacks,” Rubio spokesman Alex Conant said in the supposed “fact check” at the top of the email. “No other candidate for president has received more classified Intelligence briefings or better understands the threats facing our nation today than Marco. It’s sad to see Jeb’s ‘joyful’ campaign reduced to such intellectual dishonesty.”\nThe “fact check,” is posted on a website domain called “2016facts.org”—which is really owned by the Rubio campaign per a Federal Election Commission-required disclosure at the bottom noting that it was “Paid for By Marco Rubio For President.”\nThe posting is reminiscent of efforts Rubio engaged in to mislead the public during his push alongside Sen. Chuck Schumer (D-NY) for the “Gang of Eight” amnesty bill—phony “fact checks” that were actually Rubio’s and his liberal allies’ talking points disguised as facts were produced to lull the unsuspecting public into temporary submission so Rubio and Schumer could get amnesty through the Senate. They eventually failed to slip the amnesty through the House of Representatives as the public eventually saw through the tactics, but nonetheless the fabricated “fact check” has become a signature move of Rubio’s when he’s in trouble and needs a political bailout.\nThe “fact check” is littered with misinformation that doesn’t actually address any of the points made by Bush’s team in the Super PAC ad—but rather other “facts” that are about other related, but not central, points.\nIn the so-called “myth-versus-fact” section of the Rubio campaign’s “fact check”—which, again, reads like Schumer’s talking points for the “Gang of Eight” amnesty bill as this is exactly the same tactic Rubio used then—Rubio’s campaign addresses all three major allegations in the Bush Super PAC ad.\n“Days after the Paris attacks, Senators came together for a top-secret briefing on the terrorist threat, Marco Rubio was missing. Fundraising in California instead,” is the first point in the Bush Super PAC ad, labeled by the Rubio campaign as a “myth.”\nThe Rubio campaign in their “fact” section of this part of the “fact check” points to a whole bunch of reports that Rubio did attend a different and separate classified briefing on the Paris attacks—one that was different and separate from the one he did in fact skip, which his team does not deny that he skipped.\nThings the Rubio campaign cites as their “facts” meant to debunk the Bush Super PAC’s allegation—but are really separate points unrelated to the core allegation—include the fact that Rubio did attend a different briefing, that Rubio gave remarks outside that separate briefing, that Rubio serves on the Senate Intelligence Committee even though he’s skipped several of that committee’s briefings, and that Senate Judiciary Committee chairman Sen. Chuck Grassley (R-IA) wouldn’t back Bush’s criticisms of Rubio.\nIn the second “myth” of the Rubio campaign sponsored “fact check,” the Rubio campaign challenges the Bush Super PAC’s ad’s second major claim: “Two weeks later, terrorists struck again in San Bernardino. And where was Marco? Fundraising again in New Orleans.”\nAgain, like the first so-called “myth,” Rubio’s team listed out a whole series of unrelated “facts” meant to debunk it—but those statements again did not address the truth, which is that during the San Bernardino attacks, Rubio was fundraising in New Orleans.\nThe “facts” in this part of the “fact check” include that Rubio came back to the Senate the next day to address radical Islam in a speech to the Republican Jewish Coalition, that Rubio has on his website “outlined a strategy” to defeat ISIS,” and that Bush himself was also in New Orleans fundraising during that time. Again, while those statements from Rubio’s team are true and are “facts,” they don’t debunk the core allegation from the Bush team—which is also true.\nThe next “myth” the Rubio campaign’s “fact check” supposedly addresses is this statement from the Bush Super PAC ad: “Over the last three years Rubio has missed important national security hearings and missed more total votes than any other senator.”\nYet again, Rubio’s campaign cites unrelated other “facts” meant to debunk that allegation—but don’t address the core of the allegation, which is true: Rubio has in fact missed several important national security hearings and he has in fact missed more votes than any other U.S. Senator.\nThe “facts” the Rubio campaign points to in order to make its case on this point include that Bush campaigned for Sen. John McCain (R-AZ)—the 2008 GOP presidential nominee—after he missed lots of votes and hearings while on the campaign trail as well. While that’s also true—McCain did miss lots of those things while campaigning for president back then, and Bush didn’t attack McCain over it while campaigning for McCain—it doesn’t mean that Rubio didn’t also do those things that the Bush Super PAC alleged.\nIn addition to deploying the same “Gang of Eight”-style phony “fact check” document to attack Bush, Rubio’s campaign has also showed another sign of desperation: He’s deployed countless surrogates to defend him from the ad.\n“As a member of the House Intelligence Committee and a veteran, there is no doubt that Marco has shown great national security leadership in the Senate,” Rep. Mike Pompeo (R-KS), who has endorsed Rubio for president, said in a statement released by the Rubio campaign designed to combat the ad. “The claims by Jeb Bush’s Super PAC are misleading and reflect a deep misunderstanding of Marco’s critically important record working to keep Americans safe.”","url":"https://www.breitbart.com/politics/2015/12/29/rubio-bush-war-intensifies-ad-hitting-marcos-choice-fundraise-skipping-security-briefings/"}
