{"authors":[],"date_download":"2018-10-22 23:04:51","date_modify":"2018-10-22 23:04:51","date_publish":"2014-05-13 18:19:52","description":"\"The issue is whether there are legislative proposals before us that could do anything about it,\" the possible 2016 candidate says.","filename":"data/vaneerConsumption/RubioIveNeverDisputedThatTheClimateIsChanging.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/297806/140402-rubio_senate_april2-1805_200ae19fe10070d164bb0da82e0a0a97.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_rubio-ive-never-disputed-climate-changing-n104421_1540249491.html","title":"Rubio: 'I've Never Disputed That The Climate Is Changing'","title_page":"Rubio: 'I've Never Disputed That The Climate Is Changing'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSen. Marco Rubio said Tuesday that he’s “never disputed that the climate is changing,” arguing that recent comments in which he was skeptical of man-made climate change were merely focused on U.S. energy policy.\n“Headlines notwithstanding, of course the climate is changing,” he said after a policy speech at the National Press Club. “The issue is not whether the climate is changing – as it always is changing – the issue is whether there are legislative proposals before us that could do anything about it.”\nRubio, a possible 2016 presidential candidate, said on ABC's \"This Week' on Sunday that “I do not believe that human activity is causing these dramatic changes to our climate the way these scientists are portraying it.\" (During that interview, he also acknowledged that the climate is \"always changing\" and advocated for strategies to manage the impact of those changes.)\nQuestioned on Tuesday about the source of his doubts, Rubio notably did not repeat the statement that climate change is not the result of human activity, only emphasizing his opposition to energy bills backed by environmental advocates.\n“What I have said, and what I disagree with, is that if we pass cap-and-trade for example, that will stop this from happening, when in fact half of the emissions on the planet are coming from developing countries and half of that is coming from one country – China – that isn’t going to follow whatever laws we pass,” he said.\nAs he did on Sunday, Rubio added that he supports strategies to “mitigate” the effects of climate change and to invest in technologies that preserve the environment “in a way that … is also good for our economy.”\n“For people to go out and say ‘if you pass this bill that I am proposing, this will somehow lead us to have less tornadoes and less hurricanes,’ that’s just not an accurate statement,” he said.\nRubio’s remarks came after a lengthy policy speech on overhauling the nation’s retirement system. He proposed raising the age of retirement but letting workers enroll in a federal savings plan.","url":"https://www.nbcnews.com/politics/politics-news/rubio-ive-never-disputed-climate-changing-n104421"}
