{"authors":["Ian Hanchett"],"date_download":"2018-10-30 21:13:02","date_modify":"2018-10-30 21:13:02","date_publish":"2015-04-14 03:35:49","description":"Marco Rubio said \"we have to acknowledge and address\" that African-Americans \"feel like they're treated differently\" by police and civilians","filename":"data/vaneerConsumption/RubioWeNeedtoAddressThatPeopleFeelTargetedBasedonRace.json","image_url":"https://media.breitbart.com/media/2015/04/Rubio-Race-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_13__1540933982.html","title":"Rubio: We Need to 'Address' That People Feel Targeted Based on Race","title_page":"Rubio: We Need to 'Address' That People Feel Targeted Based on Race | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senator and presidential candidate Marco Rubio (R-FL) said that “we have to acknowledge and address” that “there are millions of young African-Americans in this country who do feel like they’re treated differently both by law enforcement, and sometimes by individuals” in an interview broadcast on Monday’s “Hannity” on the Fox News Channel.\nRubio said, “every case is different, and so my point is, yeah, there are millions of [Americans] — I’ve spoken to millions of young African-Americans who feel as if they are targeted by the police, they’ve had experiences with the police, that they’re very concerned about. Quite frankly, Sean, I’ve seen it, I’ve witnessed it myself, and not necessarily with police, but maybe a friend of yours, if you go to a store or something, and you hear the stories when they come back back, that they were followed around…and that’s problematic, and we need to admit that. By the same token, not every instance that involves, unfortunately an African-American victim and a white police officer or person is necessary indicative of a race problem. And so, we need to be careful about that, but at the end of the day we have to recognize there are millions of young African-Americans in this country who do feel like they’re treated differently both by law enforcement, and sometimes by individuals, and that’s something we have to acknowledge and address.”\nRubio added that “I don’t necessarily believe that we need to tailor messages to one ethnic group or another…equality of opportunity applies across the board.” And that “a disproportionate number of people who are suffering from opportunity inequality happen to be young, single women, and people that come from minority communities. They would most stand to benefit from a limited government, free enterprise agenda that will give them a chance to achieve their version of the American dream.\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/04/13/rubio-we-need-to-address-that-people-feel-targeted-based-on-race/"}
