{"authors":["Tim Collins For Mailonline"],"date_download":"2018-10-23 02:58:57","date_modify":"2018-10-23 02:58:57","date_publish":"2017-04-26 14:15:56","description":"London-based entrepreneur and former 'Made in Chelsea' star Amber Atherton has launched a free app that creates captions for your social media images.","filename":"data/vaneerConsumption/RubricapppromisesperfectcaptionsforInstagramsnaps.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FACDC00000578-0-image-a-42_1493210246601.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447474_Rubric-app-promises-perfect-captions-Instagram-snaps_1540263537.html","title":"Rubric app promises perfect captions for Instagram snaps","title_page":"Rubric app promises perfect captions for Instagram snaps | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Capturing glamorous looking photos is easier than ever thanks to the creative use of Instagram filters.\nBut thinking of something witty or engaging to write underneath that latest snap of your gourmet lunch can be a struggle.\nNow a new app promises to turn even the laziest of writers into social media stars by analysing your images and suggesting snappy captions.\nScroll down for video\nRubric (pictured), a new app that uses artificial intelligence and visual recognition software to work out what is in your photos, could provide the perfect captions for your Instagram snaps\nHOW IT WORKS Rubric uses artificial intelligence and visual recognition software to work out what is in your photo. Based on what it finds, the app will offer social media friendly trendy phrases, as well as inspirational quotes and even song lyrics. MailOnline put the Rubric through its paces, with varying results. The app's ability to correctly identify what is in each image is pretty accurate. But some of the stock phrases felt slightly repetitive. Where the app really came into its own was with its suggestions of historical and inspirational quotes.\nRubric uses artificial intelligence and visual recognition software to work out the 'perfect' caption for your photo.\nBased on what it finds, the app will offer social media friendly trendy phrases, as well as inspirational quotes and even song lyrics.\nRubric is the brainchild of entrepreneur and former reality star Amber Atherton, a familiar face to viewers of 'Made In Chelsea'.\nHer company Zyper launched the app exclusively for iPhone and it has proved a hit, topping the trending chart in the App Store and it has been downloaded more than 7,000 times in its first three days.\nA statement on the app's website said: 'Rubric solves the millennial epidemic of deciding what to caption a photo.\n'Once all the filtering and editing is done, you're left with critical problem of what the perfect caption would be.\n'Rubric uses visual recognition technology and machine learning to automatically generate a wide selection of relevant captions.\n'From trending phrases to lyrics and quotes.'\nMailOnline put the Rubric through its paces, with varying results.\nThe app's ability to correctly identify what is in each image is pretty accurate, although some images were more problematic than others.\nRubric was, thankfully, able to correctly distinguish a loaf of bread from an image of a sheep, as well as various famous faces - including the Queen.\nRubric was able to correctly distinguish a loaf of bread (left) from an image of a sheep (right), offering social media friendly phrases like 'bakery game too strong' and 'sheep feels'\nWhen it came to an image of the Queen, Rubric suggested captions (right) like 'queen game too strong' and 'queen what's good?' and the less than courteous 'queen af'. It also offered some words of wisdom (right) from US talk show host Oprah Winfrey on female empowerment\nBut some of the 'tags' suggested were less useful than others.\nIn the first section, Rubric offers suggestions for shareable phrases in the language of Instagram and other trendy social media apps.\nThese quickly became quite repetitive and variations on a theme, with the item pictured slotted into such gems as 'game too strong', 'feels', 'chill' and others.\nWhere the app really came into its own was with its suggestions of historical and inspirational quotes.\nRubric offered a cheeky line from Hollywood legend Jack Nicholson on dealing with the police (left) as well as some thoughts on the role of administration in relation to Theresa May\nA photo of Gandhi (left), who was identified by the software as a leader, prompted a particularly apt quote from Martin Luther King Jr. An image of the Duke and Duchess of Cambridge elicited some thoughts from Barbara Bush on togetherness (right)\nRubric offered a cheeky line from Hollywood legend Jack Nicholson on dealing with the police.\nIt said: 'There's only two people in your life you should lie to... the police and your girlfriend.'\nAnd a photo of Gandhi, who was identified by the software as a leader, prompted a particularly apt quote from Martin Luther King Jr, which said: 'A genuine leader is not a searcher for consensus, but a molder of consensus.'\nA third section of the software also offers suggestions from songs, fed by the Rap Genius service, a crowd-sourced site that provides song lyrics and interpretations of their meaning.","url":"https://www.dailymail.co.uk/sciencetech/article-4447474/Rubric-app-promises-perfect-captions-Instagram-snaps.html"}
