{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:39:01","date_modify":"2018-10-30 22:39:01","date_publish":"2014-08-14 20:54:12","description":"Big news, guys: Selena Gomez is in a movie, and it's not one that looks like it's going to get a 0% rating on Rotten Tomatoes (which, for the record, she did too)! Quite the contrary, in fact: The first trailer for Rudderless , starring Billy…","filename":"data/vaneerConsumption/RudderlessTrailerWithSelenaGomezLooksLikeHerMostEmotionalRoleYetVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/414a4c80-8080-46b4-b92a-dae221969d25.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35850-rudderless-trailer-with-selena-gomez-looks-like-her-most-emotional-role-yet-video_1540939141.html","title":"'Rudderless' Trailer With Selena Gomez Looks Like Her Most Emotional Role Yet - VIDEO","title_page":"'Rudderless' Trailer With Selena Gomez Looks Like Her Most Emotional Role Yet — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Big news, guys: Selena Gomez is in a movie, and it's not one that looks like it's going to get a 0% rating on Rotten Tomatoes (which, for the record, she did too)! Quite the contrary, in fact: The first trailer for Rudderless , starring Billy Crudup, Anton Yelchin, Felicity Huffman, and Selena Gomez, is here, and based off of the two-and-a-half minute clip, it's gonna be worth a watch. Or two. Or ten.\nThe film, which focuses on Crudup's character, Sam's, downward spiral and subsequent rise after his son is killed in a college campus shooting, was directed by Huffman's husband, Shameless star William H. Macy, and premiered at Sundance to excellent reviews. Yelchin portrays a young musician who convinces Sam to play some of Sam's late son's unfinished music with him, and there's apparently a huge twist late in the film that \"deepens\" the plot quite a bit. Gomez's part is smaller by the looks of it, but she's said in the past that it's quite a dark role for her.\nAfter premiering at Sundance earlier this year, the film was instantly acquired by Samuel Goldwyn Films, and it looks like the film will be released in theaters and on video on demand platforms on October 17. Not too far off! Until then, check the trailer below.\nMovieclips Trailers on YouTube\nImage: Sundance","url":"https://www.bustle.com/articles/35850-rudderless-trailer-with-selena-gomez-looks-like-her-most-emotional-role-yet-video"}
