{"authors":["Casey Rackham"],"date_download":"2018-10-30 23:04:59","date_modify":"2018-10-30 23:04:59","date_publish":"2014-08-14 02:18:42","description":"I'm in such shock right now, I can't even comprehend what's happening. In the worst move ever, America axed fan-favorite Rudy Abreu and my personal favorite, Tanisha Belnap. But let's just talk about Rudy right now, because you know what this means:…","filename":"data/vaneerConsumption/RudyAbreuIsGoingHomeNowHisSYTYCDRomanceWithJacqueLeWarneIsOver.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d1ae9400-beb5-4260-b67c-49f76693dd50.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35713-rudy-abreu-is-going-home-now-his-sytycd-romance-with-jacque-lewarne-is-over_1540940699.html","title":"Rudy Abreu Is Going Home & Now His 'SYTYCD' Romance With Jacque LeWarne Is Over","title_page":"Rudy Abreu Is Going Home & Now His 'SYTYCD' Romance With Jacque LeWarne Is Over","title_rss":"NULL","source_domain":"bustle.com","text":"I'm in such shock right now, I can't even comprehend what's happening. In the worst move ever, America axed fan-favorite Rudy Abreu and my personal favorite, Tanisha Belnap. But let's just talk about Rudy right now, because you know what this means: No more Rudy and Jacque romance. Although both lovebirds were in the bottom four during So You Think You Can Dance's Top 8 episode, only Jacque was able to stay on the show. That means all of our hope of seeing their cute faces make it to the top together have been dashed. Womp.\nAll I can say is that after tonight's absolutely amazing performance from Rudy, I bet America is seriously regretting its decision to send him packing. It was honestly one of my favorite of Rudy's routines, especially since All-Star Allison Holker made it completely stunning.\nI'm definitely one of those people who are iffy when it comes to the all-stars coming back to dance on the show, because, in the end, do they detract from the dancer who's actually competing, or do they make them better? Well, thanks to Allison, I have finally been turned into an all-star believer. Like a really, really big believer. Because damn, girl — she turned Rudy into one sexy beast. (But it should be noted that he was only turned into a sexy beast because she was a sexy beast. I mean, I can't even handle her moves in that white dress.)\nYouTube\nTheir jazz routine to Michael Jackson's \"Dirty Diana,\" which was choreographed by Ray Leeper, was, in my opinion, very Dirty Dancing-esque (both in the way they were dressed and in the chemistry between them). In that moment in time, Rudy was no longer that self-proclaimed fat kid at heart; he had completely transformed into a man. I mean, the entire premise of the dance was enough to get you hot. It's about a woman who wants to be with a man who's taken, and although the man pushes her away, he secretly wants her (uh oh, Jacque).\nTheir chemistry was absolutely insane, and at one point, in case we weren't already getting that they totally wanted to have sex, Allison basically jumped as high she possibly could until her legs were wrapped around Rudy's upper body. Wowza. And of course, the sexual tension wasn't the only thing that helped them steal the show; Rudy's technical moves were outstanding. By the end of their performance, it honestly sounded like they were at a Taylor Swift concert because the audience was absolutely losing its shit in the most squealish way possible. Unfortunately, Rudy was put into the bottom four because of his Top 10 Cha Cha performance with All-Star Jenna Johnson. So, that sucks.\nNow I'm gonna go and cry in a corner and possibly watch Dirty Dancing. Bye.\nImages: Adam Rose/Fox","url":"https://www.bustle.com/articles/35713-rudy-abreu-is-going-home-now-his-sytycd-romance-with-jacque-lewarne-is-over"}
