{"authors":["Caitlin Gallagher"],"date_download":"2018-10-30 23:27:21","date_modify":"2018-10-30 23:27:21","date_publish":"2014-08-13 18:23:10","description":"Season 11 of So You Think You Can Dance has been pushing a Rudy & Jacque romance on us viewers, but it's still up for debate how legitimate the Rudy/Jacque relationship is. While the chemistry between the ballet dancer and the contemporary dancer…","filename":"data/vaneerConsumption/RudyJacqueonSYTYCDSeemMoreConnectedtoTheirNewPartnersThanToEachOther.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8555e4f5-8109-4e56-9c76-0b7cc19a6811.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35567-rudy-jacque-on-sytycd-seem-more-connected-to-their-new-partners-than-to-each-other_1540942041.html","title":"Rudy & Jacque on 'SYTYCD' Seem More Connected to Their New Partners Than To Each Other","title_page":"Rudy & Jacque on 'SYTYCD' Seem More Connected to Their New Partners Than To Each Other","title_rss":"NULL","source_domain":"bustle.com","text":"Season 11 of So You Think You Can Dance has been pushing a Rudy & Jacque romance on us viewers, but it's still up for debate how legitimate the Rudy/Jacque relationship is. While the chemistry between the ballet dancer and the contemporary dancer may be in question, SYTYCD showed us how hot the two of them can be alongside other partners, namely some all-star partners, last Wednesday. Still, the show seems hell-bent on proving to us that the coupling of these adorable dancers is for real.\nThe pair started the night by coming out back-to-back during their intros, which led to Rudy blowing Jacque a kiss as she came out to strut her stuff. I barely noticed it, but don't worry, host Cat Deeley commented on it. Of course. (As much as I love Cat, I hope that she feels a bit weird pimping out this teen \"love\" story.)\nJacque and Rudy also danced right after each other during the episode. And SYTYCD made them do their little \"stand around awkwardly before the commercial break\" bit together. It definitely felt forced as Jacque looked pretty uncomfortable — and who can blame her? Even if their relationship is real, what self-respecting person would want their newfound relationship constantly broadcast on national television? That's just embarrassing.\nBut if I'm being honest, Rudy and Jacque's performances with their all-star partners showed that they definitely have more chemistry with other dance partners than with each other. One of those reasons is because we are seeing them do choreographed, sexy dances with their partners, while the 19-year-old Rudy and 18-year-old Jacque aren’t in those same seductive characters when they just wave and smile at the camera.\nRudy is a huge goofball in real life, but somehow he was kind of studly in the cha cha with partner Jenna:\nYouTube\nAlthough he had way too much mouth and lip action for my taste, he brought the moves. Judge Mary Murphy said he was “on fire” and “full of chemistry and power.\" She even put Rudy on the famous hot tamale train (and then instantly should have kicked him off for his jumping around and throwing his vest open). I agreed with judge and creator of SYTYCD Nigel Lythgoe when he advised Rudy to not go too over the top, but regardless, his dynamic with Jenna could not be denied.\nSimilarly, Jacque and Season 9 winner Chehon performed the first ever ballet-contemporary duet on the show. Choreographer Travis Wall said, “There’s not really a story in this piece. The attraction between the two — that connection— speaks for itself.”\nYouTube\nI don’t know if I always dug Jacque’s facials, but that connection between the dancers was apparent and her body looked amazing. In her pointe shoes and white costume, she was stunning alongside Chehon. Guest judge Tara Lipinski said, “In one word it was flawless. From your extension, to the flexibility, to those legs — oh my goodness.”\nSo where does this leave us? Jacque and Rudy both looked fabulous with their all-star partners, so SYTYCD will inevitably switch it up again this Wednesday. Interestingly enough, the show decided to pair Jacque with tWitch and Rudy with Allison. Coincidence that this showmance \"couple\" is paired with a married SYTYCD couple? I think not. And I’m sure it will make for tons of fodder and cheeky comments from Cat, the judges, and the choreographers.\nImages: Adam Rose/Fox; sweet--deans/Tumblr","url":"https://www.bustle.com/articles/35567-rudy-jacque-on-sytycd-seem-more-connected-to-their-new-partners-than-to-each-other"}
