{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 02:56:45","date_modify":"2018-10-23 02:56:45","date_publish":"2016-01-29 17:38:54","description":"The 27-year-old toted her favourite orange Celine purse as she headed out into Hollywood on Thursday night. Rumer had a busy 2015, having starred on Broadway and Dancing With The Stars.","filename":"data/vaneerConsumption/RumerWilliswearssameplungingLBDoncemoreassheheadsoutinLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B40F1700000578-0-image-a-7_1454086320892.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423078_Rumer-Willis-wears-plunging-LBD-heads-LA_1540263405.html","title":"Rumer Willis wears same plunging LBD once more as she heads out in LA","title_page":"Rumer Willis wears same plunging LBD once more as she heads out in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rumer Willis certainly was showing off her figure on Thursday night.\nThe 27-year-old flashed both her chest and thigh in a plunging black mini dress as she left the romantic Le Jardin lounge in Hollywood.\nThe Dancing With The Stars champion appeared to be all by herself.\nScroll down for video\nThat dress is working overtime! Rumer Willis showed off her chest and thigh in a black mini when leaving Hollywood's Le Jardin on Thursday night\nThe daughter of Demi Moore and Bruce Willis had the exact same outfit on a week ago.\nThe only difference on Thursday was Rumer's long plum red nails, which added an element of glam to the casual cool look.\nToting her favourite orange Celine purse, the actress slicked her short black hair across her head and brought out her natural beauty with bronzer eye shadow and long full lashes.\nThe Now And Then actress completed the nighttime look with a myriad of rings for a finishing touch.\nThere's little doubt a fun night out on the town was a nice change of pace for Rumer, who has been busy with her thriving career.\nTaking the plunge! The 27-year-old's low-cut LBD flashed plenty of cleavage on Thursday\nHard to miss: Willis made sure she stood out as she toted along her bright Celine purse\nThe multi-talented star is currently in the midst of filming musical feature Hello Again, which also stars Sam Underwood, Jenna Ushkowitz and Tyler Blackburn.\nThe indie feature centres around several characters who slip in and out of one another's arms in a bittersweet search for love.\nIt adapts Michael John LaChiusa's 1994 off-Broadway musical, which is based on Arthur Schnitzler's 1897 play La Ronde.\nHard at work: The multi-talented star is currently in the midst of filming musical feature Hello Again, which also stars Sam Underwood, Jenna Ushkowitz and Tyler Blackburn\nDirected by Tom Gustafson, it has yet to set a release date.\nThe new role comes after a busy 2015, which saw her win the coveted Mirror Ball trophy with her pro partner Val Chmerkovskiy on Dancing With The Stars.\nShe also made her Broadway debut in a limited run of Chicago.\nRed alert: The Dancing With The Stars winner showed off her long glam red nails","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423078/Rumer-Willis-wears-plunging-LBD-heads-LA.html"}
