{"authors":["John Nolte"],"date_download":"2018-10-30 19:35:38","date_modify":"2018-10-30 19:35:38","date_publish":"2014-06-21 17:37:00","description":"Child of too much privilege and free time; daughter of movie stars Demi Moore and Bruce Willis; exhibitionist millionaire narcissist with priorities so |","filename":"data/vaneerConsumption/RumerWillisGoesToplesstoProveShesNotDemiMoore.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Hollywood/2014/06/21/rumer-willis-3066.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_06_21__1540928138.html","title":"Rumer Willis Goes Topless to Prove She's Not Demi Moore","title_page":"Rumer Willis Goes Topless to Prove She's Not Demi Moore | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Child of too much privilege and free time; daughter of movie stars Demi Moore and Bruce Willis; exhibitionist millionaire narcissist with priorities so out of whack you wonder if she wasn’t a victim of baby-shaken-dropped-and-held-under-water syndrome — whatever you want to call her, Rumer Willis is so desperate for you to see her boobies, she continues to make a cause out of it. (Warning: NSFW spoiled princess tatas at link.)\nAfter prancing around New York City topless earlier this month, Willis followed up her cause celebre Friday night with a Topless Rights event in Los Angeles.\nThe hashtag is #FreeTheNipple and those lucky enough to attend also got to hear Rumer sing. Because she sings, you know. And cares. About women’s rights. About her right to show you her boobs.\nThe evening also featured a Very Important Video called “Everybody’s Gotta Eat” about the Very Important Issue of public breastfeeding. The video featured Rumer. Because she acts, you know. And cares. About you seeing breastfeeding boobs.\nMeanwhile, 1 billion people are without clean drinking water in the world and could really use all the support and celebrity advocacy they can find — because, like, many of them are, like, women also suffering under oppressive, like, bras and t-shirts, like.\nSources tell me that Rumer is merely acting out to prove to the world that she is her own woman and not her mother.\nMission accomplished.\nNow that we’ve seen her boobs, the world now knows Rumer Willis is no Demi Moore.","url":"https://www.breitbart.com/local/2014/06/21/rumer-willis-boobs/"}
