{"authors":[],"date_download":"2018-10-22 22:28:50","date_modify":"2018-10-22 22:28:50","date_publish":"2014-06-10 04:18:26","description":"A carriage horse bolted on the streets of Manhattan, galloping through Central Park and several streets before slamming into a yellow cab.","filename":"data/vaneerConsumption/RunawayHorseCrashesIntoNYCTaxiPolice.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/498391/140609-runaway-horse-central-park-jms-2327_04fdbbf60965c9258ee20b96a50ac1ad.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_runaway-horse-crashes-nyc-taxi-police-n127046_1540247330.html","title":"Runaway Horse Crashes Into NYC Taxi: Police","title_page":"Runaway Horse Crashes Into NYC Taxi: Police","title_rss":"NULL","source_domain":"nbcnews.com","text":"Pumpkin took off near 59th Street and ran his entire route through Central Park, the equivalent of the Kentucky Derby, according to Hansen. He was slowing down near the zoo off Fifth Avenue when a bicyclist jumped into the driver's seat to try to stop him. It only caused the horse to speed up, slamming the carriage into a taxicab on Central Park South.\nWilliam Paul, a tourist from Florida, witnessed the cyclist trying to steer Pumpkin to the side of the street before the horse crashed into the side of taxi and came to a stop.\n\"The horse was very frightened and shaky,\" he said.\nNo one was hurt, and Pumpkin is expected to be OK. But the unusual scene provided a platform for both supporters and opponents of the horse-drawn carriage industry to reiterate their positions and to clash at times.\n\"Thank God no one was hurt this time, but what is it going to take for people to see that horses do not belong in New York City traffic?\" said Allie Feldman of NYCLASS, an advocacy group that opposes horse-drawn carriages.\nMayor de Blasio vowed to end horse-drawn carriages in Central Park when he was elected, and wants to replace them with old-timey electric cars. He has been met with resistance from carriage-horse operators and their allies, and the City Council has not yet introduced legislation banning the carriage horses.","url":"https://www.nbcnews.com/news/us-news/runaway-horse-crashes-nyc-taxi-police-n127046"}
