{"authors":["Sophie Borland Health Correspondent For The Daily Mail"],"date_download":"2018-10-23 02:21:50","date_modify":"2018-10-23 02:21:50","date_publish":"2016-01-29 16:54:19","description":"The Food Standards Agency is set to change its official advice after scientists concluded the risk of contracting salmonella from UK eggs is now 'very low'.","filename":"data/vaneerConsumption/RunnyeggsAREsafeSalmonellathreatisnowsolowthatevenpregnantwomencanenjoy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B4268F00000578-0-image-a-88_1454086042119.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3423138_Runny-eggs-safe-Threat-salmonella-low-pregnant-women-dip-soldiers-again_1540261310.html","title":"Runny eggs ARE safe! Salmonella threat is now so low that even pregnant women can enjoy","title_page":"Runny eggs ARE safe! Salmonella threat is now so low that even pregnant women can enjoy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pregnant women will to be told they can enjoy runny eggs again as the risks of salmonella have been almost eliminated.\nFor almost 30 years they have been urged to avoid all raw or undercooked eggs – including home-made mayonnaise, mousse and hollandaise sauce.\nBut a year-long review by a panel of Government scientists has concluded that the risks of contracting salmonella from UK eggs is now ‘very low.’\nIt states that pregnant women, the elderly and toddlers can safely enjoy eggs with runny yolks as long as they have British Lion kitemark on their shell.\nPregnant women can enjoy runny eggs again as the risk of salmonella from UK eggs is now 'very low'\nThis covers almost 90 per cent of eggs produced in this country including those from major supermarkets.\nBut they should avoid eating runny eggs from smaller stores or at restaurants and cafes, which may not be British Lion approved.\nThe scientists have told the Food Standards Agency to change its official advice and this is expected to be updated within the next few months.\nPregnant women, the elderly, infants and anyone with long-term illnesses have been advised to avoid raw or runny eggs ever since the salmonella scare in 1988.\nAt the time, the Government was so worried about the risks that they told all members of the public to only eat them if properly cooked\nPregant women can safely enjoy eggs with runny yolks as long as they have British Lion kitemark\nAnd sales of eggs fell off a cliff almost overnight when former Health Minister Edwina Currie warned that most of those from British hens were infected with salmonella.\nThe Government changed its advice in 1998 and said runny eggs were safe for most adults and children.\nBut pregnant women, the elderly and young children were urged to continue to avoid them as there was still a small risk of salmonella.\nThis is caused by bacteria living in the hens and can be extremely serious in pregnancy leading to miscarriage or premature labour.\nIt isn’t normally serious for otherwise healthy adults and children but in rare cases can be fatal for the elderly or toddlers.\nThe report by the Government’s Advisory Committee on the Microbiological Safety of Food states: ‘The Working Group is in agreement that there has been a major reduction in the microbiological risk from Salmonella in UK shell eggs from hens since the 2001 report.\n‘The very low risk level means that eggs produced under the Lion Code, or produced under demonstrably equivalent comprehensive schemes, can be served raw or lightly cooked to all groups in society, including those that are more vulnerable to infection, in both domestic and commercial settings, including care homes and hospitals.’\n‘The group’s view is that this is especially the case for those eggs produced under the Lion Code Scheme, which comprises a suite of measures including: vaccination, a cool chain from farm to retail outlets, enhanced testing for Salmonella, improved farm hygiene, better rodent control, independent auditing, date stamping on the eggs and traceability.’\n1988: THE EDWINA EFFECT Cases of salmonella caught from British eggs rose sharply in the 1980s In December 1988 health minister Edwina Currie outraged producers by warning that most British eggs were infected Sales plummeted by 60 per cent and did not recover for several years In 1998 the egg industry reinstated the British Lion stamp on shells signifying producers had vaccinated hens against salmonella and performed other checks A 2004 study of 28,000 British eggs by the Foods Standards Agency found none contained salmonella Now 11.8billion eggs are eaten in Britain every year and consumption is rising\n‘The Group recommends that the Food Standards Agency considers amending its advice on eggs in the light of the above.’\nDr Juliet Gray, a registered nutritionist based in Guildford, Surrey, pointed out that eggs are a vital source of protein and women which are particularly important for pregnant women and the elderly.\n‘Eggs are highly nutritious, containing key nutrients including high quality protein, vitamin D, selenium, choline and omega-3 fatty acids, several of which are not found in many other foods.\n‘These nutrients are particularly important for many vulnerable groups, including pregnant women, babies and older people.’ She said:\nThe nutrient content is the exactly the same for hard-boiled eggs but many prefer yolks runny for dipping in soldiers.\nAndrew Joret, chairman of the British Egg Industry Council said: ‘We have been confident for some time that the safety record of British Lion eggs means that vulnerable groups such as pregnant women, babies and elderly people should be able to consume them when runny.\n‘We know that many people in these groups, such as older people in care homes, would love to enjoy a traditional soft-boiled egg again.'","url":"https://www.dailymail.co.uk/health/article-3423138/Runny-eggs-safe-Threat-salmonella-low-pregnant-women-dip-soldiers-again.html"}
