{"authors":["Emily Dixon"],"date_download":"2018-10-31 00:02:22","date_modify":"2018-10-31 00:02:22","date_publish":"2018-10-28 16:04:37","description":"Ever imagined an unsettling amalgam of Ron Weasley and a young Orson Welles? Imagine no more: your vision has been realised in the first official photo of Rupert Grint's The ABC Murders character, published in the Radio Times ahead of the Christmas…","filename":"data/vaneerConsumption/RupertGrintsTheABCMurdersCharacterLooksAbsolutelyNothingLikeRonWeasley.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/4ec3788a-afdf-43e4-a4d9-a45d470ec692-getty-631629928.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_rupert-grints-the-abc-murders-character-looks-absolutely-nothing-like-ron-weasley-13009440_1540944142.html","title":"Rupert Grint's 'The ABC Murders' Character Looks Absolutely Nothing Like Ron Weasley","title_page":"Rupert Grint's 'The ABC Murders' Character Looks Absolutely Nothing Like Ron Weasley","title_rss":"NULL","source_domain":"bustle.com","text":"Ever imagined an unsettling amalgam of Ron Weasley and a young Orson Welles? Imagine no more: your vision has been realised in the first official photo of Rupert Grint's The ABC Murders character, published in the Radio Times ahead of the Christmas release of the BBC Agatha Christie adaptation. Grint will play Inspector Crome, the magazine reports, alongside John Malkovich's take on the iconic detective Hercule Poirot. And going off the photo alone, the scowling Crome doesn't seem like the most pleasant of characters — less Ron Weasley, more pre-heartbreaking backstory Professor Snape.\nThe ABC Murders is another Christie adaptation by writer Sarah Phelps, who also created 2015's And Then There Were None and this year's Ordeal by Innocence. The three-part series already boasts a pretty stellar cast: alongside Grint and Malkovich, Broadchurch's Andrew Buchan, Twin Peaks' Eamon Farren, Game of Thrones star Tara Fitzgerald, Harlots actor Bronwyn James, and Skins alumnus Freya Mavor will appear.\nChristie's murder mystery, first published in 1936, takes place in 1930s Britain, as fascism spreads inexorably across Europe. According to the BBC, Phelps' adaptation will stay true to the period setting, depicting \"a time when the nation is dangerously divided and suspicion and hatred are on the rise.\"\nDetective Poirot is faced with a curiously specific killer, who signs a letter \"A.B.C.\" The murderer strikes in Andover, then Bexhill, then Churston, targeting victims with corresponding initials (Ascher, Barnard, Clarke). At each crime scene, they leave a copy of The ABC Railway Guide. The final murder takes place in Doncaster — but their surname doesn't begin with D. (Why would you establish then disregard a perfectly clear pattern, murderer?)\nThe case proves unusually perplexing for Poirot, whose target appears to be taunting him as they continue to evade capture. Wikipedia might not satisfy the spoiler-hungry, however — as the Radio Times notes, writer Sarah Phelps isn't afraid to stray from her source when adapting Christie. The TV miniseries Ordeal by Innocence went so far as to change the murderer from the original novel, so there's no guarantee that Christie's culprit in The ABC Murders will match Phelps'.\n\"Set in the seething, suspicious early 1930s, The ABC Murders is a brutal story of violence and lies, the long shadow of the past and the slaughter to come,\" said Phelps in a BBC press release. \"At its centre, one of the most familiar, famous characters in crime fiction. We may all think we know Poirot but do we really know Hercule?\"\nCharlie Gray/BBC/Mammoth Screen\nRupert Grint's character, Inspector Crome, is a police officer initially assigned to the case, who proves hostile and suspicious towards Poirot and his investigative techniques. Pretty much the exact opposite of Ron Weasley, loyal comrade and number one Harry Potter cheerleader, then. Perhaps Grint will draw on that bleak period in Harry Potter and the Deathly Hallows when Ron wears the locket and transforms into peak moody adolescent?\nThere's no specific air date for the BBC's The ABC Murders as of yet; as mentioned above, the series is slated for release around Christmas. And there's six more Christie adaptations on the way, too, thanks to a deal between the BBC and Agatha Christie Limited. Can I please petition for a Harry Potter star to appear in every series?","url":"https://www.bustle.com/p/rupert-grints-the-abc-murders-character-looks-absolutely-nothing-like-ron-weasley-13009440"}
