{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 01:32:09","date_modify":"2018-10-23 01:32:09","date_publish":"2017-03-16 11:38:08","description":"The Culture Secretary has been under acute pressure to refer 21st Century Fox's £11.7billion takeover of Sky to Ofcom and the Competition and Markets Authority.","filename":"data/vaneerConsumption/RupertMurdochsbidtobuySkyWILLbesenttoregulators.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53CDCE00000578-0-image-a-8_1489664249619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319818_Rupert-Murdoch-s-bid-buy-Sky-sent-regulators_1540258329.html","title":"Rupert Murdoch's bid to buy Sky WILL be sent to regulators","title_page":"Rupert Murdoch's bid to buy Sky WILL be sent to regulators | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rupert Murdoch's bid to buy all of Sky will be sent to regulators for detailed probing, Karen Bradley confirmed today.\nMs Bradley told MPs submissions from 21st Century Fox and Sky had not ended her concerns over competition and broadcasting standards, prompting her to send out the bid.\nOfcom and the Competition and Markets Authority now have until May 16 to study the deal, including carrying out a 'fit and proper person test' on the Murdochs.\nMr Murdoch's Fox announced its £11.7billion bid to buy the 61 per cent of Sky it does not own in December.\nThe Culture Secretary has since been under acute pressure to send out the merger which is bitterly opposed by campaigners who believe Mr Murdoch has too much control over the UK media.\nAn earlier deal collapsed in 2010 in the aftermath of the phone hacking scandal.\nKaren Bradley has confirmed Rupert Murdoch's bid to buy all of Sky will be sent out to regulators for investigations into broadcasting standards and media competition\nLast week, Fox said it 'welcomes a thorough and thoughtful regulatory review' into its planned £11.7billion takeover of broadcaster Sky.\nMs Bradley said earlier this month she was likely to intervene but invited the two companies to send her written submissions on their plans.\nAnnouncing her decision to MPs today, Ms Bradley said: 'While the representations from 21st Century Fox highlighted areas where it contested the position taken in my minded to letter, none of the representations have lead me to dismiss the concerns I have regarding the two public interest grounds I previously specified.\n'I am of the view that it remains both important, given the issues raised, and wholly appropriate for me to seek comprehensive advice from Ofcom on these public interest considerations and from the CMA on jurisdiction issues.'\nMs Bradley's decision was welcomed by Labour deputy leader Tom Watson, who has led campaigns against Mr Murdoch.\nHe said: 'Can you confirm in your view the broadcasting standard ground for referral gives Ofcom the power to investigate any corporate governance issue affecting 21st Century Fox, including around the phone hacking scandal, any cover up of illegality at News International, the rehiring of people responsible for governance failures and on going sexual harassment claims in the United States?'\nFOX BUYS SKY: WHAT HAPPENS NOW? The Culture Secretary today issued a public interest intervention notice (PIIN) over the Fox-Sky merger. The media regulators will now spend up to 40 days carrying out a public interest test on the proposed deal, including a review of whether the holder of the broadcast licence is a 'fit and proper person'. If it has concerns, Ms Bradley will have to ask Fox to address any issues, and decide whether to accept what they suggest. A rejected compromise would send the bid to the Competition and Markets Authority for full review, which could take up to six months. After their scrutiny, Ms Bradley will have 30 days to block, approve or approve the deal with conditions. The European Commission could also take a look at the deal on competition grounds. Assuming the deal passes again, it will eventually be put to a vote of Sky shareholders.\nMs Bradley replied: 'Corporate governance is one of the issues I am referring the matter to Ofcom and therefore I would expect them to look at it.\n'But clearly, it is an independent regulator. I have made the decision to refer to Ofcom but it is for Ofcom to decide what evidence they want to look at.\n'They are open to look at whatever evidence they feel is appropriate.'\nA 21st Century Fox spokesperson said it was keen to co-operate with the investigation and it was confident that the merger will be approved.\nThe spokesperson said: 'We are confident that a thorough review of our track record over 30 years will underscore our commitment to upholding high broadcast standards, and will demonstrate that the transaction will not result in there being insufficient plurality in the UK.\n'The media market has changed dramatically in recent years, as has our business.\n'We believe our proposed £11.7 billion investment will benefit the UK's creative industries.\n'We look forward to continuing to work with all stakeholders and are confident that the transaction will be approved.'\nA Sky spokesman said: 'Sky notes the announcement by the Secretary of State for Culture, Media and Sport regarding 21st Century Fox's proposal to acquire the shares in Sky that it does not already own.\n'The Secretary of State has asked Ofcom to investigate whether such a takeover would raise public interest considerations in respect of media plurality and commitment to broadcasting standards. Ofcom is to submit a report by 16 May 2017.'\nRupert Murdoch's 21st Century Fox has said it 'welcomes a thorough and thoughtful regulatory review' into its planned £11.7 billion takeover of broadcaster Sky, the company said\nEarlier this month Ms Bradley (pictured) warned Fox said she was likely to intervene to see if any one company would control too much of Britain's media\nFormer Labour leader Ed Miliband warned that if the takeover is allowed to go ahead, it will strengthen the Murdoch empire's already 'untrammelled power'.\nHe said: 'Many of us believe that if you look at the conduct of the Murdochs and the untrammelled power they already have, it is not in the public interest for them to take over Sky and have full control.'\nWHAT WILL MURDOCH AND FOX OWN? In 2013, following the closure of the News of the World, the media mogul split his businesses and Fox then acquired the Sky stake. The New York-based company now owns a 39 per cent stake in Sky. Sky has 22million customers across five countries - the UK, Ireland, Germany, Italy and Austria. It has annual revenues of more than £11billion and is Europe's leading investment of television content. The company has a programming budget of £4.9billion. It paid £4.2billion for the rights to show Premier League football for three years from the 2016/17 season. It also has a deal with HBO - a huge network in the US - to exclusively show a number of television series, including Game of Thrones. Sky's revenues rose by seven per cent to nearly £12bn earlier this year.\nHe also urged Ms Bradley to give Ofcom more time to consider if Mr Murdoch and his family are 'fit and proper' owners, if they ask for it.\nFormer Tory culture secretary John Whittingdale said: 'While it is clearly sensible to ask the regulator to examine this bid, will you recognise that this transaction represents an £11.7 billion investment by an international company into a British broadcaster, and as such is a fantastic vote of confidence that the UK will remain an international centre of broadcasting long after we leave the European Union?'\nMs Bradley agreed, saying it shows the UK is 'global Britain' and will remain 'open for business'\nIn its initial response to Ms Bradley last week, Fox said it did not believe the deal would result in 'insufficient plurality' in the UK media.\nIt said: '21CF welcomes a thorough and thoughtful regulatory review. We believe this transaction is in the interest of the UK, its creative economy and its consumers.\n'For the past 30 years, 21CF and Sky have been broadcasters of good standing in the UK, a responsibility we take seriously.\n'The UK has a thriving creative and media sector that is becoming increasingly more plural and we are confident that this transaction would not result in there being insufficient plurality in the UK.\n'We will continue to work with all relevant regulatory authorities in assisting their reviews.'\nIn its submission to Ms Bradley, Fox took issue with what it said were serious flaws in the process that led to the minister saying she was 'minded' to refer the deal for a full investigation.\nWhile Fox said it would welcome a thorough regulatory review, it questioned the government's analysis of Murdoch's influence on the media market.\nThe company claimed the circulation of his newspapers had fallen and they were now held in a separate company.\nIt also rejected any suggestion Fox had a weaker record than Sky when it came to broadcasting standards and said it had learnt from the mistakes made in the past.\nIn a letter, it said: 'Twenty First Century Fox takes compliance matters extremely seriously and is proud of the transformation of its corporate governance and of the arrangements it has put in place since that time.'\nFox said it would welcome a decision whether to refer the bid to regulators as soon as possible, adding it was prepared to begin working with the regulatory bodies at the earliest opportunity.","url":"https://www.dailymail.co.uk/news/article-4319818/Rupert-Murdoch-s-bid-buy-Sky-sent-regulators.html"}
