{"authors":["Jason Chester For Mailonline"],"date_download":"2018-10-23 01:32:55","date_modify":"2018-10-23 01:32:55","date_publish":"2017-03-10 09:51:04","description":"Grint, 28, looked delighted after reuniting with the 26-year old actress some five years after their final screen appearance as wizarding siblings Ron and Ginny Weasley.","filename":"data/vaneerConsumption/RupertGrintisreunitedwithBonnieWrightinLosAngeles.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E22036800000578-0-image-a-56_1489139122963.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300488_Rupert-Grint-reunited-Bonnie-Wright_1540258375.html","title":"Rupert Grint is reunited with Bonnie Wright in Los Angeles","title_page":"Rupert Grint is reunited with Bonnie Wright in Los Angeles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rupert Grint delighted Harry Potter fans on Thursday evening by reuniting with his former screen-sister at the launch of his latest show.\nThe British actor crossed paths with old friend Bonnie Wright following a premier screening of gritty crime-drama Snatch at Arclight Cinema in Los Angeles.\nGrint, 28, looked delighted after reuniting with the 26-year old actress some five years after their final screen appearance as wizarding siblings Ron and Ginny Weasley in Harry Potter and the Deathly Hallows – Part 2.\nScroll down for video\nMagical: Rupert Grint delighted Harry Potter fans on Thursday evening by reuniting with former screen-sister Bonnie Wright at the launch of new show Snatch in Los Angeles on Thursday evening\nSporting a smart charcoal two-piece over a flamboyantly patterned shirt, the actor looked suitably smart as he celebrated the launch of Snatch – a 10 episode show inspired by director Guy Richie’s hugely successful 2000 film of the same name.\nThe movie was set in the London criminal underworld and dealt with the theft of a stolen diamond, gambling, professional fighting and gangsters.\nNow the cult classic - which featured actors Jason Statham, Vinnie Jones and Brad Pitt - is a high-stakes, high-octane original series on Crackle.\nThen and now: Grint, 28, looked delighted after reuniting with the 26-year old actress some five years after their final screen appearance as wizarding siblings Ron and Ginny Weasley\nMain man: Sporting a smart charcoal two-piece over a flamboyantly patterned shirt, the actor looked suitably smart as he celebrated the launch of Snatch – a 10 episode show inspired by director Guy Richie’s hugely successful 2000 film of the same name\nGrint stars as the dynamic and chaotic Charlie Cavendish in the show, alongside the likes of Luke Pasqualino, Lucien Laviscount and Ed Westwick.\nThe plot is inspired by a real-life heist in London, and the series tells the story of a group of twenty-somethings, up and coming hustlers who stumble upon a truck of stolen gold bullion and are suddenly thrust into the high-stakes world of organised crime.\nSupporting her former co-star, Bonnie opted for a smart casual ensemble comprised of loose fitting blouse and pleated dress trousers.\nLeading the way: The actor was accompanied by his Snatch co-stars on Thursday evening - (L-R) Rupert Grint, Lucien Laviscount, Phoebe Dynevor and Luke Pasqualino\nHow it was: Bonnie, on hand to support her former co-star, won international stardom thanks to her role as wizard student Ginny Weasley\nSide by side: Dougray Scott and Tamer Hassan were also on hand to celebrate the launch of their new show\nPucker up: The pair enjoyed a playful red carpet kiss as they made an entrance at Arclight Theatre\nSay cheese: Luke Pasqualino and Rupert Grint feature prominently in the forthcoming new dram\nSnatch co-stars Luke Pasqualino, Dougray Scott and Tamer Hassan were also on hand to promote the series, with Hassan offering Scott a playful kiss as they made their way inside.\nOn a male heavy night actress Phoebe Dynevor added some much needed glamour to proceedings by opting for a stylishly embellished semi-sheer evening dress.\nSnatch will be available online from March 16.\nArresting sight: Phoebe Dynevor added a touch of glamour to proceedings\nHere come the girls: The Snatch star was joined by Madison Giovanni at the premier launch party on Thursday evening\nPlenty to smile about: (L-R) Eric Berger, EVP and General Manager of Digital for Sony Pictures Television, Rupert Grint and Andy Kaplan, President of Worldwide Networks for Sony Pictures Television\nShady: Grint's new role is worlds away from his career beginnings as Harry Potter sidekick Ron Weasley\nRed carpet ready: Sean Teale and Phoebe Dynevor ensured their new show enjoyed a successful launch\nAll together now: The cast and crew gathered for a group shot on Thursday evening. The new show will be available online from March 16","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300488/Rupert-Grint-reunited-Bonnie-Wright.html"}
