{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 17:58:44","date_modify":"2018-10-30 17:58:44","date_publish":"2016-03-03 02:43:56","description":"Conservative radio host Rush Limbaugh said Wednesday Donald Trump continues to offer public support of Planned Parenthood because he is already “running a national presidential campaign” and “already thinks in terms of being the nominee.” |","filename":"data/vaneerConsumption/RushLimbaughonDonaldTrumpsSupportforPlannedParenthoodHesRunningaNationalCampaign.json","image_url":"https://media.breitbart.com/media/2015/08/Donald-Trump-AP-L-and-Rush-Limbaugh-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_02__1540922324.html","title":"Rush Limbaugh on Donald Trump’s Support for Planned Parenthood: He’s ‘Running a National Campaign’","title_page":"Rush Limbaugh on Donald Trump’s Support for Planned Parenthood: He’s ‘Running a National Campaign’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Conservative radio host Rush Limbaugh said Wednesday Donald Trump continues to offer public support of Planned Parenthood because he is already “running a national presidential campaign” and “already thinks in terms of being the nominee.”\nLimbaugh said:\n“They do great health things for women!” He acknowledges abortion’s no way. “We’re gonna defund ’em because of that,” but he… Folks, he’s running a national campaign here, and he’s talking about broadening the base. Last night he said, “We’re gonna unify.” Last night he acknowledged a point that I’ve been trying to make everybody here for weeks now, and that is that he has put together a coalition that’s way beyond the Republican base. It’s way beyond a conservative Republican base.\nLimbaugh was responding to Trump’s comments during a press conference Tuesday night following his victories on Super Tuesday. A reporter asked Trump about his support for Planned Parenthood – that the organization helps “millions and millions of women” and does “some good work.” While Trump has said he would eliminate Planned Parenthood’s taxpayer funding as long as it continues to perform abortions, he nevertheless has continued his praise of the organization.\nDuring his press conference, a reporter asked Trump, “Are you trying to inject your tone into a more general election…?”\nTrump replied:\nI’m just doing what’s right. Look, Planned Parenthood has done very good work for some — for many, many — for millions of women. And I’ll say it and I know a lot of the so-called conservatives, they say that’s really — because I’m a conservative, but I’m a common-sense conservative. But millions of women have been helped by Planned Parenthood. But we’re not going to allow and we’re not going to fund as long as you have the abortion going on at Planned Parenthood, and we understand that and I’ve said it loud and clear. But — and we’ll see what happens. But Planned Parenthood — millions of people — and I’ve had thousands of letters from women that have been helped. And this wasn’t a setup. This was people writing letters. I’m going to be really good for women. I’m going to be good for women’s health issues. It’s very important to me, very important to me. (APPLAUSE) And maybe that’s not a perfect conservative view, but I can tell you one thing. I’m more conservative than anybody on the military, on taking care of our vets, on the border, on the wall, on getting rid of Obamacare and coming up with something much, much better, and certainly, getting rid of Common Core and bringing education to a local level so that you’re going to have good education for our children who are being absolutely starved for proper education.\nLimbaugh’s analysis:\nOnce again he comes up with Planned Parenthood. He gets a question about Planned Parenthood, and he’s not wavering from this. And people are misunderstanding what’s happening. In the South Carolina debate I was taken aback when I saw Trump go on and on about Planned Parenthood. That was the debate where he accused Bush of knowing in advance of 9/11, knowing that there were no weapons of mass destruction, I mean, all this stuff that left-wingers say, the radical left wingers say, Trump’s out there saying it, and then I realized what’s going on, it’s an open primary, Democrats can cross over and vote… All that stuff that happened in the South Carolina primary, I think what it means is that Trump already thinks in terms of being the nominee. I think he’s been running a national presidential campaign for a while now. In other words, I think he’s been focused on Hillary. I don’t think his real focus has just been on Cruz or Jeb or Rubio.\nLimbaugh added that when Trump responded to the reporter’s question on Planned Parenthood, “He kind of gave something away.”\n“He talks about, ‘Yeah, so-called conservatives,’ and then he caught himself,” he continued, adding:\n[C]learly he’s got some discomfort, problems with rock-ribbed — I mean, super-serious — ideological conservatives, much like the Republican establishment does, by the way. That’s what makes ’em nervous about Cruz. “Nobody’s that way! Nobody’s this earnest and ideological in everything they say or do. It makes us uncomfortable,” they say.\nTrump continues to say that – if elected president – he will eliminate Planned Parenthood’s taxpayer funding as long as it performs abortions. He has quoted Planned Parenthood as saying that only three percent of its services are abortions. Though that percentage has been debunked many times by others, Planned Parenthood’s own CEO and president – Cecile Richards – admitted last week, “The abortion part of Planned Parenthood is an important part of what we do.”","url":"https://www.breitbart.com/politics/2016/03/02/rush-limbaugh-on-donald-trumps-support-for-planned-parenthood-hes-running-a-national-campaign/"}
