{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:06:21","date_modify":"2018-10-30 21:06:21","date_publish":"2016-11-02 10:43:53","description":"Russia seeks \"honest cooperation\" for a political solution in Syria, Foreign Minister Sergei Lavrov said on Wednesday.","filename":"data/vaneerConsumption/RussiaSeeksHonestCooperationinSyriaLavrov.json","image_url":"https://media.breitbart.com/media/2016/10/Russian-Foreign-Minister-Sergey-Lavrov-meeting-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_11_02__1540933581.html","title":"Russia Seeks 'Honest' Cooperation in Syria: Lavrov","title_page":"Russia Seeks 'Honest' Cooperation in Syria: Lavrov","title_rss":"NULL","source_domain":"breitbart.com","text":"ATHENS (AFP) – Russia seeks “honest cooperation” for a political solution in Syria, Foreign Minister Sergei Lavrov (pictured) said on Wednesday as Moscow declared a brief truce in the war-ravaged city of Aleppo.\n“We hope our partners will draw (the) necessary conclusions (so that) we will all aim for honest cooperation… for a political process involving both the government and opposition forces,” Lavrov said at the start of an official visit to Greece.\nHowever, he insisted that Washington help enforce a United Nations Security Council resolution condemning support for extremist groups in Syria.\n“When we adopted this resolution, I remember US Secretary of State John Kerry’s words. He said: ‘Whoever wants to be part of (the political) process must sever links to terrorists’,” Lavrov said through a translator.\n“Almost a year has passed and we await these words to be carried out,” he added.\nRussia has accused the US-led coalition of failing to rein in hardline Syrian rebels, warning that the chances of a political settlement to the crisis was now remote.\nIn turn, the West has accused Moscow of committing possible war crimes in Aleppo through indiscriminate bombing to support a brutal Syrian government offensive.\nMoscow has been conducting a bombing campaign in Syria in support of long-time ally Bashar al-Assad since September 2015.\nMore than 300,000 people have been killed since Syria’s war devolved from a widespread protest movement against Assad’s rule in March 2011 to a multi-front war between rebels, jihadists, Kurds and regime forces.","url":"https://www.breitbart.com/middle-east/2016/11/02/russia-seeks-honest-cooperation-syria-lavrov/"}
