{"authors":["Associated Press"],"date_download":"2018-10-23 04:16:35","date_modify":"2018-10-23 04:16:35","date_publish":"2016-01-11 17:18:37","description":"BELGRADE, Serbia (AP) — Russia is ready to arm its Balkan ally Serbia with sophisticated weapons, the Russian deputy prime minister said Monday, which could ...","filename":"data/vaneerConsumption/RussiareadytoarmBalkanallySerbia.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394267_Russia-ready-arm-Balkan-ally-Serbia_1540268195.html","title":"Russia ready to arm Balkan ally Serbia","title_page":"Russia ready to arm Balkan ally Serbia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Russia ready to arm Balkan ally Serbia\nBELGRADE, Serbia (AP) — Russia is ready to arm its Balkan ally Serbia with sophisticated weapons, the Russian deputy prime minister said Monday, which could be at odds with Belgrade's desire to join the European Union.\nDmitry Rogozin said in Belgrade that \"we are ready to directly support our Balkan ally\" in the purchase of weapons, including the S300 surface-to-air missile system.\n\"We will consider (Serbia's) request in the shortest possible period,\" Rogozin said.\nSerbia and Balkan rival Croatia, a NATO member, have recently clashed over alleged Croatian plans to acquire long-range missiles that could strike Serbia. The two neighbors were at war in the 1990s.\nSerbia's prime minister, Aleksandar Vucic, told a joint news conference that Serbia will remain militarily neutral, but won't allow itself to become \"an easy target.\"\nSerbia, traditionally a Russian ally, has officially sought EU membership, but has been struggling to overcome strong opposition from pro-Kremlin nationalists. So far, Serbia has resisted pressure from the EU to join in sanctions against Russia.\nMany Western officials fear that increasing Russia's political, economic and military role in Serbia and a Serb-controlled part of Bosnia could destabilize the Balkans, which is still reeling from wars in the 1990s. Serbs are seen as the last true Russian allies in the southeastern European region.","url":"https://www.dailymail.co.uk/wires/ap/article-3394267/Russia-ready-arm-Balkan-ally-Serbia.html"}
