{"authors":["Penny Starr"],"date_download":"2018-10-30 19:11:18","date_modify":"2018-10-30 19:11:18","date_publish":"2018-07-15 20:47:59","description":"John Podesta said the indictment of Russians for hacking the DNC email in the 2016 presidential election means they were listening to Trump.","filename":"data/vaneerConsumption/RussiansListenedtoTrump.json","image_url":"https://media.breitbart.com/media/2018/06/AP_17033194040366-e1527877223746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_15__1540926678.html","title":"Russians Listened to Trump","title_page":"John Podesta on DOJ Indictment for DNC Hack: Russians Listened to Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"John Podesta, manager for the failed 2106 Hillary Clinton presidential campaign, said the announcement Friday that Department of Justice (DOJ) Special Counsel Robert Mueller’s prosecutors had secured an indictment against 12 or more Russian nationals for hacking the Democratic National Committee’s (DNC) email during the race proved the Russians were “listening” to then-presidential candidate Donald Trump.\nAt a July 27, 2016, press conference now-President Donald Trump referenced the 30,000 emails that appeared to be missing in the midst of the investigation of candidate Clinton’s scandal over using her personal email server while serving as Secretary of State.\n“I will tell you this, Russia: If you’re listening, I hope you’re able to find the 30,000 emails that are missing,” Trump said at the press conference in Florida.\nOn National Public Radio’s (NPR) Weekend Edition Saturday, host Renee Montagne asked Podesta about the indictments.\n“Well, let me ask you something. Have you learned from these indictments something that’s new to you?” Montagne asked.\n“Well, I think that the—in terms of the individual case involving me, the answer to that is no,” Podesta said, adding, “We did not know that the very day that Donald Trump on the campaign trail asked the Russians to hack Hillary Clinton’s computers, that’s the first day they actually went ahead and looked at her personal domain and tried to attack her personal computers.”\n“That was a brand-new fact,” Podesta said. “It happened on July 27, 2016.”\n“And, you know, that indicates I guess that the Russians were actually listening to Donald Trump when he was—when people thought he was just using some of his usual antics on the stage,” Podesta said. “They were listening to him.”\n“They responded to him,” Podesta said. “They carried out a broad-based attack on our democracy, including the hacking, obviously.”\nBreitbart News reported that, as was the case in Mueller’s previous indictment against Russians, there is no evidence of “collusion” with any American in any of the defendants’ alleged crimes, as Rosenstein emphasized in his announcement on Friday. Further, there was not any allegation the Russian intelligence officers’ alleged crimes in any way affected the outcome of the 2016 presidential election.\n“There is no allegation in this indictment that any American citizen committed a crime,” Rosenstein told reporters. “There’s no allegation that the conspiracy changed the vote count or affected any election result.”\nFollow @PennyStarrDC on Twitter","url":"https://www.breitbart.com/politics/2018/07/15/john-podesta-doj-indictment-dnc-election-hack-russians-listened-donald-trump/"}
