{"authors":["Frances Martel"],"date_download":"2018-10-30 18:30:39","date_modify":"2018-10-30 18:30:39","date_publish":"2018-07-19 16:39:41","description":"State Department spokeswoman Heather Nauert sharply rebuked the Russian government during Wednesday's regular press briefing.","filename":"data/vaneerConsumption/RussiasResponsetoIndictmentsAbsurd.json","image_url":"https://media.breitbart.com/media/2018/07/wi/ap/19/1f9c38_trump-69164-donald-trump-patrick-shanahan-president-donald-trump-gestures-e1532017959970.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_19__1540924239.html","title":"Russia's Response to Indictments 'Absurd,'","title_page":"State Department: Russia's Response to Indictments 'Absurd,'","title_rss":"NULL","source_domain":"breitbart.com","text":"State Department spokeswoman Heather Nauert sharply rebuked the Russian government during Wednesday’s regular press briefing, calling Moscow’s response to election meddling allegations “absurd” and insisting that the two countries did not come to any agreements at this week’s Helsinki summit.\nShortly before President Donald Trump and his Russian counterpart Vladimir Putin met on Monday, Deputy Attorney General Rod Rosenstein announced that the Department of Justice would indict 12 people as part of the investigation into the hacking of Democratic National Committee (DNC) members and Hillary Clinton campaign staffers in 2016. All 12 were Russian nationals and none are known to have used any relationships with Americans to commit their crimes. The Russians are members of the Russian intelligence community; few expect Putin to extradite them.\nInstead, Putin suggested during a press briefing following the meeting with Trump that he would allow American intelligence and law enforcement personnel to question the indicted individuals if the United States would allow Russian officers to interrogate American citizens “who have something to do with illegal actions in the territory of Russia,” according to the Hill.\n“There was some conversation about it, but there wasn’t a commitment made on behalf of the United States,” White House press secretary Sarah Huckabee Sanders said about the proposal, in response to a question at her regular briefing.\nNauert took a much harsher tone against the Russian government.\n“The overall assertions that have come out of the Russian Government are absolutely absurd—the fact that they want to question 11 American citizens and the assertions that the Russian Government is making about those American citizens,” Nauert said on Wednesday, shortly after Huckabee Sanders’ comments. “We do not stand by those assertions that the Russian Government makes. The prosecutor general in Russia is well aware that the United States has rejected Russian allegations in this regard.”\n“Instead, we continue to urge Russian authorities to work with the U.S. Department of Justice to pursue those in Russia who in fact perpetrated the fraudulent scheme that Russia refers to,” Nauert added.\nNauert noted, however, that some of the final decisions on the agreement would fall to the Department of Justice, not the Department of State.\nNauert also responded to the Russian government’s claim that Trump and Putin arrived at “agreements” that would soon be implemented. Trump and Putin did not sign any public joint statement or appear to agree on any particular commitments, but Russian Ambassador to the United States Anatoly Antonov told Russian television that both sides were gearing up to ensure that the unspecified agreements come to at the summit would be implemented.\n“It was an important meeting. It was meaty, productive and constructive. I think important oral agreements were reached,” Antonov said, according to the Russian news outlet TASS.\nNauert dismissed the idea that any concrete agreements came from the summit, instead describing them as “sort of three takeaways … three proposals that we are currently assessing.” The proposals, she noted, were:\nA high-level working group with business leaders from both countries … convening some sort of an expert council which would include political scientists from the United States and from Russia, diplomats, former diplomats, former military officials … and that our NSC meet with the Russian NSC to discuss follow-up meetings.\n“These are certainly all modest proposals,” Nauert noted.\nTrump and Putin were modest in describing what they discussed during their two-hour conversation. Among the topics brought up at the press conference following the meeting were Russia’s role in Syria—and perhaps a strategy shift from an alliance with Iran to an alliance with Israel and the United States—and Russia’s economy. Trump specifically warned Putin that the United States would be actively competing against Russian natural gas companies for their business, particularly in Germany, where Trump has described a Russian business presence as a regional threat.\n“It is very sad when Germany makes a massive oil and gas deal with Russia, where we’re supposed to be guarding against Russia, and Germany goes and pays out billions and billions of dollars a year to Russia,” Trump said during a meeting of NATO member countries last week. “Germany is totally controlled by Russia.”\nFollow Frances Martel on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/07/19/state-department-russia-response-no-agreements-made/"}
