{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-22 23:23:45","date_modify":"2018-10-22 23:23:45","date_publish":"2016-01-29 11:03:27","description":"The Su-27 Flanker passed dangerously close to the Boeing RC-135 which was 30 miles from the Russian coast while flying over international waters. The Russian jet blasted the US aircraft with its engines as it turned away.","filename":"data/vaneerConsumption/RussianSu27jetfighterflieswithin20feetofUSsurveillancejet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/1EE4763A00000578-0-image-a-15_1454065367703.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422583_Russian-Su-27-jet-fighter-flies-20-feet-surveillance-aircraft-unsafe-unprofessional-interception-Black-Sea_1540250625.html","title":"Russian Su-27 jet fighter flies within 20 feet of US surveillance jet","title_page":"Russian Su-27 jet fighter flies within 20 feet of US surveillance jet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Russian fighter jet 'buzzed' a US surveillance aircraft passing within 20 feet when it intercepted its target over the Black Sea.\nThe Su-27 Flanker passed dangerously close to the Boeing RC-135 which was 30 miles from the Russian coast while flying over international waters.\nAccording to US officials, the Russian jet drew alongside the surveillance aircraft before turning away violently and hitting it with the jet blast from its engines.\nA Russian SU-27 Flanker, file photo, passed within 20 feet of the US surveillance aircraft on Monday\nThe Russians intercepted the Boeing RC-135, file photo, which was flying over international waters\nThis 'disturbed the controllability' of the larger aircraft.\nNavy Captain Daniel Hernandez, chief spokesman of the US European Command told the Washington Free Beacon: ' On Jan. 25 an RC-135 aircraft flying a routine route in international airspace over the Black Sea was intercepted by a Russian Su-27 in an unsafe and unprofessional manner.\n'We are looking into the issue.'\nThe Boeing RC-135 carries state-of-the-art signals intelligence equipment onboard according to the US airforce is able to 'detect, identify and geolocate signals throughout the electromagnetic spectrum'.\nAs well as three pilots and two navigators, the aircraft carries electronic warfare officers and intelligence officers.\nThe high-tech surveillance equipment enables the operators to collect mobile phone and radio data from a target area.\nThere are a rising number of complaints of Russian military aircraft flying in a belligerent fashion over international waters.\nIn October 2015, the US Navy scrambled four F/A-18s when two Russian Tu-142 Bear aircraft approached the USS Ronald Reagan aircraft carrier while it was operating off the Korean peninsula.\nThe two Russian surveillance aircraft were flying at a height of just 500 feet and did not respond to any radio messages.\nThe FA-18s intercepted the Russian aircraft when they approached within a mile of the US aircraft carrier.\nThe issue of interceptions is especially tense at present because both Russia and the United States are conducting air operations over Syria. The two nations have signed 'a memorandum of understanding' to prevent any 'accidents' while over Syrian territory.\nThe Russians have dramatically improved their anti-aircraft capability in Syria since a Turkish F-16 shot down one of their Su-24s in November 2015. The Turkish military claimed the Russian jet had encroached its airspace.","url":"https://www.dailymail.co.uk/news/article-3422583/Russian-Su-27-jet-fighter-flies-20-feet-surveillance-aircraft-unsafe-unprofessional-interception-Black-Sea.html"}
