{"authors":[],"date_download":"2018-10-30 20:28:26","date_modify":"2018-10-30 20:28:26","date_publish":"2015-11-17 09:16:21","description":"The Russian passenger plane that crashed in Egypt was brought down by a homemade bomb placed on board in a \"terrorist\" act, the head of Russia's FSB security service told President Vladimir Putin on Tuesday.","filename":"data/vaneerConsumption/RussiaConfirmsBombDidBringDownAirbusA321PlaneOverEgypt.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-495222778.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_17__1540931306.html","title":"Russia Confirms Bomb Did Bring Down Airbus A321 Plane Over Egypt","title_page":"Russia Confirms Bomb Did Bring Down Airbus A321 Plane Over Egypt","title_rss":"NULL","source_domain":"breitbart.com","text":"MOSCOW (AP) — The Russian passenger plane that crashed in Egypt was brought down by a homemade bomb placed on board in a “terrorist” act, the head of Russia’s FSB security service told President Vladimir Putin on Tuesday.\n“According to our experts, a homemade explosive device equivalent to 1 kilogram of TNT went off onboard, which caused the plane to break up in the air, which explains why the fuselage was scattered over such a large territory. I can certainly say that this was a terrorist act,” Alexander Bortnikov said.\nAll 224 people on board, most of them Russian tourists, were killed in the Oct. 31 crash.\nPutin vowed to hunt down those responsible for the attack.\n“There’s no statute of limitations for this, we need to know all of their names,” Putin said. “We’re going to look for them everywhere wherever they are hiding. We will find them in any place on Earth and punish them.”\nIS has claimed responsibility for bringing the Russian plane down in written statements, as well as video and audio messages posted on the Internet following the crash.\nIt said the attack was retaliation for Russia’s air campaign against IS — and other groups — in Syria, where Moscow wants to preserve the rule of President Bashar Assad.\nThe group warned Putin that they would also target him “at home” but did not offer any details to back its claim. While releasing specifics would add credibility, the group may be withholding either because its claim is false, or because doing so would undermine plans for similar attacks in the future — or because the aura of mystery might deepen its mystique among die-hard followers.\nIS has also claimed responsibility for Friday attacks in Paris that killed 129 people and wounded 350 others.","url":"https://www.breitbart.com/national-security/2015/11/17/russia-confirms-airbus-a321-plane-brought-down-by-bomb-over-egypt/"}
