{"authors":["Will Stewart For Mailonline"],"date_download":"2018-10-22 22:34:57","date_modify":"2018-10-22 22:34:57","date_publish":"2016-01-28 10:45:33","description":"According to official sources, Russian travellers in Turkey could be used as 'human shields' during Russian airstrikes (pictured) after being smuggled into rebel-held regions of Syria.","filename":"data/vaneerConsumption/RussiaclaimsISISisplanningtokidnaptouristsinTurkeyandexecutethem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/2E89F34900000578-0-image-a-26_1453977912292.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420711_Russia-claims-ISIS-planning-kidnap-tourists-Turkey-publicly-execute-use-human-shields-areas-targeted-Putin-air-strikes_1540247697.html","title":"Russia claims ISIS is planning to kidnap tourists in Turkey and execute them","title_page":"Russia claims ISIS is planning to kidnap tourists in Turkey and execute them | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Moscow secret services is warning that Russian tourists in Turkey are in danger of abductions and 'public executions' by jihadist group ISIS.\nTravellers could also be used as 'human shields' after being smuggled into rebel-held regions of Syria, according to official sources.\nThe claim citing 'competent agencies' in Moscow comes from Russia's Federal Agency for Tourism.\nThe agency issued a warning to Russians visiting Turkey that ISIS is planning to capture tourists in the country then move them back into its territory to be used as human shields in airstrikes (pictured)\nThe chilling warning follows the shooting down of a Russian Su-24 bomber by the Turkish air force, which has sent relations between the two countries plummeting to an all-time low\n'The leaders of the international terrorist organisation ISIS - banned in the Russian Federation - plan to take Russian citizens hostage in the Republic of Turkey,' says a statement.\n'According to the available information, these hostages may be moved to territories controlled by rebels in order to organise public executions and use the hostages as 'human shields' during combat actions with the Syrian governmental and coalition armies.\n'With this regard, we appeal to all individual tourists heading to Turkey and remind them of the necessity to take all possible measures and make sure in personal security.'\nThe chilling warning follows the shooting down of a Russian Su-24 bomber by the Turkish air force on the Syria-Turkey border in November.\nTurkey has been Russia's leading holiday destination for years but Moscow has already banned organised tours to the country over the incident.\nThe stark warning appears to be aimed at tourists on individual trips and those travelling via third countries to reach Turkey.\nNo additional information was given on the warning nor was there a direct statement from the 'competent agencies', seen as a euphemism for the security services.\nThere is currently a deep crisis in relations between Moscow and Ankara.\nRussia reintroduced entry visas for Turks and slapped sanctions on several Turkish products.\nRussia has been conducting air strikes in Syria, its ally in the region since Soviet times, since September. Turkey meanwhile is part of a parallel US-led coalition targeting jihadists in the country.","url":"https://www.dailymail.co.uk/news/article-3420711/Russia-claims-ISIS-planning-kidnap-tourists-Turkey-publicly-execute-use-human-shields-areas-targeted-Putin-air-strikes.html"}
