{"authors":["Associated Press","Karen Ruiz For Dailymail.Com"],"date_download":"2018-10-23 04:45:27","date_modify":"2018-10-23 04:45:27","date_publish":"2017-03-16 15:59:16","description":"Jeffrey Falsey, 24, has been charged with first-degree murder. He allegedly shot his mother's fiance, Dan Kulwicki, 68, during a dispute in their St Petersburg trailer in Florida.","filename":"data/vaneerConsumption/Russiadoughnutfightendedwith1deadandadeputyhurt.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/19/3E57E9C500000578-0-image-a-66_1489693293260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320832_Sheriff-Fight-doughnuts-ended-1-dead-deputy-hurt_1540269927.html","title":"Russia doughnut fight ended with 1 dead and a deputy hurt","title_page":"Russia doughnut fight ended with 1 dead and a deputy hurt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One man was killed and another was injured after a standoff that was sparked by an argument over doughnuts, investigators said.\nPinellas County Sheriff Bob Gualtieri said it began Wednesday morning when 24-year-old Jeffrey Falsey asked his mother to get him doughnuts.\nWhen Susan DiFabbio, 63, refused, her son became angry and she called the police.\nDeputies arrived at a trailer at their trailer in St Petersburg to find DiFabbio's fiance Dan Kulwicki, 68, with a gunshot wound to his head. DiFabbio had left the residence before police could arrive.\nMurder over doughnuts: Jeffrey Falsey, 24, (left) allegedly shot his mother's fiance to death, Dan Kulwicki, 68, (right) during a dispute that was sparked over doughnuts\nGualtieri said Falsey had also been angry at the fact that his mother was dating Kulwicki who was a registered sex offender and had just moved in with the family.\nBut before deputies made the gruesome discovery, they had knocked on the door and heard a voice inviting them inside.\nThe men grew suspicious and spoke from behind the door until shots rang out of the trailer sending the deputies scrambling behind cars.\nFalsey had allegedly watched the deputies from inside the trailer through a video surveillance system.\nDeputy Michael Ficocelli was shot in the leg during the rampage and was taken to a local hospital with non life-threatening injuries.\nAuthorities said at least 30 rounds were fired during the shooting.\nDeputies arrived at the doorstep of the trailer at 5157 80th Way N in unincorporated St. Petersburg and were met with gunshots allegedly fired by Falsey. Deputy Michael Ficocelli was shot in the leg during the rampage\nTwo hours later, negotiators persuaded Falsey to leave the home. Inside they found Kulwicki dead.\nThe trailer had smelled of gunpowder and a rifle, a pistol, and a semiautomatic hand gun were found in the home, authorities said.\nAll the weapons were legally owned, two of which were given to Falsey as gifts from his parents, Gualteri said.\nThe sheriff said the 24-year-old has mental health issues and had been arrested before for battery after allegedly hitting his mother.\n'[He] had nothing on his mind other than killing people and making carnage,' Gualtieri said.\nThe suspect's father Michael Falsey, argued that his son did not have mental issues and claims Jeffrey told him his mother had been abusing him, the Ledger reported.\nHe faces multiple charges, including first-degree murder. Records don't list an attorney.","url":"https://www.dailymail.co.uk/news/article-4320832/Sheriff-Fight-doughnuts-ended-1-dead-deputy-hurt.html"}
