{"authors":["Associated Press"],"date_download":"2018-10-23 01:59:34","date_modify":"2018-10-23 01:59:34","date_publish":"2017-04-26 12:45:50","description":"MOSCOW (AP) - The Russian counterintelligence agency on Wednesday announced the arrest of two suspected supporters of the Islamic State group who it said...","filename":"data/vaneerConsumption/Russiasaysitthwartedterrorattackarrested2suspects.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447422_Russia-says-thwarted-terror-attack-arrested-2-suspects_1540259974.html","title":"Russia says it thwarted terror attack, arrested 2 suspects","title_page":"Russia says it thwarted terror attack, arrested 2 suspects | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MOSCOW (AP) - The Russian counterintelligence agency on Wednesday announced the arrest of two suspected supporters of the Islamic State group who it said were planning a terror attack.\nThe two men were arrested in an apartment in Yuzhno-Sakhalinsk, a city on the Pacific island of Sakhalin, where a search turned up a homemade explosive device and IS propaganda literature, the FSB said.\nOne of the suspects is a citizen of Russia and the other of one of the former Soviet republics in Central Asia, the agency said in a statement carried by Russian news agencies. It provided no further identification.\nThe FSB has appeared eager to demonstrate its ability to prevent attacks following this month's suicide bombing on the St. Petersburg subway that killed 15 passengers. The bomber was from Kyrgyzstan, one of the impoverished, predominantly Muslim former Soviet republics in Central Asia that are seen as fertile ground for Islamic extremists.\nThe agency said the two men arrested on Sakhalin were planning to carry out a terror attack but gave no specifics other than to say that it was planned for a site where many people congregate.\nAn FSB video of the suspects broadcast on Russian state television showed the two men handcuffed and lying face down on the floor.","url":"https://www.dailymail.co.uk/wires/ap/article-4447422/Russia-says-thwarted-terror-attack-arrested-2-suspects.html"}
