{"authors":[],"date_download":"2018-10-22 23:10:02","date_modify":"2018-10-22 23:10:02","date_publish":"2016-01-28 11:50:26","description":"Russia said on Thursday it wanted to hold an international meeting on Syria -- including key players from the West and the Middle East -- in Munich next mont...","filename":"data/vaneerConsumption/RussiaproposesinternationalmeetingonSyriaonFeb11.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g88o-2vdWmEltwXfba0ce28e632838fac-212_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420779_Russia-proposes-international-meeting-Syria-Feb-11_1540249802.html","title":"Russia proposes international meeting on Syria on Feb 11","title_page":"Russia proposes international meeting on Syria on Feb 11 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Russia proposes international meeting on Syria on Feb 11\nRussia said on Thursday it wanted to hold an international meeting on Syria -- including key players from the West and the Middle East -- in Munich next month.\n\"There is an agreement in principle between Russian Foreign Minister Sergei Lavrov and Secretary of State John Kerry, and now we will propose to all the other participants of the international Syria support group a time and place -- Munich, February 11,\" state news agency TASS quoted deputy foreign minister Mikhail Bogdanov as saying.\nThe call for a fresh meeting of the key international players in Syria came as opposition groups from the war-torn country met for a third day in Riyadh to decide whether to attend UN peace talks with the government, with less than 24 hours before the negotiations were due to open in Geneva.\nRussian Deputy Foreign Minister Mikhail Bogdanov (R) has called for a Feburary international meeting on Syria\nSome 17 nations -- including the United States, Russia, Saudi Arabia, Turkey and Iran -- held several rounds of talks last year in the broadest international push to end the conflict in Syria.\nRussia is currently conducting a bombing campaign in Syria in support of President Bashar al-Assad, while the US is leading a separate coalition targeting Islamic State jihadists.\nIranian Deputy Foreign Minister Hossein Amir Abdollahian told journalists in Moscow on Thursday, a day after meeting Bogdanov, that the talks would likely happen February 11.","url":"https://www.dailymail.co.uk/wires/afp/article-3420779/Russia-proposes-international-meeting-Syria-Feb-11.html"}
