{"authors":["Eyder Peralta"],"date_download":"2018-10-23 01:06:27","date_modify":"2018-10-23 01:06:27","date_publish":"2014-08-07 00:00:00","description":"Snowden has been in exile for a little more than a year, after he leaked a cache of classified documents that revealed some of the United States' most deeply held security secrets.","filename":"data/vaneerConsumption/RussiaGivesEdwardSnowden3YearResidencePermit.json","image_url":"https://media.npr.org/assets/img/2014/08/07/ap44481531646_wide-af18cfb9ed2299591c17afcfea740b9cf1fc11a8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_08_07_338519188_russia-gives-edward-snowden-three-year-residence-permit_1540256787.html","title":"Russia Gives Edward Snowden 3-Year Residence Permit","title_page":"Russia Gives Edward Snowden 3-Year Residence Permit : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Russia Gives Edward Snowden 3-Year Residence Permit\nEnlarge this image toggle caption Tanya Lokshina/AP Tanya Lokshina/AP\nRussia is allowing former NSA contractor Edward Snowden to remain in the country for at least three more years.\nSpeaking to reporters in Moscow on Thursday, attorney Anatoly Kucherena said Snowden's application had been approved Aug. 1.\nIf you remember, Snowden has been in exile for a little more than a year. He fled the United States when he decided to leak a cache of classified documents that revealed some of the United States' most deeply held security secrets.\nThe United States has sought his extradition, after it charged him with espionage, theft and conversion of government property. Of course, Russia has not complied with those demands.\nInstead, after Snowden was stranded in the Moscow airport for more than a month last summer, Russia handed him a temporary one-year asylum.\nRussia Today, an English-language news outlet funded by the Russian government, reports that Kucherena told reporters Snowden had not asked for political asylum and that he would not be able to apply for Russian citizenship.\n\"He will be able to travel freely within the country and go abroad,\" RT quotes Kucherena as saying. \"He'll be able to stay abroad for not longer than three months.\"\nWe'll update this post once the U.S. government issues a reaction.","url":"https://www.npr.org/sections/thetwo-way/2014/08/07/338519188/russia-gives-edward-snowden-three-year-residence-permit"}
