{"authors":[],"date_download":"2018-10-22 20:37:21","date_modify":"2018-10-22 20:37:21","date_publish":"2014-06-02 14:26:33","description":"Five pro-Russian separatists were killed in east Ukraine Monday as Moscow said it would submit a draft U.N. resolution to end escalating violence.","filename":"data/vaneerConsumption/RussiaToSubmitUNResolutiononUkraineas5DieinLuhansk.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/480746/140602-ukraine-6a_e9ac75fe10b9d3a8fdabf68e099fbfbc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_russia-submit-u-n-resolution-ukraine-5-die-luhansk-n120246_1540240641.html","title":"Russia To Submit U.N. Resolution on Ukraine as 5 Die in Luhansk","title_page":"Russia To Submit U.N. Resolution on Ukraine as 5 Die in Luhansk","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMOSCOW - Five pro-Russian separatists were killed and seven Ukrainian guards wounded Monday in clashes near Luhansk in eastern Ukraine.\nThe fighting began in the early hours of the morning in the area, where the separatists are trying to take control of the Ukrainian border control posts.\nLocal residents were reportedly fleeing the area.\nThe developments came as Russia said it would submit a draft resolution to the U.N. Security Council calling for an immediate end to worsening violence in Ukraine and the creation of humanitarian corridors in the east of the country.\nForeign minister Sergei Lavrov said Western nations had assured Russia the situation in Ukraine would improve after its May 25 presidential election but that \"everything is happening in exactly the opposite way\".\n\"People are dying every day. Peaceful civilians are suffering more and more - the army, military aviation and heavy weapons continue to be used against them,\" he said when asked about Ukraine at a joint news conference after talks with his Mauritanian counterpart.\nThe draft resolution \"will contain a demand for the immediate halt to violence and the beginning of actual negotiations with the aim of establishing a stable and reliable ceasefire,\" Lavrov said.\nUkrainian President-elect Petro Poroshenko and the pro-Western authorities in Kiev have defied Moscow's repeated calls for an end to the government's operation against armed separatists in the eastern Donetsk and Luhansk regions, which border Russia.\nRussia calls it a \"punitive operation\", while Kiev says it is aimed at combating terrorists.\nReuters contributed to this report.\nAlbina Kovalyova","url":"https://www.nbcnews.com/storyline/ukraine-crisis/russia-submit-u-n-resolution-ukraine-5-die-luhansk-n120246"}
