{"authors":[],"date_download":"2018-10-22 21:13:44","date_modify":"2018-10-22 21:13:44","date_publish":"2014-05-06 15:11:24","description":"The comments came after the head of the U.S. Air Force said Russian military drills in the Pacific were linked to Ukraine.","filename":"data/vaneerConsumption/RussiaMocksUSKnowledgeofGeographyAfterDrillFears.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/423306/140506-russia-jets-11a_d8cb6fb6ba0bf44e12311029d335cdd7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_russia-mocks-u-s-knowledge-geography-after-drill-fears-n98216_1540242824.html","title":"Russia Mocks U.S. 'Knowledge of Geography' After Drill Fears","title_page":"Russia Mocks U.S. 'Knowledge of Geography' After Drill Fears","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nU.S. concern about Russian military drills in the Pacific prompted Moscow to accuse the White House on Tuesday of having a \"bad knowledge of geography.\"\nThe Kremlin's wry taunt came after the head of the U.S. Air Force said Russian intervention in Ukraine had been accompanied by a significant increase in its Asia-Pacific activity.\nGeneral Herbert \"Hawk\" Carlisle said Russian jets had flown toward the California coast and around the U.S. Pacific island territory of Guam.\nHe told Washington's Center for Strategic and International Studies think tank on Monday that \"we relate a lot of [the activity in the Pacific] to what's going on in the Ukraine,\" according to a report of the speech by Reuters.\nIn response, Russia's state-run RIA Novosti news agency quoted a \"top-ranking Russian Defense Ministry official\" as pointing out that \"first of all, the United States of America in fact borders Russia via the Bering Strait.\"","url":"https://www.nbcnews.com/storyline/ukraine-crisis/russia-mocks-u-s-knowledge-geography-after-drill-fears-n98216"}
