{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-22 23:45:57","date_modify":"2018-10-22 23:45:57","date_publish":"2016-01-28 13:02:16","description":"The shocking footage - filmed in Labytnangi, Russia - shows Zhanna Voytishek, 35, take her frustrations out on her young boy when she realises her child benefit has not yet been paid.","filename":"data/vaneerConsumption/Russianmotherthrowssonintoroadafterfindinglowbankbalance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA8D9100000578-0-image-a-31_1453986678026.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420884_Russian-mother-beats-six-year-old-son-kicks-stomach-throwing-road-checking-bank-balance-seeing-expected_1540251957.html","title":"Russian mother throws son into road after finding low bank balance","title_page":"Russian mother throws son into road after finding low bank balance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A vicious Russian mother has been caught on CCTV kicking her six-year-old son before throwing him into the street after discovering she had less money than expected when visiting an ATM.\nThe shocking footage shows Zhanna Voytishek, 35, take her frustrations out on her innocent young boy when she realises her child welfare benefit has not yet reached her bank account.\nAfter checking the machine, she cruelly pushes the schoolboy by his head, toppling him to the floor of the convenience store they are visiting in the town of Labytnangi, in the northern Urals.\nOnce down, Voytishek - dressed in a thick winter jacket - then lands a brutal kick into his midriff as the helpless boy tries in vain to protect himself.\nWhen passers-by try to intervene, the cowardly mother drags her injured son out of the shop on to a snowy pavement.\nWith her tensions still running high, she then grabs the tiny boy by the back of his neck and waist, lifting him in the air and tossing him like a rag-doll into the deep snow.\nZhanna Voytishek, 35, is seen on CCTV standing alongside her son as she checks her bank balance in a convenience store in the town of Labytnangi, in the northern Urals, Russia\nAfter checking an ATM and finding she has less money than expected, Voytishek cruelly pushes her son by his head, toppling him to the floor\nOnce down, the woman - dressed in a thick winter jacket - then lands a brutal kick into her son's midriff as the helpless boy tries in vain to protect himself\nWithout a second thought - and her son writhing in agony on the freezing tarmac - she then walks off, leaving a concerned member of the public to care for the boy.\nIt is not known how the boy was aided thereafter.\nThe horrifying CCTV film - recorded in November last year - was uploaded to social media earlier this week.\nIts emergence prompted Russian law enforcement services to launch an investigation.\nWhen passers-by try to intervene, the cowardly mother drags her injured son out of the shop on to a snowy pavement\nWith her tensions still running high, she then grabs the tiny boy by the back of his neck and waist, lifting him in the air and tossing him like a rag-doll into the deep snow\nWithout a second thought - and her son writhing in agony on the freezing tarmac - she then walks off, leaving a concerned member of the public to care for the boy\nIt was then reported that the woman's rage was caused by the late deposit of her child's welfare payment - 2,000 rubles (£18) - into her bank account.\nLocal news have since reported that the woman has a psychiatric disorder.\nDespite the recorded abuse, Russia's Children's Rights Ombudsman Pavel Astakhov stated the boy will not be taken away by social services.\nHe said: 'The boy is from a complete family. He has a father with whom we have no complaints, so he hasn't been taken from the family.'","url":"https://www.dailymail.co.uk/news/article-3420884/Russian-mother-beats-six-year-old-son-kicks-stomach-throwing-road-checking-bank-balance-seeing-expected.html"}
