{"authors":["John J. Xenakis"],"date_download":"2018-10-30 18:44:42","date_modify":"2018-10-30 18:44:42","date_publish":"2018-09-16 14:02:43","description":"Contents: Russian Orthodox Church in historic split with Constantinople over Ukraine issue; Consequences of an independent Ukrainian Orthodox Church | National Security","filename":"data/vaneerConsumption/RussianOrthodoxChurchinHistoricSplitwithConstantinopleoverUkraineIssue.json","image_url":"https://media.breitbart.com/media/2018/07/wi/afp/30/1b9f44_believers-ukrainian-orthodox-church-in-religious-procession-in-kiev-marking-e1537106556272.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_09_16__1540925082.html","title":"Russian Orthodox Church in Historic Split with Constantinople over Ukraine Issue","title_page":"Russian Orthodox Church in Historic Split with Constantinople over Ukraine Issue","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nRussian Orthodox Church in historic split with Constantinople over Ukraine issue\nConsequences of an independent Ukrainian Orthodox Church\nRussian Orthodox Church in historic split with Constantinople over Ukraine issue\nPutin’s dream of an ‘Orthodox Vatican’ would be a major tourist and religious center in the city of Sergiev Posad, northeast of Moscow (BBC)\nThe Russian Orthodox Church (ROC) has taken the first steps in what is being described as a “historic schism” in the Orthodox Christian Church.\nThe ROC announced on Friday:\nWe have decided to suspend joint performance of church services with the hierarchs of the Constantinople Patriarchate, to suspend our membership in all structures, which are headed or co-chaired by the representatives of Constantinople.\nAn ROC spokesman said that this was only a “warning,” and that the ROC would break all relations with Constantinople if it grants independence to the Ukrainian Orthodox Church, which is currently subordinate to the Russian Church.\nThe Constantinople Patriarchate and the Moscow Patriarchate are two of several dozen Orthodox Patriarchates in the world, but they’re the two most influential.\nThe city of Constantinople was renamed Istanbul when it was conquered by the Ottoman Muslims in 1453, bringing an end to the Byzantine Empire. However, the spiritual leader of the world’s Orthodox Christians is still considered to be the Constantinople Patriarchate. All Patriarchates are considered to be equal, but Constantinople is “first among equals.”\nOrthodox Christians in Ukraine are officially part of the Russian Orthodox Church. There is a Ukrainian Orthodox Church of Kiev that was formed in the 1990s, but it’s not recognized by other Orthodox churches.\nAfter Russia invaded Ukraine, and then invaded and annexed Crimea in 2014, there was a movement in Ukraine to make the Ukrainian Orthodox Church an “autocephalous church” or independent church. Instead of being subordinate to the Russian Church, the Ukrainian church would then be a peer to the Russian and Constantinople churches.\nRight now, Patriarch Bartholomew I in Constantinople is leading a debate about whether he should issue what is called a “Tomos of autocephaly” (charter of independence), which would give the Ukraine church the independence that it wants. It is believed that Bartholomew favors doing so and that a decision will be reached by the end of the year. At that time, Patriarch Kirill in Moscow is expected to complete several all relations with Constantinople. Russia Today and Moscow Times and BBC Russian (Trans) and Telegraph (London)\nConsequences of an independent Ukrainian Orthodox Church\nAlthough the current split was triggered by the Ukrainian church’s request for independence, following Russia’s invasion, occupation and annexation of Crimea, the chances of a split between Russia and Constantinople have been growing for years, particularly since the collapse of the Soviet Union.\nThe Soviet Union was officially atheist. Nonetheless, during the time of the Soviet Union, there was one Russian Orthodox Church, and all Orthodox Christians in the Soviet Empire belonged to it. After the Soviet collapse in 1991, independent Orthodox churches were formed in Estonia and other former Soviet republics. Constantinople recognized the Estonian church as independent, resulting in enormous friction between Moscow and Constantinople.\nThose disputes became even more prominent when Russia’s president Vladimir Putin came to power. Putin’s dream is that the Russian Patriarchate should replace the Constantinople Patriarchate as the “first among equals.” Furthermore, Putin dreamed of creating an “Orthodox Vatican” in the ancient city of Sergiev Posad, northeast of Moscow.\nIn line with this dream, Putin has been enticing, bribing and threatening various Orthodox churches to pledge loyalty to the Russian church, rather than the Constantinople church.\nPutin’s dream sounds reasonable when you consider that the Russian church is the largest Orthodox Church in the world, in terms of numbers of members and parishes. However, if Ukraine becomes an independent church, then the Russian church will lose almost half its parishes, and that will be the end of Putin’s dream. It will also cost the Russian Patriarchate a great deal of money. It will also encourage other former Soviet republics, like Belarus and Georgia, to follow the same path.\nSo this pending decision by Bartholomew is far more than symbolic. It has major religious and geopolitical implications. Putin would certainly retaliate. He might retaliate in Ukraine with a renewed invasion. He might retaliate by trying to convince his new pal, Turkey’s president Recep Tayyip Erdogan, to take some action in the Phanar, the portion of Istanbul still occupied by the Constantinople Patriarchate. So Bartholomew’s decision, expected by the end of the year, should have major consequences. Jamestown and Moscow Times and BBC Russian (Trans) Window on Eurasia\nRelated Articles:\nKEYS: Generational Dynamics, Russia, Ukraine, Constantinople, Russian Orthodox Church, Ukrainian Orthodox Church, Patriarch Bartholomew I, Patriarch Kirill, Vladimir Putin, Sergiev Posad, Orthodox Vatican, Turkey, Recep Tayyip Erdogan, Estonia, Belarus, Georgia\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2018/09/16/world-view-russian-orthodox-church-in-historic-split-with-constantinople-over-ukraine-issue/"}
