{"authors":[],"date_download":"2018-10-22 23:07:37","date_modify":"2018-10-22 23:07:37","date_publish":"2017-03-16 05:48:13","description":"US charges that Russia's FSB security service was behind the hacking of Yahoo underscored a worrisome run of successes in Moscow's cyber-efforts against its...","filename":"data/vaneerConsumption/RussiarunsupcyberscoreagainstUSwithYahooelectionhacks.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/05/wire-226573-1489643295-208_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318978_Russia-runs-cyber-score-against-US-Yahoo-election-hacks_1540249657.html","title":"Russia runs up cyber score against US with Yahoo, election hacks","title_page":"Russia runs up cyber score against US with Yahoo, election hacks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The US Justice Department indicted two officials of Russia's Federal Security Service, the FSB, and two hackers they hired to steal data from Yahoo user accounts\nUS charges that Russia's FSB security service was behind the hacking of Yahoo underscored a worrisome run of successes in Moscow's cyber-efforts against its longtime rival.\nComing after Russian President Vladimir Putin allegedly masterminded an effort to shape the US presidential election last year, the accusations add to concerns that the Kremlin is besting Washington on multiple fronts, from international conflict zones to domestic politics and the economy.\nThey could also make it harder for US President Donald Trump to achieve his stated hope of smoothing relations with Moscow, amid ongoing probes into links between his campaign advisors and Moscow.\nThe US Justice Department on Wednesday indicted two officials of Russia's Federal Security Service, the FSB, and two criminal hackers they hired to steal data from some 500 million Yahoo user accounts.\nThey used that information to break into the accounts of Russian and US officials, Russian journalists and politicians, and business officials from multiple countries.\nIt was the first time Washington laid criminal charges against Russian officials for cyber-related offenses, aiming to send a message to Moscow to stop making use of the criminal underworld for espionage.\nBut experts say that will probably not happen.\n\"The Russians have done really well, and most people would say that they have the upper hand, they have the initiative,\" said James Lewis of the Center for Strategic and International Studies in Washington.\n\"There is no chance of them giving this up. Why would they do it?\"\n- Cold War-like fears -\nMuch of Washington has become consumed by a Cold War-like fear of Russia's tactical moves, focusing on whether Moscow may have compromised people close to Trump.\nThe Federal Bureau of Investigation and multiple committees in Congress continue to investigate Russia's role in last year's election and its links to people associated with the Trump administration.\nUS intelligence chiefs said in a report issued in January that their investigations showed Putin oversaw the effort that included hacking Democratic computers and communications and releasing embarrassing documents via WikiLeaks in order to hurt the campaign of Trump's rival Hillary Clinton.\nSeparately, a British former intelligence operative's dossier on Russian election interference reported efforts to help Trump to victory as well as regular communications between Trump campaign aides and Russian officials. A subsequent New York Times report said some of those communications were with Russian intelligence.\n\"Russian efforts to influence the 2016 US presidential election represent the most recent expression of Moscow's longstanding desire to undermine the US-led liberal democratic order,\" the intelligence chiefs' report said.\nMoscow \"demonstrated a significant escalation in directness, level of activity, and scope of effort compared to previous operations,\" it added.\n- Focus on the role of organized crime -\nUS businesses and the government have been targeted by many small and large-scale hacking attempts in recent years. In 2014, the Justice Department laid criminal charges against five members of China's military it said were systematically stealing US corporate secrets.\nA year later, president Barack Obama pressed Chinese leader Xi Jinping to end the cybertheft, calling it beyond the accepted norms of spying.\nThat has largely worked, analysts say. The security firm Fire Eye has documented a steep decline in Chinese-origin hacking attempts.\nBut Russia remains aggressive in the online world, and the particular complaint of the United States is that the authorities often work with organized crime.\n\"Today's indictments shed a light on the close and mutually beneficial ties between the cyber underworld and Russia's government and security services, and the extent to which Russia leverages these cyber activities to multiple ends: commercial, financial and geopolitical,\" said Senator Mark Warner, the top Democrat on the Senate Intelligence Committee.\nLewis said the US indictments aim to signal Moscow that it has gone too far and that Washington can take retaliatory action.\nBut that won't necessarily make Moscow stop, he said.\n\"One of the reasons the Obama-Xi deal came through is that the Chinese wanted to get control of their own operations,\" Lewis said.\n\"With the Russians, the problem is that it's rarely in their interest to cooperate,\" he added.\nMany worry that Moscow is also behind WikiLeaks' publication of a trove of documents on the Central Intelligence Agency's own hacking program last week, which exposed secrets and embarrassed the US spy agency.\nUS intelligence officials have branded WikiLeaks a Russian front since the election leaks. But no one knows who provided the anti-secrecy group with the CIA documents.\n\"WikiLeaks works with insiders, it works with the Russians,\" Lewis said. \"We don't know which it is in this case.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4318978/Russia-runs-cyber-score-against-US-Yahoo-election-hacks.html"}
