{"authors":["Breitbart News"],"date_download":"2018-10-30 19:13:48","date_modify":"2018-10-30 19:13:48","date_publish":"2017-01-01 16:32:30","description":"DHS-FBI report \"provides almost no new evidence to support the Obama Administration's claims Russia attempted to interfere with the US electoral process.\"","filename":"data/vaneerConsumption/RussianHackingReportUnderwhelms.json","image_url":"https://media.breitbart.com/media/2017/01/GettyImages-621958176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_01_01__1540926828.html","title":"'Russian Hacking' Report Underwhelms","title_page":"Ars Technica: 'Russian Hacking' Report Underwhelms","title_rss":"NULL","source_domain":"breitbart.com","text":"Dan Goodin of Ars Technica writes that the DHS-FBI report on Russian hacking in 2016 “provides almost no new evidence to support the Obama Administration’s claims Russia attempted to interfere with the US electoral process.”\nFrom Ars Technica:\nTalk about disappointments. The US government’s much-anticipated analysis of Russian-sponsored hacking operations provides almost none of the promised evidence linking them to breaches that the Obama administration claims were orchestrated in an attempt to interfere with the 2016 presidential election.\nThe 13-page report, which was jointly published Thursday by the Department of Homeland Security and the FBI, billed itself as an indictment of sorts that would finally lay out the intelligence community’s case that Russian government operatives carried out hacks on the Democratic National Committee, the Democratic Congressional Campaign Committee, and Clinton Campaign Chief John Podesta and leaked much of the resulting material. While security companies in the private sector have said for months the hacking campaign was the work of people working for the Russian government, anonymous people tied to the leaks have claimed they are lone wolves. Many independent security experts said there was little way to know the true origins of the attacks.\nSadly, the JAR, as the Joint Analysis Report is called, does little to end the debate. Instead of providing smoking guns that the Russian government was behind specific hacks, it largely restates previous private-sector claims without providing any support for their validity. Even worse, it provides an effective bait and switch by promising newly declassified intelligence into Russian hackers’ “tradecraft and techniques” and instead delivering generic methods carried out by just about all state-sponsored hacking groups.\nRead the rest of the story here.","url":"https://www.breitbart.com/tech/2017/01/01/russian-hacking-white-house-fail/"}
