{"authors":["Dailymail.Com Reporters"],"date_download":"2018-10-23 02:20:47","date_modify":"2018-10-23 02:20:47","date_publish":"2016-01-11 14:15:02","description":"The daughter of a Russian billionaire is selling the $88million Manhattan apartment she bought to live in while studying in America.","filename":"data/vaneerConsumption/Russianbillionairesdaughterlists88millionCentralParkpenthouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300AA4B800000578-0-image-a-15_1452520387244.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393886_Russian-billionaire-lists-88million-Central-Park-penthouse-bought-2011-daughter-s-college-crash-pad_1540261247.html","title":"Russian billionaire's daughter lists $88million Central Park penthouse","title_page":"Russian billionaire's daughter lists $88million Central Park penthouse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The daughter of a Russian billionaire is selling the $88million Manhattan apartment she bought to live in while studying in America.\nDmitry Rybolovlev's daughter Ekaterina purchased the penthouse residence at 15 Central Park West in 2011 through her trust, paying what was at the time a record price for a Manhattan apartment.\nAt the time the apartment was purchased, Mr Rybolovlev was in the process of divorcing Ekaterina's mother Elena.\nFor sale: Russian billionaire Dmitry Rybolovlev's (left, in November) daughter Ekaterina (right) is selling the Manhattan penthouse apartment she bought to stay in during college\nBetter than the dorms: Above, the apartment building at 15 Central Park West where Ekaterina lived\nThe couple finalized their divorce this past October, after Elena's settlement was reduced from a staggering $4.5billion to a still very healthy $603million.\nA source told the New York Post that it may be difficult to sell the apartment, due to the declining New York City real estate market.\nThat being said, an investor group purchased a unit in the new luxury Manhattan apartment building One57 for $91.5million and the penthouse in that same complex was sold for a little over $100million last year.\nWhen Ekaterina purchased the apartment through her trust, she was studying at an undisclosed U.S. university.\nThe 6,744-square-foot apartment boasts ten rooms and a wraparound terrace.\nRybolovlev is one of the small group of Russians who became fabulously wealthy during the post-Soviet privatization of the economy and are known as oligarchs. He is the former owner of fertilizer business Uralkali.\nIn 2008, Mr Rybolovlev, 43, bought Donald Trump's 33,000-square-foot Florida estate - Maison L'Amitie - for $95million in cash.\nHe is the owner of the French football team AS Monaco and used to run Russia's largest potash fertiliser company Uralkali.","url":"https://www.dailymail.co.uk/news/article-3393886/Russian-billionaire-lists-88million-Central-Park-penthouse-bought-2011-daughter-s-college-crash-pad.html"}
