{"authors":["Will Stewart For Mailonline"],"date_download":"2018-10-23 01:31:24","date_modify":"2018-10-23 01:31:24","date_publish":"2017-04-26 11:59:08","description":"The roof of the PepsiCo plant in Lebedyan - 235 miles south of Moscow - collapsed and unleashed a river of pineapple, cherry, mango and apple juice through the town's streets.","filename":"data/vaneerConsumption/Russiantownfloodedwithtropicaldrinksasrooffallsin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F461E00000578-0-image-a-43_1493205306780.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447002_Russian-town-flooded-tropical-drinks-roof-falls-in_1540258284.html","title":"Russian town flooded with tropical drinks as roof falls in","title_page":"Russian town flooded with tropical drinks as roof falls in | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rivers of tropical juice flowed through the streets of a Russian town after the roof of a soft drinks factory collapsed.\nA cascade of flavours including pineapple, apricot, tangerine, grape, mango, pomegranate, apple, cherry, orange, grapefruit and tomato poured out of the plant in Lebedyan, 235 miles south of Moscow.\nOwned by PepsiCo, the plant called Lebedyansky is the sixth largest juice factory in the world.\nScroll down for video\nThe river of fruit juice spilled into the streets of Lebedyan (pictured) after the roof of the PepsiCo factory - known as 'Lebedyansky' - collapsed\nThe Russian town, which is 235 miles south of Moscow, has a population of 21,000. One local, Roman Bogoslovsky, said simply: 'Juices are flowing through the streets'\nA representative from a local environmental watchdog said the spillage, as shown above, does not appear to have damaged the town's water supply\nSome 300 square metres of the roof collapsed at 10am in the town with a population of 21,000.\nThe cause was not immediately apparent.\nTwo workers were trapped for four hours on a 125ft high gantry as emergency workers used special hoists to rescue them .\nBoth were taken to hospital.\nTwo workers were taken to hospital after they became stranded on a 125ft high gantry for four hours\nThe factory (pictured) is the sixth largest of its kind in the world and sells juice under the brand name of 'Ja' in Russia\nLocal Roman Bogoslovsky said: 'Juices are flowing through the streets.'\nDrinks from the vast cannery plant are sold under the brand name 'Ja' in Russia.\nRescue teams are taking part in a mass clean up, clearing rubble from the collapsed building.\nEnvironment chiefs said they have launched an investigation into whether yesterday's spillage could cause a health hazard.\nCars and walkers had to slog through the rivers of cherry, pineapple, apple, mango and apricot juice after 28 million litres of the stuff was spilled into the streets\nEnvironmental workers have taken samples from the nearby River Don to see if it has suffered any damage. But one online poster, Kazimir Alchikov, was looking on the bright side: 'Colourful rivers like that look like fun, at least in cartoons'\nDmitriy Chursin, a representative from the local environmental watchdog, confirmed that water samples from the Don River that flows through the city have been taken to see if the main water has been affected by the soda or the chemicals made to mix it.\nHe said: 'So far our specialists haven't found any signs of possible damage of water resources.'\nBut online posters have lined up to look on the bright side.\nOne, named Anatoly Averkov, said: 'Good thing is that it was a factory specialising on soft beverages, imagine if it was something more serious – chemical producing one' while another, going by the name Kazimir Alchikov, added: 'Colourful rivers like that look like fun, at least in cartoons.'\nPepsi representatives have confirmed they are ready to pay for the damage and stressed that the level of flooding is not that dramatic.","url":"https://www.dailymail.co.uk/news/article-4447002/Russian-town-flooded-tropical-drinks-roof-falls-in.html"}
