{"authors":[],"date_download":"2018-10-22 21:47:43","date_modify":"2018-10-22 21:47:43","date_publish":"2014-06-06 12:49:06","description":"Ukraine president-elect Petro Poroshenko and Russian President Vladimir Putin came face-to-face during a group photo Friday.","filename":"data/vaneerConsumption/RussiasPutinUkrainesPetroPoroshenkoMeetatDDayCommemoration.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/491801/140606-poroshenko-putin-mn-835_590b3678ca96d821e71155f2f47c922d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_russias-putin-ukraines-petro-poroshenko-meet-d-day-commemoration-n124341_1540244863.html","title":"Russia's Putin, Ukraine's Petro Poroshenko Meet at D-Day Commemoration","title_page":"Russia's Putin, Ukraine's Petro Poroshenko Meet at D-Day Commemoration","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUkraine's incoming president spoke briefly with Russian President Vladimir Putin after world leaders gathered for a photo Friday at D-Day commemoration ceremonies.\nPresident-elect Petro Poroshenko, Putin and German Chancellor Angela Merkel lingered a while and chatted in a threesome. Reporters observing the encounter couldn't hear any of the animated conversation, which lasted about a minute, and the men did not shake hands in public.\nNo plans have been announced for a longer, formal meeting.\nDeadly violence in eastern Ukraine was in many minds at the gathering in France, and a possible contact between Putin and Poroshenko was eagerly anticipated.\nIn recent weeks, Ukrainian officials say more than 200 people have died — a figure which can't be independently confirmed — in fighting between Ukrainian government troops and pro-Russian rebels.\nCandy magnate Poroshenko, who is to be sworn in as Ukraine's next president on Saturday, has promised a comprehensive plan to put an end to the hostilities in the east as soon as he assumes office.\n- The Associated Press","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/russias-putin-ukraines-petro-poroshenko-meet-d-day-commemoration-n124341"}
