{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:34:14","date_modify":"2018-10-30 20:34:14","date_publish":"2015-09-06 11:00:01","description":"In what is potentially a major escalation in the Mideast, officials are saying Russia appears to be building a new military base in Syria.","filename":"data/vaneerConsumption/RussiaMayBeBuildingaNewMilitaryBaseinSyria.json","image_url":"https://media.breitbart.com/media/2015/03/ap_ap-photo1329-1024x728.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_06__1540931654.html","title":"Russia May Be Building a New Military Base in Syria","title_page":"Russia May Be Building a New Military Base in Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nRussia may be building a new military base in Syria\nThe cost of repudiating the Truman Doctrine\nRussia may be building a new military base in Syria\nRussian soldiers\nIn what is potentially a major escalation in the growing sectarian wars in the Mideast, intelligence officials are saying that Russia appears to be building a new military base in Syria, in the Mediterranean port city of Latakia, with an airfield and prefabricated housing units for up to 1,000 personnel.\nImages and videos are emerging that show Syrian and Russian combat troops fighting alongside each other, with troops shouting orders to one another in Russian. According to one unnamed intelligence official:\nIf they’re moving people in to help the Syrian government fight their own fight, that’s one thing. But if they’re moving in ground forces and dropping bombs on populated areas, that’s an entirely different matter.\nRussia justifies its military intervention in support of the regime of Syria’s president Bashar al-Assad because of the rise of the so-called Islamic State (IS or ISIS or ISIL or Daesh), without mentioning that Russia, Iran and al-Assad are directly responsible for the rise of ISIS by conducting a genocidal campaign against innocent Sunni women and children, after they peacefully protested in 2011.\nUS Secretary of State John Kerry is strongly disapproving of the Russian action. According to a statement by the State Dept.:\nThe secretary made clear that if such reports were accurate, these actions could further escalate the conflict, lead to greater loss of innocent life, increase refugee flows and risk confrontation with the anti-ISIL coalition operating in Syria.\nThe statement makes it clear that, unless Russia desists, then the US will treat the situation harshly and issue another statement.\nAs I have been writing for many, many months, there is no war of Muslims versus Christians. The war in the Mideast and Asia is Muslims versus Muslims, with the number of Christians killed minuscule compared to the number of Muslims killed. As I’ve said many times, this Muslim versus Muslim war is going to engulf the whole region, and will pull in the rest of the world.\nIf it is true that Russian troops are fighting alongside Syrian troops against Sunni militants, then we have the first war of Muslims versus Christians. This is a generational Awakening era, where increasingly nationalist and xenophobic populations are willing to start and escalate wars, with no fear of the consequences. You can be certain that this will only escalate. Telegraph (London) and Reuters\nThe cost of repudiating the Truman Doctrine\nI have written many times about the Harry Truman’s Truman Doctrine of 1947, which made America policeman of the world. The doctrine is highly controversial today, but its justification is that it is better to have a small military action to stop an ongoing crime than to let it slide and end up having an enormous conflict like World War II. Every president since WWII has followed the Truman Doctrine, up to and including George Bush. Barack Obama is the first president to repudiate the Truman Doctrine, essentially leaving the world without a policeman.\nThe Truman Doctrine has always been heavily criticized, but it has done much to preserve peace for decades. Now, since 2011, we see in full fury what happens to the world without a policeman.\nSince the Syrian conflict began in 2011, Russia’s support has been essential to the survival of al-Assad. Al-Assad, a member of the Alawite/Shia religious group, began using heavy weapons on peaceful Sunni Muslim demonstrators. He has flattened entire Sunni villages with Russia’s heavy weapons, he has killed children by sending missiles into exam rooms and bedrooms, he’s killed hundreds with Sarin gas, and he continues to kill countless more with barrel bombs loaded with explosives, metals, and chlorine gas dropped from helicopters.\nAl-Assad’s genocidal sectarian attack on Sunnis caused the formation of Iraqi rebel groups, such as the Free Syrian Army (FSA). But it also triggered a worldwide tsunami of young men from around the world traveling to Syria to fight against al-Assad, joining the al-Qaeda linked Jabhat al-Nusra (al-Nusra Front), and causing the creation of ISIS.\nAl-Assad predicted a quick victory in 2012, and that might have happened if his only enemy had been the FSA. But he began to suffer defeats at the hands of al-Nusra and ISIS, and his regime could only continue with the help of a massive supply of heavy weapons from Russia, fighters from Iran’s Islamic Revolution Guards Corps (IRGC), and fighters from the Lebanon-based Iran-back terror group Hezbollah.\nBut even with all that massive support from other countries, the al-Assad regime has been losing the war against al-Nusra and ISIS, so that now he is apparently going to need Christian Russian troops to support him.\nAll of this has happened as a consequence of Barack Obama’s repudiation of the Truman Doctrine. It is too late to do anything now, but with no policeman, al-Assad was able to conduct his Sunni extermination campaign in 2011. The most damaging example of all was Obama’s flip-flop about the “red line” of al-Assad’s use of chemical weapons, which, combined with America’s total withdrawal from Iraq, signaled to all sides in the Mideast that they were free to kill anyone they wanted with impunity. It is as if all the policemen were withdrawn from New York City, and then everyone expressed surprised when the city exploded in multiple gang wars.\nWe have had seven years of a president with absolutely no clue what is going on in the world, and it has been a disaster. We have no need for eight years of another president who has no clue what’s going on in the world. And by that I also mean that we have no need for a president whose idea of foreign policy is to stoke nationalism, xenophobia and hatred by repeatedly suggesting that all Mexicans are rapists and murderers, which is about as disastrous a policy as possible.\nNor do I accept anyone’s claim that the president can hire a staff of experts who will tell him what to do. President Obama has repeatedly ignored the advice of army generals and other experts, because he believes that he’s always the smartest person in the room, no matter who else is in the room. So the claim about hiring a staff of experts is just an excuse for not knowing anything. In the meantime, the situation in Mideast worsens every day, and the nicest thing that anyone can say about American foreign policy in the Mideast is that it’s totally incoherent.\nI hear a lot of rhetoric and hot air by politicians on all sides, as long as I can stand listening to it, but I’m waiting to see if there’s anyone who actually knows what’s going on. I’m afraid I’m going to have to wait a long time.\nKEYS: Generational Dynamics, Syria, Latakia, Russia, Bashar al-Assad, Harry Truman, Truman Doctrine, Free Syrian Army, FSA, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Jabhat al-Nusra, al-Nusra Front, Iran, Hezbollah\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/09/06/world-view-russia-may-be-building-a-new-military-base-in-syria/"}
