{"authors":[],"date_download":"2018-10-22 22:13:21","date_modify":"2018-10-22 22:13:21","date_publish":"2014-05-09 11:24:30","description":"\"The only position towards terrorists is shoot to kill,\" Ukraine's interior minister says.","filename":"data/vaneerConsumption/RussiasVictoryDayTakesDeadlyTurninUkrainianCityofMariupol.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/431831/140509-ukraine-mariupol-1020a_d2b5fd10a714db9afbffaecf6d5d6eac.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_russias-victory-day-takes-deadly-turn-ukrainian-city-mariupol-n101176_1540246401.html","title":"Russia's Victory Day Takes Deadly Turn in Ukrainian City of Mariupol","title_page":"Russia's Victory Day Takes Deadly Turn in Ukrainian City of Mariupol","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUkrainian troops killed some 20 pro-Russian separatists who tried to storm the police headquarters in the city of Mariupol on Friday, Ukraine's Interior Ministry said.\nThe clashes came as Moscow and parts of Ukraine staged flamboyant celebrations to mark the anniversary of the Soviet Union's defeat of Nazi Germany in World War II.\nThe Ukrainian Interior Minister Arsen Avakov wrote on his Facebook page that government forces killed 20 separatists, whom it called \"terrorists,\" and captured four more after about 60 militants tried to storm the police headquarters.\n\"The only position towards terrorists is shoot to kill,\" he said. \"I ask all of you, the friends and the enemies, put all your conflicts and interests aside, the country is at stake. It is time to recollect our strength and to come out of this situation.\"\nHe said one Ukrainian soldier was killed and five more injured as police headquarters in the city were set on fire.\nThe Interfax Ukraine news agency translated a Facebook post by the Donetsk \"People's Governor\" Pavlo Hubarev alleging that Kiev-backed militants had used \"chemical weapons\" when taking back the city's council building on Tuesday.\nNBC News was not able to verify the claim.\nMoscow, meanwhile, staged one of its largest Victory Day parades in years amid growing Russian patriotic fervor sparked by the annexation of Crimea from Ukraine in March.\nThere were similar parades in the eastern Ukraine region of Donetsk, where Ukrainian troops have for weeks been trying to dislodge pro-Russian separatists who have occupied buildings in dozens of cities.\nRussian President Vladimir Putin blames the United States for stirring up tension within Ukraine. Putin says that by backing the new Kiev government, put in place after an uprising in February, the U.S. is supporting a fascist regime imposed in a coup d'etat.\n- Richard Engel and Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/russias-victory-day-takes-deadly-turn-ukrainian-city-mariupol-n101176"}
