{"authors":["Press Association"],"date_download":"2018-10-23 03:43:09","date_modify":"2018-10-23 03:43:09","date_publish":"2017-04-26 15:19:09","description":"Lewis Hamilton heads into the Russian Grand Prix trailing Sebastian Vettel by seven points.","filename":"data/vaneerConsumption/RussianGrandPrixtalkingpoints.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465709-1493216354-315_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448044_Russian-Grand-Prix--talking-points_1540266189.html","title":"Russian Grand Prix - talking points","title_page":"Russian Grand Prix - talking points | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lewis Hamilton heads into the Russian Grand Prix trailing Sebastian Vettel by seven points following the Ferrari driver’s victory last time out in Bahrain.\nVettel, the four-time world champion, has won two of the opening three rounds of this season’s Formula One World Championship to cement his status as the number one challenger to the Mercedes driver this season.\nHere, Press Association Sport takes a look at the key talking points ahead of Sunday’s race at the Sochi Autodrom.\nHamilton out for revenge\nFerrari driver Sebastian Vettel, centre, celebrates as Lewis Hamilton, left, finished the race second (Hassan Ammar/AP)\nThere was certainly an air of what could have been for Hamilton as he took stock of his defeat to Vettel in Bahrain. Hamilton had the quicker machinery than Vettel in both qualifying and the race, but a number of mistakes – by both team and driver – contributed to the Mercedes driver finishing behind his championship rival. The 32-year-old Briton will be keen to make amends in Sochi as he attempts to level the score at 2-2 from the first four grands prix of a see-saw championship. Hamilton has good form in Russia – having won two of the three races staged here – while this event was the scene of Vettel’s X-rated outburst last year in which he said the f-word on five occasions inside just 10 seconds after being punted out of the race by Daniil Kvyat.\nHalo takes back seat\nSebastian Vettel's Ferrari with halo (David Davies/PA)\nA meeting of F1’s top aficionados on Tuesday evening determined that the shield has now surpassed the halo as the FIA’s preferred choice for improved cockpit safety. The sport’s governing body are keen to ramp up driver-head protection and had given the green light for the halo to be introduced next season. But the device courted criticism for its ugly appearance – indeed Hamilton described it as the “worst-looking modification” in F1 history – and the shield, a see-through screen which was presented to the drivers in China earlier this month, is viewed as the more aesthetically pleasing option. Tests will be carried out on the concept throughout the season.\nLiberty Media slowly showing hand\nBernie Ecclestone was at the Bahrain grand prix (Luca Bruno/AP)\nIt has been three months since American giants Liberty Media acquired Formula One and their approach has so far been slowly, slowly, catchy monkey. Indeed, bar the relaxing of social media rules in the paddock, they have made very few tweaks to the sport which was governed by Bernie Ecclestone for four decades. So, with that in mind it was interesting to note that one of the outcomes from the gathering of F1’s Strategy Group on Tuesday – where chairman Chase Carey made his debut – was to open future meetings to the sport’s lesser teams. Under Ecclestone’s self-proclaimed dictatorship, the talks had been limited to the top teams. But the likes of Sauber, Haas, Toro Rosso and Renault will now be invited to attend. A step in the right direction.\nWill Ferrari speak to the media in Russia?\nSebastian Vettel and Kimi Raikkonen did not talk to the press last time out (David Davies/PA)\nVettel may be leading the Formula One title, but neither he, nor his team-mate Kimi Raikkonen were made available to print or broadcast journalists on the so-called media day in Bahrain. Hand Vettel a microphone and he will be prepared to speak for hours, but his decision not to in Bahrain came from above – with rumblings in the paddock suggesting it was Ferrari team principal Maurizio Arrivabene rather than the team’s overlord Sergio Marchionne – who made the call. Let us hope the FIA, or indeed Liberty, who have promised more access to fans and media alike, take action should Ferrari close shop in Russia, too.\nMotor racing community shows support for Monger\nJust visited @BillyMonger mum Amanda dad Robert Sponsor Nick Armstrong and Jamie Caroline Billy's friend at Queen's medical centre, Notts — Johnny Herbert (@johnnyherbertf1) April 25, 2017\nfundraising for Billy has just clicked over £750,000. Thank you for your generosity & help. The response has been inspiring. #believeInBilly — Steven Hunter (@JHRdevelopments) April 25, 2017\nThe strength of the motor racing community was there for all to see after more than £500,000 was raised in under 24 hours for Billy Monger, the British teenager who had both his legs amputated following a horrendous Formula Four crash at Donington Park on Easter Sunday. Monger, 17, paid tribute to all those who contributed – with Jenson Button and Max Verstappen each donating £15,000 – in a heartfelt message via his social media channels on Tuesday. The current total on Monger’s Just Giving page stands just shy of £800,000. An incredible effort all round.","url":"https://www.dailymail.co.uk/wires/pa/article-4448044/Russian-Grand-Prix--talking-points.html"}
