{"authors":["Afp Reporter","Sara Malm For Mailonline"],"date_download":"2018-10-23 01:57:04","date_modify":"2018-10-23 01:57:04","date_publish":"2016-01-11 13:21:28","description":"At least 12 children and three adults were killed, and 20, all of them children and teachers, injured in a Russian air strike that hit a school in Anjara, Syria's Aleppo province","filename":"data/vaneerConsumption/Russianbomberkills12childrenafterairstrikehitsaschoolinAleppo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/2FFE37A600000578-0-image-a-6_1452533249385.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393675_8-children-dead-Russia-strike-hits-Syria-school-monitor_1540259824.html","title":"Russian bomber kills 12 children after air strike hits a school in Aleppo","title_page":"Russian bomber kills 12 children after air strike hits a school in Aleppo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At least 12 children and three adults were killed in a Russian air strike that hit a school in Syria's Aleppo province on Monday, a London-based monitoring group said.\nIn addition, at least 20 people, all of them children and teachers were injured in the strike in the town of Anjara, according to The Syrian Observatory for Human Rights.\nThe monitor said there had been heavy air strikes and clashes between government and rebel forces since Sunday in the northern province, which is controlled by a mixture of moderate and Islamist rebels.\nAt least 12 children and three adults were killed, and 20, all of them children and teachers, injured in a Russian air strike that hit a school near Aleppo (pictured is a protest in Aleppo today)\nPhotos distributed by media activists in Aleppo province showed a classroom full of rubble with the wooden tops of desks blown off their metal frames.\nThe Britain-based Observatory also reported that three children were killed by rebel rocket fire on a government-held district in Aleppo city.\nControl of the city has been divided between government forces in the west and rebel fighters in the east since shortly after fighting began there in mid-2012.\nGovernment forces regularly carry out air raids on the east, while rebels fire rockets into the west.\nThe situation is largely reversed in the countryside surrounding the city, with rebels controlling much of the area west of Aleppo, and the government present to the east.\nRussian warplanes have been conducting air strikes against Islamic State jihadists and other groups in Syria since September\nRussia, a staunch ally of President Bashar al-Assad's regime, began air strikes in support of the central government in late September.\nIt says it is targeting the Islamic State group and other 'terrorists,' but a third of those killed in its strikes have been civilians, according to the Observatory.\nThe monitor said in late December that Russian air strikes had killed more than 2,300 people since they began on September 30, among them 792 civilians.\nMoscow has slammed as 'absurd' allegations that its strikes have killed civilians.","url":"https://www.dailymail.co.uk/news/article-3393675/8-children-dead-Russia-strike-hits-Syria-school-monitor.html"}
