{"authors":["Associated Press"],"date_download":"2018-10-23 01:35:09","date_modify":"2018-10-23 01:35:09","date_publish":"2016-01-11 12:41:50","description":"MOSCOW (AP) — The Russian ruble fell sharply on its first day of trading after a ten-day holiday period, as a drop in the price of oil cast a shadow across t...","filename":"data/vaneerConsumption/Russiasrubleslumpsonfirstdayoftradingafterholiday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:9b094ed58952459ebaf7af70a4b621c5-56CX32zFKLb7123928b84cebc0c7-782_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393540_Russias-ruble-tanks-day-trading-holiday_1540258509.html","title":"Russia's ruble slumps on first day of trading after holiday","title_page":"Russia's ruble slumps on first day of trading after holiday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Russia's ruble slumps on first day of trading after holiday\nMOSCOW (AP) — The Russian ruble fell sharply on its first day of trading after a ten-day holiday period, as a drop in the price of oil cast a shadow across the energy-exporting economy.\nThe national currency dropped by nearly 2 percent half an hour into trading, to 76.1 rubles, as the Moscow exchange resumed trading in foreign exchange for the first time since Dec. 31.\nThe price of oil, the backbone of the Russian economy, has declined over the past week amid fears about a slowdown in China's growth. Russia has also been hit by economic sanctions that Western nations imposed following the 2014 annexation of Ukraine's Crimea.\nPeople stand at a bus stop in front of an exchange office sign showing the currency exchange rates of the Russian ruble, U.S. dollar, and euro in Moscow, Russia, Monday, Jan. 11, 2016. The Russian ruble has tanked on the first day of trading after a ten-day holiday period as the price of oil continues to decline. The national currency dropped by nearly 2 percent half an hour into trading to 76.1 rubles on Monday at the Moscow stock exchange's first currency trading session since Dec. 31. (AP Photo/Alexander Zemlianichenko)\nThe sharp decline in the price of oil, now trading at 12-year lows at $34 per barrel for Brent crude, will likely cause a drain on Russia's reserves and push the government to cut down on expenses.\nRussia has based its budget this year on an average oil price of $50 per barrel and Finance Minister Anton Siluanov indicated last month that the government is prepared for cuts if crude were to fall to $30. The Russian daily Vedomosti last month quoted a ministry draft proposal that would see budget expenses cut by 5 percent across the board.\nRussia is running a budget deficit of 3 percent of GDP this year and since President Vladimir Putin has ordered it to be kept below that level, the government will have to let the ruble depreciate further to balance the budget.\nAnalysts at Bank of America Merrill Lynch said in a research note last month that the ruble would need to weaken to a staggering 94 rubles to the dollar if Russia wants to keep its budget deficit below 3 percent.\nAfter the economy shrank 3.8 percent drop last year, the Russian economic development ministry expected it to return to growth of about 0.7 percent this year. But with the further drop in oil prices, the economy could instead shrink another 3 percent, the ministry warned.\nSpeaking in an interview with the German newspaper Bild published Monday, Putin sought to assuage fears of an economic crisis.\n\"We believe that we will gradually be looking at the stabilization and the rise of the economy,\" he said, adding that the government is investing in the high-tech industry and domestic manufacturing, which should help growth in the future.\nUnlike in the 1990s, Russia is much better prepared for a recession as its debt levels are low and it has $340 billion in gold and currency reserves. But they may be running low soon.\nFinance Minister Siluanov warned last month that Russia would likely deplete one of its two rainy day funds, now worth roughly $52 billion, by the end of 2016 as it tries to plug the state deficit.\nSign showing the currency exchange rates of the Russian ruble, U.S. dollar is seen with the skyscrapers of the \"Moscow City\" in the background in Moscow, Russia, Monday, Jan. 11, 2016. The Russian ruble has tanked on the first day of trading after a ten-day holiday period as the price of oil continues to decline. The national currency dropped by nearly 2 percent half an hour into trading to 76.1 rubles on Monday at the Moscow stock exchange's first currency trading session since Dec. 31. (AP Photo/Alexander Zemlianichenko)\nPeople enter a shopping mall passing an exchange booth in downtown Moscow, Russia, on Monday, Jan. 11, 2016. The Russian ruble has tanked on the first day of trading after a ten-day holiday period as the price of oil continues to decline. The national currency dropped by nearly 2 percent half an hour into trading to 76.1 rubles on Monday at the Moscow stock exchange's first currency trading session since Dec. 31. (AP Photo/Ivan Sekretarev)\nPeople walk past a sign showing the currency exchange rates of the Russian ruble, U.S. dollar, and euro in Moscow, Russia, Monday, Jan. 11, 2016. The Russian ruble has tanked on the first day of trading after a ten-day holiday period as the price of oil continues to decline. The national currency dropped by nearly 2 percent half an hour into trading to 76.1 rubles on Monday at the Moscow stock exchange's first currency trading session since Dec. 31. (AP Photo/Alexander Zemlianichenko)","url":"https://www.dailymail.co.uk/wires/ap/article-3393540/Russias-ruble-tanks-day-trading-holiday.html"}
