{"authors":["Associated Press"],"date_download":"2018-10-23 00:35:27","date_modify":"2018-10-23 00:35:27","date_publish":"2017-03-10 07:19:07","description":"Russia World Cup head Vitaly Mutko has been barred from seeking re-election to FIFA's top decision-making body after failing an eligibility check.FIFA's...","filename":"data/vaneerConsumption/RussiaWorldCupheadVitalyMutkobarredfromFIFACouncil.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195019-1489136682-376_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300192_FIFA-bans-Russias-Mutko-council-election_1540254927.html","title":"Russia World Cup head Vitaly Mutko barred from FIFA Council","title_page":"Russia World Cup head Vitaly Mutko barred from FIFA Council | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Russia World Cup head Vitaly Mutko has been barred from seeking re-election to FIFA's top decision-making body after failing an eligibility check.\nFIFA's review committee has ruled that Mutko can no longer sit on the FIFA Council because of his role as a deputy prime minister of Russia, people familiar with the decision told The Associated Press. The people spoke on condition of anonymity because they were not authorized to discuss the eligibility checks on Mutko, who confirmed the decision later Friday.\nMutko's exclusion from the election is due to a clampdown on government interference in soccer rather than a separate, ongoing FIFA ethics examination of a World Anti-Doping Agency report that implicates him in Russia's doping cover-ups.\nFILE - In this Sunday, July 24, 2016, file photo, Russian Sports Minister Vitaly Mutko speaks to the media in Moscow, Russia. People with knowledge of the decision say Russia World Cup head Vitaly Mutko has been barred from seeking re-election to FIFA's top decision-making body after failing an eligibility check. (AP Photo/Pavel Golovkin, File)\nMutko, who is also president of Russia's soccer federation, said he will not mount an appeal against FIFA's decision to exclude him from the April 5 election.\n\"I wanted to get re-elected, but FIFA has changed its criteria,\" Mutko said in comments carried by the Tass news agency. \"A new criterion has been introduced: political neutrality. They want the organization to be politically neutral, so that officials and representatives of the government don't get elected, and that's their right.\"\nMutko will lose the position on FIFA's ruling body, which he has held since 2009, just as Russia prepares to host the Confederations Cup in three months as the warmup event for the 2018 World Cup.\nNow four men are in line for four European places at the UEFA Congress next month: Sandor Csanyi, a current UEFA executive committee member from Hungary; Geir Thorsteinsson, president of Iceland's soccer federation; former AC Milan player Dejan Savicevic, Montenegro's federation president; and Costakis Koutsokoumnis, the Cyprus federation president.\nFIFA has long prohibited government interference in how member federations run their own affairs, but Mutko has had multi-task status as head of the World Cup preparations, Russian federation and FIFA Council member for several years.\nMukto was sports minister when he formally joined FIFA's executive committee, the precursor to the council, in 2009. That was the same day FIFA's congress approved stricter new rules protecting member federations and soccer officials from government meddling.\nMutko's re-election bid has now been thwarted by a more exacting interpretation of FIFA rules restricting \"political interference\" by the new review committee assessing the eligibility of officials for top posts headed by former Portuguese government minister Miguel Poiares Maduro.\nThis is the first time Mutko has undergone an integrity check since they were introduced as part of anti-corruption reforms begun by Sepp Blatter in the fallout from the Russia-Qatar World Cup hosting decisions in 2010 and subsequent failed presidential election bid by Mohamed bin Hammam of Qatar.\nMutko was promoted from sports minister to deputy prime minister last year and he retains responsibility for sports despite being directly implicated in a wider doping scandal in Russia.\nFive suspicious samples in the Russian men's under-17 and under-21 national teams in 2013 and 2014 were exposed in emails released in December by the World Anti-Doping Agency, accompanying investigator Richard McLaren's report into Russian doping.\nMutko has been accused of covering up a doping case in the Russian league.\nRussia was also accused by McLaren of subverting doping procedures at the 2014 Sochi Winter Olympics while Mutko was sports minister, with intelligence officers involved in tampering with samples of Russian medal winners.\n___\nAP Sports Writer Graham Dunbar in Geneva contributed to this report.\nRob Harris can be followed at -www.twitter.com/RobHarris and -www.facebook.com/RobHarrisReports","url":"https://www.dailymail.co.uk/wires/ap/article-4300192/FIFA-bans-Russias-Mutko-council-election.html"}
