{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:42:22","date_modify":"2018-10-30 19:42:22","date_publish":"2018-06-26 02:54:18","description":"Russia reportedly breached a ceasefire deal late Saturday night that it had brokered with the United States and Jordan last July by carrying out airstrikes on in rebel-held Daraa, Syria.","filename":"data/vaneerConsumption/RussiaBreaksCeasefireDealwithAirstrikesonSyrianRebelsinSouth.json","image_url":"https://media.breitbart.com/media/2018/06/airstrike-daraa-syria-6-25-18-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_06_25__1540928542.html","title":"Russia Breaks Ceasefire Deal with Airstrikes on Syrian Rebels in South","title_page":"Russia Breaks Ceasefire Deal with Airstrikes on Syrian Rebels in South","title_rss":"NULL","source_domain":"breitbart.com","text":"Russia reportedly breached a ceasefire deal late Saturday night that it had brokered with the United States and Jordan last July by carrying out airstrikes on in rebel-held Daraa, Syria, against forces opposed to Syrian dictator Bashar al-Assad, leaving at least five civilians dead and destroying a hospital and emergency rescue center during the process.\n“This is once again an example of Russia flouting arrangements it has entered into with no regard for civilian lives,” a State Department official said in response to the attacks, according to the Wall Street Journal.\nThe publication also noted that forces aligned with Assad reportedly dropped leaflets demanding rebels in the area surrender themselves prior to carrying out the airstrikes.\nAccording to the AFP, the Syrian Observatory for Human Rights said around 25 airstrikes slammed into rebel-held towns.\nRussia has had active warplanes in Syria since 2015. Moscow had refrained from bombing any Syrian rebel positions in the south before Saturday evening. The AFP reported that “violence has been ratcheting up this week as Syrian government forces look to retake the south militarily.”\nThe Wall Street Journal reported that the State Department expressed concern about the airstrikes and said it had been in touch with the Russian government and “parties on the ground.”\nSaber Sifer, the political representative of one of Daraa’s largest rebel groups, reportedly said the Syrian regime needed Russia to carry out the airstrikes on the rebel-held positions because it is “not capable of advancing on its own.”\nRussia is seen as Syria’s strongest military ally, along with Iran. According to reports by multiple Syrian rebel commanders, Syrian regime forces have, in recent weeks, disguised Iranian fighters and Iranian-backed and trained foreign fighters as Syrian fighters by providing them with their own uniforms and having them raise Syria’s flags.\nThe Sunni Free Syrian Army (FSA) and the Eastern Lions Brigade, a fellow Syrian rebel group formerly affiliated with the FSA, are among rebel groups fighting against Assad’s forces and Iranian influence in the south. In other parts of the country, Kurdish independence groups are fighting against Assad and his regime in addition to confronting Turkey, which has invaded northern Syria’s Afrin region.\nWidespread protests in Iran over the past few months have been the direct result of the Iranian regime’s decision to invest in foreign interventionism in places like Syria, Iraq, Libya, and Lebanon. As unemployment continues to beleaguer about 40 percent of Iran’s population, protests against the regime continued to grow.\nAdelle Nazarian is a politics and national security reporter for Breitbart News. Follow her on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/06/25/russian-breaks-cease-fire-deal-with-airstrikes-on-syria/"}
