{"authors":["John Hayward"],"date_download":"2018-10-30 20:35:48","date_modify":"2018-10-30 20:35:48","date_publish":"2015-04-27 14:20:19","description":"President Barack Obama's email was compromised when Russian hackers invaded the White House computer system.","filename":"data/vaneerConsumption/RussianHackersReadObamasEmailsinWhiteHouseComputerSystemHack.json","image_url":"https://media.breitbart.com/media/2014/12/dark-computer-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_27__1540931748.html","title":"Russian Hackers Read Obama's Emails in White House Computer System Hack","title_page":"Russian Hackers Read Obama's Emails in White House Computer System Hack | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“Some of President Obama’s email correspondence was swept up by Russian hackers last year in a breach of the White House’s unclassified computer system that was far more intrusive and worrisome than has been publicly acknowledged,” The New York Times reported over the weekend, based on comments from “senior American officials briefed on the investigation.”\nWhen the administration decided to drop the bombshell admission that hackers entered the Defense Department network as part of Defense Secretary Ashton Carter’s speech at Stanford University, I wrote about the “glacial pace” at which states reveal this sort of information and expected similar declarations in the future.\nAnd here we are, learning that the White House breach was “far more intrusive and worrisome than has been publicly acknowledged.” According to The New York Times, senior White House officials have known about the true extent of the data breach for months, which means they have been lying to the American people about it for months. Officials are still not willing to go on the record with what they know; the Times got a round of “no comment” responses from the White House and National Security Council.\nThe NYT explains that the unclassified system “routinely contains much information that is considered highly sensitive: schedules, email exchanges with ambassadors and diplomats, discussions of pending personnel moves and legislation, and, inevitably, some debate about policy.”\nTo restate the “information is ammunition” point, there are good reasons to keep some details of cyber warfare secret; one official told the NYT they wanted to keep the extent of the breach secret “to avoid tipping off the Russians about what had been learned from the investigation.” But as usual, the Obama White House goes too far and gives itself blanket permission to deceive the American public as much as it pleases. Once again, we see a story that would have been huge if the truth came out all at once, getting strung across months of the ever-churning news cycle until it becomes a footnote.\nThe newspaper notes that the administration’s reluctance to point fingers at the Russian government is a marked contrast to the way they loudly blamed the Sony hack on North Korea. The Russian attack was so severe that it was still changing the way our State Department did business during the Iranian nuclear negotiations, with officials obliged to use personal accounts because the State system was still unreliable. And yet, the administration is bending over backward to avoid officially implicating the Russian government. Presumably, this is some combination of embarrassment and a desire to avoid being pressured into a confrontation with the Russians.","url":"https://www.breitbart.com/national-security/2015/04/27/russian-hackers-read-obamas-emails-in-white-house-computer-system-hack/"}
