{"authors":["Hannah Al-Othman For Mailoline"],"date_download":"2018-10-23 02:06:27","date_modify":"2018-10-23 02:06:27","date_publish":"2017-03-16 12:23:03","description":"Ryan Wiik claims Tasmin Lucia-Khan sexually manipulated him and spread false rumors about him, according to a complaint filed in L.A. County Superior Court on Wednesday.","filename":"data/vaneerConsumption/RyanWiiksuesTasminLuciaKhanforsexualmanipulation.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E539FA300000578-0-image-a-13_1489662812526.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319892_Actor-sues-woman-seduced-d-make-CEO_1540260387.html","title":"Ryan Wiik sues Tasmin Lucia-Khan for 'sexual manipulation'","title_page":"Ryan Wiik sues Tasmin Lucia-Khan for 'sexual manipulation' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ryan Wiik has filed a complaint in L.A. County Superior Court\nAn actor and producer is suing a former BBC News anchor for allegedly using sex and lies to force him out of the production company that he founded.\nRyan Wiik claims Tasmin Lucia-Khan sexually manipulated him and spread false rumors about him, according to a complaint filed in LA County Superior Court yesterday.\nThe 35-year-old is suing Tasmin Lucia-Khan for defamation, fraud and invasion of privacy.\nKhan told The Hollywood Reporter that his complaint is 'baseless' and 'reads like a Hollywood movie script'.\n'I've never manipulated anyone or seduced anyone to get a job,' she said.\n'I take great offense, being a strong female who has worked very hard. We're in 2017. Women can get jobs by working really hard and being damn good at their jobs.'\nShe says that Wiik resigned voluntarily over creative differences, and was shocked upon reading his lawsuit.\n'It's quite upsetting to read this and I will be taking action,' she said. 'I'm not going to allow these salacious claims to be floating around.'\nKhan is best known in the UK for being the face of BBC Three News, hosting E24 on BBC News, and fronting the morning news for breakfast show Daybreak, pictured\nThe Norwegian native says he founded WR Films Entertainment Group in 2009 to develop and produce feature films, with the intention of making a franchise based on a series of classic Western books by Louis Masterson.\nFour years later, he entered into a talent agreement with his company to star in the first Morgan Kane film and two possible sequels.\nThe actor says he met Khan in 2015, and claims she seduced him in order to manipulate her way into a position of power within his company.\nKhan, 36, is a British film producer, television personality, entrepreneur, who is best known in the UK for being the face of BBC Three News, hosting E24 on BBC News, and fronting the morning news for breakfast show Daybreak.\nThe Oxford University-educated daughter of Bangladeshi immigrants moved to the US in 2012 to pursue opportunities there, after 15 years on UK television, and from 2013 onwards was NBC Extra's 'Special Correspondent' covering celebrity interviews, and entertainment and news stories, including the birth of the royal babies.\nWiik claims that Khan told him she could protect him from damaging press if and when his company went public, before seducing him until she secured her desired role in the company.\nHe claims she was offered the titles of VP public relations and COO, but demanded to be made CEO of the company.\nKhan says that the complaint is 'baseless' and 'reads like a Hollywood movie script'\nThe actor says that he relented after 'weeks of sexual and emotional manipulation by Khan'.\nEarly last year, WR became a publicly traded company in Norway as Wiik attempted to raise funds to produce Morgan Kane.\nHe claims that Khan brought an outside investor onto the company's board and then began trying to take over the company by holding secret meetings without his knowledge.\n'On information and belief, Khan also held secret meetings in Norway with other investors to negotiate additional advantageous deal points for herself as CEO,' attorney Neville Johnson wrote in the complaint.\n'These new deal points, benefiting Khan, were secretly negotiated between Khan and the investors, and were later presented to the WR board of directors as a condition which WR had to accept in order to receive funding from the investors.'\nHe further claims that Kham then tried to destroy his reputation by falsely telling shareholders and board members that he offered investors sexual favors from prostitutes in order to secure funding.\nWiik claims that because of the rumors a board member demanded he 'burn his acting contract' for Morgan Kane.\n'However, while working hard to destroy Wiik's position in the company, outside of work, Khan continued to seduce Wiik, insisted that they continue their sexual affair, and filmed their sexual activities on her and his phone,' Johnson writes in the complaint.\nWiik is seeking exemplary and punitive damages in an amount to be determined at trial.","url":"https://www.dailymail.co.uk/news/article-4319892/Actor-sues-woman-seduced-d-make-CEO.html"}
