{"authors":["Sameer Suri For Dailymail.Com"],"date_download":"2018-10-23 04:14:24","date_modify":"2018-10-23 04:14:24","date_publish":"2017-03-16 15:27:57","description":"Ryan Reynolds was spotted in Times Square on Thursday, wearing a form-fitting navy suit for his spot on Good Morning America, where he was promoting his new space thriller Life.","filename":"data/vaneerConsumption/RyanReynoldshitsGoodMorningAmericainNewYorkCity.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54EBB700000578-0-image-a-15_1489676268236.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320432_Ryan-Reynolds-dishes-friendship-Jake-Gyllenhaal_1540268064.html","title":"Ryan Reynolds hits Good Morning America in New York City","title_page":"Ryan Reynolds hits Good Morning America in New York City | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ryan Reynolds was spotted in Times Square on Thursday, wearing a form-fitting navy suit for his spot on Good Morning America.\nThe 40-year-old, who is married to actress Blake Lively, looked like a silver fox with his slightly grey hair and beard.\nThe actor was on the morning TV show to talk up his new space thriller Life. In doing so he gushed about his friendship with his co-star Jake Gyllenhaal, saying: 'We're hanging out all the time!'\nScroll down for video\nDapper Dan: Ryan Reynolds was spotted in Times Square on Thursday, wearing a form-fitting navy suit for his spot on Good Morning America\nThe Vancouver native had explained, 'I've done, I've - probably almost 50 movies in 24 years, and every time you work with people, you're like: \"I'm gonna hang out with this guy all the time!\" And you never see them again.'\nCalling Gyllenhaal 'easily the most interesting actor working in Hollywood' and 'one of the kindest guys I've ever met,' he revealed that they have kept a relationship.\nIt helps that they live near each other, he said, though there is some source of contention: 'Blake, my wife, is a very - is very good at cooking, and Jake might be just a little bit better,' he said. He added: 'It gets very competitive between those two.'\nSo distinguished: The 40-year-old had flecks of grey in his stubble, and he'd added a pop of contrast to his outfit by way of a pink and tan pocket square\nLife, penned by Deadpool screenwriters Rhett Reese and Paul Wernick, also stars Rebecca Ferguson, Hiroyuki Sanada, Ariyon Bakare and Olga Dihovichnaya.\nThe six of them play an International Space Station crew who pick up a Martian life form, only to discover it's highly dangerous and punishingly strong.\nReynolds also dished a bit about what fans of Deadpool can expect from the upcoming sequel to the darkly comic 2016 superhero film.\nWork-life balance: He was on the show promoting his new space thriller Life, and gushed about his friendship with his co-star Jake Gyllanhaal, saying: 'We're hanging out all the time!'\nHe confided that 'there's a lot of stuff we were trying to get in the first one that we just had to, unfortunately had to cut for time, that we may try to see if we can sneak in somewhere else.'\nTo hear him tell it, 'We had, in Deadpool 1, we actually had a whole sequence where Deadpool sings The Gambler, Kenny Rogers' Gambler, while kicking people's butts.'\nThough 'maybe that'll see the light of day again,' he conceded that 'There's something to be said about letting everything else go, and just doing a totally new movie, though, too.'\nIncoming: Life, penned by Deadpool screenwriters Rhett Reese and Paul Wernick, stars the actors amid a cast that includes Rebecca Ferguson\nThe interview had also touched on the new derriere-baring Deadpool short film that's currently playing ahead of Logan in movie theaters, and Reynolds assured the audiences that production on the sequel will begin 'real soon.'\nIn the short film, Deadpool spots an old man being mugged and resolves to help, but spends rather too much time in a nearby phone booth changing into superhero gear.\nMeanwhile, Life will open in movie theaters next Friday after throwing its world premiere this Friday at the South By Southwest Film Festival in Austin.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320432/Ryan-Reynolds-dishes-friendship-Jake-Gyllenhaal.html"}
