{"authors":["Rory Brigstock-Barron For Mailonline"],"date_download":"2018-10-23 01:15:12","date_modify":"2018-10-23 01:15:12","date_publish":"2016-01-29 15:03:43","description":"UFC FIGHT NIGHT NEW JERSEY PREVIEW: Anthony Johnson and Ryan Bader fight for their shot at the light-heavyweight belt against Daniel Cormier or Jon Jones.","filename":"data/vaneerConsumption/RyanBaderwantstodragAnthonyJohnsonintodeepwateratUFCFightNightNewJerseyinsearchofillusivetitleshot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30ACEBFE00000578-0-image-a-17_1454028626518.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_ufc_article-3421481_Ryan-Bader-wants-drag-Anthony-Johnson-deep-water-UFC-Fight-Night-New-Jersey-search-illusive-title-shot_1540257312.html","title":"Ryan Bader wants to drag Anthony Johnson into 'deep water' at UFC Fight Night New Jersey in search of illusive title shot","title_page":"Ryan Bader wants to drag Anthony Johnson into 'deep water' at UFC Fight Night New Jersey in search of illusive title shot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With Daniel Cormier's rematch with Jon Jones all but confirmed for some time this spring, a huge fight between Anthony Johnson and Ryan Bader will decide the No 1 contender in the UFC's light-heavweight division on Saturday.\nJohnson, who rebounded from his failed tilt at the belt against Cormier last May to knock out Jimmy Manuwa in September, is looking for his second shot at UFC gold, but will have his work cut out against a rejuvenated Bader - riding a five-fight win streak.\nThe 32-year-old is coming off a win against Johnson's team-mate and former champion Rashad Evans, the most impressive of his great run which has also seen him take decision victories over Phil Davis and Ovince Saint Preux.\nScroll down for video\nAnthony Johnson (left) will be looking to showcase his knockout power once again on Saturday night\nThe former title challenger faces Ryan Bader in New Jersey for the light-heavyweight No 1 contender spot\nBut Bader, who arrived in the UFC in 2009 and is yet to fight for the belt, has a habit of falling at the penultimate hurdle.\nThe two-time All-American wrestler was submitted by Jones - who then went on to become champion - and was knocked out by Lyoto Machida and Glover Teixeira in fights that would have put him into title contention in an ever-thinning division.\nKnockout artist Johnson is clearly the highest calibre opponent Bader has faced since his loss to Teixeira two and a half years ago, and will be a true test of how far he has come.\nThe blueprint for beating Johnson was laid out by another wrestling-based fighter, champion Daniel Cormier, and while Bader's grappling credentials don't match the Olympian's - he too will try and take Johnson into the later rounds, where he has a habit of drowning.\nBader (left) beat Johnson's team-mate and former UFC champion Rashad Evans last October\n'Rumble' said: 'I believe 95 percent of the time I have a good chance of knocking you out'\n'When it gets into the fight game and we take him (Johnson) to deep waters, we'll see how he responds and maybe he'll be something different, but he hasn't shown that in the past,' Bader's coach Aaron Simpson said on the MMA Hour.\n'We know he's got that bully mentality. He's a freak when he can be, man. He is very dangerous, and that's evident. [But] Daniel Cormier outlasted [Johnson] because he knew was going to be tougher than him. So that's the same mentality Bader has.'\nJohnson has scored knockouts in all but one of his four wins since returning to the UFC in 2014, even finishing Alexander Gustafsson, who ran both Jones and Cormier close over five rounds.\n'Rumble' was close to claiming the belt when he knocked down Cormier in the first round of their title fight last May but was worn down in the third round and submitted.\nFormer UFC heavyweight champion Josh Barnett will fight Ben Rothwell in the co-main event\nBarnett is well aware of Rothwell's power but believes he can exploit 'Big Ben' where he is weak\nSince then the 31-year-old has been getting back to his wrestling and this fight could test how far he has come in that department.\n'Of course, I believe I can knock out anybody that I fight,' Johnson said. 'I’m not saying I’ve always been successful, but I believe 95 percent of the time I have a good chance of knocking you out.\n'But I’m not going in there thinking I’m just going to knock him out. I’m going in there and thinking I seriously have to fight this guy and beat him up so I can win. That’s it.'\nBefore the light-heavyweights square off, resurgent heavyweights Josh Barnett and Ben Rothwell will fight in a co-main event which will see one man move into the title picture.\nBarnett, who was UFC champion well over a decade ago, returned to action with an impressive win over Roy Nelson in September and Rothwell is on a three-fight win-streak which includes a knockout of former Strikeforce and Glory champion Alistair Overeem.\nRothwell is riding a three-fight win-streak including a victory over Alistair Overeem\nBig Ben's last win came against Matt Mitrione who he submitted in the first round in June\nRothwell will feel hard done by after his fight with Stipe Miocic, set for October, was cancelled for the now No 1 contender to face and knock out Andrei Arlovski.\n'Big Ben' now has a chance to prove he should not have been overlooked, but faces a man with every trick in the book on Saturday.\nBarnett is as wily a veteran as they come in MMA and could make it a tough night for Rothwell if he can avoid those heavy hands.\n'He's a big ogre man, and he swings hard and often,' Barnett said of Rothwell. 'He doesn't have a lot of the technical refinements but he's got a hellacious chin and he's got one punch knockout power which is dangerous.'\nAlso on the card is a bantamweight showdown between dangerous finisher Iuri Alcantara and 18-1 American Jimmie Rivera.\nKicking off the main card action is 19-year-old sensation Sage Northcutt who faces Bryan Barberena in the young star's first fight at welterweight in the UFC.","url":"https://www.dailymail.co.uk/sport/ufc/article-3421481/Ryan-Bader-wants-drag-Anthony-Johnson-deep-water-UFC-Fight-Night-New-Jersey-search-illusive-title-shot.html"}
