{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-22 21:58:56","date_modify":"2018-10-22 21:58:56","date_publish":"2017-03-16 02:14:22","description":"Ryan Reynolds was forced to pull out of an appearance on The One Show on Wednesday after a heavy snow storm left him stranded in New York.","filename":"data/vaneerConsumption/RyanReynoldsisforcedtopulloutofTheOneShow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/253DF81100000578-0-image-a-262_1489630626886.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318620_Ryan-Reynolds-forced-pull-One-Show_1540245536.html","title":"Ryan Reynolds is forced to pull out of The One Show","title_page":"Ryan Reynolds is forced to pull out of The One Show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ryan Reynolds was forced to pull out of an appearance on The One Show on Wednesday after a heavy snow storm left him stranded in New York.\nThe Critics Choice Awards winner, 40, was caught up in Storm Stella, forcing his co-stars Jake Gyllenhaal and Rebecca Ferguson to go on without him as they promoted their new film, Life.\nIt was down to hosts Matt Baker and Michelle Ackerley to break the bad news, as they explained: 'We must say hello to your co-star Ryan Reynolds who was meant to be with us today, wasn't he? But unfortunately he's been caught up in that storm in the East coast.'\nScroll down for video\nStranded: Ryan Reynolds was forced to pull out of an appearance on The One Show on Wednesday after a heavy snow storm left him stranded in New York\nLuckily the pair were more than happy to go on as a duo, with Jake full of kind words for Ryan as he discussed their intense 'bromance'.\n'He’s a wonderful man,' Jake said. It’s rare in our industry to meet someone, a contemporary, and there’s no competition.'\nThere's just some friends you meet at a certain time in your life. We met on this movie and became really close friends.\nTwo's company: The Critics Choice Awards winner, 40, was caught up in Storm Stella, forcing his co-stars Jake Gyllenhaal and Rebecca Ferguson to go on without him as they promoted their new film, Life\nChirpy: Luckily the pair were more than happy to go on as a duo, with Jake full of kind words for Ryan as he discussed their intense 'bromance'\nThe Oscar-nominated actor also admitted Ryan's famous humour helped lighten the tense mood on set.\nJake and Rebecca have been without Ryan on the European promo trail for their highly anticipated new sci-fi movie.\nThe movie's first trailer was released by Sony Pictures last month, giving fans a first look at the Sci-fi thriller due out later this year.\nFirm friends: 'He’s a wonderful man,' Jake said. It’s rare in our industry to meet someone, a contemporary, and there’s no competition'\nJake and Ryan play astronauts who are a part of a team of scientists aboard the International Space Station who fight to save Earth from an evolving life form on Mars.\nThe pair star alongside Ariyon Bakare, Rebecca Ferguson as well as Hiroyuki Sanada and Olga Dihovichnaya.\nIt's set directed by Daniel Espinosa and written by Deadpool screenwriters Paul Wernick and Rhett Reese.\nThe highly-awaited flick is set to hits theatres on March 24.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318620/Ryan-Reynolds-forced-pull-One-Show.html"}
