{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 00:23:41","date_modify":"2018-10-23 00:23:41","date_publish":"2017-03-10 06:53:41","description":"The Deadpool actor, 29, tuned into his earbuds as he stepped out in the chilly city by himself. It seems Ryan's wife Blake Lively may still be in Canada, as she was in Toronto on Wednesday.","filename":"data/vaneerConsumption/RyanReynoldsrocksjeansandsuedejacketforsolostroll.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E2095EE00000578-0-image-a-4_1489129075260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300102_Ryan-Reynolds-rocks-jeans-suede-jacket-solo-stroll_1540254221.html","title":"Ryan Reynolds rocks jeans and suede jacket for solo stroll","title_page":"Ryan Reynolds rocks jeans and suede jacket for solo stroll | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His wife Blake Lively traveled to Toronto for an event yesterday.\nAnd Ryan Reynolds enjoyed some time to himself as he stepped out for a stroll in New York City on Thursday.\nThe Deadpool actor, 29, plugged into his earbuds as he stepped out in the city by himself.\nHitting his stride! Ryan Reynolds enjoyed some time to himself as he stepped out for a stroll in New York City on Thursday\nRyan rocked a suede dark green jacket, jeans, and a pair of small black sunglasses.\nGlasses in one hand, the actor stepped across the street in his cosy black and white trainers.\nClearly relaxed, the actor rocked a salt and pepper five o'clock shadow, giving his expression a more rugged touch.\nIt seems Ryan's wife Blake may still be in Canada, as the actress was the special guest at the L'Oreal Paris Women Of Worth Gala in Toronto.\nMan of style! Ryan rocked a suede dark green jacket, jeans, and a pair of small black sunglasses\nFamily life: Ryan and Blake Lively are based in New York where they are raising their daughters, James, two, and Ines, five months (pictured in Hollywood in December)\nRyan and Blake are based in New York where they are raising their daughters, James, two, and Ines, five months.\nThe couple tied the knot in South Carolina in 2012.\nRyan was previously married from 2008 to 2011 to actress Scarlett Johansson.\nBlake last starred in the action film The Shallows and thriller All I See Is You, while Ryan gears up for Deadpool 2.\nHe will also be starring opposite Jake Gyllenhaal and Hiroyuki Sanada in the upcoming thriller Life, which is scheduled for release on March 24.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300102/Ryan-Reynolds-rocks-jeans-suede-jacket-solo-stroll.html"}
