{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-22 23:04:17","date_modify":"2018-10-22 23:04:17","date_publish":"2016-01-28 11:40:31","description":"Hearing of the news the 39-year-old actor took to Twitter and responded to the Zayn's cancellation in his usual glib and wry way, joking that he'd got his 'lips done for nothing'.","filename":"data/vaneerConsumption/RyanReynoldsexpresseshismockoutrageatZaynMalikoverGrahamNorton.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA83CB00000578-0-image-a-20_1453987632970.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420770_Ryan-Reynolds-expresses-mock-outrage-Zayn-Malik-pulling-slot-Graham-Norton-show_1540249457.html","title":"Ryan Reynolds expresses his mock outrage at Zayn Malik over Graham Norton","title_page":"Ryan Reynolds expresses his mock outrage at Zayn Malik over Graham Norton | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Zayn Malik shocked many when it was announced he was pulling out of his first solo TV interview since leaving One Direction.\nBut non more so than Hollywood A-Lister Ryan Reynolds, who was due to appear on The Graham Norton Show alongside the 23-year-old popstar.\nHearing of the news the 39-year-old actor took to Twitter and responded to the Zayn's cancellation in his usual glib and wry way, joking that he'd got his 'lips done for nothing'.\nScroll down for video\n'I got my lips done for nothing': Zayn Malik shocked many when it was announced he was pulling out of his first solo TV interviews since leaving One Direction, but non more so than Hollywood A-Lister Ryan Reynolds\nA disappointed fan? Hearing of the news the 39-year-old actor took to Twitter and responded to the Zayn's cancellation in his usual glib and wry way, joking that he'd got his 'lips done for nothing'\nThe Deadpool star, who treats his near 1million followers to his own unique sense of humour in regular posts, tweeted his mock outrage at Zayn's 11th hour pull-out.\nHaving heard of the news, the Canadian star quipped: 'Zayn isn't on the Graham Norton show with me anymore. I'll still go on... But obviously I got my lips done for nothing. #DeadpoolDoesLondon.'\nGathering more than 16,000 likes and nearly 10,000 retweets, Ryan's topical gag appeared to go down well with his followers and fans of the pop star.\nSee more of the latest on Zayn Malik as he pulls out of his slot on the Graham Norton Show\nWry sense of humour: The Deadpool star (pictured on Thursday), who treats his near 1million followers to his own unique sense of humour in regular posts, tweeted his mock outrage at Zayn's 11th hour pull-out\nThe tweet even gained approval from Zayn, who retweeted the gag to his 17.4million followers - adding a laughing emoji to show he found the gag hilarious.\nThe Bradford-born star was set to film the episode at some point this week alongside the Buried actor, before it went to air on Friday night - the same day his first solo track, Pillow Talk, will be unveiled.\nThe appearance would have marked Zayn's first televised interview since he quit One Direction in March last year.\nSeeing the funny side: The tweet even gained approval from Zayn, who retweeted the gag to his 17.4million followers - adding a laughing emoji to show he found the gag hilarious\nHowever, it's believed his decision to pull out of the show stemmed from scheduling conflicts, as the singer continues to put together the finishing touches on his debut album.\n'Due to unforeseen scheduling conflicts with recording commitments, Zayn's appearance on Graham Norton has been postponed,' a rep for the star told MailOnline.\n'Zayn has confirmed that he would love to appear on the show at a later date.'\n'Due to unforeseen scheduling conflicts with recording commitments, Zayn's appearance on Graham Norton has been postponed': The appearance would have marked Zayn's first televised interview since he quit 1D\nHowever, a source told The Sun that there may be a little more to the story, spilling: 'This is a very last-minute decision from Zayn and his team.\n'They have put it down to scheduling issues but this is an appearance that has been in the diary for a while now.\n'But it will spark talk of something being wrong behind the scenes. This appearance is a big deal to both Zayn and his fans,' they added.\nAccording to Digital Spy, the former X Factor star was set to talk about his upcoming album, while Ryan is on the show to plug his highly-anticipated Deadpool movie.\nDue to hit screens on February 10, the film is centred around Marvel's antihero, Wade Wilson - AKA Deadpool, the merc with a mouth - and his exploits as a superhuman hit-man and mercenary.\nThe merc with a mouth: According to Digital Spy, the former X Factor star was set to talk about his upcoming album, while Ryan is on the show to plug his highly-anticipated Deadpool movie (pictured)\nDapper gent: Ryan ditched the red and black leather of Deadpool for a smart ensemble, as he headed out into London to promote the film on Thursday\nCasually suave: Sporting a navy overcoat, shirt and knitted tie, the A-Lister cut a suave figure","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420770/Ryan-Reynolds-expresses-mock-outrage-Zayn-Malik-pulling-slot-Graham-Norton-show.html"}
