{"authors":["Kelsey Snell"],"date_download":"2018-10-22 21:27:14","date_modify":"2018-10-22 21:27:14","date_publish":"2018-07-24 00:00:00","description":"The House speaker also said he would not invite Russian President Vladimir Putin to address Congress if he visits in the fall: \"That's something we reserve for allies.\"","filename":"data/vaneerConsumption/RyanTrumpThreatToRevokeSecurityClearancesIsTrollingPeople.json","image_url":"https://media.npr.org/assets/img/2018/07/24/ap_18205548224000_wide-eb8ae7122884035d49360ff5740e90c81d3307d5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_24_631870467_ryan-trump-threat-to-revoke-security-clearances-is-trolling-people_1540243634.html","title":"Ryan: Trump Threat To Revoke Security Clearances Is 'Trolling People'","title_page":"Ryan: Trump Threat To Revoke Security Clearances Is 'Trolling People' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ryan: Trump Threat To Revoke Security Clearances Is 'Trolling People'\nEnlarge this image toggle caption Jacquelyn Martin/AP Jacquelyn Martin/AP\nHouse Speaker Paul Ryan on Tuesday downplayed a threat by President Trump to revoke security clearances for a number intelligence officials who served under President Barack Obama as \"trolling\" and not a political act.\n\"I think he's trolling people, honestly,\" Ryan told reporters. \"This is something that is in the purview of the executive branch.\"\nRyan moved on quickly when asked whether it is dangerous for Trump to threaten people's security clearances over politics. Democrats and Republicans have warned that revoking classified access over political dissent could have a chilling effect on the intelligence community.\nOn Monday, White House press secretary Sarah Sanders told reporters that the former officials could lose security clearance over political statements. The list includes former CIA Director John Brennan; former Director of National Intelligence James Clapper; former FBI Director James Comey; retired Gen. Michael Hayden, a former director of the CIA; former national security adviser Susan Rice; and former FBI Deputy Director Andrew McCabe.\n\"The president is exploring the mechanisms to remove security clearance because they've politicized and, in some cases, monetized their public service and security clearances,\" Sanders said. \"Making baseless accusations of improper contact with Russia or being influenced by Russia against the president is extremely inappropriate.\"\nSeveral people on the list, including Clapper, immediately rejected that description.\n\"I think this is a real abuse of the clearance system,\" Clapper said on CNN. \"And is that now going to become a criterion for obtaining a clearance anywhere in the government? A pledge of fealty or loyalty to President Trump?\"\nOthers, like Hayden, say they no longer receive classified briefings and don't intend to change their behavior as a result of the threat.\nOthers, including Comey, have already had their clearances revoked.\nThe move has been met with widespread criticism from people in the intelligence community. Former CIA officer John Sipher told NPR's Morning Edition that while Trump has the right to revoke security clearances, he disagrees with the reasoning.\n\"Trump is revoking these clearances not because they did anything wrong or can't be trusted, but because they disagree with him,\" Sipher said. \"He's trying to punish the people who criticize him, right, so in a sense, this does send a signal, potentially, to people in the government that there's some sort of loyalty test to having a security clearance.\"\nSome Republicans in Congress, like Virginia Republican Rep. Scott Taylor, say it would be wrong to consider political speech when issuing clearances.\nRyan on Tuesday also addressed Russian President Vladimir Putin's potential visit to Washington. Ryan told reporters that he would not invite Putin to Congress while he is in town.\nTypically, visiting heads of state are asked to travel to the Capitol for a ceremonial visit, including a speech before a joint meeting of the House and the Senate.\nBut Ryan says Putin would not get that same invitation.\n\"We certainly will not be giving him an invitation to do a joint session,\" Ryan said. \"That's something we reserve for allies.\"\nRyan said he doesn't have a problem with presidents meeting with heads of state; what matters is what they discuss in those meetings. Ryan said he hopes Trump will stress to Putin that Russia cannot interfere in U.S. affairs.\n\"If the message is stop meddling in our country, stop violating our sovereignty, then I support that,\" he said. \"But it's the message that counts.\"","url":"https://www.npr.org/2018/07/24/631870467/ryan-trump-threat-to-revoke-security-clearances-is-trolling-people"}
