{"authors":[],"date_download":"2018-10-30 01:13:25","date_modify":"2018-10-30 01:13:25","date_publish":"2018-09-17 00:05:28","description":"Just two weeks shy of 77 years after Neville Chamberlain returned from his Munich meeting with Adolf Hitler, waving an agreement he said guaranteed “peace for our time,” then-president Barack Obama proclaimed that his new deal with Iran would block “every pathway” Iran had to obtain nuclear weapons.","filename":"data/vaneerConsumption/SabotagingTrumponIransBehalf.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-Secretary_Kerry_shakes_hands_with_minister_Zarif-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862005.html","title":"Sabotaging Trump on Iran’s Behalf","title_page":"Sabotaging Trump on Iran’s BehalfThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Just two weeks shy of 77 years after Neville Chamberlain returned from his Munich meeting with Adolf Hitler, waving an agreement he said guaranteed “peace for our time,” then-president Barack Obama proclaimed that his new deal with Iran would block “every pathway” Iran had to obtain nuclear weapons.\nCalled the “Joint Cooperative Plan of Action” (JCPOA), more commonly known as Obama’s nuclear weapons deal with Iran, it was Obama’s greatest diplomatic triumph in which his secretary of state, John Kerry, shared Obama’s glory.\nThose of us who had even the slightest understanding of the agreement Obama had made — and with whom he had made it — instantly connected Munich and the JCPOA. We knew that Iran would never permit international inspectors to see what they’re doing in their military bases, so to say that his deal blocked Iran’s pathways to nuclear weapons was a horribly dangerous lie.\nEarlier this year, when President Trump revoked the deal, Obama said it was a serious mistake for him to have done so. What we didn’t know then was that Vichy John Kerry undertook a concerted private diplomatic effort, without the knowledge of the Trump administration, to undermine what Trump has done.\nKerry’s goal — which must have been pursued with Obama’s knowledge and approval — was to assure the Iranians that the Trump presidency is a bump on the road, a temporary obstacle to the Democrats’ pursuit of the appeasement of Iran.\nIn a radio interview with Hugh Hewitt last week, Kerry said that he had met Iranian Foreign Minister Mohammed Javad Zarif three or four times since Kerry left office. When Hewitt asked whether Kerry was trying to coach Zarif through Trump’s revocation of the JCPOA, Kerry denied that he was and then said precisely the opposite. It’s worth a long quote. Kerry said:\n“What I have done is tried to elicit from [Zarif] what Iran might be willing to do in order to change the dynamic in the Middle East for the better. You know, how does one resolve Yemen? What do you do to try to get peace in Syria? I mean, those are the things that really are preoccupying, because those are the impediments to people, to Iran’s ability to convince people that it’s ready to embrace something different. I mean, and I’ve been very blunt to Foreign Minister Zarif, and told him look, you guys need to recognize that the world does not appreciate what’s happening with missiles, what’s happening with Hezbollah, what’s happening with Yemen. You’re supporting you know, an ongoing struggle there. They say they’re prepared to negotiate and to resolve these issues. But the administration’s taken a very different tack. I don’t know as I talk to you today if there’s been any dialogue or sit down. I don’t think there has, which would open up any kind of diplomatic channel. And it appears right now as if the administration is hell bent for leather determined to pursue a regime change strategy to bring the economy down and try to isolate further. And I would simply caution that the United States historically has not had a great record in regime change strategies, number one. And number two, that makes it very difficult, if not impossible, for any Iranian leader to sit down and negotiate anything, because they’re not going to do it in a capitulatory, you know, situation. It’s just not going to happen.”\nThe context of Kerry’s talks with the Iranian foreign minister can be summed up in three points.\nFirst are the efforts by some members of the European Union — supposedly our NATO allies — to do everything they can to preserve the JCPOA and enable Iran to evade our sanctions. Their “blocking statute” purports to prevent European companies from complying with the sanctions against Iran that Trump has put back in place. Through the European Union, they are granting Iran about $50 billion in “developmental aid” to ease the impact of our sanctions.\nSecond is Iran’s aggression in Syria, Afghanistan, and Iraq, including their establishing military bases in Syria close to Israel’s Golan Heights border.\nThird is Iran’s support for Houthi Shiite rebels in Yemen, which has turned that nation into another battleground.\nThe ayatollahs are evil, but they aren’t dumb. They are highly intelligent observers of American politics. They understand how polarized and apparently irreconcilable the Democrats’ opposition to Trump is.\nThus, the Iranians could not help but understand Kerry to be saying that if they just wait until Trump is gone, the next Democratic president will restore the Obama nuclear weapons deal with them and remove the Trump sanctions.\n(It’s highly likely that Kerry has had similar talks with leaders of some EU/NATO nations — particularly Germany’s Merkel and France’s Macron. They too, like the ayatollahs, yearn for the day when another version of Obama replaces Trump. Did Kerry give them a similar message — to wait out Trump — that he gave Iran? Did he tell the EU leaders what he told the Iranian foreign minister and what Zarif said in response? We don’t yet know, but you can bet dollars to donuts that he has.)\nKerry’s belief, stated to Hewitt, is that the Iranians are willing to compromise away everything they’re doing in Syria, Afghanistan, Yemen, and elsewhere if only we’d resume the sort of negotiations with them that he performed as Obama’s secretary of state. Only someone who is willfully ignorant of the Iranian regime’s history and current actions could come to that conclusion.\nNo American has the right to conduct foreign policy without the president’s permission and approval. That is illegal under the Logan Act of 1799. Remember Trump’s first national security advisor, Gen. Michael Flynn?\nOn several occasions during his campaign candidate Trump, very unwisely, had voiced his desire for friendlier relations with Putin’s Russia. In December, with only 22 days left in his presidency, Obama put in place greater sanctions against Russia. Obama clearly wanted to limit Trump’s ability to gain a closer relationship with Putin. And that’s where Flynn came into the picture.\nDuring the time between the 2016 election and Trump’s inauguration, as the incoming national security adviser, Flynn’s job would have been to open channels of communication with the leaders and representatives of foreign governments. His effort to do so resulted in his pursuit by Special Counsel Robert Mueller.\nDuring the transition, Flynn had more than one conversation with Russian Ambassador to the U.S. Sergey Kislyak. Flynn had no power to reverse the new Obama sanctions and could only express Trump’s desire for a more cordial relationship with Putin. Kislyak had to have known that, as did Mueller. What Flynn could do, in the words used in the later charging statement filed against him in federal court, was to urge Russia “not to escalate the situation and only respond to the U.S. in a reciprocal manner.”\nWhen the FBI came to interview Flynn, he may have unwittingly misled them about the number and content of his conversations with Kislyak. As reported elsewhere many times, the FBI agents who interviewed him thought Flynn was truthful.\nNevertheless, Mueller wanted his scalp. Flynn later pled guilty to lying to the FBI. Judging from the words of the charging statement against him, Flynn was probably threatened with more severe penalties for violating the Logan Act. No one has ever been convicted of violating that law, which has been in place for over 200 years, but there’s no reason Mueller wouldn’t use it as leverage in a plea agreement such as the one Flynn signed.\nLet’s come back to Kerry. There is no evidence to suggest that the FBI is investigating Kerry for a clearer and far graver violation of the Logan Act. Why?\nOne of two reasons or the combination of both.\nFirst, the FBI and the Justice Department — despite the removal of James Comey, Andrew McCabe, Peter Strzok, and others — are still apparently dominated by a group of people who have decided to turn a blind eye to illegal acts committed by former members of the Obama administration during and after their terms in office.\nSecond, the FBI and Justice Department are so cowed by the political uproar that would result from investigating and charging Kerry that they won’t consider doing so.\nEither reason is destructive of our system of government and the president’s ability to govern.\nOn Thursday night Trump tweeted, “John Kerry had illegal meetings with the very hostile Iranian Regime, which can only serve to undercut our great work to the detriment of the American people. He told them to wait out the Trump Administration! Was he registered under the Foreign Agents Registration Act? BAD!”\nSecretary of State Mike Pompeo said that Kerry’s talks with Zarif were “inconsistent with what the foreign policy of the United States is, as directed by this president, and… beyond inappropriate,”\nIt’s now up to Attorney General Jeff Sessions to order the FBI to investigate Kerry’s meetings with the Iranian foreign minister and to bring appropriate charges against him for his confessed acts.\nBoth the FBI and the Justice Department are under a dark cloud because of their complicity in Obama’s spying on the Trump campaign and transition, and in the ongoing Mueller investigation’s persecution of people such as Gen. Flynn.\nInvestigating and possibly prosecuting Kerry would help remove that cloud. If Sessions doesn’t insist that it be done, it will leave an indelible stain on his honorable service to the nation.","url":"https://spectator.org/sabotaging-trump-on-irans-behalf/"}
