{"authors":["Breitbart News"],"date_download":"2018-10-30 18:00:13","date_modify":"2018-10-30 18:00:13","date_publish":"2018-08-07 00:04:40","description":"U.S. Senate candidate Joe Arpaio argued the benefits of gun ownership to a tiny toy doughnut in the latest episode of comedian Sacha Baron Cohen’s new prank show.","filename":"data/vaneerConsumption/SachaBaronCohenTargetsJoeArpaioonShowtimeSeriesWhoIsAmerica.json","image_url":"https://media.breitbart.com/media/2018/08/SachaandJoe1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_08_06__1540922413.html","title":"Sacha Baron Cohen Targets Joe Arpaio on Showtime Series 'Who Is America'","title_page":"Sacha Baron Cohen Targets Joe Arpaio on Showtime Series 'Who Is America'","title_rss":"NULL","source_domain":"breitbart.com","text":"PHOENIX (AP) — U.S. Senate candidate Joe Arpaio argued the benefits of gun ownership to a tiny toy doughnut in the latest episode of comedian Sacha Baron Cohen’s new prank show.\nArpaio often seemed taken aback during the interview that aired Sunday in which Baron Cohen portrayed a Finnish TV host who channeled some of his questions through a toy named “D’Lish Donut.”\n“D’Lish Donut, you have to understand that you have to follow the Constitution and the law and allow people to have guns,” Arpaio said. At one point, Arpaio looked downward at the toy and pointed his finger for emphasis as he argued that guns were an effective means of defense.\nThe 86-year-old retired lawman joins defeated Senate candidate Roy Moore and other politicians who were pranked in the Showtime series.\nThe Republican served as metro Phoenix’s sheriff for 24 years until his defeat in 2016 as he faced a criminal contempt of court charge for disobeying a judge’s orders in an immigration case. He was later convicted of the misdemeanor, but was spared a possible jail sentence when he was pardoned by President Donald Trump.\nArpaio, through his campaign manager, declined an interview request Monday from The Associated Press about the segment.\nHis campaign issued a statement saying Arpaio couldn’t fully understand what Baron Cohen was saying during the interview. “We’re not mad about it, it’s comedy,” Arpaio spokeswoman Jennifer Lawrence said in the statement.\nIn an interview three weeks ago, Arpaio said the segment was filmed in Los Angeles in October, three months before he announced that he was running for the U.S. Senate seat held by retiring Sen. Jeff Flake.\nArpaio said the producers told him the show was focusing on the most famous people in the United States. He also had said he didn’t know who Baron Cohen was until he recently saw news coverage about the comedian pulling a similar prank on former Alaska Gov. Sarah Palin.\nThe campaign of former state Sen. Kelli Ward, one of Arpaio’s two GOP opponents, declined to comment on Arpaio’s appearance on the show. A spokeswoman for his other opponent, Rep. Martha McSally, didn’t return a phone call and email seeking comment.\nBaron Cohen, whose character sported reddish orange hair and a garish floral-print shirt, also told Arpaio he has more than 43 guns.\n“You have 43 guns?” Arpaio asked.\n“Yes, I have been collecting them for the upcoming race war,” Baron Cohen said.\nArpaio appeared surprised by the answer, but no further reaction from him was shown during the four-minute segment.\nHe previously said he began to suspect something was amiss when Baron Cohen started using sexually explicit expressions, though he resisted the urge to walk out.\nLawrence said in her statement that she had to explain to Arpaio what Baron Cohen meant when he used one such expression.","url":"https://www.breitbart.com/entertainment/2018/08/06/sacha-baron-cohen-targets-joe-arpaio-on-showtime-series-who-is-america/"}
