{"authors":["Ben Kew"],"date_download":"2018-10-30 17:58:19","date_modify":"2018-10-30 17:58:19","date_publish":"2018-08-27 16:06:31","description":"Sacha Baron Cohen duped Sarah Palin by posing as a disabled veteran eager to discuss issues facing the country, the former vice presidential candidate told Breitbart News.","filename":"data/vaneerConsumption/SachaBaronCohensWhoIsAmericaSeasonEndsWithoutAiringSarahPalinSegment.json","image_url":"https://media.breitbart.com/media/2018/07/Conhenratingsfail1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_08_27__1540922299.html","title":"Sacha Baron Cohen’s 'Who Is America' Season Ends Without Airing Sarah Palin Segment","title_page":"Sacha Baron Cohen’s 'Who Is America' Season Ends Without Airing Sarah Palin Segment","title_rss":"NULL","source_domain":"breitbart.com","text":"Sacha Baron Cohen’s Showtime series Who is America ended without airing his interview with Sarah Palin after the comedian purportedly posed as a disabled veteran to gain access to the former Alaska governor and vice presidential candidate.\nAccording to The Hollywood Reporter, Palin’s interview did not make the final cut of the show, which also features segments with O.J. Simpson and former Democratic congressman Barney Frank.\nSuch a decision was hinted at by Showtime president of programming Gary Levine earlier this month after he said that Cohen has a “very high bar” for what makes the final cut.\n“All I can say about that is that there are several people who have thrown themselves in front of buses that may not be heading their way,” he told reporters at the time.\nNews that Palin may be involved in the show emerged last month after she revealed that Cohen had duped her by posing as a disabled veteran eager to discuss issues facing the country.\n“Cohen pretended to be a disabled veteran from Kentucky who was a big fan of Governor Palin,” a source close to Palin told Breitbart News at the time. “He was wearing a necklace made of bullets and had a laptop covered in InfoWars stickers.”\n“His disguise was basically a caricature of a conservative middle-class Trump voter,” they continued. “He was asking her absurd, racist, homophobic, and sexist questions that were all meant to mock Trump voters as a bunch of ignorant and offensive kooks.”\nEventually, Sarah Palin walked away from the interview after Cohen asked her a “horrible” question about whether Chelsea Clinton had been subject to a government-funded sex change. She has since called on CBS and Showtime to “donate all proceeds to a charitable group that actually respects and supports American Vets.”\nSince its debut last month, Who is America has received generally mixed reviews from critics. Other prominent figures duped by the 46-year-old British prankster include former vice-president Dick Cheney, Alabama Senatorial candidate Roy Moore, and former presidential candidate Bernie Sanders.\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.","url":"https://www.breitbart.com/entertainment/2018/08/27/sacha-baron-cohens-who-is-america-sarah-palin-segment/"}
