{"authors":[],"date_download":"2018-10-30 18:22:52","date_modify":"2018-10-30 18:22:52","date_publish":"2018-10-30 16:43:00","description":"The mother of a Connecticut university student who choked to death during a pancake-eating contest h...","filename":"data/vaneerConsumption/SacredHeartUniversitysuedoverstudentsdeathinpancakeeat.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Images/pancake-640869_1280-U48003237321tfM-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_sacred-heart-universit_a9846a4d0924c6ce5b917fd4dd568d42__1540923772.html","title":"Sacred Heart University sued over student’s death in pancake-eat","title_page":"Sacred Heart University sued over student’s death in pancake-eat","title_rss":"NULL","source_domain":"ajc.com","text":"The mother of a Connecticut university student who choked to death during a pancake-eating contest has filed a wrongful death lawsuit against the school, the Hartford Courant reported.\n>> Read more trending news\nCaitlin Nelson, a 20-year-old junior at Sacred Heart University in Bridgeport, died after choking during the charity event on March 30, 2017. The contest was a university-sanctioned Greek life event, WVIT reported.\nNelson, of Clark, New Jersey, began to choke minutes after the contest began. She died April 2 at a New York hospital, the Courant reported.\nThe lawsuit was filed Monday in Superior Court in Bridgeport. The suit, filed by Nelson’s mother, Rosanne Nelson, claims the university was to blame for allowing the contest, the newspaper reported.\nA spokesman for Sacred Heart declined to comment because of the litigation, the Courant reported.\nNelson, whose father was a Port Authority police officer killed in New York City during the Sept. 11, 2001, attacks, was a social work major who assisted victims in the 2012 shootings at Sandy Hook Elementary School in Newtown, the Connecticut Post reported in 2017.\nDuring the pancake-eating contest, Nelson began to choke. First responders were unable to clear the food from her mouth and throat, the Courant reported. An autopsy revealed Nelson died of asphyxia due to obstruction of her airway by a lump of food, the newspaper reported.\n“Caitlin’s family is bringing this case to expose the dangers associated with amateur eating contests and to help prevent other families from having to endure this type of preventable tragedy,” Katie Mesner-Hage, of Koskoff, Koskoff & Bieder, which represents the family, said in a statement. “These contests are significantly more dangerous than people realize and it’s critically important for the public – especially educational institutions – to understand that certain foods are safer than others and a modicum of forethought can literally save lives.”","url":"https://www.ajc.com/news/sacred-heart-university-sued-after-student-dies-pancake-eating-contest/XW0nYPqO60mxxMeQiCPDsO/"}
