{"authors":[],"date_download":"2018-10-23 03:30:25","date_modify":"2018-10-23 03:30:25","date_publish":"2017-03-10 13:03:10","description":"Hundreds of protesters took to the streets of Pretoria on Friday over fears that South Africa's welfare agency may be unable to make benefit payments to...","filename":"data/vaneerConsumption/SAfricansmarchoverloomingwelfarepaymentcrisis.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196071-1489150991-77_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301242_S-Africans-march-looming-welfare-payment-crisis_1540265425.html","title":"S.Africans march over looming welfare payment crisis","title_page":"S.Africans march over looming welfare payment crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The march follows weeks of uncertainty over grants to more than 17 million people\nHundreds of protesters took to the streets of Pretoria on Friday over fears that South Africa's welfare agency may be unable to make benefit payments to millions of poor people.\nThe march was led by Mmusi Maimane, the leader of the main opposition Democratic Alliance party, and follows weeks of uncertainty over grants to more than 17 million people.\nIt is feared that payments will come to a halt after the government failed to announce a new company to process them when the current distributor's contract ends on March 31.\n\"In less than three weeks' time, millions of South Africans stand to lose their social grants if an urgent solution to the grant payment crisis is not found,\" said Maimane.\n\"A third of our people depend on grants to survive,\" he added as he addressed the march which was joined by disabled people and mothers with young children.\nThe protesters marched outside the social development ministry, many of them clad in the blue of the Democratic Alliance.\nWelfare grants are a critical safety net in a country where poverty and inequality are rampant.\nAround 140 billion rand ($10.6 billion) is paid out every year.\nThe ruling African National Congress (ANC) -- which is suffering declining popularity -- has used the subsidies paid to the elderly, orphans and children to secure the backing of many poor voters.\nSouth Africa's welfare system was plunged into chaos in 2014 when a court ruled that the contract of the current distributor, Cash Paymaster Services, was granted illegally.\nMaimane said the grants debacle was a \"massive responsibility on the shoulders of the government\".\nThe crisis has seen opposition parties in parliament call for the sacking of social development minister Bathabile Dlamini, despite her pledge this week that the grants would be paid on time.\nMaimane said his party would pursue criminal charges against Dlamini if she failed to resolve the crisis.","url":"https://www.dailymail.co.uk/wires/afp/article-4301242/S-Africans-march-looming-welfare-payment-crisis.html"}
