{"authors":[],"date_download":"2018-10-23 01:24:36","date_modify":"2018-10-23 01:24:36","date_publish":"2016-01-28 15:40:41","description":"South Africa raised its benchmark interest rate by an aggressive half a percentage point to 6.75 percent Thursday to counter rising inflation, despite fears ...","filename":"data/vaneerConsumption/SAfricaraiseskeyinterestrateevenasgrowthslows.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h1k1-4vVdYopwYQ7f641721b07aed5f4a-805_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421188_S-Africa-raises-key-rate-growth-slows_1540257876.html","title":"S.Africa raises key interest rate even as growth slows","title_page":"S.Africa raises key interest rate even as growth slows | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"S.Africa raises key interest rate even as growth slows\nSouth Africa raised its benchmark interest rate by an aggressive half a percentage point to 6.75 percent Thursday to counter rising inflation, despite fears that the country could be heading into recession.\nEconomic woes have piled up in recent months for South Africa, with the International Monetary Fund slashing its latest growth forecast by almost half to 0.7 percent.\nThe rand has collapsed 30 percent against the dollar since the start of 2015 due to falling commodity prices, power shortages and investor shock when a new finance minister was appointed and sacked within days.\nEconomic woes have piled up in recent months for South Africa, with the International Monetary Fund slashing its latest growth forecast by almost half to 0.7 percent ©Rajesh Jantilal (AFP/File)\nLesetja Kganyago, governor of the South African Reserve Bank, announced that inflation was set to exceed the target limit of six percent for the next two years, after averaging 4.6 percent in 2015.\n\"Inflation is now expected to average 6.8 percent in 2016 and 7.0 percent in 2017,\" he said.\nThe bank \"faced the continuing dilemma of a deteriorating inflation environment and a worsening growth outlook,\" Kganyago said.\n\"Given the deterioration in the inflation outlook, the MPC (Monetary Policy Committee) decided to increase the repurchase rate by 50 basis points to 6.75 percent.\"\nThe interest-rate rise, which was widely predicted by economists, came after an increase of a quarter of a percentage point in November.\n- 'Hefty hike' -\nAnnual inflation rose to 5.2 percent in December -- fuelled by the weak rand and the worst drought in more than a century forcing up food prices.\nAhead of the central bank decision, Bloomberg News reported that Africa's most-industrialised economy faced a 45 percent likelihood of tipping into recession this year.\nBusiness confidence has dropped to the lowest level since before Nelson Mandela came to power in 1994, according to an index released this month by the South African Chamber of Commerce and Industry.\nSouth Africa, like other emerging economies with mining industries, has also been hit by the slowdown in China's economy.\nUnemployment stands at more than 25 percent, with the number rising to near 35 percent including those who have given up looking for work.\n\"The rate hike really has to be seen in context of flagging growth rates, a severe currency depreciation and further threats to the currency -- that's why we've seen this hefty hike,\" financial analyst Daniel Silke told AFP.\n\"It's bad for consumer confidence, already at a low in South Africa, which in turn could negatively affect growth.\"\nSilke also warned that higher inflation would set the scene for a bruising clash between the treasury and trade unions over wage demands.\nPravin Gordhan, the new finance minister, has vowed to impose strict expenditure limits to stabilise the economy.\nGordhan, who also served in the post from 2009 to 2014, was re-appointed in December after President Jacob Zuma oversaw a chaotic reshuffle.\nRespected finance minister Nhlanhla Nene was sacked in favour of little-known David van Rooyen, who was widely seen as a weak placeman for corrupt Zuma loyalists.\nAs the rand collapsed and investors pulled out, Zuma was forced to dump van Rooyan after just four days and seek to repair the damage by naming Gordhan to the post.","url":"https://www.dailymail.co.uk/wires/afp/article-3421188/S-Africa-raises-key-rate-growth-slows.html"}
