{"authors":["Associated Press"],"date_download":"2018-10-23 01:24:40","date_modify":"2018-10-23 01:24:40","date_publish":"2016-01-28 15:39:59","description":"BURBANK, Calif. (AP) — Carol Burnett is so glad she's had some six decades together with television viewers. After all, it was on the small screen where Burn...","filename":"data/vaneerConsumption/SAGhonoreeBurnettsachievementsloomlargerthanTV.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:b27993540ed14839a1b1fbd078aaf80c-2vdWmEltwXfba0ce28e632a3852c-591_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421169_SAG-honoree-Burnetts-achievements-loom-larger-TV_1540257880.html","title":"SAG honoree Burnett's achievements loom larger than TV","title_page":"SAG honoree Burnett's achievements loom larger than TV | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SAG honoree Burnett's achievements loom larger than TV\nBURBANK, Calif. (AP) — Carol Burnett is so glad she's had some six decades together with television viewers.\nAfter all, it was on the small screen where Burnett arguably reached her artistic and popularity peaks, most notably with the variety series, \"The Carol Burnett Show\" (1967-78).\nSo, little wonder that Burnett was a bit surprised when, out of the gate, the conversation turned to another aspect of her screen career, to which the Screen Actors Guild will pay tribute with its top honor, for Life Achievement, at the SAG Awards on Saturday.\nIn this Monday, Dec. 7, 2015 photo, Carol Burnett poses for a portrait in Burbank, Calif. Burnett says her upcoming Life Achievement Award from the Screen Actors Guild on Saturday, Jan. 30, 2016, is special because it comes not only from fellow TV performers, but also from movie stars. The awards show will be simulcast live on Saturday on TNT and TBS at 8 p.m. ET/5 p.m. PT from Los Angeles. (Photo by Rich Fury/Invision/AP)\nIn addition to all that TV, Burnett also made an impressive number of feature films with some of the industry's most highly regarded directors: Martin Ritt, Peter Bogdanovich, Robert Altman and John Huston among them.\nBy the early '60s, Burnett was already a star of stage (a Tony nomination for the 1959 musical \"Once Upon a Mattress\") and TV (a 1962 Emmy for her work on the variety series \"The Gary Moore Show\").\nSo film offers were inevitable.\n\"I was very nervous (about) making movies,\" Burnett said in a recent interview. \"I always felt that I was small screen and movie stars were big screen. And, also, I missed an audience and having that feedback.\"\nShe marked her feature-film debut in the 1963 Dean Martin-Elizabeth Montgomery farce \"Who's Been Sleeping in My Bed?\" ''A terrible movie,\" recalled Burnett, adding it was still a fun shoot and that she loved both Martin and Montgomery.\nBurnett's starring debut wouldn't come for another decade. With the \"Burnett Show\" flying high, she spent her summer vacation working with director Ritt (\"Hud,\" ''Norma Rae\") portraying one of the two leads in \"Pete 'n' Tillie\" (1972), about a 40-ish virgin who gets fixed up with a confirmed bachelor, portrayed by Walter Matthau.\nBurnett remembered that she was so \"tight\" the first few days of filming, because she was so overwhelmed by movie star Matthau.\nHe soon invited her to lunch, and shortly after they sat down, Matthau asked, \"Why do you do all of this television crap?'\"\nThat got her goat. So, she asked how long it took him to make a movie, how many movies he made per year, and if any of them were \"crap.\"\nHe replied about 10 weeks a film, about two a year, and, yes, some were awful.\n\"And I said, 'Well, it takes you, Walter, 10 weeks to make crap,'\" Burnett remembered. '\"It takes me five days.'\"\nMatthau howled with laughter, and both a solid professional and lifelong personal relationship were born.\n\"He did that to get a rise out of me,\" Burnett recalled. \"And it worked.\"\nSadly, that small-screen insecurity would return to Burnett's big-screen work. But at least it made for a funny story.\nBurnett said she so hated her own portrayal of the prostitute in the 1974 remake of the classic \"The Front Page\" that she refused to watch it — only to get trapped on an airplane showing the movie.\nWhen the film ended, Burnett asked the stewardess for the microphone:\n\"Good afternoon, ladies and gentlemen. This is Carol Burnett and I was in the movie that you just watched, and I would like to take this opportunity to apologize to each and every one of you for my performance in that film.\"\nThe passengers applauded.\n\"I felt cleansed,\" Burnett said, laughing heartily.\nHer next two films were for \"Nashville\" and \"M(asterisk)A(asterisk)S(asterisk)H\" director Altman, the ensemble comedies \"Health\" and \"A Wedding.\" She then scored a box-office smash in Alan Alda's dramedy \"The Four Seasons,\" followed by \"Key Largo\" director Huston's big-screen adaptation of the Broadway musical \"Annie,\" which would introduce Burnett, as the wicked orphanage matron Miss Hannigan, to a new generation of fans.\nAnd new Burnett fans have been cropping up ever since, perhaps at a greater rate now than in some time, thanks to \"Burnett Show\" clips on YouTube, Time Life's recent DVD releases of series episodes, as well as reruns of the show on the MeTV network.\nThe lanky, stylish Burnett, 82, also keeps busy, with a recurring role on the CBS series \"Hawaii Five-0\" (of which she's a fan) and a road show in which Burnett does just as she did on the old series: She asks someone backstage to \"bump up the lights\" so she can see the audience and answer questions.\nTo be honored by Hollywood for Life Achievement, \"To use my friend Julie Andrews' term, I'm gobsmacked about it,\" Burnett said. \"I'm still in awe of the big screen, of the movie stars. 'Oh my god, there's Meryl Streep!' 'Oh my god, there's so-and-so!' I think I'm going to be very nervous. But I'm thrilled.\"\n___\nFollow AP Entertainment Writer Mike Cidoni Lennox on Twitter at www.twitter.com/CidoniLennox\nIn this Monday, Dec. 7, 2015 photo, Carol Burnett poses for a portrait in Burbank, Calif. Burnett says her upcoming Life Achievement Award from the Screen Actors Guild on Saturday, Jan. 30, 2016, is special because it comes not only from fellow TV performers, but also from movie stars. The awards show will be simulcast live on Saturday on TNT and TBS at 8 p.m. ET/5 p.m. PT from Los Angeles. (Photo by Rich Fury/Invision/AP)\nIn this Monday, Dec. 7, 2015 photo, Carol Burnett poses for a portrait in Burbank, Calif. Burnett says her upcoming Life Achievement Award from the Screen Actors Guild on Saturday, Jan. 30, 2016, is special because it comes not only from fellow TV performers, but also from movie stars. The awards show will be simulcast live on Saturday on TNT and TBS at 8 p.m. ET/5 p.m. PT from Los Angeles. (Photo by Rich Fury/Invision/AP)\nIn this Monday, Dec. 7, 2015 photo, Carol Burnett poses for a portrait in Burbank, Calif. Burnett says her upcoming Life Achievement Award from the Screen Actors Guild on Saturday, Jan. 30, 2016, is special because it comes not only from fellow TV performers, but also from movie stars. The awards show will be simulcast live on Saturday on TNT and TBS at 8 p.m. ET/5 p.m. PT from Los Angeles. (Photo by Rich Fury/Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3421169/SAG-honoree-Burnetts-achievements-loom-larger-TV.html"}
