{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 01:19:19","date_modify":"2018-10-23 01:19:19","date_publish":"2016-01-28 15:36:20","description":"Frank Raftis, 61, from Horley, Surrey, went to the supermarket last summer for a loan to buy a new car for his daughter, but was turned down","filename":"data/vaneerConsumption/Sainsburysworkersangerafterhisowncompanyrefusedhimacreditcard.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AA424900000578-0-image-a-48_1453995203150.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421156_Sainsbury-s-worker-s-anger-company-refused-credit-card_1540257559.html","title":"Sainsbury's worker's anger after his own company refused him a credit card","title_page":"Sainsbury's worker's anger after his own company refused him a credit card | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A part-time Sainsbury's worker claims he was refused a credit card and a loan by the supermarket because they weren't paying him enough.\nFrank Raftis, 61, from Horley, Surrey, has questioned why his own employer rejected him, insisting his credit record is spotless.\nThe former teacher went to the supermarket last summer for a loan to buy a new car for his daughter, but was turned down.\nRejected: Frank Raftis is angry that his own employer, Sainsbury's, turned him down for a credit card\nHe said: 'I have worked at Sainsbury's for over a year now as a checkout clerk. I think they turned me down because I don't earn enough at Sainsbury's.\n'Basically they hinted at the fact that I didn't make the grade on the points system.'\nMr Raftis, who is originally from Canada, currently works as a learning support assistant at East Surrey College, alongside his part-time job on the checkouts at Sainsbury's Redhill.\nHe said: 'I've never missed a mortgage payment, I pay my child support and I pay for all my household bills.\n'I was told I had a good credit rating and I decided to get a new car loan.'\nWhen Sainsbury's rejected him he went to NatWest instead, and was given the loan without any trouble at all.\nRules: The company insists it uses a number of criteria for giving credit cards and its staff are well paid\nHe emailed the CEO of Sainsbury's questioning why he was rejected. He was later told that the supermarket operate using their own credit agency, and that's who makes their decision.\nSainsbury's raised the basic pay for store colleagues to £7.36 per hour at the end of August 2015 and states that this makes each employee £1,000 a year better off.\nA spokesperson for Sainsbury's Bank said that Mr Raftis' failure to secure a loan could have been due to his failing a variety of different criteria.\nThey said: 'All banks have different lending criteria and take into account a number of factors including credit payment history, overall levels of indebtedness and affordability.","url":"https://www.dailymail.co.uk/news/article-3421156/Sainsbury-s-worker-s-anger-company-refused-credit-card.html"}
