{"authors":["Associated Press"],"date_download":"2018-10-22 21:19:44","date_modify":"2018-10-22 21:19:44","date_publish":"2017-04-26 01:35:20","description":"NEW ORLEANS (AP) - Adrian Peterson, the NFL's most productive running back for much of the past decade, has decided to head into the twilight of his career...","filename":"data/vaneerConsumption/Saints32yearoldAdrianPetersonagreeon2yearcontract.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/01/wire-462555-1493167822-429_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446010_Saints-32-year-old-Adrian-Peterson-agree-2-year-contract_1540243184.html","title":"Saints, 32-year-old Adrian Peterson agree on 2-year contract","title_page":"Saints, 32-year-old Adrian Peterson agree on 2-year contract | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW ORLEANS (AP) - Adrian Peterson, the NFL's most productive running back for much of the past decade, has decided to head into the twilight of his career as a potential backup in New Orleans' pass-happy offense.\nThe Saints on Tuesday came to terms on a two-year contract with Peterson, a 10-year veteran who has posted seven 1,000-yard seasons with Minnesota and once eclipsed 2,000 yards.\nSaints coach Sean Payton said he envisions a productive role for Peterson, who is coming back from a 2016 meniscal tear that required season-ending knee surgery after only three games.\nFILE - In this Oct. 4, 2015, file photo, Minnesota Vikings running back Adrian Peterson waves during warms ups before an NFL football game against the Denver Broncos, in Denver. Free-agent running back Adrian Peterson has reportedly agreed to a two-year contract with the New Orleans Saints. The Saints have not announced a deal, but Peterson tells ESPN in a statement that he's agreed to play in New Orleans. (AP Photo/Joe Mahoney, File)\n\"It's rare and unique to have the opportunity to add a (potential) Hall of Fame player to your roster. His career has been top-notch,\" Payton said in a statement provided by the club. \"We think he will be an excellent fit in our locker room and in our offense.\"\nThe agreement was first reported early Tuesday when Peterson provided a statement to ESPN.\n\"It goes without saying that the Saints are really solid behind Drew Brees. I feel like my skillset can make them even more dominant (offensively),\" Peterson said in a statement. \"They have a great offensive line, which is something that stood out to me as well.\"\nPeterson, 32, has spent his entire NFL career with the Vikings, which happens to be the team against which the Saints open the 2017 regular season - in Minnesota.\n___\nFor more NFL coverage: www.pro32.ap.org and www.twitter.com/AP_NFL\n___\nAP Sports Writer Jon Krawczynski in Eden Prairie, Minnesota, contributed to this report.\nFILE - In this Dec. 18, 2016, file photo, Minnesota Vikings running back Adrian Peterson warms up before the start of an NFL football game against the Indianapolis Colts, in Minneapolis. Free-agent running back Adrian Peterson has reportedly agreed to a two-year contract with the New Orleans Saints. The Saints have not announced a deal, but Peterson tells ESPN in a statement that he's agreed to play in New Orleans. (AP Photo/Andy Clayton-King, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4446010/Saints-32-year-old-Adrian-Peterson-agree-2-year-contract.html"}
