{"authors":["Matilda Rudd","Jacob Schepis For Daily Mail Australia"],"date_download":"2018-10-22 23:14:53","date_modify":"2018-10-22 23:14:53","date_publish":"2017-03-10 02:09:50","description":"Melbourne coach Jacob Schepis, 25, was sick of the 'organic super food' hype and decided to put different restaurants salad and burger options to the calorie test.","filename":"data/vaneerConsumption/SaladoveraburgerwontshiftweightsaysMelbournePT.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F088A00000578-0-image-a-7_1489106537926.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299300_Why-burgers-better-salad-according-trainer_1540250093.html","title":"Salad over a burger won't shift weight says Melbourne PT","title_page":"Salad over a burger won't shift weight says Melbourne PT | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Salads are often synonymous with fat loss, health and fitness.\nBut Melbourne fitness coach Jacob Schepis, 25, was sick of the super food hype and decided to put salads to the test.\nWhile you may have the best of intentions when opting to choose a leafy salad on the menu, it could be hindering your fat loss efforts.\nMr Schepis, 25, told the Daily Mail Australia that 'people have a lot of misconceptions when it comes to eating 'good' and 'bad' foods. We need to stop categorising them in this way.'\nJacob Schepis, 25, says that often eating a salad can inhibit your weight loss dreams more than a burger can\nHere, Jacob shares his advice.\nWhilst there is no need to have a brain aneurysm over your nutritional plan and try to micromanage every single minute detail in your diet, you must understand that you are not exempt from the bounds of science; the calories you eat count and your gluten free, quinoa, feta and walnut salad is most likely full of them.\nWe have a tendency as a society to get sucked in to fitness and health buzz words such as raw, organic, alkaline, paleo, coconut oil and so forth, and what tends to happen when we label foods as 'good' and 'bad', 'healthy' or 'unhealthy' is that we forget the big picture – calories and macro nutrients.\nHere is a typical scenario…\n'You were probably better off getting the burger and enjoying the social occasion rather than trying to restrict yourself and missing out,' Mr Schepis wrote\nYou are eating out with friends and family and want to make a sensible, 'healthy' choice because you're trying to get rid of some stubborn fat.\nYou browse the menu, and decide to choose a salad as opposed to a burger, because your conscience is telling you that the salad is a far 'healthier' option than the burger. Even though you would much prefer to eat a burger, you don't because well, abs.\nUnfortunately, you most likely made a poor decision as far as your abs are concerned.\nI recently scoured several restaurants and selected a number of their salad and burger options and estimated the calories in both to compare which would be more beneficial for my fat loss efforts.\nThese are the results.\nA typical burger 1x bun (200 Calories) 1x beef or chicken patty (170 calories) 1x slice of cheese (100 Calories) 2x slice of tomato (40 Calories) 2x slices of lettuce (10 Calories) 1x piece of bacon (100 Calories) Residual cooking oil (120 Calories) Total: 740 calories\nA typical salad 75g of beef (140 Calories) 20g walnuts (165 Calories) 1/2 cup quinoa (120 calories) 20g feta (75 calories) 1 cup of lettuce (40 calories) 1/4 cup cucumber (20 calories) 50g sweet potato (40 Calories) 1 T. of olive oil (120 Calories) 1-2 T. of dressing (80 Calories) Total: 820 calories\nAnybody surprised?\nI wasn't but I guess that's because I've been in the calorie and macronutrient tracking game for years, and see right through the BS of 'healthy food' options.\nYes, micronturients matter, and sure not all calories are equal, but a salad with that amount of nuts, seeds, oil and cheese is a bowl full of calories and fat. Nothing wrong with that if you are fitting it into an energy controlled diet, however unfortunately most individuals who choose a salad instead of a burger have little understanding of nutrition or physiology.\nA salad will have far more phytonutrients, vitamins, minerals and fiber all contributing to it's 'health' benefits, however if you are at a chronic energy surplus (eating more than your body burns), then you were probably better off getting the burger and enjoying the social occasion rather than trying to restrict yourself and missing out.\nThe Melbourne fitness coach said ditching the salad dressing and taking out 'high calorie' add-ons like avocado, nuts and seeds can reduce the amount of calories in a salad\nAs you can see, there are a number of what I refer to as 'calorie killers'. Ingredients that turn, what could have been a really calorie controlled, 'healthy' meal, into a blow out. Typical high calorie ingredients include:\nDressing.\nNuts & Seeds.\nOil.\nAvocado.\nEgg.\nFatty cuts of meat.\nNow before the paleo enthusiasts have their jimmy's rustled, let me just state for the record that nuts, seeds, oils, avocado and fatty cuts of meat are indeed very nutritious, and when eaten within the confines of a calorie controlled, balanced diet, then let the inner cave man eat.\nUltimately it's up to the individual and their lifestyle to decide which is the healthier option\nHowever regardless of their nutritional benefits the six items listed above are laden with calories. If your salad contains three or more of these ingredients it is likely going to contribute to a large portion of your daily calorie and fat requirements.\nMy recommendations are to opt for a salad if you are serious about your fat loss efforts and really want to be bang on with your targets. And there are a number of ways to make your salad a better choice than a burger.\nFor example you can ask to have the dressing and oil on the side and remove one or more of the higher calorie ingredients.\nJacob showcasing his advice in action with a classic burger shot\nIt's as simple as that. All of a sudden, your salad goes from 800 calories to 500 making it an obvious choice when compared to a burger.\nSo should you eat a burger or a salad when eating out?\nWell I can't give you the answer because you will need to learn how to make your own informed decisions but neither option is better than the other if consumed within your calorie and macro nutrient demands.\nHowever if you are out, want to enjoy a social occasion and are faced with nit picky restaurants who refuse to change their menu, just get the burger, enjoy it and move on!","url":"https://www.dailymail.co.uk/femail/article-4299300/Why-burgers-better-salad-according-trainer.html"}
