{"authors":["Press Association"],"date_download":"2018-10-22 22:33:52","date_modify":"2018-10-22 22:33:52","date_publish":"2016-01-28 10:40:52","description":"Sales of publicly-owned assets, including Royal Mail and Eurostar, raised more money for the Government in 2015 than any other year in history. A total of £2...","filename":"data/vaneerConsumption/Saleofpublicassetsin2015wasbiggestinukhistory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-19c8e30e-c2ef-4503-987a-81c1be6ded2f-2vdWmEltwXfba0ce28e63275f97c-656_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420168_Sale-public-assets-2015-biggest-UK-history_1540247632.html","title":"Sale of public assets in 2015 was biggest in uk history","title_page":"Sale of public assets in 2015 was biggest in uk history | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sale of public assets in 2015 was biggest in UK history\nSales of publicly-owned assets, including Royal Mail and Eurostar, raised more money for the Government in 2015 than any other year in history.\nA total of £26.4 billion was made through privatisations, beating by almost £6 million the previous record set in 1987, according to new analysis by the Press Association.\nThe sell-offs included the Government's remaining 30% stake in Royal Mail, 5% of the Royal Bank of Scotland and more than 11 billion shares in Lloyds.\nThe sell-offs included the Government's remaining 30% stake in Royal Mail\nResponding to the findings, a Treasury spokesman said: \"Central to our plan to fix the public finances is the sale of Government assets to help pay down the national debt and ensure economic security for working people.\n\"That's why we've set an ambitious target to sell £5 billion worth of assets by 2020, which will put us on track to meet our target.\"\nShadow business secretary Angela Eagle accused Chancellor George Osborne of \"touring China selling off any British asset he could lay his hands on to the Chinese state bank\".\nShe added: \"Osborne will only meet his debt target by selling off public assets which explains why the Tories are flogging off the family silver at record pace.\"\nThe Press Association's analysis shows that almost half of the record-breaking £26.4 billion came from the sale of mortgages previously owned by Northern Rock, which brought in around £13 billion.\nMore than £1 billion was raised by the sale of the Government's remaining shares in Royal Mail, while a further £800 million came from the sale of a 40% stake in Eurostar.\nWelcoming the figures, TaxPayers' Alliance chief executive Jonathan Isaby said: \"M inisters are absolutely right to have identified assets to be sold off. Where shares, buildings or land no longer need to be in Government hands, their sale can help ease the burden on already hard-pressed taxpayers.\"\nTUC general secretary Frances O'Grady said the privatisations had \" nothing to do with providing economic security\".\n\"Eurostar and Royal Mail were both sold for well under value,\" she continued. \"Flogging them off for short-term political gain is short-changing taxpayers.\"\nIn 1987 the privatisation of British Airways, Rolls-Royce and other public assets raised a combined total of £20.7 billion in today's prices: a record that remained unbeaten until 2015.\nChief economist at IHS Global Insight Howard Archer said the bumper sell-offs in 2015 had been helped by \"largely favourable market conditions\" during much of the year.\n\"Current financial market turmoil and uncertainty could slow and delay further privatisation plans,\" he added.\nSome £2 billion of shares in Lloyds are due to go on sale to the public later this year. The privatisation of Channel 4 has also been rumoured, with David Cameron saying it is right to \"look at all the options\" over the future of the publicly-owned TV network.\nThe first sell-off of 2016 has already taken place. The Government announced on January 22 that it had sold its stake in a 67-acre redevelopment site near King's Cross station in London, raising £371 million.","url":"https://www.dailymail.co.uk/wires/pa/article-3420168/Sale-public-assets-2015-biggest-UK-history.html"}
