{"authors":[],"date_download":"2018-10-30 18:23:19","date_modify":"2018-10-30 18:23:19","date_publish":"2017-01-19 13:12:00","description":"DeKalb County officials held a town hall meeting Wednesday about sales tax proposals to pay for road repairs and infrastructure","filename":"data/vaneerConsumption/SalestaxforDeKalbroadrepairsreconsidered.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/19/Images/1-18-17%20splost%20town%20hall_3652x2286.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_s_9e739ec877a9076cbd50be58dbe72cb7__1540923799.html","title":"Sales tax for DeKalb road repairs reconsidered","title_page":"DeKalb County sales tax for roads and infrastructure debated","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County officials are telling residents about renewed proposals to raise sales taxes to pay for road repaving and other construction.\nAbout 50 people at a town hall meeting Tuesday heard about the money the sales tax could raise and the projects it could fund: resurfacing 400 miles of the county’s worst roads, building a police and fire academy, replacing fire stations.\nState lawmakers from DeKalb will reconsider legislation this year to create the county’s first special purpose local option sales tax (SPLOST). A previous effort to put the sales tax on the ballot failed last year because of an error in the legislation’s wording that would have raised homeowners’ property taxes.\nOther metro Atlanta counties already have a SPLOST that brings in hundreds of millions of dollars for local infrastructure, said DeKalb Commissioner Mereda Davis Johnson.\n“DeKalb County needs to catch up,” she said.\nThe sales tax would raise roughly $110 million a year for up to six years, for a maximum of about $660 million to spend. DeKalb’s overall sales tax rate would increase from 7 percent to 8 percent if approved by voters during a referendum.\nThe money could go toward roads, sidewalks, trails, fire stations, parks, police and libraries, according a project list proposed by a citizen panel last year.\n“The needs have grown and accumulated, so now we’re faced with the dilemma: Where do we get the money to meet those needs?” said Luz Borrero, who is DeKalb's chief operating officer for development.\nIf the Georgia General Assembly approves the sales tax measure, then the DeKalb Commission would consider a final project list and the duration of the tax.\nCommissioners have debated the size of the SPLOST.\nJohnson said she supports a full project list that includes road repairs, other infrastructure and $35 million to help fund construction of a government building in central DeKalb.\nCommissioner Kathie Gannon, who was recently elected the board’s presiding officer, has previously suggested a scaled-down SPLOST that focused primarily on roads.","url":"https://www.ajc.com/news/local-govt--politics/sales-tax-for-dekalb-road-repairs-reconsidered/5HZncXYvnMe9WqH06m8XxO/"}
