{"authors":["Kate Darvall For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 21:39:32","date_modify":"2018-10-22 21:39:32","date_publish":"2017-04-26 02:16:44","description":"Salim Mehajer pleaded not guilty in Sydney court on Wednesday to assaulting Seven News reporter Laura Banks after she was 'slammed in the car door of his Porsche'.","filename":"data/vaneerConsumption/SalimMehajerpleadednotguiltytoassaultingreporter.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9B9B8F00000578-0-image-a-37_1493169704654.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446064_Salim-Mehajer-pleaded-not-guilty-assaulting-reporter_1540244372.html","title":"Salim Mehajer pleaded not guilty to assaulting reporter","title_page":"Salim Mehajer pleaded not guilty to assaulting reporter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Salim Mehajer has pleaded not guilty to assaulting Seven News reporter Laura Banks after she was allegedly slammed in the car door of his Porsche.\nThe reporter was allegedly caught between the luxury car and car door when Mehajer tried to escape from media and drive away from a Sydney police station on April 2.\nThe former Auburn deputy mayor also pleaded not guilty to robbing and assaulting a taxi driver earlier this month.\nScroll down for video\nSalim Mehajer has pleaded not guilty to assaulting Seven News reporter Laura Banks after she was allegedly slammed in the car door of his Porsche\nSalim Mehajer is seen outside Sydney's Downing Centre Local Court on Wednesday\nMehajer, 30, appeared at Sydney's Downing Centre Local Court on Wednesday where his lawyer Mahmoud Abbas entered a plea of not guilty for four offences.\nPolice allege Mehajer threw an eftpos terminal at the taxi driver's face and stole his iPhone outside the Star Casino in the early hours of April 2.\nHe's also alleged to have destroyed another woman's iPhone on the same day as he allegedly assaulted reporter Laura Banks.\nMehajer, 30, appeared at Sydney's Downing Centre Local Court on Wednesday where his lawyer Mahmoud Abbas entered a plea of not guilty for four offences\nMehajer, 30, pictured outside Sydney's Downing Centre Local Court on Wednesday\nSalim Mehajer leaves the Downing Centre court in Sydney, Wednesday, wearing his wedding ring\nPolice allege Mehajer threw an eftpos terminal at the taxi driver's face and stole his iPhone outside the Star Casino in the early hours of April 2\nMehajer can be seen wearing his wedding ring as he leaves Sydney court on Wednesday","url":"https://www.dailymail.co.uk/news/article-4446064/Salim-Mehajer-pleaded-not-guilty-assaulting-reporter.html"}
