{"authors":["Press Association Reporter"],"date_download":"2018-10-23 01:07:20","date_modify":"2018-10-23 01:07:20","date_publish":"2016-01-11 11:40:39","description":"Salman Butt is eyeing a 'new beginning' after a superb century on his return to domestic cricket following his spot-fixing ban.","filename":"data/vaneerConsumption/SalmanButthitscenturyondomesticreturnandhopesitsthestartofnewbeginning.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/2FFA5D7E00000578-0-image-a-34_1452512404947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-3393759_Salman-Butt-hits-century-domestic-return-hopes-start-new-beginning_1540256840.html","title":"Salman Butt hits century on domestic return and hopes it's the start of new beginning","title_page":"Salman Butt hits century on domestic return and hopes it's the start of new beginning | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Salman Butt is eyeing a 'new beginning' after a superb century on his return to domestic cricket following his spot-fixing ban.\nThe former Pakistan captain was banned for five years, with a further five suspended, after being found guilty of instructing bowlers Mohammad Amir and Mohammad Asif to bowl deliberate no-balls during the Lord's Test against England in 2010.\nAmir has been named in Pakistan's limited-overs squad for the upcoming tour of New Zealand while Asif featured alongside Butt for the Water and Power Development Authority team against the Federally Administered Tribal Areas in the national one-day cup.\nFormer Pakistan captain Salman Butt scored a century on his return to domestic cricket\nAsif took two for 22 in his six overs but it was opening batsman Butt's 135 which set up a 141-run win.\nThe 31-year-old hit 14 fours and faced 143 balls, sharing in partnerships of 115 and 92 for the first two wickets in a total of 277 for seven.\nHe told journalists in Pakistan after the match: 'This is the start and I hope it is the new beginning. I will try to maintain this performance. As long as I get more matches I will improve and my rhythm will be better.\nButt completed his spot-fixing ban four months ago and has been named in squad for New Zealand tour\nButt hopes his domestic ton can be the start of a new beginning after serving a five-year ban\n'I did a lot of work to keep myself in best shape. Since I wasn't allowed to play cricket for registered clubs, I had been training at unregistered facilities and the result is there.'\nFATA were bowled out for 136 in reply, Asif removing openers Fawad Khan and Rehan Afridi.\nAnd unlike Butt, 33-year-old Asif stated his aim to play for Pakistan again.","url":"https://www.dailymail.co.uk/sport/article-3393759/Salman-Butt-hits-century-domestic-return-hopes-start-new-beginning.html"}
