{"authors":[],"date_download":"2018-10-30 01:20:30","date_modify":"2018-10-30 01:20:30","date_publish":"2018-07-25 11:37:00","description":"With waves of products being recalled with potential salmonella contamination, many people may be wo...","filename":"data/vaneerConsumption/SalmonellaSignsandsymptomsofinfection.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/04/19/Videos/4374980.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_salmonella-signs-and-symptoms-infection__1540862430.html","title":"Salmonella: Signs and symptoms of infection","title_page":"Salmonella: Signs and symptoms of infection","title_rss":"NULL","source_domain":"ajc.com","text":"With waves of products being recalled with potential salmonella contamination, many people may be wondering what salmonella is , how it is contracted and how to treat the illness.\nSalmonella was discovered by Dr. Daniel Salmon and his team about 125 years ago, according to the National Institutes of Health. Salmonella is the bacteria that causes salmonellosis.\n>> Read more trending news\nWhen infected, people normally develop diarrhea, fever and abdominal cramps that will begin between 12 and 72 hours after infection, according to the Centers for Disease Control and Prevention.\nFor most people who come down with the illness, it lasts four to seven days and most people don’t need to seek medical treatment, but some cases where diarrhea is too severe, people could need hospitalization.\nIn those extreme cases, the infection can spread from intestines to the blood stream and be spread throughout the body.\nIt can cause death if left untreated with antibiotics. Elderly, infants and people with compromised immune systems could be vulnerable.\nThe CDC says that about 1.2 million people are sickened with salmonella every year leading to 23,000 hospitalizations and 450 deaths each year in the United States. In most cases, food is to blame for the illnesses.\nNormally, when the infection is cured, patients will recover completely but it could be months until the digestive track returns to normal, the CDC says.\nBut some patients can have what’s called reactive arthritis that can last for months or years. Reactive arthritis can lead to chronic arthritis, eye irritation or painful urination, the CDC reports.\nHow to prevent salmonella infections\nCook foods like poultry, ground beef and eggs completely.\nDon’t eat or drink foods with raw eggs or unpasteurized milk.\nWash hands, kitchen surfaces and utensils with soap and water after they are in contact with raw meat or poultry.\nWash hands with soap and water after touching reptiles, birds or baby chicks or after coming in contact with animal feces.\nAvoid cross-contamination. Keep uncooked meats separate from cooked foods, produce and ready-to-eat foods.\nInfected people should not prepare food or drink for others until symptoms subside.\nInformation compiled from the Centers of Disease Control and Prevention.","url":"https://www.ajc.com/news/national/salmonella-signs-and-symptoms-infection/zVZ05fQ6W5YWiht6YgD92N/"}
