{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 20:47:56","date_modify":"2018-10-22 20:47:56","date_publish":"2016-01-29 03:50:13","description":"The 49-year-old sported splotchy acne makeup as she arrived on set of her upcoming movie in White Plains, New York on Thursday. Costar Alec, 57, wore a grey suit and blue tie.","filename":"data/vaneerConsumption/SalmaHayeksportsacnemakeupasshefilmsDrunkParentswithAlecBaldwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AEBAD800000578-0-image-a-17_1454038252751.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422139_Salma-Hayek-sports-acne-make-films-new-comedy-Drunk-Parents-Alec-Baldwin_1540241276.html","title":"Salma Hayek sports 'acne make-up' as she films Drunk Parents with Alec Baldwin","title_page":"Salma Hayek sports 'acne make-up' as she films Drunk Parents with Alec Baldwin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's considered one of the most beautiful women in the world.\nBut Salma Hayek went for a very different look with a face full of fake acne as she arrived on set to film comedy Drunk Parents with costar Alec Baldwin in White Plains, New York on Thursday.\nThe 49-year-old's splotchy complexion included three large spots on her forehead, cheek and chin.\nNew look: Salma Hayek was seen with a spotty complexion as she filmed comedy Bad Parents in White Plains, New York on Thursday\nBut the actress appeared untroubled by her new look, smiling and chatting with a crew member as she arrived on set.\nSalma and Alec star as two parents who drop their child off at college and then get drunk and stumble into a kidnapping and case of mistaken identity.\nThe Mexican-born beauty bundled up in a black coat with blue faux fur trim, which she wore over a knee-length blue dress.\nThe Frida star pulled her brunette hair back in a messy ponytail, and kept the rest of her makeup minimal.\nMake up: The 49-year-old smiled as she arrived on set made up to look like she had bad acne\nCozy: The actress bundled up in a dark coat with blue faux fur trim\nThe actress added sheer black tights and flashy gold high-topped sneakers\nSalma, who recently starred in and produced animated film The Prophet, has an eight-year-old daughter Valentina with her husband, billionaire Kering CEO Francois-Henri Pinault,\nAlso seen heading to the set in White Plains on Thursday was actor Alec Baldwin, who plays Salma's husband.\nRelaxed: Salma wore black tights and shiny gold sneakers\nThe 57-year-old actor looked sharp in a grey suit, which he wore over a light blue shirt and navy tie.\nAlec looked focused as he climbed out of his SUV and buttoned up his suit jacket.\nThe New Yorker, who has a two-year-old daughter Carmen and six-month-old son Rafael with wife Hilaria, 32, chatted with a crew member as he headed to the set.\nCostar: Actor Alec Baldwin, who plays Salma's husband in the film, arrived on set wearing a stylish grey suit\nReady to go: The New Yorker appeared serious as he headed to work\nHe is also father of model Ireland Baldwin, from his marriage to actress Kim Basinger.\nThe costars previously worked together on sitcom 30 Rock.\nSalma made a cameo as the devout girlfriend of Alec's conservative CEO character Jack on the cult comedy show.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422139/Salma-Hayek-sports-acne-make-films-new-comedy-Drunk-Parents-Alec-Baldwin.html"}
