{"authors":["Australian Associated Press"],"date_download":"2018-10-23 04:58:30","date_modify":"2018-10-23 04:58:30","date_publish":"2017-03-10 15:00:27","description":"The jury was taken to areas at Salt Creek, SA on Friday to see a number of spots where it's alleged a 60-year-old man attempted to murder a German woman after sexually assaulting her friend.","filename":"data/vaneerConsumption/SaltCreekbackpackerwassexuallyassaultedbyman60.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2377FA00000578-0-image-a-96_1489157987515.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301286_SA-backpacker-sexual-assault-jury-taken-Salt-Creek_1540270710.html","title":"Salt Creek backpacker was 'sexually assaulted' by man, 60","title_page":"Salt Creek backpacker was 'sexually assaulted' by man, 60 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Supreme Court jury has been taken to a series of remote locations south of Adelaide as the trial continues for a man charged over an attack on two female backpackers.\nThe jury of eight men and four women was taken to areas at Salt Creek in the Coorong National Park on Friday to see a number of spots where the alleged attack took place in February last year.\nKey spots on the sand dunes were marked with orange cones as prosecutor Jim Pearce added context to his graphic opening at the start of the trial on Thursday.\nThe jury of eight men and four women was taken to areas at Salt Creek to see a number of spots where the alleged attack took place in February last year. Key spots on the sand dunes were marked with orange cones\nA 60-year-old man is charged with attempted murder, kidnapping, indecent assault and other offences\nA 60-year-old man is charged with attempted murder, kidnapping, indecent assault and other offences.\nThe crown alleges a German woman was struck over the head with a hammer and run over by a 4WD shortly after her Brazilian friend was sexually assaulted.\nMr Pearce told the jury the backpackers met the man through classifieds website Gumtree when they sought a lift from Adelaide to Melbourne.\nHe said the Brazilian woman was the first to be attacked, with allegations the man threw her to the ground, tied her arms behind her back, cut off her bikini and sexually assaulted her.\nSome time later the woman's German friend was hit over the head with a hammer several times and rammed with the 4WD, the car running over her on one occasion, Mr Pearce said.\nThe crown alleges a German woman was struck over the head with a hammer and run over by a 4WD shortly after her Brazilian friend was sexually assaulted\nBy the time she and her friend managed to get help, she was covered in blood.\n'Her hair was so drenched with blood that you could've wrung it out like a wet towel,' Mr Pearce told the jury during his opening.\nDefence counsel Bill Boucaut, who also took part in Friday's view, urged the jury to keep an open mind.\n'Sometimes things are not always what they appear to be,' Mr Boucaut told the court on Thursday.\nThe trial will continue in Adelaide on Tuesday.","url":"https://www.dailymail.co.uk/news/article-4301286/SA-backpacker-sexual-assault-jury-taken-Salt-Creek.html"}
