{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 00:55:40","date_modify":"2018-10-23 00:55:40","date_publish":"2016-01-28 15:02:29","description":"Salvatore Perrone, of Staten Island, New York, is charged with murdering the men, all of Middle Eastern descent, during a five-month killing spree in 2012.","filename":"data/vaneerConsumption/SalvatorePerronewhomurderedthreeBrooklynshopkeepersseenwithkillkit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB032A00000578-0-image-a-2_1453991656331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420978_Alleged-serial-killer-murdered-three-Brooklyn-shopkeepers-Middle-Eastern-descent-gun-seen-kill-kit-minutes-final-shooting_1540256140.html","title":"Salvatore Perrone 'who murdered three Brooklyn shopkeepers seen with 'kill kit'","title_page":"Salvatore Perrone 'who murdered three Brooklyn shopkeepers seen with 'kill kit' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The alleged killer has pleaded not guilty to the murders and refutes police reports that he implicated himself during questioning\nCourt documents show Perrone told cops he was a CIA operative paid by Arab men to kill Jews but he was found mentally fit to stand trial\nInvestigators found the gun was used in all three murders which took place in shops which had no security cameras\nSalvatore Perrone, of Staten Island, (pictured in court last week) is charged with murdering the men, all of Middle Eastern descent, during a five-month killing spree in 2012\nA man accused of killing three Brooklyn shopkeepers with the same gun was seen with a 'kill kit' moments before one of the murders, a court heard.\nSalvatore Perrone, of Staten Island, New York, is charged with murdering the men, all of Middle Eastern descent, during a five-month killing spree in 2012.\nThe 66-year-old clothing dealer was dubbed 'John Doe Duffel Bags' by police before his arrest after he was seen carrying a bag in surveillance footage.\nOfficers then discovered a bag, containing a sawed-off shotgun and bloody knife hidden behind Perrone's girlfriend's couch.\nJurors in his murder trial on Wednesday were shown surveillance footage, captured from a store across the street, of Perrone lurking outside the second victim's 99-cent shop with the bag prosecutors have called his 'kill kit', New York Post reports.\nIsaac Kadare's body was discovered inside his Amazing 99 Cent Deals store, in Bensonhurst, later that evening on August 2, 2012.\nThe father-of-four, 59, had been shot in the face and stabbed repeatedly in the neck while officers found that the $900 he had collected from a tenant earlier that day was missing.\nCrime Scene Unit Detective Carlos Pantoja told the court previously that Perrone attempted to cover up the murder of the Jewish shopkeeper by placing bleach around the body and an aluminum tray on the victim's face, JP Updates reported.\nPantoja described the smell of bleach at the crime scene and discoloration to the victim's pants from the Clorox.\n'He was laying on his right side, and there was a pool of blood,' he added.\nCourt documents reveal the alleged serial killer told cops he was a CIA operative paid by Arab men to kill Jews.\nAn NYPD source close to the investigation told SI Live Perrone told detectives he confessed to the two earlier murders and that he did it to 'promote world peace'.\nBut Perrone, who was found by psychologists to be fit to stand trial, pleaded not guilty to three counts of murder and now refutes police reports that say he implicated himself in the killings during questioning.\nCaught on camera: The balding, mustachioed suspect, dubbed 'John Doe Duffel Bags' by police, who was seen carrying what prosecutors call a 'kill kit' near the murder scenes of two victims. Pictured left, carrying a bag on November 16, 2012, close to the shop of victim Rahmatollah Vahidipour, and right, walking with the bag shortly before Isaac Kadare was killed on August 2, 2012\nWeapon: Police say that Perrone used this sawed-off shotgun to kill three New York shop keepers\nPerrone previously underwent a court-ordered psychiatric exam and was deemed fit for trial\nHe is also accused of murdering Egyptian Mohammed Gebeli, 65, in Bay Ridge and Rahmatollah Vahidipour, an Iranian.\nAll three shopkeepers were men alone in stores that had no video cameras.\nOn July 6, Gebli was found shot through the neck in his Valentino Fashion Inc. clothing shop. His body had been hidden beneath some of his own store's merchandise - as were the other bodies.\nPolice believe the alleged killer does this to buy himself more getaway time by delaying the discovery of the bodies.\n'I hope they catch the son of a b****,' Gebeli's son, Mourad said.\nIn the final murder before Perrone's arrest, Vahidipour was shot three times in the head and chest at his store on November 16, 2012.\nThe Daily News reports that the shop owner, of Great Neck, was behind the counter of She She in Brooklyn's Flatbush when he was shot.\nIsaac Kadare, a father-of-four, 59, was shot in the face and stabbed repeatedly in the neck while working at his store\nKadare's body was discovered inside his Amazing 99 Cent Deals store, in Bensonhurst, later that evening on August 2, 2012\nThe gunman dragged the victim's body toward the back of the store and covered it with clothing.\nWhen Rahmoatollah didn't come home at the usual time his family called the police, who discovered the 78 year old with two gunshot wounds to the head and one to the torso.\nOn the floor of the shop were the killer's calling card: shell casings matching casings left at the scenes of the last two homicides.\n'Now it's like he's telling us, 'It's me again,'' a police source told the New York Daily News.\n'He never had in his whole life one enemy, he didn't have, he was a very kind man,' his wife, Naima Rahmatollah, told reporters.\nAfter that killing, detectives discovered the same gun was used in the fatal shootings of two other shopkeepers when ballistics matched the .22-caliber gun shell casings on all three.\nBallistics tests matched in each killing, all of which occurred in Brooklyn shops with an '8' in the address.\nMurdered: Shopkeepers Rahmatollah Vahidipour (left) and Mohammed Gebeli (right) were killed by the same gun in 2012\nUnguarded: Police believe the killer was attracted to Vahidipour's store because, as with previous crime scenes, there were no cameras\nPeronne was caught on surveillance footage a block and a half away from the Flatbush store where Vahidipour was killed.\nMinutes later, the same mustachioed suspect is seen in a different video two blocks away from the store.\nOn Wednesday, the court heard from another clothing shop manager, Rafael Picshardo, who said Perrone came into his store on the same day as the Rahmoatollah murder, but fled after noticing the security cameras.\n'I felt uncomfortable,' said Picshardo, according to the New York Post. He said Perrone stood there for 10 minutes, just 'looking up' and completely ignoring everyone.\n'People were approaching him saying, 'Good morning, hello,' and he didn't say anything,' Picshardo told the court. He eventually asked Perrone, 'What the f- is wrong with you?'\nThe New York Post reports that a different surveillance camera, located by the scene of the second murder in Bensonhurst also shows the same man.\nPerrone (pictured being transported to court in November 2015) is accused of killing three Brooklyn shopkeepers of Middle Eastern descent\nAt Brooklyn Supreme Court on Wednesday, Perrone, who suffers from personality and delusional disorder and is prone to outbursts remained uncharacteristically quiet\nThe video is of poorer quality, but police say that the same duffel bag-toting man was in the area around the time that shopkeeper Kadare was killed on August 2, New York Post reports.\n'John Doe Duffel Bag' wore a long overcoat and carried a duffel bag,' police commissioner Ray Kelly said.\n'He was seen in the vicinity of Vahidipour's store just after 6pm. The shop owner's body was found at 7.11pm.'\nNYPD Commissioner Raymond Kelly previously labelled Perrone a 'serial killer' who is likely to have continued the murder spree.\n'I think it's reasonable to assume that he was going to continue doing this, and, by arresting him, we saved lives,' Commissioner Kelly said in 2012.\nBesides owning stores, each victim was of Middle Eastern descent, prompting suspicion the killer could be racially motivated.\nPeople who've crossed paths with Perrone have described him as a man who wanted people to believe he was a tough guy, going so far as to claim he was a retired police officer.\nSalvatore Perrone (pictured in a 2001 police mugshot provided by the Franconia Township Police Department in Telford, PA) is charged in connection with the Brooklyn murders\n'He was the kind of guy who you could tell had watched 'The Godfather' too many times,' Ben Elchonen, 26, who lives in the same apartment building as Charova, told Reuters.\nElchonen said Perrone often spoke as if he were a police officer and once questioned him as to why he was on the building's roof, saying: 'we've gotten reports of someone throwing eggs'.\n'He acted like a tough guy, but he wasn't at all,' Elchonen said. 'He spoke with this heavy Italian accent, but you could tell he was playing a part, playing a role.'\nAt Brooklyn Supreme Court on Wednesday, Perrone, who suffers from personality and delusional disorder and is prone to outbursts remained uncharacteristically quiet.","url":"https://www.dailymail.co.uk/news/article-3420978/Alleged-serial-killer-murdered-three-Brooklyn-shopkeepers-Middle-Eastern-descent-gun-seen-kill-kit-minutes-final-shooting.html"}
