{"authors":["Jan Moir For The Daily Mail"],"date_download":"2018-10-22 20:23:29","date_modify":"2018-10-22 20:23:29","date_publish":"2016-01-29 01:24:59","description":"For a long time it has been obvious to everyone that Samantha Cameron is her husband’s greatest asset, yet the British public have never really heard her voice. Until now, writes JAN MOIR.","filename":"data/vaneerConsumption/SamanthaCameronmakeshusbandDavidlookhalfbakedwritesJANMOIR.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/309B558400000578-0-image-a-16_1454030174138.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3422036_When-comes-common-touch-posh-Sam-makes-Dave-look-half-baked-JAN-MOIR-says-Mrs-Cameron-s-mass-exposure-Bake-shows-s-sweet-fondant-fancy_1540239809.html","title":"Samantha Cameron makes husband David look half-baked, writes JAN MOIR","title_page":"Samantha Cameron makes husband David look half-baked, writes JAN MOIR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"During the six years he has been Prime Minister, she has been dutifully at his side.\nShe has kissed babies, cut ribbons, opened garden centres and worn a carefully curated selection of outfits that speak of High Street and affordability, not privilege and expense.\nIn her favourite peep-toe shoes, she has never, not once, put a foot wrong, while her glossy perma-smile and wash’n’glow hair tell their own story of wifely Tory duty.\nScroll down for video\nThe UK finally heard Samantha Cameron's (pictured) voice for the first time, writes Jan Moir\nFor a long time it has been obvious to everyone that Samantha Cameron is her husband’s greatest asset, yet the British public have never really got to know her or even heard her voice.\nUntil now.\nThis week, SamCam appeared as a contestant on BBC’s The Great Sport Relief Bake Off.\nThe charity baking competition was Mrs Cameron’s first mass exposure in her own right — and what a triumph it turned out to be.\nNearly five million people watched as the Prime Minister’s wife made flawless rough puff pastry, piped cream onto an obscure French fancy and buffed her fondant icing like a pro.\nYes, she bakes like a dream and went on to beat the three other celebrity contestants to win her heat — but what was really important was that we saw a glimpse at last of what she’s really like: sweet, self-deprecating and warm.\n‘I’ve never had to concentrate so hard,’ she cried at one point, but it was all worthwhile.\nMrs Cameron appeared as a contestant on the BBC's The Great Sport Relief Bake-Off, pictured\n‘I’ve seen a lot of canapes in my time and they are absolutely perfect,’ said judge Paul Hollywood, sampling her crab and shrimp vol-au-vents which are, apparently, a Cameron family favourite.\nPresented with a winner’s bouquet at the end of the show, Samantha laughed and said: ‘I’m normally being given flowers for being David’s wife, so it’s really nice being given flowers for, you know, doing something that I’ve done on my own.’\nAll this was said without rancour or edge as she took a simple pleasure in her own sugar-sprinkled moment of glory.\nThis made me think Samantha seems to be decent and genuine in a way that her husband never does — even when he really is being sincere.\nTake yesterday, for example, when the PM was talking about the Government’s flood response with local tourist chiefs in Grasmere.\nDuring the meeting, Dave still had the air of a man killing time with dull provincial paupers before he could rush back to London and quaff claret and nibble on caviar toasts with his chums.\nThe only thing that makes me believe that this uncharitable thought can’t be true is that the fragrant Samantha could never be married to such a boor. Could she?\nThe Prime Minister's wife 'seems to be decent and genuine in a way that her husband never does'\nOf course, the appearance of such a high-profile Conservative wife on a BBC entertainment programme — alongside fellow contestants comedian Jason Manford, former England goalkeeper David James and EastEnders actress Maddy Hill — did not pass without complaint from some quarters.\nMany Twitter dullards, unable to think beyond entrenched political hatreds, vowed they would never watch the show again.\nSomeone called Thomas CW wrote: ‘Samantha Cameron’s signature bake should be an austerity cake with working-class families (sic) tears sprinkled on top.’\nYou’d have to have a heart made of frozen marzipan not to guffaw at the pantomime piety.\nSome viewers also complained that during the show Mrs Cameron kept defining herself in terms of her husband and family; talking about his ‘enthusiastic’ cooking skills, admitting that he was ‘bad’ at clearing up in the kitchen, enthusing how ‘thrilled’ their daughter would be at her performance.\nYet the show was filmed over a two-day marathon bakeathon — and the producers would have wanted to include as many references to the PM as possible.\nI don’t think a few throwaway remarks amount to an inferiority complex, do you?\nThere was some scepticism about her claim she hadn’t realised her show-stopper surfing-themed cake was a vivid true Tory blue in colour.\nTo be honest, her oh-so innocent denials on this front were a bit harder to swallow.\nYet Samantha wowed everyone; charming viewers, critics and commentators alike in a way that is incredibly rare in the arena of the political spouse.\nIt was certainly in marked contrast to other high-profile political wives, whose every moment in the limelight is matched only by an exponential increase in public hostility.\nDuring the ten years that her husband was prime minister, Cherie Blair was loathed even more every time she opened her gob or unleashed another of her skull-splitting laughs.\nHer vulgar disclosure that their last child, Leo, was conceived in Balmoral Castle because she was too embarrassed to pack something she called her ‘contraceptive equipment’ was — urgh — the last straw.\nThen we had Gordon Brown’s wife Sarah writing self-important articles in newspapers about the bee-boxes and wormery she has installed in the Downing Street garden.\nOr lecturing the nation about crumbles (‘In spring, early rhubarb is just delicious’) and going on stage at a Labour party conference to introduce ‘My husband, my hero’.\nStop torturing us!\nMrs Cameron, pictured with ex-England goalkeeper David James, made a show-stopping Surf Cake\nShe said she was happy to get flowers for something she had done rather than 'being the PM's wife'\nMeanwhile, Miriam Clegg seems to meddle too much, while her mad, giggling stunt as guest editor on Radio Four’s Today programme after Christmas only shot even more cannonballs through the tattered remnants of any wifely popularity she once had.\nAnd Justine Miliband lost all credibility after she and husband Ed misrepresented the kitchen in their £2 million home.\nOf course, these days, everyone is on permanent privilege alert, with Mr Cameron’s Eton background in particular seen as a vote-losing handicap.\nYet the truth is that star baker Samantha, with her effortless common touch, is ever so much posher than him.\nHer father is Sir Reginald Sheffield, her mother is now married to Lord Astor, her sister Emily is deputy editor at British Vogue magazine.\nSamantha grew up on a 300-acre estate in Lincolnshire and the family also own another large estate in Yorkshire.\nFriends say that after watching herself on the programme this week, Mrs Cameron was shocked at how ‘posh’ she sounded.\nFor the irony is that she has always seen herself as a counter-culture figure, even though she has spent much of the past half-dozen years trapped in the aspic of Tory high command.\nThere were hints of gentle rebellion when she studied art in London and Bristol — well, as rebellious as a baronet’s daughter ever gets before marrying someone from the Home Counties with a beefy complexion and excellent prospects, just like Dave.\n'When she first came on the scene, the other Tory wives had never seen a Tory wife quite like Sam'\nIn her wild days pre-settling down to marriage and motherhood, she hung out with a hip-hop artist and had a small but daring dolphin tattoo inked on her right ankle.\nEven now she says she prefers the town to the country, loves Star Wars and still has a fondness for obscure indie music.\nWhen she first came on the scene, the other Tory wives had never seen a Tory wife quite like Sam — and the grassroots matrons originally disapproved of her and her fancy Notting Hill ways.\nAfter all, Tory wives are there to make the sandwiches and keep their opinions to themselves.\nNot to become — as SamCam once briefly did in the run-up to the 2010 election — a ‘social action champion’ charged to speak on behalf of her husband.\nGenerally, however, she has flitted through political life as silently as a geisha, although there is much speculation about how much sway she has behind closed doors.\nSome say that she is a significant political voice who counsels her husband in the way one might expect from a wife with a liberal arts background.\nShe stood up for gay marriages and for Syrian refugees as an ambassador for Save The Children.\nSome even suspect that the PM retreated this week from letting in more unaccompanied child refugees because it might give the impression his wife had too much influence.\nGiven the fact that he has such a palpably charming spouse, the strange thing is that Cameron still has a problem with women voters, who largely remain entirely resistant to his charms.\nSam, second right, pictured with Mary Berry, far right, Paul Hollywood, second left, presenter Mel Giedroyc, far left, and fellow contestants (from left) Maddy Hill, David James and Jason Manford\nYet whenever Samantha appears on his arm, he is redeemed.\nSurely a man with such a commendable wife cannot be useless in absolutely every respect? She gives him credibility both as a man and as a politician.\nHowever, he still comes close to ruining everything! In a newspaper interview, the Tory leader once revealed he and Samantha like to relax by having a siesta and ‘cuddles’ in the afternoon.\nOn another occasion, he declared his feelings for his wife on national television by saying: ‘I just love her!’ while she sat at his side, looking terrified.\nThat’s another reason why Wednesday’s Bake Off appearance was such a triumph.\nFor once, the Prime Minister’s wife could be herself in the spotlight instead of being frightened of a hostile question or of saying the wrong thing.\nWhat was the worst that could happen this time? That she burned her hazelnut praline? Actually she did — but she relaxed into her role and survived to tell the tale.\nIn the past, Samantha Cameron’s reluctance to push herself into the limelight or to comment on the issues of the day and guest-host radio programmes means some have dismissed her as an air-head.\nSam and David Cameron, pictured, have four children together\nYet friends say her time at the luxury stationery company Smythson proved she has business savvy — and she has certainly got style.\nOn The Great Sport Relief Bake Off, as she made neat sugar paste surfboards and cut waves from three different shades of icing, it was clear she has some talent.\nShe said having a fine art degree helped her with the design of the cake and — stop laughing at the back — one could see that was true.\nIn the end, this simple baking show was a kind of coming-out for a woman who has been trapped behind the door of No 10.\nUntil now, all we knew about Sam was that she was a devoted wife, a great mum to her four children and was dignified in her grief when son Ivan died at the age of six.\nNow she has emerged as a fully rounded human being, capable of producing laughs as well as pastries. She bakes! She speaks! She does blue icing swirls! And she won!","url":"https://www.dailymail.co.uk/debate/article-3422036/When-comes-common-touch-posh-Sam-makes-Dave-look-half-baked-JAN-MOIR-says-Mrs-Cameron-s-mass-exposure-Bake-shows-s-sweet-fondant-fancy.html"}
