{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-23 00:08:21","date_modify":"2018-10-23 00:08:21","date_publish":"2016-01-28 13:41:32","description":"The 44-year-old wife of Prime Minister David Cameron is at the centre of an angry social media backlash following her victory on last night's The Great Sport Relief Bake Off.","filename":"data/vaneerConsumption/SamanthaCameronistrolledfollowingherBakeOffwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA738400000578-0-image-a-42_1453986609415.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420849_Samantha-Cameron-trolled-following-Bake-win_1540253301.html","title":"Samantha Cameron is trolled following her Bake Off win","title_page":"Samantha Cameron is trolled following her Bake Off win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One viewer said her signature bake should have been an 'austerity cake'\nShe dazzled the judges with her 'beautiful' vol-au-vents and fondant smoothing skills.\nBut Samantha Cameron, wife of Prime Minister David Cameron, has found herself at the centre of an angry social media backlash following her victory on last night's The Great Sport Relief Bake Off.\nOne viewer claimed the inclusion of the 44-year-old mother-of-three in the charity programme - alongside fellow contestants Jason Manford, David James and Maddy Hill - had put them 'right off watching it'. While another made a cruel dig and said she should have made an 'austerity cake'.\nSamantha Cameron, wife of Prime Minister David, has found herself at the centre of an angry social media backlash following her victory on last night's The Great Sport Relief Bake Off\nOne viewer claimed the inclusion of Samantha in the charity programme - alongside fellow contestants Jason Manford, David James and Maddy Hill - had put them 'right off watching it'\nSamantha seemed genuinely surprised to come out victorious on the BBC1 show - much to the dismay of some viewers at home who aired their views on social media\nHowever, others were quick to leap to the defence of Samantha saying she came across 'brilliantly' on screen and looked like 'a bit of a babe'.\nSamantha showcased her kitchen skills from the get-go and the Signature Challenge clearly paid to her strengths.\nThe businesswoman was seen effortlessly whipping up vol-au-vents containing 'Cornish crab and shrimp curry with black mustard seeds, fresh chilli, garlic, and ginger'.\nMary Berry stared in awe at the delicate puffs of pastry as Paul Hollywood commented: 'I’ve seen a lot of vol-au-vents in my time. And they are absolutely perfect ! The kick from the chilli is there but it doesn’t overwhelm the shrimp or the crab. It’s a beautiful texture.’\nStyle icon Samantha continued to impress and shown during the Showstopper Challenge.\n‘I am by trade a designer and I did Fine Art for my degree,’ she pointed out. ‘So, in theory I should be good at this.’\nThe wrath continued as Carrie Gough commented: 'Anyone on @sportrelief #bakeoff asked #SamCameron why she's there when it's her husband who is forcing the vulnerable into poverty & need?'\nA fired up David Burns wrote: 'Tonight on #bakeoff, millionaire #samcam asks for donations whilst her husband destroys the welfare state forcing more to depend on charity'\nWhile Joe Hudson commented: '\"My husband hasn't mastered clearing up as you go along\" You can say that again #SamCam.#bakeoff'\nThe Great Sport Relief Bake Off contestants, pictured from left, Samantha Cameron, David James, Jason Manford and Maddy Hill with host Mel Giedroyc, centre\nRabia Barkatulla said: '#bakeoff #sportsrelief Sam-please-like-me!-Cameron, hearts bleed as she accepts flowers because of who she is married to. Difficult job'\nMeanwhile. Steve Dunstan added: 'Samantha Cameron being on #BakeOff has put me right off watching it'\nShe duly knocked up a cake adorned by what looked like a German flag, mini surfboards made of sugar paste, and a blue wave effect that even Mary Berry had never seen before.\nPaul gushed: ‘Each sponge is very well baked and it’s very well executed. You should feel very proud of yourself, well done.’\nSamantha seemed genuinely surprised to come out victorious on the BBC1 show - much to the dismay of some viewers at home.\nTaking to Twitter, an outraged user called Thomas CW wrote, 'Samantha Cameron's signature bake should be an austerity cake with working class families tears sprinkled on top #BakeOff.'\nWhile an angry Jess Green added: 'How lovely of Sam Cam to be doing charity work to support some of the most vulnerable people forced in to poverty in this country. #bakeoff.'\nSocial media user Laur Evans quipped: 'What a surprise that Sam Cam went for something traditional, but not well thought through. #BakeOff.'\nThe wrath continued as Carrie Gough commented: 'Anyone on @sportrelief #bakeoff asked #SamCameron why she's there when it's her husband who is forcing the vulnerable into poverty & need?'\nMany annoyed Twitter contributors embroiled their opinions on David Cameron into Samantha's television appearance.\nA supporter with the online user name Shiner hit back at the criticism, said: '#bakeoff people need to get over SamCam winning bake off FFS grow up she's not the devil #pathetic #itsnotpolitics'\nAn admirer called Rebecca wrote: 'Sam Cam came across brilliantly on #bakeoff I don't know who David or maddy are though.'\nSamantha Cameron appeared in high spirits as she got to work on her cake creations during the Bake Off\nWhile another fan, Miranda, said: 'Thought #SamanthaCameron was the perfect winner on @sportrelief #BakeOff'\nRichard Mills gushed about the fashion figure, saying: '#SamCam - bit of a babe #sportrelief #bakeoff'\nA fired up David Burns wrote: 'Tonight on #bakeoff, millionaire #samcam asks for donations whilst her husband destroys the welfare state forcing more to depend on charity.'\nWhile Joe Hudson commented: '\"My husband hasn't mastered clearing up as you go along\" You can say that again #SamCam.#bakeoff.'\nOne viewer was unimpressed with how Samantha reacted to her win - joking she only usually gets flowers for being the Prime Minister's wife - while another said her appearance was a turn off.\nRabia Barkatulla said: '#bakeoff #sportsrelief Sam-please-like-me!-Cameron, hearts bleed as she accepts flowers because of who she is married to. Difficult job.'\nMeanwhile, Steve Dunstan added: 'Samantha Cameron being on #BakeOff has put me right off watching it.'\nBut it wasn't all bad news for Samantha with many fans leaping to her defence, saying the show isn't about politics.\nA supporter with the online user name Shiner, hit back at the criticism: '#bakeoff people need to get over SamCam winning bake off FFS grow up she's not the devil #pathetic #itsnotpolitics.'\nSamantha is seen talking through her Showstopper cake with presenter Mel Giedroyc\nOther said she 'came across brilliantly' and 'was the perfect winner'.\nAn admirer called Rebecca wrote: 'Sam Cam came across brilliantly on #bakeoff I don't know who David or maddy are though.'\nWhile another fan, Miranda, said: 'Thought #SamanthaCameron was the perfect winner on @sportrelief #BakeOff.'\nRichard Mills gushed about the fashion figure, saying: '#SamCam - bit of a babe #sportrelief #bakeoff.'\nThe Great Sport Relief Bake Off cooked up 4.6 million viewers on Wednesday night. The programme has three more episodes to air over the coming weeks.\nUnlike in the regular series of The Great British Bake Off, each of the 16 participants in the charity version only appears once, with a star baker crowned during each of the four episodes.\nSamantha chats to former England goalkeeper David James during filming for the Bake Off","url":"https://www.dailymail.co.uk/femail/article-3420849/Samantha-Cameron-trolled-following-Bake-win.html"}
