{"authors":[],"date_download":"2018-10-21 02:48:53","date_modify":"2018-10-21 02:48:53","date_publish":"2018-08-27 19:00:40","description":"Since coming to The Post in late 2016, Samantha has impressed her editors on the Morning Mix with her resourceful, energetic reporting and ability to find stories overnight that resonate with readers.","filename":"data/vaneerConsumption/SamanthaSchmidtjoinstheSocialIssuesteam.json","image_url":"https://www.washingtonpost.com/resizer/Ra4ByBKpz34zVuHXbFEl1TJdXII=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3V4XIQR7GYYU7GRNLGIQ4EXRYM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_27__1540090133.html","title":"Samantha Schmidt joins the Social Issues team","title_page":"Samantha Schmidt joins the Social Issues team - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Local Editor Mike Semel, Deputy Local Editor Monica Norton and Local Editor Sydney Trent:\nWe are delighted to announce that Samantha Schmidt will join the Social Issues team to take on the gender and family beat.\nSince coming to The Post in late 2016, Samantha has impressed her editors on the Morning Mix with her resourceful, energetic reporting and ability to find stories overnight that resonate with readers. They include her profile of Tammie Jo Shults, the former fighter pilot who calmly landed a Southwest Airlines flight after its engine exploded; her interview with the family that lost nine relatives across three generations in the Texas church shooting; a moving story about an Arizona family struggling with a mother’s deportation and a viral tale about a clarinetist whose ex-girlfriend faked a rejection letter from his dream school.\nWhen National needed a reporter to cover Hurricane Maria, Samantha booked the last flight to Puerto Rico before the storm hit. Amid extraordinary limitations, she anchored the coverage on the island for nearly two weeks, collaborating with a team in D.C. and often beating the competition. Her story about the gathering of the island’s mayors was the first to illuminate the scope of Maria’s severe damage. Now, she is back on the story for our anniversary coverage.\nSamantha graduated from Indiana University in 2016 with a B.A. in journalism. She was a James Reston Reporting Fellow at The New York Times in 2016 and has held internships at the Tampa Bay Times, the Star Tribune of Minneapolis and Dow Jones. She grew up in Plymouth, Minnesota, outside of Minneapolis, but escaped to Costa Rica for the winter holidays to visit with her mother’s family there. Samantha is fluent in Spanish and speaks some Arabic.\nSamantha says she can’t wait to be part of the newsroom during the daytime, and the Social Issues team is excited to get her on board. She starts Sept. 10.","url":"https://www.washingtonpost.com/pr/wp/2018/08/27/samantha-schmidt-joins-the-social-issues-team/"}
