{"authors":["Samantha Brick For Mailonline"],"date_download":"2018-10-22 21:51:22","date_modify":"2018-10-22 21:51:22","date_publish":"2016-01-29 08:14:24","description":"The controversial writer, who lives in France with her husband Pascal, says that no self respecting Gallic mother arrives at the school gates without being perfectly coiffed and made-up.","filename":"data/vaneerConsumption/SamanthaBricktellsBritainsslummymummiestocopyFrenchwomen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC4B6000000578-0-image-a-55_1454001093112.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421344_Samantha-Brick-tells-Britain-s-slummy-mummies-copy-French-women_1540245082.html","title":"Samantha Brick tells Britain's slummy mummies to copy French women","title_page":"Samantha Brick tells Britain's slummy mummies to copy French women | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"My, my how I chortled into my café au lait this week when I read that British mothers had plummeted to yet another all time low.\nYes, I’m talking about wearing pyjamas, which have become such common clobber at the school gate that a headteacher at a school in Darlington this week was forced to ban them. More worryingly, she caused such uproar for doing so one mother turned up wearing her nightclothes in protest.\nWomen what on earth are you thinking? The first crime you have committed is wearing clothes that should be left relegated to your childhood. Second of all, you’re wearing said saggy-bottomed, elastic-waisted, passion-killers in public.\nLeft: Karen Routh wearing her pyjamas in protest of the headmistress's ban of nightwear at the school gate at Skerne Park Academy in Darlington. Right: Writer Samantha Brick says no wonder UK men cheat\nWriter Samantha Brick, pictured with husband Pascal, warns British women: 'Is it any wonder that your other half is sneakily logging onto Facebook, constantly volunteering to go overseas on ‘essential’ work trips, and going to bed much later than you in a bid to avoid your overweight self, encased in a sweaty man-made fibre'\nIs it any wonder that your other half is sneakily logging on to Facebook in search of another lover, constantly volunteering to go overseas on ‘essential’ work trips, and going to bed much later than you in a bid to avoid your could-try-harder, overweight self, encased in a sweaty man-made fibre outfit.\nNo wonder you can’t keep a hold of your man!\nHe wants a woman to flaunt her curves. He’d really like you to wear clothes that demonstrate to him you’re making an effort. Secretly he really wants to be reminded of that gorgeous young thing he waltzed up the aisle with.\nHe does not want to come home to a woman looking like an extra from One Flew Over The Cuckoo’s Nest.\nYou wearing your PJs throughout the day? You might as well be sporting a sign announcing you’ve given up on sex too.\nSamantha Brick says when she used to do the school run for her stepson in France she did it 'to perfection' and always looked groomed at 7am. She asks UK mothers: 'Surely it’s not rocket science to organize – and stick to - a routine where you’re up first, bathed, dressed and then preparing breakfast for your family'\nI have lived in France for eight years. Let me tell you, no French mother in possession of all her senses would ever dream of lounging around at home in a pair of pyjamas or even putting a pair on in order to go to bed (that’s what negligees are for).\nAs for sporting bedwear to the school gate? It would never ever happen in France.\nHow do I know this when I’m not a mother? For five years, one week in two, I did the school run (to perfection, I might add) for my stepson Antonio.\nIn France, school starts much earlier than for you British sissies. At 7am I’d be waiting in the car, warming it up while my stepson grabbed his bags and schoolbooks. It goes without saying I’d already be fully clothed for the day ahead.\nWe were at the school bus stop at 7.15am every morning. In winter, it was dark, it was often icy, yet the temptation to sneak out in what I wore to bed simply never crossed my mind.\nKaren Routh wore pjyjamas to drop her daughter at Skerne Park Primary School in Darlington yesterday after the head teacher sent parents a letter home warning them not to wear nightwear at the school gate\nFor the love of God women, you’re adults. Surely it’s not rocket science to organise – and stick to - a routine where you’re up first, bathed, dressed and then preparing breakfast for your family.\nWhile you’re at it, a little bit of lippy wouldn’t be too hard to apply either would it?\nAccording to Samantha Brick: 'No French mother would dream of even putting a pair pf pyjamas on in order to go to bed - that’s what negligees are for'\nWhen the school bell rang signalling the end of the school day, I would collect my stepson after school. This is where most British women I know would fail.\nYou lot would seriously need to raise your game when you approach a French school courtyard.\nMums wore Louboutin heels, had their hair perfectly coiffed and flirted with whichever supervisor was on the school gate.\nOne mum I know (even I was scared of her) stalked into the playground in head to foot leather, her hair dyed a vivid shade of henna red.\nAnother mother - in the summer, mind - would turn up channelling Brigitte Bardot in an off-the-shoulder top and a pair of denim hot pants. They were cut so high it was evident to all she was a fan of the Brazilian wax.\nEven the grannies on pick up duty were Helen Mirren glamorous.\nTo fit in, I used to keep my make-up bag in the car and would pull over a mile away from the school and touch up my lipstick. You could never ever be over-dressed on the school run.\nNot only are you groomed to within an inch of your life - but the car is sparkling clean too.\nYou would be ostracised if you turned up looking anything less than presentable.\nOne friend, who was renovating her property, would change out of her work clothes and into her normal feminine attire so she didn’t turn up looking like a scuzzy wreck.\nOne time she forgot and her son walked straight past her. I understand why, he wouldn’t publicly acknowledge this dusty-looking harridan (who hadn’t even combed her hair) was his mother.\nBut then it wasn't surprising. The school headmistress set the standards, which we all adhered to.\nWith Wednesday afternoons off in France, this particular headmistress was found in the hairdressers every week without fail. If this mother-of-two looked good – so did the rest of us.\nShe'd call mothers out for putting on weight, for not making the best of themselves, for not kitting out their children in decent attire too. She’d phone them up at home berating them for letting themselves go.\nShe even had a sideline business flogging jewellery from home. If you were chic enough – the cheapest piece was three figures - you’d get an invite. Obviously yours truly was a regular.\nI genuinely feel sorry for British fathers. There would be a public outcry if they strolled out in their boxers and a T-shirt. Women haven’t you ever asked yourselves why your chaps don’t have the gumption to tell your how they feel?","url":"https://www.dailymail.co.uk/femail/article-3421344/Samantha-Brick-tells-Britain-s-slummy-mummies-copy-French-women.html"}
