{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 00:21:37","date_modify":"2018-10-23 00:21:37","date_publish":"2017-03-16 09:28:17","description":"Mrs Cameron, 45, has been spotted out in her £390 cocoon coat three times in recent weeks at high-profile events including London Fashion Week and a star-studded book launch at Sotheby's.","filename":"data/vaneerConsumption/SamanthaCameronsfavouritecoathasalreadysoldout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/17/3E4E4E0100000578-0-image-a-25_1489598286098.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4316966_Samantha-Cameron-s-favourite-coat-sold-out_1540254097.html","title":"Samantha Cameron’s favourite coat has already sold out","title_page":"Samantha Cameron’s favourite coat has already sold out | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It hit stores just four weeks ago, but pieces from Samantha Cameron's debut womenswear line are already flying off the shelves - and it's all down to the designer herself.\nThe fashion entrepreneur, who launched Cefinn in February, has proved she really is her own best advert after stepping out in a range of pieces from the collection which are fast selling out.\nMrs Cameron, 45, has been spotted out in her £390 cocoon coat three times in recent weeks at high-profile events, including at London Fashion Week and a star-studded book launch at Sotheby's, and it's since sold out online.\nScroll down for video\nSamantha Cameron, 45, has seen her £390 belted cocoon coat sell out after modelling it at a number of high-profile events including the London Uprising book launch this week (pictured)\nTrendsetter: The utility-style coat has now completely sold out in both khaki and navy, listed as 'coming soon' on Cefinn's website and is currently not available at Selfriedges or Net-a-Porter\nThe belted, utility-style coat has since sold out both khaki and navy, according to Cefinn's website, and is not available from its other main stockists Net-a-Porter and Selfridges.\nThe former Prime Minister's wife has also posted a stream of pictures on social media showing her wearing the ultra-modern designs including a £270 coral funnel neck midi dress.\nMrs Cameron, who is mother to Nancy, Arthur and Florence, with husband David, has also modelled her own creations in glossy spreads in Vogue and the Sunday Times Magazine.\nThe designer, who previously worked for British leather brand Smythson, unveiled her debut clothing line in an interview with Vogue following months of speculation.\nMrs Cameron steps out in the navy version of the bestselling coat at the Burberry show at London Fashion Week in February. Before launching her own line she worked at Smythson\nThe former Prime Minister's wife has also posted a stream of pictures on social media showing her wearing the sold-out £390 coat (pictured) and a £270 coral funnel neck midi dress\nHer debut 35-piece collection, launched last month, is designed for 'practical, modern women who enjoy clothes' and aims to fill a gap in the market for contemporary designer clothing that is 'at the right price point'.\nMrs Cameron clearly already has support from the fashion world, and modelled pieces from her own collection in the January issue of UK Vogue.\nDuring her time in No 10, she cemented her place as a key player in the fashion industry, winning plaudits for her support of British designers - with Roksanda Ilincic a particular favourite.\nMrs Cameron models a black dress from Cefinn. The designer unveiled her debut clothing line in an interview with Vogue following months of speculation\nThe fine art graduate worked at Bond Street luxury brand Smythson as creative director while her husband is in office, a role which won her a British Glamour Magazine Award for Best Accessory Designer in 2009.\nShe then took a part-time consultancy role with the company when her family moved to Number 10 in 2010, stepping down to two days a week in order to support her husband.\nMrs Cameron is also an ambassador to the British Fashion Council and in 2015 she topped Vanity Fair's Best Dressed Women list.","url":"https://www.dailymail.co.uk/femail/article-4316966/Samantha-Cameron-s-favourite-coat-sold-out.html"}
