{"authors":[],"date_download":"2018-10-22 21:00:53","date_modify":"2018-10-22 21:00:53","date_publish":"2014-05-05 15:28:16","description":"First, Amazon expanded its same-day delivery service. A few days later, Google did the same.","filename":"data/vaneerConsumption/SameDayDeliveryWarsGoogleTakesonAmazon.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/420841/google_shopping_express_la_-_courier_81a0c91b50972defde48f9efdaf8c598.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gift-guide_same-day-delivery-wars-google-takes-amazon-n97286_1540242053.html","title":"Same-Day Delivery Wars: Google Takes on Amazon","title_page":"Same-Day Delivery Wars: Google Takes on Amazon ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn the future, waiting a few days for an online delivery could become a thing of the past.\nOn Monday, Google began offering its same-day delivery service, Shopping Express, in Manhattan and parts of Los Angeles. That move came only days after Amazon announced it was offering same-day shipping in Dallas, Los Angeles and San Francisco, bringing the total number of cities where the service is offered up to 12.\nThe idea is simple: Order something online and get it delivered on that same day for a fee, $4.99 per item for Google Shopping Express and $9.98 for the first item (plus $0.99 for each additional item) for Amazon Local Express.\n“Our goal has been to make a same-day delivery service that isn’t a luxury,” Jenna Owens, general manager of operations for Google Shopping Express, told NBC News. “This is how people are going to be shopping in the future, so we wanted to introduce it to them now.”\nTo entice potential shoppers, Google is offering Google Shopping Express memberships for free, which means customers can pay nothing for same-day delivery for six months. Eventually, Google will charge for memberships, but the rates have not been decided yet.\nSame-day delivery is not a new idea. Amazon began offering it in 2009, while Google publicly launched Shopping Express in San Francisco in 2012. EBay Now, also launched in 2012, will actually pay someone to go to a store, buy an item, and deliver it to a customer within one to two hours for $5 per order.\nCould Google moving into New York and Los Angeles be a sign that same-day delivery is becoming more than just a niche service for early adopters?\nPeter Sheldon, principal analyst at Forrester Research, does not think so.\n\"I’m kind of skeptical about these same-day delivery services,\" he told NBC News. \" They perceive that there is territory to be gained here, so there is this kind of one-upmanship, but what we see is that consumers are skeptical about it.\"\nRight now, he said, customers are willing to wait a couple of days to get a package if it means saving money.","url":"https://www.nbcnews.com/tech/gift-guide/same-day-delivery-wars-google-takes-amazon-n97286"}
