{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:49:50","date_modify":"2018-10-30 21:49:50","date_publish":"2015-08-28 23:06:08","description":"Virginia Governor Terry McAuliffe (D) pushed for \"universal background checks for gun purchases.\" like Vester Flanagan passed.","filename":"data/vaneerConsumption/SameBackgroundCheckasVesterFlanagan.json","image_url":"https://media.breitbart.com/media/2015/08/McAuliffe-826-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_28__1540936190.html","title":"Same Background Check as Vester Flanagan","title_page":"Gov. McAuliffe: Same Background Check as Vester Flanagan","title_rss":"NULL","source_domain":"breitbart.com","text":"On August 28 Virginia Governor Terry McAuliffe (D) confirmed that Vester Lee Flanagan passed a background check for the gun he used to kill WDBJ-TV’s Alison Parker and Adam Ward. McAuliffe then pushed for “universal background checks for gun purchases.”\nIn other words, everyone should have to pass the same background check Vester Flanagan passed for his Glock 19.\nAccording to the AP, McAuliffe “visited WDBJ-TV to lend his support and give condolences to the employees there.” He then pushed for universal background checks and said he believes “There are too many guns in America.”\nAt the same time, McAuliffe stressed that he is a gun owner.\nMcAuliffe’s background check push began so soon after the August 26 attack that police were still in pursuit of Flanagan when McAuliffe first broached the subject. Breitbart News reported that McAuliffe said:\nTwice I have brought legislation before the general assembly. Twice I have asked that we have background checks. Twice now they have rejected background checks. [There are] individuals in this country who should not be allowed to own a firearm and it’s just tragic that this kind of legislation cannot be passed and signed into law.\nJust after saying these things, a reporter asked McAuliffe if he knew whether Flanagan had gone through a background check for his gun; McAuliffe said he did not know. He now says he does know that Flanagan passed a background a check, and although that check did nothing to prevent Flanagan from carrying out a heinous crime, McAuliffe wants every American to undergo the same check for every gun purchase, whether private or retail.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/08/28/gov-mcauliffe-everyone-should-have-to-pass-same-background-check-vester-flanagan-passed/"}
