{"authors":["Bianca La Cioppa For Daily Mail Australia"],"date_download":"2018-10-22 22:27:06","date_modify":"2018-10-22 22:27:06","date_publish":"2016-01-28 10:32:42","description":"She's waking up at the crack of dawn for her new breakfast radio gig, and on Wednesday Sam Frost looked tired as she strolled the streets of Sydney suburb Paddington.","filename":"data/vaneerConsumption/SamFrostgoesmakeupfreeinapairofskintightskinnyjeans.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A9179400000578-0-image-a-5_1453976041979.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420544_Sam-Frost-goes-make-free-shows-toned-legs-pair-skin-tight-skinny-jeans_1540247226.html","title":"Sam Frost goes make-up free in a pair of skin-tight skinny jeans","title_page":"Sam Frost goes make-up free in a pair of skin-tight skinny jeans | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's waking up at the crack of dawn for her new breakfast radio gig, and on Wednesday Sam Frost looked tired as she strolled the streets of Sydney suburb Paddington.\nThe 26-year-old appeared to have put little effort into her look as she went make-up free for the outing.\nShe showed off her toned legs as she rocked a pair of high-waisted skinny jeans, matching them with a peach tank top which featured a high turtle-neck collar.\nKeeping it natural: Sam Frost went make-up free as she strolled the streets of Sydney on Wednesday\nThe first-ever Bachelorette finished off her low-key attire with a pair of beige slip-on sandals.\nWhile she displayed her blemish free face, her two toned locks fell loosely over her shoulders.\nSam was quick to try and cover her make-up free self by adding a pair of dark shaded sunglasses.\nSimple: The 26-year-old showed off her toned legs as she rocked a pair of high-waisted skinny jeans\nOut and about: Her two toned locks fell loosely over her shoulders as she covered her face with a pair of dark shaded sunglasses\nAs she walked from her new vehicle, she flung a multi-coloured bag over her left shoulder while balancing a water bottle with her hand.\nThe radio host was treated to a new Mini Cooper last weekend, months after her black Hyundai was spotted parked on a suburban Bondi street with its front section smashed in.\nHer boyfriend Sasha Mielczarek announced the new purchase on social media as he shared an image of herself placed in the front driver's seat while displaying a large pearly white smile.\nHe wrote alongside the image 'Congratulations to this dork @fro01 on the purchase of her new car!\n'She was like one of them wacky inflatable tube guys at the car yard running around the show room #ishallcallhimminime,' he added.\nOn a mission: The radio host flung a multi-coloured bag over her left shoulder while balancing a water bottle with her hand\nBrand new: Sam was treated to a new Mini Cooper last weekend, months after her black Hyundai was spotted parked on a suburban Bondi street with its front section smashed in\nOn Thursday evening Sam kicked off the celebrity fashion at the Witchery runway event on Thursday at Carriageworks in Sydney.\nThe 26-year-old stunned in an all-black ensemble which tied up tightly around her waist and accentuated her slender frame.\nBest pal Sarah-Mae Amey also attended the event with the former Bachelorette.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420544/Sam-Frost-goes-make-free-shows-toned-legs-pair-skin-tight-skinny-jeans.html"}
