{"authors":["Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-23 02:35:20","date_modify":"2018-10-23 02:35:20","date_publish":"2017-03-10 11:47:57","description":"Controversial AFL Footy Show host Sam Newman threatened to punch a man in an expletive-filled voicemail after they leaked footage of his interview with Mick Gatto in Melbourne on Thursday.","filename":"data/vaneerConsumption/SamNewmanleavesexpletiveladenvoicemail.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21B94A00000578-0-image-a-28_1489136432973.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300236_Sam-Newman-leaves-expletive-laden-voicemail_1540262120.html","title":"Sam Newman leaves expletive-laden voicemail","title_page":"Sam Newman leaves expletive-laden voicemail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Controversial AFL Footy Show host Sam Newman threatened to punch the man who leaked footage of his Mick Gatto interview in an expletive-filled voicemail.\nThe TV personality declared the 15 Minutes of Fame website creator, Tony Sheahan, a '24 carat c***' and 'piece of s***'during The Footy Show premiere on Thursday night, the Herald Sun reported.\nBut he says his outburst was just 'hyperbole in the extreme'.\nThe foul-mouthed rant follows a bizarre press conference held by underworld figure Mick Gatto in Melbourne on Thursday - It was alleged he was contacted by Essendon to 'fix the AFL club's doping scandal'.\nControversial AFL Footy Show host Sam Newman (left) threatened to punch the man who leaked footage of his Mick Gatto (centre)interview in an expletive-filled voicemail\nIt's understood Newman, who revealed an aerodynamic new look on Thursday's premiere, was enraged after Sheahan leaked footage of Newman's interview with Gatto - before it could be shown on The Footy Show.\n'You are a c***,' Newman unleashed.\n'You ask me for favours, you ask me for snippets. You are a f***ing piece of s**t ***hole.\n'The next time I see you… I'll punch your f***ing head in.'\nIn the leaked video, Melbourne gangland identity Gatto told Newman had been approached by Essendon to obtain information relating to the doping scandal in 2014 - a claim the AFL club has denied.\nGatto refused to answer any questions at the press conference in front of his daughter's restaurant in Lygon Street on Thursday.\n'All I can say is two things, be watching [The Footy Show] tonight and you'll hear all about it,' Gatto said.\n'The second thing is I really have no comment to make and I can't at this stage.'\nGatto (pictured) told Newman in the leaked interview that he had been approached by Essendon to obtain information relating to the doping scandal in 2014 - a claim the AFL club has denied\nThe TV personality declared the 15 Minutes of Fame website creator, Tony Sheahan, a '24 carat c***' and 'piece of s***'\nIt's understood Newman, who revealed an aerodynamic new look on Thursday's premiere, was enraged after Sheahan leaked footage of Newman's interview with Gatto\n'The next time I see you…I'll punch your f***ing head in,' Newman threatened in the voicemail\nA former Essendon employee claimed a senior club official in November 2014 asked him to enlist Mr Gatto's help.\nDual premiership player Dean Wallis and former team services manager John Elliott - have reportedly made the claim as part of a Worksafe action against the club.\nMr Elliott claims a senior Essendon official asked him to set up a meeting in late 2014 with Mr Gatto to get information on a supplier to Stephen Dank.\nEssendon Chairman Lindsay Tanner, who joined the club's board in mid-2015, labelled Mr Elliott a 'disgruntled' employee.\nEssendon has been accused of contacting Melbourne underworld figure Mick Gatto to 'fix' their doping scandal (Gatto pictured speaking to Newman on Thursday)\n'Allegations of having dealings with Mick Gatto are false,' Essendon Chairman Lindsay Tanner said in a statement on Thursday\n'Allegations of having dealings with Mick Gatto are false,' Mr Tanner said in a statement on Thursday.\n'Inappropriate demands and threats made upon Essendon Football Club have been reported to the AFL Integrity Department and, on its advice, Victoria Police have been contacted.'\nRead more: http://www.dailymail.co.uk/news/article-4295956/Melbourne-Underworld-figure-Mick-Gatto-press-conference.html#ixzz4auWlcO1U Follow us: @MailOnline on Twitter | DailyMail on Facebook","url":"https://www.dailymail.co.uk/news/article-4300236/Sam-Newman-leaves-expletive-laden-voicemail.html"}
