{"authors":["Stephen Bisset For Daily Mail Australia"],"date_download":"2018-10-23 05:23:17","date_modify":"2018-10-23 05:23:17","date_publish":"2017-04-26 16:52:48","description":"UK actor Sam Riley is set to blow Australian audiences away, when his new shoot-em-up Free Fire opens on Thursday","filename":"data/vaneerConsumption/SamRileytoblastintheguntotingFreeFiire.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA08E6D00000578-0-image-a-90_1493221184026.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448370_UK-actor-Sam-Riley-blast-gun-toting-Free-Fiire_1540272197.html","title":"Sam Riley to blast in the gun-toting Free Fiire","title_page":"Sam Riley to blast in the gun-toting Free Fiire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the British actor who has been the subject of rumours that he could be the next James Bond.\nWhile that rumour hasn't materialised of yet, Sam Riley will next be seen, on Australian screens, touting a gun but not a tux or martini, in the fast-paced shoot-em-up action thriller Free Fire which hits cinemas on Thursday.\nSpeaking to The Daily Telegraph, Sam said the film, also starring Brie Larson, Armie Hammer, Cillian Murphy and Australia's Noah Taylor, was an 'event'.\nBlazing: Sam Riley will next be seen, on Australian screens in the fast-paced shoot-em-up action thriller Free Fire which hits cinemas on Thursday.\n'You knew you were doing something pretty unusual. And give boys guns and they’re all little idiots again: \"My one’s bigger than your one\". It does descend into childishness quite quickly... poor Brie,' he said.\nSam went as far as describing the action flick as 'bonkers.'\n'It’s basically the end of the Wild Bunch stretched out to 90 minutes, in real time,” Sam told the publication.\nNon-Stop: 'It’s basically the end of the Wild Bunch stretched out to 90 minutes, in real time,' Sam told the Daily Telegraph\nFree Fire is set in Boston circa 1978 and tells the story of an arms deal that goes wrong in an abandoned warehouse before descending into an all-guns-blazing, action packed shootout.\nThe Telegraph reported that, in late 2015, British newspapers divulged that money had been bet on the actor to take on the iconic role - with the sum enough to bring the odds down to 12/1.\nThe rumours had added gravitas given that Sam had just begun filming SS-GB for the BBC which was written by long-time Bond scribes Neal Purvis and Robert Wade.\nStellar cast: The dapper actor will star alongside the likes of Brie Larson, Cillian Murphy, Armie Hammer and Australia's Noah Taylor\nSince first coming to prominence playing troubled Joy Division frontman Ian Curtis in Anton Corbijn's bio-pic Control, Sam has continued to impress.\nHe has been seen in substantial roles in the likes of Rowan Joffe's adaptation of Graham Greene's Brighton Rock, On the Road in which he plays Jack Kerouac's lead character Sal Paradise and alongside Angelina Jolie in the Disney blockbuster Maleficent.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448370/UK-actor-Sam-Riley-blast-gun-toting-Free-Fiire.html"}
