{"authors":["Mark Prigg","Stacy Liberatore For Dailymail.Com"],"date_download":"2018-10-23 04:57:50","date_modify":"2018-10-23 04:57:50","date_publish":"2017-03-16 16:08:11","description":"An Italian page found on the Samsung website clearly states 'comandi vocali con Bixby', which means 'voice commands with Bixby' when translated into English.","filename":"data/vaneerConsumption/SamsungsSiricompetitorwillbecalledBixby.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E4F51FF00000578-0-image-a-5_1489680456507.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4320850_Samsung-s-Siri-competitor-called-Bixby_1540270670.html","title":"Samsung's Siri competitor will be called Bixby","title_page":"Samsung's Siri competitor will be called Bixby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Samsung's 'make or break' Galaxy S8 smartphone will have a smart assistant called Bixby to take on Apple's Siri, the firm has accidentally revealed on its own website.\nAn Italian page found on the Samsung website clearly states 'comandi vocali con Bixby', which means 'voice commands with Bixby' when translated into English.\nBixby is believed to be central to Samsung's plan for the S8, with the handset even having a dedicated button for the assistant.\nScroll down for video\nSamsung's Galaxy S7: The latest version of its flagship phone will come in two sizes, both with curved screens. An Italian page found on the Samsung website clearly states 'comandi vocali con Bixby', which means 'voice commands with Bixby' when translated into English.\nSAMSUNG'S BIXBY Bixby could be used for a wide variety of functions in a similar way to Apple's Siri. The latest rumors suggests Bixby will have visual search capabilities to analyze the image, identify objects and performing optical character recognition on visible text. Once activate, a search tool will appear allowing users to search for specific objects or ‘use optical character recognition to process any text you point the phone at. It will be equipped with ‘a high degree of interconnectedness to other applications’ For example, the technology will show you where to buy an object in and image and can also complete the transaction for you. And will be activated once users open the handset’s camera app.\nThe mention appears in the privacy information under 'voice services', adding Bixby can be used to 'control all operations with the touch interface using voice commands.\nThe Galaxy S8 and Galaxy S8 Plus are set to be unveiled during a press conference on March 29th and should hit the market about a month later.\nFor many Samsung customers, the Galaxy S8 is not just the firm's next phone, but a chance for the smartphone maker to redeem themselves for the Galaxy Note 7 fiasco - 2.5 million devices were recalled after reports that some were exploding.\nThe new handset will come in two sizes, both with curved screens, according to the Wall Street Journal.\nIn previous versions, Samsung has released both curved 'Edge' models and a more traditional screen.\nThe new handset is also expected to dump the home button, and instead have a fingerprint sensor on the rear and iris scanning to unlock the phone.\nIt will also feature Bixby, Samsungs updated AI assistant, along with a dedicated button for the feature, the WSJ says.\nEarlier today a set of leaked images claiming to be the Samsung Galaxy S8 and S8 Plus surfaced – suggesting the flagship phone will have a curved 'infinity screen'.\nA set of leaked images claiming to be the Samsung Galaxy S8 and S8 Plus have surfaced – suggesting the flagship phone will have a curved 'infinity screen'. The photos of the highly-anticipated device depict a curved edge-to-edge screen\nNew leaks claiming to be the Samsung Galaxy S8 have surfaced that show a handset coated with a glossy black finish and is said to have been made with parts from the factories that are building the device\nThe photos of the highly-anticipated device depict a curved edge-to-edge screen, which means the South Korean firm has tossed out the physical home button.\nAlthough the latest leaks do not showcase a fully assembled smartphone, it does give users an idea about what size screen to expect in the coming months.\nFor many Samsung customers, the Galaxy S8 is not just the firm's next phone, but a chance for the smartphone maker to redeem themselves for the Galaxy Note 7 fiasco - 2.5 million devices were recalled after reports that some were exploding.\nFor many Samsung customers, the Galaxy S8 is not just the firm's next phone, but a chance for the smartphone maker to redeem themselves for the Galaxy Note 7 fiasco - 2.5 million devices were recalled after reports that some were exploding.\nAnd although other rumors speculate the handset won't be out until mid-April, it has been one of the most talked about devices for the past few months.\nThe clear casings were shared on the web by the web by BGR, which noted that the smartphones 'are expected to take up more of the phones' faces thanks to much smaller bezels above and below the screens'.\nZach Epstein, the reporter with BGR, also stated that the two models will be designed with AMOLED displays.\nSAMSUNG'S GALAXY S8 RUMORS New renders of what could be Samsung Galaxy S8 have surfaced and they suggest the device will incorporate a dual-lens camera design and remove the home button for an edge-to-edge screen. It's speculated that Samsung could design a fingerprint-sensing display or place the feature behind the tempered glass. Because levels of concentration will be increased with a 'full screen', pictures and videos should be much clearer and even go so far as to produce a 3D effect. Rumors suggest that pixels of the dual-cameras will support 16 megapixels and 8 megapixels. Another new addition to the Galaxy S8 could also be an upgraded Application process (AP) that corresponds to handset's brain. Sources say Samsung is going to start mas-producing 10-nano Snapdragon 830s, which will be used for Galaxy S8, at the end of this year at the earliest. The artist impression also shows the handset in four vibrant shades of red, blue, purple and yellow - another feature yet to be seen by Samsung users.\nThe new leaks appear to be very similar to a photo posted to Weibo, a Chinese social media platform, last month that highlights a complete device.\nAnd it also suggests the fingerprint scanner has been relocated – either on the back or embedded under the glass.\nAlthough the latest leak does not showcase a fully assembled smartphone, it does give users an idea about what size screen to expect in the coming months. The images coincide with previous rumors that the flagship devices will have a curved edge-to-edge display\nHowever, because of these missing features SamMobile, which first spotted the gold Samsung S8, questions if the photo is 'a product of some Photoshop wizardry'. 'Typically, when you head into settings, they don't automatically hide,' reports Josh L.\nOn the other hand, Samsung could have developed a full-screen mode that manually activates, which allows for an end-to-end screen.\nIf this is in fact true, then users would simply swipe up from the bottom of the screen and the keys will appear.\nAnd just last week an image showing what claims to be the bottom have of the phone hit the web – confirming multiple rumors that have been floating around for months.\nA photo (pictured) was posted to Weibo, a Chinese social media platform, last month that shows a fully assembled phone and appears to resemble the recent leaked images\nAnother leak of the highly-anticipated Samsung Galaxy S8 surfaced just last week. The handset has a curved display, a 3.5mm audio jack, a Type-C USB and one speaker poking out of the bottom right corner. And the physical home button has been removed\nThere are some ports placed at the bottom and the entire handset appears to be made of metal and glass.\nIn December, rumors surfaced that suggests the South Korean firm had plans to remove the standard 3.5mm headphone jack, but the new leaks point to just the opposite.\nTWO MAJOR FLAWS Following the release of the Samsung Galaxy Note 7, reports began surfacing that the smartphones were exploding. Samsung conducted their own investigation into the matter and revealed their findings in January. The first issue was that the battery components in the Galaxy Note 7 did not fit in the battery's casing. This caused the battery cell's upper right corner to be crimped by the casing. The second round affected the devices sent to replace the original faulty phones. These were caused by manufacturing issues, including poor welding at the battery manufacturer.\nIt was also speculated that the flagship phone would be equipped with reversible USB Type-C port for easy connectivity including hassle-free charging – and this port is shown in the real-life photo.\nThere is also a visible microphone positioned to the right of the charging port and two antenna lines can also be spotted on the sides of the leak.\nIn addition to what the Galaxy S8 could look like, other rumors reveal Samsung is anticipating a high demand once the handset hits the market in mid-April, which was first revealed by The Investor.\nSome outlets have claimed that the exact date has been set for April 18.\nBut, Samsung has not confirmed any of the rumors.\n'We cannot confirm the details of the Galaxy S8 launch,' a Samsung spokesperson said.\nAccording to the report, the firm is working toward a 60-million shipment goal – much higher than some of its more recent Galaxy S devices.\nThe report says Samsung will begin mass production of the S8 in March after receiving the parts from its main vendors in February, including camera iris scanner module maker Partron and camera lens firm Sekonix.\n'As the release date of the S8 has been postponed to mid-April, Samsung seems to have set a more ambitious goal than before to make up for the loss caused by the Note model,' a source told The Investor.","url":"https://www.dailymail.co.uk/sciencetech/article-4320850/Samsung-s-Siri-competitor-called-Bixby.html"}
