{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-22 20:50:00","date_modify":"2018-10-22 20:50:00","date_publish":"2016-01-28 04:10:25","description":"The South Korean handset maker continues to face high-end competition from arch-rival Apple as well as cheaper players like China's Huawei and Xiaomi.","filename":"data/vaneerConsumption/SamsungannouncesprofitsfellbyalmostHALFcomparedtothistimelastyar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/2vdWmEltwXfba0ce28e6323af638-0-image-a-5_1453973707589.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420155_Samsung-Electronics-posts-40-fall-Q4-net-profit_1540241400.html","title":"Samsung announces profits fell by almost HALF compared to this time last yar","title_page":"Samsung announces profits fell by almost HALF compared to this time last yar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Just a day after Apple announced that it made more money in the last quarter of 2015 than any company before it, Samsung has unveiled its own earnings.\nThe outcome, however, is not as positive.\nDuring the fourth quarter, the South Korean tech giant reported a 40 per cent year-on-year drop in net profit.\nThe world's top handset maker continues to face high-end competition from arch-rival Apple as well as cheaper players such as China's Huawei and Xiaomi.\nSlowing global demand for smartphones as well as memory chips dealt a blow to Samsung Electronics as it reported Thursday a 40 percent on-year drop in fourth-quarter net profit. The world's top handset maker continues to face high-end competition from arch-rival Apple matched by cheaper players like China's Huawei\nNet profit for October to December stood at 3.22 trillion won ($2.7 billion), below analyst expectations and down 39.7 per cent from a year ago.\nOperating profit rose 16.1 per cent year-on-year to 6.1 trillion won, in line with its earlier estimate.\nIn a statement, the South Korean giant said 2016 was expected to throw up continued challenges to maintaining earnings 'due to a difficult business environment and slowing IT demand'.\nThe poor earnings were blamed on a sharp fall in oil prices, as the components side of the business was impacted by weakened prices for chips and LCD panels.\nAPPLE PROFITS CONTINUE TO SOAR Apple made enough money in just two hours to pay its entire UK corporate tax bill. The California-based technology giant raked in record profits of £12.9billion on its worldwide operations in the last three months. This was equivalent to £5.9million an hour – meaning it could cover the £11.8million UK tax bill it paid last year in just 120 minutes. By comparison, a lawyer for Oracle recently revealed in federal court that Android has generated $31 billion in revenue since Google acquired the mobile operating system in 2005. If the numbers are accurate, that would mean Android has generated less revenue over its lifetime than the iPhone did in the quarter ended 30 September, the most recently reported quarter. Then, Apple said the iPhone generated $32.2 billion in sales.\nSlowing global demand for computers also played a role.\nSince late 2014, Samsung's semiconductor business since has helped offset slumping profits at the firm's key mobile unit.\nBut sluggish demand for handsets and computers worldwide drove down prices for memory chips, squeezing margins in the semiconductor unit, which posted the first drop in quarterly operating profit for about two years.\n'The global slowdown affected all the firm's business segments...I see no major factor to boost profit down the road,' said Lee Seung-Woo, analyst at IBK Investment and Securities.\n'The situation looks pretty bleak.'\nFollowing on from the earnings report, shares of Samsung fell 1.56 per cent in early trading to 1,156,000 won.\nSamsung lost more than $8 billion in market value in 2015, with its flagship smartphone business struggling to hold market share.\nSales of the Galaxy S6 - the latest edition of Samsung's top-of-the-range handset, launched in April - failed to generate much excitement among consumers.\nBut Samsung was not alone in being forced to come to terms with a slowing market.\nOn Tuesday, Apple raised the spectre of the end of a technological era after reporting the slowest sales growth ever of its market-leading iPhone and warning it expects worse to come.\nNet profit for October to December stood at 3.22 trillion won ($2.7 billion), below analyst expectations and down 39.7% from a year ago. Operating profit rose 16.1 per cent year-on-year to 6.1 trillion won, in line with its earlier estimate. Sales of the Galaxy S6 (pictured) that launched in April failed to generate excitement among buyers\nBut Samsung was not alone in being forced to come to terms with a slowing market. On Tuesday, Apple (shop pictured) raised the spectre of the end of a technological era after reporting the slowest sales growth ever of its market-leading iPhone and warning it expects worse to come\nThe California technology giant said it expects to see its first decline in iPhone sales in the current quarter on a year-on-year basis.\nSamsung last year revamped its product lineup to provide a move diverse price range and vowed Thursday more efforts to expand its presence in the non-high end segment.\n'The overall smartphone industry is struggling, but the low-and mid-end segments are still growing and competition will be even fiercer,' Lee Kyeong-Tae, vice head of Samsung's mobile unit, said at a conference call.\nThe firm will this year launch updated mid-end models like Galaxy A and Galaxy J in emerging markets including China, Lee said.\nApple's woes also have a knock-on effect for Samsung's semiconductor division, which, as well as providing components for the company's own handsets, also makes the processors for a number of other companies - including Apple.","url":"https://www.dailymail.co.uk/sciencetech/article-3420155/Samsung-Electronics-posts-40-fall-Q4-net-profit.html"}
