{"authors":["Bianca La Cioppa For Daily Mail Australia"],"date_download":"2018-10-22 21:55:18","date_modify":"2018-10-22 21:55:18","date_publish":"2016-01-28 09:31:58","description":"Sam Wood has revealed he is interested in signing up as a trainer for new series of The Biggest Loser Australia.","filename":"data/vaneerConsumption/SamWoodextendinghisTVcareerasatraineronTheBiggestLoserAustralia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/08/30A7A30200000578-0-image-a-9_1453968208628.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420461_Sam-Wood-extending-TV-career-trainer-Biggest-Loser-Australia_1540245318.html","title":"Sam Wood extending his TV career as a trainer on The Biggest Loser Australia","title_page":"Sam Wood extending his TV career as a trainer on The Biggest Loser Australia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He rose to local fame last year after finding love on The Bachelor - and now Sam Wood has another reality television show in his sights.\nThe 35-year-old revealed to the latest issue of OK! Magazine that he is interested in signing up as a trainer for new series of The Biggest Loser Australia.\n'I would love to be a trainer on The Biggest Loser,' he said to the publication.\nScroll down for video\nNew gig? Sam Wood has revealed he is interested in signing up as a trainer for new series of The Biggest Loser Australia\nSam, who has 15 years as a fitness coach, added: 'I think it's great what they do'.\nIt is not known when filming for the new series will begin and whether new-mum Michelle Bridges will be returning.\nBut while he has his goals set on the weight loss series, the personal trainer has kicked off his first 28 day fitness program.\nInto it: The 35-year-old said: 'I would love to be a trainer on The Biggest Loser'\nComing soon? It is not known when filming for the new series will begin and whether new-mum Michelle Bridges will be returning\nThe four week diet includes morning smoothies, lower carb bread lunches, and hearty dinners.\n'As a personal trainer, I see so many people wanting to lose a few kilos and tone up for summer,' he told the Daily Mail Australia last year.\n'I want to encourage people to take simple steps to carbdown for summer. It doesn’t have to be difficult and with the Helga’s lower carb range, there’s no need to compromise on taste either.'\nFitness lover: But while he has his goals set on the weight loss series, the personal trainer has kicked off his first 28 day fitness program\nLining up: Since launching late last year the four week program has signed up I'm A Celebrity...Get me Out of Here! host Julia Morris (pictured) and radio host Kate Langbroek\nSince launching comedian and TV personality Julia Morris and radio host Kate Langbroek have signed up to the challenged.\nSam's fiancée Snezana Markoski has also tried businessman's program and has so far lost five kilograms.\nDaily Mail Australia has contacted Sam for comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420461/Sam-Wood-extending-TV-career-trainer-Biggest-Loser-Australia.html"}
