{"authors":["Mary Chastain"],"date_download":"2018-10-30 20:42:23","date_modify":"2018-10-30 20:42:23","date_publish":"2015-12-03 19:57:17","description":"CBS News reported that the San Bernardino killers viewed ISIS propaganda, which means they belongs on a long list of U.S. ISIS suspects.","filename":"data/vaneerConsumption/SanBernardinoJihadisRecruitedbyIslamicStateSocialMedia.json","image_url":"https://media.breitbart.com/media/2015/01/Cyber-Caliphate-hacking-Twitter-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_03__1540932143.html","title":"San Bernardino Jihadis Recruited by Islamic State Social Media","title_page":"San Bernardino Jihadis Recruited by Islamic State Social Media","title_rss":"NULL","source_domain":"breitbart.com","text":"Sources revealed to CBS News that the San Bernardino killers had been viewing Islamic State (ISIS/ISIL) propaganda online, making them the latest in a long line of terror suspects the FBI is trying to monitor.\nWhile direct recruitment from Islamic State officials from Iraq and Syria in the West is uncommon, ISIS recruiters have been known for years to have developed an extremely adept online propaganda system, using encrypted messaging apps as well as publicly viewable social media like Twitter and Facebook. Their attempts to attract Muslims to their cause have been significantly successful, law enforcement officials warn.\nIn May, FOX News reported that the FBI, Department of Homeland Security, and the National Counterterrorism Center warned of intense terrorist chatter on social media. They also said the majority of the chatter occurs in the U.S.\n“The large number of social media postings by U.S.-based ISIL supporters is challenging for investigators in differentiating those supporters focused only on promoting pro-ISIL rhetoric, which may be protected speech, [versus] detecting those prepared to engage in violence on the group’s behalf,” said the bulletin.\nA month later, House Homeland Security Committee chairman Rep. Michael McCaul (R-TX) told FOX News Sunday that terrorist chatter included a possible attack on Independence Day. He said:\n“It’s concerning. there’s a great deal of chatter, a high volume, if you will. The joint intelligence bulletin was issued to state and locals. The concern is quite frankly the confluence of these events, ISIS spokesman calling for jihad during Ramadan which is happening right now. You have the one-year anniversary of the caliphate or Islamic State and now we have the Fourth of July coming up, which is one of the holidays we celebrate that they like to target this sort of thing and these anniversaries. I think given the confluence of events, we’re being on the cautious side here to warn the public to remain vigilant, to enjoy the Fourth of July parades, but remain vigilant during these celebrations.” He added, “ISIS is not just regionalized, like the administration says in only Iraq and Syria. This is a global threat. This is a new generation of terrorists.”\nFBI Director James Comey said “that more and more Americans are engaging online with ISIS.” Unfortunately, though, ISIS uses “sophisticated recruiting methods” including the “dark web” or encrypted websites.\nJust last month, Special Agent in Charge of the Dallas FBI Tom Class confirmed ISIS is recruiting youth in North Texas, especially with social media. He reiterated Comey’s comments by saying after the terrorists snare their recruits, they move conversations to the “dark web.”\n“It’s the most significant threat to the country, the most significant threat to our national security and it’s the FBI’s top priority,” he said. “We have active investigations, counter-terrorism investigations every day.”\nSix days later Comey stated the FBI “was running over 900 active investigations against suspected ISIS operatives in the United States.” At least 48 of those suspects deserve the FBI’s Mobil Surveillance Team.","url":"https://www.breitbart.com/national-security/2015/12/03/san-bernardino-jihadis-recruited-islamic-state-social-media-ambassadors/"}
