{"authors":["Frances Martel"],"date_download":"2018-10-30 19:29:26","date_modify":"2018-10-30 19:29:26","date_publish":"2015-01-23 16:54:44","description":"Thousands of Argentines gathered yet again last night at the Argentine-Israeli Mutual Association (AMIA) center, the site of the worst terrorist attack in |","filename":"data/vaneerConsumption/SanctionsPossibleforArgentinainIranDealasThousandsMoreProtestDeathofProsecutor.json","image_url":"https://media.breitbart.com/media/2015/01/Anti-government-protests-argentina-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_23__1540927766.html","title":"Sanctions Possible for Argentina in Iran Deal as Thousands More Protest Death of Prosecutor","title_page":"Sanctions Possible for Argentina in Iran Deal as Thousands More Protest Death of Prosecutor | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Thousands of Argentines gathered yet again last night at the Argentine-Israeli Mutual Association (AMIA) center, the site of the worst terrorist attack in the nation’s history, to call for justice in the case of Alberto Nisman, a prosecutor investigating the case who was found dead the day before he was to present his findings to the Argentine Congress.\nArgentines have been organizing rallies calling for a thorough investigation of Nisman’s death all week, and they only appear to be growing as evidence mounts that Nisman’s death was not a suicide, but possibly a targeted killing in response to his investigation of the AMIA attack. On Wednesday, thousands gathered in front of the AMIA building, where the 1994 bombing took place, killing 85 people. Organizers demanded justice for Nisman, with one man calling him another “victim” of the attack itself.\nJulio Schlosser, head of the DAIA Jewish community organization, told the crowd: “Eighty-five people were murdered in the 1994 terrorist attack, but there were many other victims who died from anguish and sadness caused by the same incident.” He read a list of names of individuals who had died “after losing their relatives” in the attack, and added Nisman to the list.\nOn Friday, hundreds of others gathered to protest the Argentine government’s apparent sloth in investigating Nisman’s death at the Argentine embassy in Israel. The group organizing the protest made clear that they believed Nisman’s account of what went on behind the scenes to cover up the AMIA bombing: namely, that the Argentine government agreed to help the organizers of the bombing skirt justice in order to secure a trade deal with Iran. In a statement on the group’s Facebook page, they state:\nAlberto Nisman had managed to make the truth about the case prevail, but he was silenced forever on Monday, with a gun, the same day he was to present 300 incriminatory pages against the President of Argentina and her foreign relations minister… all this after Iran’s guilt was proven in 2006, and the guilt of an international terrorist network proven in 2013.\nAttendants can be seen displaying the “Yo soy Nisman” posters Buenos Aires protesters began to use on Monday, echoing the “Je Suis Charlie” signs used by those in France commemorating the victims of the Charlie Hebdo massacre.\nThe protests grow stronger as evidence mounts that, should Nisman’s report prove true, Argentina may be facing sanctions from the United States and other Western nations for violating trade sanctions on Iran, the product of the Iranian government’s refusal to abandon its nuclear program.\nAs the New York Times notes, the United States Department of the Treasury clearly states on its website that any negotiations for a contract to buy Iranian oil could result in sanctions from the United States. While the Treasury Department declined to comment on this particular case, the negotiations would clearly fall in line with such a deal should they be proven true: the Argentine government stands accused of trading the freedom of terrorists who killed 85 of their citizens for oil.\nThe President of Argentina, Cristina Fernández de Kirchner, has commented on the matter in an extensive and convoluted social media post in which she declares that Nisman’s death was not a suicide, though “I have no proof,” and insists repeatedly that Nisman was misled by a series of false intelligence agents. “They used him alive and they needed him dead,” she writes, with no clear indication of who “they” are.","url":"https://www.breitbart.com/national-security/2015/01/23/sanctions-possible-for-argentina-in-iran-deal-as-thousands-more-protest-death-of-prosecutor/"}
