{"authors":["John Sexton"],"date_download":"2018-10-30 19:43:34","date_modify":"2018-10-30 19:43:34","date_publish":"2015-07-24 00:55:04","description":"An autopsy on Sandra Bland concludes she committed suicide by hanging herself with a plastic trash bag.","filename":"data/vaneerConsumption/SandraBlandDeathRuledSuicideAutopsyShowsNoEvidenceofStruggle.json","image_url":"https://media.breitbart.com/media/2015/07/113012-sd.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_23__1540928614.html","title":"Sandra Bland Death Ruled Suicide, Autopsy Shows No Evidence of Struggle","title_page":"Sandra Bland Death Ruled Suicide, Autopsy Shows No Evidence of Struggle | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An autopsy on Sandra Bland, the woman found dead in a Texas jail cell three days after a traffic stop, concludes she committed suicide by hanging herself with a plastic trash bag.\nThe results were revealed Thursday afternoon by assistant district attorney Warren Diepraam. Diepramm said there was no evidence of defensive wounds on Bland’s hands, which might be expected if someone had struggled against an attacker. The autopsy also found dozens of cuts on Bland’s left arm which were healed over and estimated to be 2-4 weeks old. Diepramm said the cuts were “consistent with self injury,” but he added, “That’s not to say that they are.”\nThe manner of Bland’s death has been questioned by her parents and also by activists involved in the Black Lives Matter movement. On Wednesday, a police intake form was released to the media on which Bland admitted to a prior suicide attempt after a miscarriage in 2014. However, Bland also indicated on the same form that she was not contemplating suicide at that moment. Bland’s parents have pointed to the inconsistencies as a reason to question the official account of what happened to their daughter.\nA toxicology test found Bland had marijuana in her system at the time of her death. It was not clear whether she had somehow smoked the drug in jail before her death or if she had ingesting the drug earlier. An attorney for the Bland family told WGNtv that an independent autopsy was done over the weekend.\nBland wound up in the Waller County jail after a contentious traffic stop. Initially pulled over for failing to signal a lane change, the officer eventually ordered Bland out of the car after she refused to put out a cigarette. When Bland refused, Officer Brian Encinia pulled out what appears to be a taster and shouted, “I will light you up!” Bland complied and got out of the car, but the conflict continued to escalate even after she was handcuffed. Officer Encinia claimed she kicked him, though this is not visible on the dashcam video because both Encinia and Bland are on a sidewalk out of view. After the alleged kick, Encinia takes Bland to the ground and a female officer arrives to assist him. Officer Encinia was put on desk duty pending the completion of the investigation.\nSeveral conspiracy theories have surfaced around the case in the past week. The initial dashcam video of the traffic stop contained multiple glitches which some described as evidence of editing. After the story gained attention, the police blamed the problems on a technical snafu and released a second version of the video. But that explanation hasn’t convinced some activists.\nIn addition, Twitter has been host to speculation that Sandra Bland’s mug shot was taken while she was lying on the ground rather than sitting or standing against a wall. Some have even suggested she might already be dead in the photo.","url":"https://www.breitbart.com/politics/2015/07/23/sandra-bland-death-ruled-suicide-autopsy-shows-no-evidence-of-struggle/"}
