{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:08:55","date_modify":"2018-10-30 21:08:55","date_publish":"2016-05-24 10:20:46","description":"Democratic candidate Bernie Sanders has tapped two major backers of the BDS movement as a member on the DNC platform committee.","filename":"data/vaneerConsumption/SandersPicksTwoBDSSupportersForDNCPlatformCommittee.json","image_url":"https://media.breitbart.com/media/2016/03/Sanders-321-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_24__1540933735.html","title":"Sanders Picks Two BDS Supporters For DNC Platform Committee","title_page":"Sanders Picks Two BDS Supporters For DNC Platform Committee","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Democratic candidate Bernie Sanders has tapped two major backers of the Boycott, Divestment, and Sanctions (BDS) movement to be members of the DNC platform committee after reports emerged that Sanders wants to revamp the platform to highlight the issue of Palestinian rights.\nSanders picked James Zogby, president of the Arab-American Institute in Washington, and Cornel West, a philosopher and anti-Israel activist, to fill two of his five slots on the 15-member platform as part of his plans to revise the Democratic Party’s stance on relations with Israel.\nWest is a vociferous critic of Israel who has called the Gaza Strip “the ‘hood on steroids” and, in 2014, wrote that the crimes of Hamas “pale in the face of the U.S.-supported Israeli slaughters of innocent civilians.”\nOn Saturday, Zogby slammed the Obama administration for continuing to “enable [Prime Minister Benjamin Netanyahu’s] malevolent rule.”\nIn an oped in the Huffington Post, Zogby wrote that even though the administration has “repeatedly expressed displeasure over Netanyahu’s settlement policies and his blatant interference in US internal politics,” it is “now debating whether to reward his government with a 10-year aid package valued at $35 billion—while Netanyahu, supported by allies in Congress, is brazenly holding out for $45 to $50 billion. And so, operating with virtually no restraints, Netanyahu continues to maneuver and to aggressively advance his hardline agenda. He maintains his grip on power. Israeli society continues to become more extreme and intolerant. Palestinians are more despairing and desperate. And peace more remote.”\nIn addition to Zogby and West, Sanders also picked Rep. Keith Ellison (D-Minn), the first Muslim elected to Congress. For his part, Sanders is the first Jewish candidate to win nominating rights.\nSix other members of the platform committee were picked by Hillary Clinton and the remaining four by DNC Chairwoman Debbie Wasserman Schultz, one of the party’s most important Jewish leaders. Clinton’s choices included Wendy Sherman, the lead U.S. negotiator for the Iran nuclear deal who is heavily involved in Jewish life in Maryland, Neera Tanden, president of the Center for American Progress, and former congressman Howard Berman. Rep. Elijah Cummings will serve as chairman.\nThe National Jewish Democratic Council (NJDC) wrote in a statement to Jewish Insider that despite the controversial selections, the “Democrats will once again approve a platform that speaks to our commitment to a strong U.S.-Israel relationship.”","url":"https://www.breitbart.com/middle-east/2016/05/24/sanders-picks-two-bds-supporters-for-dnc-platform-committee/"}
