{"authors":["Pam Key"],"date_download":"2018-10-30 21:41:59","date_modify":"2018-10-30 21:41:59","date_publish":"2016-01-03 17:57:43","description":"Sanders: Trump Should Worry About Issues Instead of Bill Clinton’s Sex Life","filename":"data/vaneerConsumption/SandersTrumpShouldWorryAboutIssuesInsteadofBillClintonsSexLife.json","image_url":"https://media.breitbart.com/media/2016/01/saneder.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_01_03__1540935719.html","title":"Sanders: Trump Should Worry About Issues Instead of Bill Clinton’s Sex Life","title_page":"Sanders: Trump Should Worry About Issues Instead of Bill Clinton’s Sex Life | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sunday on CNN’s “State of the Union,” while discussing Republican presidential candidate Donald Trump going after his potential general election opponent Democratic presidential front-runner Hillary Clinton’s husband, Democratic presidential candidate Sen. Bernie Sanders (I-VT) said maybe Trump should worry about issues “rather than Bill Clinton’s sex life.”\nSanders said, “I think that Donald Trump might want to concern himself with the fact he’s dead wrong when he says we should not raise the minimum wage. He’s dead wrong when he says that wages in America are too high. He’s dead wrong when he thinks we should give huge tax breaks to billionaires like himself. He’s dead wrong when he thinks the climate change is a hoax on the entire — virtually an entire scientific community thinks it’s the great environmental crisis. Maybe Trump should worry about those issues rather than Bill Clinton’s sex life.”\nWhen asked again if thought it was “fair game,” Sanders said, “No. I think we have more important things to worry about in this country than Bill Clinton’s sex life.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2016/01/03/sanders-trump-should-worry-about-issues-instead-of-bill-clintons-sex-life/"}
fe/"}
