{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:08:11","date_modify":"2018-10-30 18:08:11","date_publish":"2015-03-02 21:35:45","description":"San Diego Mayor Kevin Faulconer is the only Republican mayor of a major city in America--and his popularity is soaring, with an approval rating of 61%. However, fighting over the future of the San Diego Chargers, the city's beloved NFL franchise, indicates that Faulconer's popularity could shift with the team's fate. |","filename":"data/vaneerConsumption/SanDiegosFaulconerHighApprovalButChargersFightLooms.json","image_url":"https://media.breitbart.com/media/2015/01/Faulconer-AP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_02__1540922891.html","title":"San Diego’s Faulconer: High Approval–But Chargers Fight Looms","title_page":"San Diego's Faulconer: High Approval--But Chargers Fight Looms | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"San Diego Mayor Kevin Faulconer is the only Republican mayor of a major city in America–and his popularity is soaring, with an approval rating of 61%. However, fighting over the future of the San Diego Chargers, the city’s beloved NFL franchise, indicates that Faulconer’s popularity could shift with the team’s fate.\nAmong the 501 registered voters surveyed in a 10 News/U-T San Diego poll, 27% said they would be more likely to re-elect San Diego Mayor Kevin Faulconer if the Chargers remain in San Diego. 13% say they are more likely to keep the Mayor in office if the Chargers leave.\nRecent controversy has ramped up over the long-running debate over the Chargers. In the midst of debate over whether the Chargers would consider moving to Los Angeles, Faulconer and Chargers Special Counsel Mark Fabiani descended into a war of words over stadium project negotiations.\nThen, in February, the Chargers and Oakland Raiders announced contingent plans to construct and share an impressive new $1.7 billion stadium in Los Angeles.\n60% of respondents in the poll said the city is headed in the right direction.I nfrastructure topped the list of issues most important to those polled at 21%, with economic growth (19%), the stadium (16%) and the city budget (16%) close behind.\n55% said the fate of a potential new Chargers stadium and the football organization’s home would have no bearing on whether they would vote for Faulconer in the future. For others, however the issue may be critical.\nOn Monday evening, the Chargers Stadium Task Force will host a public forum at the Chargers’ current Qualcomm Stadium home to allow the public input on the project.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/03/02/san-diegos-faulconer-high-approval-but-chargers-fight-looms/"}
