{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:41:10","date_modify":"2018-10-30 19:41:10","date_publish":"2015-12-23 17:46:38","description":"The grand jurors and the five special prosecutors overseeing and hearing the Sandra Bland cases are racially diverse.","filename":"data/vaneerConsumption/SandraBlandSpecialProsecutorsandGrandJuryRaciallyDiverse.json","image_url":"https://media.breitbart.com/media/2015/07/ap_sandra-bland_ap-photo4-e1450892827379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_23__1540928470.html","title":"Sandra Bland Special Prosecutors and Grand Jury Racially Diverse","title_page":"Sandra Bland Special Prosecutors and Grand Jury Racially Diverse","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — The grand jurors who are hearing the evidence in the Sandra Bland cases, and the special prosecutors who were appointed to serve in the case, are racially diverse and include two black special prosecutors, and three blacks and one Hispanic on the grand jury.\nA black Texas state senator has responded to the decision of the grand jury in the Sandra Bland case saying he was satisfied with the panels. The racial makeup of the special prosecutors, and the grand jury, meet the requirements for “diversity” says Senator Royce West (D-Dallas). West is a practicing lawyer and has his own law firm.\nAs reported by Breitbart Texas, a special prosecutor in the Sandra Bland case, and the head of a commission that has looked into procedures in Waller County, Texas, confirmed that a grand jury declined to indict the Waller County Sheriff or his staff.\nThe grand jury that made these decisions is comprised of four minorities, three blacks and one Hispanic.\nThe five special prosecutors appointed by Waller County District Attorney Elton Mathis include two African Americans.\nBreitbart Texas spoke with special prosecutor, Houston lawyer, Darrel W. Jordan, Jr., and to the Waller County District Attorney’s Office. Both confirmed the racial makeup of the special prosecutors and the grand jury panel.\nIn a statement obtained by Breitbart Texas from Senator West, he said, “The grand jury was comprised of four minorities, three African Americans and one Hispanic.” He added, “Both these panels can be considered as reaching the requirements of diversity.”\nThe senator from Dallas continued, “That said, I must respect the decision of the grand jury; made after reviewing days of testimony and evidence lasting late into Monday evening, that the evidence presented did not amount to that needed for a criminal, felony indictment of Waller Sheriff’s Department jail personnel.”\nWest added, “That is not to say that mistakes were not made that may have contributed to her death. Neither does their non-indictment preclude the possibility of civil liability.”\nBreitbart Texas reported in August that Sandra Bland’s mother filed a federal civil rights lawsuit on behalf of herself and Bland’s estate. A copy of the complaint filed in federal court was attached to the article.\nA Texas Department of Public Safety (DPS) trooper stopped Bland after she ran a stop sign and changed lanes without signaling. The situation escalated after Bland refused to put out her cigarette pursuant to the officer’s instructions.\nAfter Bland was arrested, she was found hanging in the jail after being there three days. She was never bonded out. Her death was ruled a suicide by a medical examiner.\nWhen Breitbart Texas spoke with special prosecutor Darrell Jordan, he said the grand jury did exactly what he thought they would do and pointed to the wrongful death lawsuit filed by the Bland family. He said the family is not alleging there was a homicide, and added, “The grand jury found no evidence of homicide.” Instead, he explained, the lawsuit filed by the Bland family alleges that the county and their employees were negligent in their evaluation of Bland when at the jail.\nAs reported by Breitbart Texas in August, Sandra Bland’s mother filed a federal civil rights lawsuit on behalf of herself and Bland’s estate. A copy of the complaint was attached to the article.\nPaul Looney, a Houston area attorney who was appointed by Waller County Sheriff Glenn Smith to look into jail procedures and other law enforcement issues, told Breitbart Texas after the decision of the grand jury, “The only issue that remains is Officer Encinia.”\nOfficer Brian Encinia is the DPS trooper who arrested Bland.\nAs seen on his police dashcam video, Officer Encinia can be heard saying “I’ll light you up.” It also appears that he pointed a Taser at Bland when he said it.\nThe federal lawsuit alleges that Encinia threatened Bland with bodily injury by pointing the Taser at her. It also urges that he used force and/or threatened force in order to remove her from her vehicle, placed handcuffs on her and wrestled her to the ground, slammed her head to the ground, and kneeled on her body.\nThe August 4th federal complaint also asserts that “Brian Encinia falsified an allegation of assault on a public servant against Sandra Bland for purposes for taking her into custody.”\nPaul Looney told Breitbart Texas that the police dashcam videos do not show everything at the scene. He said it is possible that the grand jury could hear evidence that incriminates the officer.\nSenator West addressed the frustration expressed by Bland’s family and their attorney with regard to the grand jury process. Their frustration has been the subject of articles by the media.\nThe Dallas senator said, “Although I have not spoken with Mrs. Reed-Veal (Bland’s mother) recently, I also understand her and counsel’s frustration with the grand jury process and its findings.”\nWest explained, “From the outset, I and other members of the Legislature and public officials, asked for a process that would be open and transparent. That – from the family’s perspective – would appear to be at odds with how a grand jury works. But the grand jury is a long-standing institution in Texas and in other jurisdictions across the country.”\nSpecial prosecutor Jordan told Breitbart Texas the grand jury will reconvene on January 6.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/politics/2015/12/23/sandra-bland-special-prosecutors-grand-jury-racially-diverse/"}
