{"authors":[],"date_download":"2018-10-23 03:10:55","date_modify":"2018-10-23 03:10:55","date_publish":"2016-01-28 18:35:26","description":"White House hopeful Bernie Sanders, the oldest candidate in the US presidential race, released a letter from his physician Thursday stating the 74-year-old i...","filename":"data/vaneerConsumption/Sandersinverygoodhealthmedicalrecordsshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h40h-4PuZeKVXE7cd9005b2c876044e82-436_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421490_Sanders-good-health-medical-records-show_1540264255.html","title":"Sanders in 'very good health,' medical records show","title_page":"Sanders in 'very good health,' medical records show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sanders in 'very good health,' medical records show\nWhite House hopeful Bernie Sanders, the oldest candidate in the US presidential race, released a letter from his physician Thursday stating the 74-year-old is in \"very good health.\"\nShould Sanders win the Democratic nomination and go on to victory, he would be the oldest person ever elected to the presidency. The senator has stressed in recent public forums that he is in excellent health, and his doctor confirmed that.\n\"You are in overall very good health and active in your professional work, and recreational lifestyle without limitation,\" Brian Monahan, the attending physician of the US Congress whose office has treated Sanders for 26 years, wrote in a letter released by the campaign.\nDemocratic presidential candidate Bernie Sanders speaks during a forum at Roosevelt High School on January 28, 2016 in Des Moines, Iowa ©Joe Raedle (Getty/AFP)\nIt said a recent physical examination showed Sanders to have normal readings for blood pressure, cholesterol, metabolism and blood glucose. His electrocardiogram was also normal.\nOver the years he has been treated for conditions including gout, a kind of arthritis, as well as hypothyroidism and the painful colon condition diverticulitis. He has had two hernias repaired.\nSanders takes a daily doses of the metabolism regulator levothyroxine, according to Monahan.\nClinton, the Democratic frontrunner, released her health records last July.","url":"https://www.dailymail.co.uk/wires/afp/article-3421490/Sanders-good-health-medical-records-show.html"}
