{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:30:25","date_modify":"2018-10-30 18:30:25","date_publish":"2018-07-23 19:07:42","description":"During Monday's White House Press Briefing, White House Press Secretary Sarah Huckabee Sanders stated President Trump is looking to revoke former CIA | Video","filename":"data/vaneerConsumption/SandersTrumpLookingtoTakeAwayBrennansSecurityClearanceLookingatComeyClapperHaydenRiceandMcCabe.json","image_url":"https://media.breitbart.com/media/2018/07/Sanders-723-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_07_23__1540924225.html","title":"Sanders: Trump 'Looking to Take Away Brennan's Security Clearance' - Looking at Comey, Clapper, Hayden, Rice, and McCabe","title_page":"Sanders: Trump 'Looking to Take Away Brennan's Security Clearance' - Looking at Comey, Clapper, Hayden, Rice, and McCabe | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During Monday’s White House Press Briefing, White House Press Secretary Sarah Huckabee Sanders stated President Trump is looking to revoke former CIA Director John Brennan’s security clearance and also looking into the clearances of former FBI Director James Comey, former DNI James Clapper, former Director of the NSA and the CIA Gen. Michael Hayden (Ret.), former National Security Adviser Susan Rice, and former Deputy FBI Director Andrew McCabe.\nSanders said, “Not only is the president looking to take away Brennan’s security clearance. He’s also looking into the clearances of Comey, Clapper, Hayden, Rice, and McCabe. The president is exploring the mechanisms to remove security clearance because they’ve politicized, and in some cases, monetized their public service and security clearances. Making baseless accusations of improper contact with Russia or being influenced by Russia against the president is extremely inappropriate. And the fact that people with security clearances are making these baseless charges provides inappropriate legitimacy to accusations with zero evidence.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2018/07/23/sanders-trump-looking-to-take-away-brennans-security-clearance-looking-at-comey-clapper-hayden-rice-and-mccabe/"}
