{"authors":["Associated Press"],"date_download":"2018-10-23 05:41:31","date_modify":"2018-10-23 05:41:31","date_publish":"2016-01-28 21:31:31","description":"NEW YORK (AP) — One of the best Peter Pans ever is returning home to Broadway — and to a musical about Peter Pan. Sandy Duncan, who played the boy who won't ...","filename":"data/vaneerConsumption/SandyDuncananexPeterPantojoinPanshowonBroadway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:ea2a1ab9aab140c28a8a1da18ea8c3bd-2vdWmEltwXfba0ce28e632ce1410-997_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421702_Sandy-Duncan-ex-Peter-Pan-join-Pan-Broadway_1540273291.html","title":"Sandy Duncan, an ex-Peter Pan, to join Pan show on Broadway","title_page":"Sandy Duncan, an ex-Peter Pan, to join Pan show on Broadway | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sandy Duncan, an ex-Peter Pan, to join Pan show on Broadway\nNEW YORK (AP) — One of the best Peter Pans ever is returning home to Broadway — and to a musical about Peter Pan.\nSandy Duncan, who played the boy who won't grow up on Broadway from 1979-81, will soon replace Carolee Carmello in \"Finding Neverland,\" easily the most inspired piece of recasting in recent history.\nMaking the move even more special is the fact that Duncan will be returning to the Lunt-Fontanne Theatre, where she played Peter in the first Broadway revival, earning her one of her three Tony Award nominations.\nFILE - In this Oct. 20, 2013 file photo, actress Sandy Duncan attends the opening night of \"A Time To Kill\" in New York. Duncan, who played Peter Pan, the boy who won't grow up on Broadway from 1979-81, will soon replace Carolee Carmello in ¿Finding Neverland.\" The ¿Finding Neverland¿ musical is adapted from the 2004 whimsical film of the same name about a widow whose four young sons inspired playwright J.M. Barrie to write the children's classic, \"Peter Pan.\" (Photo by Andy Kropa/Invision/AP, File)\nThe \"Finding Neverland\" musical is adapted from the 2004 whimsical film of the same name about a widow whose four young sons inspired playwright J.M. Barrie to write the children's classic.\nStarting Feb. 9, Duncan will play the widow's mother, joining Tony Yazbeck as Barrie and Kelsey Grammer as both the American theatrical producer Charles Frohman and a fearsome Captain Hook.\nDuncan, known for her TV turn in \"The Hogan Family,\" previous was on Broadway in \"Chicago,\" ''Canterbury Tales\" and \"The Boyfriend.\" She will turn 70 on Feb. 20.\n\"Finding Neverland\" is directed by Diane Paulus and has a book by British playwright James Graham, whose \"This House\" premiered at the National Theatre in 2012. Music and lyrics are by Gary Barlow of the pop band Take That, and songwriter and producer Eliot Kennedy.\n___\nOnline: http://findingneverlandthemusical.com\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421702/Sandy-Duncan-ex-Peter-Pan-join-Pan-Broadway.html"}
