{"authors":[],"date_download":"2018-10-30 19:44:19","date_modify":"2018-10-30 19:44:19","date_publish":"2015-07-23 13:51:04","description":"HEMPSTEAD, Texas, July 23 (UPI) — The autopsy of a woman found dead in her Texas jail cell indicated no signs of struggle, though there were several","filename":"data/vaneerConsumption/SandraBlandautopsyrevealscutsthoughnosignsofstruggle.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540928659.html","title":"Sandra Bland autopsy reveals cuts, though no signs of struggle","title_page":"Sandra Bland autopsy reveals cuts, though no signs of struggle - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HEMPSTEAD, Texas, July 23 (UPI) — The autopsy of a woman found dead in her Texas jail cell indicated no signs of struggle, though there were several cut marks on her arm and back, a Texas prosecutor said Thursday.\nAt the time of her death, Sandra Bland had approximately 30 healing cut marks on her left forearm, Harris County, Texas, prosecutor Warren Diepraam said during a news conference. There were also healing cut marks on the top of her back. He said it’s not clear when or how she sustained those injuries.\n“In the multiple instances where I’ve seen those injuries (on the arm), they’re consistent with self injury,” Diepraam told reporters. “That’s not to say that they are.”\nBland, 28, died July 13, three days after she was arrested in Prairie View, Texas. She was charged with assault on a public servant after allegedly becoming combative with Texas Department of Public Safety Trooper Brian Encinia.\nThe Waller County, Texas, Sheriff’s Office said guards found Bland hanging from a plastic trash bag in her jail cell, a story the woman’s family said they didn’t believe, prompting an investigation. The Harris County Medical Examiner’s Office said Bland died from hanging and classified her death as suicide.\nIn addition to the cuts on Bland’s body, the medical examiner’s office said it found no evidence of struggle. Diepraam said the ligature marks on her neck made a single furrow, “completely different looking” from the sorts of marks that would have been found had she been strangled by another party.\nDiepraam said interviews of Bland’s fellow inmates indicate they heard no sounds of a commotion at the time of her death.\nMeanwhile, toxicology results showed Bland tested positive for marijuana. Diepraam said the test did not indicate how much marijuana was in her system — that test is forthcoming. He said it’s not clear whether Bland consumed the drug before her arrest or perhaps while in her jail cell.\n“To have marijuana present in your body three days after hypothetically smoking or ingesting is indicative of a large amount of marijuana, but we can not say for certain,” he said.\nDiepraam said he felt the presence of marijuana in her system could be relevant to the investigation because it is a mood-altering drug.\nThe Waller County district attorney’s office ordered more extensive toxicology tests, the results of which were expected Friday. Meanwhile, Bland’s family has ordered a second autopsy, the results of which were also pending.\nThe question of Bland’s state of mind has been the center of much speculation since her death. On a screening form she filled out when she was booked into the jail, she indicated she had attempted to kill herself in 2014 using pills after the loss of a baby.\nBland’s self-reported answers on the document should have triggered notification to the magistrate and a local crisis center, according to recommended guidelines from the Texas Commission on Jail Standards. This, however, was apparently not done.\nIn March, she also posted a video to Facebook indicating she was dealing with depression and post-traumatic stress disorder.\nDiepraam said the district attorney’s office has not yet formed an opinion on whether any crime was committed in relation to Bland’s death. He said prosecutors will wait until the investigation is complete to determine if there will be any criminal charges.\nMeanwhile, District Attorney Elton Mathis said Thursday he agrees with the Texas DPS’ decision to investigate Encinia’s actions during Bland’s arrest.\n“I was not happy when I saw that video,” he said.\nThe dashboard camera video from Encinia’s cruiser showed an escalating confrontation between Encinia and Bland after he asked her to put out a cigarette and step out of her vehicle. At one point he pulled out his Taser and threatened to “light” her up.\nEncinia has since been put on administrative duty pending an investigation into the arrest.\nBland’s family said they had intended to bury the woman this weekend in her native home state of Illinois, but they received a notice from the Waller County district attorney’s office to preserve her body for possible further forensic testing.","url":"https://www.breitbart.com/news/sandra-bland-autopsy-reveals-cuts-though-no-signs-of-struggle/"}
