{"authors":[],"date_download":"2018-10-22 22:43:16","date_modify":"2018-10-22 22:43:16","date_publish":"2014-06-10 21:19:30","description":"Joshua James Corbett, 39, was charged with felony first-degree residential burglary.","filename":"data/vaneerConsumption/SandraBullockStalkingSuspectKeptDiaryandMachineGun.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/497081/140609-sandra-bullock-stalked-ef-1332_4db0fb1b9521e23f84fbbe337cb5892c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_pop-culture-news_sandra-bullock-stalking-suspect-kept-diary-machine-gun-n127761_1540248196.html","title":"Sandra Bullock Stalking Suspect Kept Diary and Machine Gun","title_page":"Sandra Bullock Stalking Suspect Kept Diary and Machine Gun","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nProsecutors charged a Los Angeles County man with multiple felony counts including stalking and possession of a machine gun in connection with Sunday's early morning break-in at the home of actress Sandra Bullock.\nJoshua James Corbett, 39, was charged with felony first-degree residential burglary. He pleaded not guilty to the charges. His bail was set at $185,000.\nThe weapon was recovered during a search at his property — he was not armed at the time of his arrest, authorities said.\nSign up for breaking news alerts from NBC News\nIf convicted on all counts, Corbett faces a maximum state prison term of more than seven years.\nAuthorities allege that Corbett scaled a fence to gain entry to Bullock's Westside property. Bullock and her child were inside the home at the time but were unhurt, according to authorities.\nPolice responded in about four minutes, and Corbett was arrested at the scene. Sources familiar with the investigation said Corbett had personal items belonging to Bullock at the time of the arrest. They said he also kept a detailed diary about Bullock.\nOn Tuesday, the judge granted a protective order that prevents Corbett from being within 200 yards of the actress.\n—Andrew Blankstein","url":"https://www.nbcnews.com/pop-culture/pop-culture-news/sandra-bullock-stalking-suspect-kept-diary-machine-gun-n127761"}
