{"authors":["Bob Price","Lana Shadwick"],"date_download":"2018-10-30 19:43:35","date_modify":"2018-10-30 19:43:35","date_publish":"2015-08-04 20:20:57","description":"The mother of Sandra Bland wasted no time in filing a federal civil rights lawsuit on behalf of herself and Bland’s estate.","filename":"data/vaneerConsumption/SandraBlandsFamilyFilesFederalCivilRightsLawsuit.json","image_url":"https://media.breitbart.com/media/2015/08/AP_771579654597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_08_04__1540928615.html","title":"Sandra Bland’s Family Files Federal Civil Rights Lawsuit","title_page":"Sandra Bland’s Family Files Federal Civil Rights Lawsuit","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — The mother of Sandra Bland has filed a federal civil rights lawsuit on behalf of herself and Bland’s estate. Bland committed suicide in a Waller County jail after being arrested by a Texas Department of Public Safety (DPS) trooper for a traffic violation and assaulting a police officer.\nThe lawsuit was filed in a Houston federal court Tuesday morning, according to court documents obtained by Breitbart Texas. The lawsuit was filed by Bland’s mother, Geneva Reed-Veal from Naperville, Illinois.\nNamed as defendants in the lawsuit were: Brian Encinia, a trooper for the Texas Department of Public Safety, individually and as an agent and/or employee of DPS; the Texas Department of Public Safety; Elsa Magnus, individually and as an agent and/or employee of the Waller County Sheriff’s Office; Oscar Prudente, individually and as an agent and/or employee of the Waller County Sheriff’s Office; and Waller County. Magnus and Prudente are screening officers at the Waller County jail and are employed by the Waller County Sheriff’s Office.\nTom Rhodes, local counsel for Bland’s mother, told Breitbart Texas, “This family deserves answers and justice. We are honored and privileged to represent Sandy’s family in this very important case. This case is not only important to the family, but to all of us as a people.”\nBreitbart Texas previously reported that Trooper Encinia stopped Bland after she ran a stop sign in front of him and then changed lanes without signaling as his vehicle approached hers. He told her the reason for the stop was the improper lane change and said he was about to give her a warning ticket, according to the dashcam video released by the Texas DPS. The situation escalated after Bland refused to put out a cigarette per the officer’s instructions.\n“We are looking for Waller County and the individuals involved to take accountability,” said attorney Cannon Lambert Sr., in a press conference reported by USAToday. Lambert is the family’s attorney in Illinois.\nThe federal complaint asserts a federal civil rights claim, assault and battery, wrongful death and survival actions, and vicarious liability for Officer Encinia’s alleged “willful and wanton” conduct, among other claims.\nThe complaint urges the following facts in support of the lawsuit. Specifically, that on or about July 10, 2015, Brian Encinia threatened Bland with bodily injury by pointing a Taser at her and saying, “I’ll light you up.”\nIt also urges that he used force and/or threatened force in order to remove her from her vehicle, placed handcuffs on her and wrestled her to the ground, slammed her head to the ground, and kneeled on her body.\nThe August 4th federal complaint asserts that “On or about July 10, 201, Brian Encinia falsified an allegation of assault on a public servant against Sandra Bland for purposes for taking her into custody.”\nThe Waller County jail had a duty “to keep Ms. Bland safe and free from physical injury, harm, or death,” continues the allegations in the complaint. Moreover, it alleges that jail personnel was also “required to screen and evaluate Sandra Bland on an ongoing basis.” It asserts that Waller County was also required to train its jail personnel on the method and means of evaluating persons placed in custody to keep them safe from physical or psychological injury, harm, or death, and were required to screen and evaluate the mental status of persons placed in custody.\nThe lawsuit states, Ms. Bland was “found in her cell with a ligature made of a garbage bag around her neck.”\nThe federal civil rights claim against Officer Encinia states that he was acting under color of law, and intentionally, willfully, wantonly, and unreasonably deprived Bland of her civil rights, privileges, and immunities under the U.S. Constitution and federal civil rights law.\nBland’s mother asserts that the officer had been reprimanded for unprofessional conduct and that DPS “knew or should have known that Defendant Brian Encinia exhibited a pattern of escalating encounters with the public.” It is also alleged that his behavior demonstrated a deliberate indifference and conscious disregard for the constitutional rights and safety of Ms. Bland.\nNo mention was made by the family about Sandra Bland’s personal responsibility in disobeying an order from a police officer and her alleged assault of the trooper. Nor did they explain why the family did not assist Ms. Bland with posting bond. She was in jail three days prior to her death.\nThe family has requested an independent investigation by the U.S. Department of Justice.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. Follow her on Twitter@LanaShadwick2.\nBob Price is a senior political news contributor for Breitbart Texas and a member of the original Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.\nFederal Complaint in Sandra Bland Family Lawsuit","url":"https://www.breitbart.com/border/2015/08/04/sandra-blands-family-files-federal-lawsuit/"}
