{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:07:05","date_modify":"2018-10-30 18:07:05","date_publish":"2017-02-06 19:27:18","description":"San Diego Mayor Kevin Faulconer and Tijuana, Mexico Mayor Manuel Gastelum held a joint press conference in San Diego.","filename":"data/vaneerConsumption/SanDiegoTijuanaStressCommonTiesinJointPressConference.json","image_url":"https://media.breitbart.com/media/2015/08/mexico-border-gate-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_02_06__1540922825.html","title":"San Diego, Tijuana Stress Common Ties in Joint Press Conference","title_page":"San Diego, Tijuana Stress Common Ties in Joint Press Conference","title_rss":"NULL","source_domain":"breitbart.com","text":"San Diego Mayor Kevin Faulconer and Tijuana, Mexico Mayor Manuel Gastelum held a joint press conference in San Diego to stress their continued cooperation, despite mounting tensions between the U.S. and Mexican governments, and blockades on the Mexican side of the border.\nFor several weekends, protesters in Mexico have blocked traffic at the San Ysidro border crossing to protest rising fuel prices. Mexicans have been visiting California, whose gas is usually more expensive than in the rest of the country, because it is relatively cheaper than what they would pay for fuel at home.\nFaulconer and Gastelum were participating in meetings with business leaders from both cities.\n“We share the same air, the same ocean, and a similar history,” Faulconer said in a statement.\n“We can’t control what happens outside our cities, but I can tell you this: we will continue … working together for the prosperity of our people.”\nMayor Gastelum echoed those sentiments.\n“When jobs are created in Tijuana, jobs are created in San Diego, and vice versa,” he said.\nLocal business leaders also spoke, and stressed the interdependence between the San Diego and Tijuana economies.\nIn 2015, a cross-border airport terminal was opened between the two cities, allowing air passengers to avoid the long wait at the San Isidro crossing by walking to the other side of the border — for a fee.\nFaulconer, a Republican, was elected in 2014 after his Democratic predecessor was forced from office in a sexual harassment scandal. He was re-elected in 2016, and is considered a possible candidate for governor in 2018.\nLieutenant Governor Gavin Newsom and former Los Angeles Mayor Antonio Villaraigosa, both Democrats, are already running for the office. Gov. Jerry Brown, now in his fourth term, will retire after 2018.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/local/2017/02/06/san-diego-tijuana-faulconer-press-conference/"}
