{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:22:43","date_modify":"2018-10-30 20:22:43","date_publish":"2015-12-29 00:39:54","description":"The City of San Francisco is demanding that Justin Bieber's music label put an end to a graffiti marketing campaign that is defacing their city, annoying residents, and costing taxpayers money.","filename":"data/vaneerConsumption/SanFranciscotoJustinBieberStopSprayPaintingGraffitionOurSidewalks.json","image_url":"https://media.breitbart.com/media/2015/12/Justin-Bieber-SF-Graffiti-Instagram-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_28__1540930963.html","title":"San Francisco to Justin Bieber: Stop Spray-Painting Graffiti on Our Sidewalks","title_page":"San Francisco to Justin Bieber: Stop Spray-Painting Graffiti on Our Sidewalks","title_rss":"NULL","source_domain":"breitbart.com","text":"The City of San Francisco is demanding that Justin Bieber’s music label put an end to a graffiti marketing campaign that is defacing their city, annoying residents, and costing taxpayers money.\nGraffiti promoting Bieber’s new album Purpose began popping up on San Francisco’s sidewalks in mid-November.\nJustin Bieber turf in Mission District, San Francisco. Rain did not wash it away, nor did the SFDPW. Justin 1 SF 0. pic.twitter.com/UNjp36mb1B — Sustainable Race (@evnewsreport) December 14, 2015\nThe graffiti reads: “Justin Bieber Purpose #Nov 13.”\nWhile the exact source of the graffiti remains unclear, City Attorney Dennis Herrera wants Bieber and his label to help make it stop.\nHerrera sent a letter to Universal Music Group’s Jeffrey Harleston and Def Jam CEO Steve Bartels on Monday Dec. 28 about the graffiti, which appears to have been painted on with a stencil.\nIn contrast, previous sidewalk marketing campaigns have been applied using chalk, as The Los Angeles Times notes.\n“This prohibited marketing practice illegally exploits our City’s walkable neighborhoods and robust tourism; intentionally creates visual distractions that pose risks to pedestrians on busy rights of way,” Herrera wrote in his letter.\nHe added the graffiti “irresponsibly tells our youth that likeminded lawlessness and contempt for public property are condoned and encouraged by its beneficiaries — including Mr. Bieber and the record labels that produce and promote him.”\nHerrera can pursue civil penalties of up to $2,500 for each violation, plus restitution for fees and costs, Fox News reported.\nOn Dec. 11, crews began cleaning off the graffiti using power washers, according to ABC7 News. The Bay Area affiliate also reported there were no estimates regarding how much the cleanup would cost the city’s taxpayers.\nThe city was made aware of Bieber’s graffiti campaign after receiving complaints from citizens living in San Francisco’s Haight-Ashbury neighborhood and other areas.\nOne Twitter user wrote, “pls fine Justin Bieber for this graffiti.”\n.@sf311 pls fine Justin Bieber for this graffiti pic.twitter.com/7darWpoOuj — suldrew (@suldrew) November 20, 2015\nReddit users also shared their thoughts on the graffiti marketing campaign.\n“Is that one of those it only shows up when the pavement is wet type of deals?” wrote one user, to which another replied: “Yes, wet with the tears of real musicians.”\nAnother user simply wrote: “If only there were some way to not buy his new album and not hear it. Also, if there were some way to simply not care what he does.”\nThis is not the first time Bieber has gotten into trouble for graffiti. In 2013, he was charged with vandalism for “defacing a building or urban monument by graffiti or other means,” after he was caught spray-painting “Beliebers4Life” on the walls of the former Hotel Nacional in Rio de Janeiro, Brazil.\nBieber seemed to make light of the event later when he posted photos to Instagram of himself with a spray-can making graffiti:","url":"https://www.breitbart.com/entertainment/2015/12/28/san-francisco-officials-demand-justin-bieber-put-an-end-to-spray-painted-sidewalks/"}
