{"authors":["Associated Press","Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-22 20:12:02","date_modify":"2018-10-22 20:12:02","date_publish":"2016-01-29 00:39:14","description":"Fourteen students at the majority white St Ignatius Prep were punished after photos emerged online showing them dressed in clothes mimicking urban black culture.","filename":"data/vaneerConsumption/SanFranciscoCatholicstudentssuspendedoverracistthemedwiggerparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B228D000000578-0-image-a-17_1454072632358.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421990_San-Francisco-students-suspended-race-themed-party_1540239122.html","title":"San Francisco Catholic students suspended over racist-themed 'wigger' party","title_page":"San Francisco Catholic students suspended over racist-themed 'wigger' party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"St Ignatius has 1,474 students enrolled in the school, of them 59 percent are white and under five percent black\nThe party was held in a city park and included 80-100 students from five area schools, among them some black teens\nPhotos posted by attendees show teens of both sexes, most of them white, wearing baggy pants, oversize basketball jerseys and track suits\nOfficials at the elite, majority white school learned of the event after seeing pictures on social media\nFourteen students at St. Ignatius College Preparatory High School have been suspended in the wake of\nFourteen students from a mostly white prestigious Catholic prep school in San Francisco have been suspended for attending an off-campus party where teenagers wore clothes commonly associated with urban black culture.\nThe Rev. Edwin Harris, president of St. Ignatius College Preparatory High School, told parents in a letter that the alcohol-fueled bash at a large city park called Sigmund Stern Grove 'appropriated pervasive negative stereotypes' and carried 'racial overtones and racist implications'.\n'Regardless of the intent of those who participated, their actions had an adverse effect on the community and on them,' Harris said. 'We categorically condemn this gathering as it does not represent the Ignatian values or ideals that our school stands for.'\nScroll down for video\nRace party: Fourteen students at St. Ignatius College Preparatory High School in San Francisco have been suspended after posing for pictures (seen above) at a racist-themed off-campus party\nCultural appropriation: Photos that were taken at the January 23 event show high school students of both sexes wearing low-riding baggy pants, oversize basketball jerseys and track suits, and sporting braids\nOffensive: School officials say the event was billed as a 'wigger' party - an offensive term combining the word 'white' and the N-word, and referring to a gathering for white people who emulate the language, gestures and dress popularized by rap and hip-hop videos\nThe party last weekend in San Francisco drew teenagers from several schools and was not organized by St. Ignatius students, Harris said. School administrators learned about it Tuesday from students who had seen photos on Instagram, he said.\nPhotos that were taken at the January 23 event and later obtained by the station KPIX show high school students of both sexes, most of them seemingly white, wearing low-riding baggy pants, oversize basketball jerseys and track suits, and sporting braids.\nMany of the partygoers seen in the pictures also made hand gestures seemingly meant to mimic gang signs.\nThe station reported that the Saturday night beer bash drew 80-100 students, including black teens, from five different schools.\nSt. Ignatius Principal Patrick Ruff told the San Francisco Chronicle the weekend party was billed as a so-called 'wigger' party - an offensive term combining the word 'white' and the N-word, and referring to a gathering for white people who emulate the language, gestures and dress popularized by rap and hip-hop videos.\n'It's disheartening and incredibly sad this type of thing exists not just for SI, but for the entire city,' Ruff told the newspaper.\nElite: Tuition at the prep school is just over $20,200 a year, and of the 1,474 students enrolled in St Ignatius, 59 percent are white and just under five percent are black\nThe party at a city park called Sigmund Stern Grove (park is pictured above) drew 80-100 students from five schools\nStudents and parents at the school were divided on the suspensions, with some deeming the disciplinary measure as overly harsh, pointing out that the party took place off campus and not during school hours.\nOthers, like 18-year-old Thomas O'Halloran, a senior, said that those who attended the party should have known better.\n'You can’t go to a party like that and post pictures on social media and think that nothing is going to happen,' he told the Chronicle. 'It’s just weird that this would happen at an institution that tries so hard to promote inclusion.'\nThe suspended St. Ignatius students will be required to meet with members of the school's Black Student Union, and administrators are planning a school-wide assembly to discuss diversity, Harris said.\nAccording to information available on the school's website, of the 1,474 students enrolled in St Ignatius, 59 percent are white and just under five percent are black.","url":"https://www.dailymail.co.uk/news/article-3421990/San-Francisco-students-suspended-race-themed-party.html"}
