{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:17:50","date_modify":"2018-10-30 22:17:50","date_publish":"2015-07-04 15:13:37","description":"San Francisco Shooting Suspect A Felon, Barred From Gun Possession","filename":"data/vaneerConsumption/SanFranciscoShootingSuspectAFelonBarredFromGunPossession.json","image_url":"https://media.breitbart.com/media/2015/07/Screen-Shot-2015-07-03-at-6.56.33-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_04__1540937870.html","title":"San Francisco Shooting Suspect A Felon, Barred From Gun Possession","title_page":"San Francisco Shooting Suspect A Felon, Barred From Gun Possession | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When Francisco Sanchez allegedly gunned down Kathryn Steinle at San Francisco’s Pier 14 on July 1, Breitbart News discovered that Sanchez had been deported from the country five times. We also discovered another interesting tidbit–Sanchez has seven felonies, which means he faces 100 percent gun control 100 percent of the time.\nHe is completely barred from gun possession and prohibited from having the gun with which he allegedly shot and killed Steinle.\nThe fact that the allegedly had one anyway proves again that gun control does not affect the behavior of criminals, but it does place law-abiding citizens in a scenario where it is harder for them to get the guns they need for self-defense.\nAccording to NBC Bay Area, “Sanchez has seven prior felony convictions, four of which were for drug charges.” The felony “convictions took place in states including Texas, Oregon and Arizona.”\nBut those convictions–and the resulting ban on Sanchez purchasing or possessing a firearm–appear to have done nothing to keep him obtaining one and, worse still, using it. Moreover, California’s expanded background check requirement, their state gun registry, and their 10-round magazine limit were powerless to protect Steinle.\nThe impotency of gun control has been on display around the world for decades, but has been brought into extremely sharp focus in America with alleged attacks by individuals completely barred from gun possession over the past few months.\nFor example, two of the suspects in the May 9 slaying of Hattiesburg, Mississippi Officers Benjamin Deen and Liquori Tate are felons–completely barred from gun possession. Likewise, Andrew Romero, the suspect in the Memorial Day shooting death of Rio Rancho, New Mexico, Officer Gregg “Nigel” Benner, is a felon who was consequently barred from gun possession at the time that he allegedly used a gun to kill Officer Benner.\nGun control is not working. It is time for criminal control. We must take dangerous people off our streets before they get the opportunity to act out their desires to hurt citizens and/or figures of civic and public authority. To pretend that such criminals can be controlled by merely warning them that they are not to possess a gun is like pretending that the Adam Lanzas and Nidal Hasans of this world will obey “no guns allowed” signs if they posted with large letters.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/07/04/san-francisco-shooting-suspect-a-felon-barred-from-gun-possession/"}
