{"authors":[],"date_download":"2018-10-22 20:24:10","date_modify":"2018-10-22 20:24:10","date_publish":"2014-06-01 06:29:17","description":"Free marijuana is the reward in store for certain voters on Tuesday in San Jose's municipal election.","filename":"data/vaneerConsumption/SanJoseDispensariesOfferFreePottoVoters.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/479816/140601-calif-marijuana-ga-0222_aa6b6e3880f5cd3e4a695c4fa2de3585.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_san-jose-dispensaries-offer-free-pot-voters-n119511_1540239850.html","title":"San Jose Dispensaries Offer Free Pot to Voters","title_page":"San Jose Dispensaries Offer Free Pot to Voters","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFree marijuana is the reward in store for certain voters on Tuesday in San Jose's municipal election.\nSan Jose is in the process of choosing a new mayor -- and also passing new, more-restrictive rules on medical marijuana. A proposal the City Council is still considering would zone dispensaries out of business, weed supporters say -- so Tuesday's election is important. Half of the City Council's 10 seats are at stake.\nSelect Silicon Valley medical marijuana dispensaries will give free discounted and in some cases free marijuana to voters with medical cannabis recommendations on Tuesday.\n\"A lot of people don't know about the primary elections,\" said Dave Hodges of the Silicon Valley Cannabis Coalition. \"We have some important races including the mayoral race, and we want to make sure politicians know the power of our voters.\"\nTo exchange \"Weed for Votes,\" all voters will need to do is present their \"I Voted\" sticker or their ballot stub to clubs listed in an announcement to be released Monday.\nThe June 3 ballot doesn't contain any marijuana-specific items, but activists have created a cannabis friendly voter guide.\nWith so many vacant seats at San Jose City Hall, the Cannabis Coalition feels this is its chance to get the right people in, Hodges said.\nThe city, though, says U.S. election code forbids giving something away in exchange for voting if there is a federal race or issue on the ballot. The congressional race between Mike Honda and Ro Khanna suggests the free weed might be illegal.\n“There may be federal issues, but there’s also federal issues providing cannabis,” Hodges said. “It’s one of those gray areas.”\nCannabis club member James McKinney said the idea is motivating him to vote.","url":"https://www.nbcnews.com/news/us-news/san-jose-dispensaries-offer-free-pot-voters-n119511"}
