{"authors":["Alexandra Klausner For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 03:18:20","date_modify":"2018-10-23 03:18:20","date_publish":"2016-01-28 18:43:19","description":"Tara McNeill Palajac of Northern California faces a murder charge this week after confessing she drowned her 12-year-old son in a bathtub on January 8.","filename":"data/vaneerConsumption/SantaClarawomandrownedher12yearoldadoptedsoninthebath.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACD61300000578-0-image-a-8_1454006318418.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421387_Woman-drowned-12-year-old-adopted-son-bath_1540264700.html","title":"Santa Clara woman 'drowned her 12-year-old adopted son in the bath'","title_page":"Santa Clara woman 'drowned her 12-year-old adopted son in the bath' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Charged: Tara McNeill Palajac was arraigned in the January 8 drowning death of her adopted son, 12, at their Santa Clara home\nPolice say a woman in Northern California faces a murder charge after confessing she drowned her 12-year-old son in a bathtub.\nThe San Jose Mercury News reports Tara McNeill Palajac was arraigned in the January 8 death of her adopted son at their Santa Clara home.\nPolice say Palajac initially said the boy had accidentally drowned but later confessed under police interrogation.\nAccording to court documents the child was rushed to the hospital, where he was pronounced dead about two hours later.\nPalajac reportedly told officers that she was home alone with the boy when she found him in the bathtub partially floating face up in the water.\nPolice say that detectives conducted a lengthy follow-up interview with Palajac three days later and she reportedly admitted that she held the child under water 'until he was lifeless'.\nNeighbors were shocked after hearing news of the alleged killing.\nPalajac was known as the homeowner association's chief financial officer.\nNeighbors told ABC that Palajac had two adopted sons who were polite and liked to play soccer.\nBoth of her adopted sons are believed to be from Hungary.\nOne neighbor said the adoptive parents had sent the boys back to Hungary to see their biological parents during school breaks.\n'She seems to be very nice person when we deal with business. She seems to be very professional,' said the president of the HOA, Bill Yeung.\nPalajac is expected to enter a plea on February 1 and remains on suicide watch for the time being.","url":"https://www.dailymail.co.uk/news/article-3421387/Woman-drowned-12-year-old-adopted-son-bath.html"}
