{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:20:27","date_modify":"2018-10-30 20:20:27","date_publish":"2016-07-11 17:50:45","description":"Carlos Santana will snub the Boycott, Divestment and Sanctions (BDS) movement to perform in Tel Aviv at the end of this month.","filename":"data/vaneerConsumption/SantanaSnubsBoycottMovementAheadOfConcertInIsrael.json","image_url":"https://media.breitbart.com/media/2016/03/santana.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_11__1540930827.html","title":"Santana Snubs Boycott Movement Ahead Of Concert In Israel","title_page":"Santana Snubs Boycott Movement Ahead Of Concert In Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Legendary multi-Grammy-award winning guitarist Carlos Santana has snubbed the Boycott, Divestment, and Sanctions (BDS) movement, and will perform in Tel Aviv at the end of this month after 29 years since his last concert in Israel.\n“I prefer to do something productive with my energy. The majority of proceeds from the concert will go to Israeli and Palestinian children,” Santana said when asked his position regarding BDS.\n“A friend once told me, ‘stop whining, either do something helpful or shut up.’ That’s my answer to a lot of people. I do things from my heart, in order to help the world and get to greater compassion and forgiveness,” he added.\nIn 2010, Santana pulled out of a scheduled concert in Jaffa leading to rumors that he was pressured by BDS activists to cancel. The upcoming concert put those rumors to rest.\n“Music is something holy, an inspiration that helps people see how to live together in coexistence. When you hear all the music in the world, age doesn’t matter. It’s a collective celebration, energy, and other world views – it keeps you really young,” the guitarist said.\nLast month, iconic British rock band Queen announced their debut performance in Tel Aviv with Adam Lambert as lead singer.\nVociferous Israel-basher and Pink Floyd front man Roger Waters has been accused of using bullying tactics to persuade other musicians not to perform in Israel.","url":"https://www.breitbart.com/middle-east/2016/07/11/santana-snubs-boycott-movement-ahead-of-concert-in-israel/"}
