{"authors":["Frances Martel"],"date_download":"2018-10-30 19:27:36","date_modify":"2018-10-30 19:27:36","date_publish":"2016-10-07 00:15:48","description":"Colombian President Juan Manuel Santos and FARC chief \"Timochenko\" have been dropped from the shortlist of Nobel Peace Prize candidates.","filename":"data/vaneerConsumption/SantosandTerrorChiefsQuestforNobelPrizeEndsAfterColombiaRejectsFARCDeal.json","image_url":"https://media.breitbart.com/media/2016/10/colombia-juan-santos-timochenko-peace-deal-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_10_06__1540927656.html","title":"Santos and Terror Chief's Quest for Nobel Prize Ends After Colombia Rejects FARC Deal","title_page":"Santos and Terror Chief's Quest for Nobel Prize Ends After Colombia Rejects FARC Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Both Colombian President Juan Manuel Santos and FARC terror group chief “Timochenko” have been dropped from the shortlist of Nobel Peace Prize candidates after the nation rejected a peace deal that would have allowed the FARC to evolve into a political party.\nThe Nobel Peace Prize committee, which had referred to the men who brokered the “peace” deal as an “obvious choice” for the prize previously, confirmed that it would be impossible to confer the award to the Colombian group when the winner is announced on Friday.\n“Colombia’s off any credible list,” the head of the Nobel Peace Research Institute, Kristian Berg Harpviken, confirmed to Reuters. Reuters also quotes historian Asle Sveen as calling the prize “out of the question” for the Colombian head of state and the head of one of the world’s most profitable drug trafficking operations. Sveen predicted the organizers of the Joint Comprehensive Plan of Action (JCPoA), more popularly known as the Iran nuclear deal, would now be the frontrunners.\nHad they won the prize, Santos and “Timochenko” would have made away with a $936,000 prize.\nFor two years in a row at the United Nations General Assembly, Santos declared that the ongoing “war” with the Revolutionary Armed Forces of Colombia (FARC) was over, thanks to years of negotiations with the terrorist group’s leadership in Havana, Cuba. FARC leaders escaped to Cuba during the tenure of president Álvaro Uribe, who allied with the American CIA to use counterterrorism techniques implemented against al-Qaeda to decimate the group. Uribe, now a Senator and the leader of the campaign against the peace deal, has insisted that a narco-terrorist insurgency within a law-abiding country is “not a war,” and that this description provides legitimacy to the FARC group as a political movement, not merely a sprawling organized crime syndicate.\nCuba, no longer on the State Department’s State Sponsors of Terrorism list as part of President Barack Obama’s concessions to dictator Raúl Castro, welcomed FARC terror leaders as heroes when Uribe’s campaign against them in the 2000s forced them to flee.\nSantos did the same the Monday before the October 2 vote in which Colombians rejected impunity for the terrorist group. Timochenko was allowed to return to Colombia without being arrested for a meeting of the FARC in the nation’s dense forest interior, from which he emerged to sign the peace deal with Santos.\nAs per the 1991 Colombian constitution, such a deal cannot go through without a simple majority popular vote. Santos failed to achieve this, with “no” winning with slightly less than 1 percent of the vote.\nBoth Timochenko’s hometown and the birthplace of the FARC voted “no,” and the national vote map indicates the areas hardest hit by the group’s half-century-long terror spree were most reluctant to reintegrate them into society. While polls asking Colombians whether they supported peace found that most were inclined to do so, leading many to believe the “yes” vote would pull through, other polls that asked Colombians about the specific provisions of the negotiation in question found strong resistance to said provisions.\nThe deal would have granted the FARC representation in Congress without having been elected and allowed FARC terrorists to run for office beginning in 2018. It also established a special tribunal for FARC terrorists, comprised partially of FARC members, who would judge each terrorist as they handed over their weapons. The tribunal would find each guilty of either “political crimes” or “crimes against humanity” — categories that were never specifically defined — and those found guilty of “political crimes” would not have to serve a prison sentence.\nThe Nobel Prize Committee must now sort through hundreds of candidates for a new winner. The list includes individuals and groups as varied as the Greek islanders forced to endure waves of thousands of migrants from Syria and beyond; criminal hacker Edward Snowden; and Republican Presidential nominee Donald Trump.\n“2016 may finally be Edward Snowden’s year… His leaks are now having a positive effect,” Harpviken speculated.","url":"https://www.breitbart.com/national-security/2016/10/06/santos-quest-nobel-prize-collapses-colombia-rejects-farc-deal/"}
