{"authors":[],"date_download":"2018-10-22 22:55:16","date_modify":"2018-10-22 22:55:16","date_publish":"2014-05-13 01:33:13","description":"An underwater explorer says heaps of wreckage off Haiti's coast may mark the spot where Christopher Columbus' flagship, the Santa Maria, sank in 1492.","filename":"data/vaneerConsumption/SantaMariaFoundWreckMayBeColumbusSunkenFlagship.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/437771/140512-coslog-santamaria_2a6266e4c1f4870c129659f3b6f69961.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_santa-maria-found-wreck-may-be-columbus-sunken-flagship-n103766_1540248916.html","title":"Santa Maria Found? Wreck May Be Columbus' Sunken Flagship","title_page":"Santa Maria Found? Wreck May Be Columbus' Sunken Flagship","title_rss":"NULL","source_domain":"nbcnews.com","text":"The claim is based on photographic documentation of the underwater site, plus Clifford's interpretation of previous research that identified the location of La Navidad, the fortified settlement that Columbus established on the coast of present-day Haiti after the Santa Maria ran aground on Christmas Day, 1492. The Independent quoted Clifford as saying that the location of the wreckage site was consistent with descriptions set down in Columbus' diary.\nColumbus and his crew had set out from Spain earlier that year in the Santa Maria as well as two other ships, the Niña and the Pinta. He was searching for an easy trade route to Asia. Instead, he came upon the New World. The voyage set the stage for widespread European settlement of the Americas.\nA week after the Santa Maria sank, Columbus left most of his crew behind in La Navidad and sailed back to Spain with the Niña and the Pinta. He came back to the Americas a year later with a 17-ship fleet — but when he returned to La Navidad, he found the fort in ruins, destroyed by the island's native inhabitants.\nEventually, La Navidad and the wreck of the Santa Maria became the focus of an archaeological mystery.","url":"https://www.nbcnews.com/science/science-news/santa-maria-found-wreck-may-be-columbus-sunken-flagship-n103766"}
