{"authors":["Amita Sharma","Dan Morain","David Gorn"],"date_download":"2018-10-30 23:13:53","date_modify":"2018-10-30 23:13:53","date_publish":"2018-09-12 20:19:03","description":"As senior homelessness spikes in some parts of the state, Santa Monica is trying out rental subsidies to help keep its seniors off the streets.","filename":"data/vaneerConsumption/SantaMonicaofferscashtoseniorstohelpwithrent.json","image_url":"https://calmatters.org/wp-content/uploads/IMG_1406-600x450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941233.html","title":"Santa Monica offers cash to seniors to help with rent","title_page":"Santa Monica offers cash to seniors to help with rent | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Rumors of seniors straining to pay their rent started making the rounds at Santa Monica City Hall two years ago so officials surveyed its elderly residents.\n“We had one household where the participant was eating every other day,” said Lisa Varon, senior analyst with the city of Santa Monica. “We had another household where the participant was trading her parking space for protein powder. We had people who were forgoing medical or dental care that they needed and making really difficult choices. They were all managing to hang on by a just a tiny thread and they were doing it with a lot of dignity the last quarter of their lives.”\nAging in California is becoming less about cruises, the pursuit of hobbies and time with the grandkids under the sun and more about survival. One in five seniors in the state lives in poverty, according to the Kaiser Family Foundation. Half of the state’s single seniors don’t have enough money to cover basic expenses. And regions like Los Angeles County are seeing a spike in homelessness among seniors.\nSanta Monica hopes to stem that trend.\nIn November, it launched a 14-month experiment by giving cash to nearly two dozen senior men and women struggling to pay their rent in a city that has rent control.\n“You would think their rents would be low, but even the 3 to 5 percent increases allowed a year outstrip the increases in the cost of medical care and other costs combined with the limited increases in Social Security,” said Steven Wallace, associate director of UCLA’s Center for Health Policy Research.\nBefore Kaye, who only wanted her first name used, was admitted into Santa Monica’s pilot program she said she had to pay all her expenses from her $1,000 monthly Social Security check.\n“If I didn’t have money to eat after paying my monthly bills, I just didn’t eat,” Kaye said. “There was literally nothing for nothing.”\nThat meant no money for partial dentures.\n“I had to have 12 teeth pulled out of my head in one day so that I could get dentures because they [Medi-Cal] wouldn’t pay for partials,” she said.\nIt also meant no money for gas for the 70-year-old’s car or any other transportation.\n“There were many times I would have to say to someone, `I don’t even have money to take a bus to get to you,’” she said.\nKaye said Santa Monica’s monthly subsidy has saved her.\n“If it weren’t for the city of Santa Monica helping me, I would probably by now have been evicted and on the street,” she said.\nOutside of helping seniors remain in their homes, city officials say the goal is to preserve Santa Monica’s diverse population.\n“This is not just the fancy shining city by the beach,” said Andy Agle, Santa Monica’s director of housing and economic development. “This is a city that is for everyone. It should be accessible to anyone. There are people living in $10 million houses here, but there are people living on Social Security, and all of that is part of Santa Monica.”\nOfficials said Santa Monica may be the first city in the United States to subsidize rent for seniors. Though other cities like Denver and Detroit are offering rental subsidies to low-income families. Stockton also plans to offer a basic income of $500 to some of its neediest residents in the fall as part of an 18-month project.\n“We are human beings,” said 70-year-old Pierre Devillandry “We have to help each other.”\nThe 30-year Santa Monica resident is a painter who laughs easily. But just one year ago, he was wracked with anxiety because he consistently fell short $500 each month on his bills. He was dogged by one thought: “How am I going to live tomorrow?”\nThen came the letter from the city of Santa Monica informing the painter that he was accepted into the pilot program for a monthly subsidy.\n“It was something that came down from Heaven,” he said.\nWallace said single seniors like Devillandry are hurting the most.\n“About half of them don’t have enough money to pay those basic expenses,” Wallace said. “And so, you don’t see people dying on the street but you do see people in dire circumstances and making do in various ways that I think none of us would consider adequate in a wealthy, civilized society like we’re in.”\nWallace consulted on Santa Monica’s elderly subsidy program. He said the true test of its success will be if seniors in the pilot project stay in their homes longer than those who are not receiving help. Another indicator will be if the city saves money.\nSanta Monica admitted seniors making $14,000 a year or less into the program.The city used UCLA’s Elder Index to calculate how much it costs for seniors to cover their basic expenses and has sought to raise the income of each of the participants to $22,098 annually.\nVaron said Santa Monica has set aside $300,000 in general fund and sales tax money for the pilot project. She said the alternative could be even more expensive.\n“When somebody becomes homeless, their expenses become astronomically higher because they’re on the street, and they are sick and possibly we are calling paramedics for them,” Varon said. “They are ending up at the hospital because they are so sick so how can we afford not to keep them housed?”\nSanta Monica’s Agle views the city’s subsidies as part of its social contract with seniors.\n“In most of California, Social Security is barely going to pay your rent,” he said. “Are we as a state, as Californians, going to say, `Let’s add everybody over 65 as homeless.’ Is that really who we want to be as a country as a state?”","url":"https://calmatters.org/articles/santa-monica-offers-cash-to-seniors-to-help-with-rent/"}
