{"authors":[],"date_download":"2018-10-30 01:09:50","date_modify":"2018-10-30 01:09:50","date_publish":"2015-03-11 00:00:00","description":null,"filename":"data/vaneerConsumption/SarahPalinslessonsinmultitaskingusingmultidevices.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_sarah_palins_lessons_in_multi_tasking_using_multi_devices_1540861790.html","title":"Sarah Palin's lessons in multi tasking, using multi devices","title_page":"Sarah Palin's lessons in multi tasking, using multi devices","title_rss":"NULL","source_domain":"americanthinker.com","text":"Sarah Palin's lessons in multi tasking, using multi devices\nOk, so ignore for the moment--and just for the moment--Hillary Rodham Clinton's statement at her vast right wing conspiracy repudiation that she only used one device for convenience when she previously admitted http://www.breitbart.com/video/2015/03/10/hillary-flashback-i-have-two-phones/ When asked if she prefers iPhone or Android, Clinton responded “iPhone, OK, in full disclosure — and a Blackberry.”\nAnd also ignore--but again, just for the moment--that such devices allow for more than one account so she could have easily had a regulation .gov account dealing with her official duties and a clintonemail.com private account for Chelsea’s wedding plans, her e mails to her loving husband who admits to not using e mail and her yoga on one handy, dandy convenient device. But math is hard. Sarah Palin could have taught her a trick or two about these devices. And convenience. And well, diplomacy. Palin only needed one device to see Russia from her house and what they were up to. Clinton, with all her flying around and one convenient device with her Secret Service guarded server, couldn't see what Putin's reset/old set Russia was up to let alone Benghazi, Libya. ht: Instapundit","url":"https://www.americanthinker.com/blog/2015/03/sarah_palins_lessons_in_multi_tasking_using_multi_devices.html"}
