{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-23 00:02:29","date_modify":"2018-10-23 00:02:29","date_publish":"2016-01-29 12:38:27","description":"As Sara Leonardi and her husband Glenn McGrath headed out to lunch with their newborn, the three well and truly looked like the perfect family in matching ensembles.","filename":"data/vaneerConsumption/SaraLeonardiandGlennMcGrathstepoutwiththeirbabygirlMadison.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1960800000578-0-image-a-45_1454065457679.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422532_Sara-Leonardi-Glenn-McGrath-step-lunch-baby-girl-Madison-matching-blue-linen_1540252949.html","title":"Sara Leonardi and Glenn McGrath step out with their baby girl Madison","title_page":"Sara Leonardi and Glenn McGrath step out with their baby girl Madison | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They welcomed their new baby Madison into the world just last September after thinking they'd never be able to conceive.\nAnd as Sara Leonardi and her husband Glenn McGrath headed out to lunch with their infant on Friday, the three well and truly looked like the perfect family in matching ensembles.\nWhether it was deliberate or not that the legendary cricketer, 45, and his wife, 34, donned co-ordinated blue linen shirts, they undoubtedly looked picture perfect on their lunch outing in Sydney.\nScroll down for video\nFamilies who dress together stay together! Sara Leonardi and Glenn McGrath stepped out for lunch on Friday in Sydney with their baby girl Madison, wearing matching blue linen shirts\nThe interior designer opted for a baby blue collared shirt, wrapping a white and blue light-weight scarf around her neck, adding cement-coloured chinos and slip-on shoes for comfort.\nThe mother-of-one shielded her eyes from the glare with a pair of cats-eye sunglasses and tied her hair in a half-up pony tail.\nHer husband meanwhile, chose an identical hue for his shirt, wearing it un-tucked with a pair of navy shorts and brown suede sneakers.\nFamily outing: The trio headed out for lunch in Cronulla, braving the stormy weather\nBaby blue: The interior designer opted for a baby blue collared shirt, wrapping a white and blue light-weight scarf around her neck, adding cement-coloured chinos and slip-on shoes for comfort\nChic: The mother-of-one shielded her eyes from the glare with a pair of cats-eye sunglasses\nEven the blanket covering the stroller on the stormy day in the beach-side suburb of Cronulla, was baby blue.\nAs the doting parents lifted their tiny tot into the car, Madison could be seen napping soundly.\nThis is the couple's first child together, with their trouble conceiving well documented, enduring two rounds of IVF after the fast bowler had his vasectomy reversed.\nThe overjoyed pair announced their pregnancy to the monthly title in May, with Glenn telling The Australian Women's Weekly: 'We're adding to our family and we couldn't be more delighted.\nNapping soundly: Madison could be seen napping soundly as her mother placed her into the car\nMatchy, matchy! Even the blanket, which was protecting the new bub from the rain, was baby blue\nDelighted: The overjoyed pair announced their pregnancy in The Australian Women's Weekly in May\n'Sara and I are very happy together and the kids are two really happy, normal children and I think, at the end of the day, that’s really the true measure of what Sara and I have built together these last five years of marriage.'\nThe couple met during the 2009 Indian Premier League, a year after Glenn lost Jane to breast cancer in 2008, and got together shortly afterwards.\nGlenn has two other children, Holly, 12, and James, 15, with his late wife Jane.\nStressful: Madison's conception wasn't all that smooth, with the legendary cricketer having to reverse his 2003 vasectomy and Sara undergoing two rounds of IVF before conceiving","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422532/Sara-Leonardi-Glenn-McGrath-step-lunch-baby-girl-Madison-matching-blue-linen.html"}
