{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 22:56:54","date_modify":"2018-10-22 22:56:54","date_publish":"2016-01-28 11:34:09","description":"Sarah Paulson, 41, let loose at the American Crime Story premiere after party at the W Hotel, Los Angeles, on Wednesday night.","filename":"data/vaneerConsumption/SarahPaulsongetsplayfulwithhercostarsatAmericanCrimeStoryparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A95E0200000578-0-image-a-8_1453976846962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420698_Easy-tiger-Sarah-Paulson-cuts-glamorous-figure-floor-length-fuschia-gown-lets-feisty-roar-American-Crime-Story-premiere-party_1540249014.html","title":"Sarah Paulson gets playful with her co-stars at American Crime Story party","title_page":"Sarah Paulson gets playful with her co-stars at American Crime Story party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has a leading role in the eagerly awaited star-studded drama which will retell the events of the infamous O.J. Simpson trial.\nSo it's no surprise Sarah Paulson, 41, let loose at the American Crime Story premiere after party at the W Hotel, Los Angeles, on Wednesday night.\nThe actress, who has been a longstanding fixture of series' sister show American Horror Story, joked around with her co-star Courtney B. Vance and was all smiles as she posed for pictures.\nScroll down for video\nRoar! Sarah Paulson, 41, let loose at the American Crime Story premiere after party at the W Hotel, Los Angeles, on Wednesday night, alongside co-star Courtney B. Vance\nSarah, who plays the role of Marcia Clark -- the head prosecutor in the 0.J. Simpson murder case -- in FX's mini -series, gave Courtney her best scary face.\nMouth wide-open and brows furrowed, she roared while raising a clawed hand. However, Courtney wasn't fazed by her actions and simply smiled back at her while gently holding her wrist.\nThe actress dressed in an elegant dark pink dress with a metallic waistband and carried a chunky gold clutch.\nPretty in pink: The actress dressed in an elegant dark pink dress with a metallic waistband and carried a chunky gold clutch\nLaughing out loud: The actress, who has been a longstanding fixture of series' sister show American Horror Story, joked around with her co-star Courtney B. Vance and was all smiles as she posed for pictures\nGood pals: She clearly shares a strong friendship with Vance as she stood with her arms draped over his shoulders laughing heartily\nSarah's cropped blonde locks were swept to the side and abruptly came to rest at the level of her chin.\nShe clearly shares a strong friendship with Vance as she stood with her arms draped over his shoulders and laughing heartily.\nIn another shot, she put her hands on his cheeks while pulling an enthusiastic face just inches from his.\nCharacter profile: Sarah plays the role of Marcia Clark -- the head prosecutor in the 0J Simpson murder case -- in FX's mini -series\nStuck in the middle: Sarah took the centre space when she was pictured with David Schwimmer and director John Singleton, putting on a more serious face as she put arms around their shoulders\nAnd joined by Jessica Blair Herman, she leaned in and nibbled on Courtney's cheek, while the unperturbed actor kept on grinning.\nSarah took the centre space when she was pictured with David Schwimmer and director John Singleton, putting on a more serious face as she put her arms around their shoulders.\nShe crouched down and looked up at the show's creator Ryan Murphy in another shot, who held onto her right arm while Cuba Gooding Jr held her left.\nTake a bite: Joined by Jessica Blair Herman, Sarah leaned in towards Courtney and nibbled on his cheek, while the unperturbed actor kept on grinning\nExcited! Sarah put her hands on Courtney's cheeks while pulling an enthusiastic face just inches from his\nNestling in: She crouched down and looked up at the show's creator Ryan Murphy in another shot, who held onto her right arm while Cuba Gooding Jr held her left\nThe new TV series centres around the O.J. Simpson trial which took place from 1994 to 1995, and will see Cuba Gooding Jr. play the role of O.J. and Travolta as defense lawyer Robert Shapiro.\nThe former American football star was cleared of murdering his ex-wife and Kris Jenner's best friend, Nicole Brown Simpson, and Ronald Goldman.\nFormer friends star David portrays defense lawyer Robert Kardashian and Selma his wife Kris, now known as Kris Jenner.\nProducer Nina recently teased in an interview with MTV News: 'For us, the O.J. story is so much more about race in America, the relationship between white police and a black community, the birth of a 24-hour news cycle, and of reality TV.\nThe infamous Bronco chase: Cuba Gooding Jr. plays OJ Simpson in the FX mini series\nBig character: David plays attorney Robert Kardashian, who fathered Kim, Khloe, Kourtney and Robert Jr, in the upcoming TV mini-series American Crime Story\n'The violence is very sobering, but it is very, very restrained, because the story is much more about the trial and the circumstances and the cultural response, two years after the L.A. riots, and how the city and the country and the world responded to these events.\n'It’s a very, very different show than American Horror Story, and very respectful of the people involved.'\nThe 10-episode true-crime anthology series American Crime Story: The People v. O.J. Simpson premieres February 2 on FX.\nGotcha! Malcolm Jamal-Warner warmly held Sarah for a cheerful snap\nQuite a transformation: Travolta, left, had the looks and the nuances down as legal defender Robert Shapiro, right in 1994","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420698/Easy-tiger-Sarah-Paulson-cuts-glamorous-figure-floor-length-fuschia-gown-lets-feisty-roar-American-Crime-Story-premiere-party.html"}
