{"authors":["Tony Lee"],"date_download":"2018-10-30 21:12:22","date_modify":"2018-10-30 21:12:22","date_publish":"2014-05-21 23:10:00","description":"Former Alaska Gov. Sarah Palin said President Barack Obama's Veterans Administration scandal involving 40 veterans who reportedly died after they were put |","filename":"data/vaneerConsumption/SarahPalinVAScandalFutureofObamacareIfDemocratsNotVotedOut.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Palin/palin-troops-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_05_21__1540933942.html","title":"Sarah Palin: VA Scandal Future of Obamacare If Democrats Not Voted Out","title_page":"Sarah Palin: VA Scandal Future of Obamacare If Democrats Not Voted Out | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Alaska Gov. Sarah Palin said President Barack Obama’s Veterans Administration scandal involving 40 veterans who reportedly died after they were put on secret waiting lists represents Obamacare’s future if Democrats are not voted out of office.\n“Friends, that’s rationed care. That’s the VA today. That’s what’s got to change,” she wrote Wednesday on Facebook. “That’s why Congress has got to change because until we elect leaders who’ll buck the march to socialized medicine known as Obamacare, America’s health care system will go the way of the VA.”\nPalin had previously warned about the perils of socialized medicine and Obamacare before the law was enacted.\n“Government health care will not reduce the cost; it will simply refuse to pay the cost,” Palin wrote in 2009 while predicting “death panels.” “And who will suffer the most when they ration care? The sick, the elderly, and the disabled, of course.”\nPolitifact deemed Palin’s remarks to be its “Lie of the year,” and Palin was mocked years before liberals like Howard Dean, Paul Krugman, and some of President Barack Obama’s former advisers – like Steven Rattner – finally conceded she was right\nPalin said Wednesday that “Obama’s Democrat party must be defeated in the ballot box in November” so that America remains the strongest nation on earth. She posted a picture of Abraham Lincoln and referenced Lincoln’s words about Americans having to guard their freedoms: “America will never be destroyed from the outside. If we falter and lose our freedoms, it will be because we destroyed ourselves.”\nLast week, Palin sounded the alarm about the willingness of Democrats to use Obamacare’s failures to push the country toward a single-payer healthcare system.\n“What happens next is the Left will subtly suggest moving America toward a single-payer system, which was their intention all along. Watch for this gradual, but driving, descent into statism,” Palin warned. “So, are you still relying on Obamacare to help and not hurt you? On the Democrats’ watch, health care in the hands of unaccountable bureaucrats proves Reagan’s adage that government is not the solution; government is the problem.”","url":"https://www.breitbart.com/politics/2014/05/21/sarah-palin-va-scandal-future-of-obamacare-if-democrats-not-voted-out/"}
