{"authors":["Penny Starr"],"date_download":"2018-10-30 18:31:32","date_modify":"2018-10-30 18:31:32","date_publish":"2018-06-23 19:24:30","description":"A man claiming to be a waiter at the Red Hen restaurant in Lexington, Virginia, posted on Facebook Friday that the owner refused to serve White House press secretary Sarah Sanders and her family, resulting in an online battle between supporters and people who called out the discrimination.","filename":"data/vaneerConsumption/SarahSandersAntiTrumpRestaurantOwnerKickedMeOut.json","image_url":"https://media.breitbart.com/media/2018/06/Sarah-Sanders-pursed-lips-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_23__1540924292.html","title":"Sarah Sanders: Anti-Trump Restaurant Owner Kicked Me Out","title_page":"Sarah Sanders: Anti-Trump Restaurant Owner Kicked Me Out","title_rss":"NULL","source_domain":"breitbart.com","text":"A man claiming to be a waiter at the Red Hen restaurant in Lexington, Virginia, posted on Facebook Friday that the owner refused to serve White House press secretary Sarah Sanders and her family, resulting in an online battle between supporters and people who called out the discrimination.\nLast night I was told by the owner of Red Hen in Lexington, VA to leave because I work for @POTUS and I politely left. Her actions say far more about her than about me. I always do my best to treat people, including those I disagree with, respectfully and will continue to do so — Sarah Sanders (@PressSec) June 23, 2018\nJaike Foley-Schultz had previously posted about the incident on Facebook, then changed his version of events.\nOriginally, Foley-Schultz wrote, “I just served Sarah huckabee sanders for a total of 2 minutes before my owner kicked her out along with 7 of her other family members…”\nThat post was later edited to read, “I just served Sarah huckabee sanders for a total of 2 minutes before my owner asked her to leave and she complied. Her family left on their own accord, we didn’t actually refuse service or ‘kick her out.'”\nSanders’ Twitter post clearly aligns with Foley-Schultz’s original post.\nNewsweek reported:\nLater that evening, Brennan Gilmore, the executive director of Clean Virginia, reposted the story on his Twitter page, which attracted more than 15,000 likes and 4,000 retweets. “@PressSec got kicked out of the Red Hen restaurant in Lexington, Va tonight. Apparently the owner didn’t want to serve her and her party out of moral conviction,” he wrote. Shortly after, hundreds of reviews started flooding into The Red Hen’s Yelp and Facebook pages from both Democrats and Republicans, ranging from one star to five stars. Most reviewers thanked the restaurant for taking a moral stand:\n.@PressSec got kicked out of the Red Hen restaurant in Lexington, Va tonight. Apparently the owner didn’t want to serve her and her party out of moral conviction. pic.twitter.com/jr3bfiY3XY — Brennan Gilmore (@brennanmgilmore) June 23, 2018\n“Cant wait to visit this establishment when I pass thru in July. From what I hear they have great food standards morals and respect for human decency. This is my type of place,” Mashay Clart wrote.\nNot all of the people weighing in, however, supported what they saw as blatant discrimination.\n“I saw the owner refuse Sarah Huckabee Sanders service because he is a Democrat and can’t be a decent human being, What an idiot,” Solomon Sanchez wrote.\n“Rude, bigoted, hateful staff and owners. What a disappointment,” Valarie Waskom wrote.\n“I live in the Midwest and have already heard what you did to Mrs. Sanders and her party. What a total disgrace you are! Talk about Nazis!! Better check your books. I am certain they won’t be as fruitful as they were before you chose to be ignorant!” Sandra Calhoun wrote on Facebook:\nFollow @PennyStarrDC on Twitter.","url":"https://www.breitbart.com/politics/2018/06/23/sanders-anti-trump-restaurant-owner-kicked-me-out/"}
