{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 03:45:52","date_modify":"2018-10-23 03:45:52","date_publish":"2016-01-11 16:37:48","description":"The comedian and I Smile Back star said that the thought of never having kids makes her sad, but her lifestyle isn't 'conducive' to raising children the way she'd want to.","filename":"data/vaneerConsumption/SarahSilvermansayswomenfacetoomuchpressuretohavebabies.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DD38400000578-0-image-a-2_1452539137900.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393994_Sarah-Silverman-45-says-women-face-pressure-babies-admits-believes-T-all_1540266352.html","title":"Sarah Silverman says women face too much pressure to have babies","title_page":"Sarah Silverman says women face too much pressure to have babies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In October, she said she'd changed her mind and thought she might adopt, adding that 'freeze eggs?' is always lingering on her To Do list\nIn 2012, the I Smile Back star said she didn't want children because she was afraid of passing her depression on to them\nShe added that she still faces pressure - even from mere\nThough no one seems to bat an eyelid when a Hollywood actor chooses to maintain a bachelor lifestyle, deciding not to have children can be a bit different for women - as comedian Sarah Silverman is learning too well.\nThe 45-year-old admits that she feels conflicted about starting a family of her own - but as if that wasn't a stressful enough decision to make in her own right, she now has acquaintances weighing in on whether she should become a mother.\n'I'm 45 and I don't have kids and, you know, when you're a woman, I'm finding out... you get so much pressure,' she told Marc Maron on his podcast, WTF.\nPriorities: Sarah Silverman said that she 'aches' for kids but loves her life as it is too much to have them\nMind your own business! The 45-year-old noted that lately she has been receiving a lot of pressure from others, who urge her to start a family\n'I got two emails within the span of a week, two weeks ago, from people in my life, who I don't necessarily know really well, who just out of nowhere said, \"You should really have kids\" and, \"I've been thinking about you.\" It's such an odd thing to put on someone,' she said.\nBesides the unfairness of that pressure – particularly as men seem far less likely to be on the receiving end of it - Sarah pointed out that it's actually quite insensitive to make comments like that at all.\nThe people telling her she should have kids don't know how how much she struggles with fact that she doesn't have them.\n'It's a sadness for me because I love kids. I ache for kids,' Sarah said. 'But I love my life more. You can't have it all; you really can't.'\nThat is, she qualified, unless you're a \"fun dad\", the kind of person who isn't actually involved in the day-to-day care-taking but gets to join in for the enjoyable parts.\nShe once said she'd be afraid to pass her depression down to her offspring, but now she considers freezing her eggs or adopting\n'I can be a fun dad, I feel totally prepared for that,' she said. 'But I don't have the lifestyle conducive to having kids the way that I would want to have kids. And I just made that choice. [But it's not like] that choice, I have no regrets, or no sadness about it.'\nLuckily, those feelings helped her out with her 2015 film I Smile Back, in which she plays a mother struggling with depression - a role that got her nominated for a Screen Actors Guild Award.\n'I have this saddness and this desperation round children that I feel worked well for this part,' she said. 'Because she has so much anxiety about loving her kids and not wanting to f*** them up.'\nSarah's feelings about having children have evolved over time. A few years ago, she made headlines for proclaiming that she didn't want to procreate.\n'I don’t want kids,' she said on The Conversation with Amanda de Cadenet in 2012. 'I know that I have this depression and that it’s in my family. Every family has their stuff but, for me, I just don’t feel strong enough to see that in a child.'\nTough role: She starred int he 2015 film I Smile Back (pictured), in which she plays a mother struggling with depression\nEmotions: She said she was able to draw on her saddness about having kids for the part\nDoing the right thing? Sarah said in October that a part of her is 'baby crazy' and she feels 'sorrow' that she may never have kids\nMore recently, she revised her position, writing in an essay for Glamour in October that she thinks she'd be able to 'therapy through it'.\n'A part of me is baby crazy. A part of me goes, Why not? And every day I add \"Freeze eggs?\" to the end of my to-do list. Then it keeps getting passed on to the next day's list. Maybe I'll adopt.\n'I do have sorrow about the possibility that I may never have my own children. And I still have downward spirals, days when I have to drag myself onstage to do stand-up or I'm just tweeting Morrissey lyrics from my bed. But there's one thing I know that I used to not know: It will pass.'\nSarah famously dated fellow comedian Jimmy Kimmel from 2003 to 2009, with a brief break-up in 2008. Though the two have remained friendly - Sarah has been on his show since the split, and they've joked about their past - Jimmy began dating the woman who is now his wife, co-head writer Molly McNearney, only months later.\nJimmy and Molly tied the knot in July of 2013 and went on to have a daughter, Jane, in July of 2014.\nSarah has been dating actor Michael Sheen since the beginning of 2014, though the couple has no plans to get hitched.\n'Just read that I wanna get married which is hilarious b/c I will never get married,' Sarah tweeted in September of 2014. 'Why would I want the govt involved in my love life? Ew. It's barbaric.","url":"https://www.dailymail.co.uk/femail/article-3393994/Sarah-Silverman-45-says-women-face-pressure-babies-admits-believes-T-all.html"}
