{"authors":["Associated Press","Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 02:03:37","date_modify":"2018-10-23 02:03:37","date_publish":"2016-01-28 16:47:55","description":"Sara DiVello, 38, from Boston, was the head of public relations at a lucrative financial services firm before she hit her breaking point and quit her job.","filename":"data/vaneerConsumption/SaraDiVelloquitherjobtoteachYOGAandinsistsshesneverbeenhappier.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/02/02/16/30D0CA8D00000578-0-image-a-93_1454431792826.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421291_Why-stay-bad-job-Reasons-practical-emotional_1540260217.html","title":"Sara DiVello quit her job to teach YOGA and insists she's never been happier","title_page":"Sara DiVello quit her job to teach YOGA and insists she's never been happier | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman has revealed what pushed her to quit her six-figure job at a $750 billion company to teach yoga and pursue her dream of being a writer.\nAt 31 years old, Sara DiVello, from Boston, was the head of pubic relations at a lucrative financial services firm. However, it was her high-stress job that required her to work long hours and travel constantly that led her to abandon the career she had spent her life working towards.\n'For nearly 10 years, I slogged through brain-numbing, red-tape-filled, dismal days in an industry devoted to nothing more than the altar of making money,' the now-38-year-old wrote in an essay for Cosmopolitan.com. 'Because of this, I ended up leaving my financially lucrative, comfortable career because I felt like my soul was being eroded.'\nNew life: Sara DiVello, who can be seen in a modified lotus pose in the Financial District of Boston, quit her high-paying job at a $750 billion company to teach yoga\nNever looking back: Sara, who worked as the head of PR at a financial services firm, said she turned to yoga to help relieve herself of the stress brought on by her job\nSara explained that she had grown up 'poor' and living in 'hand-me-down', so when she became the first one in her family to go to college, she majored in print communications to increase the likelihood of her finding a job instead of her dream of studying English.\n'I didn't have the luxury of book-writing dreams. I had student-loan reality,' she noted.\nHowever, the high-profile job that Sara had though she wanted left her exhausted and took her away from her family, friends, and fiancé, who also frequently traveled.\nThe couple were away so often that they left their suitcases by the door in their apartment, so they wouldn't have to keep taking them out of storage.\nCatch-22: Sara said working in public relations felt like her 'soul was being eroded', but she stuck with her career for years because she grew up poor and worried about money\nConflicted: Sara said she believed in her heart that yoga was her calling, but her mind told her that she couldn't abandon her high-profile career for a job that doesn't even require the college degree she worked so hard for\nSara said it was the stress of her job that made her turn to yoga for 'solace'. After work she would head to yoga class and abandon thoughts of her high-octane career to instead focus on her breath and unwinding.\nThe former businesswoman admitted that a voice in her head told her that yoga was her calling, but she ignored it because she believed having a career was enough.\nHowever, Sara's boss was abusive, insulting and undermined her, keeping her out of important meetings. But she still felt she couldn't leave; she hoped for a year-end bonus and also didn't want a prospective employer to think she was unreliable for quitting so soon.\n'They're afraid you're going to do it to them and they won't hire you,' she told the Associated Press. 'I kept thinking, \"I can solve this. I can make it work.\"'\nEnough is enough: Sara hit her breaking point after her boss announced without warning that she was taking over a major initiative that she had been leading for months, prompting her to give her notice\nFriendly gathering: Sara is pictured with meditation guru Gabby Bernstein (center) and another friend in Nantucket, Massachusetts, in 2014\nLife-changing decisions: Sara went on to teach yoga and publish her memoir Where in the OM Am I? in 2013. Sara is pictured hold her book (right)\nAt her lowest point, Sara explained her essay that she woke up in the middle of night during a branding summit in Colorado and had no idea where she was 'literally or figuratively'. In that moment, she recalled how she wanted to be back at home with her fiancé, but they were both away on business.\nShe admitted that they hadn't spoken in days, and despite her reassuring herself that they were a 'power couple', she felt like they were hardly even together.\nSara continued to practice yoga and eventually enrolled in a yoga teacher-training program. However, she refused to let herself pursue a career in yoga, which doesn't require the college degree she worked so hard for.\nHowever, things changed for Sara after she hit her breaking point at work. When her new, less-experienced boss announced without warning that she was taking over a major initiative that Sara had been leading for months, she gave her notice.\nThrough the looking glass: Sara said she had every intention to return to her career in public relations after taking the summer off, however, she eventually realized that wasn't what she wanted\nCelebration: Sara (back left) can be see striking a yoga pose with yoga maven and championship ballroom dancer, Tao Porchon Lync (center), on her 96th birthday in 2014\nSara said she had ever intention of returning to her career in public relations, and after she quit her job she though she would just take off the summer to teach yoga and regroup. She and her fiancé were married at this point, and he readily supported her idea.\nAlthough she was fearful about not taking in any money, she looked for yoga teaching opportunities. Sara recalled bringing 12 pages of notes to teach her first class, and despite her nerves, she felt like it was the first time she was being her 'authentic' self.\nWhen summer passed, Sara still wasn't ready to go back to her career in PR. Instead, she continued teaching yoga and in 2013 she published her memoir Where in the OM Am I?, which chronicles her transition from a corporate businesswoman to a yoga instructor.","url":"https://www.dailymail.co.uk/femail/article-3421291/Why-stay-bad-job-Reasons-practical-emotional.html"}
