{"authors":["Fiona Macrae Science Editor For The Daily Mail"],"date_download":"2018-10-23 02:42:43","date_modify":"2018-10-23 02:42:43","date_publish":"2016-01-11 15:14:24","description":"Psychologist Louise Phillips from Aberdeen University tested the theory by asking 116 men and women to read a series of stories and watch videos which showed everyday conversations.","filename":"data/vaneerConsumption/Sarcasmislostontheover65sbecausetheytakeittooliterallystudyfinds.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B602700000578-0-image-a-84_1452525210109.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3394030_Don-t-bother-sarcastic-older-people-won-t-understand-mean-Study-finds-sarcasm-lost-65s-literally_1540262563.html","title":"Sarcasm is lost on the over 65s because they take it too literally, study finds","title_page":"Sarcasm is lost on the over 65s because they take it too literally, study finds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is often said to be the lowest form of wit and it seems that sarcasm becomes beneath us as we get older.\nResearch shows that cutting comments are lost on pensioners.\nThe Aberdeen University study found that men and women aged 65-plus are less likely to see the inner meaning in sarcastic statements and so take them literally.\nIt is thought the pensioners' tendency to view the world through rose-tinted glasses means that they see the best in people.\nThe Aberdeen University study found that men and women aged 65-plus (stock image) are less likely to see the inner meaning in sarcastic statements and so take them literally. It is thought the pensioners' tendency to view the world through rose-tinted glasses means that they see the best in people\nPsychologist Louise Phillips asked 116 men and women to read a series of stories and watch a selection of videos which showed everyday conversations between friends and spouses.\nSome were straightforward but others involved sarcastic exchanges, such as someone who didn't enjoy a play describing it as 'fantastic'.\nAfterwards, the volunteers, who were aged between 18 and 86, were questioned about what they'd seen and read.\nTheir answers revealed that those aged 65-plus were less likely to pick up on sarcasm than the others.\nHOW TO BE SARCASTIC ONLINE Sarcasm is one of the trickiest literary concepts to convey by email or text without running the risk of being taken seriously, or offending someone. Now, a group of psychologists may have found the solution. After studying the impact of emoticons and punctuation on how people interpret written statements, they have pinpointed the best way to ensure your text will be read as sarcastic. They said in ambiguous situations where a message could be taken literally, using a winking face emoji at the end of a statement will make it seem more sarcastic. Elsewhere, using an ellipsis and a tongue face emoticon can also make messages seem more sarcastic than a simple full stop. This would be written as '... :-p' on emails or programs that don't support emoji.\nHowever, they were just as likely as the younger participants to grasp the meaning of the non-sarcastic scenarios.\nTests showed the phenomenon couldn't simply be explained away by the pensioners suffering memory problems.\nHowever, they were worse at reading facial expressions – something that could be important when decoding what is actually meant.\nThe tendency for pensioners to look on the bright side may also be relevant.\nPrevious research has shown that despite the widespread belief that we get grumpier as we age, pensioners have a more positive view of the world than younger people.\nIt is thought that this ability to see the good and overlook the bad helps ensure we are not overwhelmed by life's tragedies, which grow in number as we age.\nThe discovery that sarcasm loses its bite with age is important because while sarcasm can be hurtful, it plays an important part in many day-to-day interactions.\nBitter banter can also help us bond with others and build new friendships.\nProfessor Phillips said: 'Losing the ability to respond appropriately to sarcasm might affect our relationships and friendships as we age.\nSarcasm is also difficult to portray in writing. Using emoticons such as a winking face at the end of a message (pictured) can make it seem more sarcastic, according to recent research. They assessed the emotional impact of different types of punctuation and emojis to see how they influenced the way people interpreted them\n'We already know that engaging in social interactions is valuable, particularly as we age, and we were interested in finding out how the normal ageing process might affect our ability to understand subtle social cues such as sarcasm.\n'However, in some situations it might be a good thing to misinterpret sarcasm, given that it can sometimes be considered nasty or derogatory.\n'Older adults are known to have a more positive outlook on life than younger adults and this may contribute to their failure to pick up on sarcastic undertones.'\nThe professor, who has previously shown that we become more gullible and easier to deceive as we age, now wants to look at whether the elderly's lack of appreciation of sarcasm means they use it less.\nThe study is reported in the journal Developmental Psychology.","url":"https://www.dailymail.co.uk/sciencetech/article-3394030/Don-t-bother-sarcastic-older-people-won-t-understand-mean-Study-finds-sarcasm-lost-65s-literally.html"}
