{"authors":["Allen Reed","The Associated Press"],"date_download":"2018-10-30 18:43:46","date_modify":"2018-10-30 18:43:46","date_publish":"2015-07-06 04:02:00","description":"LITTLE ROCK — An Oklahoma Supreme Court ruling that will rid the Capitol grounds of a religious monument has simultaneously scuttled the plans of a group advocating for a Satanic statue there, and they now hope to enshrine the deity outside the Arkansas Statehouse.","filename":"data/vaneerConsumption/SatanicTempleseesArkansasaspossiblemonumentlocation.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_jul_06__1540925026.html","title":"Satanic Temple sees Arkansas as possible monument location","title_page":"Satanic Temple sees Arkansas as possible monument location ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"LITTLE ROCK — An Oklahoma Supreme Court ruling that will rid the Capitol grounds of a religious monument has simultaneously scuttled the plans of a group advocating for a Satanic statue there, and they now hope to enshrine the deity outside the Arkansas Statehouse.\nThe Satanic Temple, which advocates for the separation of church and state, spent more than $100,000 to design and construct an 8½-foot-tall bronze Baphomet, which depicts Satan as a goat-headed figure with horns, hooves, wings and a beard. With Oklahoma justices outlawing a Ten Commandments display from around its Capitol, The Satanic Temple has turned its attention to Arkansas, where lawmakers this year approved a similar Ten Commandments display on public land.\n\"It was always our intention to take this wherever it was relevant, wherever it was necessary, and wherever that dialogue needed to take place,\" said Lucien Greaves, a spokesman for the group, which is less about Satan worship and more about highlighting what it perceives to be improper religious influence on governments.\nThe 1½-ton figurine, backed by an inverted pentagram and flanked by statues of two young children gazing up at the creature, includes seating on Satan's lap. The group wanted to make its point by placing it in Oklahoma City but the Oklahoma Supreme Court last week ruled — in a case challenging the legality of the Ten Commandments on Capitol grounds —that the state constitution bars governments from doing anything to benefit a religion, either directly or indirectly. Justices said the Ten Commandments had obvious Jewish and Christian overtones that made the monument unconstitutional.\nThe U.S. Supreme Court had approved a similar Texas Ten Commandments monument but barred similar displays in two Kentucky courthouses. Arkansas and Oklahoma legislators have said the Ten Commandments were being presented for their historic, not religious, significance.\nGreaves said last week that the Baphomet is meant to symbolize plurality and religious liberty and is now needed alongside a Christian monument in a different state, most likely Arkansas.\nArkansas' Ten Commandments display could go up by the end of the year, joining 15 other monuments at the Capitol, said state Sen. Jason Rapert, who wrote the bill authorizing the monument. He dismissed the idea that his bill could inadvertently summon the demon.\n\"The Satanist Temple, or whoever these pagans are, are simply trying to draw attention to themselves and it's simply an outrageous gesture that flies in the face of the sensitivities of the people of the state of Arkansas,\" Rapert said. \"In my opinion, a lot of what they stand for is detestable to the everyday American and definitely to the everyday Arkansan.\"\nGreaves said the group, which will unveil the statue July 25 in Detroit, will decide later whether to apply for space outside the Arkansas Statehouse.\nSee Tuesday's Arkansas Democrat-Gazette for full coverage.","url":"https://www.arkansasonline.com/news/2015/jul/06/satanic-temple-sees-arkansas-possible-monument-loc/"}
