{"authors":["Associated Press"],"date_download":"2018-10-22 21:37:53","date_modify":"2018-10-22 21:37:53","date_publish":"2016-01-29 07:21:13","description":"MELBOURNE, Australia (AP) — With the kind of 2015 Serena Williams had, and her form so far at this Australian Open, it begs the question: Does it really matt...","filename":"data/vaneerConsumption/SaturdayattheAustralianOpen22ndmajorforWilliams.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:24f2f594b1554225abd88002d78597b0-3bmscybNe842cce83474b51e11ea-693_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420843_Day-12-Australian-Open-Murray-vs-Raonic-semifinal_1540244273.html","title":"Saturday at the Australian Open: 22nd major for Williams?","title_page":"Saturday at the Australian Open: 22nd major for Williams? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Saturday at the Australian Open: 22nd major for Williams?\nMELBOURNE, Australia (AP) — With the kind of 2015 Serena Williams had, and her form so far at this Australian Open, it begs the question: Does it really matter who's across the net from her in Saturday's final?\nAngelique Kerber is the only player who can answer that now.\nThe No. 7-ranked Kerber hopes to take inspiration from fellow German Steffi Graf, whose total of 22 majors in the Open era Williams could equal with a win at Rod Laver Arena on Saturday. Graf wished Kerber good luck in a message.\nSerena Williams of the United States speaks during a press conference, ahead of Saturday's women's singles final against Angelique Kerber of Germany at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Shuji Kajiyama)\nThe odds are certainly in Williams' favor: she's never lost a final in six previous attempts here. She also hasn't dropped a set in six matches this tournament, something she's never done in 15 previous appearances at Melbourne Park. And she's only lost 26 games in six matches.\nKerber faced a match point during a tiebreaker in her first-rounder against Japan's Misaki Doi, but won in three sets. She's won her other five matches in straight sets.\nHere's a look at the match-up, along with the men's doubles final that will follow the women's championship:\n____\nHEAD-TO-HEAD: Williams, as is the case with nearly all of the top 25 players, has a winning career record over Kerber, having won five of their six matches (newcomer Belinda Bencic is the exception, she and Williams are 1-1). Kerber and Williams haven't met in nearly 18 months. At Stanford, California on Aug. 3, 2014, they played in the Bank of the West Classic final, Williams' first tournament since her departure from Wimbledon because of equilibrium problems due a viral infection. Williams won 7-6 (1), 6-3 despite Kerber winning five straight games to go up 5-1 and serving for the first set at 5-2. \"I blinked my eye and I was down 1-5,\" Williams said. But Williams saved two set points and went to win five games in a row.\n____\nWILLIAMS ON KERBER: \"She took out a really tough opponent in Victoria (Azarenka, in the quarterfinals). She's been very consistent this year already. She's proven that she wants to take her game to the next level. I know she was talking about she wants to do better in the slams this year. To start out with a ... final already tells you that if she puts her mind to something, she's going to do it.\"\n___\nKERBER ON WILLIAMS: \"I have actually nothing to lose. But still I will go out there to try to challenge her, playing good tennis. I know that I won against her once, so I can beat her. But I must play my best I can play. I must be there from the first point and playing very deep ... play my game and be aggressive like she is.\"\n___\nON REACHING 22: Williams admitted Friday that the pressure of reaching Graf's 22 might have gotten to her in New York when she lost in the semifinals to Roberta Vinci. \"I was the favorite in New York,\" Williams said. \"I feel like I could have done better ... but that was a learning experience. So I'm going to hopefully take that to the court for not only this tournament but for the rest of these slams.\"\n___\nDOUBLES SUCCESS: Seventh-seeded Jamie Murray and Brazilian Bruno Soares, playing just their third event as a team, take on Daniel Nestor and Radek Stepanek in the men's doubles final. Both pairs are playing in their first major together. The Murray-Soares combo has done well, making the semifinals in Doha and winning the Sydney International title. \"We came here feeling good, playing seven matches and winning one title,\" says Soares. At Sydney, Nestor, into his 26th season on the ATP World Tour, became the first player to reach the 1,000-win mark in doubles. He has eight men's Grand Slam doubles titles and the 43-year-old Canadian will try to make it nine on Saturday.\nAngelique Kerber of Germany speaks during a press conference, ahead of Saturday's women's singles final against Serena Williams of the United States at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Shuji Kajiyama)\nSerena Williams of the United States celebrates after defeating Agnieszka Radwanska of Poland during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Rick Rycroft)","url":"https://www.dailymail.co.uk/wires/ap/article-3420843/Day-12-Australian-Open-Murray-vs-Raonic-semifinal.html"}
