{"authors":[],"date_download":"2018-10-22 22:29:18","date_modify":"2018-10-22 22:29:18","date_publish":"2014-06-09 16:27:47","description":"The saucy Broadway musical \"Carmen Jones\" is being revived decades after its debut in an unlikely place - Havana, Cuba.","filename":"data/vaneerConsumption/SaucyCarmenJonesMusicalGetsAMakeoverInHavana.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/494021/140606-luna-manzanares-carmen-2205_fa9dea86a1c91d28047091e714f1a44d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_saucy-carmen-jones-musical-gets-makeover-havana-n126351_1540247358.html","title":"Saucy 'Carmen Jones' Musical Gets A Makeover - In Havana","title_page":"Saucy 'Carmen Jones' Musical Gets A Makeover - In Havana ","title_rss":"NULL","source_domain":"nbcnews.com","text":"HAVANA, CUBA -- The saucy and sexy Carmen Jones is getting a makeover in an old warehouse that sits abandoned along the port of Havana.\nThe American musical, based on the beloved opera Carmen, was brought to Broadway by Oscar Hammerstein in 1943 and adapted to the silver screen a decade later by the director Otto Preminger. Now the newest adaption will have an all-Cuban cast and an adapted script that sets the story in pre-Revolutionary Cuba.\nTitled Carmen Jones—El Amor Cubano, the femme fatale in this latest version works in a cigar factory in a small town near Santiago, the place where Fidel Castro’s militantes were waging war against the dictator Fulgencio Batista. Carmen and her friends dream of leaving the squalor for the bright lights and glamour of the capital. Taking a page from the original story, Cuban Carmen has a fiery temper that gets her in trouble. Like the original, she too becomes infatuated with the young soldier assigned to guard her while pursuing a second love interest.\nThe Cuban musical brings together a creative team from various countries.\nStart with Music Director Alex Lacamoire, whose successes on- and off-Broadway include Wicked and High Fidelity. He won a Tony Award in 2008 and a 2009 Grammy for his work on In The Heights.\nMixing Broadway and opera with Cuban culture and the sounds of salsa, mambo, rhumba and cha cha cha was an “absolutely brilliant idea”, said Lacamoire. “It’s a chance to try something new but also do something that was familiar.”\nMixing Broadway and opera with Cuban culture and the sounds of salsa, mambo, rhumba and cha cha cha is an “absolutely brilliant idea,” according to one of the show's creators.\nBritish Theater director Christopher Renshaw, nominated for a Tony for The King and I, has directed all over the world. “This is truly a first,” Renshaw explained, noting that musicals rarely come to the Cuban stage.\nAnd the musical draws on top Cuban talent. Renowned choreographer Rocian Chavez has a strong corps of dancers catapulting and leaping through varied dance styles while playwright Norge Espinosa used his poetic skills in writing a Spanish-language script and lyrics.","url":"https://www.nbcnews.com/news/latino/saucy-carmen-jones-musical-gets-makeover-havana-n126351"}
