{"authors":["Jasmine Garsd"],"date_download":"2018-10-23 00:40:40","date_modify":"2018-10-23 00:40:40","date_publish":"2015-01-08 00:00:00","description":"The Portuguese term — which embodies a particular mix of melancholy, longing and loss — has no direct equivalent in English. But it does find full expression in bittersweet music.","filename":"data/vaneerConsumption/SaudadeAnUntranslatableUndeniablyPotentWord.json","image_url":"https://media.npr.org/assets/img/2014/02/27/gilberto-gil-luar-lp-warner-bros-records-1981-stereo-encarte-2477-mlb4796709450_082013-f_wide-cd86bc030a8e67ca6b480b86d077f90b9d435880.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_altlatino_2014_02_28_282552613_saudade-an-untranslatable-undeniably-potent-word_1540255240.html","title":"Saudade: An Untranslatable, Undeniably Potent Word","title_page":"Saudade: An Untranslatable, Undeniably Potent Word : Alt.Latino : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Saudade: An Untranslatable, Undeniably Potent Word\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\n(Editor's note: This is an encore presentation of a show we presented during Black History Month in February 2014 in which we discussed the African heritage of Brazilian music)\nI've always been fascinated that there are certain words with no direct equivalents in other languages. It goes to the idea that life is so varied and complex, it will spawn words as distinctive as snowflakes.\nThe natives of Tierra del Fuego, Argentina have the word mamihlapinatapai for a look shared between two people when both are wishing the other would do something neither wants to. In Thai there is greng-jai — when you don't want someone to do something for you because it would be a bother for him or her.\nPerhaps my favorite of these elusive words is saudade, a Portuguese and Galician term that is a common fixture in the literature and music of Brazil, Portugal, Cape Verde and beyond. The concept has many definitions, including a melancholy nostalgia for something that perhaps has not even happened. It often carries an assurance that this thing you feel nostalgic for will never happen again. My favorite definition of saudade is by Portuguese writer Manuel de Melo: \"a pleasure you suffer, an ailment you enjoy.\"\nSince it comes up so frequently in the music we listen to on our show, we decided to dig deeper. Joining us to explain the concept are two musical masterminds: jazz singer Luciana Souza and producer Beco Dranoff. Both do a great job of explaining what saudade means playing some of their favorite tracks.\nEven if you can't quite wrap your mind around the word saudade, you can certainly understand it through this music. And please, if you want to add to their explanation of what saudade is, tell us about your own saudade and your favorite songs on the topic in the comments section below.","url":"https://www.npr.org/sections/altlatino/2014/02/28/282552613/saudade-an-untranslatable-undeniably-potent-word"}
