{"authors":[],"date_download":"2018-10-22 21:13:48","date_modify":"2018-10-22 21:13:48","date_publish":"2014-05-06 13:28:41","description":"Saudi officials arrested some 62 militants actively plotting attacks on government targets, government says.","filename":"data/vaneerConsumption/SaudisQuashAlQaedaLinkedCellPlottingAttacksArrestDozens.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422971/140506-saudi-minister-mn-935_47614326b818203400b077546f76928f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_saudis-quash-al-qaeda-linked-cell-plotting-attacks-arrest-dozens-n98081_1540242828.html","title":"Saudis Quash Al-Qaeda-Linked Cell Plotting Attacks, Arrest Dozens","title_page":"Saudis Quash Al-Qaeda-Linked Cell Plotting Attacks, Arrest Dozens","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRIYADH, Saudi Arabia - Police in Saudi Arabia have quashed an al-Qaeda-linked cell with ties to Yemen and Syria planning attacks and assassinations throughout the country, officials said Tuesday.\nInterior Ministry spokesman Maj. Gen. Mansour al-Turki said some 62 members of the cell – including 59 Saudi militants, a Yemeni, a Pakistani and a Palestinian – were arrested and that authorities are hunting down 44 others.\nThe group was planning “wide scale assassinations” and attacks against government and foreign interests, the Interior Ministry said. It added that security forces had dismantled a factory to make explosives and seized about 1 million Saudi Riyals ($266,000).\nAl-Turki said suspicious activities on social networks led to the arrests but declined to elaborate.\nHe told reporters in Riyadh that members of the organization had links to extremist elements in Syria and Yemen, adding that the cell had made “direct” contact with the Islamist State of Iraq and the Levant, a brutal al-Qaeda breakaway group.\nSaudi Arabia is deeply concerned about the rise of al-Qaida linked militants in Syria and the threat of the ongoing civil war to regional stability.\nThe Kingdom –- which has been growing increasingly frustrated over the U.S.’s perceived inaction to end the crisis and arm the moderate opposition –- has sent billions in humanitarian aid and weaponry to the rebels.\n- Lubna Hussain","url":"https://www.nbcnews.com/news/world/saudis-quash-al-qaeda-linked-cell-plotting-attacks-arrest-dozens-n98081"}
