{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:59:36","date_modify":"2018-10-30 17:59:36","date_publish":"2015-06-10 20:11:32","description":"Saudi Arabia may lift a ban that requires women to receive permission from a man in order to travel. It is one of a few reforms being considered in the conservative Islamic kingdom. The International Business Times (IBT) suggests terrorism might ease the restrictive laws against women. |","filename":"data/vaneerConsumption/SaudiArabiaConsidersLiftingTravelBanonLoneWomen.json","image_url":"https://media.breitbart.com/media/2015/04/Woman-wearing-burqua-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_10__1540922376.html","title":"Saudi Arabia Considers Lifting Travel Ban on Lone Women","title_page":"Saudi Arabia Considers Lifting Travel Ban on Lone Women | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Saudi Arabia may lift a ban that requires women to receive permission from a man in order to travel. It is one of a few reforms being considered in the conservative Islamic kingdom. The International Business Times (IBT) suggests terrorism might ease the restrictive laws against women.\nAs of publication, any woman below 45 years old must “provide proof they have the approval of their male guardian or “mahram” before traveling, even locally, and that they are accompanied at all times.” A new campaign called “Your Passport, Your Identity” will dictate the need for a mahram “based on the reasons for travel, not age.” Major General Sulaiman Al-Yahya, the director of the Passport Department, said those who travel to the interior, justice, or social ministries will not need permission from a man.\nSome Saudi citizens did not approve of the announcement:\nOne user sarcastically proposes that new regulations should stipulate that a police officer travels with every Saudi woman, who should have an electronic chip that keeps track of her location implanted in her feet. He also proposes that the chip be connected to an electric detonator that automatically strikes her if she comes back to the hotel after 6 pm. #ضوابط_سفر_المرأة_السعودية ممكن أساعدكم باقتراحتي، أرجو ان تحوز على إعجاب جميع المتخلفين والمتطرفين: #صباح_الحياة pic.twitter.com/ZkzDyaagVm — Mozah S (@MozahsS) June 8, 2015 Another user suggests that only a woman who is afraid that her “debaucheries” would be exposed would stand against the new travel controls. https://twitter.com/Outlook22222/status/607845158638387200\nAl-Yahya also explained the new law allows women to “get passports issued and renewed without the approval of their parents or guardians.” He also hopes people will protect their passports, especially since the government might issue a plastic identification card with the passport. All of this will hopefully “prevent expatriates who run away from their sponsors, from coming back, unless they agree to return to their employers.” Al-Yahya said the moves will put an end to the black market.\nSaudi Arabia is one of the most oppressive countries in the world, with laws stating that women must be covered head to toe and cannot drive. Al-Yahya claimed the change came about to keep Saudi Arabia in line “with advanced countries.” However, Farah Abdulaziz Al-Sweel at IBT suggested recent terrorism attacks could also force the government to change their laws regarding women as a man disguised as a woman attempted to bomb a mosque last week. He dressed in a “niqab (face veil) and abaya (the requisite long black garment for women), he attempted to enter the women’s section of the mosque at the south entrance before being stopped and chased away.”\nShe said women in the kingdom did not need identification cards, but that changed in 2013 when the government passed a law that all citizens aged 15 and up must receive an ID card. It remained optional for those between 10 and 15. Late King Abdullah banned men from working in lingerie shops, which allowed more employment for women.\nAl-Sweel insisted her argument does not mean she supports the niqab ban in France or that she condemns women who choose to wear a veil:","url":"https://www.breitbart.com/national-security/2015/06/10/saudi-arabia-considers-lifting-travel-ban-on-lone-women/"}
