{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:39:05","date_modify":"2018-10-30 20:39:05","date_publish":"2016-03-25 02:54:55","description":"At least 50 members of the resurgent al-Qaeda branch in Yemen were killed in a U.S. airstrike in the mountains of southern Yemen, Reuters reports.","filename":"data/vaneerConsumption/SaudiCoalitionHouthisAgreeonApril10Ceasefire.json","image_url":"https://media.breitbart.com/media/2016/03/yemen-road-damage-from-airstrikes-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_24__1540931945.html","title":"Saudi Coalition, Houthis Agree on April 10 Ceasefire","title_page":"Yemen: Saudi Coalition, Houthis Agree on April 10 Ceasefire","title_rss":"NULL","source_domain":"breitbart.com","text":"At least 50 members of the resurgent al-Qaeda branch in Yemen were killed in a U.S. airstrike in the mountains of southern Yemen, Reuters reports, citing medics and a local official.\nThe Yemen-based al-Qaeda in the Arabian Peninsula (AQAP) is considered one of the deadliest offshoots of the terrorist group.\nAQAP has taken advantage of the bloody civil war in Yemen and has emerged as the strongest jihadist group in the country, while a U.S.-backed Saudi-led coalition has concentrated on combating Iran-allied Shiite Houthis and the West has focused on defeating the Islamic State (ISIS/ISIL).\nThe warring parties in Yemen have agreed to a nationwide ceasefire expected to start midnight on April 10, according to United Nations special envoy Ismail Ould Cheikh Ahmed.\nAhmed added that peace negotiations between the rival sides will take place in Kuwait beginning April 18.\n“There have already been several failed attempts to defuse the conflict in Yemen, which has drawn in regional rivals Saudi Arabia and Iran and triggered a humanitarian crisis in the country,” declares Al Jazeera.\nThe Saudi-led coalition has been fighting the Shiite Houthi rebels and their allies, forces loyal to former Yemeni President Ali Abdullah Saleh, since March 2015.\nMoreover, the Saudi alliance has also been trying to restore the internationally recognized government under Yemen’s current leader, President Abdu Rabbu Mansour Hadi.\nAmid the chaos, AQAP is enjoying a rapid resurgence, taking control of much of southern Yemen.\nReuters reports that the U.S. attack took place on Tuesday “as al Qaeda in the Arabian Peninsula (AQAP) recruits queued for dinner at the camp, west of the port city of Mukalla on Yemen’s south coast.”\nOn Tuesday, a statement issued by the Pentagon revealed that “dozens of AQAP fighters” had been killed in the airstrike, without specifically saying how many jihadists had been executed.\nReuters learned from Yemeni sources that “at least 50 people were killed and 30 wounded.”\nThat means that nearly everyone at the camp, which the Pentagon said “was being used by more than 70 AQAP terrorists,” was either killed or wounded.\nUnnamed residents told Reuters that the attack “set off huge fires inside the camp.”\n“We continue to assess the results of the operation, but our initial assessment is that dozens of AQAP fighters have been removed from the battlefield,” stated Peter Cook, the Pentagon press secretary. “This strike deals a blow to AQAP’s ability to use Yemen as a base for attacks that threaten U.S. persons, and it demonstrates our commitment to defeating [al Qaeda] and denying it safe haven.”\nAQAP has used Yemen to plot attacks against Western targets, including an attempt to blow up a U.S.-bound passenger plane in 2009.\nThe jihadist group also claimed responsibility for the attack on the Charlie Hebdo magazine in Paris that killed 12 people last year. However, some analysts claim the group’s role was “more inspirational than direct,” notes Reuters.\n“The United States has frequently targeted al Qaeda militants across Yemen with drone strikes, killing many prominent leaders of the group over the past few years,” it adds.","url":"https://www.breitbart.com/national-security/2016/03/24/u-s-strikes-al-qaeda-in-yemen-as-saudi-led-coalition-shiite-houthis-agree-on-april-10-ceasefire/"}
