{"authors":["Mia De Graaf","David Martosko","U.S. Political Editor In Des Moines","J. Taylor Rushing","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-22 20:39:21","date_modify":"2018-10-22 20:39:21","date_publish":"2016-01-29 02:43:43","description":"Dragging out his spat with Fox News, the GOP frontrunner retweeted a meme of Megyn Kelly photoshopped next to a picture of Prince Alwaleed bin Talal of Saudi Arabia.","filename":"data/vaneerConsumption/SaudiArabianprinceAlwaleedbinTalalslamsDonaldTrumponTwitter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2763500000578-0-image-a-2_1454072942527.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422127_Need-bail-time-Saudi-Arabian-prince-slams-Donald-Trump-Twitter-GOP-frontrunner-mocked-Fox-News-ties-monarch_1540240761.html","title":"Saudi Arabian prince Alwaleed bin Talal slams Donald Trump on Twitter","title_page":"Saudi Arabian prince Alwaleed bin Talal slams Donald Trump on Twitter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump got into a Twitter fight with the Saudi Royal Family on Thursday.\nDragging out his spat with Fox News, the GOP front-runner retweeted an image of news anchor Megyn Kelly, Photoshopped into to a picture of Prince Alwaleed bin Talal of Saudi Arabia and his sister.\n'Most people don't know that the co-owner of Fox News is Prince Al-Waleed of Saudi Arabia here with his sister and with host Mygan [sic] Kelly,' it read. 'In case you only watch Fox News and you missed it everywhere else.'\nWithin hours, the monarch hit back pointing out that the photo is a fake – and that Trump could have been in financial disaster if it hadn't been for him.\nBut during a brief interview on his plane in Des Moines, Iowa, Trump insisted the Saudi is the one who needs financial bailouts, and said he's never liked the man – before admitting the two have never met.\nDragging out his spat with Fox News on Thursday, the GOP frontrunner retweeted this meme of Megyn Kelly photoshopped next to a picture of Prince Alwaleed bin Talal of Saudi Arabia\nWithin hours, the monarch hit back pointing out that the photo is a mock-up - and that Trump could have been in financial disaster if it hadn't been for him\n'NEVER MET HIM': Donald Trump said aboard his private Boeing 757 in Des Moiens, Iowa, that he's never liked Saudi Prince Alwaleed bin Talal – but then admitted the two men have never met\n'Trump:You base your statements on photoshopped pics?I bailed you out twice;a 3rd time,maybe?,' Alwaleed, the 34th richest person in the world, tweeted at him on Thursday.\nIndeed, in 1991, when Donald Trump was in debt, Alwaleed bought the real estate mogul's yacht Trump Princess - a former James Bond prop - for $281 million.\nIn 1995, the prince bought a majority stake in the Plaza Hotel as Trump was sinking into bankruptcy.\nAboard his Boeing 757, parked on the tarmac in Des Moines, DailyMail.com asked The Donald about Alwaleed's claim that he had rescued him financially.\n'No, no,' Trump insisted. 'He didn't bail me out. Let me tell you – he needs bailing out right now, if you look at where he's going. He needs bailing out. He needs big bailouts.'\n'Nope. Never been a fan of his. Never been a fan. Never liked him.'\nAsked if he had ever met Alwaleed personally, the man on whom he had just heaped a helping of billionaire scorn, Trump paused for a moment.\n'No. Never liked him. Never met him,' he said.\n'Don't know him, just never liked him. Never liked his style.'\nIt is not the first time Trump and Alwaleed have exchanged blows online.\nIt is not the first time Trump and Alwaleed have exchanged blows online. This was in December\nSaudi Prince Alwaleed bin Talal is pictured in August 2011. He says he bailed Trump out twice by buying his distressed properties\nIn December, Alwaleed called Donald Trump a disgrace to the United States following his call for a ban on Muslims entering the country, and demanded the Republican front-runner withdraw from the U.S. presidential race.\nTrump triggered an international uproar when he made his comments in response to last week's deadly shootings in California by two Muslims who authorities said were radicalized.\n'You are a disgrace not only to the GOP but to all America,' Prince Alwaleed, the chairman of Kingdom Holding, said on his Twitter account, addressing Trump and referring to the Republican Party.\n'Withdraw from the U.S presidential race as you will never win,' the prince, who is worth $24.9 billion added.\nWithin hours, Trump - who started his career with support from his family - hit back on Twitter.\n'Dopey Prince @Alwaleed_Talal wants to control our U.S. politicians with daddy's money,' he said. 'Can't do it when I get elected.'\nThe latest spat with Alwaleed comes a day after retweeted another meme about Megyn Kelly, criticizing her for posing for GQ magazine.\nRepublican presidential front-runner Donald Trump tweeted this message (above and below) on Thursday morning\nTrump sent out a message on his Twitter page at 6.36am on Wednesday that shows Kelly's pictures for the men's magazine.\n'And this is the bimbo that's asking presidential questions?', the tweet said, with two provocative poses of Kelly: 'Criticizes Trump for objectifying women ... Poses like this in GQ Magazine.'\nTrump has cited his long-running feud with Kelly as his reason for skipping Thursday night's prime-time Republican debate on Fox, just four days before the critical Iowa caucuses.\nTrump is locked in a close contest in Iowa with Texas Sen. Ted Cruz, with the latest average of major polls showing Trump just 6.5 percentage points ahead, according to Real Clear Politics.\nThe Trump-Kelly feud has grown so intense to Trump that he plans to hold a competing event, benefiting veterans, in Des Moines at the same time as the debate.\nOn Wednesday, Trump criticized Kelly again in an interview with Fox News host Bill O'Reilly, arguing that she was biased against him.\nThe GOP race-leader has sent out numerous tweets criticizing Kelly ever since last August, when the reporter tried to pin him down on allegations of misogyny during the first Republican presidential debate.\nTrump bristled at the debate, but really let fly online, shortly thereafter accusing her of menstruating during the debate - a comment he later said was misinterpreted.\nThe back-and-forth continued up until Wednesday, when Trump shut the door on appearing at the Fox-hosted debate, claiming that the network was biased against him.\nTexas Sen. Ted Cruz, at left, is battling Trump for the GOP nomination in a close contest in Iowa\nHowever, on Thursday Trump caught flak from his own Twitter followers for his post.\n'I am mortified that you would retweet this,' wrote one follower. 'This is so wrong on multiple levels.'\nAnother follower wrote, 'And this is the man who wants to lead the USA?'\nSome of Trump's other followers posted racy pictures for which his own wife Melania has posed, suggesting that the tycoon was a hypocrite.","url":"https://www.dailymail.co.uk/news/article-3422127/Need-bail-time-Saudi-Arabian-prince-slams-Donald-Trump-Twitter-GOP-frontrunner-mocked-Fox-News-ties-monarch.html"}
