{"authors":[],"date_download":"2018-10-23 03:48:46","date_modify":"2018-10-23 03:48:46","date_publish":"2017-04-26 15:21:29","description":"The Saudi coast guard fired on an unmanned boat rigged with explosives, thwarting an attack on one of the kingdom's oil terminals that authorities on...","filename":"data/vaneerConsumption/SaudifirestopsrebelboatbombfromYemen.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465731-1493216491-687_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4448050_Saudi-fire-stops-rebel-boat-bomb-Yemen_1540266526.html","title":"Saudi fire stops 'rebel boat bomb' from Yemen","title_page":"Saudi fire stops 'rebel boat bomb' from Yemen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Smoke billows in the distance following a reported air strike carried out by the Saudi-led coalition in the Yemeni capital Sanaa on October 5, 2016\nThe Saudi coast guard fired on an unmanned boat rigged with explosives, thwarting an attack on one of the kingdom's oil terminals that authorities on Wednesday blamed on Yemeni Huthi rebels.\nThe boat, sent from a small island off the Yemeni coast, was targeting a petroleum products distribution terminal run by Saudi oil giant Aramco when it was intercepted on Tuesday, the interior ministry said in a statement carried by the SPA state news agency.\n\"The boat was spotted when it departed from a small island in Yemeni waters and gained speed after entering Saudi waters,\" the ministry said.\nAfter determining that the boat was unmanned, a coast guard unit opened fire on its engine and stopped it 1.5 miles (2.8 kilometres) from the terminal in the southern region of Jazan, the statement said.\nThe boat was loaded with \"strong explosive material,\" it said.\nThe ministry vowed to foil all \"terrorist attempts\" against the kingdom and to \"reach those behind them from the Huthi militias.\"\nIt accused the rebels of \"threatening the security of waterways and offshore installations with explosive-laden boats and naval mines.\"\nSaudi Arabia is leading an Arab coalition that in March 2015 launched a military campaign against Iran-backed Yemeni rebels in support of President Abedrabbo Mansour Hadi.\nHuthi rebels aided by renegade troops loyal to former president Ali Abdullah Saleh repeatedly fire missiles across the borders with the kingdom, but this is the first attempt of kind to target an oil installation.\nIn August, the rebels claimed to have hit an Aramco facility with a missile, but the oil company said all its installations were operating as normal.\nTwo Saudi sailors were killed in a rebel \"suicide\" boat strike on a frigate patrolling off the Yemeni coast in January, the coalition said at the time. The rebels said they hit the ship with a guided missile.\nMore than 7,700 people have been killed in the past two years of fighting in Yemen, the UN says.","url":"https://www.dailymail.co.uk/wires/afp/article-4448050/Saudi-fire-stops-rebel-boat-bomb-Yemen.html"}
