{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:51:55","date_modify":"2018-10-30 20:51:55","date_publish":"2016-12-22 02:43:08","description":"Saudi Arabia has been lobbying American lawmakers to change the bipartisan law that allows the families of 9/11 victims to sue the country.","filename":"data/vaneerConsumption/SaudiForeignMinister911LawsuitBillAGraveDangertotheInternationalSystem.json","image_url":"https://media.breitbart.com/media/2016/12/twin-towers-9-11-01-new-york-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_21__1540932715.html","title":"Saudi Foreign Minister: 9/11 Lawsuit Bill 'A Grave Danger to the International System'","title_page":"Saudi Foreign Minister: 9/11 Lawsuit Bill 'A Grave Danger to the International System' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Sunni kingdom of Saudi Arabia has been lobbying American lawmakers to change the bipartisan law that allows the families of 9/11 victims and survivors of the tragedy to sue the Gulf Arab country in U.S. courts for any role it may have played in the 2001 attacks that killed nearly 3,000 people on American soil.\nUnder the law, the survivors and relatives of the victims are able to demand compensation if the Saudi government is proven to bear some responsibility for the deadly September 11, 2001, attacks that have left a scar on the American soul.\nOn Sunday, Saudi Foreign Minister (FM) Adel al-Jubeir revealed that he has been trying “to persuade” U.S. lawmakers “that there needs to be an amendment” to the Justice Against Sponsors of Terrorism Act (JASTA). He made the remark at a joint press conference with visiting U.S. Secretary of State John Kerry, reports Agence France-Presse (AFP).\n“We believe the law, that curtails sovereign immunities, represents a grave danger to the international system,” also said the the Saudi FM, adding, “The United States is, by eroding this principle [sovereign immunity], opening the door for other countries to take similar steps and then before you know it international order becomes governed by the law of the jungle.”\nLeaders of the GOP-controlled Congress, namely Senate Majority Leader Mitch McConnell (R-KY) and House Speaker Paul Ryan (R-WI), have indicated they are open to rewriting the bill, expressing buyer’s remorse soon after the bill became law in September.\n“The question now becomes how do you go about amending the law,” declared Jubeir on Sunday, without explicitly outlining what the amendment would entail.\nIn a rare show of bipartisanship, Congress enacted JASTA into law in September despite President Barack Obama’s veto, which lawmakers managed override, marking the first and only time Congress has quashed a veto from the sitting president.\nThe Gulf Cooperation Council (GCC), a six-nation coalition of Gulf Arab states that includes Saudi Arabia as its most powerful member, denounced the bill’s passage, saying it “contravenes” sovereign immunity and “will create a grave precedent.”\nSaudi Arabia and its allies threatened to retaliate against the United States over the law by curtailing economic relations and scaling back counterterrorism cooperation.\nVarious experts have warned that Saudi Arabia and its allies have the ability to “reduce valuable security and intelligence cooperation with longstanding ally Washington,” according to AFP.\nJASTA “will have negative effects on international cooperation in the fight against terrorism,” warned Sheikh Abdullah bin Zayed al-Nahyan, foreign minister of Saudi ally and GCC member the United Arab Emirates (UAE).\nThe White House and the Pentagon have warned the contentious bill would place U.S. troops and interests at risk by opening up the United States to private lawsuits over its military operations abroad.\nAccording to the Saudi FM, the United States would suffer the most from the erosion of sovereign immunity at the hands of JASTA.\nOf the 19 al-Qaeda plane hijackers who carried out the 9/11 attacks, 15 considered Saudi Arabia their home.\nHowever, the kingdom has denied any official ties to the 15 Saudi jihadis, notes the Saudi news outlet Al Arabiya.","url":"https://www.breitbart.com/national-security/2016/12/21/saudi-kingdom-urges-u-s-change-bipartisan-911-bill-allows-victims-sue-gulf-arab-nation/"}
