{"authors":[],"date_download":"2018-10-30 20:43:09","date_modify":"2018-10-30 20:43:09","date_publish":"2015-03-26 04:29:32","description":"SANAA, Yemen (AP) — Saudi Arabia bombed key military installations in Yemen on Thursday after announcing a broad regional coalition to oust Shiite rebels","filename":"data/vaneerConsumption/SaudiairstrikestargetrebelbasesinYemen.json","image_url":"https://media.breitbart.com/media/2015/03/ap_ap-photo1226-1024x701.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540932189.html","title":"Saudi airstrikes target rebel bases in Yemen","title_page":"Saudi airstrikes target rebel bases in Yemen - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SANAA, Yemen (AP) — Saudi Arabia bombed key military installations in Yemen on Thursday after announcing a broad regional coalition to oust Shiite rebels that forced the country’s embattled president to flee. Some of the strikes hit positions in the country’s capital, Sanaa, and flattened a number of homes near the international airport.\nThe airstrikes, which had the support of nine other countries, drew a strong reaction from Iran which called the operation an “invasion” and a “dangerous step” that will worsen the crisis in the country.\nIran “condemns the airstrikes against Yemen this morning that left some innocent Yemenis wounded and dead and considers this action a dangerous step,” Foreign Ministry spokeswoman Marzieh Afkham said in a statement. She said military action would complicate and worsen the crisis in Yemen.\n“This invasion will bear no result but expansion of terrorism and extremism throughout the whole region,” she said.\nThe Saudi airstrikes came hours after President Abed Rabbo Mansour Hadi, a close U.S. ally, fled Yemen by sea after rebels pushed their way toward the southern port city of Aden where he had taken refuge.\nThe back-and-forth between the regional heavyweights was threatening to turn impoverished Yemen into a proxy battle between the Middle East’s Sunni powers and Shiite-led Iran.\nSaudi-owned Al-Arabiya News reported that the kingdom had deployed 100 fighter jets, 150,000 soldiers and other navy units in “Operation Decisive Storm.”\nThe Shiite rebels, known as Houthis, were calling on their supporters to protest in the streets of Sanaa on Thursday afternoon, Yemen’s Houthi-controlled state news agency SABA reported. TV stations affiliated with the rebels and their ally, former President Ali Abdullah Saleh, showed the aftermath of the strikes Thursday morning in what appeared to be a residential area.\nAl-Masirah TV, affiliated with the Houthis, quoted the ministry of health as saying that 18 civilians were killed and 24 were injured.\nYemen Today, a TV station affiliated with Saleh, showed hundreds of residents congregating around a number of flattened houses, some chanting “Death to Al-Saud”, in reference to the kingdom’s royal family. The civilians were sifting through the rubble, pulling out mattresses, bricks and shrapnel.\nAn Associated Press reporter on the scene in the Sanaa neighborhood near the international airport saw people searching for loved ones in the debris of flattened homes. Residents said at least three bodies were pulled from the rubble. There were traces of blood between the bricks.\nAhmed al-Sumaini said an entire alley close to the airport was wiped out in the strikes overnight. He said people ran out from their homes in the middle of the night. “This was a surprise. I was asleep and I was jolted out of my bed,” he said, waving a piece of shrapnel.\nIn addition to the airport, targets included the camp of U.S.-trained Yemeni special forces, which is controlled by generals loyal to Saleh. Yemeni security officials said the targets also included a missile base in Sanaa that was controlled by the Houthis earlier this year. One of the security officials said the strikes also targeted the fuel depot at the base.\nThe Houthis said in a statement that Saudi jets hit the military base, known as al-Duleimi, and that they responded with anti-aircraft missiles.\nThe strikes also hit the al-Annad air base in the southern Lahj province. About 100 U.S. military advisers withdrew over the weekend from base, where they had been leading a drone campaign against al-Qaida in the Arabian Peninsula, or AQAP.\nThe crumbling of Hadi’s government is a blow to Washington’s counterterrorism strategy against al-Qaida’s branch in Yemen, considered to be the most powerful in the terrorist network.\nThe security officials spoke on condition of anonymity, because they were not authorized to brief journalists.\nRiad Yassin, Yemen’s foreign minister, told Saudi’s Al-Hadath TV that the airstrikes were welcomed.\n“I hope the Houthis listen to the sound of reason. With what is happening, they forced us into this,” he said.\nSaudi ambassador to the United States Adel al-Jubeir announced the military operation in a news conference in Washington. He said his government had consulted closely with the U.S. and other allies but that the U.S. military was not involved in the operations.\nThe White House said in a statement late Wednesday that the U.S. was coordinating military and intelligence support with the Saudis but not taking part directly in the strikes.\nOther regional players were involved in the Saudi operation: The United Arab Emirates, Kuwait, Qatar and Bahrain joined Saudi Arabia in a statement published by the Saudi Press Agency, saying they would answer a request from Hadi “to protect Yemen and his dear people from the aggression of the Houthi militias which were and are still a tool in the hands of foreign powers that don’t stop meddling with the security and stability of brotherly Yemen.” Oman, the sixth member of the Gulf Cooperation Council, didn’t sign onto the statement.\nOn a Thursday conference call with foreign ministers from the council, Secretary of State John Kerry commended the work of the coalition’s military action against the Houthis, according to a State Department official traveling with Kerry in Lausanne, Switzerland. Kerry noted U.S. support for coalition efforts, including intelligence sharing and logistical support for strikes against Houthi targets, said the official, who spoke on the condition of anonymity to discuss a private diplomatic call.\nEgypt announced political and military support, saying it is ready to send ground troops if necessary. Jordan confirmed it was participating in the operation. Pakistan, Morocco and Sudan were also taking part, the Saudi Press Agency reported Thursday.\nSaudi Arabia and its Gulf allies believe the Houthis are tools for Iran to seize control of Yemen and say they intend to stop the takeover. The Houthis deny they are backed by Iran.\nYemen now faces fragmentation, with Houthis controlling much of the north, including the capital of Sanaa, and several southern provinces. In recent days, they took the third-largest city, Taiz, as well as much of the province of Lahj, both just to the north of Aden.\nThe Houthis are backed by Saleh, the autocrat who ruled Yemen for three decades until he was removed amid a 2011 Arab Spring uprising. Some of the best-equipped and trained military and security units remained loyal to Saleh and they have helped the Houthis in their rapid advance.\nHadi left Sanaa for Aden earlier this month after escaping house arrest under the Houthis, who overran the capital six months ago. In Aden, he had sought to make a last stand, claiming it as the temporary seat of what remained of his government, backed by allied militias and loyal army units.\nWith Houthis and Saleh forces closing in on multiple fronts, Hadi and his aides left Aden Wednesday on two boats in the Gulf of Aden, security and port officials told AP. The officials would not specify his destination.\nArab leaders are meeting in Egypt this weekend for a pre-planned summit. It is unclear if Hadi will join them.","url":"https://www.breitbart.com/news/saudi-airstrikes-target-rebel-bases-in-yemen/"}
