{"authors":["Breitbart News"],"date_download":"2018-10-30 20:46:34","date_modify":"2018-10-30 20:46:34","date_publish":"2015-12-16 15:53:02","description":"At the heart of Korea’s Onsan Refinery lies a street called “A.I. Naimi Road,” an homage to Saudi Arabia’s oil minister.","filename":"data/vaneerConsumption/SaudiArabiaInvestingMillionsintoCourtingAsiatoBuyItsOil.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_16__1540932394.html","title":"Saudi Arabia Investing Millions into Courting Asia to Buy Its Oil","title_page":"Saudi Arabia Investing Millions into Courting Asia to Buy Its Oil | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This story originally appeared at Bloomberg:\nAt the heart of Korea’s Onsan Refinery lies a street called “A.I. Naimi Road,” an homage to Saudi Arabia’s oil minister. The reason: state-owned Saudi Arabian Oil Co. holds a 65 percent stake in the complex.\nTaking a controlling interest last year in South Korea’s third-largest refinery highlights the shifting dynamics of the oil business. With crude prices down by more than half in the past two years, the Saudis and other oil-rich countries are fighting to lock in customers. Asia, which now accounts for 70 percent of Saudi oil exports, is the primary battleground.\nFor Saudi Aramco, as the company is widely known, that means purchasing stakes in refineries, with contracts guaranteeing most of the oil will come from the kingdom. Aramco has invested in three processing facilities in Asia. As Iran prepares to boost its own exports, the Saudis are on the cusp of a dramatic increase in its commitment to the region, eyeing billions of dollars of projects in countries from Indonesia to Vietnam.\nOwning refineries in Asia is “part of a long-term strategy to consolidate” the Saudi market share in a key region, said Mustafa Ansari, an analyst at the Arab Petroleum Investment Corp., a state-controlled development bank in Dammam, the city at the heart of Saudi oil country.\nThe Saudis pursued a similar path in the U.S. three decades ago to lock in sales as crude prices tumbled, buying into three oil-processing facilities in Texas and Louisiana since 1988. The strategy worked: Motiva Enterprises LLC, the U.S. refiner half-owned by Aramco, imported 65 million barrels of Saudi oil in the first eight months of 2015 — more than triple what ExxonMobil Corp. got from the kingdom in that time, U.S. government data show.\nRead the full story at Bloomberg.","url":"https://www.breitbart.com/national-security/2015/12/16/saudi-arabia-investing-millions-into-courting-asia-to-buy-its-oil/"}
