{"authors":["Jackie Northam"],"date_download":"2018-10-22 21:52:12","date_modify":"2018-10-22 21:52:12","date_publish":"2015-03-27 00:00:00","description":"Airstrikes and anti-aircraft fire rocked the capital, Sanaa, while Houthi rebels continued their push into southern Yemen. Meanwhile, Arab foreign ministers gathered in Egypt.","filename":"data/vaneerConsumption/SaudiArabiaPoundsRebelTargetsInYemenOn2ndDayOfAirCampaign.json","image_url":"https://media.npr.org/assets/img/2015/03/27/ap954194161741_wide-89ec012a1c77f0e3aa9b34e2fbf013165b678435.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_03_27_395773579_saudi-arabia-pounds-rebel-targets-in-yemen-on-2nd-day-of-air-campaign_1540245132.html","title":"Saudi Arabia Pounds Rebel Targets In Yemen On 2nd Day Of Air Campaign","title_page":"Saudi Arabia Pounds Rebel Targets In Yemen On 2nd Day Of Air Campaign : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Saudi Arabia Pounds Rebel Targets In Yemen On 2nd Day Of Air Campaign\nEnlarge this image toggle caption Hani Mohammed/AP Hani Mohammed/AP\nSaudi Arabia unleashed another round of airstrikes today on its southern neighbor, Yemen. The warplanes targeted Houthi rebel targets, including air bases, in a bid to neutralize the militants' air defenses.\nExplosions rocked the capital, Sanaa, and anti-aircraft guns could be heard returning fire, according to The Associated Press.\nYemen's foreign minister, Riad Yassin, told the BBC that a \"short, sharp\" campaign was needed to weaken the rebels and that the airstrikes should end as soon as possible. He said he did not know if Arab leaders would launch a ground offensive in Yemen, which coalition members have said they are prepared to do if the airstrikes fail to stop the rebels' advance and force them to negotiate.\nThe British broadcaster says rebel leader, Abdul Malik al-Houthi, has vowed not to surrender to the \"unjustified aggression\" of the Saudi-led coalition.\nDespite the intense air campaign, Houthi rebels and forces allied to former President Ali Abdullah Saleh continued their push into southern Yemen, according to Reuters.\nEight other Arab nations are involved in \"Operation Decisive Storm.\" Foreign Policy says a surprising feature of the operation is the number and size of the commitment to the coalition.\nThe online magazine says the Saudis are reportedly contributing 100 fighter jets and 150,000 soldiers, along with naval units. Bahrain and Kuwait are reportedly deploying 15 fighter jets; Qatar, Jordan, even Sudan are offering warplanes; and Egypt is offering troops if a ground offensive becomes necessary. The White House says it is providing intelligence and targeting support for the airstrikes.\nForeign Policy says the contributions involved in action against militants from the self-declared Islamic State in Syria have been paltry in comparison.\nMeanwhile, Yemeni President Abd Rabbu Mansour Hadi is expected to arrive in the Egyptian resort of Sharm El-Sheikh later today for an Arab League Summit. Hadi fled Yemen by boat earlier this week after Houthi rebels closed in on his palace in the southern port city of Aden. He is finding refuge in the Saudi capital, Riyadh.","url":"https://www.npr.org/sections/thetwo-way/2015/03/27/395773579/saudi-arabia-pounds-rebel-targets-in-yemen-on-2nd-day-of-air-campaign"}
