{"authors":[],"date_download":"2018-10-23 01:26:16","date_modify":"2018-10-23 01:26:16","date_publish":"2017-04-26 11:51:23","description":"A recent Saudi government and security shake-up aims to strengthen King Salman's increasingly powerful son against a royal rival and to bolster ties with...","filename":"data/vaneerConsumption/Saudishakeupstrengthenskingspowerfulson.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464645-1493203885-413_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447254_Saudi-shake-strengthens-kings-powerful-son_1540257976.html","title":"Saudi shake-up strengthens king's powerful son","title_page":"Saudi shake-up strengthens king's powerful son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Saudi Deputy Crown Prince Mohammed bin Salman (C) attends a meeting with US Defence Secretary Jim Mattis in Riyadh on April 19, 2017\nA recent Saudi government and security shake-up aims to strengthen King Salman's increasingly powerful son against a royal rival and to bolster ties with Washington, analysts and diplomats say.\nRoyal decrees at the weekend saw a number of allies of Deputy Crown Prince Mohammed bin Salman moved into key positions and another son of the king named as ambassador to Washington.\nThe goal, a foreign diplomat told AFP, is \"to strengthen MBS (Mohammed bin Salman) and the Salman branch\" of the al-Saud family which has ruled Saudi Arabia since the country's founding.\nMohammed bin Salman, 31, has risen to prominence since he was named deputy crown prince two years ago, a few months after his father took the throne following the death of King Abdullah.\nThe king's nephew Mohammed bin Nayef, now 57, was at the same time named crown prince and is the heir apparent.\nReports of rivalry between the two have spread since, with the bearded Mohammed bin Salman seen in the ascendant.\nHe already serves as defence minister, head of Saudi Arabia's main economic policy coordinating body and chairman of a council overseeing state oil giant Aramco.\nOne of the weekend decrees saw the creation of a new National Security Centre linked with the royal court.\n- 'Competition' over security -\nDetails of how the new centre will operate have yet to emerge, but the foreign diplomat said its creation reflects \"competition\" for succession between Mohammed bin Salman and Mohammed bin Nayef, who is interior minister and heads an existing body, the Political and Security Council.\nAnother decree also named a new national security advisor, Mohammed bin Salih Alghfaili, who foreign diplomats say will play a lead role on the council.\nHe too is linked with Mohammed bin Salman and the new arrangement shows that the crown prince \"is losing his power,\" a second foreign diplomat said.\nBoth diplomats declined to be named because of the sensitivity of royal leadership matters.\nSaudi Crown Prince and Interior Minister Mohammed bin Nayef (R) inspects Saudi forces during a military parade in the Muslim holy city of Mecca in September 2016\nAnother decree named Major General Ahmed Assiri, who the diplomats said is also a loyalist of the defence minister, as deputy chief of the General Intelligence Presidency.\nPeter Salisbury, a research fellow at London's Chatham House, told AFP that the various moves appear \"a lot like Mohammed bin Salman has taken another step towards consolidating his control over the security services\".\nSecurity matters are especially important to Mohammed bin Nayef, who made his name and won wide respect abroad for having led Saudi efforts against Al-Qaeda and other jihadists.\nAnalysts and diplomats said other moves made at the weekend appeared aimed not only at boosting King Salman's branch among the thousands-strong royal family but at continuing to improve ties with longtime ally Washington.\nKing Salman named another son, Prince Abdulaziz bin Salman, as state minister for energy affairs, and one more, Prince Khaled bin Salman, as ambassador to Washington.\n- Building US ties -\nThe new ambassador Prince Khaled, believed to be younger than 30, is a former fighter pilot who flew missions as part of the US-led coalition bombing the Islamic State group in Syria and Iraq.\nAnother change saw Fahad bin Turki, a former head of the Saudi special forces, promoted to lieutenant general to head the army.\nThese appointments appear to involve people \"well-placed... to build relationships with senior military and administration officials in the US,\" Salisbury said.\nTies between Riyadh and Washington became increasingly frayed during the administration of president Barack Obama.\nRiyadh has found a more favourable ear in the Washington of President Donald Trump, who has echoed Saudi concerns about Iranian influence in the region.\nMohammed bin Salman met Trump in Washington last month, a visit followed last week by US Defence Secretary Jim Mattis's trip to Riyadh.\nKey for Riyadh will be US support for the Saudi-led coalition that for two years has been fighting in support of Yemen's government against rebels supported by Iran, Saudi Arabia's regional rival.\nSaudi Deputy Crown Prince Mohammed bin Salman met with US President Donald Trump at the White House in March 2017\nThe United States has backed the coalition with intelligence, weapons, and aerial refuelling for its warplanes, but Obama's government in December blocked the transfer of precision-guided bombs because of concerns over civilian casualties.\nUnder Obama, \"things were really bad\" between the two countries, the second diplomat said.\nSaudi officials realised that \"they cannot survive on their own\" and must depend on American security support, he said.","url":"https://www.dailymail.co.uk/wires/afp/article-4447254/Saudi-shake-strengthens-kings-powerful-son.html"}
