{"authors":[],"date_download":"2018-10-22 20:54:56","date_modify":"2018-10-22 20:54:56","date_publish":"2014-06-03 15:48:26","description":"Saudi Officials say a search of old records has turned up more than 100 unreported cases of MERS.","filename":"data/vaneerConsumption/SaudiOfficialsFindExtraMERSCases.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/436656/140512-mers-camels-saudi-arabia-1245p_f6721e643ef3c563b8527e081a264bdd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_mers-mystery_saudi-officials-find-extra-mers-cases-n121341_1540241696.html","title":"Saudi Officials Find 'Extra' MERS Cases","title_page":"Saudi Officials Find 'Extra' MERS Cases","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSaudi officials said Tuesday they had found 113 more cases of the deadly MERS virus in old medical records — and more than 90 extra deaths.\nOfficials also announced they had fired the deputy health minister, Dr. Ziad Memish, who had been heading the kingdom’s MERS efforts.\nIt wasn’t immediately clear what either announcement meant, but U.S. and World Health Organization health experts have been trying to pressure Saudi Arabia to share more information about MERS, and to accept outside help in its efforts to fight the virus.\nThe new numbers bring the total Saudi toll from MERS to 282 deaths out of 688 cases, making for a 40 percent fatality rate.\n“Acting Health Minister Adel Faqeeh has issued a decision today to relieve Deputy Health Minister Dr. Ziad Memish from his position,” the Saudi health ministry said in a statement posted on its website.\nIn April, Saudi Health Minister Abdullah Al Rabeeah lost his job.\nThe Middle East Respiratory Syndrome virus first emerged in 2012, and while it’s spread to nearly two dozen countries, including the United States, the World Health Organization says it’s not a global health emergency yet.\nWHO and other experts agree that studies are desperately needed on how much of the population is infected with MERS, especially in Saudi Arabia, where the vast majority of cases have been. MERS is a coronavirus, in the same family of viruses as many common cold viruses, and it’s possible that people can be infected and get symptoms no worse than a sniffle.\nTwo health care workers who had been working in Saudi hospitals carried the virus to the U.S. in recent weeks, but both have recovered and have not appeared to have infected anyone else. The Centers for Disease Control and Prevention feared one man was infected by one of the travelers, but later said new tests showed he had not been.\nWHO has been unusually frank about Saudi Arabia’s struggle to stop the virus, saying hospitals are not always properly implementing infection control measures.\nReuters contributed to this article.","url":"https://www.nbcnews.com/storyline/mers-mystery/saudi-officials-find-extra-mers-cases-n121341"}
