{"authors":["Associated Press"],"date_download":"2018-10-22 23:52:52","date_modify":"2018-10-22 23:52:52","date_publish":"2017-04-26 08:45:24","description":"ABU DHABI, United Arab Emirates (AP) - A Saudi novelist won what is considered to be the region's top literary award for Arab fiction for a book about the...","filename":"data/vaneerConsumption/SaudinovelistwinsprestigiousprizeforArabfiction.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/09/wire-464075-1493195134-234_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446688_Saudi-novelist-wins-prestigious-prize-Arab-fiction_1540252372.html","title":"Saudi novelist wins prestigious prize for Arab fiction","title_page":"Saudi novelist wins prestigious prize for Arab fiction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ABU DHABI, United Arab Emirates (AP) - A Saudi novelist won what is considered to be the region's top literary award for Arab fiction for a book about the trials and tribulations of a man on a journey of self-revelation through Andalusia in the 12th century during a turbulent period of history.\nMohammed Hasan Alwan was awarded the International Prize for Arab Fiction in Abu Dhabi on Tuesday evening, the 10th annual winner of the prize.\nAlwan received a $50,000 cash prize and will get to have his book translated into English under the title \"A Small Death.\" His book was selected from more than 180 novels from 19 countries. Five shortlisted finalists each received a $10,000 prize.\nMohammed Hasan Alwan, Saudi Arabia's novelist poses in front of cameras after he won the International Prize for Arabic Fiction (IPAF) in Abu Dhabi, United Arab Emirates, Tuesday, April 25, 2017. (AP Photo/Kamran Jebreili)\nThe prize is run with the support of the Booker Prize Foundation and funded by Abu Dhabi's Tourism and Culture Authority.\nAlwan was born in Saudi Arabia's capital of Riyadh in 1979 and resides in Toronto, Canada. He has published five novels.\nHe has said of his experience living outside his homeland that he initially thought he was feeling nostalgia writing a book about \"extreme eastern concepts\" while residing in a \"distant cold corner of the world in Canada\".\n\"Then I realized that being exposed to what is seemingly foreign or different is what drives me to reconnect with myself, as well as with my heritage and old culture,\" he said in a statement released after his win.\n___\nOnline: www.arabicfiction.org\nMohammed Hasan Alwan, Saudi Arabia's novelist, and the writer of \"A Small Death\", 3rd right, celebrates with the Sahar Khalifeh chair of the Arab fiction judges, 4th right, and Mohamed Khalifa Al Mubarak, Chairman of Abu Dhabi Tourism & Culture Authority, 2nd right, after he won the International Prize for Arabic Fiction (IPAF) in Abu Dhabi, United Arab Emirates, Tuesday, April 25, 2017. (AP Photo/Kamran Jebreili)\nMohammed Hasan Alwan, Saudi Arabian novelist is surrounded by journalists after he won the International Prize for Arabic Fiction (IPAF) in Abu Dhabi, United Arab Emirates, Tuesday, April 25, 2017. (AP Photo/Kamran Jebreili)\nMohammed Hasan Alwan, Saudi Arabia's novelist is congratulated by two competitors after he won the International Prize for Arabic Fiction (IPAF) in Abu Dhabi, United Arab Emirates, Tuesday, April 25, 2017. (AP Photo/Kamran Jebreili)","url":"https://www.dailymail.co.uk/wires/ap/article-4446688/Saudi-novelist-wins-prestigious-prize-Arab-fiction.html"}
