{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:20:30","date_modify":"2018-10-30 21:20:30","date_publish":"2018-08-19 08:55:26","description":"Mansour al-Amer swipes a card to reveal a narrow sleep pod, reminiscent of Japan’s famed capsule hotels. But this pod is in Saudi Arabia.","filename":"data/vaneerConsumption/SaudiArabiaTestsJapanInspiredNapPodsforMuslimHajj.json","image_url":"https://media.breitbart.com/media/2018/08/nap-pod.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_08_19__1540934430.html","title":"Saudi Arabia Tests Japan-Inspired ‘Nap Pods’ for Muslim Hajj","title_page":"Saudi Arabia Tests Japan-Inspired ‘Nap Pods’ for Muslim Hajj","title_rss":"NULL","source_domain":"breitbart.com","text":"MECCA, Saudi Arabia (AFP) — Mansour al-Amer swipes a card to reveal a narrow sleep pod, reminiscent of Japan’s famed capsule hotels. But this pod is in Saudi Arabia, where the Muslim hajj pilgrimage begins Sunday.\nThe kingdom has plans to introduce capsule rooms in the western city of Mina in the coming days, as an estimated 2 million Muslim faithful gather for the six-day hajj, one of the five pillars of Islam.\nThe free nap pods are part of new measures Saudi Arabia is rolling out this year in a bid to modernize the centuries-old practice of hajj.\nThe government has also introduced apps for on-the-spot translation and emergency medical care.\nAmer is the head of a Saudi charity, the Haji and Mutamer Gift Charitable Association, which is offering between 18 and 24 capsule for pilgrims to nap in for free in the coming days.\nEach fiberglass pod — less than three meters long and just over one meter high — features a mattress, clean sheets, air conditioning and a large, well-lit mirror.\nThe pods can be lined up horizontally or stacked vertically to save on space.\n“We are always thinking about pilgrims and how to make them more comfortable during the rituals of hajj,” Amer told AFP.\n‘Nap-share economy’\nThe nap pods provide a solution for pilgrims of limited means who cannot afford to book hotels on site but need a quick rest during hajj.\nEach napper will have three hours of access to the pods, which are imported from Japan at cost of around $1,114 (1,000 euros) each.\nWhen the pilgrim wakes for prayer time — five times daily in Islam — workers will sterilize the pod before handing it over to the next pilgrim.\n“The idea already exists globally, in Japan for example, and in several cities across the world,” Amer said.\n“We believe it’s extremely well-suited for crowded places in our holy sites and in Mecca.”\nBut for hajj, which takes pilgrims across Mecca and Mina — two cities in western Saudi Arabia home to the holiest sites of Islam — the pods were also inspired by the rising popularity of car and bike-sharing.\n“The capsules work through a share economy, like bicycles that you can rent for an hour and then leave for someone else,” said Amer.\nA trial run of 12 pods earlier this year was, he said, a success. Amer estimates 60 people used the pods every day during the holy fasting month of Ramadan.\nThe hajj presents the Saudi authorities with major logistical challenges, as Islam is currently the world’s fastest-growing religion, according to the Pew research center.\nProviding accommodation for 2 million pilgrims is no small feat, with travelers staying in everything from five-star hotels to tents pitched in empty lots.\nSaudi authorities are pushing a “smart hajj” initiative to meet with the growing demands of hajj, which coincide with the kingdom’s unprecedented modernization drive.\nSaudi Arabia, one of the world’s most restrictive countries, this year lifted a ban on women driving and has seen a string of reform initiatives spearheaded by the powerful young Crown Prince Mohammed bin Salman.\nBut the kingdom has also tightened its grip on dissent, with around a dozen women’s rights campaigners arrested in recent weeks. Some have been released.\nEvery Muslim is required to complete the hajj at least once in their lifetime if they have the means to do so.\nThe annual pilgrimage sees the Muslim faithful gather in Mecca, all clad in white, to perform rituals around the black Kaaba cube.\nThe hajj also features a symbolic stoning of the devil ceremony, marking the start of Eid al-Adha, a three-day feast.","url":"https://www.breitbart.com/middle-east/2018/08/19/pictures-saudi-arabia-tests-japan-inspired-nap-pods-for-muslim-hajj/"}
