{"authors":["John Hayward"],"date_download":"2018-10-30 20:45:20","date_modify":"2018-10-30 20:45:20","date_publish":"2016-06-07 04:31:24","description":"Talk of a production cap to stabilize oil prices seems like a distant memory now, as Saudi Arabia cuts oil prices to Europe to compete.","filename":"data/vaneerConsumption/SaudiArabiaWagesOilPriceWaronIran.json","image_url":"https://media.breitbart.com/media/2016/04/saudi-arabia-oil-fields-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_06__1540932320.html","title":"Saudi Arabia Wages Oil Price War on Iran","title_page":"Saudi Arabia Wages Oil Price War on Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"Talk of a production cap to stabilize oil prices seems like a distant memory now, as Iran continues ramping up post-sanctions production and Saudi Arabia cuts oil prices to Europe to compete.\n“In an email sent to customers, state oil company Saudi Aramco said it had cut its light crude prices by 35 cents a barrel to northwest Europe and by 10 cents a barrel to the Mediterranean for July deliveries,” the Wall Street Journal reports.\nNormally, growing demand would bring prices up at this time of year, but the latest OPEC effort to organize a production cap fell apart last week. As in the past, Iran’s refusal to cap production was a major factor. Saudi Arabia’s regional rivalry with Iran means they aren’t about to scale back and let Tehran seize market share.\nThe WSJ reports that Iranian oil shipments to Europe have reached 400,000 barrels a day, on track to hit 700,000 within a few months, following deals with Greek, French, and Italian refining companies. That will bring Iran close to Saudi Arabia’s European exports of 800,000 barrels per day.\nA price war is breaking out, and the Iranians are planning to fight a very aggressive war. They are predicting a victory against the Saudis because the Kingdom’s economy is much more dependent on oil than Iran’s. The Saudis are aware of this, which is why they have embarked on a major reform initiative to harden their economy, but it will take time to implement fully.\nPanos Mourdoukoutas at Forbes thought Saudi Arabia did fairly well in the first round of oil price combat, but now Iran might be gaining the upper hand. The Saudis pretty clearly wanted oil prices to increase, to drive up the value of their national oil company Aramco before its first planned offering of public stock, which is supposed to provide a tsunami of funds for the Saudi project to transform their economy.\nInstead, Iran’s refusal to cap production spoiled the Saudis’ plans for OPEC to arrange such a cap, so prices are falling instead of rising.\n“Simply put, Iran would like lower oil prices between now and the day Aramco makes its market debut,” writes Mourdoukoutas. “That’s why it has undermined recent OPEC meetings, in my opinion.”\nIran is also using discounts to its customers in Asia, where it has always been able to sell oil, as a weapon in its post-sanctions price war strategy.\nWith these discounts, Iran is “undercutting Saudi and Iraqi prices to levels not seen since 2007-2008,” writes Seeking Alpha, which wonders if Iran has gained the “upper hand” in the oil battle, by virtue of being better able to endure the pain of reduced oil income.\nEveryone else will have front-row seats to the title fight between Saudi Arabia and Iran. “Once Nigeria, Libya and Canada resume pumping at their normal levels, the effects of the struggle between Iran and Saudi Arabia will be felt. If both increase production, the world will be awash with oil, pulling prices back to the mid $30/barrel levels,” Seeking Alpha anticipates.\nOil strategist Julian Lee suggests a radical strategy for Saudi Arabia at Bloomberg News: Allow large-scale foreign investment in its oil industry, rather than merely selling stock in Aramco for quick cash.\n“Letting overseas oil companies from ExxonMobil to China’s CNPC invest directly in exploration or production in the kingdom would ensure that the diminished pot of investment capital is put to the most efficient use — and diverted away from rivals like Iran,” proposes Lee.\nLee acknowledges that such policies are difficult for nationalized oil companies to embrace, although Mexico and Venezuela have opened their oil industries to outside investment — a process interrupted in the latter case when Venezuela came down with a terminal case of socialism. Iran, too, has benefited from foreign investment, helping it create the very infrastructure it is now using so effectively as a weapon against the Saudis.\nGive Tehran its due: They seem to have anticipated the results of Barack Obama’s nuclear deal far more clearly than anyone in the administration, the governments of Europe, or the Saudi monarchy. Unless, of course, one of the hidden goals of the nuclear deal was always weakening Saudi Arabia and inflating Iran to the status of regional super-power.","url":"https://www.breitbart.com/national-security/2016/06/06/saudi-arabia-fights-oil-price-war-iran/"}
