{"authors":["Associated Press"],"date_download":"2018-10-23 01:42:51","date_modify":"2018-10-23 01:42:51","date_publish":"2017-04-26 12:20:48","description":"DUBAI, United Arab Emirates (AP) - A proposal to establish sports education colleges for Saudi women failed to win enough votes in the kingdom's top advisory...","filename":"data/vaneerConsumption/Saudicouncilrejectsproposalforfemalesportscolleges.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465333-1493211665-736_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447342_Saudi-council-rejects-proposal-female-sports-colleges_1540258971.html","title":"Saudi council rejects proposal for female sports colleges","title_page":"Saudi council rejects proposal for female sports colleges | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DUBAI, United Arab Emirates (AP) - A proposal to establish sports education colleges for Saudi women failed to win enough votes in the kingdom's top advisory body, a council member who drafted the plan said Wednesday.\nThe proposal on the colleges needed 76 out of 150 votes to pass in the Shura Council, but fell three votes short of that goal. It called for the establishment of colleges that would train Saudi women in how to teach fitness and well-being.\nLina Almaeena, who is one of three council members that submitted the proposal, said 57 members against the measure with the rest abstaining.\nFILE- In this May 12, 2014 file photo, Jiddah United sports club founder Lina Almaeena stands in her sporting goods shop in Jiddah, Saudi Arabia. A proposal to establish physical education colleges in Saudi female has failed to win enough votes in the kingdom's Shura Council, which advises government. (AP Photo/Hasan Jamali, File)\nSome of the kingdom's ultraconservatives shun the concept of women's exercise as \"immodest\" and say it blurs gender lines.\n\"Obviously there are people who have different schools of thoughts. I don't know what the rational exactly is,\" Almaeena said, speaking to The Associated Press a day after the proposal failed to pass.\nShe has long been an advocate for women's access to sports and founded Jeddah United in 2006, the first sports club in Saudi Arabia to include women.\nPhysical education is still not on the curriculum for Saudi girls in public schools, though some private schools offer physical education classes and sports to female students. There are also plans to license dozens of female-only gyms.\nThe kingdom discourages unrelated men and women from mixing and women cannot openly exercise in public.\nBut despite lingering attitudes against women's participation in sports, the kingdom sent women to participate in the Olympic Games twice, doubling its female contingency to four in the 2016 Rio games.\nAlmaeena said she expected the proposal to have greater backing by Shura Council members because it supports the kingdom's Vision 2030 plan, which is a blueprint for a wide-reaching government overhaul to develop the society and the economy. It was introduced under King Salman by his son, Deputy Crown Prince Mohammed bin Salman.\nVision 2030 specifically calls for encouraging the participation of all citizens in sports and athletic activities. It says currently 13 percent of the Saudi population exercises once a week. The government aims to bump that up to 40 percent and raise life expectancy from 74 years to 80 years.\nAlmaeena said that in order to improve women's health and participation in sports, there have to be women who can teach young girls about fitness and well-being.\nSaudi women who want to study sports medicine or physical education at the university level have to study abroad. The country's General Sports Authority offers certificates in some courses.\nThough the college proposal failed to garner enough votes in the Shura Council, Almaeena said strides have been made in recent years. Women were first appointed to the Shura Council in 2013 by the late King Abdullah as part of a wider effort to gradually improve women's rights.\nThe Shura Council does not have authority to pass legislation, but its proposals can become law with the backing of the Cabinet and the monarch. Almaeena said the Ministry of Education can still choose to adopt the proposal.\n\"I'm very optimistic because there is a new vision ... but of course I would have wished it would have passed,\" she said.\n___\nFollow Aya Batrawy on Twitter at www.twitter.com/ayaelb\nFILE - In this May 21, 2012 file photo, members of a Saudi female soccer team practice at a secret location in Riyadh, Saudi Arabia. A proposal to establish sports education colleges for Saudi women has failed to win enough votes in the kingdom's Shura Council, which advises the government. Saudi media reports say the proposal on the colleges needed 76 votes to pass, but fell three votes short of that goal. (AP Photo/Hassan Ammar, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4447342/Saudi-council-rejects-proposal-female-sports-colleges.html"}
