{"authors":["John Hayward"],"date_download":"2018-10-30 20:45:46","date_modify":"2018-10-30 20:45:46","date_publish":"2016-02-25 04:24:38","description":"Saudi Arabia has scuttled talk of a deal with other big oil nations to cut production and \"warned high-cost operators such as U.S. shale drillers to trim costs or go bust, in a stark message that triggered fresh pressure on crude prices,\" as the Financial Times put it.","filename":"data/vaneerConsumption/SaudiArabiaAbandonsDealtoCutOilProduction.json","image_url":"https://media.breitbart.com/media/2016/01/Screen-Shot-2016-01-12-at-5.58.48-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_24__1540932346.html","title":"Saudi Arabia Abandons Deal to Cut Oil Production","title_page":"Saudi Arabia Abandons Deal to Cut Oil Production","title_rss":"NULL","source_domain":"breitbart.com","text":"Saudi Arabia has scuttled talk of a deal with other big oil nations to cut production and “warned high-cost operators such as U.S. shale drillers to trim costs or go bust, in a stark message that triggered fresh pressure on crude prices,” as the Financial Times put it.\nThe markets perked up last week after a tentative agreement between Saudi Arabia, Russia, Qatar, and Venezuela to freeze production until oil prices stabilized. The market wanted more than a freeze, and there were strong doubts such an agreement could be finalized without highly improbable cooperation from resurgent post-sanctions Iran and cash-hungry Iraq, but even the rumor of unprecedented coordination between the Saudis and Russians to stabilize prices was good enough for a market bump.\nThe Financial Times quotes Saudi oil minister Ali al-Naimi blaming a “lack of trust” between the big oil producers for making a production cut impossible, although he still talked up the possibility of a “co-ordinated production freeze,” presumably along the lines of last week’s tentative agreement.\n“There is less trust than normal,” said Naimi. “Not many countries are going to deliver. Even if they say they will cut production, they will not deliver.”\nNaimi explicitly denied the Saudis were at war with U.S. shale companies but then said those companies must “find a way to lower their costs, borrow cash, or liquidate.” The FT bluntly states the Saudis have been “pumping freely in an effort to knock out higher-cost rivals.”\nNaimi admitted his advice “sounds harsh, and unfortunately it is, but it is a more efficient way to rebalance markets” than expecting “low-cost production” like Saudi Arabia’s to “subsidize higher-cost supplies.”\nRemarkably, Naimi said all this while addressing the very “higher-cost” suppliers his country has been trying to knock out: he was speaking at an annual conference for U.S. energy companies in Houston, Texas.\nThe response of the audience was also interesting, because the Financial Times describes U.S. executives as “resigned” to the end of OPEC’s control over the supply, in essence viewing the current market disruptions as the price of moving to a free market, where, as Cenovus Energy CEO Brian Ferguson put it, “supply and demand will solve for price.”\nReuters reports that the Saudi oil minister’s comments, combined with record-high inventories of U.S. crude, drove the price of oil below $33 a barrel on Wednesday.\n“Al-Naimi’s remarks punctured an oil-price rally that has lacked substance. The market correctly interpreted the presentation as bearish,” said David Hutton of the PVM brokerage. Other analysts said it was now clear that a production freeze, along the lines of the agreement between the Saudis and other top producers last week, would not be enough to stabilize the market.","url":"https://www.breitbart.com/national-security/2016/02/24/saudis-nix-deal-to-cut-oil-production-tell-u-s-shale-drillers-to-drop-dead/"}
