{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:06:46","date_modify":"2018-10-30 22:06:46","date_publish":"2016-04-17 14:51:15","description":"Saudi Arabia threatens economic retaliation if blamed for 9/11 attacks","filename":"data/vaneerConsumption/SaudiArabiaThreatensEconomicRetaliationifBlamedfor9.json","image_url":"https://media.breitbart.com/media/2016/03/saudi-arabia-king-salman-military-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_17__1540937206.html","title":"Saudi Arabia Threatens Economic Retaliation if Blamed for 9","title_page":"Saudi Arabia Threatens Economic Retaliation if Blamed for 9/11","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nCuba’s reactionary Raúl Castro tries to hold back the ‘restoration of capitalism’\nSaudi Arabia threatens economic retaliation if blamed for 9/11 attacks\nCuba’s reactionary Raúl Castro tries to hold back the ‘restoration of capitalism’\nFidel Castro\nCuba’s president Raúl Castro admitted Saturday that micro, small and medium-sized private companies have proliferated since Cuba’s 2010 economic reforms, but warned that this does not in any way imply the “restoration of capitalism.” In making this announcement, Castro is trying desperately to hold back the tides of history, an attempt that will surely fail.\nIn 2010, Cuba’s president Fidel Castro announced that Cuba’s bureaucracy had become so bloated that the government would lay off 500,000 workers in the public sector. According to the announcement:\nOur state neither can nor should continue to burden companies and productive organizations with services and inflated budgets that weigh down the economy, are counterproductive, create bad habits and distort the behavior of workers.\nThose workers would have to form private businesses or work for other people’s private businesses. The announcement was effectively the end of socialism for Cuba. (See “16-Sep-10 News — Cuba’s seismic shift has global implications”)\nNow, over five years later, those 500,000 laid off workers did create numerous private businesses, many of which are succeeding. So Castro’s announcement on Saturday is not only anti-historical, but silly.\nKarl Marx’s theories said that capitalism had built within it the seeds of its own destruction, and that it would also be replaced by the dictatorship of the proletariat, and then by socialism. Not only has that never happened, but the opposite has happened. Whether in East Germany, Russia, China, North Korea or Cuba, socialism has always been imposed over a river of blood and thousands of millions of dead bodies of people who had to be killed to create the socialist paradise. As the communists like to say, you have to break a few eggs to make an omelet.\nIn fact, it is socialism that contains the seeds to its own destruction. In recent times, we’ve seen a total collapse of socialism in East Germany and Russia, and in China a collapse into “capitalistic socialism,” which is actually Fascism.\nAs I wrote in my 2010 article, one can prove mathematically that socialism must always fail as population grows. If you are a serf lord or a war lord and you control a couple of hundred people, then socialism is easy. You just appoint your son to be chief bureaucrat, and have him monitor all commercial transactions. But as population grows exponentially, the number of transactions that have to be monitored grows exponentially even faster, and so the number of bureaucrats required to enforce socialism grows faster than the population. That is why all the socialist countries in the last century got stuck in the 1950s, and why North Korea today is still stuck in the 1950s.\nCuba was stuck in the 1950s, as was apparent from the fact that all the cars in Cuba were 1950s cars from America. The number of bureaucrats necessary to enforce socialism had grown so large that it was getting out of control. That’s why the 2010 announcement was that 500,000 people would be laid off and allowed to create their own private businesses.\nIn country after country where socialism has been tried, it has been accomplished by means of huge bloody massacres in generational Crisis eras, and in the countries we have mentioned it has collapsed bloodlessly during generational Unraveling eras. Cuba is in a generational Unraveling era today. The only thing holding socialism together today is that Fidel and Raúl Castro are still alive and still running things. But Raúl Castro is 84 years old, and he has promised to retire soon, so socialism will not last much longer in Cuba. Agencia EFE (Madrid) and Cuban News Agency (ACN)\nSaudi Arabia threatens economic retaliation if blamed for 9/11 attacks\nNew York’s World Trade Center, prior to the 9/11 attack\nSaudi Arabia is threatening to sell of hundreds of billions of dollars worth of American assets if a bill becomes law that would allow the Saudi government to be held responsible in U.S. courts for any role in the September 11, 2001 attacks.\nThe 9/11 Commission Report, published during the Bush administration, found “no evidence that the Saudi government as an institution or senior Saudi officials individually funded the organization.” That very careful wording leaves open the possibility that some less-than-senior Saudi politicians supported or funded the 9/11 attacks.\nHowever, the final chapter of the report, now known as the mysterious “28 pages,” was left out of the public version of the support, for reasons of “nation security” that both the Bush and Obama administrations have supported. Activists are claiming that the “28 pages” contain evidence of the guilt of the Saudi government, and they’re demanding that they be declassified.\nFamilies of the victims are going further and demanding that Congress pass a bill that would permit them to sue the Saudi government and recover damages for the 9/11 attacks. Congress is now debating such a bill, though it’s opposed by the Obama administration.\nThe Saudis are threatening revenge, saying that if that bill becomes law, then they will sell off $750 billion in American treasury securities and other US assets. They have threatened to do this quickly, before the US courts could freeze these assets. Selling the assets would, in effect, immunize the Saudis from the lawsuits, or at least from having to pay damages if they lose the lawsuits.\nThis is just one more thing that is worsening relations between Saudi Arabia and the United States. Relations have been worsening ever since President Obama took office, especially when Obama appeared to throw Hosni Mubarak under the bus during the 2011 Arab Awakening. (See “21-May-11 News — Saudi Arabia advances Gulf Cooperation Council, further cuts U.S. ties.”)\nAs I’ve been writing for years, Generational Dynamics predicts that in the coming Clash of Civilizations world war, the US, India, Russia and Iran would be allies opposing China, Pakistan, Saudi Arabia, and the Sunni Muslim countries. CNN and The Sun (London) and The 9/11 Commission Report (PDF)\nKEYS: Generational Dynamics, Cuba, Raúl Castro, Fidel Castro, Karl Marx, Russia, East Germany, China, North Korea, Saudi Arabia, 28 pages, Egypt, Hosni Mubarak\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/04/17/17-apr-16-world-view-saudi-arabia-threatens-economic-retaliation-blamed-911-attacks/"}
