{"authors":["Associated Press"],"date_download":"2018-10-23 03:10:09","date_modify":"2018-10-23 03:10:09","date_publish":"2016-01-11 15:52:10","description":"MIAMI (AP) — A Saudi prisoner at the U.S. base at Guantanamo Bay, Cuba, who authorities said was a recruiter and fighter for al-Qaida has been sent back to h...","filename":"data/vaneerConsumption/SaudiprisoneratGuantanamoreleasedbyUSafter14years.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394067_Saudi-prisoner-Guantanamo-released-US-14-years_1540264209.html","title":"Saudi prisoner at Guantanamo released by US after 14 years","title_page":"Saudi prisoner at Guantanamo released by US after 14 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Saudi prisoner at Guantanamo released by US after 14 years\nMIAMI (AP) — A Saudi prisoner at the U.S. base at Guantanamo Bay, Cuba, who authorities said was a recruiter and fighter for al-Qaida has been sent back to his homeland, the Pentagon said Monday amid a wave of releases from the detention center.\nMuhammed Abd Al-Rahman Al-Shamrani was among the first prisoners taken to the U.S. base in Cuba when it opened in January 2002 to hold suspected enemy combatants. He had long been deemed too dangerous to release even as most of the prisoners from Saudi Arabia were sent home.\nA profile of al-Shamrani first released by the Pentagon in 2014 said he \"almost certainly remains committed to supporting extremist causes, and has continued to incite other detainees against the detention staff at Guantanamo.\" His attorney, Martha Rayner, had said that the allegations against him were no more serious than prisoners who had already been released.\nHis case was reviewed again last year by a government board amid an effort by President Barack Obama to reduce the Guantanamo prison population and move the remainder to the U.S. The board concluded that the Saudi security measures and rehabilitation program for militants are adequate to minimize the risk of him taking part in extremist activities.\n\"Mr. al-Shamrani looks forward to participating in the Saudi reintegration program, reuniting with his family and establishing a peaceful and productive life in his home country,\" said Rayner, professor at Fordham University School of Law in New York.","url":"https://www.dailymail.co.uk/wires/ap/article-3394067/Saudi-prisoner-Guantanamo-released-US-14-years.html"}
