{"authors":[],"date_download":"2018-10-22 22:48:58","date_modify":"2018-10-22 22:48:58","date_publish":"2014-05-12 19:01:19","description":"With Finnair vying to be Europe’s route to Asia, premium passengers now have one more reason to love their stop in Helsinki.","filename":"data/vaneerConsumption/SaunaFinnairRaisestheStakesforBestAirportLounge.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437216/140512-nose-view-sauna_d2c1f84ad89474a2d159b0cb054d0e40.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_sauna-finnair-raises-stakes-best-airport-lounge-n103456_1540248538.html","title":"Sauna? Finnair Raises the Stakes for Best Airport Lounge","title_page":"Sauna? Finnair Raises the Stakes for Best Airport Lounge","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWith Finnair vying to be Europe’s route to Asia, premium passengers headed for those long flights now have one more reason to love their stop in Helsinki.\nThe Oneworld Alliance airline has announced the opening of their New Premium Lounge, adjacent to their award-winning Finnair Lounge near Gate 36 in the non-Schengen area of Helsinki Airport, on July 1.\n“This new and exclusive lounge takes Finnair’s long association with Finnish design to a new level,” says Markku Remes, Finnair’s Manager of Lounge and VIP Services. “We will be delighted to welcome our most loyal and regular customers into this special space before their flight.”\nIt is characterized by classic Nordic design. Described as: “in harmony with Finnish nature, with dynamic changes in light, colours and video projections in tune with the seasons and time of day, all combining to create a unique atmosphere of calm.” And there’s a sauna!","url":"https://www.nbcnews.com/business/travel/sauna-finnair-raises-stakes-best-airport-lounge-n103456"}
