{"authors":["Press Association"],"date_download":"2018-10-22 23:27:21","date_modify":"2018-10-22 23:27:21","date_publish":"2016-01-11 05:43:40","description":"Millions of people may be planning their retirements on wrong information after \"bungling\" by the Government, MPs have warned. The cross-party Work and Pensi...","filename":"data/vaneerConsumption/Saversgiveninadequateandconfusinginformationonpensions.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-7bfc434f-e793-4155-9bbf-054eee193ce6-56CX32zFKLb7123928b84caf1710-860_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393293_Savers-given-inadequate-confusing-information-pensions_1540250841.html","title":"Savers given 'inadequate' and 'confusing' information on pensions","title_page":"Savers given 'inadequate' and 'confusing' information on pensions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Savers given 'inadequate' and 'confusing' information on pensions\nMillions of people may be planning their retirements on wrong information after \"bungling\" by the Government, MPs have warned.\nThe cross-party Work and Pensions Committee said details sent out about when individuals will get state pensions and how much they are worth were \"inadequate\" and \"confusing\".\nWomen are particularly vulnerable to problems as their retirement ages are being brought into line with those of men.\nConfusing information could baffle those saving for a pension, a report said\nThe committee has raised the alarm in an interim report on the New State Pension (NSP), which replaces the basic and additional state pensions from April.\nThe MPs said the situation was so \"urgent\" that they could not wait for the full inquiry to be completed before speaking out.\n\"The Government is right to want people to engage more with their pensions. Central to achieving this is making pensions more approachable,\" the report said.\n\"At a crucial time of reform to the state pension and the state pension age, Department for Work and Pensions (DWP) statements are insufficiently clear.\n\"This lack of clarity increases the chances that people misunderstand the value of their state pension or the age from which they will receive it. In turn, this increases the chances that they will not best plan for retirement.\"\nThe committee called for statements to be on a single page, with key messages highlighted in boxes to ensure they stand out clearly.\nThe documents should clearly declare the current value of state pension built up, the age at which people will be eligible to receive the income, and how they can build up extra entitlement.\nThe report pointed to \"widespread concerns\" that women had been unaware of increases in their state pension age dating back to 1995, even though in some cases they had received correspondence from government.\nOne woman told the MPs she had been sent a letter by the Pension Service in 2005 that did not mention her retirement age.\nIn 2012, two years before her 60th birthday and what she thought was her pension age, she received another letter saying she was not entitled until she turned 66.\nCommittee chairman Frank Field said: \"Successive governments have bungled the fundamental duty to tell women of these major changes to when they can expect their state pension.\n\"Retirement expectations have been smashed as some women have only been told a couple of years before the date they expected to retire that no such retirement pension is now available.\n\"We are also concerned about the accuracy of existing information that is being sent out to women about their state pension entitlement.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393293/Savers-given-inadequate-confusing-information-pensions.html"}
