{"authors":[],"date_download":"2018-10-23 00:51:51","date_modify":"2018-10-23 00:51:51","date_publish":"2014-09-25 00:00:00","description":"Major food companies have cut trillions of calories, and studies show Americans are consuming fewer calories because of it. But some advocates think companies should do more to improve our diets.","filename":"data/vaneerConsumption/SayonaraToSuperSizeMeFoodCompaniesCutCaloriesSoDoWe.json","image_url":"https://media.npr.org/assets/img/2014/09/24/istock_000000713280medium_wide-a11bcc00bb6af9e3ef340dde06fcf07f1e431cde.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=351244903_1540255911.html","title":"Sayonara To 'Super-Size Me'? Food Companies Cut Calories, So Do We","title_page":"Sayonara To 'Super-Size Me'? Food Companies Cut Calories, So Do We : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nPatting yourself on the back for cutting down on calories? Well, a group of the nation's biggest food and beverage makers are doing the same. The companies claim that they've removed a total of 6.4 trillion calories from snack packs, sodas and other treats. The calorie cuts are part of a nationwide effort to tackle the obesity epidemic.\nNPR's Allison Aubrey reports on a new study that looks at whether these efforts are making a difference.\nALLISON AUBREY, BYLINE: If you want to know whether 16 food companies including Kraft and General Mills have the power to change Americans' eating habits, you've got to track what we're buying and eating. That's what researcher Barry Popkin of the University of North Carolina has tried to do. He compared to the number of calories families buy now compared to 2007.\nBARRY POPKIN: We've found that families with children cut 101 calories per day in their purchases.\nAUBREY: The cuts come from items such as sugary cereals, which have been made a little less sweet and salty snacks that are sold in those smaller 100 calorie packs. Now, changes like this may sound trivial, but Popkin argues, they add up.\nPOPKIN: This is where Americans are. Americans are buying 60 to 80 percent of their food from these packaged processed foods.\nAUBREY: And when people cut 100 calories day after day, the effect is cumulative.\nPOPKIN: It's not enough to make us all healthy. However, the science says that 100 calories will probably be enough to lead to the leveling off that we've seen, the plateauing, of the obesity epidemic.\nAUBREY: Popkin's analysis is published in the American Journal of Preventive Medicine and researchers have also looked at how the calorie initiatives impact company's bottom lines. Turns out, trimming calories can boost profits.\nHANK CARDELLO: Yeah - doing well by doing good perhaps is a great way to describe it.\nAUBREY: That's Hank Cardello of the Hudson Institute, an independent research group. His study shows that the companies selling more lower-calorie, better-for-you products are growing faster than companies that have been slow to change.\nCARDELLO: I mean, this is perfect alignment with the public health need where we do need to cut the calories and at the same time, it is absolutely necessary for these companies to grow.\nAUBREY: And just this week of beverage giants Coke and Pepsi both new made pledges to cut calories. But not everyone is so convinced that simply shaving calories from processed foods and sugary drinks is worth celebrating.\nMICHEL NISCHAN: I applaud any change that reduces calories, but I'm doubtful that it's going to lead to any meaningful change.\nAUBREY: That's Michel Nischan, founder of the group Wholesome Wave. He's a food advocate who's been pushing the idea of prescription fruits and vegetables, since most Americans eat fewer than two a day. His view - if these huge companies want to really make a difference, they should get Americans to completely rethink what we put on our plates.\nNISCHAN: Yes, enjoy your Diet Pepsi - I mean, God bless America, but, just use your marketing expertise to convince Americans that, actually, vegetables are really cool and whole grains are really cool. And there are ways that you can combine them with some of your favorite processed foods and have a better outcome.\nAUBREY: And some companies say they are trying. We reached out to Nestle, which owns brands such as DiGiorno pizza and Stouffer's lasagna. Here's Nestle's Chavanne Hanson.\nCHAVANNE HANSON: We don't sell fruit and vegetable commodities but we certainly encourage them. We've developed a program called Balance Your Plate.\nAUBREY: Which basically encourages families to add a side salad and some vegetables to their frozen meals. Not exactly revolutionary, but experts like Barry Popkin say when you're pushing for change, you've got to meet Americans where they are.\nAllison Aubrey, NPR News.\nCORNISH: It's NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=351244903"}
