{"authors":[],"date_download":"2018-10-22 20:49:04","date_modify":"2018-10-22 20:49:04","date_publish":"2014-05-04 03:53:03","description":"Comedian Joel McHale spent more time hitting below the belt during his White House Correspondents' Dinner routine than lobbing softballs.","filename":"data/vaneerConsumption/SayWhatJoelMcHalesEightNerdPromLowBlows.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/418786/140504-mchale-obama-correspondents-745a_1363b3ae1a0f36faaed43caa27280a15.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_white-house-correspondents-dinner_say-what-joel-mchales-eight-nerd-prom-low-blows-n96536_1540241344.html","title":"Say What? Joel McHale's Eight Nerd Prom Low Blows","title_page":"Say What? Joel McHale's Eight Nerd Prom Low Blows","title_rss":"NULL","source_domain":"nbcnews.com","text":"Here are his most notable eight low blows:\n1) I’m a big fan of President Obama. I think he’s one of the all-time great presidents, definitely in the top 50. Please explain that to Jessica Simpson.\n2) Look, I know it’s been a long night. But I promise that tonight will be both amusing and over quickly, just like Chris Christie’s presidential bid. I got a lot of these tonight, so buckle up Gov. Christie. Excuse me, extender-buckle up.\n3) The vice president isn’t here tonight. Not for security reasons. He just thought this event was being held at the Dulles Airport Applebee’s. Yes, right now, Joe is elbow-deep in jalapeño poppers and talking to a construction cone he thinks is John Boehner. Um, it’s crazy to think that Joe Biden is only one heartbeat away from no one taking him seriously as president. Biden will likely be running for president in 2016 saying, “There is no obvious reason not to.” He talks about his motivation for a presidential run as if he’s deciding to finish a meatball hoagie. \"Hey, it’s there, isn’t it? Look, all I’m saying is if the bread is toasty and the cheese is warm, I’m going to finish that thing. Jill, bring me my hoagie bib. No, not that one. The fancy one.\"\n4) Hillary’s daughter, Chelsea, is pregnant, which means in nine months we will officially have a sequel to \"Bad Grandpa.\" It also raises the question: When the baby is born, do you give Bill Clinton a cigar?\n5) Jeb Bush says he’s thinking about running. Wow, another Bush might be in the White House. Is it already time for our every 10 years surprise party for Iraq?\n6) And CNN is desperately searching for something they’ve been missing for months—their dignity. At this point, CNN is like the Radio Shack at a sad strip mall. You don’t know how it stayed in business this long, you don’t know anyone who shops there. And they just fired Piers Morgan.\n7) I’m not going to spoil the shocking twist on \"House of Cards,\" but just know that it was so surprising that Nancy Pelosi’s face almost changed expression. Did you like that one, Nancy? I can’t tell.\n8) What’s our biggest concern as Americans? TV show spoilers! In other countries a spoiler consists of, \"Hey, I haven’t been back to the village yet, so don’t tell me who survived the drone strike. No spoilers!\"","url":"https://www.nbcnews.com/storyline/white-house-correspondents-dinner/say-what-joel-mchales-eight-nerd-prom-low-blows-n96536"}
