{"authors":["Madlen Davies For Mailonline"],"date_download":"2018-10-23 00:42:58","date_modify":"2018-10-23 00:42:58","date_publish":"2016-01-11 10:31:48","description":"Some 37 per cent of women saw a doctor more than five times before their diagnosis, compared to 24 per cent of men, according to a report by The Brain Tumour Charity.","filename":"data/vaneerConsumption/ScandalofthepatientswithbraintumourswhoarefobbedoffbyGPs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/300708B600000578-0-image-a-6_1452506285821.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3393620_Scandal-patients-brain-tumors-fobbed-GPs-claim-just-tired-attention-seeking_1540255378.html","title":"Scandal of the patients with brain tumours who are fobbed off by GPs","title_page":"Scandal of the patients with brain tumours who are fobbed off by GPs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brain tumour patients are being dismissed as 'tired' or 'attention seeking' and visit doctors multiple times before they are eventually diagnosed, a new report has found.\nAnd women are likely to wait much longer than men for their tumour to be discovered.\nFemale patients who seek medical advice for their symptoms are twice as likely as men to wait more than a year for a diagnosis, according to the research.\nWomen who seek medical advice for their symptoms are twice as likely as men to wait more than a year for a brain tumour diagnosis, a new report has found\nSarah Lindsell, chief executive of The Brain Tumour Charity - which published the report, said: 'Our report shows that overall, people with brain tumour symptoms often struggle to secure a diagnosis and we will continue our drive to address that problem.\n'However, it appears that women tend to face a more difficult path than men when they seek help for brain tumour symptoms.\n'It is a worrying disparity and one that deserves further investigation.'\nThe report - Finding Myself in Your Hands: The Reality of Brain Tumour Treatment and Care - found nearly one in three brain tumour patients visited a doctor more than five time before the disease was diagnosed and nearly a quarter waited more than a year for diagnosis.\nPatients who waited more time were mostly women, with 30 per cent going diagnosed for more than a year compared to 15 per cent of men.\nSome 37 per cent saw a doctor more than five times before their diagnosis compared to 24 per cent of men.\nWHAT ARE THE SYMPTOMS OF A BRAIN TUMOUR? The symptoms of a brain tumour vary depending on the exact part of the brain that's affected. Common symptoms include: severe, persistent headaches\nseizures (fits)\npersistent nausea, vomiting and drowsiness\nmental or behavioural changes, such as memory problems or changes in personality\nprogressive weakness or paralysis on one side of the body, vision problems, or speech problems Sometimes, a person may not have any symptoms to begin with or they may only develop very slowly over time. Source: NHS Choices\nSome people reported their diagnosis took more than five years after their symptoms first appeared and again it was mostly women 11 per cent, compared to 6 per cent of men.\nCarol Rutherford, from Flitwick in Bedfordshire, went to the doctors five times after a nurse friend said her symptoms, including personality changes and memory loss, could be a sign of pressure on the brain.\nBut she was told 'No, you don't need a brain scan, you're just really tired'.\nAfter she collapsed, a scan revealed a fist-sized tumour, and she was advised to say goodbye to her family.\nThankfully, surgeons at Addenbrooke's hospital, Cambridgeshire, were able to operate.\n'I am very, very lucky to have made a full recovery,' she said.\nAnother woman was given antidepressants, sleep charts and painkillers over several visits to the doctors before a tumour was diagnosed.\nShe told the charity: 'One of the GPs I saw actually made fun of me saying what did I think my headaches were, a brain tumour?'\nSome women who went to the doctor or were admitted to hospital were dismissed as 'tired' or 'attention-seeking' and many were only diagnosed after multiple visits to their doctor (file photo)\nAnd another patient spent three years trying to get a diagnosis.\nShe said: 'On every hospital admission they accused me of attention-seeking, and on one admission they thought I was on illegal drugs.'\nThe charity, which studied 1,000 people with a brain tumour diagnosis, also found those with a household income of less than £20,000 were more likely than those earning over £40,000 to wait longer for a diagnosis.\nThe report also found 29 per cent of patients felt their diagnosis had been dealt with unsatisfactorily.\nMs Lindsell added: 'Our findings show that more can be done to ensure brain tumour patients are treated with sensitivity and compassion at every stage.","url":"https://www.dailymail.co.uk/health/article-3393620/Scandal-patients-brain-tumors-fobbed-GPs-claim-just-tired-attention-seeking.html"}
