{"authors":["Matthew Boyle"],"date_download":"2018-10-30 21:45:44","date_modify":"2018-10-30 21:45:44","date_publish":"2016-09-13 20:15:59","description":"Bill and Hillary Clinton secretly used the Arkansas state government to provide Chelsea Clinton, their daughter, with top-of-the-line childcare during Bill’s first term as governor. | Politics","filename":"data/vaneerConsumption/ScandalousClintonChildcareHistorySurfacesHowHillaryBillSecretlyUsedArkansasGovernorsMansiontoFundChelseasNanny.json","image_url":"https://media.breitbart.com/media/2016/09/newborn-chelsea-clinton-Donald-R.-BroylesAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_13__1540935944.html","title":"Scandalous Clinton Childcare History Surfaces: How Hillary, Bill Secretly Used Arkansas Governor’s Mansion to Fund Chelsea’s Nanny","title_page":"Scandalous Clinton Childcare History Surfaces: How Hillary, Bill Secretly Used Arkansas Governor’s Mansion to Fund Chelsea’s Nanny | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NEW YORK — Bill and Hillary Clinton secretly used the Arkansas state government to provide Chelsea Clinton, their daughter, with top-of-the-line childcare during Bill’s first term as governor.\nRevelations that the Clinton family illicitly used government to improve their own lives substantially in terms of childcare come as Donald J. Trump, the Republican nominee for president, and his daughter Ivanka Trump ready their childcare and maternity leave plan for rollout in Pennsylvania later Tuesday evening.\nTrump’s plan, according to aides who briefed press earlier on Tuesday, will include using the tax code to allow parents and those with elderly dependents in the middle class to deduct costs for up to four total dependents from their taxes. The aides say the tax deduction is available for taxpayers who take the standard deduction and is capped at the average cost of care for the state of residence. Higher income earners making more than $250,000—or $500,000 if filing jointly—per year will not be eligible for it, they said. Trump’s plan will, they say, also offer as much as $1,200 per year per eligible family in child care spending rebates through the Earned Income Tax Credit (EITC). Stay-at-home parents and working parents will both be eligible for the same tax deductions.\nMeanwhile, Trump’s plan will also, aides said in a call with reporters on Tuesday morning, provide mothers with up to six weeks of maternity leave when their companies don’t offer it, through an amendment to the existing unemployment insurance (UI) that would be paid for with offsets in other parts of the program so that taxes don’t get raised.\nTrump’s plan contrasts with Clinton’s, which she announced back in May, an initiative the Wall Street Journal characterized as an effort “to limit child care costs to 10% of a family’s income.” But Clinton’s childcare efforts, which she cast in a January 2016 town hall as something she understands because she went through it herself, are contradicted by the details that she and Bill misused taxpayer resources to provide government-run childcare for Chelsea.\n“I am aware of what’s going on in the lives of Americans,” Hillary Clinton said in January. “And I bring different experiences, because yes, I’ve been a daughter, a mother, a grandmother. And so child care for me is not some abstract policy issue, I remember when I was a young mother and getting the child care that I needed for my daughter and so I know what the struggles are like on a day-to-day basis.”\nIn September 1981, the Arkansas Gazette reported that Bill Clinton—who had nine months earlier wrapped his first term as governor of Arkansas after losing reelection before he would go on to serve again as the state’s governor from January 1983 to December 1992—used taxpayer cash to fund a nurse in a slot that was supposed to be for a security guard.\n“An Audit of the Governor’s Mansion accounts showed that a nurse hired by former Governor Bill Clinton during his last year in office filled a slot for a security guard and drew a salary from the state of $9,785, the Legislative Joint Auditing Committee was told Thursday,” the Arkansas Gazette wrote in a Sept. 11, 1981, report.\nThe amount that nurse was paid was nearly double minimum wage, assuming she worked a 40-hour week, since Arkansas’ then-minimum wage of $2.70 per hour according to the Department of Labor would have equated to an annual salary of $5,616.\nBut it turns out, according to that Gazette article, that Clinton openly admitted he misused the taxpayer resources to give top-of-the-line childcare to Chelsea, his newborn daughter.\n“Clinton said Thursday in Little Rock that the state Finance and Administration Department and the Mansion Commission had approved the hiring of the nurse before she was employed to care for Clinton’s newborn daughter, Chelsea,” the Arkansas Gazette reported. “He said the security guard position was the only one open, so he hired the nurse in that position.”\nAccording to an August 1993 report in the American Spectator, Bill Clinton’s state government misused the taxpayer money to bring the nurse for Chelsea Clinton aboard in the security guard position within a week of Chelsea’s birth.\nLisa Schiffren wrote in the American Spectator piece\nChelsea Clinton was born on February 27,1980. Hillary—already a partner at The Rose Law Firm, took off the better part of six months in order to care for Chelsea. But a 1981 audit of the Governor’s Mansion official payroll showed that one D.M. Sanders, a nurse, was employed from March 4, 1980—one week after Chelsea’s birth—until Bill Clinton left office on January 31, 1981, at the cost of $3,130. Of course the State of Arkansas does not pay for nannies for its officials’ children. So Governor Clinton had Chelsea’s nurse listed on the official payroll as a security guard.\nSchriffren added that Bill Clinton didn’t even care that what he was doing was wrong.\n“When this expenditure was caught and challenged by a local newspaper in 1981, the then-out-of-office Clinton shrugged it off on the grounds that the security guard slot had been the only one open,” she wrote.\nLater, when President in 1996, Bill Clinton gave the nanny—Dessie Sanders—a shout out at a public event.\n“We’re off to a pretty good start. (Cheers, applause.) Hello, Dessie. I’m glad to see you. See that lady right there? She used to take care of my daughter right after she was born. Her name is Dessie Sanders (sp). Give her hand. She did a good job,” Bill Clinton said at the Sundial Recreation Center in Sun City, Arizona, on Sept. 11, 1996, according to public remarks.\nBut that wasn’t all: As Schriffren detailed in the American Spectator, the Clintons habitually abused their position of power by using state government staff to take care of Chelsea for them.\nShe wrote that “witnesses in Little Rock suggest” that “the Clintons routinely used staffers assigned to official duties—housekeeping, security, mansion administrator, etc.—to look after Chelsea.”\nShe specifically quoted one maid by name as confirming her job wasn’t just for the government; she was to handle Chelsea Clinton as well.\n“Rosie Spann, an elderly maid who served in the mansion when Chelsea was young, confirmed this. ‘I worked upstairs, so I sometimes watched the baby when Hillary went to work.’”\nBill Clinton’s then deputy White House press secretary even confirmed, according to the 1993 report, that they used the government resources Bill Clinton had acquired thanks to being an elected politician to take care of Chelsea.\n“No secret is made of the fact that, as White House Deputy Press Secretary Lorraine Voles put it, ‘childcare was provided for them in the governor’s mansion,’” Schriffren wrote.\nAccording to a May 1992 report in Vanity Fair magazine, they even had resident baby-sitters for Chelsea Clinton.\n“’Whenever Hillary was there, she always sat with Chelsea while she had dinner,’ recalls Melinda Martin, the resident baby-sitter from ’85 to ’87,” Gail Sheehy wrote in the Vanity Fair piece. “(Most of the Clintons’ baby-sitters are fresh out of the University of Arkansas, with names like Melinda, Melissa, and Michelle.)”\nAnd according to an April 11, 1993, report in Newsweek magazine, when Clinton was elected president, they brought at least one of the taxpayer-funded nannies with the first family to Washington, D.C.\n“Chelsea Clinton may not need a babysitter, but her former nanny is not far away,” Newsweek wrote in a staff report. “NEWSWEEK has learned that Helen Dickey, Chelsea’s nanny from her Little Rock days, has landed a job-and a bedroom-at 1600 Pennsylvania Avenue. Dickey, 22, earns $20,000 a year as a full-time ‘staff assistant’ in the White House social office, according to Hillary Clinton’s Press Secretary Lisa Caputo. Dickey’s duties include ‘basic backup support,’ like helping to plan parties and answering mail and the phones. Dickey says she is no longer Chelsea’s nanny, but Caputo acknowledges that Dickey does take care of the First Daughter ‘on occasion.’”","url":"https://www.breitbart.com/politics/2016/09/13/scandalous-clinton-childcare-history-surfaces-hillary-bill-secretly-used-governors-mansion-fund-chelseas-nanny/"}
