{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-23 00:02:54","date_modify":"2018-10-23 00:02:54","date_publish":"2016-01-29 12:42:26","description":"Scientists at King's College London scanned the brains of 61 men with autism spectrum disorder and compared them to the white matter of men without the condition.","filename":"data/vaneerConsumption/Scansofautisticbrainsrevealdifferencesinvolvedinlanguageandfacialrecognition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1B0ED00000578-0-image-a-14_1454069739666.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422662_How-autism-changes-brain-Scans-patients-reveal-subtle-differences-regions-involved-language-facial-recognition_1540252974.html","title":"Scans of autistic brains reveal differences involved in language and facial recognition","title_page":"Scans of autistic brains reveal differences involved in language and facial recognition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Men with autism have subtle differences in the connections within their brains and the findings could help determine why people with the disorder exhibit the symptoms that they do.\nScientists used brain scanning techniques to examine the white matter in the brains of adult males suffering from autism spectrum disorder (ASD) - a condition that affects around one in 100 people.\nThey found the bundles of nerves in an area of the brain called the frontal lobe, which is involved in social interaction skills, look different from those without the disorder.\nScroll down for video\nResearchers used MRI scans to study the brains of adults with autism spectrum disorder and found they have significant differences in the white matter in key regions of the brain involved in language and facial recognition. Red regions in the scans above highlight areas where the differences were found\nSpecifically the researchers found the connections between nerve cells in an area on the left side of the brain, called the arcuate bundle and responsible for language, were altered compared to healthy adults.\nThese differences were particularly severe in those who experienced 'delayed echolalia' as part of their autism, where they often repeat words or sentences in a parrot-like way.\nDr Marco Catani, a neuroscientist at King's College London, said the findings could provide new insights into the causes of the condition and how it develops as children mature.\n'White matter provides key insights which allow us to paint a precise picture of how different parts of the brain develop during critical periods in childhood,' he said.\nWHAT IS AUTISM SPECTRUM DISORDER? Autism Spectrum Disorder (ASD) can cause a wide range of symptoms, which are often grouped into two main categories. Firstly, problems with social interaction and communication. This includes difficulty understanding and being aware of other people's emotions and feelings and/or problems taking part in, or starting, conversations. Patterns of thought are another key area, namely restricted and repetitive patterns of thought or physical movement, such as hand tapping or twisting, and becoming upset if these set routines are disrupted. It's estimated about 1 in every 100 people in the UK has ASD. More boys are diagnosed with it than girls. There is no 'cure for ASD, but a range of educational and behavioural support schemes can help people with the condition. Source: NHS Choices\n'We found subtle brain differences in men who at a very young age had severe problems with communication and social interaction.\n'The differences appear to remain even if they have somehow learned to cope with these difficulties in adult life.'\nThe researchers used Magnetic Resonance Imaging technique called Diffusion Tensor Imaging, to compare networks of white matter in 61 adults with autism spectrum disorder and 61 people without.\nWhite matter plays a crucial role in helping to connect different regions of the brain and allowing them to communicate with each other.\nThe scans also revealed people with autism spectrum disorder had underdeveloped areas of white matter in another part of the brain called the left uncinated bundle.\nThis plays a significant role in face recognition and emotional processing.\nThe experts found people with this underdevelopment had suffered problems with facial expressions in childhood.\nDr Catani said, however, further research on women and children with autism could help to reveal further insights into how the changes in the brain develop.\nAt present it is unclear whether the changes are a result of the problems experienced by the men during adulthood as a result of autism, or if they are the route course of these problems.\nBut Dr Catani said the study could eventually lead to new ways of diagnosing and treating people with autism.\nThe research may help scientists better understand why autism symptoms can continue into adulthood. The condition can affect how people interact socially. The film Rain Man saw Dustin Hoffman (pictured right with Tom Cruise in a still from the film) play an autistic character and how he struggled to interact with others\nHe added: 'It is worth noting that the brain differences are visible only with the special research techniques we now have at our disposal.\n'These differences are very subtle and potentially reversible.\n'Thanks to neuroimaging studies like this, it may one day be possible to stimulate the development of these faulty brain connections, or to predict how people with autism respond to treatment.'\n'Our study did not include women and children, so it would be interesting to explore whether similar differences exist within these groups.\nFor example, research has shown that women appear more resilient than men when it comes to autism, so it will be important if this is explained biologically in their brain development.'","url":"https://www.dailymail.co.uk/sciencetech/article-3422662/How-autism-changes-brain-Scans-patients-reveal-subtle-differences-regions-involved-language-facial-recognition.html"}
