{"authors":["Jeff Poor"],"date_download":"2018-10-30 18:22:28","date_modify":"2018-10-30 18:22:28","date_publish":"2015-11-10 14:40:20","description":"Scarborough: No One Can Name What the Mizzou President, Chancellor Did To Be Kicked Out","filename":"data/vaneerConsumption/ScarboroughNoOneCanNameWhattheMizzouPresidentChancellorDidToBeKickedOut.json","image_url":"https://media.breitbart.com/media/2015/11/Scarborough1110.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_11_10__1540923748.html","title":"Scarborough: No One Can Name What the Mizzou President, Chancellor Did To Be Kicked Out","title_page":"Scarborough: No One Can Name What the Mizzou President, Chancellor Did To Be Kicked Out | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On his Tuesday broadcast of “Morning Joe,” MSNBC host Joe Scarborough attempted to dissect the events surrounding the alleged racial tensions at the University of Missouri that led to the resignations of the university’s president and its chancellor on Monday.\nScarborough pressed Washington Post columnist Eugene Robinson for specifics, but neither he nor Robinson could come up with those specifics, which led Scarborough to speculate a proposed boycott by the university’s football team was the driving force behind their resignations.\nExchange as follows:\nSCARBOROUGH: I’ve got to say, students have a right to protest, obviously. I think what concerns me the most is the power of college football — the power of college sports that once the football team said we’re not going to play on Saturday, the hell with due process, to hell with any of it. The football team wins and this college president is thrown out and we’re all scratching our heads going is he a racist? Is he a bigot? ROBINSON: You know, I haven’t been on the campus so I don’t know but obviously as far as the students are concern it’s what the administration did not do rather than what it did. You know, there are a lot of African-American students and other minority students on that campus who obviously feel that for whatever reasons that the campus was not made to be a friendly, accepting and supportive place in the way that – SCARBOROUGH: Right, Eugene. I guess what I am saying is what are those reasons? What are the specifics? I’ve been reading since this photograph was taken, looking for specifics of systemic actions that have made students feel excluded. What are the specifics? ROBINSON: And I don’t know what those specifics are. But what I do know — SCARBOROUGH: Isn’t that troubling, Gene? That you don’t know, a Pulitzer Prize winner, this guy is run out as president of the university because the football team said we’re not going to play and neither you nor I know reading these articles know what he did to evoke this type of response. Is this a complete failure of the national media to report? ROBINSON: The national media should always have done a better job at getting to the bottom of everything. But what fascinates me is the football team. These are students on the campus who have real power. They were certainly made to feel welcome on the campus. They were certainly supported on the campus. So the football team to act essentially against self-interest, for the members of that team, some of whom, you know, they’re playing in a big time Division I program, some of them, quite a few of them, have hopes of going on to play pro football, for them to say supported by the coaching staff we’re not playing — that’s a big statement and that tells me that there’s a situation there that people felt strongly about that needed to be rectified.\nScarborough went on to press his panel and determined that no one could name what actions were directly responsible for those resignations.\n“That’s been the question for three days and that’s the question I put out on the table – should a president of a university and a chancellor of a university be run out before there are discussions, before there is debate, before it is taken up, before there is due process – or do you just have a college football team – I mean, if a math class went out on strike, they would still be there. It seems to me major academic decisions are being made by a football team. And none of us around this table can name what the president or the chancellor did to deserve being kicked out.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2015/11/10/scarborough-no-one-can-name-what-the-mizzou-president-chancellor-did-to-be-kicked-out/"}
