{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 03:14:38","date_modify":"2018-10-23 03:14:38","date_publish":"2017-03-16 13:57:10","description":"The 32-year-old New York City native looked stunning in a sexy teal gown as she attended the premiere for her highly anticipated sci-fi adventure Ghost In The Shell.","filename":"data/vaneerConsumption/ScarlettJohanssonatGhostInTheShellJapanpremiere.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54859C00000578-0-image-a-10_1489672042898.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320328_Scarlett-Johansson-Ghost-Shell-Japan-premiere_1540264478.html","title":"Scarlett Johansson at Ghost In The Shell Japan premiere","title_page":"Scarlett Johansson at Ghost In The Shell Japan premiere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scarlett Johansson filed for divorce from husband of two years, French journalist Romain Dauraic, earlier this month and is reportedly headed for a difficult custody battle over their daughter Rose Dorothy.\nBut if the actress is stressed over her personal troubles, she did not show it on Wednesday evening while in Japan.\nThe 32-year-old New York City native looked stunning in a sexy teal gown as she attended the premiere for her highly anticipated sci-fi adventure Ghost In The Shell.\nShe pulled it off! Scarlett Johansson looked sensational in this complicated teal dress at the Ghost In The Shell premiere in Japan on Wednesday evening\nVa-voom: The blonde bombshell knew just how to pose in the interesting dress that actually seemed to be two dresses sewn together\nThe blonde bombshell knew just how to pose in the interesting dress that actually seemed to be two dresses sewn together.\nThe main dress was a spaghetti strap V-neck slip dress in a flat crepe.\nThen on her left side she seemed to have half of another dress on that had a long sleeve and tiers on the lower half.\nA 10: Then on her left side she seemed to have half of another dress on that had a long sleeve and tiers on the lower half\nLong earrings and a small gold clutch were her accessories.\nThanks to her beauty and incredible figure, she managed to pull off the number.\nThe Lucy star looked confident as she put one had on her hip and smiled for the dozens of photographers on the carpet.\nHer early years: She made her film debut in the fantasy comedy North (1994). Johansson subsequently starred in Manny & Lo (1996), and garnered further acclaim and prominence with roles in The Horse Whisperer (1998) and Ghost World (2001)\nA pro: The Lucy star looked confident as she put one had on her hip and smiled for the dozens of photographers on the carpet\nShe was also seen in a maroon silk number by HANEY that had a floral design.\nThe jumpsuit had harem pants and a turtleneck top.\nWhile in that look, Scarlett was seated on stage, most likely for a Q&A interview about the film.\nGhost In The Shell is out this month and also stars Takeshi Kitano, Michael Pitt and Juliette Binoche.\nIt’s based on the Japanese manga of the same name by Masamune Shirow, and previously became an animated film in Japan in 1995.\nArigato! She was also seen in a maroon silk number that had harem pants and a turtleneck top\nNo stilettos here: The siren wore chunky heels with a sandal look\nTalking it out: While in that look, Scarlett was seated on stage, most likely for a Q&A interview about the film\nThis weekend's SNL was the star's first public appearance since officially filing to divorce husband Dauriac on March 7.\nIt is reported that the exes are at the beginning of a custody battle of their two-year-old daughter.\nAccording to earlier reports from Daily Mail, Johansson is asking for joint custody of their daughter, Rose, but also wants the child to live with her.\nThe cast: Scarlett with (L-R) Danish Pilou AsbÊk, Japanese Takeshi Kitano and French Juliette Binoche pose during a press conference promoting the movie\nAll lined up and ready to go: The artists were promoting the film in Tokyo\nLook at that leg! The blonde wonder flashed a toned thigh in the interesting suit\nTrying to charm the Japanese crowd: The star is very popular in the country\nComing up soon: Ghost In The Shell opens in the US on March 31 and is expected to become a blockbuster\nIt was said that Dauriac was taken aback by the request because he has been the 'primary parent' for the two-year-old while Johansson has been involved with her career.\nThe Frenchman Dauriac plans to petition the court to take the child to live with him in his native France, Mayerson said, adding that Johansson will have 'access to her daughter any time she wants to come to Paris.'\nScarlett's first husband was Ryan Reynolds who is now married to and has two children with actress Blake Lively.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320328/Scarlett-Johansson-Ghost-Shell-Japan-premiere.html"}
