{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:10:07","date_modify":"2018-10-30 20:10:07","date_publish":"2016-01-02 21:27:59","description":"A South Carolina lawmaker is equating erectile dysfunction with abortion-on- demand as \"women's health care.\"","filename":"data/vaneerConsumption/SCDemocratEquatesLateTermAbortionwithErectileDysfunction.json","image_url":"https://media.breitbart.com/media/2016/01/Viagra-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_02__1540930207.html","title":"SC Democrat Equates Late-Term Abortion with Erectile Dysfunction","title_page":"SC Democrat Equates Late-Term Abortion with Erectile Dysfunction","title_rss":"NULL","source_domain":"breitbart.com","text":"A South Carolina Democrat lawmaker has proposed a bill that would make it more difficult for men to obtain medications that treat erectile dysfunction (ED) in retaliation for a Republican measure that would restrict abortions past the fifth month of pregnancy.\nState Rep. Mia McLeod said her legislation is “not a joke,” but South Carolina state House Majority Leader Bruce Bannister (R) said in response to the measure, “Entertaining, but kind of sad that someone would spend the time to draft and introduce that bill.”\nAccording to The State, however, McLeod says anti-abortion proposals are wasting lawmakers’ time, energy, and taxpayer funds.\nThe lawmaker is using her bill to fundraise for her 2016 state Senate campaign. Her proposal includes the following hurdles before doctors can prescribe ED medications for men: a cardiac stress test, notification of drug risks, referrals to a sex therapist, and obtaining a notarized affidavit from the patient’s sexual partners stating he has experienced ED symptoms.\nMcLeod said her legislation is not likely to pass because most of South Carolina’s state lawmakers are male.\n“In a male-dominated Legislature is it likely to pass?” McLeod asked. “No.”\nThe state legislature is close to passing a Pain-Capable Unborn Child Protection bill patterned after the one that was passed by the U.S. House. The measure, currently in conference, is based on scientific evidence that unborn babies are able to feel the pain of the abortion procedure at least as early as in the twentieth week of pregnancy, or five months.\nMcLeod said she is troubled by the late-term abortion ban and expects more attempts to restrict abortion on demand.\n“I don’t see an end in sight,” she said. “That’s troubling to say the least.”\nMcLeod hopes her legislation will force state lawmakers to think about abortion as women’s health care and expand discussions to include men’s sexual health. She said that if some lawmakers insist on regulating women’s abortion health care, then “we should govern it all.”\nA November 2014 Quinnipiac University poll found 60 percent of Americans support legislation limiting abortion past the twentieth week of pregnancy.","url":"https://www.breitbart.com/politics/2016/01/02/south-carolina-dem-equates-late-term-abortion-erectile-dysfunction/"}
