{"authors":["The Associated Press"],"date_download":"2018-10-30 19:25:07","date_modify":"2018-10-30 19:25:07","date_publish":"2018-10-28 08:35:27","description":"Xander Schauffele gave the Americans a sweep of the World Golf Championships and quickly put a winle...","filename":"data/vaneerConsumption/SchauffelewinsHSBCforUSsweepofWorldChampionships.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_Top_News_Sports_Stories/2018/10/28/Images/988f33e5293a461fa092f0f57029e111.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_schauffele-wins-hsbc-for-sweep-world-championships__1540927507.html","title":"Schauffele wins HSBC for US sweep of World Championships","title_page":"Schauffele wins HSBC for US sweep of World Championships","title_rss":"NULL","source_domain":"ajc.com","text":"Xander Schauffele gave the Americans a sweep of the World Golf Championships and quickly put a winless sophomore season behind him.\nSchauffele made birdie on his final three holes Sunday, the last one a two-putt birdie from about 30 feet on the par-5 18th hole to beat Tony Finau in a sudden-death playoff and win the HSBC Champions.\n\"When I was signing my card, I was like, 'Oh, wow. I actually went birdie-birdie to get in the playoff,\" Schauffele said. \"I was just in my own world out there.\"\nHe began the tournament by celebrating his 25th birthday. He ended it with one clutch shot after another in the closing stretch at Sheshan International for a 4-under 68, the lowest score of the final round, and his first victory in 13 months.\nSchauffele won twice in his first year on the PGA Tour to win rookie of the year. Last season featured high finishes, but only one good chance at winning when he was a runner-up in the British Open at Carnoustie.\nNow he has three victories, the last two at the Tour Championship to end the 2017 season and now a World Golf Championship.\nFinau, who started the final round with a three-shot lead in his bid for a second PGA Tour-sanctioned victory, was ahead by one shot until Schauffele made an 18-foot birdie putt on the par-3 17th, only the fourth player to make birdie on that hole Sunday.\nDefending champion Justin Rose missed a 10-foot birdie chance on the 17th and went to the final hole two shots behind. Trying to make eagle, he went from the bunker to the rough to over the green and into the water, making a bogey for a 72 to finish four shots behind.\nThat meant Brooks Koepka, who closed with a 69 and tied for 16th, stayed at No. 1 in the world for at least another week.\nThen, it was a battle between the two Americans.\nFinau faced a risky shot from his ball sitting high in the rough by going for the green. It narrowly cleared the water, leaving him an eagle putt from about 35 feet that he placed to a few feet from the cup. Schauffele's second shot into the par-5 18th landed on the putting surface and rolled just over the back as the 25-year-old American said, \"Sit!\" six times before it settled just off the green.\nHe ran his eagle putt 3 feet by and made that for birdie. He and Finau finished at 14-under 274.\nIn the playoff, Schauffele again hit the fairway and hit a 5-iron to the middle of the green. Finau went into the face of the bunker on the left, had no choice but to lay up, and his third shot was 20 feet on the fringe. He missed his birdie putt to extend the playoff.\n\"Definitely feel like I let one get away,\" said Finau, whose only PGA Tour victory was at the Puerto Rico Open two years ago. \"Xander played incredible golf today. It was playing tough out there. He posted a number and made birdie on a playoff hole when it counted. Hats off to him. He played nicely today and deserved to win.\"\nThe United States becomes the first country to have four players win the four World Golf Championships. Phil Mickelson won the Mexico Championship, Bubba Watson won the Dell Match Play and Justin Thomas won the Bridgestone Invitational.\nThe Americans also won all four WGCs in 2013 when Tiger Woods won two of them, Matt Kuchar won the Match Play and Dustin Johnson won in Shanghai. Americans now have won 41 of the 69 events since the World Golf Championships series began in 1999. Woods has won 18 of them.\nRose was trying to join Woods as the only players to successfully defend a WGC title — Woods has done it eight times — and birdied the 13th and 14th holes to pull within one shot of the lead. But he misfired from the fairway on the 15th into a bunker and made bogey, and he couldn't catch up.\nHe needed to finish second alone to replace Koepka at No. 1 in the world.\n\"Tough day for everybody,\" Rose said, alluding to only three players shooting in the 60s in the final round. \"You just look at the scoreboard. Seems like everyone fell apart. It was a three-horse race all day. It was hard to keep the mistakes off the card completely today.\"\nHe gets another chance to go back to No. 1 when he defends his title in the Turkish Airlines Open next week.\nRose's third shot to the 18th nicked Schauffele's ball, sending both balls down the slope and into the water. Schauffele was allowed to replace his ball without penalty, though it was an indication how close his shot was from trickling down the hill and into the water, which would have cost him the tournament.\nSchauffele, under strong consideration but left off the Ryder Cup team as a captain's pick, moved to No. 12 in the world.\nKiradech Aphibarnrat (71) and Andrew Putnam (72) tied for fourth. Putnam was making his debut in the World Golf Championships.","url":"https://www.ajc.com/sports/schauffele-wins-hsbc-for-sweep-world-championships/Ew5ZmnGwsNLn2F2wgedAFL/"}
