{"authors":["Nic White For Daily Mail Australia"],"date_download":"2018-10-23 03:45:01","date_modify":"2018-10-23 03:45:01","date_publish":"2017-03-10 13:32:14","description":"Schapelle Corby appears to be enjoying her last months in Bali swimming at the beach, running, and seeing her Balinese boyfriend, before returning home when her parole for drug smuggling ends.","filename":"data/vaneerConsumption/SchapelleCorbyscharmedlifeinBalibeforecominghome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22B5C400000578-0-image-a-37_1489147743791.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300788_Schapelle-Corby-s-charmed-life-Bali-coming-home_1540266301.html","title":"Schapelle Corby's charmed life in Bali before coming home","title_page":"Schapelle Corby's charmed life in Bali before coming home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Schapelle Corby appears to be enjoying her last months in Bali before returning home when her parole for drug smuggling ends in May.\nParole officers in December admitted they had no idea where the 39-year-old was living even though they were meant to be keeping an eye on her.\nBut she has been spotted enjoying a charmed life of leisure on the Indonesian island after she was released from Kerobokan Prison in February 2014.\nScroll down for video\nSchapelle Corby appears to be enjoying her last months in Bali before returning home when her parole for drug smuggling ends in May\nThe 39-year-old was spotted running to keep fit and riding around the island on a scooter\nThe former Gold Coast beauty therapist was pictured swimming at a 'secret' beach every day and driving around Bali on a scooter in an upcoming promotional advertisement for 9 News report.\nShe was also spotted going for regular runs to keep fit and shopping in popular Indonesian dress while shading her eyes with oversized sunglasses.\nThe segment preview also showed her beefy, tattooed Balinese boyfriend of 10 years Ben Panangian sitting in a yellow car in a singlet and shorts.\nIt also claimed to show how Corby was preparing to return to Australia, where she is expected to live with her sister Mercedes and children Wayan, 17, Nyeleigh, 15, and Nyoman, 9.\nThe segment preview also purported to show her beefy, tattooed Balinese boyfriend sitting in a yellow car in a singlet and shorts\nCorby was arrested trying to smuggle 4.2 kilograms of marijuana in her boogie board bag from Australia in October 2004, and jailed the following year\nShe was supposed to stay with Mercedes' ex-husband Wayan Widyartha in his Kuta compound while on parole, but locals claimed she never lived there.\nWayan also closed down his nearby surf shop Kuta Board Room and moved elsewhere, though it was not clear if Corby was with him.\nCorby was arrested trying to smuggle 4.2 kilograms of marijuana in her boogie board bag from Australia in October 2004.\nShe was convicted the following year, but maintained her innocence.\nHer parole ends in July and she can leave Indonesia to return to Australia on May 27.\nCorby with her sister Mercedes on the night she was released on parole in February 2014","url":"https://www.dailymail.co.uk/news/article-4300788/Schapelle-Corby-s-charmed-life-Bali-coming-home.html"}
