{"authors":["Alex Gladden"],"date_download":"2018-10-30 14:20:43","date_modify":"2018-10-30 14:20:43","date_publish":"2018-10-29 00:00:00","description":"A Pulaski County Special School District bus driver was fatally struck by his own bus in Little Rock on Monday afternoon, authorities said.","filename":"data/vaneerConsumption/SchoolbusdriverdiesafterbeingstruckbyhisownbusinLittleRock.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/29/resized_250499-1b-bus-1030_75-25303_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_school-bus-driver-dies-after-being-stru-1__page=1_1540909243.html","title":"School bus driver dies after being struck by his own bus in Little Rock","title_page":"School bus driver dies after being struck by his own bus in Little Rock","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Little Rock police and crime scene technicians at the scene of a bus accident on the 9000 block of Towne Oaks Drive in Little Rock Monday afternoon. According to police, a Pulaski County Special School District driver was killed after he was struck by his own bus. - Photo by John Sykes Jr.\nA Pulaski County Special School District bus driver was fatally struck by his own bus in Little Rock on Monday afternoon, authorities said.\nIt happened shortly before 2:15 p.m. on Towne Oaks Drive near Treasure Hill Road, which is northwest of North Rodney Parham and Reservoir roads.\n\"Upon their arrival, they learned that they did have a fatal incident,\" Little Rock Police Department spokesman Lt. Michael Ford said.\nFord said it appears the bus driver exited the vehicle and the bus started rolling down the hill, at which point he tried to catch up to the bus and was run over. Ford said the driver, whose name wasn't released, \"maybe got caught up under the bus.\" The bus stopped when it struck a tree.\nOfficers will continue to investigate the circumstances, Ford said. Part of the investigation will include determining whether any of the bus' equipment was faulty.\n\"This is my first time in my 18-year career of hearing something like this,\" Ford said.\nJessica Duff, a spokesman for the school district, said no children were on board at the time.\n\"It is a tragedy,\" Ford said. \"It's something that's sad, so hopefully we can gather all the information from witnesses, so we can know what happened.\"\nFord said he was not aware of any other recent bus crashes and could not recall when the last bus crash occurred. Little Rock officers normally do not handle matters with Pulaski County Special School District school buses because the buses mostly run outside city limits.\nThe officers will interview witnesses and reconstruct the accident to determine what happened, Ford said.\nLauren Wo drove past the bus after the accident and saw a man lying on the ground, she said.\n\"He wasn't moving or nothing,\" she said.\nThe driver was taking the bus to pick up children who were aboard a bus with a mechanical problem, Duff said. But officials were able to fix the bus with the issue, so the driver did not pick up the children. The bus that crashed did not have any known mechanical issues.\nSchool district officials will release the name of the driver today, Duff said.\nThe school district had the bus towed shortly after 5 p.m., she said.\nTo Duff's knowledge, none of the county's buses have cameras, including the crashed bus, she said.\nADVERTISEMENT\nMore headlines\nMetro on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/school-bus-driver-dies-after-being-stru-1/?page=1"}
