{"authors":["Jaime Dunaway"],"date_download":"2018-10-30 17:49:56","date_modify":"2018-10-30 17:49:56","date_publish":"2018-10-30 00:00:00","description":"Pulaski County Special School District officials have identified the man who was killed Monday after being hit by his own bus.","filename":"data/vaneerConsumption/SchooldistrictIDsemployeekilledinschoolbusaccidentinLittleRock.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/Untitled_collage_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540921796.html","title":"School district IDs employee killed in school bus accident in Little Rock","title_page":"School district IDs employee killed in school bus accident in Little Rock","title_rss":"NULL","source_domain":"arkansasonline.com","text":"At left, Jason Johnson is shown in a photo released by the Pulaski County Special School District. At right, police investigate the scene of a bus accident that killed Johnson on Monday in Little Rock.\nPulaski County Special School District officials have identified the man who was killed Monday after being hit by his own bus.\nJason Johnson, 40, had been a mechanic with the school district for nearly a decade, school officials said in a news release Tuesday that revealed more details about the wreck. He worked for the district from 2007 to 2016 and returned in February of this year, officials wrote.\nJohnson died around 2 p.m. Monday after being called to Treasure Hill Road to fix a mechanical problem on one of the district's Career-Based Initiative buses.\nStudents got off the bus and re-entered once the repairs were complete, the release states.\nOfficials said Johnson then got back on the bus he had driven to the scene and started traveling toward Towne Oaks Drive. He stopped a short time later and apparently got out to check something, and the bus \"somehow\" began rolling down the street, according to the release.\nJohnson ran alongside the bus in an attempt to get inside and stop the vehicle, but he was hit and killed on impact, officials wrote.\nNo students were on the bus when it crashed into a tree.\nThe school system's director of transportation said the school bus accident was the district's first that resulted in a fatality.","url":"https://www.arkansasonline.com/news/2018/oct/30/school-district-identifies-employee-killed-little-/"}
