{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:32:39","date_modify":"2018-10-30 22:32:39","date_publish":"2016-01-06 08:00:00","description":"Gov. Jerry Brown will propose another healthy budget on Thursday that will be vetted and adopted by the Legislature in June. That’s good news for K-12","filename":"data/vaneerConsumption/Schoolbudgetsaregrowingbutsoarepensionpayments.json","image_url":"https://calmatters.org/wp-content/uploads/vallejohigh_0181.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938759.html","title":"School budgets are growing, but so are pension payments","title_page":"School budgets are growing, but so are pension payments | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Gov. Jerry Brown will propose another healthy budget on Thursday that will be vetted and adopted by the Legislature in June. That’s good news for K-12 public education, which accounts for more than 40 percent of state funds. So why aren’t school district officials jumping up and down?\nOne reason is the growing pension contributions for 880,000 working and retired teachers and administrators in the California State Teachers Retirement System. The retirement system has an unfunded liability of more than $67 billion as of last June. Under a schedule for paying down the debt that Brown and legislators approved in 2014, school district contributions to the teacher pension system will ramp up from 8.25 percent of their budgets in 2013 to 19.1 percent in the fiscal year that begins July 2020. The agreement also raised teacher and state contribution rates, but only slightly.\nThis means taxpayers who contributed $3.6 billion into CalSTRS through the state and local school districts back in the 2013-14 fiscal year, will see those payments more than double to $7.7 billion by 2019-20, according to projections by the Legislative Analyst’s Office, the Legislature’s nonpartisan budget analyst. The total school budget for the current fiscal year is $69 billion.\nThe increased pension payment is projected to consume about 38 percent of growth in the education budget between now and 2019. In other words, school districts will pay $3.1 billion more to the pension system in 2019-20 than they do today while the state’s minimum school funding guarantee, called Proposition 98, is projected to be about $8.3 billion higher in that same year.\nPensions projected to consume 38 percent of education growth\nIf, however, California slips back into recession, the legislative analyst warned that district pension costs could consume more than the Proposition 98 growth and force districts to cut elsewhere. That’s the scenario the state grappled with during the Great Recession, forcing layoffs, furloughs and service cuts to students.\nHow will this change affect schools?","url":"https://calmatters.org/articles/school-budgets-are-growing-but-so-are-pension-payments/"}
