{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 00:16:22","date_modify":"2018-10-23 00:16:22","date_publish":"2017-03-16 09:24:45","description":"Teigahn Sangster, 11, claims she was handed the small caramel frappuccino with the word 'fato' written on the cup in the Starbucks at a retail park Fort Kinnaird in Edinburgh.","filename":"data/vaneerConsumption/Schoolgirl11hasfatwrittenonStarbuckscup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E532CD400000578-0-image-a-47_1489656960925.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319342_Schoolgirl-11-fat-written-Starbucks-cup_1540253782.html","title":"Schoolgirl,11,has 'fat' written on Starbucks cup","title_page":"Schoolgirl,11,has 'fat' written on Starbucks cup | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A size eight schoolgirl was left 'mortified' when a Starbucks barista allegedly wrote 'fat' on her cup instead of her name.\nTeigahn Sangster, 11, claims she was handed the cup in the Starbucks at the retail park Fort Kinnaird in Edinburgh.\nThe employee allegedly daubed 'fat' or 'fato' on the small caramel Frappuccino ordered by nine stone Teigahn.\nThe upset schoolgirl then phoned her mother from the shop and when told to bring the cup home, said: 'It doesn't matter mum, I am fat'.\nTeigahn Sangster, 11, (right) claims she was handed the cup in the Starbucks at retail park Fort Kinnaird in Edinburgh\nThe employee allegedly daubed 'fat' or 'fato' on the side of the cup after Teigahn ordered a small caramel Frappuccino\nStarbucks has confirmed it is 'urgently investigating' the matter.\nTeigahn from Joppa, Edinburgh, said: 'I felt really shocked when I saw what was written.\n'As we sat down my friend first spotted it and said 'that's rude'. I felt really embarrassed, upset and angry by it.\n'What if they'd written it for someone who was bigger? They would feel quite hurt by it and think they had a point - it would scar them for life.'\nTeigahn said she had been looking forward to the trip with her friend as it was the first time they'd gone without adult supervision.\nShe added: 'I'd been excited to go as it was the first time we'd gone on our own and felt really grown up but after seeing what was written I just wanted to go home - it really spoiled it for me.\n'I'm normally a big fan of Starbucks but I won't go back in now. I think the staff need better training.'\nThe 11-year-old was with a friend on her first ever trip to the coffee shop unaccompanied\nThe upset schoolgirl then phoned her mother from the shop and when told to bring the cup home, said: 'It doesn't matter mum, I am fat'\nTeigahn (pictured with her father Kevin), was described by her family as an active girl who is a healthy size for her age\nTeigahn's outraged mother Dionne Ford said she was 'disgusted' by what happened to her daughter.\nThe 34-year-old said: 'I was furious when I heard what had happened - especially on her first trip alone.\n'She phoned me from the café to tell me what had happened and I told her to bring the cup home.\n'She told me 'it doesn't matter mum, I am fat'.\n'It was really upsetting to hear - it made her feel so little and knocked her confidence, I think it's terrible.\n'She's tried to bury it under the carpet but she was obviously very embarrassed - it's bullying.\n'Children of this age are so impressionable and many are taking their own lives from bullying and name calling, it's disgusting.'\nThe mother-of-two said Teigahn is an active girl who is a healthy size for her age.\nTeigahn's outraged mother Dionne Ford (pictured) said she was 'disgusted' by what happened to her daughter\nShe said: 'She's tall for her age, 5ft 5, and is well developed already but she's not fat by any stretch of the imagination.\n'She wears adult size eight clothing and regularly goes horse riding and indoor rock climbing - she's a really active girl.\n'I used to go to Starbucks every single day but I haven't been back since this happened and I won't be any time soon.\n'The staff need extra training and if it was done as a personal attack that person should be reprimanded, it's completely disgusting.'\nA Starbucks spokesman said: 'We were concerned to learn of this as it is not indicative of the friendly service we provide in our stores. We are very sorry for the upset this has caused the family.\n'Following our investigation, we want to reassure that our store team did not write this intentionally.\n'It was originally crossed through and the circle is an indication that the partner (employee) hasn't captured the name correctly. We would like to get in touch with the family directly to explain and apologise.'\nA spokesman for eating disorder charity Beat said: 'Eating disorders are serious mental illnesses and their causes are complex - they're now understood to be caused by a combination of a biological predisposition and an environmental or social trigger, with bullying being one possible example of this.\n'We are also aware that low self-esteem and poor body image, which may be caused by comments like these, can contribute to and perpetuate the illness.\n'It is important that as a society we strive to promote healthy body image from a young age, and to celebrate people for what they do, rather than how they look.'","url":"https://www.dailymail.co.uk/news/article-4319342/Schoolgirl-11-fat-written-Starbucks-cup.html"}
