{"authors":["Jessica Calefati","David Gorn","Matt Levin","Ben Christopher"],"date_download":"2018-10-30 22:52:41","date_modify":"2018-10-30 22:52:41","date_publish":"2016-11-22 08:00:28","description":null,"filename":"data/vaneerConsumption/Schoolbuildingbonanzabutnewdollarsmightnotreachpoordistricts.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/SCHOOL_CONSTRUCTION-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939961.html","title":"School building bonanza-but new dollars might not reach poor districts","title_page":"School building bonanza—but new dollars might not reach poor districts | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"It’s tough for California voters to say no to more money for school construction. They almost always approve state bond requests, and this month they passed a $9 billion package that backers promised would help pay for repairs and upgrades needed to preserve students’ access to safe, modern classrooms.\nUnlike previous bonds, however, Prop. 51 was placed on the ballot not by elected lawmakers, but by developers looking out for their own interests. Its approval locks in an outdated system that was designed for a time when the student population was growing, and its application process may limit poor districts’ chances of claiming their fair share of the money.\nInstead of prioritizing projects for needy communities, the state will dole out these bond proceeds the way it always has: on a first-come, first-served basis. Scores of well-off districts are already in line, and small, impoverished ones have no one in their corner helping them navigate the complicated application process. That means some worthy repair projects may never see a dime.\n“Children all across the state are sitting in subpar buildings with leaky roofs and classrooms that can’t support their curriculum,” said Jeff Vincent, who directs UC Berkeley’s Center for Cities and Schools. “Some of those problems may not get fixed any time soon.”\nIt’s widely agreed that California needs more money for school facilities, and that the bond will help pay for projects that have languished. But the problem starts with how the funding is divided among projects.\nOne third of the $9 billion bond’s proceeds will support new construction, another third will finance modernization projects and the rest of it will go to career technical education, charter school and community college buildings. That mix may sound reasonable. But when the state created the School Facility Program in 1998, California’s population was booming and new school construction was needed to keep pace. By contrast, public school enrollment over the next decade is projected to dip slightly.\n“There will be some new construction needs. Some counties are growing,” said Vincent. “But to suggest that we should spend as much on new construction as we spend on modernization is out of skew with our needs on the ground. Demand for upgrades is far greater.”\nThe next problem is how the money is awarded. Districts applying to the state must provide matching funds, giving wealthier communities an advantage because they can tap a deeper well of local taxes.\nAt Hanford Elementary School District, which serves a small farming town in the Central Valley, the wish list includes replacing old electrical wiring in schools that are more than half a century old, improving students’ access to computers and getting some new fire alarms.\nAnticipating voter approval of Prop. 51, Hanford was one of nearly 200 districts across the state that used the November ballot to also seek voter approval of local school bonds.\nThe district’s $24 million bond passed, but Hanford will never qualify for as much state support as Campbell Union School District, located in the heart of Silicon Valley. Voters there approved a $72 million bond, which could mean three times as much state matching money as Hanford—even though the districts serve about the same number of students in roughly the same number of buildings.\nThis disparity isn’t fair to students from Hanford and other needy parts of the state, said Shin Green, an Oakland-based consultant whose firm specializes in school infrastructure financing. “We don’t know where the next doctor or physicist or inventor will come from,” Green said. “Substantial differences in the quality of our facilities mean substantial differences in our kids’ opportunities to learn. And that strikes me as wrong.”\nPoor districts incapable of raising money locally through bonds or developer fees—which communities charge to help pay for new school construction—may ask the state to cover a project’s full cost. But few are familiar enough with the application process to make it work in their favor, Green said.\n“Districts trying to get the septic system fixed or get that bus alternator replaced may not even know who in Sacramento to call for help,” Green said. “I’ve run across districts that assume they can’t get any money and don’t bother applying.”\nStill, Prop. 51 drew support from a large, diverse coalition of interest groups and politicians, including the California Chamber of Commerce, the State Building and Construction Trades Council, and both the state Democratic and Republican parties. Proponents were eager to replenish California’s fund for school construction, which ran dry four years ago after churning through $40 billion in bond money over the last two decades.\nBreaking with recent tradition, this year’s measure was sponsored by two groups that stand to benefit from an incoming wave of school and home building: the Coalition for Adequate School Housing, which promotes new school construction, and the California Building Industry Association, a trade group for developers.\nRepresentatives from both organizations declined a CALmattters request for interviews about their motivations and the need for the bond. Had it failed, districts likely would have raised fees on developers to pay for school projects—either cutting into developers’ bottom lines or prompting them to raise home prices.\nProp. 51’s loudest critic was Gov. Jerry Brown, who called it “a blunderbuss” and said in an interview with The Los Angeles Times that the Legislature could have done a better job than “the developers who put that one together.”\nEarly this year, Brown collaborated with legislative leaders on a much smaller $5 billion bond that would also have changed the way the state distributes the money, prioritizing projects that reduce overcrowding and protect students’ health and safety. But the developers who sponsored the measure refused to change anything about the existing program or even discuss how to improve it, state Department of Finance Director Michael Cohen noted in an October op-ed urging a no vote. “They insisted on the status quo,” he wrote.\nEven so, Chris Funk, who leads San Jose’s East Side Union High School District, says he’s glad the measure passed because school systems such as his can’t wait any longer to get financing for repairs on old pipes, leaky roofs and broken air conditioning systems.\nFunk also rejected the governor’s criticism of the measure’s price tag, which the nonpartisan Legislative Analyst’s Office pegs at $17.6 billion to pay off both the bond’s principal and interest over the next 35 years—via payments of about $500 million annually. “Until the governor starts fully funding education and providing the right money for facilities, I would much rather perpetuate the current system,” he said.\nTucked into Prop. 51 is a key provision that voters likely glossed over: It prohibits the state from modifying the way it allocates school construction funding without another vote of the people.\nOutgoing state Senate Education Committee Chairwoman Carol Liu, D-Glendale, said she opposed the bond, too, and wishes the Legislature could have done more to fix the problem. “We have lost an opportunity to reform a fragmented system of bond administration and disbursement that does not ensure that school districts and communities with the greatest need for new facilities receive funds,” she said.","url":"https://calmatters.org/articles/school-building-bonanzabut-new-dollars-might-not-reach-poor-districts/"}
