{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-23 00:51:30","date_modify":"2018-10-23 00:51:30","date_publish":"2017-04-26 10:49:44","description":"Owen Carey, pictured, died after eating a piece of chicken while in London celebrating his 18th birthday alongside his girlfriend Martha, who cradled him as he passed away.","filename":"data/vaneerConsumption/SchoolboydiedaftereatingapieceofchickeninLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EE4DE00000578-0-image-a-16_1493200782666.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446872_Schoolboy-died-eating-piece-chicken_1540255890.html","title":"Schoolboy died after eating a piece of chicken in London","title_page":"Schoolboy died after eating a piece of chicken in London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A schoolboy died from a massive allergic reaction while on a date with his girlfriend celebrating his 18th birthday - after eating a piece of grilled chicken.\nGrammar school boy Owen Carey, 18, had a severe allergic reaction and tragically passed away as his girlfriend Martha cradled him - in front of the London Eye.\nThe young couple had been celebrating Owen's birthday with a sightseeing tour in the capital.\nPaul Carey, pictured with his son Owen, right, who died after eating chicken has paid a heart-rendering tribute to the teenager who lost his life outside the London eye\nThe lad, who attended top The Skinners' School in Tunbridge Wells, Kent, could not be resuscitated after suffering anaphylactic shock as a result of 'plain' chicken he had eaten earlier in the day.\nHe collapsed in front of the iconic London symbol and died on Saturday lunchtime.\nHis father Paul Carey posted an emotional message on Facebook sharing the heartbreaking news.\nMr Carey said: 'Owen died, in front of the big wheel that is the London Eye, of an anaphylactic reaction to something he had eaten at lunchtime.\n'He died with his girlfriend Martha beside him. Paramedics and others tried to help, but it was all in vain.'\nOwen Carey, pictured, died after eating a chicken dinner in London\nMr Carey said paramedics spent 45 minutes trying to save his son who'd been visiting the capital with his girlfriend to celebrate his birthday.\nOwen was taken to St Thomas' Hospital and his family rushed to his side.\nMr Carey said: 'I received a call from my daughter, Emma, just after 5.30.\n'I was in Devon, and managed to get to the hospital just before 10pm.\n'My elder son, Daniel, was there too, and we were able to see Owen, still in the resuscitation room, with other members of our family.\n'I gave my baby boy lots of hugs and kisses. I held his cold hand. I shall miss him so very, very much.\n'He had turned 18 just two weeks before, on the day before my 60th birthday.\n'Just last Easter weekend we had had a fantastic time together over two days of great fun in my new home in Cornwall.\n'Along with the younger members of our family, Owen and I together had planted an oak sapling in my new fields; he had wanted a palm tree as a joke.\n'I have to make sure that oak grows, as he will now not.'\nIn the emotional post, Mr Carey described the pain he felt at losing his son.\nHe said: 'I felt so full of life then, but just now, I really, really do feel so empty, and it is\nThe teenager, pictured, ate the plain chicken which caused an allergic reaction\ngoing to be a struggle in these next few days, weeks and months, to come to terms with what has happened.'\nHe begged people to share the post, writing: 'Please share this message so that as many people as possible who might have known Owen understand the tragic end to his life.\n'Please think about why he died; a stupid bit of 'plain grilled' chicken cooked the wrong way?\n'Have a look at the websites of any one of the charities supporting people with allergies and anaphylactic reactions, notably, anaphylaxis.org.uk.\n'I am going to help them to raise awareness of this awful problem that really, truly can rob people of their lives.\n'It has robbed me of my son, and I will never, ever, be able to replace him.. He has gone forever.'\nMr Smith said: 'He ate chicken in a restaurant - I'm not sure which one.\n'He didn't like the taste of it so stopped eating it.\n'The reaction built up over the next few hours.\n'He then collapsed in front of the London Eye.'\nMr Smith said that staff from the capital's famous attraction and a passing doctor rushed over to help Owen while they waited for paramedics to arrive.\nPaul said: 'They tried to get oxygen into him but couldn't because of the extreme swelling that had happened.\n'When you have an anaphylactic reaction the body swells and stops the airways.\n'It was a horrible way to go.\n'They took him to hospital but it was too late. According to the hospital staff the reaction was so severe there was nothing they could do.\n'If there had been an Epipen available or if he had had his and taken it early enough that might have saved him.'\nPaul had seen his son two weeks before at a joint birthday party in Cornwall where he lives.\nOwen, who lived with his mother in Crowborough in East Sussex, was celebrating his 18th birthday and Paul was celebrating his 60th.\nHe was allergic to a long list of things including peanuts, different spices and wheat.\nPaul said: 'I can't say it was definitely the chicken but we know he ate chicken.\n'He was very careful about what he ate. He had been well trained by his mother and by myself on restricting his diet.\n'Something went wrong.'\nPaul paid tribute to his son Owen who had an older brother and sister.\nHe said: 'Owen was so full of life and fun. He is going to be sorely missed by so many people.\n'The whole family are completely overwhelmed.'\nOwen had many hobbies including playing the guitar, skiing and rock-climbing.","url":"https://www.dailymail.co.uk/news/article-4446872/Schoolboy-died-eating-piece-chicken.html"}
