{"authors":["Eleanor Harding For The Daily Mail"],"date_download":"2018-10-22 22:14:43","date_modify":"2018-10-22 22:14:43","date_publish":"2017-03-10 00:23:06","description":"In her first major speech as chief inspector of schools, Amanda Spielman will hit out at the ‘scandal’ of heads who jeopardise British children’s education to boost their own performance ratings.","filename":"data/vaneerConsumption/SchoolstrytogameleaguetablessaysnewOfstedchief.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3BFF9BD700000578-0-image-a-50_1489103797319.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299440_Schools-try-game-league-tables-says-new-Ofsted-chief_1540246483.html","title":"Schools try to 'game' league tables, says new Ofsted chief","title_page":"Schools try to 'game' league tables, says new Ofsted chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In her first major speech as chief inspector of schools, Amanda Spielman (pictured) will hit out at the ‘scandal’ of heads who jeopardise children’s education\nToo many schools are trying to ‘game’ the system by entering pupils for ‘Mickey Mouse’ qualifications to move up league tables, the new Ofsted head will warn today.\nIn her first major speech as chief inspector of schools, Amanda Spielman will hit out at the ‘scandal’ of heads who jeopardise children’s education to boost their own performance ratings.\nShe is also expected to launch a major Ofsted investigation into whether schools are using the curriculum to give children a broad enough education.\nOfsted has found some schools are entering children for easy, non-academic qualifications in an effort to ensure they get better grades.\nOthers are even taking poor-performing pupils off their role so that their low grades do not impact on the school as a whole, the watchdog has found.\nThe Government has tried to crack down on this practice by introducing new performance measures which assess schools’ ability to produce improvement in key academic subjects.\nBut speaking to school leaders at the annual Association of School and College Leaders conference, Mrs Spielman said many schools are still using tricks at the expense of pupils.\nShe is expected to say: ‘We know that there are some schools that are narrowing the curriculum, using qualifications inappropriately, and moving out pupils who would drag down results.\n‘That is nothing short of a scandal. Childhood isn’t deferrable. Young people get one opportunity to learn in school, and we owe it to them make sure they all get an education that is broad, rich and deep.’\nOfsted has previously found that some schools have been entering pupils for multiple qualifications with overlapping subject content.\nOthers have been telling pupils to take the European Computer Driving Licence (ECDL) qualification, an easy computer literacy course.\nMrs Spielman believes there is a conflict between a head teacher’s desire to give pupils the right education for their future success, and the desire to improve their school’s league table position.\nShe will say: ‘There is more to a good education than league tables. Vitally important though a school’s examination results are, we must not allow curricula to be driven just by SATs, GCSEs and A-Levels.\n‘It is the substance of education that ultimately creates and changes life chances, not grade stickers from exams.\nOfsted has found some schools are entering children for easy, non-academic qualifications in an effort to ensure they get better grades (stock photo)\n‘So I am determined to make sure that the curriculum receives the proper focus it deserves.’\nMrs Spielman will make clear that she does not believe the curriculum has received enough attention during inspections in recent years.\nTo correct this, Ofsted will investigate how maintained schools translate the National Curriculum into effective classroom teaching and how academies design their own curriculum.\nIt follows a previous warning by Ofsted over easy qualifications such as AS levels in ‘use of maths’ and ‘creative writing’.\nCritics have long argued that these qualifications are unlikely to be valued by employers and good universities.\nThe elite universities that make up the Russell Group favour traditionally more rigorous courses such as maths, English, the sciences and languages.\nOfsted has said that encouraging whole year groups to take marginal qualifications amounted to gaming and would be noted in inspections.\nIt is understood that schools guilty of the practice will be marked down during inspections when the ability of their leaders and how well the schools prepare children for their futures is assessed.","url":"https://www.dailymail.co.uk/news/article-4299440/Schools-try-game-league-tables-says-new-Ofsted-chief.html"}
