{"authors":[],"date_download":"2018-10-22 21:50:31","date_modify":"2018-10-22 21:50:31","date_publish":"2014-05-07 23:22:00","description":"Obama Cabinet members spell out the do's and dont's regarding enrolling schoolchildren, regardless of immigration status.","filename":"data/vaneerConsumption/SchoolsToldToStopBarringKidsBasedonImmigrationStatus.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/428761/20140508-schools-hallway-sl-0929_632ddec73b9df3cc30d4c079e66feb02.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_schools-told-stop-barring-kids-based-immigration-status-n99891_1540245031.html","title":"Schools Told To Stop Barring Kids Based on Immigration Status","title_page":"Schools Told To Stop Barring Kids Based on Immigration Status","title_rss":"NULL","source_domain":"nbcnews.com","text":"Two members of the Obama Cabinet issued a firm reminder to America's schools that all children are entitled to a public education regardless of their immigration status.\nAttorney General Eric Holder and Education Secretary Arne Duncan said Thursday that despite \"guidance\" to schools in 2011 detailing educators' responsibilities on enrolling children, \"we have continued to hear troubling reports of actions being taken by school districts around the country that have a chilling effect on student enrollment, raising barriers for undocumented children and children from immigrant families who seek to receive the public education to which they are entitled.\"\nThose actions and polices not only harm innocent children but also \"markedly weaken our nation\" by leaving young people unprepared and ill-equipped to succeed and contribute,\" Holder said, quoting from the landmark Plyer v. Doe case.\nThe 1982 Supreme Court decision makes clear the legal requirement that “the undocumented or non-citizen status of a student (or his or her parent or guardian) is irrelevant to that student’s entitlement to an elementary and secondary public education.\" Such discrimination is prohibited under provisions of the Civil Rights Act of 1964, the guidance states.\nEducation Secretary Arne Duncan said the department's Office of Civil Rights has received 17 complaints since the 2011 guidance was issued. Those complaints were in Arizona, Colorado, Kansas, Louisiana, Michigan, Missouri, New Mexico, North Carolina, Ohio, South Carolina, Virginia and Washington, D.C., the department said. \"In several instances, school leaders are inappropriately requiring information that may be barring or discouraging students from ever enrolling in school,\" Duncan said.\n\"The message here is simple and it's crystal clear: let all, all children living in the district enroll in public schools,\" he said.\nAccording to the Southern Poverty Law Center schools often don’t outright deny enrollment but use tactics such as asking for hard to get documents, requiring Social Security numbers, tell parents their children are too old to enroll in some classes or require families to fill out complex paperwork written in English.\nThe Southern Poverty Law Centerfiled a complaint in February with the Justice Department against two North Carolina school systems that were turning away immigrant children. The SPLC also had complained to a superintendent of an Alabama school system over denying a 17-year-old Latino student enrollment. In 2012, Alabama had passed a law requiring schools to check immigration status. It was struck down, but not before some Latino schoolchildren withdrew or stayed away from school.\nThe SPLC has said it has received other reports of enrollment denials, but families have been too afraid to complain.\nAccording to the SPLC, schools often don’t outright deny enrollment but use tactics such as asking for hard to get documents, requiring Social Security numbers, telling parents their children are too old to enroll in some classes or requiring families to fill out complex paperwork written in English.\nThe Justice and Education Department also has undertaken investigated procedures for 200 districts in Georgia, working with the districts and state to correct problems.\nJerri Katzerman, the center’s deputy legal director, said while Holder and Duncan were not saying anything new or novel in their reminder to the schools, “the fact that they have reached out to reinforce equal access to education is very important.”\nThe administration's defense of immigrant schoolchildren and children of immigrants, including those not legally in the U.S., provides a chance for the Obama administration to reaffirm its support for immigrants, even as many in the community have been protesting his immigration enforcement policies.\nBut Jocelyn Samuels, acting assistant AG for civil rights, said the agencies have been working on the issue for three years. Philip Rosenfelt, acting general counsel of the Department of Education, said the guidance release coincides with schools' preparation for next school year's enrollment.\nThe guidance states:\n_ Students are not barred from enrolling in public schools on the basis of their citizenship or immigration status or that of their parents or guardians.\n_ Districts may not request information with the intention of denying access to public schools on the basis of race, color or national origin.\n_ A school may not bar a student from enrolling because he or she lacks a birth certificate or has records indicating a foreign birthplace.\n_ Schools may not deny enrollment if a student, parents or guardian lacks or chooses not to provide a Social Security number.\nThe administration made clear that school districts may require proof of residency that students or their parents live in the districts, but asking citizenship status is prohibited.\nThe officials suggested school districts check their enrollment data for any precipitous drops in types of students, which may be a signal of barriers to their attendance.","url":"https://www.nbcnews.com/news/latino/schools-told-stop-barring-kids-based-immigration-status-n99891"}
