{"authors":[],"date_download":"2018-10-30 21:00:41","date_modify":"2018-10-30 21:00:41","date_publish":"2015-09-16 09:49:47","description":"A recent news article considered complaints that school uniforms in public schools were somehow racially discriminatory.","filename":"data/vaneerConsumption/SchooluniformsareraciallydiscriminatoryHuh.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/09/16/Images/photos.medleyphoto.8158670.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_school-uniforms-are-racially-discriminatory-huh__1540933241.html","title":"School uniforms are racially discriminatory? Huh?","title_page":"Complaints that school uniforms are inherently racist ring hollow","title_rss":"NULL","source_domain":"ajc.com","text":"A recent news article considered complaints that school uniforms in public schools were somehow racially discriminatory.\nStatistics show that nationally black and Hispanic students have to wear uniforms more often than white students. The AJC found that about half of black students and a quarter of Hispanic students in metro Atlanta must wear uniforms while only one in 20 white kids do.\nThe worry is that minority kids already get dinged with disciplinary infractions more than white kids and that the uniforms will just be one more way to get them in trouble.\nMy response? Pul-leeze. For 20 years, and a total of 51 kid-tuition years, I have paid dearly for the privilege of having my kids wear uniforms. It’s worked out well and is money well spent.\nI know it’s apples and oranges comparing Catholic schools and public schools, so I’ll return to my point: the fact that minority kids more frequently must wear uniforms is not discriminatory. It may be a stab in the dark by parents and school officials looking for ways to improve learning and discipline. And it may or may not work. But it’s not racism.\nRacism manifests itself sometimes in police conduct or in housing patterns or hiring. But is it racist to make kids in underperforming schools don uniforms? Come on. Making such claims dilutes a real issue.\nRequiring students to wear uniforms is akin to requiring them to sit up straight. It won’t necessarily do it, but it grabs their attention, reminds them that they aren’t just hanging out. It could make them feel like they are part of a team, part of something bigger than themselves. It also reminds them adults are in charge. The whole effort gained traction back in 1996 when President Bill Clinton endorsed the idea.\n‘Everyone’s civil rights became an issue’\nIn the story I referenced, my colleagues Rose French and Molly Bloom spoke with an angry Cobb County mother whose kid was taken out of class for wearing a pink blouse and another who complained about the cost of buying another set of clothes.\nThere is, of course, an academic who’s an expert on this. The story quoted David L. Brunsma, a sociology professor at Virginia Tech who has written extensively on the subject of school uniforms.\n“The (uniform) policy itself is not a racist policy. But it is being implemented in a racist fashion,” Brunsma said. “Uniforms within the public school system have actually ended up being a kind of marker of disadvantage. Meanwhile out in the suburbs or the predominantly white schools … the student bodies are kind of free to express themselves.”\nJessie Goree, a retired teacher and a Clayton County school board member, chuckled at the free expression argument.\n“Because we’re a public school, we’ll have a few parents who want to buck the system and argue their constitutional rights,” she said. “It used to be there was a pretty good dress code. Then, all of a sudden, they let students do what they want. And then everyone’s civil rights became an issue.”\nOddly, perhaps fittingly, I first met Goree in a hallway in the Clayton County courthouse during the trial of Sheriff Victor Hill, who was acquitted of corruption charges. Also in that crowd was “General” Larry Platt, the Atlanta civil rights activist whose claim to fame was “Pants on the Ground,” his video ode to fashion that went viral. “Pants on the ground. Pants on the ground. Lookin’ like a fool with yo pants on the ground.”\nGoree and Platt were like-minded on that issue.\n‘I can’t be looking cute in khakis’\nSagging pants may have been one reason the Clayton school board decided in 2008 to go to uniforms. But at the time, attire was just a symptom of something much larger, much worse. The school district, and the county as a whole, was circling the drain. Goree was elected in August 2008, the same month the district’s accreditation was stripped. Later, that November, four Clayton teens were killed in separate violent episodes, a couple of them seemingly gang-related.\nThe uniform vote was a desperate grab at normality. It didn’t add teachers or boost their pay or mend the curriculum. It was doing something cheap and visible, a move that said, “We are trying.”\n“It was just a matter of trying to change the climate,” said Goree.\nA sophomore at the time made the administration’s point when she told a reporter, “I can’t be looking cute in khakis.” Precisely! It’s the same reason the Atlanta Olympics decided to have female volunteers wear those godawful skorts — they didn’t want cads from France or New York to be leering at their bottoms.\nUniforms also improve safety, they say. Teachers can pretty quickly figure out who belongs in a school and who doesn’t.\nAnd, I suppose, uniforms cut down on bullying. Would-be ruffians have a pretty hard time coming across as tough when dressed in khakis and a polo.\nProfessor Brunsma says mandating uniforms is like merely slapping loud paint on a deteriorating house. His research found no significant effects on behavior, absenteeism or on whether students gave a hoot. Other studies say differently, like one by the University of Houston, which said uniforms help language scores and attendance among middle and high school students.\nSo, pick your study. You’ll probably be right.","url":"https://www.ajc.com/news/local/school-uniforms-are-racially-discriminatory-huh/bDpbfFOlxdgjBMKmVKivKP/"}
