{"authors":[],"date_download":"2018-10-30 20:11:20","date_modify":"2018-10-30 20:11:20","date_publish":"2017-03-09 01:48:00","description":"Clayton County middle school students say they found a video of their history teacher’s 6-year...","filename":"data/vaneerConsumption/Schooldistrictinvestigatingclaimsofchildpornfoundontablet.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/08/Images/schoolinvestigation.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_tablet-had-_a00c6a4193292e11f387587640f0e3b6__1540930280.html","title":"School district investigating claims of child porn found on tablet","title_page":"School district investigating claims of child porn found on tablet","title_rss":"NULL","source_domain":"ajc.com","text":"Clayton County middle school students say they found a video of their history teacher’s 6-year-old child performing explicit, illegal sex acts, Channel 2 Action News reported.\nThe Babb Middle School teacher has not been in the classroom since the incident was reported Friday, the news station reported. The school is located in Forest Park.\nAccording to Channel 2, the teacher passed out tablets during class for the students to work on. That’s when one of the students alleged they discovered a video of the teacher’s child performing a sex act.\nThe principal was allegedly notified after three class periods had watched the video. One parent told Channel 2 several pornography sites were found in the tablet’s history.\nStudents at a Clayton County middle school say they found disturbing images on a tablet they use for learning, and now the district is investigating their teacher. (www.accessatlanta.com)\nSome parents say no one has notified them of the allegations .\n“Nothing has came home regarding this information,” parent Shannon Robinson told Channel 2. “This is the first I'm hearing about it and I'm very upset about this.”\nThe Division of Family and Children Services removed the teacher’s children from her home, the station reported. The teacher has not been identified.\nClayton County Public Schools spokeswoman Jada Dawkins confirmed the district is investigating the allegations.","url":"https://www.ajc.com/news/crime--law/tablet-had-child-pornography-students-clayton-county-school-say/tCprV1gxGuR3e6nO9DefjO/"}
