{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:03:43","date_modify":"2018-10-30 18:03:43","date_publish":"2018-07-16 19:28:09","description":"During a press conference on Monday, Senate Majority Leader Chuck Schumer (D-NY) stated President Trump has put Russia's interests over America's and | Video","filename":"data/vaneerConsumption/SchumerTrumpPuttingRussiasInterestsoverAmericasMillionsofAmericansWillWonderifPutinHasDirtonTrump.json","image_url":"https://media.breitbart.com/media/2018/07/Schumer-716-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_07_16__1540922623.html","title":"Schumer: Trump Putting Russia's Interests over America's, Millions of Americans Will Wonder if Putin Has Dirt on Trump","title_page":"Schumer: Trump Putting Russia's Interests over America's, Millions of Americans Will Wonder if Putin Has Dirt on Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During a press conference on Monday, Senate Majority Leader Chuck Schumer (D-NY) stated President Trump has put Russia’s interests over America’s and “Millions of Americans will continue to wonder if the only possible explanation for this dangerous behavior is the possibility that President Putin holds damaging information over President Trump.”\nSchumer said, “Americans have never seen a president of the United States support an adversary the way President Trump has supported President Putin. For the president of the United States to side with President Putin against American law enforcement, American defense officials, American intelligence agencies, is thoughtless. It’s dangerous. It’s weak. The president is putting himself over our country. Starting with the president’s trip to NATO, ending with his shameful performance at today’s press conference, President Trump has strengthened our adversaries while weakening our defenses and those of our allies. A single ominous question now hangs over the White House, what could possibly cause President Trump to put the interests of Russia over those of the United States? Millions of Americans will continue to wonder if the only possible explanation for this dangerous behavior is the possibility that President Putin holds damaging information over President Trump.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2018/07/16/schumer-trump-putting-russias-interests-over-americas-millions-of-americans-will-wonder-if-putin-has-dirt-on-trump/"}
