{"authors":[],"date_download":"2018-10-22 23:17:01","date_modify":"2018-10-22 23:17:01","date_publish":"2015-03-20 00:00:00","description":"Researchers who helped develop powerful techniques warn that tweaking the genome is now easy. More public debate's needed, they say, before making changes in genes passed from parent to child.","filename":"data/vaneerConsumption/ScientistsUrgeTemporaryMoratoriumOnHumanGenomeEdits.json","image_url":"https://media.npr.org/assets/img/2015/03/20/climbing-dna_wide-f0b7b810f1738c49a24c015d41c6520d7e684754.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=394311141_1540250221.html","title":"Scientists Urge Temporary Moratorium On Human Genome Edits","title_page":"Scientists Urge Temporary Moratorium On Human Genome Edits : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MELISSA BLOCK, HOST:\nLeading biologists and bioethicists are sounding an alarm about new technology that could allow scientists to alter the human genetic code for generations. Researchers are calling for a worldwide moratorium on any attempts to do that. At least until there's been time for a lot more research and discussion. And NPR science correspondent Rob Stein joins me now to talk about this. Rob, let's start first by talking about the science involved. What exactly is it that's prompted this concern?\nROB STEIN, BYLINE: Well, Melissa, as you know, scientists have known for a long time how to manipulate human DNA, how to do genetic engineering, what they call genetic editing. But it's only been limited to really highly-skilled geneticists were the people who could do this because it was really hard, really slow and really expensive. But what's happened is scientists have developed some new techniques that make it much faster, much cheaper, much easier to make very precise changes in human DNA. And for that reason a lot more people can do it.\nBLOCK: A lot more people can do it and that raises all sorts of ethical concerns, right?\nSTEIN: That's right. Scientists are really excited about this technology because they might be able to use it to do all sorts of good things and even perhaps to cure human diseases. The big worry is about something called germline genetic modification. And that involves changing the genes in a sperm, an egg or an embryo. And that's long been considered taboo in science - off limits.\nBLOCK: OK, well, let's break that down a little bit - the germline genetic modification that you're talking about - and why specifically that raises kinds of problems.\nSTEIN: Well, there's a long list of concerns about that. The big one is that this is all very new and scientists really, really don't know how well it works yet or how safe it is. And they can make some kind of mistake and that can end up introducing some new disease into the human genetic blueprint that would be passed down for generations. Another concern is that this could open the door to what a lot of people call designer babies. Where if you let people do this, say, to cure disease, what's to stop them from trying to do this to make a baby that's smarter or taller or a better athlete? And that gets into this whole new \"Brave New World\" issue of, you know, genetically engineering the human race.\nBLOCK: Now, we mentioned the worldwide moratorium that some are calling for - explain what that's about.\nSTEIN: Yeah, so over the last week there's been several groups of scientists who have issued statements about this, basically warning about this, including one that came out this week that included a scientist who developed that technique I mentioned earlier - CRISPR. And what they're saying is wait a minute. We need to take some time to really think about this, talk about it, do some more research and make sure it's safe and to air all these issues that it raises. Another group of scientists last week issued a similar statement in which they actually went a step further and said we should not only not let anybody try genetic modification on the human germline, we shouldn't even be doing the basic research in the laboratory on eggs and embryos that could lay the groundwork for doing this sort of thing in the future.\nBLOCK: So there's some division among scientists on this question.\nSTEIN: Right, I spoke to several of these scientists today. And scientists in one group are saying look, this is really important technology and we should be able to use it in the laboratory to see what we could learn. It could provide lots of really important insights into human biology, cures for infertility, stem cell research. But another scientist I spoke with said look, if you do that and you let scientists do these experiments and publish them in the scientific literature, you're basically giving rogue scientists out there the formula to do exactly what we're all worried about.\nBLOCK: Would a worldwide moratorium be enforceable in any way?\nSTEIN: That's a very good question, and, really, it would not be enforceable. In countries like the United States and in Europe there are regulatory bodies like the Food and Drug Administration that could prevent this sort of thing from happening. But the idea is that by issuing these statements, if we can create a scientific consensus, it would sort of have the moral authority to really persuade people not to even try this.\nBLOCK: OK, NPR's Rob Stein. Rob, thanks so much.\nSTEIN: Oh, sure, nice to be here.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=394311141"}
