{"authors":["Associated Press"],"date_download":"2018-10-22 21:15:29","date_modify":"2018-10-22 21:15:29","date_publish":"2016-01-28 07:05:44","description":"RIO DE JANEIRO (AP) — The release of new figures apparently finding fewer cases of microcephaly in Brazil than first feared is adding force to calls for more...","filename":"data/vaneerConsumption/ScientistsMoreresearchneededintoZikamicrocephalylink.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:2a34d45c55cd442399577f5a93abdd8b-2vdWmEltwXfba0ce28e63254a8a5-868_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420371_Scientists-More-research-needed-Zika-microcephaly-link_1540242929.html","title":"Scientists: More research needed into Zika-microcephaly link","title_page":"Scientists: More research needed into Zika-microcephaly link | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scientists: More research needed into Zika-microcephaly link\nRIO DE JANEIRO (AP) — The release of new figures apparently finding fewer cases of microcephaly in Brazil than first feared is adding force to calls for more research into the link between the rare birth defect and the spreading Zika virus.\nHealth experts have been looking at 4,180 suspected cases of microcephaly reported since October in Brazil, where authorities said the birth defect could be linked to the virus and announced that 220,000 military personnel were being deployed to help eradicate the Aedes aegypti mosquito that transmits Zika.\nBut on Wednesday, Health Ministry officials said they had done a more intense analysis of more than 700 of those cases, confirming 270 cases and ruling out 462 others.\nMunicipal workers pause to refill the insecticide sprayer during an operation to combat the Aedes aegypti mosquitoes that transmits the Zika virus at the Imbiribeira neighborhood in Recife, Pernambuco state, Brazil, Tuesday, Jan. 26, 2016. Brazil's health minister Marcelo Castro said that nearly 220,000 members of Brazil's Armed Forces would go door-to-door to help in mosquito eradication efforts ahead of the country's Carnival celebrations. (AP Photo/Felipe Dana)\nWhat this means is hard to say, according to some experts. It does not answer whether the tropical Zika virus is causing the babies to have unusually small heads. Nor does it really tell us how big the problem is.\n\"I don't think we should lower our alarm over the Zika outbreak,\" said Paul Roepe, co-director of Georgetown University's Center for Infectious Disease.\nBrazilian officials still say they believe there's a sharp increase in cases of microcephaly and strongly suspect the Zika virus is to blame. The concern is strong enough that the U.S. Centers for Disease Control and Prevention this month warned pregnant women to reconsider visits to areas where Zika is present, and officials in El Salvador, Colombia and Brazil have suggested women stop getting pregnant until the crisis has passed.\nBut the World Health Organization and others have stressed that any link between Zika and the defect remains circumstantial and is not yet proven scientifically. And the new figures were a reminder of just how little is known about the disease and its effects.\nThe arrival of the mosquito-borne illness in Brazil initially caused little alarm as the virus' symptoms are generally much milder than those of dengue. Then late last year, after noting what they said was a spike in the birth defect, Brazilian authorities for the first time asked doctors to report cases of patients in their care. So there are no solid numbers to compare with the new tally.\nIn 2014, only about 150 cases were reported in Brazil in a year — a surprisingly small amount for a large country with nearly 3 million births a year. The United States, with about 4 million births a year, has an estimated 2,500 cases of microcephaly a year, said Margaret Honein, a CDC epidemiologist.\nBrazilian health officials have dismissed the idea there might have been a large number of unreported cases previously. But the rate of recorded microcephaly cases was only a fraction of what some experts thought it ought to be.\nIn establishing a registry, the Health Ministry cast a wide net, including live births, stillborn and miscarried babies, and fetuses shown to have unusually small heads by ultrasound or other diagnostic tests, the ministry said. In subsequent investigations, tests were done to see if the brain had been affected.\nBrazilian health officials did not detail what they found in the 462 cases that were ruled out, but many of them were just premature and under-sized, a health ministry spokeswoman said.\nThe birth defect can be caused by factors such as genetics, malnutrition or drugs. Infections are also a cause although Zika-like viruses have not previously been linked to microcephaly.\nThe CDC's Honein said shifts in the numbers reported out of Brazil were not surprising, and much more investigation is needed.\nShe was echoed by Dr. Ganeshwaran Mochida, a pediatric neurologist at Boston Children's Hospital who specializes in microcephaly.\nHe said 270 confirmed cases \"is still quite a substantial number\" in a country that has been reporting far lower counts.\n___\nMike Stobbe reported from New York City.\nMunicipal workers sprays insecticide to combat the Aedes aegypti mosquitoes that transmits the Zika virus at the Imbiribeira neighborhood in Recife, Pernambuco state, Brazil, Tuesday, Jan. 26, 2016. Brazil's health minister Marcelo Castro said that nearly 220,000 members of Brazil's Armed Forces would go door-to-door to help in mosquito eradication efforts ahead of the country's Carnival celebrations. (AP Photo/Felipe Dana)\nA municipal worker gestures during an operation to combat the Aedes aegypti mosquitoes that transmits the Zika virus in Recife, Pernambuco state, Brazil, Tuesday, Jan. 26, 2016. Brazil's health minister Marcelo Castro says the country is sending some 220,000 troops to battle the mosquito blamed for spreading a virus suspected of causing birth defects, but he also says the war is already being lost. (AP Photo/Felipe Dana)\nA health worker shows larvae of the Aedes aegypti mosquitoes found inside a warehouse during an operation to combat the mosquitoes that transmits the Zika virus in Recife, Pernambuco state, Brazil, Tuesday, Jan. 26, 2016. Brazil's health minister Marcelo Castro says the country is sending some 220,000 troops to battle the mosquito blamed for spreading a virus suspected of causing birth defects, but he also says the war is already being lost. (AP Photo/Felipe Dana)\nA fumigation brigade spray an area of Chacabuco Park in a Aedes mosquito control effort, in Buenos Aires, Argentina, Wednesday, Jan. 27, 2016. Zika virus is spread by the same Aedes mosquito as dengue fever and chikunguya. The U.S. Centers for Disease Control says researchers have found strong evidence of a possible link between Zika and a surge of birth defects in Brazil. (AP Photo/Natacha Pisarenko)\nA fumigation brigade sprays an area of Chacabuco Park in a Aedes mosquito control effort, in Buenos Aires, Argentina, Wednesday, Jan. 27, 2016. Zika virus is spread by the same Aedes mosquito as dengue fever and chikunguya. The U.S. Centers for Disease Control says researchers have found strong evidence of a possible link between Zika and a surge of birth defects in Brazil. (AP Photo/Natacha Pisarenko)\nFILE - Dead insects and larvae float in an empty vase at a cemetery in Cartagena, Colombia, Tuesday, Jan. 26, 2016. Local health workers emptied vases during a campaign to destroy potential hatcheries of Aedes aegypti mosquitoes that transmits the Zika virus at the cemetery as part of a prevention campaign that according to the health ministry has already infected more than 16,000 people in Colombia, and could hit more than half a million. (AP Photo/Reinaldo Reyes)\nThis 2006 photo provided by the Centers for Disease Control and Prevention shows a female Aedes aegypti mosquito in the process of acquiring a blood meal from a human host. Scientists believe the species originated in Africa, but came to the Americas on slave ships. It's continued to spread through shipping and airplanes. Now it's found through much of the world. (James Gathany/Centers for Disease Control and Prevention via AP)\nYoung residents run away and others cover their faces as municipal worker sprays insecticide to combat the Aedes aegypti mosquitoes that transmits the Zika virus at the Imbiribeira neighborhood in Recife, Pernambuco state, Brazil, Tuesday, Jan. 26, 2016. Brazil's health minister Marcelo Castro said that nearly 220,000 members of Brazil's Armed Forces would go door-to-door to help in mosquito eradication efforts ahead of the country's Carnival celebrations. (AP Photo/Felipe Dana)\nA municipal worker sprays insecticide to combat the Aedes aegypti mosquitoes that transmits the Zika virus at the Imbiribeira neighborhood in Recife, Pernambuco state, Brazil, Tuesday, Jan. 26, 2016. Brazil's health minister Marcelo Castro said that nearly 220,000 members of Brazil's Armed Forces would go door-to-door to help in mosquito eradication efforts ahead of the country's Carnival celebrations. (AP Photo/Felipe Dana)","url":"https://www.dailymail.co.uk/wires/ap/article-3420371/Scientists-More-research-needed-Zika-microcephaly-link.html"}
