{"authors":["Cheyenne Macdonald For Dailymail.Com"],"date_download":"2018-10-22 22:15:39","date_modify":"2018-10-22 22:15:39","date_publish":"2017-03-10 00:27:11","description":"Researchers at Pleistocene Park in Siberia are attempting to reintroduce herbivores and even resurrect woolly mammoths to revert Beringia to a grassland that absorbs less heat.","filename":"data/vaneerConsumption/ScientistsrevealplantorestoreSiberiatotheIceAge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EE28700000578-0-image-a-52_1489103874221.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4299470_Scientists-reveal-plan-restore-Siberia-Ice-Age_1540246539.html","title":"Scientists reveal plan to restore Siberia to the Ice Age","title_page":"Scientists reveal plan to restore Siberia to the Ice Age | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At a 50-square mile nature reserve tucked deep in Arctic Siberia, scientists are working on a radical plan to fight climate change by reviving the ancient grasslands of the last Ice Age – and the beasts that once roamed them.\nWhile this period is better known for the glaciers that swathed the continents until 12,000 years ago, the grasslands of the Mammoth Steppe ecosystem also dominated much of the surface.\nResearchers at Pleistocene Park are attempting to reintroduce wild herbivores and even resurrect woolly mammoths to revert Beringia to a grassy landscape that absorbs less heat than the forests there today, in efforts to stop the thawing of Siberia’s permafrost.\nScroll down for video\nOver the years, the trees at Pleistocene Park have been flattened using powerful tank-like vehicles. But, in order to keep the trees from taking over again, the ambitious plans call for the services of hundreds of thousands of woolly mammoths\nHOW IT WOULD WORK It’s thought that the grasslands will reflect more sunlight than the forests that exist today, allowing the winter freeze to penetrate deeper into the crust, and cool the soil beneath. Over the years, the trees at the park have been flattened using powerful tank-like vehicles. But, in order to keep the trees from taking over again, they’ll need to employ large, grazing animals – including resurrected woolly mammoths. The park is so far home to wild horses, bison, and musk oxen, all crucial to the grassland ecosystem. And, it’ll soon need predators. ‘For an ecosystem to be sustainable it must have large heavy grazers, such as elephants, ruminants such as cows and goats, predators such as wolves and tigers etc,’ the park’s website explains. These ecosystems were extremely stable, the post continues, as ‘high animal density only allowed grasses to be the dominating vegetation, since only grasses can sustain active grazing. ‘Shrubs, moss, and trees were either trampled or broken.’\nArctic permafrost is often said to be a climate change ‘ticking time bomb.’\nAs Earth warms and the frozen soil thaws, it threatens to release massive amounts of carbon stored within, which could escape in the form of carbon dioxide and methane.\nIn turn, these powerful greenhouse gasses could trigger runaway climate change.\nSergey Zimov first had the idea to introduce a Mammoth Steppe ecosystem to Beringia decades ago, essentially creating a cold-weather version of the African savannah, The Atlantic reports.\nPleistocene Park, named for an epoch that spanned roughly 2.6 million to 12,000 years ago, was founded in 1996, and is now under the control of Sergey’s son, Nikita.\nIt’s thought that the grasslands will reflect more sunlight, allowing the winter freeze to penetrate deeper into the crust, and cool the soil beneath.\nThis would slow the melting of the permafrost.\n‘To make permafrost colder, all that is needed is to remove heat insulating snow cover, and expose the ground to the extreme negative temperatures of the Arctic,’ the park’s Kickstarter campaign explains in a bid to raise $106,000 for the project.\n‘In the steppe ecosystems, animal density is so high that animals looking for forage trample all the snow in the pastures several times per winter.\n‘This compacts the snow, massively reducing its heat insulating abilities.’\nAt a 50-square mile nature reserve tucked deep in Arctic Siberia, scientists are working on a radical plan to fight climate change by reviving the ancient grasslands of the last Ice Age – and the beasts that once roamed them\nThe park is so far home to wild horses, bison, and musk oxen – all crucial to the grassland ecosystem. And, it’ll soon need predators. As grazing animals eat their way through the grasslands, they are continually producing nutrient-rich waste\nOver the years, the trees at the park have been flattened using powerful tank-like vehicles.\nBut, in order to keep the trees from taking over again, they’ll need to employ hundreds of thousands of woolly mammoths, according to The Atlantic.\nScientists are already working to resurrect the ancient beasts by editing the genes of the Asian elephant, with hopes that natural selection will eventually refine their creation – if they are ever successfully manufactured.\nThe park is so far home to wild horses, bison, and musk oxen – all crucial to the grassland ecosystem.\nAnd, it’ll soon need predators.\nResearchers at Pleistocene Park are attempting to reintroduce wild herbivores and even resurrect woolly mammoths to revert Beringia to a grassy landscape that absorbs less heat than the forests there today, in efforts to stop the thawing of Siberia’s permafrost\nAccording to The Atlantic, Nikita plans to bring in gray wolves, Siberian Tigers, and cold-adapted Canadian cougars – and, if scientists succeed in resurrecting extinct species, they may even bring back cave lions and dire wolves.\n‘For an ecosystem to be sustainable it must have large heavy grazers, such as elephants, ruminants such as cows and goats, predators such as wolves and tigers etc,’ the park’s website explains.\nThese ecosystems were extremely stable, the post continues, as ‘high animal density only allowed grasses to be the dominating vegetation, since only grasses can sustain active grazing.\n‘Shrubs, moss, and trees were either trampled or broken.’\nBRINGING WOOLLY MAMMOTHS BACK FROM THE DEAD Scientists with with Harvard Woolly Mammoth Revival and Revive & Restore are 'using Crispr genome engineering to copy/paste DNA from the mammoth genome into living elephant cell cultures (fibroblasts).' There are three major steps in the process of building the mammoth from an Asian elephant, according to the project. This includes the introduction of blood oxygen release at low temperatures, subcutaneous fat for insulation and fasting, and thick hair. There are three major steps in the process of building the mammoth from an Asian elephant, according to the project. This includes the introduction of blood oxygen release at low temperatures, illustrated above As the work continues, the researchers are reprogramming the fibroblasts into induced pluripotent stem cells (iPSCs), which are 'immortal' Then, they say these can be developed into multiple types of tissues, including red blood cells to test their oxygen carrying capacity under different conditions. This can also be done for fat and hair.\nAs grazing animals eat their way through the grasslands, they are continually producing nutrient-rich waste.\nThis, in turn, acts like fertilizer that allows the grass to regrow.\nWhile the effort has met the criticism of those who argue that the plan is much like ‘playing God,’ the family behind Pleistocene Park points to the many ways in which human society is already doing the same.\n‘For an ecosystem to be sustainable it must have large heavy grazers, such as elephants, ruminants such as cows and goats, predators such as wolves and tigers etc,’ the park’s website explains\nSome cities are already turning to cloud-seeding to induce rain in drought stricken areas, for example.\nAnd, on a much larger scale, some have proposed the radical plan to seed the atmosphere with sun-reflecting aerosols to cool the Earth.\n‘Playing God doesn’t bother me in the least,’ Nikita told The Atlantic.\n‘We are already doing it. Why not do it better?’","url":"https://www.dailymail.co.uk/sciencetech/article-4299470/Scientists-reveal-plan-restore-Siberia-Ice-Age.html"}
