{"authors":[],"date_download":"2018-10-22 21:32:39","date_modify":"2018-10-22 21:32:39","date_publish":"2014-06-05 17:29:03","description":"Conservationists document hundreds of new species in Southeast Asia's Mekong Delta, including beautiful creatures from Myanmar.","filename":"data/vaneerConsumption/ScientistsSpotBeautifulNewSpeciesinSoutheastAsia.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/490156/140605-frog_088c699a645d5be7e13b02de29f9ea86.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_scientists-spot-beautiful-new-species-southeast-asia-n123721_1540243959.html","title":"Scientists Spot Beautiful New Species in Southeast Asia","title_page":"Scientists Spot Beautiful New Species in Southeast Asia","title_rss":"NULL","source_domain":"nbcnews.com","text":"The 26 plants and animals newly identified in Myanmar include a species of dragon fish, which are hugely popular in the Asian aquatic world. The \"scribbled arowana\" is creating a buzz on the aquarium fish blogosphere because of its unheard-of complex, maze-like markings on every individual scale.\nPreviously unidentified by scientists, a ginger plant collected from a single region in the cloud forests of the western state of Rakhine had been hiding in plain sight at local markets, WWF said. And a chocolate-spotted frog, a member of the Amolops family, was discovered in a mountain range that stretches along Myanmar's western border and India.\nWin Myo Thu, co-founder of the local environmental group EcoDev, believes scientists have only scraped the surface of species discoveries in his country.\nIn part because Myanmar was cut off from the rest of the world for such a long time, limiting the ability to carry out a proper inventory, \"there is a huge, huge knowledge gap,\" he said. \"The more research that is done, the more species we are going to find.\"\nMore than 300 other species were discovered in 2012-13 elsewhere in the Mekong Delta region of Southeast Asia, the World Wildlife Fund said in a report titled \"Mysterious Mekong.\" One of them, the Cambodian tailorbird, was documented for the first time in Cambodia's capital, Phnom Penh, during spot checks for the avian flu.\nIn Laos, scientists initially spotted a new species of giant flying squirrel at a bushmeat market. In the same country, they found a species of huntsman spider — the first of its kind in the world without any eyes, something the scientists say is attributable to living permanently without daylight.\n— The Associated Press","url":"https://www.nbcnews.com/science/environment/scientists-spot-beautiful-new-species-southeast-asia-n123721"}
