{"authors":["Nate Church"],"date_download":"2018-10-30 21:34:03","date_modify":"2018-10-30 21:34:03","date_publish":"2017-04-03 20:57:21","description":"The Treatment and Research Institute for Autism Spectrum Disorders is using robots to both study and treat children with Autism Spectrum Disorder.","filename":"data/vaneerConsumption/ScientistsUsingRobotstoStudyHelpChildrenwithAutism.json","image_url":"https://media.breitbart.com/media/2017/04/vanderbilt-robot-autism-youtube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_04_03__1540935243.html","title":"Scientists Using Robots to Study, Help Children with Autism","title_page":"Scientists Using Robots to Study, Help Children with Autism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Treatment and Research Institute for Autism Spectrum Disorders is using robots to both study and treat children with Autism Spectrum Disorder.\nAt Vanderbilt University in Nashville, Tennessee, the institute demonstrated some of their progress with a robot affectionately designated “Russell” as a play on the name of their Robotics and Autonomous Systems Laboratory, or RASL. Robot Russell interacted with two-year-old human Lennon Landry in a simple instructional game.\nHe was one of six children chosen for a 2015 study in “Adaptive Robotic Intervention Architecture for Autism Intervention,” designed to help autistic children learn to look someone in the eye — just one of the many “significant social, communications and behavioral challenges” of autism, according to the CDC.\nVanderbilt Associate Professor of Pediatrics Zachary Warren said that the use of “intelligence systems [and] intelligent data” finally allows researchers to examine a “critical time in development where we had a hard time approaching.” Five out of the six children involved in the study showed improvement by its conclusion, but the work has only just begun. According to Warren:\nA child may not respond to their mother calling their name, but may automatically respond to a robot action or a piece of technology. If we can use that technology to shift how that child responds, then we may have a very valuable system to that child, that family, and maybe for autism intervention.\nBut some remain skeptical. Pediatric neurologist Max Wiznitzer urges readers not to place too much weight on the advances, because “it’s not real life. We don’t interact with robots on a regular basis. We interact with people, and deal with the unpredictability of the people.”\nMeanwhile, Vanderbilt Professor of Mechanical Engineering Nilanjan Sarkar is conducting a study to see whether Autism Spectrum Disorder can be identified in babies within their first year of life. In his words, the study “[gives] stimuli on the audiovisual and on the tactile stimuli … like a mother’s touch.” He cites previous research claims that infants who develop autism might “respond differently” to such stimulation.\nThe “How Babies Respond to Talking and Touch” study places a baby in a car seat, wearing a wrist sensor. A robot tracks their reaction as a video is played of a woman speaking affectionately, while a mechanized makeup brush caresses the child’s arm. The project will track its eight infant subjects for the next few years. If any develop autism, it will be compared to their reactions to see if there is any sign of a link.\nAlong with help from the National Science Foundation, the National Institute of Mental Health, and Vanderbilt University, Warren says that their goal is to “develop and deploy meaningful accelerant technologies,” to accelerate diagnosis, treatment, and fundamental learning for autistic children.\nFollow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.","url":"https://www.breitbart.com/tech/2017/04/03/scientists-using-robots-to-study-help-children-with-autism/"}
