{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 01:44:51","date_modify":"2018-10-23 01:44:51","date_publish":"2017-03-10 10:16:13","description":"Former Durham University lecturer Dr Jeremy Richard Allington-Smith, 59, escaped jail after arguing he had developed hypersexuality, an inability to control impulses, from his medication.","filename":"data/vaneerConsumption/Scientistwhodrewupachildsexabusemanualsparedjail.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E21E5AF00000578-0-image-a-9_1489140933845.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300676_Scientist-drew-child-sex-abuse-manual-spared-jail_1540259091.html","title":"Scientist who drew up a child sex abuse manual spared jail","title_page":"Scientist who drew up a child sex abuse manual spared jail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Durham University lecturer Dr Jeremy Richard Allington-Smith, 59, escaped jail after arguing he had developed hypersexuality, an inability to control impulses, from his medication\nAn scientist who secretly filmed hundreds of women and drew up a 'paedophile manual' has walked free from court after blaming his offending on his medication.\nFormer Durham University lecturer Dr Jeremy Richard Allington-Smith, 59, escaped jail after arguing he had developed hypersexuality - an inability to control impulses - while taking medication for Parkinson's disease.\nDuring that period, the former astrophysicist's heightened sex drive led to him to film women wearing short skirts and shorts in public.\nHe also recorded a woman undressing by placing a camera-phone under a door and downloaded a large number of images of children being sexually abused, as well as drawing similar sketches.\nHe even drew up a manual containing advice regarding the sexual abuse of children, featuring many of his own hand-drawn images.\nDurham Crown Court heard he did seek assistance from his own physician to combat his impulses, but underplayed the extent of his activities.\nHarry Hadfield, prosecuting, said it came to police attention after a student was asked by her landlady to sort through some rubbish to ascertain what material could be recycled.\nIt led to the discovery of a brown envelope containing a large number of pencil sketches featuring children being sexually abused.\nSearches of Allington-Smith's home and university office led to the seizure of computer equipment, on which 3,141 downloaded images were recovered, 688 featuring the most serious forms of abuse.\nDurham Crown Court (pictured) heard he did seek assistance from his own physician to combat his impulses, but underplayed the extent of his activities\nA further 1,792 prohibited images, many hand drawn scenes of child abuse, were found on three storage devices, as well as a 'paedophile manual', containing 4,044 sketch images of abuse.\nMr Hadfield said Allington-Smith's 'clandestinely' filmed footage was found stored on a lap-top, including 360 moving clips taken as he surreptitiously filmed women around Durham city centre.\nWhen interviewed he admitted making the sketches, which he said he did not realise was illegal, claiming it was 'victimless' as no children were actually being abused.\nHe said he drew them in moments of 'idleness', for sexual gratification, while he claimed he could not ascertain the ages of the youngsters in the downloaded abuse images.\nAllington-Smith, 59, subsequently admitted three counts each of making indecent images and possessing prohibited images of children.\nHe also admitted possessing a paedophile manual, voyeurism and doing a series of acts outraging public decency.\nPrior to the case, Brian Russell, representing the defendant, presented medical reports, research results and character references to Judge Christopher Prince.\nTHE SIDE EFFECTS OF PARKINSON'S DRUGS Impulsive and compulsive behaviours are known side effects of taking drugs to help deal with Parkinson's disease. The former is when someone is unable to resist any temptation to carry out activities, while the latter is an urge to act in a certain way. Many don't think about the financial, social or legal consequences before taking adopting new behaviours. Often they revolve around addictions to gambling, shopping, binge eating and overwhelming sexual thoughts. Dopamine agonists, which stimulate nerve cells, are the primary cause but only a small number of patients are affected. Other drugs can also cause the same effects, but there are no figures to suggest how many patients are affected, according to Parkinson's UK.\nJudge Prince said while acknowledging that the offending crossed the custody threshold, he could take the 'exceptional course' of passing a non- custodial sentence.\nHe said: 'It's important the public realises why a man who has committed offences for which they would expect him to go directly to prison, isn't going to go to prison today.'\nFollowing 'a brilliant academic career' during which he has made 'a major contribution' in the field of astrophysics, the judge said the defendant appeared now 'racked with remorse' having willingly submitting himself for psychiatric help and counselling.\nThe judge said eminent physicians confirmed the potential side-effects of the medication taken by Allington-Smith, which, if carefully monitored, could be safely controlled to prevent any repeat of his hypersexual and impulsive behaviour.\nJudge Prince added: 'It's self-evident, if I can have a high-degree of confidence that there won't be any risk of re-offending, then the public can have that confidence, providing there is lengthy engagement with the Probation Service.'\nPassing a three-year community supervision order, the judge warned Allington-Smith if he returned to his offending behaviour he would be jailed.\nAllington-Smith, of Albert Street, Durham, who has resigned from the university as a result of his offending, was made subject of a Sexual Harm Prevention Order 'until further order', and must register a sex offender for five years.\nFollowing the case, a spokesman for the child protection society, the NSPCC, said: 'It is vital to remember that the children in these images are real children who have suffered appalling abuse for the images to be made. Accessing this material fuels the demand for the abuse to continue.\n'It is entirely right that Allington-Smith was brought before the courts for these crimes. We hope through close supervision he is prevented from re-offending.'","url":"https://www.dailymail.co.uk/news/article-4300676/Scientist-drew-child-sex-abuse-manual-spared-jail.html"}
