{"authors":[],"date_download":"2018-10-22 22:49:51","date_modify":"2018-10-22 22:49:51","date_publish":"2014-06-11 01:01:16","description":"Researchers say the craggy appearance of the moon's far side has to do with the way it was formed billions of years ago.","filename":"data/vaneerConsumption/ScientistsExplainWhyMoonsFarSideLooksSoCraggy.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500926/140610-farside_f60e9bc3af9cee9606dae04667e86584.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_scientists-explain-why-moons-far-side-looks-so-craggy-n127991_1540248591.html","title":"Scientists Explain Why Moon's Far Side Looks So Craggy","title_page":"Scientists Explain Why Moon's Far Side Looks So Craggy","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn these days of daily image releases from Saturn, Mars, the moon and other spots in the universe, it's hard to remember just how exciting it was back in the 1950s and 1960s when a few images trickled out to the world at the time. Perhaps one of the biggest early surprises was how jagged and cragged the back side of the moon looked. Where were the smooth lunar \"seas\" that we saw on the Earth-facing side of the moon?\nAbout 55 years after the first Soviet images of the far side were sent to Earth, a team of researchers led by Penn State University's Arpita Roy may have an explanation.\nThey say it’s due to the violent way that the moon formed — likely after a Mars-sized object collided with our Earth, creating a sea of debris that gradually coalesced into the moon we see today. The huge crash and gathering together heated up both our planet and the moon, but the moon got cooler first because it was smaller.","url":"https://www.nbcnews.com/science/space/scientists-explain-why-moons-far-side-looks-so-craggy-n127991"}
