{"authors":[],"date_download":"2018-10-30 14:31:22","date_modify":"2018-10-30 14:31:22","date_publish":"2015-07-11 00:00:00","description":null,"filename":"data/vaneerConsumption/Scientistswarningofglobalcoolingonceagain.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_scientists_warning_of_global_cooling_once_again_1540909882.html","title":"Scientists warning of global cooling once again!","title_page":"Scientists warning of global cooling once again!","title_rss":"NULL","source_domain":"americanthinker.com","text":"Climate scientists are warning that we may be headed into a period of global cooling . If this sounds familiar, it is because it is – global cooling was predicted in the 1970s to recreate another Ice Age. Of course, it didn't happen.\nA new study claims to have cracked predicting solar cycles - and says that between 2020 and 2030 solar cycles will cancel each other out. The new model of the Sun's solar cycle is producing unprecedentedly accurate predictions of irregularities within the Sun's 11-year heartbeat. It draws on dynamo effects in two layers of the Sun, one close to the surface and one deep within its convection zone. Predictions from the model suggest that solar activity will fall by 60 per cent during the 2030s to conditions last seen during the 'mini ice age' that began in 1645, according to the results presented by Prof Valentina Zharkova at the National Astronomy Meeting in Llandudno. The model predicts that the pair of waves become increasingly offset during Cycle 25, which peaks in 2022. During Cycle 26, which covers the decade from 2030-2040, the two waves will become exactly out of synch and this will cause a significant reduction in solar activity.\nNow, I have to admit, I find this theory a little more plausible than global warming. Note that I said \"a little.\" It does make sense that as heat and energy from the sun decline, it gets colder on the Earth – whereas the theory of global warming never made sense, even theoretically, and the only people who believed it were the ones who didn't know the details of the theory.\nHowever, I also remember that the last ice age never happened. And when we consider that climatologists can't predict the weather a week ahead, much less 15 years from now, I think the seriousness of their prediction has to be taken with a grain of salt.\nHowever, if this is the new political viewpoint of the environmental commissars, it raises a big question about global warming. Will the two cancel each other out? If we are in danger of global cooling, don't we need some global warming to balance it, and shouldn't we therefore encourage the burning of fossil fuels? In that case should we not penalize renewable energy companies (wind and solar) with a non-carbon tax, to penalize them for not helping to make the globe warmer?\nAll this reminds me of the book 1984. At one point people were brainwashed to think Eurasia was the enemy, but at a moment's notice they could believe that Eastasia was the enemy instead. It's the same with these environmental fantasies. One day it's warming to be feared, the next cooling.\nMy personal opinion is that the only thing to be feared are the people in charge who are punishing us for their own irrational sense of guilt.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/scientists_warning_of_global_cooling_once_again.html"}
