{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 22:12:07","date_modify":"2018-10-30 22:12:07","date_publish":"2018-06-30 12:54:27","description":"Researchers released a report revealing “ultralow surface temperatures” in East Antarctica that surpass the coldest ever measured. - temperatures | Politics","filename":"data/vaneerConsumption/ScientistsObserveColdestTemperaturesEveronEarthsSurface.json","image_url":"https://media.breitbart.com/media/2018/03/antarctica.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_30__1540937527.html","title":"Scientists Observe Coldest Temperatures Ever on Earth’s Surface","title_page":"Scientists Observe Coldest Temperatures Ever on Earth’s Surface | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Researchers released a report this week revealing “ultralow surface temperatures” in East Antarctica that surpass the coldest temperatures ever recorded on the earth’s surface.\nThe lowest measured air temperature on earth is −89.2 °C (−129 F) on 23 July 1983, observed at Vostok Station in Antarctica, but new data published in Geophysical Research Letters this week, has found that some 100 different locations on the East Antarctic Plateau reached temperatures of -98° C (-144° F) during the Antarctic polar night between 2004–2016.\nA team from the National Snow and Ice Data Center (NSIDC) at the University of Colorado Boulder have identified the East Antarctic Plateau — a massive, empty expanse the size of Australia that begins near the South Pole — as the coldest place on the planet.\nThe East Antarctic Plateau sits some 3,500 m (11,500 ft) above sea level and the air over the Plateau is extremely still, dry and thin, providing an ideal environment for extreme cold.\n“In this area, we see periods of incredibly dry air, and this allows the heat from the snow surface to radiate into space more easily,” said Ted Scambos of the University of Colorado Boulder, lead author of the study.\nEast Antarctica is home to extremely low air and surface temperatures brought on by intense radiative cooling of the snow surface during prolonged wintertime periods of clear sky, weak winds, and very dry atmosphere, the report revealed.\nThe researchers analyzed data from NASA’s Terra and Aqua satellites, as well as the NOAA’s Polar Operational Environmental Satellites, gathered during the Antarctic winters between 2004 and 2016, and found that snow surface temperatures regularly dipped below -90° C (-130° F) across the Plateau, with some 100 spots reaching a lowest temperature of -98° C (-144° F).\n“Approximately 100 sites have observed minimum surface temperatures of ~−98 °C during the winters of 2004–2016,” and the researchers believe that this represents close to the absolute coldest the earth’s surface can get.\n“This temperature appears to be about as low as it is possible to reach, even under clear skies and very dry conditions, because heat radiating from the cold clear air is nearly equal to the heat radiating from the bitterly cold snow surface,” the report states.\nThe coldest temperatures were found where pockets of air sat still for several days, allowing it to reach ultra-cold levels.\nWhile Vostok, Antarctica, still holds the world record for the coldest temperature ever measured by a land-based weather station, the scientists hope to deploy ground-based instruments in the coldest locations of the East Antarctic Plateau in the next year or two.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/politics/2018/06/30/scientists-observe-coldest-temperatures-ever-on-earths-surface/"}
