{"authors":[],"date_download":"2018-10-22 23:17:41","date_modify":"2018-10-22 23:17:41","date_publish":"2014-09-19 00:00:00","description":"Lori Baker uses DNA samples to track down the loved ones of immigrants who died on their journeys. \"I would love not to do this anymore, but I don't think I have it in me not to,\" she says.","filename":"data/vaneerConsumption/ScientistIDsBodiesOfMigrantsHelpingFamiliesFindClosure.json","image_url":"https://media.npr.org/assets/img/2014/09/18/bakernpr_wide-6753031c2f5f1f9d32cb0402b06235908d71399b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=349517129_1540250261.html","title":"Scientist IDs Bodies Of Migrants, Helping Families Find Closure","title_page":"Scientist IDs Bodies Of Migrants, Helping Families Find Closure : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nThousands of people have died trying to cross the border from Mexico into the United States. Countless bodies remain identified, some ending up in unmarked graves in small border town cemeteries. Today on StoryCorps, we hear from a forensic scientist at Baylor University in Texas, who's trying to identify some of these remains and match them with families who are looking for lost relatives. Doctor Lori Baker recently sat down with her husband, Eric Baker, to talk about what she's experienced. In a note of warning, this story contains descriptions some listeners may find disturbing.\nLORI BAKER: I went out on a forensic case and the sheriff had a skull on his office desk. It was the skull of a younger person. And he was using it as a pencil holder. He had pens and pencils in the eye socket of this person. So that's when I decided something had to be done. Now what we do is we go to cemeteries along the border. Sometimes they're multiple individuals in any one grave. We found people in trash bags. And we work to determine who they are. We take DNA samples and go through reports that families have filed to find one little thing that might connect to the case that you're working on. When we have an identification, it's resolution. But the families are going to know the horrible things that happened to their loved one. They die of heat stroke, its exposure. And it's really overwhelming when you're holding them in your hands. And you see the blisters that are on the feet of these individuals. I remember our very first identification. It was a woman. She had two young daughters and she lived with her mom. She couldn't take care of them, so she decided to come to the US so that she could work and send money home. So she paid someone to smuggle her across. And she twisted her ankle. And the group left her behind because she couldn't keep up. Well, her remains came to me. And when it was an identification, I thought, I've got to find out from that mom if it would have been better just not to know, thinking maybe she lived and would home someday. And she said no the hope eats you alive every day. And now, they say they're blessed because they're able to lay flowers on her grave.\nERIC BAKER: Has it gotten any easier?\nL. BAKER: It hasn't. I would love not to do this anymore but, I don't think I have it in me not to; especially when we have an 11-year-old child and I know we probably won't figure out who he is. And his mom's probably grieving somewhere. It's really something that I don't know that I'll ever get over if we don't figure out who he is.\nCORNISH: That's forensic scientist Lori Baker with her husband, Eric Baker, in Waco, Texas. The StoryCorps podcast is on iTunes and at NPR.org.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=349517129"}
