{"authors":[],"date_download":"2018-10-22 22:20:55","date_modify":"2018-10-22 22:20:55","date_publish":"2014-06-09 19:27:20","description":"New research found that over 30 years a 1,000-acre forest would remove 4 to 7 tons of nitrogen oxide annually.","filename":"data/vaneerConsumption/ScientistsExploreUsingForeststoScrubPollutionOutoftheAir.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/497466/140609-pollution-tree-jsw-324p_919f40bf4fe9e36e1314b01da2ea7e0c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_scientists-explore-using-forests-scrub-pollution-out-air-n126601_1540246855.html","title":"Scientists Explore Using Forests to Scrub Pollution Out of the Air","title_page":"Scientists Explore Using Forests to Scrub Pollution Out of the Air","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBefore Houston and its suburbs were built, a dense forest naturally purified the coastal air along a stretch of the Texas Gulf Coast that grew thick with pecan, ash, live oak and hackberry trees.\nIt was the kind of pristine woodland that was mostly wiped out by settlers in their rush to clear land and build communities. Now one of the nation's largest chemical companies and one of its oldest conservation groups have forged an unlikely partnership that seeks to recreate some of that forest to curb pollution.\nThe plan drafted by Dow Chemical and the Nature Conservancy is only in its infancy and faces many hurdles. But it envisions a day when expensive machines used to capture industrial pollutants might be at least partially replaced by restoring some of the groves of native trees that once filled the land.\n\"It looks very promising at the early stage of the research,\" said Mark Weick, director of sustainability programs for Dow. \"But for this to become something that is an emission control, everyone needs to know it works.\"\nMany plants, and especially trees, capture pollution naturally when it hits their leaves. Trees with the biggest leaves and the widest canopies capture the most pollutants, especially nitrogen oxide, a common byproduct of combustion that can irritate lungs and contributes to the formation of ground-level ozone. The reforestation proposal imagines emissions from Dow's largest North American factory drifting downwind into the trees near Freeport, Texas.\nDow and the Nature Conservancy began a six-year, $10 million collaboration in 2011, when they came together to look at ways natural resources could be used to save the company money.\nThe research found that over 30 years a 1,000-acre forest would remove 4 to 7 tons of nitrogen oxide annually, said Timm Kroeger, a senior environmental economist with the conservancy. A traditional mechanical \"scrubber\" removes about 50 to 70 tons annually.\n--- The Associated Press","url":"https://www.nbcnews.com/science/environment/scientists-explore-using-forests-scrub-pollution-out-air-n126601"}
