{"authors":["Scott Neuman"],"date_download":"2018-10-22 21:53:04","date_modify":"2018-10-22 21:53:04","date_publish":"2015-03-20 00:00:00","description":"Suicide bombers strike at two Shiite mosques said to be frequented by supporters of the country's Houthi rebel movement.","filename":"data/vaneerConsumption/ScoresKilledInMosqueAttacksInYemen.json","image_url":"https://media.npr.org/assets/img/2015/03/20/42920421_h35666749_wide-3e608fa9a6c2e2672bd00b1da2ddd69c2b17bab1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_03_20_394239611_mosque-attacks-in-yemen-kill-dozens_1540245184.html","title":"Scores Killed In Mosque Attacks In Yemen","title_page":"Scores Killed In Mosque Attacks In Yemen : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Scores Killed In Mosque Attacks In Yemen\nEnlarge this image toggle caption Khaled Abdullah/Reuters/Landov Khaled Abdullah/Reuters/Landov\nUpdated at 5:50 p.m. ET\nSuicide bombers in Yemen attacked two mosques during Friday prayers in the capital, Sanaa, killing at least 137 people and wounding hundreds more.\nAuthorities believe that three separate suicide bombers carried out the attack on the Badr and al-Hashoosh mosques, according to the local rebel-controlled Al-Masirah television. The BBC says that the two houses of worship \"are used mainly by supporters of the Zaidi [Shiite]-led Houthi rebel movement, which controls Sanaa.\"\nWitnesses quoted by The Associated Press say two bombers hit the Badr mosque — one walked in and detonated his vest, causing worshipers to rush toward the outside gates, where a second bomber blew up.\n\"The heads, legs and arms of the dead people were scattered on the floor of the mosque,\" Mohammed al-Ansi told the AP, adding, \"blood is running like a river.\"\nThe self-declared Islamic State claimed responsibility for the attack on its Twitter account, according to Reuters. The news agency quoted local authorities as saying 137 people had been killed and hundreds wounded.\nAP reports:","url":"https://www.npr.org/sections/thetwo-way/2015/03/20/394239611/mosque-attacks-in-yemen-kill-dozens"}
