{"authors":["Kat Stromquist"],"date_download":"2018-10-30 01:11:05","date_modify":"2018-10-30 01:11:05","date_publish":"2018-10-28 03:48:00","description":"Fresh research about gender in the workplace aims to help Arkansas businesses look more closely at how they're keeping and promoting women in their ranks.","filename":"data/vaneerConsumption/ScorecardaimstohelpArkansasbusinessesattractretainwomeninworkforce.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_28_research-to-key-on-worker-equality-2018__page=2_1540861865.html","title":"Score card aims to help Arkansas businesses attract, retain women in workforce","title_page":"Score card aims to help Arkansas businesses attract, retain women in workforce","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Fresh research about gender in the workplace aims to help Arkansas businesses look more closely at how they're keeping and promoting women in their ranks.\nThe \"Gender Equity Scorecard,\" created by University of Arkansas Clinton School of Public Service graduate student researchers with the Women's Foundation of Arkansas, is an internal assessment geared toward the business community in the state.\nSet to be presented as part of a workplace-equity panel at the Clinton School at noon Tuesday, the score card features a battery of questions intended to help businesses consider whether they're set up for female employees to succeed.\n\"We found that this hadn't been done in Arkansas,\" said Starre Haas, one of the student researchers. \"It's easy to say that you're all for gender equity. But what the score card does, it strives to change the way that businesses think.\"\nWorkplace barriers for women have made headlines in recent years, ranging from high-profile actresses discovering that they're paid millions less than male colleagues, to Facebook Chief Operating Officer Sheryl Sandberg's book urging women to \"lean in\" at the office, to the sexual-harassment scandals associated with the #MeToo movement last fall.\nSome analysts think that a lack of policies geared toward women -- for example, the fact that many workplaces do not offer maternity or family leave beyond unpaid Family and Medical Leave Act time off -- is dragging down women's participation in the economy.\nIn Arkansas, 53.1 percent of women are in the workforce. That's more than 10 percent lower than the percentage of men working and about 5 percentage points lower than the 58.3 percent of women who are in the national workforce, according to a University of Arkansas at Little Rock Arkansas Economic Development Institute report.\nAgainst that backdrop, the research group of Haas, Dylan Edgell, Mariella Hernandez and Christine McCall used surveys, interviews and focus groups involving hundreds of women statewide, as well as models from other states and countries, to design an Arkansas-specific rubric for employers.\nThe score card asks company leaders yes-or-no questions in categories including financial literacy, flexibility, job skills, leadership, mentoring and resources. Questions in the \"flexibility\" category deal with topics such as whether organizations have on-site day care or allow employees to use sick time to care for dependents; \"leadership\" questions have prompts about the gender makeup of company brass and anti-harassment policies.\nEach \"yes\" answer receives a point. The responses in each category are then totaled and weighted to create a \"gender equity score,\" which Anna Beth Gorman said could someday serve as a competitive advantage for companies that want to attract and retain top women employees.\n\"What we hope it will do is just generate the conversation,\" said Gorman, who is the executive director of the Women's Foundation of Arkansas. \"This is not meant to be 'gotcha' or 'this is what you're not doing.' It's basically to understand: Are we offering an environment that women say supports their growth?\"\nA 'BOYS CLUB'\nIn crafting the score card, the research group solicited input from women throughout Arkansas who work in industries including retail, government, architecture and education.\nWhat those women reported wasn't a shock, the researchers said.\nThey found that the challenges for Arkansas women are similar to those found in national research on gender and the workplace -- pay inequity (in which women earn less than men working in the same field), discrimination, limited opportunities for advancement and few accommodations for family life.\n\"In particular, having children held women back in receiving job promotions [or] having to leave the workplace,\" Hernandez said. \"[After having a child], sometimes they were able to come [back], sometimes not at all, [or] sometimes at a different position and salary than they were in before.\"\n\"[There are] just different barriers that prevented women advancing in the same rate and to the same position as men, particularly in the top positions,\" she said.\nRespondents also mentioned a \"boys club\" atmosphere at some Arkansas workplaces, in which women felt excluded from networking events such as golf outings, while others said they had to be cautious about how they presented themselves at the office.\n\"We've heard from women not being able to mention anything about their personal lives,\" Hernandez said. A male worker could offhandedly say he was engaged to be married, but if a woman said that, it could lead to bosses thinking that she could get pregnant and leave her job, Hernandez said.\nOne thing that did surprise researchers was what women said they'd prioritize as a way to remedy the problems.\nFor example, some women in the state said they valued \"flexibility\" as much as salary in a job. They mentioned flexible start times, working remotely, and paid family and sick leave.\nSuch feedback formed the basis for the score card, which tracks as closely as possible the specific needs that women in the state identified, and outlines challenges that the women say many business leaders don't fully appreciate.\nResearcher Edgell said male-dominated leadership at many Arkansas companies can lead to blind spots regarding women's challenges.\n\"When you don't actively search and try to understand some of these issues, some of these leaders may not understand, and [the issues] may not be a priority to solve,\" he said.\n\"I feel like people are just very unaware that this is an ongoing issue,\" Haas said. \"There have been huge strides in the development of gender equity, but there's still a lot of work to be done.\"\nWOMEN SITTING OUT\n\"The inability to balance work and family\" is a big factor that causes women to get out of the workforce, said Chandra Childers, senior research scientist at the Institute for Women's Policy Research. That's especially true \"for women who may be caring not only for children, but for sick or disabled other family members, their own parents, for example,\" she said.\nNationally, women's participation in the labor market peaked in 2000 and has been stagnant or falling since, hindering economic growth, according to reports by The Hamilton Project think tank.\nThe trend is apparent in Arkansas, where a 2016 report by the Institute for Women's Policy Research ranked the state 47th in the nation in terms of women's labor force participation.\nAlso, the Natural State came in at 50th of 51 in rankings for women's median annual earnings and the ratio of women's to men's earnings, scoring a \"D-\" in an overall assessment of employment and earnings.\nAlthough the source of regional disparities in workforce participation is hard to nail down, Childers said not paying women enough to justify the cost of child care is one factor. Another, particularly in more rural states, is not offering good public transportation. Those tend to hold women back from working outside the home.\nMore specific data from the UALR report, created for the Women's Foundation of Arkansas, finds \"dramatic\" county-to-county differences in the state for women in the workforce.\nIn 41 of 75 counties, fewer than half of women work outside the home. In Jackson County, that falls to 30.9 percent, meaning a third of women living in that county are in the workforce. (Rates vary by ethnicity. More black, Asian, Pacific Islander and Hispanic women in Arkansas work outside the home as compared with white women.)\nThe report also found that women in the state are earning more college degrees than men are, but a woman earns $31,790 to a man's $40,867.\nAlthough Sarah Beth Estes -- co-lead researcher, sociology professor and interim dean of the College of Arts, Letters and Sciences -- said more research is needed to analyze specific causes for the UALR findings, helping women participate and succeed in the workforce is important, in part because it can reduce child poverty among Arkansas households headed by women.\nShe said there also is a strong economic-development argument to be made for helping women succeed in the workforce.\n\"For the state, when you don't have an inclusive policy about taking advantage of all of the talent that you have, you are hobbling yourself,\" she said.\nCOMPANIES TAKE NOTE\nGorman, the Women's Foundation of Arkansas executive director, said she's already seeing encouraging signs at some Arkansas businesses regarding their female workers.\n\"We do have companies that are really looking at what is diversity and inclusion?\" she said. \"We are a values-driven state, so everyone can relate to, 'When my daughter goes to work, we want her to be treated fairly.'\"\nShe's especially heartened by what's happening in a few companies in industries not traditionally staffed by women but that offer high-paying jobs, such as in the fields of science, technology, engineering and mathematics, or in the trades.\nOne example, she said, is Baldwin & Shell Construction Co., where Scott Copas, the president and chief executive, says a shift in perspective has led to seven women in senior leadership roles and women making up 14 percent of the company's employees, compared with an average of 4 percent in the overall construction industry.\n\"The change has been significant, and quite frankly, it's just been exciting for us,\" he said.\nAt some of Arkansas' largest private employers, those with more than 5,000 employees, representatives say they are implementing programs with an eye toward retaining women and encouraging their advancement.\nDeb Sinta, Tyson Foods' vice president of talent and culture, said Tyson has six business resource groups to represent traditionally underrepresented employees, of which its women's group is the largest. Its members work on career and leadership development, and community outreach.\n\"What women need, in terms of leadership development, is a little bit different than what men need,\" she said.\nWalmart offers a similar group and sponsors mentoring circles inspired by Sandberg's book Lean In: Women, Work and the Will to Lead. The retailer also offers paid maternity leave and adoption benefits for all full-time hourly and salaried employees, a spokesman said.\nIn the health care sphere, the Baptist Health system offers a \"weekend option,\" which Cathy Dickinson, president of human resources, said allows women to stay home with their children during the week and work weekends at close to full-time pay.\nThe company also is starting a professional women's organization to help younger women visit and network with veteran employees.\nSince she took on the role, \"there seem to be more women reaching out to me with different needs and concerns,\" she said. \"I think when they see we're hiring more and more females in executive roles, they see that as a real positive.\"\nMercy health system's workforce is about 78.6 percent female, recruitment manager Danielle Ferguson said. While the health care group does not have any recruitment or retention programs specifically geared toward women, some Missouri hospitals in the network have developed summers-off, leadership and mentoring programs aimed at female workers, she said, and there is a possibility that similar programs will be started at its Arkansas facilities.\nGorman hopes the Gender Equity Scorecard will help companies, that may not previously have considered the needs of their female employees, find a starting point for such discussions.\nWomen are \"the nucleus of the family,\" she said. They pass on their circumstances to their children, and their success at work is essential to the Arkansas economy, she said.\n\"The economy is an issue that can mobilize a lot of people,\" Gorman said. \"Generating revenue for our state, generating revenue for our families. This is not a partisan issue. This is something that everyone can get on.\"\nMetro on 10/28/2018","url":"https://www.arkansasonline.com/news/2018/oct/28/research-to-key-on-worker-equality-2018/?page=2"}
