{"authors":["Jordan Gass-Poore For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 01:17:12","date_modify":"2018-10-23 01:17:12","date_publish":"2017-03-10 09:09:08","description":"The Supreme Court is expelling a workout class founded by its first female justice, Sandra Day O'Connor (pictured). Since 1981, the class had been allowed to exercise in a private area of the building.","filename":"data/vaneerConsumption/SCOTUSKICKSOUTexerciseclassstartedbyOConnor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E23339700000578-0-image-a-9_1489155035797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300484_Supreme-Court-brings-gavel-OConnor-workout-class_1540257432.html","title":"SCOTUS KICKS OUT exercise class started by O'Connor","title_page":"SCOTUS KICKS OUT exercise class started by O'Connor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Years after she left the Supreme Court, Justice Sandra Day O'Connor remained enthusiastic about the early morning exercise class she started at the highest court in the land - the basketball court that sits one floor above the courtroom where she heard arguments for nearly a quarter-century.\nWhile the first female justice never managed to persuade her fellow justices to join her regularly, O'Connor's class became a court fixture and a hit with a devoted group of women who live in the court's Capitol Hill neighborhood.\nNow, more than 35 years after the class began and more than a decade after O'Connor left the bench, the court has ruled that the women must take their workout somewhere else.\nThe Supreme Court is expelling a workout class in the building founded by its first female justice, Sandra Day O'Connor (above), citing lack of attendance and security\n'Unfortunately, the time had come for the class to relocate,' Supreme Court spokeswoman Kathleen Arberg wrote in an email to The Associated Press.\n'Few employees attended the class and for some time now, the Justice has not been a participant and cannot oversee the group's access to the gym, which is in a private area of the building open only to Court employees.'\nAllowing area residents to attend the class was a \"rare exception\" to court policy made because of O'Connor's role in the class, Arberg wrote.\nO'Connor, now 86, retired from the Supreme Court in 2006 and spends much of her time in her home state of Arizona.\nHer family was informed of the change, Arberg said.\nAccording to a New York Times article from 1981, the year O'Connor joined the court, O'Connor on her third day at the court sent a notice to all female Supreme Court employees that she was starting an exercise class.\nOn O'Connor's (above) third day at the Supreme Court in 1981 she sent a notice to all female employees that she was starting an exercise class that would meet five mornings a week\nThe class would meet five mornings a week beginning at 8am and a YWCA instructor would lead the class, which would cost $35 monthly.\nThe letter said that the class would include \"conditioning in slimnastics with some aerobic dance\".\nIn addition to court employees, O'Connor's female clerks were encouraged to join, but others got invites, too.\nIn time there were yearly T-shirts with slogans like \"Cool Out with the Supremes\".\nUntil recently, on Monday, Wednesday and Friday there was aerobics and work with weights and resistance bands. Tuesdays was for yoga.\nParticipants often grabbed a post-workout coffee at the court's public cafeteria.\nThese days, the group of about 20 exercisers includes women in their 60s, 70s and 80s, with one participant in her 90s.\nO'Connor discussed her workout legacy during an appearance at the Newseum in 2012, six years after she retired.\n'I still have my class. It's still going on and I went this morning, as a matter of fact, at 8am, and it was good. That meant a lot to me, to have that class. That just really mattered,' O'Connor said.\nJustice Ruth Bader Ginsburg (above), 83, has at least one core strength move in common with the O'Connor exercisers. They both do the plank\nJustice Sonia Sotomayor (above) has said O'Connor's exercise class met too early\nJustice Stephen Breyer (above) attended the class a few times but didn't want to be the only man, O'Connor has said\nMuriel Martin-Wein, 76, who has attended the class for years, said the women were \"all heartsick\" when they were told they would have to leave the Supreme Court building.\n'It was a real thrill. It made us feel special,' she said of being at the court.\nO'Connor's secretary, Linda Neary, declined to comment on the change, which was first reported by The National Law Journal.\nDega Schembri, who co-owns a gym in Cleveland Park, led instruction on Monday, Wednesday and Friday.\nSchembri said the class will move to Capitol Hill Presbyterian Church on Mondays and the city's Eastern Market's North Hall on Wednesdays and Fridays.\n'I'm happy that we're able to continue something that she started,' Schembri said of O'Connor.\nThe class might still have been based at the court if O'Connor had been able to persuade another justice to attend. But she repeatedly struck out.\nDega Schembri led instruction on Monday, Wednesday and Friday at the Supreme Court\nMuriel Martin-Wein, 76, who has attended the class for years, said the women were \"all heartsick\" when they were told they would have to leave the Supreme Court building\nJustice Stephen Breyer attended the class a few times but didn't want to be the only man, O'Connor has said.\nDuring an appearance at the Newseum in 2012, Justice Elena Kagan, who worked as a law clerk to Justice Thurgood Marshall from 1987 to 1988, remembered meeting and disappointing O'Connor back then.\nO'Connor encouraged the female law clerks to join her exercise class, but Kagan preferred playing basketball, The New York Times reports.\nLater, Kagan injured herself playing basketball and, on crutches, ran into O'Connor.\n'She sadly shook her head and she said, \"It wouldn’t have happened in exercise class,\"' Kagan remembered.\nBoth Justice Ruth Bader Ginsburg, who joined the court in 1993, and Justice Sonia Sotomayor, who joined in 2009, have said the class met too early.\nThat doesn't mean the current justices are uninterested in fitness.\nThree of them work out at the court using the same personal trainer. And Ginsburg, who is 83, has at least one core strength move in common with the O'Connor exercisers.\nThey both do the plank.","url":"https://www.dailymail.co.uk/news/article-4300484/Supreme-Court-brings-gavel-OConnor-workout-class.html"}
