{"authors":[],"date_download":"2018-10-30 00:59:27","date_modify":"2018-10-30 00:59:27","date_publish":"2018-07-11 23:49:05","description":null,"filename":"data/vaneerConsumption/SCOTUS9GuidesorGuardians.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Supreme_Court_of_the_United_States_-_Roberts_Court_2017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861167.html","title":"SCOTUS 9: Guides or Guardians?","title_page":"SCOTUS 9: Guides or Guardians?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"President Trump’s nomination of Brett Kavanaugh bids fair to push the Supreme Court away from “penumbras” and other confabulations that have blighted the Court’s product for decades. Naturally, the Oppo Left got a jump-start at NYU, where students (and one faculty member) publicly savaged Trump’s pick — on Saturday, two days before Trump announced his choice. Monday night, Women’s March went the NYU naysayers one better, issuing a blast email to hundreds of journalists slamming Trump’s pick, but with “XX” in the name slot; they also misspelled the nominee’s last name in the title. Oh, and guess who put on her show blocks from the White House?\nThe resignation of Justice Anthony Kennedy, creating this opening, was especially surprising in that he stepped aside from a dominant position as the deciding vote in several huge cases; and his departure will likely lead to confirmation of a new Justice more restrained in the exercise of judicial power.\nAs with each court fight in recent decades, much is already being made over whether the next Justice will be more “conservative” or more “liberal.” The latter group is best described today as “progressive” or left-wing, so as to distinguish between classical and postmodern liberalism. Indeed, to classical liberals, postmodernism is diametrically opposed to genuine liberalism — think for example of the divide between libertarian and postmodern views of free speech rights versus “hate speech.” Indeed, the divide today includes whether the Court should allow aggrieved parties to compel others to espouse views they find abhorrent.\nWe are witnessing again a sterile public debate over highly charged political issues in a fashion no different from what one would expect to hear in the nation’s legislative chambers. Framing the debate over any judicial nomination this way reduces the exchange to public policy differences. Lost is this kind of debate is what should be its proper focus: a debate over governmental structure. In short, we are increasingly losing sight of what our Constitution actually is.\nOur federal Constitution is in form a governmental charter (as are state constitutions, but leave them aside here). The Framers of 1787 had studied history intently, and derived lessons from earlier efforts to form a just government, from ancient Greece and Rome to the Articles of Confederation.\nThus, its first three Articles divide powers into legislative, executive, and judicial. Legislators make laws; the executive administers and enforces them; and the judiciary interprets legal/policy terms, their application and (more controversially) in selected cases, their result.\nArticle IV addresses myriad conflicts that had arisen between the states due to divergent state laws since 1776, and guarantees to all states a republican (not purely democratic) form of government. Article V specifies two ways to amend the original document, and guarantees “equal suffrage” (two votes per state) in the Senate, a protection accorded those adversely affected by amendment nowhere else in the Constitution. Article VI establishes a hierarchy of authority, with the federal Constitution at its apex, covers oaths attendant to, and mandates validity of then-existing public debts.\nIt is in the Bill of Rights, ratified in 1791, that one finds the first guarantees of substantive rights and procedural protections; plus adjustments as to the extent of governmental powers. Those, plus 17 later amendments, can be classified as follows:\nTen amendments confer bedrock substantive rights : 1 (freedom of speech, assembly, religion); 2 (keep and bear arms); parts of 5 (self-incrimination, double jeopardy, just compensation for condemnation of private property for public use); 8 (bail, fines and punishment); 13 (abolition of slavery); 14 (privileges and immunities of citizens, equal protection of the laws); 15 (Negro suffrage); 19 (women suffrage); 23 (D.C. voting rights); and 26 (adulthood and suffrage). Prohibition (18) was repealed (21).\n: 1 (freedom of speech, assembly, religion); 2 (keep and bear arms); parts of 5 (self-incrimination, double jeopardy, just compensation for condemnation of private property for public use); 8 (bail, fines and punishment); 13 (abolition of slavery); 14 (privileges and immunities of citizens, equal protection of the laws); 15 (Negro suffrage); 19 (women suffrage); 23 (D.C. voting rights); and 26 (adulthood and suffrage). Prohibition (18) was repealed (21). Two confer residual rights : 9 (people v. federal state government);10 (states and/or people v. federal government).\n: 9 (people v. federal state government);10 (states and/or people v. federal government). Five confer procedural protections : 3 (quartering of soldiers in private homes) parts of 5 (due process of law as to deprivation of life, liberty and property); 6 (criminal procedure); 7 (jury trial in civil cases); 14 (due process rights of citizens).\n: 3 (quartering of soldiers in private homes) parts of 5 (due process of law as to deprivation of life, liberty and property); 6 (criminal procedure); 7 (jury trial in civil cases); 14 (due process rights of citizens). Three affect the reach of governmental power : 11 (federal sovereign immunity); 6 (federal income tax); 24 (federal and state poll tax).\n: 11 (federal sovereign immunity); 6 (federal income tax); 24 (federal and state poll tax). The remaining six cover federal officials : 12 (election of president and vice-president); 17 (direct election of senators); 20 (terms of president, vice-president, succession, assembly of Congress); 22 (presidential term limits); 25 (vacancy or disability of president and vice-president) 27 (salaries of members of Congress).\n: 12 (election of president and vice-president); 17 (direct election of senators); 20 (terms of president, vice-president, succession, assembly of Congress); 22 (presidential term limits); 25 (vacancy or disability of president and vice-president) 27 (salaries of members of Congress). Constitutional Interpretation. There is a broader conflict over the competing doctrines of “Originalism” and “Living Constitution” — in which the ultimate role of the federal courts in general and the Supreme Court in particular frames the debate concerning tripartite separation of powers.\nBelow are key issues today that reflect fault lines between left and right views of the Court’s role based upon recent decisions, and anticipated future challenges. They cover constitutional structure and powers; substantive rights versus policy choice; judicial roles; and individual nominee qualifications. Taking these in turn:\nStructure. (a) The doctrine of deference to precedent — stare decisis, legalese for “let the decision stand”; (b) the so-called “Chevron deference” under which courts grant enormous deference to administrative agency regulations interpreting legislative laws; (c) the jurisdictional reach of the federal district and appeals courts, per Justice Thomas’s concurrence in Trump V. Hawaii, in which he suggests that the Court address the recent phenomenon of “universal injunctions” (orders) that go beyond the parties before the Court.\nAs to stare decisis, Justice Alito’s majority opinion in Janus v AFSCME, holding unconstitutional forcing public sector employees to contribute to union political activities, states that stare decisis is “at its weakest” when Constitutional questions are at stake because the only remedy for reversing Supreme Court rulings (other than a future Supreme Court doing so) is to pass a Constitutional amendment. And among such questions, stare decisis least applies in First Amendment cases. Alito lists five critical factors: the “quality” of the earlier Court’s reasoning; the “workability” of the existing judicial rule; “consistency” with other rulings; “developments” since the earlier ruling; and “reliance” on the earlier decision.\nRights v. Policy. (a) compelled speech; (b) future efforts by Congress or the states to regulate firearms — a primary issue being ownership of long guns, with Judge Kavanaugh having endorsed constitutional protect for possession of same, in 2011; (c) immigration; and (d) inter-minority affirmative action — conflict between minority groups, not involving whites — Asian students suing Harvard over admission barriers, based in part upon rancid reverse racist stereotypes about Asians as a group. This last item is perhaps the most important substantive case that may come before the Court.\nDisputes over compelled speech came to the fore in Janus v. AFSCME, the recent decision preventing public employee unions from compelling employees to help underwrite union political activities they disagree with. The majority, per Justice Alito, based their ruling on the first Amendment prohibiting not only suppression of protected speech, but compelling speakers to support contrary views; Justice Kagan, dissenting, came all out for allowing compelled speech in this case, accusing the majority of “weaponizing the First Amendment.” Look for more cases in this area.\nImmigration disputes, such as the Trump travel ban recently upheld by the Supremes, will increasingly center on the distinction between “refugees” and “migrants.” Refugee is the term for those who flee due to a well-founded fear of persecution — a prime example is the May 1939 voyage of the St. Louis, which sailed for Havana from Hamburg with 937 Jewish passengers a few months before the Sept. 1, 1939 start of World War II. They were turned away not only by Cuba, but also by the United States and Canada. Instead they landed in various western European ports; 254 of them perished in the Nazi Holocaust.\nIn contrast, economic migrants face no specific concrete threat of persecution at home, but merely seek a better life in wealthier countries. Most of the refugees who fled Central America for the U.S. did not stop in Mexico, which would have sufficed were escaping persecution their motive. President Trump’s nascent border wall aims to stop migrants (with terrorists and criminals also targeted).\nAs to affirmative action, in an upcoming case entering the federal courts, Harvard used a report assessing Asian applicants as deficient in personality traits, as indicated by this New York Times op-ed:\nHarvard evaluated applicants on the extent to which they possessed the following traits: likability, helpfulness, courage, kindness, positive personality, people like to be around them, the person is widely respected. Asian Americans, who had the highest scores in both the academic and extracurricular ratings, lagged far behind all other racial groups in the degree to which they received high ratings on the personality score.… Harvard’s lawyers will soon tell the highest court in the land that Casey Pedrick’s Asian students are less respected because they are less likable, less courageous, and less kind than all other applicants. The university has decided that this is necessary for the greater good. The reality is that it is a carefully considered act of slander. (My italics.)\nAttesting to this finding is that many Asian applicants never met with Harvard admissions officers. Harvard claims it uses personal letters and recommendations as criteria. Likely true, but why did they commission this group test if they intended to base their judgments on individual criteria?\nCourt’s Role. Judges who espouse “Originalism” root their judgments in their understanding of the text of the Constitution and legislative statutory language. Judges who follow the “Living Constitution” or the “Continuing Convention” doctrine are prepared to confect new rights to address matters they regard as not considered by the Framers.\nThe LCs limit their activity to confecting new statutes via judicial fiat, by rewriting laws already enacted. The CCs go further: they amend the Constitution as they deem is necessary to meet the notion of today’s felt necessities. As to LCs, an example is the landmark 1979 United Steelworkers v. Weber case on affirmative action in the workplace. The majority circumvented an apparent flat statutory prohibition by calling the agreement between the union and Kaiser Aluminum a “private, voluntary” agreement. It was nothing of the kind, as the government tipped the scale by threatening to deprive the company of millions of dollars in federal contracts — about as voluntary as “Your money or your (corporate financial) life.”\nThe applicable section of the Civil Rights Act of 1964, sec. 703(j) reads (italics and underscore mine):\nNothing contained in this title shall be interpreted to require any employer, employment agency, labor organization, or joint labor-management committee subject to this title to grant preferential treatment to any individual or to any group because of the race, color, religion, sex, or national origin of such individual or group on account of an imbalance which may exist with respect to the total number or percentage of persons of any race, color, religion, sex, or national origin employed by any employer.…\nJustice Rehnquist (who later became chief justice) dissented over the disregard of this clear statutory limitation, eviscerating the majority’s judicial alchemy, in writing this provision out of the statute:\nAs to CC adherents, they view the Court’s rulings as amendments to the Constitution itself — which the Weber majority dodged by rewriting the statute. Congress could have banned the latter by outlawing such “private” accords, but did not do so. If the Court amends the Constitution, however, Congress alone cannot reverse the ruling. Originalism aims to confine Court rulings to interpreting laws, with greater weight given the text itself, than legislative history (debate on the law) or other factors. Kavanaugh and Gorsuch are Originalists.\nNominee Qualifications. These include scholarship; grasp of jurisprudential philosophies and history; and intellectual acuity. No one seriously accuses Judge Kavanaugh of deficiencies here.\nCharacter and Temperament. Then there is the personal side: character and temperament. While the new nominee appears to be a model of probity and personality, there is one historical point to be made, as to differing standards for Democrats and Republicans.\nImagine if ANY Republican judicial nominee, for ANY court position, had said what sitting Justice Ruth Bader Ginsburg said in 2009, concerning abortions:\nFrankly… I had thought that [when] Roe was decided, there was concern about population growth… particularly… in populations that we don’t want to have too many of… Roe was going to be then set up for Medicaid funding for abortion.\nNo Republican could even dream of such comments being ignored; the offending judge would be forced off the Court in a flash.\nToday’s Debate and the Court’s Future. Sadly, the debate is centering above all on the abortion cases — Roe v. Wade (1973) and its progeny. A large share of the public likely believes that if Roe were overruled, abortion would become illegal nationwide. Little could be further from the truth. In the event, Chief Justice John Roberts will not provide the fifth vote to deep-six Roe, if his last-minute 2012 switch to save Obamacare’s individual mandate is any guide.\nAs Andy McCarthy noted recently, Roe’s ambit has been narrowed for a quarter century. In reality, what would surely transpire is what happened after the repeal of Prohibition. Then, there were wet and dry states, and in some states wet and dry counties. Establishments set up shop across state and county lines, to serve those living in states or counties that remained dry.\nAbortion clinics would migrate today to abortion-friendly states, were Roe discarded. Customers in abortion-unfriendly states would simply drive to the nearest permissive state. Contrary to scaremongers, a scene like this abortion quack episode (4 min.) from 1963’s Love with the Proper Stranger will not return. A June 5, 2018 tally of state abortion status shows four states having already passed “trigger laws” that would immediately ban abortion were Roe overturned — but all would have narrow exceptions. Seven states have laws that would be revived from pre-Roe times, to limit abortions; another ten states would limit abortion “to the maximum extent” permitted post-Roe. Nine states have laws on the books that would fully protect abortion rights absent Roe. The remaining dozen are up for grabs. Sixteen states had liberalized abortion laws before Roe, but right-to-life groups stalled momentum in other states.\nToday’s debate focuses on substantive rights above all; but courts are best suited to adjudicate structure and procedure. And the impact of court rulings as to the existence or extent of substantive rights angers the losers, as such rulings bypass the democratic legislative process, and hence are far harder to reverse.\nIn Federalist 78, Alexander Hamilton wrote of the courts:\nWhoever attentively considers the different departments of power must perceive, that, in a government in which they are separated from each other, the judiciary, from the nature of its functions, will always be the least dangerous to the political rights of the Constitution; because it will be least in a capacity to annoy or injure them. The Executive not only dispenses the honors, but holds the sword of the community. The legislature not only commands the purse, but prescribes the rules by which the duties and rights of every citizen are to be regulated. The judiciary, on the contrary, has no influence over either the sword or the purse; no direction either of the strength or of the wealth of the society; and can take no active resolution whatever. It may truly be said to have neither FORCE nor WILL, but merely judgment; and must ultimately depend upon the aid of the executive arm even for the efficacy of its judgments.\nThe federal courts have, over the past 70 years, injected the judiciary into virtually every nook and cranny of our national life — plus state and local life as well. Couple this with life tenure on the bench, and the result is a recipe for endless, growing domestic conflict. It is far too late to expect a major rollback of government growth or the judiciary’s outsize role in our lives.\nEven if President Trump puts three (four?) Justices (as Richard Nixon did in his first term) on the Court, look for modest rollback at best. But for many, this author included, this beats the alternative of further judicial encroachment upon the provinces of the executive, the legislature, the states, and on the individual rights of the citizenry.\nJohn C. Wohlstetter is author of Sleepwalking With the Bomb (2nd Ed. 2014.)","url":"https://spectator.org/scotus-9-guides-or-guardians/"}
