{"authors":[],"date_download":"2018-10-22 22:14:01","date_modify":"2018-10-22 22:14:01","date_publish":"2014-06-09 13:16:19","description":"Opinion polls show more people are planning to vote \"no\" on the question of whether Scotland should leave the U.K. - but it's getting closer.","filename":"data/vaneerConsumption/Scotland100DaystoGoUntilReferendumonIndependence.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/496261/140609-scottland-independence-jsw-933a_bca560f3d3150e08aafa767459248293.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_scotland-independence-vote_scotland-100-days-go-until-referendum-independence-n126141_1540246441.html","title":"Scotland: 100 Days to Go Until Referendum on Independence","title_page":"Scotland: 100 Days to Go Until Referendum on Independence ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe people of Scotland have just 100 days until they vote in a referendum on whether their nation will remain part of the United Kingdom or separate to form its own country.\nOpinion polls between those planning to vote \"yes\" or \"no\" to the split have narrowed in recent months, but the Better Together campaign to keep Scotland in the U.K. still has a firm projected lead.\nBritish Prime Minister David Cameron, a vocal supporter of the \"no\" campaign, tweeted on Monday that people in the rest of the U.K. - that is Wales, England, and Northern Ireland - must send a strong message to the Scottish people.\nThe non-partisan website whatscotlandthinks.com collated recent polling figures in the U.K. and its average showed 58 percent of people planned to vote \"no\" in the Sept. 18 poll and 42 percent \"yes.\"\nOpposition leader Ed Miliband also sent a message via Twitter urging a \"no\" vote and focusing on Scotland's key role in building the U.K.'s widespread welfare state.\nThe Better Together campaign was given a significant boost last week when President Barack Obama appeared to give it his support.\n\"There is a referendum process in place and it is up to the people of Scotland,\" he said, speaking alongside Cameron in the Belgian capital of Brussels. \"The United Kingdom has been an extraordinary partner to us. From the outside at least, it looks like things have worked pretty well.\n\"And we obviously have a deep interest in making sure that one of the closest allies we will ever have remains a strong, robust, united and effective partner. But ultimately these are decisions that are to be made by the folks there.\"\nAlex Salmond, the First Minister of Scotland and supporter of the \"yes\" campaign, said Monday he thought Cameron had asked his U.S. counterpart to weigh in on the debate.","url":"https://www.nbcnews.com/storyline/scotland-independence-vote/scotland-100-days-go-until-referendum-independence-n126141"}
