{"authors":["Rob Robertson For The Scottish Daily Mail"],"date_download":"2018-10-22 20:30:05","date_modify":"2018-10-22 20:30:05","date_publish":"2016-01-28 01:33:49","description":"Vern Cotter and Eddie Jones have locked horns in a pre-Calcutta Cup war of words after England’s new head coach cheekily claimed that Scotland are ‘favourites’ for next weekend’s opener.","filename":"data/vaneerConsumption/ScotlandmightnotbeabletocopewiththepressureofbeingfavouritesclaimsEnglandcoachEddieJones.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A10BA100000578-0-image-a-44_1453944825337.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3420255_Scotland-not-able-cope-pressure-favourites-claims-England-coach-Eddie-Jones_1540240205.html","title":"Scotland might not be able to cope with the pressure of being favourites, claims England coach Eddie Jones","title_page":"Scotland might not be able to cope with the pressure of being favourites, claims England coach Eddie Jones | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scotland take on England in the Six Nations opener next weekend\nVern Cotter and Eddie Jones have locked horns in a pre-Calcutta Cup war of words after England's new head coach cheekily claimed that Scotland are 'favourites' for next weekend's Six Nations opener - and may not be able to cope with the pressure.\nIt prompted the normally calm Cotter to return fire, accusing Jones of playing mind games in a bid to ease the burden on his own shoulders ahead of his first game in charge.\nBut the row between the pair at yesterday's Six Nations launch in London only served to turn up the heat ahead of one of the most eagerly anticipated Scotland-England matches in years.\nEddie Jones claimed that Scotland are 'favourites' for next weekend's Six Nations opener\nFormer Japan coach Jones, who will be expected to turn the Auld Enemy around after their World Cup debacle under Stuart Lancaster, said: 'If you look at the most recent results and performances then Scotland have a massive advantage at the moment and they have to carry that weight of expectation, which is something they're not used to.\n'If you made the World Cup quarter-finals you've done well and Scotland will go into the game with their chests out.\n'We've only had six training sessions together so there is an enormous pressure on Scotland to perform and not so much on us.\n'The bookies might have us as favourites but Scotland have to be.\n'I've picked a squad who I think can compete with Scotland at Murrayfield but it's going to be a tough old game.'\nCotter claimed that Jones' comments were 'no concern of mine' and accused him of using the words as 'a psychological lever' ahead of next Saturday's game.\nScotland coach Vern Cotter (right) claimed that Jones' comments were 'no concern of mine'\n'I am not quite sure how Eddie works,' he said. 'It's just a psychological lever, isn't it? He's trying to use it to take the pressure off himself.\n'From what I gather, England are still classed ahead of us in the world rankings and I think they have a large numbers of players.\n'I wouldn't think England would need this sort of thing. I thought they would be comfortable with the favourites' tag but those are things that are used to try and take people away from the game.\n'We are fully focused on our game and the players are looking forward to the match. All the peripheral stuff will be swept aside. What he said is no concern of mine.'\nCotter is well used to Jones' pre-match wind-ups, of course, with the Australian having questioned Scotland's fitness before the Dark Blues ran out 45-10 winners against his Japan side during the World Cup in September.\nMeanwhile Cotter revealed his side had suffered two major blows ahead of the Calcutta Cup clash, with centres Alex Dunbar and Peter Horne likely to miss out.\nMark Bennett will undergo a fitness test on Monday to find whether his injured shoulder has recovered enough to allow him to play.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3420255/Scotland-not-able-cope-pressure-favourites-claims-England-coach-Eddie-Jones.html"}
