{"authors":["Simon Tomlinson For Mailonline"],"date_download":"2018-10-23 02:02:37","date_modify":"2018-10-23 02:02:37","date_publish":"2016-01-11 13:40:46","description":"The singer had used his acceptance speech at the 2014 Brit Awards to urge Scotland to 'stay with us' and vote against independence during the referendum of that year.","filename":"data/vaneerConsumption/ScottishNationaliststrollDavidBowiebecausehepleadedforScotlandtostayinUK.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DDA1500000578-0-image-a-2_1452539588437.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393862_Good-riddance-maybe-unionism-gives-cancer-Scottish-Nationalists-troll-David-Bowie-death-pleaded-Scotland-stay-UK-2014_1540260157.html","title":"Scottish Nationalists troll David Bowie because he pleaded for Scotland to stay in UK","title_page":"Scottish Nationalists troll David Bowie because he pleaded for Scotland to stay in UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Bowie fans reacted with fury today after Scottish nationalists celebrated the singer's death simply because he had asked Scotland to remain the United Kingdom.\nThe singer, who passed away yesterday after an 18-month battle with cancer, used his acceptance speech at the 2014 Brit Awards to urge Scotland to vote against independence in the referendum.\nHe faced a toxic backlash from hardliners over his stance at the time, with one nationalist telling him to 'f*** off back to Mars' – a reference to his song Life On Mars.\nBut news of his death has done little to quell their anger, with many taking to social media just hours after his death was announced to attack him once again, including a woman who even posted: 'maybe unionism gives you cancer'.\nScroll down for video\nSupermodel Kate Moss (wearing a Ziggy Stardust outfit) reads out an acceptance speech on behalf of David Bowie at the 2014 Brit Awards in which the singer pleaded with Scotland to vote against independence during the referendum. Scottish Nationalists have celebrated the singer's death because of his stance\nMoss wore one of Bowie's Ziggy Stardust outfits to collect the prize on his behalf at the Brit Awards. In the speech, Bowie said: 'In Japanese myth, the rabbits from my old costume that Kate's wearing live on the moon'\nYes supporter John Harvey called Bowie a 'self-serving tax dodging c***' in a Facebook rant after his death\nScottish Nationalists have taken to social media to attack Bowie for his referendum stance again, including one woman who even posted that 'maybe unionism gives you cancer' after his death from the disease\nOther Yes supporters called Bowie a 'self-serving tax dodging' individual who 'poked his nose into others' affairs'.\nWriting on his public Facebook page, Yes supporter John Harvey, from Dundee, said: 'Rip Bowie I telt (told) you no to get involved in politics ya no voting c*** womble.\n'Gonna say something here. Bowie deed... life is for the living and your legacy as an individual is for those yet to be born.\n'Bowie was a self serving tax dodging c*** who poked his nose into others affairs....good riddance.'\nNationalist Shelley Detlefsen even suggested that supporting the Union may be linked to cancer and said she was 'sickened' to see some fellow Yes supporters 'crying like babies' about Bowie's death.\nShe wrote on her public Facebook page: 'They say he got diagnosed 18 months ago. Maybe unionism gives you cancer?\n'I was actually a big fan. He found Stevie Ray Vaughn. Labyrinth, etc, but I'm a bit sickened to see a bunch of \"nationalists\" crying like babies over a foreign unionist's death.'\nResponding to Ms Detlefsen's cancer jibe, Mr Harvey wrote: 'Ooooof Shelley, you are so naughty hahahahahahahaha.'\nLast picture: Bowie attended the premiere of the musical Lazarus, based on his songs, in New York on December 7\n'SCOTLAND STAY WITH US': KATE MOSS DELIVERED BOWIE'S 2014 BRITS SPEECH IN ZIGGY OUTFIT David Bowie had made his plea for Scotland to stay in the UK in a speech read out by supermodel Kate Moss who accepted his Brit Award prize on his behalf months befroe the referendum vote. The catwalk star was on hand for the ceremony because the singer chose to stay at home in New York rather than attend the event to pick up his best British male award, his first Brit for 18 years. Moss wore one of Bowie's Ziggy Stardust outfits to collect the prize on his behalf at the Brit Awards. Reading a statement, Moss said: 'Good evening ladies and gentleman, David has asked me to say this. 'In Japanese myth the rabbits from my old costume that Kate's wearing live on the moon. 'Kate comes from Venus and I from Mars, so that's nice. I'm completely delighted to have a Brit for being the best male, but I am, aren't I Kate? I think it's a great way to end the day. 'Thank you very, very much and Scotland - stay with us'.\nYes voter John Gallagher, whose profile picture bears the SNP logo, wrote on his public Facebook page: 'The luvvies are out in force! For Bowie I liked some of his stuff!\n'But when the man from Brixton stuck his big nose into politics and said Scotland should stay with Westminster... FFS stick tae yer singin ya twat is what I said at the time.\n'Saor Alba Freedom For Scotland. I certainly didn't see him contributing at the food banks!\n'He should never had told Scots to vote for the Union with Westminster!\n'He was a man from Brixton who contributed nothing to Scotland! We are on our knees with foodbanks and child poverty he was a millionare singer [sic].'\nOther social media users reacted with fury at the comments by the Scottish Nationalists.\nSam Moreton tweeted: 'Bigots and Scum. But I expect no different.\n'Always an icon and a legend. RIP.'\nAnother, named Angela, said: 'The ugly face of nationalism. #snp should be ashamed, this is their doing.'\nCraig Thomas branded the trolls 'filth'.\nScottish First Minister Nicola Stugeon, who helped to spearhead the independence campaign, also paid her respects to the singer.\nIn a tribute on her Twitter account, she said: 'What dreadful news about David Bowie. A hero for so much more than just one day.'\nBowie had made his plea in a speech read out by supermodel Kate Moss who accepted his Brit Award prize for Best British Male on his behalf two years ago.\nSupermodel: Kate Moss was pictured walking in London today as she wore a T-shirt with a black and white image of Bowie's face on the front of it. She also wore a pair of purple metallic platform boots similar to those once sported by the singer\nThe catwalk star was on hand for the ceremony because Bowie, 67, chose to stay at home in New York rather than attend the event to pick up his best British male award - his first Brit for 18 years.\nMoss wore one of Bowie's Ziggy Stardust outfits to collect the prize on his behalf at the Brit Awards.\nReading a statement, Moss said: 'Good evening ladies and gentleman, David has asked me to say this.\n'In Japanese myth, the rabbits from my old costume that Kate's wearing live on the moon.\n'Kate comes from Venus and I from Mars, so that's nice. I'm completely delighted to have a Brit for being the best male, but I am, aren't I Kate? I think it's a great way to end the day.\n'Thank you very, very much and Scotland - stay with us'.\nA woman leaves a bouquet at a mural of David Bowie in Brixton, south London, after his death from cancer\nBowie was among a number of celebrities to suffer online abuse during the Scottish referendum.\nSir Chris Hoy, the six-time Olympic gold medallist, was called a 'bigoted anti-Scot' and a 'traitor' after he mentioned that most Scottish athletes rely on facilities across the rest of the UK.\nAnd Harry Potter author JK Rowling, who donated £1 million to the No campaign, received a torrent of vile abuse. Among other insults, she was branded a 'traitor', a 'quisling' and a 'unionist cow-bag'.\nThe star, whose new album came out just last week, passed away from the illness yesterday surrounded by his family, according to an announcement posted on his official website and Facebook page today.\nA spokesman for the singer said this morning: 'David Bowie died peacefully surrounded by his family after a courageous 18-month battle with cancer.\n'While many of you will share in this loss, we ask that you respect the family's privacy during their time of grief.'\nA flood of celebrities and other public figures such as politicians and even the Archbishop of Canterbury have since paid tribute to the impact he had on the cultural landscape of his era.","url":"https://www.dailymail.co.uk/news/article-3393862/Good-riddance-maybe-unionism-gives-cancer-Scottish-Nationalists-troll-David-Bowie-death-pleaded-Scotland-stay-UK-2014.html"}
