{"authors":["Nicole Fabian-Weber"],"date_download":"2018-10-30 23:13:12","date_modify":"2018-10-30 23:13:12","date_publish":"2014-08-13 22:10:11","description":"Scott Disick is nothing if not a man of luxury. And nothing says luxury quite like dropping north of $200 at a Burger King on 45 boxes of 9-piece chicken fries. The Keeping Up With the Kardashians star Instagrammed a pic of his ridiculous BK…","filename":"data/vaneerConsumption/ScottDisickDropsAbsurdAmountatBurgerKingonSuperTastyChickenFriesPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bf3c3419-95c8-4716-aab6-29c0accea12a.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35688-scott-disick-drops-absurd-amount-at-burger-king-on-super-tasty-chicken-fries-photo_1540941192.html","title":"Scott Disick Drops Absurd Amount at Burger King on Super Tasty Chicken Fries - PHOTO","title_page":"Scott Disick Drops Absurd Amount at Burger King on Super Tasty Chicken Fries — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Scott Disick is nothing if not a man of luxury. And nothing says luxury quite like dropping north of $200 at a Burger King on 45 boxes of 9-piece chicken fries. The Keeping Up With the Kardashians star Instagrammed a pic of his ridiculous BK purchase on Wednesday, along with the caption, \"Thank the Lord @BurgerKing #ChickenFriesareBack #bkpdpartner.\" The latter hashtag makes it seem like he's a paid partner with Burger King, but whatevs. All I'm taking away from this is that Lord Disick loves his chicken fries. Also, I want chicken fries, too, now. Whatever you're doing, it's working, Disick.\nLD is currently in New York shooting Kourtney and Khloe Take the Hamptons, and this isn't the first time he's made mention of his love of the speciality item that has fast food fanatics all a twitter. About a week ago, he Instagrammed a photo of himself driving in a convertible (not safe, dude), with a caption that read, \"I love convertibles, choppers and @BurgerKing Chicken Fries #bringbackchickenfries #tbt #bkpdpartner.\" You know, things that all typically go hand-in-hand.\nClearly, Scott has some sort of partnership going on with Burger King, but at his core, I think he's just a man who likes his chicken fries. And if he wants to eat them on a chopper or in a convertible, so be it.\nImage: letthelordbewithyou/Instagram","url":"https://www.bustle.com/articles/35688-scott-disick-drops-absurd-amount-at-burger-king-on-super-tasty-chicken-fries-photo"}
