{"authors":["Press Association"],"date_download":"2018-10-23 02:09:09","date_modify":"2018-10-23 02:09:09","date_publish":"2016-01-28 16:53:55","description":"Scotland duo Adam Ashe and Alex Dunbar have been sent home to Glasgow after both were ruled out of the Dark Blues' RBS 6 Nations opener with England. The War...","filename":"data/vaneerConsumption/Scotlandpairadamasheandalexdunbarruledoutofsixnationsopener.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-35346bd8-b78f-4f8a-8181-b4f07e89d274-4vVdYopwYQ7f641721b07af6be91-326_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421192_Scotland-pair-Adam-Ashe-Alex-Dunbar-ruled-Six-Nations-opener_1540260549.html","title":"Scotland pair adam ashe and alex dunbar ruled out of six nations opener","title_page":"Scotland pair adam ashe and alex dunbar ruled out of six nations opener | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scotland pair Adam Ashe and Alex Dunbar ruled out of Six Nations opener\nScotland duo Adam Ashe and Alex Dunbar have been sent home to Glasgow after both were ruled out of the Dark Blues' RBS 6 Nations opener with England.\nThe Warriors pair met up with Vern Cotter's squad for their three-day training camp in St Andrews earlier this week.\nBut the players - who both missed last year's World Cup - will have to wait to make their Scotland returns after being counted out of the February 6 clash with England.\nAlex Dunbar has been ruled out of Scotland's opening RBS 6 Nations clash with England\nCentre Dunbar has not played for his country since tearing knee ligaments in the build-up to last year's clash with the English.\nHe was hoping to make his comeback against Eddie Jones' side but then suffered a thigh strain in his club's 22-5 win over Racing 92 on Saturday. He had the injury scanned at Glasgow's BMI Ross Hall Hospital, with medics confirming he will have to be sidelined for a few weeks yet.\nAshe picked up a shoulder injury in Glasgow's Champions Cup loss to Northampton a fortnight ago and is also unlikely to be ready to feature until later in the Championships.","url":"https://www.dailymail.co.uk/wires/pa/article-3421192/Scotland-pair-Adam-Ashe-Alex-Dunbar-ruled-Six-Nations-opener.html"}
