{"authors":["Press Association"],"date_download":"2018-10-23 03:17:20","date_modify":"2018-10-23 03:17:20","date_publish":"2016-01-11 15:56:30","description":"Scott Waites won his second BDO World Championship title with a 7-1 thumping of Canadian Jeff Smith in Frimley Green. Huddersfield's Waites, the 2003 champio...","filename":"data/vaneerConsumption/Scottwaitesclaimssecondbdoworldchampionship.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-68cdf6b7-756f-4718-8190-8596a562590a-48qEJGFphM8d437f0aaf926c9c99-882_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393664_Scott-Waites-claims-second-BDO-World-Championship_1540264640.html","title":"Scott waites claims second bdo world championship","title_page":"Scott waites claims second bdo world championship | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scott Waites claims second BDO World Championship\nScott Waites won his second BDO World Championship title with a 7-1 thumping of Canadian Jeff Smith in Frimley Green.\nHuddersfield's Waites, the 2003 champion, won the first five sets and there was no coming back for the unseeded Smith, whose run did not have the fairytale ending he would have hoped for.\nIt was by no means one-way traffic, and Waites twice had to come from two legs to one down in the opening five sets as Smith failed to make the most of his chances.\nScott Waites defeated Jeff Smith to win the BDO World Championship\nSmith finally got on the board by taking the sixth set in spectacular fashion with a 161 checkout.\nAn unlikely comeback potentially looked on the cards when he won the first two legs of the next set but again he could not land the doubles and Waites won three legs in a row.\nSmith's final chance came when he again led 2-1 in the eighth set but he could do nothing but applaud as Waites landed a 156 checkout and then took out double 16 to clinch the title.\nWaites, who has battled back from shoulder surgery, told the BBC: \"It's absolutely brilliant. To win my second world title, I can't believe it. I don't know what to say.\"\nSmith made the semi-finals on his debut last year and was the first Canadian for 22 years to play in the final.\nHe said: \"Scott was incredible. He could have gone out early but he dug in and really made it to the end.","url":"https://www.dailymail.co.uk/wires/pa/article-3393664/Scott-Waites-claims-second-BDO-World-Championship.html"}
