{"authors":["Press Association"],"date_download":"2018-10-22 20:24:04","date_modify":"2018-10-22 20:24:04","date_publish":"2016-01-29 01:23:58","description":"Scott Brown birdied his last hole for a 30 on the front nine, a six-under 66 and a share of the lead on Thursday in the Farmers Insurance Open.","filename":"data/vaneerConsumption/ScottBrownhits30onfrontninetoshareleadatFarmersInsuranceOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AD96CE00000578-0-image-a-82_1454030523878.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-3422067_Scott-Brown-hits-30-nine-share-lead-Farmers-Insurance-Open_1540239844.html","title":"Scott Brown hits 30 on front nine to share lead at Farmers Insurance Open","title_page":"Scott Brown hits 30 on front nine to share lead at Farmers Insurance Open  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Americans Scott Brown and Andrew Loupe shared the lead as home players occupied the first seven places after the first round of the Farmers Insurance Open at Torrey Pines.\nThe duo were tied on six under par after both opened with rounds of 66 with Brown having eight birdies and two bogeys in his round.\nBrown played the more difficult South Course whereas Loupe's opening round was on the North Course.\nAmerican Scott Brown shares the lead after the fist day in San Diego after a front-nine 30\nAndrew Loupe and Brown were tied on six under par after both opened with rounds of 66\nBrown said: \"I hit it really well coming in, the last 11 holes. I made a couple of length putts and capitalised on the short ones.\n\"It's a hard golf course, if you're out of position you are immediately playing for par. Fortunately I drove it good and hit a lot of good iron shots today,\" Brown added in an interview on the PGA Tour website.\nLoupe had two eagles, four birdies and two bogeys as he and Brown led fellow countrymen Billy Horschel, Patton Kizzire, Tom Hoge, Rob Hoppenheim and Harold Varner III by a single stroke.\nA seven-way tie on five under par included Americans Gary Woodland, Brendan Steele, Scott Stallings, Matt Every and Chesson Hadley.\nPhil Mickelson recovered from a rough start to post a respectable 69 with six birdies\nAlso sharing eighth place were South Korea's KJ Choi and Japan's Hideki Matsuyama.\nScotland's Martin Laird and Ireland's Paul Dunne featured in a 19-way tie for 15th on three under which also included Patrick Reed and Phil Mickelson.\nIreland's Shane Lowry and England's Justin Rose both had rounds of one under to tie for 54th.\nDefending champion Jason Day had gone into the tournament hoping to be competitive despite suffering from a virus but he ended the opening round tied forth 76th on even par in a group which also included England's Brian Davis.","url":"https://www.dailymail.co.uk/sport/golf/article-3422067/Scott-Brown-hits-30-nine-share-lead-Farmers-Insurance-Open.html"}
