{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-22 23:30:24","date_modify":"2018-10-22 23:30:24","date_publish":"2017-04-26 08:00:26","description":"Located in Melvaig, in the Scottish Highlands, the unusual building which once housed lighthouse keepers and their families, boasts a staggering nine bedrooms and is on the market for £450,000.","filename":"data/vaneerConsumption/ScottishHighlandsconvertedlighthousegoesonthemarket.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/25/17/3F9872BC00000578-0-image-a-24_1493136703489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4444080_Coastal-conversion-nine-bedrooms-goes-market_1540251024.html","title":"Scottish Highlands converted lighthouse goes on the market","title_page":"Scottish Highlands converted lighthouse goes on the market | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A converted lighthouse building offering stunning views of the Northern Lights has gone on the market for almost half a million pounds.\nDescribed as a 'truly wondrous' property, Rua Reidh in the Scottish Highlands overlooks the Minch coastline as well as the nearby Isles of Skye, Harris and Lewis, and is on the market with a £450,000 price tag.\nLocated in Melvaig, Gairloch, the unusual B-listed building which once housed three lighthouse keepers and their families also boasts a staggering nine bedrooms and sprawling private drive.\nIts name, Rua Reidh, is Gaelic for 'smooth point', and is inspired by the rock formations that occur around the headland where the rock slabs run down into the sea.\nAs well as catching glimpses of the Aurora Borealis, when Rua Reidh's new owners gaze out of their window they could spot goats and deer roaming wild or a rare white tailed eagle swooping past, while the water plays host to seals, dolphins, and even the occasional whale.\nGreen with envy? A view of Rua Reidh lighthouse and its surrounding buildings. Set in the Scottish Highlands, it offers spectacular views of the coastline and Northern Lights and is currently on the market with a £450,000 asking price\nAnd the imposing stone-built property, which didn't have central heating until 1989, is secluded, with a three-mile single track driveway leading to the house and its parking area.\nStanding at 25 metres tall, the lighthouse itself is not included in the sale but owners of the Old Keepers Accommodation will have use of the surrounding area.\nThe Old Keepers Accommodation, built in 1910, is split into a spacious flat comprising three bedrooms, lounge and kitchen, while a connecting doorway leads to the main living accommodation.\nThis part of the building - the main apartment - houses five bedrooms, a sitting room, kitchen, conservatory, cloakroom and bathroom.\nUnusual: Agents are describing the sprawling, nine-bedroom Rua Reidh in Melvaig, Gairloch, as a 'truly wondrous' property overlooking the Minch coastline (pictured) as well as the nearby Isles of Skye, Harris and Lewis\nNo nosy neigbours here: The imposing stone-built property, which didn't have central heating installed until 1989, is blissfully secluded with a three-mile single track driveway leading to the house and its parking area\nAt present the property operates as a hospitality business, touted as the perfect base from which to explore one of the 'last wilderness areas' of Europe, according to estate agents Strutt & Parker.\nThe current owners have completely renovated the property internally and externally, running a hospitality business consisting of a self-catering apartment and separate guest accommodation providing bed, breakfast and evening meal.\nThe Keepers Accommodation is currently split into an apartment with three bedrooms, a lounge and kitchen and a comfortable main house which provides five bedrooms, four bathrooms, sitting room, office, kitchen, conservatory, utility room and WC.\nLocated in Melvaig, Gairloch, the unusual B-listed building which once housed three lighthouse keepers and their families also boasts a staggering nine bedrooms and has a modest asking price for a property of its size at £450,000\nCosy: At present the property operates as a hospitality business, touted as the perfect base from which to explore one of the 'last wilderness areas' of Europe according to estate agents Strutt & Parker who are overseeing its sale\nProspective buyers will have plenty to feast their eyes on; Rua Reidh, located on the Western coast of Rossshire, overlooks a stunning stretch of coastline and is known for its superb scenery, white sandy beaches, wide open spaces and diverse wildlife.\nIt sits among some of the most dramatic mountain and coastal scenery in Britain, in a region with vast stretches of roadless countryside where deer and goats roam wild and where a variety of birdlife - including the rare white tailed eagle - can be spotted.\nSeals, dolphins, otters - and even the occasional whale - are regularly seen from the lighthouse while basking sharks are frequently seen in the summer months.\nThe Old Keepers Accommodation, built in 1910, is split into a spacious flat comprising three bedrooms, lounge and kitchen, while a connecting doorway leads to the main living accommodation (accommodation is pictured foreground, to the right)\nWould you live here? According to Strutt & Parker, struggles to make a living from the inhospitable land are also in evidence in the surrounding area, with abandoned crofting hamlets and pastures left to crumble in the heathland\nNine bedrooms in the sprawling property First Officers Quarters: Three bedrooms Keepers House: Five bedrooms Staff Accommodation: One bedroom\nThe moors behind the lighthouse are home to a wealth of seabirds, wading birds, flora and fauna, and just an hour's walk away lie deserted sandy beaches.\nThe region also has plenty to offer for history buffs; from Mesolithiccaves to Bronze and Iron Age hut circles, medieval forts to fortified islands, the whole of Wester Ross is an area rich in archaelogical remains.\nPast struggles to make a living from the inhospitable land are also in evidence, with abandoned crofting hamlets and pastures left to crumble in the surrounding heathland.\nGairloch itself is an attractive small town with a string of hotels, coffee shops, a museum and shops.","url":"https://www.dailymail.co.uk/femail/article-4444080/Coastal-conversion-nine-bedrooms-goes-market.html"}
