{"authors":["Rob Robertson For The Scottish Daily Mail"],"date_download":"2018-10-23 01:55:36","date_modify":"2018-10-23 01:55:36","date_publish":"2017-03-16 12:12:26","description":"Scotland have received a major boost after all six of their walking wounded were passed fit to take on Italy in the final match of the Six Nations. Hogg had been a doubt after picking up a shoulder injury.","filename":"data/vaneerConsumption/ScotlandhookerFordgetsnodoverBrownagainstItaly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E454FB200000578-0-image-a-92_1489666325689.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4319976_Scotland-hooker-Ford-gets-nod-Brown-against-Italy_1540259736.html","title":"Scotland hooker Ford gets nod over Brown against Italy","title_page":"Scotland hooker Ford gets nod over Brown against Italy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scotland have received a major boost after all six of their walking wounded were passed fit to take on Italy in the final match of the Six Nations.\nThe biggest doubt had been full-back Stuart Hogg, who became a father for the second time on Wednesday evening when his wife Gillian gave birth to Olivia May Hogg. The couple already have a little boy called Archie.\nHogg had been a doubt after picking up a shoulder injury and a head knock in the defeat to England.\nFraser Brown performed a dangerous tackle on Elliot Daly in the opening minutes on Saturday\nBrown was shown a yellow card for his tackle on England winger Daly at Twickenham\nScotland head coach Vern Cotter said that he had passed all his graduated return to play protocols and he had no qualms about naming him in his starting team to play Italy. Tommy Seymour and Ryan Wilson, who also picked up head knocks against England have also been passed fit.\nFinn Russell, Huw Jones and Richie Gray all passed fitness tests on Thursday morning which allowed Cotter to name them in his starting team.\n‘We haven’t been able to do anything up until today with a full team because of return to play protocols, while Finn Russell and Huw Jones had niggles in knees and ankles,’ said Cotter.\n‘We’ve obviously been through necessary line-out calls and defence but, because it is towards the end of the competition, rest and recovery becomes more important than trying anything new. The medical staff have all worked extremely hard.’\nRoss Ford will be handed the chance to impress form the start in the final Six Nations game\nDaly suffered a nasty blow and was forced to leave the field with a head injury\nThe only change in the Scotland starting XV is at hooker where Ross Ford starts in place of Fraser Brown.\nThe front-row veteran has faced Italy 11 times during his international career — and is wary of what to expect.\n‘The Italians are confrontational. They like to disrupt games, so we have to be very disciplined and patient when we play against them,’ said Ford.\n‘We can’t give them easy access into the game by giving them penalties early on. If we do that, they will grow in confidence and they will get their scrum and maul going.\n‘If they get a sniff, they will be there or thereabouts, so we have to be disciplined and break them down and everybody has to be aware that it will take time to do that.\nScotland head coach Vern Cotter is taking charge of the Dark Blues for the final time\nFront rower Brown was let off the hook by an an independent disciplinary panel on Monday\n‘In this Six Nations they have been leading, as they were against England, or within a score at half-time, so that shows it will take us time to get on top.\n‘The overriding thing is being patient and disciplined with the ball, and even more without it when we take them on and try to wear them down.’\nFord, who is three caps shy of Chris Paterson’s Scotland record of 109, suffered one of the worst results of his international career against Italy just two years ago.\nThe No 2 had to go off with a back spasm after 66 minutes as Scotland threw away a lead late on during the 2015 Six Nations.\n‘That was one of the low points for me and it was frustrating. I could do nothing to help near the end as I was in the changing room getting treatment on my back spasm,’ said Ford.\n‘I watched it on the television screens inside and it remains a bad memory, especially in front of our home crowd. ‘To lose that was a disappointment.\n‘That game also showed that Italy should never be written off. The boys, I hope, realise that if you are not concentrating and try to play too much too early it can come back and bite you at times like it did two years ago.\n‘As I say, patience and discipline are vital, because any slip-ups and these things can happen to you against Italy.’","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4319976/Scotland-hooker-Ford-gets-nod-Brown-against-Italy.html"}
