{"authors":["Andy Newport","Press Association Sport"],"date_download":"2018-10-23 00:28:32","date_modify":"2018-10-23 00:28:32","date_publish":"2017-03-10 06:54:13","description":"Eddie Jones' England side are looking to equal the All Blacks' record 18-match winning streak set in 2016 when they welcome the Dark Blues to Twickenham on Saturday in Calcutta Cup action.","filename":"data/vaneerConsumption/ScotlanddonotfearEnglandin6NationsclashVisser.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E1CF9C600000578-0-image-a-27_1489128849064.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4300168_Scotland-not-fear-England-6-Nations-clash-Visser_1540254512.html","title":"Scotland do not fear England in 6 Nations clash - Visser","title_page":"Scotland do not fear England in 6 Nations clash - Visser | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tim Visser insists Scotland are not scared of taking on Eddie Jones' English winning machine.\nThe Auld Enemy are looking to equal the All Blacks' record 18-match winning streak set in 2016 when they welcome the Dark Blues to Twickenham on Saturday.\nIt would be easy for Vern Cotter's men to admit to being daunted by the prospect of facing Jones' all-conquering Red Rose outfit.\nTim Visser has insisted Scotland are not scared by the prospect of facing England\nEddie Jones' side will be looking to equal New Zealand's record 18-game winning run\nBut Dutch-born wing Visser thinks the fear factor which has gripped previous Scotland XVs on journeys to south west London is gone.\nThe Harlequins back, who hopes to play a part in what would be the Scots' first London triumph since 1983, said: 'We don't go into games being scared of the opposition.\n'We are very confident but as typical Scots we are very conservative in how we approach the game.\n'We need to be calm and composed. We need to play the game not the occasion that is why we have to treat this as just another game of rugby.\nBut Visser has called on his side to be calm and composed, with the pressure on England\n'We are going to where they say is a daunting place but we are looking forward to it. The last couple of weeks we have played exciting rugby.\n'England know how to win games but I don't think they've been winning as smoothly as they always have. They have struggled up to half time in various games. But they must be doing something right to have won 17 games in a row.\n'But I don't think we are a team under pressure. We go down there with a record of not much success but we have kept our feet on the ground. We have to give it our best but I think the pressure is on them.'\nScotland have put themselves in rare contention to land the RBS 6 Nations title following wins over Ireland and Wales.\nScotland have shown the ability to win tight games, Visser believes, ahead of the encounter\nAnd Visser admits there is more than just national pride riding on this edition of the annual Calcutta Cup duel.\n'I would be lying if I said there wasn't,' he said. 'We all know the importance of it with one eye on the championship.\n'At this level it is all about keeping a calm head. We showed that against Ireland and Wales when we won in the later stages of the game. It is going to be a tight game. If we want to be in it we still have to be in with a shout at half time.\n'England have won championships but we have shown we can win tight games. All we have to do now is do it at Twickenham.'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4300168/Scotland-not-fear-England-6-Nations-clash-Visser.html"}
