{"authors":["Ryan Smith","Becky Freeth For Mailonline"],"date_download":"2018-10-23 02:39:00","date_modify":"2018-10-23 02:39:00","date_publish":"2017-04-26 13:45:48","description":"While his ex and co-parent Kourtney Kardashian, 38, is away, party-hard Scott, 33, helped Kylie Jenner's recent ex Tyga, 27, bounce back in his own signature way.","filename":"data/vaneerConsumption/ScottDisickpartieswithBritishmodelEllaRossAGAIN.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F7CF800000578-0-image-a-44_1493210594216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447526_Scott-Disick-parties-Brit-model-Ella-Ross-AGAIN_1540262340.html","title":"Scott Disick parties with British model Ella Ross AGAIN","title_page":"Scott Disick parties with British model Ella Ross AGAIN | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His new 'mystery woman' was unmasked by MailOnline on Tuesday as British model and socialite Ella Ross.\nBut Scott Disick didn't desist in entertaining the beauty, 19, while she was saying in California on Wednesday, even making sure she travelled home in luxury after a wild night out in West Hollywood with the Keeping Up With The Kardashians star.\nWhile his ex and co-parent Kourtney Kardashian, 38, is away, party-hard Scott, 33, helped Kylie Jenner's recent ex Tyga, 27, bounce back in his own signature style.\nScroll down for video\nUnder his wing: Scott Disick (right) was seen partying with newly-single Tyga (left) again on Tuesday night in West Hollywood\nGorgeous mum-of-three Kourtney is holidaying in Mexico this week, granting her light relief from their co-parenting arrangement.\nScott on the other hand, is holding down the fort in Calabasas where he is thought to have met LA-based stylist Ella.\nThe beauty was seen in the back of a luxury car with a fellow blonde, shortly after hitting night spot Galerie Montaigne.\nInto the fold: Model Ella Rose (right) who enjoyed a liaison with Scott earlier this week was once again linked to the Scott by leaving the same TAG Heuer\nIdentified: MailOnline uncloacked Scott's new 'mystery woman' on Tuesday\nWow! Former model Ella has been revealed as the latest lady to catch Scott's eye\nLow-key: The British beauty was seen enjoying a low-key date with Scott Disick on Monday when he took her from Casa Del Mar to the Beverly Hills Hotel\nShe was a guest at an A-list event held by TAG Heuer, where Scott was showing Tyga a good time.\nTyga is on the rebound from his split with Kylie - the younger half sister of Kourtney, Scott's ex.\nElla's run-in with Scott comes just two days after the bombshell was spotted in the passenger seat of Scott's car.\nAccording to sources, he picked her up from Casa Del Mar and took her to the Beverly Hills Hotel where they spent three hours inside.\nBouncing back: Meanwhile, Tyga seemed to be back out on the town following his split with Kylie Jenner\nHeading home: Scott was hard to miss in his blue silk bomber jacket\nDriven home: The same could be said for Tyga in his orange jumpsuit\nScott's 10-year relationship with Kourtney has been plagued by meet-ups with models and beautiful LA socialites - regardless of whether they were on or off.\nKourtney and Scott, who slit in 2015 after nine years of dating, share three children: Mason, seven; Penelope, four; and Reign, two.\nThe latest one, Ella, is a former model, who hails from Sussex and counts Brit socialites Lottie Moss and Lily Fortescue among her connected circle of well-heeled pals.\nIt's over... again: Tyga's ex-girlfriend Kylie (pictured) is the younger sister of Kourtney, Scott's ex\nParty hard stars: Tyga was out until late at Galerie Montaigne\nAnd as she works on achieving her dream of becoming a formidable force in the fashion world, the stunning blonde has already amassed a sizeable audience, with an impressive 17,000 followers already enjoying her scintillating Instagram posts.\nWhile she's a relative newcomer to the shores of Southern California and still keeps close ties to her native England, Ella has quickly landed on her feet in LA, partying at such exclusive spots as West Hollywood's Soho House and Chateau Marmont.\nGo team: Scott and ex-girlfriend Kourtney Kardashian (pictured) have praised themselves for working as a good co-parenting to Mason, Penelope and Reign\nThis is what you could have had: Kourt is currently enjoying a wild girls' weekend in Mexico and reminding him exactly what he's missing in bikinis\nCheeky: Kourtney has been sharing a tantalising insight into her getaway\nAlthough her primary job is working at getting the latest and best threads on the backs of her clients, she also returns to her modelling roots from time to time, sharing a series of shots of herself posing in eye-catching garments on social media.\nDuring last weekend's instalment of Coachella, she set pulses racing as she uploaded an image showing her wearing a a taupe bra top with denim Daisy Dukes, while a tasselled waistcoat and boots added some Wild West fashion edge.\nAnd just days before heading for the sweltering and arid climes Indio for the festival, she gave an even better view of her enviably svelte frame, as she posed for a snapshot in a skimpy bikini.\nShe's well connected! Ella counts model Lottie Moss among her circle of close pals\nBFFs: Lily Fortesque is also featured as a pal on blonde beauty Ella's Instagram account\nStylist: The 22-year-old hails from Sussex and works as a personal wardrobe and events stylist\nOh so popular: She boasts an impressive 17,000 followers on image-sharing app Instagram","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447526/Scott-Disick-parties-Brit-model-Ella-Ross-AGAIN.html"}
