{"authors":[],"date_download":"2018-10-22 22:17:16","date_modify":"2018-10-22 22:17:16","date_publish":"2016-01-28 10:08:30","description":"MailOnline has teamed up with BT Sport to give away five pairs of RBS 6 Nations tickets to Scotland vs England to BT Murrayfield on Saturday, February 6.","filename":"data/vaneerConsumption/ScotlandvsEnglandWinticketstothe2016SixNationsmatchwithBTSport.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A906D900000578-0-image-a-16_1453975680251.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3420650_Scotland-vs-England-Win-tickets-Six-Nations-match-plus-two-nights-Edinburgh-hotel-courtesy-BT-Sport_1540246636.html","title":"Scotland vs England: Win tickets to the 2016 Six Nations match with BT Sport","title_page":"Scotland vs England: Win tickets to the 2016 Six Nations match with BT Sport | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MailOnline has teamed up with BT Sport to give away five pairs of RBS 6 Nations tickets to Scotland vs England at BT Murrayfield on Saturday, February 6.\nScotland will be hoping to start with a victory over England at BT Murrayfield\nThis historic match is the first chance to see the Scottish team in action since their heartbreaking 35-34 loss against Australia in the World Cup last year, while England will be stepping out under new coach and captain Eddie Jones and Dylan Hartley.\nThe winners will also get two night’s accommodation at the Novotel, Edinburgh Park for the Friday and Saturday night.\nTo be in with a chance of winning, simply answer the following question:\nWho is the captain of Scotland?\nA) Stuart Hogg B) Greig Laidlaw C) Stuart Gray\nE-mail your answer, along with your name, address and contact number to sportcomp@dailymail.co.uk to arrive by 11am on Tuesday, February 2.\nPLEASE NOTE: You must validate your entry with the words SCOTLAND VS ENGLAND TICKETS in your subject box; the tickets do not include any travel; normal Associated Newspapers terms and conditions apply - the Editor's decision is final.\nBT is at the heart of Scottish Rugby, with the BT logo now featuring on the new shirt. BT’s association with Scottish Rugby sees them sponsor Scotland 7s, Scotland’s club league and cup competitions and Scottish Rugby’s four new academies, as well as BT Murrayfield.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3420650/Scotland-vs-England-Win-tickets-Six-Nations-match-plus-two-nights-Edinburgh-hotel-courtesy-BT-Sport.html"}
