{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 20:30:52","date_modify":"2018-10-30 20:30:52","date_publish":"2016-07-06 08:48:10","description":"Scottish fishing industry leaders have clashed with Scottish Ministers over Nicola Sturgeon's plans to keep Scotland in the EU.","filename":"data/vaneerConsumption/ScottishFishermenThreatentoBlockSturgeonsAttemptstoKeepScotlandintheEU.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-151955330-e1467725299360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_07_06__1540931452.html","title":"Scottish Fishermen Threaten to Block Sturgeon's Attempts to Keep Scotland in the EU","title_page":"Scottish Fishermen Threaten to Block Sturgeon's Attempts to Keep Scotland in the EU","title_rss":"NULL","source_domain":"breitbart.com","text":"Scottish fishing industry leaders have clashed with the Scottish Government over Nicola Sturgeon’s plans to keep Scotland within the European Union (EU), warning that they will fight all efforts to do so.\nWhile the Scottish people voted 62 per cent to 38 per cent to stay in the EU, making it the most Europhile of the four United Kingdom nations, the fishing industry was almost unanimously opposed to the UK’s continued participation in the bloc.\nThey were unafraid to say so during a meeting between the Scottish Fisherman’s Federation (SFF) and the Scottish rural economy secretary, Fergus Ewing, at Holyrood yesterday, The Guardian has reported.\nIndeed, the gulf between the two parties was underlined when the SFF refused to sign a joint statement with Mr. Ewing, preferring to issue their own statement following the event stating that there had been a “significant divergence in our approach to EU membership”.\nBertie Armstrong, SFF chief executive, said: “We outlined to the Minister the unanimous view of our membership of the real and positive opportunities that leaving the EU would bring to our fishing communities.\n“The minister listened carefully to our points of view and we both acknowledged that there was a significant divergence in our approach to EU membership. However, there was also recognition from both parties of the need to maintain close dialogue and a good working relationship.”\nThe fishing industry is particularly keen to avoid becoming a bargaining chip during Brexit negotiations, and is moving to ensure that leaving the Common Fisheries Policy, which has decimated Britain’s fishing industry, is included in the final result.\n“In effect, much in the same way as how our oil and gas sector benefits from the UK’s territorial reach, [leaving the EU] brings the opportunity of making Britain the controlling partner in the northern continental shelf where we would be able to exert a positive influence on the way that fisheries are managed, working with other nations in a partnership approach,” Mr. Armstrong said.\nMr. Ewing recognised that there were differences in approach, but has said that he is keen to keep the fishing industry within talks on the way forward.\n“I recognise that differences exist between the Scottish government’s desire to explore all possible options to protect Scotland’s place in Europe and the SFF’s position,” he said.\n“It is vital that we seek a better mutual understanding of what those differences mean in practical terms. It is also important for us to carry on and address immediate and short-term issues, and I am pleased that we will continue to engage on those.\n“I have assured SFF that I will continue to champion [the] Scottish fishing industry’s interests, despite the huge uncertainties we now have, and intend fully to do so.”","url":"https://www.breitbart.com/europe/2016/07/06/scottish-fishermen-holyrood-attempts-keep-scotland-eu/"}
