{"authors":["Neil Munro"],"date_download":"2018-10-30 20:16:11","date_modify":"2018-10-30 20:16:11","date_publish":"2015-09-22 01:48:47","description":"Scott Walker used his exit speech to spout the anti-Donald Trump, populist-hating narrative now being pushed by the establishment.","filename":"data/vaneerConsumption/ScottWalkerExitsJabsUpbeatTrumpsNegativeCampaign.json","image_url":"https://media.breitbart.com/media/2015/09/scott-walker-las-vegas-town-hall-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_21__1540930571.html","title":"Scott Walker Exits, Jabs Upbeat Trump's 'Negative Campaign'","title_page":"Scott Walker Exits, Jabs Upbeat Trump's 'Negative Campaign'","title_rss":"NULL","source_domain":"breitbart.com","text":"Wisconsin Gov. Scott Walker used his sooner-than-expected exit speech to spout the anti-Trump, populist-hating narrative now being pushed by the establishment’s entwined GOP, Democratic, Wall Street, and media wings.\nEstablishment interests are trying to scare middle-class voters by painting a dark, depressing, and negative image over the optimistic and enthusiastic crowds now powering Donald Trump’s upbeat “Make American Great Again” campaign.\n“I encourage other Republican presidential candidates to consider [exiting] so that the voters can focus on a limited number of candidates who can offer a positive, conservative alternative to the current frontrunner,” said Walker, who was recently expected to get major financial support from donors allied to the Koch brothers’ low-tax, low-regulation coalition.\nWalker’s negative rhetoric supports the Democrats’ negative strategy against Trump. For example, Democratic frontrunner Hillary Clinton claimed Sept. 18 that she was “appalled” at Trump’s decision to ignore a questioner’s claim that President Barack Obama is a Muslim. Trump should “start behaving like a president,” said Clinton, whose campaign is beset by legal and political crises.\nThat frontrunner is the bête noire of the establishment, Donald Trump, whose populist pitch stole away nearly all of Walker’s voters.\nTwo months ago, Walker was leading the GOP race because he was successfully straddling the GOP’s populist and establishment wings. But populist Trump, Ben Carson, and Sen. Ted Cruz have won most of the GOP’s populist vote, and Walker could not compete for establishment donors and voters against Jeb Bush, Sen. Marco Rubio, and the former HP CEO Carly Fiorina.\nWalker’s Sept. 21 appeal for more quitters is likely aimed at the establishment donors who are now funding Sen. Marco Rubio, and a series of establishment candidates now stuck at a few percent.\nThose donors can shift their funds to Gov. Jeb Bush and abandon the unimportant players, including Sen. Lindsey Graham of South Carolina, Louisiana Gov. Bobby Jindal, and former New York Gov. George Pataki. More importantly, the donors can quit popular upstart candidates, such as Sen. Ted Cruz, Sen. Rand Paul, and Gov. Mike Huckabee.\nWalker’s dour speech likely aids the well-funded Bush, who has claimed repeatedly that he wishes to run an optimistic campaign.\nA centerpiece of Bush’s “optimistic” campaign platform is his call for a larger inflow of foreign college graduates to take decent jobs sought by debt-burdened American graduates. Bush’s “optimistic” plans would likely only be optimistic for shareholders and investors, who would gain greater profits as middle-class wages continue to shrink amid the labor surplus.\nAmericans’ wages have been flat since the late 1970s, coinciding with the 1965 restart of mass-immigration. Since then, the federal government has delivered more than 40 million new taxpayer-funded foreign workers and customers into the U.S. marketplace, so slashing the market-price of American’s labor.\nTrump’s campaign is using popular anger at the establishment’s economic failure to power his upbeat campaign for a pro-American election that would sideline the establishment and jump-start the stalled middle class. That optimism is exemplified by his slogan, “Make American Great Again!”\nBut Walker insisted that Trump’s cheerful and hard-nosed anti-establishment campaign is somehow negative.\n“As a kid, I was drawn to Ronald Reagan… most of all, I admired hm because of his eternal optimism,” Walker claimed.\nIn fact, Reagan ran tough campaigns that hammered incumbent Democrats.\nIn 1964, “not only was [his] content pretty bracing, but his demeanor was serious, almost angry,” said Jack Pitney, a professor at Claremont McKenna College.\nIn 1980, at the GOP convention, Reagan declared that “Never before in our history have Americans been called upon to face three grave threats to our very existence, any one of which could destroy us. We face a disintegrating economy, a weakened defense and an energy policy based on the sharing of scarcity. The major issue of this campaign is the direct political, personal and moral responsibility of Democratic Party leadership–in the White House and in Congress–for this unprecedented calamity which has befallen us.”\nThat hard-nosed message was coupled with an optimistic alternative; “The American spirit is still there, ready to blaze into life if you and I are willing to do what has to be done; the practical, down-to-earth things that will stimulate our economy, increase productivity and put America back to work.”\nAfter Reagan won his 1980 presidential election, “his presentation softened over the years: the indignant outsider morphed into the smiling grandfather that we remember,” Pitney told the left-wing vox.com site.\nBut Walker ignored Reagan’s tough pitches and touted only Reagan’s later optimistic pitch.\n“Reagan was good for America because he was an optimist,” Walker misleadingly claimed in his exit speech. “Sadly the debate taking plan in the Republican Party today is not focused on that optimistic view of America. Instead, it has drifted into personal attacks. In the end, the American voters want to be for something, not against someone,” he continued, suggesting Trump’s campaign consists of only personal animus, not pro-American policies.\n“Instead of talking about of talking about how bad things are, we want to hear how we can make them better for everyone,” he said, ignoring Trump’s plan to reduce the glut in the nation’s labor market by inviting foreign migrants to return home.\nWalker’s exit speech tailed off into meaningless talking points. “We need to get back to the basics of our party. We are the party that believes people make jobs, not the government,” he said.\nWalker will now return to the governorship of Wisconsin.","url":"https://www.breitbart.com/politics/2015/09/21/scott-walker-exits-race-becomes-anti-populist-sock-puppet-bipartisan-establishment/"}
