{"authors":[],"date_download":"2018-10-30 01:09:22","date_modify":"2018-10-30 01:09:22","date_publish":"2016-11-29 00:00:00","description":null,"filename":"data/vaneerConsumption/ScottBrownonWhattheNextVASecretaryMustDo.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_11_scott_brown_on_what_the_next_va_secretary_must_do_comments_1540861762.html","title":"Scott Brown on What the Next VA Secretary Must Do","title_page":"Articles: Scott Brown on What the Next VA Secretary Must Do","title_rss":"NULL","source_domain":"americanthinker.com","text":"Every time Donald Trump discusses issues he hopes to tackle as president, he always mentions the need to make sure US veterans are taken care of. A strong candidate for the job who is currently being considered for Secretary of Veterans Affairs is former Senator Scott Brown. American Thinker interviewed him and some veterans about what issues need to be tackled. If anyone has the right stuff to clean up the mess within the VA it is Scott Brown. His work experiences will help him tackle the many issues. At the age of nineteen he enlisted, and soon was commissioned an infantry officer, retiring as a Colonel. As a State Senator and US Senator he was a ranking member on committees that dealt with veterans’ issues. An issue important to Val, a retired Air Force Doctor, who is now working for a veteran’s choice clinic, is timely referrals for patients who cannot be seen under the 30 days access standard, because the VA drags their feet for months.... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/11/scott_brown_on_what_the_next_va_secretary_must_do_comments.html"}
ere else and had to pay out of their own pocket. They resent not being able to get help from the VA in a timely manner. I think it is obvious the VA cannot handle the backlog so we need to get private providers involved. This is not privatizing it, but a combination approach. Before any decision is made there must be a state by state analysis of each facility.”\nA vet from Iraq wonders when the VA will come into the 21st century. Brown agrees that the VA is archaic, and “have been throwing good money after bad. We need to be more effective and efficient by modernizing. This includes using technology to be more creative and innovative.”\nOn the other hand a Vietnam vet worries that he will fall through the cracks because he is not computer savvy. Brown sees as the bureaucracy the key problem.\n“I understand some veterans are traumatized and cannot find the proper forms to get help. We must work with different veterans’ groups to help them get squared away. We need to take the VA outside the walls of Washington DC, with one possibility having the local armory help with filing paperwork. The vet who is not computer savvy will have someone sit down with them and find the solutions right then and there. Any technology should be user friendly.”\nPatrick, a Ft. Hood survivor who was shot in the head, losing 20% of his brain, was put in the wrong category of brain injury for two years. Although it was fixed, it cost him $42,000 in retroactive pay. Brown commented,\n“Since it was announced I was being considered, I have had an abundance of emails, phone calls, and Facebook messages. I wish Patrick was the only person who gets the run around. This is where the veteran service groups and able VA workers can fill the void by taking people like Patrick under their wing. Currently there is a tremendous amount of complaints and cases that we must weed through. I hope the vets understand it will take some time. I do envision having a complaint hot line.”\nRobert, a retired USAF Colonel believes that administrators of VA facilities should be held responsible for not making improvements. Brown intends to go personally, or have a team sent to:\n“individual facilities and tell the administrators they have a ‘free pass moment’ to disclose strengths and weaknesses, what is being done right and wrong, and what is needed to solve the problems. Then I will bring in a team to fix things with the needed resources. But, I want to emphasize, if it turns out they were not telling the truth or hiding things I hope to be able to fire them and put in place someone who can get the job done.”\nBob, a retired FBI agent and Marine that volunteers at veteran facilities, feels there should be consequences for those employees who are incompetent, uncaring, and act like they are doing vets a favor. If chosen, Brown will make the atmosphere zero tolerance and require:\n“veterans to be treated as if they are walking into a five star hotel. There must be an attitude that they are honored to have them there and want to serve them, not the other way around. People need to understand if they are not doing well they can be replaced. I think it is very important to find out what the rank and file are thinking and experiencing. We welcome the input from the veterans either by phone, in person, on-line, or in filling out a form. People need to be kept informed and updated whether on the web, in the media, or through You-Tube.”\nSome soldiers who are suffering from PTSD want an all of the above approach. Although Brown must rely on medical expertise he does:\n“support options that are available. We must look at a case-by-case basis. For example the group Road To Recovery has a program for people with mental and physical disabilities. Vets lead vets as they ride on bicycles to rehabilitate and build up their confidence. We need to get into the VA all these different outside groups.”\nIf Scott Brown is chosen VA Secretary, Americans will not just get him, but his whole family. His daughter, country music singer Ayla Brown, has traveled five times with the Armed Forces Entertainment group where she performed for the troops. Her mother, Gail Huff Brown, told American Thinker,\n“My goal is to volunteer and bring on board different organizations that specifically deal with mental health issues of veterans. I know there are a lot of people that want to help, but don’t know how to do it.”\nBest-selling author Anne Elizabeth, who writes about SEALs, wants to see Gail working with the spouses. Gail agrees, “We need a better network of support systems so spouses have places to go and are able to meet with those in similar situations. We should even consider a virtual support group. We as a society have to find a way to help those who welcome home their loved ones, but also see a mental health issue. One possible way to keep the family engaged is with a volunteer call system. For example, someone can call twenty families once a week and check-in with them. This keeps a line of communication open.”\nScott Brown wants Americans to understand,\n“I deal in facts and want a top to bottom review. I am a workaholic and a no-nonsense guy. Veterans should expect the best care for the best price. But they need to understand it is not going to happen overnight. It will take time to review everything, find out what is working and what is not, and then come up with solutions.”\nThe author writes for American Thinker. She has done book reviews, author interviews, and has written a number of national security, political, and foreign policy articles.","url":"https://www.americanthinker.com/articles/2016/11/scott_brown_on_what_the_next_va_secretary_must_do.html"}
