{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 01:59:12","date_modify":"2018-10-23 01:59:12","date_publish":"2016-01-29 16:15:16","description":"FedEx workers near Charles de Gaulle airport in Paris raised the alarm not knowing the eight cookers were inert and were being sent to help the Tunisian military.","filename":"data/vaneerConsumption/ScrewfilledpressurecookerssparkpanicatFedExwarehouseinParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3D65E00000578-0-image-a-76_1454083984413.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422815_Screw-filled-pressure-cookers-spark-panic-FedEx-warehouse-Paris-Embassy-finally-tells-dummies_1540259952.html","title":"Screw-filled pressure cookers spark panic at FedEx warehouse in Paris","title_page":"Screw-filled pressure cookers spark panic at FedEx warehouse in Paris | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pressure cookers filled with screws caused panic in France when they were discovered en route to the US Embassy in Tunisia.\nFedEx workers near Charles de Gaulle airport in Paris raised the alarm not knowing the eight cookers were inert and were being sent to help the Tunisian military deal with improvised explosive devices (IEDs).\nThe find sparked confusion as workers fled the scene fearing the worse. A spokesman for the General Confederation of Labour union (CGT), Frederic Petit, said not knowing they were inert, the employees immediately alerted managers.\nCharles de Gaulle airport in Paris - the FedEx warehouse where the eight pressure cookers with screws in them were found is near to the site\nHe added that workers felt 'nervous and abandoned' as they were not told the packages were safe for four hours.\nThe devices were found after an item fell and tore open of one of the cooker's boxes.\nA U.S. Defense Department official said that the boxes posed no danger and were intended to train the Tunisian military in counter-IED tactics\nA defence spokesman said: 'The boxes had already cleared customs, and were properly marked. 'The situation has since been resolved and the packages are headed to their final destination of Tunisia.'\nDefense officials added that it was not uncommon to ship props like this for training purposes and apologised for the confusion.\nA FedEx warehouse near Charles de Gaulle airport was the scene of panic when workers uncovered eight pressure cookers filled with screws\nEarlier, FedEx Europe declined to identify who had sent the shipment, citing client privacy, but said in a statement that the consignment was 'authorised under applicable security regulations' and did not 'trigger any risk to safety and security.'\nMr Petit said workers made the discovery at around 9.30 pm on Tuesday, but it was not until 1.30 am the following morning that they were told the shipment was OK.\nYesterday a man was arrested at Disneyland Paris carrying two handguns, ammunition, and a 'guide to the Koran'.","url":"https://www.dailymail.co.uk/news/article-3422815/Screw-filled-pressure-cookers-spark-panic-FedEx-warehouse-Paris-Embassy-finally-tells-dummies.html"}
