{"authors":["Abc News","Mike Levine","Janet Weinstein","Matt Seyler","More Bill","More Mike","More Janet","More Matt"],"date_download":"2018-10-30 00:53:26","date_modify":"2018-10-30 00:53:26","date_publish":"2018-10-28 07:53:10","description":"The alleged gunman in the Pittsburgh synagogue massacre used four guns in the rampage, officials said.","filename":"data/vaneerConsumption/ScrewtheopticsImgoinginAllegedsynagogueshooterpostsonsocialmediamomentsbeforemassacre.json","image_url":"https://s.abcnews.com/images/US/synagogue-17-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_pittsburgh-synagogue-all_760de8c6731557d52c08578670685568_story_id=58803485_1540860806.html","title":"'Screw the optics, I'm going in': Alleged synagogue shooter posts on social media moments before massacre","title_page":"'Screw the optics, I'm going in': Alleged synagogue shooter posts on social media moments before massacre - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The man who allegedly gunned down 11 worshipers at a Pittsburgh synagogue used three handguns and an AR-15 assault rifle in the 20-minute rampage and screamed to SWAT officers who wounded him in a shootout that he wanted \"all Jews to die,\" authorities said on Sunday.\nRobert Gregory Bowers, the suspect in the latest mass shooting in America, allegedly acted alone in the Saturday morning massacre at the Tree of Life temple, bursting into Shabbat services with guns blazing and killing three women and eight men, while injuring six others, including four police officers, officials said.\nDuring a news conference Sunday morning, the names of the dead were released. They ranged in age from 54 to 97, and included two brothers, a married couple and a family physician. All the victims were from the Pittsburgh area.\nDr. Karl Williams, the Allegheny County medical examiner, read the names of the victims: Joyce Fienberg, 75, Richard Gottfried, 65, Rose Mallinger, 97, Jerry Rabinowitz, 66, Daniel Stein, 71, Melvin Wax, 88, and Irving Younger, 69.\nAlso killed were brothers Cecil Rosenthal, 59, and David Rosenthal, 54; and Bernice Simon, 84, and her husband, Sylvan Simon, 86.\nBrendan Smialowski/AFP/Getty Images\nBowers, 46, of Pittsburgh, remained in fair condition and under guard on Sunday in a Pittsburgh hospital. He is scheduled to make his first appearance in federal court at 1:30 p.m. on Monday.\n'Screw the optics, I'm going in'\nInvestigators said that minutes before carrying out the carnage, Bowers is believed to have posted his intent to commit the massacre on the social media platform Gab, which is popular with white supremacists and the alt-right.\n\"Screw the optics, I'm going in,\" reads a post believed to have been made by Bowers moments before the first gunshots were fired inside the temple.\nBowers was charged late Saturday night with 29 federal counts, including several hate crimes. He is facing 11 counts of obstruction of exercise of religious beliefs resulting in death, 11 counts of use of a firearm to commit murder, four counts of obstruction of exercise of religious belief resulting in bodily injury to a public safety officer and three counts of use and discharge of a firearm during and in relation to a crime of violence.\nThe four counts of bodily injury to a public safety officer stem from the police officers injured in the shooting.\n\"Each count is punishable by death,\" Scott Brady, the U.S. Attorney for the Western District of Pennsylvania, said at Sunday's news conference.\nJeff Swensen/Getty Images\nBob Jones, the special agent in charge of the FBI Pittsburgh office, said Bowers allegedly used three Glock 357 handguns and an AR-15 assault rifle in the massacre.\n\"All the weapons he brought into the facility were used,\" Jones said.\nBrady added that during the course of the deadly assault, \"Bowers made statements regarding genocide and his desire to kill Jewish people.\"\nJones said Bowers roamed the sprawling temple in Pittsburgh's Squirrel Hill neighborhood to kill victims.\nGun battle with suspect\nThree services were occurring simultaneously at the temple at the time of the rampage and Jones said bodies were found in three different locations of the synagogue.\nThe first shots were fired about 9:45 a.m. and calls went out to emergency medical services at 9:54 a.m.\nRabbi Jeffrey Myers was officiating one of the services when the shooting broke out. He told ABC News on Sunday that for about 20 seconds he wasn't sure what was happening.\nAFP/Getty Images\nMyers immediately called 911 as another rabbi huddled with congregants in a cloakroom. He said he was on the phone with a 911 dispatcher being the \"eyes and ears\" for the police as they rushed to the scene.\nTree of Life Rabbi Jeffrey Myers describes the moment gunshots rang out inside Pittsburgh synagogue: \"I remember everything crisply and will remember it the rest of my life.\" https://t.co/pIeIZOmsst pic.twitter.com/2iKIbaVAx1 — ABC News (@ABC) October 29, 2018\nOfficers raced to the synagogue and encountered Bowers as he was exiting the building and a gun battle ensued, authorities said. Bowers retreated back into the temple and went to the third floor, according to the criminal complaint filed against him.\nAP\n\"SWAT operators entered the third floor of the building. While searching for any remaining victims SWAT operators encountered Bowers, who opened fire on the officers,\" according to the complaint.\nDuring the gunfight, two officers were shot multiple times by Bowers. Two other officers were injured by flying glass or bullet fragments in the encounter, authorities said.\nSteph Chambers/Pittsburgh Post-Gazette via AP\nDuring the exchange of gunfire, Bowers was shot several times and taken into custody, according to the complaint.\nAs Bowers was being treated at the scene, he blurted out a statement to SWAT Officer David Blahut, saying, \"He wanted all Jews to die and also that they (Jews) were committing genocide to his people,\" according to the criminal complaint.\nBowers was not known to the FBI before Saturday, according to Jones. Investigators suspect he acted alone, Jones said.\nIn addition to the federal charges, Bowers was also charged with 35 state offenses, including 11 counts of criminal homicide, six counts of criminal attempted homicide, six counts of aggravated assault and 13 counts of ethnic intimidation.\nBrendan Smialowski/AFP/Getty Images\nSome of the congregants were gathering for a baby-naming ceremony in the synagogue which had not yet started when the massacre began to unfold. No children were among those injured, authorities said.\n\"I heard the gunfire\"\nFive victims remained hospitalized Sunday evening, including two in critical condition, said Dr. Donald Yealy, chair of emergency medicine at the University of Pittsburgh Medical Center. He said the two in critical condition were a 40-year-old SWAT team member and a 70-year old man who is the chaplain at UPMC-Presbyterian.\nDr. Leonard Weiss, assistant EMS medical director for the city of Pittsburgh, lives next door to the synagogue and told ABC News on Sunday that the gunfire woke him up.\n\"I started hearing yelling. Then I realized it was very close by,\" Weiss said. \"My first thoughts were to get safe. But I knew that my role with the city and my role in my job is to find out what's going on and respond.\"\nHe said he called the emergency dispatch center to find out where the staging area was, then alerted his colleagues at the University of Pittsburgh Medical Center of the alarming situation.\n\"Then I dressed up. I got as much equipment as I could together, and put my boots on and I went outside,\" Weiss said. \"I immediately was suspicious when I heard the gunfire that there would be several casualties. It took a long time for the scene to get safe and for us to get a specific count on who was injured.\"\nHe said police officers escorted him to the staging area, where he helped direct ambulances to the scene and paramedics to the scene. He recalled checking on one victim with a bullet wound who was being rushed to the hospital in bad shape.\nHe said that once the gunfire subsided and the wounded had been removed from the synagogue, he went to the threshold of the temple and looked in.\n\"I saw several damaged windows. I could see a lot of upsetting things in the chapel that was beyond that threshold,\" he said. \"I was able to visualize some of the victims who lost their lives.\nBrendan Smialowski/AFP/Getty Images\n\"I felt very emotional,\" he said. \"I felt scared for myself and for my family and my neighbors. I felt scared for my city that it could happen here. And, [I] felt especially proud and worried about my colleague paramedics that risked their lives to go right in and pull people out while the action was unfolding.\"\nHe said it wasn't until Sunday morning that he heard one of the victims killed was Rabinowitz, a family physician and colleague at the UPMC Shadyside Hospital.\nPolice snipers used their house\nKim and Ken Hardin, who live across the street from the synagogue, said they heard the shots and quickly ushered their children and a friend of theirs into the basement and away from windows.\n\"We heard five repetitive shots. I stepped out on my porch and I heard three additional shots and within minutes police started to arrive,\" Ken Hardin told ABC's \"Good Morning America\" on Sunday. \"Police started to park in front of our house. They were shielding themselves with their car. So we realized the situation was pretty serious.\"\nHe said five officers knocked on his back door and asked to use their second floor to position snipers.\n\"The five police officers went upstairs, asked that I open the windows in our bedroom and obtain a chest-high dresser,\" Ken Hardin said. \"So I found one in my son's room. A police officer and I took the drawers out and dragged the dresser right in front of the window and they perched their rifles on top of the dresser toward the synagogue.\"\nKim Hardin added: \"We did see shooting taking place. Our youngest son said that he saw a police officer get shot. I don't know whether or not that he did. It was certainly traumatic for a 10-year-old to see police with so many weapons and to hear the gunfire.\"\n\"Darkest day in Pittsburgh's history\"\nThe Anti-Defamation League said it was \"unconscionable for Jews to be targeted during worship on a Sabbath morning.\"\n\"This is the deadliest attack on the Jewish community in the history of the United States,\" it said in a statement.\nFirst responders prevented the shooting from becoming a worse tragedy, Brady said.\n\"They are truly heroes, who without hesitation, without concern for their safety ran toward gunfire to protect innocent victims. By confronting and neutralizing Bowers, they prevented additional loss of life,\" Brady said.\nThe shooting rattled nerves across the country and globe and prompted an outpouring of support and condolences.\nIn New York, the Empire State Building went dark except for an orange halo on the mast to honor the victims. In Paris, the Eiffel Tower also went dark in homage to the victims.\nPittsburgh Mayor Bill Peduto said the city of Pittsburgh will stand by the victims' families and help them get through the tragedy.\n\"Pittsburgh is a strong town. We are a resilient city,\" Peduto said at Sunday's news conference. \"We'll get through this darkest day in Pittsburgh's history by working together.\"\nABC News' Matt Gutman and Whit Johnson contributed to this report","url":"https://abcnews.go.com/US/pittsburgh-synagogue-alleged-mass-shooter-told-swat-officers/story?id=58803485"}
