{"authors":[],"date_download":"2018-10-22 22:58:39","date_modify":"2018-10-22 22:58:39","date_publish":"2014-05-13 13:36:40","description":"Scuba diver Rene Umberger said a man ripped off her breathing apparatus after he was upset about being filmed. She wants the other diver charged.","filename":"data/vaneerConsumption/ScubaDiverAssaultOffHawaiiCaughtonCamera.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/438561/140513-scuba-attack-02_3324ff01c9ede5f05de81852c3b61dfe.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_scuba-diver-assault-hawaii-caught-camera-n104071_1540249119.html","title":"Scuba Diver Assault Off Hawaii Caught on Camera","title_page":"Scuba Diver Assault Off Hawaii Caught on Camera","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn aggressive diver could end up in hot water for a “dive-by” caught on camera.\nScuba diver Rene Umberger said she was about 50 feet below the waters off Kona, Hawaii, on Thursday when another diver swam over and ripped off her breathing apparatus.\nUmberger was filming damage to coral reefs when she was dragged into the shocking underwater assault. She now wants the other diver identified and charged.\n“I think this man needs to be arrested immediately for attempted murder,” the 53-year-old environmentalist told NBC affiliate KHNL.\nAfter Umberger managed to slip her breathing device back on, she captured the diver continuing to intimidate her. Her diving partner also had a camera.\nFrom a distance, her attacker looked over and spread his arms wide.\n“I honestly thought he was coming back for a second attack,” Umberger said. “I got up on the boat and I said, ‘Oh my God, someone just tried to kill me underwater.’”\nUmberger believes the menacing diver, who appeared to be spearfishing, was unhappy when he noticed two cameras pointed in his direction. It’s not known whether he was spearfishing legally.\nEither way, Umberger said, she was merely trying to document the reefs — not engage in a dustup with a fellow diver.\nThe state Division of Conservation and Resources Enforcement said it would investigate the footage, which could be turned over to prosecutors.\nUmberger said her experience diving helped her keep calm in an otherwise terrifying situation.\n“Never in a million years did I think that someone would attack like that, especially from such a distance,” she said. “It’s not like we were close up or in their face.”\n— Erik Ortiz","url":"https://www.nbcnews.com/news/us-news/scuba-diver-assault-hawaii-caught-camera-n104071"}
