{"authors":[],"date_download":"2018-10-30 18:09:05","date_modify":"2018-10-30 18:09:05","date_publish":"2016-10-10 18:18:44","description":"Q: There’s a tall metal sculpture in the middle of Five Points in downtown Atlanta.","filename":"data/vaneerConsumption/SculptureatributetoFivePoints.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/10/Images/newsEngin.16262876_Five-Points-Monument.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_sculpture-tribute-five-points__1540922945.html","title":"Sculpture a tribute to Five Points","title_page":"Sculpture a tribute to Five Points","title_rss":"NULL","source_domain":"ajc.com","text":"Q: There’s a tall metal sculpture in the middle of Five Points in downtown Atlanta. What does it represent? When was it installed and who was the artist?\nA: George Beasley didn’t have much time.\nThe 1996 Olympics were approaching and the huge bronze and steel sculpture needed to be in place before the opening ceremony.\nSo he went to work crafting what became the 36-foot tall sculpture in Five Points.\n“It was really a crash program because of the Olympics,” Beasley said. “We didn’t get down to the heavy building until four months before the opening day. It went in that week before. They were still moving streets around.”\nSimply called the “Five Points Monument,” Beasley’s creation is on the traffic island near Woodruff Park, at the confluence of the five streets — Peachtree, Edgewood, Decatur, Whitehall (South Peachtree) and Marietta — that give the area its name.\nIf you look toward Woodruff Park, you can spot a bronze sculpture called “Atlanta from the Ashes,” which has been a part of the city since 1969. It’s been in that location since 1995, when it was moved for the Olympics.\nBeasley, who taught at Georgia State for 40 years, still works out of the university’s sculpture studio on Edgewood when he’s not in Scotland, where he lives part of the year.\nRenown for his work with iron, his creations can been seen throughout Atlanta, including at Emory and local corporations and churches. Beasley said he recently completed an iron piece for a sculpture park in Latvia.\nThe sculpture in Five Points was built at Georgia State’s studio and then moved on two flat bed trucks to the traffic island, which had been cleared of utility poles and street lights.\nHe said the area underneath the sculpture had to be reinforced after a “vault” was discovered that once contained electrical components for Atlanta’s old trolley system.\n“It’s probably the only sculpture that I know of that has a basement,” Beasley said.\nCranes then lifted the sculpture into place, just in time for Atlanta’s Summer Games.\nThe sculpture was built to resemble a water tower that was once there.\nHe thinks it’s his largest creation, “especially vertically.”\n“All of those bronze panels are like panels of the tank, deconstructed and rearranged,” Beasley said. “It’s the water tower, taken part, looked at, rearranged, and used for other purposes.”","url":"https://www.ajc.com/news/sculpture-tribute-five-points/xYiCy4Wxeukfsyrai8BIVL/"}
