{"authors":["Associated Press"],"date_download":"2018-10-22 22:47:14","date_modify":"2018-10-22 22:47:14","date_publish":"2016-01-11 03:46:31","description":"MINNEAPOLIS (AP) — Minnesota kicker Blair Walsh hooked his 27-yard field goal attempt into the frigid wind with 22 seconds remaining, handing Seattle a 10-9 ...","filename":"data/vaneerConsumption/SeahawksedgeVikingsPackersbeatRedskinstoadvance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:6cee8c54ea1549289c8bf2e48db9cede-56CX32zFKLb7123928b84c9d7ccb-91_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393334_Seahawks-edge-Vikings-Packers-beat-Redskins-advance_1540248434.html","title":"Seahawks edge Vikings, Packers beat Redskins to advance","title_page":"Seahawks edge Vikings, Packers beat Redskins to advance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Seahawks edge Vikings, Packers beat Redskins to advance\nMINNEAPOLIS (AP) — Minnesota kicker Blair Walsh hooked his 27-yard field goal attempt into the frigid wind with 22 seconds remaining, handing Seattle a 10-9 victory over the stunned Vikings on a Sunday in weather that tied for the third-coldest NFL game on record.\nThe stadium announcer said, with the wind-chill factored in, the temperature was -32 degrees (-25F) and Seattle can look forward to much more comfortable conditions when they visit Carolina next weekend.\nIn Sunday's other game, Green Bay won 35-18 at Washington, completing a wild-card weekend in which all four visiting teams won. On Saturday, Kansas City cruised past Houston and Pittsburgh needed a late field-goal to beat Cincinnati. It's the first road-team sweep that has happened since the current playoff format was adopted in 1990.\nMinnesota Vikings kicker Blair Walsh (3) reacts after missing a field goal during the second half of an NFL wild-card football game against the Seattle Seahawks, Sunday, Jan. 10, 2016, in Minneapolis. The Seahawks won 10-9. (AP Photo/Jim Mone)\nGreen Bay will play Arizona next weekend.\nSeattle (11-6) didn't score until Russell Wilson's short touchdown pass to Doug Baldwin early in the fourth quarter. Then, a fumble by Adrian Peterson for the Vikings on the next possession set up a field goal by Steven Hauschka.\nThe Vikings (11-6) took the ball for the deciding drive with 1:42 left at their 39-yard line and, aided by a pass interference penalty on Kam Chancellor, drove deep into Seattle's territory. After draining the clock for the seemingly inevitable win, Walsh simply missed the winner after making all three of his earlier attempts.\n\"We were fortunate that we got the win,\" Seahawks coach Pete Carroll said. \"A lot of those times, guys make those kicks. There's a high percentage that they make them, but you've still got to do it.\"\nWalsh didn't hide. Holder Jeff Locke had the laces turned in, not out, but there were no excuses to be made.\n\"You're confident, but you never think that you have it or take it for granted,\" Walsh said, subdued with glassy eyes in the locker room afterward. \"I just didn't put a swing on it that would be acceptable by anybody's standards.\"\nHis coach Mike Zimmer was unforgiving.\n\"It's a chip shot,\" Zimmer said. \"He's got to make it.\"\nThis was a fittingly frigid finish for Minnesota's two-year stint outdoors at the University of Minnesota's TCF Bank Stadium during construction of the new covered downtown stadium. It was the first outdoors playoff game in Minnesota since 1976, and the coach of that team, 88-year-old Bud Grant, delighted fans when he strolled out to the coin toss wearing only a polo shirt.\nGreen Bay quarterback Aaron Rodgers overcame a slow start to lead the Packers to a comfortable victory at Washington.\nRodgers opened the game by going 1 for 8, and the Packers' first four drives went: punt, safety, punt, punt. They gained all of 11 yards heading into the second period, and they trailed by double digits.\nAnd then, spurred by using the hurry-up approach he loves, Rodgers turned it around, throwing for a pair of touchdowns while Eddie Lacy and James Starks each ran for a score, and Green Bay overran the Redskins.\n\"We got the tempo up, and they couldn't keep up,\" said Rodgers, who finished 21 for 36 for 210 yards and no turnovers. \"We became a snowball, kind of going downhill, and it was tough for us to stop.\"\nThat was missing while the Packers were losing their final two games and six of their last 10 after a 6-0 start, letting the NFC North title slip away. And it was missing early Sunday, when Washington grabbed an 11-0 lead.\n\"We just needed a game like this to get our mojo back and get our confidence going,\" Rodgers said. \"It just takes one performance to get us going back in the right direction and believing that we can make a run.\"\nGreen Bay will play at Arizona on Saturday. In Week 16 of the regular season, the Cardinals dominated the Packers and won 38-8.\nWashington (9-8) had won four games in a row, but its season ends without a single victory over a team that finished with more wins than losses.\n\"It's a little sick feeling any time you lose a game at the end of the year, not matter when it is,\" Washington's Jay Gruden said after his first playoff game as an NFL head coach. \"The opportunities we had out there today — it makes you ill.\"\nHis quarterback, Kirk Cousins, made his first playoff start after a breakthrough season and was 29 for 46 for 329 yards. He threw for one touchdown, ran for another, lost one fumble and was sacked six times.\nRodgers turned things around in the second quarter, twice catching Washington with too many men on the field. He went 5 for 6 for 68 yards on a drive that ended with a 12-yard TD pass to Randall Cobb. When he hit Davante Adams for a 10-yard touchdown that gave the Packers a 17-11 halftime lead, Rodgers danced a little jig and threw some fist pumps.\nIn the second half, the running game took over. After 17 rushing yards at halftime, the Packers finished with 141 yards on 32 carries.\n___\nOnline:\nAP NFL website: www.pro32.ap.org and AP NFL Twitter feed: www.twitter.com/AP_NFL\nSeattle Seahawks punter Jon Ryan (9) flips over as he run the ball during the first half of an NFL wild-card football game against the Minnesota Vikings, Sunday, Jan. 10, 2016, in Minneapolis. (AP Photo/Jim Mone)\nSeattle Seahawks punter Jon Ryan (9) jumps over Minnesota Vikings linebacker Casey Matthews (59) as he runs the ball during the first half of an NFL wild-card football game against the Minnesota Vikings, Sunday, Jan. 10, 2016, in Minneapolis. (AP Photo/Nam Y. Huh)\nSeattle Seahawks quarterback Russell Wilson (3) is tackled by Minnesota Vikings defensive end Everson Griffen (97) during the first half of an NFL wild-card football game, Sunday, Jan. 10, 2016, in Minneapolis. (AP Photo/Nam Y. Huh)\nSeattle Seahawks quarterback Russell Wilson (3) runs the ball against Minnesota Vikings strong safety Andrew Sendejo (34) during the first half of an NFL wild-card football game, Sunday, Jan. 10, 2016, in Minneapolis. (AP Photo/Nam Y. Huh)\nMinnesota Vikings running back Adrian Peterson (28) runs the ball during the first half of an NFL wild-card football game against the Seattle Seahawks, Sunday, Jan. 10, 2016, in Minneapolis. (AP Photo/Jim Mone)\nFans watch during the second half of an NFL wild-card football game between the Minnesota Vikings and the Seattle Seahawks, Sunday, Jan. 10, 2016, in Minneapolis. The Seahawks won 10-9. (AP Photo/Jim Mone)\nSeattle Seahawks head coach Pete Carroll celebrates with wide receiver Doug Baldwin (89) after an NFL wild-card football game, Sunday, Jan. 10, 2016, in Minneapolis. The Seahawks won 10-9. (AP Photo/Nam Y. Huh)\nMinnesota Vikings fans react after an NFL wild-card football game between the Minnesota Vikings and the Seattle Seahawks, Sunday, Jan. 10, 2016, in Minneapolis. The Seahawks won 10-9. (AP Photo/Nam Y. Huh)","url":"https://www.dailymail.co.uk/wires/ap/article-3393334/Seahawks-edge-Vikings-Packers-beat-Redskins-advance.html"}
