{"authors":["Trent Baker"],"date_download":"2018-10-30 21:32:25","date_modify":"2018-10-30 21:32:25","date_publish":"2015-09-17 14:14:03","description":"Seahawks' Richard Sherman: If Black Lives Matter, Stop Black-on-Black Crime","filename":"data/vaneerConsumption/SeahawksRichardShermanIfBlackLivesMatterStopBlackonBlackCrime.json","image_url":"https://media.breitbart.com/media/2015/09/sherman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_09_17__1540935145.html","title":"Seahawks' Richard Sherman: If Black Lives Matter, Stop Black-on-Black Crime","title_page":"Seahawks' Richard Sherman: If Black Lives Matter, Stop Black-on-Black Crime | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Seattle Seahawks star cornerback Richard Sherman addressed an imposter Wednesday who made a social media post in his name that garnered attention. The social media post claiming to be Sherman responded to an image posted on black supremacist King Noble’s site of Sherman with his arm around teammate Marshawn Lynch with the caption, “When we gon Kill These KKKrakas Bro.”\nSherman, a product of Stanford University, began his press conference addressing that post, which he says he did not write, and ultimately the “Black Lives Matter” movement.\nRemarks as follows:\n“Before we get started, I’m gonna address the — because there was some article written. You know, you guys have seen it. Talking about King Noble and all this. I did not write that article. A lot of people had sent it to me over the weekend, but I thought this would be the best place to address it. There were some points in that article, or in that post, that were relevant and I could agree with. But there were also some obviously ignorant points in there. I don’t think any time’s a time to call out for an all-out war against police or any race of people. I thought that was an ignorant statement. But as a black man, I do understand that black lives matter. You know, I stand for that, I believe in that wholeheartedly.\nBut I also think that there’s a way to go about things, and there’s a way to do things. And I think the issue at hand needs to be addressed internally, and before we move on, because from personal experience, you know, you have living in the hood, living in the inner city, you deal with things, you deal with people dying. Dealt with a best friend getting killed … it was two 35-year-old black men. Wasn’t no police officer involved, wasn’t anybody else involved, and I didn’t hear anybody shouting “black lives matter” then … and I think that’s the point we need to get to is that we need to deal with our own internal issues before we move forward and start pointing fingers and start attacking other people. We need to solidify ourselves as people and deal with our issues, because I think as long as we have black-on-black crime and, you know, one black man killing another … if black lives matter, then it should matter all the time. You should never let somebody get killed — that’s somebody’s son, that’s somebody’s brother, that’s somebody’s friend. So you should always keep that in mind.\nAnd there’s a lot of dealings with police officers right now, I don’t think all cops are bad. You know, I think there’s some great cops out there, who do everything in their power to uphold the badge and uphold the honor and protect the people in society. But there are bad cops, and I think that also needs to be addressed. I think the police officers we have right now — you know, some of it is being brought to light, because of video cameras, everybody has a camera phone. But these are things a lot of us have dealt with our whole lives. And I think right now is a perfect time to deal with it. The climate we’re in … everybody’s being more accepting, you know, so I think the ignorance should stop. I think people realize that, at the end of the day, we’re all human beings. So, you know, before we’re black, white, Asian, Polynesian, Latino — we’re humans. So, it’s up to us to stop it. Thank you.”","url":"https://www.breitbart.com/video/2015/09/17/seahawks-richard-sherman-if-black-lives-matter-stop-black-on-black-crime/"}
