{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-22 22:42:15","date_modify":"2018-10-22 22:42:15","date_publish":"2016-01-29 09:58:49","description":"Seal was all smiles as he arrived at the G'Day USA gala dinner in Los Angeles on Thursday without girlfriend Erica Packer - despite her ex-husband James Packer also attending the event.","filename":"data/vaneerConsumption/SealattendsGDayUSAgalawithJamesPackerandMariahCarey.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B041F600000578-0-image-a-7_1454057023022.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422317_Seal-attends-G-Day-USA-gala-without-Erica-Packer-James-Mariah-Carey_1540248135.html","title":"Seal attends G'Day USA gala with James Packer and Mariah Carey","title_page":"Seal attends G'Day USA gala with James Packer and Mariah Carey | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It could have made for one very awkward run-in.\nBut Seal was all smiles as he arrived at the G'Day USA gala dinner in Los Angeles on Thursday without girlfriend Erica Packer - despite her ex-husband James Packer also attending the event with new fiancée Mariah Carey.\nWhile 38-year-old Erica's current and former flames didn't appear to talk on the red carpet, James, 48, is known for having a good and supportive relationship with his exes.\nScroll down for video\nFancy seeing you here! Seal attended the G'Day USA gala dinner in Los Angeles on Thursday without girlfriend Erica Packer but alongside her ex-husband James and his new fiancée Mariah Carey\nThe Kiss From A Rose singer, who performed on stage during the gala dinner event, opted for a classic monochrome ensemble for the occasion, wearing a black blazer and trousers with a white open-collared shirt.\nFlashing his pearly whites, the 52-year-old ex-husband of supermodel Heidi Klum appeared happy and relaxed as he posed for photographers.\nMeanwhile, a loved-up James and his pop diva fiancée exchanged loving glances as they stepped out on the red carpet together - their first public event since announcing their engagement.\nAwkward encounter? The Australian billionaire seems to have good relationships with his exes, so the potential run-in with the singer may not have been awkward\nSweet nothings: At one point Mariah was seen to be whispering in her lover's ear\nThe We Belong Together singer dazzled in a glittery black maxi dress with a plunging neckline, while her beau donned a sophisticated suit with a black tie.\nIn a display of an almost teenage romance, Mariah at one point was seen to be whispering in her lover's ear.\nThe newly engaged Australian billionaire businessman appears to have a good relationship with both of his ex-wives, with Jodhi Meares one of the first to be introduced to Mariah when the pair began dating in Junely.\nIn August last year, it was made even clearer that Jodhi and James still hold a very close bond, with the former swimwear model declaring on Instagram: 'James is actually one of my best friends.'\n'[James] is one of the biggest legends you'd ever have the pleasure of meeting,' she added.\nNew flames: Seal and Erica Packer have not yet publicly spoken about their relationship, but appear to be very much in love\nKiss from a rose! The couple have been seeing each other for at least six months, having revealed their romance in August last year\nStill close: The bond between James and first wife Jodhi was evident when the former swimwear model was one of the first people introduced to Mariah when the couple began dating in June\nSharing a snap to Instagram in June, the fashion designer was seen to be enjoying the company of her ex and his then-girlfriend.\n'Amore', she wrote in the caption, which is Italian for 'love'.\nJames and Erica split in 2013, after six years of marriage and three children together - Indigo, seven, Jackson, five, and Emmanuelle, three.\nErica and Seal have been seeing each other for at least six months, having revealed their romance in August last year.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422317/Seal-attends-G-Day-USA-gala-without-Erica-Packer-James-Mariah-Carey.html"}
