{"authors":["John Hayward"],"date_download":"2018-10-30 20:37:59","date_modify":"2018-10-30 20:37:59","date_publish":"2016-03-08 06:00:38","description":"Congressman Duncan Hunter (R-CA) says Navy SEALs have been telling him they are running short on combat rifles.","filename":"data/vaneerConsumption/SEALsShortOnCombatRiflesSaysRepDuncanHunter.json","image_url":"https://media.breitbart.com/media/2016/03/combat-navy-seals-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_07__1540931879.html","title":"SEALs Short On Combat Rifles, Says Rep. Duncan Hunter","title_page":"SEALs Short On Combat Rifles, Says Rep. Duncan Hunter","title_rss":"NULL","source_domain":"breitbart.com","text":"Congressman Duncan Hunter (R-CA), a Marine with three combat deployments to Iraq and Afghanistan on his resume, says Navy SEALs have been telling him they are running short on combat rifles.\nThe Associated Press reports Hunter describing a “weapons carousel” in which SEALs returning from deployment hand their weapons off to outgoing troops, a practice he described as undermining the “train like you fight” ideal, and disrupting the personal connection special operators develop with their finely-tuned weapons. Hunter stressed the importance of allowing special operators to train with the same weapons they bring into the field.\n“As it currently stands, following a deployment, a SEAL will have his weapon taken from him, which has been fine-tuned to certain specifications, and given to a different operator to use. This means that SEALs standing by to deploy are waiting for different teams to come back stateside just so they can use their weapons,” said Hunter.\n“They want their rifles. It’s their lifeline. So let them keep their guns until they’re assigned desk jobs at the Pentagon,” the Congressman urged.\nAccording to the Navy Times, some SEALs have been “forced to spend their own money on combat gear. Former active-duty special operator Lt. Cmdr. Sean Matson, visiting Capitol Hill at Hunter’s invitation, said he “had to put up $900 of his own money to buy a high-quality ballistic helmet when the Navy dragged its heels on upgrading his kit.”\nHunter portrayed the SEAL rifle shortage as a consequence of “wasteful spending,” noting that abundant funds for purchasing rifles, which are far less expensive than most of the equipment the military buys, should be available, based on congressional spending authorizations for special ops forces.\nHunter’s chief of staff Joe Kasper told the Navy Times shortages of “optics, night vision, and laser attachments” have also been reported, even as the budget for Navy Special Warfare increased.\n“So there are obviously some trade-offs being made, but they’re occurring at the expense of operators and their firepower – and those are the absolute worst trade-offs to make,” said Kasper.\nOne of the SEALs who confided in Hunter blamed “slow, penny-pinching bureaucracy that rarely seeks input from the service members who use the gear,” with the acquisition system so clunky that better gear is sometimes available by the time a purchase is authorized, which starts the long, slow-moving screening and acquisition process all over again.\nHunter’s letter of inquiry to the Naval Special Warfare Command chief, Rear Admiral Brian Losey, asked if “the expense of expanding the size of the special operations forces could have left too little in the budget for weapons.” Given the relatively modest cost of the weapons, that should not be a big problem unless, as Hunter suggested, too much of the command’s funding has been spent elsewhere.\nThe AP notes that Losey’s superior, Army General Joseph Votel of the U.S. Special Operations Command, suggested long maintenance cycles for the heavily-used SEAL rifles could be part of the problem. Votel promised to “take immediate action” if SEAL combat readiness has been adversely affected.\nHunter was not satisfied with that answer. “This is not a factor of too many rounds going through the weapon,” he told Votel, as quoted by the Navy Times. “It’s a matter of where the money’s being spent. What are your priorities for the SEALs? If it isn’t having a weapon that stays with you for a deployable term, then what are they?”\nAnother troubling example of that “slow, penny-pinching bureaucracy” cited in Rep. Hunter’s letter to Losey was slow reimbursement of travel expenses for SEALs, which threatens to ruin their credit ratings because they are personally accountable for late payments on their government-issued credit cards. Damage to their credit ratings could, in turn, make it difficult for SEALs to obtain the high-level security clearances they require.\nThe Navy Times relates a response to these allegations from an unnamed Navy official, who suggested Hunter was being pressured by vendors who want to “speed up the acquisition process to boost their businesses” — such as Matson, the former special operator who paid for his own helmet and now runs a military gear company.\nThe official also said Matson’s account of buying his own helmet represented an upgrade to appropriate gear he was properly issued, based on his personal preference — he was not going to be sent into the field with no helmet at all — and argued that some special-ops groups, such as the famed SEAL Team 6, have much faster acquisition cycles than others, especially when they are involved in evaluating new gear.","url":"https://www.breitbart.com/national-security/2016/03/07/rep-duncan-hunter-navy-seals-face-shortage-of-combat-rifles/"}
