{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:04:06","date_modify":"2018-10-23 03:04:06","date_publish":"2016-01-28 18:25:17","description":"Combs, 46, will help mentor Team Pharrell, according to the publication - taking on Adam Levine, Blake Shelton and Christina Aguilera, who is returning to the series after a hiatus.","filename":"data/vaneerConsumption/SeanDiddyCombssignsuptomentorPharrellWilliamsteamonTheVoice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACCF4300000578-0-image-a-32_1454004939989.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421401_Sean-Diddy-Combs-signs-mentor-Pharrell-Williams-team-Voice_1540263846.html","title":"Sean 'Diddy' Combs signs up to mentor Pharrell Williams' team on The Voice","title_page":"Sean 'Diddy' Combs signs up to mentor Pharrell Williams' team on The Voice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He won season eight of the Voice and is clearly looking to retain his crown in the 10th round.\nPharrell Williams has recruited the richest man in hip-hop to his team of advisers, reported UsWeekly on Thursday.\nSean 'Diddy' Combs, 46, will help mentor Team Pharrell, according to the publication - taking on Adam Levine, Blake Shelton and Christina Aguilera, who is returning to the series after a hiatus. Gwen Stefani is also back, but she will serve as mentor and not coach.\nScroll down for video\nAdviser: Sean 'Diddy' Combs, 46, will help mentor Team Pharrell in season 10 of The Voice according to People; here he is seen in November\nDiddy - who is worth $735 million according to Forbes, even exceeding the wealth of Dr Dre and Jay-Z - has three Grammy Awards and two VMAs so is well-placed to support the aspiring singers.\nAdam Levine - whose act Jordan Smith won the last season - has signed up Tori Kelly to his team.\nThe 23-year-old - who is up for Best New Artist at next month's Grammys ceremony - was spotted on You Tube by Scooter Braun - and has experience of being in the contestants' shoes as she auditioned for American Idol when she was 16-years-old.\nRecruited Diddy: He won season eight of the Voice and is clearly looking to retain his crown in the 10th round\nAfter Gwen Stefani kept her red seat warm last season, Christina is back and has signed up singing legend Patti LaBelle to her own advisers.\nThe iconic 71-year-old - who has two Grammy Awards to her name - finished in 8th place on Dancing With The Stars in Spring last year, in the season which was won by Rumer Willis.\nAnd Blake Shelton, 39, didn't have to look to far to recruit his new team adviser for the NBC competition series.\nTeams: Tori Kelly (L) has been signed up to Adam Levine's team and Christina is back and signed up singing legend Patti LaBelle (R) to her own advisers\nCouple: Blake Shelton has lined up his girlfriend Gwen Stefani to his team, according to Us Weekly\nThe country music star has lined up his girlfriend Gwen Stefani, according to Us Weekly, after the pair started dating during the last season.\nThey both found themselves single after Blake and Miranda Lambert split after four years of marriage, and Gwen and Gavin Rossdale broke up after being husband and wife for 13 years.\nThree months ago they confirmed their relationship, and seem to be going from strength-to-strength after spending the holidays together and being spotted looking loved up.\nSeason ten of The Voice is set to premiere on February 29, on NBC.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421401/Sean-Diddy-Combs-signs-mentor-Pharrell-Williams-team-Voice.html"}
