{"authors":["Flora Drury For Mailonline"],"date_download":"2018-10-23 00:18:19","date_modify":"2018-10-23 00:18:19","date_publish":"2016-01-11 09:18:12","description":"The Hollywood star may have raised eyebrows with his meeting with El Chapo for Rolling Stone, but he has form turning up in strange places - including visiting Iraq just months before the war (pictured).","filename":"data/vaneerConsumption/SeanPennhashistoryofstickinghisnoseinwhereitdoesntbelong.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/300679AC00000578-0-image-a-12_1452503634275.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393584_Meddling-Sean-Penn-Oscar-winning-actor-history-sticking-nose-doesn-t-belong_1540253899.html","title":"Sean Penn has history of sticking his nose in where it doesn't belong","title_page":"Sean Penn has history of sticking his nose in where it doesn't belong  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The revelation that Sean Penn had met and interviewed Joaquin 'El Chapo' Guzmán will have taken many by surprise.\nBut those who have kept an eye on Penn and his activist antics will note this is not the first time he has stuck his nose in somewhere it might not necessarily belong.\nFrom his appearance in Baghdad shortly before the Iraq War - which he vehemently opposed - to wading through the flood waters left behind by Hurricane Katrina armed with a shotgun, the Hollywood star doesn't do anything by halves, or quietly.\nSean Penn's meeting with El Chapo while he was on the run from authorities has left many shocked\nBut Penn has a history of turning up in strange places - including visiting Iraq in December 2002 (pictured)\nThe Hollywood star also decided to visit Iran in 2005, at a time when very few Americans visited the country\nPenn, who shuns Hollywood in favor of a less glitzy lifestyle, first rose to prominence as an activist in December 2002, when he headed to Iraq to conduct his own investigation into what was happening in the country.\n'I do feel an obligation to take responsibility with my government for actions that it takes,' he explained to the BBC at the time.\n'On the brink of actions that are threatened here, I am determined that if there is going to be... blood on my hands, that I didn't want that blood to be invisible. I wanted it to have the face of the people that I saw here.'\nTwo months before, Penn paid $56,000 for an advertisement in The Washington Post protesting President George W. Bush's planned invasion of Iraq.\nPenn would remain vehemently anti-war - even using his Oscars acceptance speech to bring up weapons of mass destruction, and describing Bush and Dick Cheney as 'villainously and criminally obscene people'.\nBut this was just the start for Madonna's ex-husband, and his interesting choices.\nThree years later, he decided to visit Iran - which was then a country visited by only about 500 Americans a year, not counting those of Iranian descent.\nHis humanitarian work in New Orleans was praised - but pictures of him wading through the floodwaters with a shotgun raised more than a few eyebrows at the time. Here, Penn is pictured helping people to hospital\nPenn also makes friends with people the U.S. government aren't too fond of - like Hugo Chavez, pictured\nHe wrote five dispatches from his visit for the San Francisco Chronicle, detailing what he found there.\nA few months later, his activism would take him a bit closer to home, when he decided to help out during Hurricane Katrina.\nHe later revealed he decided to go after watching the tragedy unfold for three days, at which point he decided not enough was being done to help.\n'Displaying a mix of bravado, altruism and daredevil recklessness, he repeatedly swam over to trapped homeowners to take them to higher and drier ground,' Vanity Fair reported.\nHowever, it left some confused: pictures of Penn wading through the floodwaters, with a shotgun, led some to question whether he thought he was in a Hollywood blockbuster.\nHis humanitarian work in Haiti five years later, however, has won him praise - and the title of 'ambassador-at-large' for the disaster hit island.\nBut Penn, who rose to fame in the 80s and was known for being a wild child, also has a reputation for getting close to people his own government aren't too fond of.\nEl Chapo isn't the first interview Penn has done - here he is having a chat with Cuba's Raul Castro in 2008\nPenn shakes hands with Bolivian president Evo Morales at the presidential palace in La Paz in 2012\nIn 2012, he met with Argentina's then-president Cristina Kirchner and weighed in on tensions between the Latin American country and the United Kingdom since the Falklands War - branding Britain 'colonialist'\nIn 2007, he met with President Hugo Chavez, a bete-noire of Bush's, in Caracas, while in 2008, President Raul Castro of Cuba granted him his first interview with a non-Cuban.\nPenn interviewed the latter for The Nation and Huffington Post, revealing they got on well.\nIn 2012, he even weighed in on tensions between Argentina and the United Kingdom since the Falklands War - branding Britain 'colonialist'.\nHe controversially using the Argentine term 'Malvinas' to describe the British islands, and called on David Cameron to cave to Cristina Kirchner's request for diplomatic talks.","url":"https://www.dailymail.co.uk/news/article-3393584/Meddling-Sean-Penn-Oscar-winning-actor-history-sticking-nose-doesn-t-belong.html"}
