{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:51:49","date_modify":"2018-10-22 22:51:49","date_publish":"2017-03-16 04:53:34","description":"After being accosted in an Apple store on Sunday, Sean Spicer had a happier encounter with the general public on Wednesday when fans in Nashville lined up to pose for him in selfies at Trump's rally.","filename":"data/vaneerConsumption/SeanSpicerambushedbyfansatTrumpsNashvillerally.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51EE6800000578-0-image-a-16_1489641430408.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318884_Sean-Spicer-ambushed-time-fans_1540248709.html","title":"Sean Spicer ambushed by fans at Trump's Nashville rally","title_page":"Sean Spicer ambushed by fans at Trump's Nashville rally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As the press secretary for an administration that hates the press, Sean Spicer's working days must be stressful enough - and on Sunday his personal life followed suit when he was cornered in an Apple store by an angry Trump hater.\nBut on Wednesday he finally had a chance to smile as fans at Trump's Nashville, Tennessee rally swarmed him asking for selfies.\nThe press secretary was photographed smiling with Trump supporters, and while his suit cut a sharp contrast with their Make America Great Again hats and Deplorable Lives Matter pins, he looked right at home.\nSmile! White House press secretary Sean Spicer poses with a reporter after Donald Trump's speech at his Nashville, Tennessee rally on Wednesday\nTwo's company: Two more fans join Spicer for a selfie while more hopefuls gather behind him. Earlier, Trump had criticized a Hawaii judge's decision to halt the latest version of his travel ban and promised to repeal and replace Obamacare\nSelfie time: Spicer is joined by several other people - including the photographer himself - for this selfie photograph. Spicer is not often seen with crowds of adoring fans\nCheese! Spicer is joined by two more members of the audience at the Nashville rally. On Sunday Spicer had a less pleasant experience when he was accosted in an Apple store by a critic\nGroup shot: Spicer continues to entertain crowds hungry for selfies during the Nashville rally. The event mimicked those seen on Trump's election campaign trail - complete with references to Hillary Clinton\nHappy times: Spicer's job - as the media spokesman for a White House that loathes the media - puts him in an unenviable position. So meeting his fans gave the embattled press secretary some much-needed time off\nDuring the rally , Trump took swings at Hawaiian Judge Derrick Watson, who suspended his most recent travel ban, saying'We're going to fight this terrible ruling.\n'We're going to take this case as far as it needs to go, including all the way up to the Supreme Courty. We're going to win and we're going to keep our citizens safe. Believe me.'\nTrump later bashed the 'bad, fake media' for what he anticipated would be negative reporting on his speech.\nA single protester disrupted the event with a sign calling him a 'liar.'\n'One person!' Trump marveled. 'And they'll be the story tomorrow.'\nHe also bristled at 'fake news' reports that he was hedging on his pledge to build a wall on the southern US border. 'Everybody wants to build our wall,' he said. 'Usually that means you get a good price.'\nSpicer's encounters after Trump's speech echoed a similar - but less happy, for him - meeting on Sunday, when a member of the public cornered him, asking how he liked working for a 'fascist'.\nHe looked awkward and tried to flee as Shree Chauhan, 33, asked: 'Have you committed treason too? Just like the president. Have you committed treason too? What can you tell me about Russia?\nSpicer smiles politely during the encounter and replies 'It's such a great country that allows you to be here,' before eventually walking away.\nChauhan, who is of Indian descent and was born in America, claims this was a racist. She told DailyMail.com that she felt as if Spicer was suggesting that she had no right to be in the US.\nHowever, it's possible Spicer was referring to the right of all Americans to exercise free speech - even if they are confronting one of the most powerful people in the country while he shops.","url":"https://www.dailymail.co.uk/news/article-4318884/Sean-Spicer-ambushed-time-fans.html"}
