{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 19:50:39","date_modify":"2018-10-30 19:50:39","date_publish":"2017-03-24 03:05:32","description":"The New England Patriots became the first major pro sports franchise to win a championship during Donald Trump’s presidency. So, it only makes sense that the Pats will be the first team to visit the White House, to be honored as champions. | Sports","filename":"data/vaneerConsumption/SeanSpicerPatriotsSettoVisitWhiteHouseonApril19.json","image_url":"https://media.breitbart.com/media/2017/02/brady.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_03_23__1540929039.html","title":"Sean Spicer: Patriots Set to Visit White House on April 19","title_page":"Sean Spicer: Patriots Set to Visit White House on April 19 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The New England Patriots became the first major pro sports franchise to win a championship during Donald Trump’s presidency. So, it only makes sense that the Pats will be the first team to visit the White House, to be honored as champions.\nNow, we know the exact date that event will take place. ESPN’s Adam Schefter reported the announcement from White House press secretary Sean Spicer on Thursday afternoon:\nWhite House press secretary Sean Spicer announced the Patriots will visit the White House on April 19. — Adam Schefter (@AdamSchefter) March 23, 2017\nOf course, not all the Patriots will make the trip. Players such as Martellus Bennett, Chris Long, Devin McCourty, and Dont’a Hightower have all said they will not attend. Some won’t attend for political reasons, some say they won’t attend for personal reasons.\nNonetheless, plenty of Patriots will make the trip. Bill Belichick and Tom Brady, two friends of the president, presumably among them. Though, Brady did not make the trip to the White House in 2014, and has not officially commented on whether or not he will attend this time.\nFollow Dylan Gwinn on Twitter: @themightygwinn","url":"https://www.breitbart.com/sports/2017/03/23/sean-spicer-patriots-set-visit-white-house-april-19/"}
