{"authors":["The Associated Press"],"date_download":"2018-10-30 21:23:58","date_modify":"2018-10-30 21:23:58","date_publish":"2017-04-01 00:00:00","description":"WASHINGTON — White House press secretary Sean Spicer is apologizing for making an \"insensitive\" reference to the Holocaust in earlier comments about Syrian President Bashar Assad's use of chemical weapons.","filename":"data/vaneerConsumption/SeanSpicerapologizesforinsensitivereferencetoHolocaust.json","image_url":"https://media.arkansasonline.com/img/photos/2017/04/01/132418278_132416315-f9bff01e35cf41e686e65d7fd856c25d_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_apr_11_sean-spice_6f229ad7f4fe6d4309c1d3d4dd82794c__page=2_1540934638.html","title":"Sean Spicer apologizes for 'insensitive' reference to Holocaust","title_page":"Sean Spicer apologizes for 'insensitive' reference to Holocaust","title_rss":"NULL","source_domain":"arkansasonline.com","text":"White House press secretary Sean Spicer speaks during the daily press briefing at the White House, Friday, March 31, 2017, in Washington. Spicer discussed the U.S., China relationship and other topics. (AP Photo/Evan Vucci)\n5:45 P.M. UPDATE:\nWASHINGTON — White House press secretary Sean Spicer is apologizing for making an \"insensitive\" reference to the Holocaust in earlier comments about Syrian President Bashar Assad's use of chemical weapons.\nSpicer said in an interview with CNN that he mistakenly used \"an inappropriate, insensitive reference to the Holocaust.\" He said there was no comparison, and \"it was a mistake to do that.\" He added: \"It was my blunder.\"\nSpicer said during a White House briefing Tuesday that Adolf Hitler \"didn't even sink to using chemical weapons.\" That drew instant rebuke from Jewish groups and critics who noted it ignored Hitler's use of gas chambers to kill Jews during the Holocaust.\nSpicer was attempting to discuss the horror of the chemical weapons attack last week in Syria.\nRead Wednesday's Arkansas Democrat-Gazette for full details.\nEARLIER:\nWASHINGTON — White House Press Secretary Sean Spicer said Tuesday that Adolf Hitler \"didn't even sink to using chemical weapons\" — a comment at odds with Hitler's use of gas chambers to kill Jews during the Holocaust.\nSpicer was attempting to discuss the horror of the chemical weapons attack last week in Syria, which President Donald Trump's administration is blaming on President Bashar Assad.\n\"We didn't use chemical weapons in World War II,\" said Spicer, adding that \"someone as despicable as Hitler ... didn't even sink to using chemical weapons.\"\nMinutes later, Spicer delivered a garbled defense of his remarks in which he tried to differentiate between Hitler's actions and the gas attack on Syrian civilians last week. The attack in northern Syria left nearly 90 people dead, and Turkey's health minister said tests show sarin gas was used.\n\"I think when you come to sarin gas, there was no, he [Hitler] was not using the gas on his own people the same way that Assad is doing,\" Spicer said. \"There was clearly ... I understand your point, thank you. There was not ... He brought them into the Holocaust center I understand that.\n\"I appreciate the clarification. That was not the intent,\" he said.\nAfter the briefing, Spicer emailed a statement to reporters: \"In no way was I trying to lessen the horrendous nature of the Holocaust. I was trying to draw a distinction of the tactic of using airplanes to drop chemical weapons on population centers. Any attack on innocent people is reprehensible and inexcusable.\"\nSpicer's comments came on the first day of Passover and a day after the White House held a Seder dinner marking the emancipation of the Jewish people, a tradition started during former President Barack Obama's administration.\nAccording to the U.S. Holocaust Memorial Museum, the Nazis experimented with poison gas in late 1939 with the killing of mental patients, which was termed \"euthanasia.\" Both mobile and stationary gas chambers were later used, with up to 6,000 Jews gassed each day at Auschwitz alone.\nRead Wednesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/apr/11/sean-spicer-suggests-even-hitler-didnt-use-chemica/?page=2"}
