{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-22 23:05:00","date_modify":"2018-10-22 23:05:00","date_publish":"2016-01-28 11:44:48","description":"The plane is believed to have clipped a wave and flipped over as it neared Whitsunday Island off the northeast coast of Queensland on Thursday.","filename":"data/vaneerConsumption/SeaplanecrashesatHamiltonIslandwith11peopleonboard.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30AA033400000578-0-image-a-37_1453981480654.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420806_Seaplane-crashes-Hamilton-Island-11-people-board-clipped-wave-flipped-over_1540249500.html","title":"Seaplane crashes at Hamilton Island with 11 people on board","title_page":"Seaplane crashes at Hamilton Island with 11 people on board | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 25-year-old woman has been airlifted to hospital with serious head injuries after a seaplane crashed with 11 people on board.\nThe plane is believed to have clipped a wave and flipped over as it neared Whitsunday Island off the northeast coast of Queensland on Thursday.\nOne woman was taken to Mackay Hospital by helicopter and the other 10 were treated by paramedics on Hamilton Island in one of the function rooms.\nThe Cessna 208 seaplane was coming in to land at Chance Bay when it struck rough water, bounced and then crashed into some plants on the beach, police said.\nA 25-year-old woman has been airlifted to hospital with serious head injuries after a seaplane crashed with 11 people on board\nThere were seven women and four men on board the plane - all aged in their twenties and thirties.\nVolunteer Marine Rescue's Mal Priday said the people who were on board the plane were assessed by paramedics.\n'I believe it has overturned, 11 passengers as far as I know onboard were evacuated back to Hamilton Island on a private vessel,' he said.\n'One person had a head injury and I believe has been evacuated to Proserpine Hospital by helicopter — and the other 10 are being treated by paramedics here on Hamilton Island in one of the function rooms.'\nOne woman was taken to Proserpine Hospital by helicopter and the other 10 are being treated by paramedics on Hamilton Island in one of the function rooms\nThe seaplane was flying from Hamilton Island (pictured) to Whitsunday Island when it crashed\nThe Whitsunday Water Police attended the scene and the plane is expected to be retrieved on Friday.\n'The plane poses no navigational or environmental hazard and it is expected to be retrieved tomorrow,' a spokesman for Queensland Police said.\n'At this stage, it appears likely that no further investigation by the Queensland Police Service will be necessary.'\nThe Australian Transport Safety Bureau said they have received reports of an incident, but no decision had been made on whether the crash will be investigated.","url":"https://www.dailymail.co.uk/news/article-3420806/Seaplane-crashes-Hamilton-Island-11-people-board-clipped-wave-flipped-over.html"}
