{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 23:07:22","date_modify":"2018-10-22 23:07:22","date_publish":"2016-07-28 00:00:00","description":"\"I have no idea. I can't even hazard a guess to phylum,\" one scientist says. The curious orb was found and captured during a recent Nautilus expedition near California's Channel Islands.","filename":"data/vaneerConsumption/SeaSlugDiscoBallBeautifulDeepSeaPurpleBlobPuzzlesScientists.json","image_url":"https://media.npr.org/assets/img/2016/07/28/purple-blob_wide-13ff687e10c5d782c6b953eb2323b3ed9f615501.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_07_28_487799041_sea-slug-disco-ball-beautiful-deep-sea-purple-blob-puzzles-scientists_1540249642.html","title":"Sea Slug? Disco Ball? Beautiful Deep-Sea Purple Blob Puzzles Scientists","title_page":"Sea Slug? Disco Ball? Beautiful Deep-Sea Purple Blob Puzzles Scientists : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Sea Slug? Disco Ball? Beautiful Deep-Sea Purple Blob Puzzles Scientists\nEnlarge this image toggle caption E/V Nautilus/Screen shot by NPR E/V Nautilus/Screen shot by NPR\nResearchers have found a curious purple orb near California's Channel Islands – and it's left them stumped.\nTo our untrained eye, it looks a little like a really dazzling Christmas ornament. Alternatively, Smithsonian compared it to an unhatched Pokemon.\nDuring the recent expedition, unnamed scientists from the Nautilus exploration vessel are recording and chatting about what they're seeing when they come across the mysterious, beautiful blob. Watch their video here:\nYouTube\n\"What is that?\" \"'I'm stumped. I have no idea. I can't even hazard a guess to phylum,\" the team says.\n\"What if it's an egg sac of some sort?\" \"It looks like a disco ball right now.\"\nThe team was able to suction up the 5 cm-wide orb, after a close encounter with a meddling crab. It was found in an underwater canyon 5,301 feet deep, spokesperson Susan Poulton from the E/V Nautilus told The Two-Way in an email.\nAfter a closer look, the team says it is most likely a pleurobranch – a type of sea slug. That's a nudibranch relative – and as Smithsonian explains: \"Known for their brilliant hues, nudibranchs are a type of sea slug that inhabit a range of environments.\"\nNational Geographic adds that these mollusks \"live in warm and cold water, on a variety of ocean surfaces. Most of them are about the size of a finger or hand.\"\nHowever – the brilliant purple color raises some questions. \"Currently none of the known species of California deep-sea pleurobranchs are purple, so this could be a new discovery,\" the Nautilus team says. \"Pleurobranchs have rhinophores (ear-like structures) in a particular location and a gill under the mantle on the right side, but we are still determining if this is present on this sample,\" Poulton adds.\nAnd, the creature put on a bit of a show once it was suctioned onboard the exploration vessel. \"After sampling, it began to unfold to reveal two distinct lobes,\" the team says. The change is dramatic:\ntoggle caption Ocean Exploration Trust\nMarine scientist Jeff Goddard of the University of California, Santa Barbara offered a few other guesses about what the blob could be to Smithsonian:\n\" 'Anytime you see a round structure like that you have to consider the possibility it's an embryo,' he tells Smithsonian.com. Even so, 'the purple orb would be an unusual egg mass, especially if it contained a single large egg/embryo,' Goddard says. An embryo of what, he's not sure. But he also says it's possible that it's a fibrous sponge. Another option is a sea squirt predator. The video shows that it's the only purple orb in an area full of gray tunicates, so it could be munching on the critters.\"\nPoulton says the team has \"sent the samples to the Harvard Museum of Comparative Zoology and consulted with scientists there about a potential identification.\"\nExpedition leader Robert Ballard has a history of fascinating discoveries — he's the explorer who found the wreckage of the Titanic.\nThe Two-Way has a love of deep-sea stories — let's call this one the latest in our ongoing series, \"Mysteries of the Deep.\"","url":"https://www.npr.org/sections/thetwo-way/2016/07/28/487799041/sea-slug-disco-ball-beautiful-deep-sea-purple-blob-puzzles-scientists"}
