{"authors":[],"date_download":"2018-10-22 22:52:51","date_modify":"2018-10-22 22:52:51","date_publish":"2014-06-11 06:51:49","description":"\"I just want people to die, and I'm gonna die with them!\" Aaron Ybarra wrote day of the shooting at small Seattle college, according to prosecutor.","filename":"data/vaneerConsumption/SeattlePacificUniversityAllegedShooterStoppedTakingMeds.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/500161/140610-aaron-ybarra-1528_8beb48d2b41920389a4906924cae8c91.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_seattle-pacific-university-alleged-shooter-stopped-taking-meds-n128101_1540248771.html","title":"Seattle Pacific University Alleged Shooter Stopped Taking Meds","title_page":"Seattle Pacific University Alleged Shooter Stopped Taking Meds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSEATTLE - The man charged with killing one student and wounding two others at a small Seattle college last week had stopped taking his medications because he \"wanted to feel the hate,\" and he detailed his plans in a handwritten journal for two weeks before the attack, a prosecutor said Tuesday.\n\"I just want people to die, and I'm gonna die with them!\" Aaron Ybarra wrote the day of the shooting, King County Prosecutor Dan Satterberg said.\nSign up for breaking news alerts from NBC News\nSatterberg released new details of the allegations as he filed charges of first-degree murder, attempted murder and assault against Ybarra, 26. Satterberg is seeking a sentence of life in prison.\nAuthorities say Ybarra has been held without bail and is on suicide watch at the county jail since a student pepper-sprayed him and ended the rampage Thursday at Seattle Pacific University.\nYbarra's lawyer, Ramona Brandes, has said her client has a long history of mental issues but is aware of the trauma caused by the shooting and is sorry. She said Tuesday that no decision has been made yet on whether he will seek a mental-illness defense.\n\"We have to look at his symptoms he manifested in the past, his treatment and his jail records to determine whether his mental illness arises to the level of a defense. These are choices he's going to be involved in,\" Brandes told The Seattle Times. \"He wasn't on his meds and he committed an action that is incomprehensible. Had he been on his meds, would this have happened? We'll continue asking that for all time.\"","url":"https://www.nbcnews.com/news/us-news/seattle-pacific-university-alleged-shooter-stopped-taking-meds-n128101"}
