{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:13:42","date_modify":"2018-10-30 20:13:42","date_publish":"2015-07-05 16:12:20","description":"Now students as young as sixth grade have ready access to taxpayer-funded birth control, without ever having to tell mom and dad. |","filename":"data/vaneerConsumption/SeattleTeensGetBirthControlatSchoolMoreEasilyThanTheyCanBuyaSoda.json","image_url":"https://media.breitbart.com/media/2015/07/Implant-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_05__1540930422.html","title":"Seattle Teens Get Birth Control at School ‘More Easily Than They Can Buy a Soda’","title_page":"Seattle Teens Get Birth Control at School ‘More Easily Than They Can Buy a Soda’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A number of Seattle public middle and high schools now offer long-acting reversible contraceptives (LARCs) to their students, free of charge and free of parental consent. Now students as young as sixth grade have ready access to taxpayer-funded birth control, without ever having to tell mom and dad.\n“Thanks to a Washington state Medicaid program called Take Charge and the nonprofit Neighborcare, teens can access confidential counseling on different birth control methods — and LARC insertion — more easily than they can buy a soda,” boasts Salon Magazine.\nThe statement is not just journalistic flourish, but literal truth. Seattle famously banned soda pop from public school campuses in 2004 for health reasons, yet teen students can get an IUD inserted at their school’s health center without their parents’ knowledge.\nWhat Salon fails to mention in its puff piece is that LARCs are associated with serious side effects, such as uterine perforation and infection. IUDs also frequently act as abortifacients by preventing the implantation of a fertilized egg.\nAccording to Grist, Neighborcare Health “was the first organization to step up to the plate and provide LARC placement services in certain Seattle public high schools and middle schools.” LARCs are the most expensive forms of birth control available, but now they are implanted in Seattle school girls for free thanks to Take Charge, “a Washington State Medicaid program that’s specifically targeted toward minors seeking contraceptive services.”\nBecause of Take Charge, Grist says, “girls under 19 who don’t want to use their parents’ private insurance to get birth control have a way to get contraception in school at no cost.”\nIn an interesting twist, Salon applauds increased conversation about birth control among teens while simultaneously praising the program’s “confidentiality,” meaning that students can get contraceptives without their parents finding out.\nSalon writes that “one of the greatest benefits of the clinic, it seems, is the degree to which it’s opened up the conversation around birth control in the school. Girls will openly trade stories about what kind of contraception they’re using.”\nSo casual locker room chitchat about birth control is good, while dialogue between teens and parents is bad.\nAccording to Katie Acker, a “health educator” with Neighborcare at Chief Sealth International School, more talk of sex and contraception is downright invigorating.\n“It’s absolutely amazing and crazy,” Acker said. “The birth control culture, for lack of a better term, and the conversations have just changed so much.”\nShe said that “conversations are just happening so openly and so excitedly. There’s so much pride around, ‘I’ve got this method, I’ve got this method.’ It’s not a hush-hush thing anymore.”\n“So many students will come in and say, ‘Oh, my friend got the IUD, can I make an appointment?’”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/politics/2015/07/05/seattle-teens-get-iuds-at-school-more-easily-than-they-can-buy-a-soda/"}
