{"authors":[],"date_download":"2018-10-22 20:49:55","date_modify":"2018-10-22 20:49:55","date_publish":"2014-06-02 18:21:43","description":"The Seattle City Council approves a $15 hourly minimum wage — the highest in the nation. It would be phased in over several years.","filename":"data/vaneerConsumption/SeattleApprovesCountrysHighestMinimumWageof15.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/482201/140602-seattle-minimum-wage-mms-1426_376b6b1c23cb1ada8c2fe907bb831c49.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_seattle-approves-countrys-highest-minimum-wage-15-n120511_1540241395.html","title":"Seattle Approves Country's Highest Minimum Wage of $15","title_page":"Seattle Approves Country's Highest Minimum Wage of $15","title_rss":"NULL","source_domain":"nbcnews.com","text":"The City Council voted 9-0 in front of a sometimes raucous audience that frequently interjected cheers, applause and shouts of “Shame on you!” as the council debated several changes to the measure.\nSeattle’s higher minimum wage would surpass San Francisco’s minimum of $10.74 an hour.\nWashington state also has the highest state minimum wage, at $9.32 an hour.\nSome small business owners worry that a higher minimum wage could put them out of business.\nThe International Franchise Association, a Washington, D.C.-based business group that represents franchise owners, said it plans to sue to stop the ordinance.\n\"The City Council's action today is unfair, discriminatory and a deliberate attempt to achieve a political agenda at the expense of small franchise business owners,\" the group said in a statement.\nMeanwhile, a group called 15 Now led by Socialist Seattle City Council member Kshama Sawant is collecting signatures for a ballot measure that would create an immediate wage hike for large businesses and a three-year phase-in for small business.\n“Our victory is not complete, but we have fought until the last day, the last hour, against all the loopholes demanded by business,” Sawant said before the council vote. “$15 in Seattle is just the beginning.”\n-The Associated Press and NBC News staff","url":"https://www.nbcnews.com/business/business-news/seattle-approves-countrys-highest-minimum-wage-15-n120511"}
