{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:08:30","date_modify":"2018-10-30 18:08:30","date_publish":"2015-12-31 08:01:30","description":"SeaWorld is suing the California Coastal Commission for conditioning an Orca habitat expansion on ending killer whale breeding programs.","filename":"data/vaneerConsumption/SeaWorldSuesCaliforniaoverOrcaBreedingBan.json","image_url":"https://media.breitbart.com/media/2015/12/Killer-whale-birth-SeaWorld-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_31__1540922910.html","title":"SeaWorld Sues California over Orca Breeding Ban","title_page":"SeaWorld Sues California over Orca Breeding Ban | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SAN DIEGO, CALIFORNIA — SeaWorld is suing the California Coastal Commission (CCC) for conditioning approval of an extensive $100 million dollar Orca habitat expansion on ending killer whale breeding programs and whale transfers, which would end the signature Orca shows at the San Diego park.\nIn October the CCC board approved the park’s Blue World Project to expand killer whale habitat, but conditioned the approval on halting breeding programs and forcing the stop of any whale transfers between the park and other facilities. The move essentially twists the arm of the organization and will ultimately end any killer whale presence at the facility. The alternative would be not to go forward with the massive habitat expansion for the killer whales.\nSeaWorld stated in a complaint filed Tuesday with the Superior Court of California:\nThis last-minute ‘no breeding or transfer’ condition is unprecedented, and it is plainly illegal for one very clear reason: the Coastal Commission’s jurisdiction — which is entirely defined and circumscribed by the Coastal Act — does not extend to the care, breeding or transport of the SeaWorld orcas because the orcas are not, in any way, part of the coastal or marine environment. All of SeaWorld’s activities with respect to the care, breeding and transportation of orcas occur onshore in the orca pools and not in the marine environment and are specifically governed by federal law….\nSeaWorld’s legal challenge is based in part on jurisdiction and part on the basis that the conditions are preempted by federal law. The organization stated Tuesday that the “overreaching condition” to “ban orca breeding” does not fall under the CCC’s authority.\n“The Coastal Commission has neither the legal jurisdiction nor, accordingly, the expertise, to dictate the care, feeding, or breeding of animals held solely in captivity under human care,” a portion of the SeaWorld complaint read.\nThe Marine Mammal Protection Act in conjunction with the Animal Welfare Act of 1970, and regulations promulgated under those laws, govern the taking, management and conservation, display, and breeding of orcas and their progeny. SeaWorld’s breeding program complies with those laws and regulations, and the Coastal Commission has no jurisdiction to impose its own requirements as to those matters of federal law.\nStephen Wells, Executive Director of the Animal Legal Defense Fund, lashed out, saying “shame on SeaWorld” for bringing the suit. Wells suggested that the suit will “almost certainly fail.” He pledged the support of the ALDF to fight SeaWorld over the habitat expansion project unless orca shows are phased out.\nFollowing the CCC vote, SeaWorld chose to cut back on its killer whale shows.\nSeaWorld has faced challenges following release of the documentary Blackfish in 2013, which harpooned the organization for activities including keeping killer whales in captivity and for killer whale performances.\nPETA similarly backed Steve-O of MTV’s Jackass show. Fox 40 reported that the 40-year-old prankster was fined $239 dollars or an alternative court appearance for a freeway stunt that left a San Diego freeway sign for the park saying, “SeaWorld Sucks.”\nPETA protesters also came out against the new 1.5 acre, 10.5 million gallon habitat expansion at a January reveal of the Blue World Project in San Diego.\nSeaWorld quoted the Association of Zoos and Aquariums (AZA) declaring that the park is “meeting or exceeding the highest standard of animal care and welfare of any zoological organization in the world.”\nSeaWorld also stated that the organization is already highly regulated by the federal government including “frequent random inspections by federal veterinarians and other officials.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/12/31/seaworld-sues-california-orca-breeding-ban/"}
