{"authors":["Alicia Lu"],"date_download":"2018-10-30 22:24:39","date_modify":"2018-10-30 22:24:39","date_publish":"2014-08-15 18:37:08","description":"Last January, the Sundance Film Festival premiered a documentary that forever shook people's perceptions of the family theme park SeaWorld. Blackfish revealed the alleged appalling conditions and deadly consequences of holding orcas in captivity,…","filename":"data/vaneerConsumption/SeaWorldOrcasGetBiggerHomesAfterASolid18MonthsOfBlackfishOutrage.json","image_url":"https://imgix.bustle.com/uploads/image/2018/6/12/8372b25e-c8f6-40fd-b4f8-10a1f7144796-whales-1263066_1920.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35962-seaworld-orcas-get-bigger-homes-after-a-solid-18-months-of-blackfish-outrage_1540938279.html","title":"SeaWorld Orcas Get Bigger Homes, After A Solid 18 Months Of 'Blackfish' Outrage","title_page":"SeaWorld Orcas Get Bigger Homes, After A Solid 18 Months Of 'Blackfish' Outrage","title_rss":"NULL","source_domain":"bustle.com","text":"Last January, the Sundance Film Festival premiered a documentary that forever shook people's perceptions of the family theme park SeaWorld. Blackfish revealed the alleged appalling conditions and deadly consequences of holding orcas in captivity, focusing on killer whale Tilikum, who's been involved in the deaths of three people. Eighteen months later, in response to the angry public reaction and pressure from animal-rights groups that followed Blackfish, SeaWorld is expanding its orca habitat at three of its parks and investing in further research on the species.\nSeaWorld San Diego, which is home to 10 killer whales, will be the first location to expand its orca environment through an effort called the Blue Water Project. The project will almost double the size of the park's current killer whale tanks, and will span 1.5 acres at 50 feet deep and 350 feet in length. Just going by the amount of water alone, the new facility will have 10 million gallons of water, a significant jump from the current 5.6 million.\nThe new facility will also allow visitors to observe the orcas from behind a 40-foot-tall glass wall below the waterline.\nIn a statement, Jim Atchison, CEO and president of SeaWorld Entertainment Inc., said:\nThrough up-close and personal encounters, the new environment will transform how visitors experience killer whales. Our guests will be able to walk alongside the whales as if they were at the shore, watch them interact at the depths found in the ocean, or a birds-eye view from above.\nGetty Images/Getty Images News/Getty Images\nSure. That's why they're building it.\nBesides the hundreds of millions of dollars the company will be plunging into this expansion, SeaWorld's also pledging $10 million in matching funds to killer whale research, including studying the animal's hearing ranges and tracking the nutrition and reproduction of the Southern Resident Killer Whale. SeaWorld says it also plans to appoint an independent advisory committee of scientists to oversee the park's orca program.\nThe new habitat will even include an underwater current to provide the whales with exercise.\nPredictably, some aren't buying SeaWorld's purported concern for its killer whales. Many animal-rights activists are pushing for much more than the expansion of the facilities. PETA, for example, which has long pushed for SeaWorld to release its marine animals from captivity, wrote on its affiliate website, SeaWorld of Hurt:\nThe abusement park is sinking millions of dollars into building bigger prisons, complete with flouncy bits on the outside to give visitors the illusion of the sea.\nThe group suggests that SeaWorld's expansion plan is nothing but an attempt to save itself after the company's stock and attendance tanked after the Blackfish backlash, a decline that SeaWorld has also admitted to.\nAnd PETA director of animal law Jared Goodman told the LA Times,\nThis is a desperate drop-in-the-bucket move to try to turn back the hands of time when people [now] understand the suffering of captive orcas, and it will not save the company.\nSeaWorld San Diego's expansion project is expected to be completed by 2018. SeaWorld Orlando and SeaWorld San Antonio will follow in its footsteps with similar projects.\nImages: Aktim/Pixabay, Getty, WSBTV, Efraimstochter/Pixabay","url":"https://www.bustle.com/articles/35962-seaworld-orcas-get-bigger-homes-after-a-solid-18-months-of-blackfish-outrage"}
