{"authors":["Sebastian Shakespeare For The Daily Mail"],"date_download":"2018-10-22 21:53:28","date_modify":"2018-10-22 21:53:28","date_publish":"2016-01-11 01:52:27","description":"Eighties TV ‘golden girl’ Selina Scott, 64, is a patron of the Wild Camels Protection Foundation. She met the animals in Mongolia while sourcing material for her sock company.","filename":"data/vaneerConsumption/SEBASTIANSHAKESPEAREonwhycamelswanttokissSelinaScott.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3000AC2500000578-0-image-a-61_1452477094611.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393242_SEBASTIAN-SHAKESPEARE-camels-want-Selina-Scott-smooch_1540245208.html","title":"SEBASTIAN SHAKESPEARE on why camels want to kiss Selina Scott","title_page":"SEBASTIAN SHAKESPEARE on why camels want to kiss Selina Scott | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eighties TV ‘golden girl’ Selina Scott was pursued by royals and once chased round a hotel room by singer Adam Faith. Now she enjoys the affections of a hairier creature.\nSelina, 64, is a patron of the Wild Camels Protection Foundation. She met them in Mongolia, right, while sourcing material for her sock company.\n‘They are lovely,’ she tells me. ‘Dignified, gentle, friendly. But they are endangered and I have promised to do all I can to protect them.’\nIt’s enough to give her former admirers the hump.\nEighties TV ‘golden girl’ Selina Scott, 64, is a patron of the Wild Camels Protection Foundation. She met the animals in Mongolia, above, while sourcing material for her sock company\nTrinny mourns her father\nScarcely a year after Trinny Woodall’s ex-husband Johnny Elichaoff fell to his death from the roof of a West London shopping centre, the TV presenter is mourning her father.\nFormer banker Bruce has died in France at the age of 88. It was his pal, the St Trinian’s creator Ronald Searle, who gave the girlfriend of art gallery owner Charles Saatchi her nickname. Trinny’s real name is Sarah-Jane.\nWhen cartoonist Searle heard she’d cut off a schoolmate’s plait, he declared her ‘just like a St Trinian’s girl’.\nHere comes trouble - Kate's sister hits 18\nHere comes trouble. Kate Moss’s half-sister, Lottie, turned 18 at the weekend and marked the occasion by slipping into the sort of little black dress that transformed Elizabeth Hurley from a bit-part actress into an A-lister.\nWhile Hurley’s frock was an eye-catching Versace number held together with safety pins, Lottie’s was a sheer Balmain mini exposing her bra and knickers.\nShe completed the ensemble with high heels and smoky eyes.\n‘Such an amazing night,’ gushed Lottie, left, who was partying at a chichi bar in London’s West End.\nHowever, will her middle-aged big sister keep up?\nKate Moss’s half-sister, Lottie (pictured above), turned 18 at the weekend and marked the occasion by slipping into the sort of little black dress that transformed Elizabeth Hurley from a bit-part actress into an A-lister","url":"https://www.dailymail.co.uk/news/article-3393242/SEBASTIAN-SHAKESPEARE-camels-want-Selina-Scott-smooch.html"}
