{"authors":[],"date_download":"2018-10-22 21:32:44","date_modify":"2018-10-22 21:32:44","date_publish":"2014-06-05 18:21:16","description":"The vote was 78-17.","filename":"data/vaneerConsumption/SebeliusSuccessorBurwellEasilyConfirmedinSenate.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/490301/health_nominee-jpeg-0cee6_b803bb03b041de82bad45bff810e15c3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_sebelius-successor-burwell-easily-confirmed-senate-n123781_1540243964.html","title":"Sebelius Successor Burwell Easily Confirmed in Senate","title_page":"Sebelius Successor Burwell Easily Confirmed in Senate ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHer predecessor was one of the most controversial figures in Washington, but Sylvia Matthews Burwell has had smooth sailing so far.\nThe Senate easily confirmed Burwell on Thursday to be the next Secretary of Health and Human Services, the administration official charged with implementing the highly charged new health care law.\nThe vote was 78-17.\nAfter its disastrous rollout, the health law has become one of the most dominant campaign issues of the 2014 midterm cycle, and Burwell’s top job will be to steer oversight of the legislation. The previous secretary, Kathleen Sebelius, faced months of calls for her resignation before finally stepping down in April.\nStill, Republicans have mostly praised Burwell’s private sector record, competence and willingness to take on a job that few people in Washington would want.\n“Regardless of my objections to the Affordable Care Act, the Department of Health and Human Services needs competent leadership,” Arizona Sen. John McCain said at a confirmation hearing for Burwell last month. “I believe Ms. Burwell has the qualifications to run Health and Human Services.”\nRepublican Sen. Tom Coburn of Oklahoma called Burwell a “great listener” who started conducting meetings with GOP members even before her confirmation hearings started.\n“That's a characteristic too often that we don't see as members of Congress in members of an administration, whether they are Republican or Democrat,” he said.\nBurwell previously served as the president’s budget chief. She has also worked as the president of the Walmart Foundation and the head of global development at the Bill & Melinda Gates Foundation.","url":"https://www.nbcnews.com/politics/congress/sebelius-successor-burwell-easily-confirmed-senate-n123781"}
