{"authors":[],"date_download":"2018-10-30 20:59:19","date_modify":"2018-10-30 20:59:19","date_publish":"2015-06-14 04:00:00","description":"Baltimore Ravens running back Ray Rice is seen punching — and knocking out — his fiancee in a hotel elevator.","filename":"data/vaneerConsumption/SECfootballtacklesplayermisconduct.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/06/14/Images/photos.medleyphoto.7420893.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_sec-football-tackles-player-misconduct__1540933159.html","title":"SEC football tackles player misconduct","title_page":"SEC football tackles player misconduct","title_rss":"NULL","source_domain":"ajc.com","text":"Baltimore Ravens running back Ray Rice is seen punching — and knocking out — his fiancee in a hotel elevator. Florida State quarterback Jameis Winston is accused of rape.\nIt’s no secret that football has been struggling with a woman problem.\nSo, when the SEC moved recently to ban its schools from accepting athletes subject to charges of sexual or domestic violence at another institution it was calculated to strike a new and improved tone of zero tolerance. The 14-school conference — a football powerhouse — seemed determined to avoid the missteps the National Football League made in its handling of the Rice scandal. The proposal was pushed by the University of Georgia, which has cut marquee players for bad behavior only to see them reappear on the other side of the the line of scrimmage suited up for the other team.\nBut already there is some confusion and grumbling about the new policy, notably from University of Alabama Coach Nick Saban, who said it’s too vague and denies promising players a second chance. This year, Saban’s squad accepted a player who’d been booted from UGA for sexual misconduct.\nMost sexual assaults on college campuses are also not reported, or not investigated if the victim chooses not to cooperate, so the new rule won’t apply in many situations. Given questions about the scope of the new rule from coaches such as Saban, it’s also unclear how uniformly it will be applied by SEC schools.\nBut the fact that SEC weighed in shows how politically treacherous the issue of violence against women has become in the big-bucks world of college football.\nThe ‘Jonathan Taylor Rule’\nSEC university officials who adopted the proposal at meeting late last month in Destin, Fla., made clear that the ban had a poster child: Jonathan Taylor.\nThe 6-foot-4, 335-pound University of Georgia defensive lineman was arrested last summer in Athens and charged with aggravated assault and battery for an attack against a female student. Taylor used his hands to choke her and had also struck her “several times with a closed fist,” according to a police report. Police who arrived at her dorm room said the 19-year-old women had bruises on her arms and legs as well as scratches and red marks on her neck. Taylor was booted from the UGA football team.\nBut after spending last fall at Copiah-Lincoln Community College in Mississippi, he found a new home: the University of Alabama in January. Just three months after arriving in Tuscaloosa, however, he was in trouble again — charged him with beating another girlfriend, police said. The woman in that alleged assault has since recanted her statement but the charges have not been dropped. Alabama, which had faced scrutiny for signing Taylor in the first place, let him go.\nTaylor has pled not guilty to the charges in Athens and his attorney, Kim Stephens, said a status conference in the case is scheduled for late this month.\nTo critics, it pointed to all that was wrong with college football: placing money and winning over ethics.\nUGA athletic director Greg McGarity told The Atlanta Journal-Constitution said the Taylor move “certainly added to the discussion,” but he said the issue was already on the minds of school officials, especially following the Rice scandal.\n“We felt the SEC should take a stand, a very public stand and we hope it sends a strong message to young men and to young women that this type of behavior will absolutely not be tolerated,” McGarity said.\n“We hope this gains more traction nationally.”\nThe SEC is believed to be the first college athletic conference to adopt such a rule. An official with The Atlantic Coast Conference — home to Georgia Tech’s football program — said it doesn’t have a similar proposal currently under consideration.\nAllen Sack, a professor at the College of Business at the University of New Haven who played on Notre Dame’s 1966 National Championship Football Team, said there is one reason that other football programs may be reluctant to follow suit.\n“Money. It is gigantic money,” Sack said. “It’s why schools sign some kids they shouldn’t. Because if they’re not going to play for your school they are going to play somewhere else.”\nDan Lebowitz, director of the Center for the Study of Sport in Society at Northeastern University, agreed.\n“The SEC did what they always do. They took on an incredibly high-risk kid because he could play football,” he said. “Now what they are doing is looking at the long-term sustainability of their brand.”\nLoopholes and vague language\nBut while the new SEC policy is aimed at preventing violence against women there are loopholes and potential landmines.\nThe new SEC rule bans the transfer of a student athlete “who has been subject to official university or athletics department disciplinary action at any time during enrollment at any previous collegiate institution.” Serious misconduct is defined narrowly, later on in the rule, as”sexual assault, domestic violence or other forms of sexual violence.”\nThere is no stipulation that the individual be found guilty, or even formally charged.\nThat omission irked Alabama’s Saban who said it should “clearly define exactly why or what” the offenses were at the previous school, and that the words “convicted and felony should be involved in the rule.”\nMcGarity allowed that the ban could apply even to those who had faced allegations without a formal charge or finding of wrongdoing. But he said the rule allows for the SEC commissioner to issue a waiver that could be used in those instances.\nAnother big loophole is one that underscores and complicates most sexual assault cases: many victims never come forward or — if they do — often decline to pursues charges.\nOne such instance, involving a pair of UGA football players, was detailed in records reviewed by The Atlanta Journal-Constitution as part of a series of stores on campus rape. In the 2010 case, a young woman told police she had become drunk and only learned she had sex with the two players through a text message exchange the next day.\n“This sickens me because I do not remember this at all and did not give consent for it at all,” she told police.\nNonetheless the victim and her friend “expressed a certain apprehension about pressing charges against athletes, citing that they had to see the athletes every day because they live in the same dorm,” according to the police report. The victim’s friend described “intimidation” many non-athletes in the dorm felt.\nThe AJC is not naming the men since they were not charged criminally. As a matter of policy, the AJC does not name victims of sexual assault.\nWomen and Football\nDespite football’s notoriously macho culture, women have been flocking to the game in greater and greater numbers. Over the past few years, the NFL has attracted more regular season female viewers than either professional basketball and baseball. Some estimates say women make up some 45 percent of pro football fans.\nSo, it’s no wonder the sport is looking to keep them in the fold.\nLebowitz said the NFL in particular has made a targeted push to recruit female fans, marketing jerseys in feminine cuts and establishing fantasy football teams aimed at women.\nAnd while Taylor may have a difficult road ahead in the courts his football career may not be over yet.\nStephens, his attorney, said he’s had calls from some schools inquiring about the likely outcome of the criminal charges, which he said are more complicated than have been portrayed so far in police documents.\n“His SEC career may be over but I think — I hope — he will play football again,” Stephens said.","url":"https://www.ajc.com/news/sec-football-tackles-player-misconduct/eLXjPQP2HUuWlUMhcPSWdK/"}
