{"authors":["Matt Turner"],"date_download":"2018-10-30 23:28:58","date_modify":"2018-10-30 23:28:58","date_publish":"2016-12-07 00:00:00","description":"It looks like the Securities and Exchange Commission might be about to shine a spotlight on one of the hot topics in Wall Street trading.","filename":"data/vaneerConsumption/SECmaybepreparingtolookatexchangeaccessfees.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_sec-may-be-preparing-to-look-at-exchange-access-fees-2016-12_1540942138.html","title":"SEC may be preparing to look at exchange access fees","title_page":"    SEC may be preparing to look at exchange access fees - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders work on the floor of the NYSE Thomson Reuters The Securities and Exchange Commission may be about to shine a spotlight on one of the hot topics in Wall Street trading.\nThe Commission is seeking additional comment on a request from the New York Stock Exchange to change the fees its charges for certain connectivity services, it said in a note late last month.\nThe SEC's focus is technical and the wording in the note is specific to particular charges, but upstart trading venues and high-speed trading firms are hoping it has broader significance. They say that establishment exchanges such as the NYSE are overcharging for connectivity, colocation and market data.\n\"We are pleased that the Commission will be subjecting this incremental fee application to review,\" Doug Cifu, the CEO of electronic trading firm Virtu told Business Insider.\"As we have repeatedly said we think exchange market data and connectivity fees have 'jumped the shark' as an excessive cost burden on the industry.\"\nSeveral big market-makers have argued they are in a bind because they have to sign up to use the NYSE's and Nasdaq's proprietary depth-of-book feeds and pay for other add-ons, such as having their servers located in exchange data centers. The exchanges, in contrast, argue that these feeds are optional, that there is competition, and that trading firms can terminate feeds or colocation arrangements if they get too pricey.\nThe latest SEC note, which is buried in a Nov. 21 update and went largely unnoticed, said that the commission is \"concerned\" that there might not be \"viable alternatives for users\" but to pay the fee NYSE is proposing. In all, the word \"concerned\" appears five times in the note. It said:\n\"The Commission is concerned that the Exchange has not supported its argument that there are viable alternatives for Users inside the data center in lieu of obtaining such information from the Exchange. The Commission seeks comment on whether Users do have viable alternatives to paying the Exchange a connectivity fee for the NYSE Premium Data Products.\"\nThe SEC's request for additional comment could of course have little or no bearing on NYSE's application to change its fees. Still, market participants say it could hint that change is on its way.\n\"Obviously just because they are asking for comment doesn't mean they are going to ultimately find that the pricing is anti-competitive, but asking the question is the first step,\" Don Ross, CEO of equity trading platform PDQ Enterprises, told Business Insider.\n\"This could be an interesting battle in the ongoing market-data-cost war between brokers and exchanges,\" Justin Schack, a partner at Rosenblatt Securities, added.\nThe New York Stock Exchange and the SEC declined to comment.\nThe decision also represents the latest episode in the long-running battle between NYSE and IEX, America's newest stock exchange. IEX was the only firm to file a comment letter in response to NYSE's application, and it pushed for the SEC to ask for more information on the fees the exchange group was proposing.\nThe Commission has invited interested parties to submit data, views and arguments by December 12. Anyone who wants to respond to an earlier submission has until December 27 to do so.\nWatch this space.","url":"https://www.businessinsider.com/sec-may-be-preparing-to-look-at-exchange-access-fees-2016-12"}
