{"authors":["Alex Matthews","Rachel Watson For The Scottish Daily Mail","James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-22 23:08:25","date_modify":"2018-10-22 23:08:25","date_publish":"2017-03-10 01:59:06","description":"Downing Street believes it is only a matter of time until Nicola Sturgeon is granted her wish for a second vote on the breaking up the Union with the only debate left being over 'the date' it happens.","filename":"data/vaneerConsumption/SecondScottishreferendumisINEVITABLEsaysMinister.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/00/3E12400C00000578-0-image-a-46_1489020992414.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299720_Second-Scottish-referendum-INEVITABLE-says-Minister_1540249705.html","title":"Second Scottish referendum is INEVITABLE says Minister","title_page":"Second Scottish referendum is INEVITABLE says Minister | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May's team believe it is only a matter of time until Nicola Sturgeon is granted her wish for a second vote on breaking up the Union\nA second referendum on Scottish independence is 'inevitable' Government ministers have revealed.\nDowning Street believes that it is only a matter of time until Nicola Sturgeon is granted her wish for a second vote on breaking up the Union.\nThe Scottish First Minister has continued to issue threats over a second referendum following the UK-wide decision to leave the EU last year.\nA minister told the Financial Times: 'It's looking inevitable, I don't think we're in any position to stop it happening.'\nWhile a source close to Theresa May's team said the only debate over a second referendum would be about 'the date'.\nA spokesman for the Prime Minister has previously insisted she would not endorse another vote.\n'There should not be a second referendum,' he said.\nSources also say that No10 would try to delay the vote until Britain has left the EU.\nHowever, a poll has showed Scots voters split down the middle on the independence issue.\nIpsos MORI research for STV News found 50 per cent of those who knew how they would vote backed breaking away from the UK.\nMrs Sturgeon has claimed autumn 2018 would be the 'common-sense time' to stage a second Scottish independence referendum.\nThe Scottish First Minister has said she is not and never has been 'bluffing' about forcing voters to return to the polls on the issue which was ruled a 'once in a generation' vote in 2014.\nSNP leader Mrs Stugeon has claimed a vote on separation is 'highly likely' and has now given her clearest hint yet that Scotland could be just 18 months away from another vote.\nThe First Minister has refused to rule out holding another divisive vote on breaking up the Union within the next 18 months\nMrs Sturgeon has repeatedly claimed time is running out for the UK Government to present a Brexit deal which would let Scotland stay within the single market, even if the rest of the country leaves.\nScottish Tory leader Ruth Davidson insisted Scots did not want a second referendum and Downing Street has insisted repeatedly there should not be a re-run of 2014.\nIn an interview to appear on BBC Two's Brexit: Britain's Biggest Deal tonight, Mrs Sturgeon was asked if autumn 2018 was a likely time to hold another referendum.\nShe said: 'Within that window, when the, the sort of outline of a UK deal, becomes clear on the UK exiting the EU, I think would be the common-sense time for Scotland to have that choice, if that is the road we choose to go down.'\nAsked if she was not ruling out a referendum next year, Mrs Sturgeon added: 'I'm not ruling anything out.'\nIf Mrs Sturgeon is to consider holding a referendum next autumn she would have to announce that at least nine months before it could be held.\nThis comes after the Electoral Commission ruled legislation for the vote should be passed six months before a three-month period of referendum campaigning begins.\nIt would also need to be authorised by the Westminster government. The PM's spokesman refused to state categorically that Mrs May would block a vote.\nBut he said: 'The question is should there be a second referendum, and we don't believe there should.\n'The referendum was only held in 2014, it was a fair and legal vote, and both sides said they would abide by the result.'\nMrs Sturgeon was also quizzed by the BBC's political editor Laura Kuenssberg on whether or not she was bluffing about holding another referendum. She said: 'I'm not and I never have been.'\nScottish Tory leader Ruth Davidson said: 'People in Scotland don't want a second referendum, and the SNP doesn't have a mandate for one.\n'Nicola Sturgeon needs to provide some certainty for Scotland, and rule it out.'\nScottish Labour leader Kezia Dugdale said: 'This is another attempt by Nicola Sturgeon to sow division, at a time when the country needs to pull together more than ever.'","url":"https://www.dailymail.co.uk/news/article-4299720/Second-Scottish-referendum-INEVITABLE-says-Minister.html"}
