{"authors":["Associated Press"],"date_download":"2018-10-22 23:32:54","date_modify":"2018-10-22 23:32:54","date_publish":"2016-01-11 06:26:00","description":"CHICAGO (AP) — Even though fewer U.S. teens are smoking, secondhand smoke remains a big problem for them, a government study found. Nearly half of nonsmoking...","filename":"data/vaneerConsumption/Secondhandsmokehitsalmosthalfofteenswhodontsmoke.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:7da48c0920d249b58de78004871bcb9b-48qEJGFphM8d437f0aaf9214c53d-135_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3392960_Secondhand-smoke-hits-half-teens-dont-smoke_1540251174.html","title":"Secondhand smoke hits almost half of teens who don't smoke","title_page":"Secondhand smoke hits almost half of teens who don't smoke | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Secondhand smoke hits almost half of teens who don't smoke\nCHICAGO (AP) — Even though fewer U.S. teens are smoking, secondhand smoke remains a big problem for them, a government study found.\nNearly half of nonsmoking kids in middle school and high school encountered secondhand tobacco smoke in 2013, and rates were even higher among smokers.\nEarlier studies on teens and secondhand smoke in specific places, such as cars or indoors, indicate that the problem has declined in recent years but the new research suggests it's still affecting millions of kids.\nFILE - In this Saturday, March 2, 2013, photo, a cigarette burns in an ashtray at a home in Hayneville, Ala. A government study released on Monday, Jan. 11, 2016, shows that even though fewer U.S. teens are smoking, exposure to secondhand smoke remains a big problem. Nearly half of nonsmoking kids in middle school and high school were exposed to secondhand tobacco smoke in 2013, and rates were even higher among smokers. (AP Photo/Dave Martin)\n\"These findings are concerning because the U.S. Surgeon General has concluded that there is no safe level of secondhand smoke exposure,\" said lead author Israel Agaku, a researcher at the Centers for Disease Control and Prevention,\nSecondhand smoke has been linked with several illnesses in children, including breathing problems, ear infections, bronchitis and pneumonia. In adults, it has been linked with heart disease and lung cancer.\nThe study results are based on a national survey of more than 17,000 middle school and high school kids. Exposure was defined as being around tobacco smoke at least once within the past week.\nNearly 1 in 4 nonsmokers who reported any exposure said they were around tobacco smoke daily. Settings included home, school, cars and public places. It's not clear how many had only brief exposure.\nThe study was published online Monday in the journal Pediatrics.\nCDC data show that youth smoking has fallen steadily in recent years, reaching about 9 percent among high schoolers in 2014. At least 26 states have smoke-free laws affecting indoor public places and worksites, and more than 80 percent of U.S. homes have no-smoking rules.\nThe researchers say the study results show efforts are needed to expand smoke-free zones.\n___\nOnline:\nPediatrics: http://bit.ly/1mGaGnn\nCDC: http://www.cdc.gov\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3392960/Secondhand-smoke-hits-half-teens-dont-smoke.html"}
