{"authors":[],"date_download":"2018-10-22 22:31:15","date_modify":"2018-10-22 22:31:15","date_publish":"2014-05-10 16:19:07","description":"The balloon caught on fire and exploded on Friday night with three people inside.","filename":"data/vaneerConsumption/SecondBodyFoundinHotAirBalloonAccidentSearch.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/433591/140509-hot-air-balloon-fire-2126_348f37455377bfd47e06770f8152877b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hot-air-balloon-accident_second-body-found-hot-air-balloon-accident-search-n102161_1540247475.html","title":"Second Body Found in Hot Air Balloon Accident Search","title_page":"Second Body Found in Hot Air Balloon Accident Search","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA second body was found Saturday morning following a fiery hot air balloon accident in eastern Virginia that left two people dead and crews searching for a third victim, officials said.\nThe body was located around 11 a.m. in a wooded area of Caroline County, Virginia, State Police spokeswoman Corinne Geller said during a news conference.\nThe balloon, carrying three people, ascended 8 p.m. Friday as part of a precursor to the Mid-Atlantic Balloon Festival scheduled for Saturday and Sunday at Meadow Event Park. But officials say it hit a utility line, which caused it to erupt into flames, shoot into the sky and then explode.\nThe two bodies were discovered about 1,500 yards apart, Geller said. Identities have not yet been released.\nThe search area is densely wooded, posing a challenge to the 100 personnel conducting the ground search for the third body and remnants of the balloon, Geller said.\nThe process is also moving slowly because crews are being “meticulous — so nothing gets overlooked,” Geller said.\n“We will stay here until the third occupant is located,” Geller said, adding, “We’re very hopeful that we will locate the third occupant.”\nThe search teams were also dedicated to finding the basket of the vehicle and the balloon, but “we’re not sure what’s left of it,” Geller said, pointing out that the remnants could have been incinerated.\nBut Sam Parks, President of the Balloon Federation of America said he’s confident the balloon will be found. “To have such a large piece of material disappear would be highly unlikely,” Parks said, pointing out that balloons stand seven stories high when inflated.\nStill, “there’s a lot of trees and large vegetation,” Parks said from the scene, and Geller said the balloon “flew away very quickly and went very high” before it erupted mid-air.\n“The fire increases the heat and that makes the balloon rise rather rapidly,” Geller said.\nWitnesses said the pilot “did everything he could in his power to save his passengers lives and his own,” Geller said. “Unfortunately, this was a very rapid event — and then of course there was the explosion.”\nWitnesses also described seeing at least one person falling from the balloon, but it’s unclear whether that person jumped or fell, Geller said. “We may actually never know.”\nThe skies were overcast Friday night, and officials don’t believe weather was a factor. The Virginia State Police, Federal Aviation Administration and National Transportation Safety Board are each conducting investigations into the cause of the crash.\nThe Mid-Atlantic Balloon Festival was cancelled, organizers said in a statement. \"The Meadow Event Park staff is devastated. It’s a shocking situation for everyone.\"","url":"https://www.nbcnews.com/storyline/hot-air-balloon-accident/second-body-found-hot-air-balloon-accident-search-n102161"}
