{"authors":[],"date_download":"2018-10-22 22:20:27","date_modify":"2018-10-22 22:20:27","date_publish":"2014-06-09 17:36:45","description":"With tourism and business travel rebounding, particularly on the high end, smaller U.S. cities are looking to grab their slices of the travel pie.","filename":"data/vaneerConsumption/SecondaryCitiesSeekTourismSpotlight.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/497036/140609-portland-1311_58deb91a7c85637a3ed5892ebfdfc25b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_secondary-cities-seek-tourism-spotlight-n126446_1540246827.html","title":"Secondary Cities Seek Tourism Spotlight","title_page":"Secondary Cities Seek Tourism Spotlight","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"When you're marketing a second-tier city, it's all about your brand,\" said Cleo Battle, executive vice president of the Louisville Convention and Visitors Bureau.\n\"If you're a San Francisco or Orlando, your brand is already well established in consumers' minds and you don't have to sell it,\" he explained. \"But a second-tier city needs a focused brand that resonates with consumers, and bourbon has worked well for us. A convention organizer considering Louisville … might not know anything else about our city … but they'll say, 'Yes, I love what they're doing with bourbon.' \"\nThe city has developed an \"Urban Bourbon Trail\" itinerary, available in print or as a smartphone app, that leads visitors returning from day trips at regional distilleries in the Louisville area to more than 25 local establishments serving a vast array of bourbons.\nHospitality developers have taken note. Louisville is seeing some $2 billion in infrastructure development, with the downtown Kentucky International Convention Center undergoing a revamp and 1,700 new hotel rooms under construction.\nIn addition to new Hilton and Embassy Suites properties, the city will soon get a new 600-room Omni Hotels & Resorts outlet as part of a $261 million mixed-use development approved for the \"Fourth Street Live!\" entertainment, office and retail district, which attracts some 4.5 million visitors a year.\nLouisville was picked for the project — which aims to be the lodging company's first luxury AAA Four Diamond hotel — because Omni looks \"for a pro-business city that also has a personality, something we can market\" when opting to break ground in new territory, said Peter Strebel, the hotel chain's vice president of operations. Omni just last year opened a hotel in nearby Nashville, \"another secondary city that has a great story and culture behind it,\" he noted.\nLouisville's metrics were right, too. \"Their occupancies are pretty strong — which I think is driven by location — and there's a nice convention center [next door],\" said Strebel. \"We felt the city was underserved in terms of first-class, full-service luxury hotels.\"\nMojo on Lake Michigan\nOther comparable second-tier cities are also seeing growth in visitor numbers and tourism infrastructure. Milwaukee, Wisconsin — home to the Harley-Davidson Museum, Fortune 500 firms and a world-famous brewery heritage, but not usually thought of as a first-tier tourism or business-travel draw — raked in $2.9 billion in travel receipts in 2012, making the industry the city's top employer, according to Paul Upchurch, president and CEO of tourist board Visit Milwaukee.\nThis year also looks promising in the town known as Brew City. In terms of arrivals, the first quarter \"was extremely strong in all segments, although leisure was a little slower than business travel because we had what everyone else in the Midwest had—a long and cold winter,\" said Upchurch.\n\"In my opinion, second-tier cities should sell what they have.\"\nMilwaukee, too, is experiencing what Upchurch called \"significant growth\" in its hotel market, particularly in developments geared toward higher-end leisure and business travelers. Improvements to its convention center, sports venues and other attractions are also in the works. \"Like many other cities our size, we're looking at some of the needs that we think will make a lot of sense in terms of tourism development,\" he said.\nProperty openings include a new full-service Marriott, a Hilton Garden Inn \"that was a phenomenal renovation of a century-old building\" and a soon-to-open 380-room hotel at the Potawatomi Bingo Casino, just outside downtown.\nKimpton Hotels & Restaurants is also planning a property, but the most iconic, typically Milwaukee hotel entrant might be the Brewhouse Inn & Suites, a 100-room boutique facility built into the former Pabst Brewery — and the perfect marriage of upscale hotel development and local heritage. \"The old kettles are still there; it's very experiential,\" noted Upchurch.\nTo promote all these developments, Visit Milwaukee in May launched both a refreshed website at VisitMilwaukee.org and a summer marketing campaign primarily geared at the drive-in source markets of Wisconsin, northern Illinois and Chicago.\nThe city, like most other second-tier urban destinations, recognizes that its appeal is mainly regional and, at most, domestic. At Visit Pittsburgh, in Pennsylvania's second-largest city, president and CEO Craig Davis said, \"I will be very straight with you: The drive-in market is our sweet spot.\n\"In my opinion, second-tier cities should sell what they have,\" he said, adding that smaller tourism boards like Pittsburgh's should \"always aspire to be better but understand you're trying to match what you have with what consumers want.\n\"If you're honest with yourself about what you are and what differentiates you from everyone else, I think you'll market yourself more effectively,\" Davis said, noting that in terms of occupancies, average hotel rates and rev par, Pittsburgh leads the second-tier pack. \"We're proud, and we own who we are.\"\nFocusing, for now, his promotional efforts—including the city's successful \"Mighty Beautiful\" campaign—on the 55 percent of the U.S. population that lives within a six-hour drive of Pittsburgh, Davis said he tends to regard international and overseas markets as \"the next frontier.\"\nMiller at Travel Portland — which partners in certain domestic marketing efforts with Visit Pittsburgh — has no such reservations. He agrees that Portland is \"being true to ourselves\" and \"not directly competing\" with first-tier destinations but said he is also convinced the city can hold its own in competitive foreign markets.\n\"It's absolutely achievable, or I wouldn't be doing what I'm doing,\" Miller said. \"We're already getting visitors who may be on their first trip to the U.S., and they're coming here because they've seen our ads or heard about us around the world.\"\nReaching overseas\nWhile continuing to market to the drive-in Pacific Northwest region, ranging from Vancouver, British Columbia, to Eugene, Oregon, and Seattle and Spokane in Washington state, Portland has invested more than $1 million in overseas promotions.\n\"We've upped our game in several key markets, such as Germany and the U.K.,\" Miller said. \"Those are two of our biggest international source markets, so we're increasing investments there while also looking farther afield.\" Other major or up-and-coming markets for Portland include France, the Netherlands, Japan and, in particular, China.\nSome of its competitors might think Travel Portland is tilting at windmills, but not so at Brand USA. Founded in 2010 to promote U.S. travel to audiences abroad, the Washington, D.C.-based organization \"represents and markets the entirety of the United States, from our gateway cities to the smaller off-the-beaten-path destinations,\" said Camila Clark, director of marketing communications.\n\"The culture in Portland is changing dramatically how we think of ourselves and the value the consumer gets here.\"\nBrand USA officials see Canada and Mexico as particularly fertile source markets for second-tier city destinations in the states. \"Our neighbors … are the two largest sources of international visitors, and many times visitors from these countries have visited the U.S. before,\" said Clark. \"Therefore, they're looking for new travel experiences — many of which are available beyond the gateway cities.\"\nNot satisfied with broadening its customer base, Travel Portland is also aiming higher in terms of hotel room rates. Thanks to strong occupancies and robust investment in hotel product, Miller said he thinks average nightly rates in the city could rise by $20 right away. \"The consumer is paying that in other markets for similar product,\" he said. \"The culture in Portland is changing dramatically how we think of ourselves and the value the consumer gets here.\"\nThe time for discounting has passed, Miller added. \"I think we're past the recession mentality of having to be cheap in order to attract business.\"","url":"https://www.nbcnews.com/business/travel/secondary-cities-seek-tourism-spotlight-n126446"}
