{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 01:58:53","date_modify":"2018-10-23 01:58:53","date_publish":"2016-01-29 16:14:36","description":"Around 100 romantic notes sent and received by Jack Wilson Cox, pictured, and the older Eliza Turnham were discovered during renovation works at the Five Arrows Hotel in Waddesdon, Bucks.","filename":"data/vaneerConsumption/SecretWW1lovelettersdiscoveredbyworkmenatFiveArrowspub.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B4368300000578-0-image-a-65_1454085163597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422893_Stash-secret-love-letters-teenage-WW1-soldier-woman-13-years-senior-discovered-workmen-old-pub_1540259933.html","title":"Secret WW1 love letters discovered by workmen at Five Arrows pub","title_page":"Secret WW1 love letters discovered by workmen at Five Arrows pub | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cox returned from the war and married while Eliza Turnham died a spinster\nBoth lived near the stately home of Waddesdon Manor in Buckinghamshire\nJack Wilson Cox, pictured here in uniform, was deployed during the Great War to France in 1915\nA stash of secret love letters between a teenage First World War soldier and a woman 13 years his senior have been uncovered by workmen at an old pub.\nAround 100 romantic notes were discovered during renovation works in the roof at the Five Arrows Hotel, near the gates of stately home Waddesdon Manor in Buckinghamshire.\nThe letters are believed to have been sent between Eliza Turnham, the landlord's daughter, and Jack Wilson Cox, who was deployed to France in 1915.\nWaddesdon Estate archivist Catherine Taylor described the letters, which were found behind a chimney, as 'romantic' and 'intriguing'.\nShe said: 'We think that Eliza must have hidden the letters away, and they are one of the most significant recent finds here at Waddesdon.\n'Jack was 17 in July 1914 and seems to have lied about his age to enlist early. He later transferred to the Royal Engineers as a signaller and Motor Dispatch Rider.\n'Eliza was 13 years older than Jack and in some of the letters it seems like writing between an older sister and a younger brother.\n'But in others he talks about 'perhaps stealing a kiss' and they are very romantic; it's really intriguing.'\nDespite the age difference, Ms Taylor said they show two people with a very close relationship who have obviously known each other a long time.\nShe said: 'Elsie was the eldest of five children and her three younger brothers also fought in the First World War and were friends of Jack's.\n'Despite being thirteen years older than Jack they appear to have had a very close relationship and active correspondence while he was away.'\nThe touching notes are full of news about Waddesdon friends and colleagues, memories of going on trips with Eliza and her family, and news from the Front.\nThe touching notes are full of news about Waddesdon friends and colleagues, memories of going on trips with Eliza and her family, and news from the Front\nWaddesdon Estate archivist Catherine Taylor described the letters, which were found behind a chimney, as 'romantic' and 'intriguing'\nEliza Turnham pictured later in life after both wars had ended in 1949\nThey also speak of the weather and parcels received.\nJack was the son of James Wilson Cox, chauffer to Alice de Rothschild, the younger sister of Baron Ferdinand de Rothschild, who built the manor in the 19th century.\nThe teenage soldier survived the war and returned to live in Waddesdon, close to Eliza.\nFollowing in his father's footsteps he became a chauffeur to the Rothschilds.\nJack went on to marry a girl from Luton in 1923, but Eliza never married, perhaps pining for her lost love. She died in Aylesbury in 1953 aged around 70 years old.\nThe letters, which date from 18 June 1917 to 28 October 1918, were discovered by an electrician laying new cabling in the roof space at the Grade II listed Five Arrows pub.\nA selection of the letters will go on display at Waddesdon Manor from March 23, as part of the Tales From The Archive exhibition.\nThe Turnham brothers, siblings of Eliza Turnham, pictured on horseback outside of the Five Arrows Hotel\nThe letters, which date from 18 June 1917 to 28 October 1918, were discovered by an electrician laying new cabling in the roof space at the Grade II listed Five Arrows pub, pictured then and now\nHow the Five Arrows Hotel looks today, located close to the gates of the stately home Waddesdon Manor","url":"https://www.dailymail.co.uk/news/article-3422893/Stash-secret-love-letters-teenage-WW1-soldier-woman-13-years-senior-discovered-workmen-old-pub.html"}
