{"authors":[],"date_download":"2018-10-22 22:13:04","date_modify":"2018-10-22 22:13:04","date_publish":"2014-05-09 13:38:06","description":"In the chat with the Young African Leaders Initiative Network (YALI), Kerry addressed the abducted schoolgirls.","filename":"data/vaneerConsumption/SecretaryKerryHostsTwitterChatonAfrica.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/431721/140509-john-kerry-10a_79e78cb4abe5d9d674c18d7710f9daf2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_secretary-kerry-hosts-twitter-chat-africa-n101326_1540246384.html","title":"Secretary Kerry Hosts Twitter Chat on Africa","title_page":"Secretary Kerry Hosts Twitter Chat on Africa","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSecretary of State John Kerry hosted a Twitter chat with a network of young African public figures, activists and entrepreneurs to answer questions about American policy in the region on Friday during the last day of the World Economic Forum on Africa in Abuja, Nigeria.\nNBC News' Ann Curry submitted a question:\nThe chat with the Young African Leaders Initiative Network (YALI) — President Barack Obama’s signature effort to invest in an emerging generation of African leaders — followed Kerry’s announcement that American experts had arrived in Nigeria to help search for the 276 abducted Nigerian schoolgirls.\nIn a stark juxtaposition to the goals of YALI, the girls were abducted by the terrorist group Boko Haram, which roughly translated means, “Western education is sinful.”\n\"Through YALI, the United States provides training, tools, and technology to support young African leaders, connecting them to each other, the United States, and opportunities to develop themselves and their communities,\" the State Department said in the statement announcing the event.\nKerry met with YALI graduates and 2014 finalists when he visited Africa last week, the statement added.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/secretary-kerry-hosts-twitter-chat-africa-n101326"}
