{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 03:15:02","date_modify":"2018-10-23 03:15:02","date_publish":"2017-03-16 13:57:30","description":"The Queen's private secretary will reportedly call the Prime Minister with the coded message after the monarch passes away, it emerged today.","filename":"data/vaneerConsumption/SecretcodeforwhentheQueendiesisrevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E53DD4200000578-0-image-a-109_1489671010656.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320356_Secret-code-Queen-dies-revealed_1540264502.html","title":"Secret code for when the Queen dies is revealed","title_page":"Secret code for when the Queen dies is revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"British officials will use the code words 'London Bridge is down' to inform each other the Queen has died, it emerged today.\nThe Queen's private secretary will reportedly call the Prime Minister with the coded message after the monarch passes away.\nIt will start in train a series of carefully planned events over how the death of the Head of State will be handled and reported to her public.\nThe Queen looking healthy at the National Army Museum today. The plans in place for her death emerged today, included a coded phrase which will be passed from her private secretary to the Prime Minister\nQueen Elizabeth, 90, has ruled for 65 years and has appeared strong and healthy in recent public appearances.\nBut it emerged today that civil servants have extensive plans in place for when she does pass away, with the leaders of the 36 countries for whom she is a figurehead being the first to be informed after the UK Prime Minister, the Guardian reported.\nThe coded phrase is understood to be in place to prevent switchboard operators getting the news before those in power.\nOnce each of the Commonwealth governments have been informed, the media will be told, with TV shows on BBC One, Two and Four interrupted and going to the news. Radio 4 and Radio 5 Live will also go to the news.\nBoth Houses of Parliament would be recalled, according to plans, which are believed to have been in place since the 1960s.\nIt is understood that a period 12 days of official mourning will be announced and a funeral will take place at Westminster Abbey.\nKing George VI's 1952 funeral. Plans for the Queen's death have been in place since the 1960s\nHer funeral will be held 12 days after her death and she will lie in state in Westminster Hall for four days, with more than half a million people expected to visit.\nAround 2,000 people will attend the funeral, before the Queen's body is taken by road to Windsor Castle, where she will be buried in the Royal Vault.\nPrince Charles would become King and the current Duke of Cambridge, Prince William, would become the Prince of Wales.\nDespite the report of the plans being published today, the Queen is said to be fit and healthy and was in good spirits when she attended a Commonwealth Day service earlier this week.\nShe also has a busy diary of events over the coming months, including opening the new headquarters of the Met Police next week, visiting the Chelsea Flower Show in May and taking a salute in her birthday parade in June.\nToday she attended the reopening of the National Army Museum in Chelsea, where she wore a blue tweed coat and matching hat.","url":"https://www.dailymail.co.uk/news/article-4320356/Secret-code-Queen-dies-revealed.html"}
