{"authors":[],"date_download":"2018-10-22 22:37:23","date_modify":"2018-10-22 22:37:23","date_publish":"2014-05-12 02:26:17","description":"Agents were reportedly diverted from White House duty to protect the then-director's assistant's home an hour away.","filename":"data/vaneerConsumption/SecretServiceOrdersProbeIntoOperationMoonlightReport.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/435316/140511-sercret-service-jms-2232_078e0b18d528068f58df1ccc19413894.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_secret-service-orders-probe-operation-moonlight-report-n102756_1540247843.html","title":"Secret Service Orders Probe Into 'Operation Moonlight' Report","title_page":"Secret Service Orders Probe Into 'Operation Moonlight' Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe current head of the Secret Service has ordered an investigation into allegations that agents were taken off White House patrol to protect her predecessor's assistant at home, the agency said Sunday night.\nDirector Julia Pierson asked the Department of Homeland Security inspector general to look into the accusations of improper use of resources nearly three years ago, which were detailed in a Washington Post report.\n\"Any allegations of impropriety or misconduct will be aggressively investigated and addressed,\" the Secret Service said in a statement.\nThe newspaper reported that the agents in question were part of the Prowler surveillance team, which patrols the outskirts of the White House grounds.\nTwo agents were reportedly reassigned twice a day to check on the home of then-Director Mark Sullivan's assistant, who claimed she was being harassed by a neighbor. The assignment was known as Operation Moonlight.\nThe assistant lived in La Plata, Maryland, almost an hour's drive from the White House. On the first day of reassignment, two agents were moved minutes before President Obama left on his helicopter — normally a high-security event, the newspaper reported.\nA Secret Service spokesman disputed accounts that Operation Moonlight went on for months, saying the reassignment took place for just a few days.\n\"Director Pierson will ensure the Secret Service responds to any findings from this investigation and implements any recommendations or corrective actions,\" the agency said in its statement.","url":"https://www.nbcnews.com/news/us-news/secret-service-orders-probe-operation-moonlight-report-n102756"}
