{"authors":["Louise Cheer For Daily Mail Australia"],"date_download":"2018-10-22 20:48:47","date_modify":"2018-10-22 20:48:47","date_publish":"2016-01-29 04:03:58","description":"Australians have been warned by cyber security experts to password protect their security cameras (pictured) as criminals could be accessing them without their knowledge.","filename":"data/vaneerConsumption/Securitycamerasnotpasswordprotectedputpeopleatriskofidentitytheft.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE29D900000578-0-image-a-41_1454035478051.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421966_Security-cameras-not-password-protected-people-risk-identity-theft_1540241327.html","title":"Security cameras not password protected put people at risk of identity theft","title_page":"Security cameras not password protected put people at risk of identity theft | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"People who are not password protecting their security cameras are unknowingly putting themselves and others at risk of identity theft.\nMembers of the public can access and live stream activity from inside homes or businesses that have these cameras without the knowledge of its owners.\nCyber security expert Dr Malcolm Pattinson, from the University of Adelaide, told Daily Mail Australia people could use the information gathered from this security loophole to steal identities.\nMembers of the public can access and live stream activity from inside homes or businesses that have these cameras without the knowledge of its owners. Above is a Melbourne salon\nBut it was not just a person's photo that could be taken from the footage.\n'When you come to assume the identity of somebody, it seems so much more genuine if you know their background... you can talk more convincingly when you know their lifestyle,' Dr Pattinson said.\n'The more you know about them the more you can emulate what they do.\n'[From the footage], they [identity thieves] can see what sort of car you drive perhaps, they see you carry a certain bag, maybe they see what kind of phone you have.'\nCyber security expert Dr Malcolm Pattinson, from the University of Adelaide, told Daily Mail Australia people could use the information gathered from this security loophole to steal identities. Pictured is a Melbourne cafe\nStills in this story come from CCTV footage that can be seen on websites, such as Insecam, that collate unprotected cameras across the world in one place\nFor example, in Australia there are 104 live streams broadcast online from cafes, salons, front gardens (above), inside homes and construction sites on Insecam\nDr Pattinson told Daily Mail Australia criminals could also be using the unrestricted camera access to monitor activity inside homes to figure out the best times to strike.\n'It can be used to trace people when they're leaving home, when they get back and when they are out of the house, so then they can rob it,' he said.\nWebsites, such as Insecam, collate unprotected cameras across the world in one place.\nFor example, in Australia there are 104 live streams broadcast online from cafes, salons, front gardens, inside homes and construction sites on Insecam.\nA staff member, who works at a Melbourne cafe that appears on the site, told Daily Mail Australia he was unaware footage from his security camera could be accessed by the public.\nThis is an ice cream parlour in Perth. A worker is seen inside the eatery\nStaff members can be watched and monitored by the public at this Melbourne pet hotel\nThis backyard pool can be seen by the public because it does not have a password. Security research Mike Ando said the best way to stop unrestricted access to cameras was to create a password for the devices\n'I didn't know about that. It doesn't bother me,' he said.\nBut the staff member did not wish to comment further.\nTo safeguard themselves from this risk, security researcher Mike Ando said there was a quick fix to resolve the matter.\n'The number one way is to put a password on their cameras. Don't use the default password,' Mr Ando told Daily Mail Australia.\n'People need to understand how easy it is to change their password.'\nMr Ando added websites like Insecam were trying to bring attention to the issue.\n'The point of these sites is not to be creepy but to raise awareness of how easy it is to access their cameras, so people will change their passwords,' he said.\nMr Ando said people could even search for security camera feeds on Google if they entered the right terms.\nInsecam states people can request their cameras to be removed from the website by emailing administrators and the easiest way to make their cameras private was to set up a password.","url":"https://www.dailymail.co.uk/news/article-3421966/Security-cameras-not-password-protected-people-risk-identity-theft.html"}
