{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 21:54:14","date_modify":"2018-10-30 21:54:14","date_publish":"2016-02-25 09:30:32","description":"Slovenian police are investigating after 30 inhabitants of a migrant centre absconded, leaving local parents concerned for the safety of their children.","filename":"data/vaneerConsumption/SecurityConcernAtMigrantCentreNextDoorToJuniorSchoolAfter30InmatesEscape.json","image_url":"https://media.breitbart.com/media/2016/02/Screen-Shot-2016-02-15-at-11.28.27.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_25__1540936454.html","title":"Security Concern At Migrant Centre Next Door To Junior School After 30 Inmates Escape","title_page":"Security Concern At Migrant Centre Next Door To Junior School After 30 Inmates Escape","title_rss":"NULL","source_domain":"breitbart.com","text":"Slovenian police are investigating after 30 inhabitants of a migrant centre absconded, leaving local parents deeply concerned for the safety of their children.\nThe Vrhnika town housing centre for migrants is separated from the local junior school by just a low fence backed with barbed wire, and is in the neighbourhood of the largest middle school in the area, a fact which has not escaped the attention of worried parents. Over 30 migrants escaped the centre on Monday night, possibly fleeing north to Austria, reports the Slovenske Novice.\nA number of those escaped have now been returned, with some found in the grounds of the middle school and one in the junior school. It is reported no reason has yet been given for why the migrant was hiding in the kindergarten, but the mayor of the town is to hold an extraordinary Wednesday night town-hall meeting to address the problem along with other local “notaries”.\nIt is reported extra police will be deployed to the wooded areas around the school and the migrant centre, into which the migrants are thought to have fled and through which children walk to school, along with two police dogs. Police officers will be posted to the entrances of the schools, and there will be a “permanent patrol” around the area from now on.\nEven before the escape the neighbourhood took significant steps to protect themselves from what they saw as the menace posed by the 840 migrants in the centre. The paper reports the junior school had hired a security guard at the “outbreak of the migrant crisis to ensure security was taken care of”, and the area in the vicinity of the school was regularly “disinfected” for the safety of children.","url":"https://www.breitbart.com/europe/2016/02/25/security-concern-at-migrant-centre-next-door-to-junior-school-after-30-inmates-vanish/"}
