{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 01:27:10","date_modify":"2018-10-23 01:27:10","date_publish":"2017-03-16 11:23:12","description":"Security guard Matthew Larmond was one of ten 'human guinea pigs' who got a first experience of illusionist Derren Brown's Ghost Train: Rise of the Demon at the theme park in Surrey.","filename":"data/vaneerConsumption/SecurityguardwetshimselftestingDerrenBrownsride.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E5394D800000578-0-image-a-68_1489663272228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319492_Security-guard-wets-testing-Derren-Brown-s-ride_1540258030.html","title":"Security guard 'wets himself' testing Derren Brown's ride","title_page":"Security guard 'wets himself' testing Derren Brown's ride | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the hilarious moment a security guard appeared to wet himself in terror while testing Derren Brown's updated virtual reality ride at Thorpe Park.\nMatthew Larmond was one of ten 'human guinea pigs' who got a first experience of the illusionist's Ghost Train: Rise of the Demon at the theme park in Surrey.\nTo test out the changes to the ride, Brown brought in a group of martial arts experts, boxers, servicemen and former prison guards to see how they would react.\nSecurity guard Matthew Larmond appeared to wet himself in terror while testing Derren Brown's updated virtual reality ride at Thorpe Park\nMr Larmond was one of ten 'human guinea pigs' who got a first experience of the illusionist's Ghost Train: Rise of the Demon at the theme park in Surrey\n'Wetting himself': To test out the changes to the ride, Brown brought in a group of martial arts experts, boxers, servicemen and former prison guards to see how they would react\nThey were filmed while sitting with the headsets for the ride - which reopens in a fortnight - and Larmond was seen spraying a bottle of water over himself in fright.\nThe ride uses virtual reality and illusions to spook thrill-seekers - who have to be aged at least 13 - by subjecting them to a simulated train crash and demonic attacks.\nEx-prison officer Matt Sproit, who also tried out the changes to the ride which is due to reopen on March 31, said: 'I'm used to dealing with terrifying situations.\n'So I was never expecting the VR footage to scare me that much. When I took off that headset I was physically shaking.'\nAnd another tester, stunt woman Carol Nulty, added: 'I thought I had to be pretty fearless in my job, but this lived up to expectations.\nBrown (pictured) said he 'decided to run scare tests on a selection of participants who claim they are totally fearless - the reactions have been incredible'\nBungee jumper Emilia Cain recorded a very high heart rate of 183bpm during the testing\nSecurity guard Joseph Sands recorded a heart rate of 129bpm while trying out the ride\nRoxanne Gregory, who has served in the Territorial Army, was shocked by the experience\n'The VR is flawlessly real – you really believe there is a demon in the room with you. This is not a ride for the faint hearted.'\nHOW THE TEN 'HUMAN GUINEA PIGS' REACTED TO DERREN BROWN'S RIDE NAME OCCUPATION HEART RATE Nick Ferreira Former boxer 138bpm Joseph Sands Security guard 129bpm Alo Raptopoulos Martial arts instructor 127bpm Matt Sproit Former prison officer 112bpm Matthew Larmond Security guard 169bpm Carol Nulty Stunt woman 145bpm Freddie Pearce High school teacher 133bpm Emilia Cain Bungee jumper 183bpm Faye Carmichael Police detective 159bpm Roxanne Gregory Territorial Army 157bpm\nEmilia Cain-Heritage commented: 'As a bungee jumper, I face fear on a regular basis but this was a new level in fear – so, so real and absolutely terrifying.'\nThorpe Park trumpeted the experience at its original opening in July last year as one of the most advanced it has ever built and its biggest-ever investment.\nThe trials saw reactions including screams, falling out of the chair and curling into a ball, with one test even resulting in a headset being flung across the room.\nBrown said: 'Over the last few weeks I have been testing out the components of the attraction and decided to run scare tests on a selection of participants who claim they are totally fearless - the reactions have been incredible.\n'Visitors to the Ghost Train will experience a heart stopping combination of next generation technology, grand illusion, live action and special-effects, completely unalike anything they will have seen before.\n'We are making this bigger, better and scarier than last year. The changes and improvements that have taken place will scare the s*** out of guests.'\nFormer boxer Nick Ferreira recorded a heart rate of 138bpm while using the device\nFormer prison officer Matt Sproit also endured the new virtual reality experience\nAlo Raptopoulos tried out the ride, which uses illusions and virtual reality to spook thrill-seekers by subjecting them to a simulated train crash and demonic attacks\nDerren Brown's Ghost Train: Rise of the Demon 'will leave guests' hearts racing', the park says\nIllusionist Brown is pictured at the launch for the original Ghost Train ride in January last year\nThe heart rate of the testers reached a collective of 1,452bpm, while on average it increased by 31.9bpm. The highest rate recorded was 183bpm.\nDominic Jones, divisional director at Thorpe Park Resort, said: 'We are always looking for ways to make our guests' experiences bigger, better and will be making a terrifying attraction even scarier for 2017.\n'Derren Brown's Ghost Train: Rise of the Demon will leave guests' hearts racing. Our test trials on some of the nation's most fearless subjects have gone very well, with heart rates reaching over 180bpm.\n'Now we are opening early stage testing to the general public to see how they handle the new journey – and of course, we always keep a secret up our sleeve… things may take an unexpected turn.'","url":"https://www.dailymail.co.uk/news/article-4319492/Security-guard-wets-testing-Derren-Brown-s-ride.html"}
