{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:26:01","date_modify":"2018-10-30 21:26:01","date_publish":"2017-02-17 13:57:38","description":"Looking to get a taste of India without leaving your couch?","filename":"data/vaneerConsumption/SeethefirstthreeepisodesofChaiPanisculinarydocumentary.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/09/Images/WPIMAGE_cmgajcfoodandmore_8175.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_se_47861df6cb8c0c3a5dab48e2087966cf__1540934761.html","title":"See the first three episodes of Chai Pani's 'culinary documentary'","title_page":"See the first three episodes of Chai Pani's 'culinary documentary'","title_rss":"NULL","source_domain":"ajc.com","text":"Looking to get a taste of India without leaving your couch?\nChef Meherwan Meherwan Irani of the Chai Pani Group, which owns Chai Pani in Decatur and Botiwalla in Ponce City Market , as well as two restaurants in Asheville, has released the first three episodes of the culinary film \"Cutting Chai\" online.\nThe film, which first premiered in March 2016 at Ponce City Market, provides a glimpse into Indian culture through food, with Irani and his chefs Daniel Peach and James Grogan visiting 10 cities in India in 10 days.\nIt was produced in-house by chef Irani and Chai Pani Brand Director Michael Files, whose brother Daniel served as editor.\nThe first three episodes are available to watch on Chai Pani’s YouTube Channel, Chai Pani Channel, as well as at the official Cutting Chai website, Cutting Chai Movie. Episodes 4-6 will be made available on March 14, and episodes 7-10 will be released on April 11.\nFiles and Irani are also in the process of creating several other online culinary series, including a cocktail series from MG Road and a cooking series with Irani. All will have their debut on the group’s YouTube channel, Chai Pani Channel.\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/see-the-first-three-episodes-chai-pani-culinary-documentary/kGnSvA0HEGsuDDntVKECwM/"}
