{"authors":[],"date_download":"2018-10-22 21:03:14","date_modify":"2018-10-22 21:03:14","date_publish":"2014-05-05 19:26:40","description":"The Eta Aquarid meteor shower is hitting its peak, and you can see the show in the night sky or online.","filename":"data/vaneerConsumption/SeetheEtaAquaridMeteorShowerintheSkyandOnline.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421371/140505-jeffberkes_80e8a42b02b46f42256800e0b84c6290.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_see-eta-aquarid-meteor-shower-sky-online-n97491_1540242194.html","title":"See the Eta Aquarid Meteor Shower, in the Sky and Online","title_page":"See the Eta Aquarid Meteor Shower, in the Sky and Online","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Eta Aquarid meteor shower hits its peak late Monday and early Tuesday, just a couple of weeks after another springtime sky show — the Lyrids — lit up the night. If your skies are cloudy, or filled with the glare of city lights, don't despair: There's still a chance to catch the show online.\nThe meteors are sparked every year in early May when Earth plows through the trail of fine cosmic grit left behind by Halley's Comet.\n\"If you don't want to wait until 2061, when Comet Halley returns, you can always look up and see pieces of Halley burning up in the atmosphere,\" Bill Cooke, head of NASA's Meteoroid Environment Office at Marshall Space Flight Center, told NBC News.\nSoutherners get the best view\nUnder ideal conditions, observers in the Southern Hemisphere could see as many as 60 Eta Aquarids per hour, with about half that number visible in the north.\nEta Aquarids are so named because they appear to radiate from a star known as Eta Aquarii in the constellation Aquarius. During this time of year, that part of the sky is well-placed for viewing from the Southern Hemisphere, but the viewing isn't quite as good from the Northern Hemisphere.\n\"If you're north of 40 degrees latitude, you probably won't see many Eta Aquarids,\" Cooke said.\nFortunately, this is an auspicious year for both northerners and southerners. The moon is just coming out of its crescent phase, which means there should be a moonless sky between 3 a.m. and dawn, the peak hours for meteor watching. (Find out the times for moonset and sunrise for your locale.)\nMake the most of the meteors\nThe standard rules for maximizing a meteor shower apply: For optimal outdoor viewing, find a place that's far from city lights and wide-open skies, bring a comfy chaise lounge or blanket to lie on, give your eyes plenty of time to adjust, and keep your expectations realistic. This isn't a fireworks show, but an opportunity to commune with the night sky. In addition to the meteors and the stars, keep an eye out for bright planets and the International Space Station.\nIf you want to see the Eta Aquarids popping on your computer screen, check out the view from Huntsville, Alabama, streamed live via Marshall Space Flight Center and Ustream. The Slooh virtual observatory is also offering streaming video, from upstate New York starting at 9 p.m. ET Monday. Viewers can watch the show at Slooh.com, on YouTube or via Slooh's iPad app. Astronomer Bob Berman is providing expert audio commentary.\n\"What makes this shower somewhat special is that the meteors stem from the most famous comet in all of history, Comet Halley,\" Berman said in a news release. \"As Halley goes around the sun in its 76-year orbit, pieces of it, little chunks of ice, slough off the comet, and we intersect that every year around this time, in early May. And we happen to hit this material just about head-on producing one of the fastest displays of meteors of the year.\"\nGot pictures? Feel free to share them via NBC News' FirstPerson photo-upload page, the NBC News Science Facebook page, or by tagging your Twitter photo posts with the #nbcmeteors hashtag.\nThanks to Jeff Berkes for sharing his multiple-exposure photo of Eta Aquarid meteors as seen last May in the skies over a remote island off the Florida coast. \"This was some extreme camping, let me tell you,\" Berkes wrote in an email. \"Three nights on a small island that had a 7-foot crocodile living on it — not an alligator, a croc. ... Being nearly 80 miles away from civilization surrounded by shark-infested water was a true paradise.\"\nFor more of Jeff Berkes' work, check out his website and Facebook page. Browse through SpaceWeather.com's meteor gallery for still more pictures.","url":"https://www.nbcnews.com/science/space/see-eta-aquarid-meteor-shower-sky-online-n97491"}
