{"authors":["D. Orlando Ledbetter"],"date_download":"2018-10-30 20:02:06","date_modify":"2018-10-30 20:02:06","date_publish":"2017-01-09 08:55:10","description":"There are thousands of tickets available for the Falcons’ divisional round playoff game agains...","filename":"data/vaneerConsumption/SelectticketsstillavailableforSeahawksFalconsplayoffgame.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/18/Images/WPIMAGE_cmgajcatlantafalcons_11588.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_atlanta-falcons_select_0fa4c3c4c10197f57f560683384a429d__1540929726.html","title":"Select tickets still available for Seahawks-Falcons playoff game","title_page":"Select tickets still available for Seahawks-Falcons playoff game","title_rss":"NULL","source_domain":"ajc.com","text":"There are thousands of tickets available for the Falcons’ divisional round playoff game against Seattle Seahawks, which is set for 4:35 p.m. on Saturday at the Georgia Dome.\nThere are mostly single tickets sprinkled throughout the dome and some club seats and suites that are still available ranging from $75 to $800, according to the team’s website. The team advises that fans still looking for tickets visit www.atlantafalcons.com/tickets or www.Ticketmaster.com.\nFans are also advised that if they purchase from the team’s primary inventory, Ticketmaster or TicketExchange from other season ticket holders, they will know for certain that they are not getting fraudulent tickets, according to Don Rovak the team’s vice president of Ticket Sales and Service.\nThe Falcons went toe-to-toe with the Seahawks before losing 26-24 on Oct. 16 in Seattle. The Falcons blew a late 24-23 lead when quarterback Matt Ryan threw an interception off the hands of wide receiver Julio Jones.\nAlso, there was a controversial non-call as Seattle defensive back Richard Sherman held Jones on a deep pass play that would have put the Falcons in field goal range for the victory.\nFalcons head coach Dan Quinn came to the team from Seattle, where he was their record-setting defensive coordinator.\nRECAP OF THE ATLANTA FALCONS 2016 REGULAR SEASON\nGAME 16: Falcons 38, Saints 32\n5 things we learned from the Falcons win over the Saints\nFalcons defense sags late but hangs on vs. Brees\nJulio Jones says bye week will be 'great for me' with sore toe\nGAME 15: Falcons 33, Panthers 16\n5 things we learned from the Falcons win over the Panthers\nNFL playoffs: Falcons clinch NFC South title\nThird-and-21, no problem for Coleman\nWhat Dan Quinn had to say after the win over the Panthers\nGAME 14: Falcons 41, 49ers 13\n5 things we learned from the Falcons' win over the 49ers\nWhat Matt Ryan had to say about the win over the 49ers\nPHOTOS: Falcons win over the 49ers\nGAME 13: Falcons 42, Rams 14\nREPORT CARD: Falcons handled their business against woeful Rams\nGAME 12: Chiefs 29, Falcons 28\n5 things we learned from the Falcons' loss to the Chiefs\nFalcons still control their playoff destiny\nPHOTOS: Falcons have a bad day at the office\nMatt Ryan tormented by Berry's big interceptions\nBeasley becomes a double-digit sacker\nGAME 11: Falcons 38, Cardinals 19\n5 things we learned from the Falcons' win over the Cardinals\nMARK BRADLEY: The Falcons keep getting better as they go\nJulio Jones gets calls this time\nTaylor Gabriel continues scoring streak in win over Cardinals\nColeman scores TD in return from injury\nFalcons' offensive line 'stepped up to the task'\nGAME 10: Eagles 24, Falcons 15\n5 things we learned from the Falcons' loss to the Eagles\nRyan, offense slowed down to a crawl\nPerkins stalls key drive with costly penalty\nDefense gets blown of the line of scrimmage\nKeanu Neal can expect fine but Falcons' biggest issue is injuries (Trufant and Tamme)\nFalcons go into bye week wrong way -- beat up by Eagles\nWhat Dan Quinn had to say after the loss to the Eagles\nWhat Matt Ryan had to say after the loss to the Eagles\nWhat the Falcons had to say after the loss to the Eagles\nPHOTOS: Falcons fall to the Eagles\n5 things we learned from the Falcons' rout of the Bucs\nGAME SEVEN: Chargers 33, Falcons 30 in OT\n5 things we learned from the Falcons loss to the Chargers\nDan Quinn's gamble with house-money backfires\n6 penalties 'unacceptable' for Falcons offensive line\nPhilip Rivers confounds Falcons with short passes: 'He picked us apart'\nMatt Ryan's late-game interception leads to overtime loss\nPHOTOS: Chargers rally to beat Falcons\nGAME SIX: Seahawks 26, Falcons 24\n5 things we learned from the Falcons loss to the Seahawks\nMARK BRADLEY: The Falcons didn't win, but they made one guy believe (me)\nMARK BRADLEY: The Falcons got jobbed but did themselves proud\nMatt Ryan's turnovers were costly\nWhat Dan Quinn had to say after the 26-24 loss to Seattle\nSeattle slows down Falcons' running backs Freeman, Coleman\nRyan Schraeder, offensive line rebounds in second half\nJulio Jones: 'It was just a missed call'\nWhat the Falcons had to say after the 26-24 loss to Seattle\nWhat Matt Ryan had to say after the 26-24 loss to Seattle\nRichard Sherman non-commital on pass interference non-call\nPHOTOS: Falcons at Seahawks in Seattle\nGAME FIVE: Falcons 23, Broncos 16\n5 things we learned from the Falcons upset of Super Bowl champs\nMARK BRADLEY: The Falcons rock a rookie in the Rockies\nWhat Dan Quinn have to say after the win over Denver\nColeman amassed 163 yards to power the offense\nVic Beasley has breakout game with 3.5 sacks\nKemal Ishmael moved to linebacker, led team in tackles\nWhat the Falcons had to say after the win over the Broncos\nPhotos: Falcons battle the Broncos\nGAME FOUR: Falcons 48, Panthers 33\n5 things we learned from the Falcons' 48-33 win over the Panthers\nTweetcap: Falcons 48, Panthers 33\nOld pro Freeney shows new trick with Falcons\nFalcons' rookie Neal holds on vs. Olsen\nWhat Julio Jones had to say after the 48-33 win over the Panthers\nWhat Dan Quinn had to say after the 48-33 win over the Panthers\nWhat Matt Ryan had to say after the 48-33 win over the Panthers\nAlford battled; Collins to return\nEarly view in NFC South isn't what most expected; Falcons on top\nGAME THREE: Falcons 45, Saints 32\n5 things we learned from the Falcons' 45-32 win over the Saints\nFalcons, Saints protest with unity circle before game\nREPORT CARD: Falcons earned high marks for drubbing Saints\nWhat Dan Quinn had to say after the 45-32 win over the Saints\nWhat Matt Ryan had to say after the 45-32 win over the Saints\nWhat the Falcons had to say after the 45-32 win over the Saints\nKeanu Neal makes strong debut for Falcons\nFalcons' Deion Jones runs for glory, not survival, in return home\nAJC POWER RANKINGS: Falcons best in NFC South?\nGAME TWO: Falcons 35, Raiders 28\n5 things we learned from the Falcons' win over the Raiders\nTrufant's heads-up play saves the day\nTight ends help to power offense\nWeatherspoon plays strong in first start since 2013\nMatthews, Schraeder held Mack sack-less\nJEFF SCHULTZ: Falcons put on offensive show and win\nWhat Matt Ryan had to say after beating the Raiders\nWhat Dan Quinn had to say after the win over the Raiders\nGAME ONE: Buccaneers 31, Falcons 24\n5 things we learned from the Falcons' loss to the Bucs\nNo sacks for new-look Falcons pass rush\nJulio Jones not worried about his ankle injury\nFalcons have a case of the \"no-huddle\" blues\nREPORT CARD: Falcons can't 'gift' opponents 17 points\nFILM REVIEW: Beasley missing in action\nAJC'S NFL POWER RANKINGS: Where are the Falcons?\nHageman charged is domestic violence case","url":"https://www.myajc.com/blog/atlanta-falcons/select-tickets-still-available-for-seahawks-falcons-playoff-game/VSVVW0qyC6lKgrX1XVjLGM/"}
