{"authors":["Ryan Smith For Mailonline"],"date_download":"2018-10-23 02:45:51","date_modify":"2018-10-23 02:45:51","date_publish":"2017-03-16 13:20:09","description":"She's endured many ups and downs over the years - including the end of her relationship with Justin Bieber, and a blossoming new romance with The Weeknd.","filename":"data/vaneerConsumption/SelenaGomezisunveiledasVogueslatestcovergirl.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E541FB400000578-0-image-a-52_1489670400153.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320176_Selena-Gomez-unveiled-Vogue-s-latest-cover-girl_1540262751.html","title":"Selena Gomez is unveiled as Vogue's latest cover girl","title_page":"Selena Gomez is unveiled as Vogue's latest cover girl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's endured many ups and downs over the years - including the end of her relationship with Justin Bieber, and a blossoming new romance with The Weeknd.\nAnd Selena Gomez, 24, is enjoying another personal high as she's been unveiled as the new cover girl for the latest issue of American glossy fashion bible Vogue.\nThe Texan beauty looks sensational as she poses on the cover in a plunging red two-piece, in which she shows off her enviably taut abs and shapely physique.\nScroll down for video\nCover: Selena Gomez has been unveiled at the latest cover girl for America's Vogue magazine\nIn accompanying photographs inside the magazine - shot by Mert Alas and Marcus Piggott - she continues to show exactly why she was chosen to pose for the esteemed publication, as she wears a selection of stunning ensembles.\nOne image shows her wearing an embellished red leather jacket with tiny black floral shorts as she sits on the golden sands of a beach wearing heavy jewellery.\nAnother sees her posing in a boldly patterned green two-piece - which includes a high neckline top with ab cut-outs and high-waited trousers.\nPassion for fashion: The singer and actress looks sensational in a range of accompanying shots\nShe also sat down for an interview with Vogue's Rob Haskell, speaking about how the pressures of her Revival tour led to her checking into a psychiatric facility.\n'Tours are a really lonely place for me,' she explained. 'My self-esteem was shot. I was depressed, anxious. I started to have panic attacks right before getting onstage, or right after leaving the stage. Basically I felt I wasn’t good enough, wasn’t capable.\n'I felt I wasn’t giving my fans anything, and they could see it—which, I think, was a complete distortion. I was so used to performing for kids... Suddenly I have kids smoking and drinking at my shows, people in their 20s, 30s, and I’m looking into their eyes, and I don’t know what to say....\nUps and downs: In her interview with the magazine, she talks about the ups and downs of fame\n'What I wanted to say is that life is so stressful, and I get the desire to just escape it. But I wasn’t figuring my own stuff out, so I felt I had no wisdom to share... Maybe I thought everybody out there was thinking, This is a waste of time.'\nAfter 90 days of treatment to help her heal from the feeling of being burned out, she has bounced back - and continues to take time out of her young adoring fans.\nIn an apparent dig at her ex Justin - who she doesn't mention by name, and who has had run-ins with fans - she Vogue: 'Somebody I used to hang out with would always get very frustrated with me. But I have a hard time saying no to children.'\nHowever she dodges questions about her new partner, The Weeknd, in the interview - revealing she's learned her lesson when it comes to talking about her romances.\nAnd despite landing the Vogue cover, Selena is adamant that she can't wait for her fame to run out.\nShe adds: 'Look, I love what I do, and I’m aware of how lucky I am. But – how can I say this without sounding weird? – I just really can’t wait for people to forget about me.'\nEx factor: In a seeming dig at her ex Justin Bieber, she spoke about how a person she 'used to hang out with' got annoyed with her whenever she'd stop to greet her adoring fans\nAfter her Vogue cover was published, Selena shared the images on Instagram, with the caption: 'I want to thank Rob Haskell for writing my story. I was a little nervous at how honest I was but you depicted where I'm at perfectly. I'm so grateful.'\nSelena recently made a donation to support research into lupus at the University of Southern California's Keck School of Medicine.\nShe made the gift to establish the Selena Gomez Fund for Lupus Research.\n'I continue to be optimistic about the progress being made in lupus research and am proud to support the promising work at Keck School of Medicine,' she said.\nBlossoming romance: She recently embarked on a romance with Canadian singer The Weeknd\nSelena went on: 'I am hopeful for the millions of us around the world that may benefit from this.'\nSelena was forced to cancel her tour in 2013 after a flare up of the condition that affects the immune system. She later revealed she had been diagnosed with lupus in 2010 and had kept it secret.\nThe Lupus Foundation of America describes lupus as a chronic autoimmune disease that can damage any part of the body, including skin, joints and organs.\nInitially, the research program in her name at USC will seek to make progress on developing targeted therapeutic treatment breakthroughs.\nThe April edition of Vogue magazine is on newsstands now.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320176/Selena-Gomez-unveiled-Vogue-s-latest-cover-girl.html"}
