{"authors":["Amy Sciarretto"],"date_download":"2018-10-31 01:41:31","date_modify":"2018-10-31 01:41:31","date_publish":"2018-08-28 12:41:52","description":"Selena Gomez is one of the most stylish stars of her generation. She has the good fortune to be able to spend major loot on high-end pieces while designers clamor to dress her. She still loves a fashion bargain, though! Selena Gomez wore a leopard…","filename":"data/vaneerConsumption/SelenaGomezWoreA24UrbanOutfittersLeopardPrintTopYesYouCanStillBuyIt.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/10ceec53-8c26-40f5-958e-4427c3c61937-getty-988380014.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_selena-gomez-wore-a-24-urban-outfitters-leopard-print-top-yes-you-can-still-buy-it-10258544_1540950091.html","title":"Selena Gomez Wore A $24 Urban Outfitters Leopard Print Top & Yes, You Can Still Buy It","title_page":"Selena Gomez Wore A $24 Urban Outfitters Leopard Print Top & Yes, You Can Still Buy It","title_rss":"NULL","source_domain":"bustle.com","text":"Selena Gomez is one of the most stylish stars of her generation. She has the good fortune to be able to spend major loot on high-end pieces while designers clamor to dress her. She still loves a fashion bargain, though! Selena Gomez wore a leopard print top from Urban Outfitters (offers sizes XS to XL) and yes, you can still buy it — unless, of course, it sells out because Selenators flock to the retailer's stores and site to scoop up one of their own.\nYou have to love that Gomez rocks accessible pieces that her faithful fanbase can copy.\nCosmo reports that Gomez rocked the mock turtleneck top while hanging out with friends over the weekend. As see in the Instagram post by her pal and assistant Theresa Marie Mingus, the singer and actor paired the print top with denim shorts and strappy, silver heels for an overall sexy presentation. Rawr.\nThe top is long-sleeved and semi-cropped at the waist. In addition to the fun leopard print, it comes in white or black options. It's a textured, rib knit and has frilly trim at the cuff and the hemline. These details allow the shirt to be dressed up or down.\nIt's also a total steal at $24. It can be an essential layering piece in your fall wardrobe because why not?\nGomez slayed it and so can you.\nOut From Under Gracen Turtleneck $24 The fabric is really rich — from the ribbing to the print. That combination of textures is what makes this such a versatile piece. It could end up being one of the core pieces in your fall wardrobe. Buy Now\nCourtesy of Urban Outfitters\nThe retailer and brand styled the top with a frayed hem and asymmetrical mini, a denim jacket, and glossy and pointy ankle booties. So if you're looking for some style inspo, well, you got it courtesy of Gomez and Urban Outfitters.\nCourtesy of Urban Outfitters\nYou can appreciate the ruffly hem of the shirt from this vantage point. It's a subtle detail but it certainly makes an impact.\nCourtesy of Urban Outfitters\nThe spotted print is perfect for transitioning from summer into fall. If you want to incorporate an unusual piece without resorting to a loud pop of color, your OOTD will enjoy the same effect thanks to this top. The print is bold without being overly loud. That's why it's a winner and a keeper.\nTippi Sweater in Leopard $89.50 As Cosmo noted, the Selena x Urban Outfitters top could veritably sell out once the Selenators find out where they can purchase it. There are other leopard print tops available, like this similar, three-quarter length sleeve shirt. It has a bolder print but it's equally as stylish. It also goes up to 3X in sizing. So that's awesome! Buy Now\nIn addition to scoring her Urban Outfitters top, you can copy Gomez's style by shopping her Coach ready-to-wear collection. It includes bags, because of course it does. It's Coach. The brand is know for its leather goods. But Gomez also co-designed a lovely fashion capsule for the beloved brand.\nGomez is also one of the faces of Puma so there are plenty of Sel-approved athleisure options for your fall closet. Many of Selena's sartorial choices come at a price point that is attractive to her fans. That's why the superstar remains a potent source of fashion inspo.","url":"https://www.bustle.com/p/selena-gomez-wore-a-24-urban-outfitters-leopard-print-top-yes-you-can-still-buy-it-10258544"}
