{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-22 23:44:54","date_modify":"2018-10-22 23:44:54","date_publish":"2016-01-11 07:34:25","description":"Whether your 'phone face' has left you with saggy jowels and jaw tension or you’re suffering from dull and lacklustre 'winter face', navigating your complexion can often be a minefield.","filename":"data/vaneerConsumption/SelfridgesFaceGymsguidetoidentifyifyouhaveaPhoneFroworSugarface.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/07/21/2FE49B0600000578-0-image-a-13_1452203252652.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3388992_Do-Phone-Frow-Sugar-face-identify-making-uglier-fix-immediately_1540251894.html","title":"Selfridges' FaceGym's guide to identify if you have a Phone, Frow or Sugar face","title_page":"Selfridges' FaceGym's guide to identify if you have a Phone, Frow or Sugar face | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After a month of overindulgence this festive period, it isn't just our waistlines feeling the ill effects.\nIf you're suffering from saggy, wrinkled and spotty skin, according to skincare experts, most of us have fallen victim to what they're hailing 'seasonal face problems'.\nWhether your 'phone face' has left you with saggy jowls and jaw tension or you’re suffering from dull and lacklustre 'winter face', navigating your complexion can often be a minefield.\nHowever, FaceGym, the facial exercise and skincare studio in Selfridges, has teamed up with The Juicery and WelleCo to devise the ultimate guide to every type of facial issue - and the solution to fixing it fast.\nIf you're constantly texting, have poor posture, a double chin, forehead creases and jaw tension, you may well be suffering from phone face\nPHONE FACE\nIt’s time for a digital detox. Put down your smartphone, tablet and iPad and give your face and neck muscles a rest.\nThe signs:\n• Always switched on\n• Instagram addict\n• Constantly texting\n• Poor posture\n• Sagging jaw\n• Double chin\n• Forehead creases\n• Jaw tension\n• Tired eyes\n• Tight neck muscles aka ‘text neck’\nHow to beat it: Inge Theron, founder of FaceGym and FT Spa Junkie, says it's important to start at the root cause of the problem so try and implement a 'digital downtime' for a few hours every day. Dinner is a great place to start; turn your phone off so you are not tempted by the blings and spend time doing what you love - read a book, take a walk, prepare dinner or meditate and get back into yourself.\nIf you are suffering from 'text neck', very simple head stretches can work wonders. Place your right hand on your left side of the head and left hand on the base of the neck and shoulder and gentle pull the head to the right - you should feel a lovely and tender neck stretch. Repeat on the other side and do five of these a day, in the morning and evening.\nWorking the platysma (the big muscle that runs from your jawline to your shoulder) is also very useful. Sit with an erect spine, pull your lips back against your teeth, and turn the corners of your mouth downward, open your mouth slightly, and activate the muscles of your jaw. Keep your lips pressed firmly against your teeth and the corners of your mouth turned down. The tendons on your neck should stand out. Wiggle your lower jaw up and down start with just five and work up to ten exercises.\nFor those who are already experiencing the saggy jowls from smart phone face, it's important you use targeted products for lifting and shaping and not just moisturising. Apply along the jowls rubbing in the direction towards the heart and not the other way around. I'd also invest in the new FaceGym Face Ball; it works wonders to release tension between the eyes, the jaw and can be used to lift saggy skin.\nFood for thought: Vitamin C, found in leafy greens and berries, is crucial for building collagen - the most important thing for keeping your skin looking firmer and younger.\nWINTER FACE\nAre you stressed out and tired, feeling like your cheeks are dragging on the floor, with poor sleep patterns and no time for exercise?\nAre you stressed out and tired, feeling like your cheeks are dragging on the floor, with poor sleep patterns and no time for exercise? You probably have winter face\nThe signs:\n• Looking tired\n• Stressed\n• Dark circles\n• Crepey, dull, lacklustre skin\n• Wrinkles\n• Saggy cheeks and jowls\nHow to beat it: Twice a week use of a good exfoliant or light fruit acid peal to freshen up the skin and help to get rid of the ‘winter look’ on the surface – choose something with brightening qualities and make sure it's not to harsh.\nFor the drooping jowls and saggy cheeks - otherwise known as the zygomaticus muscle - I recommend 'Face Whipping', which is slow rhythmic massage movements to help improve muscle tone.\nPut your two hands out in front of your face and place four fingers firmly under the checks and lift up vigorously, alternating with both hands starting slow and getting faster.\nFood for thought: Orange foods like mango, carrots and pumpkin contain beta carotene. The body converts beta-carotene into active vitamin A or retinol which helps fight signs of aging. Turmeric is an incredible anti-inflammatory food that helps cool off inflammation caused by working hard and partying harder.\nAvoid salty food like sushi and reduce alcohol as this all adds to bags under the eyes and that puffy swollen look.\nSUGAR FACE\nYou’ve been burning the candle at both ends, bingeing on sugary snacks and drinking for as many nights as you can remember.\nIf you've been burning the candle at both ends, bingeing on sugary snacks and drinking for as many nights as you can remember, you may have sugar face, which is characterised by enlarged pores and breakouts\nThe signs:\n• Bloated and puffy\n• Breakouts\n• Enlarged pores\n• Dull complexion\n• Dark circles\n• Creases around the cheeks\n• Pronounced nasolabial lines\nHow to beat it: Sugar is one of the main causes of ageing and really the best thing you can do for this face is to do a audit of your diet, cutting out all white sugar.\nI also advise reducing your wine intake - at least until your skin has improved - as it plays havoc with your hormones, especially in woman, and is often the cause of the breakouts around the chin and jaw line.\nA daily use of AHA soap will lighten, rejuvenate, clean the skin up from toxins and make the skin glow.\nFood for thought: Lemon aids in digestion and helps boost the liver to do its job better. Leafy greens such as kale and spinach are loaded with vitamins and minerals as well as compounds that help switch on the liver’s own detoxification enzymes. Cilantro can also help pull out toxins from our body.\nFAT FACE\nThe winter weather means many of us indulge in stodgy comfort food, wine and puddings. For many, the pounds start to show on the face. This massage will help to burn off both face and body weight by sculpting, lifting and tightening like a few rounds in the boxing ring.\nThe winter weather means many of us indulge in stodgy comfort food, wine and puddings, which can cause fat face and less pronounced features\nThe signs:\n• Rounded, puffy face\n• Double chin\n• Sagging jowls\n• Less pronounced features\nHow to beat it: It’s very important to drink a lot of water and add a piece of lemon or cucumber as it will make your water taste better and helps the body to detox and will help with puffy eyes.\nA quick and easy exercise is the chin lift. Sit with your spine erect, tilt your head back until you are looking toward the ceiling and pucker your lips tightly as if you want to kiss the ceiling. Repeat this five to 10 times.\nFood for thought: Ginger has over 40 types of anti-oxidants, many responsible for increasing blood circulation (that spicy kick!) and helps to cut down on toxins, which can cause skin aging.\nTurmeric is one of the most powerful anti-inflammation fighters we have. A glass of this each morning will help kick start the system and flush out all those toxins that lead to bloating and puffiness.\nIf you’re skin is unhappy – take a break from dairy and see what happens. Instead of dairy milk, try cashew milk, which is rich and creamy and loaded with healthy fats, vitamin B and enzyme components, which protects our skin from UV damage.\nFROW FACE\nIf you find yourself wearing oversized dark glasses indoors this winter, put the sparkle back in your eyes, the glow back into your skin and shine like star whether you are front row, backstage or simply wanting to be selfie ready with this quick and proven red carpet Hollywood fix.\nIf you find yourself wearing oversized dark glasses indoors this winter due to tired, puffy eyes, you may well have frow face\nThe signs:\n• Tired\n• Puffy eyes\n• Crepey, dull, lacklustre skin, wrinkles\n• Need to look camera ready\nHow to beat it: To decrease puffy and swollen eyes at home without any tools, a quick recommendation is to put two spoons in the freezer and when you get up in the morning press them gently against the skin. Use with a powerful eye cream.\nYou can also give yourself a quick eye lift. Pincer your thumb and second finger on both hands, grip the front of your eyebrow and 'sausage' the skin upwards, working from the the nose to the ear.\nFood for thought: Avocados help moisturise your skin from the inside out giving you a doughy, supple complexion.\nThey also contain a super powerful antioxidant called glutathione, which is amazingly anti-aging and supports the liver in its detoxification process.","url":"https://www.dailymail.co.uk/femail/article-3388992/Do-Phone-Frow-Sugar-face-identify-making-uglier-fix-immediately.html"}
