{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:37:28","date_modify":"2018-10-30 20:37:28","date_publish":"2016-12-29 00:00:00","description":null,"filename":"data/vaneerConsumption/SelfiePayhasarrivedinLatinAmerica.json","image_url":"https://amp.businessinsider.com/images/58654a4ef10a9a24008b5be1-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_selfie-pay-has-arrived-in-latin-america-2016-12_1540931848.html","title":"'Selfie Pay' has arrived in Latin America","title_page":"    'Selfie Pay' has arrived in Latin America - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII This story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nMasterCard announced that Latin American markets, starting with Brazil and Mexico, will get access to Identity Check Mobile, a payment technology app that uses in-app facial recognition software to confirm a user's identity in order to authenticate online purchases.\nThis rollout follows successful trials in Canada, the Netherlands, and the US, as well as a full launch across Europe earlier this year.\nThis new feature could be a major success in the region considering its growing e-commerce market, and smartphone penetration.\nSmartphone penetration is expected to grow along with e-commerce. In 2014, smartphones represented 32% of all phone connections in Latin America, with this figure expected to grow to 68% by 2020, according to the Wharton School — This would give the region more than 605 million smartphones by 2020, leaving it only behind the Asia Pacific region. As more users get access to smartphones, it's likely e-commerce will rise.\nIn 2014, smartphones represented 32% of all phone connections in Latin America, with this figure expected to grow to 68% by 2020, according to the Wharton School — This would give the region more than 605 million smartphones by 2020, leaving it only behind the Asia Pacific region. As more users get access to smartphones, it's likely e-commerce will rise. Latin America is one of the fastest-growing regions for e-commerce, behind Asia-Pacific. BI Intelligence expects online retail sales to grow at a compound annual growth rate (CAGR) of 17% between 2014 and 2019 to reach $85 billion in sales at the end of the forecast period. Most importantly for MasterCard's recent release, Brazil and Mexico are the two largest online retail markets in Latin America, accounting for more than 50% of sales. The rise in e-commerce will likely be followed by a rise in fraud attempts, which could make Mastercard's new technology extremely attractive to consumers looking to secure their information.","url":"https://www.businessinsider.com/selfie-pay-has-arrived-in-latin-america-2016-12"}
