{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:42:31","date_modify":"2018-10-30 18:42:31","date_publish":"2015-12-07 16:58:07","description":"Toymaker Mattel has created a Barbie doll in the likeness of \"Selma\" director Ava DuVernay as part of their \"Sheroes\" line of Barbies that honor \"female heroes who inspire girls.\"","filename":"data/vaneerConsumption/SelmaDirectorAvaDuVernayGetsHerOwnBarbieDoll.json","image_url":"https://media.breitbart.com/media/2015/12/Selma-Director-Barbie.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_07__1540924951.html","title":"'Selma' Director Ava DuVernay Gets Her Own Barbie Doll","title_page":"'Selma' Director Ava DuVernay Gets Her Own Barbie Doll","title_rss":"NULL","source_domain":"breitbart.com","text":"Selma director Ava DuVernay has gotten her very own Barbie doll.\nIn a tweet Sunday, DuVernay revealed that toymaker Mattel will begin selling the Barbie doll based on her likeness on Monday.\nTomorrow this #AvaBarbie goes on sale for Christmas because enough folks asked @Mattel to do so. Wild + wonderful. https://t.co/louahFZwjQ — Ava DuVernay (@AVAETC) December 6, 2015\nDuVernay’s doll is part of the “Sheroes” line of Barbie dolls that the company first revealed in April. The toy line honors “female heroes who inspire girls by breaking boundaries and expanding possibilities for women everywhere.”\nLast year, DuVernay became the first African-American woman to have a film (Selma) nominated for the Best Picture Academy Award. DuVernay ultimately lost out on the top prize to Alejandro G. Iñárritu’s Birdman, but the Martin Luther King, Jr. biopic snagged a trophy for Best Original Song for John Legend and Common’s “Glory.”\n“Barbie has always represented that girls have choices, and this Spring we are proud to honor six Sheroes who through their trade and philanthropic efforts are an inspiration to girls,” Barbie General Manager Evelyn Mazzocco said while announcing the line in April. “Started by a female entrepreneur and mother, this brand has a responsibility to continue to honor and encourage powerful female role models who are leaving a legacy for the next generation of glass ceiling breakers.”\nMattel had planned to manufacture one Barbie doll for each of the six “Shero” honorees, which the real-life subjects could then auction off to benefit the charity of their choice. But DuVernay’s fans apparently lobbied the toymaker to make her doll available to consumers in time for the holiday season.\nDuVernay announced on Twitter that all proceeds from the sale of the doll will go to benefit the Colors of Change and Witness organizations. On Monday morning, the director was re-tweeting those refreshing the Barbie website for information on how to obtain the doll:\nWaiting on this @AVAETC doll to pop up at the @Barbie site. Not a game folks. Tick tock! pic.twitter.com/n6fOqqOsH6 — Lauren W. (@iamlaurenp) December 7, 2015\nOther “Sheroes” honored with their own Barbie dolls include country music star Trisha Yearwood, actresses Kristen Chenoweth and Emmy Rossum, Lucky magazine editor-in-chief Eva Chen, and five-year-old fashion designer Sydney “Mayhem” Kaiser.","url":"https://www.breitbart.com/entertainment/2015/12/07/selma-director-ava-duvernay-gets-barbie-doll/"}
