{"authors":["Cassie Carpenter For Dailymail.Com"],"date_download":"2018-10-22 20:58:33","date_modify":"2018-10-22 20:58:33","date_publish":"2016-01-28 05:24:11","description":"In The People v. O.J. Simpson - the 43-year-old Grammy nominee plays Kris Jenner, who was good friends with murder victim Nicole Brown Simpson","filename":"data/vaneerConsumption/SelmaBlairlooksultraslimatLApremiereofFXsAmericanCrimeStory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A6E1F400000578-0-image-a-21_1453958133383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420365_Selma-Blair-looks-ultra-slim-white-pleated-gown-LA-premiere-FX-s-American-Crime-Story_1540241913.html","title":"Selma Blair looks ultra-slim at LA premiere of FX's American Crime Story","title_page":"Selma Blair looks ultra-slim at LA premiere of FX's American Crime Story | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Selma Blair looked elegant in a white pleated gown at the premiere of FX's American Crime Story in Westwood on Wednesday evening.\nThe white Derek Lam dress highlighted how slim the 43-year-old Grammy nominee has become, and she coiffed her raven locks into a French twist.\nThe Sex, Death and Bowling actress later tweeted about how Vanity Fair's West Coast Editor Krista Smith 'is always my date.'\nScroll down for video\nOld Hollywood glam: Selma Blair looked elegant in a white pleated gown at the premiere of FX's American Crime Story in Westwood on Wednesday evening\nSkinny Minnie! The white Derek Lam dress highlighted how slim the 43-year-old Grammy nominee has become, and she coiffed her raven locks into a French twist\nA vision: With her tresses swept into a chic hairdo, the actress looked incredible in her stunning number\n'Casual night out in Hollywood': The Sex, Death and Bowling actress later tweeted about how Vanity Fair's West Coast Editor Krista Smith 'is always my date'\nIn The People v. O.J. Simpson - Selma plays Kris Jenner, who was good friends with murder victim Nicole Brown Simpson.\n'Selma's great,' the 60-year-old momager said at last week's NATPE convention - according to Variety.\n'I hope she's done a really good job in bringing it home. She's such a talented actress...I want to see how it turns out. I heard it's really well done.'\nJenner's ex-husband was attorney Robert Kardashian, who famously helped acquit the footballer of the 1994 murder of his ex-wife and her friend Ron Goldman.\n'Do you think he did it?' In The People v. O.J. Simpson - Selma plays Kris Jenner, who was good friends with murder victim Nicole Brown Simpson\nThe 60-year-old momager said at last week's NATPE convention: 'Selma's great. I hope she's done a really good job in bringing it home. She's such a talented actress...I heard it's really well done' (pictured December 9)\n'I want to see how it turns out': Jenner's ex-husband was attorney Robert Kardashian, who famously helped acquit the footballer of the 1994 murder of his ex-wife and her friend Ron Goldman (pictured in 1995)\nThe single mother-of-one - who attended Jenner's Christmas Eve party - was spotted earlier on Wednesday grabbing coffee in Studio City.\nBlair - born Beitner - was without her four-year-old son Arthur, whose father is her ex-partner, fashion designer Jason Bleick.\nAlso posing on the Westwood Village Theatre red carpet was Selma's co-star John Travolta alongside his wife of 24 years, Kelly Preston.\nCasually clad: The single mother-of-one - who attended Jenner's Christmas Eve party - was spotted earlier on Wednesday grabbing coffee in Studio City\nAmicable exes: Blair - born Beitner - was without her four-year-old son Arthur, whose father is her ex-partner, fashion designer Jason Bleick\nThe two-time Oscar nominee - who turns 62 next month - received civil litigator Robert Shapiro's blessing when he scored the small-screen role.\n'Robert wrote me a beautiful letter that he was very proud that I was playing him. That felt really good,' Travolta - whose father Salvatore was 'obsessed with the trial' - told WFLA's Daytime in October.\n'I think you'll be alarmed at what's revealed. I mean, honestly, its astonishing. It's startling. And it's all conversations and virtual pieces of information that have never been revealed to the public.'\nScientologist couple: Also posing on the Westwood Village Theatre red carpet was Selma's co-star John Travolta alongside his wife of 24 years, Kelly Preston\n'He was very proud that I was playing him': The two-time Oscar nominee - who turns 62 next month - received civil litigator Robert Shapiro's blessing when he scored the small-screen role (pictured with David Schwimmer)\nTravolta - whose father Salvatore was 'obsessed with the trial' - told WFLA's Daytime in October: 'It's all conversations and virtual pieces of information that have never been revealed to the public'\nQuite a transformation: Travolta, left, had the looks and the nuances down as legal defender Robert Shapiro, right in 1994\nBlack-clad bunch: The Criminal Activities star - sporting one of his many wigs - later posed with co-star Cuba Gooding Jr., who plays O.J. in the miniseries\nDapper gent: The 48-year-old Oscar winner - last seen in Selma - rocked a mohawk fade, beard, and glasses with his all-black suit\nThe infamous Bronco chase: Cuba Gooding Jr. plays OJ Simpson in the FX mini series\nCuba Gooding Jr. Taking a quick selfie at the #ACSFX premiere. See him as O.J. Simpson Tuesday 10PM on FX. pic.twitter.com/pcelV4SmsY — AmericanCrimeStoryFX (@ACSFX) January 28, 2016\nThe Criminal Activities star - sporting one of his many wigs - later posed with co-star Cuba Gooding Jr., who plays O.J. in the miniseries.\nThe 48-year-old Oscar winner - last seen in Selma - rocked a mohawk fade, beard, and glasses with his all-black suit.\nDavid Schwimmer - who plays Robert Kardashian in ACS - made sure to greet his Friends-obsessed fans waiting outside the bustling venue.\nI'll be there for you: David Schwimmer - who plays Robert Kardashian in ACS - made sure to greet his Friends-obsessed fans waiting outside the bustling venue\nOde to Kardashian style? The 49-year-old Emmy nominee sported a silver suit and leopard-print arm candy in the form of his leggy, British wife Zoë Buckman\nBig character: David plays attorney Robert Kardashian, who fathered Kim, Khloe, Kourtney and Robert Jr, in the upcoming TV mini-series American Crime Story\nRyan Murphy favourite: Sarah Paulson put on a sideshow in a cranberry halter gown, featuring a metallic belt, as she posed without her partner Holland Taylor\nFleshing out the role: The 41-year-old Golden Globe nominee plays head prosecutor Marcia Clark, who was also struggling through a divorce and custody battle at the time\nBecoming Marcia A photo posted by Sarah Paulson (@mssarahcatharinepaulson) on Nov 27, 2015 at 12:06pm PST\nThe 49-year-old Emmy nominee sported a silver suit and leopard-print arm candy in the form of his leggy, British wife Zoë Buckman.\nSarah Paulson put on a sideshow in a cranberry halter gown, featuring a metallic belt, as she posed without her partner Holland Taylor.\nThe 41-year-old Golden Globe nominee plays head prosecutor Marcia Clark, who was also struggling through a divorce and custody battle at the time.\nPower pair: Courtney B. Vance was still rocking his character's mustache as he posed separately from his longtime wife Angela Bassett wearing a white halter dress\nThe 55-year-old Yale and Harvard grad plays famed defense lawyer Johnnie Cochran, whose closing statement included the catchphrase: 'If it doesn't fit, you must acquit'\nSupporting players: Jordana Brewster - who plays Denise Brown - looked stately in a b&w gown, while Connie Britton - who plays Faye Resnick - opted for a cobalt-blue frock\nCosby alum: Malcolm-Jamal Warner - rocking a patterned scarf - plays Simpson's former teammate Al Cowlings, who drove his white Bronco during the televised cop chase\nCourtney B. Vance was still rocking his character's mustache as he posed separately from his longtime wife Angela Bassett wearing a white halter dress.\nThe 55-year-old Yale and Harvard grad plays famed defense lawyer Johnnie Cochran, whose closing statement included the catchphrase: 'If it doesn't fit, you must acquit.'\nJordana Brewster - who plays Denise Brown - looked stately in a b&w gown, while Connie Britton - who plays Faye Resnick - opted for a cobalt-blue frock.\nInterested parties: Other guests to the premiere included Melissa & Joey star Joey Lawrence, Togetherness actress Amanda Peet, and Scream Queens' Niecy Nash\nYo angels got my haircut! I'll send pic soon but look where I am 2night.I'm supporting my dear friend John Travolta pic.twitter.com/AGrwcWgq92 — Joey Lawrence (@joeylawrence) January 28, 2016\n'Trial of the century': The 10-episode true-crime anthology series American Crime Story: The People v. O.J. Simpson premieres February 2 on FX\nMalcolm-Jamal Warner - rocking a patterned scarf - plays Simpson's former teammate Al Cowlings, who drove his white Bronco during the televised cop chase.\nOther guests to the premiere included Melissa & Joey star Joey Lawrence, Togetherness actress Amanda Peet, and Scream Queens' Niecy Nash.\nThe 10-episode true-crime anthology series American Crime Story: The People v. O.J. Simpson premieres February 2 on FX.\nDoing their thing: The stars of the new series all gathered for a group shot with ACS executive producer Ryan Murphy (M)\nStrike a pose: The 50-year-old Emmy winner - posing with Dana Walden, Paulson, and Gooding - also helmed two episodes of the critically-lauded miniseries\nThigh's the limit! David and his 30-year-old wife enjoyed a glamorous date night away from their four-year-old daughter Cleo\nCelebrations: Cuba, President and General Manager of FX Network John Landgraf, Sarah, and Courtney all attended the afterparty at W Hotel\nNothing but love off-screen: Sarah and Courtney - who play opposing attorneys during the trial - appeared to be deep in conversation\nParty time: The American Academy of Dramatic Arts grad was seen wrapping her arms around the Book of Negroes star at the bash\nWhat a night: Travolta, Kelly, and Gooding Jr. all went in for a large group hug","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420365/Selma-Blair-looks-ultra-slim-white-pleated-gown-LA-premiere-FX-s-American-Crime-Story.html"}
