{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:46:11","date_modify":"2018-10-30 18:46:11","date_publish":"2016-01-19 17:28:05","description":"British actor David Oyelowo, who was snubbed from Oscars consideration last year for his role as Martin Luther King, Jr. in \"Selma,\" is calling for a “radical and timely change” in the academy’s nominating process.","filename":"data/vaneerConsumption/SelmaActorDavidOyelowoDemandsRadicalChangeforUnforgivableWhiteOscars.json","image_url":"https://media.breitbart.com/media/2016/01/David-Oyelowo-GettyImages.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_01_19__1540925171.html","title":"'Selma' Actor David Oyelowo Demands 'Radical Change' for 'Unforgivable' White Oscars","title_page":"'Selma' Actor David Oyelowo Demands 'Radical Change' for 'Unforgivable' White Oscars","title_rss":"NULL","source_domain":"breitbart.com","text":"British actor David Oyelowo, who was snubbed from Oscars consideration last year for his role as Martin Luther King, Jr. in Selma, is calling for a “radical and timely change” in the academy’s nominating process.\nFor the second consecutive year, the Academy of Motion Picture Arts and Sciences (AMPAS) announced that all 20 Oscar nominations in the four main acting categories had gone to white actors.\nOyelowo addressed the the growing controversy while presenting an award to Academy president Cheryl Boone Isaacs at the King Legacy Awards in Los Angeles on Monday night, according to The Hollywood Reporter.\n“The Academy has a problem,” said the 39-year-old. “It’s a problem that needs to be solved.” He continued:\nA year ago, I did a film called Selma, and after the Academy Awards, Cheryl invited me to her office to talk about what went wrong then. We had a deep and meaningful conversation. For 20 opportunities to celebrate actors of color, actresses of color, to be missed last year is one thing; for that to happen again this year is unforgivable.\nDescribing the Oscars as the “epitome” of “artistic endeavor within the filmmaking community,” the actor said, “This institution doesn’t reflect its president, and it doesn’t reflect this room. I am an Academy member, and it doesn’t reflect me, and it doesn’t reflect this nation.”\n“The Academy is an institution in which they all say radical and timely change cannot happen quickly,” he said. “It better happen quickly. The law of this country can change in a matter of months. It better come on. The Oscars is on February 28.\nAdded Oyelowo: “Cheryl needs us to pray that by that date, change is going to come. We need to pray for Cheryl, we need to support Cheryl, we need to love Cheryl. We cannot afford to get bitter, we cannot afford to get negative. But we must make our voice heard.”\nBoone Issacs announced Monday that she was “heartbroken and frustrated,” by the lack of racial diversity, and promised “dramatic steps to alter the makeup of our membership.”\n“In the coming days and weeks we will conduct a review of our membership recruitment in order to bring about much-needed diversity in our 2016 class and beyond,” she said.\nOyelowo joins other black industry figures, including Spike Lee and Jada Pinkett Smith, in addressing the race controversy.","url":"https://www.breitbart.com/entertainment/2016/01/19/selma-actor-david-oyelowo-slams-oscars-unforgivable-lack-diversity/"}
