{"authors":["Greg Styles For Daily Mail Australia"],"date_download":"2018-10-23 03:30:43","date_modify":"2018-10-23 03:30:43","date_publish":"2017-03-10 13:02:15","description":"Michael Turnbull is a big fan of the topless mirror selfie. But the former Bachelorette runner-up took it a step further on Friday by taking a Snapchat video during his 'bathroom adventures'.","filename":"data/vaneerConsumption/SeminakedMichaelTurnbullfilmsSnapchatinjustatowel.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22644700000578-0-image-a-25_1489144008736.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300620_Michael-Turnbull-Bachelorette-films-cringe-worthy-Snapchat_1540265443.html","title":"Semi-naked Michael Turnbull films Snapchat in just a towel","title_page":"Semi-naked Michael Turnbull films Snapchat in just a towel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michael Turnbull is a big fan of the topless mirror selfie.\nBut the former Bachelorette runner-up took it a step further on Friday by taking a Snapchat video during his 'bathroom adventures'.\nPosing in just a towel, the 35-year-old applied one off the app's filters to alter his appearance for the short clip, which he shared on Instagram.\nNew Sheriff in town: Michael Turnbull took his usual shirtless antics a step further on Friday by taking a Snapchat video during his 'bathroom adventures'\nMichael is tensing his athletic body as he is seen adorned with a cowboy hat and beard as a burning rag shoots flames in front of him.\nIt isn't the first time that the Brisbane native, who shot into the public eye on season one of The Bachelorette, has made use of the app for the amusement of his Instagram followers.\nMichael uploaded a similar video late last year - this time using Snapchat's 'duck' filter.\nHe's done this before: It isn't the first time that the Brisbane native has made use of the app for the amusement of his Instagram followers\nHe's quack-ers: Michael uploaded a similar video late last year - this time using Snapchat's 'duck' filter\nAgain opting to appear minus a shirt, the reality star is seen with a large beak and sunglasses.\nFollowers expressed their amusement as Michael could be heard rapping along to a song by Canadian artist Drake.\nThe former Melbourne Victory goalkeeper, who failed to make an appearance for the club, also used the app to mock his singleton status in December.\nNew flame: The former Melbourne Victory goalkeeper, who failed to make an appearance for the club, also used the app to mock his singleton status in December\nUnder the spotlight: Back in August, Michael was investigated by Channel Nine's A Current Affair over claims he was representing a pyramid scheme. Pictured with Bachelorette Sam Frost\nPictured flying solo at a fashion event, Michael edited an emoji of the dancing lady next to a picture of him on the red carpet.\nHe captioned the picture: 'When she takes forever to get ready.'\nBack in August, Michael was investigated by Channel Nine's A Current Affair over claims he was representing a pyramid scheme.\nThe former sportsman was also forced to deny that he is a 'fake' after he was busted trying to pass off an imitation Rolex watch as the real deal during his time on The Bachelorette.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300620/Michael-Turnbull-Bachelorette-films-cringe-worthy-Snapchat.html"}
