{"authors":[],"date_download":"2018-10-22 22:16:29","date_modify":"2018-10-22 22:16:29","date_publish":"2014-05-09 17:11:59","description":"U.S. lawmakers have been calling on the Obama administration — and Nigeria's government — to do more to retrieve the girls taken by Boko Haram.","filename":"data/vaneerConsumption/SenateSetsHearingonResponsetoAbductedNigerianSchoolgirls.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/432346/140509-nigeria-do-something-jsw-104p_dfca11bb5a48198adab946d0c7bbc962.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_senate-sets-hearing-response-abducted-nigerian-schoolgirls-n101571_1540246589.html","title":"Senate Sets Hearing on Response to Abducted Nigerian Schoolgirls","title_page":"Senate Sets Hearing on Response to Abducted Nigerian Schoolgirls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWASHINGTON — A U.S. Senate panel next week will examine U.S. offers of assistance to Nigeria after Islamist insurgents took more than 200 girls from their school, as well as impediments that might be slowing that assistance.\nThe hearing will come a full month after the abductions.\nThe Senate Foreign Relations Subcommittee on Africa Affairs said it will hold the hearing on Thursday, May 15, with witnesses from the U.S. State Department and Department of Defense.\nU.S. lawmakers have been calling on the Obama administration — and Nigeria's government — to do more to retrieve the girls taken by Boko Haram militants from their school in the northern Nigerian village of Chibok on April 14.\n\"It took far too long for (Nigerian) President (Goodluck) Jonathan to accept the United States' offers of assistance to find these girls. I was relieved when President Jonathan finally said he would welcome our help, but rhetoric alone won't bring these girls home,\" Delaware Democratic Senator Chris Coons, the chairman of the subcommittee, said in a statement.\nEarlier this week, members of Congress held a vigil on the steps of the U.S. Capitol to demand action. The U.S. Senate unanimously passed a resolution condemning the kidnapping and supporting U.S. efforts to aid in the search.\nOn Friday morning, a House of Representatives committee unanimously passed its own Nigeria resolution.\n— Reuters","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/senate-sets-hearing-response-abducted-nigerian-schoolgirls-n101571"}
