{"authors":["Breitbart News"],"date_download":"2018-10-30 19:23:16","date_modify":"2018-10-30 19:23:16","date_publish":"2015-01-29 20:50:33","description":"A bill that would levy tough new sanctions on Iran if it fails to sign an agreement to curb its nuclear program cleared a Senate committee on Thursday. But lawmakers are holding off on a full Senate vote to see whether diplomatic negotiations yield a deal. |","filename":"data/vaneerConsumption/SenatePanelApprovesIranSanctionsBill.json","image_url":"https://media.breitbart.com/media/2015/01/menendez.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_29__1540927396.html","title":"Senate Panel Approves Iran Sanctions Bill","title_page":"Senate Panel Approves Iran Sanctions Bill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — A bill that would levy tough new sanctions on Iran if it fails to sign an agreement to curb its nuclear program cleared a Senate committee on Thursday. But lawmakers are holding off on a full Senate vote to see whether diplomatic negotiations yield a deal.\nRepublican and Democratic members of the Senate Banking, Housing and Urban Affairs Committee voted 18-4 to pass the bill aimed at ramping up economic pressure on Iran starting in July if it doesn’t ink an international deal preventing it from having the capability to develop a nuclear weapon.\nRepublicans still can move ahead, but that’s unlikely without Democratic support. They wouldn’t have enough votes to override President Barack Obama, who says he’ll veto the legislation because it would derail the diplomatic effort to reach a deal.\nThe U.S. and other nations negotiating with Tehran have long suspected Iran’s nuclear program is secretly aimed at atomic weapons capability. Tehran insists the program is entirely devoted to civilian purposes.\nTalks with Tehran have been extended until July, with the goal of reaching a framework for a deal by the end of March. Iran’s state-run IRNA news service said Wednesday that Iranian lawmakers have proposed a bill that would scuttle the diplomatic effort if the U.S. imposed new U.S. sanctions.\nA movement to levy more sanctions to cripple the Iranian economy had been moving fast on Capitol Hill. But on Tuesday, Sen. Bob Menendez, D-N.J., who co-authored the measure with Sen. Mark Kirk, R-Ill., and nine other Democrats told Obama in a letter that they wouldn’t push the bill at least until the end of March.\n“While I will move to vote today in support of the underlying legislation, I have no intention of moving forward and supporting it on the floor if it is brought before the March 24 deadline” when lawmakers will be able to ascertain “whether or not an agreement is possible and what that agreement would look like,” Menendez said.\nThe bill would not impose any new sanctions during the remaining timeline for negotiations. It says that if there is no deal by July 6, the sanctions that were eased during negotiations would be reinstated. After that, sanctions would be stepped up every month.\n“I have been working on this legislation for quite some number of years to thread the ultimate needle to make sure that we achieve the noble cause of making sure we avoid a nuclear war in the Persian Gulf and make sure that our kids never, ever have to witness such an event,” Kirk said.\n“I would say that for those that think that we’re rushing too fast … we’re probably acting way too late,” Kirk said.\nThe committee voted to amend the bill to include a statement that Israel, an archenemy of Iran, has a right to defend itself. Other amendments to the bill that passed allow Congress to vote on any deal approved with Iran; beef up reporting requirements for verifying that Iran is complying with any agreement reached and task the Treasury Department to report on the economic impact of sanctions relief on Iran.\nThe White House has been lobbying lawmakers to refrain from slapping more sanctions on Iran amid the delicate negotiations.\nAsked whether the U.S. would agree to extend the talks if a framework for a comprehensive agreement is not reached by March 24, White House spokesman Josh Earnest said “We’ll see.”\nEarnest also said Obama would veto legislation that would give Congress final say on approving any deal with Iran because it would “set a harmful precedent” for future negotiations.\nLast week, House Speaker John Boehner fueled the rising friction between Capitol Hill and the White House by announcing that he had invited Israeli Prime Minister Benjamin Netanyahu to address Congress March 3 and push for new sanctions.\nRep. Nancy Pelosi, D-Calif., the leader of the House Democrats, said Boehner’s invitation was inappropriate. Democratic Reps. Keith Ellison of Minnesota, Steve Cohen of Tennessee and Maxine Waters of California are circulating a letter asking Boehner to postpone Netanyahu’s address to Congress.\n“The timing of this invitation and lack of coordination with the White House indicate that this is not an ordinary diplomatic visit,” the letter states. “Rather, this appears to be an attempt to promote new sanctions legislation against Iran that could undermine critical negotiations.”\n—\nAssociated Press writer Julie Pace contributed to this report.","url":"https://www.breitbart.com/politics/2015/01/29/senate-panel-approves-iran-sanctions-bill/"}
