{"authors":["Associated Press"],"date_download":"2018-10-23 05:14:32","date_modify":"2018-10-23 05:14:32","date_publish":"2016-01-29 20:56:40","description":"LOS ANGELES (AP) — California's U.S. senators are seeking a federal investigation into the ongoing leak of natural gas from a utility's underground storage s...","filename":"data/vaneerConsumption/SenatorsseekfederalreviewofCaliforniagasleak.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423439_Senators-seek-federal-review-California-gas-leak_1540271672.html","title":"Senators seek federal review of California gas leak","title_page":"Senators seek federal review of California gas leak | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Senators seek federal review of California gas leak\nLOS ANGELES (AP) — California's U.S. senators are seeking a federal investigation into the ongoing leak of natural gas from a utility's underground storage site that has forced thousands of people to leave nearby Los Angeles neighborhoods.\nU.S. Sens. Barbara Boxer and Dianne Feinstein said Friday that they will introduce an amendment to legislation on the Senate floor that would direct Energy Secretary Ernest Moniz to lead a review of the cause and response to the leak at a Southern California Gas Co. facility.\nMassive amounts of climate-changing methane have been spewing for more than three months from a well blowout at the Aliso Canyon site. The stench has sickened residents in the Porter Ranch community who have complained of nosebleeds, headaches, nausea and other symptoms.\nWhile public health officials have sought to reassure residents that they don't believe there will be long-term health problems, they also told SoCalGas to pay to relocate people who wanted to move out.\nSo far, the company has relocated more than 4,500 households and was in the process Thursday of helping move nearly 3,400 others, a spokeswoman said.\nGov. Jerry Brown has declared an emergency. Several state agencies with overlapping authority have been overseeing efforts to plug the leak, which could take another month, and ordering to the gas company to stop the leak and turn over reports about the well that was more than 60 years old.\nThe amendment would also direct the task force to recommend whether the aging facility and others like it should continue to operate near residential communities.\nThe California Public Utilities Commission is looking into the impact on energy supplies if the facility is shut down. Aliso Canyon is the largest facility of its kind in the West and capable of holding enough gas to supply all of Southern California.\nBoxer said she wanted to \"put our brightest minds to work\" on the crisis in the hope of preventing similar blowouts across the country.","url":"https://www.dailymail.co.uk/wires/ap/article-3423439/Senators-seek-federal-review-California-gas-leak.html"}
