{"authors":[],"date_download":"2018-10-22 21:35:35","date_modify":"2018-10-22 21:35:35","date_publish":"2014-06-05 19:32:29","description":"A bipartisan group of senators on Thursday announced a deal to address delays in health care for military veterans.","filename":"data/vaneerConsumption/SenatorsAnnounceDealonVeteransHealthCare.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_senators-announce-deal-veterans-health-care-n123851_1540244135.html","title":"Senators Announce Deal on Veterans' Health Care","title_page":"Senators Announce Deal on Veterans' Health Care","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA bipartisan group of senators on Thursday announced a deal to address delays in health care for military veterans in the wake of the Veterans Affairs scandal that led to the resignation of VA head Eric Shinseki.\nVeterans Affairs Committee Chairman Bernie Sanders and Republican Sen. John McCain announced the deal on the Senate floor and urged swift passage of the legislation that is aimed to expand opportunities for veterans to receive medical care.\nA key provision of the deal would allow veterans who live at least 40 miles from a VA hospital to receive care from some private doctors. It also would also permit the construction of new VA facilities in areas of the country where hospitals are sparse.\n\"Right now we have a crisis on our hands and it's imperative that we deal with that crisis,\" Sanders, an independent, said. \"And in my mind, the essence of the crisis is that we have learned that in many parts of this country...veterans cannot get the timely care that they need.\"\nThe bill also gives the Obama administration greater firing power while giving dismissed VA employees one week to file an appeal.\nPassing legislation to address VA health care has been a priority for Congress following reports that veterans died while waiting for care at a VA hospital in Phoenix.\n“We were able to come together in a way that, I believe, will help relieve this terrible tragedy that seems to have befallen our nation’s veterans,” McCain said. “It started in Phoenix, Arizona, as my colleagues know, but it is spread all over the country.”\nThe timetable for when the Democratically-controlled Senate will take up the bill is unclear.","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/senators-announce-deal-veterans-health-care-n123851"}
