{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:20","date_modify":"2018-10-30 19:08:20","date_publish":"2018-07-19 04:22:58","description":"Migrant Parents Could Stay Until Children's Legal Appeals Finish","filename":"data/vaneerConsumption/SenateDemocratsPushNationalCatchandReleaseBill.json","image_url":"https://media.breitbart.com/media/2018/07/GettyImages-981572578.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_07_18__1540926500.html","title":"Senate Democrats Push National Catch-and-Release Bill","title_page":"Senate Democrats Push National Catch-and-Release Bill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate Democrats are rallying behind a “family reunification” bill which promises a policy of catch-and-release for nearly all migrants who bring their children over the border.\nThe bill would allow the migrant parents to stay in the United States until their children’s legal pleas are finally resolved. That legal stay could last for several years if the courts’ existing two-year backlog of 700,000 cases is increased by many migrants eager to accept the Democrats’ catch-and-release invite.\nThe bill would also allow more migrants to simply walk away from courtroom hearings and into the nation’s population of at least 11 million illegal migrants.\n“Only about 5 percent of the people [who are] released [from detention] ultimately end up being removed, even if they get a final order of removal for immigration purposes,” Kevin McAleenan, head of U.S. Customs and Border Protection, said July 17. In contrast, when migrants are kept in custody, he said:\nImmigration processing can be done fairly and relatively quickly [and] the detain docket for the immigration courts moves in about 45 days on average …. for those in ICE custody.\nWhen migrants are released, the legal process is lengthened and many migrants disappear, so wrecking law enforcement. McAleenan said:\nIt is really that in-custody docket, move in 45 days, that actually creates an immigration system where we have a rule of law, and we don’t have that if we are releasing people.\nThe Reunite Every Unaccompanied Newborn Infant, Toddler and Other Children Expeditiously (REUNITE) Act, is sponsored by California Sen. Kamala Harris, Oregon Sen. Jeff Merkley, and Nevada Sen. Catherine Cortez Masto. The bill is needed, they say, to stop President Donald Trump from sending migrants’ children to government shelters so their parents can be detained until their immigration and asylum cases are heard.\n“This is a crisis created by this administration and has resulted in thousands of children being ripped from their mothers and fathers,” Harris said July 17. “Government should be in the business of keeping families together not tearing them apart.”\n“Trump’s policy to deliberately inflict trauma on the children of families fleeing persecution is a dark and evil deed,” said Merkley. The bill would “treat these families with respect and decency as they await their hearing on their asylum claims,” he said.\nThe bill “would require the Trump administration to immediately reunite separated children with their parents, ensure that separated children have access to legal counsel … [and ensures] families are not detained as they pursue legal avenues of relief,” said Cortez Masto.\nCurrent laws bar officials from keeping children in detention with their illegal-immigrant parents for more than 20 days. The deadline is far less than the 45 days that McAleenan says are needed to complete the legal process.\nThat 20-day limit is recognized by cartels and by the migrants who bring children with them to trigger catch-and-release rules. For example, the New York Times reported June 22:\n“This is the reason I brought a minor with me,” said Guillermo T., 57, a construction worker who recently arrived in Arizona. Facing unemployment at home in Guatemala, he decided to head north; he had been told that bringing his 16-year-old daughter would assure passage. He asked that only his first named be used to avoid consequences with his immigration case. “She was my passport,” he said of his daughter.\nThe bill would also bar the use of DNA technology to verify migrants’ claim to be parents of the children and would redirect funds from enforcement programs to fund the extra immigration inflow.\nThe backlog of asylum cases is now 700,000, and many take more than two years to complete. In 2017, officials awarded 400,000 work permits to people waiting for asylum hearings. The migrant inflow of cheap labor and extra consumers is praised by business groups and progressives.\nCurrently, four million Americans turn 18 each year and begin looking for good jobs in the free market — but the government provides green cards to roughly 1 million legal immigrants and temporary work-permits to roughly 3 million foreign workers.\nThe Washington-imposed economic policy of economic growth via mass-immigration shifts wealth from young people towards older people by flooding the market with foreign labor. That process spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions.","url":"https://www.breitbart.com/midterm-election/2018/07/18/senate-democrats-offer-catch-release-bill-help-migrant-families/"}
