{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:55:45","date_modify":"2018-10-30 18:55:45","date_publish":"2015-07-31 00:35:44","description":"Senate Republicans say legislation to defund Planned Parenthood and fund women's health care is about the “moral fabric” of the nation.","filename":"data/vaneerConsumption/SenateRepublicansFundWomensHealthNotPlannedParenthood.json","image_url":"https://media.breitbart.com/media/2015/07/senators-for-defunding-planned-parenthood-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_30__1540925745.html","title":"Senate Republicans: 'Fund Women’s Health, Not Planned Parenthood'","title_page":"Senate Republicans: 'Fund Women’s Health, Not Planned Parenthood' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With their legislation to defund Planned Parenthood and redirect those federal funds to women’s health care facilities that don’t provide abortions, Senate Republicans say they are sending the message that their proposal is not about politics, but about the “moral fabric” of the nation.\nAt a news conference Wednesday, Senate Majority Leader Mitch McConnell said the videos of Planned Parenthood medical officials engaged in harvesting the body parts of aborted babies for sale “shock the conscience.”\nReferring to the GOP bill as one that will “ensure taxpayer dollars that are supposed to be spent on women’s health are, in fact, spent on women’s health.” McConnell said taxpayer funding should not be subsidizing “some scandal-plagued organization.”\nSen. Joni Ernst, who introduced the legislation, said, “The recent footage depicting Planned Parenthood’s role in the harvesting of organs—heart, liver, kidneys—of unborn babies is morally reprehensible and vile.”\n“The American people—Republicans and Democrats alike—are horrified at the utter lack of compassion shown by Planned Parenthood for these women and their babies,” she continued. “In fact, now, Hillary Clinton is calling these Planned Parenthood images ‘disturbing,’ and I agree.”\nAsserting that the videos hit at the “moral fabric of our society,” Ernst said the issue at hand is “human life.” She stressed the legislation proposed would defund Planned Parenthood but make that funding available to other women’s health care facilities—such as community health centers and hospitals—that do not provide abortions.\n“I want to make clear that there will be no reduction in overall federal funding available to support women’s health,” Ernst said.\nAdding that, while the images and conversations seen in the videos have caused Americans to be “horrified” and “appalled,” Sen. Deb Fischer said what is particularly shocking is the “lack of compassion towards women and unborn children” on display by Planned Parenthood medical officials. Fischer echoed that the GOP legislation “targets funding for centers that truly prioritize and place that priority on women’s health.”\n“It’s important to note that there are 9,000 community health centers across the country which do everything that Planned Parenthood does, except for abortion,” Sen. Rand Paul said. “There’s absolutely no need for any public funding of Planned Parenthood. There’s no excuse for it, and we should end all funding for Planned Parenthood.”\nSen. Tim Scott also emphasized that the issue of defunding Planned Parenthood is “not a political issue, not a partisan issue, not even about whether you’re pro-life or pro-choice,” but, rather, “an issue about our humanity.” Scott said he was “brought to tears” by the videos and, consequently, believes “the right thing for us to do is to defund Planned Parenthood.”\nAlso speaking at the press conference were Sen. James Lankford, Sen. John Cornyn, Sen. John Thune, and Sen. Johnny Isakson. Other co-sponsors of the bill include Sen. Marco Rubio, Sen. Tom Cotton, Sen. Ted Cruz, Sen. Mike Lee, and Sen. John McCain.\nAt least one Republican Senator, Sen. Susan Collins (R-ME), said Wednesday, according to the Associated Press, that until she knows more, she will oppose ending federal support to Planned Parenthood.\nCollins’s office did not respond to Breitbart News’s request for comment on whether or not she would support the legislation.\nDemocrats in defense of Planned Parenthood, nevertheless, are once again advancing the “war on women” meme against the Senate GOP’s legislation, failing to mention the fact that the bill redirects the abortion giant’s federal funding to other women’s health care facilities.\nOn Tuesday, Senate Minority Leader Sen. Harry Reid (D-NV) charged Republicans with “an attack on women’s health,” as The Hill reported. Sen. Patty Murray (D-WA) said, “I am furious that Republicans are once again trying to take away basic health care services for 2.7 million women. We have stood strong before that we are going to make sure that women in this country have health care available, Planned Parenthood provides it. For Republicans to take it away is wrong.”\nSimilarly, presidential contender Sen. Bernie Sanders (I-VT) said, “The vast majority of government funding that Planned Parenthood receives is through Medicaid reimbursements. Cutting that funding will be devastating to the health needs of millions of women who desperately need the quality services Planned Parenthood provides.”\nThe Senate will vote on Ernst’s bill to defund Planned Parenthood, S. 1881, on Monday, August 3 at 5:30 p.m.","url":"https://www.breitbart.com/politics/2015/07/30/senate-republicans-fund-womens-health-not-planned-parenthood/"}
