{"authors":[],"date_download":"2018-10-22 21:13:59","date_modify":"2018-10-22 21:13:59","date_publish":"2014-05-06 16:17:03","description":"Despite rancor, a measure to begin debate on an underlying energy efficiency bill was approved 79-20.","filename":"data/vaneerConsumption/SenateWranglesOverEnergyKeystoneXLPipelineMeasures.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/423721/keystone_pipeline_protest-jpeg-0c207_fda5f80d8d4a9510f1a0785d92504510.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_senate-wrangles-over-energy-keystone-xl-pipeline-measures-n98276_1540242839.html","title":"Senate Wrangles Over Energy, Keystone XL Pipeline Measures","title_page":"Senate Wrangles Over Energy, Keystone XL Pipeline Measures ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA heated dispute spilled onto the Senate floor Tuesday as leaders wrangled over a measure to approve construction of the Keystone XL pipeline.\nDespite the rancor, a measure to begin debate on an underlying energy efficiency bill was approved 79-20. But the legislation’s fate remains unclear as both parties accuse each other of playing politics with the controversial pipeline proposal.\nRepublicans want to attach the Keystone measure as one of several amendments to the energy efficiency bill proposed by Sens. Rob Portman of Ohio and Jeanne Shaheen of New Hampshire. Some embattled red state Democrats, eager to get on the record supporting the pipeline but wary of scuttling the underlying bill, want a separate vote on the pipeline approval.\nOn Tuesday morning, Senate Majority Leader Harry Reid compared negotiations with the GOP to the pursuit of a greased pig at the rodeo, arguing that Republicans have asked for too much in exchange for the Keystone vote.\n“Oftentimes working with my Republican colleagues reminds me of chasing these little pigs,” Reid said on the Senate floor. “Nearly every time we make progress we see it slip out of our hands and we see the Republicans scamper away.”\nSenate Minority Leader Mitch McConnell chastised Reid for the theatrical speech, saying the Republican request for amendments was fair.","url":"https://www.nbcnews.com/politics/congress/senate-wrangles-over-energy-keystone-xl-pipeline-measures-n98276"}
