{"authors":["Francesca Chambers","White House Correspondent","Geoff Earle","Deputy U.S. Political Editor For Dailymail.Com"],"date_download":"2018-10-23 03:42:31","date_modify":"2018-10-23 03:42:31","date_publish":"2017-04-26 15:12:02","description":"Some senators who traveled to the White House Wednesday to get a secret briefing on North Korea claimed they learned 'very little' and did not get 'straight answers'.","filename":"data/vaneerConsumption/SenatorsclaimTrumpbriefingonNorthKoreawaspointless.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/27/16/3FA7E7A900000578-0-image-a-3_1493305380686.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447884_Senate-heads-White-House-North-Korea-briefing_1540266151.html","title":"Senators claim Trump briefing on North Korea was pointless","title_page":"Senators claim Trump briefing on North Korea was pointless | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Several senators who attended a White House briefing Wednesday said they 'learned very little' about the threat posed by North Korea and accused Trump administration officials of failing to give 'straight answers' about the options to deal with the threat posed by North Korean President Kim Jong-Un.\nPresident Trump dropped in on the classified briefing of the senators that was conducted inside the White House complex.\nSenators got briefed on what a senior administration official described as a 'broad range of options' to 'remove this threat' posed by Kim's government.\nSenator Richard Blumenthal (pictured, left with Supreme Court judge nominee Neil Gorsuch) said there was very little new in the Korea briefing\nBut Senator Richard Blumenthal, a Democrat from Connecticut, told the Washington Post: 'There was very little, if anything new (in it).'\nHe said: 'I remain mystified about why the entire Senate had to be taken over to the White House rather than conducting it here.'\nOne Republican congressman, who declined to be named, said: 'Several senators asked specifically 'What is the policy?' and the briefers gave us very, very few details.'\nA bus is seen outside the White House as the entire U.S. Senate took a field trip to 1600 Pennsylvania Avenue to be briefed on the North Korea situation\nMembers of the Senate came to the White House Wednesday in vans and buses to get a secret briefing on North Korea amid escalating tensions.\nSenate Majority Leader Mitch McConnell sought the briefing, and Trump then offered to host the senators at the White House, in a move that put the location of the high-stakes discussion on his own turf.\nThe administration described a series of economic, diplomatic, and other pressure that could be applied – but also continues to keep military options on the table.\nThe anonymous Republican senator told the Post 'the basic gist of it at the beginning was that we're going to get more aggressive; we've waited and they've continued to be bad actors. We've reached a point where things are getting pretty dire and getting to the point where we've got to get more aggressive.'\n'From then on, what we all wanted to know is: What does that mean?. What is it that we should be looking for as the trigger that something is about to happen and that we'd end up taking some kind of kinetic action? That's where things got a little elliptical.'\n'Nothing is risk-free. This situation is not risk-free,' a Trump administration official said, the Washington Post reported.\n'What the president has done is he's made a decision for us to pursue a certain course, and that course obviously has a number of options associated with it depending on how the situation develops in the future,' a White House official said.\nSenate Majority Leader Mitch McConnell (pictured center) had called for the briefing about North Korea amid high tensions with the 'hermit kingdom' and congressmen were bussed to the White House for the briefing\n'What you've seen is really an integrated effort to prioritize diplomatic and informational aspects of national power, but also what you'll see soon is using the economic dimension of national power, as well as the military preparations that are underway,' the official said at a briefing for reporters after the meeting with senators.\nSenator Ted Cruz (R-Texas) said after the briefing: 'The military is obviously planning for a number of options, as they should -- minimal military action to more significant action.'\nHe continued, according to ABC News: 'It's of course the hope of the administration and Congress that military action isn't necessary. If there's a clear and imminent threat to the U.S., our military needs to be prepared to act and I believe they are prepared to act to keep our country safe.'\nTrump and Vice President Mike Pence, who has warned that all options are on the table with respect to North Korea, addressed the group.\nSecretary of State Rex Tillerson, Secretary of Defense James Mattis, and Director of National Intelligence Dan Coats issued a joint statement pointing to the 'urgent threat.\n'Past efforts have failed to halt North Korea's unlawful weapons programs and nuclear and ballistic missile tests. With each provocation, North Korea jeopardizes stability in Northeast Asia and poses a growing threat to our allies and the U.S. homeland,' they said.\nSen. Claire McCaskill (left, in red) and Sen. Lindsey Graham (center) join their Senate peers and head to the White House for a North Korea briefing\nJoint Statement by Secretary of State Rex Tillerson, Secretary of Defense James Mattis, Director of National Intelligence Dan Coats\nPast efforts have failed to halt North Korea's unlawful weapons programs and nuclear and ballistic missile tests. With each provocation, North Korea jeopardizes stability in Northeast Asia and poses a growing threat to our allies and the U.S. homeland. North Korea's pursuit of nuclear weapons is an urgent national security threat and top foreign policy priority. Upon assuming office, President Trump ordered a thorough review of U.S. policy pertaining to the Democratic People's Republic of Korea (DPRK) ... The president's approach aims to pressure North Korea into dismantling its nuclear, ballistic missile, and proliferation programs by tightening economic sanctions and pursuing diplomatic measures with our allies and regional partners. We are engaging responsible members of the international community to increase pressure on the DPRK in order to convince the regime to de-escalate and return to the path of dialogue. We will maintain our close coordination and cooperation with our allies, especially the Republic of Korea and Japan, as we work together to preserve stability and prosperity in the region. The United States seeks stability and the peaceful denuclearization of the Korean peninsula. We remain open to negotiations towards that goal. However, we remain prepared to defend ourselves and our allies.\n'North Korea's pursuit of nuclear weapons is an urgent national security threat and top foreign policy priority.\n'The president's approach aims to pressure North Korea into dismantling its nuclear, ballistic missile, and proliferation programs by tightening economic sanctions and pursuing diplomatic measures with our allies and regional partners,' they continued.\n'We are engaging responsible members of the international community to increase pressure on the DPRK in order to convince the regime to de-escalate and return to the path of dialogue. We will maintain our close coordination and cooperation with our allies, especially the Republic of Korea and Japan, as we work together to preserve stability and prosperity in the region.'\n'We remain prepared to defend ourselves and our allies,' they warned.\nSome senators griped after the meeting about the lack of definition about the administration's North Korea policy.\nThe official declined to say what those preparations were, though the reference may have been in response to a Pentagon proposal to beef up security of the Hawaiian islands.\n'I don't think we're going to describe those in any detail,' the White House official said.\n'The president has made clear that a North Korea that is armed with a nuclear armed missile – a capability they have yet to test – is unacceptable to us and threatens our vital national security interest, ' McConnell said on the Senate floor Wednesday morning.\nAccording to a White House national security official, Trump suggested the White House as a venue 'as a gesture of cooperation with Congress. He also intends to drop by briefly.'\n'The president offered to host it here at the White House to communicate the seriousness of the threat from North Korea and to allow the senators to ask questions of the national security team,' a senior administration official said.\nA spokesman for McConnell told DailyMail.com, 'The Leader requested the briefing. The White House offered to host it there and the Leader accepted.'\nSen. John McCain was spotted outside one of the buses on Capitol Hill, which headed to the White House for a briefing\nSen. Elizabeth Warren was seen outside the Capitol Hill heading to one of the buses that took the entire U.S. Senate to the White House\n'Thus, in order to allow the Senate to better understand this threat, I asked the administration to brief all senators on the issue, and the president graciously offered to hold the meeting down at the White House. So I would encourage all our colleagues to attend this afternoon's meeting,' McConnell likewise said.\nOnes like this one on highly classified subjects normally would be held inside a large, secure facility in the Capitol.\nInstead, members of the Senate were seen coming to the White House, where the executive for decades has carved out supreme authority over foreign policy and military action.\nThe senators piled into buses to make the drive up Pennsylvania Ave. for the North Korea briefing on Trump's turf.\nA senior administration official warned Wednesday that Kim Jong-un is a risk to a large population of South Korea\n'But now really a new level of threat from North Korea associated with the unacceptable and erratic and unlawful behavior of the Kim regime...represented by the murder of his brother using a nerve agent in a public place, in an airport, ' the official said.\nSenators were briefed on what the official descried as a 'broad range of options' to 'remove this threat' posed by Kim's government.\n'What the president has done is he's made a decision for us to pursue a certain course, and that course obviously has a number of options associated with it depending on how the situation develops in the future,' the official said.\n'So I think that what you've seen is really an integrated effort to prioritize diplomatic and informational aspects of national power, but also what you'll see soon is using the economic dimension of national power, as well as the military preparations that are underway,' he said.\nThe official declined to say what those preparations were, though the reference may have been in response to a Pentagon proposal to beef up security of the Hawaiian islands.\n'I don't think we're gonna describe those in any detail,' the White House official said.\nWhite House spokeswoman Sarah Huckabee Sanders told 'Fox and Friends' Wednesday morning, 'The tensions are high, I think there's no secret about that,'\n'But also I think that we finally have a president who takes North Korea seriously and is going to do something about it if necessary. And I think that's a big difference between President Trump and the previous administration,' she said.\nA senior aide told the Washington Post earlier this week the idea for holding the event at the White House came from the president himself.\nExplaining the unusual set-up for the meeting, which is expected to be held in the Old Executive Office building, where the White House National Security Council is house, Huckabee Sanders continued: 'Let me be very clear – this is a Senate briefing simply taking place on White House grounds. This is something being led by the Senate, and the White House is simply providing a location for them to do that.'\nHundreds of weapons were fired across the sea in Wonsan, North Korea, in a military demonstration Tuesday\nMY PLACE OR YOURS? The Senators will travel to White House grounds for the briefing. 'This is a Senate briefing simply taking place on White House grounds,' the White House said\nMore than 300 large-calibre artillery pieces were fired in the drill, called a 'Combined Fire Demonstration'\n'Tensions are high,' said White House aide Sarah Huckabee Sanders in an appearance on 'Fox & Friends'\nLeader Kim Jong-Un saluted his military from the top of a private car as they drove through the demonstration\n'But because of the nature, the importance of this event, I think it's a great thing that they're doing, and shows the cooperation of both the Senate and the White House to work together to make sure that North Korea does not continue to be a constant threat for the United States,' she said.\n'North Korea's one of the greatest threats we face in the world today, and I think that any senator that doesn't show up [does] a disservice to the state, and to the country, by not being a part of this,' she said.\nOn Tuesday, in just the latest escalation, North Korea staged live-fire exercises off its coast in a show of military force.\nNorth Korean dictator Kim Jong-Un's army fired rockets and torpedoes at mock enemy warships during North Korea's 'largest ever' live-fire artillery drills.\nThe Dwight D. Eisenhower Executive Office Building has am auditorium that can be used to accommodate large groups\nMandatory Credit: Photo by Lcpl. Christian J. Robertson/REX/Shutterstock (8656764b)..U.S. Marine Corps crew chief Cpl. Justin Fry, mans the door gun on a UH-1Y Huey helicopter, as they fly in a formation during a Mission Rehearsal Exercise in Okinawa, Japan. U.S. Forces across the Asian region have increased combat exercises as tensions continue to rise between the U.S. and North Korea...US military exercises near North Korea increase - 26 Apr 2017..\nHundreds of tanks were lined up along the eastern coastal town of Wonsan in a show of military strength to celebrate 85 years since the North Korean army was created.\nKim saluted the military as he watched the exercises on Tuesday, which involved the firing of more than 300 large-calibre artillery pieces and included submarine torpedo-attacks.\nJust one day later, South Korea conducted joint military live-fire drills with the U.S. at Seungjin fire training field in Pocheon, South Korea, near the border with North Korea.\nWhite House press secretary Sean Spicer said Director of National Intelligence Dan Coates, Secretary of State Rex Tillerson, Secretary of Defense James Mattis, and Chairman of the Joint Chiefs of Staff Joseph Dunford all would attend.\n'We'll know more, as we get closer to that time, how many actually show up. But this is a great opportunity for each of these senators to get briefed as to what the situation is in North Korea and the steps that this administration's taking to calm that threat,' he said.\nAsked if the White House would make the case for military action, Spicer responded: 'Well, this is about making sure that they know what steps the Trump administration is taking to protect this country, to reduce the threat of North Korea.'\nSpicer continued: 'A lot of the efforts the president has already undertaken with President Xi in China, and the success that he's had of China putting both political and economic pressure on China, in a frankly unprecedented way, to make sure that we not – just not corral the world, the rest of the world in this effort,' said, in words likely meant to mean China's efforts to pressure North Korea.\nSpicer on Tuesday also indicated the briefing was the Senate's idea.\n'Just to be clear, that meeting is a Senate meeting led by Leader McConnell just utilizing our space. So that is their meeting, so we're not there to talk strategy,' he said.","url":"https://www.dailymail.co.uk/news/article-4447884/Senate-heads-White-House-North-Korea-briefing.html"}
