{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:06:31","date_modify":"2018-10-30 18:06:31","date_publish":"2017-03-15 19:16:15","description":"A group of Senate critics of the House-led effort to replace Obamacare met with senior White House aides on Tuesday to warn of the bill’s uncertain future in the Senate. | Politics","filename":"data/vaneerConsumption/SenateCriticsofPaulRyanHealthcareBillSoundAlarmattheWhiteHouse.json","image_url":"https://media.breitbart.com/media/2017/03/Cruz-Lee-Paul-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_15__1540922791.html","title":"Senate Critics of Paul Ryan Healthcare Bill Sound Alarm at the White House","title_page":"Senate Critics of Paul Ryan Healthcare Bill Sound Alarm at the White House | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A group of Senate critics of the House-led effort to replace Obamacare met with senior White House aides on Tuesday to warn of the bill’s uncertain future in the Senate.\nSenators Ted Cruz, Rand Paul, and Mike Lee were at the meeting as well as Senators Ben Sasse, Ron Johnson, Pat Toomey, James Risch, and Luther Strange (the Alabama Senator replacing Jeff Sessions).\nSenators Paul and Lee have vocally opposed Ryan’s bill, while other senators in the group continue to signal their concerns behind closed doors.\nThe meeting was described as a “constructive discussion” by a Senate aide, but described the White House as still in “selling mode” on the bill.\nSenior White House aides were clear that the bill could not simply be a Obamacare repeal without some kind of replacement element, according to a Senate aide familiar with the details of the meeting.\nSome senators were skeptical that Ryan’s bill, as written, could survive the reconciliation process in the Senate, and would require big changes if it passed the House.\n“In all likelihood, Majority Leader McConnell will have to totally rewrite the bill,” a Senate aide predicted to Breitbart News.\nSome elements of Ryan’s bill — such as the 30% surcharge for failing to maintain insurance coverage, changing insurance regulations, and the effort to defund Planned Parenthood — face a tough hurdle in the Senate because of the Byrd Rule.\nThe Byrd Rule allows the Senate Parliamentarian to decide what elements of the budget reconciliation bill can be considered “budget related.” But the parliamentarian can be overruled by the Vice President or the Senate majority, a rare occurrence. Some Senators critics believe that if they do act to overrule the parliamentarian, they might as well have a bill that includes more of what conservatives want.\nCruz detailed the process in a Politico op-ed, but many senators would likely be uncomfortable with that option.\nSen. James Lankford said in a statement after the meeting that he wanted the plan to comply with the Senate rules.\n“Today’s meeting at the White House focused on the repeal and replacement of Obamacare in a way that provides a smooth transition to lower costs and better coverage options for everyone,” Lankford said in a statement after the meeting. “We also discussed how a replacement plan can comply with complicated, but necessary, Senate rules.”\nPresident Trump was not at the meeting, but Vice President Mike Pence made an appearance. The White House declined to comment on any details of the meeting.","url":"https://www.breitbart.com/politics/2017/03/15/senate-critics-of-paul-ryan-healthcare-bill-sound-alarm-at-the-white-house/"}
