{"authors":["Dan Morain"],"date_download":"2018-10-30 22:52:11","date_modify":"2018-10-30 22:52:11","date_publish":"2018-07-15 00:00:00","description":"The Senate goes digital, Steve Poizner's GOP donors, high speed rail in Fresno, recycled carpet, congenital syphilis in California, taxes and auto rules.","filename":"data/vaneerConsumption/SenategoesdigitalGOPforPoiznerhighspeedrail.json","image_url":"https://calmatters.org/wp-content/uploads/Screen-Shot-2018-07-15-at-9.55.22-AM-e1539739541322.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_newsletters__1540939931.html","title":"Senate goes digital, GOP for Poizner, high-speed rail","title_page":"Senate goes digital, GOP for Poizner, high-speed rail | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Senate goes digital, GOP for Poizner, high-speed rail\nGood morning, California. Less than three weeks til Election Day. Your CALmatters voter guide awaits.\n“I’m only running for the House, but I’m honored to be asked the question.”—Congressman Adam Schiff, the Los Angeles-area Democrat and regular on cable news shows, answering a Los Angeles Times reporter’s question about whether he’s running for president.\nThe U.S. Senate enters the computer age\nU.S. Sen. Dianne Feinstein and state Sen. Kevin de León.\nThis big news about the race for U.S. Senate this week wasn’t that Sen. Dianne Feinstein entered the final days of the 2018 campaign with $4 million in the bank.\nNor was it that her coffer is almost 10 times fatter than the $426,000 of her challenger, California state Sen. Kevin de León.\nthan the $426,000 of her challenger, California state Sen. Kevin de León. Or that she has raised $8.6 million this year and loaned her campaign $8 million. Or that de León, who has no personal wealth, has raised $1.5 million. None of that was a surprise. Feinstein has had a fundraising advantage over her challenger.\nIt was that the Senate surrendered to the digital age, finally. U.S. senators and Senate candidates were required to file their campaign finance reports online for the first time, ending the Senate’s stubborn refusal to make its members disclose their funding electronically, giving the public ready access to their campaign finance filings.\nPresident Donald Trump signed legislation on Sept. 21 that included a provision requiring that senators and Senate candidates file their reports online, as candidates and incumbents in races for president and the House of Representatives long have done.\nClean-government advocates led by Issue One pushed for the change.\nIssue One executive director Meredith McGehee: “This is a down payment on disclosure, and we believe it is a harbinger of more bipartisan work in the future.”\nFeinstein advocated online filing and voluntarily filed her reports with the Federal Elections Commission online, as did U.S. Sen. Kamala Harris. De León did not file his initial reports electronically, instead delivering paper versions to the U.S. Senate. He complied with the new requirement on Monday.\nFor a reminder of how wasteful the old system was, click here .\nAnd for CALmatters’ election guide look at the Feinstein-de León race, click here.\nAdvertisement\nIt's time to make behavioral health solutions a top priority in California.\nIndependent candidate, GOP cash\nSteve Poizner, candidate for Insurance Commissioner.\nInsurance commissioner candidate Steve Poizner is shunning partisanship in his bid to become the first no-party-preference candidate to win statewide office in California.\nBut the former Republican has returned to people he knows best when it comes to raising money: Republicans.\nPoizner was a Republican when he was elected insurance commissioner in 2006, and when he ran for governor in 2010. Then, he ran to the right of billionaire Meg Whitman, who defeated him before losing the general election to Jerry Brown.\nHe dropped his old registration before embarking on the current campaign: “I really really want to stay out of partisanship. … If I can win, that will open the door to lots of other people who will run for office. That will be a great thing.”\nThe numbers:\nThe wealthy tech entrepreneur has given his own campaign more than $1 million .\n. He raised another $1.233 million from campaign donors.\nfrom campaign donors. Of that latter sum, at least $224,000 or 18 percent has come from contributors who gave to his 2010 run for governor.\nPoizner: “The reason why my donors are mainly Republican donors is because those are the ones who I know. … But I am super-clear with all my donors. I am an independent. You might not like that. I’m running as an independent because it is a good fit for that office.”\nTo read more, click here.\nTo read more about the Insurance Commissioner race, check out our election guide.\nAdvertisement\nStrategic. Persuasive. Effective. Working at the intersection of business, politics and policy.\nFresno’s high-speed rail future?\nFresno wonders: Will high-speed rail pan out?\nSouthwest Fresno residents are the city’s poorest and sickest, and Fresno itself ranks second among all U.S. metro areas in concentrated poverty, according to a deep look by the nonprofit Center for Public Integrity .\nThe report: “To live in Southwest Fresno is to expect you’ll die up to two decades sooner than people who live a few miles away in affluent Fresno neighborhoods, a 2012 Joint Center for Political and Economic Studies report concluded.”\nA decade ago, city leaders banked on a flashy New York billionaire developer named Donald Trump to help by developing a world-class golf course called Running Horse. That didn’t pan out.\nNow, many city leaders see high-speed rail, over-budget and long-delayed, as the future.\nNot in Southwest Fresno, though, where “residents express skepticism that this speeding train is just another Running Horse, destined to fail amid political battles in which they feel like pawns, not players, their needs again unmet.”\nThe piece is part of a project that looks at a half-dozen communities “connected by their profound needs and sense of political abandonment.”\nRecycling comes at a cost\nCarpet at a recycling center in Santa Rosa.\nThe cost of carpet will rise by a dime in 2019 to 35 cents a square yard to help fund California’s still struggling carpet recycling program.\nIn 2010, the Legislature directed that carpet, then 3 percent of the waste in landfills, be recycled; 24 percent of it must be recycled by 2020. For a variety of reasons, the industry-run program has struggled to find markets for recycled carpet.\nOn Tuesday, CalRecycle’s Scott Smithline approved with caveats the carpet industry plan for increasing recycling, which includes the fee hike.\nMark Murray of the nonprofit Californians Against Waste said he intends to seek legislation in 2019 that would shift responsibility to the state. The industry has little incentive to meet ambitious goals, he said.\nCalifornia's syphilis problem, revisited\nHundreds of California babies are born with syphilis each year.\nHundreds of California babies are born with syphilis each year, suffering damaging defects or dying, CALmatters’ David Gorn reports .\nCalifornia has the nation’s third-highest rate of congenital syphilis, after Louisiana and Nevada. Kern County is especially affected, possibly due to high poverty and drug-abuse rates that can lead to a lack of health care.\nof congenital syphilis, after Louisiana and Nevada. Kern County is especially affected, possibly due to high poverty and drug-abuse rates that can lead to a lack of health care. California officials say they reach out to homeless women, women released from incarceration and those in the sex industry; they’re at high risk. So are their babies.\nIn 2017, 30 babies were stillborn because of syphilis, the California Department of Public Health reports .\nUCLA professor Jeffrey Klausner: “These are statistics we see among the poorest countries in the world.”\nCommentary at CALmatters\nDan Becker and James Gerstenzang , Safe Climate Campaign: California plays a central role setting auto rules and has a responsibility to lead the world’s fight against auto pollution. President Trump wants to revoke that unique authority. California Air Resources Board Chairwoman Mary Nichols must defend it.\nDan Walters, CALmatters : Despite very strong growth in property taxes, hundreds of local governments are asking voters to approve additional taxes. They are reluctant, however, to tell voters that rising pension costs are the major reason.\n—\nPlease email or call me with tips, suggestions and insights, dmorain@calmatters.org, 916.201.6281. Thanks for reading, please tell a friend and sign up here.\nSee you tomorrow.","url":"https://calmatters.org/articles/newsletters/senate-digital-poizner-high-speed-rail/"}
