{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:55:49","date_modify":"2018-10-30 18:55:49","date_publish":"2015-07-17 04:22:03","description":"The Senate passed its version of the reauthorization of the No Child Left Behind (NCLB) law Thursday by a vote of 81-17.","filename":"data/vaneerConsumption/SenatePassesBipartisanNoChildLeftBehindRewrite.json","image_url":"https://media.breitbart.com/media/2015/02/classroom-testing-school-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_16__1540925749.html","title":"Senate Passes ‘Bipartisan’ No Child Left Behind Rewrite","title_page":"Senate Passes ‘Bipartisan’ No Child Left Behind Rewrite | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Senate passed its version of the reauthorization of the No Child Left Behind (NCLB) law Thursday by a vote of 81-17. The approval of the Every Child Achieves Act now sends the measure to a conference with the House’s bill, which passed that chamber last week.\nThe House’s version of the NCLB rewrite, dubbed the Student Success Act, has received the threat of a veto from President Obama. An approved amendment to that bill allows parents to opt their children out of state standardized testing without penalty.\nA similar amendment to the Senate bill, offered by Sen. Mike Lee, was rejected. The Senate measure was sponsored by both the chairman of the Senate committee that overseas education, Sen. Lamar Alexander, and the ranking member Sen. Patty Murray.\nThroughout the process of preparing and debating the bill and its over 150 amendments, Alexander praised the “bipartisan” spirit and process and said his main goal was to achieve a piece of legislation that President Obama would sign into law.\nBoth Obama and Secretary of Education Arne Duncan have exerted pressure to ensure the final NCLB reauthorization requires states to continue testing students to determine their performance, a provision they see as a major part of their plan for educational justice to close the achievement gap.\nAccording to Roll Call, Alexander and Murray will begin work with House Education and the Workforce chairman Rep. John Kline.\n“We’ll get right together with Chairman Kline, and I’m in favor of moving pretty rapidly,” Alexander said.\n“I’d like to work with the House and come up with something that the president can sign pretty quickly,” Alexander said. “We want a result, and under our constitutional system that takes a presidential signature, and… we’ve stayed in touch with him.”\nAs debate on the Senate bill was brought to a close, Majority Leader Sen. Mitch McConnell applauded “another bipartisan achievement for our country and a long overdue win for our kids.”\nPresidential candidates Sen. Ted Cruz, Sen. Rand Paul, and Sen. Marco Rubio all voted against the bill. Sen. Lindsey Graham did not vote.","url":"https://www.breitbart.com/politics/2015/07/16/senate-passes-bipartisan-no-child-left-behind-rewrite/"}
