{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:19:54","date_modify":"2018-10-30 19:19:54","date_publish":"2015-06-02 21:07:45","description":"The Senate voted 67-32 Tuesday afternoon to pass the House’s USA Freedom Act without any of the amendments offered by Senate Majority Leader Mitch McConnell (R-KY).","filename":"data/vaneerConsumption/SenatePassesUSAFreedomActWithoutAmendmentsMovestoPresidentObamasDesk.json","image_url":"https://media.breitbart.com/media/2015/06/Senate-Votes-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_02__1540927194.html","title":"Senate Passes USA Freedom Act Without Amendments, Moves to President Obama's Desk","title_page":"Senate Passes USA Freedom Act Without Amendments, Moves to President Obama's Desk | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Senate voted 67-32 Tuesday afternoon to pass the House’s USA Freedom Act without any of the amendments offered by Senate Majority Leader Mitch McConnell (R-KY).\nThe legislation will now go to President Obama’s desk to be signed into law Tuesday evening.\nThe USA Freedom Act that was previously passed by the U.S. House of Representatives would, in effect, stop the NSA’s bulk surveillance collection and reform the programs that lapsed when the Patriot Act expired at midnight Sunday, after GOP presidential candidate, Sen. Rand Paul, filibustered the spy program for 11 hours.\nThe first amendment that failed to pass was the McConnell-Burr amendment. According to the Guardian, this amendment would “Change the amicus on the Fisa court – the public-interests advocate who would argue, in part, about civil liberties concerns to the secret court that oversees many surveillance programs.”\nMcConnell and Senate Intelligence Committee Chairman Sen. Richard Burr (R-NC) wanted an amendment to the USA Freedom Act that extends the time for the government to transfer custody of phone records to private telecom companies from six months to 12 months.\n“McConnell has also filed amendments that would require the US intelligence chief to certify the implementation of the new phone-records regime, demand notification of changes made by telecom companies to the kinds of call records they generate and reduce transparency in the process by which the secret Fisa court reviews the government’s surveillance orders,” the Guardian reported.\nHowever, the Guardian correctly predicted it was unlikely that McConnell’s amendments would pass, as they lacked support from both Republicans and Democrats.\nSen. Diane Feinstein (D-CA) said prior to the final vote, “I think it should be passed as is if we want to get it back in operation, and I think it’s foremost that this be operable.” She suggested she might be open to amendments in the future. “We could amend it … but we need to get this done now.”\nSen. Dean Heller (R-NV) — a co-sponsor of the USA Freedom Act — told reporters early Tuesday he doesn’t want to see any amendments.\n“I don’t want the program to go away, but I think the USA Freedom Act is the correct way to go,” Heller said. “If you amend the kill, you kill the bill.”\nPaul and Sen. Bernie Sanders (I-VT) – both presidential candidates – previously said they do not support the USA Freedom Act, because it didn’t go far enough in stopping the NSA’s bulk surveillance collection.\nThe legislation comes roughly two years after Edward Snowden’s revelations about the NSA program.","url":"https://www.breitbart.com/politics/2015/06/02/senate-passes-usa-freedom-act-without-amendments-moves-to-president-obamas-desk/"}
