{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:23:22","date_modify":"2018-10-30 19:23:22","date_publish":"2015-02-26 14:35:47","description":"Outgoing Sen. Barbara Boxer (D-California) both praised and chastised fellow Democrat and Secretary of State John Kerry during Tuesday's Senate Foreign Relations Committee hearing. On Iran, Boxer said point-blank that Iran cannot be trusted \"for one second.\" She then went on to clarify her belief that while the people of Iran could be trusted, the government and regime cannot be. |","filename":"data/vaneerConsumption/SenBoxerIranCannotBeTrustedForOneSecond.json","image_url":"https://media.breitbart.com/media/2015/01/boxer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_26__1540927402.html","title":"Sen. Boxer: Iran Cannot Be Trusted 'For One Second'","title_page":"Sen. Boxer: Iran Cannot Be Trusted 'For One Second' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Outgoing Sen. Barbara Boxer (D-California) both praised and chastised fellow Democrat and Secretary of State John Kerry during Tuesday’s Senate Foreign Relations Committee hearing.\nOn Iran, Boxer said point-blank that Iran cannot be trusted “for one second.” She then went on to clarify her belief that while the people of Iran could be trusted, the government and regime cannot be.\nSen. Robert Menendez (D-NJ), who is the co-sponsor of a bipartisan bill to impose new sanctions on Iran if negotiations fail, raised concerns over whether Kerry and the Obama Administration’s projected 10-year deal on nuclear talks is actually a 5-year deal as “the core idea would be to reward Iran for good behavior over the last five years by easing their ability to pursue enrichment capabilities and sanctions.”\nMenendez added that “if that is out there in the universe, then it is really problematic,” and that “a deal that allows Iran to continue as a nuclear threshold state…and allows it go from threshold to nuclear state, is no deal at all.”\nYet, throughout the hearing Kerry would not confirm whether the United States would commit to maintaining sanctions on Iran. Sen. Cory Gardner (R-CO) asked Kerry about this commitment, to which Kerry replied that he did not want to be bound to a definitive answer at that moment because he did not know how the situation would proceed. “I don’t know where we [will] wind up.”\nBoxer, who will retire after 2016, stated that she agreed with President Barack Obama’s policies toward the “Islamic State” (or ISIS, ISIL, Daesh). Boxer said that the president had “beautifully stated”, in her opinion, his “crystal clear policy” that U.S. military forces will not be deployed to conduct conduct ground combat operations against ISIL and that it will “be the responsibility of local forces.”\nHowever, Boxer told Kerry that she was concerned that the administration’s new requested Authorization for the Use of Military Force (AUMF) had “a giant loophole you can drive a combat truck through” with regard to a potentially expanding war, and predicted that “it is not going to get a lot of support among, I think, the Democrats on this committee.”\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/national-security/2015/02/26/sen-boxer-iran-cannot-be-trusted-for-one-second/"}
