{"authors":["Jack Montgomery"],"date_download":"2018-10-30 18:31:57","date_modify":"2018-10-30 18:31:57","date_publish":"2018-06-26 07:54:50","description":"Marine Le Pen has warned the EU is 'immigrationist' and argued boat migrants should be returned to Africa.","filename":"data/vaneerConsumption/SendMigrantBoatsBacktoAfrica.json","image_url":"https://media.breitbart.com/media/2017/04/Marine-Le-Pen-1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_26__1540924317.html","title":"Send Migrant Boats Back to Africa","title_page":"Le Pen: Send Migrant Boats Back to Africa","title_rss":"NULL","source_domain":"breitbart.com","text":"National Rally leader Marine Le Pen has warned that the EU is ‘immigrationist’ and cannot be trusted to control Europe’s borders, and says illegal migrants trying to cross the Mediterranean should be sent back to Africa.\nThe veteran campaigner was defeated by globalist poster boy Emmanuel Macron in France’s 2017 presidential elections, but was estimated to have won almost half of the youth vote and around two-thirds of the working-class vote, and was returned to the National Assembly as the representative for the Pas-de-Calais shortly afterwards.\nAfter reforming and rebranding the old Front National as the National Rally, she has reemerged as an active voice against Macron, whose popularity has declined precipitously since his election.\nLe Pen used her recent FranceInfo interview to attack the French president for denouncing the populist movements rising across Europe in general and Italy in particular as a kind of “leprosy”, saying his comments “insult not only tens of millions of Europeans but rulers of countries of the European Union”.\nMacron Attacks Italy’s New Govt, Warns Euroscepticism Is Spreading ‘Like Leprosy’ https://t.co/Di5XrjZ2q7 — Breitbart London (@BreitbartLondon) June 22, 2018\nLe Pen praised Matteo Salvini, who leads the nationalist Lega party which makes up one half of Italy’s new populist coalition government, for being “the first to say ‘no'” to the immigration policies of a European Union which she described as being “in full implosion”.\nShe backed Salvini’s decision to close Italy’s ports to NGO ‘rescue’ ships collecting migrants from a few miles off the North African coast and ferrying them to distant European harbours, noting that 80 percent of Italians support the measure and recommending that migrants should be taken “back to their port of departure in Libya”.\nSuch a policy has been successfully operated by Australia for some years, which was another popular destination for boat-borne illegal migrants — many of whom drowned on the way — until the government made it their policy to turn back any and all boats, either sending them back the way they came of dropping them off for processing in third countries.\nFmr Oz PM Abbott Tells EU: Seal Your Borders And Be Honest Over Scale Of Migrant Invasion https://t.co/cyHeWOwK62 pic.twitter.com/bgH14LNfHj — Breitbart London (@BreitbartLondon) September 18, 2016\nLe Pen argued that the key to resolving the current crisis is not more European Union involvement, but the return of immigration to national control, and the abolition of the borderless, intra-EU Schengen area once denounced as “effectively an international passport-free zone for terrorists” by Interpol chief Robert Noble.\n“The European Union, in reality, wants heavy immigration to EU countries,” she explained.\n“To entrust [the EU] to fight against immigration does not seem reasonable to me.”\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/06/26/le-pen-pro-migration-eu-border-send-back-migrant-boats/"}
