{"authors":[],"date_download":"2018-10-23 05:17:44","date_modify":"2018-10-23 05:17:44","date_publish":"2015-07-16 00:00:00","description":"The Democrat says she supports the nuclear deal world powers struck with Iran this week. She notes that Iran stuck to the interim agreement, and says the pact's critics haven't offered other options.","filename":"data/vaneerConsumption/SenFeinsteinOnIranDealsCriticsWhatIsTheirAlternative.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_07_16_423435129_sen-feinstein-on-iran-deals-critics-what-is-their-alternative_1540271864.html","title":"Sen. Feinstein On Iran Deal's Critics: 'What Is Their Alternative?'","title_page":"Sen. Feinstein On Iran Deal's Critics: 'What Is Their Alternative?' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Sen. Feinstein On Iran Deal's Critics: 'What Is Their Alternative?'\nThe Democrat says she supports the nuclear deal world powers struck with Iran this week. She notes that Iran stuck to the interim agreement, and says the pact's critics haven't offered other options.\nRENEE MONTAGNE, HOST:\nWith the Iran nuclear deal reached in Vienna, its fate now moves to Capitol Hill in Washington, D.C. Members of Congress will be pouring over the details in the coming weeks. President Obama has already said he will veto any rejection by Congress, but that threat hasn't stopped lawmakers from expressing fierce opposition to the deal. Here's Republican presidential hopeful Sen. Lindsey Graham last night on All Things Considered.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nLINDSEY GRAHAM: If I'm president of the United States, we're going to re-impose sanctions until they change their behavior. I would stop this deal. I would tell our allies America's not going to be part of empowering a radical Islamic regime with more money, more weapons and create a nuclear arms race. We're not going down that road.\nMONTAGNE: That's the opposition. Now let's hear from one of the most powerful voices in support of the Iran nuclear deal, Sen. Dianne Feinstein. She is the most senior Democrat on the Senate Intelligence Committee. Sen. Feinstein joined us from her office to talk about what she likes about the deal. Welcome.\nDIANNE FEINSTEIN: Thank you.\nMONTAGNE: Now, you are known for being strong on national security. You've backed the tough sanctions that are credited with getting Iran to the table. What are the key elements of this deal that make you support it?\nFEINSTEIN: This isn't an agreement just between the United States and Iran. These are the big powers. And in fact, from what I've learned, both Russia and China at key times were very helpful in putting this together. So you have the big powers of the world essentially saying we believe that this will end the nuclear weapons pursuit, where it's possible for Iran to become a more active partner for peace and goodwill, and I very much believe that.\nMONTAGNE: Well, though, let me ask you, do you trust that the Iranians will do what they've agreed to do?\nFEINSTEIN: Well, it's not an issue of trust with me. This has not been put together slapdash. This has taken almost two years to negotiate. And in fact, the interim agreement has lasted for a year and a half. And many people thought Iran would not carry out that agreement without cheating. Iran has carried out that agreement, and I know that from our intelligence people. So I think this indicates that the government of Iran, particularly the president and this foreign minister, Javad Zarif, do want to move the country in a more moderate direction. Now, they have the same problem that we do on our right wing, so we'll have to wait and see how that works out. You've got to realize we've had political people spouting off even before the 150 pages came out. And so even a country, Israel, they knew what they were going to say before this agreement was made public. And I think the agreement ought to be given an opportunity to be sustained.\nMONTAGNE: You know, you mention people coming out before - opponents, critics coming out before the final deal was released. Among them was Prime Minister Benjamin Netanyahu, Israeli prime minister. His first reaction was that Israel is not bound by this deal - pretty strong words from an important ally. What do you make of that?\nFEINSTEIN: Well, I've been very disappointed in Israel's position, candidly. I don't think they have given this agreement even a chance. They have been opposed to any agreement for a long, long time. Secondly, if Israel were to attack Iran, Iran would respond. The Middle East today is the most troubled it's been in my lifetime, and I have followed this closely. And so the survival of the state of Israel as a Jewish democratic state depends on all of us supporting an Israel that wants to solve problems, not make more problems.\nMONTAGNE: Surveillance and inspections are really key to this. Are you comfortable with the fact that this agreement does not specify access anywhere, any time? I mean, is that good enough?\nFEINSTEIN: Well, let me say what the inspections do. The International Atomic Energy Agency would have 24-7 access to all of Iran's uranium mines and mills for 25 years and Iran's centrifuge production and storage facilities for 20 years. And we have the technical means that if highly-enriched uranium is used in a bomb, it will be detected because we have greatly improved technical means. I won't go into them, but we have them.\nMONTAGNE: Well, what would you tell your colleagues in Congress, who will be spending the next 60 days reviewing this final agreement - what would you tell them to keep in mind?\nFEINSTEIN: What I would tell them to keep in mind is what is their alternative? I heard one this morning on television saying well, we have a bomb that could take this stuff out. Well, then what? What is Iran going to do once attacked by the United States? I don't believe that Iran is going to stand by. I believe that we then throw the whole Middle East into very serious jeopardy.\nMONTAGNE: Sen. Dianne Feinstein of California, thank you very much.\nFEINSTEIN: Happy to do it, thanks.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/07/16/423435129/sen-feinstein-on-iran-deals-critics-what-is-their-alternative"}
