{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:42:59","date_modify":"2018-10-30 18:42:59","date_publish":"2016-09-26 16:52:03","description":"A senior Egyptian intelligence official derided Palestinian President Mahmoud Abbas to one of his main rivals in a newly leaked phone call.","filename":"data/vaneerConsumption/SeniorEgyptianOfficialMocksCamelAbbasForStupidity.json","image_url":"https://media.breitbart.com/media/2016/09/mahmud-abbas.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_26__1540924979.html","title":"Senior Egyptian Official Mocks 'Camel' Abbas For 'Stupidity'","title_page":"Senior Egyptian Official Mocks 'Camel' Abbas For 'Stupidity'","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A senior Egyptian intelligence official derided Palestinian President Mahmoud Abbas to one of his main rivals in a newly leaked phone call, saying the Palestinian Authority chief is a “camel” who is old and stupid, and the Fatah party is “screwed” under his leadership.\nMajor General Wael el-Safty, an officer in Egypt’s General Intelligence Directorate in charge of Palestinian affairs, made the comments during a conversation with Fatah’s exiled politician Mohammad Dahlan, the Middle East Eye reported.\nIn the call, which was broadcast on Egypt’s Mekameleen TV, Safty can be heard saying that Abbas’ “concentration isn’t at full capacity” and he “has nothing to offer.”\n“You told me something I still remember to this day,” Safty tells Dahlan. “You said that he [Abbas] is like a camel” because he regurgitates old ideas.\nSafty mocks Abbas’ age, saying the 81-year-old PA leader doesn’t have many laps left to run.\n“The track is running out, if you excuse the phrase,” Safty says.\n“He isn’t smart at all,” the Egyptian intelligence officer is heard saying. “The issue of [Abbas’] age also comes into it. … He doesn’t want to change, he doesn’t want to do anything.”\nSafty then moves on to to speak about the future of the Palestinian leadership.\n“Fatah is completely screwed,” he says. “The [Palestinian Liberation] Organisation is even worse.”\n“He can’t even contain the factions [within Fatah],” he says. “These are the ones that Abu Mazen couldn’t contain, these people drove me absolutely crazy, their positions have begun to align with Hamas,” Safty says, referring to Abbas using his nom de guerre.\n“He can’t bring them together,” Safty continues. “I swear, he can’t bring them together.”\nOnly Safty’s side of the conversation is heard in the leaks.\nDahlan was one of Fatah’s foremost officials in the Gaza Strip before Hamas’ takeover in 2007. He was ousted from the party in 2011 following allegations of corruption and murder, and now resides in the United Arab Emirates.\nDahlan, who according to the report was part of a joint Jordanian-Egyptian-UAE plan to replace Abbas as leader of the PA, allegedly triggered an arms race in areas where the former strongman is still supported.\nHowever, according to the Times of Israel, in recent months Abbas and Dahlan have been engaged in reconciliation talks in an attempt to prevent Hamas gaining power ahead of elections in the West Bank and Gaza.","url":"https://www.breitbart.com/middle-east/2016/09/26/senior-egyptian-official-mocks-camel-abbas-for-stupidity-says-fatah-is-screwed/"}
