{"authors":["Hugo Duncan For The Daily Mail"],"date_download":"2018-10-22 22:30:47","date_modify":"2018-10-22 22:30:47","date_publish":"2017-03-10 00:52:56","description":"The future role of Charlotte Hogg, 46, the most senior female chief at the Bank of England is in doubt after she misled Parliament over her brother Quintin Hogg's links to Barclays.","filename":"data/vaneerConsumption/SeniorfemaleBankofEnglandchiefmisledMPs.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3D02871D00000578-0-image-a-69_1489107127961.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299592_Senior-female-Bank-England-chief-misled-MPs_1540247447.html","title":"Senior female Bank of England chief misled MPs","title_page":"Senior female Bank of England chief misled MPs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Bank of England was locked in crisis talks yesterday over the future of its most senior woman after she misled Parliament over her family links to Barclays.\nCharlotte Hogg, a close ally of Governor Mark Carney, did not reveal where her brother Quintin Hogg worked when she joined the central bank as chief operating officer in 2013.\nThe 46-year-old also failed to disclose his job at Barclays – a lender she now regulates – when she was promoted to deputy governor for markets and banking this month.\nThe Bank of England engaged in crisis talks over the future of its most senior woman, Charlotte Hogg (pictured) after she misled Parliament over her brother Quintin Hogg's links to Barclays\nThe failure to declare the link means she broke the Bank’s own code of conduct – a set of rules she helped write.\nIn a grave embarrassment to Miss Hogg and the Bank, she then misled Parliament last week when she told MPs on the Treasury committee scrutinising her promotion that she had disclosed all possible conflicts of interest.\nMiss Hogg – the most powerful woman at the central bank and daughter of former Cabinet minister Douglas Hogg, the third Viscount Hailsham – offered her ‘sincere apologies’ for her ‘oversight’.\nBut early this week Labour MP John Mann, a member of the committee, called for her to resign.\nMPs on the Treasury committee met again yesterday to discuss her future at the Bank.\nIt is thought they will release a statement on their position next week.\n‘It is not looking good for her,’ one member of the committee told The Financial Times. ‘She has been hoist by her own petard.’\nSenior staff at the Bank are also said to have held meetings yesterday to decide how to respond to the MPs – and discuss whether Miss Hogg should stand down to preserve the reputation of the 323-year-old institution.\nThe row casts a shadow over the career of one of the most powerful women in the City of London who has been tipped to become the Bank’s first female governor when Mr Carney leaves in 2019.\nIt is particularly humiliating for Miss Hogg after she last week told MPs concerned about a potential conflict of interest: ‘I have always declared, from the moment I joined the Bank, all of my potential conflicts of interest.’\nThe married mother of two even added: ‘I am in compliance with all of our codes of conduct. I know that. I helped to write them.’\nThe 46-year-old banking chief failed to disclose her brother's ties in 2013, Quintin Hogg also worked at Barclays when she joined as chief operating officer\nIt is also an embarrassment for Mr Carney who described Ms Hogg as ‘the ideal person’ for the job as deputy governor on her appointment.\nThe Bank declined to comment last night.\nBut earlier this week, Bradley Fried, the deputy chairman of the Court of the Bank of England, insisted Miss Hogg’s mistake was ‘terribly unfortunate’ but not ‘a hanging offence’.\nThe Treasury committee cannot force Miss Hogg to resign.\nBut its verdict on her suitability for the job could make her position untenable.\nMiss Hogg is from a family of high-flyers and establishment grandees.\nHer husband, Steve Sacks, is chief customer officer at Burberry. They live with their two children in London.\nHer father was a Cabinet minister under John Major and later hit the headlines during the MPs’ expenses scandal when it was alleged he claimed £2,200 of taxpayers’ money to have the moat cleaned at the family home, Kettlethorpe Hall in Lincolnshire.\nHis father and grandfather both served as Lord Chancellor.\nMiss Hogg’s mother, economist Sarah Hogg, a baroness in her own right, was head of the Downing Street policy unit under Major before becoming the first female chairman of a FTSE 100 company when she took the helm at private equity firm 3i.\nNow the Bank of England is now deciding her future with the central bank. Miss Hogg – the most powerful woman at the central bank and daughter of former Cabinet minister Douglas Hogg, the third Viscount Hailsham – offered her ‘sincere apologies’ for her ‘oversight’\nBaroness Hogg’s father was chief secretary to the Treasury and Paymaster General while her grandfather was a Tory MP.\nMiss Hogg was educated at £35,000 a year St Mary’s School, Ascot, and studied economics and history at the University of Oxford.\nShe also studied at Harvard University in the United States before joining the Bank as a graduate trainee in 1992.\nMiss Hogg went on to work for management consultant McKinsey, investment bank Morgan Stanley, business data firm Experian and Spanish-owned lender Santander before returning to the Bank in 2013 when she was made its first chief operating officer.\nShe as replaced Minouche Shafik as deputy governor, earning around £350,000 a year including a basic salary of £270,000 and pension contributions of £80,000.\nMiss Hogg is one of four deputy governors at the Bank – serving alongside Ben Broadbent, Sir Jon Cunliffe and Sam Woods.\nBut as chief operating officer she remains in charge of the day-to-day running of the institution as well as sitting on crucial committees that are responsible for setting interest rates and preventing another financial crisis.","url":"https://www.dailymail.co.uk/news/article-4299592/Senior-female-Bank-England-chief-misled-MPs.html"}
