{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:41:35","date_modify":"2018-10-30 21:41:35","date_publish":"2015-04-07 15:28:16","description":"After weeks of pushing fundraising pleas to potential re-election supporters, Senator John McCain has announced he will seek another six years in the U.S. Senate. |","filename":"data/vaneerConsumption/SenJohnMcCainWillRunAgain.json","image_url":"https://media.breitbart.com/media/2015/02/mccain2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_07__1540935695.html","title":"Sen. John McCain Will Run Again","title_page":"Sen. John McCain Will Run Again | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After weeks of pushing fundraising pleas to potential re-election supporters, Senator John McCain has announced he will seek another six years in the U.S. Senate.\nIn a statement released late Monday, McCain acknowledged he’ll probably face a primary challenger and would be 86 by the time his next term expires.\nMcCain told NBC’s Kelly O’Donnell that he’s “just getting started” in the Senate, a declaration not likely to sit well with his critics. “Watch me. Take a look at my 18-hour days. Take a look at the hearings we have. Take a look at my legislative accomplishments,” he offered as a defense for his advanced age.\nIn 2014, the Arizona Republican Party formally censured McCain for being too liberal. Responding to his critics, McCain made the smug joke, “I was also censured by Vladimir Putin.” The comment also alludes to the issues McCain will likely focus on in his bid to hold on to his seat, national security. In light of a potential challenger, McCain said, “I will stand on my record.”\nThat challenger pool is looking formidable. State Senator Kelli Ward has surfaced as a “rising star” in the future of Arizona politics, according to Republican Club of Kingman President Larry Schiff. A medical doctor and military wife, Ward has garnered support from both conservatives and more libertarian leaning voters. In an exclusive interview with Breitbart News, Ward addressed a potential run for McCain’s seat, “It’s time for the next generation of leadership to come in and to put America back on the right path.”\nO’Donnell referenced a 2010 McCain campaign ad pledge to “build the danged fence,” to which McCain replied, “I have always, always emphasized the need for border security.” However some suggest those words have no teeth. Ward pointed out in the Breitbart interview “there is no danged fence!”\nU.S. Representative from Arizona Matt Salmon has also been rumored a potential McCain challenger though he has yet to address that potential. In March, a source close to Salmon told Breitbart’s Matthew Boyle of a potential Salmon Senate run, that he “had a lot of people encourage him to take a hard look at this seat and that’s what he’s doing.”\nAccess to healthy campaign war chest residual funds from his failed 2008 Presidential bid helped McCain overcome primary challenger J.D. Hayworth in 2010, the year he ran the ‘danged fence’ ad. A repeat of that feat may be tough given a $2 million balance, noted in the Washington Post, according to a 2014 year end FEC report.\nThe weakened position was reflected in March fundraising pleas in which McCain told potential supporters he faces a “unique set of challenges.” He also wrote, “I’m going to be the target of a wide array of powerful groups,” going on to push, “our nation is now in greater danger than at any time in our lives.” He called contributions, “much needed.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/04/07/sen-john-mccain-will-run-again/"}
