{"authors":["Caroline Burke"],"date_download":"2018-10-31 01:42:19","date_modify":"2018-10-31 01:42:19","date_publish":"2018-08-28 01:42:19","description":"In the months leading up to his passing, the late Senator John McCain and Donald Trump weren't exactly on good terms. So it might not have come as a surprise that the drama continued after McCain's death, when Trump drew criticism for his slowness…","filename":"data/vaneerConsumption/SenJimInhofeClaimsJohnMcCainIsPartiallyAtFaultForTheWhiteHouseFlagIssue.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/fbf6a6f7-c723-4afc-bc26-8d4d9f3b608e-getty-812602996.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_sen-jim-inhofe-claims-john-mccain-is-partially-at-fault-for-the-white-house-flag-issue-10258235_1540950139.html","title":"Sen. Jim Inhofe Claims John McCain Is \"Partially\" At Fault For The White House Flag Issue","title_page":"Sen. Jim Inhofe Claims John McCain Is \"Partially\" At Fault For The White House Flag Issue","title_rss":"NULL","source_domain":"bustle.com","text":"In the months leading up to his passing, the late Senator John McCain and Donald Trump weren't exactly on good terms. So it might not have come as a surprise that the drama continued after McCain's death, when Trump drew criticism for his slowness in ordering the White House flag to fly at half-staff. But not all lawmakers are placing the blame exclusively on Trump's shoulders: on Monday afternoon, Senator Jim Inhofe said McCain was \"partially\" at fault for the White House flag issue, because of his treatment of Trump in the past.\nOn Monday, Inhofe told reporters that McCain was \"partially to blame\" for the White House's delay in establishing a half-staff flag, because \"he disagreed with the president in certain areas and wasn't too courteous about it.\" Via Ashley Killough, a CNN reporter, Inhofe added that McCain and Trump were alike in that they were \"both very strong willed people.\"\nHowever, Inhofe was also quick to add that McCain was, in his opinion, a \"hero.\" But when asked what he thought about Trump refusing to call McCain a \"hero,\" Inhofe simply replied, \"Oh, let them have their thing. I have no opinions about that. He was my hero.\"\nThe controversy around Trump's delay in issuing a statement to lower the flags is kind of confusing. But according to Slate, he didn't technically do anything wrong: the country's U.S. flag code states that a flag has to be lowered when a member of Congress dies, and it must stay at half-staff on the day of death as well as the day after the death.\nHowever, for anything after that, it's up to the discretion of the president, governors, or mayor of Washington, D.C. to decide whether or not the flag should stay at half-staff. So when the flag was raised all the way up on Monday morning, Trump may have been breaking tradition (in the past, Slate notes that presidents have extended the length of half-staff flag flying for notable politicians like McCain), but he wasn't breaking any rules.\nOn Monday at noon, the American Legion, a U.S. war veterans' association, released a statement asking Trump to lower the flag. The statement read,\n\"The American Legion urges the White House to follow long-established protocol following the death of prominent government officials...John McCain was an American hero and cherished member of the American Legion.\nOn behalf of the American Legion's two million wartime veterans, I strongly urge you to make an appropriate presidential proclamation noting Senator McCain's death and legacy of service to our nation, and that our nation's flag be half-staffed through his internment.\"\nC-SPAN on YouTube\nTrump issued a statement demanding the lowering of the flag shortly after. Now, all government American flags will stay at half-staff until after McCain's internment, AKA his burial.\nMcCain was notably one of the only Republican politicians to repeatedly and consistently stand up to Trump in the years leading up to his death. Perhaps his greatest standoff was when he cast a vote against Trump's proposed replacement to the Affordable Care Act last July.\nAfter making his iconic vote, McCain later said in a public statement, “We must now return to the correct way of legislating and send the bill back to committee, hold hearings, receive input from both sides of the aisle, heed the recommendations of nation’s governors, and produce a bill that finally delivers affordable health care for the American people. We must do the hard work our citizens expect of us and deserve.”","url":"https://www.bustle.com/p/sen-jim-inhofe-claims-john-mccain-is-partially-at-fault-for-the-white-house-flag-issue-10258235"}
