{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 21:37:42","date_modify":"2018-10-30 21:37:42","date_publish":"2016-10-06 17:47:41","description":"Sen. Jeff Sessions tells radio talk show Howie Carr he's lost confidence in FBI Director James B. Comey Jr. | Politics","filename":"data/vaneerConsumption/SenJeffSessionsSenateMustInvestigateFBIsBreathtakingDestructionofEvidenceImmunitytoCherylMills.json","image_url":"https://media.breitbart.com/media/2016/07/Sessions3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_06__1540935462.html","title":"Sen. Jeff Sessions: Senate Must Investigate FBI's 'Breathtaking' Destruction of Evidence, Immunity to Cheryl Mills","title_page":"Sen. Jeff Sessions: Senate Must Investigate FBI's 'Breathtaking' Destruction of Evidence, Immunity to Cheryl Mills | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Jeff Sessions tells radio talk show Howie Carr he’s lost confidence in FBI Director James B. Comey Jr.\nThe Alabama Republican adds that he thinks the Senate should investigate how the FBI granted immunity to Clinton Foundation director Cheryl Mills and destroyed evidence under congressional subpoena.\n“I was a U.S. attorney and an assistant U.S. attorney before that and I have been through a lot of these issues,” Sessions says.\nSessions said when he was a Department of Justice lawyer, he worked regularly with FBI agents and he was always impressed by their professionalism and their apolitical approach to their work.\n“I love the FBI,” he said.\nBut, now after witnessing the extraordinary handling of evidence, witnesses involved in the scandal surrounding Hillary Clinton’s private email scheme and her handling of classified electronic correspondence, he is forced to reassess, he said.\nClinton is the Democratic nominee for president and Comey announced July 5 that he was recommending to the Department of Justice that she not be prosecuted in regard to the scandal.\n“This is scary to me,” Sessions tells Carr. “I tried not to be critical of Comey at first.”\nSessions said the more he learns about Comey and the FBI’s operating outside of the bureau’s regular practices, the more concerned he becomes.\nWhile the House of Representatives has made an effort to investigate Comey and the FBI’s behavior in the Clinton email scandal, the Senate needs to get involved also, he said.\nCentral to the FBI’s mismanagement of the scandal investigation is their preferential treatment of Mills, he said. Mills was Clinton’s chief of staff at the State Department, an attorney in the administration of her husband President William J. Clinton and is now a member of the Clinton Foundation’s board of directors.\nHowie Carr asked Sessions how is it that the former first lady could have Mills treated by the FBI and the Department of Justice as her attorney, while Clinton also had another team of lawyers from Williams and Connolly.\nThe efforts to cover up and protect everyone involved in the email scandal were blatant, Carr said. “Richard Nixon never dreamed of doing things like this.”\nThe Alabama senator said that benefit given to Mills was not justified.\n“It is really unhealthy,” the senator said.\n“She should not be treated as a legitimate lawyer–she surely had a conflict of interest,” he said. As it is understood in the Common Law, attorney-lawyer privilege protects communications between a lawyer and his client. But, there are limits on the privilege, so that it cannot be used to obstruct an investigation into a past or ongoing crime.\nMills and the FBI set up an investigation process, where Mills was in a position to know everything that was going on as both a potential target, witness and attorney, who was granted privilege with other targets and witnesses and allowed to attend interviews between the FBI and other potential targets and witnesses.\nSessions told Carr: “I don’t see how it is possible for someone so involved in a case that they refuse to provide testimony and information without a grant of immunity.”\nMills must know she is in legal jeopardy, he said.\n“That suggests that they think a truthful and or a truthful production of documents could incriminate them–and then, she turns around and is the lawyer for another possible co-conspirator in this activity?” he asked.\n“It is a breathtaking thing,” the senator said.\nSessions said Mills, who was Clinton’s chief of staff at the State Department, then was granted attorney-lawyer privilege in regards to relationship with Clinton and was allowed to participate in FBI interviews with other individuals involved in the email scandal.\n“I really don’t see how Congress can issue a subpoena for records and they then destroy those records,” he said.\n“I am telling you that every business knows that if they get a subpoena for business records, and they destroy those records, they are subject to criminal prosecution and will be prosecuted,” Sessions said. “That’s a high prosecution case.”","url":"https://www.breitbart.com/politics/2016/10/06/sen-jeff-sessions-blasts-fbi-destroying-evidence-granting-mills-immunity-its-breathtaking/"}
