{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:51:33","date_modify":"2018-10-30 21:51:33","date_publish":"2017-01-21 17:42:02","description":"Sen. Lamar Alexander, HELP chairman, says that he is delaying the initial vote on Besty DeVos, education secretary nominee.","filename":"data/vaneerConsumption/SenLamarAlexanderDelaysVoteonBetsyDeVos.json","image_url":"https://media.breitbart.com/media/2017/01/Betsy-DeVos-at-Senate-Hearing-AP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_21__1540936293.html","title":"Sen. Lamar Alexander Delays Vote on Betsy DeVos","title_page":"Sen. Lamar Alexander Delays Vote on Betsy DeVos","title_rss":"NULL","source_domain":"breitbart.com","text":"Chairman of the Senate Health, Education, Labor, and Pensions Committee (HELP), Sen. Lamar Alexander (R-TN), says he is delaying the initial vote on Besty DeVos, nominee for secretary of education.\nHis announcement that the vote on DeVos’ nomination would be delayed by a week, until January 31, came Friday evening, reports the New York Times (NYT). Many Democrats, focused on DeVos’ vast wealth and potential ethical conflicts of interest, objected to Alexander’s insistence on only one round of questions for DeVos and argued they needed more time to have their questions answered.\nThe Office of Government Ethics released its report for DeVos after her hearing last Tuesday. One of the concerns reported by the NYT is that while DeVos said she had stepped down from the board of Neurocore, a Michigan company that operates biofeedback “brain performance centers” that offer alternative treatment for children and adults with diagnoses of attention deficit disorder and autism, she says she will still keep her financial interest in the company, valued at between $5 million to $25 million.\nThe NYT continues:\nMs. DeVos and her husband promote Neurocore heavily on the website for Windquest Group, a family office the couple use to manage some of their many investments. The website, for instance, includes a link to a Washington Post article about Kirk Cousins, a Washington Redskins quarterback who describes how he “retrained” his brain to better perform on the field by going to a Neurocore center. But the claims that Neurocore’s methods can help children improve their performance in school could present a conflict for Ms. DeVos if she is confirmed as education secretary — especially given that the company is moving to expand its national reach.\n“This is not an appropriate investment for the secretary of education,” Richard W. Painter, an ethics adviser to former President George W. Bush, reportedly told the NYT. He added:\nHow schools respond to attention issues is a vitally important policy question and ties right into achievement. In my view, there should be support, including financial support, for alternatives to A.D.H.D. drug treatments that are covered by health insurance whereas alternatives often are not covered.\n“The secretary would be barred from participating in that important policy decision if she or her husband owned an interest in this company,” he added.\nWhile Democrats’ concerns about DeVos are centered on their support for increased federal funding for public schools and whether the nominee would be seeking to privatize the public education system, the grassroots base of the Republican Party say few of their questions were asked by Republican senators during DeVos’ confirmation.\nDr. Karen Effrem, president of Florida-based Education Liberty Watch, observes to Breitbart News there was only one mention of the Common Core standards during DeVos’ hearing, during a question posed by Louisiana Republican Sen. Bill Cassidy, who asked DeVos if she intended to coerce Common Core in the states. The nominee answered, “No.”\nWhile pleased with DeVos’ answer to that single question, Effrem explains why it is not enough for the thousands of grassroots parents and other citizens who have been battling against the Common Core in their individual states:\nAs stated in numerous writings by many anti-Common Core experts and activists, the foundation of the Every Student Succeeds Act (ESSA) mandates the Common Core by imposing secretarial veto of state plans and requiring states’ compliance with eleven different federal laws all mandating statewide standards and tests that are Common Core even if not labeled such.\nEffrem continued that while DeVos said she would not support a federal school choice law, that response is in conflict to her other answers regarding “accountability.”\nThose answers “combined with her record of support for very regulated voucher plans in Indiana and Louisiana that require administration of the state (Common Core) tests … is extremely concerning for the autonomy and viability of private schools,” she adds.\nEffrem says if DeVos is confirmed, she and her organization will closely monitor how she implements ESSA; the ease with which she grants waivers for “state plans that seek to truly eliminate Common Core” and its associated tests; and the degree to which she resists implementation of social and emotional learning (SEL) accountability schemes.\n“The Family Education Rights and Privacy Act (FERPA) was gutted by regulatory fiat during the Obama administration,” Effrem notes. “At the very least, those privacy protections must be restored and preferably expanded to deal with all of the online data mining that is happening with technology-based education. Privacy was mentioned by Mr. Trump and was one of our questions.”\nParent activist Karen Braun, who writes at Stop Common Core in Michigan – DeVos’ home state – says the nominee’s hearing was “political theater and grandstanding by all involved.”\nShe notes that DeVos seems most concerned about parents’ choice of the “learning environment” for their children, while the content of what is learned cannot be chosen. She continues:\nIn her opening remarks DeVos made it clear what she believes: [DeVos said then,] “Why, in 2017, are we still questioning parents’ ability to exercise educational choice for their children? I am a firm believer in parents choosing the learning environment that’s best for their individual children.” Choosing the learning environment is NOT true choice. For example, parents in a DeVos charter school in Grand Rapids wanted Common Core OUT of their school. The administration said it wasn’t going to happen because “what the state and Mr. DeVos want they are going to get.”\nBraun observes that – though DeVos said on her new website that she is “certainly” not a supporter of Common Core – she never supported the grassroots group that has been attempting to rid the state of the controversial reform.\nUltimately, groups like Braun’s and Effrem’s would like to see the federal Education Department dismantled.\n“I would have hoped to hear Mrs. DeVos say, in response to almost every question she was asked about education policy, ‘That’s none of my business — it’s a state and local issue,’” senior fellow with American Principles Project Jane Robbins tells Breitbart News. “She gave the occasional nod to local control but didn’t make it clear that under her guidance, the federal education establishment will be dismantled. That’s disappointing.”","url":"https://www.breitbart.com/politics/2017/01/21/sen-lamar-alexander-delays-vote-betsy-devos/"}
