{"authors":["Caroline May"],"date_download":"2018-10-30 22:17:46","date_modify":"2018-10-30 22:17:46","date_publish":"2015-07-10 14:32:52","description":"Sen. Richard Shelby (R-AL) is pressing Attorney General Loretta Lynch to stop providing law enforcement grants to sanctuary cities.","filename":"data/vaneerConsumption/SenShelbyPressesObamaAdminToCeaseLawEnforcementGrantsToSanctuaryCities.json","image_url":"https://media.breitbart.com/media/2015/07/Screen-Shot-2015-07-03-at-6.56.33-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_10__1540937866.html","title":"Sen. Shelby Presses Obama Admin. To Cease Law Enforcement Grants To Sanctuary Cities","title_page":"Sen. Shelby Presses Obama Admin. To Cease Law Enforcement Grants To Sanctuary Cities | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the wake of the recent murder of a young woman, allegedly by a multiple-deportee, multiple-felon at a popular San Francisco tourist destination, Sen. Richard Shelby (R-AL) is pressing Attorney General Loretta Lynch to stop providing law enforcement grants to sanctuary cities.\n“Any violent crime is tragic, but the fact that the senseless death in San Francisco arose directly from a ‘sanctuary city’ deliberately obstructing policies to remove illegal immigrants who have committed crimes is appalling and inexcusable,” Shelby, the Chairman of the Senate Appropriations Subcommittee on Commerce-Justice-Science, says.\n“I strongly believe that interfering with the routine coordination of federal law enforcement is intolerable and potentially deadly to law-abiding American families,” he added.\nIn a letter to Lynch Thursday, Shelby highlights that his subcommittee appropriated more than $2 billion in grants for state and local law enforcement agencies through Justice Assistance Grants and the COPS program.\nHe requests that Lynch “use the Department’s administrative authorities as the grant-making agency to limit the availability of these taxpayer funds only to states and local agencies tat affirmatively certify that they will follow the law and identify and hold criminal illegal immigrants in their custody when requested by the appropriate federal agency.”\n“Simply put: municipalities that refuse to cooperate with federal immigration laws should not receive the Department of Justice’s federal law enforcement assistance funding,” he wrote.\nShelby’s missive comes as a number of GOP lawmakers in both the House and Senate have introduced legislation aimed at targeting the funding for sanctuary cities.\nThe effort follows the murder of Kathryn Steinle at a San Francisco pier by an illegal immigrant who had been released from the San Francisco Sheriff’s Department less than three months earlier due to the city’s sanctuary city policies.\n“Municipalities that refuse to cooperate with federal immigration laws simply should not receive the Department of Justice’s assistance funding,” Shelby added. “The freedoms we enjoy – like strolling on a San Francisco pier with our children – are possible only when we are willing to enforce the federal laws that keep our families and our freedoms safe.”","url":"https://www.breitbart.com/politics/2015/07/10/sen-shelby-presses-obama-admin-to-cease-law-enforcement-grants-to-sanctuary-cities/"}
