{"authors":["Marlen Komar"],"date_download":"2018-10-31 01:46:53","date_modify":"2018-10-31 01:46:53","date_publish":"2018-09-06 15:40:50","description":"Virgil Abloh of the iconic streetstyle brand Off-White and Nike came together to create Serena Williams' US Open tennis tournament outfit, and now Serena Williams' daughter has mini Nike Blazers just like her mom.\nAbloh — who was Kanye West’s…","filename":"data/vaneerConsumption/SerenaWilliamsDaughterJustGotBabySizedOffWhiteNikeShoes.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/1e93fccc-c5e6-41e3-90bd-485cefb8aed7-untitled.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_serena-williams-daughter-just-got-baby-sized-off-white-nike-shoes-11772945_1540950413.html","title":"Serena Williams' Daughter Just Got Baby Sized Off-White Nike Shoes","title_page":"Serena Williams' Daughter Just Got Baby Sized Off-White Nike Shoes","title_rss":"NULL","source_domain":"bustle.com","text":"Virgil Abloh of the iconic streetstyle brand Off-White and Nike came together to create Serena Williams' US Open tennis tournament outfit, and now Serena Williams' daughter has mini Nike Blazers just like her mom.\nAbloh — who was Kanye West’s creative director and is now Louis Vuitton's men’s designer while simultaneously running his own brand — was tasked with designing the 23-time Grand Slam champion's tournament outfits, creating a multi-piece capsule collection called \"The Queen Collection.\" Everything from tutu dresses, to a leather jacket, to a series of chic Nike shoes are included in the lineup, and Nike delighted fashion and tennis fans alike when they announced that the limited edition pieces are slated to go on sale, letting the masses copy the Queen of Tennis. Part of that lineup is a specific shoe design called \"The Ten: Nike Blazers,\" which is a high top shoe transformed with an Off-White twist. This is the exact pair of shoes that Williams' daughter got in the mail, just baby sized.\nFeaturing ombre soles that fade from hot pink, to royal purple, to grey, it also sports the iconic Nike swoop that dips down passed the sole. It also has a neon yellow tag hanging off the laces that adds an extra pop of color, as well as the phrase, \"Off-White for Nike. 'Nike Blazer Mid.' Beaverton, Oregon. C. 1972\" stamped across it. Off-White is known for its use of words and phrases in its collections, so it is a very \"Abloh\" twist.\nSince the public is able to snap up the same shoes, it only makes sense that Williams' own daughter should have the chance to copy her mom's style, too.\nWilliams shared a photo on Instagram of the mini Off-White x Nike Blazers that Abloh sent over, showing how it is an exact replica of her own pair, just tiny. Made specifically for one-year-old Alexis Olympia, they look exactly the same as the original pair, featuring the colorful hues and a comically big neon tag.\nThe tennis star thanked the designer in the caption, tagging the whole team and writing, \"Thank you ❤️@virgilabloh @nike @off____white.\"\nAs you can imagine, fans love the toddler-sized kicks. \"Cute!! And probably the most swaggy baby out there,\" a follower wrote. \"These are quite literally the cutest sneakers ever made! They’re so itty bitty!\"\nOthers want similar pairs for their own kids, writing things like, \"Think i should get some for my spawn!\"\nWhile Nike has not confirmed if there will be kid versions of the much-anticipated high top shoe, it might not be completely out the realm of possibilities. Right now it might look like a sweet gift for her toddler, but the shoe brand has been known to extend their collaborative projects into kids' sizes.\nFor example, when Nike did a collaboration with YouTuber Sean Wotherspoon who reimagined the Air Max 1/97, they also created toddler and kid sizes of the shoes.\nYou can see them below:\nWhether there is a tiny version of the high tops coming or not, it was an adorable gesture.","url":"https://www.bustle.com/p/serena-williams-daughter-just-got-baby-sized-off-white-nike-shoes-11772945"}
