{"authors":["Press Association"],"date_download":"2018-10-22 21:50:56","date_modify":"2018-10-22 21:50:56","date_publish":"2016-01-28 09:07:26","description":"Serena Williams is one win away from a record-equalling 22nd grand slam title after the top seed blew away Agnieszka Radwanska in the Australian Open semi-fi...","filename":"data/vaneerConsumption/Serenawilliamsreachesaustralianopenfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-b24e0e3e-561a-4f18-a83f-1b9af74a92fe-4vVdYopwYQ7f641721b07ab16052-838_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420441_Serena-Williams-reaches-Australian-Open-final_1540245056.html","title":"Serena williams reaches australian open final","title_page":"Serena williams reaches australian open final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Serena Williams reaches Australian Open final\nSerena Williams is one win away from a record-equalling 22nd grand slam title after the top seed blew away Agnieszka Radwanska in the Australian Open semi-final.\nWilliams eased past Radwanska 6-0 6-4 to reach her 26th major final and her seventh in Melbourne while victory would see her go level with Steffi Graf at the top of the Open era champions list.\nThe American will face either Britain's Johanna Konta, ranked 47th in the world, or German Angelique Kerber, the pair playing their semi-final later on Thursday.\nSerena Williams has reached the Australian Open final\n\"Either one is OK, I've never played Konta - Kerber a few times - but I'm honestly a little surprised to be in another final,\" Williams said,\n\"I feel I'm playing the best I can and I can't believe I'm in the final.\n\"Physically I'm feeling a lot better, mentally I needed that break after the US Open and now I just feel so good, it's great, I didn't think I'd do so well so fast.\"\nRadwanska, ranked fourth in the world, is no stranger to the top level of women's tennis but she was made to look a minnow by Williams, who looks ominously back to her very best.\nShe set her stall out in the very first point as she thundered back Radwanska's first serve before two more booming returns sealed an early break.\nIt was a sign of what was to come as Williams crushed her opponent from the outset, storming into a 5-0 lead and leaving the crowd wondering if the Pole would ever get on the board.\nRadwanska's serve was like shooting practice for the American, particularly given her first serve sat at a lowly 50 per cent in the first set, which Williams sealed to love in just 20 minutes.\nThe top seed hit 18 winners in the opening six games and her second serve was averaging a higher speed than Radwanska's first.\nFinally, however, the world number four registered at the start of the next set, to a great cheer from the crowd, and then she held again to keep pace at 3-2.\nWilliams started to miss a few and Radwanska started to compete, breaking the top seed to level at 3-3 and then drawing the biggest applause of the match when she pulled her opponent in with a drop shot then pushed away the winner with a neat backhand volley.\nUp 4-3, Radwanska was sparking hopes of a comeback but no sooner had she dared to think it than Williams cranked up the pressure again.\nThe American held and then won seven points in a row, including three consecutive aces, to open up a triple match point.","url":"https://www.dailymail.co.uk/wires/pa/article-3420441/Serena-Williams-reaches-Australian-Open-final.html"}
