{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:42:04","date_modify":"2018-10-23 00:42:04","date_publish":"2017-03-10 07:42:00","description":"In the 80s-inspired clip, the beauty is seen dancing in a gym setting, clad in a leotard with legwarmers, jamming to a remake of Billy Idol’s Dancing With Myself, which came out in 1982.","filename":"data/vaneerConsumption/SerenaWilliamsservesupthesexyin80sinspiredad.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E20124E00000578-0-image-a-104_1489123181952.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300026_Serena-Williams-serves-sexy-80s-inspired-ad_1540255324.html","title":"Serena Williams serves up the sexy in 80s-inspired ad","title_page":"Serena Williams serves up the sexy in 80s-inspired ad | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If she had the chance, she'd ask the world to dance.\nSerena Williams channels her inner Jennifer Beals for a 1980-inspired ad for Berlei, an Australian sportswear company she says has outfitted her with sports bra support 'for over 18 years.'\nIn the clip, the 35-year-old beauty, wearing her curly mane down, was seen dancing in a dance studio - clad in a leotard with legwarmers - and jamming to a remake of Billy Idol’s Dancing With Myself. (The song which came out in 1982, the year after she was born.)\nWhat a feeling: Serena Williams channels her inner Flashdance diva for a 1980-inspired ad for Berlei, an Australian company she says has outfitted her with sports bra support 'for over 18 years'\nExquisite: The world-class athlete showed off her sexy curves and nimble moves in the ad, which took place in a dance studio reminiscent of the 80s TV staple Fame\nLovely: The spot is part of a bigger promotional campaign from the company called '#DoItForYourself,' a movement she says strikes her as empowering\nThe women’s tennis stalwart captioned the energy-packed clip, 'Take care of yourselves ladies,' adding the hashtag '#DoItForYourself,' the mantra for the marketing of the company's campaign.\nThe curvy, 5ft9 athlete said in January that the '#DoItForYourself' mantra takes on a special meaning to her, as it represents 'really standing up for yourself and what you believe in and just doing it.'\n'I always say there's going to be so many people who are not going to believe in you and try to hold you back from your dreams, but I believe that it's really so important to do everything in your life for you, and I think ultimately you get the best results that way,' she said in a previous ad for the company.\nWorth an upvote! The tennis beauty last year confirmed her engagement to Reddit mogul Alexis Ohanian\nThe top-ranked tennis beauty is certainly getting the best results in all facets of her life, be it romance, career or on the courts.\nLate last year, Serena announced her engagement with Reddit mogul Alexis Ohanian after more than a year of dating. The gorgeous star had previously been romantically linked to French tennis coach Patrick Mouratoglou, rapper Common and filmmaker Brett Ratner.\nShe's also snared a coveted cameo in next year's star-laden Ocean's Eight, adding to her on-camera resume. In her past dabbling as an actress, Serena's been seen on Law & Order: Special Victims Unit, ER and Pixels.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300026/Serena-Williams-serves-sexy-80s-inspired-ad.html"}
