{"authors":[],"date_download":"2018-10-22 21:17:03","date_modify":"2018-10-22 21:17:03","date_publish":"2016-01-28 07:15:26","description":"An imperious Serena Williams set up a crack at her seventh Australian Open title Thursday by trampling Agnieszka Radwanska, with only Angelique Kerber now ca...","filename":"data/vaneerConsumption/SerenathroughtoAustralianOpenfinalfacesGermanysKerber.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g652-4vVdYopwYQ7f641721b07aa0e4db-528_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420479_Serena-Australian-Open-final-faces-Germanys-Kerber_1540243023.html","title":"Serena through to Australian Open final, faces Germany's Kerber","title_page":"Serena through to Australian Open final, faces Germany's Kerber | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Serena through to Australian Open final, faces Germany's Kerber\nAn imperious Serena Williams set up a crack at her seventh Australian Open title Thursday by trampling Agnieszka Radwanska, with only Angelique Kerber now capable of stopping her equalling Steffi Graf's Open-era record of 22 Grand Slam triumphs.\nThe dominant top seed was in inspirational form as she pummelled the Pole 6-0, 6-4 on Rod Laver Arena, with the stunned fourth seed calling the opening set the best tennis she had ever faced.\nIt set Williams up for a 26th Grand Slam final as she zeroes in on a seventh Australian Open title and a bid to match's Graf's record. Margaret Court holds the all-time record of 24 major wins.\nSerena Williams of the US celebrates after victory in her Australian Open women's singles semi-final match against Poland's Agnieszka Radwanska, in Melbourne, on January 28, 2016 ©Greg Wood (AFP)\nGermany's Kerber, the seventh seed, earned her right to face Williams by beating unseeded Briton Johanna Konta 7-5, 6-2 to sweep into her maiden Grand Slam final.\nIt marked the first time a German has reached the final at Melbourne Park since Anke Huber in 1996, but Kerber faces a monumental task with the American powerhouse across the net in Saturday's decider.\nWilliams, 34, has a 5-1 win record against Kerber and vastly more big match experience, but she is not underestimating the threat she faces.\n\"She took out a really tough opponent in Victoria,\" she said of Kerber's quarter-final ousting of two-time champion Victoria Azarenka.\n\"You can't underestimate Kerber. She's beaten me before, too, and pretty good. I know that she brings a lot, you know, to the game.\n\"Her being lefty definitely helps out as well. I haven't played any lefties yet. But we'll see. I think... it will be a really good match. It definitely won't be easy.\"\nAgainst Radwanska, the top seed was untouchable and she will go into the decider knowing that of her 25 previous major finals, she has won 21.\nThe Pole admitted she was left in awe after seeing her 13-match win streak emphatically halted by the Williams juggernaut.\n\"I think she started unbelievable, with such power and speed. I was just standing there kind of watching her playing,\" said Radwanska, calling the first set the best anyone had ever played against her.\n\"I think so. There was just no mistake. Unbelievable serve. Everything, she was going for it. Yeah, I couldn't do much. Not at all, actually.\"\nThe writing was on the wall -- Williams had never lost a semi-final at Melbourne Park on her way to six titles, and had beaten the Pole in each of their previous eight meetings stretching back to 2008.\nShe crushed long-time rival Maria Sharapova in the quarter-finals and dished out the same treatment to the in-form fourth seed, who won the WTA Finals late last season and this month's Shenzhen Open title.\n- 'Steffi, write me!' -\nKerber, buoyed by a new-found self-belief inspired by fellow German Graf, who practised with the 28-year-old last year, was too strong for Konta, who was playing her first Australian Open main draw and first Grand Slam semi.\n\"It's a really special moment. I reach the final for the first time,\" Kerber said. \"I was trying to give everything today on court.\"\nKnowing the task now awaiting her is vast, she joked that Graf needed to help her once again.\n\"Steffi, write me please!\" Kerber said, adding: \"I'm really looking forward to playing against Serena.\n\"I'm really looking forward to taking this challenge. I must play my best tennis.\"\nKonta was bidding to become the first British woman to reach a Grand Slam final since Virginia Wade at Wimbledon in 1977, and the first in Melbourne since Wade in 1972.\nDespite being beaten, the world number 47 is expected to break into the top 30 when the new rankings are released on Monday.\nGermany's Angelique Kerber celebrates after victory in her Australian Open women's singles semi-final match against Britain's Johanna Konta, in Melbourne, on January 28, 2016 ©William West (AFP)\nPoland's Agnieszka Radwanska hits a return against Serena Williams of the US during their Australian Open women's singles semi-final match, in Melbourne, on January 28, 2016 ©Peter Parks (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3420479/Serena-Australian-Open-final-faces-Germanys-Kerber.html"}
