{"authors":["Tom Allnutt","Press Association Sport"],"date_download":"2018-10-22 23:04:05","date_modify":"2018-10-22 23:04:05","date_publish":"2016-01-28 11:39:52","description":"Serena Williams insists she is blocking out all thoughts of equalling Steffi Graf's grand slam record as she prepares to face Germany's Angelique Kerber in the Australian Open final.","filename":"data/vaneerConsumption/SerenaWilliamsignoresSteffiGrafrecordtalkaheadofAustralianOpenfinalwithAngeliqueKerber.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A79A1800000578-0-image-a-23_1453980929576.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3420800_Serena-Williams-tunes-Steffi-Graf-record-talk-ahead-Australian-Open-final-against-Germany-s-Angelique-Kerber_1540249445.html","title":"Serena Williams ignores Steffi Graf record talk ahead of Australian Open final with Angelique Kerber","title_page":"Serena Williams ignores Steffi Graf record talk ahead of Australian Open final with Angelique Kerber | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Serena Williams insists she is blocking out all thoughts of equalling Steffi Graf's grand slam record as she prepares to face Germany's Angelique Kerber in the Australian Open final.\nVictory against Kerber would draw Williams level with Graf's Open-era best 22 major titles while taking her own tally of Melbourne triumphs to five.\nShe is currently third in the all-time list after moving three clear of Chris Evert and Martina Navratilova's 18 but she remains short of Australian Margaret Court, who is out in front on 24.\nSerena Williams insists she is blocking out all thoughts of equalling Steffi Graf's grand slam record\nWilliams celebrates during her semi-final victory over Poland's Agnieszka Radwanska on Thursday\nMaking history has not always come easily to Williams, who last year crumbled when two wins away from the calendar grand slam, which would have been a first since Graf's in 1988.\nNow on the brink of matching Graf again, Williams is desperate to keep focus.\n'I definitely block it out,' Williams said.\n'I was one off last year too. If I don't win on Saturday, I'll still be one off. It took me forever to get to 18. I was so stressed out. I don't want to relive that at all.'\nWilliams threatened to embarrass her semi-final opponent Agnieszka Radwanska on Thursday, annihilating the Pole 6-0 in a first set that took just 20 minutes.\nThe form of the American, who won 6-0 6-4 and is yet to drop a set so far, has fed the suspicion she is unstoppable in Saturday's final.\n'I think everything is stoppable at some point, I guess,' Williams said.\n'She (Kerber) took out a really tough opponent in Victoria (Azarenka).\nWilliams plays a crunching forehand at the tournament in Melbourne, during her 6-0, 6-4 demolition job\n'You can't underestimate Kerber. She's beaten me before, too, and pretty good. I know that she brings a lot to the game.\n'Her being a lefty definitely helps out as well. I haven't played any lefties yet. But we'll see. I think if I do play her, it will be a really good match. It definitely won't be easy.'\nKerber has beaten Williams once, in Cincinnati in 2012, but she has lost all of their other five meetings without winning a set.\nRadwanska suggested the world No 1 may be unbeatable in this kind of mood.\n'I'm not even angry because I know she was just playing too good today,' Radwanska said.\n'There was just no mistake. Unbelievable serve, everything. She was going for it. I couldn't do much - nothing at all, actually.'\nKerber has taken on Graf, her childhood idol, as something of a mentor, practising with her last year in Las Vegas and maintaining contact since.\nThe form of the American, who is yet to drop a set so far, has fed the suspicion that she is unstoppable\nAfter beating Britain's Johanna Konta 7-5 6-2, Kerber was asked on court if Graf might give her some tips on how to beat Williams.\nKerber said: 'I hope so, Steffi write to me please!'\nBy the time her press conference had come around an hour later, it appeared the seven-time Wimbledon champion had delivered.\n'She wrote to me, but I was not able to check it right now,' Kerber said.\n'I just saw that. I think she sent me a text message, but I don't know what she wrote yet.'\nKerber is the only woman left who can preserve Graf's grand slam record. Does she feel a duty to her compatriot?\n'I think so,' Kerber said. 'The Germans must be together.'","url":"https://www.dailymail.co.uk/sport/tennis/article-3420800/Serena-Williams-tunes-Steffi-Graf-record-talk-ahead-Australian-Open-final-against-Germany-s-Angelique-Kerber.html"}
