{"authors":["Press Association"],"date_download":"2018-10-23 00:58:06","date_modify":"2018-10-23 00:58:06","date_publish":"2017-04-26 11:04:21","description":"The world number one posted a picture on Snapchat last week showing off a small baby bump.","filename":"data/vaneerConsumption/SerenaWilliamsadmitssherevealedpregnancybyaccident.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464411-1493201065-675_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447084_Serena-Williams-admits-revealed-pregnancy-accident_1540256286.html","title":"Serena Williams admits she revealed pregnancy by accident","title_page":"Serena Williams admits she revealed pregnancy by accident | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Serena Williams has admitted she accidentally made her pregnancy public having learned she was expecting a baby two weeks before the Australian Open.\nThe world number one posted a picture on Snapchat last week showing off a small baby bump with the caption “20 weeks”.\nIt was taken down shortly afterwards, leading to several hours of confusion before the news was confirmed by Williams’ publicist.\nSerena Williams (Adam Davy/PA)\nSpeaking at TED2017, the 35-year-old said : “I was on vacation, taking time for myself, and I have this thing where I’ve been checking my status and taking a picture every week.\n“I’ve been just saving it, but you know how social media is – you press the wrong button and… My phone doesn’t ring that much, and 30 minutes later, I’d missed four calls. So I picked it up and realised, ‘Oh no’.”\nWilliams was eight weeks pregnant when she won her 23rd grand slam singles title in Melbourne in January, setting a new record for the Open era.\n“I was nervous,” she said. “I wasn’t sure what to do. Can I play? I know it’s very dangerous in the first 12 weeks or so, so I had a lot of questions.\n“I knew that at that moment, it was important for me to just focus. I had to take all that energy and put it in a paper bag and throw it away. I really felt like I didn’t have time to deal with any extra emotions – any extra anything.\n“Pregnant or not, no one knew. Every tournament where I show up, I’m expected to win. If I don’t win, it’s actually bigger news.”\nWilliams, who is engaged to Reddit co-founder Alexis Ohanian, turns 36 in September and will likely be closer to 37 by the time she is ready to return to professional tennis.\nBut she insisted she is definitely intending to resume her career, citing the influence of sister Venus, who turns 37 in June and is ranked 12th.\n“I definitely plan on coming back – I’m not done yet,” said Williams, who remains one behind the all-time slam record held by Margaret Court.\n“My story isn’t over. I’m really inspired by my sister, who’s a year older than me. If she’s still playing, then I know I can play. This is just a new part of my life. My baby is going to be in the stands, hopefully cheering for me and not crying too much.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447084/Serena-Williams-admits-revealed-pregnancy-accident.html"}
