{"authors":[],"date_download":"2018-10-22 20:56:05","date_modify":"2018-10-22 20:56:05","date_publish":"2016-01-28 05:16:04","description":"An inspired world number one Serena Williams demolished Polish fourth seed Agnieszka Radwanska Thursday to surge into her 26th Grand Slam final and zero in o...","filename":"data/vaneerConsumption/SerenasurgespastRadwanskaandinto26thGrandSlamfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5je-2vdWmEltwXfba0ce28e63244acf8-705_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420367_Serena-surges-past-Radwanska-26th-Grand-Slam-final_1540241765.html","title":"Serena surges past Radwanska and into 26th Grand Slam final","title_page":"Serena surges past Radwanska and into 26th Grand Slam final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Serena surges past Radwanska and into 26th Grand Slam final\nAn inspired world number one Serena Williams demolished Polish fourth seed Agnieszka Radwanska Thursday to surge into her 26th Grand Slam final and zero in on a seventh Australian Open title.\nThe dominant top seed was untouchable in overpowering the Pole 6-0, 6-4 in just 64 minutes on Rod Laver Arena to set up a decider against German seventh seed Angelique Kerber or unseeded Briton Johanna Konta.\nKerber and Konta play later Thursday, with whoever wins facing a huge obstacle to be crowned champion. Of her 25 previous major finals, Williams has won 21.\nSerena Williams during her Australian Open semi-final match against Agnieszka Radwanska in Melbourne on January 28, 2016 ©Saeed Khan (AFP)\n\"I'm really excited to be in another final, it kind of blows my mind right now,\" said Williams, 34. \"I feel I am playing the best I can, and I can't believe I am in the final.\n\"I started playing aggressive again in the second set and it worked out.\"\nThe writing was on the wall for Radwanska -- Williams had never lost a semi-final at Melbourne Park on her way to six titles, and had beaten the Pole in each of their previous eight meetings stretching back to 2008.\nShe crushed long-time rival Maria Sharapova in the quarter-finals and dished out the same treatment to Radwanska, halting her 13-match win streak in emphatic fashion.\n\"I think she started unbelievable, with such a power and speed. I was just standing there kind of watching her playing,\" said Radwanska, calling the first set the best anyone had ever played against her.\n\"There was just no mistake. Unbelievable serve. Everything, she was going for it. I couldn't do much.\"\nThe victory puts Williams just one win away from matching Steffi Graf's Open-era Grand Slam record of 22 titles, with Margaret Court's all-time mark of 24 edging closer.\n- Emphatic finish -\nIn her 16th Australian Open, Williams, who said this week she had no plans to retire any time soon, got on the front foot immediately, and effortlessly.\nWithin a minute of the match starting she had a break point as she hit clean winners and attacked the net.\nIt was the worst possible opening for Radwanska, with Williams, the oldest world number one in WTA history, breaking and then using her huge power advantage to easily hold serve and go 2-0 clear.\nRadwanska, 26, was in serious trouble with Williams attacking her vulnerable second serve, and a double fault left her flailing 0-3 behind.\nThe American was hitting booming shots to perfection, while Radwanska was struggling to get the ball over the net.\nHer movement was virtually non-existent and a feeble backhand had the top seed 5-0 ahead after just 17 minutes.\nRadwanska could do nothing against an opponent playing on a different level, and only won seven points the entire set -- four of them from Williams' unforced errors.\nWilliams won the set in 20 minutes, one of the fastest of the tournament and humiliating for Radwanska, last year's WTA Finals champion and one of the world's top players.\nRadwanska finally got off the mark in the opening game of the second set when Williams netted a backhand from the baseline, to huge applause from the crowd.\nBut it was only a temporary reprieve, with Williams holding serve and then breaking to march 2-1 clear.\nThe fourth seed finally started finding her range and with some errors leaking into the Williams game, she easily held serve then broke with a forehand error to go level at 3-3.\nAn epic seventh game, including the first deuce of the match, allowed her to hold serve, but an easy Williams hold was followed by another lapse from Radwanska who was broken again.\nWilliams, serving for victory, sent down three booming aces and won it on the first match point, keeping intact her record of not dropping a set all tournament.\nPoland's Agnieszka Radwanska hits a return against Serena Williams of the US during their women's singles semi-final match on day eleven of the 2016 Australian Open tennis tournament in Melbourne on January 28, 2016 ©Peter Parks (AFP)\nGermany's Angelique Kerber plays a forehand return during her women's singles semi-final match against Britain's Johanna Konta on day eleven of the 2016 Australian Open tennis tournament in Melbourne on January 28, 2016 ©Saeed Khan (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3420367/Serena-surges-past-Radwanska-26th-Grand-Slam-final.html"}
