{"authors":["Stuart Fraser For Mailonline"],"date_download":"2018-10-22 20:47:31","date_modify":"2018-10-22 20:47:31","date_publish":"2016-01-28 03:53:26","description":"STUART FRASER IN MELBOURNE: The last time Serena Willams played a Grand Slam semi-final, she was error-strewn as Roberta Vinci ended her bid for a Calendar Grand Slam.","filename":"data/vaneerConsumption/SerenaWilliamspowersinto2016AustralianOpenfinalbybeatingAgnieszkaRadwanska.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A69BCE00000578-0-image-a-37_1453953766796.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3420295_Serena-Williams-powers-Australian-Open-final-merciless-victory-Agnieszka-Radwanska_1540241251.html","title":"Serena Williams powers into 2016 Australian Open final by beating Agnieszka Radwanska","title_page":"Serena Williams powers into 2016 Australian Open final by beating Agnieszka Radwanska   | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The last time Serena Willams played a Grand Slam semi-final, she was uptight and error-strewn as Roberta Vinci ended her bid for a Calendar Grand Slam at the US Open.\nHow contrasting a performance in Melbourne on Thursday as the world No 1 beat Polish fourth seed Agnieszka Radwanska 6-0, 6-4 in just 64 minutes to reach the final of the Australian Open.\nSaturday's championship match against German Angelique Kerber will be the 26th Grand Slam final of William's career as the 34-year-old bids for a 22nd Grand Slam singles title, which would equal Steffi Graf's Open Era record.\nSerena Williams beat Agnieszka Radwanska 6-0, 6-4 on Thursday to reach the Australian Open final\nWilliams roars with delight after sealing a commanding victory to reach yet another Grand Slam final\nWilliams took the first set against Radwanska in only 21 minutes in a stunning performance\nWilliams said: 'I'm really excited to be in another final. It just kind of blows my mind right now. I just feel like I'm playing the best I can and I can't believe I'm in the final.'\nRadwanska had come into the semi-final on a 13-match win streak which stretched back to her WTA Finals success at the end of last season.\nBut she could only win seven points in the first set as Williams made a stunning start, racing to the opening set in just 21 minutes and hitting 18 winners to Radwanska's one.\nThere was a big cheer from the Rod Laver Arena crowd as Radwanska prevented the dreaded double bagel by holding her serve in the first game of the second set.\nAlthough Radwanska put up some resistance towards the end, Williams crucially broke for 5-4 and then served out the match in style, sealing victory with three aces and a forehand drive volley.\nWilliams said: 'She started playing really well in the second set. She was making a lot of great shots, hitting really deep.\n'I was like \"I have to figure out something\" and then I just started playing aggressive again, go back to what I was doing all week and it worked out.'\nThe American took the second set 6-4, with her serve particularly causing her opponent many problems\nRadwanska battled back in the second set but but Williams proved to be too strong in the semi-final\nWilliams is congratulated by her beaten opponent Radwanska after their Australian Open semi-final\nThere had been concerns that Williams may have been rusty coming into the first Grand Slam of the year after cutting her season short following her US Open disappointment.\nBut those have been quickly dispelled with her performance in Melbourne so far, not dropping a set through six matches.","url":"https://www.dailymail.co.uk/sport/tennis/article-3420295/Serena-Williams-powers-Australian-Open-final-merciless-victory-Agnieszka-Radwanska.html"}
