{"authors":["Chloe-Lee Longhetti","Megan Pustetto For Daily Mail Australia"],"date_download":"2018-10-23 01:45:39","date_modify":"2018-10-23 01:45:39","date_publish":"2016-01-11 12:58:17","description":"The 34-year-old gave the sporting personalities some tips on how to serve.","filename":"data/vaneerConsumption/SerenaWilliamsshowsoffmusclyarmsgivingtennistipsinMelbourne.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3009734900000578-0-image-a-52_1452513189369.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393574_Serena-Williams-shows-muscly-arms-giving-tennis-tips-Geelong-s-Joel-Selwood-sporting-stars-ahead-Australian-Open_1540259139.html","title":"Serena Williams shows off muscly arms giving tennis tips in Melbourne","title_page":"Serena Williams shows off muscly arms giving tennis tips in Melbourne | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the women's world no.1 tennis player, so no she can teach Australian AFL and cricket stars a few tips on the court.\nOn Monday, a very happy Serena Williams made a promotional appearance at a Gatorade sponsored masterclass at Woolworths Ashwood in Melbourne, ahead of The Australian Open, putting her skills into action on the court.\nThe 34-year-old was joined by AFL stars Geelong's captain Joel Selwood, Hawthorn's captain Luke Hodge, and test cricketer Peter Siddle, and Australian Women's cricket captain Meg Lanning, who watched how to perform the perfect serve.\nScroll down for video\nGame, set and match! American tennis player Serena Williams made a promotional appearance at a Gatorade sponsored masterclass at Woolworths Ashwood in Melbourne ahead of The Australian Open\nShowing off her fit figure and muscly arms, the athlete looked smart in all-black exercise gear as she showed off her athletic ability.\nWearing a tight singlet and leggings, the Gatorade ambassador had her long dark tresses pulled off her face into a pony tail.\nShe also wore light make-up including a skim of foundation and a pink gloss.\nThe star teamed her look with minimal accessories including a necklace and drop earrings, and a watch as she provided rare insight into what it takes to become the best in the business.\nSee the latest Serena Williams updates as she poses ahead of the Australian Open\nShowing them how it's done: The women's world no. 1 is pictured preparing to serve here at the event\nNumber one! At the event the tennis ace showed off her athletic ability\nStylish: Showing off her fit figure and muscly arms, the athlete looked smart in all-black exercise gear\nStar turn out: The 34-year-old was joined on the day by AFL stars including test cricketer Peter Siddle, (L), Hawthorn's captain Luke Hodge (second left), Geelong's captain Joel Selwood (second right) and Australian Women's cricket captain Meg Lanning\nReady for business: Wearing a tight singlet and leggings, she had her long dark tresses pulled off her face into a pony tail\nWhile there, she gave the sporting personalities tips on how to serve, and also to some teenage tennis players.\nWatching them do their best, which would have been a daunting task in front of her, she dished advice from her years on the court.\nWhile she didn't play tennis on the day, she did a few serves with her racket.\nAppearing to be in good spirits, she laughed and smiled throughout the day.\nAt one point, Joel presented Serena with his team's jersey.\nGiving advice: Serena while there, gave the sporting personalities some tips on how to serve, and also to some teen tennis players\nResting the body: While she didn't play tennis on the day, she did a few serves with her racket\nTrying hard: Peter tried his best at serving in front of the star\nNice one: At one point, Joel presented Serena with his team's jersey\nSerena last week was forced to withdraw from the Hopman Cup in Perth, because of her knee injury and needing to rest it ahead of the Australian Open, amid fears about how she will cope.\nThe defending champion battled knee problems in the latter half of 2015.\nThis week, she told The Herald Sun how she was 'ready' to take on the Australian Open and try for her seventh Australian Open title despite her injury.\n'My body is feeling great now,' she told the publication.\n'Obviously I had a hiccup but right now it is doing much better. I've had a few days of training so it's looking good.'\nInjuries: Serena last week was forced to withdraw from the Hopman Cup in Perth, because of her knee injury and needing to rest it ahead of the Australian Open\nNature of the sport: There are fears about how Serena is going to take the strain of maintaining the World Number 1 position","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393574/Serena-Williams-shows-muscly-arms-giving-tennis-tips-Geelong-s-Joel-Selwood-sporting-stars-ahead-Australian-Open.html"}
