{"authors":["Marcus Scriven"],"date_download":"2018-10-23 01:46:18","date_modify":"2018-10-23 01:46:18","date_publish":"2016-01-11 13:00:43","description":"Most Spanish cities are alive with colour and character - but Seville is a special place for a weekend away, says Marcus Scriven, as he slips into the warmth of an Andalusian afternoon.","filename":"data/vaneerConsumption/SerenadedbySevilleFlamencoandfinefoodartandeleganceawoozylazyweekendinAndalusiasamazingcapitalcity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/2DCDEDC800000578-0-image-a-5_1452516959419.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_article-3393834_Serenaded-Seville-Flamenco-fine-food-art-elegance-woozy-lazy-weekend-Andalusia-s-amazing-capital-city_1540259178.html","title":"Serenaded by Seville: Flamenco and fine food, art and elegance - a woozy, lazy weekend in Andalusia's amazing capital city","title_page":"Serenaded by Seville: Flamenco and fine food, art and elegance - a woozy, lazy weekend in Andalusia's amazing capital city | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mid-afternoon, and the sun is at shirtsleeve strength, the air scented with shrimp, garlic and sherry and every inch of the Plaza del Salvador is occupied.\nA public holiday?\nNo - merely Seville as Friday ripens into the weekend. Now is a good time to visit this elegant Spanish city.\nLow-season prices kick in this month and will last to February. If you are planning to sample the full spectrum of the city's pleasures in a weekend, then it is sensible to opt for one of the newer, smaller hotels near this central square.\nSpain at its most sumptuous: Seville is not a huge city - but it is full of charm and character\nHotels such as the Alminar, where manager Francisco and his team have the requisite knowledge to let you in on the city's secrets.\nSanta Cruz, once Seville's Jewish quarter, is east from here and home to the baroque splendour of the Salvador church.\nThere is little traffic, just the occasional moped on waspish throttle, or a car scraping its way up from a subterranean lair.\nIt is a bewildering tangle of fountains, courtyards and secluded gardens.\nThe Giralda, the bell tower, spot-lit at night, which crowns the cathedral, is a helpful marker: use it as a guide and you can wander, perhaps to Calle Mateos Gago, where the pavements overflow with tables, chairs and orange trees.\nTroubadours, seemingly dressed in homage to the Laughing Cavalier, serenade their way from bar to bar.\nFor absolute artistic intensity, however, head to Casa de la Memoria on Calle Cuna for flamenco of almost spiritual possession; heels machine-gunning bare floorboards as if a fire-cracker has exploded in the dancer's soul.\nRefuel at El Rinconcillo, probably Seville's oldest hostelry, where black-waistcoated staff chalk your bill on to the bar in front of you.\nStamp your feet: Flamenco is a huge part of Seville's appeal - and dance clubs abound\nBack in a roof-terrace room at the Alminar, you have a private view of the cathedral, just 50 yards away. An empire of a building, its dark interior has an altar drenched in gold and a tomb supposedly containing the remains of Christopher Columbus.\nTwo minutes' walk to the south is the Alcazar, the royal palace, which requires a full afternoon to explore.\nIts toy fort castellated walls belie the decorative intricacy within; colonnaded courtyards and regal chambers with stucco friezes and azulejo tiles.\nThe gardens are richer still; lemon trees, rosemary and myrtle, palms and pomegranate, plus peacocks and a water-powered organ which gurgles into action on the hour.\nTake in the imperious Avenida de la Constitucion, on the cathedral's western flank, from which cars are exiled in favour of trams, cyclists, mime artists and street vendors on whose braziers chestnuts spark and crackle.\nThen make for the River Guadalquivir.\nAt sunset, it is a stage-set scene with terraces shielded by avenues of acacia and palm.\nYou must also squeeze in Casa Pilatos, one of the late Duchess of Medinaceli's many residences.\nThere is an El Greco in the dining room, a Tintoretto in the tower room, a fireplace of Sevres porcelain and, most memorably, a painting of a breastfeeding, bearded woman, with her husband looking haggard at her shoulder.\nThe Sevillanos do justice to Sunday lunch, dining until at least 5pm - so there is time to digest the feast of your experiences at an outside table at Modesto in Santa Cruz or La Fabrica in the Alameda area before flying home.","url":"https://www.dailymail.co.uk/travel/article-3393834/Serenaded-Seville-Flamenco-fine-food-art-elegance-woozy-lazy-weekend-Andalusia-s-amazing-capital-city.html"}
