{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-23 00:20:36","date_modify":"2018-10-23 00:20:36","date_publish":"2016-01-29 13:15:34","description":"The country's top court, The Supreme’s People’s Court announced today that Tan Yongzhi had been ‘condemned to death’ in Zhengzhou, Henan Province for abduction and trafficking.","filename":"data/vaneerConsumption/SerialhumantraffickerTanYongzhiexecutedinChina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B13B3A00000578-0-image-a-41_1454070514853.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3422704_Serial-human-trafficker-executed-China-abducting-22-children_1540254036.html","title":"Serial human trafficker Tan Yongzhi executed in China","title_page":"Serial human trafficker Tan Yongzhi executed in China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tan kidnapped the victims over five years throughout the country\nA man has been executed in China for the abduction and trafficking of 22 children over the space of five years.\nChina's top court, The Supreme's People's Court, announced today that Tan Yongzhi had been 'condemned to death' in Zhengzhou, Henan Province, reports the People's Daily Online.\nTan kidnapped the children between February 2008 and April 2013 from areas that stretched across south-west China's Yunnan Province to the central area of Henan.\nDeath: Tan Yongzhi has been executed in Zhengzhou, China after he abducted 22 children over five years\nShocking: Child abduction is a problem in China. It's estimated 200,000 children vanish each year (file photo)\nAccording to the report, the court said Tan's actions and the large number of children he abducted seriously damaged children's rights, which is why he was executed.\nThe authorities have been unable to locate the birth parents of all the abducted children.\nThe exact date of the sentencing or execution has not been released.\nThere has always been a heavy penalty for those convicted of abducting a child in China, and the death penalty is still prominent.\nThe country has intensified its crackdown on trafficking of women and children in recent years.\nIn 2012, 1,918 abduction cases involving women and children were solved.\nThe Supreme People's Court said that number declined massively to 858 cases last year – a drop of almost 50 per cent.\nExecuted: The Supreme's People's Court, announced today that Tan Yongzhi was 'condemned to death'\nThe amount of people punished for abduction related charges in China declined by more than half, from 2,801 in 2012, to 1,362 in 2015.\nChild abduction is a major problem in the country, and finding accurate figures is extremely difficult.\nA recent BBC report said that an illegal market in children has developed in the country, and it is estimated that 200,000 children are taken from their parents each year.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3422704/Serial-human-trafficker-executed-China-abducting-22-children.html"}
