{"authors":["Press Association"],"date_download":"2018-10-23 01:12:47","date_modify":"2018-10-23 01:12:47","date_publish":"2016-01-11 11:57:44","description":"A suspected sex attacker has tried to grab three women off the street, including one he pretended to help after she tripped at a railway station. Police are ...","filename":"data/vaneerConsumption/serialsexattackerpromptspolicewarning.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-1c732c35-456e-477c-8888-1d91c6a22753-48qEJGFphM8d437f0aaf92451b8c-468_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393749_Serial-sex-attacker-prompts-police-warning_1540257167.html","title":"'serial sex attacker' prompts police warning","title_page":"'serial sex attacker' prompts police warning | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Serial sex attacker' prompts police warning\nA suspected sex attacker has tried to grab three women off the street, including one he pretended to help after she tripped at a railway station.\nPolice are warning women to take care walking alone after dark in Carshalton, Sutton, south-west London, after a series of incidents thought to involve the same man.\nThe suspect allegedly first pounced on a 34-year-old woman at around 7pm on January 7 as she walked along North Street towards the Sun pub.\nPolice warned women walking along after dark in Carshalton, Sutton, to take care\nHe is said to have sexually assaulted her, before following her to a nearby park where he grabbed at her again. She shouted and he ran off.\nTwo days later, the same man, who is Asian and in his late 20s to early 30s, helped a 22-year-old woman after she stumbled at Carshalton station at around 9.30pm.\nHe walked with her to Festival Walk where he allegedly grabbed her and tried to drag her in to a park, but failed and ran off.\nMinutes later, it is claimed the attacker began following a 27-year-old dog walker and tried to grab her as she walked along North Street towards the Sun pub.\nHe is 5ft 6in to 5ft 9in and has short, dark hair. On January 7 he wore a brown leather jacket and dark trousers, while on January 9 he wore a striped grey top and jeans.\nDetective Inspector James Carrington said: \"We believe the same man to be behind all three incidents and are appealing for anyone with information or any witnesses to come forward.\n\"We don't wish to alarm people but it is sensible advice to take care if you are walking alone after dark.","url":"https://www.dailymail.co.uk/wires/pa/article-3393749/Serial-sex-attacker-prompts-police-warning.html"}
