{"authors":[],"date_download":"2018-10-30 20:43:06","date_modify":"2018-10-30 20:43:06","date_publish":"2014-07-01 02:45:59","description":"Plans have been announced for two services to remember former Auburn tight end Philip Lutzenkirchen.","filename":"data/vaneerConsumption/ServicessetforformerAuburnstarLutzenkirchen.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_services-set-for-former-auburn-star-lutzenkirchen__1540932186.html","title":"Services set for former Auburn star Lutzenkirchen","title_page":"Services set for former Auburn star Lutzenkirchen","title_rss":"NULL","source_domain":"ajc.com","text":"Plans have been announced for two services to remember former Auburn tight end Philip Lutzenkirchen.\nAccording to the Columbus Ledger-Enquirer, a memorial service is scheduled for 8 p.m. Wednesday at the Lassiter High School football stadium.\nA funeral Mass is planned for 1 p.m. Thursday at Transfiguration Catholic Church. A visitation is planned before the service, beginning at 10:30 a.m.\nLutzenkirchen, 23, was killed in a car crash near LaGrange early Sunday. The one-vehicle accident happened around 3 a.m. at the intersection of Upper Big Springs Road and Lower Big Springs Road, the Georgia State Patrol said.\nAlso killed in the wreck was the University of Georgia’s Joseph Ian Davis, 22, of Dunwoody. Davis was driving a 2006 Chevrolet Tahoe with three passengers, including Lutzenkirchen, who was in the back seat of the SUV, GSP said. At the T-shaped intersection, Davis apparently missed a stop sign. The SUV barreled about 450 feet through a church yard and flipped over several times before coming to rest on its roof. Davis was partially ejected and Lutzenkirchen was completely ejected.\nTwo others were injured, the GSP said.","url":"https://www.ajc.com/news/services-set-for-former-auburn-star-lutzenkirchen/gTRWvhAwFV5bwHXfUcBWdL/"}
