{"authors":["Abigail Miller For Dailymail.Com"],"date_download":"2018-10-22 23:55:03","date_modify":"2018-10-22 23:55:03","date_publish":"2017-03-10 04:53:42","description":"The Defense Department is looking into d online outlets through which members of the armed forces have shared nude photographs of women, many taken without their knowledge or permission.","filename":"data/vaneerConsumption/Servicemenaresharingnudephotosofservicewomenonline.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E20037300000578-0-image-a-69_1489120679411.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299974_Servicemen-sharing-nude-photos-servicewomen-online_1540252503.html","title":"Servicemen are sharing nude photos of servicewomen online","title_page":"Servicemen are sharing nude photos of servicewomen online | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Just days after it was revealed that members of the Facebook group 'Marine's United' were sharing nude photos of females, it is coming to light that the same is occurring among other branches of the military.\nNow the Defense Department is looking into different websites and online outlets through which members of the armed forces have shared nude photographs of women, many taken without their knowledge or permission.\nThe investigation started out with just the Marines, but has spread to all branches of the military.\nThe U.S. Department of Defense is looking into different websites and online outlets through which members of the armed forces have shared nude photographs of women, many taken without their knowledge or permission\nA website, titled Anon-IB gained notoriety for publishing nude photographs of celebrities, such as Jennifer Lawrence.\nNow it has been revealed that it contains a message board for military personnel to exchange comments and crude photos of female service members, or partners of service members. Some of the female members are even identified by name or duty station, reported CBS News.\nSome of the photos posted are extremely pornographic, however others are just snaps of service women following requests for 'wins' which is a slang term for nude photos.\nA website, titled Anon-IB contains a message board for military personnel to exchange comments and crude photos of female service members, or partners of service members\nThe message board came to light days after the story of women whose nude photos were posted in the Facebook group 'Marines United' gained national attention.\nThe group had hundreds, possibly thousands of explicit photos of unsuspecting servicewomen, some who were on active duty.\nAfter the existence of the group was made public, members have been redirected to new pages, including one titled Marines United 2, or MU2. Some are also posting on groups with similar names, requesting nude photos.\nAccording to CNN, members have even taken to taunting federal and military investigators, with one writing: 'It would be hilarious if one of these FBI or (Naval Criminal Investigative Service) f***s found their wife on here,' on the original Marines United page.\nMembers of the group also shared a link to a cloud storage site containing more than 2,500 images of women in stages of undress or engaging in sexual acts.\nThere were 30,000 followers of the secret Facebook group and many members made sexually aggressive comments about the victims. Some suggested in the 2,500 photo comments that the servicemen perform sexual acts with the women and film it for the other members.\nEarlier this week, two of the victims whose pictures were leaked on the group spoke out how the experience had affected them.\nSenior Master Sergeant Ronald Green told Congress that Marines United is just the 'tip of the spear,' and a former Marine turned journalist James LaPorta said Marines United is spreading to other group chats.\nOfficials said that they have received reports of at least six other websites or groups.\nCaptain Ryan Alvis, public affairs officer for the Marines, told CBS News: 'Whoever runs it kept moving it, making it hard to even find what the scope of it was.'\n'People will immediately start blaming victims, and we are most concerned about them. They may have taken pics meant to be private and then those images could have been shared by a former close friend. So many questions that we just don't have answers to at this point.'\n'The Marine Corps is deeply concerned about allegations regarding the derogatory online comments and sharing of salacious photographs in a closed website. This behavior destroys morale, erodes trust, and degrades the individual. The Marine Corps does not condone this sort of behavior, which undermines our core values. As General Neller said in his recent Message to the Force, the Marine Corps' success in battle depends on trust, mutual respect, and teamwork.'The Marine Corps takes every allegation of misconduct seriously.'\nHe went on to say the people involved will be held accountable for their actions.\nThe Marines also released a 10 page document addressing how the misogynistic nature of the group is unacceptable.\nThe War Horse journalist and former Marine Thomas Brennan received threats after exposing the group.\nMembers are allegedly posting his addresses and phone numbers of his friends and colleagues in the group.\nBrennan told the Marine Corps Times: 'As a Marine veteran, I stand by the code: honor, courage and commitment. This story was published with the intention of standing up for what is right and staying true to the leadership principle of looking out for Marines and their families.'\nThese kinds of groups aren't new. In 2013, California Representative Jackie Speier wrote in a press release about a similar Marines Facebook group called 'F'N Wook'. She proposed multiple bills aimed to reduce sexual assault and sexual harassment in the Marines.\nIn an annual report the Pentagon released in May 2016, the U.S. military received about 6,000 reports of sexual assault in 2015, similar to the number in 2014, but such crimes are still under-represented.\nAdditionally, the behavior is so concerning to Pentagon officials because it can do real harm to the military by discouraging young women from joining the armed forces and convincing those already in uniform to retire, reported CBS.","url":"https://www.dailymail.co.uk/news/article-4299974/Servicemen-sharing-nude-photos-servicewomen-online.html"}
