{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:06:29","date_modify":"2018-10-30 22:06:29","date_publish":"2016-12-15 00:00:00","description":null,"filename":"data/vaneerConsumption/ServicescouldboostVerifone.json","image_url":"https://amp.businessinsider.com/images/5852b25dca7f0c1c008b5dfa-320-160.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_services-could-boost-verifone-2016-12_1540937189.html","title":"Services could boost Verifone","title_page":"    Services could boost Verifone - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nIn its most recent earnings presentation, US payment-terminal vendor Verifone posted tempered gains.\nThat mediocre performance was largely due to challenges related to the switch to chip cards in the US.\nBut the firm's services segment revenue posted 14% year-over-year growth, in contrast to a 22% decline in its systems segment. And now, services comprise 44% of the company's total revenue, up 10 percentage points from last year. That points to shifts in the payments industry that Verifone could move to capitalize on.\nThe firm highlighted a few areas where it plans to see strong growth. Here are two of them:\nIntegrated point-of-sale: Verifone noted its new Carbon point-of-sale (POS) offering will have several more launches with key partners, including large banks, acquirers, and retailers, in early 2017. Carbon is a robust POS platform that includes dual screens, internet connectivity, and more.\nMobility: Verifone is also seeing growth in its mobile point-of-sale (mPOS) segment as retailers increasingly want to \"engage consumers and take payments throughout the store.\" It's worth noting that BI Intelligence forecasted that there will be 27.7 million mPOS devices in the US in 2021, up from 3.2 million in 2014. Verifone is likely trying to capitalize on these trends by leveraging its strong industry positioning to grow in the segment.","url":"https://www.businessinsider.com/services-could-boost-verifone-2016-12"}
