{"authors":["Tanya Li For Daily Mail Australia"],"date_download":"2018-10-22 20:40:48","date_modify":"2018-10-22 20:40:48","date_publish":"2016-01-29 02:44:48","description":"NSW State Emergency Services commissioner, Adam Dent, will not stand down from his role after being convicted of mid-range drink-driving in Wollongong.","filename":"data/vaneerConsumption/SESAdamDentwontstanddownafterbeingcaughtdrinkdrivinginWollongong.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE720600000578-0-image-a-32_1454033316803.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421865_SES-commissioner-won-t-stand-caught-drink-driving-Wollongong_1540240848.html","title":"SES' Adam Dent won't stand down after being caught drink-driving in Wollongong","title_page":"SES' Adam Dent won't stand down after being caught drink-driving in Wollongong | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The New South Wales State Emergency Service (SES) commissioner will not stand down from his position after being convicted of drink-driving almost double the legal blood alcohol limit.\nAdam Dent, 35, has apologised to the people of NSW after he was banned from driving for six months over a drink-driving charge.\nMr Dent was convicted of mid-range drink-driving in Wollongong Local Court on Thursday after being pulled over on December 30 at Fairy Meadow, according to ABC News.\nNSW SES commissioner Adam Dent was convicted of mid-range drink-driving in a Wollongong court\nAccording to Fairfax Media, the court heard that he had a breath analysis of 0.09 - 0.04 above the limit - and drunk three glasses of wine from 4pm to 7pm while only eating cheese and biscuits before driving home.\nHe told AAP that he had made a mistake and was sorry.\n'The clear message is you need a plan B... I made a mistake. Never drink and drive,' Mr Dent said on Friday.\nHe said he is committed to serving the community and will not stand down from his role.\nMr Dent leads a team of over 10,000 volunteers and staff for the largest State Emergency Service in Australia.\nThe NSW SES is the combat agency with legislated responsibility for storms, floods and tsunami. It is also the largest volunteer provider of rescue services in NSW and supports communities through capabilities in urban search and rescue.\nMr Dent also led the Red Cross relief and recovery efforts in response to the Black Saturday bushfires in 2009 and the Victorian floods in 2011 and 2012, deploying and leading over 1,300 personnel.","url":"https://www.dailymail.co.uk/news/article-3421865/SES-commissioner-won-t-stand-caught-drink-driving-Wollongong.html"}
