{"authors":["Ken Klukowski"],"date_download":"2018-10-30 19:18:47","date_modify":"2018-10-30 19:18:47","date_publish":"2016-02-10 01:31:39","description":"The U.S. Supreme Court blocked a new rule from the EPA from going into effect, a rule that challengers say would cause energy costs to skyrocket.","filename":"data/vaneerConsumption/SetbackforObamaSupremeCourtBlocksEPACO2EmissionsRule.json","image_url":"https://media.breitbart.com/media/2015/10/ap_ap-photo1751.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_09__1540927127.html","title":"Setback for Obama: Supreme Court Blocks EPA CO2 Emissions Rule","title_page":"Setback for Obama: Supreme Court Blocks EPA CO2 Emissions Rule | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — In an unusual move, the U.S. Supreme Court blocked a new rule from the Environmental Protection Agency (EPA) from going into effect, a rule that the challengers say would cause energy costs to skyrocket.\nOne of President Barack Obama’s top priorities is fundamentally transforming America’s electrical power infrastructure through executive action. His EPA’s Clean Power Plan is the largest component of that agenda.\nOver two dozen states are challenging the EPA, joined by industry groups and business groups like the U.S. Chamber of Commerce and the National Federation of Independent Business, all of which argue that this rule would crush power generators that use fossil fuels.\nThe challengers lost before the U.S. Court of Appeals for the D.C. Circuit and asked Chief Justice John Roberts to grant a stay until the challengers could seek review in the Supreme Court.\nSuch stays are very rarely granted. The Supreme Court considers three factors, whether there is: (1) a reasonable probability that four justices will grant certiorari to review the case, (2) a fair prospect that a majority of the Court (at least five justices) will vote to reverse the lower court on the merits of the case, and (3) irreparable harm to one of the parties if the stay is not granted.\nRoberts referred it to all nine justices. By a 5-4 vote late on Tuesday, the Court granted the stay. This now gives the states and private sector time to ask the justices to take up the case.\nIt is now almost certain that the Court will take the case, to consider whether the EPA is exercising power far exceeding what Congress granted the agency in the Clean Air Act. Arguments would likely be heard in the late fall, with a decision in early 2017.\nKen Klukowski is legal editor for Breitbart News. Follow him on Twitter @kenklukowski.","url":"https://www.breitbart.com/politics/2016/02/09/supreme-court-blocks-epa-is-surprise-setback-for-obama/"}
