{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:17:17","date_modify":"2018-10-31 00:17:17","date_publish":"2018-07-11 00:00:00","description":"A Kindle copy of \"Margin of Safety,\" written by the billionaire value investor and hedge fund manager Seth Klarman, briefly sold for $9.99. Hard copies of the out-of-print book, which is considered a bible of value investing, sell for thousands of dollars.","filename":"data/vaneerConsumption/SethKlarmansMarginofSafetyavailableonAmazonKindlefor999.json","image_url":"https://amp.businessinsider.com/images/563a17669dd7cc04308bbd11-1334-667.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_seth-klarman-margin-of-safety-book-on-amazon-kindle-2018-7_1540945037.html","title":"Seth Klarman's 'Margin of Safety' available on Amazon Kindle for $9.99","title_page":"    Seth Klarman's 'Margin of Safety' available on Amazon Kindle for $9.99 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Seth Klarman, the president and CEO of The Baupost Group. Getty Images/ Scott Olson\nOne of the most prized books on Wall Street, which usually costs thousands of dollars, was briefly available to the masses for a fraction of the price.\nAn Amazon Kindle copy of \"Margin of Safety,\" written by the billionaire value investor and hedge fund manager Seth Klarman, sold for a few days for $9.99. But according to The Baupost Group, Klarman's firm, the copy was unauthorized, Fortune reported.\nThe book, which is out of print, became a collector's item on Wall Street because of its rarity and price. The cheapest hardcover copy on Amazon cost $521.91 as of Tuesday afternoon.\nA Kindle copy of \"Margin of Safety\" was briefly available for $9.99. Amazon\nBloomberg earlier reported that the Kindle copy became available on Amazon on Friday. It quickly rose to fourth place on the Business & Money charts.\nThe book, first published in 1991, is considered a bible for value investors, who include the likes of Klarman and Berkshire Hathaway CEO Warren Buffett. It explains the philosophy behind identifying undervalued stocks and includes Klarman's own investing failures along the way.\nKlarman is founder of The Baupost Group, a $30 billion hedge fund known for its secrecy. The fund's website has very little information, and its client letters rarely get circulated widely. Klarman's most recent year-end letter, obtained by Business Insider in January, warned that the global political climate posed a serious threat to democracy and international markets.\nYou can buy the book on Amazon here »","url":"https://www.businessinsider.com/seth-klarman-margin-of-safety-book-on-amazon-kindle-2018-7"}
