{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:51:46","date_modify":"2018-10-31 01:51:46","date_publish":"2018-09-11 13:10:56","description":"The fact that President Donald Trump has suggested that the U.S. attorney general investigate which senior official wrote a scathing New York Times op-ed that claimed the commander-in-chief has \"misguided impulses\" doesn't sit right with the Late…","filename":"data/vaneerConsumption/SethMeyersAnonymousOpEdSegmentComparedTrumpStaffersToShaggy.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/b7b92a27-f593-4fe9-b5db-5e1a1c593d31-screen-shot-2018-09-11-at-15542-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_seth-meyers-anonymous-op-ed-segment-compared-trump-staffers-to-shaggy-11867372_1540950706.html","title":"Seth Meyers' Anonymous Op-Ed Segment Compared Trump Staffers To Shaggy","title_page":"Seth Meyers' Anonymous Op-Ed Segment Compared Trump Staffers To Shaggy","title_rss":"NULL","source_domain":"bustle.com","text":"The fact that President Donald Trump has suggested that the U.S. attorney general investigate which senior official wrote a scathing New York Times op-ed that claimed the commander-in-chief has \"misguided impulses\" doesn't sit right with the Late Night with Seth Meyers host. In Monday's episode, Seth Meyers compared Trump staffers to Shaggy because many have spoken out to assure the president it wasn't them. This, Meyers says, is one of the most bizarre phenomenons to come out of the Trump White House.\n“One of the weirdest aspects of having Donald Trump as president is the fact that every few months or so people working at the highest levels of government have to put down everything they’re doing and hunt for the anonymous mole who just called the president a brain-dead moron,” the late-night host said during Monday's Late Night with Seth Meyers.\nMeyers went on to explain that it's a recurring theme with Trump.\n\"Someone calls the president an idiot. Or they call him a fifth-grader. Or they leak a transcript of him telling the president of Mexico he wants a piñata for his birthday,\" Meyers said. \"And then serious government officials and four-star generals have to issue so many denials they start to sound like Shaggy.\"\nThe op-ed in question — entitled \"I Am Part of the Resistance Inside the Trump Administration\" — was published anonymously on Sept. 5. Trump administration officials from Vice President Mike Pence to Homeland Security Secretary Kirstjen Nielsen have publicly denied penning the article.\n\"Secretary Nielsen is focused on leading the men and women of DHS and protecting the homeland — not writing anonymous and false opinion pieces for the New York Times,\" DHS Press Secretary Tyler Q. Houlton said in a statement obtained by CNN. \"These types of political attacks are beneath the Secretary and the Department's mission.\"\nMeyers' point was that Nielsen, Pence, and Trump's other Cabinet members were wasting time issuing denials and subsequently searching for the person who wrote the op-ed. White House Counselor Kellyanne Conway claimed on CNN that the author likely broke the law by divulging national security secrets — though Jake Tapper noted that none appeared in the piece.\nLate Night with Seth Meyers on YouTube\n\"The fact is calling Donald Trump a moron is not a crime. It's not even new information,\" Meyers said. \"And yet, he's very obviously freaked out by both the anonymous op-ed and famed journalist Bob Woodward's blockbuster new book, Fear.\"\nMeyers mocks Trump for fixating on leaks from within the White House that warn the country that the president is erratic and unstable, yet going on national TV and \"acting erratic and unstable.\" The segment proved this by playing a clip from a recent Trump rally during which the president couldn't pronounce the word \"anonymous\" while railing against the Times op-ed.\nAlthough Attorney General Jeff Sessions hasn't said that he'll formally investigate who's leading the resistance within the White House, the fact remains that Trump and his top aides have put time and energy into speaking out against the article's claims — time and energy that could be spent solving much larger problems.","url":"https://www.bustle.com/p/seth-meyers-anonymous-op-ed-segment-compared-trump-staffers-to-shaggy-11867372"}
