{"authors":[],"date_download":"2018-10-22 23:01:39","date_modify":"2018-10-22 23:01:39","date_publish":"2014-05-13 15:27:14","description":"Seven Ukrainian soldiers were killed and seven more were injured in an ambush by separatists in the eastern part of the country, officials said.","filename":"data/vaneerConsumption/SevenUkrainianSoldiersKilledinSeparatistAmbush.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_seven-ukrainian-soldiers-killed-separatist-ambush-n104231_1540249299.html","title":"Seven Ukrainian Soldiers Killed in Separatist Ambush","title_page":"Seven Ukrainian Soldiers Killed in Separatist Ambush","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSeven Ukrainian soldiers were killed and seven more were injured in an ambush by separatists in the eastern part of the country, officials said.\nPro-Russia separatists staged an ambush on Ukrainian troops and vehicles 20 kilometers from the eastern city of Kramatorsk, the Ukrainian Defense Ministry said in a statement. The separatists used grenade launchers and firearms, the statement said. More than 30 attackers were hiding in bushes near a river.\nInitially, six Ukrainian soldiers were reported killed, but a seventh died in a helicopter on the way to the hospital, news agency Interfax said.\nKramatorsk is in the Donetsk region, one of two regions in eastern Ukraine that held referendums for independence Sunday.\nThe U.S. government said it would not recognize Monday's sovereignty declarations, with U.S. State Department spokeswoman Jen Psaki calling the voting process \"suspect.\"\n— Elizabeth Chuck","url":"https://www.nbcnews.com/storyline/ukraine-crisis/seven-ukrainian-soldiers-killed-separatist-ambush-n104231"}
