{"authors":[],"date_download":"2018-10-23 01:52:17","date_modify":"2018-10-23 01:52:17","date_publish":"2016-01-28 16:20:56","description":"Seven Hamas militants were confirmed killed Thursday after a tunnel built for fighting Israel collapsed in the Gaza Strip, highlighting concerns that yet ano...","filename":"data/vaneerConsumption/SevenHamasmilitantskilledinGazatunnelcollapse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g79k-4vVdYopwYQ7f641721b07af15435-984_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420646_Seven-Hamas-militants-killed-Gaza-tunnel-collapse_1540259537.html","title":"Seven Hamas militants killed in Gaza tunnel collapse","title_page":"Seven Hamas militants killed in Gaza tunnel collapse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Seven Hamas militants killed in Gaza tunnel collapse\nSeven Hamas militants were confirmed killed Thursday after a tunnel built for fighting Israel collapsed in the Gaza Strip, highlighting concerns that yet another conflict could eventually erupt in the Palestinian enclave.\nThe Ezzedine Al-Qassam Brigades, Hamas's armed wing, said that four militants managed to escape after the collapse late on Tuesday in the northeast of the strip.\nThe collapse occurred after several days of rain.\nTunnels have been used to store weapons or stage attacks, including by passing under the Israeli border during the 2014 war ©Mahmud Hams (AFP/File)\nAl-Qassam Brigades said the seven \"martyrs\" were killed \"when they were going to prepare for fighting with the enemy.\"\nEight militants were initially reported missing by a security source. A Hamas source said three managed to escape within the first hour of the collapse, while a fourth was later rescued.\nThe rescued man was injured, the source said, but it was not clear how seriously. Officials from Hamas, the Islamist movement that rules the Gaza Strip, were seeking to keep tight control over information regarding the incident.\nThe collapse comes at a time of renewed focus on tunnels in Gaza, with Israel accusing Hamas of reconstructing them with the aim of attacking it following its 2014 war with Palestinian militants in the enclave, when many were destroyed.\nAl-Qassam Brigades said the men killed were working on rebuilding a tunnel previously used for attacks when the collapse occurred. It was not clear if it was referring to the tunnel that collapsed or another connected to it.\nSeveral idle bulldozers could be seen on Thursday morning in an area next to a farm where the tunnel is believed to have been located. The area is about a kilometre (0.6 miles) from the Israeli border.\n- Tunnels on TV -\nSuch tunnels have been used in the past to store weapons or stage attacks, including by passing under the Israeli border during the 2014 war.\nIn June 2006, a group of Hamas and other militants entered Israel through a cross-border tunnel, seized Israeli soldier Gilad Shalit and took him back to Gaza.\nAfter the statement on the deaths was issued on Thursday, Hamas-run Al-Aqsa television broadcast a programme on tunnel operations, including the targeting of Israeli tanks.\nGaza has remained largely calm since a wave of Palestinian knife, gun and car-ramming attacks began in October in the West Bank, Jerusalem and Israel, though a number of people have been killed by Israeli forces during violent protests along the Gaza border.\nSome analysts believe Hamas would not like to see another war now and is instead focused on rebuilding following the 2014 conflict.\nReconstruction has been slow due to the Israeli blockade on the territory, a lack of donor funds and problems with coordination between Hamas and the Palestinian Authority, which is based in Ramallah in the West Bank and dominated by rival Fatah.\nBut Hamas has also faced pressure from militants within Gaza, including Salafist jihadists who have claimed responsibility for recent rocket fire from the enclave into Israel.\nHamas uses the tunnels both for attacks and as a rallying cry, saying they are needed for \"resistance\" against Israel. Those killed in this week's collapse were being portrayed as heros.\nTunnel collapses have previously occurred in the coastal strip, which has seen three wars with Israel since 2008.\nOn Saturday, a tunnel collapse killed a 30-year-old man, according to Hamas officials. Residents said the tunnel was located in Al-Maghazi in the central Gaza Strip.\nIn December, 14 Palestinians were rescued after being stranded for hours in a tunnel near the Egyptian border when it flooded and partially collapsed.\nTunnels in that area are more typically used for smuggling.\nAt the end of 2014, Egypt began the construction of a buffer zone in the northern Sinai Peninsula, on the border with Gaza, including destroying hundreds of tunnels it says are used for smuggling weapons and other items.\nIsrael's blockade severely restricts the movement of people and goods into and out of the enclave.\nEgypt's border with Gaza has also remained largely closed following the 2013 overthrow of the country's president Mohamed Morsi of the Muslim Brotherhood, effectively trapping 1.8 million Gazans into the territory.","url":"https://www.dailymail.co.uk/wires/afp/article-3420646/Seven-Hamas-militants-killed-Gaza-tunnel-collapse.html"}
