{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 21:57:28","date_modify":"2018-10-22 21:57:28","date_publish":"2017-04-26 03:02:06","description":"After all the controversy Seven Year Switch's Kaitlyn Isham, 28, seemed keen for a spot of adult shopping, ducking into a sex shop in Melbourne on Monday.","filename":"data/vaneerConsumption/SevenYearSwitchsKaitlynIshambuyssextoys.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9BB52E00000578-0-image-a-10_1493171698393.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446096_Seven-Year-Switch-star-Kaitlyn-Isham-buys-sex-toys_1540245448.html","title":"Seven Year Switch's Kaitlyn Isham buys sex toys","title_page":"Seven Year Switch's Kaitlyn Isham buys sex toys | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's made headlines for her 'grotty' vibrator and past work as an adult webcam model.\nAnd even after all the controversy, Seven Year Switch's Kaitlyn Isham, 28, seemed keen for a spot of adult shopping, ducking into a sex shop in Melbourne on Monday.\nThe university student was perhaps encouraged to purchase a new sex toy after viewers labelled her vibrator 'grotty' and 'dirty' after she showed off the device on national television.\nStocking up! Controversial Seven Year Switch star Kaitlyn Isham heads to an adult store to buy sex toys after viewers were left repulsed by her 'dirty vibrator' on show\nKaitlyn was dressed casually for the X-rated shopping excursion, wearing a pair of patterned leggings and a black singlet.\nHer face was the picture of concentration as she browsed a series of vibrators.\nThe university studio appeared particularly taken with the 'Magic Hand Dildo', picking up the device to examine it closer.\nLooking to spice things up? Kaitlyn also took time to browse a series of whips at the adult sex shop\nKaitlyn also took time to browse a series of whips, the bubbly American picking up one with pink tassels for closer inspection.\nBut in the end she left the store without a pleasure apparatus or whip, instead settling on a more basic item.\nThe Seven Year Switch star headed to the payment counter with sex toy cleaner fluid in hand.\nLast week, viewers took Kaitlyn to town on social media after she showed off her 'grotty' vibrator on Seven Year Switch, with audiences quick to notice its ridged edges were caked in dirt.\nThink pink? While browsing the sex toys Kaitlyn appeared taken with a pink tassled whip\nSelf conscious about something? The Seven Year Switch star headed to the payment counter with a sex toy cleaner in hand\nAn outraged Twitter user wrote: 'F*****G HELL give that vibrator a wash once in a while!!!'\nAnother tweeted: 'That woman would have a seven year itch from the fungus growing on that dildo.'\nDaily Mail Australia has also revealed sexually explicit photos of Kaitlyn have been circulating online, taken from when she worked as an adult webcam model.\nKaitlyn is currently appearing on Seven Year Switch to try and save her relationship with boyfriend of three years, IT professional Mark.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446096/Seven-Year-Switch-star-Kaitlyn-Isham-buys-sex-toys.html"}
