{"authors":[],"date_download":"2018-10-30 19:49:44","date_modify":"2018-10-30 19:49:44","date_publish":"2015-12-18 16:39:27","description":"Opening in 2017, Mercedes-Benz Stadium will set a new standard for multi-purpose stadium design, taking the fan and guest experience to new heights for football, soccer and other sports and non-sports events.","filename":"data/vaneerConsumption/SevensurprisingwaysMercedesBenzStadiumwillchangethe.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/19/Images/photos.medleyphoto.8407742.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_seven-surprising_165ff42500111594a6f9e3e64fd3a8cc__1540928984.html","title":"Seven surprising ways Mercedes-Benz Stadium will change the...","title_page":"Seven surprising ways Mercedes-Benz Stadium will change the...","title_rss":"NULL","source_domain":"ajc.com","text":"Opening in 2017, Mercedes-Benz Stadium will set a new standard for multi-purpose stadium design, taking the fan and guest experience to new heights for football, soccer and other sports and non-sports events.\nThe new stadium will replace the Georgia Dome, which has served as the home of the Atlanta Falcons since 1992. Mercedes-Benz Stadium will also be home to Atlanta United FC, a Major League Soccer expansion team that will begin play in 2017.\nBuilt for event flexibility, the capacity of Mercedes-Benz Stadium can be expanded to 75,000 seats to host events like the Super Bowl, or up to 83,000 seats for the NCAA Final Four, which the building will host in 2020. Further, as part of environmental sustainability plans for building construction and operations, Mercedes-Benz Stadium is currently tracking toward the goal of LEED Platinum certification, which would make it the first professional sports venue to achieve this highest level.\n\"This building will be a game changer in many areas,\" said Scott Jenkins, general manager of Mercedes-Benz Stadium. \"Mercedes-Benz Stadium is a beautiful, iconic building that enhances the downtown Atlanta landscape.\"\nHere are seven surprising ways Mercedes-Benz Stadium will change the game for fans:\n1. Scoring with architecture and design: The stadium, which will stand some 30 stories high, is being touted as an architectural wonder, with considerable attention paid to enhancing the fan and guest experience before they even enter the stadium. The exterior fan plaza is expected to be a popular gathering place on game day, offering plenty of space for camaraderie and ease of access to and from the stadium.\n2. Rise up: Fans will immediately notice the eight-petal retractable roof which, unlike many other stadium retractable roofs, can open or close in less than seven minutes. With Atlanta’s temperate climate and beautiful fall days, the Falcons anticipate playing its games in the open-air environment the roof provides. \"We plan to take the approach that this is an open-air stadium that can be closed, not the other way around,\" said Mike Gomes, senior vice president of fan experience for AMB Sports & Entertainment Group.\n3. Window to the city: Offering both interior and exterior views as well as natural sunlight, the floor-to-ceiling window to the city allows fans and guests the opportunity to connect with the downtown skyline. Most of the exterior walls of Mercedes-Benz Stadium will feature large windows, so a fan's experience should be a bright one, with a compelling view of downtown Atlanta and an overall sense of a much brighter venue. \"The window to the city, along with the retractable roof and other glass-like exterior walls in the building create a freshness and brightness and make the stadium feel bigger than it already is,” Gomes said.\n4. Hello to halo: If architecture and presentation don't leave fans in awe, the 58-foot-high, 360-degree, high-definition halo video board circling the roof is a one-of-a-kind feature that will no doubt be an attraction on its own. It's not only the largest video board in professional sports, at 1,100 lineal feet long or nearly 64,000 square feet, it's the largest video board in the world. Complementing the state-of-the-art video board will be a 100-foot-high \"mega column\" wrapped with a 3-Dimensional video board, as well as 1,100 linear feet of LED ribbon boards. The stadium's state-of-the-art audio system will be paired with these video features, providing multiple opportunities for entertaining fans and guests at all events. \"We have the ability to put on a show unlike any show for sports events, concerts, conventions – anything we host in the venue,\" Jenkins said.\"\n5. Let there be light: Watching an event will be a brighter experience, thanks in no small part to the planned installation of LED sports lights, which provide a better quality of light than a traditional metal halide sports lamp. \"LED is of a higher quality, is more natural and you can control it and make it part of the show,\" Jenkins said. “And as a bonus, it’s more energy efficient.”\n6. Satisfying hungry fans: Mercedes-Benz Stadium will have more than 650 points of sale for concessions, with twice the number of cooking stations and grill space than in the Georgia Dome, offering faster service and fresher food for hungry fans. Each concourse will offer signature concessions, including a 100-yard bar on the upper concourse and a lounge at field level. \"We're mindful of creating something fun and unique for fans regardless of where they are sitting,\" Gomes said.\n7. Room to roam: In addition to the fan plaza outside, the interior of Mercedes-Benz Stadium will showcase plenty of space on the concourses and will feature 23 escalators, 19 elevators and an expanded number of restroom facilities. \"Fans and guests will enjoy 360-degree circulation around the building and expansive concourse spaces,\" Jenkins said. \"There's a lot more space to move around and more destination points to gather.\"\nThis article is presented in collaboration with the Atlanta Falcons. For more information about Mercedes-Benz Stadium or to visit the Mercedes-Benz Preview Center, visit Mercedes-Benz Stadium.com or call 678-686-4400.","url":"https://www.ajc.com/news/local/seven-surprising-ways-mercedes-benz-stadium-will-change-the-game-for-fans/Oh4N6QEoUGpagRSTJmlTaK/"}
