{"authors":[],"date_download":"2018-10-22 20:39:51","date_modify":"2018-10-22 20:39:51","date_publish":"2016-01-28 02:35:25","description":"World Rugby forecasts a \"game-changing\" 2016 for the sport with sevens making its Olympic debut in Rio. But interest in the game's short-form is waning in th...","filename":"data/vaneerConsumption/SevensOlympicdebutfailstoimpressNewZealanders.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5a1-4vVdYopwYQ7f641721b07a793b44-170_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420289_Sevens-Olympic-debut-fails-impress-New-Zealanders_1540240791.html","title":"Sevens Olympic debut fails to impress New Zealanders","title_page":"Sevens Olympic debut fails to impress New Zealanders | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sevens Olympic debut fails to impress New Zealanders\nWorld Rugby forecasts a \"game-changing\" 2016 for the sport with sevens making its Olympic debut in Rio. But interest in the game's short-form is waning in the 15-a-side code's New Zealand stronghold, despite the appearance of superstar World Cup winner Sonny Bill Williams at the Wellington Sevens this week.\nNew Zealand considers itself the spiritual home of rugby, yet only about a third of the available tickets have been sold for this weekend's round of the World Sevens Series in the capital.\nFor a tournament that was once an automatic sellout at the 35,000-seat Westpac Stadium, ticket sales slumped to 18,000 a day last year and are down to 12,000 this year, even though New Zealand are setting their sights on Olympic gold.\nNew Zealand's Declan O'Donnell evades a tackle from Fiji's Pio Tuwai during their IRB's 10-leg World Rugby Sevens Series match, in Dubai, in December 2015 ©Karim Sahib (AFP/File)\nThis is in sharp contrast to Australia, which is on track to have a capacity 70,000 crowd at Allianz stadium for the Sydney round of the series the following weekend.\nInterest in sevens in Australia is said to be rising after they made the 15-a-side World Cup final last year where they were beaten by New Zealand.\nWorld Rugby chairman Bernard Lapasset said in his overview for 2016 that it will be \"game-changing as the Olympic Games provides an exciting opportunity for the world's top teams to showcase the dynamism\" of sevens on sport's biggest stage.\nThe Olympic debut \"is a major and exciting catalyst behind record participation growth ... in a sport that has multiple social and performance benefits from the playground to the podium,\" he said.\nNew Zealand Rugby chief executive Steve Tew had also claimed this would be \"a very exciting year for sevens with the Olympics in Rio de Janiero just around the corner.\"\nBut not even confirmation that one of rugby's most high profile personalities and double-World Cup winner in the 15-a-side code, Williams, will be playing in Wellington has made a difference to flagging ticket sales.\nTew revealed only 12,000 tickets had been sold for each day in Wellington.\n\"I don't think it's made a huge difference to date,\" he said of the impact of Williams's inclusion in the New Zealand squad.\nMulti-sports star Williams -- a member of the World Cup winning 15-a-side All Blacks in 2011 and 2015 -- is making his debut in the sevens branch of the game where New Zealand have won the World Series 12 times in its 16-year existence.\n- 'Full yawn' -\nProminent New Zealand rugby writer Wynne Gray said there was an assumption sevens would become more fashionable now it has been included in the Olympics but he rated it: \"Half a game, half an audience and a full yawn.\"\nSevens' devotees were dwindling and \"it's becoming an acquired choice for people's entertainment dollar rather than a lemming-like popularity rush,\" he wrote in the New Zealand Herald.\nThe general manager of the Wellington Sevens, Steve Dunbar, remained hopeful ticket sales would improve but said it was clear changes were needed in the way the tournament was run.\n\"We had 14 or 15 hugely successful years but it was time to shake things up. We have started afresh with new dates, new days - Saturday and Sunday - and new ticket options,\" he told AFP.\n\"We expect a big walk-up crowd as fans can decide on the day whether they want to come along.\"\nFiji and South Africa who won the opening rounds of the 2015-16 series in Dubai and Cape Town head the table going into Wellington with 35 points ahead of USA and Argentina (both on 29), England (26) and France and New Zealand (both 25).\nAlthough rugby is preparing to make its Olympic debut in the abbreviated form, it has been played in the full 15-a-side version at four Olympics.\nThe United States won gold the last time rugby was included at the 1924 Paris Games.\nNew Zealand's rugby code-hopper Sonny Bill Williams signs his autograph for a fan in Christchurch, in November 2015, following their Rugby World Cup win against Australia in England ©Fiona Goodall (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420289/Sevens-Olympic-debut-fails-impress-New-Zealanders.html"}
