{"authors":[],"date_download":"2018-10-22 20:50:03","date_modify":"2018-10-22 20:50:03","date_publish":"2014-06-03 10:01:35","description":"Severe thunderstorms threaten destructive winds, hail, tornadoes - and even a possible derecho - for much of the Plains and the Midwest.","filename":"data/vaneerConsumption/SevereStormsTornadoesPossibleDerechoforPlainsMidwest.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/483236/140603-thunder-warning-6a_f044303a826ed2c0dc41d5ccb8fb2117.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_severe-storms-tornadoes-possible-derecho-plains-midwest-n121011_1540241403.html","title":"Severe Storms: Tornadoes, Possible Derecho for Plains, Midwest","title_page":"Severe Storms: Tornadoes, Possible Derecho for Plains, Midwest","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA dense pattern of severe thunderstorms threatens to bring destructive winds, hail, tornadoes and even a possible derecho to much of the Plains and the Midwest on Tuesday, forecasters said.\nStrong tornadoes could develop in Nebraska and northern Kansas on Tuesday afternoon, while for Wednesday the threat area extends from southeast Iowa and east Missouri through the Ohio Valley to West Virginia and southwest Virginia.\n“The main severe threat Tuesday night is damaging wind gusts, although hail and tornadoes cannot be ruled out,” said Weather Channel lead meteorologist Kevin Roth.\nLess severe thunderstorms are also likely to bring heavy rain to the east coast, including New York, Philadelphia, Washington D.C. and Boston.\nCosmic Log: What is a derecho?\n“Tuesday night the thunderstorms likely congeal into a complex of severe thunderstorms that move east-southeast from the Plains to the mid-Mississippi and lower Ohio Valleys,” Roth said.\nA derecho – a 200-mile long straight line of damaging wind – is most likely to occur Tuesday night and into Wednesday, he said.\n“Damaging wind gusts, hail and tornadoes are still possible Wednesday,” he said.\nSeparately, hot weather means thunderstorms are likely in parts of the Deep South over the next few days, bringing “potentially dangerous cloud-to-ground lightning and rain-slicked roads” but no severe weather, Roth added.\n-Alastair Jamieson","url":"https://www.nbcnews.com/news/weather/severe-storms-tornadoes-possible-derecho-plains-midwest-n121011"}
