{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:42:58","date_modify":"2018-10-30 20:42:58","date_publish":"2015-10-31 16:06:02","description":"Flooding, tornadoes, and severe winds have hit Texas. Two are dead and others are missing after being caught up in rushing flood waters.","filename":"data/vaneerConsumption/SevereWeatherHitsTexaswithFloodingandTornadoesTwoDeadOthersMissing.json","image_url":"https://media.breitbart.com/media/2015/10/tornado.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_10_31__1540932178.html","title":"Severe Weather Hits Texas with Flooding and Tornadoes: Two Dead, Others Missing","title_page":"Severe Weather Hits Texas with Flooding and Tornadoes: Two Dead, Others Missing","title_rss":"NULL","source_domain":"breitbart.com","text":"Flooding, tornadoes, and severe damaging winds have hit the central and southeast portions of the Lone Star state. Two are dead and others are missing after being caught up in rushing flood waters. Tornadoes have touched down in three central Texas cities causing damage. Flash flood watch and flood advisory warnings have been issued for east central and eastern regions.\nAlthough the weather is expected to move eastward towards Louisiana and Mississippi later this weekend, flood warnings and severe rain is expected to continue to hit Texas.\nOn Friday, the San Antonio area was hit with tornadoes, and over 18 inches of rain struck the Austin area causing flash flooding.\nOne has died in Austin, and another in San Antonio, after flash floods caught them up in waters. More than 14 inches of rain pounded central Texas Friday morning.\nThe Austin-Bergstrom International Airport was closed for most of the day, as reported by the Austin American-Statesman. The air traffic control tower was flooded by over six inches of water after the area received 14 inches of water.\nThe Austin affiliate of ABC reported that the Travis County Sheriff’s Office said they were working to recover the body of a man who was swept away on Friday morning in southern Travis County (Austin). They are also looking for another man who was swept off the roof of his car near SH 130 and FM 812.\nThe Statesman also reported that Onion Creek reached 39 feet on Friday afternoon where it crosses U.S. 183. Onion Creek is a neighborhood in Austin. The creek starts in Hays County and empties into the Colorado River.\nAn elderly woman was reported missing in southeast Travis County early Friday afternoon. Rescue crews were trying to help the woman and her husband. Crews were able to get her husband safely to a hospital.\nOfficials have issued warnings to stay off of miles of Interstate 35 between San Antonio and Austin because of flooding.\nWimberly in the hill country has once again been hit with flooding after the Blanco River rose 26.5 feet on Friday. The city and its county, Hays County, was hit Memorial Day weekend as waters swelled 33 feet in just three hours, as reported by Breitbart Texas. An estimated 1,000 homes were flooded and families were swept away in flood waters.\nAn emergency shelter in San Marcos was threatened and the roads around the San Marcos Activity Center were overrun by water on Friday.\nTornado watch warnings have been issued for the south central and southeast regions.\nTornadoes touched down in three central Texas cities, including the cities of D’Hanis and Zorn. A tornado and strong winds were reported in Floresville, a small city in the San Antonio metropolitan area. A man interviewed by KENS 5 said the tornado sounded like there were gunshots outside.\nThe coastal regions of the state are still being hit with rains, and flash flood warnings have been issued for the area already saturated with rains from Hurricane Patricia. Almost 12 inches was dumped on the region last weekend.\nOn Saturday morning, rain has been focused in the Houston area causing flooding and power outages. A tornado was reported in southern Harris County and the area has received four to seven inches of rain since Friday night.\nThe National Weather Service has issued a Flash Flood Watch until noon Saturday for the following counties: Bell, Bosque, Comanche, Coryell, Ellis, Erath, Falls, Freestone, Hamilton, Henderson, Hill, Hood, Johnson, Lampasas, Leon, Limestone, McLennan, Milam, Mills, Navarro, Robertson and Somervell.\nThe weather is supposed to move eastward towards Louisiana and Mississippi this weekend but in the meantime, flood watches and severe thunderstorms have been predicted for the Gulf Coast.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. Follow her on Twitter@LanaShadwick2","url":"https://www.breitbart.com/border/2015/10/31/severe-weather-hits-texas-flooding-tornados-two-dead-others-missing/"}
