{"authors":[],"date_download":"2018-10-22 22:35:25","date_modify":"2018-10-22 22:35:25","date_publish":"2014-06-10 15:56:52","description":"In the worst drought in California's history, the state Senate killed a bill that would have placed a moratorium on the use of hydraulic fracturing.","filename":"data/vaneerConsumption/SevereWaterShortageinWestFailstoStopFrackingatGasWells.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/499561/140610-140610-fracking-1202_3707b1c748a9f3ba84d1e7384499e065.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_energy_severe-water-shortage-west-fails-stop-fracking-gas-wells-n127416_1540247725.html","title":"Severe Water Shortage in West Fails to Stop Fracking at Gas Wells","title_page":"Severe Water Shortage in West Fails to Stop Fracking at Gas Wells","title_rss":"NULL","source_domain":"nbcnews.com","text":"Critics of fracking, may have hoped drought-ridden states might be inclined to shut down the oil and gas extraction method that uses huge amounts of water.\nBut just last month, in the midst of the worst drought in California's history, the state Senate killed a bill that would have put a moratorium on the state's use of hydraulic fracturing.\nThe battle over water and the need to drill for energy is likely to get worse, said Christiana Peppard, a professor of science and theology at New York's Fordham University and an expert in the field of water ethics.\n\"In arid states, there is a mounting tension between agricultural interests and oil and gas interests,\" said Peppard. \"Conflicts over water rights and use in the West are as old as Manifest Destiny, and this is the newest [iteration],\" she said. In the 19th century, Manifest Destiny was the widely held belief that American settlers were destined to expand throughout the continent.\nThose in the oil and gas industry say the focus of fracking's water use is misplaced.\n\"What's mostly left out of these discussions is that water for fracking is dwarfed by other uses,\" said Steve Everley, director of Energy in Depth, a research program of the Independent Petroleum Association of America.\nEverley said agriculture uses far more water than fracking—with at least 80 percent of all surface and ground water use in the U.S. going to the agriculture industry.\n\"Suggesting that fracking is causing or intensifying the drought is just not supported by the facts,\" he said.\nUsed since the 1940s, hydraulic fracturing is the process of drilling and injecting fluid into the ground at high pressure in order to fracture shale rock to release natural gas and oil. The fluid is a combination of water and chemicals, mixed with sand.\nAs of now, the method is in use in 17 states, with a total of some 82,000 wells nationwide.\nOne constant back and forth over fracking is the safety of the liquid used in the process. Opponents fear that nearby ground water used for drinking could become contaminated from seepage of the chemical-based liquid.\nDrilling companies are not required to release information on the types of chemicals used in fracking.\n\"About 20 percent of water used in fracking gets trapped underground where there have been some incidents of freshwater reservoirs and aquifers getting polluted,\" said Jose Lopez, a physics professor at Seton Hall University. \"This issue is a concern as it's not easy to clean these freshwater sources.\"\nSome experts say the fear is overblown.\n\"Based on a study by MIT, very few safety breaches have occurred that have caused contamination,\" said Todd Recknagel, CEO of AM Conservation Group, a manufacturer and distributor of energy and water conservation products.\nBeyond water safety, severe drought in the West has raised the issue of water usage.\nDrought states such as Texas and Colorado are operating the most fracking wells— with 33,753 and 18,168 wells, respectively. California has around 95 oil and gas wells that use the process.\nA study released last year by the nonprofit business sustainability group Ceres, said increased fracking is creating more competition over water supplies, especially in states under water stress.\nThe report states that In Colorado, 92 percent of the fracking wells were in extremely high water-stress regions. In Texas, 51 percent of the wells were in high or extremely high stressed regions.\n\"These findings highlight emerging tensions in many U.S. regions between growing hydraulic fracturing activity and localized water supply needs,\" Ceres President Mindy Lubber said on the group's website.\nAn estimated 3 million to 5 million gallons of fresh water are used in the fracking process for each well, according to experts. And that's a problem where water is scarce, said Fordham's Peppard.\n\"None of that water is reclaimable,\" she said. \"It can't re-enter the watershed in a meaningful way due to the chemically laden and toxic nature of the water.\"\nBut Everley counters that fracking accounts for only 0.3 percent of all freshwater consumption in the U.S. And, he added, oil production can produce water used for agriculture purposes, as it has in California.\nAfter the state Senate failed to ban fracking, California's Democratic Gov. Jerry Brown said the process was needed for jobs and oil production.\nBu opponents are forging ahead, whether it's because of the drought or the water safety issue.\nDespite not having fracking in their areas, several cities and counties in California have voted to ban the practice. Similar actions have taken place or are planned in Colorado and Texas.\nWith predictions of the drought expected to get worse this summer, and the use of fracking on the increase, the fight boils down to better water management, said Will Sarni, director and practice leader in enterprise water strategy at Deloitte Consulting LLP.\n\"There is no doubt there is competition for water,\" he said. \"We just need to be mindful of certain sectors and work toward better efficiency.\"\nFor Peppard, a resolution to the issue comes from thinking about future generations.\n\"The bigger question is whether prioritizing clean water for fracking is a good use of water in drought states,\" she said. \"The challenge is to get our priorities in order.\"","url":"https://www.nbcnews.com/business/energy/severe-water-shortage-west-fails-stop-fracking-gas-wells-n127416"}
