{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 22:04:54","date_modify":"2018-10-22 22:04:54","date_publish":"2017-04-26 03:32:18","description":"Kaitlyn Isham has been slammed by Seven Year Switch 2016 participant Jackie Martin over her adult webcam past and reasons for appearing on the show.","filename":"data/vaneerConsumption/SevenYearSwitchsJackieSLAMSKaitlyn.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B61C900000578-0-image-a-47_1493166586690.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445914_Seven-Year-Switch-s-Jackie-SLAMS-Kaitlyn_1540245894.html","title":"Seven Year Switch's Jackie SLAMS Kaitlyn","title_page":"Seven Year Switch's Jackie SLAMS Kaitlyn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's courted controversy after sexually explicit webcam photos surfaced last week.\nAnd now Kaitlyn Isham has been slammed by Seven Year Switch 2016 participant Jackie Martin over her adult webcam past and reasons for appearing on the show.\nOn Tuesday, Jackie claimed Kaitlyn was only cast because 'producers were so desperate to get people to have sex on the show'.\n'The producers were so desperate to get people to have sex on the show, they actually called in a professional!' Seven Year Switch's Jackie (right) SLAMS Kaitlyn (left) after explicit photos surfaced\nJackie appeared on last year's series of Seven Year Switch alongside her partner Tim Naughton in an attempt to salvage their relationship.\nTheir time on the reality TV show seemed to do the trick for their struggling romance, with Tim proposing to Jackie during the series finale and welcoming their first child together, a son Chadwick, last September.\nOn Tuesday, Jackie took to Instagram to recap last night's episode before laying into Kaitlyn over her webcam past.\nMore loved up than ever! Jackie appeared on last year's series of Seven Year Switch alongside her partner Tim Naughton in an attempt to salvage their relationship\nLast week, Daily Mail Australia revealed had sexually explicit photos of Kaitlyn were circulating online, taken several years ago while she worked as an adult webcam model.\nKaityln confirmed the photos were taken during a dark time in her life after her brother died in a motorcycle accident.\n'So the producers were so desperate to get people to have sex on the show,' Jackie wrote of Kaitlyn's casting.\nRevealed: Last week, Daily Mail Australia revealed had sexually explicit photos of Kaitlyn were circulating online\nDaily Mail Australia has contacted Channel Seven and Kaitlyn for comment.\nUniversity student Kaitlyn is appearing on Seven Year Switch with her partner of three years, IT professional Mark.\nShe has made waves on the series for packing her vibrator and increasingly flirtatious behaviour with her switch therapy partner Michael, going skinny dipping together on Tuesday night's episode.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445914/Seven-Year-Switch-s-Jackie-SLAMS-Kaitlyn.html"}
