{"authors":["Katie French For Mailonline"],"date_download":"2018-10-23 02:19:58","date_modify":"2018-10-23 02:19:58","date_publish":"2017-03-10 11:26:46","description":"This was the scene on a London train platform yesterday when seven nuns were spotted at Seven Sisters station (pictured). Onlooker Ben Patey, 33, said he had to do a double-take.","filename":"data/vaneerConsumption/SevennunsspottedatSevenSisterstubestation.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E2200A700000578-0-image-a-11_1489140601270.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300862_Seven-nuns-spotted-Seven-Sisters-tube-station_1540261198.html","title":"Seven nuns spotted at Seven Sisters tube station","title_page":"Seven nuns spotted at Seven Sisters tube station | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A commuter couldn't help but smile yesterday afternoon as he noticed seven nuns waiting for a train - at Seven Sisters tube station.\nBut any irony of the bizarre coincidence appeared to go straight over the nuns' habits, as the group relaxed until the tube arrived.\nOne was spotted enjoying a takeaway coffee while another killed the time by knitting.\nBut onlooker Ben Patey, 33, couldn't help but be amused.\nWhat do you call a tube platform with seven sisters on it? Nun of your business! Onlooker left open mouthed after spotting the group at the North London station\nMr Patey said: 'I had just had a long day and I was waiting to jump on the train when I looked across and saw the nuns and the sign.\n'I had to do a double-take. It was one of those strange but amusing moments.'\nBut it remains a mystery where the sisters were from or where they were travelling to.\nThe closest convent to the station said it was not their nuns sighted and added it was a rare event to see so many together at once.\nSister Agnes of St Annes in Stoke Newington said: ‘It is quite rare to see seven together at one time, we are a convent of 13.’\nShe explained each alter has their own colour palette for the distinctive uniforms.\nBen Patey, who photographed the moment on a London train platform when seven nuns were spotted at Seven Sisters station,\nIn the picture, the seven sisters are wearing black gowns with either a habit of the same colour, or white.\nSister Agnes said: ‘We all wear different colours, here we are black with a grey veil. It depends on which alter you serve.’\nThe Seven Sisters tube station is believed to take its name from a group of seven elm trees which were planted around a willow tree in the 14th Century.\nHowever the eagle-eyed reader feeling a little superior might be able to notice that, yes, there is an eighth sister behind the pillar on the left.\nPerhaps she was travelling to Nunhead.\nThis is not the first time commuters have been left chuckling at strange visual occurrences at tube stations.\nIn April 2016 a traffic warden tried to give a ticket to a man driving a giant foot.\nA photographer captured the moment the massive pink foot-shaped vehicle was pulled over in south London.\nThe marshal appeared to give the driver a stern talking to outside Balham tube station.\nAfter being spoken to by the warden, the structure was apparently abandoned by the side of the road.\nThe scene was spotted by Wandsworth Police who tweeted: 'Spotted near Balham Tube, a typical day in Wandsworth*(anyone have an explanation?)'\nThe strange giant foot sighting was eventually revealed to be a promotional tactic for this year's Wandsworth Arts Fringe festival.","url":"https://www.dailymail.co.uk/news/article-4300862/Seven-nuns-spotted-Seven-Sisters-tube-station.html"}
