{"authors":["Alice Broster"],"date_download":"2018-10-31 01:46:16","date_modify":"2018-10-31 01:46:16","date_publish":"2018-09-11 17:03:43","description":"Almost everyone has *that* story, when their mum or dad sat them down and tried to explain the birds and the bees to them. Or that morning when you wake up and realise the day has come: you’ve finally got your period. Your mum explains what it is…","filename":"data/vaneerConsumption/SexEducationReformIsLongOverdueParticularlyWhenItComesoTheConsentConversation.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/b72585bb-7aab-40eb-b81a-bd25addb3c0e-shutterstock_706298233.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_sex-education-reform-is-long-overdue-particularly-when-it-comes-o-the-consent-conversation-11870677_1540950376.html","title":"Sex Education Reform Is Long Overdue, Particularly When It Comes o The Consent Conversation","title_page":"Sex Education Reform Is Long Overdue, Particularly When It Comes o The Consent Conversation","title_rss":"NULL","source_domain":"bustle.com","text":"Almost everyone has *that* story, when their mum or dad sat them down and tried to explain the birds and the bees to them. Or that morning when you wake up and realise the day has come: you’ve finally got your period. Your mum explains what it is but you still don’t really understand why your body would inconvenience you in this way. Sex education in British schools is treated similarly — like a low priority laughing matter. But sex education is of paramount importance, and if we have any hope of tackling issues of consent, abuse, and mental health, it should be treated so.\nI imagine my own sex education to have been a lot like many other students growing up in British secondary schools in the '00s. I remember being dragged into the library to watch the school nurse put a tampon in a glass of water. It obviously blew up and from that we were supposed to understand what to do should our period start. Luckily mine had already inflicted itself upon me a couple of years earlier, but it definitely instilled a fear of tampons that I didn’t shake until university. On another equally confusing afternoon, a women from Public Health England came in to show us how to put condoms on wooden appendages. Half the class were mortified by the wooden penis’ and the other half spent an hour throwing condoms around the room.\nChris Jackson/Getty Images Entertainment/Getty Images\nEducation Secretary Damian Hinds has called for curriculum reform arguing that current sex education is “outdated.” Speaking to The Sun he said, “This new guidance will ensure lessons teach children and young people how to recognise when someone else has not given consent and more importantly why they should not to put pressure on someone else to do something they don’t want to.” And it is true, whilst I may have learnt what a tampon looks like when you fill it with water, consent, boundaries, pornography, and sexting were never mentioned.\nPeople constantly complain that they didn’t learn anything useful at school. When will you use Pythagoras theorem in your day to day life? However, we need to recognise that this lack lustre approach to teaching children about sex isn’t sufficient. There is more to intimate relationships than knowing how to put a condom on. Without proper sex education unwanted pregnancies, sexually transmitted disease, and unclear guidelines of consent will only become more of an issue.\nWith the curriculum changes, it will be compulsory for children aged four and upwards to have comprehensive sex education. I can hear the hordes of panicked parents already — there are definitely levels to what's appropriate education for each age group — but I don’t see the harm in teaching them about healthy relationships, be that familial, friendship, or otherwise.\nChris J Ratcliffe/Getty Images News/Getty Images\nResearch published in the Global Public Health journal has shown that in places where there is more comprehensive sex education, such as the Netherlands, there are lower rates of teenage pregnancy and sexual abuse. Knowledge is power, and in the #MeToo era, where we are hyper vigilant on calling out predators on their past wrong doings, surely it would make sense to give children the ability to understand their own bodies, boundaries, and right to say no.\nCurrently in the UK sex education is also broken down into age appropriate categories. Research published by the United Nations has found that under this system LGBTQI relationships and issues are not taught until children are in high school. So where does this leave queer kids? Knowing less about their bodies, feelings, and desires than their peers. Autostraddle reported that the absence of education means LGBTQI children develop a sense of \"other,\" feeling there is something wrong with them and there may not be a place for them, even before they fully understand their own feelings.\nFor some reason, the sense that sex and relationship education is something to be ashamed of lingers. By avoiding these conversations, everyone is losing out. It is perpetuating problems, denying children the right to understand boundaries and their own bodies, and closing down a conversation that needs to be had. If we are ever to tackle the issues that have arisen in this #MeToo era a conversation needs to be started that includes everybody.","url":"https://www.bustle.com/p/sex-education-reform-is-long-overdue-particularly-when-it-comes-o-the-consent-conversation-11870677"}
