{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-22 22:55:01","date_modify":"2018-10-22 22:55:01","date_publish":"2016-01-28 11:24:28","description":"Researchers at Columbia University, in New York, studied how the molecular 'clocks' encoded in our DNA differ from chimpanzees, which go through puberty six years earlier than humans.","filename":"data/vaneerConsumption/Sexlivesofchimpanzeesrevealswhenwelastsharedacommonancestor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/20A97B8600000578-0-image-a-7_1453978824470.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420689_Humans-split-chimps-4-MILLION-years-later-thought-Sex-lives-great-apes-reveal-clues-shared-common-ancestor_1540248901.html","title":"Sex lives of chimpanzees reveals when we last shared a common ancestor","title_page":"Sex lives of chimpanzees reveals when we last shared a common ancestor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They are our closest living relatives in the animal kingdom but it seems we may have split from chimpanzees along our own evolutionary paths more recently than some estimates claim.\nNew research has analysed the timing of puberty and sex lives of chimpanzees to calculate an accurate estimate for when our species and the apes last shared a common ancestor.\nThe findings suggest our respective evolutionary lineages went their separate ways around six to seven million years ago, much more recently than the 10 million years that is often cited.\nChimpanzees (pictured) share 98.8 per cent of our DNA and can appear remarkably human-like in their behaviour. Now a new study has provided a new estimate for when these apes last shared a common ancestor with humans by looking at when the animals go through puberty and other aspects of their sex lives\nThis timing falls firmly within estimates made using the fossil record, although other studies have also proposed the split occurring anytime between three and 13 million years ago.\nIn the new research, geneticists at Columbia University, in New York, looked at the 'molecular clock' that is used by researchers to estimate when species last shared a common ancestor.\nLAST COMMON ANCESTOR OF APES Scientists last year revealed the fossilised remains of a species of small ape that may have been the last common ancestor to humans, chimpanzees and gibbons. Named Pliobates cataloniae, the species existed around 14 million years ago, before the evolutionary split between 'large apes' and 'lesser apes'. The discovery fills a gap in the fossil record, and suggests that root of the entire ape family tree evolved from a far smaller creature than previously believed. Living hominoids are a group of primates that includes the small-bodied apes, such as gibbons and siamangs. Collectively, they are known as Hylobatidae. Hominoids also include the larger-bodied great apes, such as orangutans, gorillas and chimpanzees. Along with humans, they belong to the family Hominidae. Pliobates cataloniae was found to have features of both groups, suggesting it was one of our last common ancestors. Pliobates cataloniae is thought to be the last common ancestor of all apes. An illustration of the fossils is shown left and a reconstruction right\nThis looks for minor changes – or mutations – in the DNA that build up over time.\nGuy Amster and Guy Sella who led the Columbia University study, realised traditionally this technique has failed to account for differences in the timing of life events in the species.\nChimpanzees undergo puberty at around the age of seven and a half, while humans typically start changing at the age of 13 years old.\nThe time between generations in chimps is also lower.\nTogether, this means the rate at which mutations occur in the DNA is faster in chimpanzees than in humans, meaning estimates using the molecular clock in the past have been inaccurate.\nWriting in the journal Proceedings of the National Academy of Sciences, Mr Amster and Dr Sella said their estimate could be further refined by looking at other impacts on the mutation rate because DNA is passed down through the generations - also known as the germ line.\nThey said: 'Importantly, it revises split times for the human-chimpanzee split downwards from around 10 million years ago to as low as 6.6 million years ago.\n'Our mutational model will surely be refined as we learn more about germ-line mutations.\n'For example, molecular evolutionary patterns suggest that rates of certain types of mutations may track some combination of absolute time and number of cell divisions.\n'If so, maternal age could affect the accrual of these mutations.\n'In addition, there is still uncertainty about the number of cell divisions in the male germ line during spermatogenesis.'\nCurrently there is no fossil that has been identified as the last common ancestor between chimpanzees and humans, so scientists have been forced to estimate it using later and earlier fossils.\nSome of the earliest studies estimated our species may have split as long at 25 million years ago.\nYoung chimpanzees (pictured) go through puberty at the age of seven and a half years old while humans go through this change to sexual maturity at around the age of 13 years old. This difference may account for why our 'molecular clocks' are different and has lead researchers to revise the date of when our species split\nBut the publication of the human genome revealed that we share 98.8 per cent of our DNA with these apes.\nScientists have since analysed proteins and DNA in our two species in the hope of narrowing down the time when we shared a common ancestor.\nA growing consensus has put the date between five and ten million years ago.\nBut the new study has shown it is possible to narrow down the timeline of our evolution by looking at how often mutations commonly occur within individual species.\nMales, for example, experience greater numbers of mutations in the DNA of their sperm as they get older, so the older a species is when it reproduces after reaching maturity, the more changes occur.\nThe research has said that chimpanzees (stock picture) and humans last shared a common ancestor around 6.6 million years ago. As there is no definitive fossil from when this split occurred, researchers have had to rely upon comparing the rates at which mutations occur in DNA to estimate when we went our separate ways\nSpeaking to Ars Technica, other researchers not involved in the research described the technique in the paper as 'thoughtful' and said it could add to more sophisticated estimates of split times.\nMr Amster and Mr Sella added it could also help to provide new estimates for the splits between other mammals and could reveal new details in our evolutionary – or phylogenetic – history.\nThey said: 'We show that accounting for the effects of sex-specific life histories on mutation rates along the hominid phylogeny largely bridges this apparent gap and leads to more accurate split time estimates.","url":"https://www.dailymail.co.uk/sciencetech/article-3420689/Humans-split-chimps-4-MILLION-years-later-thought-Sex-lives-great-apes-reveal-clues-shared-common-ancestor.html"}
