{"authors":["Associated Press","Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-22 23:45:12","date_modify":"2018-10-22 23:45:12","date_publish":"2016-01-28 12:53:34","description":"A registered sex offender was thrown in jail on Tuesday after attempting to kidnap a three-year-old girl, who had just arrived from Argentina with her family at Miami airport.","filename":"data/vaneerConsumption/SexoffendertriedtoabductthreeyearoldgirlatMiamiairport.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AAB46000000578-0-image-a-8_1453988882802.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420892_Sex-offender-accused-trying-abduct-girl-airport_1540251912.html","title":"Sex offender 'tried to abduct three-year-old girl at Miami airport'","title_page":"Sex offender 'tried to abduct three-year-old girl at Miami airport' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cuong Nguyen, 42, in a recent booking photograph\nA registered sex offender was thrown in jail after attempting to kidnap a three-year-old girl at Miami airport on Tuesday.\nA family arrived from Argentina to Miami International Airport and were renting a car when it crossed paths with the sex offender.\nCuong Nguyen, 42, approached the three-year-old girl as she was walking toward a water fountain with her siblings, aged six and nine, and the children's father following close behind, the Miami Herald reports.\nNguyen grabbed the little girl by the wrist, but she broke free and ran to her mother.\nAfter Nguyen was arrested, he told detectives he was homeless and admitted he had grabbed the child.\nNguyen told police he 'thought she was cute' and that he would 'kiss the victim', according to the Herald.\nHe was charged with two felony counts of attempted kidnapping and false imprisonment of a child under 13, according to the Miami-Dade County clerk of courts.\nNguyen was convicted in 1996 of lewd and lascivious behavior on a child under 16, according to a Florida sex offender registry.\nVideo courtesy of NBC Miami\nThe attempted kidnapping happened at Miami International Airport in Florida on Tuesday","url":"https://www.dailymail.co.uk/news/article-3420892/Sex-offender-accused-trying-abduct-girl-airport.html"}
