{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 03:59:29","date_modify":"2018-10-23 03:59:29","date_publish":"2017-03-10 14:03:15","description":"Rita Yadav, 28, attacked her husband Ved Prakash, 31, at their home in Khora Colony, in Ghaziabad, Uttar Pradesh, in northern India, on Thursday morning after throttling him with a stone grinder.","filename":"data/vaneerConsumption/SexstarvedIndianwifecutsoffherhusbandsPENIS.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E23191E00000578-0-image-a-86_1489153212155.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301402_Sex-starved-Indian-wife-cuts-husband-s-PENIS_1540267169.html","title":"'Sex starved Indian wife' cuts off her husband's PENIS","title_page":"'Sex starved Indian wife' cuts off her husband's PENIS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A wife in India has cut off her husband's penis after he refused to have sex with her for more than a decade.\nRita Yadav, 28, attacked her husband Ved Prakash, 31, at their home in Khora Colony, in Ghaziabad, Uttar Pradesh, in northern India, on Thursday morning.\nShe claimed he had refused to have sex with her for ten years of their 11-year marriage and she believed he was having an affair.\nRita Yadav, 28, cut off her husband's penis after he refused to have sex with her for 10 years\nVed Prakash, 31, pictured, is recovering in hospital after his penis was slashed off by his wife\nHusband was knocked unconscious and taken to Jaypee Hospital when he came around\nVed, pictured in bed, had just returned from a night shift when he was hit on the head by Yadav\n‘He used to tell me he hated me,’ the housewife said.\n‘We used to fight daily and he told me he hated looking at my face.\n'He always threatened he would have an affair. I was desperate to have children.\n'I used to beg him but he said he’d make love to someone else instead.\n'I’d been dealing with the torture for years and I couldn’t take any more.’\nWhen Ved, a taxi driver, arrived home from his night shift yesterday morning he went straight into the shower.\nBut as he stepped out Yadav hit him over the head with a stone grinder and he fell unconscious.\nA doctor checks up on Ved Prakash\nShe then used a kitchen knife and slashed his penis.\nYadav locked him in the bathroom and she then handed herself into the local police station.\nVed regained consciousness after 30 minutes and called his friend in agony, who immediately took him to Jaypee Hospital.\nInspector Jai Prakash Chaubey, at Khora Police Station, said: ‘She came to us and told us what she had done and we recorded her statement.\n'She claimed they had regular fights and accused him of having an extra-marital affair.\n'She has confessed to attacking him and slashing his genitals in anger.’\nDr Saurabh Gupta, a surgeon, at Jaypee Hospital, said: ‘He was in a critical condition when he arrived at the hospital.\n'His penis was almost fully detached from the base and he had lost a lot blood.\n'His penis had been cut with a sharp knife and the cut was nearly 4-inch deep.\n'We operated immediately and we were able to save both his life and the organ with a re-implantation.’\nDoctors managed to reattach the penis in a five-hour operation and Ved is now out of danger.\nHe is still in hospital recovering.\nRita is awaiting trial having been arrested and charged under Section 326 - voluntarily causing grievous hurt with dangerous weapons - of the Indian Penal Code.","url":"https://www.dailymail.co.uk/news/article-4301402/Sex-starved-Indian-wife-cuts-husband-s-PENIS.html"}
