{"authors":["Associated Press","Dailymail.Com Reporter"],"date_download":"2018-10-23 04:26:28","date_modify":"2018-10-23 04:26:28","date_publish":"2016-01-29 20:05:25","description":"All three victims were attacked while walking home alone from the Uptown area near campus. The first assault happened in 2006, and the other two last year, in June and December.","filename":"data/vaneerConsumption/SexualpredatoronthelooseatOhioUniversity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B544A900000578-0-image-a-81_1454100946495.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422811_Linking-3-cases-cops-hunt-serial-rapist-college-town_1540268788.html","title":"Sexual predator on the loose at Ohio University","title_page":"Sexual predator on the loose at Ohio University | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The suspect has been described as a 'white male in his early twenties to early thirties, 5-foot-8-inches to 5-foot-9-inches tall, and about 160 pounds'\nAll three assaults happened when college-aged women were walking back at night from bars in the Uptown area near the Ohio University campus\nin that case to another assault in June and one in 2006\nThe most recent assault happened on December 12; DNA has connected the suspect\nDo you know this man? Police in Athens, Ohio are searching for a suspect connected to three separate sexual assaults near the Ohio University campus in the past 10 years\nThe police chief of an Ohio college town said authorities are seeking a predator linked to sexual assaults on three women since 2006.\nAthens Police Chief Tom Pyle said Thursday that DNA evidence shows the same person committed the separate but similar assaults - one in 2006 and two last year, one in June and another in December. The city is home to Ohio University.\nThe victims were all young college-aged women walking home in the middle of the night when the attacks occurred. However, authorities stopped short of calling them students at the school.\nThe 2006 victim was raped, and the June case involved an attempted sexual assault, according to police.\nAuthorities say the December encounter was similar to the other two, but the exact circumstances of it are unclear.\nThe Ohio Bureau of Criminal Investigation has been asked to assist with the investigation, and police are increasing patrols and asking for the public's help in finding the suspect.\n'We encourage everyone, especially students, to stay alert and be upstanding and active bystanders,' Pyle said.\nUniversity President Roderick McDavis said the school is working with the city and police to increase safety and prevention measures.\nSome of those steps include extending the hours of an on-demand transit service and widening the service's coverage area to include off-campus housing.\nScroll down for video\nAlone: All of the women were attacked after walking alone from the Uptown area near the Ohio University campus\nThe university police Chief Andrew Powers said in a statement released Thursday that he and Pyle are working together to coordinate greater patrol visibility on and around the campus area.\nPowers said Athens is a relatively safe community where most residents feel comfortable.\n'Unfortunately, it is now clear that a predator is taking advantage of this feeling of security and victimizing women whom he feels are vulnerable,' Powers said in a statement.\nThe suspect has been described as a 'white male in his early twenties to early thirties, 5-foot-8-inches to 5-foot-9-inches tall, and about 160 pounds'","url":"https://www.dailymail.co.uk/news/article-3422811/Linking-3-cases-cops-hunt-serial-rapist-college-town.html"}
