{"authors":["Laurel Rosenhall","Antoinette Siu","Dan Morain","Ben Christopher"],"date_download":"2018-10-30 22:53:49","date_modify":"2018-10-30 22:53:49","date_publish":"2018-08-30 18:05:34","description":"We're keeping track of how many #MeToo bills to combat sexual harassment win approval from the California Legislature and Gov. Jerry Brown.","filename":"data/vaneerConsumption/SexualharassmentshookCaliorniasCapitolbutdidMeToobillsprevailWerekeepingscore.json","image_url":"https://calmatters.org/wp-content/uploads/iStock-935056162.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940029.html","title":"Sexual harassment shook Caliornia's Capitol-but did #MeToo bills prevail? We're keeping score","title_page":"Sexual harassment shook Caliornia's Capitol—but did #MeToo bills prevail? We're keeping score | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Sexual harassment scandals loomed large when the legislative year opened in January. Hundreds of women who work in the Capitol had spoken out about a climate they said was rife with misconduct, two legislators had just resigned facing harassment allegations, and a third went on a leave-of-absence while officials investigated accusations against him.\nOf course the problem wasn’t just in Sacramento. Jarring revelations emerged from Hollywood and Silicon Valley, as women across the country shared their #MeToo stories. The cry for change from victims and supporters—combined with lawmakers’ acknowledgment of the problem in their own house—created momentum in the Capitol to write new bills meant to combat sexual misconduct and hold offenders accountable. They proposed a raft of new laws aimed to achieve more equality in all California workplaces—such as a ban on confidentiality provisions in sexual harassment settlements and a mandate for corporations to include women in their boardrooms.\nOther proposals targeted the Legislature itself, such as a bill extending whistleblower protections to Capitol staff who report misconduct, and another allocating $1.5 million to establish a new unit to investigate complaints against lawmakers. Now, as the legislative session comes to a close, how many of these bills gained traction and how many fizzled? We’re keeping score here—and we’ll be updating this list as the fate of these bills is revealed in coming days.","url":"https://calmatters.org/articles/sexual-harassment-metoo-bills-california-tracker/"}
