{"authors":[],"date_download":"2018-10-23 03:11:54","date_modify":"2018-10-23 03:11:54","date_publish":"2016-01-29 18:00:50","description":"South African FIFA presidential contender Tokyo Sexwale on Friday called for a campaign to stop European rival Gianni Infantino getting the leadership of foo...","filename":"data/vaneerConsumption/SexwalecallsforantiEuropecampaignatFIFA.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i4iz-4PuZeKVXE7cd9005b2c876ce9b94-646_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423233_Sexwale-calls-anti-Europe-campaign-FIFA_1540264314.html","title":"Sexwale calls for anti-Europe campaign at FIFA","title_page":"Sexwale calls for anti-Europe campaign at FIFA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sexwale calls for anti-Europe campaign at FIFA\nSouth African FIFA presidential contender Tokyo Sexwale on Friday called for a campaign to stop European rival Gianni Infantino getting the leadership of football's scandal-tainted world body.\nWithout naming Infantino, the UEFA general secretary, Sexwale said the next FIFA leader must come from Africa or Asia and that he was ready to form an alliance to stop a European candidate.\n\"I am focused on making sure that the president of FIFA comes from either Africa or Asia, not Europe,\" Sexwale told South Africa's Metro radio.\nTokyo Sexwale speaks during a press conference with the heads of the Palestinian and Israeli Football federations in the West Bank city of Jericho on December 16, 2015 ©Thomas Coex (AFP/File)\nWith Sexwale, Infantino and two other candidates, Prince Ali bin al Hussein and Sheikh Salman bin Ebrahim al Khalifa, due in Qatar this weekend, Sexwale's comments were a strong sign that the campaign is polarising ahead of the February 26 vote.\nFIFA, which has never had a leader from outside Europe or South America, is looking for a replacement for Sepp Blatter, banned for eight years for abuse of his position, while the world body has been rocked by other corruption scandals.\nSexwale, an anti-apartheid prisoner with Nelson Mandela who became a business tycoon and politician, raised the possibility of some candidates joining forces.\n\"The time for alliances is... coming, and it's healthy, it's democratic and it's good,\" he said. \"Now we are talking... we are brothers, we are colleagues.\"\nHe did not name his allies, but Infantino's main rival is Sheikh Salman, head of the Asian Football Confederation (AFC), which this month signed a cooperation accord with the Confederation of African Football.\nPrince Ali, a former FIFA vice president, has made a formal complaint to FIFA about the accord which he said was a \"an attempt to engineer a bloc vote\" in the FIFA race.\nThe 53-member CAF is to meet on February 5 to decide which candidate it will back in the election.\nThe South American confederation, CONMEBOL, and a group of European countries including Germany and France have indicated they will vote for Infantino, a longtime right hand man to Michel Platini, who was banned for eight years at the same time as Blatter.\nElection rivalry has already cause tensions in Europe.\nJerome Champagne, a French former FIFA official, said he was insulted by the head of the French Football Federation, Noel Le Graet, at a meeting in a Paris restaurant when he sought support for his campaign.\nLe Graet told him France would be supporting Infantino and an altercation started in the restaurant, according to media reports.\nChampagne replied that he would protest Le Graet's decision not to even let him speak to the FFF executive. In response, Le Graet called him a \"little man\", used another expletive, threw down the money for the meal and then walked out, according to Le Parisien newspaper, whose account was confirmed by other football sources.\n\"I was insulted,\" Champagne told AFP, also confirming the media reports. Le Graet, a frequently outspoken character, would not comment on the meeting.\nInfantino is to give more details of his programme at a conference in London on February 1.","url":"https://www.dailymail.co.uk/wires/afp/article-3423233/Sexwale-calls-anti-Europe-campaign-FIFA.html"}
