{"authors":[],"date_download":"2018-10-23 02:09:44","date_modify":"2018-10-23 02:09:44","date_publish":"2016-01-29 16:25:54","description":"South Africa's FIFA presidential candidate Tokyo Sexwale has said he will work to ensure that the eventual winner of the election next month is not one of th...","filename":"data/vaneerConsumption/SexwalecallsfornonEuropeanFIFAchief.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i1s7-3bmscybNe842cce83474b57d5d4d-767_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422883_Sexwale-calls-non-European-FIFA-chief_1540260584.html","title":"Sexwale calls for non-European FIFA chief","title_page":"Sexwale calls for non-European FIFA chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sexwale calls for non-European FIFA chief\nSouth Africa's FIFA presidential candidate Tokyo Sexwale has said he will work to ensure that the eventual winner of the election next month is not one of the two European runners.\nSexwale is seen as an outsider for the post, but he signalled in an interview that he could swing behind Bahraini Sheikh Salman bin Ebrahim al Khalifa or Jordanian Prince Ali bin al Hussein.\nThe other two candidates in the February 26 vote to head football's corruption-plagued governing body are Gianni Infantino from Switzerland, and Jerome Champagne from France.\nTokyo Sexwale is the only African candidate bidding for the FIFA presidency ©Thomas Coex (AFP/File)\n\"For me, it's not about only the presidency,\" Sexwale told South Africa's Metro FM radio station.\n\"The main issues for FIFA are accountability and credibility.\n\"I am focused on making sure that the president of FIFA comes from either Africa or Asia, not Europe.\"\nHe also raised the possibility of some candidates joining forces before the vote.\n\"The time for alliances is... coming, and it's healthy, it's democratic and it's good,\" he said.\n\"Now we are talking... we are brothers, we are colleagues.\"\nSexwale, the only African candidate bidding for the job, has been criticised by the South African Football Association (SAFA) for running a lacklustre campaign in the race to replace Sepp Blatter.\nSexwale was an anti-apartheid prisoner with Nelson Mandela on Robben Island, and then became a millionaire business tycoon.","url":"https://www.dailymail.co.uk/wires/afp/article-3422883/Sexwale-calls-non-European-FIFA-chief.html"}
