{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:47","date_modify":"2018-10-30 18:48:47","date_publish":"2015-06-04 15:02:54","description":"Never one to retreat from controversy, San Francisco archbishop Salvatore Cordileone has weighed in on the trans-Jenner debate, arguing that men don’t suddenly become women just through a physical operation, cross-dressing or being addressed with new names. |","filename":"data/vaneerConsumption/SFArchbishopSlamsGenderIdeologyintheWakeofJennerCelebrity.json","image_url":"https://media.breitbart.com/media/2015/03/Screen-Shot-2015-03-05-at-12.33.01-PM-e1433430097501.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_04__1540925327.html","title":"S.F. Archbishop Slams Gender Ideology in the Wake of Jenner Celebrity","title_page":"S.F. Archbishop Slams Gender Ideology in the Wake of Jenner Celebrity | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Never one to retreat from controversy, San Francisco archbishop Salvatore Cordileone has weighed in on the trans-Jenner debate, arguing that men don’t suddenly become women just through a surgical operation, hormone therapy, cross-dressing or being addressed with new names.\n“The clear biological fact is that a human being is born either male or female,” Cordileone said Wednesday during a conference in New York organized by Catholic conservatives.\nThe redoubtable archbishop has already drawn the ire of freethinking local Catholics in his Archdiocese of San Francisco by insisting that teachers in Catholic schools teach Catholic doctrine and morality, rather than their own version of it.\nHe has also demanded that those in charge of the formation of children in the Church’s name avoid behavior that would scandalize the kids. A teacher could face punishment or dismissal for “escorting a woman into an abortion clinic, handing out contraception to students, or for being a member of a white supremacist group,” he said.\nIn his address Wednesday, Cordileone reminded his audience of Pope Francis’ harsh criticism of those who promote “gender ideology.”\nNot mincing words, Francis has called modern gender ideology “demonic,” and has compared gender theory with “the educational policies of Hitler.” The Pope also said that gender theory “does not recognize the order of creation,” a point that Cordileone picked up on in his words.\n“Yet now we have the idea gaining acceptance that biological sex and one’s personal gender identity can be at variance with each other, with more and more gender identities being invented,” said Cordileone.\nThe Pope himself received backlash for criticizing “an academic perspective that sees gender identities as a spectrum rather than as binaries.” Basing himself on Biblical theology, the Pope believes that God creates people as “male and female,” rather than an ever expanding gamut of contrived pseudo-sexual genders.\nCordileone remarked that a friend of his recently pointed out to him that a major university advertised housing “for a grand total of 14 different gender identities.”\n“Those initials keep getting longer and longer,” he said, referring to the trend of appending a series of letters to the familiar LGBT acronym, including abbreviations for queer, intersex, intergender, pansexual or asexual.\n“I wonder,” said Pope Francis last April, “whether the so-called theory of gender is not an expression of frustration and resignation, which tries to erase sexual differences because it doesn’t know how to handle them.”\nRemoving sexual differences, Francis declared, “is the problem, not the solution.” Acting as if these differences didn’t matter means “taking a step backwards,” he said.\n“God has entrusted the earth to the covenant between man and woman,” Francis said. Its failure “dries up the world of affection and darkens the sky of hope.”\nJenner is receiving accolades for his/her decision to take on a female persona, and has been called a “hero” for his “courageous” choice.\nOthers have been more circumspect in their reactions to his decision.\nOne repentant transsexual, Walt Heyer, expressed his fear that the Jenner story might not have a happy ending.\n“As a former transgender myself,” he wrote, “I found it painful to see Jenner looking so fragile, exhibiting an uncertain nervousness throughout the interview. I see Jenner and my heart sinks with sadness; my stomach aches in pain.”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2015/06/04/s-f-archbishop-slams-gender-ideology-in-the-wake-of-jenner-celebrity/"}
