{"authors":["William Bigelow"],"date_download":"2018-10-30 18:50:23","date_modify":"2018-10-30 18:50:23","date_publish":"2015-04-22 20:52:15","description":"The children of Santa Clara are fighting a proposal by the San Francisco 49ers to use the city’s public soccer park for stadium parking in exchange for $15 million in rent over 39 years. |","filename":"data/vaneerConsumption/SFCelebratesSuperBowl50AsKidsFightforSoccerPark.json","image_url":"https://media.breitbart.com/media/2015/04/Santa-Clara-SCYSL-Facebook.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_04_22__1540925423.html","title":"SF Celebrates Super Bowl 50–As Kids Fight for Soccer Park","title_page":"SF Celebrates Super Bowl 50--As Kids Fight for Soccer Park | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday, San Francisco previewed a football fan village, called Super Bowl City, that is planned for the city’s waterfront for next year’s Super Bowl 50. The match will be played February 7 of next year 44 miles south at the 49ers’ stadium in Santa Clara. Meanwhile, the San Jose Mercury News reports, the children of Santa Clara are fighting a proposal by the San Francisco 49ers and Mayor Jamie Matthews that would let the 49ers use the city’s public soccer park for stadium parking in exchange for $15 million in rent over 39 years.\nSuper Bowl City hopes to draw over one million visitors between January 30 and February 7 of next year. On Tuesday, Host Committee CEO Keith Bruce told host committee members, elected officials and media, “We’re on a mission to ensure that Super Bowl 50 benefits our entire region,” according to the Mercury News. Bruce added, “There will be activities and fun for all ages, for kids and families and international tourists. There’ll be interactive games as well as other attractions that will highlight the technological prowess of this region along with its culinary and cultural diversity.”\nLikewise, Daniel Lurie, chairman of the San Francisco Bay Area Super Bowl 50 Host Committee, said, “Our commitment from the beginning has been to put our Bay Area community first, and create real opportunities for our region to benefit from this opportunity to host Super Bowl 50, whether it is local businesses or our Bay Area’s nonprofit community.”\nCity spokeswoman Jennifer Yamaguma said simply that “Santa Clara hopes that the events planned for San Francisco are successful and enjoyable for all who attend. And, of course, we look forward to hosting Super Bowl 50 at Levi’s Stadium in Santa Clara.”\nBut in Santa Clara on Tuesday, an overflow crowd targeted the city council regarding the proposal from 49ers and the local mayor. Kids carried posters emblazoned with slogans venting their (and their parents’) anger at the city renting the park to the 49ers. Some posters targeted Jed York, the owner of the 49ers.\nExamples of the messages included, “Unnecessary Roughness,” “Jed York: Faithful No More,” “Jedd [sic] York Needs A Spanking,” “My Mom Gets Angry When I Lie,” “Park on Your Own Grass,” “Save the Soccer Park,” “Mayor Matthews, Who Knows If Your Own Grandchildren Want To Play Soccer?” and “Park On Your Own Practice Field.”\nAt the Santa Clara Youth Soccer League’s Facebook page, activists posted photographs of children posting–as well as a letter by 49ers’ president Jed York in 2012 promising not to interfere with the use of the park by the children.","url":"https://www.breitbart.com/local/2015/04/22/sf-celebrates-super-bowl-50-but-kids-fight-for-soccer-park/"}
