{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:17:59","date_modify":"2018-10-30 22:17:59","date_publish":"2015-07-10 21:24:13","description":"SF Police Didn't Investigate Theft Of Fed Agent's Gun Before Kathryn Steinle's Murder","filename":"data/vaneerConsumption/SFPoliceDidntInvestigateTheftofAgentsGun.json","image_url":"https://media.breitbart.com/media/2015/07/ap_francisco-sanchez-jeff-adachi-diana-garciaor_ap-photo3-1024x738.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_10__1540937879.html","title":"SF Police Didn't Investigate Theft of Agent's Gun","title_page":"SF Police Didn't Investigate Theft of Agent's Gun","title_rss":"NULL","source_domain":"breitbart.com","text":"On June 9, San Francisco Police Chief Greg Suhr said no one was assigned to investigate the June 27 break-in of a car belonging to a federal agent — a car from which a .40 caliber handgun was stolen and then allegedly used by Juan Francisco Lopez Sanchez in the July 1 shooting death of Kathryin Steinle.\nSuhr did not explain why four days passed without the burglary being assigned, but on July 7 he issued a “department wide bulletin” reminding his officers of the process for determining “cases that require an immediate investigation.”\nAccording to the San Francisco Chronicle, Suhr also used the bulletin to remind officers that “It is the policy of the San Francisco Police Department to diligently investigate crimes in order to arrest and prosecute those responsible.”\nPolice Spokesman Sgt. Michael Andraychak assured everyone that while the June 27 burglary was not assigned for investigation, the officers “who responded to the initial report” were “thorough.”\nHe added:\nThey determined that there was nothing of evidentiary value at the scene and that calling out CSI was not warranted. They searched the area for possible surveillance cameras and/or witnesses and located none. They had a citywide crime alert broadcast on police radio channels and a teletype was issued. All investigative leads were exhausted.\nThe car which was burglarized on June 27 belonged to a “U.S. Bureau of Land Management Ranger.” The Chronicle previously reported that the gun which was stolen was “not the agent’s official gun” but a backup.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/07/10/sf-police-didnt-investigate-theft-of-fed-agents-gun-before-kathryn-steinles-murder/"}
