{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:17:53","date_modify":"2018-10-30 22:17:53","date_publish":"2015-07-04 04:01:02","description":"New information has been released in the story of Francisco Sanchez, a five-time deported, seven felony convicted Mexican national accused of shooting and killing 31-year-old Kathryn Seinle at Pier 14 in San Francisco Wednesday night as she posed for pictures with her father.","filename":"data/vaneerConsumption/SFSanctuaryCityPolicyIgnoresICEDetainerReleasedCriminalAlienKillsYoungWoman.json","image_url":"https://media.breitbart.com/media/2015/07/kathryn-steinle.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_07_03__1540937873.html","title":"SF Sanctuary City Policy Ignores ICE Detainer — Released Criminal Alien Kills Young Woman","title_page":"SF Sanctuary City Policy Ignores ICE Detainer -- Released Criminal Alien Kills Young Woman | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New information has been released in the story of Francisco Sanchez, a five-time deported, seven felony convicted Mexican national accused of shooting and killing 31-year-old Kathryn Seinle at Pier 14 in San Francisco Wednesday night as she posed for pictures with her father.\nThe San Francisco Sheriff’s Department (SFSD) details a March possession and April release of the suspect from San Francisco County Jail. Denying an ICE detainer request was in line with San Francisco and Sheriff’s Department Policy. SFSD states that ICE detainer requests are “not a legal basis to hold an individual.”\nFrancisco Sanchez’s full name is now known to be Juan Francisco Lopez-Sanchez, and he is 52,according to SFSD records.\nLopez-Sanchez was arrested within approximately one hour of Wednesday’s shooting incident thanks in part to witnesses’ cell phone evidence and quick law enforcement response. He has since signed a confession to the shooting and killing of Seinle, according to ABC7.\nSFSD records show Lopez-Sanchez had been booked into San Francisco County Jail on March 26, 2015, transferred from federal prison on a local drug-related warrant. At that time no ICE warrant or judicial order had been issued, but an ICE detainer had been issued. March 27 Lopez-Sanchez was in Superior Court for the local charges. The court dismissed the charges.\nAfter the charges were dismissed, SFSD says they verified that his federal time had been completed. On April 15, 2015, with no further charges pending, Lopez-Sanchez was released. The ICE detainer was refused.\nSan Francisco’s policy does not allow ICE detainer requests to be honored. SFSD spokesperson Freya Horne told Breitbart News, “Our policy is that we don’t honor them.” SFSD cited Ordinance 130764, approved by Board of Supervisors, and signed by Mayor Ed Lee in October 2013 as backing for not honoring the ICE detainer. SFSD Policy on immigration detainers is in line with this ordinance.\nJust two and a half months later, on July 1, Lopez-Sanchez, by his own admission, shot and killed Kathryn Steinle.\nSFPD noted that 300 U.S. municipalities have changed policy on ICE detainers, then suggested that ICE has not made a change accordingly. Court precedent was cited as support for the San Francisco policy. However, “The most recent data from the U.S. Census Bureau (2007) counted 39,044 general purpose local governments, which includes 19,492 municipal governments, 16,519 township governments and 3.033 county governments,” according to the National League of Cities. That would put the 300 still in the minority position. SFSD states that a warrant or court order is required for SFSD to return an individual to ICE for deportation proceedings.\nICE spokesperson Virginia Kice told Breitbart News that the murder suspect has an extensive criminal and immigration record, with five prior deportations and seven felony convictions.\n17-year-old Jamiel Shaw Jr. was killed under similar circumstances in 2008, when a criminal alien shot and killed him just outside his family’s Los Angeles home. The criminal alien had been released from prison just hours before. Breitbart News previously reported that the murderer would have been eligible for legal status under provisions of the “Gang of Eight” immigration bill and under President Obama’s executive action on immigration.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/border/2015/07/03/sf-sanctuary-city-policy-ignores-ice-detainer-released-criminal-alien-kills-young-woman/"}
