{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:17:40","date_modify":"2018-10-30 22:17:40","date_publish":"2015-07-10 18:44:58","description":"San Francisco Sheriff Ross Mirkarimi held a press conference Friday morning under the premise of setting the \"record straight\" on the details of local government policies and the series of events in the case of accused killer Juan Francisco Lopez-Sanchez. |","filename":"data/vaneerConsumption/SFSheriffBlamesICEforConfessedKillersRelease.json","image_url":"https://media.breitbart.com/media/2015/07/Mirkarimi-Matt-Baume-Flickr-CC-Cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_10__1540937860.html","title":"S.F. Sheriff Blames ICE for Confessed Killer's Release","title_page":"S.F. Sheriff Blames ICE for Confessed Killer's Release | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"San Francisco Sheriff Ross Mirkarimi held a press conference Friday morning under the premise of setting the “record straight” on the details of local government policies and the series of events in the case of accused killer Juan Francisco Lopez-Sanchez.\nMirkarimi has come under an onslaught of criticism for his department’s “sanctuary city” policies, which rejected cooperation with immigration officials, and released five-time deportee, seven-time convicted felon Lopez-Sanchez just two-and-a-half months before the shooting death of Kathryn Steinle at Pier 14, to which Lopez-Sanchez has confessed.\n“I think there’s been a significant amount of misunderstanding about the sequence of events,” Mirkarimi told reporters. “We want to set the record straight.”\nThe following is Mirkarimi’s version of the events.\nOn December 11, 1995, a San Francisco court issued a bench warrant for the arrest of Lopez-Sanchez for failure to appear on marijuana charges. Bail was set at $5,000.\nBetween 1998 and 2000, Lopez-Sanchez was sentenced to federal custody four times. Mirkarimi said that according to ICE in that period of time, Lopez-Sanchez had been deported 5 times.\nOn March 23, 2015, the San Francisco Sheriff’s department received a call from the federal Bureau of Prisons on the warrant for marijuana charge. Based on a Bureau of Prisons request for confirmation of the bench warrant, as per protocol, the Sheriff’s department requested transfer of Lopez-Sanchez. Lopez-Sanchez was in federal custody three times since the warrant was issued. This was the first time San Francisco had been contacted by federal officials regarding the 1995 warrant. As Mirkarimi has previously told reporters, San Francisco rarely, if ever, prosecutes marijuana charges.\nOn March 26, 2015, Lopez-Sanchez was transferred and booked on the bench warrant. On March 27, Lopez-Sanchez appeared in court. The District Attorney moved to dismiss the charges. The court dismissed the charges. Between March 27 and April 14, a determination was made that Lopez-Sanchez had completed his federal prison sentence and no outstanding warrants in any other jurisdiction existed. Lopez-Sanchez was released April 15.\nU.S. Immigration and Customs Enforcement (ICE) did not provide a warrant or judicial order for Lopez-Sanchez’s release, though it had issued a detainer.\nMirkarimi then moved to say an ICE detainer is a “misnomer” for an official document, and extension of detention is voluntarily. He cited two federal court cases that he said held that ICE detainers are not legally binding. If provided a warrant or legal order, Lopez-Sanchez would not have been released, Mirkarimi said.\nMirkarimi defended his policies as being concurrent with San Francisco’s broader “sanctuary city” policies.\nHe stated that Department of Homeland Security (DHS) Deputy Secretary Alejandro Mayorkas has since informed him that a warrant or judicial order is required for the San Francisco Sheriff’s department to detain a suspect. San Francisco own policies require a warrant or judicial order for transfer of prisoner to ICE. In this case, federal authorities did not proceed directly to deportation proceedings.\nMirkarimi said that a DHS memo from December 2014 indicates Lopez-Sanchez met the highest ICE priority. He criticized ICE for its failure to obtain a warrant or judicial order.\nIn addition, Mirkarimi said there has been a lot of finger-pointing and distortion of facts by Mayor Ed Lee and others.\nQuestioned by reporters why the Sheriff’s department failed to exercise discretion in the case of Lopez-Sanchez, Mirkarimi said that he was constrained by a city ordinance requiing a judicial order or warrant before cooperating with ICE.\n“The mayor is trying to run away from his own ordinance,” Mirkarimi asserted. “The mayor is playing politics with public safety and I really think it’s disingenuous.”\nMirkarimi ultimately blamed ICE and suggested that a call to ICE notifying them of Lopez-Sanchez’s impending release was outside of protocol.\nICE has previously indicated that it is normal procedure to file a detainer request and does not require the suspect be detained beyond legal standards. In addition, an ICE spokesperson previously informed Breitbart News that typically ICE is able to pick up a detainee in a very short period of time in areas such as San Francisco. ICE officers are in close proximity to where detainees are held and could easily have arrived.\nICE has informed Breitbart News that a response to Mirkarimi’s statements will be available shortly.\n“We strongly disagree with the Sheriff’s mischaracterizations and will issue a statement shortly,” ICE told Breitbart News.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/07/10/s-f-sheriff-blames-ice-for-lopez-sanchez-release/"}
