{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:16:16","date_modify":"2018-10-30 22:16:16","date_publish":"2015-07-17 11:00:05","description":"Members of the San Francisco Board of Supervisors responsible for sanctuary city policies that have become controversial again in the wake of the July 1 |","filename":"data/vaneerConsumption/SFSupervisorsRefusetoAnswerQuestionsAboutSteinlesDeath.json","image_url":"https://media.breitbart.com/media/2015/07/Scott-Weiner-AFP-Getty-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_17__1540937776.html","title":"SF Supervisors Refuse to Answer Questions About Steinle’s Death","title_page":"SF Supervisors Refuse to Answer Questions About Steinle’s Death | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Members of the San Francisco Board of Supervisors responsible for sanctuary city policies that have become controversial again in the wake of the July 1 shooting death of Kate Steinle by an illegal alien are defending those policies, calling for gun control and berating Fox News.\nAs Breitbart News has reported, various officials at different levels of government are blaming each other for allowing the confessed killer, five-time deportee and seven-time convict Juan Francisco Lopez-Sanchez, out on the street.\nFox News sent a reporter out to question several of the San Francisco Supervisors on Tuesday, the San Francisco Chronicle relayed. The reactions were brash, condescending and evasive.\nSupervisor Jane Kim told the reporter, “I think the issue here is gun control.”\nSupervisor Katy Tang said, “Of course Fox News would be this rude.” She continued, “You’re interviewing the wrong f—ing person.”\nSupervisor Scott Wiener refused to answer questions, repeatedly asserting in a condescending manner, “Fox News is not real news.”\nThe Chronicle later followed up with Wiener’s office, which told the outlet that a flood of Tea Party members have called criticizing the Supervisor for evading the media.\nSheriff Ross Mirkarimi has borne much of the blame, as it was his department that refused to honor a U.S. Immigration and Customs Enforcement (ICE) detainer request when accused perpetrator Juan Francisco Lopez-Sanchez was slated for release in April of this year.\nMirkarimi has attempted to blame ICE for Lopez-Sanchez’s April release, saying the detainer was not enough and that he required a warrant or court order.\nMayor Ed Lee has blamed Mirkarimi as well. In 2012, Lee attempted to oust Mirkarimi from office after the Sheriff pled guilty to a domestic violence charge. Mirkarimi has since had that charge expunged from his record, but he is still prohibited from carrying a firearm.\nIn 2013, Gov. Jerry Brown–who had previously opposed the sanctuary city policy–signed the Trust Act, effectively extending sanctuary policies statewide to allow cities to refuse certain cooperation with federal immigration officials.\nKate Steinle is but one of the most recent cases of Americans killed due to the actions of illegal aliens each year.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/07/17/sf-supervisors-refuse-to-answer-questions-about-steinles-death/"}
