{"authors":[],"date_download":"2018-10-30 17:52:02","date_modify":"2018-10-30 17:52:02","date_publish":"2018-10-29 22:13:25","description":"The Shake Shack at the Atlanta airport took four years to come to fruition.","filename":"data/vaneerConsumption/ShakeShackatAtlantaairportsparkedbydrivedownPeachtreeRoad.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Videos/4518256.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/travel_shake-shack-hartsfie_c3b320eaaae3fda0feeb0f14a78cf82b__1540921922.html","title":"Shake Shack at Atlanta airport sparked by drive down Peachtree Road","title_page":"Shake Shack at Atlanta airport sparked by drive down Peachtree Road","title_rss":"NULL","source_domain":"ajc.com","text":"Four years ago, Randy Hazelton was driving south on Peachtree Road when he spotted a line of people around the block.\nThe first Shake Shack in Georgia had just opened at Buckhead Atlanta, and the cult favorite burger chain from New York was nearing peak popularity.\nHazelton, who runs a small airport concessions business, decided to walk in to the Shake Shack to learn more.\n“I didn’t know much about it at the time, but I knew enough to pull my car over and see what the hoopla is about,” Hazelton said. “I went home and started doing some research.”\nHazelton and his business partner Kevin Holt started calling Shack Shack managers around the country to get a contact at the company’s corporate headquarters.\nThey got a meeting, and pitched the idea that they could license the Shake Shack concept and open a location at the world’s busiest airport.\n“You got a couple of brothers in Atlanta talking about a startup called H&H Hospitality saying, ‘We can do this too,’” Hazelton said.\nBy 2015, Hazelton and Holt’s H&H Hospitality were competing for an airport contract with a Shake Shack licensing deal in hand.\nBy 2016, Atlanta-based H&H Hospitality in partnership with Atlanta-based Concessions International had won the contract for a location on Concourse A.\nThen came a flurry of controversy amid a federal investigation into Atlanta City Hall, and some airport contracts were put on hold.\nShake Shack’s corporate management has been “very patient” over the last four years, Hazelton said. Eventually, the contract moved forward.\nThe airport Shake Shack opened last month.\nAt an event at the new location on Concourse A on Monday, Concessions International CEO Donata Russell Ross acknowledged “it was a long time coming.”\nNow, the Shake Shack is one of the variety of burger choices at the airport, along with a recently-opened outpost of Bobby Flay’s Bobby’s Burger Palace, Grindhouse Killer Burgers, Five Guys, The Varsity, Boardwalk Fresh Burgers & Fries, McDonald’s and Burger King.","url":"https://www.ajc.com/travel/shake-shack-hartsfield-jackson-sparked-drive-down-peachtree-road/w8mKQ7nvHmqhqTbPtRLtJJ/"}
