{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:35:33","date_modify":"2018-10-30 18:35:33","date_publish":"2016-03-17 12:23:35","description":"A new BDS campaign with the slogan \"Shame on you\" has been gaining momentum in Jordan, the Jerusalem Post reported.","filename":"data/vaneerConsumption/ShameonYouforContaminatingtheBloodofPalestinianChildren.json","image_url":"https://media.breitbart.com/media/2016/03/aisi.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_03_17__1540924533.html","title":"Shame on You for Contaminating the Blood of Palestinian Children","title_page":"Jordanian BDS: Shame on You for Contaminating the Blood of Palestinian Children","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A new BDS campaign with the slogan “Shame on you” has been gaining momentum in Jordan, the Jerusalem Post reported.\nOn Tuesday, campaign organizers held a press conference in Amman in which they called for a blanket boycott of Israeli goods and stated their opposition to Jordan’s policy on Israel, saying that “economic war is no less important than military war.”\n“The campaign stresses that supporting the occupier and striving for normalization with it amounts to paying for the bullets with which it kills innocent Palestinians,” Murad Kadi, a campaign activist said.\nThe campaign was giving out stickers stating “boycott the enemy” in bazaars, stores, and government ministries in Jordan.\nKadi said the campaign seeks to “caution merchants and citizens over the danger of normalization with an enemy which contaminates the blood of children and women in occupied Palestine.”\nThe campaign was first launched in January 2013 but many Jordanian merchants rejected it, according to the report.\n“Initially, the campaign faced difficulties since many merchants shut the door on us, but now the situation is different. We see our stickers calling to boycott Israeli goods on the entrance to stores and even on houses and cars,” Fidaa Ramhi, a campaign activist said.\nA list of “Zionist” brands, including Pizza Hut, McDonald’s, Pepsi, Nestle, and Nike appears on the campaign’s Facebook page.","url":"https://www.breitbart.com/middle-east/2016/03/17/jordanian-bds-shame-israel-contaminating-blood-palestinian-children/"}
