{"authors":["Sarah Fitzmaurice For Daily Mail Australia"],"date_download":"2018-10-23 05:01:02","date_modify":"2018-10-23 05:01:02","date_publish":"2016-01-28 21:02:07","description":"He's a huge fan of taking a selfie and regularly posts smoulder snaps and his best 'blue steel' poses to his Instagram page.","filename":"data/vaneerConsumption/ShaneWarnetrolledafterpostingnaturalselfieshowingoffhiswrinkles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD38FB00000578-0-image-a-11_1454014898710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421700_Shane-Warne-trolled-posting-natural-selfie-showing-wrinkles_1540270862.html","title":"Shane Warne trolled after posting natural selfie showing off his wrinkles","title_page":"Shane Warne trolled after posting natural selfie showing off his wrinkles  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's a huge fan of taking a selfie and regularly posts 'blue steel' poses giving even Derek Zoolander a run for his money.\nBut Shane Warne's latest Instagram post attracted serious criticism from fans - after he posted a natural picture showing off his wrinkles.\nThe 46-year-old uploaded the seemingly filter-free pictures but it attracted a slew of negative comments from fans.\nScroll down for video\nMean: Shane Warne attracted an onslaught of negative comments after posting this selfie to his Instagram page. Many users commented on his wrinkled face and criticised his appearance\nOne user wrote: 'The leather on Shane's face looks tougher then the ball her bowled at Lords for the ashes.' (sic)\nAnother quipped: 'Face Like a roadmap.'\nThe mean-spirited message led one fan to write: 'Some absolutely savage comments on here.'\nShane posted the selfie thanking Ethiad airways following a flight and told fans he's heading to London.\nCruel: One user said that the legendary bowler had skin like a leather cricket ball. Shane pictured in 2006\nCritical: Warnie fanced an onslaught of negative comments from fans\nNot impressed: Hardly any of his followers wrote anything positive about the picture\nHe captioned the image: 'Thanks @etihadairways for looking after me again. You're the best airline in the world. Goodbye Melbourne & see you soon. Are you guys ready for some golf in London next week when I arrive @rossdesmond & Ian Ward #Fore.'\nShane, who is set to appear in the I'm A Celebrity Get Me Out Of Here Australia new series, appears to be heading to England's capital before entering the jungle in South Africa.\nIn recent years Shane has often sported a smooth and wrinkle-free appearance, leading to rumours he turned to Botox.\nNo work? While Shane was dating Elizabeth Hurley he underwent somewhat of an image overhaul leading many to question if he was using Botox\nHe loves a selfie: The former cricketer often posts images of just his face to his Instagram feed\nBut the former cricketer has always denied claims he's ever used injections - claiming his changed appearance was down to losing weight.\nSpeaking to Kyle Sandilands and Jackie O Henderson in 2014 he said of his youthful look: 'It's not anything to do with plastic surgery because I haven't had any,'\n'When you lose 10 kilos your facial features change, everything changes and I'm fresh, I'm eating healthy and I'm happy.'\nWhile Shane has yet to comment on I'm A Celebrity Get Me Out Of Here it's thought he will be entering the jungle after the launch on Sunday.\n'It's not plastic surgery': In 2014 (pictured left) Shane denied ever going under the knife, instead crediting his dramatic change in appearance to healthy eating and weightloss. Pictured right in 2003\nA showbusiness insider has divulged information about the spokesman's contract - revealing he's ruled out consuming creepy crawlies.\n'Shane has a special \"no spider eating clause\" in his contact,' a source told Daily Mail Australia.\n'He's also getting more money than the rest of the stars.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421700/Shane-Warne-trolled-posting-natural-selfie-showing-wrinkles.html"}
