{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-22 21:35:56","date_modify":"2018-10-22 21:35:56","date_publish":"2016-01-28 08:04:27","description":"Stepping out in a white frock at the Australian Open, the ex-wife of cricket legend Shane Warne flaunted her toned arms and legs in a summery halterneck frock.","filename":"data/vaneerConsumption/ShaneWarnesexwifeSimoneCallahancutsstylishfigureattheAustralianOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A70F6C00000578-0-image-a-57_1453960030315.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420400_Shane-Warne-s-ex-wife-Simone-Callahan-cuts-stylish-figure-bohemian-linen-dress-attends-ladies-lunch-Australian-Open_1540244156.html","title":"Shane Warne's ex-wife Simone Callahan cuts stylish figure at the Australian Open","title_page":"Shane Warne's ex-wife Simone Callahan cuts stylish figure at the Australian Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"While it was a little overcast in Melbourne on Thursday, Simone Callahan was in cheery spirits as she attended a ladies' lunch.\nStepping out in a white frock at the Emirates suite at the Australian Open, the ex-wife of cricket legend Shane Warne flaunted her toned arms and legs in a summery halterneck frock.\nThe 45-year-old joined a guest list made up of other socialites, including host of Australia's Got Talent, Sophie Monk, and former Neighbours star Natalie Bassingthwaighte.\nLooking all white! Shane Warne's ex-wife Simone Callahan cut a stylish figure in bohemian linen dress as she attends ladies' lunch at the Emirates siute at the Australian Open in Melbourne on Thursday\nShe opted for comfort with a pair of flats, but the design of the sandals added a slight bohemian touch to her look.\nAppearing with natural make-up, the former model appeared to sport just a touch of bronzer to her cheeks, and allowed her long blonde locks to flow freely over shoulders.\nSophie meanwhile chose a strapless grey marle frock by Sydney-based designer Lillian Xu with a giant bow on the bust.\nNatural beauty: Appearing with natural makeup, the former model appeared to sport just a touch of bronzer to her cheeks\nIt landed just above her knees, and appeared to be constructed using fused neoprene - a thicker fabric for the cool Melbourne weather.\nShe paired the look with some studded platform pumps by Christian Louboutin, and allowing for the dress to speak for itself, she opted for very minimal jewellery.\nNatalie however was less formally dressed, wearing a simple, khaki singlet dress and battered white sneakers.\nAppearing fresh-faced, the former Neighbours star cinched her waist with a leopard-print shirt and kept jewellery to a minimum also.\nBow-eautiful! Sophie Monk meanwhile chose a strapless grey marle frock by Sydney-based designer Lillian Xu with a giant bow on the bust\nDressing down: Natalie however was less formally dressed, wearing a simple, khaki singlet dress and battered white sneakers\nCasual: Appearing fresh-faced, the former Neighbours star cinched her waist with a leopard-print shirt and kept jewellery to a minimum also\nFellow Neighbours stars were also in attendance, including Ashleigh Brewer, who opted for an all-black ensemble, and Krista Vendy, also in black.\nReal Housewife of Melbourne star Andrea Moss meanwhile looked glamorous in an white brocade minidress and went for white strappy wedges.\nTV presenter and model Lauren Phillips also attended the event, wearing a white linen long sleeve dress that finished just above her knees.\nAll black: Neighbours star Ashleigh Brewer opted for an all-black ensemble down to her manicure, and added a pop of colour with rich red matte lipstick\nStylish: Krista Vendy (R) also opted for a black outfit, but added a touch of glam with a pair of gold strappy sandals. Real Housewife of Melbourne star Andrea Moss (L) meanwhile looked glamorous in an white brocade minidress and went for white strappy wedges\nPutting her best foot forward: TV presenter and model Lauren Phillips also attended the event, wearing a white linen long sleeve dress that finished just above her knees\nHer look featured tassels and she teamed it with camel heels.\nOn the day, the women took the opportunity to have a bit of fun, and posed with a tennis racket prop while there.\nSophie - who is a singer and actress - used hers to pretend she was playing air guitar.\nMucking around: On the day, the women took the opportunity to have a bit of fun, and posed with a tennis racket prop while there","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420400/Shane-Warne-s-ex-wife-Simone-Callahan-cuts-stylish-figure-bohemian-linen-dress-attends-ladies-lunch-Australian-Open.html"}
