{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:56:00","date_modify":"2018-10-30 19:56:00","date_publish":"2015-04-10 14:06:55","description":"Shannon Watts of Moms Demand Action states that everyone should be subjected to the same background check Gabby Giffords' attacker passed.","filename":"data/vaneerConsumption/ShannonWattsEveryoneShouldHavetoGoThroughBackgroundCheckGabbyGiffordsAttackerPassed.json","image_url":"https://media.breitbart.com/media/2015/01/Moms-Demand-logo-ap.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_10__1540929360.html","title":"Shannon Watts: Everyone Should Have to Go Through Background Check Gabby Giffords' Attacker Passed","title_page":"Shannon Watts: Everyone Should Have to Go Through Background Check Gabby Giffords' Attacker Passed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On April 6, Fox News ran a column which contained comments from Moms Demand Actions’ Shannon Watts praising Washington state’s institution for the very kind of background check Jared Loughner passed to get the firearm he used to attack Gabby Giffords, then saying it’s only “gunsense” that all other gun purchasers should have to go through the same background check.\nAccording to Fox News, Watts cites the institution of expanded background checks in Washington state as proof that gun control proponents did not get beaten as badly as it appeared during the mid-term elections. Those checks outlawed private gun sales in Washington state by expanding existing background checks to all sales–retail and private–and Watts suggests that Americans everywhere want background checks instituted in this same way across the country.\nShe says doing so would show “gunsense.”\nQuestion: Would expanding background checks to every sale, both retail and private, stop high profile shootings like the one that resulted in Gabby Giffords’ injury or the heinous attack on Sandy Hook Elementary?\nThe answer is no. Expanding background checks will not prevent such attacks as Giffords endured because her attacker passed a background check. And, as Senator Joe Manchin (D-WV) explained, expanding background checks would not have stopped Adam Lanza from attacking Sandy Hook because he stole his guns, thereby purposely circumventing all gun controls.\nQuestion: Would expanding background checks to every sale stop high profile shootings like the one that resulted in the deaths of police officers in Las Vegas in June or the one that resulted in the deaths of movie-goers in Aurora in July 2012?\nThe answer is no because the Las Vegas attackers–Jerad and Amanda Miller–acquired their guns via background checks, as did Aurora theater gunman James Holmes.\nThe same could be said about 2014 Fort Hood gunman Ivan Lopez, Arapohoe High School gunman Karl Halverson Pierson, DC Navy Yard gunman Aaron Alexis, and 2009 Fort Hood gunman Nidal Hasan, just to name a few. These attackers and others went through background checks to get the guns they used to commit heinous, despicable crimes.\nSo these checks do nothing to keep guns out of the hands of some of the most dangerous people among us right now, yet Shannon Watts says her group pushes background checks as a way of “keeping guns out of the hands of dangerous people.”\nIs this what “gunsense” really looks like?\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/04/10/shannon-watts-everyone-should-have-to-go-through-background-check-gabby-giffords-attacker-passed/"}
