{"authors":["Alicia Vrajlal","Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-22 20:36:53","date_modify":"2018-10-22 20:36:53","date_publish":"2016-01-28 02:00:52","description":"He's the 'international cricketing megastar' flying into the South African jungle on Sunday.","filename":"data/vaneerConsumption/ShaneWarnereportedlyreceives2mtoappearonAustralianImACelebrity2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A6365000000578-0-image-a-24_1453949341454.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420243_Shane-Warne-reportedly-receives-2-million-appear-m-Celebrity-Here_1540240613.html","title":"Shane Warne reportedly receives $2m to appear on Australian I'm A Celebrity 2016","title_page":"Shane Warne reportedly receives $2m to appear on Australian I'm A Celebrity 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the 'international cricketing megastar' flying into the South African jungle on Sunday.\nAnd it looks like cricketer Shane Warne is reportedly receiving quite the hefty pay cheque to match his title to star on I'm A Celebrity... Get Me Out Of Here! next month.\nEntertainment guru Peter Ford told a segment on 3AW's breakfast radio programme on Thursday that the 46-year-old retired spin bowler is set to receive $2million.\nScroll down for video\nJungle bound: Cricketer Shane Warne is reported to be receiving $2 million to appear on I'm A Celebrity... Get Me Out Of Here next month\n'I’ve heard this from three sources, I find it hard to believe, but the amount is $2million,' Ford said on air.\nDaily Mail Australia revealed that Shane, from Melbourne, would be joining the second series of the Channel Ten reality show, which kicks off on Sunday.\nFurthermore a showbusiness insider has divulged information about the Advanced Hair Studio spokesman's contract - saying he must not be asked to eat spiders, as well as revealing, like Ford said, that he's secured a more lucrative deal than other contestants.\n'Shane has a special \"no spider eating clause\" in his contact,' a source told Daily Mail Australia.\nFearful: Shane has a special no spider eating clause in his contact,' an insider told Daily Mail Australia\n'He's also getting more money than the rest of the stars.\n'Most of the celebs are believed to have got $50,000 for six weeks shooting – Warnie is believed to have got more,' the source continued.\nTwo other sports stars are set to join Shane in South Africa later this week.\n'Along with Shane, Brendan Fevola and Gorden Tallis are also headed for the jungle,' the insider revealed to Daily Mail Australia.\nThe 35-year-old Former AFL star Brendan Fevola will be entering the jungle later this week.\nGetting ready: . The Melbourne-born athlete has previously admitted his arachnophobia, which was the basis of a 2014 advertising campaign by UK-based online bookmakers Sportingbet\nThe ex-Carlton player, who infamously had an extra-marital affair with model Lara Bingle back in 2006, has been rumoured to be entering the jungle for several weeks.\nHe will be joined by 42-year-old former rugby league international Gorden Tallis.\nThe ex-Brisbane Broncos star earned the nickname 'Raging Bull' for his on-field aggression during the height of his career.\nOn I'm A Celebrity..., contestants take part in daily Tucker Trials to earn meals for the camp, where they are sometimes challenged to swallow local creepy crawlies.\nSecond time lucky: The sportsman was apparently approached to appear on the Channel Ten reality show last year but turned the first offer down\nNormally, each insect eaten results in a meal for themselves and the other celebrities back at camp.\nShane has previously admitted he suffers from arachnophobia, meaning a fear of spiders or other arachnids.\nHis fear was the basis for an advertising campaign he launched with UK-based online gambling company Sportingbet back in 2014.\nI'm A Celebrity... Get Me Out of Here! starts Sunday 31 January on Channel Ten.\nVictory: Ex-AFL star Brendan Fevola, 35, pictured here in June 2013, will also be a contestant on I'm A Celebrity..., according to a source","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420243/Shane-Warne-reportedly-receives-2-million-appear-m-Celebrity-Here.html"}
