{"authors":["Greg Styles For Daily Mail Australia"],"date_download":"2018-10-23 05:12:11","date_modify":"2018-10-23 05:12:11","date_publish":"2017-03-10 15:09:53","description":"Despite being born on these shores, having a father of Pakistani and Saudi Arabian descent and a Lithuanian mother meant Shanina Shaik didn't fit the typical 'blonde beach look'.","filename":"data/vaneerConsumption/ShaninaShaikfeltneglectedinAustraliabecauseoflooks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E233A9900000578-0-image-a-60_1489156600857.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301390_Shanina-Shaik-Australia-Latina-New-York_1540271531.html","title":"Shanina Shaik felt neglected in Australia because of looks","title_page":"Shanina Shaik felt neglected in Australia because of looks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shanina Shaik has revealed the struggles she faced when trying to break into the Australian modelling scene.\nDespite being born on these shores, having a father of Pakistani and Saudi Arabian descent and a Lithuanian mother meant the 26-year-old didn't fit the typical 'blonde beach look' of homegrown models.\nReflecting on the barriers she was confronted with, Shanina told The Daily Telegraph on Saturday that she felt like her face just didn't fit.\nOpening up: Shanina Shaik has revealed the struggles she faced when trying to break into the Australian modelling scene\nShe said: 'When I was younger and starting out, the Australian modelling scene was very unaccepting of my look. I felt like I didn't fit, because the typical Australian look was the blonde beach girl and here I was, the complete opposite.'\nAfter finding her career at a standstill, Shanina was compelled to seek a different route to the top.\nThe Melbourne native finished runner-up on the one and only series of Make Me A Supermodel, hosted by modelling royalty Jennifer Hawkins, earning herself a modelling contract in the process.\nOdd one out: Despite being born on these shores, having a father of Pakistani and Saudi Arabian descent and a Lithuanian mother meant the 26-year-old didn't fit the typical 'blonde beach look' of homegrown models\nLooking back: Reflecting on the barriers she was confronted with, Shanina told The Daily Telegraph on Saturday that she felt like her face just didn't fit\nA move to New York followed when she was just 17, proving to be the catalyst for her career to take off.\nShe said: 'It's the main reason I went on the show because I felt like I had to try another way to get into modelling - I knew I had to get to New York and the show was my way to achieve that.'\nShanina's change of scenery coincided with some of the biggest names in the fashion world coming calling for her services.\nAhoy there! A move to New York followed when she was just 17, proving to be the catalyst for her career to take off. Pictured in 2011\nRise and rise: After strutting her stuff up and down catwalks for three seasons, Victoria's Secret provided her big break when she was cast in the lingerie giant's 2011 Fashion Show\nAfter strutting her stuff up and down catwalks for three seasons, Victoria's Secret provided her big break when she was cast in the lingerie giant's 2011 Fashion Show.\nAnd while her looks proved to be a hindrance in making it big in Australia, they had the opposite effect in the more diverse American market.\nShe revealed: 'I was booking lots of jobs and sometimes being categorised as a Latina, which was fine with me. There's certainly more acceptance and understanding about cultures now and that there is not just one look, but so many that can be celebrated.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301390/Shanina-Shaik-Australia-Latina-New-York.html"}
