{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:55:24","date_modify":"2018-10-22 23:55:24","date_publish":"2017-03-10 04:59:28","description":"The resilient actress wrote, 'This is a true #tbt,' referring to the social media trend Throwback Thursday, and said that the show remains 'to this day the biggest tv show of its kind [she] worked on.","filename":"data/vaneerConsumption/ShannenDohertysharesretroshotwithJasonPriestley.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1FB33F00000578-0-image-a-79_1489117303777.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299926_Shannen-Doherty-shares-retro-shot-Jason-Priestley_1540252524.html","title":"Shannen Doherty shares retro shot with Jason Priestley","title_page":"Shannen Doherty shares retro shot with Jason Priestley | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shannen Doherty's usually looking forward, but on Thursday, she decided to take a look back.\nThe 45-year-old posted a shot of herself and Beverly Hills, 90210 co-star Jason Priestley from 1990s while sharing her thoughts on the famed Fox hit that centered around a pair of teen twins who moved with their parents from Minnesota to Beverly Hills.\nThe resilient actress wrote, 'This is a true #tbt,' referring to the social media trend Throwback Thursday, adding that the show remains 'to this day the biggest tv show of its kind [she] worked on.'\nLooking back: Shannen Doherty posted a shot of herself and Beverly Hills, 90210 co-star Jason Priestley on Instagram on Thursday, adding that she was 'very proud' of the program\nLooking forward: Both stars remain in the public eye, as Shannen (left) has been an inspiration to thousands amid her documented cancer battle, while Priestley has been steadily working for years on TV\nFighting the good fight: Doherty's heart and tenacity as during her fight with cancer has been encouraging to her fans and those who have been impacted by the disease\nShe called the program, which was created by Aaron Spelling, 'A true iconic show that reached and touched not only young people, but bridged the gap to their parents,' adding that she's 'very proud of this show.'\nThe inspirational beauty, who's diligently shared her cancer battle via social media, added the hashtags '#brendawalsh' and '#twins' at the tail end of the post, also tagging her TV sibling Priestley, 47.\nLast summer the actor, who played Brandon Walsh on the Darren Star-created, Aaron Spelling-produced show, hailed his former co-star as 'incredibly brave' for sharing images from when she shaved her head amid treatments.\nWe love the 90s: Beverly Hills, 90210 ran from 1990 until its cancellation in January of 2000\nSmokin' hot: Priestley and Doherty were two of TV's hottest stars amid their show's early success. Here, the duo were seen at the 1991 Emmys\nFriday I'm in love: Shannen, clearly feeling nostalgic, also uploaded this shot with her former co-star Luke Perry on Thursday\n'Shannen's a strong kid and a tough fighter and I know that she's gonna come through this fight and she's gonna be OK,' he told Entertainment Tonight in July.\nLast fall, many of Shannen's other co-stars from the 90s staple shared well-wishes and emphasized her importance to the program during a panel event at a Chicago nostalgia convention called Rewind Con.\nLuke Perry, who played Dylan McKay, the sometimes-boyfriend of Shannen's character Brenda Walsh, said that while some of Doherty's 'contributions to the show get forgotten or they somehow get minimized ... the reality is she's a very big part of the success of that program.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299926/Shannen-Doherty-shares-retro-shot-Jason-Priestley.html"}
