{"authors":["Tatiana Tenreyro"],"date_download":"2018-10-31 01:49:02","date_modify":"2018-10-31 01:49:02","date_publish":"2018-09-06 14:27:53","description":"Netflix’s new YA rom-com Sierra Burgess Is a Loser puts a modern spin on the classic Cyrano de Bergerac story, with Riverdale’s Shannon Purser playing the titular character. But besides its love story, music makes up a large part of the film. Sierra…","filename":"data/vaneerConsumption/ShannonPurserReallySingsInSierraBurgessIsALoserHerVoiceWillLeaveYouSoImpressed.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/eb20ae12-4ff9-4e98-83e1-bd973552b543-screen-shot-2018-08-27-at-25120-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_shannon-purser-really-sings-in-sierra-burgess-is-a-loser-her-voice-will-leave-you-so-impressed-10252841_1540950542.html","title":"Shannon Purser Really Sings In 'Sierra Burgess Is A Loser' & Her Voice Will Leave You So Impressed","title_page":"Shannon Purser Really Sings In 'Sierra Burgess Is A Loser' & Her Voice Will Leave You So Impressed","title_rss":"NULL","source_domain":"bustle.com","text":"Netflix’s new YA rom-com Sierra Burgess Is a Loser puts a modern spin on the classic Cyrano de Bergerac story, with Riverdale’s Shannon Purser playing the titular character. But besides its love story, music makes up a large part of the film. Sierra is secretly a singer-songwriter, yet fears sharing her music with the world. And in case you were wondering if Purser is really singing in Sierra Burgess — she actually is.\nHearing Purser sing might come as a surprise to some fans, but the actor has actually been singing for a long time. “I’ve been singing and doing musical theater since I was younger,” she says, speaking over the phone to Bustle in August. “I love to sing; it’s a big part of my life. But [Sierra Burgess Is a Loser] was the first time I got to sing on camera. It was definitely a little scary at first, but just a really great experience.”\nDuring her journey to self-acceptance in the film, Sierra decides to (small spoiler!) write a song to her crush Jamey (Noah Centineo), titled “Sunflower.” In the song, she likens herself to the flower, longing to instead be a rose so he’ll think she’s beautiful. It’s the only song Purser sings in the film, but it carries a big significance in the story. And what makes the track even more special is that composers Leland and Bram Inscore and screenwriter Lindsay Beer invited Troye Silvan to collaborate as co-songwriter. Together, the group created a heartfelt, catchy song that encapsulates Sierra’s longing for acceptance.\nNetflix on YouTube\nThis isn’t the only time Purser has sung on-camera, though. After filming Sierra Burgess, the actor appeared as a series regular on NBC’s short-lived show Rise, showing off her singing talents. Much like her tune in Sierra Burgess, her cover of fun.’s “Carry On” in Rise comes at a pivotal point for her character, who's dealing with a crush.\nBesides singing in Rise and Sierra Burgess, Purser also often shares covers on Twitter, including Frank Ocean’s “Ivy” and Twenty One Pilots’ “Jumpsuit.” The former got a co-sign from Debby Ryan, who replied saying “I’m shaken. Sing often pls.”\nEach time Purser shares a cover, her fans excitedly ask for more, with one fan demanding an EP after she shared her Twenty One Pilots cover. It’s been a while since Purser has shared any new tracks, leaving fans waiting for one to pop up. But, for those who are eagerly waiting for more, good news: there might be something in store soon. “I have been in the studio, actually, so I would love to release something and hopefully I will be able to pretty soon,” Purser tells Bustle. Fingers crossed that this is the case.\nIt totally makes sense if Purser is holding off on sharing more covers while she's in the studio, making some new tracks to eventually share with her fans. But, in the meantime, Sierra Burgess is the perfect antidote for those who want to hear Purser show off her impressive voice.","url":"https://www.bustle.com/p/shannon-purser-really-sings-in-sierra-burgess-is-a-loser-her-voice-will-leave-you-so-impressed-10252841"}
