{"authors":["Hannah Paine","Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-22 22:51:08","date_modify":"2018-10-22 22:51:08","date_publish":"2017-04-26 05:56:03","description":"On Tuesday Shanina Shaik took a page out of selfie queen Kim Kardashian's book, sharing a revealing photo to Instagram, showing off her shapely derriere while posing for a 'belfie'.","filename":"data/vaneerConsumption/ShaninaShaikshowsoffhershapelyderriereinbelfie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BF1B800000578-0-image-a-30_1493175456704.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446134_Shanina-Shaik-shows-shapely-derriere-belfie_1540248668.html","title":"Shanina Shaik shows off her shapely derriere in 'belfie'","title_page":"Shanina Shaik shows off her shapely derriere in 'belfie' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the Aussie supermodel not shy about showing off her amazing figure.\nAnd on Tuesday, Shanina Shaik took a page out of selfie queen Kim Kardashian's book, sharing a revealing photo to Instagram.\nThe 26-year-old showed off her derriere while posing for a 'belfie' wearing a VERY skimpy one piece.\nTaking a page out of Kim Kardashian's book? Shanina Shaik shows off her derriere wearing a skimpy one piece in 'belfie'\nIn the photo, shared with Shanina's 913,000 Instagram followers, the natural beauty can be seen posing in a changing room.\nStanding in front of a mirror, the leggy brunette shows off her amazing curves, wearing a skimpy black swimsuit.\nThe shot mirrors a now iconic Kim Kardashian posted on Twitter in 2013, showing off her famous rump in a white swimsuit.\nShanina appears to be a fan of the 'belfie' pose, with her Instagram feed littered with several pictures showing her in the pose.\nHer inspiration? The shot mirrors a now iconic Kim Kardashian posted on Twitter in 2013, showing off her famous rump in a white swimsuit\nShanina's revealing post comes after her fiance DJ Ruckus told Daily Mail Australia the couple couldn't wait to have kids.\nRuckus revealed that 'wedding plans are in motion', and talk of babies is a common thing for the pair.\n'People are saying that we will have beautiful children and keep asking (when),' he said.\n'We do five-year plan sort of stuff. So of course babies are definitely on the cards.'\nExcited: Shanina's revealing post comes after her fiance DJ Ruckus told Daily Mail Australia the couple couldn't wait to have kids\nAnd while they're currently based in New York, with various properties between the two, Ruckus admitted that the concept of settling in Australia would be nice.\n'Shanina has property in Australia and obviously her family is here, but I don’t know if we could make it work,' he said.\n'It would be nice to have a little place in Byron Bay, a nice retreat.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446134/Shanina-Shaik-shows-shapely-derriere-belfie.html"}
