{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-22 20:41:24","date_modify":"2018-10-22 20:41:24","date_publish":"2016-01-28 02:47:24","description":"Despite an online petition fetching over 6,000 signatures, 40-year-old country singer Shannon Noll has not made the lineup for this year's Groovin' The Moo.","filename":"data/vaneerConsumption/ShannonNollleftoutofGroovinTheMoolineup2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A64A9500000578-0-image-a-70_1453960531434.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420244_Shannon-Noll-left-Groovin-Moo-lineup-despite-online-petition-6-000-signatures-leaving-campaign-founder-broken-man_1540240884.html","title":"Shannon Noll left out of Groovin' The Moo lineup 2016","title_page":"Shannon Noll left out of Groovin' The Moo lineup 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the Australian Idol runner-up turned ironic hipster hero.\nBut despite an online petition that fetched over 6,000 signatures appealing to festival bosses, 40-year-old country singer Shannon Noll has not made the line-up for this year's Groovin' The Moo.\nThe line-up for the music festival, which includes headliners triple j Hottest 100 chart toppers The Rubens, was released on on Thursday, and Shannon fan and campaign founder Nat Robinson has been left 'a broken man'.\nScroll down for video\n'Australian Idol all over again': Shannon Noll has been left out of Groovin' The Moo line-up when the music festival made its announcement on Thursday\nAdmin for the Facebook page, Get Shannon Noll to Groovin The Moo 2016', Nat vented on Facebook: 'Shocked, upset, angry, confused... These are only a few words to describe how I feel right now. I have let every single one of you down. I am so so sorry.'\nThe supporting petition, started by fellow fan Ethan Adams-Norris, garnered a total of 6,274 supporters and excitement had built over the past month - 'Nollsie' even said he'd been in touch with the organisers - but all hope was shattered.\nHours later, Nat added: 'Well done to the Groovin organisers for missing out on the opportunity of a f****** life time.'\n'A broken man': Founder of the failed online petition, Ethan Adams-Norris, was left 'shocked, upset, angry and confused,' at the news\nIt looked promising: The 40-year-old What About Me singer said he'd been in touch with the festival\nThe fans of the page are ropeable, expressing their anger through hilarious memes and comparing his exclusion from the music festival to his runner up position on Australian Idol.\n'2003 Australian Idol all over again. Shannon Noll has been robbed,' wrote one fan.\nThe ‎Wyong Rugby League Club in Kanwal New South Wales have offered the Facebook page's over 9,000 fans a consolation prize however.\nVenting their shock: The social media page has been flooded with hilarious memes to describe fans' disappointment\nWhat about him? The petition garnered a total of 6,274 supporters, but it was ultimately unsuccessful\nUsing the seemingly devastating news to their advantage, the pub promoted their event taking place on April 15 where the What About Me singer will be performing.\nAs for future festival appearances, will Shannon perhaps make an appearance at the coveted Splendour in the Grass in Byron Bay?\n'I have a few idea's up my sleeve that I'll be dropping over the next couple of days hopefully,' Nat told Daily Mail Australia on Thursday.\n'I have previously been in contact with Shannon's manager and he also has an idea he wants to discuss with me.'\nGroovin' The Moo begins its tour of regional centres in April, kicking off in Maitland on April 23, Canberra on April 24, Oakbank on April 25, Bendigo on April 30, Townsville on May 1, and finishing off in Bunbury on May 7.\nGROOVIN' THE MOO 2016 LINEUP ALISON WONDERLAND, BOO SEEKA, BOY & BEAR, BRITISH INDIA, CLIENT LIAISON, DANNY BROWN (USA), DRAPHT, DZ DEATHRAYS, EMMA LOUISE, GOLDEN FEATURES, HARTS, ILLY, IN HEARTS WAKE, MS MR (USA), MUTEMATH (USA), NGAIIRE, ODESZA (USA), RATATAT (USA), REMI, THE RUBENS, SAFIA, TWENTY ONE PILOTS (USA), VALLIS ALPS, VIC MENSA (USA)","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420244/Shannon-Noll-left-Groovin-Moo-lineup-despite-online-petition-6-000-signatures-leaving-campaign-founder-broken-man.html"}
