{"authors":[],"date_download":"2018-10-23 04:18:09","date_modify":"2018-10-23 04:18:09","date_publish":"2016-01-28 20:15:26","description":"Former Los Angeles Lakers center Shaquille O'Neal is to be honored with a statue outside the NBA team's Staples Center arena. O'Neal will join former Lakers ...","filename":"data/vaneerConsumption/ShaqstatuetogracehomearenaofNBALakers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h4xp-4PuZeKVXE7cd9005b2c87610877a-743_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421611_Shaq-statue-grace-home-arena-NBA-Lakers_1540268289.html","title":"Shaq statue to grace home arena of NBA Lakers","title_page":"Shaq statue to grace home arena of NBA Lakers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shaq statue to grace home arena of NBA Lakers\nFormer Los Angeles Lakers center Shaquille O'Neal is to be honored with a statue outside the NBA team's Staples Center arena.\nO'Neal will join former Lakers greats Jerry West, Kareem Abdul-Jabbar and Earvin \"Magic\" Johnson, NHL icon Wayne Gretzky -- who put the Los Angeles Kings on the map -- boxer Oscar De La Hoya and broadcaster Chick Hearn in being immortalized in bronze at the downtown Los Angeles arena.\n\"We look forward to having Shaq join the other legends who have been honored with statues at Staples Center,\" Jeanie Buss, Lakers president and co-owner, said in a statement. \"He is a giant not only in size, but also in stature and in what he accomplished as a Laker.\nFormer Los Angeles Lakers center Shaquille O'Neal, pictured on February 12, 2013, will be honored with a statue outside the Staples Center arena ©Robyn Beck (AFP/File)\n\"Shaq literally broke the ground for the site, and was hugely responsible for not only getting Staples Center built, but for making it one of the most successful and famous arenas in the world. It's an honor that is well deserved.\"\nO'Neal was taken aback when he learned of the news not from the team but during an interview on \"Jimmy Kimmel Live\" on Wednesday night.\nBefore his relationship with Kobe Bryant deteriorated and the Lakers traded O'Neal to the Miami Heat in 2004, the duo dominated the Western Conference.\nO'Neal joined the Lakers in 1996 after starting his career with the Orlando Magic. The Lakers won the NBA championship in 2000, 2001 and 2002. O'Neal was the 1999-2000 NBA Most Valuable Player and those three title runs all saw him named MVP of the Finals.","url":"https://www.dailymail.co.uk/wires/afp/article-3421611/Shaq-statue-grace-home-arena-NBA-Lakers.html"}
