{"authors":["Phoebe Jackson-Edwards For Mail Online"],"date_download":"2018-10-22 21:36:39","date_modify":"2018-10-22 21:36:39","date_publish":"2016-01-28 08:19:16","description":"Sharon Ebert, 42, from Southampton, bought high-tech equipment for her garage after her gym closed but it's been nine months since she used any of it because she's too distracted at home.","filename":"data/vaneerConsumption/SharonEbertspends7000onconvertinghergarageintoagym.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/16/30A1B7E600000578-0-image-a-2_1453910777312.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3419080_Woman-spends-7-000-converting-garage-gym_1540244199.html","title":"Sharon Ebert spends £7,000 on converting her garage into a gym","title_page":"Sharon Ebert spends £7,000 on converting her garage into a gym | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Many people sign up for pricey gym membership that they never use but one woman has revealed how she did the opposite.\nSharon Ebert, 42, from Southampton, Hampshire, splashed out on £7,000 on a high-tech home gym that includes a cable machine and dumbbell set, both costing more than £1,000 each, which she doesn't even use.\nThe lettings agent wanted to have the equipment on tap but soon found that housework got in the way at home and the workout zone languishes unused.\nSharon Ebert revealed she spent over £7,000 on a high-tech home gym including a cable machine and dumbbell set, both costing over £1,000 each, which she doesn't use\nSharon, from Southport, wanted to have the equipment on tap but found housework got in the way at home - but she's still looking to spend on more workout machines. Pictured using the dumbbells while kettle bells can be seen to the right\nSharon told FEMAIL: 'I've got pretty much a whole gym at home. I don't do things by halves.\n'In the last nine to 10 months I haven't used it at all.'\nShe admitted although guests are amazed by the gym, she doesn't use it as she 'never has the motivation.'\nSharon was an avid member of her local gym until it was shut down in 2012 and she said she didn't feel comfortable going to another gym.\nSharon put the gym together in a month, buying online large equipment like a squat rack, running machine, balance trainer and multi-gym machine\nSharon keeps fit with regular gym sessions and works out with a trainer but when her local gym closed she thought a home gym would be the answer\nSo in 2013, Sharon decided instead to convert her garage to a workout space just as good as her old gym.\nWith the full support of her husband Hayden Ebert, 38, she began researching what equipment to buy and finding the best prices online but in hindsight she 'went over the top and bought everything.'\nSharon put the gym together in a month, snapping up professional kit like a squat rack, a running machine, a balance trainer and a multi-gym machine.\nBut she said: 'I got as much as I could. It was an investment in myself and my husband. I've got four children it gives me a bit of time to myself.'\nSharon created the gym in 2013, Sharon began researching what equipment to buy and finding the best prices online but in hindsight she 'went over the top and bought everything'\nSharon's husband Hayden also regularly works out so the two hoped the gym would be an investment\nBut Sharon found she lacked motivation at home and has not used her home gym for nine months, pictured at her local gym\nThe couple, who own a lettings agency, didn't need to save to buy the kit.\nSharon said: 'We're fortunate enough we can have luxuries in life.'\nBut her plan backfired and she found it difficult to keep concentrating with so many distractions.\nShe said: 'At home, my dog Ethel the pug has to be with me.\n'If I'm doing abs low down she jumps on me and smothers me with kisses. I'd put the children's dinner in the oven then work out, but after 20 minutes I have to go and check on it.\n'Or the kids want something so you go and do that. At home there's my mobile which can go off, at the gym it's in my locker.'\nShe joined the gym instead last May because she needed a trainer to 'push that bit harder' and now works out there three to four times a week at a Fitness First gym and with a personal trainer twice a week.\nSharon doesn't regret paying for the gym equipment and is now looking to buy more 'compact' equipment to replace some of the more dated machines\nSharon found she would have her children or her mobile distract her while trying to work out but at the gym she can lock her phone away\nSharon also found her dog Ethel wanted to be with her when she worked out at home and would 'smother her with kisses'\nSharon said: 'Friends came round and they were always like \"Oh my God\". But I prefer the gym environment.'\nAlthough Sharon does not use the gym any more she doesn't regret spending the money.\nHer son Deryn, 16, often uses it and brings friends round to try it, while her daughter Shannon, 19, uses it sometimes with boyfriend Braiden, 22.\nAnd Sharon is looking to buy more up-to-date equipment for her home gym and replacing some of the machines with more up-to-date and 'compact' ones.\nShe said: 'We've spoken about about a few things to go in the gym, I think \"Oh I'd love one of those,' updating to more compact machines that do more than one thing.'\nA recent survey found that people struggle to work out at home, with 21 per cent having less motivation and not working out at home.\nOver half of the people surveyed said they tried to implement an at home exercise routine but stopped after a week.\nHusband Hayden also prefers the gym and the couple work out together usually three times a week as well as working out with a trainer\nSharon prefers to go to the gym and lacks motivation when trying to work out at home, she prefers seeing a trainer who can push her","url":"https://www.dailymail.co.uk/femail/article-3419080/Woman-spends-7-000-converting-garage-gym.html"}
