{"authors":["Lauren Grounsell For Daily Mail Australia"],"date_download":"2018-10-22 20:03:26","date_modify":"2018-10-22 20:03:26","date_publish":"2016-01-29 00:11:19","description":"Sharon Pakir was three days away from giving birth when she finally hung up her dancing shoes. The Melbourne mother is a Latin dancer and continued to perform while pregnant.","filename":"data/vaneerConsumption/SharonPakirwhodanceduntilTHREEdaysbeforegivingbirth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30ADFCBA00000578-0-image-a-66_1454024718588.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420224_Latin-dancer-Sharon-Pakir-spins-shimmies-way-incredible-dance-routines-NINE-months-pregnant_1540238606.html","title":"Sharon Pakir who danced until THREE days before giving birth","title_page":"Sharon Pakir who danced until THREE days before giving birth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She performed abroad and in cities around Australia and New Zealand\nAt nine weeks pregnant she came second in the World Latin Dance Cup\nDancing helped keep her in shape and 'limber' throughout her pregnancy\nShe performed until six month, and danced until THREE days before birth\nSharon Pakir, 34, is a Latin dancer and continued to dance while pregnant\nWhen Sharon Pakir was about nine weeks pregnant, she travelled to Miami to compete in the World Latin Dance Cup.\nNot only did she manage her routine with a baby on board, her flawless performance placed her second in the world.\nThe Melbourne resident told Daily Mail Australia dancing helped her stay fit during and after pregnancy, and she kept it up until three days before delivery.\nPregnant power: Latin dancer, Melbourne's Sharon Pakir, danced throughout her pregnancy\nSpinning around: She danced until three days before she gave birth, and performed until she was six months along\nDancing to success: At about nine weeks pregnant she and her partner placed second in the World Latin Dance Cup in Miami\n‘The first trimester I travelled and performed in six different cities across Australia and New Zealand,’ she said.\n‘I performed until six months pregnant.\n‘I took care to not ever dance in high heels… and to not get my heart rate too high.\nDancing through pregnancy: Throughout her first trimester of pregnancy Mrs Pakir travelled and performed across Australia and New Zealand\nBaby steps: ‘I took care to not ever dance in high heels … and to not get my heart rate too high,' she said\n‘I think the hardest time was the first trimester, I was nauseous and exhausted.\n‘But I felt amazing in my second and third trimester.\n‘I didn’t put on too much weight I think because of the dancing, I certainly didn’t regulate my eating, I put on 13 kilograms.’\nBorn to dance: She gave birth to her son, Charlie, seven weeks ago after gaining only 13 kilograms throughout her pregnancy\nMrs Pakir has danced for the past nine years and owns her own dance school, Spin City Dance, in Melbourne.\nThroughout her pregnancy she posted videos to her Facebook page of herself performing the Cha Cha and spinning with her dance partner, her bump on full display.\nShe gave birth to her son, Charlie, seven weeks ago and said dancing had helped her with her recovery.\nYears of experience: Prior to her pregnancy Mrs Pakir had danced for nine years and owns her own dance school in Melbourne\nBody benefits: ‘It kept my very limber, I never felt like I was waddling or by my back was hurting too badly,' she said\nDancing helped with her core and spinal strength and the twists abdominal strength and hips.\n‘It kept my very limber, I never felt like I was waddling or by my back was hurting too badly.’\nDespite her positive experience, Mrs Pakir said some people did question whether she should continue to dance throughout her pregnancy.\nSupport of her doctor: Mrs Pakir has previously suffered two miscarriages and despite having the support of her obstetrician, people questioned whether she should dance while pregnant\nThe 34-year-old has previously suffered two miscarriages, one 13 and the other at 14 weeks, and said some people questioned whether the exercise she did was to blame.\n‘A lot of people said to me are you sure you’re dancing has not caused them, which is quite a cruel thing to say,’ she said.\nMrs Pakir said her obstetrician told her dancing did not cause her to miscarry, and she should continue to exercise.\nListening to her body: She said society placed pressure on pregnant women\nFemale empowerment: ‘My biggest advice is to trust yourself, stay empowered, stay confident and roll with it,’ she said\nShe said society placed pressure on pregnant women to behave or act a certain way.\n‘My biggest advice is to trust yourself, stay empowered, stay confident and roll with it,’ she said.","url":"https://www.dailymail.co.uk/femail/article-3420224/Latin-dancer-Sharon-Pakir-spins-shimmies-way-incredible-dance-routines-NINE-months-pregnant.html"}
