{"authors":[],"date_download":"2018-10-30 20:35:37","date_modify":"2018-10-30 20:35:37","date_publish":"2016-12-29 00:00:00","description":"Shares in Toshiba fell more than 19% in morning trade on Thursday.","filename":"data/vaneerConsumption/SharesinToshibafellforthethirdday.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-toshiba-tumbles-for-third-day-as-second-downgrade-fans-writedown-fears-2016-12_1540931737.html","title":"Shares in Toshiba fell for the third day","title_page":"    Shares in Toshiba fell for the third day - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Pedestrians walk past a logo of Toshiba Corp outside an electronics retailer in Tokyo Thomson Reuters TOKYO (Reuters) - Shares in Toshiba fell more than 19% in morning trade on Thursday, clocking a third day of heavy losses after the Japanese tech-to-nuclear conglomerate said earlier this week it faced a potential multi-billion dollar writedown.\nLate on Wednesday, Moody's became the second rating agency to downgrade the group, pushing it deeper into \"junk\", or non-investment grade territory, with a Caa1 rating, from B3.\n\"Although Toshiba is still assessing the exact amount of the impairment loss, its financial metrics will likely deteriorate further, potentially resulting in a negative equity position,\" said Masako Kuwahara, Moody's Lead Analyst for Toshiba.\nMoody's said the downgrade also reflected \"mounting concerns\" over corporate governance, especially in relation to due diligence for acquisitions.\nToshiba said on Tuesday that cost overruns at a U.S. nuclear business it bought from Chicago Bridge & Iron last year, CB&I Stone & Webster, meant it could face \"several billion dollars\" in charges, acknowledging a bruising overpayment.\nSince Tuesday's first warning, the share drop has wiped about $6.5 billion off Toshiba's market value.\nToshiba shares plunged 20% at the market open on Wednesday, immediately hitting the Tokyo exchange's daily downward limit.\n(Reporting by Ayai Tomisawa; Editing by Sam Holmes)","url":"https://www.businessinsider.com/r-toshiba-tumbles-for-third-day-as-second-downgrade-fans-writedown-fears-2016-12"}
