{"authors":["Amy Lyall For Daily Mail Australia"],"date_download":"2018-10-22 21:01:22","date_modify":"2018-10-22 21:01:22","date_publish":"2016-01-29 05:18:51","description":"Sharni Vinson was one of the many Australian faces that graced the G'Day USA gala on Thursday night.","filename":"data/vaneerConsumption/SharniVinsonwearsVERYrevealingjumpsuitatGDayUSAgala.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AFF26200000578-0-image-a-52_1454046051668.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422156_Sharni-Vinson-flashes-plenty-d-colletage-revealing-jumpsuit-cakes-makeup-attends-G-day-USA-gala_1540242082.html","title":"Sharni Vinson wears VERY revealing jumpsuit at G'Day USA gala","title_page":"Sharni Vinson wears VERY revealing jumpsuit at G'Day USA gala | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sharni Vinson was one of the many Australian faces that graced the G'Day USA gala on Thursday night.\nHeld in Los Angeles, the night is designed for guests to enjoy an Aussie themed night with entertainment, food and wine.\nThe 32-year-old made sure she was the centre of attention as she walked the red carpet, flashing her décolletage in racy all in one jumpsuit complete with a fur stole wrapped around her shoulders.\nScroll down for video\nTaking the plunge: Sharni Vinson flashed her décolletage in an all-in-one jumpsuit as she walked the G'Day USA red carpet in Los Angeles on Thursday\nSharni's khaki coloured jumpsuit featured thick panels that came up from the waist and over her toned shoulders.\nHer slender middle was accentuated by the attire's tight fit, hugging her toned pins.\nThe former Home And Away star accessorised with a sparkly necklace and a large cocktail ring but it was her makeup that also drew some attention.\nThe brunette sported a heavy makeup look, including a dark smokey eye, lashing of mascara, layers of bronzer and a nude lip.\nBold beauty: The brunette sported a heavy makeup look, including a dark smokey eye, lashing of mascara, layers of bronzer and a nude lip\nBehind the scenes: The Australian actress gave her Instagram followers a sneak peek of herself getting ready, sharing an image earlier on in the day\nThe Australian actress gave her Instagram followers a sneak peek of herself getting ready, sharing an image earlier on in the day.\nSharni indulged in a red velvet cupcake as she sat in the makeup chair, with Glen Nutley styling her hair.\nThe celebrity hair stylist expertly weaved the curling tongs around her brunette tresses to give her locks a sultry curl.\nShe was dressed in a casual outfit, consisting of a plaid shirt and what appears to be tracksuit pants.\nSharni first appeared on the iconic soap Home And Away, where she portrayed the character Cassie Turner for four years.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422156/Sharni-Vinson-flashes-plenty-d-colletage-revealing-jumpsuit-cakes-makeup-attends-G-day-USA-gala.html"}
