{"authors":["Sadie Whitelocks For Mailonline"],"date_download":"2018-10-23 01:43:37","date_modify":"2018-10-23 01:43:37","date_publish":"2017-03-16 11:57:39","description":"Most recently Steve Dee from New Jersey, USA, was in the glassy waters of Bimini in the Bahamas diving with hammerhead sharks.","filename":"data/vaneerConsumption/SharkdiverSteveDeesphotosofhiscloseencounters.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53891400000578-0-image-a-31_1489661096429.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4319900_Shark-diver-shares-photos-close-encounters_1540259017.html","title":"Shark diver Steve Dee's photos of his close encounters","title_page":"Shark diver Steve Dee's photos of his close encounters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shark diving isn't your typical kind of holiday.\nBut for Steve Dee, 44, from New Jersey, USA, he spends much of his time off in the water with some of the world's most feared creatures.\nFrom cage diving with Great Whites in Mexico to stroking Hammerheads in the Bahamas, the full-time psychotherapist describes the sharp-toothed creatures as nothing but 'cute water puppies'.\nOpening his underwater photo album to MailOnline Travel, Mr Dee is seen getting up close to a mix of shark-toothed critters.\nSwapping the beach for the deep blue: Steve Dee, who lives in New Jersey, spends his holidays diving with sharks - in the photograph above, one of his friends stands stroking the tail of a giant tiger shark\nGrub's up! A great white bolts past Mr Dee with a tasty chunk of flesh between its razor-sharp teeth\nLooking up: Most recently, the intrepid swimmer was in Bimini in the Bahamas diving with hammerheads\nMy, what big teeth you have! The full-time psychotherapist describes the sharp-toothed creatures as nothing but 'cute water puppies' - above, a 14-foot tiger shark named Emma\nIn one shot he is seen petting the tail of a huge tiger shark while in another image, a great white bolts past him with a tasty chunk of flesh between its teeth.\nMr Dee said that his love affair with the water started as a child, as he had a bicoastal upbringing between New Jersey and California.\nHe then decided to do his diving qualification while on a cruise ship with his wife more than ten years ago.\nSince then beach holidays have been put to one side and diving trips have taken president. Over the past few years Mr Dee has mostly been doing shark dives.\nExplaining his fascination with the mysterious creatures, he says: 'They are amazing animals and I take every opportunity to talk to people about the need to protect them.'\nStarting young: Mr Dee said that his love affair with the water started as a child, as he had a bicoastal upbringing between New Jersey and California\nTiger sharks swim up close to the camera in the hope of some food, the shark species is one of the largest in the world\nDental work: A hammerhead shows off an impressive set of teeth as it glides through the bath-like waters\nMr Dee hopes his photography will help to foster shark conservation efforts.\nMany shark species are threatened by commercial fishing, finning and global warming. The great white is one of the most endangered, and it's thought there are only around 3,500 left in the world's oceans.\nThe intrepid diver also hopes his images, which he shares on social media, will change some of the myths surrounding sharks like 'they are in the water trying to eat people'.\n'Nothing could be further from the truth, in fact we are far more dangerous to them,' Mr Dee adds.\nMost recently he was in the glassy waters of Bimini in the Bahamas diving with hammerheads.\nHe said other places on his wish list include seeing whales sharks in Mexico and seeing South Africa's annual sardine run, which attracts an array of marine wildlife.\nAlong with sharks Mr Dee, who shoots on a Nikon D5100 camera, also enjoys diving in to the deep to visit shipwrecks and caves. Luckily his wife Nicole shares his passion for the deep blue too.\nDesigned for dinnertime: The hammerhead's unique head is used as a weapon when hunting down prey\nOn the move: A hammerhead shark turns away from the camera, showing its gills and and underbelly to Mr Dee\nLookalike: The tiger shark gets its name from the dark stripes down its body which resemble a tiger's stripe pattern\nMesmerised: Mr Dee sits on the sea floor with a group of divers as they watch tiger sharks circle their boat\nDanger, danger: Mr Dee hopes his photography will help to foster shark conservation efforts - many shark species are threatened by commercial fishing, finning and global warming","url":"https://www.dailymail.co.uk/travel/travel_news/article-4319900/Shark-diver-shares-photos-close-encounters.html"}
