{"authors":["Associated Press"],"date_download":"2018-10-23 00:20:44","date_modify":"2018-10-23 00:20:44","date_publish":"2017-04-26 09:45:23","description":"STUTTGART, Germany (AP) - Looking relieved, Maria Sharapova went through her familiar routine of waving to the crowd and blowing kisses after winning her...","filename":"data/vaneerConsumption/Sharapovawins1stmatchonreturnfrom15monthdopingban.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/22/wire-468171-1493242561-222_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446826_Sharapova-returns-tennis-15-month-doping-ban_1540254044.html","title":"Sharapova wins 1st match on return from 15-month doping ban","title_page":"Sharapova wins 1st match on return from 15-month doping ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"STUTTGART, Germany (AP) - Looking relieved, Maria Sharapova went through her familiar routine of waving to the crowd and blowing kisses after winning her first match on her return from a 15-month doping ban on Wednesday.\nThe five-time Grand Slam champion and former No. 1 beat Roberta Vinci 7-5, 6-3 in the opening round of the Porsche Grand Prix.\n\"It was the best feeling in the world,\" Sharapova said about stepping on court again for a professional match. \"I have been waiting for this a long time.\"\nRussia's Maria Sharapova blows a kiss after winning 7-5, 6-3 against Italy's Roberta Vinci at the Porsche Tennis Grand Prix in Stuttgart, Germany, Wednesday, April 26, 2017. It was Sharapova's first match after a 15 months lasting doping ban. (AP Photo/Michael Probst)\nSharapova had earlier been given a lukewarm welcome by the 4,500 spectators, receiving a polite applause and some whistling when she entered the sold-out arena.\nThe Russian had not been afraid of the reception that awaited her, despite the fact that she entered the event on a much-debated wildcard.\n\"It's not something you focus on because you spent so many months training and preparing and getting ready that you have to be in your mind when you're walking out on court,\" she said.\nSharapova was not looking back in anger at her suspension, saying: \"I am not an individual that's angry. I let things go pretty quickly.\"\nSharapova added that she had \"a pretty normal life\" and \"grew as a person\" while being away from the circuit, until getting back to training in January.\n\"I was studying, I was working, I was working on my business, I formed friendships that I did never have the time for to form,\" she said.\nWednesday's match was the Russian's first since losing to Serena Williams in the quarterfinals of the 2016 Australian Open, and her first match on clay in nearly two years.\nAgainst the 36th-ranked Italian, Sharapova had a shaky start, conceding seven of the first eight points and dropping the opening two games within five minutes.\nShe finally took her fifth chance in the third game to break Vinci's serve.\nApart from producing a string of unforced errors, Sharapova also showed flashes of her old self - with several outstanding returns and cross-court winners, mostly followed by her trademark fist pump.\nWhen Vinci held serve to go 5-4 up, the Italian had already won more games than in her two previous matches, both two-set defeats, against Sharapova.\nThe Russian, however, broke again and converted her second set point with a forehand winner to take the opener.\nSharapova took control of the second set after an early break and held off three break points in her following service game.\nShe dropped only two points on serve in the rest of the match and closed out the win on Vinci's serve to go 13-1 for the Stuttgart tournament after winning it three times on four appearances.\n\"It's good for tennis that she has come back,\" Vinci said after the match. \"She played good, she played aggressive, very solid, good service. She deserved to win.\"\nVinci added \"it was tough to stay focused before this match. Of course lots of pressure. If you see Facebook and Instagram, always 'Sharapova-Vinci, Sharapova-Vinci, first match.' It was tough for me to stay focused but I tried to enjoy the moment.\"\nLast year, Sharapova tested positive for the banned substance meldonium. She had her initial two-year ban reduced to 15 months by the Court of Arbitration for Sport, which ruled that the Russian bore \"less than significant fault\" in the case and that she could not \"be considered to be an intentional doper.\"\nSharapova had been taking meldonium for many years, but overlooked an announcement by the World Anti-Doping Agency that it added the drug to its banned list on Jan. 1, 2016.\nAs a result of the suspension, Sharapova lost her ranking. But the three-time winner from 2012-14 was given direct entrance to the main draw of the Stuttgart event. Organizers in Madrid and Rome followed the example and handed her a wild card for their events in May as well.\nSeveral players, including Vinci, have criticized the invitation for a player who has been caught doping.\nSharapova said \"it's not my job\" to think about other people's comments.\n\"Words and quotes and articles is not what matters in life, I have learned that very well over the past year,\" she said. \"Articles, they go away, that is not life. What matters is what happens on the court.\"\nSharapova added that \"I'm not getting a wild card to receive a trophy. I still have to win the matches and that's my job.\"\nEarlier Wednesday, Sharapova completed a one-hour training session on an empty center court. Because her suspension ended only at midnight, she had not been allowed to use official tournament facilities before, forcing her to visit a local tennis club in Stuttgart for training since last weekend.\nSharapova next plays fellow Russian Ekaterina Makarova, who upset the seventh-seeded Agnieszka Radwanska Tuesday.\nIn other first-round play, Kristina Mladenovic beat Australian Open semifinalist Mirjana Lucic-Baroni 6-4, 6-2 to set up a second-round match against the top-seeded defending champion, Angelique Kerber. Sixth-seeded Johanna Konta defeated Naomi Osaka 7-6 (5), 3-6, 6-1, while Carla Suarez-Navarro and Elena Vesnina also advance.\nSimona Halep, who beat Barbora Strycova 6-2, 6-3, and Anett Kontaveit, who rallied to upset the fifth-seeded French Open champion Garbine Muguruza 2-6, 7-6 (1), 6-1, became the first two players to reach the quarterfinals.\nRussia's Maria Sharapova enters the court for her match against Italy's Roberta Vinci at the Porsche Grand Prix in Stuttgart, Germany, Wednesday, April 26, 2017. It is Sharapova's first match after a 15 months lasting doping ban. (AP Photo/Michael Probst)\nRussia's Maria Sharapova enters the court for her match against Italy's Roberta Vinci at the Porsche Grand Prix in Stuttgart, Germany, Wednesday, April 26, 2017. It is Sharapova's first match after a 15 months lasting doping ban. (AP Photo/Michael Probst)\nRussia's Maria Sharapova serves during her match against Italy's Roberta Vinci at the Porsche Grand Prix in Stuttgart, Germany, Wednesday, April 26, 2017. It is Sharapova's first match after a 15 months lasting doping ban. (AP Photo/Michael Probst)\nMaria Scharapowa from Russia returns during a tennis training session at the WTA Porsche Tennis Grand Prix in Stuttgart, Germany, Wednesday 26, 2017. (Bernd Weissbrod/dpa via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4446826/Sharapova-returns-tennis-15-month-doping-ban.html"}
