{"authors":["Kayla Hawkins"],"date_download":"2018-10-30 22:26:52","date_modify":"2018-10-30 22:26:52","date_publish":"2014-08-15 16:51:05","description":"After watching seven days' worth of Shark Week, there's plenty of reasons to be terrified of getting in the water, but you can rest assured that king of the Megasharks, Megalodon, won't stop you from having a good time at the beach this weekend.…","filename":"data/vaneerConsumption/SharkWeekMegalodonsAreExtinctSoDontWorryTheyCantHurtYou.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/afc85e6d-f011-4abe-80cf-3e80aa6dc98f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35868-shark-week-megalodons-are-extinct-so-dont-worry-they-cant-hurt-you_1540938412.html","title":"'Shark Week' Megalodons Are Extinct, So Don't Worry - They Can't Hurt You","title_page":"'Shark Week' Megalodons Are Extinct, So Don't Worry — They Can't Hurt You","title_rss":"NULL","source_domain":"bustle.com","text":"After watching seven days' worth of Shark Week, there's plenty of reasons to be terrified of getting in the water, but you can rest assured that king of the Megasharks, Megalodon, won't stop you from having a good time at the beach this weekend. Though they're featured on many a SyFy movie and Shark Week special, megalodons are actually extinct per National Geographic and all scientists agree, there's no chance one will chomp on your boogie board or wash up on the shore and ruin your clambake.\nThose impressively sized jaws may be over fifty feet wide, but they haven't taken a bite in over two million years. And yet the rumors persist, egged on by the Discovery Channel's week-long mix of shark fact and shark fiction. National Geographic sheds some light in a piece about the megalodon obsession featuring paleontologist Robert Boessenecker:\n\"No credible records of Pleistocene (or Holocene) C. megalodon exist anywhere,” Boessenecker says, “and if we cannot even prove that a giant shark survived past 2-3 million years ago, the case for C. megalodon survival is hopelessly poor.” Much of the ocean has yet to be explored, it’s true, but it’d be really difficult to miss a 50-foot-long, nearshore shark with a taste for whales. The shark is long gone.\nAs we learned from last year's famously questionable Megalodon documentary, and this year's equally questionable followup, no matter how many times \"experts\" say otherwise or overworked graphic designers CGI a great white to ten times its actual size, the Discovery Channel gets a lot of ratings from megalodon coverage, but not a lot of truth. Any implication that they could still be out there is patently false, and probably designed to get you scared of the water so you stay inside and watch more Shark Week (admit it, it worked).\nAnd if you're still feeling jittery, here are a few other basic cable boogeymen you don't have to worry about on the shores of whatever beach, lake, or hotel swimming pool you choose to spend your vacation time:\n1. Mermaids\nThis one was the subject of the fake Animal Planet \"documentary\" that aired in 2012. Unless you saw the souped-up TV version, you might be more disappointed than relieved, but who knows, some people might have Splash-phobia.\n2. Sharktopus\nOccasionally you can cross a horse with a donkey and get a mule, but most cross-species experiments don't net much. A shark and an octopus? Sorry, SyFy, but they are so genetically incompatible there's literally no chance one can take a bite out of you.\n3. Sharknado\nProbably the scariest feature of a shark or a megalodon is their ability to jump. Yes, just like dolphins or whales, sharks are so strong that they can launch themselves out of the water. But since they still have to live in water, not winds of over 100MPH, the Sharknado is still impossible. Again, sorry, SyFy.\n4. Ancient Aliens\nYep, despite airing on the History Channel, this one's a pretty obvious fake. You might think, \"what does that have to do with summer vacation?\" Well, for those who like to travel beyond the beach, there's probably some alleged ancient alien explanation for whatever monument you have on the itinerary.\nAnd if after all that reassurance you're still feeling nervous, maybe stay off the coasts and stick to showers instead of baths for a while. And lighten up — no matter what Shark Week says, something that went extinct two million years ago can't hurt you. Megalodons are a thing of the past.\nImages: Mark Daniels/Discovery Channel; Giphy (4)","url":"https://www.bustle.com/articles/35868-shark-week-megalodons-are-extinct-so-dont-worry-they-cant-hurt-you"}
