{"authors":["Daniel Leberfeld"],"date_download":"2018-10-30 18:20:49","date_modify":"2018-10-30 18:20:49","date_publish":"2015-08-07 07:01:24","description":"Is marijuana addictive? The recent behavior of New York Jets standout defensive end Sheldon Richardson makes you think it very well could be. |","filename":"data/vaneerConsumption/SheldonRichardsonsArrestProvokesQuestionIsMarijuanaAddictive.json","image_url":"https://media.breitbart.com/media/2015/07/Sheldon-Richardson-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_08_07__1540923649.html","title":"Sheldon Richardson's Arrest Provokes Question: Is Marijuana Addictive?","title_page":"Sheldon Richardson's Arrest Provokes Question: Is Marijuana Addictive? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"FLORHAM PARK, New Jersey—Is marijuana addictive? The recent behavior of New York Jets standout defensive end Sheldon Richardson makes you think it very well could be.\nOn July 2, 2015, the NFL suspended Richardson for four games for failing repeated tests for marijuana. Suspensions don’t happen after just one failed test.\nLosing four game checks will cost Richardson approximately $600,000. It will also cost him money in his next contract negotiation. His current deal expires after the 2016 season. Even with so much to lose financially, he clearly couldn’t stop smoking pot.\n“Right now I’m just worried about getting him help,” said Jets coach Todd Bowles this week. “He needs the help. I’m not worried about the football player. Like I said, we can win without him. It would probably be more fun with him, but we are prepared to win without him. The biggest thing is working on getting him better as a person. It’s not, ‘When can he get back on the field?’ It’s, ‘Can he get his life together?’”\nAnd to make matters worse, on July 14, just 12 days after the announcement of his suspension, cops charged him with resisting arrest and traffic violations in O’Fallon, Missouri. He allegedly drove his new Bentley over 140 mph in a road race with another car. The cops claim he attempted to avoid apprehension by continuing to drive at a high rate of speed. Richardson faces an arraignment on August 31.\nAccording to the police report, two other men rode in his car, along with a 12-year-old child, all of whom smelled of marijuana. However, the police found no drugs in the vehicle.\n“There were no drugs found in the car, but anybody who takes a look at the situation knows what’s going on there,” Tim Lohmar, the prosecuting attorney in the case, told the New York Post. “The odor, according to the officer, was such that it was a fresh odor. The weed had just burned. I think you can reasonably assume that had been taking place while they were driving and somewhere between that and the time they were pulled over, whatever was in the car was thrown from the car. We don’t know that, obviously.”\nSo it sounds quite likely that Richardson continued to smoke pot, or at least associate with people who did, even after his league suspension.\n“I’m not a dope fiend,” Richardson said on July 30. Sounds like he might be.\n“NFL players turn to smoking marijuana for a variety of reasons, including as a means to reduce stress and pain,” Dr. Leah Lagos, a sports and clinical psychologist, told Jets Confidential. “In addition, many players have been doing it since they were teenagers. The fact that they have a previous history of using marijuana and still made it to the NFL therefore minimizes the perceived consequences/risks of marijuana use.”\nLagos believes that marijuana can be addictive because of changes it can cause in the brain.\nAccording to the National Institute on Drug Abuse, the estimates are that nine percent of users will become dependent. The number shoots up to 17 percent if the person starts using as a teen and 25-to-50 percent if used daily.\nThe Jets intend on getting Richardson the professional assistance he needs for what seems like an addiction to marijuana—before his career goes to pot.","url":"https://www.breitbart.com/video/2015/08/07/sheldon-richardsons-arrest-provokes-question-is-marijuana-addictive/"}
