{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-23 01:41:06","date_modify":"2018-10-23 01:41:06","date_publish":"2016-01-28 16:08:35","description":"The suspect, surnamed Liu, was caught with a mass of weapons including various grenades, and an imitation gun at his home in the city of Shenyang in north-east China yesterday.","filename":"data/vaneerConsumption/Shenyangmilitaryfanaticcaughtwithover800roundsofammunitionathome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AA9EA700000578-0-image-a-70_1453994344187.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3421011_Lethal-obsession-Military-fanatic-arrested-storing-rocket-propelled-grenades-800-ROUNDS-ammunition-home_1540258866.html","title":"Shenyang military fanatic caught with over 800 rounds of ammunition at home","title_page":"Shenyang military fanatic caught with over 800 rounds of ammunition at home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Man, surnamed Liu, has been detained and the case is under investigation\nBizarrely the suspect had one replica rifle amongst the deadly\nA military enthusiast has been caught with a mini arsenal of weapons and an imitation gun at his home in north-east China.\nPolice seized the man, surnamed Liu, along with more than 800 rounds of various types of grenades, bullets, and artillery shells, in the city of Shenyang yesterday, reports the People’s Daily Online.\nThe deadly items, which also included rocket-propelled grenades, were discovered accidentally when the police were investigating another case involving unlicensed taxis.\nMini arsenal: Police in Shenyang, China, yesterday uncovered a large amount of illegally collected ammunition\nDeadly: Rocket propelled grenades, bullets and artillery shells were found in Mr Liu's home-turned-arsenal\nLocked: Mr Liu (pictured) has been arrested on suspicion of the illegal possession of firearms and ammunition\nThe police were doing a routine check when they visited Mr Liu's home and discovered the mass array of weapons and ammunition.\nMr Liu is a serious ordnance fanatic and reportedly loves to collect various types of military weapons and ammunition.\nBizarrely, amongst all the deadly weapons he had collected over the years, police found a black replica firearm.\nMass array of weapons: Police seized various types of grenades, bullets, artillery shells and an imitation gun\nLethal: Shutterstock grenades were some of the deadly weapons found at Mr Liu's house in north-east China\nRoutine check: More than 800 rounds of ammunition were found while police were investigating taxi offences\nAfter identifying the weapons, police told reporters the ammunition found in Mr Liu’s home was in fact highly destructive.\nAt present, Mr Liu is on suspicion of the illegal possession of firearms and ammunition and is being detained by the Tiexi Public Security Bureau.\nThe case is under further investigation.\nReplica rifle: Bizarrely, the suspect had one fake gun (pictured) amongst the deadly artillery he collected\nDangerous hobby: Police told reporters the ammunition found in Mr Liu’s home was in fact highly destructive","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3421011/Lethal-obsession-Military-fanatic-arrested-storing-rocket-propelled-grenades-800-ROUNDS-ammunition-home.html"}
