{"authors":["John Nolte"],"date_download":"2018-10-30 21:35:35","date_modify":"2018-10-30 21:35:35","date_publish":"2015-12-21 20:37:48","description":"According to Fox News National Correspondent Will Carr, the Clark County sheriff appears to know why 24 year-old Lakeisha Holloway intentionally drove |","filename":"data/vaneerConsumption/SheriffNotComfortableDisclosingReasonLasVegasRampageDriverGaveHim.json","image_url":"https://media.breitbart.com/media/2015/12/Sheriff-Joe-Lombardo-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_21__1540935335.html","title":"Sheriff 'Not Comfortable Disclosing' Reason Las Vegas Rampage Driver Gave Him","title_page":"Sheriff 'Not Comfortable Disclosing' Reason Las Vegas Rampage Driver Gave Him | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to Fox News National Correspondent Will Carr, the Clark County sheriff appears to know why 24 year-old Lakeisha Holloway intentionally drove onto a crowded Las Vegas Boulevard sidewalk to intentionally mow down dozens of pedestrians, but is “not comfortable disclosing what” she told him.\n—\nSheriff: not comfortable disclosing what driver said about why she crashed into so many people on Las Vegas Strip #FoxNews — Will Carr (@WillCarrFNC) December 21, 2015\n—\nOne woman died in the rampage. Dozens were injured, many seriously.\nAt the time of the rampage, per early reports, Holloway’s three year old daughter was in the back seat of the car. She was not hurt. Apparently, the suspect had been homeless for more than a week and living out of her car in and around Las Vegas.\nInitial media reports ruled out terrorism. But… During a press conference Monday afternoon, though, the sheriff said he had not yet ruled out terrorism as a motive.\nAfter the rampage, a witness described Holloway as “stoic:”\nThe crash happened on a busy stretch of Las Vegas Boulevard across from the dancing water fountains of the Bellagio hotel-casino where visitors crowd sidewalks as they head from one casino to another. The Miss Universe pageant was being held nearby at Planet Hollywood. Holloway drove a few blocks to a hotel, parked and asked a valet to call police, saying she had run over some people on the Strip, Lombardo said. She was stoic when she was arrested, he said. Lombardo said police did not have a definitive motive but that they believe she had a falling out with the father of her child before the crash. A drug recognition expert on the scene determined Holloway was under the influence of a “stimulant,” but blood test results were pending.\nOne witness described the speed of the car in the 30 to 40 miles per hour range.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/12/21/sheriff-not-comfortable-disclosing-what-las-vegas-rampage-driver-told-him/"}
