{"authors":[],"date_download":"2018-10-22 23:03:33","date_modify":"2018-10-22 23:03:33","date_publish":"2016-10-01 00:00:00","description":"One of the country's most expensive races for local office is in Arizona's Maricopa County, where Sheriff Joe Arpaio, a noted opponent of illegal immigration, has the toughest challenge of his career.","filename":"data/vaneerConsumption/SheriffJoeArpaiosBidForReElectionIsOneOfthePriciestLocalRacesInTheCountryNPR.json","image_url":"https://media.npr.org/assets/img/2016/10/01/gettyimages-599066856_wide-233a59f0d477af98e974ef17f2165ac89fbe4df1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=496198977_1540249413.html","title":"Sheriff Joe Arpaio's Bid For Re-Election Is One Of the Priciest Local Races In The Country : NPR","title_page":"Sheriff Joe Arpaio's Bid For Re-Election Is One Of the Priciest Local Races In The Country : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nMost races for sheriff are low-profile affairs. Not in Arizona's Maricopa County. That's where Sheriff Joe Arpaio is running for re-election. He's known nationally for his hard-line stance on illegal immigration. He's raised $12 million for his campaign, which is a whole lot of money for a local race of any kind. From member station KJZZ in Phoenix, Jude Joffe-Block has the story.\nUNIDENTIFIED MAN: Please, everybody, stand up. Let Sheriff Joe know how much we all love him.\nJUDE JOFFE-BLOCK, BYLINE: At a Tea Party meeting outside of Phoenix, Joseph Arpaio is a rock star with this crowd of mostly white senior citizens. He's beloved here for leading the state's efforts to crack down on illegal immigration and for stumping alongside Donald Trump. The evening's raffle prize is an autographed pair of the pink boxer shorts the sheriff makes his inmates wear.\nUNIDENTIFIED WOMAN: Two-eight-four-five-nine-seven. There's our winner.\nJOFFE-BLOCK: Sue Stock won the pink underwear and was thrilled.\nSUE STOCK: We're going to frame it and put it in the living room (laughter).\nJOFFE-BLOCK: Arpaio's national fan base of conservatives has allowed him to raise more money for his campaign than Arizona's governor did for his race two years ago. Arpaio's been in office nearly 24 years. Stock and her husband, A.J., are rooting for Arpaio to win a seventh term at the age of 84.\nAJ STOCK: If he was 150 years old, he's going to do more good - he knows how to get the job done. If he was in a wheelchair on oxygen, he's going to do a better job.\nJOFFE-BLOCK: At this particular appearance, Arpaio vowed to keep investigating President Barack Obama's birth certificate. He also mentioned liberal billionaire George Soros is spending money against him.\nJOE ARPAIO: It's not because they love somebody else. They just don't like me.\nJOFFE-BLOCK: A group reportedly backed by Soros sent flyers to voters attacking the sheriff for his legal troubles. Three years ago, a judge found Arpaio's immigration enforcement efforts racially profiled Latinos. The sheriff then ignored the judge's orders. Now federal prosecutors might charge him with criminal contempt of court. The legal case has already cost taxpayers almost $50 million. And for the first time in recent memory, polls show Arpaio in danger of losing.\nARPAIO: One of my problems I've had is I haven't been able to rectify it. I'd love to get to the Latino community and talk to them. It's very difficult. Some of them think I'm the devil and all that. I'm a nice guy if I can get to talk to them. Hey, I'll sway them my way.\nJOFFE-BLOCK: The Latino electorate is growing here, and Trump on the ballot is fueling expectations of a large Latino backlash vote. But some Latino voters say they care more about voting against the sheriff.\nMARIA CASTRO: Good morning, is Blanca home?\nJOFFE-BLOCK: Twenty-two-year-old Maria Castro is going door to door in this heavily Latino neighborhood, urging minority and young voters to turn out against both Arpaio and Trump.\nCASTRO: We've had enough of living in fear, you know? And our people aren't scared anymore.\nJOFFE-BLOCK: Castro is a paid canvasser with a campaign called Bazta Arpaio for the Spanish word that means enough. This work is personal for her. Castro's mother doesn't have legal status. Her mother no longer works because Arpaio used to do raids targeting immigrant workers without papers.\nCASTRO: I'm the main breadwinner in my household, and I'm doing this because I know that's a really real fear. Like, I - my mom's been taken from us before, and I don't want that to happen again.\nJOFFE-BLOCK: Arpaio's opponent is Democrat Paul Penzone. He's a former Phoenix police sergeant who ran against the sheriff four years ago and narrowly lost. He says people here want a sheriff, not a celebrity.\nPAUL PENZONE: It shouldn't be that I go to another place in the country or outside the country and they know who our sheriff is. And it's for all the wrong reasons.\nJOFFE-BLOCK: Penzone is financially outmatched by Arpaio, but he's hoping that after 24 years, Maricopa County is ready for a new sheriff. For NPR News, I'm Jude Joffe-Block in Phoenix.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=496198977"}
