{"authors":[],"date_download":"2018-10-22 23:02:08","date_modify":"2018-10-22 23:02:08","date_publish":"2014-06-11 19:12:22","description":"The ACLU holds the ICE requests are unconstitutional.","filename":"data/vaneerConsumption/SheriffsOfficesWontHonorICEDetaineeHoldRequests.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/502991/1509-stanek-ice-holds_b0ede7f8ea55d263070c68238a82b35d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_sheriffs-offices-wont-honor-ice-detainee-hold-requests-n128746_1540249328.html","title":"Sheriff's Offices Won't Honor ICE Detainee Hold Requests","title_page":"Sheriff's Offices Won't Honor ICE Detainee Hold Requests","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA pair of local law enforcement agencies in the Midwest are sending what appears to be a chilly message to ICE, saying they will no longer automatically detain suspects for federal immigration agents.\nU.S. Immigration and Customs Enforcement, or ICE, has traditionally asked local jails to detain some inmates for up to 48 hours after they are eligible for release so it has a chance to determine whether or not that person is in the country illegally.\nAnd for years, local law enforcement officials have considered those requests mandatory.\nBut recent federal court rulings have chipped away at ICE's sway over local lawmen, stating plainly that federal detention requests are just that — requests, not marching orders from the government.\nSign up for breaking news alerts from NBC News\nThe Hennepin County Sheriff's Office in Minnesota and the Sedgwick County Sheriff's Department in Kansas have both announced they will no longer automatically honor ICE's requests for detainee holds, potentially driving a wedge between their offices and the federal government over a divisive political issue.","url":"https://www.nbcnews.com/news/us-news/sheriffs-offices-wont-honor-ice-detainee-hold-requests-n128746"}
