{"authors":["Aaron Klein"],"date_download":"2018-10-30 18:00:22","date_modify":"2018-10-30 18:00:22","date_publish":"2018-07-12 22:31:06","description":"Speaking in a Breitbart News interview, Joe Arpaio, the former Sheriff of Maricopa County, Arizona, detailed allegedly being duped into an interview with Sacha Baron Cohen, who Arpaio says posed as a famous comedian from Finland.","filename":"data/vaneerConsumption/SheriffJoeSachaBaronCohenDupedMePosingasFinnishComedian.json","image_url":"https://media.breitbart.com/media/2018/07/sacha-baron-cohen-joe-arpaio-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_07_12__1540922422.html","title":"Sheriff Joe: Sacha Baron Cohen Duped Me Posing as 'Finnish Comedian'","title_page":"EXCLUSIVE - Sheriff Joe: Sacha Baron Cohen Duped Me Posing as 'Finnish Comedian'","title_rss":"NULL","source_domain":"breitbart.com","text":"Speaking in a Breitbart News interview, Joe Arpaio, the former Sheriff of Maricopa County, Arizona, detailed allegedly being duped into an interview with Sacha Baron Cohen, who Arpaio says posed as a famous comedian from Finland.\nArpaio, currently running for a U.S. Senate seat in Arizona, said that during the interview he became “very uncomfortable” with some of the words that Cohen’s character allegedly used, including “blowjob,” “hand job” and “golden shower.” He said he was made to believe the interview was being filmed live and that 2 million people were watching.\nArpaio says that just prior to the interview, two alleged producers mentioned that they were also interviewing Sarah Palin and claimed that they “love” President Trump, as did Cohen’s character. In a lengthy Facebook post, Palin revealed that she was interviewed by Cohen, who she alleged disguised himself as a disabled U.S. veteran. Cohen’s Showtime character, going by the name of Billy Wayne Ruddick Jr, Ph.D, replied in character on Twitter, claiming that he “was in the service — not military, but United Parcel, and I only fought for my country once — when I shot a Mexican who came onto my property.”\nArpaio said the entire episode made him so uneasy that he took the unusual step of typing notes documenting the events. “Something told me I had better document this,” he said. “So, I typed those notes real fast.” Arpaio shared his notes with Breitbart News.\nArpaio said the saga began when he was contacted in the Fall of 2017 by two purported producers going by the names of Phil Simon and Corey Fielder. He said they told him that they were associated with a feature being sold to Showtime and that the show selected him as one of the twenty “most popular” people in America. He was told that he would be interviewed by a famous Finnish comedian.\nThe former sheriff noted that at the time of the interview request he was a private citizen and did not have his sheriff’s department staff to vet the interview.\nArpaio said that he arrived in Los Angeles on October 11, 2017, and that the production team brought him to the filming facility. Arpaio said he was surprised that the interview was not being filmed in a normal television studio but instead in a warehouse-like facility. He said that he was going to Los Angeles at the time anyway to support California congressional candidate Omar Navarro, who is running against Rep. Maxine Waters.\nAccording to Arpaio, the production team led him to believe that the host was a Trump supporter. He also noted signing a contract, writing, “I signed some kind of contract before filming, which I have done numerous times, did not read all the info.”\nHe said he thought it was unusual that they didn’t offer to powder his face before the interview.\nArpaio said that when he arrived on set, the production team immediately made the interview seem like it was live even though he says he was never told that it was purportedly a live interview.\nHe said that there was text on a screen claiming that over 2 million people were watching the interview live. “I was surprised it was live,” said Arpaio.\nArpaio does not recall the name that Cohen used besides posing as a famous comedian from Finland.\nHe described Cohen as using props during the interview, included boxes that contained cars. As sheriff, Arpaio famously advocated for stopping the cars of those suspected of being illegal aliens.\nQuestions he was asked involved immigration, guns, Trump playing golf, and running jails in Finland and the U.S., the former sheriff said.\nArpaio recalled Cohen using “highly inappropriate” phraseology that he says made him “very uncomfortable.”\n“He came up with certain words which were hard for me to hear,” Arpaio said, including “blowjob” and “talking about people working for” a “hand job.”\nSo I started getting a little pissed,” he said. Cohen also mentioned “golden shower,” Arpaio stated. Arpaio’s typed notes to document some of those words.\n“I felt uncomfortable with some of the words they were using but I had to live through it. I am not the type of guy who gets up and walks out,” he said. “I never walked out in thousands of interviews. I just take it.”\n“I was kind of shocked,” Arpaio continued. “But I figured this is Finland and this is a famous comedian.”\nAsked how he thinks he will be portrayed, Arpaio replied that “I was very careful in responding to controversial issues. Profiling. Illegal immigration. They were hitting me with all of that.”\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/entertainment/2018/07/12/exclusive-sheriff-joe-sacha-baron-cohen-duped-me-posing-finnish-comedian/"}
