{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:57:03","date_modify":"2018-10-30 19:57:03","date_publish":"2016-05-22 23:41:20","description":"During an NRA Leadership Conference speech, Sheriff David Clarke Jr. said, \"The only person safe in a gun-free zone ... is the criminal.\"","filename":"data/vaneerConsumption/SheriffDavidClarkeTheOnlyPersonSafeinaGunFreeZoneIstheCriminal.json","image_url":"https://media.breitbart.com/media/2015/04/Sheriff-David-Clark-AP-Photo-Mark-Humphrey.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_22__1540929423.html","title":"Sheriff David Clarke: 'The Only Person Safe in a Gun-Free Zone Is the Criminal'","title_page":"Sheriff David Clarke: 'The Only Person Safe in a Gun-Free Zone Is the Criminal' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During his May 20 speech to the NRA Leadership Conference in Louisville, Kentucky, Sheriff David Clarke Jr. said, “The only person safe in a gun free zone … is the criminal.”\nHe made this comment while referencing the horrendous May 12, 2006, sexual attack suffered by Kimberly Corban in her room on a college campus.\nClarke said:\nThis brave woman voluntarily shares the story of her horrific event so that other women do not have to experience what she did. She found out when seconds mattered, the police were not a 911 call away. She also learned that the only person safe in a gun-free zone — like a college campus — is the criminal. She knows that law-abiding people have been disarmed in these gun-free zones by their government.\nHe paused, then looked at the audience and said, “Don’t ever let anyone tell you to outsource your safety to the government.” He added, “Defend yourself in ways [that are] more advantageous to you, then dial 911.”\nClarke said:\nHandle that firearm. Practice and become proficient with it. Know its capabilities and its limitations. Take time to learn the safe handling and storing the weapon. A gun in the hand of law-abiding citizens is not threat to society at large; it is a threat only to the criminal. [And] it is also a threat to an ever-expanding federal government hell-bent on obliterating your right to keep and bear arms.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/05/22/sheriff-david-clarke-gun-free-zone/"}
