{"authors":["Trent Baker"],"date_download":"2018-10-30 21:32:09","date_modify":"2018-10-30 21:32:09","date_publish":"2017-03-25 20:13:54","description":"Friday on ESPN's \"First Take,\" Seattle Seahawks cornerback Richard Sherman weighed in on Colin Kaepernick's situation as a free agent. \"First Take\" | Video","filename":"data/vaneerConsumption/ShermanKaepernickBeingBlackballedCouldStartfor20Teams.json","image_url":"https://media.breitbart.com/media/2017/03/sherman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_03_25__1540935129.html","title":"Sherman: Kaepernick Being 'Blackballed,' Could Start for 20 Teams","title_page":"Sherman: Kaepernick Being 'Blackballed,' Could Start for 20 Teams | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Friday on ESPN’s “First Take,” Seattle Seahawks cornerback Richard Sherman weighed in on Colin Kaepernick’s situation as a free agent.\n“First Take” moderator Molly Qerim asked Sherman if Kaepernick was being blackballed by NFL teams because of his 2016 national anthem protest\n“I’m sure he is,” Sherman replied. “It’s difficult to see because he’s played at such a high level, and you see guys, quarterbacks, who have never played at a high level being signed by teams, so it’s difficult to understand. Obviously, he’s going to be in a backup role at this point. But you see quarterbacks, there was a year Matt Schaub had a pretty rough year and got signed the next year. So it has nothing to do with football. You can see that. They signed guys who have had off years before.”\nAlthough Sherman said Kaepernick would be looking for a backup role at this point of free agency, he later argued the quarterback could start on 20 teams around the league\n“You don’t have 32 starting-level quarterbacks in this league,” Sherman added. “You have about eight elites, and then you have the rest of the league. You have about eight, nine elite quarterbacks. Then you have two or three who have the potential to be elite. And then you have the rest of the teams. So he could play and start on a ton of teams in this league. At his best, he would be a starter on probably 20 of the teams in this league.\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2017/03/25/sherman-kaepernick-being-blackballed-by-nfl-teams-could-start-for-20-teams/"}
