{"authors":[],"date_download":"2018-10-22 21:53:50","date_modify":"2018-10-22 21:53:50","date_publish":"2014-05-08 18:23:16","description":"Jorge Narvaez became a YouTube sensation for his song \"Home\" dedicated to his mother, who faced deportation. After 7 years, they're reunited.","filename":"data/vaneerConsumption/ShesHomeYouTubeStarJorgeNarvaezReunitesWithMom.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/429841/140508-narvaez-reunion-01_3db9c9eec9af33489a0f98b743f0c076.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_shes-home-youtube-star-jorge-narvaez-reunites-mom-n100571_1540245230.html","title":"She's \"Home,\" YouTube Star Jorge Narvaez Reunites With Mom","title_page":"She's \"Home,\" YouTube Star Jorge Narvaez Reunites With Mom","title_rss":"NULL","source_domain":"nbcnews.com","text":"Jorge Narvaez, a San Diego man who became famous for his YouTube performance of \"Home\" and who was featured on NBC’s America’s Got Talent was reunited with his mother after seven years apart. Esther Alvarado, who faced deportation, was released Wednesday night from federal custody in downtown San Diego.\nNarvaez said it was an amazing experience to be reunited with his mother, especially right before Mother’s Day.\n“Me and my daughters and my brother just cried and hugged,” he said.\nOnce they were reunited, they ate at local In-N-Out Burger restaurant. Narvaez said his mother was craving to eat something from this side of the border. Once home, they stayed up all night talking about everything they missed out on in the past 7 years.\nThe story of Narvaez' mother's legal status started many years earlier.\nWhen Narvaez was a year old, he crossed the U.S.-Mexico border illegally with his father, and his mother Esther Alvarado followed a couple of years later, also entering illegally. After several years, Narvaez’s mother had separated from his father and she eventually remarried.\nIn 2007, she decided to become a legal permanent U.S. resident through her new marriage. In order to do so, she had to return to Ciudad Juarez in Mexico and apply there. In Juarez, government officials told her that because she admitted entering the U.S. illegally, she could not return.","url":"https://www.nbcnews.com/news/latino/shes-home-youtube-star-jorge-narvaez-reunites-mom-n100571"}
