{"authors":["Ian Hanchett"],"date_download":"2018-10-30 19:10:33","date_modify":"2018-10-30 19:10:33","date_publish":"2016-02-06 14:20:12","description":"Columnist Mark Shields argued Democratic presidential candidate former Secretary of State Hillary Clinton doesn't have an answer on her ties to Wall |","filename":"data/vaneerConsumption/ShieldsHillaryDoesntHaveAnAnsweronWallStreetTiesPlungedIntoMoneyMakingInsteadofRemainingPristine.json","image_url":"https://media.breitbart.com/media/2016/02/Shields-25-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_06__1540926633.html","title":"Shields: Hillary Doesn't Have An Answer on Wall Street Ties, 'Plunged' Into Money-Making 'Instead of Remaining Pristine'","title_page":"Shields: Hillary Doesn't Have An Answer on Wall Street Ties, 'Plunged' Into Money-Making 'Instead of Remaining Pristine' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Columnist Mark Shields argued Democratic presidential candidate former Secretary of State Hillary Clinton doesn’t have an answer on her ties to Wall Street, and that “Instead of remaining pristine, she plunged into that, money-making, knowing full well that it was going to be raised” on Friday’s “PBS NewsHour.”\nShields said that when it comes to Hillary’s Wall Street connections, “I don’t think she has an answer, Judy, quite honestly. I mean, she showed her independence. She’s defied him or challenged him to show a vote where she had changed her policy, she had changed because of her contributions. But it’s a mystery to people close to Hillary Clinton, to her campaign, strong supporters of her, who was separated in 2000 from the Clinton Foundation, from all that outside fundraising, when she became a United States senator, went to the secretary of state’s job, and all the way through 2013, she was insulated and isolated from some of the mishaps or happenings that were going on at the foundation and allegations. She comes out. Instead of remaining pristine, she plunged into that, money-making, knowing full well that it was going to be raised, if not — and it remains a mystery. And I don’t think she does have an answer. I really don’t.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2016/02/06/shields-hillary-doesnt-have-an-answer-on-wall-street-ties-plunged-into-money-making-instead-of-remaining-pristine/"}
