{"authors":["Wally Hall"],"date_download":"2018-10-30 21:21:53","date_modify":"2018-10-30 21:21:53","date_publish":"2016-11-07 00:00:00","description":"Ed Orgeron and LSU have made a huge mistake in its new policy to not allow media access to the program via players and coaching staff.","filename":"data/vaneerConsumption/Shieldingplayersfrommediaadisservice.json","image_url":"https://media.arkansasonline.com/img/photos/2016/11/07/main-2_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_aug_03_shielding-players-from-media-a-disservi__page=1_1540934513.html","title":"Shielding players from media a disservice","title_page":"Shielding players from media a disservice","title_rss":"NULL","source_domain":"arkansasonline.com","text":"LSU interim head coach Ed Orgeron works the sideline in the second half of an NCAA college football game against Alabama in Baton Rouge, La., Saturday, Nov. 5, 2016. Alabama won 10-0. - Photo by Associated Press\nEd Orgeron and LSU have made a huge mistake in its new policy to not allow media access to the program via players and coaching staff.\nOrgeron will be the voice and face of the program this season.\nNick Saban can do that with his success, but he shouldn't because it instills a sense of distrust between players and anyone outside the tight circle of football.\nEveryone is concerned millennials are losing the ability to communicate anything longer than 140 characters or what they put in a text message.\nSaban, Orgeron and a few others are abetting that shortcoming.\nNo one can ever accuse University of Arkansas, Fayetteville, head Coach Bret Bielema of being paranoid.\nHe and staff members as well as players meet with the media on a regular basis, which gives those players experience in dealing with people, builds their communication skills and creates interest in the program.\nThis is not about a columnist complaining about access. This is about helping players develop all their skills, including public speaking, in college.\nLSU is going to provide coverage via taped interviews, which means the state's flagship university is providing only the news it wants published and aired. The players and Tiger Nation deserve better.\nIn 2002, the Arkansas Democrat-Gazette published an amazing book titled Untold Stories: Black Sports Heroes Before Integration.\nDarren Ivy authored the book, but several other sports department members worked on the saga about where black athletes played college athletics.\nThe more we dug into history, the more amazing the stories became.\nGuys such as Bobby Mitchell, an All-American at Illinois, had such a great NFL career that he was inducted into the Pro Football Hall of Fame and the Arkansas Sports Hall of Fame. He was from Hot Springs.\nThere were dozens of others who hailed from Arkansas, such as Elijah Pitts and Willie Davis, but went out of state to play college football before having outstanding NFL careers. There were even more academic success stories.\nThe book has been out of publication for years, but a chance meeting with Evin Demirel informed that he has written a new book titled African-American Athletes in Arkansas.\nHis book includes the story of Muhammad Ali's 1963 visit to Little Rock and numerous other sagas about the sports history of black athletes in Arkansas.\nIf you are a sports fan, it is a great read. If you are into Arkansas sports history, it is a great read.\nIt can be purchased at heritageofsports.com or by calling (501) 554-5039.\nDemirel is a former award-winning writer for the Democrat-Gazette and has been widely published as a freelance writer.\nBeing plagued by injuries during his last season at LSU didn't hurt Leonard Fournette in the NFL Draft, as he was picked fourth overall by the Jacksonville Jaguars.\nFournette's name always will be held in the same regard as great SEC running backs such as Herschel Walker, Bo Jackson, Darren McFadden and Derrick Henry, to name a few.\nNeedless to say, a healthy Fournette has been impressive in his first days of camp with the Jaguars, but he made a big impact on his new hometown when he took 700 -- yes, 700 -- trophies he had won, got with his nutrition sponsor MET-Rx and had them create a weight set.\nFournette then donated the weight set to Jacksonville Raines High School.\nMoney and fame may change him, but he always came across as very grounded with good intentions.\nSports on 08/03/2017","url":"https://www.arkansasonline.com/news/2017/aug/03/shielding-players-from-media-a-disservi/?page=1"}
