{"authors":[],"date_download":"2018-10-22 22:23:39","date_modify":"2018-10-22 22:23:39","date_publish":"2014-05-10 00:00:00","description":"A growing segment of American workers' schedules are designed by software programs that don't often take employee needs into account.","filename":"data/vaneerConsumption/ShiftChangeJustinTimeSchedulingCreatesChaosforWorkers.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/427646/140507-oneika-jhc-main-1812_ff1ddce6928c8e1a59eb9e9d8fca2854.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_in-plain-sight_shift-change-just-in-time-scheduling-creates-chaos-workers-n95881_1540247019.html","title":"Shift Change: \"Just-in-Time\" Scheduling Creates Chaos for Workers","title_page":"Shift Change: \"Just-in-Time\" Scheduling Creates Chaos for Workers - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"When a day care worker told Journelle Clark that her five-year-old daughter often cried because she missed her mother, Clark realized something was really wrong. The 32-year-old works unpredictable hours arranging window and wall displays at an Ann Taylor LOFT in Manhattan, never knowing what her schedule—or her paycheck—will be. She could get 15 hours one week and 40 the next. Sometimes she works all weekend, sometimes she doesn’t. She’s been called in to work at the last-minute and occasionally gets sent home early from a shift she’s already started.\n“They expect me to be available all the time, 24/7,” Clark says.\nClark is part of a growing segment of the American workforce whose schedules aren’t designed by people but by sophisticated scheduling software programs. It used to be that retail and hospitality workers were scheduled for standard shifts whether business was busy or slow. Now these jobs have become increasingly tied to fluctuations in customer traffic. Using “workforce optimization systems” managers can ensure that stores have exactly the right number of workers, not only by the day, but by the hour.\nThe algorithms, built on data including last year’s sales trends, economic indicators, changes in weather and political pressures, are intended to create a perfectly predictable schedule and then provide real-time information for managers to make adjustments as these variables change.\nThis “just-in-time scheduling” helps employers piece together a jigsaw puzzle of part-time workers. But the needs of the workers themselves—for a stable paycheck and reliable hours around which to arrange child care, a second job, and other family and life commitments—are rarely entered into the calculus, experts say.\nA growing group of scholars, advocates for low-wage workers and now business consultants say it’s time for a shift in the way service and hospitality work is scheduled. And they argue that companies can actually benefit when they use the software to meet both staffing needs and pay attention to employees’ work-life balance.\n“The algorithms spit out a staffing pattern to perfectly fit the expected demand for workers,” says Joan Williams, who directs the Center for WorkLife Law at the University of California, Hastings. “But it turns out algorithms are algorithms, not reality.”\nSince 2007, the number of \"involuntary\" part-time workers has nearly doubled.\nClark, who has a college degree in English and prides herself on her creative instinct, had hoped that her job as a “visual merchandiser” would help her enter the fashion world and provide opportunities to move up. She assumed the job would be full time. But since she started in May of last year, she says, the hours have become increasingly uncertain. Though she makes $14 an hour, more than $3 above the average American retail sales wage, without a full-time schedule, her position doesn’t provide enough to pay rent. She and her daughter have had to move in with her parents in East Harlem, and she relies on them to help get her daughter to daycare.\n“If the job had been what I thought it was, we would be in a different place,” Clark says.\nPart-time work has grown quickly since the recession—much faster than full-time employment. And while these jobs have helped drive down overall unemployment rates below 7 percent, many part-time workers would rather be working full time. Since 2007, the number of \"involuntary\" part-time workers has nearly doubled. In March, there were over 7.4 million involuntary part-time workers, compared to 4.3 million the same time in 2007, according to Bureau of Labor Statistics figures.\n“Twenty-five years ago, working in retail had stable and typically full time schedules,” Williams says. Now, workers’ schedules are more likely to be “part time and extraordinarily unstable.”\nWhen managers made schedules with a pen and paper, schedules tended to be fixed—making 11th hour shift changes was as much of a pain for a manager as it was for their workers. But now management functions have been turned over to software that’s designed to treat workers’ hours as a particularly free variable in a cash flow equation.\n“What we see is that workers are being used as a variable cost and workers have no choice,” says Sasha Hammad, the executive director of the Retail Action Project, a labor organizing group in New York that’s working to change part-time employment laws. “When workers need something to change, they are told that the system can’t change it.”\nA survey of NYC retail workers conducted in 2011 by the Retail Action Project found that 71 percent of workers said their hours fluctuated week to week. And about half of workers said their bosses would change their hours without their consent.\n\"It’s an issue because they can’t predict, they can’t plan their lives, especially those who need two jobs to survive.”\nFor the retail industry, the systems are increasingly a central part of maintaining a round–the-clock workforce. “Retailers are looking at the systems to efficiently manage the hours worked and to right size staffing to the flow of customers during the day,” says Brian Dodge, a spokesperson for the Retail Industry Leaders Association.\nAnn Taylor and LOFT stores have been using workforce management systems since 2007, when the company switched from paper scheduling. “The goal of the program is to ensure that we have the right number of associates in store, at the right times, to provide the best possible experience for our clients and to ensure we are being efficient in our scheduling,” a company spokesperson wrote in an email. “Associates have access to the system to share their availability and time-off requests.”\nClark and another LOFT worker say they can indeed log into the scheduling system to request days off, but that requests are usually ignored, or accepted and then later reversed when demand changes.\nAnn Taylor’s spokesperson said that the company’s system “schedules around [workers’] preferences, providing a level of flexibility that our associates value,” and said the software program has been “generally well-received” across the company.\nDodge added that across the retail industry, employers are sensitive to the needs of their employees and understand that happy workers are productive workers.\nSome managers, for their part, say they’re under enormous pressure to maintain a perfect ratio of worker hours to customer flow and sales. Wary of having to change schedules if customer traffic shifts, they often wait until the last minute to post worker hours.\nOne study that looked at 17 corporate firms, found that only three posted schedules more than a week in advance.\n“Front line managers are squeezed,” says Susan Lambert, a University of Chicago researcher who studies low-wage workers. “The managers are the ones who are held accountable for keeping a ratio for sales or traffic and the number of hours. Sometimes they look at it every half hour, and make adjustments all day long.”\nManagers who want to be more responsive to workers’ needs are sometimes left to fix computer-generated schedules on their own time. One former department store manager, who spoke on the condition that he would not be named, says he would often work late to make adjustments to the computer-generated schedules.\n“I would spend time to make sure that each employee’s schedule worked, because I wanted to be fair,” the former manager said. “If I was not editing the schedule … it’s an issue because they can’t predict, they can’t plan their lives, especially those who need two jobs to survive.”\nAn unstable work schedule forced Onieka O'Kieffe, center, to quit one of her two retail jobs. Ramsay de Give / for NBC News\nOnieka O’Kieffe, 24, a retail worker in New York, recently had to quit one of her two retail jobs because the schedule from the first job was so unstable she could not give the second job enough warning about her availability.\n“I’d rather work one regular job,” O’Kieffe says, “but they don’t give the hours. Since they don’t give you your schedule in time, it’s like you basically live to work for them.”\nO’Kieffe lives in Brooklyn with her mother, 21-year-old sister who also works in retail in Manhattan, and her sister’s baby. They raise the child together, but when O’Kieffe and her sister’s hours change unpredictably, one of them has to miss work. “She had to ensure that her child was going to be with someone,” O’Kieffe says.\nWhile just-in-time scheduling practices are intended to drive up profitability, there are indications that they may be backfiring on companies.\nLisa Disselkamp, a human resources expert and consultant with the firm Deloitte who works with corporate clients to implement workforce management systems, says that “when employers take a purely in the moment, tactical approach to demand for labor activity without regard for any other considerations, they run the risk of increasing overall costs.”\nThose costs can come in the form of lower productivity and increased overhead when unsustainable scheduling results in higher turnover, missed shifts and low-worker morale, scholars say.\nDisselkamp tells her clients that managers should be trained to use the systems to balance worker and employer demands. The algorithms, she explains, can include information about workers’ constraints and preferences.\nSome retailers have started to use the optimization systems to provide workers with clear and unchanging schedules, she said. And in the few retail outlets that are unionized, including Bloomingdale’s New York flagship store, the labor contract includes language that ensures schedule stability.\n“I was looking for some more stability,” Clark said.\nBut so far, that’s not common. Rather than shift back to a model of consistent scheduling, many retail employers are over-hiring, the experts interviewed here say, bringing on far more workers than they need to ensure a ready labor force managers can call when the software says there’s a need. In some cases, retail employees are scheduled for “on-call” shifts, forced to phone in the morning to see if they’ll be needed on the register or sales floor that day. If they fail to call, workers can be penalized.\nWilliams and other scholars argue that there’s nothing about the software itself that’s bad for workers. It’s about the way the programs are used, they say. “The shift to computer-based scheduling could have been a boon to workers, but it has turned out to put a very heavy burden on workers,” Williams said.\nIn January, Clark says, she asked her boss if she could transition into a full-time position, but so far, that hasn’t happened. Her hours continue to fluctuate, making it difficult to plan her life. She hasn’t been to church in months, and has missed accompanying her daughter to events like a gardening day with other kids in their building.\n“I was looking for some more stability,” Clark said. “I guess it’s better to just have me on when they need me.”","url":"https://www.nbcnews.com/feature/in-plain-sight/shift-change-just-in-time-scheduling-creates-chaos-workers-n95881"}
