{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 04:17:47","date_modify":"2018-10-23 04:17:47","date_publish":"2016-01-28 20:09:21","description":"David Beckham is sure to set pulses racing as he shows off his incredibly toned body for a new fragrance campaign.","filename":"data/vaneerConsumption/ShirtlessDavidBeckhamshowsoffhisphysiquefornewfragrancecampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD42F700000578-0-image-a-53_1454013190024.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421623_Shirtless-David-Beckham-shows-incredibly-athletic-physique-new-fragrance-campaign_1540268267.html","title":"Shirtless David Beckham shows off his physique for new fragrance campaign","title_page":"Shirtless David Beckham shows off his physique for new fragrance campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David Beckham is sure to set pulses racing as he shows off his incredibly toned body for a new fragrance campaign.\nThe 40-year-old sportsman smoulders as he stands shirtless, showing off his famous and ever-growing collection of tattoos.\nThe behind-the-scenes images are taken from the photo shoot for his latest fragrance, David Beckham Beyond.\nScroll down for video\nWorking it: David Beckham is sure to set pulses racing as he shows off his incredibly toned body in behind-the-scenes shots for his fragrance campaign, David Beckham Beyond.\nTalking about his latest venture, the husband of Victoria Beckham said: 'Incredible things happen when you dream big\n'That’s what I have always believed in. My relationship with Coty started over 10 years and they believe big like I do.\n'David Beckham Beyond is the next stage in our successful partnership and I look forward to people trying the new contemporary scent.'\nSee the latest David Beckham updates on the photos from his new fragrance campaign\nWell inked: The 40-year-old sportsman smoulders as he stands shirtless, showing off his famous and ever-growing collection of tattoos\nSomething to say: Talking about his latest venture, the husband of Victoria Beckham said: 'Incredible things happen when you dream big'\nThe very sexy fragrance has notes of grapefruit, black pepper and leather. And David told People that dreaming big is a big part of his mantra.\n'Having a dream is something anyone can relate to,' he said.\n'Whether you’re young or old, we all have dreams. I’m no different and I have always carried a lot of passion into what I do, but that means you have to work hard too.\nThat's one to try: The very sexy fragrance has notes of grapefruit, black pepper and leather\nHe said: 'Whether you’re young or old, we all have dreams. I’m no different and I have always carried a lot of passion into what I do, but that means you have to work hard too'\n'If you love what you do and work hard at it then special things can happen.'\nThe images come as the handsome chap also unveiled his latest bodywear designs for H&M - showing off his best blue steel pose in the campaign shots.\nThe former footballer says he wants to 'push the definition of bodywear' with his range of cosy knits and casual white T-shirts.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421623/Shirtless-David-Beckham-shows-incredibly-athletic-physique-new-fragrance-campaign.html"}
