{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 00:18:52","date_modify":"2018-10-23 00:18:52","date_publish":"2016-01-11 09:27:56","description":"The British sports star cut a relaxed figure as he posted a series of shirtless photographs of himself on the beach in mexico to his Instagram on Saturday and Sunday, as he celebrated his 31st birthday.","filename":"data/vaneerConsumption/ShirtlessLewisHamiltonenjoysbirthdaybreakinMexicowithInstagramsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/30067D1800000578-0-image-a-44_1452504302966.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393555_Shirtless-Lewis-Hamilton-showcases-impressive-physique-collection-tattoos-birthday-break-Mexico_1540253932.html","title":"Shirtless Lewis Hamilton enjoys birthday break in Mexico with Instagram snap","title_page":"Shirtless Lewis Hamilton enjoys birthday break in Mexico with Instagram snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was crowned the F1 World Champion for third time in November.\nSo it was little surprise that during his downtime Lewis Hamilton chose to celebrate his 31st birthday with a beach break in Mexico.\nEmbracing the laid-back atmosphere, the British sports star cut a relaxed figure as he posted a series of shirtless photographs of himself on the beach to his Instagram on Saturday and Sunday.\nScroll down for video\nBirthday break: Enjoying his downtime away from Formula One, Lewis Hamilton chose to celebrate his 31st birthday with a beach break in Mexico\nClearly reveling in the bright sunny weather and heat of the Mexican coast, the Mercedes driver stripped down to his shorts for his time on the beach.\nGoing shirtless for his various jaunts on the beach, Lewis - who dated Nicole Scherzinger on and off for seven years - showcased his impressive physique as well as his collection of tattoos.\nIn one photo Lewis can be seen scrambling over rocks with a huge smile on his face, wearing a pair of black shorts, white Calvin Kleins, a jazzy bucket hat and mirrored shades.\nCapturing his playful mood perfectly, the confirmed bachelor appears to be showing off his athletic prowess as he leaps from rock to rock.\nSee the latest Lewis Hamilton updates as he relaxes on holiday in Brazil\nHones and toned in the sun: Embracing the laid-back atmosphere, the sports star cut a relaxed figure as he posted a series of shirtless photographs of himself on the beach to his Instagram on Saturday and Sunday\n'Birthday trip with the best of friends. #Blessed': Clearly reveling in the bright sunny weather and heat of the Mexican coast, the Mercedes driver stripped down to his shorts for his time on the beach.\nHowever, the only thing on Lewis' mind appeared to be enjoying himself with his dearest friends, as he captioned the snap: 'Birthday trip with the best of friends. #Blessed.'\nIn another photo, taken on the same day, the Hertfordshire-born star can be seen striking a brooding pose as he stands by the glittering, lapping waves of the sea.\nBut while fun in the sun and a celebration of his birthday were clearly at the top of his priorities list, Lewis also appeared to be firmly focused on the F1 2016 Championship.\nTaking to the beach for a run on Sunday, he shared a photo of himself deep in the middle of a 'winter workout'.\nBut while he may have squeezed in some time to keep his fitness up with some cardio, Lewis also treated himself to some fun in the surf as he tested out surfing.\nSurfs up! While he may have squeezed in everything from sunbathing to a winter workout, it appears Lewis has also developed a taste for surfing after testing his skill on a board\nA new passion? Gushing about his love for the sport, he wrote: 'Surfing was so much fun, but definitely one of the most challenging sports I've ever tried!!'\nClad in a wetsuit and bandanna in the shallows of the sea, Lewis looked every inch the regular beach bum in two of the snaps.\nAnd while his profession may be driving at top-speeds around the racetracks of the world, he seems to have found a new hobby.\nGushing about his love for the extreme sport, he wrote: 'Surfing was so much fun, but definitely one of the most challenging sports I've ever tried!!\n'If you know anything about me, you know I love a challenge!! #surfsup #amazingworkout #birthdayweekend.'\nAnd while his former flame, Pussycat Dolls star Nicole, 37, has been keen to pack on the PDA with her new boyfriend tennis star Grigor Dimitrov over the last week, Lewis appeared to be completely content with his own life.\nPosting a final snap of himself enjoying the sun on Sunday, the star can be seen relaxing on a lounger and soaking up the rays in front of a glittering ocean vista and palm tree.\nSumming up his joyous mood, he simply captioned the photo: 'Paradise!!!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393555/Shirtless-Lewis-Hamilton-showcases-impressive-physique-collection-tattoos-birthday-break-Mexico.html"}
