{"authors":["Kevin Scholla"],"date_download":"2018-10-30 20:17:18","date_modify":"2018-10-30 20:17:18","date_publish":"2015-07-31 18:56:31","description":"Trump said he'd speak to Sarah Palin, and a media firestorm ensued.","filename":"data/vaneerConsumption/ShockingCoverageOfSarahPalinAfterTrumpComments.json","image_url":"https://media.breitbart.com/media/2015/07/Trump-with-Palin-Craig-RuttleAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_31__1540930638.html","title":"Shocking Coverage Of Sarah Palin After Trump Comments","title_page":"Shocking Coverage Of Sarah Palin After Trump Comments | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump praises Sarah Palin. The world implodes.\nThat’s surely what it felt like after the GOP presidential hopeful spoke to me this past week about the former Alaska governor. It didn’t seem that racy. I simply asked Mr. Trump if he’d consult with Palin if he were elected or perhaps consider her for an official position in the administration. Trump answered in the affirmative and the firestorm ensued.\nAfter Trump’s appearance on The Palin Update with Kevin Scholla on Mama Grizzly Radio, all of the lightweights entered the ring as expected. Salon, Mediaite, Huffington Post and the like resorted to their usual tired tactics. Belittling Governor Palin every chance they get. Dismissing her, yet devoting story after story to her. Seeing the snark come from these circles wan’t too surprising.\nPalin-centric sites also weighed in. Strong Palin outlets like Us4Palin and American Grizzlies United weighed in favorably on Trump’s love for the gov.\nThe biggest surprise however came from the quote, unquote main stream sources. My interview with Trump was picked up by the likes of CNN, FOX, MSNBC, NBC, CBS, Fortune, Time, Washington Times, Washington Post, New York Daily News, and Comcast, to name just some. Even the local paper in Anchorage, Alaska ran a piece on Mr. Trump’s glowing words about Palin. International outlets from England to Australia got into the fray as well. The surprise came not in the coverage of the chat, but in the way it was covered.\nMost of these sources, usually habitual Palin bashers, actually stayed out of the mud. Instead of taking shots at the Mama Grizzly they simply reported the news. They quoted Trump, referenced the show, and in some cases gave some history of the Trump-Palin relationship. Imagine that. Actually reporting a story with no spin and no slant. Talk about kickin’ it old school.\nWhile progressive sites and liberal rags called Palin and Trump names, many of the conventional papers and shows stunningly stuck to the facts. Sarah Palin actually got fair coverage from the majority of media, even if it was only for a couple of days. The woman who has been unfairly targeted and attacked for years was on the front page with a straightforward story that the reader or viewer could make up her own mind about.\nIf nothing else, the aftermath of my conversation with Trump shows all of us that Palin can actually get a fair shake sometimes and that’s all thanks to her. Despite the “disgusting” things said about her (as Trump puts it during our interview) over the years, Palin has never backed down. She kept her head up, her smile wide, and her spirit strong. Now, after years of Palin bashing some have run out of ammo. They’ve done everything they ever could to her. When Palin makes headlines nowadays it’s a challenge for writers and talking heads to come up with anything new to go after her with. The vetting has been done. Every lie that could ever be told about her has been out there. This week, the very “journalists” who can’t stand Palin had to grit their teeth and deliver articles and stories with little or no negativity.\nThis is becoming the norm, sort of. Back in February Palin’s powerful CPAC speech about veterans and PTSD was also met with favor or at the minimum, fairness from a usually unfriendly press. Palin has stuck to her guns. Eventually even some of the blind will see. She’s been right about so much from death panels to Putin. Anyone worth their salt has to admit at least occasionally, no matter how much it pains them that Palin is a legitimate force in the world of politics. No matter what Tina Fey tells us, this is simply fact.\nWhile many covered my dialogue with The Donald factually, we’re not in an alternate universe. There was still plenty of nastiness. Palin and Trump are magnets for that. This week, though, that nonsense was regulated mostly to Cosmopolitan (calling a Trump-Palin ticket a “delectably batsh*t possibility”) and other “entertainment” magazines. Heck even E!, Perez Hilton, and People were mostly fair.\nSo, all in all a simple question to Donald Trump served us well. Trump’s praise of Palin showed us he is not afraid to share a stage with her unlike the Reince Priebuses and Chris Christies of the world. It showed us Governor Palin is as strong and as undaunted as ever. Above all, it showed us that the media, even some of its most unsavory members, when forced to, can report on Sarah Palin without artistic license.\nTrump telling the world he’d love to work with Palin led to the always fun to watch explosion of heads in ultra-liberal land while simultaneously getting a message out to the rest of us who don’t get our news nor form our opinions from Alan Colmes and comrades.\nIt was great week for Trump and a great week for Palin. That means it was a great week for America. And hey, while Bruce Jenner can brag all he wants about his Vanity Fair cover, I was in Cosmo! Eat your heart out, Bruce.","url":"https://www.breitbart.com/politics/2015/07/31/shocking-coverage-of-sarah-palin-after-trump-comments/"}
