{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 03:29:47","date_modify":"2018-10-23 03:29:47","date_publish":"2017-03-16 14:28:01","description":"A teenager (pictured in black) was hit in the head with a baseball bat during a brutal fight that broke out near a Missouri high school. The teens were reportedly fighting over a bet.","filename":"data/vaneerConsumption/Shockingmomentateenishitinheadwithabaseballbat.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54C1C600000578-0-image-a-46_1489674234249.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320380_Shocking-moment-teen-hit-head-baseball-bat_1540265387.html","title":"Shocking moment a teen is hit in head with a baseball bat","title_page":"Shocking moment a teen is hit in head with a baseball bat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Horrifying video has emerged of a teenager bashing a classmate over the head with a baseball bat during a fight near a Missouri high school.\nThe vicious brawl involving a group of boys was recorded on a cell phone outside of Timberland High School on Tuesday.\nThe footage, which shows 25 seconds of the scrap, was then uploaded to social media.\nSchool officials said the fight started after two teens argued over a bet, but it's unclear what the bet entailed.\nA teenager was hit in the head with a baseball bat during a brutal fight that broke out near a Missouri high school. A bystander is heard egging the fight on saying,'beat they a**', as one boy grabs another (left) and holds him while a third boy (right) punches him in the face\nThe boy then body slams the teen, before another teenage (left with a bat) boy runs up from behind and hits the teen over the head with the bat. Seconds later, others jumped on the bat-wielding teen (right) and punched him several times in his face\nA bystander is heard egging the fight on saying,'beat they a**', as one boy grabs another and holds him while a third boy punches him in the face.\nThe boy then body slams the teen, before another teenage boy runs up from behind and hits the teen over the head with the bat.\nSeconds later, others jumped on the bat-wielding teen and punched him several times in his face.\nAdministrators of the Wentzville School District said in a statement that they are taking the video to the police, according to Fox 2.\nParents of students who attend the high school told the station the fight has caused 'tension' between other pupils.\nIn a statement, the school district said the same two students engaged in a fight on school grounds and 'were disciplined accordingly'.\nThe fight was recorded on a mobile device outside of Timberland High School (pictured) on Tuesday. Administrators of the Wentzville School District said in a statement that they are taking the video to the police\n'The video in question appears to be a fight that happened later that evening after school hours and not on school grounds which included those same two individuals with an expanded group of friends.\n'We have no indication that this was a racially motivated incident as our investigation revealed the original altercation was the result of an argument over a bet.\n'The Wentzville School District is committed to providing a safe learning environment for all students and does not tolerate this type of behavior.'","url":"https://www.dailymail.co.uk/news/article-4320380/Shocking-moment-teen-hit-head-baseball-bat.html"}
