{"authors":["Frank Langfitt"],"date_download":"2018-10-22 21:43:14","date_modify":"2018-10-22 21:43:14","date_publish":"2016-11-09 00:00:00","description":"\"It's overwhelming for me to see the huge amount of disenfranchised people who feel the government has failed them,\" said one government worker who watched results roll in at the U.S. Embassy.","filename":"data/vaneerConsumption/ShockedByTrumpWinBritsSeeBrexitParallelsAndCommiserate.json","image_url":"https://media.npr.org/assets/img/2016/11/09/ap_16314062806054_wide-388669eacc0a2002bfb55736f6539494bab6bb4e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_parallels_2016_11_09_501370571_shocked-by-trump-win-brits-see-brexit-parallels-and-commiserate_1540244594.html","title":"Shocked By Trump Win, Brits See Brexit Parallels And Commiserate","title_page":"In Donald Trump Win, British Hear Brexit Echoes : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Shocked By Trump Win, Brits See Brexit Parallels And Commiserate\nEnlarge this image toggle caption Frank Augstein/AP Frank Augstein/AP\nOn Monday in North Carolina, Donald Trump promised to pull off a \"Brexit, Plus, Plus, Plus.\" He was referring to the surprise vote in June by people in the United Kingdom to leave the European Union.\nGiven the polls at the time in the U.S., pollsters in London saw that boast as a stretch — but early Wednesday morning, Trump delivered on that pledge.\nAt the election party Tuesday night at the U.S. Embassy in London, most Britons were shocked by how well Trump was doing. Munching on burgers and shakes from Shake Shack, they watched in disbelief as the electoral map turned increasingly red. For some, the results confounded their notion of America as an open, tolerant society.\n\"It's just blown my mind that an individual such as Trump can have such a following,\" said Jared Reeks, a member of Young Leaders UK, a group of Britons who are fans of the U.S. and focused on sustaining and improving relations between the two countries.\nAs Trump did in North Carolina, Reeks likened Trump's showing to the shock that followed the Brexit vote, when more than 17 million Britons voted to cut ties with the EU, the world's largest collective economy.\n\"It's terrifying,\" Reeks said of the Brexit vote. \"It's kind of like, 'Well, what do we do now?' And we're still trying to figure that mess out, and the reality is: No one has a clue.\"\nAnalysts will chew over the 2016 race for years, but Britons at the embassy party already were offering off-the-cuff analyses. Kate Hawley, who works in forestry with the U.K. government, saw many parallels between the types of people who supported leaving the EU and those who have backed Donald Trump.\n\"It's overwhelming for me to see the huge amount of disenfranchised people who feel the government has failed them,\" said Hawley as CNN prepared to call Ohio for Trump. They feel \"that there is nothing left for them — that any change is good.\"\nHawley likened some rural Trump supporters to people in the northeast of England, communities who felt left behind by globalization and who saw Brexit as a protest vote against the political leaders in London.\nFor Americans, Hawley offered words of comfort, while freely admitting she has struggled at times to follow her own advice.\n\"I really feel that Britain knows that you're going through,\" she said. \"We went through Brexit, and the country was completely divided. Love each other, even though you have differences.\"","url":"https://www.npr.org/sections/parallels/2016/11/09/501370571/shocked-by-trump-win-brits-see-brexit-parallels-and-commiserate"}
