{"authors":["Abc News","More Meghan"],"date_download":"2018-10-30 00:57:36","date_modify":"2018-10-30 00:57:36","date_publish":"2018-10-29 13:33:59","description":"Two people were killed by a shooter at a Kentucky Kroger.","filename":"data/vaneerConsumption/ShootingatKentuckygrocerystoreraisesquestionsabouthatecrime.json","image_url":"https://s.abcnews.com/images/US/gregory-bush-ap-jef-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_shooting-kentucky-grocer_1a3350406d214902a7bcafc5ee350a57_story_id=58830783_1540861056.html","title":"Shooting at Kentucky grocery store raises questions about hate crime","title_page":"Shooting at Kentucky grocery store raises questions about hate crime - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Two recent shootings in the U.S. -- one in Kentucky, one in Pennsylvania -- are both being investigated as possible hate crimes, authorities said.\nThe suspect who fatally shot two people at a Kentucky Kroger grocery store on Oct. 24 reportedly tried to get into a black church before the shooting, raising questions about his intentions.\nSam Rogers, the police chief of Jeffersontown, Kentucky, said the suspect, identified by police as Gregory Bush, 51, was spotted outside the First Baptist Church before the shooting at Kroger.\nBush was seen on the church's security footage, according to the police department. The church was closed when Bush had arrived.\nGoogle Maps Street View\nThe investigation into the shooting is ongoing and the charges against Bush have not yet been announced.\n\"Our hearts break for the families of the those we lost to the tragedy at the Jeffersontown Kroger. The murders are not being taken lightly by the United States government,\" Russell Coleman, the U.S. attorney for the Western District of Kentucky, said in a statement.\n\"Federal investigators are supporting local law enforcement and examining this matter from the perspective of federal criminal law, which includes potential civil rights violations such as hate crimes,\" Coleman said.\nLouisville Metro Department of Corrections/AP\nOn Saturday Oct. 27, a gunman stormed into a Pittsburgh synagogue, killing 11 people.\nSenate Majority Leader Mitch McConnell, who represents Kentucky, referenced the \"horrendous shootings\" at an event Monday in Shelbyville, Tennessee.\n\"If this isn't a hate crime, I don't know what the definition of a hate crime is. Obviously they were,\" McConnell said. \"I don't know what's going on in our country.\"","url":"https://abcnews.go.com/US/shooting-kentucky-grocery-store-raises-questions-hate-crime/story?id=58830783"}
