{"authors":["Associated Press"],"date_download":"2018-10-23 04:27:05","date_modify":"2018-10-23 04:27:05","date_publish":"2016-01-29 20:10:18","description":"ALEXANDRIA, Va. (AP) — Even in the Byzantine world of government contracting, this particular deal stood out: $1.7 million to build 350 untraceable assault-r...","filename":"data/vaneerConsumption/Shortprisontermsfor2linkedtosecretNavysilencerdeal.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422754_Sentencing-pair-cooked-secret-Navy-silencer-deal_1540268825.html","title":"Short prison terms for 2 linked to secret Navy silencer deal","title_page":"Short prison terms for 2 linked to secret Navy silencer deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Short prison terms for 2 linked to secret Navy silencer deal\nALEXANDRIA, Va. (AP) — Even in the Byzantine world of government contracting, this particular deal stood out: $1.7 million to build 350 untraceable assault-rifle silencers for the Navy, awarded on a no-bid basis to a race-car mechanic whose brother happened to be a senior naval official pushing the deal.\nNow two men who helped engineer the deal have been sentenced to prison, albeit for terms far shorter than prosecutors had sought.\nMark Landersman of Temecula, California, the mechanic who received the no-bid contract, was sentenced to 60 days in prison Friday at U.S. District Court in Alexandria. Ex-naval intelligence officer Lee Hall of Sterling, who was convicted of theft of government money for pushing the contract through, received six months.\nHall's boss at the Navy was Landersman's brother, David Landersman. He faces separate charges and hasn't gone to trial.\nProsecutors sought prison terms of four to five years. The defendants asked for no time.\nTrial testimony indicated Landersman was paid $1.7 million for silencers that cost only $10,000 to build. Tests showed that the silencers actually enhanced light and sound when weapons were fired.\nThe two argued that the silencers were needed for a classified project.\nBut the defense was unable to convince U.S. District Judge Leonie Brinkema, who convicted the two in 2014 at a bench trial. Brinkema said that if there were really a need for untraceable silencers, she couldn't understand why the boxes, after they were delivered, sat in an office for months unclaimed.\n\"This is a case with a high-level government official, in a very sensitive position, who allowed almost $2 million of government money to be wasted,\" she said before sentencing Hall.\nProsecutors said the contract was a scheme to enrich Mark Landersman, who had filed for bankruptcy.\n\"To date, it is uncertain what the intended purpose was for these silencers, if there was a purpose,\" prosecutors wrote in their sentencing memo.\nCourt papers say the defendants had told others the silencers were needed for SEAL Team 6, the unit that killed Osama bin Laden. But the SEALs denied that the silencers were for them.\nAt Friday's sentencing, lawyers for Landersman and Hall maintained that the silencers were needed for a legitimate, classified project but said they were barred from discussing it.\n\"There are things that I can't discuss that cut in our favor,\" said John Zwerling, Landersman's attorney.\nAsked how there could still be ambiguity after a lengthy criminal trial, Hall's attorney, Stuart Sears, said, \"You don't know the federal government.\" He declined to comment further.\nHall, a Bronze Star recipient who served in Kosovo, Iraq and Afghanistan, told the judge he \"never intended to harm or embarrass the U.S. Navy in any way. ... I truly believed there was a need\" for the suppressors.\nLandersman told the Associated Press \"I didn't do anything wrong\" and said the truth will come out in appeal.\nEven if the need for the silencers was legitimate, the way they were procured was not, prosecutors said. They said Mark Landersman had no business manufacturing silencers and shouldn't have gotten a no-bid contract. Prosecutors said he charged obscene amounts for what he produced, and the silencers didn't work. Video played at trial showed the metal on the silencers bubbling and the silencer coming loose during testing. Firearms experts said silencers shouldn't be made of aluminum, as Landersman's were.\nThe $1.7 million Landersman was paid for the 349 silencers came out to more than $4,500 each. Firearms dealers said similar silencers are available for $500.\nDefense lawyers said the government tested the silencers improperly and that the project required no serial numbers because of its classified nature, which would be difficult to procure from traditional vendors.","url":"https://www.dailymail.co.uk/wires/ap/article-3422754/Sentencing-pair-cooked-secret-Navy-silencer-deal.html"}
