{"authors":[],"date_download":"2018-10-22 22:59:00","date_modify":"2018-10-22 22:59:00","date_publish":"2014-06-11 15:56:35","description":"The children are sweet, thoughtful ... and convinced that our future is full of thick smog, treeless streets, abject poverty and a deep lack of human interaction.","filename":"data/vaneerConsumption/ShortFilmAsksSiliconValleyWorkersKidsAbouttheFutureofTech.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/502426/140611-children-tech-1206_1157b88b7d3c0d78de29e9bb452a819b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_short-film-asks-silicon-valley-workers-kids-about-future-tech-n128496_1540249140.html","title":"Short Film Asks Silicon Valley Workers' Kids About the Future of Tech","title_page":"Short Film Asks Silicon Valley Workers' Kids About the Future of Tech","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKids of Silicon Valley workers say the darndest things.\nIn a new short documentary, filmmaker Mike Mills interviewed sixteen children of Silicon Valley workers at companies like Apple and Google about how they think technology will affect our society.\nThe children are sweet, thoughtful ... and convinced that our future is full of thick smog, treeless streets, abject poverty and a deep lack of human interaction.\nSign up for top Technology news delivered direct to your inbox.\nBut it's not as depressing as it sounds. The film (which Yahoo Tech reported about on Tuesday and is now available online through the magazine The Believer [password: BELIEVER]), features plenty of adorable moments, even when the kids' outlook is bleak.\n\"My mom works at Apple. And my dad? He, like, started his own company, but I think he doesn’t really want to do it anymore,\" one girl said.\nLater in the 36-minute film, Mills asked the kids several questions about what life will be like decades from now.\n\"I think it's gonna be worse, really,\" a girl replied. \"More pollution. More cities. More smog. More human everything.\"\nSeveral of the kids worried that people of the future will \"lose the ability to communicate with each other, like verbally,\" as one boy put it. \"Like, they’ll always be on their teeny-tiny screens.\"\nThe toughest question for the kids came when Mills asked: If you could keep only one object you own, what would it be?\nMills showed the kids huffing and puffing and stressing about their decisions. In the end, most of them selected a piece of their beloved technology.\nA phone, one said. My Nintendo 3DS, another chimed in. Xbox. TV. Desktop (\"That thing's been with me for years,\" the girl muttered). But one boy selected books, and another said Legos. Two girls chose stuffed animals.\nOne girl, who had previously discussed the dangers of technology, admitted that she'd still go the gadget route when selecting her single object: \"Probably my iPad ... even though that's kind of on the opposite side of my opinion.\"","url":"https://www.nbcnews.com/tech/innovation/short-film-asks-silicon-valley-workers-kids-about-future-tech-n128496"}
