{"authors":[],"date_download":"2018-10-30 19:11:43","date_modify":"2018-10-30 19:11:43","date_publish":"2015-05-17 04:00:00","description":"New evidence in the controversial shooting death of an unarmed black teenager by a white Union City Police officer contradicts the official account and casts doubt on the officer’s justification for pulling his trigger, an investigation by The Atlanta Journal-Constitution and Channel 2 Action News has found.","filename":"data/vaneerConsumption/Shotintheback.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/05/17/Images/photos.medleyphoto.7272030.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_special-reports_shot-the-back__1540926703.html","title":"Shot in the back","title_page":"Police shootings in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"New evidence in the controversial shooting death of an unarmed black teenager by a white Union City Police officer contradicts the official account and casts doubt on the officer’s justification for pulling his trigger, an investigation by The Atlanta Journal-Constitution and Channel 2 Action News has found.\nUnion City Police Officer Luther Lewis shot Ariston Waiters twice in the back at close range while handcuffing the 19-year-old as he lay face down on the ground the night of Dec. 14, 2011. There were no witnesses to the shooting. Lewis claimed the teen went for his gun.\nBut the supervising lieutenant on the scene told reporters that Lewis never mentioned a struggle for his gun and told a different story just after it happened. Officer Chris McElroy said that he first learned about a struggle for Lewis’ gun from Union City Police Chief Chuck Odom, who he said met privately with Lewis at the police station hours later.\nBreaking a three-year silence, McElroy stopped short of accusing Odom and Lewis of fabricating a story to justify the shooting, but he said Lewis told him that he shot the teen because he refused to show his hands, and didn’t mention a struggle for his weapon.\n“I think Mr. Waiters died senselessly and his family deserves some closure,” McElroy told the AJC and Channel 2. “I just don’t think it’s right. It’s not sat right with me from the very first time I arrived on the scene.”\nWaiters’ death sparked protests in the predominantly African American community in South Fulton, but never drew the national attention that has followed the recent cases of police violence in Ferguson, Mo., North Charleston, S.C., and Baltimore. Waiters’ family settled a wrongful death lawsuit on behalf of Waiters’ young daughter for $750,000. And a Fulton County grand jury declined to charge Lewis with any crimes.\nBut new details uncovered by the AJC and Channel 2 raise questions about how officials investigated Waiters’ death, one of more than 100 fatal police shootings in Georgia in the past five years.\nKey witnesses, including McElroy, were never interviewed by the Union City Police Department or the GBI, which was called in to investigate the night of the shooting.\n“I was surprised I didn’t get called by the GBI,” McElroy said.\nUnion City conducted no internal investigation of its own. And Lewis’ defense was built on DNA evidence to link Waiters to the officer’s gun and support his version of a struggle. But DNA experts interviewed by the AJC and Channel 2 cast doubt on the validity of that link.\nA consultant hired by Fulton County District Attorney Paul Howard found Lewis gave shifting official statements about the shooting to the GBI, so much so that he recommended indicting Lewis for false statements, and he found that the forensic evidence did not support Lewis’ version of what happened.\nIn a blistering report, consultant Michael Levine wrote that Lewis “exhibited a disregard for human life that is unacceptable in professional law enforcement.”\nA Fulton County grand jury heard Levine testify to his findings in May 2012, and Howard’s office prepared an eight-count indictment against the officer, including felony murder, false imprisonment and violation of oath of office. Lewis, a former Army recruiter, spoke on his own behalf. Grand jurors declined to indict Lewis, who left the Union City police force voluntarily last year.\nNow, Howard told reporters he’s re-examining the case in light of the new details uncovered by the AJC and Channel 2.\n“There is no statute of limitations with respect to a murder charge or a felony murder charge,” Howard said last week. “I’m going to be seriously reexamining that factor to see if it should be re-presented” to the grand jury.\n“As I said, initially it should have been true billed in the first place. We went through a lot of trouble, paid a lot of money, to get at the truth in this case. I was surprised that the grand jurors did not do it.”\nIt’s unclear what evidence grand jurors heard. Howard said he was surprised by some of the AJC’s findings, and expressed concern that some of the information and witnesses in the district attorney’s case files may not have been presented to them.\n“I suspect that somebody made a mistake if that happened,” he said.\nFreda Waiters, Waiters’ mother, said grand jurors were told extensively about her son’s previous encounters with police and his troubled mental history, but she questioned what they knew about Lewis.\nMonths before he shot Waiters, Lewis reportedly threatened to shoot another black man because he refused to take his hands out of his pocket, McElroy told the AJC and Channel 2. He said that he and fellow officers also had concerns Lewis, an Afghanistan war veteran, might have Post Traumatic Stress Disorder because of erratic behavior on patrol.\nPolice Chief Odom declined to answer questions for this story. His department did not seek, and was not provided, a copy of the consultant’s report outlining numerous violations of police procedures, Union City Assistant Chief Lee Brown told reporters.\nBrown also said he and the chief had no prior concerns about Lewis’ behavior and that they believed his story about a struggle for his gun before he killed Waiters.\n“I didn’t see anything that was a blatant violation of policy or blatantly outside the scope of standard police practice,” Brown said. “Obviously, the citizens of Fulton County sitting on the grand jury didn’t put as much weight into what Mr. Levine said as they did into what Officer Lewis said, and the findings of the GBI investigation.”\n‘I was fixing to shoot him’\nLewis had no prior law enforcement experience, but had spent eight years on active duty with the Army, and later served in the Georgia National Guard. He told his job interviewers with Union City Police that his military service, which included a tour in Iraq, would make him a good cop, according to records in his personnel file, and he was hired in 2007.\nLess than two years later, Lewis was called up for military deployment and served a tour in Afghanistan. He returned to policing in 2010 and was assigned to Union City’s SWAT team and in 2011 to the A.C.E. unit, an aggressive crime fighting team.\nColleagues liked him and were glad to have him on the force. McElroy said he respected Lewis as a man and a father.\nBut colleagues also witnessed behavior that made them question if Lewis was experiencing PTSD or some other effects of his tours of military duty, according to court records and interviews.\nOne officer told Capt. Mike Jones that he saw Lewis shaking when he stopped a car, according to testimony Jones gave Fulton County investigators.\nJones, a former Marine, said he asked Lewis about the shaking.\n“He said, ‘You know, I just got to get back adjusted to’ — and I think I made him — I made a referral to EAP,” Jones said, referring to a departmental employee assistance program.\nIn December 2010, Lewis was patrolling off Royal South Parkway in Union City when he reported an incident that compounded concerns about his fitness for duty, according to interviews and records. It was after 3 a.m. and Lewis described walking along a wood line in search of suspects possibly linked to a carjacking.\nAt one point, Lewis said that he saw a dark figure 20 feet away, according to a police incident report. Lewis saw a muzzle flash and heard gunfire, the report said. He returned fire with four shots as he ran for cover. When officers were deployed to the wooded area, however, they found only casings from Lewis’ gun. They found no shell casings or other evidence to back up Lewis’ claim that he was fired upon.\nThen in 2011, months before Ariston Waiters was killed, Lewis alerted fellow officers that he was pursuing a suspicious person in a Union City neighborhood. McElroy responded as a backup. When he arrived, Lewis and a black teen were struggling over the hood of a car. The teen had his hand in his pocket and Lewis had his firearm drawn, pointed at his back.\nMcElroy said he helped Lewis handcuff the teen, who, it turned out, was unarmed. But McElroy said he was alarmed by what Lewis exclaimed after the situation was under control.\n“I was fixing to shoot him,” Lewis said, according to McElroy.\n‘He went for my gun’\nLewis and his partner, Thomas Ledford, were on early evening patrol Dec. 14, 2011, when they responded to teenagers fighting and reports of gunshots at Hickory Lane Circle, a street of townhomes flanked by woods that was the often the scene of trouble.\nLewis said he saw Waiters flee the area, and followed him to the woods. Lewis carried both a Taser and a Glock 17 handgun. He drew his gun and ordered Waiters to the ground. Waiters complied, Lewis said.\nWhat happened over the next minute became the focus of months of investigation.\nLewis was standing next to Waiters when McElroy arrived. The teen was face down with his hands handcuffed behind his back and gasping for breath every 15 to 30 seconds, “like a goldfish out of water,” as he later recalled. Seeing the teen was critically wounded, McElroy put out an urgent call to speed EMTs to the scene.\nMeanwhile, he asked Lewis what happened.\nLewis said he shot Waiters because he couldn’t get the teen’s hands out from under him and he thought he might have a gun, according to McElroy’s interview with Fulton County investigators two months later.\nAt that point, McElroy told investigators, Lewis reached under Waiters to find out what he was concealing. He pulled out a pill bottle from Waiters’ coat pocket.\nWhen Lewis saw what it was, he threw the pill bottle down on the ground and exclaimed: “‘That’s it?’ That’s what you got shot for? That’s it? That don’t make sense.’”\nLewis said nothing about a struggle for his gun, McElroy told investigators.\nLater that night, McElroy returned to the Union City police station, where Lewis had been sent after the shooting. The first McElroy heard about a struggle for Lewis’ gun came not from Lewis, but from Chief Odom, McElroy said.\n“He was in the back area, in the criminal investigations division, with Chief Odom,” McElroy said. “That’s when Chief Odom came out and described to me what happened, which seemed in direct contrast to what Officer Lewis had told me on the scene.”\nOfficer Ledford, Lewis’ partner, also told different versions of what happened that night. In an initial handwritten statement, taken less than an hour after the shooting, Ledford did not mention any struggle for Lewis’ gun, and he told a GBI agent on the scene that Lewis told him “he had no choice; the subject kept fighting.”\nSix hours later, back at police headquarters, Ledford told the GBI that as he arrived at the scene, Lewis told him that “he didn’t have a choice. He went for my gun.”\nReenacting the shooting\nWell after midnight, two GBI officers interviewed Lewis about what happened. The agents were struggling to understand just exactly how the 170-pound teen had attempted to grab Lewis’ gun while lying on the ground, so they asked Lewis to reenact the scene. One of the agents played Waiters and lay on the floor with his hands behind his back.\nIn a video tape of the reenactment, the 250-pound officer described how he put a knee between Waiters’ shoulders, grabbed his hands and radioed that he had a suspect in custody.\nThen he handcuffed Waiter’s left hand, he said. But when Lewis tried to cuff his right hand, Waiters was able to break free and slide his right hand underneath him, Lewis said. When Lewis couldn’t pull the hand out, he thought Waiters was going for a gun. Lewis said he pulled his Glock 17 handgun from his service holster.\nHis left hand still cuffed behind his back and still on his stomach, Waiters grabbed Lewis’ gun with his right hand and started to twist the gun back toward Lewis, Lewis said.\n“That’s when my soul went white,” Lewis said. “That’s when I knew I was losing my gun and that’s when I knew I was fixing to die by my gun tonight. And I knew I wasn’t going to let that happen, anything I could do to not have that happen.”\nLewis pushed back with all he had and fired off two quick shots into Waiters lower back.\nLewis’ description of what happened, however, was at odds with the forensic evidence later compiled in the case. The two bullets that killed Waiters entered his back at a near 90 degree angle and at close range, according to Levine, Fulton’s expert. Both bullets pierced Waiters liver and one hit his spine.\nFor the bullet trajectory to match Lewis’ version, the officer would have had to pull Waiters’ body toward him at a right angle when he fired his gun, or mounted him while firing at a downward angle, Levine found. Lewis, however, maintained that Waiters was lying on his stomach during the struggle.This led Levine to conclude that the shooting could not have occurred the way Lewis described.\nThe emerging story line about a struggle for Lewis’ gun also troubled McElroy. That was not what Lewis said at the scene. And the shooting seemed eerily similar to the previous incident McElroy witnessed between Lewis and a black suspect months earlier.\n“That’s immediately what came back to mind,” McElroy said.\nMcElroy took his concerns to Capt. Jones.\nJones later told Fulton investigators what McElroy said: “He said, ‘The night of the shooting, when I got there,’ he said, ‘Nobody — Luther didn’t tell me anything about a gun — that kid touching the gun.’”\nMcElroy also told the AJC and Channel 2 that he asked Chief Odom the night of the shooting if he should write a statement about what he saw and did at the scene.\nThe chief said no, McElroy said.\nQuestionable DNA evidence\nFreda Waiters still vividly remembers the moment she got the call that a police officer shot her son.\nShe was preparing dinner at her Douglasville home and stopped to race to Grady Memorial Hospital. When she arrived, a doctor confirmed that Ariston was dead.\n“I just wanted to scream and holler,” Waiters said. “From that point on, I became just numb.”\nBut she was determined to seek justice for her only son. Nicknamed “Astroid,” Ariston had been a challenging boy to raise. He was diagnosed with bi-polar disorder at age 13 and struggled in school, ultimately dropping out of high school. He used drugs and had several encounters with police, including disorderly conduct.\nSix months before his death, he’d become a father to a baby girl, born July 4, 2011. His daughter’s birth seemed to energize him. He said he wanted to go back to school and get his GED, so he could find a job and care for his little girl.\nDistrict Attorney Paul Howard met with Freda Waiters personally and promised a full investigation. At first, she was confident that the officer would be held responsible for her son’s death.\nHoward’s consultant found inconsistencies in Lewis’ statements and numerous violations of police standards, including his initial pursuit of Waiters, his arrest procedures and his decision to aim for the “kill zone” instead of considering a less lethal option.\nLewis’ attorney, however, seized on one piece of evidence from the GBI’s investigation. The GBI examined Lewis’ gun for evidence that Waiters touched it. A first test did not find Waiters’ DNA on the gun. A second test, performed by a private company, did not exclude Waiters’ DNA from DNA found on the gun.\nLewis’ attorney claimed that proved Waiters touched Lewis’ gun.\n“There was DNA on the gun that would have come from the skin cells from Mr. Waiters, which proves he had his hand on the gun,” attorney Al Dixon told Channel 2 in 2012.\nUnion City Assistant Chief Brown also highlighted the DNA evidence when he defended Lewis and the department’s handling of the investigation to reporters this month.\n“Ariston’s DNA was on the gun,” Brown said.\nBut an AJC/Channel 2 analysis of the DNA evidence shows it was far from conclusive. The news organizations asked two independent DNA experts to review the lab reports.\nThe vast majority of DNA detected on the gun belonged to Lewis, they said, and minor traces detected could belong to Waiters. But they are far from conclusive, they said.\n“Mr. Waiters is among perhaps hundreds of thousands of Georgians who cannot be excluded as possible minor contributors of DNA to the gun,” said Greg Hampikian, a prominent national DNA expert and a biologist at Boise State University.\nHampikian said he would not be surprised to find Waiters DNA on the gun even if he did not touch it himself. It could have transferred to the gun by Lewis’s own hand or clothing — or by the close range from which the shots were fired, he said.\n‘I trusted the wrong people’\nThe Fulton County grand jury heard 12 hours of testimony. Lewis sat through the entire proceeding and spoke last in his own defense. Then he went outside for approximately 20 minutes while the grand jurors deliberated, putting it, he said, “in God’s hands.”\n“And District Attorney Paul Howard walked out and looked at me and said, he said, ‘No bill.’ When he did, it was amazing,” Lewis told Channel 2 the day after the grand jury’s decision.\nLewis said he was sorry for pain that the shooting had caused Waiters’ family. But he also sounded a defiant note.\n“Anything I could do for Ms. Waiters I would do, absolutely,” he said. “The one thing I’m not going to do is I’m not gonna lay down and take a rap on a murder that it wasn’t. And I never will.”\nThe grand jury’s decision to not indict Lewis for any crimes was a searing experience for Freda Waiters, who felt her son was being prosecuted in the grand jury room, not the officer who shot and killed him. She put faith in D.A. Howard when, she said, he told her they knew her son was murdered. But her experience testifying in the grand jury room made her question whose side the D.A. was on.\n“I trusted the wrong people,” she said. “When you don’t know the law, not educated with the laws and what’s going on, you’re helpless.”\nThe U.S. Justice Department reviewed and passed on her son’s case after the grand jury’s decision. The family received a civil settlement in a wrongful death lawsuit against the city, but Waiters has continued to press her son’s case.\nShe acquired the case file and poured through thousands of pages of documents contained in the GBI and district attorney investigations. She also hired a private investigator, T.J. Ward, who used to work in the Union City Police Department and still had contacts there. They have appealed to Howard and the U.S. Justice Department to reopen the case.\nMcElroy was demoted from lieutenant to patrolman two months ago, and was placed on administrative leave last month after he failed a fitness test.\nHe said speaking out now about the Waiters case will likely end his 24-year career with the department, but he said it’s the right thing to do.\n“Somebody has got to do something to make this right,” McElroy said. “People need to have faith in the police department again and police officers. Not every police officer is bad.\n“And it hurts my heart doing this for my entire life to see the country and the state that it’s in with all the distrust of the police officers and the police departments in general. Maybe if I take the first step, to show there are good police officers out there and we want to tell the truth and we want to do what’s right.”\nLate last year, after another officer-involved shooting in Union City, McElroy said he was in the roll call room with Chief Odom and another officer when the chief surprised the men with an off-the-cuff remark about the Waiters shooting.\n“Luther Lewis should have been in prison,” the chief said, according to McElroy. “And I took care of it.”","url":"https://www.ajc.com/news/special-reports/shot-the-back/7UrR5zQJhZdxoVHMdag78O/"}
