{"authors":[],"date_download":"2018-10-30 18:41:03","date_modify":"2018-10-30 18:41:03","date_publish":"2016-10-27 17:28:00","description":"To help voters understand the pros and cons of Ga Amendment 1, we collected opinions of people on both sides from the AJC's coverage, with links.","filename":"data/vaneerConsumption/ShouldIvoteforOpportunitySchoolDistrict.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/14/Videos/5170669472001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_213f1a7950169c5d6cca02f2855267e0__1540924863.html","title":"Should I vote for Opportunity School District","title_page":"Election 2016: Should I vote for Opportunity School District","title_rss":"NULL","source_domain":"ajc.com","text":"Amendment 1, the Opportunity School District proposal on Georgia's Nov. 8 ballot, has attracted support and opposition throughout the Georgia primary and general election.\nTo help voters understand the pros and cons, we have collected opinions of people on both sides of the aisle. This page is an overview, taken from the AJC's coverage, with links to the full articles.\n-Compiled by Courtney Martinez, from staff reports\nYES: The arguments in favor of the Opportunity School District\nGov. Nathan Deal’s Opportunity School District referendum is on the ballot this November 8 election. Opponents of the constitutional amendment have filed a lawsuit alleging “misleading” ballot language.\nGov. Nathan Deal, the Opportunity Schools District's strongest advocate, said it's a moral imperative to pass the constitutional amendment that could put failing schools under government control. Deal says local school boards and superintendents have waited too long to take action to help failing students.\n“For example, they have the authority to allow a parent or guardian of a child in a chronically failing school to attend another school that is not failing in their own school district,” Deal said. “Thus far, they have not seen the initiative to do things like that. That would be a simple change they could make.”\n» Interactive: Which failing Georgia schools could be taken over by the state?\nSupporters also argue failing schools have a negative impact on students' chances in the future. High school graduation rates remain lower than expected and more than 70 percent of Georgia inmates don't have a high school diploma.\nDeal said that victims of the state’s worst schools “become the fodder of our prison system\" and spoke in a recent campaign video about the difficulty high school dropouts have contributing to Georgia's economy.\nThe Georgia Board of Education endorsed the Opportunity School District in a Sept. 22 resolution, stating it will “improve the education of Georgia children trapped in failing schools.\"\nSen. Freddie Powell Sims, D-Albany, called the amendment “an opportunity to help those students that have been failing for decades.”\nState Rep. Mike Dudgeon, R-Johns Creek, said the Opportunity School District will motivate local school boards and provide accountability. The former Forsyth County school board member said that the idea that it is a \"power grab for the state\" is \"simply not true.\"\nNO: The arguments against the Opportunity School District\nOpponents of the Opportunity School District say it would give control of local schools to an uncontrollable and unaccountable entity and funnel away state and local funds from struggling schools. School referendum opponents have presented alternative plans.\nAn Atlanta Journal-Constitution poll released last week found likely voters siding nearly 2-1 against Amendment 1.\nAtlanta Mayor Kasim Reed joined the opposition of the Opportunity School District. \"I oppose this proposal because I believe it will inevitably result in the diversion of public funds for public schools to private entities, with inadequate oversight, and without accountability to parents,\" he said.\nMore than 40 school boards across the state have banded together against Amendment 1. Some schools in DeKalb County Schools, Atlanta Public Schools and Fulton County Schools are among those subject to take over, although OSD affects any \"chronically failing\" school.\nDeKalb County Schools Superintendent Steve Green called it predatory politics. \"There are no quick fixes, no short cuts,\" he wrote. \"Turning around schools takes deep, hard, intimate work.\"\nAtlanta Braves legend Hank Aaron and former Atlanta mayor Andrew Young held a press conference with other opponents on Oct. 18. Aaron urged voters to say no to Amendment 1. Young said \"self-esteem is the basis of good education\" and that taking it away from local educators is \"a sin and a shame and we cannot allow it.”\nMany opponents, including the Georgia PTA, have argued the ballot question uses deceptive and misleading language. A class-action lawsuit filed in September says the ballot question is \"so misleading and deceptive that it violates the due process and voting rights of all Georgia voters.”\nFor more supporting and opposing viewpoints on the Opportunity School District, check out AJC columnist Maureen Downey's GetSchooled blog.","url":"https://www.ajc.com/news/state--regional-govt--politics/reasons-vote-the-case-for-and-against-opportunity-school-district/5SynKdmM8szwwBDkgXzBQJ/"}
