{"authors":["Stephanie Wickens"],"date_download":"2018-10-23 01:57:54","date_modify":"2018-10-23 01:57:54","date_publish":"2016-01-28 16:30:01","description":"Celebrities such as Kardashian and Coleen Rooney have famously eating their own placentas. in some form. But is the gruesome process worth it - and is it safe? Here, experts give their view.","filename":"data/vaneerConsumption/ShouldwomeneattheirownplacentasFromrumouredhealthbenefitstohowittastesexpertsrevealthetruthabouttheafterbirthtrend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB68F500000578-0-image-a-13_1453996615926.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3419617_Should-women-eat-placentas-rumoured-health-benefits-tastes-experts-reveal-truth-birth-trend_1540259874.html","title":"Should women eat their own placentas? From rumoured health benefits to how it tastes, experts reveal the truth about the after-birth trend","title_page":"Should women eat their own placentas? From rumoured health benefits to how it tastes, experts reveal the truth about the after-birth trend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celebrities around the world are eating their own placenta after giving birth.\nKim and Kourtney Kardashian claim to have done it - as have Alicia Silverstone and January Jones.\nNow, Coleen Rooney, wife of UK football player Wayne Rooney, has admitted that she is also eating her own placenta in the form of pills she's made from it.\nMrs Rooney's pills came from a Liverpool-based company called Placenta Plus.\nThe company's ‘placenta encapsulation specialist’ converts a mother’s placenta in capsules.\nPlacenta Plus claims it helps ‘mothers recover from birth with the most natural remedy around’.\nThey claim the benefits include ‘a quick healthy milk supply, prevent post-natal depression, and balances hormones’.\nHowever, to have Placenta Plus convert your placenta into capsules can set you back by £200 ($286).\nCelebrities Kim Kardashian (left) and Coleen Rooney (right) famously ate their own placenta after recently giving birth. According to experts, placenta contains protein and can help replace the blood lost at delivery\nLooking forward to starting my capsules @placentaplus1 .... Thank you xx pic.twitter.com/P1I6Rn0IJl — Coleen Rooney (@ColeenRoo) January 25, 2016\nBUT WHAT DO THE EXPERTS SAY?\nHealthista spoke to Dr Gabrielle Downey, consultant gynaecologist at BMI hospital and Sutton Medical Centre Birmingham.\nDr Downey said: ‘Placenta contains protein and iron and in fact, has a super-rich blood supply’.\nIn fact, placenta can help to replace the iron in your blood.\n‘You lose blood at delivery and the placenta acts as a natural replacement of iron,’ said Dr Downey.\nARE THERE DANGERS?\n‘Eating placenta won’t do you any harm, because anything in the placenta has already come from the mother,’ she explained.\nIs there anyone that shouldn’t eat their own placenta, then?\n‘If the mother has a temperature, or fast heart rate, it could be a sign she has an infection in which case eating the placenta wouldn’t be helpful,’ advises Dr Downey.\n‘If you have an infection in the membranes of the placenta it could make the infection worse.’\nIn fact, Dr Downey has had many patients that have eaten their own placentas, often.\n‘When I was working at Queen Charlotte’s hospital in Chelsea, London, we often had patients taking it home in a bag to fry it up and consume it.’\nSO WHAT DOES IT TASTE LIKE?\nShe said: ‘A bit like liver.’\nBut Azmina Govindji, registered dietitian and spokesperson for the British Dietetic Association, wrote in a blog post that there’s no real proof of the benefits – or the dangers.\nMs Govindji wrote: ‘There was nothing in the research that pointed to [eating your own placenta] being good for you – but there was none that confirmed it was harmful either’.\nStill, she does admit placenta contains important nutrients for the mum.\n‘The placenta is rich in protein, vitamin B12 and iron but you can get these nutrients from red meat and liver,’ explained Ms Govindji.\nEating placenta doesn't do a woman any harm - because it has already come from the mother, according to experts. Kourtney Kardashian (pictured) also ate her placenta, which an expert said tastes 'a bit like liver'\nWHAT ARE THE BENEFITS?\nAs for the science, it seems there’s no real proof that eating your own placenta has any benefits.\nA study published in June 2015, in the Archives of Women’s Health analysed the results of 10 previous research papers looking at the benefits of eating your own placenta.\nIt concluded that there’s no evidence showing that it will offer any benefits.\nRoyal College of Midwives director for midwifery, Louise Silverton, commented that because of the lack of evidence regarding the benefits of eating the placenta ‘there may be potential dangers in doing so and it must be the woman’s choice if she chooses to do so.’\nBut when it comes down to it, there's no real proof placenta gives you any additional health benefits. However, Hollywood stars - including January Jones (pictured), who starred on the TV show 'Mad Men' - continue to sing placenta's praises\nBut if you’re going down the fresh route rather than opting for pills like Coleen, be aware that it has a shelf life.\nMs Silverton said: 'Women should be aware that like any foodstuff, placentas can go off, so care will be needed about how they are stored.\n‘If a woman is intending to do this, they should discuss it with their midwife ahead of their birth so arrangements can be made to ensure she gets her placenta.’","url":"https://www.dailymail.co.uk/health/article-3419617/Should-women-eat-placentas-rumoured-health-benefits-tastes-experts-reveal-truth-birth-trend.html"}
