{"authors":[],"date_download":"2018-10-30 00:51:27","date_modify":"2018-10-30 00:51:27","date_publish":"2018-08-29 00:01:35","description":null,"filename":"data/vaneerConsumption/ShouldthePopeResign.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Pope_Francis_in_Prato_92.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860687.html","title":"Should the Pope Resign?","title_page":"Should the Pope Resign?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nMany years ago in the early 1980s I was drawn ever so transiently into the bureaucratic intricacies of the Roman Catholic Church in America. There was a saintly priest at Indiana University, Fr. James Higgins, who was driven from the university’s Newman Center to a parish some 20 miles away from campus. The archbishop of Indianapolis replaced him by two utter lightweights. Their homilies had nothing to do with Catholic doctrine and much to do with their Yoga classes, interpersonal relationships of an odd sort, and, in one instance, the thrill of approaching a cliff and questioning whether to jump or not. I looked over at my young children and decided I would drive 40 miles every Sunday rather than wait for the idiot to jump.\nThe more I looked into the plight of Fr. Higgins the more I discovered the early glimmerings of the full-blown crisis that confronts the Church today. The sex scandal and its decades-long cover-up now confronting the Church is the most serious crisis that the Church has faced since the Protestant eruption of centuries ago. The boys who took over from Fr. Higgins were planted on campus by a corpulent, luxury-loving archbishop, whose interests were worldly rather than spiritual and, incidentally, not very sophisticated. I am not sure where on campus the boys fit in, but they surely did not fit in at the Newman Center and a few years later both had wandered off to find themselves hopefully not on a cliff.\nA couple of years later I encountered the papal nuncio, the Vatican’s ambassador to the United States, at one of President Ronald Reagan’s state dinners and I asked to visit him. At his grand mansion just across the street from where the Vice President now lives I told Pio Laghi of what had now become a minor scandal in Indiana, the exiling of Fr. Higgins and the archbishop’s role in it. The nuncio assured me that he was well informed of it and of a concomitant scandal regarding sexual deviance at a nearby seminary. The fat archbishop’s days were numbered, he said. Well, the archbishop’s days might have been, but the swinging hierarchy has continued to swing. Actually the evidence is that it is swinging out of control, and it is now almost certain that the hierarchy of the Church will have to answer to those who control its purse strings, the laity.\nThe Catholic laity working with orthodox and holy religious are going to have to effect a top-to-bottom clean-up of what increasingly looks like a soiled hierarchy. Any priest or bishop who has participated in sexual deviancy should be given the boot and prosecuted when laws have been broken. Any priest or bishop who has engaged in a cover-up should be removed from the priesthood.\nCardinal Theodore McCarrick of Washington, faced with an avalanche of charges of debauching seminarians, has become the first U. S. cardinal in American history to resign due to molestation. Doubtless there are more who participated in such vile misbehavior and cover-ups. A grand jury report from Pennsylvania earlier this month detailed countless instance of rape and molestation of mainly boys and some girls, but it went beyond those charges. It documented cases of priests sexualizing sacred objects as part of the molestation. One individual mentioned in the report was McCarrick’s successor in Washington, Cardinal Donald Wuerl. His resignation has been on the Pope’s desk for some time. The Pope should now accept it.\nYet there is a problem with the Pope. The Pope himself is under suspicion of having protected known predators. Archbishop Carlo Maria Viganò, himself a papal nuncio, has devastatingly revealed that Francis was aware of McCarrick’s record as a predator and yet facilitated McCarrick’s final act as a globetrotting papal envoy. Viganò’s 11-page letter of revelations also implicates Wuerl in the McCarrick cover-up. Critics of Viganò have argued that there is no support for his charges, but now there has emerged Monsignor Jean-François Lantheaume, the former first counselor at the embassy, and he says Viganò “tells the whole truth. I am a witness.”\nIf he speaks the truth, the pope should be treated like any other prelate who has aided in the cover-up of sexual predators and of the practitioners of sacrilege: he should resign his papacy. A growing number of the laity seems to agree. And the laity is where the churches’ funds come from. It has been a long struggle, and it started for me with a mistreated country priest in Bloomington, Indiana. Father Higgins tried to warn us.","url":"https://spectator.org/should-the-pope-resign/"}
