{"authors":["Chris Cutmore For Mailonline","Joe Strange For Mailonline"],"date_download":"2018-10-22 23:57:22","date_modify":"2018-10-22 23:57:22","date_publish":"2016-01-28 13:18:26","description":"The mistakes John Stones has made that led directly to goals now amounts to eight for the season, with seven of those coming in the last three months alone. How has it come to this and what now?","filename":"data/vaneerConsumption/ShouldEvertonstickbyJohnStonesdrophimorsellhimtoChelsea.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB1FD800000578-0-image-a-2_1453993913971.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420852_John-Stones-making-big-mistakes-big-games-Everton-stick-starlet-drop-sell-Chelsea_1540252642.html","title":"Should Everton stick by John Stones, drop him or sell him to Chelsea?","title_page":"Should Everton stick by John Stones, drop him or sell him to Chelsea? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When John Stones was hauled off in the 78th minute of the Capital One Cup semi-final defeat by Manchester City, the Everton defender slumped on the bench, his face a picture of confusion, frustration and resignation.\nStones had just gifted Sergio Aguero the goal that sent City to Wembley, and he knew it. That costly lapse in concentration, allowing the striker to slip unmarked inside the penalty area and head home, was not, however, an isolated lapse. It was the latest in a growing list of high-profile errors from the 21-year-old hailed as the brightest young defensive talent in the Premier League. And he knows that too.\n'Money can't buy you Stones,' the Everton fans love to sing to Chelsea, taunting the London club's failure to land their £30million-plus target last summer. But even a portion - if not large then certainly loud - of the Goodison Park faithful have rounded on Stones, howling their frustration whenever he attempts an overambitious pass that doesn't come off. Many want him dropped from the side. Witty chant or not, some would even grab those West London roubles right now if offered.\nJohn Stones (middle row, second right) sits dejected on Everton's bench at Manchester City\nThe 21-year-old defender (third right) lost Sergio Aguero (second right) for City's winner on Wednesday\nStones tries to block Raheem Sterling's cross, which set up City's second goal at the Etihad Stadium\nHow has it come to this? Well, for starters he is a key part of the backline for an Everton team lauded for its free-spirited attack yet maligned for its hopeless defending. Everton, so the theory goes, have their best squad in years but are underachieving, and that is down to their defence.\nStones's recent personal form guide also does not make for pretty reading. Before the schoolboy-ish failure to track Aguero's run on Wednesday there was his horrible back-pass against Swansea that led to Tim Howard fouling Andre Ayew for a crucial penalty. And then there was the last-minute penalty he gave away against Stoke, getting caught out of position and sliding in recklessly to try and atone for the error but allowing Marko Arnautovic to seal a 4-3 win.\nThere are other goals Everton have conceded that critics could lay at Stones's feet too: he deflected Ayew's shot beyond Howard last Sunday for what would turn out to be the winning goal; he was one of several Everton defenders caught out by a long ball for Dele Alli's superb strike for Spurs earlier this month; Jermain Defoe picked his pocket to strike for Sunderland at Goodison Park; Odion Ighalo had him hook, line and sinker with a dummy before smashing home for Watford on the opening day of the season.\nIn fact, the mistakes Stones has made that led directly to goals now amounts to eight for the season, with seven of those coming in the last three months alone.\nDespite these lapses, most sane judges still rate Stones as a defender of class and supremely rare composure on the ball, albeit raw. But now, the very attributes that saw him praised as a precocious talent just a few months ago are now being used to cast him as an inexperienced liability.\nTake the very moment that many realised Everton truly had a unique talent on their hands. With all eyes on him following Chelsea's very public pursuit last summer, Stones used the first meeting of the season against his suitors to rub their noses right in it. On the half-hour mark, under severe pressure deep inside his own penalty area, he escaped by performing a Cruyff turn. It was breathtaking, audacious and a piece of skill only the most miserly of observers would not applaud. Or old-school Premier League defenders.\nStones is foiled by Nicolas Otamendi while trying to bring the ball out from the back in his trademark style\nHe was lauded for his Cruyff turn inside his own penalty area against Chelsea earlier this season\nStones repeated the trick against Spurs, as Son Hyeung-min attempted to close him down\nStones felt the need to tell the Goodison Park crowd to calm down after they protested against the trick\nAgainst Spurs earlier this month, however, Stones performed the same trick. This time he was screamed at by his own fans, sick of seeing the shoddy goals their talented team keep gifting the opposition.\nSo, what to do with Stones now he is under such scrutiny?\nJOHN STONES IN THE PREMIER LEAGUE THIS SEASON Appearances 21 Starts 21 Minutes Played 1890 Goals Scored 0 Assists 0 Chances Created (inc assists) 3 Total Passes Made 1097 Pass Accuracy 89.06 Pass Accuracy, Own Half 95.22 Pass Accuracy, Opponent's Half 79.39 Tackles Made 36 Duels 153 Duels Won 102 Clearances 73 Blocks 21 Fouls Made 10 Yellow Cards 3 Red Cards 0\nOne option would be to take him out of the firing line and drop him to the bench until his confidence, so clearly shot against City, returns. Roberto Martinez appeared to pave the way for that option by subbing Stones for the returning Seamus Coleman at the Etihad, with Romiro Funes Mori continuing at centre half.\nNot that Rio Ferdinand would agree with that option. The most gifted English central defender of his generation (and possibly ever) was so angry at this suggestion that he called in to BBC Radio 5 Live's football phone-in, 606, to argue against it.\n'He's the best ball-playing centre-half about at the moment,' said Ferdinand. 'I heard the caller earlier and it's just typical of people in this country – \"oh he's made a mistake, he tries to do too many flash things\". Give the kid a chance to play and to grow and to make mistakes.\n'You've got to make mistakes as a young kid, allow him to do that. Because potentially he could go and play for Barcelona, Real Madrid, the top clubs in this country, and be the captain of England.'\nDavid Moyes, who also knows a thing or two about defending (ironically to the frustration of many unappreciative Everton fans), also said that Stones must be trusted to develop his talent.\n'He's got a natural ability to take the ball which is not something that's coached,' said the Scot, who made Stones his last recruit on Merseyside when he signed from Barnsley for £3million in 2013.\n'There are one or two occasions when part of being a defender is putting your foot through the ball. He did brilliantly to make himself a bit of space to clear the ball and there wasn't a pass on for him.\nChelsea see Stones as a long-term replacement for John Terry (centre) but Everton refuse to sell\nBut Stones's position in the Everton team is now coming under scrutiny after some recent errors\n'That's John... he'll develop and he's made one or two mistakes which have cost him, but obviously he's going to go on and play for England for a long time.'\nJamie Carragher, however, had this to say of the Spurs incident: 'People come back at me and say, \"Oh, typical English mentality, it's about time we had a player who steps out with the ball\". I've had five or six foreign managers and not one of them would want me - or any defender - to be doing Cruyff turns in the six-yard box. Hopefully Roberto Martinez is telling him that.'\nAnd therein lies the key question: what is Martinez telling Stones? The Spaniard will always back his man to play his natural game rather than hoof it into Row Z.\nBut it was not Stones's ball-playing ability that saw Aguero score on Wednesday – it was a basic lack of defensive nous. Whether Stones is backed or dropped now, that is what must be addressed on the training ground, fast.\nAnd if Chelsea buy Stones they'll have to do exactly the same.","url":"https://www.dailymail.co.uk/sport/football/article-3420852/John-Stones-making-big-mistakes-big-games-Everton-stick-starlet-drop-sell-Chelsea.html"}
