{"authors":["Robbie Short","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 22:29:34","date_modify":"2018-10-30 22:29:34","date_publish":"2018-06-25 02:00:47","description":"Scientists and LGBTQ groups want a ban on conversion therapy. First Amendment purists and some religious conservatives argue that curtails personal liberty.","filename":"data/vaneerConsumption/ShouldCalifornialimitservicesforthepractice.json","image_url":"https://calmatters.org/wp-content/uploads/AB-2943_Robbie-Short_109-e1529898321588.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938574.html","title":"Should California limit services for the practice?","title_page":"Conversion therapy: Should California limit services for the practice?","title_rss":"NULL","source_domain":"calmatters.org","text":"Choking up as he began to speak to a panel of fellow lawmakers, Assemblyman Evan Low paused to collect himself. The room had just quieted after a conservative advocate who opposed his bill heckled the committee—and Low—for not hearing his side out, causing a brief shouting match in the otherwise staid hearing room.\n“It was very difficult to present this bill,” Low, a Democrat from Campbell who is gay, said once the ruckus died down. “Because when thinking about childhood and that it would not be okay to be yourself—you heard testimony about suicidal thoughts. I have also had that.”\nThis strikingly personal revelation reflects the emotional debate surrounding Low’s proposal to make California the first state in the country to outlaw the advertising and sale of sexual orientation change services—better known as “conversion therapy.”\nOn one side sit scientists and LGBTQ advocacy groups who say California must protect its citizens from a harmful, prejudice-driven practice. On the other are First Amendment purists and a group of religious conservatives who argue that a ban curtails personal liberty. At stake are questions about free speech, freedom of religion and the state’s duty to protect consumers from fraud.\nThe practice of attempting to change someone’s sexual orientation or gender identity is opposed by leading medical groups such as the American Psychological Association and the Substance Abuse and Mental Health Services Administration, which say it is ineffective and often harmful. It is embraced by some religious and conservative groups, such as the California Family Council and the Pacific Justice Institute, which say the therapy offers an option to people who believe homosexuality and being transgender are immoral.\nConversion therapies can include traditional talk-therapy as well as more extreme—and, medical groups say, damaging—methods. Some who have experienced them report being forced to ingest nausea-inducing drugs and being electroshocked while viewing homoerotic images, activities designed to condition a negative reaction to their homosexual feelings. Such reports led state Sen. Scott Wiener, a San Francisco Democrat and a coauthor of the bill, to describe the therapy as “torture.” Although current techniques tend to be less extreme than those of the past, LGBTQ advocates say that they still perpetuate a view of homosexuality and being transgender as undesirable.\nThis isn’t the first time the Legislature has attempted to limit the practice in California. In 2012, California became the first state in the nation to bar mental health professionals from treating minors with conversion therapy when it passed a law that has since served as a model for similar laws in 12 other states. Low’s bill goes further by extending the law’s protections to include anyone engaged in a financial transaction, regardless of their age. The effect would be to make it harder for people to learn about or access conversion therapy.\nThe goal, he said: “to ensure that we do not allow for Californians to be duped and to be harmed by spending money to try to get a service that has no end result.”\nHis Assembly Bill 2943 was approved by the Assembly and is now working its way through the Senate. Given the liberal makeup of the Legislature, the measure is likely to land on Democratic Gov. Jerry Brown’s desk by the end of summer.\nBrown signed the earlier bill banning conversion therapy for children. It was promptly challenged as unconstitutional by conservative activists, but upheld by the 9th U.S. Circuit Court of Appeals in 2013.\nAlthough different legal mechanisms are involved in that law and Low’s bill, they have triggered a similar debate in the state Capitol.\nOpponents argue that by classifying conversion therapy as a fraudulent practice, Low’s bill infringes upon the rights to free speech and—since many people who pursue conversion therapy do so for religious reasons—the free exercise of religion.\n“It’s one of the more blatantly unconstitutional laws that has come out of California in the last five to 10 years,” said Dean Broyles, the president of a conservative legal defense fund called the National Center for Law and Policy. He has called the debate surrounding Low’s bill a “Bonhoeffer moment” for religious conservatives, referring to the German pastor who stood up to the Nazis.\nLow and his supporters, on the other hand, cite the prevailing scientific consensus discouraging the practice of conversion therapy and argue that potential First Amendment infringements are incidental compared to the state’s duty to protect its citizens. Anthony Samson, a Sacramento attorney and policy adviser on Low’s bill, argues that the proposal is neutral to religion, since it affects all consumer transactions. (Not all religious groups in California oppose the measure. California’s six Episcopal bishops, for instance, support the bill.)\nSince the law affects only consumer transactions, religious groups—and any other organization—would still be able to offer conversion therapy services for free.\nA key provision of Low’s proposal is that it applies only to commercial transactions involving services. After an early draft of the bill provoked backlash for language critics said was overly ambiguous, Low amended it to clarify that it does not affect goods that contain messages about changing sexual orientation or gender identity—including some religious texts, such as the Bible.\nThat change has not quelled opponents, who are mounting a vigorous campaign condemning the bill. Hundreds of them—including more than 30 people who say they have successfully changed from gay to straight with conversion therapy—protested on the Capitol steps this month.\n“I have a message to the California Assembly: My wife, my four-year-old daughter, my one-year-old son, and the baby in my wife’s womb are not fraud,” Jim Domen, founder and president of Church United in Newport Beach, told the protesters. “Assembly Bill 2943 removes my right to choose my sexuality.”\nThis kind of freedom-focused rhetoric is common in this debate—a frequently heard phrase is “the right to choose”—despite scientific consensus that homosexuality can’t be willfully changed.\n“They don’t like the lifestyle. That’s what they’re attacking,” Low said, pointing to a promotional video in which Domen says that homosexuality is “destructive” and “harmful.”\nLow sees the fight over this bill as one step in a larger battle for equality. He overcame his own adolescent thoughts of suicide and conversion after finding acceptance from his family and from other gay people.\n“There is nothing wrong with me,” he said. “There is nothing wrong with members of the LGBT community.”","url":"https://calmatters.org/articles/gay-conversion-therapy-california-bill/"}
