{"authors":[],"date_download":"2018-10-30 00:57:03","date_modify":"2018-10-30 00:57:03","date_publish":"2015-12-11 09:00:00","description":null,"filename":"data/vaneerConsumption/ShouldImmigrantsBearFirstAmendmentAffidavits.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/12/1024px-Assistant_Secretary_Richard_Interacts_With_Syrian_Refugees.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861023.html","title":"Should Immigrants Bear First-Amendment Affidavits?","title_page":"Should Immigrants Bear First-Amendment Affidavits?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Rachel Carson’s book Silent Spring led to a virtual worldwide ban on DDT, beginning with EPA strictures on American use and threats to cut foreign aid to nations continuing with this pesticide. Carson’s science was flawed, and, arguably, our overreaction has led to millions of unnecessary human deaths from malaria in Africa alone. But her case illustrates the power of U.S. “border law” to foster change on a global scale, for it also involved a ban on chemically-tainted food imports. If you want to sell coffee to Starbucks, you’d better forego DDT use in your Latin American (Pike Place Roast), African/Arabian (Kati Kati), or Asian/Pacific (Komodo) groves.\nI think there’s application to the current immigration debates. Whatever “bigotry” or “xenophobia” may be in play regarding Muslim immigration, there’s still an underlying and legitimate concern that a nation can lose its soul if it ignores the ideological orientation of its immigrants.\nThe First Amendment is central to our culture and to the question at hand. Newcomers love it, as do we. Indeed, we rally with them to defend mosque construction, proud that we live in a land which protects the range of faiths so long as they abstain from high, medium, or low crimes and misdemeanors. Go ahead, howl at the moon or sacrifice chickens; publish crazy stuff; tattoo exotic scripture on your forehead; and then run for city council. It’s all kosher under our admirable system.\nBut it’s hard to miss a certain incongruity between Muslim-American rhetoric and pre-immigration behavior in countries of origin. With CAIR in the lead, U.S. Muslims are frequently indignant and appalled, quick to spot micro-aggressions and howl at trigger words or any hint that there may be a problem with their faith community. Some even found offense at President Obama’s remarks on the San Bernardino shootings, in that, while scolding those inclined to stigmatize Islam, he suggested that Muslims identify and root out dangerous folks in their midst. How dare he!\nThe irony is that many of these latter-day John Lelands were formerly at peace with religious oppression in their homelands. Whatever form dhimmitude took in the old country, they could live with it. If churches in Egypt had a harder time than mosques getting a construction permit, no problem. If an evangelical Pakistani had little or no chance to land a teaching position at a Karachi university, even if he maxed out the mandatory, Koran-familiarity test, they could live with that. But once on American soil, they turned into strident Jeffersonians.\nWell, yes, but isn’t it great that they’ve bought into our system of religious liberty? I suppose, if the buying isn’t specious. In America, these Muslims aren’t arresting outspoken infidels or tossing rocks through church windows on Sunday morning. The authorities won’t buy it. But what if they become the majority? Is there any Muslim-majority country on earth where Christians enjoy the same religious liberties as Muslims, even in the “nice” nations such as Jordan, Indonesia, and Dubai? Is there any reason to suppose they’d leave the First Amendment alone if they could muster the power here to change it?\nI’m not saying that the typical Muslim-American is dreaming of the day when he can start pushing the churches around, that he’s biding his time until his fellow believers have the numbers to “set things straight.” But I think it’s reasonable to say that, should the demographic tables turn, even Muslims who’ve absorbed Madisonian tendencies would become supine in the presence of zealots who’d like to erase or adjust our freedoms.\nSo let me suggest a way we might honor and protect religious liberty in our immigration protocols, an approach which could, as well, put even aspiring Christian immigrants in a bind: Require that one seeking residency produce affidavits from members of religious minorities in the home country, affidavits attesting to the applicant’s concern (even to the point of personal risk) for their dignity, liberty, and safety regarding the full expression of their religion or irreligion.\nOn this model, a Baha’i could attest to the graciousness of an Iranian Shia; a Yazidi to the protective advocacy of a Chaldean Orthodox in Northern Iraq; a Copt to the conspicuous friendship of an Egyptian Sunni; a Mexican evangelical to the courageous mutuality of a Catholic friend in Chiapas; an Ulster Catholic to the amiability of his Protestant neighbor; a Nigerian Orishan to the even-handed employment practices of a Yamadi businessman; an atheist to the help of a Lebanese Maronite; a French Jewish student to the extra attention he received from a pluralistic, Parisian school teacher. That sort of thing. In other words, we want to know if you were a First Amendment kind of person before we invite you to join in the polity of a First Amendment nation.\nNot only would this help keep America America in one of its best senses. It would inject greater concern for religious liberty into the nations needing the cure.\nSo you’re asking them to act on convictions they’ve had few if any resources to understand or form? Yes, for, if taken seriously, this law would serve as a powerful schoolteacher to the world. But what if giving aid and comfort to religious “enemies” could endanger good-hearted people? How can we ask them to take stands for religious liberty which could cost them dearly, especially since it costs us so little in America at this point? Well, the affidavits don’t need to trumpet heroism, but they should reflect an intentionality of spirit that goes beyond smiling and giving correct change at the restaurant checkout. They need to know we’re not fooling around on this matter, and that we wouldn’t mind stirring up a generation of pro-liberty agitators in the sending nations.\nOf course, the system invites abuse. Immigrants could identify or produce (by bribe or threat) a handful of “Christians” willing to testify on their behalf. So we’d probably have to vet the vetters. And yes, “sponsors” could face trouble if their names got out back home. But, again, this all goes with getting serious on this issue, which we’re not at present.\nSo, you want to sell your cocoa paste in the U.S.? Okay. Don’t spray your fields with DDT. You want to take your place in the American enterprise? Fine. Give evidence that you had a heart for the freedoms characteristic of the American enterprise before it was convenient, if not self-serving, to do so.\nIn the December 10 Wall Street Journal, Muslim attorney Khurram Dara wrote, “We can’t be champions of our own religious freedom without also championing the rights of all traditions across the globe that wish to peacefully practice…” Indeed. And I think the affidavit system would encourage practice along these lines.","url":"https://spectator.org/64913_should-immigrants-bear-first-amendment-affidavits/"}
