{"authors":[],"date_download":"2018-10-30 14:20:25","date_modify":"2018-10-30 14:20:25","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/Shouldtaxpayersbailoutbluestatesthathaveoverspentandoverpromised.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_should_taxpayers_bail_out_blue_states_that_have_overspent_and_over_promised_comments_1540909225.html","title":"Should taxpayers bail out blue states that have overspent and over-promised?","title_page":"Blog: Should taxpayers bail out blue states that have overspent and over-promised?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Catherine Rampell has an opinion piece in the Washington Post titled \"Blue States are in for a World of Pain.\" She is worried that rich, high-tax states like California and New York are going to suffer if Medicaid is changed to block grants. She said these states already need more revenue because they need to put more in their underfunded pension plans. It is nice that people like Rampell believe that the American people as a whole are somehow responsible for these blue states' mismanagement of their budget. Illinois is an example of a blue state that has overtaxed and overspent for decades. Illinois passed a \"temporary\" 60% income tax increase that was in effect for four years from 2011 to 2014, ostensibly to solve its budget problem. Illinois collected around $30 billion over the four years, and at the end of the period, its overall debt, pension debt, and health care obligations were higher than ever.... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/should_taxpayers_bail_out_blue_states_that_have_overspent_and_over_promised_comments.html"}
x.\" It is a payroll tax on employers. What an opportunity it is to give politicians more money. Almost all taxes that are proposed are regressive taxes, and we know from surveys that 60% of Americans cannot even come up with $1,000 for an emergency, so whatever additional taxes come out of these people's pockets essentially reduces other spending. President Obama has raised taxes the last eight years, interest rates have punished savers, the public debt has gone up $10 trillion and we have had the slowest recovery in seventy years. The people around Washington, D.C., who produce nothing but bureaucracy, have done very well, while most of the rest of the nation has been stagnant at best, and Rampell and others are worried about a president who wants to change things around and reduce spending. Isn’t it interesting that the budget deficit dropped under Bush from FY 2004 through FY 2007 after he cut taxes, and it was rising prior to him cutting taxes? Ronald Reagan had a couple of quotes that describe Rampell's, most of the media's, and Democrats' views very well. \"Government is like a baby. An alimentary canal with a big appetite at one end and no sense of responsibility at the other.\" \"Government's view of the economy could be summed up in a few short phrases: If it moves, tax it. If it keeps moving, regulate it. And if it stops moving, subsidize it.\"","url":"https://www.americanthinker.com/blog/2017/01/should_taxpayers_bail_out_blue_states_that_have_overspent_and_over_promised.html"}
