{"authors":[],"date_download":"2018-10-30 14:31:12","date_modify":"2018-10-30 14:31:12","date_publish":"2015-07-10 00:00:00","description":null,"filename":"data/vaneerConsumption/Shouldemployersbeforcedtohiretransvestites.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_should_employers_be_forced_to_hire_transvestites_1540909872.html","title":"Should employers be forced to hire transvestites?","title_page":"Should employers be forced to hire transvestites?","title_rss":"NULL","source_domain":"americanthinker.com","text":"In 2012, the Equal Employment Opportunity Commission began taking the position that discrimination against transgender employees was a form of sex discrimination under the Civil Rights Act of 1964.\nThe New York Times had an editorial featuring a sob story of a transvestite who had trouble finding a job, even in the far-left warrens of New York City. Elaine Mendus, a 6-foot-3-inch-tall man pretending to be a woman, came to New York and couldn't find a job. (Note: the article incorrectly refers to him as \"she\" and \"her\" – I'm sure some copywriter will be \"pink\"-slipped for that one, ha ha!)\nMakes sense. Martin Luther King, Jr. was marching in Selma so guys with hairy legs could work in short shorts in Hooters. His \"I Have a Dream\" speech was in reference to the dream of having a lady give him a massage only to find out that his the lady was really a guy.\nApplying for a bartender position, she was brusquely told, “We don’t hire guys.”\nIf the bar didn't hire guys, why should Elaine, who is a guy, be surprised?\nAt a Duane Reade drugstore she used her birth name on an application, even though it did not correspond with the identification form she had on hand. “The guy looked at me like I had three heads,” she said.\nThe guy probably looked at her like she had three heads because (a) he saw a 6-foot-3-inch guy dressed up as a girl and (b) he saw a job applicant who was obviously lying about his identity, which employers don't usually look favorably upon.\nShe got the same answer everywhere: Sorry, and good luck. In November, Ms. Mendus went to a city-run employment center in Harlem to get coaching. A counselor told her she should show up at job interviews dressed as a man, using a male name. She could try to transition once she proved herself on the job, he suggested.\nWonderful. Pretend to be normal, then change, then \"sue\" when the employer won't let you work in costume. Corporal Klinger would be a millionaire.\nShe began pounding the pavement, a stack of résumés in hand, willing to do virtually anything. “One of the few areas where transgender people are in demand is sex work,” said Carl Siciliano, the executive director of... a network of shelters for gay, lesbian and transgender youths. “You have the law of supply and demand. Here are all these trans people struggling to get an economic foothold and here’s where the demand is.\nWhy is there a high demand for transvestite prostitutes? Do they have a higher sex drive than normal people? Is a mania for sex part of the whole mental illness syndrome?\nIn April, she got a job at a vegan restaurant on the Upper West Side, and since then, she has managed to save $500 a month.\nA fake woman serving fake hamburgers. Perfect symmetry!\nRecently, she took and passed the test to be considered for a slot in the New York Police Department academy. She’s hoping to become one of the 1,300 officers the city is adding to the force. Eventually, she would like to be able to investigate sex crimes.\nOh, please, no. Can you imagine him stopping men on spurious pretexts and giving them pat-downs? How sick has society come when the police not only recruit, but give preference to people with mental illness?\nThere is no constitutional right to be liked, or hired for a job, based on how you dress and carry yourself. This is not discrimination based on race. This is not discrimination based on religion, or even gender. Appearance matters in many jobs, especially service jobs, and if a person dresses like something fresh out of Dr. Frankenstein's laboratory, he shouldn't expect society to embrace him.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/should_employers_be_forced_to_hire_transvestites.html"}
