{"authors":["Matt Levin","Laurel Rosenhall","California Dream Project","Dan Morain"],"date_download":"2018-10-30 22:49:11","date_modify":"2018-10-30 22:49:11","date_publish":"2018-08-10 19:49:35","description":"Would it be a merciful end to the \"moving penalty\" or a giveaway to rich homeowners and real estate agents? Proposition 5, which California voters will decide on this November, would allow homeowners age 55 and up to receive a major break on their property taxes when they move homes.","filename":"data/vaneerConsumption/ShouldBabyBoomersgetapropertytaxbreaktomoveTheprosandconsofProp5.json","image_url":"https://calmatters.org/wp-content/uploads/AdobeStock_54120953-e1534011861683.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939751.html","title":"Should Baby Boomers get a property tax break to move? The pros and cons of Prop. 5.","title_page":"Should Baby Boomers get a property tax break to move? The pros and cons of Prop. 5. | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Please subscribe to us on Apple Podcasts, Stitcher, Soundcloud, Google Play and Overcast.\nWould it be a merciful end to the “moving penalty” or a giveaway to rich homeowners and real estate agents?\nProposition 5, which California voters will decide on this November, allows homeowners age 55 and up to receive a major break on their property taxes when they move homes. Sponsored by the California Association of Realtors, the initiative attempts to address a problem familiar to many Californians of a certain age: You want to move from your empty nest, but you’re scared of the new taxes you’d have to pay on a downsized property.\nThat dilemma is a byproduct of Proposition 13, the landmark 1978 initiative that capped how much local governments can levy homeowners on escalating home values. If you bought your home in 1988, you’re still paying property taxes based of the value of your home when the Soviet Union was still in existence. It’s a pretty great deal. But try to move into a different—and invariably more expensive—home at today’s prices, and your property taxes will jump dramatically. Those property tax bills could be tough for older homeowners on fixed incomes to afford.\n“These are largely larger family homes,” said Steve White, president of the Realtors association. “If these folks were able to sell, then folks in (younger) generations would be able to purchase.”\nThe Realtors argue that Prop. 5 will induce more senior homeowners to sell their homes and buy new ones. Obviously that’s good for their commissions. But beyond allowing older homeowners to perhaps move closer to their children, the Realtors argue it would bring a flood of new homes to the market perfect for younger households starting their families.\nProp. 5 is opposed by local governments and public employee unions such as teachers and firefighters, who say the initiative is a costly giveaway to wealthy homeowners and the real estate industry. There are plenty of property tax protections already in place for senior homeowners who truly want to downsize. Because of a similar proposition passed decades ago, homeowners age 55 and up can buy a new home of equal or lesser value to their current property anywhere in their own county and retain their Prop. 13 property tax savings. Prop. 5 would allow senior homeowners to buy more expensive homes anywhere in California and still get a large tax break.\n“What the real estate industry is really trying to do with this measure is turn the market and drive up prices so their end profit is really to their benefit,” said Dorothy Johnson, an advocate for the California State Association of Counties, which oppose the measure.\nThe Realtors could not have been pleased with the analysis Prop. 5 received from the Legislative Analyst’s Office, which voters will see included in their sample ballots this fall. It concludes that Prop. 5 would eventually costs local governments and schools $2 billion a year in revenue, and that the vast majority of Baby Boomers who would benefit from the initiative were likely going to move anyway. In other words, the initiative was not likely to induce a lot of people to move or result in lower home prices.\nThat’s partly why the Realtors have pursued a somewhat odd political strategy—while pushing for Prop. 5’s passage this fall, they’re already planning to put a very similar initiative on the ballot in 2020. That initiative would provide the same property tax breaks for older homeowners, but would also close some Prop. 13 loopholes to lessen the cost on local governments.\nIn this episode of Gimme Shelter, Matt and Liam delve into the politics and policy of Prop 5. They interview Steve White, president of California Association of Realtors, and Dorothy Johnson, an advocate for the California State Association of Counties.","url":"https://calmatters.org/articles/should-baby-boomers-get-a-property-tax-break-to-move-the-pros-and-cons-of-prop-5/"}
