{"authors":[],"date_download":"2018-10-30 20:01:38","date_modify":"2018-10-30 20:01:38","date_publish":"2017-04-30 18:23:02","description":"House hunters in Dekalb County have an array of options available. However, before getting started they might be wondering, \"should I buy a new or...","filename":"data/vaneerConsumption/ShouldyoubuyaneworusedhouseinDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/30/Images/dekalbresale-U15807414756UzK-680x383.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/classifieds_homes_the-pros-_aed77b2e4cb0c968fa8355a33dcc45ff__1540929698.html","title":"Should you buy a new or used house in DeKalb?","title_page":"Should you buy a new or used house in DeKalb?","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County is a hotbed for highly sought-after midcentury modern ranch houses, according to Paige Stills, Realtor with PalmerHouse Properties. For buyers interested in a new home and willing to brave the rising prices, the search is even more difficult. \"We're running out of places to build close in,\" Stills said.\nHomebuyers interested in DeKalb should weigh these considerations before buying.\n﻿>> Tiny houses in Atlanta face tough restrictions\nNew Construction\nPros:\nMost new homes offer energy-efficient kitchen appliances.\nNew homes include money-saving construction features like HVAC systems, double-pane windows, better insulation and energy efficient water heaters.\nFoundations are usually more solid.\nAll construction reviewed to meet current building codes.\nHomeowners insurance is less expensive.\n﻿>> 5 of the most haunted old houses in Atlanta\nCons:\nNew homes cost more than older homes.\nSometimes cookie-cutter homes are constructed with less durable building materials.\n\"Builder-grade\" appliances might come without the latest technology.\n\"Mass-produced\" homes can lack character.\n﻿>> Five reasons to love East Atlanta Village\nResale Homes\nPros:\nOften less expensive than newly built homes.\nA seller will often agree to purchase a buyer's home warranty.\nMany older homes have unique features such as original hardwood floors or fireplaces.\nLandscaping may feature more mature trees and shrubs.\nOlder homes often sit on larger lots.\nCons:\nResales may offer less square footage or smaller rooms.\n\"Homes built before the 1970s will often have fewer bathrooms...or one tiny bathroom with pea-green tile,\" Stills said.\nResales are more prone to deteriorating infrastructure, such as bad wiring, faulty plumbing or a crumbling foundation.\nOlder homes may require costly renovation.\n\"Buying an older home that meets a buyer's criteria except for an outdated kitchen or bathroom, is not necessarily a deal breaker,\" Stills said. \"Making upgrades to a home or renovating can give a buyer more freedom to design a home without actually having a new home constructed.\"\nFinancing\nWhen it comes to financing, if a resale isn't quite to your liking, you can incorporate the cost of renovations into your mortgage. \"It's not much more difficult to get approved for a loan that incorporates renovations,\" said Derek White, a sales manager with Alpharetta-based Movement Mortgage. \"The borrower needs to be able to qualify for the increase in the loan amount due to the cost of renovations.\"\nThe cost of renovations can't exceed 50 percent of the \"after,\" or improved value of the home.\nAlthough builders and developers offer financing incentives with new construction, White said his experience is \"the incentives are baked into the cake for the most part.\"\n\"That relationship doesn't always work out for the buyers because outside lenders are usually not able to compete for the buyer's business,\" White said.\nThis may drive up the cost of the loan.\nStills recommends creating your own pros and cons lists that takes into consideration your desired location, must-haves and deal-breakers. Stills also suggests consulting a professional contractor to calculate the costs of renovation before purchasing a fixer-upper.\n\"Some homes are move-in ready. But some of them, especially like some of the older ranches...maybe they've been updated since the '50s, but that was in the 1980s,\" Stills said. \"If you're not crazy about the kitchen and you're very picky about what you want, I think it's worth buying a home and renovating it yourself.\"","url":"https://www.ajc.com/classifieds/homes/the-pros-and-cons-buying-new-used-house-dekalb-county/KrSPytLMuoMPU8QvJcSvVN/"}
