{"authors":["William Bigelow"],"date_download":"2018-10-30 18:58:21","date_modify":"2018-10-30 18:58:21","date_publish":"2015-12-22 18:20:53","description":"On Monday, Chee Kung Tong leader Raymond “Shrimp Boy” Chow told a jury that his violent history stopped in 2003 or 2004.","filename":"data/vaneerConsumption/ShrimpBoyTakestheStand.json","image_url":"https://media.breitbart.com/media/2015/09/Chow-Tub-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_22__1540925901.html","title":"‘Shrimp Boy’ Takes the Stand","title_page":"‘Shrimp Boy’ Takes the Stand | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday, Chee Kung Tong leader Raymond “Shrimp Boy” Chow, 56–accused of racketeering, money laundering, murder and conspiracy–told a jury that his violent history stopped in 2003 or 2004 after three days of meditation, according to CBS San Francisco.\nOn the first day of his defense, Chow admitted he had confessed to numerous crimes before his epiphany. However, he said, “I changed myself … I told myself I’m not going to cross the line to any crimes. I’m not going to do anything illegal.”\nHe said his meditative experience occurred in 2003 or 2004 near the Great Highway in San Francisco, overlooking the Pacific Ocean, after his 2003 release from prison. Chow said because he vowed to change, he would not collect the “more than half a million dollars cash” people owed him, adding, “When you try to collect your money you’re going to be person of interest. I [made] up my mind I’m not going to do anything illegal,” according to the San Francisco Chronicle.\nQueried by his attorney, Tony Serra, as to whether he had made “a vow not to engage in criminal activity” and whether he had fulfilled the vow, Chow answered simply, “Yes.” When Serra asked, “Have you since making that vow committed any crime?” Chow replied, “No.”\nFollowing Chow’s assertion that he had pledged to stop engaging in criminal activity, a juror walked out of the courtroom, later claiming to have had an anxiety attack, prompting Judge Charles Breyer to recess the trial until later in the afternoon, when he conducted a hearing on whether the juror should be dismissed.\nThe San Mateo Daily Journal reported that prosecutors made frequent objections to Chow’s long, answers to questions, arguing they were not relevant.\n“Shrimp Boy” is a key figure in the scandal that brought down State Sen. Leland Yee in 2014, who was a leading Democrat and a candidate for Secretary of State in California before being implicated in corruption and gun-running.","url":"https://www.breitbart.com/local/2015/12/22/shrimp-boy-takes-stand/"}
