{"authors":["Felix Contreras"],"date_download":"2018-10-23 00:16:43","date_modify":"2018-10-23 00:16:43","date_publish":"2016-02-04 00:00:00","description":"The Colombian band has a long history of widespread influence and electronically enhanced grooves. Hear the band's founder in a music-filled discussion with Alt.Latino.","filename":"data/vaneerConsumption/SidestepperRichardBlairsTimelessGreatIdea.json","image_url":"https://media.npr.org/assets/img/2016/02/04/sidestepper_3_cr-hugo-rubiano_wide-036ea039c37aa3d5c284ebd136e1bc2657ecca8b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_altlatino_2016_02_04_465176695_sidestepper-richard-blairs-timeless-great-idea_1540253803.html","title":"Sidestepper: Richard Blair's Timeless Great Idea","title_page":"Sidestepper: Richard Blair's Timeless Great Idea : Alt.Latino : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Sidestepper: Richard Blair's Timeless Great Idea\nEnlarge this image toggle caption Hugo Rubiano/Courtesy of the artist Hugo Rubiano/Courtesy of the artist\nRichard Blair is from Britain, but his heart is in Colombia. Blair went from producing albums for Peter Gabriel to immersing himself in the music and culture of Colombia — itself a country with deep African roots.\nHe chased a sound he'd heard in his head; one that mixed the burgeoning electronic music scene of Britain with the Afro-Colombian sounds he'd heard in the streets and clubs of Bogota, the Colombian capital.\nThe result, formed in 1996, was the band Sidestepper, which released four albums that left a huge impression on the Colombian music scene. Current Colombian bands like Bomba Estereo and Choc Quib Town have spoken at length about the influence of Sidestepper on their music.\nBlair recently assembled a new generation of Colombian musicians to re-form Sidestepper and release an album (Supernatural Love) with a sound that looks forward and backward at the same time. It's rich with tradition, and with the sounds of clubs around the world.\nThis week on Alt.Latino, Blair joins us to discuss Sidestepper's history, his own musical influences, and what we've determined to be the ultimate truth. (Listen in to find out what I mean.)","url":"https://www.npr.org/sections/altlatino/2016/02/04/465176695/sidestepper-richard-blairs-timeless-great-idea"}
