{"authors":["Frances Martel"],"date_download":"2018-10-30 19:05:59","date_modify":"2018-10-30 19:05:59","date_publish":"2015-04-15 16:18:03","description":"The government of Sierra Leone reopened schools nationwide Tuesday, after being closed nine months to prevent the spread of the Ebola virus.","filename":"data/vaneerConsumption/SierraLeoneReopensSchoolsforFirstTimeinNineMonthsasEbolaMenaceEbbs.json","image_url":"https://media.breitbart.com/media/2015/01/ebola.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_15__1540926359.html","title":"Sierra Leone Reopens Schools for First Time in Nine Months as Ebola Menace Ebbs","title_page":"Sierra Leone Reopens Schools for First Time in Nine Months as Ebola Menace Ebbs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The government of Sierra Leone reopened schools nationwide on Tuesday, after closing them for nine months to prevent the spread of the Ebola virus. President Ernest Koroma’s confidence in reopening the schools is a sign that the Ebola outbreak may be, after a year of international struggle to contain it, nearing an end.\nThe Associated Press reports that over 8,000 schools were opening on Tuesday, many staffed by teachers and other workers who have undergone UNICEF training in Ebola awareness and safety. The openings affect 1.8 million school-aged children. Teachers and staff are expected to be especially vigilant in seeking out any Ebola symptoms in students as they attend school, as well as helping students readjust to life.\nBBC reports that UNICEF called the school reopening “a major step in the normalisation of life.” The BBC reporter tasked with covering the year’s first day of school in the country noted that attendance was significantly low; in one school the BBC visited, less than ten percent of students came in. One mother told the outlet that she would have preferred the government to keep schools closed until the next academic year, scheduled to begin in September, “when Ebola would hopefully have finally ended and better preparation made for the proper start of the school year.”\nThe government prepared an Ebola-centric curriculum for the first day, teaching students basic safety behaviors and allowing each school time to reflect on their respective losses as a result of the outbreak.\nThe school openings followed a three-day lockdown known as the Zero Ebola National Campaign, an attempt to record and monitor every single potential case of Ebola and ensure maximum safety for schools reopening. In remarks announcing the reopening of schools, President Ernest Koroma announced a program to open schools up to as many students as possible: “the APC-led Government will pay all school fees in public schools and examination fees for every single NPSE, BECE and WASSCE student for the next two years.” The tuition payments are intended to entice parents to allow students to return to school and help families who have been financially hit by the Ebola virus within the past year.\nSierra Leone is the last of the three major Ebola-stricken nations to open its schools. Guinea, the BBC notes, opened schools in January, and Liberia opened theirs one month later.\nThe World Health Organization (WHO) recorded nine new cases of Ebola in Sierra Leone in the week of April 12, as well as the week prior, the lowest number of the three nations being monitored. The number is negligible compared to the hundreds being diagnosed per week at the height of the outbreak; in the week of October 12, the WHO recorded 359 cases.","url":"https://www.breitbart.com/national-security/2015/04/15/sierra-leone-reopens-schools-for-first-time-in-nine-months-as-ebola-menace-ebbs/"}
