{"authors":[],"date_download":"2018-10-22 21:57:16","date_modify":"2018-10-22 21:57:16","date_publish":"2014-06-07 00:29:31","description":"Sierra Nevada Corp. is getting ready for a key series of tests of its Dream Chaser prototype spaceship, says company executive Mark Sirangelo.","filename":"data/vaneerConsumption/SierraNevadaCorpsDreamChaserTakesShapeasaRealSpaceTaxi.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/493911/140606-dream_fbe5286ca917d7fb3bf135d883531524.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_sierra-nevada-corp-s-dream-chaser-takes-shape-real-space-n125046_1540245436.html","title":"Sierra Nevada Corp.'s Dream Chaser Takes Shape as a Real Space Taxi","title_page":"Sierra Nevada Corp.'s Dream Chaser Takes Shape as a Real Space Taxi","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe three companies that are building space taxis to transport NASA astronauts to and from the International Space Station all say they're on track to get their spaceships into orbit by 2017 — provided that NASA keeps the money flowing.\nCalifornia-based SpaceX was the latest to make a splash, thanks to last week's unveiling of its Dragon V2 space capsule. But the Boeing Co. is about to ramp up operations at NASA's Kennedy Space Center for its gumdrop-shaped CST-100 capsule. And Sierra Nevada Corp.'s Space Systems operation, headquartered in Colorado, is also making progress on its winged Dream Chaser mini-shuttle.\n\"We've had a busy few months,\" Mark Sirangelo, head of SNC Space Systems, told NBC News this week. \"The program is moving along quite rapidly.\"\nLast month, Sierra Nevada Corp. finished wind-tunnel testing for the Dream Chaser orbital design. \"Getting all the aspects of wind tunnel testing done is about as close as you can come to flying in orbit,\" Sirangelo said.\nAt NASA's Michoud Assembly Facility in Louisiana, Lockheed Martin has begun work on the version of the vehicle that's due to be launched into orbit for the first time in late 2016 atop an Atlas 5 rocket. Lockheed Martin is part of the \"dream team\" that Sierra Nevada assembled to turn the Dream Chaser into a space-traveling reality.\n\"Things are beginning to be quite real for us,\" Sirangelo said.\nSierra Nevada has also analyzed the results from the first free-flying glide test of a Dream Chaser prototype, conducted last October, and Sirangelo said two more autonomous glide tests will be conducted in the latter half of this year. A series of atmospheric tests with crews aboard will follow — and although the schedule for those flights has not been announced, Sirangelo said \"we're going to be flying it with people shortly.\"\nHe said the prototype vehicle \"is essentially the equivalent of what NASA had with Enterprise,\" the experimental space shuttle that was designed only for atmospheric testing. The orbital vehicle, in contrast, can be launched into orbit and come back down for a runway landing, with or without a pilot aboard.\nAfter the uncrewed orbital test in 2016, Sierra Nevada is aiming for demonstration flights with crews starting in 2017. That meshes with the time frame that NASA is expecting, and the time frame that's being targeted as well by SpaceX and Boeing.\nSizing up the competition\nThose two other companies received the lion's share of the $1.1 billion that NASA allotted for the current phase of the spaceship competition: $460 million for Boeing, and $440 million for SpaceX. Because of budgetary limitations, Sierra Nevada received just a half-share of $212.5 million, and Sirangelo said that forced his company to be frugal.\n\"Even though we didn't receive as much funding, we're pretty equal if not ahead in our development with our competitors,\" he said.","url":"https://www.nbcnews.com/science/space/sierra-nevada-corp-s-dream-chaser-takes-shape-real-space-n125046"}
