{"authors":["Associated Press"],"date_download":"2018-10-23 03:21:38","date_modify":"2018-10-23 03:21:38","date_publish":"2017-03-16 14:09:20","description":"FREETOWN, Sierra Leone (AP) - A pastor in Sierra Leone has discovered the largest uncut diamond found in more than four decades in this West African country...","filename":"data/vaneerConsumption/SierraLeonepastordiscovers706caratdiamondinvillage.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/19/wire-230443-1489694061-326_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320450_Sierra-Leone-pastor-finds-706-carat-diamond-village_1540264898.html","title":"Sierra Leone pastor discovers 706-carat diamond in village","title_page":"Sierra Leone pastor discovers 706-carat diamond in village | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FREETOWN, Sierra Leone (AP) - A pastor in Sierra Leone has discovered the largest uncut diamond found in more than four decades in this West African country and has turned it over to the government, saying he hopes it helps to boost recent development in his impoverished nation.\nPastor Emmanuel Momoh found the 706-carat alluvial diamond in Yakadu village in Sierra Leone's diamond-rich east, and it was presented to President Ernest Bai Koroma on Wednesday, said presidential spokesman Abdulai Bayraytay.\nThe gem, a bit smaller than a hockey puck, is the second largest diamond found in Sierra Leone. In 1972, the 968.9-carat Star of Sierra Leone was found by miners and sold for about $2.5 million.\nIn this photo taken from video footage, Sierra Leone's President Ernest Bai Koroma hands a diamond during a meeting with delegates of Kono district, where the gem was found, at the presidential office in Freetown, Sierra Leone, Thursday, March 16, 2017. A pastor in Sierra Leone has discovered the largest uncut diamond found in more than four decades in this West African country and has turned it over to the government, saying he hopes it helps to boost recent development in his impoverished nation. (SLBC via AP)\nMomoh told The Associated Press that he turned in the diamond because he was touched by the development being undertaken in Kono District, where the gem was found. He cited road construction and improvements to electricity after almost 30 years of blackouts.\n\"I believe the government can do more, especially at a time when the country is undergoing some economic challenges,\" he said.\nSierra Leone's diamond wealth fueled a decade-long civil war that ended in 2002. Despite its mineral wealth, the country remains one of the poorest in the world.\nIt was not immediately clear how the pastor came across the diamond.\nThe president expressed appreciation that there was no attempt to smuggle the gem out of the country, and encouraged others to emulate the pastor's example. He promised the diamond would be sold to the highest bidder and whatever is due to the owner and government would be distributed accordingly.\n\"A gift from God, and it will be a terrible thing if anyone tries to do something criminal with it,\" the president said.\nSpokesman Bayraytay said the diamond has not yet been valued and has been placed in the Bank of Sierra Leone.\nThe president has given \"clear instruction to the Ministry of Mines that the evaluation, sale and distribution of the proceeds must be done in the most transparent manner,\" he said.\nFILE- In this Wednesday May. 24, 2000 file photo, diamond prospectors sift through the earth in the Corbert mine in Waiima, Sierra Leone, 40 kilometers (25 miles) east of Bo in central Sierra Leone. A pastor in Sierra Leone's Kono district discovered and turned in the largest uncut diamond found in more than four decades in the West African country, the government said Thursday March. 16, 2017. (AP Photo/Adam Butler, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4320450/Sierra-Leone-pastor-finds-706-carat-diamond-village.html"}
