{"authors":["Julie Cart","Guest Commentary"],"date_download":"2018-10-31 00:04:35","date_modify":"2018-10-31 00:04:35","date_publish":"2016-11-25 14:22:43","description":"California’s high country is a delight in summer, a cool respite from the heat of the state’s lower elevations. That’s especially true in the","filename":"data/vaneerConsumption/Sierraforeststurnedtobrown.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/shaverlaketrees_1_CO8Qmt3-thumbnail-1200x1200-70.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944275.html","title":"Sierra forests turned to brown","title_page":"Sierra forests turned to brown | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California’s high country is a delight in summer, a cool respite from the heat of the state’s lower elevations. That’s especially true in the Sierra Nevada, where a corridor of shade transports vacationers from Fresno to Yosemite National Park under a dense canopy of cedar trees, firs and pines.\nBut after five years of drought and insect infestation, more than 66 million trees have died across the state, many in the eastern Sierra. In tree-ringed communities such as Bass Lake and Shaver Lake, up to 80 percent of the pines and other conifers have died.\nBoating, fishing, camping and hiking in the region’s recreational communities have been affected. The U.S. Forest Service has closed campgrounds and day-use areas to protect the public while the agency works to remove dead trees and limbs.\nSome vacation rental properties have been taken off the market, awaiting overburdened tree-removal crews. Cleanup projects can easily cost property owners tens of thousands of dollars.\nIt’s all anybody talks about, said Todd Wittwer, a fishing guide at Bass Lake and Shaver Lake.\nEven from the vantage point of his workplace on the water, “everybody sees the trees and talks about them,” he said.\nWittwer, 52, is in his 16th year as a fishing-guide operator. He said visitors from all over the world come to the high-altitude lakes to catch kokanee salmon and rainbow trout. Many are repeat visitors who are shocked at how the region is transforming.\n“They get here and they see the devastation,” Wittwer said. “It hits them hard.”\nWildlife are affected, too. “We have bald eagles at Bass Lake that we watch every year, nesting with two eaglets. They didn’t nest this year. The tops of the trees—where they build their nests–are dying.”\nWittwer said his business is slower, though he would not a put a number on the decline. Vacations are being canceled up and down the Sierra, he said. Campgrounds are denuded of trees. “Who wants to camp with no trees under the blazing hot sun?”\nFor homeowners, the widespread tree loss has pushed some to move and lowered values, Wittwer said: “There’s quite a number of homes for sale because of that.”\nGov. Jerry Brown has declared a state of emergency, and the Legislature has set aside $30 million to help counties manage the problem. That’s a start, said Gregg Fishman, spokesman for the California State Association of Counties, which has been asking for more funding.\n“This is an ecosystem-changing event, changing the face of some of these areas for many decades,” Fishman said. “Property values—I’m sure people are concerned about that. A lot of county revenue comes from property values.”\nWittwer and his guests are mostly sad.\nThe fishing guide recently hosted clients from Canada. Arriving at the lake late in the day, they marveled at the sun setting on the forest, remarking that it almost looked like autumn. “Like fire on the trees,” they said.\n“Early the next morning, they came down to the dock,” Wittwer recalled. “They looked out and said, ‘The trees are dying, aren’t they?’ Yep.”\nSee more in our main story about the Golden State’s forest fatalities.","url":"https://calmatters.org/articles/sierra-forests-turned-to-brown/"}
