{"authors":["Fionn Hargreaves For Mailonline"],"date_download":"2018-10-23 02:53:44","date_modify":"2018-10-23 02:53:44","date_publish":"2017-03-16 13:33:21","description":"Emmanuel Momoh was working in a mine in the Kono region, to the east of the country, when he found the precious stone. The gem will be sold through a bidding process and is incredibly rare.","filename":"data/vaneerConsumption/SierraLeonepastorunearths706caratdiamondworth50m.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/20/3E57F39700000578-0-image-a-46_1489694600533.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320300_Sierra-Leone-pastor-unearths-massive-706-carat-diamond_1540263224.html","title":"Sierra Leone pastor unearths 706-carat diamond worth £50m","title_page":"Sierra Leone pastor unearths 706-carat diamond worth £50m | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Christian pastor working in a Sierra Leone mine has found a 706-carat diamond, which could be the tenth largest ever found.\nThe precious stone was found by Emmanuel Momoh, who was working in the Kono region, in the east of the country.\nIt will be sold in Sierra Leone in a 'transparent' bidding process to benefit the country, according to a government statement.\nChristian pastor Emmanuel Momoh found a 706-carat diamond in a mine in Kono, Sierra Leone, which could be the tenth largest ever found (pictured)\nIt read: 'A 706-carat diamond was presented to President Dr Ernest Bai Koroma yesterday evening.\n'Receiving the diamond President Koroma thanked the chief and his people for not smuggling the diamond out of the country.'\nDiamond expert Paul Zimnisky said it could be 'between the 10th and 15th largest gem-diamonds ever recovered' and such a find is very rare in a small mine.\nThe diamond was found in a smaller, or artisan, mine, which diamond expert Paul Zimnisky said rarely find gems of this size and quality\nThe precious gem will be sold in a 'transparent' bidding process and is believed that it will likely leave the country once it is bought (file photo)\nHe said: 'Most recent exceptional diamond discoveries have been made by large commercial miners that mine very large volumes of kimberlite ore and process it with advanced equipment.\n'Artisanal mining tends to produce smaller, lower quality diamonds because the diamonds suffer breakage and erosion.'\nZimnisky said the stone would likely be sold outside Sierra Leone, despite the government's assertion, for better access to buyers.\nWithout a professional assessment of the diamond's potential flaws and colouring it is impossible to value the stone.\nHowever, a polished stone cut from the Jonker, which is the 10th largest gem-diamond ever recovered until now at 726 carats, will go on sale in Hong Kong in May.\nA single 25-carat portion is likely to sell for $2.2 million to $3.6 million (£1.78 million to £2.75 million), or $88,000 to $144,000 for a single carat, Zimnisky said.\nA single 25-carat portion is likely to sell for $2.2 million to $3.6 million or £1.78 million to £2.75 million. Diamond expert Paul Zimnisky said that it is impossible to put a value on the diamond at this point (file photo)\nA 1,111-carat diamond was discovered at a mine in Botswana in 2015, the biggest find for more than a century.\nThat gem is second in size only to the Cullinan diamond which was unearthed in South Africa in 1905, at 3,106 carats uncut, according to the Cape Town Diamond Museum.\nThe Cullinan was cut into several gems, including two set into the sceptre and crown of the British Crown Jewels.\nHistorically, Sierra Leone has had a controversial role in the diamond industry.\nThe precious stone was presented to President Dr Ernest Bai Koroma yesterday evening. Sierra Leone used to be associated with 'blood diamonds', which helped finance wars in Africa in the 1990s (file photo)\nThe sale of 'blood diamonds' helped finance civil wars across Africa in the 1990s and often funded military dictatorships on a continent that the London Diamond Bourse estimates provides 65 percent of the world's diamonds.\nRebels allowed traders to exploit diamond mines and ship the gems abroad via Liberia.\nIn one of the most notorious cases, former Liberian warlord Charles Taylor was found guilty of supporting the rebels in exchange for diamonds mined by slave labour.\nThe diamond was found in the same area as where US-Belgian businessman Michel Desaedeleer was accused of enslavement and diamond trafficking (file photo)\nThe district where the 706-carat diamond was discovered is where US-Belgian businessman Michel Desaedeleer, accused of enslavement and diamond trafficking during Sierra Leone's civil war, is alleged to have committed his crimes.\nHe died in jail in September before he could stand trial.\nThe death toll from Sierra Leone's civil war is estimated at 120,000.\nThe country has a population of roughly six million people, making it one of Africa's deadliest conflicts in recent history.","url":"https://www.dailymail.co.uk/news/article-4320300/Sierra-Leone-pastor-unearths-massive-706-carat-diamond.html"}
