{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:36:42","date_modify":"2018-10-31 00:36:42","date_publish":"2018-07-07 00:00:00","description":"BI PRIME: Chris Hyzy, the chief investment officer of Bank of America Global Wealth and Investment Management, shares what he sees as a policy error that could trigger the end of this economic cycle. Nine years into the expansion, investors everywhere are trying to figure out what it might be.","filename":"data/vaneerConsumption/SignsofendofthiseconomiccycleaccordingtoBankofAmericasHyzy.json","image_url":"https://amp.businessinsider.com/images/5b3e3a991335b834008b4848-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bull-market-economic-cycle-ending-signs-of-stress-chris-hyzy-2018-7_1540946202.html","title":"Signs of end of this economic cycle, according to Bank of America's Hyzy","title_page":"    Signs of end of this economic cycle, according to Bank of America's Hyzy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chris Hyzy, the chief investment officer of Bank of America Global Wealth and Investment Management. CNBC/Screenshot\nNine years after the financial crisis, investors everywhere are wondering what will trigger the end of the subsequent expansion.\nChris Hyzy, the chief investment officer of Bank of America Global Wealth and Investment Management, is eyeing European credit. And no, he's not referring to another Greek crisis.\n\"It can continue until there's an error, and the biggest error that we see would be European credit stress,\" Hyzy, who oversees about $2 trillion in assets, told Business Insider in a recent interview.\nThe European Central Bank, like the Federal Reserve, stepped in after the financial crisis to lower borrowing costs by buying government bonds. But in an unexpected twist, the ECB announced in March 2016 that it would add corporate debt to its $3 trillion (€2.5 trillion) quantitative-easing program.\nThis could be the complicating factor, according to Hyzy. That's because the ECB's buying of corporate bonds was an investment not only in the companies but in the spread, or gap, between the yields on corporate and sovereign bonds. Selling these bonds would lower their prices, which move inversely to yields.\n\"If they had to sell corporate bonds, that would widen out the spreads, that would raise input costs for companies, and that would be a policy error ultimately exported to the rest of the world in some fashion,\" Hyzy said.\n\"So to me, it's more important to look at the European credit markets versus the US credit markets for any sign of a policy error coming.\"\nThe ECB plans to end its bond buying in December.\nThe US corporate-debt market has also raised investors' eyebrows — not for the Fed's involvement in it but for investors' interest in companies with lower credit ratings in return for their higher yields. This isn't an immediate concern for Hyzy because coverage ratios, a gauge of how easily companies can repay their debt, are still strong.\n\"The question I would have is what makes the coverage ratios go the other way,\" Hyzy said. \"Right now we don't see any signs of that.\"\nWhile Hyzy remains bullish on the US, others have flagged the global credit market as the most likely domino that triggers the next downturn.\nIn its annual economic report, the Bank for International Settlements recently warned that rising levels of government and household borrowing are creating a trap that central bankers may struggle to untangle. Credit has helped short-term growth, but raising the low interest rates that encouraged borrowing could prove difficult for central bankers, the so-called bank for central bankers said.\nFor now, the US is furthest ahead in unwinding crisis-era monetary policy by raising interest rates and reducing the size of its balance sheet. So far, this has happened without a jump in inflation, and it's one of the reasons Hyzy believes the US is breaking away from the rest of the world. He maintains an overweight to US stocks \"even though they're at premium valuations\" and sees the rise in short-term yields as a sign that real growth is rising.\n\"If inflation comes back in a way where the Federal Reserve has to quicken the pace of the current policy, the cycle will ultimately peak out, and that's when you'll start to see the yield curve not just flatten but invert,\" Hyzy said.","url":"https://www.businessinsider.com/bull-market-economic-cycle-ending-signs-of-stress-chris-hyzy-2018-7"}
