{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:15:09","date_modify":"2018-10-30 22:15:09","date_publish":"2015-09-01 17:57:36","description":"Sig Sauer Being Sued After Their Handgun Allegedly Used In Murder By Cartel Member","filename":"data/vaneerConsumption/SigSauerBeingSuedAfterTheirHandgunAllegedlyUsedInMurderByCartelMember.json","image_url":"https://media.breitbart.com/media/2015/09/Sig-Sauer-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_01__1540937709.html","title":"Sig Sauer Being Sued After Their Handgun Allegedly Used In Murder By Cartel Member","title_page":"Sig Sauer Being Sued After Their Handgun Allegedly Used In Murder By Cartel Member","title_rss":"NULL","source_domain":"breitbart.com","text":"German gun maker Sig Sauer is being sued by gun control proponent Jürgen Grässlin over news that a Sig Sauer handgun was allegedly used by a cartel member to kill 12 people in Mexico–including human rights activist Marisela Escobedo.\nThe murders appear to have all taken place in 2010 but details surrounding them were recently released by a Chihuahua court.\nAccording to DW, German TV aired “a short documentary” on the murders on August 30 and it “showed CCTV footage of the murderer chasing Escobedo across a street in the city of Chihuahua and shooting her in the back of the head.”\nGrässlin responded:\nIt’s a particularly horrifying case, but it’s also a special case–it’s very rare. We have a convicted killer who confessed that he killed at least 12 people, and the gun’s serial number–and Sig Sauer themselves say it is one of their guns. We don’t know where exactly the gun was assembled – but we know it was German expertise, German technology – either separately or in one piece – and it found its way to the perpetrator in Mexico – the fact that he had it was illegal, because there was no export license.\nBecause Grässlin did not discover an export license that would have allowed the gun to be in Chihuahua for legal access, his suit revolves around “suspicion of illegal weapons exports.”\nSig Sauer says the gun was manufactured in New Hampshire “and sold..to a legal dealer in Mexico.”\nIn 2014 Grässlin filed a suit and made similar allegations against Sig Sauer over alleged firearm exports to Colombia and in 2010 he filed a suit against Heckler & Koch over guns he claimed were “illegally” sold to Mexican police.\nIt would be interesting to know if Grässlin has spoken with the United States Department of Justice (DOJ) or Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) regarding operation Fast and Furious; an operation in which guns were covertly supplied to Mexican cartel members.\nApproximately 2,500 weapons were knowingly sold to straw buyers in the US during the operation, with the intent of smuggling them over the US/Mexican border and supplying them to cartel members. That program began in 2009, so it would seem a viable option for supplying arms in 2010.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/09/01/sig-sauer-being-sued-after-their-handgun-allegedly-used-in-murder-by-cartel-member/"}
