{"authors":["Associated Press","Keith Griffith","Forrest Hanson","Emily Crane For Dailymail.Com"],"date_download":"2018-10-22 23:42:49","date_modify":"2018-10-22 23:42:49","date_publish":"2017-03-10 03:54:09","description":"Police in Kent, Washington on Thursday released a sketch of man who last week shot a Sikh man, offering a $6,000 reward and asking anyone with information to call the tip line at 253-856-5808.","filename":"data/vaneerConsumption/SikhshootingseesSeattlepolicereleasegunmansketch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E234C2000000578-0-image-a-4_1489155990124.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299918_Police-FBI-seek-tips-offer-reward-shooting-Sikh-man_1540251769.html","title":"Sikh shooting sees Seattle police release gunman sketch","title_page":"Sikh shooting sees Seattle police release gunman sketch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police in suburban Seattle and the FBI are asking for the public's help to find a gunman who shot a Sikh man and told him to go back to his country.\nThe Kent, Washington police department on Thursday released a sketch of the man who last week shot Deep Rai, a 39-year-old U.S. national of Indian origin, and are offering a $6,000 reward for information that leads to his arrest.\nRai, who was struck in the arm and is recovering, told police that he got into an argument with the masked assailant.\nThe suspect then shouted 'go back to your own country' and fired at Rai in his own driveway last Friday.\nPolice, assisted by the FBI, are investigating the shooting as a hate crime.\nScroll down for video\nPolice in Kent, Washington on Thursday released this sketch of a suspect in the shooting of a Sikh man, who says the assailant shot him and told him to go back to his own country\nKent Police Chief Ken Thomas gave a media conference on Saturday saying a member of the Sikh community had been shot. Cops are seeking information from the public in the case\nInvestigators haven't identified a suspect but describe him as a 6-foot-tall white man with a medium build, dark hoodie, dark clothing and a mask covering the lower part of his face.\nThe newly released suspect sketch shows the man with thick, dark eyebrows and brown eyes.\nKent Police Commander Jarod Kasner says local police haven't had reports of any similar incidents.\nBut Hira Singh, a Sikh community leader in the city of Kent, said Sunday that there have been increasing complaints recently from Sikhs who say they have been the target of foul language or other comments.\nHe says about 50,000 Sikhs live in Washington state, and Friday night's shooting has shaken the community.\nJaswinder Singh, of the Gurudwara Sikh Center of Seattle, told the Seattle Times: 'It's kind of scary to hear about things like this, but we definitely have been getting tremendous support from the community.'\nMen and women, including a man wearing a 'USA' sweatshirt, attend Sunday services at the Gurudwara Singh Sabha of Washington, a Sikh temple in Renton, Washington. The shooting has rattled members of the Sikh community, which numbers about 50,000 in the state\nRai told police a man he didn't know came up to him Friday night as he worked on his car in his driveway. They argued, with the suspect telling Rai to go back to his homeland, then shooting him in the arm, authorities said. The scene of the shooting is pictured above\nKent police have not identified the victim or released other information about him. But India's foreign minister, Sushma Swaraj, named him on Twitter, saying, 'I am sorry to know about the attack on Deep Rai, a U.S. national of Indian origin.'\nThe US ambassador to India, MaryKay Loss Carlson, and India's external affairs minister, Sushma Swaraj, expressed her sorrow over the incident.\nCarlson tweeted: 'Saddened by shooting in WA. Wishes for quick and full recovery. As @POTUS said we condemn \"hate and evil in all its forms.\"'\nIn a tweet Swaraj said: 'I am sorry to know about attack on Deep Rai a US national of Indian origin. I have spoken to Sardar Harpal Singh father of the victim.'\nFBI officers are assisting the Kent Police Department in their investigation.\nAn FBI statement read that the Seattle bureau is 'committed to investigating crimes that are potentially hate-motivated.'\nRai has since been released from hospital and is recovering, a Sikh leader from the area told the Seattle Times.\n'He is just very shaken up, both him and his family,' Jasmit Singh said.\n'We're all kind of at a loss in terms of what's going on right now, this is just bringing it home. The climate of hate that has been created doesn't distinguish between anyone.'\nPolice have asked anyone with information to call the anonymous tip line at 253-856-5808.","url":"https://www.dailymail.co.uk/news/article-4299918/Police-FBI-seek-tips-offer-reward-shooting-Sikh-man.html"}
