{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:03:01","date_modify":"2018-10-30 19:03:01","date_publish":"2015-09-28 17:11:10","description":"Indian Prime Minister Narendra Modi was greeted by several hundred opponents -- primarily members of a Sikh group.","filename":"data/vaneerConsumption/SikhSeparatistsProtestPMNarendraModiinSanJose.json","image_url":"https://media.breitbart.com/media/2015/09/Modi-Rally.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_28__1540926181.html","title":"Sikh Separatists Protest PM Narendra Modi in San Jose","title_page":"Sikh Separatists Protest PM Narendra Modi in San Jose","title_rss":"NULL","source_domain":"breitbart.com","text":"SAN JOSE — Indian Prime Minister Narendra Modi was greeted by well over 20,000 supporters on Sunday for his historic visit, but several hundred opponents — primarily members of a Sikh group — were also present to protest the leader of the Indian diaspora.\nLoud chants of “Modi, shame shame!” from a group of Sikh separatists who convened outside of the SAP Center in San Jose were met with opposition from supporters who fired back with equal fervor. Several of the Sikhs on the front lines were violently smacking images of the prime minister with the soles of their shoes in what many Indians and Indian-Americans in attendance told Breitbart News they viewed as a display of tremendous disrespect.”\n“We don’t support him because he’s the killer of the minority people in India,” Jugher Singh told Breitbart News. He blamed Modi for the 2002 retaliatory killings of 1,000 people, mostly Muslims, following what was later deemed in a court of justice to be a planned attack on Hindu pilgrims that same year in which 59 people died when a fire was set inside the Sabarmati Express train in the Indian state of Gujarat. Modi served as chief minister of Gujarat at the time of the riots and killings.\nIn 2011, a court convicted 31 Muslims for the tragic train incident and charged them with murder and criminal conspiracy in the plot to kill the Hindu activists, which led to one of the worst religious clashes in years.\nThere have been claims of violations against minorities such as Christians, Sikhs, and Muslims in India. However, a Sikh man, who was among the thousands who came out in support of Modi, said, “Mr. Modi always talks about 1.25 billion Indians. He never talks about Hindus, Sikhs, Muslims,” drawing to the PM’s holistic nationalism view in which he is seeking to promote every religious group under the umbrella of one united Indian nation.\n“The Sikh community wants Khalistan, the name of our country,” Singh, who was with his uncle Sukhmender, told Breitbart News. The Khalistan Liberation Force (KLF) is a militant group that was formed as part of the Khalistan movement created by members of the Sikh community seeking to establish a Sikh homeland through armed struggle. Several loosely associated Khalistan militant outfits have been listed internationally as terrorist organizations.\n“Separatism is another name for terrorism,” Charanjit “Sunny” Ghai, a Sikh entrepreneur who resides in Northern California and who stood in support of Modi, told Breitbart News. Ghai said he believes the Sikhs who are seeking to branch off and create a different country “are misguided people who are supported by the erstwhile Congress Raj led by Sonia Gandhi and her son [Rahul] and her father and his mother. They are using these people as puppets to break up a united India for the first time in 70 years.”\nHe said that contrary to the Sikh separatists, Sikh Indians do not support the group of dissidents but instead that “the Sikh Government of Punjab is aligned with Modi.”\nAmong the more peaceful protests of the day were a group of Hindus known as Patidar that is seeking justice for Gujurat’s farmworkers caste. The caste’s technical name is “Patidar,” but since Patel is a very common surname among its members that is the name by which they are referred. Ashish Patel, who is also part of that caste, said that while the group is supportive of Modi, they are “urging him to take some serious action because there are innocent people [who] got hit and there were nine people [who] got killed last month… strictly by police.”\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/national-security/2015/09/28/sikh-separatists-protest-pm-narendra-modi-san-jose/"}
