{"authors":[],"date_download":"2018-10-30 01:24:47","date_modify":"2018-10-30 01:24:47","date_publish":"2015-12-08 09:00:00","description":null,"filename":"data/vaneerConsumption/SilencingtheRight.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/12/1024px-Oklahomacitybombing-fema-1562.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862687.html","title":"Silencing the Right","title_page":"Silencing the RightThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Recently, there were two highly publicized shootings in five days, and Republicans are being blamed for only one of them — the one that occurred at a Planned Parenthood clinic in Colorado Springs the day after Thanksgiving.\nIn case you didn’t hear, the alleged shooter, Robert Lewis Dear Jr., supposedly said something about “no more baby parts” after his arrest. Consequently, according to the Washington Post’s Ruth Marcus, “Republican politicians who fueled the overwrought and unsupported controversy over selling baby parts bear some measure of responsibility.”\n“Inflammatory rhetoric inflames,” Marcus wrote. “Words — extreme language and overheated representations — have consequences.”\nKatha Pollitt, a columnist for the Nation, concurs. Writing in the New York Times last week, Pollitt asserted:\nWhen prominent voices in the anti-abortion movement compare clinics to Auschwitz, when they equate embryos with slaves, when Bill O’Reilly says that people feel fetal tissue donation is “Nazi stuff” and Rush Limbaugh suggests the way to stop abortion is to “require that each one occur with a gun,” it is not surprising that susceptible people will act on what they hear as a call for violence.”\nTranslation: When right-wingers talk, they attack. The logical conclusion is that if only certain voices were silenced, the violence would cease.\nLiberals made similar pronouncements after the Oklahoma City bombing in 1995. President Clinton denounced “the purveyors of hatred and division” and “the promoters of paranoia” — an oblique reference to Rush Limbaugh and his talk-radio emulators. “It is time we all stood up and spoke against that kind of reckless speech,” Clinton said.\nEx-conservative Michael Lind contended that “mainstream conservatives” had “helped to legitimate the world view of the Oklahoma City bombers… by means not of rhetoric but of ideology.” The implication is that behind every right-wing crime is a thought crime, that people with right-wing views are guilty by ideological association of right-wing violence.\nWhenever someone identified as a right-winger commits an act of violence, the same question is raised. After such an incident last year, the Washington Post’s Paul Waldman asked, “How much does right-wing rhetoric contribute to right-wing terrorism?” Note the premise of the question: That “right-wing rhetoric” contributes to terrorism is taken for granted; the question is merely of how much it contributes. Conservatives, Waldman argued, say things that “create an atmosphere in which violence and terrorism can germinate.”\nEven if this is true, it is no reason to police speech. What liberals are doing, when they correlate rhetoric with violence, is attempting to quell violence by squelching speech. What better way to shut people up than by accusing them of abetting terrorism?\nWe needn’t be so frightened of speech. We know from experience that ghastly words don’t always have ghastly consequences. It is quite possible to read Mein Kampf or The Communist Manifesto and not initiate a pogrom or a proletarian revolution. Indeed, these books have bored far more people than they have inspired or persuaded.\nThat is why we should welcome the forthcoming official publication in Germany of Mein Kampf, which hasn’t happened in 70 years. If Marcus and Pollitt are correct that inflammatory rhetoric causes people to act violently, the book should be banned on safety grounds. After all, it’s full of “extreme language and overheated representations,” and its publication is sure to have consequences.\nHowever, it’s impossible to know in advance what sort of consequences words will have. Sometimes incendiary words have good consequences — the ones in the Declaration of Independence, for instance — and sometimes they have no consequences at all. Last year, Louisiana Gov. Bobby Jindal warned of “a rebellion brewing amongst these United States” and of “a hostile takeover of Washington, D.C.” Neither has happened, because neither idea is taken seriously.\nAnd that’s just it. We should worry less about rhetoric and more about ideas. The only way to defeat bad ideas is to expose them, which is why we need people to speak more, not less, freely. In other words, we need more words, not fewer.","url":"https://spectator.org/64873_silencing-right/"}
