{"authors":["Nicole Fabian-Weber"],"date_download":"2018-10-30 23:10:01","date_modify":"2018-10-30 23:10:01","date_publish":"2014-08-13 22:31:19","description":"I mean, really. How bad of a father can Simon Cowell be? The man just posted a photo of himself and his baby son wearing matching sunglasses. No one who wears matching sunglasses with an infant is a bad person. No one! Typically, Simon tends to stay…","filename":"data/vaneerConsumption/SimonCowellsCutePicWithSonIsEvidenceThatHesNotaHalfBadDadPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bede679d-b10b-46a3-a108-433239abf828.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35697-simon-cowells-cute-pic-with-son-is-evidence-that-hes-not-a-half-bad-dad-photo_1540941001.html","title":"Simon Cowell's Cute Pic With Son Is Evidence That He's Not a Half-Bad Dad - PHOTO","title_page":"Simon Cowell's Cute Pic With Son Is Evidence That He's Not a Half-Bad Dad — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"I mean, really. How bad of a father can Simon Cowell be? The man just posted a photo of himself and his baby son wearing matching sunglasses. No one who wears matching sunglasses with an infant is a bad person. No one! Typically, Simon tends to stay mum on his private life, so this pic with his son, Eric, was a delightful little treat to his Twitter followers. As is the smile on Cowell's face. Who knew it was lurking under there all these years?\nSince the birth of his baby with girlfriend, Lauren Silverman, Cowell has shared a handful of photos of the little bundle. But hands down, this is the most adorable one yet. Just two dudes in their aviators, hanging out on a white boat. And uncomfy question: is it weird that I'm slightly jealous of little Eric? Here he is, spending his summer on a yacht, and here I am, wondering if I have the energy to make it to Chipotle to pick up a burrito for dinner. (Spoiler alert: I don't think I do.)\nAnway, here's an incredibly cute picture of Simon Cowell and his son. It's sweet; it throws their money in our faces; and it shows that Simon probably isn't a half-bad dad after all.\nAwwwww.","url":"https://www.bustle.com/articles/35697-simon-cowells-cute-pic-with-son-is-evidence-that-hes-not-a-half-bad-dad-photo"}
