{"authors":["Nkayla Afshariyan For Daily Mail Australia"],"date_download":"2018-10-22 23:48:59","date_modify":"2018-10-22 23:48:59","date_publish":"2017-03-10 04:27:13","description":"Australian fashion designer Simone Zimmermann and her husband Michael Redmond recently bought a three-storey mansion in North Bondi for $5.5 million","filename":"data/vaneerConsumption/SimoneZimmermanbuys55mhomeinNorthBondi.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1F75B600000578-0-image-a-3_1489116061897.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299684_5-5-million-home-bought-designer-Simone-Zimmerman_1540252139.html","title":"Simone Zimmerman buys $5.5m home in North Bondi","title_page":"Simone Zimmerman buys $5.5m home in North Bondi | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one-half of an Australian duo whose fashion label went from a stall at Paddington Markets to become a global brand with fans who spend as much as AU$5000 on a dress.\nNow Simone Zimmermann has purchased a stunning $5.5 million home in prestigious North Bondi.\nAccording to Domain, the Australian fashion designer and her husband Michael Redmond recently bought the three-storey mansion from Raine and Horne, Double Bay.\nThe $5.5million North Bondi house Australian fashion designer Simone Zimmermann recently bought\nDesigner Simone Zimmermann poses backstage at Zimmermann fashion show during Mercedes-Benz Fashion Week 2014\nThe property boasts three bedrooms and three bathrooms, complete with beachfront views, marbled interior and a barrel vaulted ceiling.\nThe home comes with triple parking, video intercom and keyless entry.\nThe master bedroom has a spa ensuite and the property sits on the esteemed Ben Buckler peninsula.\nSimone is no stranger to Bondi, having lived nearby on Elliot Street and growing up in the Sydney area.\nThe two-storey home boasts marbled floors, a barrel vaulted ceiling and panoramic ocean views\nWith panoramic ocean views, Simone Zimmermann's new home is situated on the esteemed Ben Buckler peninsula\nSimone (right) and her sister Nicky Zimmermann (left) pose with their models during a 2009 New York fashion show\nThe home is beautifully constructed with open plan indoor and outdoor living areas, modern kitchen and contains a study nook with breathtaking ocean views.\nSimone and her sister Nicky have expanded their fashion empire to the US, having recently sealed an investment deal with growth equity firm General Atlantic.\nThe fashionista sisters currently have showrooms in Sydney, London, New York and Los Angeles.\nPrices on their website range from AU$4950 for a dress, to $700 for a skirt and $295 for a sweater.\nThe North Bondi property was previously owned by another fashion designer Elli Bobrovizki​, former owner of Hound Dog clothing.","url":"https://www.dailymail.co.uk/femail/article-4299684/5-5-million-home-bought-designer-Simone-Zimmerman.html"}
