{"authors":["Greg Styles For Daily Mail Australia"],"date_download":"2018-10-22 21:28:28","date_modify":"2018-10-22 21:28:28","date_publish":"2017-03-16 01:17:41","description":"Simon was taking part in the Benchmark Challenge on The Biggest Loser: Transformed when it all became too much. After completing a gruelling set of burpees, he vomited into a drain.","filename":"data/vaneerConsumption/SimonvomitsonTheBiggestLoserTransformed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4FFCEB00000578-0-image-a-91_1489626541000.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318482_Simon-vomits-drain-Biggest-Loser-Transformed_1540243708.html","title":"Simon vomits on The Biggest Loser: Transformed","title_page":"Simon vomits on The Biggest Loser: Transformed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Simon pushed himself to his limits on Wednesday night's episode of The Biggest Loser: Transformed.\nThe 34-year-old, who weighs in at 108kg, was taking part in the Benchmark Challenge when it all became too much.\nAfter completing a gruelling set of burpees, the marketing manager was seen on all fours as he vomited into a drain.\nScroll down for video\nSick to his stomach: Simon pushed himself to his limits on Wednesday night's episode of The Biggest Loser: Transformed\nA determined Simon explained he wasn't going to give up, despite the fact that personal trainer Libby Babet 'absolutely caned me'.\n'That was definitely not my finest hour. That was a great session to prove how much work I need,' he reflected.\nWhile Simon appreciates the training from Libby and Shannan Ponton, fans on social media weren't convinced that seeing the married father of two throwing up was a good sign.\nGet it all out: After completing a gruelling set of burpees, the marketing manager was seen on all fours as he vomited into a drain\n'That was definitely not my finest hour. That was a great session to prove how much work I need,' he reflected\nDon't stop till you drop: The 34-year-old, who weighs in at 108kg, was taking part in the Benchmark Challenge when it all became too much\nOne commented: 'Exercising until you vomit isn't what it 'takes to be transformed'. A healthy diet and regular, normal exercise is.'\nSimon's spew followed further physical drama on the revamped show.\nLynton was left temporarily paralysed after waking up with shooting pains in his arms and was unable to lift himself from bed.\nThe 27-year-old blamed a 3.5km kayak across Sydney Harbour in the opening challenge of the series, which was shown on the programme's debut on Tuesday.\nBed bound: Lynton was left paralysed after waking up with shooting pains in his arms and was unable to lift himself from bed\nPillow talk: The 27-year-old blamed a 3.5km kayak across Sydney Harbour in the opening challenge of the series, which was shown on the programme's debut on Tuesday\nFlop: Tuesday night premiere failed to make the top ten most-watched programs of the day, placing 17th and only narrowly beating a repeat of NCIS\nHe said: 'I haven't done anything this active before, never been to a gym. And I've just kayaked across Sydney Harbour!'\nThe 11th season of the weight loss show has received a low-key reception, with viewers' disdain at the new format reflected in the ratings.\nTuesday night premiere failed to make the top ten most-watched programs of the day, placing 17th and only narrowly beating a repeat of NCIS.\nA measly 450,000 viewers tuned in to watch the show as fans took to social media to slam the show for being too much like cooking shows My Kitchen Rules and MasterChef.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318482/Simon-vomits-drain-Biggest-Loser-Transformed.html"}
