{"authors":["Leith Huffadine","Lucy Thackray For Daily Mail Australia"],"date_download":"2018-10-22 22:28:03","date_modify":"2018-10-22 22:28:03","date_publish":"2016-01-29 09:33:09","description":"Sydney man Simon Gittany (pictured), who threw his fiancee Lisa Harnum to her death from a 15th floor apartment balcony in 2011, is appealing against his conviction for her killing.","filename":"data/vaneerConsumption/SimonGittanyisappealinghisconvictionforkillingLisaHarnum.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B09F3B00000578-0-image-a-35_1454057124438.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422330_Balcony-killer-Simon-Gittany-appealing-conviction-murdering-fiancee-Lisa-Harnum-2011_1540247283.html","title":"Simon Gittany 'is appealing his conviction' for killing Lisa Harnum","title_page":"Simon Gittany 'is appealing his conviction' for killing Lisa Harnum | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Murderer Simon Gittany, who was convicted of throwing his fiancee to her death from a 15th floor apartment balcony, is appealing against his conviction for killing her.\nNext week, less than two years into an 26-year sentence for Lisa Harnum's 2011 death, the Sydney man's appeal is to have its first mention in court,The Daily Telegraph reported.\nAlthough it is set to be mentioned in the Criminal Court of Appeal next Thursday, a hearing is expected to be set for later in 2016, it was reported.\nScroll down for video\nSimon Gittany, 42, is serving a 26-year sentence for the murder of his fiancee, 30-year-old Lisa Harnum, in 2011\nMs Harnum had been planning to leave Gittany, and when he found out he flew into a rage and killed her\nCCTV footage showing the chilling moment Gittany dragged Ms Harnum from an elevator in the apartment building she was thrown from\nMs Harnum was thrown from the 15th floor of this inner city Sydney apartment in July 2011\nHe also received legal aid funding for his appeal, which he has been given extensions in order to lodge.\nGittany, 42, was found guilty of throwing Ms Harnum, 30, from the balcony of his inner city apartment in a fit of rage on July 30, 2011.\nHowever, he claimed he had been attempting to save her from committing suicide.\nMs Harnum had reportedly been planning to leave him and return to her home country of Canada.\nMs Harnum had booked flights home to her home counry, Canada, and packed her bags when Gittany found out and killed her\nThis is a view from the apartment which Ms Harnum was thrown from by Gittany\nGittany found Ms Harnum had packed her bags and made enraged threats, according to Judge Lucy McCallum.\n'I have no hesitation accepting evidence of…rage,' said Judge McCallum.\n69 seconds before Ms Harnum toppled to her death she ran to the lift, trying to flee.\nCCTV footage in the lift captured the distressing moment Gittany dragged his fiancee out of the lift by her neck.\nThe horrific images show him pulling Ms Harnum back into the apartment with his hand clamped over her mouth.\nResidents in the building told the court that they heard Ms Harnum banging on on a neighbour's door, shouting: 'Please help me, help me, God help me.'\nThe court accepted the prosecution's version of events, in which they alleged that Gittany rendered Ms Harnum unconscious in the apartment after dragging her in from the lift. He then threw her off the balcony to her death.\nGittany claimed he had been attempting to stop Ms Harnum from committing suicide, but she fell to her death\nGittany pleaded not guilty to murdering Ms Harnum, claiming he was trying to save her from suicide.\nHe had told the court he had tried to grab her when she climbed onto the balcony but had failed to stop her falling.\nThe judge did not believe Gittany's account of how Ms Harnum fell to her death, ruling that she 'found him unconvincing'.\nShe said Ms Harnum could not have behaved in the way Gittany said she had - clambering onto the balcony - without leaving fingerprints.\nShe said it was likely that Ms Harnum was rendered unconscious before she plunged to her death.\nLast year, Gittany's girlfriend, who stood by his side during his trial, announced she had left him due to the strains of being in a relationship with someone in prison, according to The Daily Telegraph.","url":"https://www.dailymail.co.uk/news/article-3422330/Balcony-killer-Simon-Gittany-appealing-conviction-murdering-fiancee-Lisa-Harnum-2011.html"}
