{"authors":["Amanda Williams For Mailonline"],"date_download":"2018-10-23 00:24:20","date_modify":"2018-10-23 00:24:20","date_publish":"2016-01-11 09:41:32","description":"A report by the Oxford Research Group's Remote Control Project lists a range of British targets including nuclear power stations, a G7 summit or the prime minister's car.","filename":"data/vaneerConsumption/Simpleandaffordabledronescouldbeturnedintoflyingbombs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006EFEE00000578-0-image-a-13_1452505288874.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393592_Simple-affordable-drones-turned-flying-bombs-target-nuclear-power-stations-prime-minister-s-car-lone-wolf-attacks-security-experts-warn_1540254260.html","title":"‘Simple and affordable’ drones could be turned into flying bombs","title_page":"‘Simple and affordable’ drones could be turned into flying bombs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISIS is 'obsessed' with using drones to 'recreate horror of 9/11' it adds\nReport warns terrorists are already using commercially available drones\nSimple and affordable drones readily available on the high street could be turned into flying bombs by lone wolf ISIS terrorists, security experts have warned.\nA report by the Oxford Research Group's Remote Control Project lists a range of British targets which could be struck by the toy drones - including nuclear power stations, a G7 summit or the prime minister's car.\nThe think-tank warns that terrorists and activists are already using the commercially available devices - which can cost as little as £100 - with the technology of remote control warfare 'impossible to control'.\nLast year defence chiefs spoke of their concerns that ISIS was planning to use drones packed with explosives to attack crowds at major events like football matches and music festivals in order to kill scores of people.\nSimple and affordable drones readily available on the high street could be turned into flying bombs by lone wolf ISIS terrorists, security experts have warned\nIn April 2015, an anti-nuclear activist landed a drone containing radioactive sand on the Japanese prime minister’s office\nRemote-controlled drones, which are becoming an increasingly popular presents for children, are available for as little as £100.\nLast Christmas stores in the UK reported a 24 per cent increase in sales of drones.\nThe report, The Hostile Use of Drones by Non-State Actors Against British Targets, claims that drones could 'be used as simple, affordable and effective airborne improvised explosive devices'.\nThe authors note: 'Islamic State [Isis] is reportedly obsessed with launching a synchronised multi-drone attack on large numbers of people in order to recreate the horrors of 9/11.'\nIt highlights that the terror group is already using drones for reconnaissance in Iraq and Syria and pulls out examples of the use of drones over the past two years that 'suggest scenarios for future lone wolf attacks', The Guardian reports.\nIn April 2015, an anti-nuclear activist landed a drone containing radioactive sand on the Japanese prime minister’s office, and in 2014 a football match was dramatically abandoned after a Serbian player ripped down an Albanian flag that was flown over the pitch on a drone, sparking a huge brawl.\nIn 2014 a football match was dramatically abandoned after a Serbian player ripped down an Albanian flag that was flown over the pitch on a drone, sparking a huge brawl\nIn 2013, Lebanese militant group Hezbollah violated Israeli airspace with unmanned drones\nThe politically-charged Euro 2016 qualifier was halted after defender Stefan Mitrovic pulled down the flag - leading to fights between players and officials and havoc in the Partizan Stadium’s stands.\nEuropean football governing body Uefa banned Albania fans from attending the clash in Belgrade but elected to allow the two countries to face each other, despite long-standing political tensions.\nAnd in 2013, Lebanese militant group Hezbollah violated Israeli airspace with unmanned drones.\nReport authors recommend measures sung as licensing drones, and legislation which will allow police and army to shoot down hostile drones.\nThe study analysed more than 200 drones available to buy on the high street or on the internet.\nChris Abbott, the lead author of the report and visiting research fellow at Bradford University's School of Social and International Studies, said: 'The use of drones for surveillance and attack is no longer the purview of state militaries alone. A range of terrorist, insurgent, criminal, corporate and activist groups have already shown their desire and ability to use drones against British targets.'","url":"https://www.dailymail.co.uk/news/article-3393592/Simple-affordable-drones-turned-flying-bombs-target-nuclear-power-stations-prime-minister-s-car-lone-wolf-attacks-security-experts-warn.html"}
