{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:05:09","date_modify":"2018-10-30 19:05:09","date_publish":"2016-07-18 14:50:37","description":"Even though all refugees are encouraged to participate in an initial domestic medical screening that does include HIV testing within 90 days of entering the country, no one knows how many HIV positive refugees have arrived in the United States in the subsequent six and a half years, since participation in these screenings is voluntary and a significant percentage of refugees simply choose not to be screened. | Politics","filename":"data/vaneerConsumption/Since2010RefugeesHaveNotBeenScreenedforHIVPriortoArrivalinUS.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-452489021.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_18__1540926309.html","title":"Since 2010, Refugees Have Not Been Screened for HIV Prior to Arrival in US","title_page":"Since 2010, Refugees Have Not Been Screened for HIV Prior to Arrival in US | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"None of the estimated 400,000 refugees who have entered the United States since 2010 were screened for the Human Immunodeficiency Virus (HIV) in their overseas medical screenings, thanks to a change in federal regulations made by the Obama administration that year.\nEven though all refugees are encouraged to participate in an initial domestic medical screening that does include HIV testing within 90 days of entering the country, no one knows how many HIV positive refugees have arrived in the United States in the subsequent six and a half years, since participation in these screenings is voluntary and a significant percentage of refugees simply choose not to be screened.\nThe number of HIV positive refugees who have entered the country since 2010 may be at least 2,000, or approximately 350 per year, and is probably significantly higher.\nNo one knows exactly how much state and federal taxpayers are paying to treat HIV positive refugees.\nHIV is not an infectious disease such as tuberculosis or measles, and is transmitted primarily through unprotected sex or intravenous drug use. In some cases it has been transmitted through blood transfusions.\nThe Obama administration dropped screening for HIV as part of the required overseas medical screening program for all foreign visitors, from tourists to legal immigrants — including those arriving as legal permanent residents, those on temporary student visas, and refugees.\nBefore that rule change, refugees diagnosed with HIV during their overseas medical screenings were categorized as Class A medical risks were deemed “inadmissable” and not allowed to enter the United States, with one notable loophole. HIV positive refugees could apply for a medical waiver from the Department of Homeland Security’s U.S. Citizenship and Immigration Services agency (USCIS).\nAccording to a Centers for Disease Control (CDC) report, a total of 186 HIV positive refugees were admitted to the United States in 2009.","url":"https://www.breitbart.com/politics/2016/07/18/hold-refugees-not-screened-hiv-since-2010/"}
