{"authors":["Phoebe Weston For Mailonline"],"date_download":"2018-10-23 01:10:36","date_modify":"2018-10-23 01:10:36","date_publish":"2017-03-16 10:53:32","description":"Ray Kurzweil a futurist who works on Google's machine learning project predicted that singularity would happen in the next twelve years at the SXSW conference in Austin, Texas .","filename":"data/vaneerConsumption/SingularitywillcreatesuperhumansGoogleexpertclaims.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E566FEF00000578-0-image-a-9_1489682627171.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4319436_Singularity-create-super-humans-Google-expert-claims_1540257036.html","title":"Singularity will create super humans, Google expert claims","title_page":"Singularity will create super humans, Google expert claims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Technological singularity will turn us into super humans some time in the next 12 years, according to a Google expert.\nThis might sound like science fiction, but Google's Director of Engineering, Ray Kurzweil, has made 147 predictions since the 1990s and has a success rate of 86 per cent.\nKurzweil says when we live in a cybernetic society we will have computers in our brains and machines will be smarter than human beings.\nHe claims this is already happening with technology - especially with our addiction to our phones - and says the next step is to wire this technology into our brains.\nScroll down for video\nTechnological singularity will turn us into super humans some time in the next 12 years, according to a Google expert. Ray Kurzweil says future cyborg generations will be sexier, smarter and stronger\nWHAT IS SINGULARITY Technological singularity is the development of 'superintelligence' brought about through the use of technology. The first use of the term 'singularity' refer to technological minds was by mathematician John von Neumann in the mid-1950s. He said: 'ever accelerating progress of technology and changes in the mode of human life, which gives the appearance of approaching some essential singularity in the history of the race beyond which human affairs, as we know them, could not continue.' The term was then used by science fiction writer Vernor Vinge who believes brain-computer interfaces are causes of the singularity. Ray Kurzweil cited von Neumann's use of the term in a foreword to von Neumann's classic The Computer and the Brain. Kurzweil predicts the singularity to occur some time in the next 12 years.\nKurzweil, an author who describes himself as a futurist and works on Google's machine learning project, predicted that technological singularity would happen by 2029 at the South by Southwest (SXSW) conference in Austin, Texas.\nSingularity is when carbon and silicon-based intelligence will merge to form a single global consciousness.\n'By 2029, computers will have human-level intelligence,' Kurzweil said in the interview with SXSW.\n'That leads to computers having human intelligence, our putting them inside our brains, connecting them to the cloud, expanding who we are.\n'Today, that's not just a future scenario,' Kurzweil said. 'It's here, in part, and it's going to accelerate', he said.\nKurzweil said that machines are already making us smarter and by connecting these machines to our neocortex they will help people think more smartly.\nHowever, Kurzweil said he wasn't concerned about the threat that intelligent robots might pose to humanity, according to Futurism.com.\nTo the contrary - he believes that implanting computers in our brains will improve us.\n'We're going to get more neocortex, we're going to be funnier, we're going to be better at music. We're going to be sexier', he said.\n'We're really going to exemplify all the things that we value in humans to a greater degree.'\nRather than a vision of the future where machines take over humanity, Kurzweil believes we will create a human-machine synthesis which will improve us.\nRay Kurzweil, an author who describes himself as a futurist said that by 2029, computers will have human-level intelligence at the the South by Southwest (SXSW) conference in Austin, Texas (stock image)\nMACHINE BRAINS The process began centuries ago with simple devices such as eyeglasses and ear trumpets that could dramatically improve human lives. Then came better machines, such as hearing aids; and then machines that could save lives, including pacemakers and dialysis machines. By the second decade of the 21st Century, we have become used to organs grown in laboratories, genetic surgery and designer babies. In 2002, medical researchers used enzymes and DNA to build the first molecular computers, and in 2004 improved versions were being injected into people’s veins to fight cancer. If the trend continues Kurzweil believes carbon and silicon-based intelligence will merge to form a single global consciousness by 2029.\nThe concept of nanomachines being inserted into the human body has been around in science fiction for decades.\nIn Star Trek tiny molecular robots called nanites were used to help repair damaged cells in the body.\nMore than ten years ago, the US National Science Foundation predicted ‘network-enhanced telepathy’ – sending thoughts over the internet – would be practical by the 2020s.\n'Ultimately, it will affect everything,' Kurzweil said.\n'We're going to be able to meet the physical needs of all humans. We're going to expand our minds and exemplify these artistic qualities that we value.'\nThe process began centuries ago with simple devices such as eyeglasses and ear trumpets that could dramatically improve human lives.\nThen came better machines, such as hearing aids; and then machines that could save lives, including pacemakers and dialysis machines.\nBy the second decade of the 21st Century, we have become used to organs grown in laboratories, genetic surgery and designer babies.\nScience fact? Harnessing the power of the mind was a favourite of science fiction, including Star Trek's Vulcan mind meld\nIn 2002, medical researchers used enzymes and DNA to build the first molecular computers, and in 2004 improved versions were being injected into people’s veins to fight cancer.\nThe first use of the term 'singularity' refer to technological minds was by mathematician John von Neumann in the mid-1950s.\nHe said: 'ever accelerating progress of technology and changes in the mode of human life, which gives the appearance of approaching some essential singularity in the history of the race beyond which human affairs, as we know them, could not continue.'\nThe term was then used by science fiction writer Vernor Vinge who believes brain-computer interfaces are causes of the singularity.\nRay Kurzweil cited von Neumann's use of the term in a foreword to von Neumann's classic The Computer and the Brain.","url":"https://www.dailymail.co.uk/sciencetech/article-4319436/Singularity-create-super-humans-Google-expert-claims.html"}
