{"authors":[],"date_download":"2018-10-23 04:14:41","date_modify":"2018-10-23 04:14:41","date_publish":"2017-03-16 15:28:14","description":"The singer Anohni is offering a missing song from her upcoming work for free -- to anyone who sends her a heartfelt email about hopes for the future.\"The...","filename":"data/vaneerConsumption/SingerAnohniofferssonginexchangeforfanemails.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229207-1489678096-484_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320704_Singer-Anohni-offers-song-exchange-fan-emails_1540268081.html","title":"Singer Anohni offers song in exchange for fan emails","title_page":"Singer Anohni offers song in exchange for fan emails | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Singer Anohni, pictured performing in 2016, has won critical acclaim and a devoted fan base through soul-baring lyrics sung in her plaintive but mellifluous voice\nThe singer Anohni is offering a missing song from her upcoming work for free -- to anyone who sends her a heartfelt email about hopes for the future.\n\"The price for this song is a gesture of anonymous vulnerability. That may be too expensive for some of you, and that's okay,\" she wrote on Facebook.\nAnohni has won critical acclaim and a devoted fan base through soul-baring lyrics sung in her plaintive but mellifluous voice, often over lush orchestration with her band Antony and the Johnsons.\nThe British-born, US-raised transgender singer, who was earlier known as Antony Hegarty, announced a seven-song EP to come out Friday called \"Paradise.\"\nShe said six songs will be available for traditional purchase but that the seventh, \"I Never Stopped Loving You,\" would only go to people who send her a personal email.\n\"Share with me in a sentence or two what you care most about, or your hopes for the future,\" she wrote.\n\"Send this to me instead of the dollar you used to send me in the olden days,\" she said.\nHer focus on hope is especially striking as her first solo album, released last year, was entitled \"Hopelessness.\"\nThe album, nominated for Britain's Mercury Prize, marked a sharp stylistic shift as Anohni turned to synth pop but crafted it as protest music.\nOn \"Hopelessness,\" Anohni deplored civilian deaths from US drone attacks, the persistence of capital punishment in the United States and global inaction on climate change.","url":"https://www.dailymail.co.uk/wires/afp/article-4320704/Singer-Anohni-offers-song-exchange-fan-emails.html"}
