{"authors":["Associated Press"],"date_download":"2018-10-22 22:12:09","date_modify":"2018-10-22 22:12:09","date_publish":"2016-01-29 09:11:02","description":"SINGAPORE (AP) — A Singapore court on Friday fined a shipping company nearly $127,000 for wiring money used to transport fighter jets and surface-to-air miss...","filename":"data/vaneerConsumption/SingaporefirmfinedforaidingNKoreanarmsshipment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:074c0772cc95458f8e0ae402c57c436b-4PuZeKVXE7cd9005b2c8767938e6-379_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422363_Singapore-firm-fined-aiding-N-Korean-arms-shipment_1540246329.html","title":"Singapore firm fined for aiding N. Korean arms shipment","title_page":"Singapore firm fined for aiding N. Korean arms shipment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Singapore firm fined for aiding N. Korean arms shipment\nSINGAPORE (AP) — A Singapore court on Friday fined a shipping company nearly $127,000 for wiring money used to transport fighter jets and surface-to-air missile systems from Cuba to North Korea in 2013 in violation of bans on helping Pyongyang build up its weapons programs.\nThe haul, hidden under heaps of sugar and discovered by Panamanian authorities, was the biggest load of arms and related materials ever to be intercepted on its way to or from the isolated North.\nThe State Court found that Singapore-registered Chinpo Shipping Company had transferred tens of thousands of dollars for the shipment without conducting due diligence.\nTan Cheng Hoe, director of a Singapore-registered shipping company, Chinpo, arrives at the State Court on Friday, Jan. 29, 2016, in Singapore. Chinpo was ordered by the State Court to pay close to $127,000 in fines for wiring money used to transport fighter jets and surface-to-air missile systems from Cuba to North Korea in 2013. The haul, hidden under heaps of sugar and discovered by Panamanian authorities, was the biggest load of arms and related materials ever to be intercepted on its way to or from the isolated North. (AP Photo/Wong Maye-E)\nThe company had been found guilty last month of contributing to the nuclear-related programs or activities of North Korea and of running a remittance business without a valid license for more than four years.\nIn delivering the sentence, District Judge Jasvender Kaur said the fine had to act as general deterrence due to \"strong public interest in preventing any breaches of United Nations sanctions.\n\"It conducted no due diligence. Such irresponsible actions must be deterred,\" the judge said.\nChinpo had wired $72,017 from its Bank of China account to a Panama-based shipping agent in July 2013 for the return passage of the MV Chong Chon Gang through the Panama Canal.\nThe MV Chong Chon Gang was managed by the North Korean company Ocean Maritime Management, a longtime client of Chinpo.\nThat month, Panamanian authorities found the ship loaded with arms and related materials weighing 474 tons, including two MiG-21 fighter jets, anti-tank rockets and SA-2 and SA-3 Russian surface-to-air missile systems. The military equipment was hidden under 10,500 tons of sugar in the cargo hold.\nChinpo had applied for a total of 605 outward remittances totaling $40 million from 2009 to 2013 on behalf of North Korean entities.\nChinpo director Tan Cheng Hoe, who also heads associated companies Tonghee Shipping Agency and Great Best Trading, said in court after the sentence: \"We were wrongly accused.\"\nWhen The Associated Press visited Chinpo's listed address last month, another company said it has occupied the premises for more than a year.\nChinpo violated a law based on U.N. sanctions that prohibits the provision of financial services, assets or resources to North Korea that \"may be reasonably be used to contribute to the nuclear-related, ballistic missile-related, or other weapons of mass destruction-related programs or activities.\"\nThe maximum sentence is a fine of 100,000 Singapore dollars ($70,356) and five years in jail. The licensing law has a maximum penalty of a fine up to 100,000 Singapore dollars ($70,356).\nChinpo was fined 80,000 Singapore dollars ($56,285) for the first charge, and 100,000 Singapore dollars ($70,356) for the second. It must pay by Feb 12.\nDefense lawyer Edmond Pereira, who had argued that the company's remittances were contingent to its role as Ocean Maritime Management's general and special agent, said it was too early to comment if his client would file an appeal.","url":"https://www.dailymail.co.uk/wires/ap/article-3422363/Singapore-firm-fined-aiding-N-Korean-arms-shipment.html"}
