{"authors":[],"date_download":"2018-10-22 20:54:24","date_modify":"2018-10-22 20:54:24","date_publish":"2014-05-04 18:59:12","description":"Northern Ireland police released Sinn Fein leader Gerry Adams after days of questioning over his role in a 1972 murder that has rocked the province.","filename":"data/vaneerConsumption/SinnFeinLeaderGerryAdamsReleasedbyPoliceProbingMurder.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/419286/140504-gerry-adams-1508_e078a4b2e0363a61d050b4b844aa7034.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_sinn-fein-leader-gerry-adams-released-police-probing-murder-n96761_1540241664.html","title":"Sinn Fein Leader Gerry Adams Released by Police Probing Murder","title_page":"Sinn Fein Leader Gerry Adams Released by Police Probing Murder","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNorthern Ireland police released Sinn Fein leader Gerry Adams on Sunday and sent a file to the public prosecutor after four days of questioning over his role in a 1972 murder in a case that has rocked the British province.\nPolice arrested Adams on Wednesday over the abduction and murder of Jean McConville, a killing he said he was \"innocent of any part\" in. His detention has raised tensions among Northern Ireland's power-sharing government and its fragile peace.\n\"A 65-year-old man arrested by detectives investigating the abduction and murder of Jean McConville in 1972 on Wednesday 30th April has been released pending a report to the PPS (Public Prosecution Service),\" police said in a statement.\nAdams' arrest over the killing of McConville is among the most significant in Northern Ireland since a 1998 peace deal ended decades of tit-for-tat killings between Irish Catholic nationalists and mostly Protestant pro-British loyalists.\nThe Sinn Fein leader, who is a member of parliament in the Irish republic, has been dogged throughout his career by accusations from former IRA fighters that he was involved in its campaign of killings, a charge he has repeatedly denied.\nNorthern Ireland's Director of Public Prosecutions will now review the police report. The head of the prosecution service, Barra McGrory, is a former solicitor for Adams, a spokesperson for the PPS was quoted as telling Irish media last year.\nThe PPS was not immediately available to comment. Under the 1998 Good Friday agreement, which drew a line under 30 years of sectarian strife in the British province, those convicted of paramilitary murders during the conflict would have life sentences reduced to two years.\n— Reuters","url":"https://www.nbcnews.com/news/world/sinn-fein-leader-gerry-adams-released-police-probing-murder-n96761"}
