{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-22 21:40:02","date_modify":"2018-10-22 21:40:02","date_publish":"2017-03-16 01:46:23","description":"The veteran actor, 76, made the admission as he threw his support behind a UK-first research initiative by Oxford University which aims to explore the benefits of cannabis-based medicines.","filename":"data/vaneerConsumption/SirPatrickStewartrevealsheusesmarijuanaeveryday.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E503D5B00000578-0-image-a-244_1489628778796.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318616_Patrick-Stewart-reveals-uses-marijuana-day_1540244402.html","title":"Sir Patrick Stewart reveals he uses marijuana every day","title_page":"Sir Patrick Stewart reveals he uses marijuana every day | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Patrick Stewart has revealed that he uses medical marijuana daily to help him deal with the symptoms of his arthritis.\nThe veteran actor, 76, made the admission as he threw his support behind a UK-first research initiative by Oxford University which aims to explore the benefits of cannabis-based medicines.\nIn a powerful statement, the X Men star explained that he uses an ointment, spray and edible marijuana medicine to help him with his condition.\nAdvocate: Sir Patrick Stewart, 76, has revealed that he uses medical marijuana daily to help him deal with the symptoms of his arthritis and has thrown his support into UK-based research into cannabis-based medicine\nHe explained: 'Two years ago, in Los Angeles, I was examined by a doctor and given a note which gave me legal permission to purchase, from a registered outlet, cannabis-based products, which I was advised might help the ortho-arthritis in both my hands.\n'This, it would seem, is a genetically-based condition. My mother had badly distorted and painful hands.\n'I purchased an ointment, spray and edibles. The ointment, while providing some relief from the discomfort, was too greasy to use during daytime and so I only use it at night.\n'It helps with sleep as the pain was reduced. The spray, however, is much more usable and I spray my fingers and particularly my thumb joints several times a day.'\nCandid: In a powerful statement, the X Men star explained that he uses an ointment, spray and edible marijuana medicine to help him with his condition\nWHERE MARIJUANA IS LEGAL IN AMERICA Twenty-eight states and the District of Columbia have legalized marijuana for a variety of medical uses. Eight of those states, plus the nation's capital, have also legalized the drug for recreational use. Those states are: Colorado, California, Oregon, Washington, Maine, Nevada, Alaska and Massachusetts. It means almost one quarter of Americans (more than 20 percent) now have access to recreational marijuana, and more than 60 percent to the medical variety. But experts - including the White House Surgeon General Dr Vivek Gupta - have warned legalization is moving faster than research.\nDescribing the process, Sir Patrick detailed: 'The spray very quickly evaporates and leaves my hands quite dry, though with a slight burning or tingling sensation, which is not unpleasant.\n'I believe that the ointment and spray have significantly reduced the stiffness and pain in my hands.\n'I can make fists, which was not the case before I began this treatment.\"\n'I have had no negative side effects from this treatment and the alternative would have been to continue taking NSAID's, Advil, Aleve and Naproxen, which are known to be harsh on the liver and to cause acid reflux.\n'This is an important step forward for Britain in a field of research that has for too long been held back by prejudice, fear and ignorance. I believe this programme of research might result in benefits for people like myself as well as millions of others.'\nHow it began: He explained: 'Two years ago, in Los Angeles, I was examined by a doctor and given a note which gave me legal permission to purchase, from a registered outlet, cannabis-based products'\nWhilst Sir Patrick was keen to promote the development of British medicine, he recently revealed that he is applying for US citizenship so he can 'fight and oppose' Donald Trump.\nThe Star Trek actor said that getting an American passport 'might be the only good thing as the result of this election'.\nThe legendary thespian - who was born in West Yorkshire but lives in Brooklyn - added that he and his wife went to Washington last month to visit friends and ask them what they could do about the President.\nSpeaking out: Patrick said 'This is an important step forward for Britain in a field of research that has for too long been held back by prejudice, fear and ignorance'\nSpeaking on Thursday's episode of The View, he explained: 'I want to be an American, too.\n'All of my friends in Washington said: \"There is one thing you can do. Fight, fight; oppose, oppose.\" But I can't do it because I'm not a citizen.'\nSir Patrick, who lives in Brooklyn with his third wife Sunny, admitted that as a couple they had 'three separate dinners' with their 'Washington insider' friends to work out 'what we could do' about Trump.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318616/Patrick-Stewart-reveals-uses-marijuana-day.html"}
