{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 00:33:46","date_modify":"2018-10-23 00:33:46","date_publish":"2017-03-16 09:57:03","description":"Sir Philip and his wife Lady Tina took over the five-star Dorchester Hotel's China Tang restaurant last night.","filename":"data/vaneerConsumption/SirPhilipGreencelebrates65thatDorchesterHotel.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53456D00000578-0-image-a-44_1489658218355.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319266_Sir-Philip-Green-celebrates-65th-Dorchester-Hotel_1540254826.html","title":"Sir Philip Green celebrates 65th at Dorchester Hotel","title_page":"Sir Philip Green celebrates 65th at Dorchester Hotel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sir Philip Green has returned to London life after settling the BHS pension scandal with a 65th birthday bash - but most of his A-list celebrity friends were conspicuous by their absence.\nSir Philip and his wife Lady Tina took over the five-star Dorchester Hotel's China Tang restaurant last night.\nBut with the billionaire hitting pension age and promising to plug the blackhole in the BHS pension scheme with £363million of his own cash, perhaps he is tightening his belt.\nAt his £6million four-day Mexican party to mark his 60th in 2012, guests including Leonardo DiCaprio, Naomi Campbell and Kate Hudson danced on the beach to performances by Stevie Wonder and Robbie Williams while munching on Kobe beef burgers worth £50 each.\nBut this year Sir Philip, his wife Lady Tina and daughter Chloe partied with Kate Moss, Tess Daly and her husband Vernon, Jamie Redknapp and his wife Louise and Alesha Dixon and her boyfriend Azuka Ononye, who all enjoyed a Chinese meal with tricks performed by magician Dynamo.\nBHS staff have been upset by the 65th birthday bash with one former store manager saying pensioners are struggling to get by while Sir Philip is 'quaffing champagne in the Dorchester'.\nBack in business: Sir Philip Green (pictured in April) has returned to London life after settling the BHS pension scandal with a 65th birthday bash\nGuests: Sir Philip's old friend Kate Moss came to the party as did Jamie Redknapp and his wife Louise (both pictured last night)\nFriends: Alesha Dixon her boyfriend Azuka Ononye (pictured) also attended the event, as did Tess Daly and her husband Vernon Kay\nAll change: But A-listers who came to his £6million 60th, including Naomi Campbell, pictured with Sir Phiulip, daighter Chloe and Lady Tina Green, don't appear to have attended the pared-back event last night\nFellow billionaire Mike Ashley, who was rumoured to want to buy up BHS after its collapse, was also enjoying a Cantonese meal in the art deco-inspired Chinese restaurant.\nBut it was a far less lavish affair than his £6million 60th birthday bash in Mexico in 2012, which lasted four days and needed 155 staff flown in from London to serve guests.\nBut five years of on stars who joined him there, including Simon Cowell, Ronnie Wood, Leonardo DiCaprio, Kate Hudson, Naomi Campbell and Gwyneth Paltrow, did not come to his London bash.\nBut Kate Moss was there to help him mark his 65th birthday after a tumultuous 12 months for him.\nSir Philip had been the darling of British business thanks to his success with Topshop and Arcadia businesses, but his reputation was badly damaged by the BHS scandal.\nTwo weeks ago he agreed to cough up more than £360 million to plug the black hole in the collapsed retailer's pension scheme in a desperate bid to salvage his battered name.\nAfter months of stinging criticism, the billionaire finally came good on his promise to protect the retirement income of 19,000 ex-employees from the collapsed high street chain.\nBut despite having a much lower-key birthday bash this year, BHS pensioners have still been left deeply upset.\nCampaigner Lin Macmillan, 61, who called on Sir Philip to sell his two yachts to bail out pensioners, accused him of showing disrespect to victims.\nShe told the Daily Express: 'People who are still looking for jobs, the people who are still going to have to exist on a pension that is not going to have much of an inflationary increase are not going to be impressed by him quaffing the champagne in the Dorchester.\n'He has absolutely no conception of the difficulties people who used to work for BHS are experiencing. I think he has burnt his boats.'\nHaving fun: The party was full of glamorous guests but fewer stars than seen at his previous parties\nGuests: PR woman Jenny Halpern Prince was at the party with dozens of others who also brought gifts for the birthday boy, including close friend Daniel Pittack (right)\nChange of scene: Sir Philip decided to entertain guests at the Dorchester rather than hold a larger bash abroad\nFormer pensions minister Ros Altmann added: 'I hope he’s wishing his pension funds many happy returns.'\nThe 65-year-old transferred £363 million cash from his own personal wealth to the Pensions Regulator to meet the crippling shortfall. He also issued a humiliating apology as he sought to draw a line under the debacle that has left his reputation in ruins and his knighthood at risk.\nSources close to Sir Philip said he was desperate to be able to hold his head high again after the demise of BHS was branded ‘the unacceptable face of capitalism’ by MPs.\nThe deal means he and his wife, Lady (Tina) Green, will avoid a high-profile and potentially embarrassing investigation into their financial affairs. It is thought such a probe could even have seen family assets such as their £100 million super yacht seized by regulators.\nAnd although the agreement was widely welcomed, former BHS staff who have been in limbo since the chain collapsed in April last year still face a cut to their retirement income.\nSir Philip insisted the agreement would achieve ‘a significantly better outcome’ than if the scheme had entered the Pension Protection Fund (PPF). He said he hoped it would bring ‘this matter to a conclusion’ and apologised to the affected pensioners.\nThe £363 million payment is just over 10 per cent of the Green family’s fortune. It is made up of £343 million to fund the new scheme and £20 million to cover expenses and other costs associated with the deal – if required.\nSir Philip's birthday parties have been famous for their excesses.\nAt his 60th in Mexico every element was luxurious: Even the burgers were made with imported Japanese Kobe beef at a cost of £50 each.\nThe beaches were patrolled by armed guards, some on jetskis, to keep out riff-raff.\nAnd the four-day event, at an estimated cost of more than £6million, was all very much about the birthday boy and his celebrity guests were asked to wear clothes bearing the branding PG60 - his initials and birthday - all weekend.\nHis ‘brand’ was everywhere – on beach towels, bathrobes, even the bespoke Hawaiian shirts to be worn to a beach barbecue.\nEveryone had to wear the logo, including Simon Cowell, Ronnie Wood, Leonardo DiCaprio, actress Kate Hudson, Kate Moss and Naomi Campbell.\nFormer BHS manager Lin Macmillan, pictured on Sky News last year, said Sir Philip's party will further upset staff caught up in the crisis\nAs the scandal grew, Sir Philip spent a long summer break on his vast yacht Lionheart (pictured), sailing around the Med and responding angrily to questions about the BHS scandal\nAround 11,000 people lost their jobs when BHS collapsed last year. The final stores closed at the end of last summer (pictured the Slough branch in its final days of trading)\nSir Phil, assisted by his wife Tina, pushed the boat out to a recession-busting extent. Pictures of his smiling face were projected for hours upon end on to the rocks at the resort, 20ft high.\nHaving hired all of the Rosewood Mayakoba resort for four days, Sir Phil brought in 155 staff from London to make sure everything ran perfectly.\nHe also had a nightclub specially erected in the honour of Chloe, who turned 21 this month.\nPerformers at the festivities included Robbie Williams and Stevie Wonder. On the last day there was a ‘simple beach barbecue’ – with music from The Beach Boys.\nEntertainment alone will have cost well over £3million, presumably paid by Tina, who lives in the tax haven of Monaco. All her husband’s Arcadia group businesses are owned in her name and, as a Monaco resident, she can receive large dividends from them without paying a penny of tax.\nSir Phil’s friends said that the whole party was planned by Tina.","url":"https://www.dailymail.co.uk/news/article-4319266/Sir-Philip-Green-celebrates-65th-Dorchester-Hotel.html"}
