{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 02:40:04","date_modify":"2018-10-23 02:40:04","date_publish":"2017-03-16 13:16:09","description":"Sir Roger Gale insisted he and his wife offered constituents a 'Rolls Royce service' but trended on Twitter after making the reference to 'girls'.","filename":"data/vaneerConsumption/SirRogerGaleisaccusedofsexism.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/00544A371000044C-0-image-a-25_1489670112969.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320244_Veteran-Tory-Sir-Roger-Gale-accused-sexism_1540262404.html","title":"Sir Roger Gale is accused of sexism","title_page":"Sir Roger Gale is accused of sexism | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sir Roger Gale insisted he and his wife offered constituents a 'Rolls Royce service' but trended on Twitter after making the reference to 'girls'\nA veteran Tory MP has been accused of 'sexism' after referring to his staff as 'girls' while defending keeping his wife on the payroll.\nSir Roger Gale insisted he and his wife offered constituents a 'Rolls Royce service' but trended on Twitter after making the reference to 'girls'.\nThe Thanet North MP said his office was run by a 'team' and slammed a decision by the expenses regulator to ban the employment of family members in future.\nSir Roger told the BBC Radio 4 Today programme his wife worked up to 60 hours a week, often working weekends and starting work at 7am most mornings.\n'She is utterly dedicated to her job as indeed are the other girls in my office but they don't work in the same way and the same hours.'\n'I know if I am away on parliamentary business - and I am quite often away these days because I have to be because of my responsibilities not just in the United Kingdom but in Europe as well - Suzy will deal with all sorts of things. She knows what I think, she knows what I will say, she knows what I want done.\n'She will go and visit constituents if they are in distress, as indeed will the other girls, I have to say.'\nTwitter user Georgia Evans said she was 'highly irritated' by the MPs words.\nCharlie Snow said: 'Roger Gale employs \"girls\" at the taxpayers' expense. Can he not find any grown ups?'\nLisa Fleisher said: 'Whoa. On BBC Radio 4, MP Sir Roger Gale refers to the women who work in his constituency office as ''the girls.''\n'What is this, the 1960s?'\nTwitter user Georgia Evans said she was 'highly irritated' by the MPs words, which saw the Thanet North MP trend on Twitter\nLisa Fleisher said: 'Whoa. On BBC Radio 4, MP Sir Roger Gale refers to the women who work in his constituency office as ''the girls.''\nCharlie Snow said: 'Roger Gale employs \"girls\" at the taxpayers' expense. Can he not find any grown ups?'\nCecilia Farren branded the MP 'pompous' and said: 'Roger Gale's praise of his wife and his 'team of girls' did not do him favours and gave me a sore throat yelling.'\nKaren Wespieser said: '[Sir Roger Gale MP, I don't care if you employ your well qualified wife but calling your office staff 'girls' is downright offensive.'\nCecilia Farren branded the MP 'pompous' and said: 'Roger Gale's praise of his wife and his 'team of girls' did not do him favours and gave me a sore throat yelling.'\nKaren Wespieser said: '[Sir Roger Gale MP, I don't care if you employ your well qualified wife but calling your office staff 'girls' is downright offensive.'\nIPSA, the Independent Parliamentary Standards Authority, announced yesterday it would ban the recruitment of relatives from after the next election.\nThe new rules state that no new 'connected parties' can be taken on in politicians' offices.\nIPSA, the Independent Parliamentary Standards Authority, announced yesterday it would ban the recruitment of relatives by MPs from after the next election\nBut the Independent Parliamentary Standards Authority (Ipsa) said it will not force MPs to sack individuals who are currently working for them.\nThe move will cause fury among MPs who say that their relatives are willing to work much longer hours than they could ask of other staff.\nMany believe the practice helps them maintain a family life amid the long hours and pressures of Westminster.\nIt comes despite Ipsa previously having repeatedly refused calls - including from the Committee on Standards in Public Life - to change its long-standing support for MPs employing relatives.","url":"https://www.dailymail.co.uk/news/article-4320244/Veteran-Tory-Sir-Roger-Gale-accused-sexism.html"}
