{"authors":[],"date_download":"2018-10-30 20:35:29","date_modify":"2018-10-30 20:35:29","date_publish":"2014-05-23 17:00:56","description":"A woman whom Gwinnett police arrested in connection with a fatal hit-and-run in April was released from jail today.","filename":"data/vaneerConsumption/SistersswapplacesinGwinnettjailfollowinghitandrun.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/22/Images/photos.medleyphoto.5283919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_sisters-swap-places-gwinnett-jail-following-hit-and-run__1540931729.html","title":"Sisters swap places in Gwinnett jail, following hit-and-run","title_page":"Sisters swap places in Gwinnett jail, following hit-and-run","title_rss":"NULL","source_domain":"ajc.com","text":"A woman whom Gwinnett police arrested in connection with a fatal hit-and-run in April was released from jail today. But her sister now sits in the same jail, facing the same charges.\nRuth Escobar, 50, had been charged in the incident that killed an 85-year-old Norcross man on April 13, but prosecutors dropped the charges against her after her sister, Esther Escobar, 46, claimed responsibility for the incident.\nRuth Escobar was released from the Gwinnett County jail today, while her sister remained jailed, after posting a bond, because of an immigration hold, according to Channel 2 Action News. Esther Escobar had her first appearance, today.\nEsther Escobar testified in a hearing on April 24 that she was the driver of a vehicle that struck and killed Kanaiyalal P. Patel.\nA witness saw the driver of a maroon 1999 Ford F-150 pickup truck hit Patel as he was walking across Kings Ridge Drive at the intersection with Singleton Road, police previously said. The witness followed the driver to Oakbrook Pointe Apartments in Norcross and helped officers locate a suspect, and Ruth Escobar was arrested.\nAfter further investigation by police, Esther Escobar was determined to be the driver and she was arrested Wednesday on charges of first-degree vehicular homicide, felony hit-and-run, driving without a valid license, failure to stop at a stop sign, and an equipment violation for the vehicle’s tires not having enough tread, police said.","url":"https://www.ajc.com/news/sisters-swap-places-gwinnett-jail-following-hit-and-run/VAVmD03QK1SoSKSeNvNKZO/"}
