{"authors":["Krishnadev Calamur"],"date_download":"2018-10-23 05:50:24","date_modify":"2018-10-23 05:50:24","date_publish":"2015-05-04 00:00:00","description":"The site, carlyfiorina.org, says the Republican presidential candidate laid off 30,000 people while she ran Hewlett-Packard. Fiorina does not deny the figure but says, overall, the firm created jobs.","filename":"data/vaneerConsumption/SiteUsingCandidateCarlyFiorinasNameAttacksHerRecordAtHP.json","image_url":"https://media.npr.org/assets/img/2015/05/04/site_wide-367af8ca3a32c0098e5269a42b361bfd534aad7a.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_05_04_404278011_fiorina-doesnt-register-dot-org-domain-site-attacks-her-record-at-hp_1540273824.html","title":"Site Using Candidate Carly Fiorina's Name Attacks Her Record At HP","title_page":"Site Using Candidate Carly Fiorina's Name Attacks Her Record At HP : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Site Using Candidate Carly Fiorina's Name Attacks Her Record At HP\nJust hours after the Republican Carly Fiorina announced her presidential run, she was criticized on a website bearing her name, for causing the loss of 30,000 jobs while serving as the CEO of Hewlett-Packard.\nAs Wired first reported, Fiorina appears not to have registered her dot-org domain name. However, she does have carlyfiorina.com registered. The dot-org page, carlyfiorina.org, has this message: \"Carly Fiorina failed to register this domain. So I'm using it to tell you how many people she laid off at Hewlett-Packard.\" The site then displays several arrays of frowny faces. It continues:\n\"That's 30,000 people she laid off. People with families.\"\nThat number has been a subject of discussion for years. Fiorina, who ran HP for about six years from 1999, oversaw the company's merger in 2002 with PC-maker Compaq. She was fired by the board in 2005.\nShe has made her business experience a centerpiece of her campaign — something that was also true when she ran for Senate in 2010 against incumbent California Democrat Barbara Boxer.\nAs NPR's Ina Jaffe reported during that campaign: \"Boxer loves it when Fiorina brings up jobs going overseas. Each time, it gives her another opportunity to remind voters that as CEO of Hewlett-Packard, Fiorina laid off tens of thousands of American workers before she herself was fired.\"\n\"She shipped 30,000 jobs overseas,\" Boxer said at the time. \"And through all that pain, what did she do to show any sacrifice? She took $100 million. That's what happened on Wall Street.\"\nFiorina herself has never disputed the number. In fact, she told InformationWeek in 2006 that HP's merger with Compaq resulted in the job cuts.\n\"In the course of my time there, we laid off over 30,000 people,\" she said. \"That's why I understand where the anger came from.\"\nBut Fiorina has also been quick to point out, as she did in a 2010 interview with NPR, that, overall, jobs were created during her tenure as HP's CEO.\n\"Companies go through tough times ... but net-net we created jobs,\" she said.\nPolitiFact, the political fact checking website run by the Tampa Bay Times, notes that \"some of those jobs may have resulted from acquisitions, and some may have been abroad.\"\nAs for HP, the company announced last year that it was dividing itself into two firms — one focused on technology infrastructure software and services and the other on printers and PCs.","url":"https://www.npr.org/sections/thetwo-way/2015/05/04/404278011/fiorina-doesnt-register-dot-org-domain-site-attacks-her-record-at-hp"}
