{"authors":[],"date_download":"2018-10-22 23:10:37","date_modify":"2018-10-22 23:10:37","date_publish":"2016-01-28 11:50:40","description":"An Indian court convicted six men Thursday of gang-raping and murdering a student as she walked home after an exam in 2013, in a case that sparked outrage ov...","filename":"data/vaneerConsumption/SixfoundguiltyofgangrapemurderinIndia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g8p4-4vVdYopwYQ7f641721b07accaf63-847_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420809_Six-guilty-gang-rape-murder-India_1540249837.html","title":"Six found guilty of gang rape, murder in India","title_page":"Six found guilty of gang rape, murder in India | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Six found guilty of gang rape, murder in India\nAn Indian court convicted six men Thursday of gang-raping and murdering a student as she walked home after an exam in 2013, in a case that sparked outrage over women's safety.\nSecurity was tight outside the court in the eastern city of Kolkata for the verdict, with chanting protesters demanding justice and scuffling with police.\nSenior public prosecutor Dipak Ghosh told AFP that six accused were convicted of gang-raping the 21-year-old woman, as well as murder, interfering with evidence and other charges.\nIndian students of Saint Joseph Degree college participate during an anti-rape protest in Hyderabad on September 13, 2013 ©Noah Seelam (AFP/File)\nJudge Sanchita Sarkar told the packed court that two others \"are acquitted due to lack of evidence\".\n\"The... punishment will be announced after hearing the convicts on Friday,\" she said.\nThe six face punishments ranging from 20 years in jail to the death penalty.\nThe gang attacked the university student as she returned home to her village, 50 kilometres (30 miles) northeast of Kolkata, in June 2013.\nThe victim, who cannot be named for legal reasons, was grabbed after getting off the bus before being dragged to a nearby abandoned farm.\nShe was found gagged and laying in a pool of blood in a field the next morning. Evidence showed she had been repeatedly raped.\nThe attack triggered anger in West Bengal state and came just months after the fatal gang rape of a student in Delhi in December 2012 that shone a global spotlight on violence against women in India.\nThe 2012 incident led to an overhaul of India's rape laws including speeding up of trials and tougher penalties for offenders, but high numbers of assaults persist.\nAbout 200 protesters gathered outside the court for Thursday's verdict demanding justice, an AFP reporter said.","url":"https://www.dailymail.co.uk/wires/afp/article-3420809/Six-guilty-gang-rape-murder-India.html"}
