{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 04:08:43","date_modify":"2018-10-23 04:08:43","date_publish":"2016-01-11 17:13:27","description":"Martin Cooke, 33, (top right) was one of the supporters arrested after he allegedly urinated on and punched a rival fan during the Bengal's 18-16 defeat in the AFC Wild Card game on Saturday.","filename":"data/vaneerConsumption/SixfootballfansarrestedinuglyscenesduringSteelersBengalsplayoffgame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D3BBE00000578-0-image-a-78_1452532681604.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394287_Six-football-fans-arrested-ugly-scenes-Steelers-Bengals-play-game-including-one-urinated-punched-supporter-sat-two-hit-women-stands_1540267723.html","title":"Six football fans arrested in ugly scenes during Steelers-Bengals play off game","title_page":"Six football fans arrested in ugly scenes during Steelers-Bengals play off game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Six football fans were arrested amid ugly scenes as the Cincinnati Bengals lost to the Pittsburgh Steelers and ended their playoff run.\nMartin Cooke, 33, was arrested after he allegedly urinated on and punched a rival supporter during the Bengal's 18-16 defeat in the AFC Wild Card game on Saturday night while two others were accused of hitting women in the stands.\nSpectators inside the Paul Brown Stadium were criticized for throwing water bottles and other pieces of debris at players as tensions ran high.\nVideo footage has also emerged of Steelers quarterback Ben Roethlisburger being pelted with objects from the stands as he was carted off with an injury.\nScroll down for video\nMartin Cooke, 33, (left) was arrested after he allegedly urinated on and punched a rival supporter during the Bengal's 18-16 defeat to the Steelers in the AFC Wild Card game. Jared McCarty, 19, (right) was arrested after he allegedly punched a woman in the head\nSix football fans (not pictured) were arrested amid ugly scenes as the Cincinnati Bengals lost to the Pittsburgh Steelers and ended their playoff run\nCooke of Germantown, Kentucky, was wearing a Bengal's hoodie when he allegedly relieved himself on a man in the row in front of him.\nJared McCarty, 19, of Reading, argued with a woman about cutting in line at an entrance gate and stole her Bengals hat, according to WCPO.\nMcCarty, who was wearing a Bengals jersey, threw the hat away, police said, and the two groups separated only to run into each other again at their seats inside the stadium.\nThe argument reportedly carried on in the stands.\nHe is then accused of punching the woman in the head, causing her to fall to the ground.\nPolice discovered a fake identification card on McCarty upon his arrest. The teen admitted to drinking alcohol, police said.\nSteelers fan David Grillo, 25, (left) from Belle Vernon, Pennsylvania, allegedly walked up an aisle in the stadium and threw a beer at a fan during the game. Phillip Ross, 29, (right) was arrested for assault after he allegedly headbutted an opposing fan\nMcCarty is accused of falsification, underage drinking, theft, and assault. He is scheduled to appear in court Monday.\nSteelers fan David Grillo, 25, from Belle Vernon, Pennsylvania, allegedly walked up an aisle in the stadium and threw a beer at a fan during the game. The drink reportedly hit the fan in the face and and cut him.\nGrillo has been accused of assault. His court date is not yet scheduled.\nPhillip Ross, 29, was arrested for assault after he allegedly headbutted an opposing fan.\nAndrew Robles, 28, of Allentown, Pennsylvania, was being ejected from the game for an unknown reason when, police said, he escaped officers and punched a woman in the face, court documents say.\nTyler Matthys, 29, from Westville, Indiana, is also accused of punching a woman in the face\nAndrew Robles, 28, of Allentown, Pennsylvania, (left) was being ejected from the game for an unknown reason when, police said, he escaped officers and punched a woman in the face, court documents say. Tyler Matthys, 29, from Westville, Indiana, (right) is also accused of punching a woman in the face","url":"https://www.dailymail.co.uk/news/article-3394287/Six-football-fans-arrested-ugly-scenes-Steelers-Bengals-play-game-including-one-urinated-punched-supporter-sat-two-hit-women-stands.html"}
