{"authors":[],"date_download":"2018-10-22 22:59:30","date_modify":"2018-10-22 22:59:30","date_publish":"2014-06-11 18:03:07","description":"Pakistani government officials and local residents said the drone fired two missiles and hit a truck Pakistan's lawless tribal region Wednesday.","filename":"data/vaneerConsumption/SixKilledinSuspectedUSDroneStrikeinPakistanOfficials.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/502756/140611-predator-1358_053ffb88b7248ae447cbfb19a1b2970c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_six-killed-suspected-u-s-drone-strike-pakistan-officials-n128646_1540249170.html","title":"Six Killed in Suspected U.S. Drone Strike in Pakistan: Officials","title_page":"Six Killed in Suspected U.S. Drone Strike in Pakistan: Officials","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPESHAWAR, Pakistan — Six suspected militants were killed Wednesday in Pakistan's lawless tribal region along the Afghanistan border by what government officials are calling the first U.S. drone strike in six months.\nThe strike would be the first in the country since Christmas day.\nPakistani government officials and local residents said the drone fired two missiles and hit a truck at Tabi Tolkhel village, about five miles northwest of Miranshah, the capital of volatile North Waziristan tribal region, along the Afghan border.\n\"According to intercepts of the militants, four were Uzbek militants and two members of the Punjabi Taliban,\" a security official said.\nA large number of armed people later held siege at the strike zone and shifted the militants' bodies to an unknown location, according to a local administration official who spoke on the condition of anonymity.\nLocal villagers said the truck was passing through to Tabi village when it came under attack.\n\"Two nearby houses were partially damaged in the missile strikes, but the target was the truck,\" Yar Mohammad, a local resident of Tabi, told NBC News by telephone.\nThe tribesman said that the majority of the local residents fearing military operations by the Pakistani security forces against local and foreign militants had left the area, and that mostly militants remained there.\nThe United States curtailed controversial drone strikes in Pakistan after the Pakistani government started peace negotiations with local Taliban in January.\nHowever, with talks between the government and Taliban apparently failed amid this week's deadly Taliban attack on the airport in Karachi, the Pakistani government is said to be preparing a military operation in North Waziristan.\n— Mushtaq Yusufzai","url":"https://www.nbcnews.com/news/world/six-killed-suspected-u-s-drone-strike-pakistan-officials-n128646"}
