{"authors":["Nick Purewal","Press Association Sport"],"date_download":"2018-10-23 03:37:14","date_modify":"2018-10-23 03:37:14","date_publish":"2017-03-16 14:37:26","description":"Conor Murray has failed to shake off his shoulder problem and will miss Ireland's RBS Six Nations finale with England, while boss Joe Schmidt has dropped lock Devin Toner.","filename":"data/vaneerConsumption/SixNationsIrelandsConorMurraytomissEnglandclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54C5C700000578-0-image-a-126_1489675001204.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4320512_Six-Nations-Ireland-s-Conor-Murray-miss-England-clash_1540265834.html","title":"Six Nations: Ireland's Conor Murray to miss England clash","title_page":"Six Nations: Ireland's Conor Murray to miss England clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Conor Murray has failed to shake off his shoulder problem and will miss Ireland's RBS Six Nations finale with England, while boss Joe Schmidt has dropped lock Devin Toner.\nFit-again Jared Payne starts at full-back ahead of Rob Kearney, with Iain Henderson preferred to Toner in the second-row and Kieran Marmion replacing Murray at scrum-half.\nKeith Earls has shaken off his groin complaint to start on the wing, but Schmidt sprung a surprise with his decision to drop lineout co-ordinator Toner.\nConor Murray receives treatment for the shoulder problem that has ruled him out vs Wales\nKieran Marmion replaces Murray at scrum-half for the final RBS Six Nations clash vs England\nFull-back Kearney has suffered a knee injury, opening the door for Payne to feature for the first time since suffering a lacerated kidney in November.\n'With Conor Murrray we fitness-tested him today and we felt he wasn't quite 100 per cent,' said Ireland boss Schmidt.\n'We just felt if we lost him early in the game we would be vulnerable. Iain Henderson came off the bench and did really well last week.\n'Between Donnacha Ryan and Dev (Toner) we just wanted to give him a chance to start. Donnacha also did well last week, so it was just trying to get that balance.\n'Rob Kearney has got a knee injury and is unavailable to be selected. It probably won't be too long but needs a bit of further investigation.'\nIreland will certainly view losing British and Irish Lions scrum-half Murray as a huge blow ahead of the England showdown.\nDevin Toner of Ireland, pictured winning a lineout vs Wales, has been dropped from the first XV\nEngland are chasing a second-successive grand slam and a world-record 19th straight win at the Aviva Stadium on Saturday.\nMurray and Johnny Sexton have built one of the standout half-back partnerships in northern hemisphere rugby, and Ireland have tended to rely on the duo's stewardship in their finest moments.\nIreland are bidding to avoid losing to all three home nations rivals in one championship for the first time since 1998, and must now do so without several of their most trusted lieutenants.\n'There's still an opportunity to finish second which is a massive thing for us,' said Schmidt.\n'We can still attain the target of second place, so there's still a heck of a lot for us to gain individually and collectively.'\nIreland head coach Joe Schmidt says finishing second behind England means 'a heck of a lot'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4320512/Six-Nations-Ireland-s-Conor-Murray-miss-England-clash.html"}
