{"authors":["Sam Tonkin For Mailonline"],"date_download":"2018-10-23 02:55:56","date_modify":"2018-10-23 02:55:56","date_publish":"2016-01-28 18:10:11","description":"Darrell Read, 50, of Wellington, New Zealand, was found not guilty of conspiracy to defraud by a jury at London's Southwark Crown Court, a day after five other traders were also cleared.","filename":"data/vaneerConsumption/SixthstockbrokerclearedoverLiborbankingscandal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACE3E700000578-0-image-a-15_1454006450248.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421385_Sixth-final-broker-cleared-plotting-fix-Libor-banking-rate-make-millions-pounds-profit_1540263356.html","title":"Sixth stockbroker cleared over Libor banking scandal","title_page":"Sixth stockbroker cleared over Libor banking scandal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cleared: Darrell Read, of Wellington, New Zealand, was found not guilty of conspiracy to defraud by a jury at London's Southwark Crown Court today\nLoud cheers and applause broke out in court today as the sixth and final broker in the latest Libor-rigging trial was cleared of trying to manipulate the benchmark lending rate.\nDarrell Read, 50, of Wellington, New Zealand, was found not guilty of conspiracy to defraud by a jury at London's Southwark Crown Court.\nThe former ICAP broker sat and held his head in his hands as his co-defendants, who were all found not guilty yesterday, hugged each other and cheered from the public gallery, which was packed with tearful friends, relatives and supporters.\nFormer brokers Noel Cryan, 49, Danny Wilkinson, 48, Colin Goodman, 53, James Gilmour, 50, and Terry Farr, 44, were all cleared of conspiracy to defraud by trying to manipulate the Libor rate linked to the Yen.\nThe emotional scenes came at the end of a trial which lasted nearly four months and cost the taxpayer up to £16million. The jury took a total of 10 hours and 59 minutes to reach all its verdicts.\nThe men had been accused of helping trader Tom Hayes, dubbed 'Rainman' by his colleagues, manipulate the Libor rate over a period of four years.\nHayes, who was convicted of conspiracy to defraud earlier this year, repeatedly asked them via instant messages and emails for help getting the Libor rate set in his favour, the court had heard.\nLibor is the term for benchmark rates which underpin hundreds of trillions of pounds of contracts, from mortgages to corporate lending.\nThere was a short break this morning before the jury reached its final verdict on Mr Read, which Mr Cryan described as 'definitely the longest 10 minutes of his (Mr Read's) life'.\nMr Cryan, a former Tullett Prebon broker, said: 'We have all been in the same position and we have all been through a lot sitting in that box (the dock) for more than three months.\n'At the end of the day this is not a laughing matter because it is an offence which can carry a 10-year sentence - and we all know what Tom Hayes got.'\nA statement released by solicitors acting for Goodman, nicknamed Lord Libor, said: ‘We can only reiterate what his counsel told the jury, that the SFO case was a complete shambles and should never have been brought.’\nNot guilty: Five other brokers, including Colin Goodman (left) - nicknamed Lord Libor - and Terry Farr (right) was also cleared yesterday of plotting to fix the banking rate to make millions of pounds of profit\nJames Gilmour (left), Noel Cryan (right) and Danny Wilkinson were also cleared of conspiracy to defraud by trying to manipulate the Libor rate linked to the Yen following a trial at Southwark Crown Court\nMatthew Frankland, the solicitor for Mr Wilkinson, said prosecutors should be targeting more senior figures in the City.\n‘It’s always been a surprise and disappointment that these people were seen as front and centre when they weren’t even bankers.\n‘If that the SFO says is true, it’s rather shocking more senior people aren’t being prosecuted.’\nThe six men were accused of helping Hayes, who is serving 11 years in prison, of manipulating the key benchmark rate.\nMr Read, who left court without comment, had been accused of deliberate dishonesty between August 2006 and December 2009.\nThe group were accused of teaming up with jailed trader Tom Hayes (pictured with his wife outside court last year) in the 'dishonest scheme' to manipulate Libor - the rate used when banks lend to each other\nWHAT IS THE LIBOR RATE? The London Interbank Offered Rate is used as the basis for hundreds of trillions of dollars of loans and transactions around the world from complex derivatives to mortgages. It is a benchmark that indicates the interest rate that banks charge when lending to each other and is seen as fundamental to the operation of UK and world markets. Interbank rates were first thrust into the spotlight during the 2007 and 2008 credit crunch when rates shot up as nervous lenders stopped lending to each other. Alleged rigging is said to have involved the submission of false figures in order either to make more money or to paint a false picture of a bank's health. The scandal which meant consumers face higher interest charges saw eight banks and brokerages fined billions by regulators in the US and the UK.\nMr Cryan said: 'Obviously we are really relieved for everyone but I think there are questions which need to be addressed in relation to the Serious Fraud Office (who brought the case), but at least justice has been done.\n'It feels like they were trying to go after the little guys and to make an example of us.'\nHayes, who was jailed in August 2015, became the first person to be convicted over the Libor rate-rigging scandal.\nHe was sentenced to 14 years in prison for manipulating the rate while working at UBS and Citigroup between 2006 and 2010. Hayes made around 300 million US dollars (£210 million) for his employers in that time.\nThe sentence was reduced to 11 years after an appeal.\nIn a statement released after Wednesday's verdicts, SFO director David Green QC said: 'The key issue in this trial was whether these defendants were party to a dishonest agreement with Tom Hayes. By their verdicts the jury have said that they could not be sure that this was the case.","url":"https://www.dailymail.co.uk/news/article-3421385/Sixth-final-broker-cleared-plotting-fix-Libor-banking-rate-make-millions-pounds-profit.html"}
