{"authors":[],"date_download":"2018-10-30 00:52:05","date_modify":"2018-10-30 00:52:05","date_publish":"2017-03-14 01:59:53","description":null,"filename":"data/vaneerConsumption/SixWaystoMakeHealthCareAffordable.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/03/3904957361_ecd4170ffe_z-e1489471268335.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860725.html","title":"Six Ways to Make Health Care Affordable","title_page":"Six Ways to Make Health Care AffordableThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As Congress looks to “repeal and replace” the Affordable Care Act (ACA), or Obamacare, many are asking how to make health care affordable for Americans.\nAcross the nation, Obamacare increased the number of people holding insurance cards but failed to increase access to quality and affordable health services. For many, the cost of health care is higher than ever.\nIf we truly want to expand access to quality care nationwide, it’s time to put patients, not government bureaucrats, in charge of health care decisions.\nEnd government mandates\nThe guaranteed issue mandate requiring insurance companies to offer health policies regardless of a consumer’s health status undercuts the basic premise of insurance and drives up premiums. Before the ACA, states like New Hampshire and Washington implemented a similar mandate only to repeal it after costs skyrocketed.\nAlternative ways to provide affordable care for high-cost patients include high risk pools, targeted subsidies for insurers, special HSA provisions, and protections for maintaining continuous coverage.\nThe community rating mandate prevents insurers from adjusting prices based on a consumer’s health status. In practice, the young and healthy must pay more to subsidize costs for older enrollees. Major insurers note allowing more variation in rates to reflect health care service usage could lower premiums.\nStates should also reduce coverage mandates. Before the ACA, Pennsylvania, for example, had more than 50 mandates on the books. The ACA added even more. Altogether, experts estimate coverage mandates raise the cost of health insurance between 10 to 50%. States should reduce these mandates.\nProtect alternative models of care\nInsurance alternatives reduce the cost of care. Direct primary care and cost sharing ministries, provide affordable health care services outside the traditional insurance model. Insurance regulations should not apply to these and future innovations.\nExpand scope of practice for mid-level practitioners\nUnder current regulations, providers like nurse practitioners and dental therapists are often prevented from practicing in underserved rural areas because of stringent licensing regulations. There is no evidence these regulations produce better health outcomes.\nEnhance consumer control\nHealth costs have risen because third-party insurance shields consumers from the true cost of care and encourages overuse. A better solution is encouraging out-of-pocket spending on routine medical care, while preserving insurance for catastrophic events. One way to support this shift is to expand the flexibility of Health Savings Accounts.\nEnd unequal tax treatment\nCurrently only employer-paid premiums and most employee-paid premiums are exempt from federal income and payroll taxes. Tax deductions, credits, or list billing would promote fairness for those who don’t receive employer-provided health insurance and end the danger of individuals losing coverage when they change jobs.\nFoster interstate competition\nPermitting shopping in neighboring states with nearby networks could spur further competition among insurers and drive down costs. For regulatory competition to be effective, Washington must reestablish states as the primary regulatory authority for health insurance.\nAmericans want quality health care at a price they can afford. Top-down mandates did not deliver. Truly affordable health care will begin only when we reject bureaucratic overregulation and put patients first.","url":"https://spectator.org/six-ways-to-make-health-care-affordable/"}
