{"authors":["Joey Millar For Mailonline"],"date_download":"2018-10-23 00:19:19","date_modify":"2018-10-23 00:19:19","date_publish":"2016-01-28 14:04:54","description":"A team of 14 workers used diggers to load the 45ft-long carcasses onto low-loaders before taking them to landfill sites in Didcot and Sheffield. The whales were washed up last weekend.","filename":"data/vaneerConsumption/Skegnesswhalesremovedtolandfillsitesinmammothfivehouroperation.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAD50900000578-0-image-a-48_1453989939795.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420842_Skegness-whales-removed-landfill-sites-mammoth-five-hour-operation_1540253959.html","title":"Skegness whales removed to landfill sites in mammoth-five hour operation","title_page":"Skegness whales removed to landfill sites in mammoth-five hour operation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three giant sperm whales which washed up on a beach in Lincolnshire have been removed in a mammoth five-hour operation.\nA team of 14 workers used diggers to load the 45ft-long carcasses onto low-loaders before taking them to landfill sites in Didcot and Sheffield.\nStunning pictures taken during the removal last night showing the 30-tonne whales being dragged along Central Beach in Skegness.\nThe giant creatures were then wrapped in black sheeting before being driven away to their final resting place.\nContractor Jan Smith, who was co-ordinating the operation, said it had gone smoother than expected.\nA team of 14 workers used diggers to load the 45ft-long carcasses onto low-loaders before taking them to landfill sites in Didcot and Sheffield\nContractor Jan Smith said his team were aware of the danger that one of the whales might blow up during the removal\nThe three 30-tonne whales washed up along Central Beach in Skegness, Lincolnshire, last weekend, attracting thousands of onlookers\nYou can't really plan anything because you don't know if they are likely to blow up Contractor Jan Smith\nExperts thought it would take eight hours to remove the three whales but his team, which started the grisly work at 8pm, were finished by 1.30am.\nMr Smith said: \"It's gone very well really. The last one where the flaps had been cut open for the autopsy was hard work.\n\"You can't really plan what you are going to do because you don't know if they are likely to blow up or something.\n\"All that you can do is treat them with the utmost respect.\n\"It is not an easy job. We moved a whale in 2012 from here.\n\"I think it is very tragic when you see such fantastic mammals getting washed up on the beach.\n\"Whether I do it or somebody else, it has got to be done. We will do it as humanely and sympathetically as we can.\n\"It is one of life's tragedies.\"\nEyewitness Dave Wilson, 44, who came to watch the whales be removed, added: \"I have just moved here and heard about the whales.\n\"I have never seen anything like it, I have never seen a whale before in my life.\n\"I feel sorry for them. I came earlier in the week to see one that had exploded. It was quite a mess.\"\nEyewitness Dave Wilson, 44, who came to watch the whales be removed, said he had 'never seen anything like it'\nMorrisons worker Linda Day said the whales had 'put Skegness on map' by attracting huge crowds, some of whom took selfies with the animals\nThe operation to remove the huge beasts took five-and-a-half hours and went smoother than expected\nMorrisons worker Linda Day, 58, added: \"I came down and saw the one in 2012. It is really sad but it is nature.\n\"It is a shame they can't put them out to sea to dispose of them but the water is too shallow. Poor things.\n\"It has put Skegness on the map. It is surprising how many people have come to see it.\"\nHuge crowds gathered at Central Beach in Skegness after the three whales washed up on Saturday night and Sunday morning\nOnlookers were kept away from the whale carcasses but some people still attempted to cut off parts of the whales as souvenirs\nSome people defied orders to keep away from the whales and used the huge bodies as canvasses for political graffiti\nThousands of people had gathered on the beach to see the three whales which washed up in Skegness last Sunday.\nThey are believed to be from the same pod as another whale which was found in Hunstanton, Norfolk, last Friday and a fifth which beached on former MOD land in Wainfleet, Lincolnshire, last Monday, along with others which have washed up on the coasts of Germany and Netherlands in the last fortnight.\nScientists who examined the mammals found they had been beached while alive and died after entering shallow North Sea waters in the hunt for food.\nThey are believed to be from the same pod as another whale which was found in Hunstanton, Norfolk, last Friday and a fifth which beached on former MOD land in Wainfleet, Lincolnshire, last Monday\nOthers whales, thought to be from the same pod, have washed up on the coasts of Germany and Netherlands in the last fortnight\nThe giant creatures were wrapped in black sheeting before being driven away to their final resting place","url":"https://www.dailymail.co.uk/news/article-3420842/Skegness-whales-removed-landfill-sites-mammoth-five-hour-operation.html"}
