{"authors":["Luke Barnes For Mailonline"],"date_download":"2018-10-23 05:52:36","date_modify":"2018-10-23 05:52:36","date_publish":"2017-03-16 16:37:11","description":"A skier was left thanking his lucky stars after a leap into the unknown (pictured) resulted in seven broken ribs and a collapsed lung in the Canadian ski resort of Whistler Blackcomb.","filename":"data/vaneerConsumption/Skiershowsmomenthebroke7ribsinCanada.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E5558A300000578-0-image-a-45_1489680580560.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320932_Skier-posts-footage-moment-breaks-seven-ribs_1540273956.html","title":"Skier shows moment he broke 7 ribs in Canada","title_page":"Skier shows moment he broke 7 ribs in Canada | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A skier was lucky to escape with his life after a leap into the unknown resulted in him landing on razor-sharp rocks.\nThe grisly accident, captured on camera last year, resulted in seven broken ribs and a collapsed lung.\nThe dramatic footage was captured on the man's Go-Pro camera, which was thought to be lost after the accident but remarkably survived the rocks and snow to surface four months later.\nIn the video one of the skiers friends can be seen to stop just before the jump, as if realising it's dangers\nPosting online, the skier said: 'I was a little too excited and I made the mistake of airing off this roller that I thought looked OK from the top.\n'I posted this video in hopes that somebody out there could learn from my mistake - always check your landings before you jump!\n'I consider myself lucky to get off as easy as I did.'\nThe skier realises the extent of his mistake the moment after he launches into the air\nThe Go-Pro captures him tumbling to the ground before cutting out\nThe accident happened in Whistler Blackcomb ski resort in British Columbia, one of the largest ski resorts in North America.\nThe resort also hosted the 2010 Vancouver Winter Olympics.\nIn his online post, the skier added in a 'big thanks' to the Blackcomb ski patrol who rescued and took him to hospital.","url":"https://www.dailymail.co.uk/news/article-4320932/Skier-posts-footage-moment-breaks-seven-ribs.html"}
