{"authors":["Andree Gorman","Insider Picks"],"date_download":"2018-10-30 23:38:41","date_modify":"2018-10-30 23:38:41","date_publish":"2016-12-06 00:00:00","description":"Brexit has instilled a certain amount of uncertainty in the British job market. Here's how you can get ahead of the competition by improving your skill set.","filename":"data/vaneerConsumption/SkillstohaveonyourCVafterBrexit.json","image_url":"https://amp.businessinsider.com/images/5846b187dd08953b448b4a6b-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_skills-to-have-on-your-cv-after-brexit-2016-12_1540942721.html","title":"Skills to have on your CV after Brexit","title_page":"    Skills to have on your CV after Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase.\nStrelka Institute for Media, Architecture and Design/flickr Brexit has instilled a certain amount of uncertainty in the British job market.\nBack in February, more than 40% of British employers were already fearing that Brexit would make it harder for them to employ the right people to work for their companies.\nIn the United Kingdom, we have a huge shortage of skills, which is why hiring managers tend to prefer hiring from outside of Britain.\nAfter all, European nationals are more likely to have a masters, or post-doctoral degree, and can generally speak more than one language.\nThat being said, the skill gap in the United Kingdom also means that there are opportunities available for those willing to update their skillset. Not only will learning these skills make you catch the eye of hiring managers, but it will also put you ahead of the competition.\nFrom coding to learning new languages, or simply knowing how to improve your CV in a way which will catch the eye of potential employers, we've rounded up the skills everyone should have on their CV post-Brexit.\nNow through January 2, 2017, you can take 75% off thousands of Udemy's classes when you enter the code \"UDEMY1275\" at checkout.","url":"https://www.businessinsider.com/skills-to-have-on-your-cv-after-brexit-2016-12"}
