{"authors":[],"date_download":"2018-10-22 21:01:11","date_modify":"2018-10-22 21:01:11","date_publish":"2014-05-05 17:19:43","description":"Over a lifetime, the average college grad will earn at least $800,000 more than the average high school grad, a Fed study says.","filename":"data/vaneerConsumption/SkipCollegeandForfeit800000FedStudySays.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/421006/140505-grads_1314_5d8fa012472a070098f946a53b6588f3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/better_careers_skip-college-forfeit-800-000-fed-study-says-n97381_1540242071.html","title":"Skip College and Forfeit $800,000, Fed Study Says","title_page":"Skip College and Forfeit $800,000, Fed Study Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Get the Better newsletter.\nOver a lifetime, the average U.S. college graduate will earn at least $800,000 more than the average high school graduate, a study published Monday by the Federal Reserve Bank of San Francisco shows.\nThat's after accounting for the high cost of college tuition and the four years of wages lost during the time it takes to complete a typical undergraduate degree, the researchers found.\n\"Although there are stories of people who skipped college and achieved financial success, for most Americans the path to higher future earnings involves a four-year college degree,\" wrote Mary Daly, the San Francisco Fed's associate director of research, and Leila Bengali, a research associate, in the latest Economic Letter from the regional Fed bank.\nA new study shows that over a lifetime a college graduate likely will earn $800,000 more than a person with only a high school diploma. Vasha Hunt / AP\nIn short, they found, \"college is still worth it.\"\nA college student who pays $21,200 in yearly tuition will recoup that investment by age 38, the researchers found. About 90 percent of students at public colleges, and 20 percent of students at private colleges, pay less than that amount, they found. By retirement, that student will have earned $831,000 more than a peer who never went to college.\nFor those students who pay the astronomical tuitions levied by top private U.S. colleges, however, the benefits may be smaller, the study suggested.\n\"Although some colleges cost more, there is no definitive evidence that they produce far superior results for all students,\" they wrote, adding \"... redoubling the efforts to make college more accessible would be time and money well spent.\"","url":"https://www.nbcnews.com/better/careers/skip-college-forfeit-800-000-fed-study-says-n97381"}
