{"authors":[],"date_download":"2018-10-23 00:30:45","date_modify":"2018-10-23 00:30:45","date_publish":"2016-01-11 10:01:29","description":"South Korea said Monday that further US \"strategic assets\" might be deployed to the Korean peninsula, following a flyover by a US B-52 bomber in response to ...","filename":"data/vaneerConsumption/SKoreaUSmullfurtherstrategicdeploymentafterNorthtest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5wt-56CX32zFKLb7123928b84cd23e20-364_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393333_S-Korea-US-discuss-strategic-deployment-North-test_1540254645.html","title":"S. Korea, US mull further strategic deployment after North test","title_page":"S. Korea, US mull further strategic deployment after North test | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"S. Korea, US mull further strategic deployment after North test\nSouth Korea said Monday that further US \"strategic assets\" might be deployed to the Korean peninsula, following a flyover by a US B-52 bomber in response to North Korea' nuclear test.\nSeoul also announced new restrictions on the movement of its citizens to the jointly-run Kaesong industrial park, just a few kilometres over the border inside North Korea.\nThe South has taken an uncompromising stance in the wake of Wednesday's test, urging the international community to impose harsh sanctions on Pyongyang and resuming high-decibel propaganda broadcasts into North Korea.\nPeople watch a news report on North Korea's latest nuclear test at a railway station in Seoul on January 6, 2016 ©Jung Yeon-Je (AFP/File)\nIn a show of strength on Sunday, a B-52 Stratofortress -- flanked by South Korean F-15 fighter jets and US F-16 planes -- flew over Osan Air Base, some 70 kilometres (45 miles) south of the inter-Korean border.\nThe US military said the fly-by was a demonstration of the \"ironclad\" commitment to its military alliance with South Korea, and a direct response to the North's fourth nuclear test.\n\"South Korea and the US are in close consultation about additional deployment of other strategic assets on the Korean Peninsula,\" Defence Ministry spokesman Kim Min-Seok told a regular press briefing in Seoul.\n- Nuclear umbrella -\nUS and South Korean media reports have speculated that the nuclear-powered aircraft carrier USS Ronald Reagan -- currently based in Japan -- as well as B-2 stealth bombers and F-22 stealth fighter jets are among the deployments being considered.\nAsked about Sunday's flyover, China's foreign ministry on Monday urged all sides \"to exercise restraint\" to avoid jeopardising stability on the Korean peninsula.\nUnder the US-South Korea military alliance, there are nearly 30,000 US troops permanently stationed in South Korea, which is also protected by the US \"nuclear umbrella\".\nSouth Korean President Park Geun-Hye will make a televised address to the nation on Wednesday, followed by a rare news conference, her office said.\nThe South's special envoy on North Korea will meet in Seoul with his US and Japanese counterparts the same day.\nNorth Korea says last week's test was of a miniaturised hydrogen bomb -- a claim largely dismissed by experts who argue the yield was far too low for a full-fledged thermonuclear device.\nState media published a photo Monday of leader Kim Jong-Un posing formally with hundreds of scientists, workers and officials who took part in the underground detonation.\nKim urged them to ensure \"uninterrupted advance and innovation... for bolstering the nuclear deterrent\", the North's official KCNA news agency reported.\nThe test has been widely condemned and the UN Security Council is discussing a new resolution that would tighten sanctions already imposed on the North after its three previous nuclear tests and banned missile launches.\nAs well as resuming the propaganda broadcasts, which one top North Korean official has warned could bring the peninsula to the \"brink of war\", Seoul has taken measures to restrict movements to the Kaesong industrial park.\nOn Monday the unification ministry announced that the number of South Koreans allowed to stay overnight in Kaesong was being reduced from 800 to 650.\n\"The aim is to minimise the presence in Kaesong, while not hampering actual production activities,\" a ministry official said.\nThe Kaesong industrial estate opened in 2004 and currently hosts more than 120 South Korean companies which employ some 53,000 North Korean workers.\nThe move is apparently motivated by fears that South Koreans staying in the zone could be vulnerable if North-South tensions continue to escalate.\nThe defence ministry spokesman in Seoul also said Monday that North Korea had deployed more troops to frontline border units.\n\"There has been an increase in troops along the border following North Korea's fourth nuclear test,\" Kim said. \"But there are no immediate signs of any imminent provocation.\"\nA US B-52 Stratofortress (bottom R) flies with fighter jets over South Korea in a show of force after North Korea's latest nuclear test ©YONHAP (YONHAP/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393333/S-Korea-US-discuss-strategic-deployment-North-test.html"}
