{"authors":[],"date_download":"2018-10-23 02:35:35","date_modify":"2018-10-23 02:35:35","date_publish":"2017-03-10 11:48:22","description":"Thousands of younger demonstrators erupted with joy while a rival older crowd angrily clashed with riot police -- two of them dying -- Friday when South...","filename":"data/vaneerConsumption/SKoreansjubilantorstunnedbypresidentssacking.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195741-1489146504-131_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301002_S-Koreans-jubilant-stunned-presidents-sacking_1540262135.html","title":"S. Koreans jubilant, or stunned by president's sacking","title_page":"S. Koreans jubilant, or stunned by president's sacking | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Anti-government activists carry a mock jail containing a cardboard cut-out of South Korea's President Park Geun-Hye of Park in Seoul on March 10, 2017 after the Constitutional Court upheld her impeachment\nThousands of younger demonstrators erupted with joy while a rival older crowd angrily clashed with riot police -- two of them dying -- Friday when South Korea's Constitutional Court fired President Park Geun-Hye over corruption.\nThe rival groups epitomised the opposing passions and generational splits over the country's sweeping political scandal.\nAround 3,000 anti-Park demonstrators, mostly in their 20s to 40s, erupted with joy as the verdict was read out in a live television broadcast.\n\"We won, we won,\" they chanted, waving banners.\n\"This is a victory of democracy,\" 27-year-old student Ahn Yo-Wool told AFP, wiping tears from her cheek.\nMillions of South Koreans, increasingly frustrated over broad economic and social challenges, have gathered for weekly protests demanding Park's removal over a wide-ranging corruption scandal.\nThe South is Asia's fourth-largest economy but growth is slowing and many complain of a lack of opportunity in a country dominated by large companies with close ties to the political establishment.\nSupporters of South Korean President Park Geun-Hye clash with police in Seoul on March 10, 2017 after the Constitutional Court upheld her impeachment\nAnother student, Lim Na-kyung, added: \"The impeachment of the president is truly a day that will go down in history. My heart is full of emotion and I am very happy.\"\nBut some of Park's diehard supporters, mostly older conservatives with fond memories of the rule of her late father, dictator Park Chung-Hee, still stand by her.\nPolice deployed buses and thousands of riot personnel to separate the groups and acting president Hwang Kyo-Ahn said two Park supporters died in a clash with riot police near the court.\nOne of them was reportedly hit on the head by a speaker falling from a vehicle roof as the pro-Park crowd swarmed towards the police blockade, wielding sticks and chanting \"Destroy Constitutional Court!\"\nSome broke police barricades and attempted to pull away police buses blocking their path, prompting the police to use pepper spray.\n\"We don't accept this decision,\" said Cho Bong-Am, 60, a kindergarten operator. \"We will take to the street to fight to the end.\"\nThe pro-Park backers were left stunned by the ruling.\n\"Nullify impeachment, dissolve parliament,\" they chanted, singing to military marches and waving both South Korean and US flags.\nSupporters of South Korean President Park Geun-Hye attack a police bus in Seoul on March 10, 2017 after the announcement of the Constitutional Court over her impeachment\nPark has maintained a hardline stance on North Korea and many of her heartland voters blame her removal on machinations by Pyongyang.\n\"Justice is dead. I think the government must now declare a martial law and wipe out these pro-Pyongyang leftists\", said Ahn Moon-Yung, a 71-year-old shopkeeper.\nAnother shopowner, Han Sang-Il, 61, said he had been participating in weekly pro-Park rallies every Saturday over the past 17 weeks.\n\"Now is time for people to rise up to overturn the court ruling. Revolution calls for blood,\" he said angrily.\nThe front-runner in polls for the presidential race, due within 60 days, is leftist Moon Jae-In of the Democratic Party.\nIf he wins, said Bae Soo-Rok, 58, who wore a military uniform and said he was a retired marine, \"We will all rise up and oust him from power within a year.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4301002/S-Koreans-jubilant-stunned-presidents-sacking.html"}
