{"authors":[],"date_download":"2018-10-22 21:00:05","date_modify":"2018-10-22 21:00:05","date_publish":"2016-01-28 06:05:26","description":"South Korea on Thursday clamped down on lax safety protocols at low-cost airlines, warning them to mend their ways or face possible closure. The transport mi...","filename":"data/vaneerConsumption/SKoreacracksdownonbudgetairlinesafetylapses.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5wu-2vdWmEltwXfba0ce28e6324af0f7-745_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420408_S-Korea-cracks-budget-airline-safety-lapses_1540242005.html","title":"S. Korea cracks down on budget airline safety lapses","title_page":"S. Korea cracks down on budget airline safety lapses | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"S. Korea cracks down on budget airline safety lapses\nSouth Korea on Thursday clamped down on lax safety protocols at low-cost airlines, warning them to mend their ways or face possible closure.\nThe transport ministry conducted a safety review of the country's six budget carriers this month, after one aircraft was forced to make an emergency return due to an unsealed door.\nThe Boeing 737-800 belonged to Jin Air, a budget airline operated by South Korea's top carrier Korean Air.\nSouth Korea's transport ministry says the country's low cost airlines are making an \"inadequate\" investment in safety after a review of the six budget carriers ©Mark Ralston (AFP/File)\nLast month, a passenger jet belonging to another budget carrier, Jeju Air, plunged 3,000 metres (10,000 feet) due to problems with its on-board air compression system.\nThe ministry concluded Thursday that low cost carriers were making an \"inadequate\" investment in safety given the exponential growth in traffic over the past decade.\nThe six budget carriers accounted for 59 percent of domestic market share last year, mostly centred on the route between Seoul and the southern resort island of Jeju.\n\"Airlines which fail to ensure passenger safety ... will face closure through cancellation of business licences,\" the ministry said in a press statement.\nIn the specific cases involving Jin Air and Jeju Air, the ministry said pilots and ground crews who appeared to have ignored basic safety procedures would be suspended for 30 days.\nThe government also plans to suspend the operations of the two airlines for seven days or fine them 600 million won ($496,000), it added.","url":"https://www.dailymail.co.uk/wires/afp/article-3420408/S-Korea-cracks-budget-airline-safety-lapses.html"}
