{"authors":[],"date_download":"2018-10-22 23:37:58","date_modify":"2018-10-22 23:37:58","date_publish":"2017-03-10 03:53:09","description":"The corridors of power have been home to South Korea's Park Geun-Hye as a child, de facto first lady, and president. She leaves them in disgrace, crippled by...","filename":"data/vaneerConsumption/SKoreaslongtimeprincessdethronedindisgrace.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/04/wire-194023-1489120999-877_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299916_S-Koreas-longtime-princess-dethroned-disgrace_1540251478.html","title":"S. Korea's longtime 'princess' dethroned in disgrace","title_page":"S. Korea's longtime 'princess' dethroned in disgrace | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Park Geun-Hye leaves office in disgrace, crippled by a corruption scandal that made her South Korea's first head of state to be removed by impeachment\nThe corridors of power have been home to South Korea's Park Geun-Hye as a child, de facto first lady, and president.\nShe leaves them in disgrace, crippled by a corruption scandal that made her the country's first head of state to be removed by impeachment.\nNow 65, Park grew up in the spotlight at the Blue House, the presidential complex just north of one of Seoul's royal palaces, enjoying a pampered life as the eldest child of military dictator Park Chung-Hee.\nDespite rights abuses, her father oversaw the country's rapid economic development during his 1961-1979 rule, with the first family treated as royalty by some supporters and Park dubbed the young \"princess\" -- a nickname that endured for decades.\nThe assassinations of both her parents five years apart in the 1970s only further fanned sympathy for her.\nPark's mother -- widely praised as a dutiful wife and caring mother in the still traditionalist society of the day -- was murdered by a Korean-Japanese believed to have been acting on Pyongyang's orders.\nDismissed South Korean President Park Geun-Hye is the daughter of assassinated military dictator Park Chung-Hee\nA student in France at the time, Park returned home to assume the role of first lady until her father was killed by his own security chief in 1979.\nShe subsequently kept a low profile for nearly two decades, until she made a successful 1998 bid to become a lawmaker as the South reeled from the fallout of the Asian financial crisis.\nShe became an instant political star among older conservative Koreans who fondly remembered her mother and revered her father for helping pull a war-ravaged nation out of poverty.\nAdept at taking advantage of the nostalgia for them and the sympathy for her, she frequently peppered her campaign speeches with the phrase, \"After I tragically lost my parents to assassins' bullets.\"\n- Virgin Queen -\nPark rose quickly up the political ladder, earning the nickname \"the queen of elections\" due to her voters' unwavering loyalty.\nDismissed South Korean President Park Geun-hye is accused of colluding with Choi Soon-sil (C) to squeeze money from the country's biggest companies\nThe fact that Park never married and was estranged from her two siblings was part of her appeal, in a country where leaders had often been embroiled in major corruption scandals involving relatives.\n\"I'm married to the Republic of Korea. I have no children. South Koreans are my family,\" Park once said, citing her role model as Elizabeth I of England -- known as the 'Virgin Queen'.\nEventually Park was elected the South's first female president in 2012, winning the highest vote share of any candidate in the democratic era.\nBut it was the family of a shady religious figure she chose as a mentor who ultimately sowed the seeds of her downfall.\nHer relationship with Choi Tae-Min, the seven-times-married founder of a cult-like group 40 years her senior, began in the 1970s when he sent her letters claiming that he had seen her dead mother in his dreams.\nHis influence grew until a US diplomatic cable published by Wikileaks noted widespread rumours that he had \"complete control over Park's body and soul\".\nHe died in 1994, and his daughter Choi Soon-Sil -- already a friend who handled Park's daily life including her wardrobe choices -- inherited his role.\nPark is accused of colluding with her for years to squeeze tens of millions of dollars from South Korean businesses, including many of the country's biggest companies, in exchange for governmental favours.\nChoi is on trial for coercion and abuse of power, while Lee Jae-Yong, the de facto leader of the world's biggest smartphone maker Samsung, has been indicted for bribery, corruption and other offences.\nPark apologised several times in tearful televised addresses, painting herself as a lonely, isolated leader whose main offence was to place too much trust in a friend.\n\"South Koreans, since I took office, I have lived a lonely life,\" she said. Choi \"stayed with me during my most difficult times,\" she added. \"It is a fact that I let my guard down.\"\nBut the scandal was too much even for many of her supporters, prompting millions to take to the streets calling for her ouster and sending her once-bulletproof approval ratings to record lows.\nMany in her own party turned against her to vote for her impeachment in parliament, leaving it to the constitutional court to have the final say.\n- 'Obsession with power' -\nThe scandal has exposed allegedly corrupt ties between politics and business, as in Park's father's time, and his divisive legacy has always dogged her political career, with critics accusing her of inheriting his authoritarian streak.\nState probes have portrayed Park as a solitary, aloof figure who preferred staying at her residence to meeting advisors at the office, overly focused on her appearance and showing little tolerance for criticism.\nOne official who was her chief of staff for two years told a parliamentary hearing he had often gone entire weeks without seeing her at all -- an experience echoed by many other senior personnel.\nPark was also accused of negligence over the sinking of the Sewol ferry in 2014 -- when more than 300 people, mostly schoolchildren, drowned in the South's worst disaster for decades.\nSeparately, Park is accused of ordering officials to crack down on and punish thousands of artists who voiced criticism of her.\n\"Instead of the father's intelligence, insight and determination to build economy, she only inherited the worst part of him -- obsession with power... and intolerance for critics,\" Chun Yu-Ok, a former ally and senior lawmaker in Park's party, wrote in a recent memoir.\n\"Her downfall is a reminder for all South Koreans that now is time to finally say goodbye to our past.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4299916/S-Koreas-longtime-princess-dethroned-disgrace.html"}
