{"authors":["James Gordon For Dailymail.Com"],"date_download":"2018-10-23 03:20:51","date_modify":"2018-10-23 03:20:51","date_publish":"2017-04-26 14:42:15","description":"A 30-year-old skydiver was found dead in a field in New York state after his parachute failed to open. Erick Miller was a seasoned jumper having completed more than 700 skydives.","filename":"data/vaneerConsumption/SkydiverErickMillerfounddeadafterparachutefailure.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0366500000578-0-image-a-2_1493216970195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447630_Skydiving-instructor-700-jumps-dead_1540264851.html","title":"Skydiver Erick Miller found dead after parachute failure","title_page":"Skydiver Erick Miller found dead after parachute failure | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"30-year-old Erick Miller was an experienced skydiver who was killed on Saturday evening\nA 30-year-old skydiver was found dead in a field in New York state after his parachute failed to open.\nErick Miller was a seasoned jumper having completed more than 700 skydives.\nHis main parachute and his reserve chute failed to deploy.\nThe Orleans County sheriff's office says Miller went skydiving with another person Saturday evening and jumped from a plane as it flew over the town of Barre, 30 miles west of Rochester.\nWhen the other person landed, Miller was nowhere to be found and his body was recovered later in a field.\n'The FAA, they're going to bring in some experts. They're going to analyze the equipment, they're going to analyze the photographs of the scene,' Orleans County Undersheriff Christopher Bourke told CBS affiliate WIVB.\nMiller's main parachute and reserve chute failed to deploy during his jump and he was later found dead in a field\nAuthorities are investigating his death and what caused the parachutes to fail\n'The theory is that he disconnected too late and the question is why. Why did he disconnect so late, because the chute should have been several hundred yards from him. It was approximately 30 feet from him.'\nMiller is described as a 'selfless & caring person who loved adventure,' according to his obituary. He leaves behind a wife, a large extended family, and close friends at the Western New York Sky Diving Club.\nThe investigation into his death is continuing.\nMeanwhile, the United States Parachute Association says 'the sport of skydiving continues to improve its safety record' in a recent report.\nAccording to data, there is less than a .01 per cent chance of dying while skydiving.\nMiller, who was also an instructor with Western New York Sky Diving Club, was participating in a sport jump with a friend\nPSA Director of the Safety and Training, Jim Crouch, said the sport is becoming safer and safer.\nEquipment is something jumpers are trained to check multiple times.\n'Typically they would either pack the parachute themselves or have a packer pack the parachute for them, but either way the system gets a check, a look over before it's put on and then after it's put on and adjusted everything is checked again to make sure all the handles are accessible and all the straps are adjusted properly,' Crouch said.","url":"https://www.dailymail.co.uk/news/article-4447630/Skydiving-instructor-700-jumps-dead.html"}
