{"authors":["Kristy Johnson","Charlotte Foster For Daily Mail Australia"],"date_download":"2018-10-22 20:55:02","date_modify":"2018-10-22 20:55:02","date_publish":"2017-03-16 00:11:14","description":"Former Big Brother star Skye Wheatley, 23, took to her Instagram story on Thursday, revealing her very pert derrière in Brazilian-cut briefs, as she joked that her rump has a heart.","filename":"data/vaneerConsumption/SkyeWheatleyrevealsveryplumprumpinskimpybriefs.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FDCA300000578-0-image-a-10_1489625555679.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318326_Skye-Wheatley-reveals-plump-rump-skimpy-briefs_1540241702.html","title":"Skye Wheatley reveals very plump rump in skimpy briefs","title_page":"Skye Wheatley reveals very plump rump in skimpy briefs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently sparked speculation that she went under the knife to enlarge her derrière.\nAnd former Big Brother star Skye Wheatley, certainly had no qualms in flaunting her very plump rump, via her latest Instagram story on Thursday.\nThe 23-year-old was seen clenching one glute in Brazilian-cut briefs, as she joked that her butt has a 'heart too.'\nScroll down for video\nThe butt of all jokes? Skye Wheatley, 23, flaunted her VERY plump rump in skimpy briefs shared to her Instagram story on Thursday, seen clenching one glute, as she revealed her derrière has a 'heart too'\nSkye, known for her obsession with Barbie doll-like proportions, was seen standing in a room, with her rear in full view.\nThe former reality star's petite upper frame was covered in a simple white T-shirt, while her very plump rump was exposed in just a pair of purple lace briefs.\nSeen pulsing one butt cheek, Skye found the activity hilarious, captioning the moment: 'My butt has a heart too okay,' alongside several laughing face emojis.\nHad a helping hand? The former reality star's recent derrière-centric Instagram snaps sparked speculation that Skye has had butt implants\nMeanwhile, Skye has been open about discussing her cosmetic surgery, as she famously talked about her botched breast augmentation in Thailand in 2015.\nThe Instagram model also makes sure to share videos to YouTube documenting her various procedures.\n'I like to look at myself as an ugly ducking,' she confessed on YouTube last year, before adding: 'And the older I get, the more improved I am.'\nShe's not shy: The Instagram model also makes sure to share videos to YouTube documenting her various cosmetic procedures\nThe Gold Coast-based personality sports a more slender figure these days compared to her time in the Big Brother house, but says that she 'hardly exercises' despite her toned physique.\nInstead, Skye insists that her enviable body is partly the result of a protein shake brand that she regularly endorses on Instagram.\nWhile the latest photos of her behind look like they have been enhanced, it could also be looking especially perky because of the all-important Instagram angle.\nBefore and after: Skye has undergone several cosmetic surgeries since appearing on reality series Big Brother in 2014\nConnected: Since appearing on the show, Skye has launched a career as an Instagram model\nOne of the biggest changes in Skye's appearance since her Big Brother days is her lips, with her now sporting a very plump pout.\nShe's openly admitted to trying Restylane lip fillers, but prefers to keep her pout large through Juvéderm instead.\nThe blonde also recently shared a selfie while modelling her new eyelash line, named after herself, following a collaboration with Australian lash company Majesty Lashes.\nSkye is now trying to make a reality TV comeback, having applied for both The Block and Australian Survivor.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318326/Skye-Wheatley-reveals-plump-rump-skimpy-briefs.html"}
