{"authors":["Sarah Fitzmaurice For Daily Mail Australia"],"date_download":"2018-10-22 20:50:38","date_modify":"2018-10-22 20:50:38","date_publish":"2016-01-29 04:08:08","description":"She's a reality star that has managed to successfully carve our a career on social media.","filename":"data/vaneerConsumption/SkyeWheatleysInstagramaccountisdeletedandsaysherpostsarehermainincome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AF1F0100000578-0-image-a-24_1454044575451.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422171_Skye-Wheatley-left-devastated-Instagram-account-deleted-reveals-posts-main-source-income_1540241438.html","title":"Skye Wheatley's Instagram account is 'deleted' and says her posts are her main income","title_page":"Skye Wheatley's Instagram account is 'deleted' and says her posts are her main income | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a reality star that has managed to successfully carve our a career on social media.\nBut Skye Wheatley has revealed that she's been left devastated after being unable to access her Instagram account.\nIn an exclusive chat to Daily Mail Australia on Friday, a teary Skye said she hadn't been able to log into her account for two days.\nScroll down for video\nAll over? Skye Wheatley has told Daily Mail Australia that her Instagram account, which is her main source of income has been 'deleted' and she's been left devastated and is seriously concerned about her career\n'When I realised I couldn't log in I bawled my eyes out, literally it makes me so scared. It's my life,' Skye explained.\n'I know it seems stupid but I tried to get a normal job. Instagram is my income, people think I'm so rich but I'm not.'\nSkye admitted she's worried about how being offline for so long will affect her work, given her main source of income comes from sponsored Instagram posts.\n'It's my life': Skye says she makes a living by posting to her Instagram page admitting to posting about 'two to four' promotional posts each week\n'My lifestyle is amazing, I get up and I can do whatever I want. I don't really spend too much time on my posts although obviously finding the right location and getting someone to take some pictures every week can take time, but it's not like a normal job.'\nFormer Big Brother star Skye, who makes a living by being paid for posts, admitted that she thought the incident, and the prospect of losing her 50k+ followers for good, has made her thankful for her lifestyle.\nShe admitted: 'I'm thinking the universe is telling me to be grateful for all the things I have. I think this is a lesson to learn.'\nThe busty blonde says she posts around two and four promotional posts a week but generally will only get paid for one post. She remained vague about how much she charges for a post and said that she supplements the income by doing a 'a little bit of make-up'.\nSelfie Queen: The blonde former reality star says she makes money by posting between two to four promotional posts a week and is worried that she'll loose her following if her account isn't reinstated\nShe explained: 'I’ll probably posts at least two to four promotional posts but I'll only get paid for one or two of those. People send me products and if I like them I'll recommend them to my followers and I'll either get free products or I might get paid per post.'\nSkye also admitted that she does use Photoshop and other applications to alter images before uploading them.\n'Sometimes I'll Photoshop a picture before I post it but other times I just like it the way it is and post it straight away,' adding: 'I've admitted it to my followers.'\nSkye first noticed that something was wrong with her Instagram account when she tried to log in on Wednesday. And after receiving an error message she tried to rectify the situation with application staff members.\nTweak: Skye, who underwent a breast augmentation last year, admitted that she sometimes alters her images using Photoshop\nAll over? Skye also told Daily Mail Australia that she and boyfriend Cameron McCristal have split up\n'I've been in contact with them and they asked me to confirm my identification,' she explained.\nBut despite her best efforts she is - as yet - unable to log into her account and the prospect of starting a new account is a daunting one.\nShe said: 'It's taken me a year to get to 54,000, from just 10,000 after I'm appeared on the show. I don't even want to think about [starting a new account] right now.'\nSkye's threat to her livelihood couldn't have come at a worse time and the busty blonde revealed she has recently called time on her romance with beau Cameron McCristal.\n'We broke up, my life is s*** right now' she said, adding: 'It's a long story.'\nOn the move: Skye has said she would like to move to Sydney in April and is hoping to secure a job as a TV presenter in future\nFitspo: The former reality star often spruiks protein drinks and supplements\n'I got told a few things. Something had happened.'\nBut while Skye admitted that social media has taken over her life she said that it wasn't to blame for her breakup.\n'My followers want me and Cameron to marry and have babies. Social media had nothing to do with the split.'\nAs Skye awaits to hear news of her Instagram account she is looking towards the future and a move from the Gold Coast to Sydney.\n'Ultimately I want to be back on TV. I haven't been approached about anything so I'm moving to Sydney after I've finished my make-up course, there is more opportunities there.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422171/Skye-Wheatley-left-devastated-Instagram-account-deleted-reveals-posts-main-source-income.html"}
