{"authors":["Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-22 22:58:18","date_modify":"2018-10-22 22:58:18","date_publish":"2017-04-26 06:20:47","description":"Former Big Brother star Skye Wheatley, 23, embarked on a bizarre quest to consume 10,000 calories in just one day.","filename":"data/vaneerConsumption/SkyeWheatleysquesttoeat10000caloriesinONEDAY.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CD76900000578-0-image-a-103_1493187499626.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446288_Skye-Wheatley-s-quest-eat-10-000-calories-ONE-DAY_1540249098.html","title":"Skye Wheatley's quest to eat 10,000 calories in ONE DAY","title_page":"Skye Wheatley's quest to eat 10,000 calories in ONE DAY | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the social media sensation with an obsession with obtaining Barbie doll-like proportions.\nBut Skye Wheatley put her aspirations aside on Sunday, to consume 10,000 calories in just one day.\nIn a YouTube clip posted on Tuesday, the 23-year-old revealed her meal plan including two-minute noodles, McDonald's, lollies and Nutella straight from the jar.\nScroll down for video\nTwo-minute noodles, McDonald's and Nutella straight from the jar: Skye Wheatley embarked on a bizarre quest to eat 10,000 calories in ONE DAY, documenting the experience to YouTube on Tuesday\n'It's 12 o'clock (in the morning) and I'm starting my 10,000 calorie challenge,' Skye revealed in her vlog on Sunday.\nThe challenge went off to a smooth start as the former Big Brother star consumed a cup of two-minute noodles and a sampling of Starburst snakes.\n'Guys, I found that it was easy because I'm obsessed with two-minute noodles,' Skye shared to camera.\nKeen to get her calorie count up, the personality indulged in a small size McDonald's fries, later finishing off a whole packet of Oreo biscuits.\nBig appetite: Keen to get her calorie count up, the personality indulged in a small size McDonald's fries, later finishing off a whole packet of Oreo biscuits, followed by a caramel frappe and hash brown\nCurious as to the effects of such a high calorie diet on her frame, Skye was sure to document the challenge with snapshots.\nStripping down to a pink g-string and a jumper scrunched just under her bust, the fashion model gave the camera a look at her legs, derrière and stomach from side on.\nSkye's stomach appeared bloated, while her lower half was not as defined as usual.\nEffects: Skye was sure to document the challenge with snapshots. Stripping down to a pink g-string and a jumper scrunched just under her bust, the fashion model gave the camera a look at her legs, derrière and stomach from side on\nDespite beginning to feel sick and lethargic, Skye was determined in her quest to reach the 10,000 calorie mark.\nHeading out with beau Cameron McCristal for another McDonald's run, the blonde picked up a large caramel frappe with whipped cream and a hash brown.\n'(I feel) Absolutely putrid. I feel so disgusting,' Skye told her legion of followers online.\nVowing to never eat the high calorie foods again, the makeup artist took her viewers through her complete list of daily meals and snacks.\nA day's work: The Instagram model is often draws attention to her taut torso and overall slender figure in social media photos, while promoting protein shakes\nStriking a pose: When not promoting brands and products, Skye shows off her figure in skimpy swimwear\nThe challenge comes as a surprise, with Skye's fanaticism for achieving what she perceives to be the perfect body.\nSkye can often be seen flaunting her incredibly taut torso and overall slender figure in skimpy attire to Instagram, while promoting protein shakes.\nHighly groomed, heavy makeup including a coating of lipstick over her plump pout and hair extensions, usually form the basis for the Gold Coast-based star's look.\nShe's not shy: Skye's Instagram snaps often see the star flaunting her Barbie-doll like proportions in skimpy attire","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446288/Skye-Wheatley-s-quest-eat-10-000-calories-ONE-DAY.html"}
