{"authors":[],"date_download":"2018-10-30 20:22:52","date_modify":"2018-10-30 20:22:52","date_publish":"2015-11-19 14:46:52","description":"Covington police are investigating whether suspects in a fatal purse-snatching at a Wal-Mart earlier this week have a connection to a Chattanooga poultry processing plant, where the victim’s credit card was found.","filename":"data/vaneerConsumption/SlainCovingtonpursesnatchvictimscreditcardfoundinTenn.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/19/Images/photos.medleyphoto.8407274.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_slain-covin_0e86e9e1883a9fa6203fd68349b7ea13__1540930972.html","title":"Slain Covington purse-snatch victim’s credit card found in Tenn.","title_page":"Slain Covington purse-snatch victim’s credit card found in Tenn.","title_rss":"NULL","source_domain":"ajc.com","text":"Covington police are investigating whether suspects in a fatal purse-snatching at a Wal-Mart earlier this week have a connection to a Chattanooga poultry processing plant, where the victim’s credit card was found.\nPolice believe a man seen on surveillance video struggling with Marsha Johnson before running over the woman Monday night outside the Wal-Mart at 103000 Industrial Blvd. fled to Tennessee with a female who was also in the vehicle.\nJohnson, who police said fell to the ground as the man grabbed her purse and then was run over multiple times by the same man, died later at Newton Medical Center.\nCovington detectives were in Chattanooga on Thursday distributing sketches of the couple suspected in the killing.\nCapt. Craig Treadwell said the victim’s VISA card had been found in a walkway of the Koch plant, leaving detectives to speculate that either the couple worked at the plant or had a friend or relative who did.\n“No one has been named a suspect,” Treadwell said at a news conference Thursday in Covington. “That is why we are in Tennessee distributing the flyers. We feel somebody there will know them or know somebody who knows them.”\nThere was no indication that the Johnson’s bank card had been used, police said.\nAfter the attack on the Covington woman, the suspects drove off in a silver or gray, mid- to late-1990s Honda Accord, police said. The car has damage on the driver’s side door and may have a dealer drive-out tag, police said.\nThe bank card is one of the department’s strongest leads at this time despite running down numerous tips about the couple, who are also suspected in a violent purse-snatching in St. George, S.C., Treadwell said.\nA week ago, a 75-year-old woman was walking into a Family Dollar store in St. George when she was approached by a woman who pointed a handgun at her head and grabbed her purse, police said.\n“As the victim fought to keep her purse, the victim felt a gun against her head heard the click where the suspect had pulled the trigger, but the gun did not fire,” St. George police said in a statement. The victim fell to the ground, breaking the purse strap, and the suspect ran to a car with a man inside. The two then drove off with the victim’s purse.\nThe couple appeared to match the description of the couple involved in the Covington incident, and the getaway vehicle was similar to the one seen in surveillance video in Covington: a gray Honda Accord with paper tags.\nTreadwell said the descriptions of the couple and car and the fact that both crimes were in close proximity to I-20 made detectives believe the same two people were responsible for both crimes and are possibly on a crime spree.\nIn the Covington case, Treadwell said surveillance video made him think that the driver did not see Johnson before he initially struck her with his vehicle.\n“But there is no way possible that he could not have known she was under the vehicle,” Treadwell said. “That is what the death penalty is for - these totally innocent victims. They are shopping at the Wal-Mart and the next thing they are dead.”\nPolice also have announced a $10,000 reward for information leading to the arrest and conviction of Johnson’s killer.","url":"https://www.ajc.com/news/crime--law/slain-covington-purse-snatch-victim-credit-card-found-tenn/eSptTfBjxtpUXhwWpdMKoM/"}
