{"authors":[],"date_download":"2018-10-30 01:05:53","date_modify":"2018-10-30 01:05:53","date_publish":"2018-07-19 19:33:48","description":"Google penalized $5.1 billion by European Union for using their own apps on Android phones. It's a money-grubbing act by the EU to get money for nothing.","filename":"data/vaneerConsumption/SlapontheWristorSlapintheFaceEUFinesGoogle5Billion.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/04/google-europe3.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861553.html","title":"Slap on the Wrist or Slap in the Face? EU Fines Google $5 Billion","title_page":"Slap on the Wrist or Slap in the Face? EU Fines Google $5 BillionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"If you searched ” Google” on Google yesterday, two headlines would appear. First, the European Union levied a 5.1 billion dollar anti-trust fine against Google regarding its Android operating system. Second, Google unveiled plans to lay an additional trans-Atlantic cable from Virginia to France.\nAssuming that trust busting is economically beneficial, the EU’s actions against Google are unfounded. In a tweet from European Commission’s anti-trust chief Margrethe Vestager, Google is accused of limiting competition by pre-installing apps onto the Android platform. If you already have an app that works fine, why look for alternatives? Per a tweet from Vestager:\nFine of €4,34 bn to @Google for 3 types of illegal restrictions on the use of Android. In this way it has cemented the dominance of its search engine. Denying rivals a chance to innovate and compete on the merits. It’s illegal under EU antitrust rules. @Google now has to stop it — Margrethe Vestager (@vestager) July 18, 2018\nThese apps include YouTube, Google Maps, Google Play, Gmail, Google search, and Chrome internet browser. The EU wants to level the playing field by getting rid of these ‘bloatware’ apps.\nSo Google can’t put Google applications on software Google developed? Sure.\nThe EU’s decision matches past anti-trust verdicts, but is much harsher. On top of the $5 billion, Google faces rolling fines of up to 5% of its yearly revenue until the ‘problem’ is fixed. In typical European fashion, this money would be equally distributed to member states.\n“Rapid innovation, wide choice, and falling prices are classic hallmarks of robust competition and Android has enabled all of them,” Google’s CEO Sundar Pichai said in a blog post,” Today’s decision rejects the business model that supports Android, which has created more choice for everyone, not less. We intend to appeal.”\nAnd appeal they should. The decision enables poor competitors to limp on at the detriment of consumers.\nMoving onto the second headline, the trans-Atlantic cable, shows where Google’s profits are going—tech innovation and development. Cutting into Google’s profits, especially in an unjustified manner, is economically backwards. Google and other tech companies are weary of bureaucratic oversight and will take moves to counter government overreach.\nFor their part, it’s kind of the EU to provide fresh regulation examples for ECON 101 students.","url":"https://spectator.org/slap-on-the-wrist-or-slap-in-the-face-eu-fines-google-5-billion/"}
