{"authors":["Adam Crafton For Mailonline"],"date_download":"2018-10-23 01:22:25","date_modify":"2018-10-23 01:22:25","date_publish":"2017-03-16 11:17:35","description":"Slaven Bilic has called for West Ham attacking stars Michail Antonio and Andy Carroll to be called up for England when coach Gareth Southgate announces his squad this afternoon.","filename":"data/vaneerConsumption/SlavenBilicwantsEnglandtopickWestHamduo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E539F4000000578-0-image-a-74_1489662813840.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319712_Slaven-Bilic-wants-England-pick-West-Ham-duo_1540257745.html","title":"Slaven Bilic wants England to pick West Ham duo","title_page":"Slaven Bilic wants England to pick West Ham duo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Slaven Bilic has called for West Ham attacking stars Michail Antonio and Andy Carroll to be called up for England when coach Gareth Southgate announces his squad.\nCarroll last played for England four years ago but he finds himself in good form, with four goals in six games.\nAntonio, meanwhile, has demonstrated his versatility and goalscoring threat, after bagging nine goals for West Ham this season.\nAndy Carroll should be called up to the England squad according to Slaven Bilic\nMichail Antonio is another Bilic feels should be involved in Gareth Southgate's squad\nWith England's forward options depleted by injuries to Harry Kane, Daniel Sturridge and Wayne Rooney, Bilic is hopeful his players will included in Southgate's squad.\n'We are going to see,' Bilic said. 'Both of them are having a good time, playing good, scoring goals. It's about the whole team. They are the ones who are most responsible for finishing or creating chances or creating space for someone else to get the chance.\n'If you add now that England have some injury problems, it will maybe open the gate for them. It's good for them to have a call-up. It gives you more confidence.'\nBilic believes it would give his players added confidence to be brought in by England\nBilic also admitted he shared co-chairman David Sullivan's concerns, after the club director said the team are conceding too many goals early in halves of games and the 'the situation cannot go on' following last week's 3-2 defeat by Bournemouth.\n'It was a comment on that game and I said also we can't be happy with the way we performed and how we conceded the three goals. We have to improve and bounce back. The players know I was not happy about the performance.\n'They were not happy in the dressing-room. They were frustrated. We played against a good opponent but they missed a penalty, we scored a goal and we were in a good position. From our point of view, we have to bounce back and we are ready for that.'","url":"https://www.dailymail.co.uk/sport/football/article-4319712/Slaven-Bilic-wants-England-pick-West-Ham-duo.html"}
