{"authors":["Robin Hilton"],"date_download":"2018-10-22 20:08:20","date_modify":"2018-10-22 20:08:20","date_publish":"2014-10-20 00:00:00","description":"Eight years after going on indefinite hiatus, the trio is back. They'll release a new album on Jan. 20 called No Cities to Love. Hear the song \"Bury Our Friends\" now.","filename":"data/vaneerConsumption/SleaterKinneyReunitesAnnouncesNewAlbum.json","image_url":"https://media.npr.org/assets/img/2014/10/20/sleaterkinney_2014_brigittesire_01_print_wide-ead87760e062afcd95504b69a31f2701edcc1433.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2014_10_20_357434514_sleater-kinney-reunite-announce-new-album_1540238900.html","title":"Sleater-Kinney Reunites, Announces New Album","title_page":"Sleater-Kinney Reunites, Announces New Album : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"\"I feel like creativity is about where you want your blood to flow. Because in order to do something meaningful and powerful there has to be life inside of it. Maybe after The Woods that blood had thinned; we felt enervated, the focus had become disparate and diffuse. We drifted apart in order to concentrate on other elements of our lives and careers. Sleater-Kinney isn't something you can do half-assed or half-heartedly. We have to really want it. And you have to feed that hunger and have the energy to. I'm not saying we need to be in a dark place to be in Sleater-Kinney. In fact, we could be in the best places in our lives. But we have to be willing to push, because the entity that is this band will push right back.\n\"We had no desire to revisit sounds and styles and paths we had treaded before. But in order to move forward, Corin and I worked together in a way that was more reminiscent of earlier albums like Dig Me Out. Meaning that we would write just the two of us and then bring songs to Janet later on in the process. I think we had to go back to an earlier model of writing in order to reacquaint ourselves with the language of the band. It's a sonic vernacular that isn't easily translated into other contexts in which we've played. This was a very deliberate writing process, there were many edits and iterations of the songs. We thought a lot about melody and structure.\n\"I spent a lot of time writing choruses for this record. Melody is what I was most picky about. I really drove Corin crazy sometimes. We would have choruses that we would work on for hours, days, maybe on and off over a matter of weeks. And we'd think we had solved it, but then I would listen to it later on and decide to discard it, that it wasn't good enough. I did that with my guitar parts too. In the end we were all more scrutinizing with our own parts than we ever have been. I think we didn't want to take any second of the song for granted, everything had to have an intention and earn its place.\"","url":"https://www.npr.org/sections/allsongs/2014/10/20/357434514/sleater-kinney-reunite-announce-new-album"}
