{"authors":[],"date_download":"2018-10-30 18:20:35","date_modify":"2018-10-30 18:20:35","date_publish":"2014-10-30 04:00:00","description":"Wading into the late-October cinematic no-man’s-land comes Colin Firth, and not for the first time this year.","filename":"data/vaneerConsumption/SleepisFirthsfourthof2014yetsuccesshasbeennegligible.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_movies_sleep-_dc8d74cfdc089073e699e650445b2294__1540923635.html","title":"‘Sleep’ is Firth’s fourth of 2014,yet success has been negligible","title_page":"‘Sleep’ is Firth’s fourth of 2014,yet success has been negligible","title_rss":"NULL","source_domain":"ajc.com","text":"Wading into the late-October cinematic no-man’s-land comes Colin Firth, and not for the first time this year. “Before I Go to Sleep” opens today, a twist-ridden thriller with Nicole Kidman as an amnesiac, stuck between her doctor (Mark Strong) and husband (Firth).\n“Before I Go to Sleep” is Firth’s fourth movie to come out here in 2014. Not that you might have noticed. It’s been a busy year, but not necessarily a good one. “Before I Go to Sleep” opened to tepid reviews in the United Kingdom last month. The Telegraph called it “chilly and uninvolving.”\nBefore this, Firth took the lead in Woody Allen’s “Magic in the Moonlight,” one of the director’s weaker movies of late. He played a private investigator in Atom Egoyan’s West Memphis Three biopic “Devil’s Knot,” but audiences took a pass. Earlier this year he teamed again with Kidman for “The Railway Man,” to a lukewarm reception.\nColin Firth it seems, one Academy Award later and 20 years later, is still running from the ghost of Mr. Darcy. It has been a tough task, with often mixed results.\nFirth’s portrayal of the aloof romantic protagonist in Jane Austen’s “Pride and Prejudice” - and in particular the footage of Firth emerging dripping in water from a lake - burned him into the minds of women across the world and set him up as a paragon of old-fashioned Britishness.\nThe 1995 “Pride and Prejudice” adaptation took Firth, then in his mid-30s, from his place as a nationally known British actor bouncing around the stage and BBC and turned him into an international icon.\nFirth was not a fan of the ensuing fuss. “It honestly doesn’t mean anything to me,” he told the U.K.’s the Independent in 2000. The next year he told the Daily Mail that for six years, no matter what he was doing, he hadn’t been mentioned in a single headline that didn’t make some pun on the Mr. Darcy name.\nThings got even weirder last year when a 12-foot statue of Mr. Darcy modeled on Firth was built and underwent a tour of Britain.\nDespite the monument, Firth’s feelings about Darcy hadn’t faded in time. “I’ve spent years trying to figure out why Mr. Darcy’s fully clothed swim in his breeches and shirt caused such a sensation,” Firth said in August.\nFirth had smaller roles in best picture winners “Shakespeare in Love” and “The English Patient” following “Pride and Prejudice.” But it was trying to spite Mr. Darcy’s legacy that gave him his second career spike, playing Mark Darcy - a character his portrayal of Mr. Darcy inspired - in the film adaptation of “Bridget Jones’s Diary.”\n“I hoped to ridicule and liberate myself once and for all from the character,” Firth told Vanity Fair.\nWhether he has done so is up for debate. Firth still chooses his films like a man keeping people guessing; mainstream musical in “Mamma Mia,” children’s fare with “Nanny McPhee” and tween hits like “What a Girl Wants” all mixed in with period films and more serious drama.\nMany of Firth’s moves have looked smart on paper but crashed spectacularly. He paired with Uma Thurman in the 2009 romantic comedy “The Accidental Husband,” but it was never released in America. International movie reviewers weren’t excited about it, either. British critics bagged it as “insufferable” and “ludicrous.”\n“Gambit” put Firth alongside Cameron Diaz in 2012 in a crime caper written by the Coen Brothers, but the movie was released in only one theater in America. The New York Times declared it to have “all the fizz of flat soda.”\nHis portrayal of a depressed, gay college professor in “A Single Man” saw him nominated for best actor in 2009, and he went that one better and won the next year for his portrayal of King George in “The King’s Speech” before starring in “Tinker Tailor Soldier Spy” in 2011, which was Oscar-nominated as well.\nIt hasn’t always been pretty, but when you look at a run like that, you have to accept that there’s some definite genius among the Good, the Bad and the Firth.","url":"https://www.ajc.com/entertainment/movies/sleep-firth-fourth-2014-yet-success-has-been-negligible/XfRYdjFIU4eJ2QVpwMmABK/"}
