{"authors":[],"date_download":"2018-10-22 21:29:40","date_modify":"2018-10-22 21:29:40","date_publish":"2014-06-05 15:15:48","description":"The young stabbing survivor of a twisted plot in the woods of Wisconsin \"is a fighter and is improving each and every day,\" her parents said.","filename":"data/vaneerConsumption/SlenderManVictimsParentsOurLittleGirlIsaFighter.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/484231/stabbing-ejo-60214_66b495f1fea0a68afcfef54f3eaac06d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_slender-man-victims-parents-our-little-girl-fighter-n123566_1540243780.html","title":"'Slender Man' Victim's Parents: 'Our Little Girl Is a Fighter'","title_page":"'Slender Man' Victim's Parents: 'Our Little Girl Is a Fighter'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe young stabbing survivor of a twisted plot in the woods of Wisconsin \"is a fighter and is improving each and every day,\" her parents said in a statement on Thursday.\n\"Our little girl is a fighter,\" the parents of the 12-year-old girl who was stabbed nearly to death 19 times on Saturday in the Milwaukee suburb of Waukesha, said. \"We appreciate your patience, love and support, as we too are stunned and saddened by this tragedy.\"\nThey also asked for the girl's anonymity and for their family's privacy to be honored. Their statement came a day after a hospital spokesperson told the Milwaukee Journal Sentinel that the girl's condition had been upgraded from critical but stable to fair.\nInvestigators say the victim was lured into the woods by two friends, also 12 years old, under the guise of a game of hide-and-seek before she was stabbed on her arms, legs and torso and left for dead by the two other girls. One of her stab wounds was a millimeter away from a major artery in her heart.","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/slender-man-victims-parents-our-little-girl-fighter-n123566"}
