{"authors":[],"date_download":"2018-10-22 21:30:00","date_modify":"2018-10-22 21:30:00","date_publish":"2014-06-03 21:46:23","description":"Two girls recently named Slender Man as the reason they allegedly stabbed another girl in the woods. But who is Slender Man?","filename":"data/vaneerConsumption/SlenderManCitedinStabbingIsaGhoulfortheInternetAge.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/486811/140604-slender-man-mn-1025_38657ca06440ae0054f026eab61806c3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_slender-man-cited-stabbing-ghoul-internet-age-n121741_1540243800.html","title":"'Slender Man' Cited in Stabbing Is a Ghoul for the Internet Age","title_page":"'Slender Man' Cited in Stabbing Is a Ghoul for the Internet Age","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGaunt and faceless in a black suit, the Slender Man is a fiend made to stalk the dreams of the Internet era.\nWhen two 12-year-old girls were asked why they allegedly lured a third girl into the Wisconsin woods and stabbed her 19 times, they gave the police a name: Slender Man. The suspects appeared in court on Monday.\nHe might be a mystery to adults, but to many kids, Slender Man is as recognizable as Dracula. He is often found lurking, an eerie Where’s Waldo?, in the back of blurry photos online. He has long, spider-like limbs, no face, and stories say he can hypnotize children into walking into his embrace.\nFrom fake “archival photos” and “police recordings” to an elaborate background story and faux documentaries about the spectral figure, Slender Man is a crowd-sourced creation that, in another century, could have numbered among Grimms’ fairy tales.\nSlender Man, sometimes written as \"Slenderman,\" has only been around since 2009, when someone created him as part of a Photoshop contest for the humor site SomethingAwful.com. Since then, he has become the subject of fan art, elaborate stories and YouTube videos.\nThe girls claimed that they aspired to be “proxies” of Slender Man when they allegedly lured the victim out to the woods for a game of hide-and-seek the morning after a sleepover. Using a knife with a five-inch blade, they allegedly stabbed the 12-year-old victim and fled, leaving her to crawl away and be discovered by bicyclists, according to the criminal complaint.\nOrigins\nIn June 2009, a person using the online moniker “Victor Surge,\" possibly a reference to Russian revolutionary writer Victor Serge, submitted two photos to a thread called “create paranormal images” on SomethingAwful.com. Each contained an abnormally tall, faceless man lurking behind children, one with the caption:\n“We didn’t want to go, we didn’t want to kill them, but its persistent silence and outstretched arms horrified and comforted us at the same time…” – 1983, photographer unknown, presumed dead.\n“Victor Surge” is actually Eric Knudsen, who said he was seeking a copyright on the character as recently as January of this year.","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/slender-man-cited-stabbing-ghoul-internet-age-n121741"}
