{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 01:51:54","date_modify":"2018-10-23 01:51:54","date_publish":"2016-01-11 13:16:13","description":"Slovakian nun Maria Pavla Hudacekova has taken the world by storm after her stunning ice skating display while wearing her full habit was captured on video in Bratislava.","filename":"data/vaneerConsumption/Slovakianiceskatingnuntakesinternetbystorm.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A6DCF00000578-0-image-a-6_1452517915789.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393819_Slovakian-ice-skating-nun-takes-internet-storm_1540259514.html","title":"Slovakian ice-skating nun takes internet by storm","title_page":"Slovakian ice-skating nun takes internet by storm | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An ice skating nun is taking the world by storm after her amazing display of skill in Slovakia went viral on the internet.\nThe nun in question was videoed with several of her sisters in the capital Bratislava dressed in their full habits skating gracefully at a public rink.\nBut she stood out among the rest after showing off techniques more suited to the Winter Olympics including a 12-spin pirouette.\nMaria Pavla Hudacekova, pictured, is taking the world by storm with her ice skating display in Slovakia\nSister Maria of Ursulines of the Roman Union wows the crowds with her tricks while dressed in full habit\nShe was joined by 10 fellow nuns on the ice but stood out with jumps, twirls and pirouettes\nIt was later revealed the figure skating nun - Maria Pavla Hudacekova or Sister Maria of Ursulines of the Roman Union, was a former junior champion skater in her youth.\nThe video was taken by a teenager watching his young sister perform on the ice - until he noticed the astonishing sight unfolding before him.\nDavid Fico wrote a story about it on his blog 'May Dave Blog', where he likened what he witnessed to the Hollywood movie 'Sister Act'.\nDavid wrote: 'More than 10 nuns appeared on ice and started ice skating. It was too hilarious for words, but also strange at the same time.\n'I felt so... I don't even know how to describe that feeling. And what really what touched me the most was that they were all so happy.\n'I could feel the happiness that shone from them. They appreciated the moment, ice skating around each other. And they were all really pretty!\nSister Maria was revealed to have been a junior champion skater in her youth and still practices today\n'One of the nuns started figure skating. It was so nice and suddenly my little sister asked her to teach her some skating skills too.'\nSister Maria told Christian news website Zasvateny Zivot: 'I did not like ice skating races, but I liked to perform. My joy was in the audience.'\nShe said she took her holy orders a decade ago after a difficult end to a love affair, but still finds time for her favourite hobby around her spiritual duties.\nShe said: 'I used to hold religious meetings with ice hockey players. I spoke to them about Jesus and supported them.'","url":"https://www.dailymail.co.uk/news/article-3393819/Slovakian-ice-skating-nun-takes-internet-storm.html"}
