{"authors":[],"date_download":"2018-10-30 21:56:23","date_modify":"2018-10-30 21:56:23","date_publish":"2016-01-29 16:58:14","description":"Slovakia's foreign minister said the low percentage of migrants so far relocated to EU member states under the migrant quota system show it is not working.","filename":"data/vaneerConsumption/SlovakiaSaysMigrantQuotaSystemNotWorkingUrgesRethink.json","image_url":"https://media.breitbart.com/media/2016/01/Screen-Shot-2016-01-23-at-14.52.14.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_29__1540936583.html","title":"Slovakia Says Migrant Quota System Not Working, Urges Rethink","title_page":"Slovakia Says Migrant Quota System Not Working, Urges Rethink ","title_rss":"NULL","source_domain":"breitbart.com","text":"Reuters – Slovakia’s foreign minister said on Friday the very low percentage of migrants so far relocated to European Union member states under the bloc’s compulsory quota system showed it was not working and he called for a rethink.\nEastern EU member states are mostly opposed to the quota system, which is strongly backed by Germany, the main destination for more than one million migrants who have arrived in Europe over the past year, many fleeing conflicts.\nSlovak Foreign Minister Miroslav Lajcak said only 0.2 percent of a total 160,000 migrants due to take part in the scheme – already a small minority of those now inside the EU – had so far been redistributed among EU member states.\n“Clearly it (the quota system) doesn’t work. Compulsory quotas are not a solution … are not feasible,” Lajcak said after talks with his Slovenian counterpart during a one-day trip to Ljubljana.\n“We need a sustainable, credible, complex solution … We are asking the EU to speed up that process.”\nMany of the migrants have escaped war in Syria and Iraq, entering the EU from Turkey and working their way north via Greece and the Balkans. The tiny ex-Yugoslav republic of Slovenia has already seen nearly 60,000 migrants pass through its territory in this month alone headed for northern Europe.\nEU interior ministers agreed last September on the current scheme to redistribute some of the migrants to help relieve pressure on Germany and several other wealthier countries such as Sweden that are the main destinations.","url":"https://www.breitbart.com/europe/2016/01/29/slovakia-says-migrant-quota-system-not-working-urges-rethink/"}
