{"authors":[],"date_download":"2018-10-30 21:54:26","date_modify":"2018-10-30 21:54:26","date_publish":"2016-03-09 09:25:37","description":"Slovenia announced Tuesday that it will refuse the transit of most migrants through its territory in a bid to seal off the Balkan route used by hundreds of thousands of people seeking a new life in Europe.","filename":"data/vaneerConsumption/SloveniatoBanTransitofMigrantsasCrisisSpirals.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-494326182-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_09__1540936466.html","title":"Slovenia to Ban Transit of Migrants as Crisis Spirals","title_page":"Slovenia to Ban Transit of Migrants as Crisis Spirals","title_rss":"NULL","source_domain":"breitbart.com","text":"Slovenia announced Tuesday that it will refuse the transit of most migrants through its territory in a bid to seal off the Balkan route used by hundreds of thousands of people seeking a new life in Europe.\nThe dramatic twist in Europe’s tangled migrant crisis could set off a domino effect among Balkan states, with Serbia swiftly indicating it would follow Ljubljana’s lead and Croatia and Macedonia also expected to follow suit.\nThe moves to shut down the main route used by the vast influx of migrants hoping to find asylum or better economic prospects in northern Europe come barely a day after the EU and Turkey agreed a proposal aimed at easing the crisis.\nEU officials hailed Monday’s deal with Ankara as an important breakthrough, but the head of the UN refugee agency cast doubt on its legality, while Amnesty International said the plan “dealt a death blow to the right to seek asylum”.\nSlovenia’s interior ministry said that from midnight (2300 GMT), access would only be granted to “foreigners meeting the requirements to enter the country”, those wishing to claim asylum, and migrants selected “on a case by case basis on humanitarian grounds and in accordance with the rules of the Schengen zone”.\nMore than a million people have crossed the Aegean Sea into Greece since the start of 2015, many from Syria, Afghanistan and Iraq and most aiming to reach wealthy Germany and Scandinavia, causing deep divisions among EU members about how to deal with Europe’s worst migration crisis since World War II.\nSerbia said that following Slovenia’s move, it would “align all measures with the European Union” and impose the same restrictions at its borders with Macedonia and Bulgaria.\nSlovenia and Serbia, along with Austria, Croatia and Macedonia, have dramatically restricted entry to migrants in recent weeks, leaving a bottleneck of some 36,000 stuck at the Greek-Macedonian border, unable to continue their journey.\n– Legal doubts –\nTurkey, currently hosting 2.7 million Syrian refugees, is the key springboard for migrants making the perilous sea crossing to Greece. Efforts to stem the flow have failed, with nearly 2,000 migrants landing on the overstretched Greek islands every day in February.\nAt talks in Brussels on Monday, the EU agreed in principle to a Turkish proposal to take back all illegal migrants landing on the Greek islands.\nAnkara also proposed an arrangement under which the EU would resettle one Syrian refugee from camps in Turkey in exchange for every Syrian that Turkey takes from Greece, in a bid to reduce the incentive for people to board boats for Europe.\nEuropean Commission chief Jean-Claude Juncker called the plan a “real game changer” and insisted it was “legally feasible”, but it sparked concern from UN refugee chief Filippo Grandi.\n“As a first reaction I’m deeply concerned about any arrangement that would involve the blanket return of anyone from one country to another without spelling out the refugee protection safeguards under international law,” Grandi told the European Parliament in Strasbourg.\nRights group Amnesty International said the proposal was full of “moral and legal flaws” and along with Human Rights Watch challenged the idea that Turkey was a “safe country” to which migrants could return.\n“The idea of bartering refugees for refugees is not only dangerously dehumanising, but also offers no sustainable long-term solution to the ongoing humanitarian crisis,” Amnesty’s Iverna McGowan said.\nUN Secretary General Ban Ki-moon, speaking in Berlin alongside German Chancellor Angela Merkel — a key player in the migrant drama — said he was “concerned that many EU countries are adopting increasingly restrictive asylum policies”.\n– ‘Shame and disgrace’ –\nAfter talks in the western Turkish city of Izimr on Wednesday, Turkey’s Prime Minister Ahmet Davutoglu and his Greek counterpart Alexis Tsipras pledged to work together to implement the plan.\nTsipras said the situation in the Aegean, where hundreds of migrants have drowned already this year making the perilous crossing in rickety boats, was a “shame and disgrace to our culture”.\nGreece and Turkey also renewed their commitment to a 2002 protocol on the readmission of migrants, which has rarely been activated before now, in the hope that its use could transform the refugee crisis.\nBut securing a deal at another European summit next week may still be difficult given the deep divisions that the migration crisis has sown in the bloc.\nHungary’s hardline anti-migration Prime Minister Viktor Orban may veto the resettlement deal, while Cyprus said it remained opposed to accelerated EU accession talks for Turkey.","url":"https://www.breitbart.com/europe/2016/03/09/slovenia-to-ban-transit-of-migrants-as-crisis-spirals/"}
