{"authors":["Associated Press"],"date_download":"2018-10-23 03:49:28","date_modify":"2018-10-23 03:49:28","date_publish":"2017-04-26 15:30:51","description":"NEW YORK (AP) - Halfway through Valentine's Day, florist Ajay Kori realized he was in the midst of a disaster.His company wasn't going to be able to deliver...","filename":"data/vaneerConsumption/SmallbusinessescanfeelbiggereffectsfromaPRdisaster.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448104_Small-businesses-feel-bigger-effects-PR-disaster_1540266568.html","title":"Small businesses can feel bigger effects from a PR disaster","title_page":"Small businesses can feel bigger effects from a PR disaster | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Halfway through Valentine's Day, florist Ajay Kori realized he was in the midst of a disaster.\nHis company wasn't going to be able to deliver many of the promised roses and other flowers by the end of the day. Angry customers started venting online, posting negative reviews of UrbanStems on sites like Google and Yelp. It was a public relations nightmare.\nWhen a small business has a crisis, it can in some ways be more vulnerable than a behemoth like United Airlines, which got plenty of attention this month after video of a passenger being dragged off a plane went viral. Small businesses don't have big revenue streams and cash reserves to cushion them if customers flee. And negative reviews about a local business can turn away prospective customers for weeks, months or longer.\nKori knew he had to move quickly to limit the damage from this past Valentine's Day and save both his company's reputation and the business itself.\n\"We sent out emails personally apologizing to every customer and gave them a refund,\" says Kori, whose company is based in Washington, D.C., and delivers in five metropolitan areas around the country. UrbanStems delivered the flowers without charge over the next few days. And it called disappointed recipients to let them know it was the company, not their sweethearts, that let them down.\nHis response shows the advantage small companies can have: They don't have multiple tiers of executives who often use precious time discussing what to do rather than taking action, says Scott Sobel, a senior executive at public relations firm kglobal.\n\"The smaller the business, the more quickly you can react,\" Sobel says. \"The longer you wait, the more damage is going to happen.\"\nUnited was criticized not only for the April 9 incident, but its fumbled response. CEO Oscar Munoz issued a series of statements in which he initially blamed the passenger before apologizing for United's handling of the situation.\nWhen a company makes a mistake, experts roundly agree it needs to own up to it swiftly and show that it's sincerely trying to make amends.\n\"Being disingenuous will hurt you,\" Sobel says. \"You should try and negotiate ... and ask, 'how can we make it right for you?\"\nThe steps Kori took, which included giving his personal cellphone number to unhappy customers, worked. Most deleted negative reviews. Some offered to help deliver flowers. Sales are up over last year.\n\"If you build goodwill, it makes any crisis easier to navigate,\" says Beth Monaghan, CEO of InkHouse PR, based in Waltham, Massachusetts. Her company has not worked with Kori.\nSometimes a PR crisis befalls a company through no fault of its own.\nWine importer Selena Cuffe was preparing to unveil South African wine in Dallas in October 2014 when a man visiting the city from Liberia died from Ebola. The wine was being launched at a Sam's Club but publicity for the event was canceled amid growing fears that the virus was spreading to the U.S.\n\"We expected about 10,000 people to come\" to the launch, says Cuffe, co-owner of Los Angeles-based Heritage Link Brands. She ended up selling fewer than 40 bottles, and was left with nearly 9,000 cases of the wine, which was produced by the family of the late South African President Nelson Mandela.\nMindful of many people's concern about products from Africa, Cuffe knew she couldn't do a traditional marketing campaign. So Heritage Link Brands hired a PR agency to plot a strategy that included trying to educate consumers. Cuffe talked with journalists about the wine, and the fact that it had been produced thousands of miles away from where the Ebola outbreak occurred. She's since been able to sell most of the wine, and used a similar strategy after importing wines from Brazil last year, when the Zika virus was in the news.\nWhen Priska Diaz and her husband Dana King began advertising their baby bottles in 2012, they launched a social media campaign including Twitter, Facebook and blogs. Most of the posts highlighted that the design of the Bare Air-free bottles helps mothers breastfeed after using bottles - something many struggle to do. But several tweets implied that because the bottles could free mothers from nursing every few hours, they could help couples rekindle their romance; the tweets told men to \"reclaim your wife,\" Diaz says.\n\"The message came out really wrong and offended a great deal of moms and dads around the globe,\" she says. The result was a stream of angry, even threatening emails and online posts.\nDiaz posted an apology on Facebook and Twitter. It took about six months for the anger to die down. The bottles, which began selling in 2013, are doing well. But Diaz has learned that bad publicity may not go away completely in an online world; sometimes she still runs across an angry blog item.\nBecause social media has made it easier for bad publicity to spread quickly, businesses should get help from someone who knows how to manage a crisis, Monaghan says.\n\"Once it has gone viral, every step you take matters,\" she says.\nBut nothing that restaurant owner Gretchen Hanson tried worked to end her PR crisis well. Hanson was accused of discriminating against an autistic woman in 2015 after she had asked the young woman and her friend to make room on a bench outside her Hobos eatery in Rehoboth Beach, Delaware, for waiting customers.\nHanson, who says she didn't know the young woman was autistic, became the subject of angry social media posts including bad reviews of her restaurant. Hobos' rating on TripAdvisor plunged, and so did business, with the number of diners dropping more than 50 percent some nights. A letter to the editor in a local newspaper did more damage.\n\"I had always been on top. Now I was fighting to stay open because the perception of my restaurant had changed,\" Hanson says.\nHanson says she tried to speak to the young woman's mother, and friends wrote letters to the newspaper on her behalf. She tried to get the negative reviews changed but couldn't - a problem faced by most establishments that have bad online reviews.\nHanson gave up and closed Hobos 18 months after the incident. Business hadn't returned to the same level, and Hanson's heart wasn't in the restaurant anymore. \"I no longer loved it,\" she says.\n_____\nFollow Joyce Rosenberg at www.twitter.com/JoyceMRosenberg . Her work can be found here: http://bigstory.ap.org/content/joyce-m-rosenberg","url":"https://www.dailymail.co.uk/wires/ap/article-4448104/Small-businesses-feel-bigger-effects-PR-disaster.html"}
