{"authors":[],"date_download":"2018-10-22 21:06:41","date_modify":"2018-10-22 21:06:41","date_publish":"2014-05-05 22:41:52","description":"No one was home, and the pilot was able to walk away from the scene.","filename":"data/vaneerConsumption/SmallPlaneCrashesIntoColoradoHomePilotEscapes.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/421846/140505-co-plane-crash-house-jms-1816_48466b808f4ca9e4bf010e7cda9c75b1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_small-plane-crashes-colorado-home-pilot-escapes-n97671_1540242401.html","title":"Small Plane Crashes Into Colorado Home, Pilot Escapes","title_page":"Small Plane Crashes Into Colorado Home, Pilot Escapes","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA small plane crashed into a Colorado home Monday, but the pilot was able to walk away and no one else was injured, authorities said.\n\"A Piper PA-25 Pawnee crashed into a residence after experiencing trouble while towing a banner over Northglenn, Colorado,\" the Federal Aviation Administration said in a statement. \"The pilot escaped from the aircraft and parachuted safely to the ground before the aircraft went down.\"\nNo one was home when the plane went down about 3:30 p.m. (5:30 p.m. ET) in the suburb of Denver.\nThe crash ignited small fires around the house, which firefighters were still trying to extinguish Monday afternoon, Sara Farris, a spokeswoman for the North Metro Fire District, told NBC News.\nThere was no immediate explanation for the crash and there was no unusual weather in the area.\nOfficials at Rocky Mountain Airport, the closest airfield, told NBC station KUSA of Denver that the plane didn't take off from there and wasn't scheduled to land there.\n— Sossy Dombourian and M. Alex Johnson","url":"https://www.nbcnews.com/news/us-news/small-plane-crashes-colorado-home-pilot-escapes-n97671"}
