{"authors":["Christopher Dhanraj","The Blackrock Blog"],"date_download":"2018-10-30 23:59:21","date_modify":"2018-10-30 23:59:21","date_publish":"2018-07-14 00:00:00","description":"Small caps have outperformed mid caps and large caps this year.","filename":"data/vaneerConsumption/Smallcapsstocksarebooming.json","image_url":"https://amp.businessinsider.com/images/5b48fcab744a986d048b4a19-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_small-caps-stocks-are-booming-2018-7_1540943961.html","title":"Small-caps stocks are booming","title_page":"    Small-caps stocks are booming - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders work on the floor of the NYSE in New York Thomson Reuters\nU.S. small-cap stocks have surged this year, hitting new highs in June 2018. The benchmark S&P Small Cap 600 Index has gained around 11% in 2018, out-performing the large cap S&P 500 by more than 5% during this period (Chart 1).\nBloomberg\nSeveral key factors have contributed to the small-cap rally this year:\n1. Fiscal policy, namely tax reform\nSmall-cap companies tend to source a larger portion of their revenue domestically compared to large caps. As such, they pay an estimated corporate tax rate of around 32% vs. 28% for larger firms.[1] Recent tax cuts passed by Congress therefore benefit smaller companies more than larger ones-a trend that has contributed to out-performance at the sector level within small caps, especially amongst tax-heavy sectors such as financials and telecoms (Chart 2).\nBloomberg\nMergers and acquisition activity has also driven small-cap performance (Chart 3).\nBloomberg\n2. Solid domestic economic growth\nU.S. small caps are nearly twice as sensitive to changes in domestic economic growth as large caps, and much less sensitive to international economies.[2] This relative domestic preference has helped U.S. small caps as economic data have remained robust while European data have weakened substantially.\n3. Dollar strengthening\nSmall-cap companies on average are less exposed to foreign markets and currency fluctuations than larger companies. The U.S. dollar has rallied more than 5% against a basket of foreign currencies since April. [3] This has led to relative foreign currency weakness that has eroded large-cap companies' overseas profits, resulting in lower earnings and equity valuations. In contrast, small companies enjoyed lower input costs for imported raw materials due as the U.S. dollar has strengthened.\nETP flow data suggests that investors are coming around to the small-cap story. Flows into U.S. listed ETP products with exposure to U.S. small-cap shares have more than doubled from less than $2 billion in March to $5 billion month to date in June. [4]\nStill, there are a number of risks when it comes to small caps. Historically, small-cap stocks have outpaced large-cap stocks during the initial expansionary phase of an economy cycle, helped by their high sensitivity to rebounding economic growth and low interest rates. However, small caps tend to under-perform large caps in recessions as growth reverses and financing condition tighten, especially given higher debt leverage levels.\nThompsonReuters\nWhile we don't see a recession on the horizon in the next few months, we do believe we are in the later stages of the expansion. As such, the days of the small-cap boom may be numbered.","url":"https://www.businessinsider.com/small-caps-stocks-are-booming-2018-7"}
