{"authors":[],"date_download":"2018-10-22 20:45:01","date_modify":"2018-10-22 20:45:01","date_publish":"2016-01-28 03:30:51","description":"More than 1.4 billion smartphones were shipped worldwide last year in a new high for the sector with Chinese handset makers racking up the biggest gains, an ...","filename":"data/vaneerConsumption/Smartphoneshipmentshitrecordhighin2015report.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5dq-4vVdYopwYQ7f641721b07a8074ad-360_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420334_Smartphone-shipments-hit-record-high-2015-report_1540241101.html","title":"Smartphone shipments hit record high in 2015: report","title_page":"Smartphone shipments hit record high in 2015: report | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Smartphone shipments hit record high in 2015: report\nMore than 1.4 billion smartphones were shipped worldwide last year in a new high for the sector with Chinese handset makers racking up the biggest gains, an industry tracker said.\nGlobal smartphone shipments for 2015 jumped slightly more than 10 percent to an unprecedented 1.43 billion, said International Data Corporation (IDC), releasing its preliminary figures on Wednesday.\nSouth Korean consumer electronics giant Samsung remained the top smartphone maker, shipping 85.6 million units in the final quarter and 324.8 million for the year, according to the IDC's Worldwide Quarterly Mobile Phone Tracker report.\nGlobal smartphone shipments for 2015 jumped slightly more than 10% to an unprecedented 1.43 billion, according to International Data Corporation ©Philippe Lopez (AFP/File)\nSecond-place Apple shipped a record-setting 74.8 million iPhones in the quarter and were up slightly more than 20 percent to 231.5 million units for the year, said IDC, a day after Apple warned that iPhone sales are set to fall for the first time.\n\"Apple assured the public that demand for its premium smartphones is still alive and kicking,\" said IDC's Anthony Scarsella, referring to the new figures.\n\"A new record-setting quarter for Apple indicates consumers continued demand for Apple's latest offerings regarding upgraded hardware and software.\"\nSamsung faces increasing pressure from US-based Apple in the high-end smartphone market and from Chinese firms such as Xiaomi and Huawei when it comes to mid or low-priced handsets, according to IDC.\n\"Usually the conversation in the smartphone market revolves around Samsung and Apple, but Huawei's strong showing for both the quarter and the year speak to how much it has grown as an international brand,\" said IDC's Melissa Chau.\n\"While there is a lot of uncertainty around the economic slowdown in China, Huawei is one of the few brands from China that has successfully diversified worldwide.\"\nHuawei shipped 32.4 million smartphones in the final quarter of 2015, pushing its total for the year to 106.6 million.\nHuawei became the fourth mobile phone maker ever to ship more than 100 million units in a year, joining Apple, Samsung and Nokia.\n\"Huawei is poised to be in a good position to hold onto a strong number three over the next year,\" Chau said.","url":"https://www.dailymail.co.uk/wires/afp/article-3420334/Smartphone-shipments-hit-record-high-2015-report.html"}
