{"authors":["Associated Press"],"date_download":"2018-10-22 22:49:58","date_modify":"2018-10-22 22:49:58","date_publish":"2017-04-26 05:45:21","description":"SYDNEY (AP) - Captain Cameron Smith will become the second Australian player to make 50 test appearances when the Kangaroos meet New Zealand in a one-off...","filename":"data/vaneerConsumption/Smithnamedtoplay50thleaguetestforAustralia.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446320_Smith-named-play-50th-league-test-Australia_1540248598.html","title":"Smith named to play 50th league test for Australia","title_page":"Smith named to play 50th league test for Australia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SYDNEY (AP) - Captain Cameron Smith will become the second Australian player to make 50 test appearances when the Kangaroos meet New Zealand in a one-off rugby league international on May 5.\nSmith is Australia's second most-capped player after Darren Lockyer, who retired after 59 tests including 38 as captain.\nSmith will be leading Australia for the 27th time in the test at Canberra, matching the great Clive Churchill as its second most-capped captain.\nThe 34-year-old, a 10-time State of Origin winner, has also played 343 matches in Australia's National Rugby League, closing on Lockyer's record of 355 matches which he should surpass this season.\nCoach Mal Meninga, who named his starting lineup for the test on Wednesday, said Smith's \"incredible milestones\" would be a major part of Australia's test preparation.\nMeninga has favored Darius Boyd at fullback over Billy Slater but said despite a long battle with injuries, Slater's international career is not over. The 34-year-old Slater played his most-recent test in 2015 and has been out of action recently after a shoulder reconstruction.\n\"He's getting back to somewhere near his best form from injury extremely well,\" Meninga said. \"It's very pleasing to see him in the game but we felt that Darius deserves to retain his spot.\n\"He was man of the match in the Four Nations final at Liverpool (in November) and he's in great form at the moment so we just chose to go that way.\"\nThe selectors have largely retained faith in Australia's Four Nations champions, dropping Canberra front-rower Shannon Boyd while losing Greg Inglis and Matt Scott to injuries.\nMeninga warned form in the coming match would be important in the selection of his World Cup squad in October.\n\"This test match was picked based on our loyalty and their success in the Four Nations, the way they've been playing at the beginning of the year as well,\" he said. \"That doesn't mean to say we'll be true to this at the back end of the year when we get through the season, finals footy and Origin.\"\nCanterbury Bulldogs forward David Klemmer has replaced the injured Scott in the starting lineup while St George Illawarra's Josh Dugan comes into the side at centre for Inglis.\n____\nAustralia: Darius Boyd, Blake Ferguson, Josh Dugan, Will Chambers, Valentine Holmes, Johnathan Thurston, Cooper Cronk, Aaron Woods, Cameron Smith (captain), David Klemmer, Boyd Cordner, Matt Gillett, Trent Merrin. Reserves: Michael Morgan, Josh Papalii, Tyson Frizell, Sam Thaiday. Shannon Boyd (18th man), James Maloney (19th man), Justin O'Neill (20th man).","url":"https://www.dailymail.co.uk/wires/ap/article-4446320/Smith-named-play-50th-league-test-Australia.html"}
