{"authors":["Dana Varinsky"],"date_download":"2018-10-30 23:35:13","date_modify":"2018-10-30 23:35:13","date_publish":"2016-12-06 00:00:00","description":"Smithfield Foods has vowed to cut emissions in its US supply chain by 25% by 2025. That's roughly equivalent to taking 900,000 cars off the road.","filename":"data/vaneerConsumption/SmithfieldFoodswillreduceitsemissionsby44milliontonsby2025.json","image_url":"https://amp.businessinsider.com/images/584704a9ba6eb602688b6b7a-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_smithfield-foods-reduce-emissions-2016-12_1540942513.html","title":"Smithfield Foods will reduce its emissions by 4.4 million tons by 2025","title_page":"    Smithfield Foods will reduce its emissions by 4.4 million tons by 2025 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Daniel Acker/Reuters Agriculture accounts for approximately 10% of US greenhouse gas emissions — not counting the pollution created by packaging and transport.\nOn December 5, a major livestock company announced its plans to help alleviate that problem.\nSmithfield Foods, the world's largest producer of pork, has vowed to cut emissions in its US supply chain by 25% by 2025. That's a reduction of nearly 4.5 million tons, which is roughly equivalent to closing 1.5 coal power plants or taking 900,000 cars off the road.\nSmithfield collaborated with the Environmental Defense Fund in setting the goal, which is based on the company's 2010 emissions. To accomplish it, the company plans to make changes on all levels of its supply chain. Smithfield said it will modify fertilizer use so that farms emit less nitrous oxide, install renewable energy projects at 30% of its company-owned farms, upgrade equipment to be more energy efficient, and optimize logistics to lower emissions from transportation and shipping.\n\"While we will have unique challenges meeting this goal as the world's largest pork processor and hog producer, our size and scale also means that, if successful, we can make a significant, positive impact,\" said Smithfield president and CEO Kenneth Sullivan in a statement.\nThe agriculture industry does have a significant ability to help mitigate climate change, since the sector is known for producing methane. A 2014 White House report estimated that 36% of human-related methane emissions come from agriculture. That's problematic because one ton of the gas can absorb 28-36 times more energy than carbon dioxide over a 100-year period. (Greenhouse gasses cause the Earth's temperature to rise by absorbing energy and insulating the planet.)\nSullivan told the Wall Street Journal that Smithfield's plan is apolitical, and is neither a response to regulatory pressure nor a statement about President-elect Donald Trump's pledge to scale back environmental regulations.\nRather, he said, customers are now simply more sensitive to environmental issues.","url":"https://www.businessinsider.com/smithfield-foods-reduce-emissions-2016-12"}
