{"authors":[],"date_download":"2018-10-22 23:26:17","date_modify":"2018-10-22 23:26:17","date_publish":"2017-03-10 02:58:09","description":"Japan is moving to pass its strictest-ever smoking laws, but the country's powerful tobacco lobby wants to stub out measures that were adopted years ago by...","filename":"data/vaneerConsumption/SmokingparadiseJapantriestokickthehabit.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/06/wire-194299-1489126693-649_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299832_Smoking-paradise-Japan-tries-kick-habit_1540250777.html","title":"Smoking paradise Japan tries to kick the habit","title_page":"Smoking paradise Japan tries to kick the habit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In Japan smoking is still allowed in most bars, restaurants and cafes and many owners fear a ban would lead to losing customers\nJapan is moving to pass its strictest-ever smoking laws, but the country's powerful tobacco lobby wants to stub out measures that were adopted years ago by other developed nations.\nThe government is keen to change Japan's image as a puffing paradise -- smoking is still allowed in most bars, restaurants and cafes -- as Tokyo gets set to host millions of visitors for the 2020 Olympics.\nThe health ministry is to submit a proposed law to parliament by June that would ban smoking in many restaurants, as well as public facilities.\nThe smoking minority\nIf approved, rule-breakers would face a penalty of 300,000 yen ($2,600).\nBut the proposals, unveiled last week, have already been watered down from an initial push for a broad ban on indoor smoking, which ran up against strong opposition from former state monopoly Japan Tobacco (JT) and many small business owners, who fear they'll lose customers.\nEstablishments can build a separate smoking room under the latest proposal.\nAnd places with less than 30 square metres (320 square feet) of floor space would not be affected by the restrictions at all -- excluding a huge number of establishments in space-challenged Japan.\n\"It would be better if it's completely banned\" in restaurants, Kumiko Tanaka, a 27-year-old non-smoker, told AFP.\n\"But I don't mind as long as smoking areas are strictly separated.\"\nEven the less-expansive rules could be headed for trouble, however, as opposition brews within the ruling Liberal Democratic Party (LDP).\nMore than 240 Japanese municipalities restrict lighting up on city streets, meaning smokers must get their fix in clearly marked smoking zones\nGaffe-prone finance minister Taro Aso recently questioned the long-established link between smoking cigarettes and lung cancer.\nAnd this week, the LDP's parliamentary affairs chief Wataru Takeshita bemoaned the proposals, as a group in his party suggested restaurant owners instead be allowed to choose -- and display their smoking status on the door.\n\"As a cigarette lover, I feel like this is not a good idea -- how would I live if smoking is banned everywhere?\" Takeshita told reporters.\n- 'Really late' -\nJapan's government gets billions of dollars annually in cigarette tax revenue, and still owns a one-third stake in JT -- the third-biggest global tobacco company with brands including Winston, Camel and Benson & Hedges.\nThis conflict leaves anti-smoking campaigners fuming in a country where cigarettes sell for around 430 yen ($3.75) a pack, and carry only modest health warning labels.\nIt is a far cry from other developed nations, including Australia and France, which have wide-ranging bans on smoking in public places and large, graphic health warnings on cigarette packs, which sell for two or three times more than in Japan.\nAlmost 50 countries have blanket bans on smoking indoors.\n\"We are really late,\" said Yumiko Mochizuki, a board member at the Japan Society for Tobacco Control (JSTC).\n\"And we were given a very bad score by the World Health Organization.\"\nProposed new anti-smoking measures are opposed by former state monopoly Japan Tobacco and small business owners\nThe global health body has given Japan its lowest rating for efforts to prevent passive smoking -- just 10 percent of restaurants are non-smoking.\nJapan even scores poorly among other Asian nations with smoking cultures such as China and South Korea.\n\"Countries such as the Republic of Korea, Hong Kong, Singapore, Australia, New Zealand, Vietnam and cities including Beijing and Shanghai China... have already introduced comprehensive smoking bans,\" said Susan Mercado, a Manila-based director at the WHO.\nSmoking kills some 130,000 people in Japan annually, with another 15,000 dying of second-hand smoke related illnesses, Mercado added.\nDespite its many smoking venues, tobacco use in Japan has been falling in line with a broader global trend.\nMore than half of Japanese men smoked in 2000. That number dropped to just below 30 percent in 2016.\n- 'Unbalanced, unreasonable, excessive' -\nJapan Tobacco said the proposed smoking rules are cause for concern.\n\"We are worried that the bill would be unbalanced, unreasonable and excessive,\" the company said.\nJapan cannot be compared to other nations with strict indoor-smoking bans because outdoor smoking is limited to certain designated areas, JT said.\nMore than 240 Japanese municipalities restrict lighting up on city streets, meaning smokers must get their fix in clearly marked smoking zones.\nBut the decade-old bylaws were brought in more to promote good manners and keep cigarette butts off the streets rather than for public health reasons.\nCampaigners said less smoking will be a hit with millions of tourists visiting for the Olympics in three years, and might just enhance Japan's famous service culture, known as omotenashi.\n\"It's the last ingredient that we need to give people our best hospitality,\" said JSTC president Manabu Sakuta.","url":"https://www.dailymail.co.uk/wires/afp/article-4299832/Smoking-paradise-Japan-tries-kick-habit.html"}
