{"authors":[],"date_download":"2018-10-22 21:57:08","date_modify":"2018-10-22 21:57:08","date_publish":"2014-05-08 19:16:15","description":"Snapchat settled with the Federal Trade Commission over charges that it misled users over how private their data was.","filename":"data/vaneerConsumption/SnapchatGets20YearsofScrutinyOverFTCPrivacyCharges.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_07/176736/140210-snapchat-jms-1549_9638b44af6d1ea04de161023cdfb9c7a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_snapchat-gets-20-years-scrutiny-over-ftc-privacy-charges-n100661_1540245428.html","title":"Snapchat Gets 20 Years of Scrutiny Over FTC Privacy Charges","title_page":"Snapchat Gets 20 Years of Scrutiny Over FTC Privacy Charges","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"If a company markets privacy and security as key selling points in pitching its service to consumers, it is critical that it keep those promises,\" FTC Chairwoman Edith Ramirez said in a statement. \"Any company that makes misrepresentations to consumers about its privacy and security practices risks FTC action.\"\nSnapchat was one of the first “ephemeral messaging” apps to hit the market. It became popular by letting users send photos that disappear once they are viewed. It also introduced text and video messaging earlier this month.\nThe problem, the FTC case alleged, was that users could take screenshots of photos and download third party apps that save all of the content that is supposed to disappear.\nThe FTC also claimed that Snapchat collected email contacts from iOS users without their notice or consent and that the company failed to fix security flaws in its “Find Friends” feature that led to users send photos to complete strangers “under the false impression that they were communicating with a friend.”\nSnapchat settled without admitting or denying any wrongdoing. The company agreed to revise its privacy policy and will be monitored by an independent privacy professional for the next 20 years.\n\"While we were focused on building, some things didn’t get the attention they could have,\" the company wrote in a blog post, claiming that it had resolved most of the issues raised by the FTC and it was investing \"heavily in security and countermeasures to prevent abuse.\"","url":"https://www.nbcnews.com/tech/tech-news/snapchat-gets-20-years-scrutiny-over-ftc-privacy-charges-n100661"}
