{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:48:10","date_modify":"2018-10-30 21:48:10","date_publish":"2017-01-11 12:09:07","description":"Tillerson will advise U.S. Senators to that the United States should be “clear-eyed” about Russia, according to his prepared remarks released by the Trump campaign. Tillerson will also call for eliminating ISIS as an important step to thwarting radical Islamic terrorism. | Politics","filename":"data/vaneerConsumption/SneakPeekRexTillersononRussiaChinaandtheIslamicState.json","image_url":"https://media.breitbart.com/media/2017/01/Rex-Tillerson-profile-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_11__1540936090.html","title":"Sneak Peek: Rex Tillerson on Russia, China, and the Islamic State","title_page":"Sneak Peek: Rex Tillerson on Russia, China, and the Islamic State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump’s pick for Secretary of State Rex Tillerson plans to speak directly on combatting the challenges posed by Russia, China, and the threat of radical Islamic terrorism during his confirmation hearing in the Senate Wednesday.\nTillerson will advise U.S. Senators to that the United States should be “clear-eyed” about Russia, according to his prepared remarks released by the Trump campaign.\n“Russia today poses a danger, but it is not unpredictable in advancing its own interests,” Tillerson will say.\nRussia’s decision to invade Ukraine, annex Crimea, and support a dictator in Syria, Tillerson argues, is a result of Obama sending “weak or mixed signals” as president.\n“Our NATO allies are right to be alarmed at a resurgent Russia,” he plans to say. “Russia must know that we will be accountable to our commitments and those of our allies, and that Russia must be held to account for its actions.”\nTillerson will suggest that the United States can work with Russia to fight terrorism, but will call for “an open and frank dialogue” between the two nations.\nOn China, Tillerson will argue against their “island-building” in the South China Sea and the need to challenge their economic and trade practices.\n“China has proven a willingness to act with abandon in pursuit of its own goals, which at times has put it in conflict with America’s interests,” he plans to say. “We have to deal with what we see, not with what we hope.”\nTillerson will call for eliminating ISIS as an important step to thwarting radical Islamic terrorism.\n“Defeating ISIS must be our foremost priority in the Middle East,” he will say, promising to focus more attention on al-Qaeda and the Muslim Brotherhood after ISIS is is destroyed.","url":"https://www.breitbart.com/politics/2017/01/11/sneak-peek-rex-tillerson-russia-china-radical-islam/"}
