{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:03:30","date_modify":"2018-10-30 20:03:30","date_publish":"2015-10-28 10:24:46","description":"After\ntwo years of secrecy and high anticipation\n, Greg Best, David Bies...","filename":"data/vaneerConsumption/SneakapeekatTiconderogaClubopeningatKrogStreetMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/28/Images/WPIMAGE_cmgajcfoodandmore_5031.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_sn_b9e3ef2f26fc905c6358d7426eef3559__1540929810.html","title":"Sneak a peek at Ticonderoga Club, opening at Krog Street Market","title_page":"Sneak a peek at Ticonderoga Club, opening at Krog Street Market","title_rss":"NULL","source_domain":"ajc.com","text":"After two years of secrecy and high anticipation , Greg Best, David Bies, Paul Calvert, Bart Sasso and Regan Smith are finally set to open Ticonderoga Club for dinner on Thursday at 5 p.m.\nMuch of the buzz has been about Best and Calvert , two of Atlanta’s most visionary bartenders. But the business they are opening with three of their best friends is not quite what you might expect.\nIn fact, the big take-away from a recent sneak peek and conversations with Best, Bies and Calvert is that this place is first and foremost meant to be a restaurant and a partnership of creative equals.\nBest and Smith are well known as the former beverage and front of house team behind Holeman & Finch Public House. Calvert has been involved in beverage programs at the Sound Table, Pura Vida and most recently Victory Brands and Paper Plane. Bies was chef de cuisine at Restaurant Eugene before taking some time to travel the world seeking culinary adventures. Sasso is the co-founder of Esperanza ATL apparel and design and served as the creative director at Resurgens Hospitality.\nTogether, with help from Atlanta design firm ai3, they’ve created a setting that aims to be both quirky and comfortable, serving food and drink that’s classic but executed with contemporary flair, and offering the kind hospitality and camaraderie they’d show friends.\nWords that come up to describe what they’re after include tavern, townie bar, local and pub. But not one quite captures a place that takes its name from a historic fort and mixes nautical and colonial American themes with whimsical touches like a ships’s hatch fitted to the bathroom door and pant legs painted under the front of the bar.\n“The two ideas that govern the design of the restaurant and the food and drink menus are focus and generosity,” Calvert said. “We wanted to focus on what we love and what makes sense for our food and what makes sense for the space and really be the best at that.”\n“We recognized that we were very much stepping out of the path that both of us had been walking,” Best said. “A lot of people were probably expecting us to open the next big cocktail bar. We will have cocktails and they will be fantastic. But we are not a cocktail bar.”\nThat said, the duo had definite ideas about the drink menu, which is surprisingly nimble and stars the Ticonderoga Cup, the julep-inspired, punch-like “cup of the house.” It’s made with rum, cognac, sherry and lemon and served over crushed ice in a dimpled copper cup with a huge sprig of mint.\n“We’re using ingredients that fit the house to make drinks that are food friendly,” Calvert says. “Our drinks may contain spirits like rum, brandy, madeira and sherry. But our beverages are for the most part very lean and rustic and refreshing. We’re serving drinks that can be paired with David’s food”.\nBest and Calvert both point to Bies as the secret behind the secret of Ticonderoga Club.\nWhen we spoke, Bies was busy tweaking the method for cooking a crispy pork knuckle, a gnarly but succulent hunk plated with kraut and stout gravy. Asked about the design for the menu, he went back to a bit of his history.\n“When I left Restaurant Eugene in 2009, I’d been the chef de cuisine for almost five years, and it would have been very easy to go from one empire to another,” Bies said. “But I didn’t want to do that. It was a time in my life when I could pack my things and go where I wanted. So I just left the country and traveled primarily in Asia and then did a little Europe and lived in Central America.\n“Naturally, this menu has influences from my travels, but not necessarily flavor-wise. It’s more methods and there are influences from growing up here in Georgia, and influences from my partner’s travels and where they grew up. But the menu doesn’t have a theme. There are underlying tones. We’re going to allow the menu, just like Ticonderoga Club itself, to become what it is organically and slowly.”\nHere’s a sneak peek of what to expect when Ticonderoga Club opens its doors.\nShrimp in Katafi with farm egg yolk and house Worcestershire sauce. Photo credit: Mia Yakel Photography\nButternut squash salad with green mango, pomegranate, herbs, peanuts, dried shrimp, maple nuoc mam. Photo credit: Mia Yakel Photography\nYukon Gold Hasselback Potato. Photo credit: Mia Yakel Photography\nSlow roasted half duck with sauce. Photo credit: Mia Yakel Photography\nPork knuckle with sauerkraut and stout gravy. Photo credit: Mia Yakel Photography\nSpiede sandwich lunch special with potato chips and a bottle of Moxie. Photo credit: Mia Yakel Photography","url":"https://www.ajc.com/blog/atlanta-restaurants/sneak-peek-ticonderoga-club-opening-krog-street-market/6bOb3QgTMOPM0kCwwxVzjJ/"}
