{"authors":["Ian Hanchett"],"date_download":"2018-10-30 21:30:25","date_modify":"2018-10-30 21:30:25","date_publish":"2015-02-01 04:58:36","description":"\"Saturday Night Live\" took a jab at the Seattle Seahawks one week after making fun of the New England Patriots for \"Deflategate.\"","filename":"data/vaneerConsumption/SNLMocksSeahawksinPreSuperBowlShow.json","image_url":"https://media.breitbart.com/media/2015/01/SNL-Open-131-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_01_31__1540935025.html","title":"SNL Mocks Seahawks in Pre-Super Bowl Show","title_page":"SNL Mocks Seahawks in Pre-Super Bowl Show | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NBC’s “Saturday Night Live” took a jab at the Seattle Seahawks one week after making fun of the New England Patriots for “Deflategate.”\nIn the sketch, Seahawks cornerback Richard Sherman and running back Marshawn Lynch host a Super Bowl preview show. Lynch initially refuses to answer even basic questions. Sherman then turns to the Seahawks fans who say they’ve been fans “since the beginning, of 2013.”\nSherman then says he wants to begin the show “the way I always do, by verbally assaulting someone who’s already lost,” in this case, he picks New York City Mayor Bill de Blasio (D) for trying to shut down the city over the recent blizzard, saying that he’s “seen bigger blizzards at Dairy Queen” and that “the only way you shut down a whole city is you put Richard Sherman on it. Boom! I went to Stanford!”\nSherman then turns to the Patriots Deflategate scandal, showing Patriots fans what a “real football looks like,” in this case a football with the same dreadlocks as Sherman.\nThe duo is then joined by Seahawks Coach Pete Carroll, who Sherman unsuccessfully tries to goad into trash talking the Patriots, but Carroll is ultimately the only person who can get Lynch to comment on the discussion.\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2015/01/31/snl-mocks-seahawks-in-pre-super-bowl-show/"}
