{"authors":["Anneliese Cooper"],"date_download":"2018-10-30 22:33:51","date_modify":"2018-10-30 22:33:51","date_publish":"2014-08-15 01:06:53","description":"When Chris Kattan was arrested for a DUI this past February, striking a Department of Transportation car that was cordoning off a section of the 101 Freeway while purportedly under the influence of Ambien, he initially pled not guilty to the…","filename":"data/vaneerConsumption/SNLsChrisKattanSentencedto3YearsProbationMoreforDUIDontDrinkDriveKids.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/771e3fba-4612-4f86-9c81-884e233290d3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35874-snls-chris-kattan-sentenced-to-3-years-probation-more-for-dui-dont-drink_1540938831.html","title":"'SNL's Chris Kattan Sentenced to 3 Years Probation & More for DUI - Don't Drink & Drive, Kids","title_page":"'SNL's Chris Kattan Sentenced to 3 Years Probation & More for DUI — Don't Drink & Drive, Kids","title_rss":"NULL","source_domain":"bustle.com","text":"When Chris Kattan was arrested for a DUI this past February, striking a Department of Transportation car that was cordoning off a section of the 101 Freeway while purportedly under the influence of Ambien, he initially pled not guilty to the offense, though the judge still ordered him to attend twice-weekly AA meetings in the interim. Now, the case has finally come to a close, with a slightly more severe ruling: According to TMZ, Kattan will face 3 years' probation, a $500 fine, 3 months of alcohol counseling, and 104 mandatory Narcotics Anonymous meetings.\nIn addition, TMZ makes note of the actor's required participation in the \"Hospital to the Morgue\" program, which they describe as \"a scared straight type of program where he'll see first-hand the consequences of dangerous behavior.\" (Given the name, one imagines these \"first-hand consequences\" might look somewhat like corpses.) Hopefully, the court's proposed treatment program is effective; as we know all too well, the disease of addiction is deadly enough to the addict themselves, let alone to those they might endanger through actions like DUIs. Luckily, the car Kattan hit was empty and he left the accident unharmed — the better now to get better, even at a court's say-so.","url":"https://www.bustle.com/articles/35874-snls-chris-kattan-sentenced-to-3-years-probation-more-for-dui-dont-drink"}
