{"authors":["Jerome Hudson"],"date_download":"2018-10-30 20:35:08","date_modify":"2018-10-30 20:35:08","date_publish":"2016-07-09 19:25:30","description":"Snoop Dogg held a presser with L.A. Mayor Garcetti and Police Chief Charlie Beck, saying he was there to show \"love\" to L.A. Police.","filename":"data/vaneerConsumption/SnoopDoggtoLAPoliceWeAreHeretoShowLoveandSupportatMarchforPeace.json","image_url":"https://media.breitbart.com/media/2016/07/Snoop-Dogg-The-Game-peace-march-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_07_09__1540931708.html","title":"Snoop Dogg to L.A. Police: 'We Are Here to Show Love and Support' at March for Peace","title_page":"Snoop Dogg to L.A. Police: 'We Are Here to Show Love and Support' at March for Peace | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Long Beach, California-based rapper Snoop Dogg held a press conference Friday with Los Angeles Mayor Eric Garcetti and Los Angeles Police Chief Charlie Beck outside the Los Angeles Police Department’s headquarters, where the Grammy-nominated artist said, “We are here to show love and support to the Los Angeles Police Department.”\n“Thank y’all for allowing us to have a conversation. We appreciate it,” he added.\nSnoop was joined by fellow California rapper, The Game, who shared his feelings about Alton Sterling and Philando Castile, the two men killed in separate police-involved shootings this week.\n“I was angry. Sitting on my couch, I couldn’t rest. I couldn’t sleep,” The Game said in front of a gaggle of news reporters.\n“Then, out of nowhere on the news, five police are ambushed by Lord-knows-who-and-what. And they died. And I felt that pain, as well, and I was saddened that that happened as a result of what happened earlier this week.”\n“Those are human beings,” The Game said of the five murdered police officers and seven others who were wounded after Houston New Black Panther Party member Micah X. Johnson ambushed and opened fire on them Thursday during a Black Lives Matter protest in Dallas, Texas.\n“I came to a realization that we are really, really destroying humanity,” The Game continued. “While I have all these cameras on me, I want to tell everyone that has their eyes on me that I love you — no matter your race, what school you teach, whoever you are in the world.\n“This is a day of change. Embrace yourself in positivity,” he pleaded.\nThe two rappers’ comments came after they led and organized a peaceful march Friday in Los Angeles, meant to break down barriers between “men of all races” and law enforcement across the country.\nThe Game took to social media to post a letter about the reasons behind the march, along with videos expressing “love.”\nH.U.N.T the movement !!! #HATEUSNOTTODAY #HUNTUSNOTTODAY A video posted by The Game (@losangelesconfidential) on Jul 8, 2016 at 8:27am PDT\nDuring the press conference Friday, Los Angeles Police Chief Charlie Beck said he was “angry” and “full of rage” after learning about the massacre of law enforcement officers in Dallas.\n“I’m an old man, and I don’t get angry easily, but I was angry. I was full of rage,” Beck said. “But I came to the realization that this cannot continue. We cannot continue to be broken up into tribes.”\nConcerning the Dallas gunman, Beck said, “He was an assassin. That is all that person can be called. Those police officers are there because they agree with your ability to express your opinion. That is crime against America.”\n“Our hearts are with all of the victims and their families in Dallas,” said Los Angeles Mayor Eric Garcetti. “The horrific violence against @DallasPD is an attack on our democracy. All Americans must unite against hate, join together in peace.”\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/07/09/snoop-dogg-to-l-a-police-we-are-here-to-show-love-and-support-at-march-for-peace/"}
