{"authors":["Kaileen Gaul For Dailymail.Com"],"date_download":"2018-10-23 04:59:03","date_modify":"2018-10-23 04:59:03","date_publish":"2017-03-10 15:03:11","description":"Winter Storm Reggie is expected to drop up to six inches of snow on the New York City metro area Friday according to the Weather Channel .","filename":"data/vaneerConsumption/SnowstartstohitNewYorkinlateseasonwinterstorm.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/19/3E24C24F00000578-0-image-a-26_1489175407273.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301592_Flakes-start-falling-messy-late-season-storm_1540270743.html","title":"Snow starts to hit New York in late season winter storm","title_page":"Snow starts to hit New York in late season winter storm | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Almost 39 million people are being hit with snow in the northeast region over the next few days.\nWinter Storm Reggie is expected to drop up to six inches of snow on the New York City metro area Friday according to the Weather Channel.\nFriday morning, parts of New York, Connecticut, Rhode Island and southeast Massachusetts received 2-5 inches in snow.\nScroll down for video\n‹ Slide me › Thursday vs Friday: People are out and about enjoying the 60 degree weather in Union Square (left) the day before snow hits Friday morning (right)\n‹ Slide me › Thursday vs Friday: Pedestrians only need a light jacket as they walk around New York City on March 9. The next day, most people wear longer coats as temperatures drop to the 30s\nNew Yorkers walk through a wintry mix of snow and sleet during the morning rush hour in Brooklyn\nThe cold weather comes a month after Winter Storm Niko dropped nine inches of snow in the tri-state area (pictured, Central Park on Friday)\nA woman rides a bike during a snow storm on the Coney Island boardwalk which is covered with a blanket of snow\nThe day after New York City temperatures reached a high of 61 degrees the city was hit with flurries of sleet and snow Friday morning\nA maintenance worker in Pennsylvania uses a snow blower to clear the snow from the front of a school Friday for the first snow in the region in over a month\nParts of New York, Connecticut, Rhode Island, southeast Massachusetts and Philadelphia (pictured) were hit with Winter Storm Reggie\n‹ Slide me › Thursday vs Friday: People who work near Washington Square Park enjoy their lunch on the steps of the NYC landmark. On Friday, most people eat inside\nThursday, there was a balmy high of 61 degrees in the Big Apple. However, Friday morning New Yorkers woke up to snow flurries which are expected to last until this afternoon.\nThis weekend is not going to be even chillier with temperatures dropping to the 20s. More snow is expected to hit the northeast on Tuesday.\nA storm from the Midwest is projected to merge with another off the Mid-Atlantic coast creating a stronger storm according to Accuweather.\nTuesday's storm has the potential to become a blizzard depending on how close to the coast the Mid-Atlantic storm tracks.\nJay Engle, a meteorologist for the National Weather Service told the New York Times: 'We didn’t have a February, so I guess we’re having a February now.'\nWinter Storm Reggie is New York City and Philadelphia's first snow in almost a month.\n‹ Slide me › Thursday vs Friday: The sun is shining sky is blue on 11th street outside of Grace Church in New York City. The next day, it could not be more bleak as temperatures drop to the 30s\n‹ Slide me › Thursday vs Friday: A sun-drenched intersection on Thursday is gloomy the next day in New York City as the region is pelted with up to six inches of snow\nAreas in Pennsylvania (Pottsville, left) and New York City (right) were hit with snow for the first time in a month\nWinter Storm Reggie is expected to drop up to six inches of snow on New York City on Friday after a month without snow\nWinter Storm Regis comes one month after Winter Storm Niko dropped nine inches of snow in the tri-state area on February 9\nTemperatures are predicted to remain in the 30s in New York City throughout the week and drop to the teens\nA woman shields herself from the snow on Friday as she walks through Central Park\nA couple walks on the Coney Island boardwalk during a snow storm on Friday morning\nThe National Weather Service has issued winter weather advisories in New York City and other portions of the northeast including Pittsburgh, Baltimore and Washington, D.C.\nThe frosty weather comes a month after Winter Storm Niko dropped nine inches of snow in the tri-state area on February 9.\nWhile no wet weather is in the forecast for Saturday, temperatures are predicted to remain in the 30s throughout the week.\nNYC Emergency Management Commissioner Joseph Esposito said in a press release Thursday: 'We’re expecting some snow for the Friday morning commute. New Yorkers should allow for extra travel time and be prepared for slick road conditions.'\n'We are also expecting extremely cold temperatures this weekend, so check in on your family, neighbors, the elderly, or others with increased health risks to make sure they are protected from the extreme cold.'\n‹ Slide me › Thursday vs Friday: The haze and snow obscures the Freedom Tower from West Village in Manhattan on Friday. It was visible the day before on the clear, 60 degree Thursday\nLower Manhattan is hit by a snow storm Friday morning. The day before temperatures reached a high of 60 degrees","url":"https://www.dailymail.co.uk/news/article-4301592/Flakes-start-falling-messy-late-season-storm.html"}
