{"authors":[],"date_download":"2018-10-30 20:17:31","date_modify":"2018-10-30 20:17:31","date_publish":"2015-02-25 10:46:16","description":"»Happening now: Rolling updates from AJC staffers »Reed lays out staggered exit plan ahead of winter storm The darkness brought an end to snowball fights and sledding in the northern suburbs.","filename":"data/vaneerConsumption/Snowiceconcernsgrowastemperaturesdrop.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/02/26/Videos/4081063826001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_snow-ice-concerns-grow-temperatures-drop__1540930651.html","title":"Snow, ice concerns grow as temperatures drop","title_page":"Snow, ice concerns grow as temperatures drop","title_rss":"NULL","source_domain":"ajc.com","text":"»Happening now: Rolling updates from AJC staffers\n»Reed lays out staggered exit plan ahead of winter storm\nThe darkness brought an end to snowball fights and sledding in the northern suburbs. Where there wasn’t snow, there was sleet and rain that wasn’t quite as picturesque.\nBut late Wednesday, the real work and worries began. With precipitation still falling, road crews were working against the clock and the dropping temperatures to keep major interstates and roadways clear for travel.\nThe fast-moving weather system was continuing to bring snow and rain to the metro area and north Georgia late Wednesday, Channel 2 Action News meteorologist Brad Nitz said. The precipitation is expected to continue until at least 2 a.m. Thursday, Nitz said.\nIn the northern suburbs, where snowfall totals measured from 2 to 3 inches, more snow was expected. But the accumulation totals dropped off quickly toward Atlanta and areas south, Nitz said.\nIf there’s no snow where you live, ice is still expected as temperatures drop below freezing Wednesday night.\nSnow started falling around 2 p.m. Wednesday as predicted and coated the area with fluffy white. It was pretty, then troublesome.\nIn Cherokee, Cobb, Forsyth and Paulding counties, the snow quickly accumulated on roads, making some impassable by 4 p.m., according to officials. Further south, the story was much different, and it was freezing rain and sleet seen falling, though metro Atlanta interstates were mostly clear.\n“It’s going to be a long night,” Lt. Jay Baker with the Cherokee County Sheriff’s Office said.\nAbout an inch of snow or a rain/snow mix is expected across the southern fringes of metro Atlanta. The mountain areas in north Georgia could record up to 8 inches of snow.\nOnly a handful of customers were without power statewide late Wednesday, according to Georgia Power. But with heavy snow piling up on trees and possibly power lines, losing power could be a reality for many others during the coming days.\nThe winter storm warning that went into effect at 10 a.m. Wednesday for areas of the state along and north of a line from Newnan to Covington to Athens runs through 10 a.m. Thursday. Late Wednesday, south metro counties were dropped from the warning, including: Clayton, Coweta, Fayette, Heard, Henry, Morgan, Newton and Rockdale.\nSchool systems were doing their part to keep the roads clear. Classes were canceled Wednesday from Atlanta northward. And many districts on the north side of Atlanta will be closed again Thursday. Full list of closings.\nThursday’s high temperature should reach the middle 40s, Nitz said. Check the full forecast and track changes.\nBut anything that doesn’t melt will re-freeze late Thursday, when temperatures again drop below freezing.","url":"https://www.ajc.com/news/snow-ice-concerns-grow-temperatures-drop/VW9kZ64ke07DV3hhOFTs9H/"}
