{"authors":[],"date_download":"2018-10-30 20:29:48","date_modify":"2018-10-30 20:29:48","date_publish":"2015-11-16 23:30:51","description":"While most people are busy gearing up for the holidays, Georgia Department of Transportation officials have been cramming for their next big winter test.","filename":"data/vaneerConsumption/SnowpocalypsenahGeorgiarollsoutnewwinterstormarsenal.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/11/16/Images/photos.medleyphoto.8397204.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_snowpocalypse-na_ffa940782a9c089080dcab56136aabaf__1540931388.html","title":"Snowpocalypse, nah: Georgia rolls out new winter storm arsenal","title_page":"Georgia readies for winter storms with new equipment, technology","title_rss":"NULL","source_domain":"ajc.com","text":"While most people are busy gearing up for the holidays, Georgia Department of Transportation officials have been cramming for their next big winter test.\nWith so much on the line politically, not to mention economically, the state can’t afford another blunder like Snow Jam 2014, which caused more than 1,200 wrecks and left thousands of angry motorists stranded on ice-covered roads.\n“We are preparing for the worst and we’ll hope for the best,” said GDOT Commissioner Russell McMurry at a news conference Monday. “Sometimes Mother Nature can throw us a curve ball. So I wanted to tell you that when the unexpected happens weatherwise, we’re prepared to respond to it.”\nMany recommendations made by Gov. Nathan Deal’s Severe Winter Weather Warning and Preparedness Task Force have been implemented in the aftermath of the 2014 Snow Jam. The state avoided a major winter storm earlier this year, but who knows what the coming cold season could bring.\nA success story from the winter of early 2015 was the spreading of a liquid salt mixture called “brine” on the roads to help delay freezing, said state maintenance engineer Dale Brantley. Traditionally, GDOT had used rock salt rather than brine to treat the roads. But if there is no precipitation at the time the rock salt is spread, fast-moving cars simply blow the salt off the roadway.\nBy contrast, spraying brine onto the road creates a salt residue over the entire surface of the pavement and keeps initial rainfall, snow or sleet from freezing as it hits the ground. The residue eventually dilutes and begins to wash away, but it gives GDOT workers more time to go back and spread more rock salt or brine where needed.\n“We have come light years since the storm of two years ago,” McMurry said.\nAmong the new tools at GDOT’s disposal are:","url":"https://www.ajc.com/news/local/snowpocalypse-nah-georgia-rolls-out-new-winter-storm-arsenal/oZdSSRGZwEXKQ51aMGzznK/"}
