{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:41:27","date_modify":"2018-10-30 19:41:27","date_publish":"2018-10-30 16:37:54","description":"Snowboard champion Shaun White apologized to the Special Olympics for dressing as \"Simple Jack,\" a mentally disabled character from","filename":"data/vaneerConsumption/SnowboarderShaunWhiteApologizestoSpecialOlympicsforSimpleJackHalloweenCostume.json","image_url":"https://media.breitbart.com/media/2018/10/Instagram-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_10_30__1540928487.html","title":"Snowboarder Shaun White Apologizes to Special Olympics for 'Simple Jack' Halloween Costume","title_page":"Snowboarder Shaun White Apologizes to Special Olympics for 'Simple Jack' Halloween Costume","title_rss":"NULL","source_domain":"breitbart.com","text":"Snowboard champion Shaun White apologized to the Special Olympics for dressing as “Simple Jack,” a mentally disabled character from the comedy film Tropic Thunder.\nWhat the hell was Shaun White thinking?! pic.twitter.com/eSxX0XeJuC — TMZ (@TMZ) October 30, 2018\nThe snowboarder wore the get-up to a Halloween costume party but soon took criticism for spoofing mentally disabled people. In fact, even the U.S. Special Olympics chastised the athlete.\n“We are truly disappointed that Shaun White, an acclaimed Olympian, would choose this costume which is so offensive and causes so much pain,” Soeren Palumbo, co-founder of Special Olympics’ Spread the Word to End the Word campaign said in an official statement released to the media, according to the Daily Mail.\n“Disability is not a joke nor should it be a punchline. We hope that Shaun White and others learn that this just continues stigma, stereotypes and discrimination,” Palumbo added.\nThe 32-year-old Olympic gold medalist soon apologized for his choice.\n“It was a last-minute decision,” White posted to Twitter. “It was the wrong one. The Special Olympics were right to call me out on it. They do great work supporting so many tremendous athletes, and I am sorry for being insensitive. Lesson learned.”\nThe “Simple Jack” movie character raised hackles back in 2008 when the Ben Stiller-starring Tropic Thunder debuted. Stiller was slammed for portraying mentally disabled people as fools in the film.\nFollow Warner Todd Huston on Twitter @warnerthuston.","url":"https://www.breitbart.com/sports/2018/10/30/snowboarder-shaun-white-apologizes-special-olympics-simple-jack-halloween-costume/"}
