{"authors":["Victoria Allen For The Scottish Daily Mail"],"date_download":"2018-10-22 20:47:45","date_modify":"2018-10-22 20:47:45","date_publish":"2016-01-28 03:58:39","description":"Dr Philippa Whitford tops up her £74,000 MP’s salary with £500-a-day hospital shifts as a locum consultant for NHS Ayrshire and Arran, working five times for the health board last month.","filename":"data/vaneerConsumption/SNPsDrPhilippaWhitfordmoonlightsas500adayNHSsurgeon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A68FFF00000578-0-image-a-9_1453952720915.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420296_Top-SNP-MP-MP-moonlights-500-day-NHS-surgeon-Party-s-health-spokesman-boosts-74-000-salary-working-cash-strapped-hospital_1540241265.html","title":"SNP's Dr Philippa Whitford moonlights as £500-a-day NHS surgeon","title_page":"SNP's Dr Philippa Whitford moonlights as £500-a-day NHS surgeon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Big earner: Dr Philippa Whitford, pictured with Nicola Sturgeon, tops up her £74,000 MP’s salary with £500-a-day hospital shifts as a locum consultant\nThe SNP’s Westminster health spokesman is earning nearly £60 an hour moonlighting as a surgeon.\nDr Philippa Whitford tops up her £74,000 MP’s salary with £500-a-day hospital shifts as a locum consultant.\nThe revelation flies in the face of leading Nationalist MP Pete Wishart’s pre-election pledge to the House of Commons that ‘no SNP Member has a second job’.\nDr Whitford, elected last May, is moonlighting for NHS Ayrshire and Arran, working five times for the health board last month.\nAccording to her register of interests, she was also paid £1,008 for only 17-and-a-half hours’ work over the summer and during conference season.\nUnlike some other politicians with outside earnings, the Central Ayrshire MP did not donate this to charity.\nIn February, Mr Wishart told the Commons: ‘I believe being a Member of Parliament is a full-time job.’\nHe added that being an MP involved so much work that constituents would find it hard to accept it could be done in tandem with another career.\nBut Dr Whitford said she has no intention of giving up her work as a locum doctor at Crosshouse Hospital near Kilmarnock.\nThe cash-strapped hospital, whose health board needs to make cuts of £13.6million this year, brought her in following a staffing crisis in December.\nDr Whitford’s second job comes to light after the Scottish Daily Mail uncovered Nationalist MP Ian Blackford’s hypocrisy over his outside interests.\nHe has campaigned against nuisance phone calls – but the Golden Charter Trust, which pays him the equivalent of £777 an hour as chairman, is linked to a company which was investigated for cold-calling.\nCampaigning: Unlike some politicians with outside earnings, Dr Whitford did not donate her wages to charity\nOther Nationalist MPs with additional jobs include Alex Salmond, who has made thousands of pounds from his autobiography and newspaper articles, and Lisa Cameron, who built up a property empire of former council homes despite speaking out over right-to-buy and also still works as a psychologist.\nMeanwhile, Nationalist MP George Kerevan, who boasted he would only take a part of his salary equivalent to the national average wage, was yesterday revealed to be employing his wife as his secretary – a practice a parliamentary watchdog has said should be abolished.\nLast night, Labour MSP Jackie Baillie said: ‘Pete Wishart already looked foolish as Alex Salmond piled up second and third jobs while serving as an MP and an MSP – now we see yet another SNP MP has a second job.\n‘The fact that Philippa Whitford, on a lucrative MP’s salary, can still make an hourly rate in our NHS nearly seven times the living wage shows the real problems in our NHS and how understaffed and under-resourced our health service is under the SNP.’\nDr Whitford worked two full days and three half-days at Crosshouse Hospital between December 18 and 30. During this time, with Parliament in recess, MPs are supposed to carry out work in their constituencies, holding surgeries for constituents, writing letters on their behalf and attending local events. The MP said she did such work in the evenings.\nThe consultant surgeon, who is married to German GP Hans Pieper and has a 21-year-old son, earned £57.60 an hour for working on August 20-21 and during conference season on September 25.\nCash-strapped: Dr Whitford said she has no intention of giving up her work as a locum doctor at Crosshouse Hospital near Kilmarnock, where the health board needs to make cuts of £13.6million this year\nThe equivalent of £490 a day, based on an average eight-and-and-a-half hour shift, this tops up her lavish MP’s pay packet.\nDr Whitford already earns almost two-and-a-half times the average salary for Scots. Of her £74,000, she keeps £67,060 if she follows her party’s promise to give away the pay rise MPs received last July.\nThe revelation flies in the face of leading Nationalist MP Pete Wishart’s pre-election pledge to the House of Commons that 'no SNP Member has a second job'\nShe refused to authorise NHS Ayrshire and Arran to reveal how much she earned in December.\nLast night, Dr Whitford insisted she had not done the work for the money but because her local hospital was ‘desperate’.\nShe added: ‘If people want politicians who are not so obsessed with keeping power that they will do anything to keep it, if you want, for example, a 40-year-old dentist to accept they risk losing their place in Parliament for a moral decision, they have to be able to go back to their previous career.\n‘What is valued for me as health spokesman is my experience in the NHS and over time you would lose that. One of my colleagues was going to be off for three months; already one was on maternity leave. I’m here. I wanted to help.’\nDr Whitford said no constituency responsibilities had been cancelled or postponed.\nBut she has committed to spend many more hours on her second job.\nShe must do clinical work, attend conferences and keep up to date on professional development in order to ‘hang on’ in her profession, undergoing an appraisal each year to ensure she remains fit to practise.\nDr Whitford insisted she was approached to work by NHS Ayrshire and Arran. But it could only do so because, after handing in her notice as a breast cancer surgeon following the election, she then applied to become a member of bank staff.\nThis makes her an on-demand member of the NHS bank, providing cover when the board is short-staffed.\nIn the money: Other Nationalist MPs with additional jobs include Alex Salmond (pictured), who has made thousands of pounds from his autobiography and newspaper articles\nCrosshouse Hospital is dependent on locum doctors and went more than £1.1million over-budget in 2014-15 just to staff geriatrics, medicine and A&E properly.\nDia Chakravarty, political director of the TaxPayers’ Alliance, said: ‘There’s nothing inherently wrong with MPs having outside interests – in fact, it can be a useful way of keeping them in touch with the realities of life outside Westminster and ensuring it is not filled with 650 identikit professional politicians.\nThe fact that Philippa Whitford, on a lucrative MP’s salary, can still make an hourly rate in our NHS nearly seven times the living wage shows the real problems in our NHS Labour MSP Jackie Baillie\n'But making promises to the electorate which they later appear to break is, of course, another matter – on which constituents will want to judge them.’\nLiz Moor, director of acute services at NHS Ayrshire and Arran, said: ‘Dr Whitford is a skilled and valued breast surgeon who remains with the board on a bank contract basis.\n'She was able to provide services for the benefit of patients in Ayrshire and Arran during the Christmas period due to unexpected consultant absence.\n‘Since April 2015, she has worked 45 hours for NHS Ayrshire and Arran under NHS terms and conditions.’\nAn SNP spokesman said: ‘Philippa was asked to take some shifts at Crosshouse Hospital during the busy Christmas holidays. She intends to keep her licence as an NHS breast cancer surgeon.","url":"https://www.dailymail.co.uk/news/article-3420296/Top-SNP-MP-MP-moonlights-500-day-NHS-surgeon-Party-s-health-spokesman-boosts-74-000-salary-working-cash-strapped-hospital.html"}
