{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 18:43:25","date_modify":"2018-10-30 18:43:25","date_publish":"2016-01-22 00:00:00","description":"The governor of Michigan said Friday that race was not a factor in the state's response to reports of lead in the drinking water in Flint, a poor, majority-black city where the supply has been contaminated for more than a year, even as state officials insisted that it was safe to drink.","filename":"data/vaneerConsumption/SnyderFlintcrisisnottiedtorace.json","image_url":"https://media.arkansasonline.com/img/photos/2016/01/22/resized_99263-state-of-state_jenk_38-20619_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jan_23_snyder-flint-crisis-not-tied-to-race-20__page=1_1540925005.html","title":"Snyder: Flint crisis not tied to race","title_page":"Snyder: Flint crisis not tied to race","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Michigan Gov. Rick Snyder delivers his State of the State address to a joint session of the House and Senate, Tuesday, Jan. 19, 2016, at the state Capitol in Lansing, Mich. - Photo by AP / AL GOLDIS\nThe governor of Michigan said Friday that race was not a factor in the state's response to reports of lead in the drinking water in Flint, a poor, majority-black city where the supply has been contaminated for more than a year, even as state officials insisted that it was safe to drink.\nPhoto by PAUL SANCYA / AP\nThis photo taken Thursday shows the Flint River near downtown Flint, Mich.\nLater, an advisory panel to Gov. Rick Snyder recommended steps the state should take to restore reliable drinking water to Flint. The Flint Water Advisory Task Force said its recommendations are more detailed and comprehensive than what the Environmental Protection Agency ordered.\nAsked whether the Flint crisis was a case of \"environmental racism,\" Snyder replied, \"Absolutely not.\"\n\"Flint is a place I've been devoted to helping,\" Snyder, a Republican, said in an interview Friday morning on MSNBC. \"Look at all the work we've done in Detroit. Several cities -- Detroit, Flint, Pontiac, Saginaw -- I've made a focused effort since before I started in office to say, we need to work hard to help people that have the greatest need. ... In terms of public safety, we've done a lot. Healthy Michigan was a whole Medicaid expansion. And many of those people getting the greatest benefit are people in places like Flint and such, because they deserve better medical care.\"\nThe interviewer, Mika Brzezinski, cited a New York Times article that asked, \"If Flint were rich and mostly white, would Michigan's state government have responded more quickly and aggressively to complaints about its lead-polluted water?\" Many Flint residents, and Democratic politicians including Hillary Clinton, have said the answer is yes.\nSnyder acknowledged failures on the state's part.\n\"If you look at it, it was people being much too technical, not having the culture of asking the common-sense questions, and then the tone of how things were done,\" he said.\n\"These people worked for me,\" he said, \"and that's why it was important to accept responsibility, and my focus is on fixing this problem, and I've been focused on that very diligently since last October.\"\nState officials have acknowledged being too slow to take complaints about Flint's water seriously, but critics said that even since the lead problem became public knowledge in September, the governor has been late to act.\nIt was not until this month that Snyder declared a state of emergency; sent a small contingent of National Guard troops to help with distributing bottled water, water filters and lead testing kits; and requested and obtained a federal emergency declaration from President Barack Obama.\nThe recommendations from the Flint Water Advisory Task Force include: work with the EPA staff on a comprehensive lead-sampling program; hire an unbiased third-party to assess and declare when Flint drinking water is safe; seek help from the federal Centers for Disease Control and Prevention in assessing an outbreak of Legionnaire's disease and its cause.\n\"To help address both the technical issues facing Flint, as well as the public-trust issues, we believe it is imperative to have the right people and organizations involved,\" task force co-chairman Chris Kolb said. \"Until the public trust starts to build, this crisis will continue.\"\nFor almost five decades, Flint got its water from Detroit, but then Detroit, amid bankruptcy and looking for new revenue, announced plans to raise its prices. So in April 2014, Flint instead started drawing water from the Flint River.\nFlint had serious fiscal problems of its own, and from 2011 to 2015 its finances were under the control of a series of emergency managers appointed by Snyder's administration. The decision to try to save money by switching water supplies was approved by one of the emergency managers.\nFrom the outset, people complained about the Flint River water, which had a reddish-brown tinge and a metallic taste. First there was bacterial contamination, and then there was chemical contamination caused by a disinfectant used to kill the bacteria.\nIt turned out that the water was so corrosive that it leached metals, including lead, out of old pipes. The state Department of Environmental Quality later conceded that it should have required the city to add anti-corrosion chemicals to the water but did not. There have also been allegations that the city failed in its own lead-testing duties.\nAn expert at the federal Environmental Protection Agency began warning the state that its testing was probably understating lead levels in the water, but state officials dismissed those concerns, and the federal officials declined to go public with them.\nThe lead problem finally was made public in September, and the city switched back to using Detroit water in October, but experts said they do not know how long it will take for the pipes to stop leaching metals.\nThe episode is under investigation by the EPA and the Justice Department at the federal level, and by the state's attorney general, Bill Schuette.\nThe state said it has identified dozens of people with elevated levels of lead, which poisons the nervous system and other organs and can stunt brain development in children.\nInformation for this article was contributed by Richard Perez-Pena of The New York Times and by Roger Schneider and John Flesher of The Associated Press.\nA Section on 01/23/2016","url":"https://www.arkansasonline.com/news/2016/jan/23/snyder-flint-crisis-not-tied-to-race-20/?page=1"}
