{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:44:55","date_modify":"2018-10-30 19:44:55","date_publish":"2018-07-27 13:06:22","description":"U.S. GDP rocketed up to 4.1 percent in Q2, a rise far outpacing the Q1 2.2 percent. The rise is the fastest since 2014, according to reports.","filename":"data/vaneerConsumption/SoaringConsumerSpendingDrivesGDPto41inQ2.json","image_url":"https://media.breitbart.com/media/2018/07/american-manufacturing.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_27__1540928695.html","title":"Soaring Consumer Spending Drives GDP to 4.1% in Q2","title_page":"Winning: Soaring Consumer Spending Drives GDP to 4.1% in Q2","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. GDP rocketed up to 4.1 percent in Q2, a rise far outpacing the Q1 2.2 percent.\nThe rise is the fastest since 2014, according to reports. The Gross Domestic Product (GDP) spike is in line with estimates from some economists ahead of the Commerce Department report, Business Insider reports.\nConsumer spending outpaced expectations, growing four percent. Bloomberg reported, “net exports contributed 1.06 percentage point to the pace of growth, the most since 2013, partly on a surge in soybean shipments ahead of retaliatory tariffs.”\nWhite House economic advisor Larry Kudlow predicted a big number on Thursday during a Fox Business interview, “You’re going to get a very good economic growth number tomorrow. Big.”\n“Congressional Republicans and President Trump promised to change the economic course of the country,” House Ways and Means Chairman Kevin Brady said Friday in response to the GDP number. “Armed with a competitive tax code, bold reforms to regulations, and encouraging news this week on trade, our economy is booming – growing at a 4.1 percent pace this quarter.”\nThe news comes days after President Trump and President of the European Commission, Jean-Claude Juncker, announced an agreement forged at the White House to work toward a “zero tariffs, zero non-tariff barriers, zero subsidies on non-auto industrial goods” trade deal. Trump announced the move in a joint Rose Garden press conference where Juncker also pledged that the EU would begin immediately importing more U.S. soybeans. President Trump responded to the news in a tweet and alert that he will deliver remarks on the White House South Lawn around 9:30am: GREAT GDP numbers just released. Will be having a news conference soon! — Donald J. Trump (@realDonaldTrump) July 27, 2018\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook","url":"https://www.breitbart.com/politics/2018/07/27/soaring-consumer-spending-drives-gdp-to-4-1-in-q2/"}
