{"authors":["Associated Press"],"date_download":"2018-10-23 02:24:24","date_modify":"2018-10-23 02:24:24","date_publish":"2017-03-10 11:34:08","description":"What to watch out for in the leading soccer competitions in Europe this weekend:___SPAINAfter the spectacular Champions League comeback against Paris...","filename":"data/vaneerConsumption/SoccerweekendWhattowatchinEuropesmaincompetitions.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195653-1489145651-255_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300914_Soccer-weekend-What-watch-Europes-main-competitions_1540261464.html","title":"Soccer weekend: What to watch in Europe's main competitions","title_page":"Soccer weekend: What to watch in Europe's main competitions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"What to watch out for in the leading soccer competitions in Europe this weekend:\n___\nSPAIN\nBarcelona's head coach Luis Enrique celebrates with some of his players at the end of the Champions League round of 16, second leg soccer match between FC Barcelona and Paris Saint Germain at the Camp Nou stadium in Barcelona, Spain, Wednesday March 8, 2017. Barcelona won the match 6-1 (6-5 on aggregate). (AP Photo/Manu Fernandez)\nAfter the spectacular Champions League comeback against Paris Saint-Germain, it's back to the Spanish title defense for Barcelona.\nThe defending champions have a difficult trip to Deportivo La Coruna, with a one-point lead over Real Madrid to protect. Despite the tight title race in the league, Barcelona coach Luis Enrique is expected to rest some regular starters on Sunday in La Coruna following the grueling game against PSG.\nMadrid, which got past Napoli in the last 16 of the Champions League on Tuesday, will host Real Betis later Sunday to try to regain the lead. Madrid still has a game in hand, at Celta Vigo.\nThird-place Sevilla, unbeaten in six games and four points off the lead, hosts promoted Leganes on Saturday.\nBy Tales Azzoni in Madrid.\n___\nFRANCE\nThings can get even worse for Paris Saint-Germain.\nAfter the humiliation of becoming the first club to be knocked out of the Champions League after winning the first leg 4-0, PSG travels to last-place Lorient in the French league on Sunday.\nConfidence is likely to be at rock-bottom following the 6-1 loss to Barcelona and Lorient desperately needs points in its fight against relegation. A defeat combined with a win for leader Monaco would leave PSG side six points behind in the title race, with only nine to play after this weekend's games.\nMonaco, which has scored a massive 121 goals in all competitions so far this season, is at home to a vastly improving Bordeaux side on Saturday.\nNice, which is in third place but level on points with PSG, hosts struggling Caen on Friday.\nNice striker Mario Balotelli will be eager to get among the goals again after failing to score in his past four games. The Italian needs one more to reach 10 league goals for the season - and all of them so far have been scored at home.\nBy Jerome Pugmire in Paris.\n___\nENGLAND\nThe title race takes a backseat in England for the quarterfinals of the FA Cup.\nFor Arsenal, there's a seemingly soft landing after being routed by Bayern Munich 10-2 on aggregate in the Champions League. The Gunners have a home match against fifth-tier club Lincoln on Monday.\nLosing to the last remaining non-league side in the competition is unthinkable for Arsenal manager Arsene Wenger, who endured waves of protests during the Bayern game as fans called for his departure at the end of the season.\nThe pick of the cup games sees Chelsea host Manchester United on Monday. So often title rivals in recent years, the cup match comes at a time when Chelsea is the runaway leader in the Premier League and United is 17 points behind in sixth place.\nThe other semifinals see Tottenham host third-tier club Millwall and an all-Premier League meeting between Manchester City and Middlesbrough.\nThere are four Premier League games this weekend, with Liverpool the highest-placed team in action. The Reds will remain fourth regardless of Sunday's result against Burnley.\nBy Rob Harris in London.\n___\nGERMANY\nBayern Munich heads into Saturday's game against Eintracht Frankfurt with a seven-point lead.\nFrankfurt has dropped from third to sixth after fourth straight losses, while Bayern is unbeaten in 17 games across all competitions and on course for an unprecedented fifth successive title.\nAlso Saturday, second-place Leipzig hosts relegation-threatened Wolfsburg, Borussia Dortmund visits Hertha Berlin, and Hoffenheim visits Freiburg. Relegation-threatened Hamburger SV faces a tough game at home against Borussia Moenchengladbach on Sunday.\nBy Ciaran Fahey in Berlin.\nBarcelona players celebrate at the end of the Champions League round of 16, second leg soccer match between FC Barcelona and Paris Saint Germain at the Camp Nou stadium in Barcelona, Spain, Wednesday March 8, 2017. Barcelona won 6-1. (AP Photo/Emilio Morenatti)\nArsenal's Alexis Sanchez, left hugs with Arsenal manager Arsene Wenger during the Champions League round of 16 second leg soccer match between Arsenal and Bayern Munich at the Emirates Stadimum in London, Tuesday, March 7, 2017. (AP Photo/Kirsty Wigglesworth)","url":"https://www.dailymail.co.uk/wires/ap/article-4300914/Soccer-weekend-What-watch-Europes-main-competitions.html"}
