{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:42:15","date_modify":"2018-10-30 21:42:15","date_publish":"2016-08-30 10:13:09","description":"Soccer is having a moment in Atlanta.","filename":"data/vaneerConsumption/SoccerfocusedsportsbarHudsonFCtoopeninBrookhaven.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/30/Images/WPIMAGE_cmgajcfoodandmore_10563.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_so_6d545341e1ed9b6d4c0ccdcf47a87e54__1540935735.html","title":"Soccer-focused sports bar Hudson FC to open in Brookhaven","title_page":"Soccer-focused sports bar Hudson FC to open in Brookhaven","title_rss":"NULL","source_domain":"ajc.com","text":"Soccer is having a moment in Atlanta.\nMLS team Atlanta United FC will debut at the new Mercedez-Benz Stadium in 2017 , and this fall, Brookhaven will get its own soccer and international sports pub.\nHudson FC is set to open by mid-October at 4058 Peachtree Road in the former Pub 71 space . The bar and restaurant will show soccer and rugby matches as well as other popular international sporting events.\nHudson FC will offer a similar menu to its sister concept Hudson Grille sister concept (which has seven metro Atlanta locations), with a few differences. Offerings will include traditional pub food such as fish and chips, a pork and beef meatloaf big plate and a variety of flatbreads.\nThe pub is from restaurant group Metrotainment Cafes, which, in addition to the Hudson spots, also operates Einstein’s and Joe's on Juniper in Midtown, Guaco Joe's in Buckhead, Cowtippers in Ansley Park and Sugar Shack in Brookhaven, in the same shopping center where Hudson FC will be located.\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instagram .","url":"https://www.ajc.com/blog/atlanta-restaurants/soccer-focused-sports-bar-hudson-open-brookhaven/csIqW7YXvvP4Jzux5ocFtK/"}
