{"authors":[],"date_download":"2018-10-22 22:49:53","date_modify":"2018-10-22 22:49:53","date_publish":"2014-05-12 15:55:30","description":"In 1971, Jane Goodall watched as a group of chimpanzees tore itself apart. Social-networking software is helping scientists understand why.","filename":"data/vaneerConsumption/SocialNetworkingTechnologyUnlocksMysteryofChimpCivilWar.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/437006/140512-jane-goodall-1442_f495524901a367e07029efe5ab9437f7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_social-networking-technology-unlocks-mystery-chimp-civil-war-n103206_1540248593.html","title":"Social-Networking Technology Unlocks Mystery of Chimp Civil War","title_page":"Social-Networking Technology Unlocks Mystery of Chimp Civil War","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn the upcoming “Dawn of the Planet of the Apes,” chimps and other primates rise up in an epic war against humans.\nBack in 1971, it was chimp-on-chimp violence that surprised primatologist Jane Goodall, who watched as a civil war erupted between two factions of a group of chimpanzees in Tanzania’s Gombe Stream National Park.\nThis is how a chimp attack usually goes down: A group of males will go on patrol, listening quietly near the border of their territory. They discover something. If it’s a similarly large group, there is often a loud screaming match, but little violence. Think of extremely hairy frat guys acting tough at a party.\nOccasionally, however, there will be a smaller group or a lone chimpanzee. The males will often rush in, hold the chimp down, and the group will bite, hit, kick and drag its body.\n“It’s really horrible and violent,” Joseph Feldblum, a Ph.D. student in evolutionary anthropology at Duke University, told NBC News. He compared it to “behavior you would associate with angry toddlers trying to destroy a toy.”\nIt does not happen every day, but it’s not exactly rare either. What is unusual is an entire group of chimpanzees splitting in two, and then one group eliminating the other over a four-year period of violence.","url":"https://www.nbcnews.com/science/environment/social-networking-technology-unlocks-mystery-chimp-civil-war-n103206"}
