{"authors":["John Hayward"],"date_download":"2018-10-30 20:48:07","date_modify":"2018-10-30 20:48:07","date_publish":"2015-07-07 20:14:43","description":"Yesterday, as Greece's debt negotiations entered a new hard-core round of brinkmanship mistaken by many observers for conciliatory gestures to Europe, observers warned that if Greece ultimately succeeds in squeezing more money out of its European creditors without making the necessary \"austerity\" concessions, their triumphant irresponsibility could go viral. |","filename":"data/vaneerConsumption/SocialistsAcrossEuropeSeeOpportunitytoSpreadGreeceChaos.json","image_url":"https://media.breitbart.com/media/2015/07/ap_ap-photo367-1024x711.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_07__1540932487.html","title":"Socialists Across Europe See Opportunity to Spread Greece Chaos","title_page":"Socialists Across Europe See Opportunity to Spread Greece Chaos | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Yesterday, as Greece’s debt negotiations entered a new hard-core round of brinkmanship mistaken by many observers for conciliatory gestures to Europe, observers warned that if Greece ultimately succeeds in squeezing more money out of its European creditors without making the necessary “austerity” concessions, their triumphant irresponsibility could go viral.\nEvery other basket-case debtor nation will get the idea that it, too, can weaponize its debt and present itself as “too big to fail.” Greece rolled into a finance meeting this morning with zero new proposals, so it should be clear to everyone that they were not turning over a new leaf by pulling Yanis Varoufakis out of the Finance Minister slot.\nIf the situation for Greek citizens continues to deteriorate – and they are already collapsing in the streets, sobbing helplessly at their inability to get money from their banks, asking employers to withhold their paychecks because they are afraid to deposit any money, and facing empty shelves that remind journalists of conditions in war-torn Syria – it will be blamed on the Europeans, as Greek socialists take their own population hostage and demand ransom payments from the EU. If it works, every other debtor nation will learn a very bad lesson.\nIrresponsibility is already going viral, as the Wall Street Journal noted Monday night:\nGreek Prime Minister Alexis Tsipras and his far-left Syriza Party are determined to protect government spending and resist economic reform, and they hope Sunday’s “no” vote will scare creditors into agreeing. The danger is that if Mr. Tsipras succeeds, voters elsewhere in Europe will conclude there’s no reason to accept difficult economic reforms if creditors always capitulate. And sure enough, parties of the left across Europe are emerging as the Syriza Party’s most vociferous allies. Consider Spain, where the Syriza-like Podemos (“We Can”) party supported a “no” vote and in a statement last week praised Mr. Tsipras for reacting to the “ultimatum and blackmail” of Greece’s creditors “in an exemplary manner.” Podemos added that “today in Europe there are two opposing camps: austerity and democracy, the government of the people or the government of markets and non-elected powers. We are with democracy. We are with the Greek people.”\nThose are the scariest words out of collectivist leaders since the rise of fascism. “Austerity” is the opposite of “democracy?” That is an explicit endorsement of precisely what America’s founding fathers most feared: a mob using the weight of numbers to enlist government as its well-armed thief, stealing the wealth of every “market and non-elected power” with the misfortune to cross its path.\nWhen Spanish Marxist party Podemos rails against the “government of markets and non-elected powers,” it is attacking independence and responsibility. As one of his more famous ideological predecessors put it, Everything inside the State, nothing outside the State.\nThis is also a distilled white-lightning shot of the fantasy all collectivists promise to gullible voters: the “freedom” from economic reality. Even now, when Greeks are lucky to extract lunch money from locked-down ATMs, they are still willing to believe in free lunches, financed with unlimited debt.\nThe Journal found sentiments similar to Podemos’ expressed by leftists in Italy and Ireland as well:\nThen there’s Italy, where Beppe Grillo, leader of the anti-euro Five Star Movement, is arguing for a similar referendum on the euro. In a blog post last week, he billed Greece’s choice as “between continuing with the austerity dictated by bureaucrats and bankers and taking back their sovereignty.” Matteo Salvini, leader of the powerful Northern League Party, which also opposes the euro, said last week that a “no” vote “could be the beginning of a new Europe.” Ireland’s left-wing Sinn Fein also campaigned for a “no” vote from Athens. In Dublin, the party’s finance spokesman, Pearse Doherty, denounced what he called the “backdrop of fear and scaremongering by our own and other European governments” and lauded Greeks for standing up to “the bullyboys” of the European Union. Ireland’s current government has been another relative reform success.\nThe WSJ sees the worldwide Left working up a political strategy to “ignore the benefits of economic reform, play the “sovereignty” card, take a few cheap shots at Germany, and argue that living within one’s means is a moral outrage.”\nThe editors also make the same prediction I made yesterday: even as Greece collapses around them, socialists look upon the misery and destruction they have wrought and smile, believing they can use the ugly fruits of their bankrupt policies as leverage against more responsible people. “German Chancellor Angela Merkel is so far resisting further concessions. But as Greece’s financial and humanitarian crisis deepens, pressure for a rescue will intensify,” warns the WSJ.\nGreece may have replaced combative “democracy vs. austerity” finance minister Yanis Varoufakis with its chief bailout negotiator, Euclid Tsakalotos, but when the Greeks arrived at the Eurogroup meeting on Tuesday morning, they didn’t have any proposals at all. They are not in any hurry to capitulate, reconcile with Germany, or chart a responsible path forward to solvency and debt repayment. They are waiting for the crisis to get worse before dumping their final round of demands on the EU, taking one last roll of the dice on their bet that the European Union cannot handle what some ministers still portray as the “failure” of a Greek exit.\nAt this point, the EU should think about the necessity of amputating Greece to keep the irresponsibility virus from spreading. Some are grumbling that Greece has effectively voted itself out of the European Union with its conduct over the past few days. That’s an expression of “democracy vs. austerity” the creditor nations of Europe should respect.","url":"https://www.breitbart.com/national-security/2015/07/07/socialists-across-europe-see-opportunity-to-spread-greece-chaos/"}
