{"authors":["John Mauldin","Mauldin Economics"],"date_download":"2018-10-31 00:17:57","date_modify":"2018-10-31 00:17:57","date_publish":"2018-07-11 00:00:00","description":"Social security and medicare are not factored into the national debt. When you factor them in and assume the government will have to pick up slack, they could add trillions to national debt.","filename":"data/vaneerConsumption/SocialsecurityandMedicarecouldaddtrillionstothenationaldebt.json","image_url":"https://amp.businessinsider.com/images/5b44fec2d7751408398b47fa-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_social-security-and-medicare-could-add-trillions-to-the-national-debt-2018-7_1540945077.html","title":"Social security and Medicare could add trillions to the national debt","title_page":"    Social security and Medicare could add trillions to the national debt - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The National debt is shown behind Federal Reserve Chairman Jerome Powell, left, as he makes the semiannual monetary policy report to the House Financial Services Committee, Tuesday, Feb. 27, 2018, in Washington. Jacquelyn Martin/AP\nThe official, on-the-books federal debt is currently about $21.2 trillion, according to the US National Debt Clock.\n$21.2T is the face amount of all outstanding Treasury paper, including so-called \"internal\" debt. This is about 105% of GDP and it's only the federal government.\nIf you add in state and local debt, that adds another $3.1 trillion to bring total government debt in the US to $24.3 trillion or more than 120% of GDP.\nThen there's corporate debt, home mortgages, credit cards, student loans, and more. Add it all together and total debt is about 330% of GDP, according to the IIF data I cited in Debt Clock Ticking.\nWe are in hock up to our ears.\nIt's Actually Worse Than That\nIn calculating debt, however, we don't factor in Social Security and Medicare.\nThese aren't yet debt because they have dedicated revenue streams: payroll taxes. Most Medicare recipients also pay premiums. To date, these revenue sources have covered current expenditures and more, allowing the programs to build up reserves.\nBut that's about to change.\nAs of this year, both programs are in negative cash flow, meaning Congress must provide additional cash to pay the promised benefits. It will get worse, too.\nThe so-called \"trust funds\" are going to run dry sooner or later, and it may be sooner. This month's annual trustee report estimated Social Security will run out of reserves in 2034, and the hospitalization part of Medicare will go dry in 2026.\nJust for the record, those \"trust funds\" don't exist except as an accounting fiction. It is like you saving $100,000 for your child's education and then borrowing all the money from your child's education fund.\nYou can pretend that you have set aside $100,000 for your child's future education, but when it comes time to make those payments, you'll have to pull it out of current income or liquidate other assets.\nThe US government has borrowed (or used or whatever euphemism you want to apply) all the money in those trust funds.\nSo, talking about running out of reserves in 2034 or 2026 is rather meaningless. We've already run out of reserves. Any time a politician talks about putting a \"lock box\" around Social Security or Medicare trust funds, he or she is either staggeringly ignorant or lying.\nAnother $50 Trillion in Debt\nFor what it's worth, Social Security says it has a $13.2 trillion unfunded liability over the next 75 years. That's the benefits they expect to pay minus the revenue they expect to receive.\n(For the record, these estimates of when the trust funds run out depend on a slew of assumptions. A small deviation in any of those can have huge long-term consequences.)\nMedicare projections require even more assumptions: what kind of treatments the program will cover, how much treatment senior citizens will need, and what those treatments will cost.\nAll these could vary wildly but the \"official\" assumptions put Medicare's 75-year unfunded liability at $37 trillion. It could be vastly more or, if we all get healthier and healthcare costs drop, could be less.\nThis being the government, I think the safe course is to assume their numbers are the best case, resembling reality only if everything goes exactly right. And of course, it won't.\nSo, at a minimum, we can probably assume Social Security and Medicare are at least another $50 trillion in debt on top of the $21.2 trillion (and growing) on-budget federal debt.\nAnd then you come to the scary part. This doesn't include civil service or military retirement obligations, or federal backing for some private pensions via the Pension Benefit Guaranty Corporation, or open-ended guarantees like FDIC, Fannie Mae, and on and on.\nJoin hundreds of thousands of other readers of Thoughts from the Frontline\nSharp macroeconomic analysis, big market calls, and shrewd predictions are all in a week's work for visionary thinker and acclaimed financial expert John Mauldin. Since 2001, investors have turned to his Thoughts from the Frontline to be informed about what's really going on in the economy. Join hundreds of thousands of readers, and get it free in your inbox every week.","url":"https://www.businessinsider.com/social-security-and-medicare-could-add-trillions-to-the-national-debt-2018-7"}
