{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:34:34","date_modify":"2018-10-30 18:34:34","date_publish":"2016-06-01 08:12:20","description":"While the anti-Israel Boycott, Divestment and Sanctions (BDS) campaign aims to hurt Israeli companies, the movement’s actions have actually had the opposite effect.","filename":"data/vaneerConsumption/SodaStreamCEOOurSalesIncreasedMassivelyDespiteAntiIsraelBoycott.json","image_url":"https://media.breitbart.com/media/2016/03/soda.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_06_01__1540924474.html","title":"SodaStream CEO: Our Sales Increased Massively Despite Anti-Israel Boycott","title_page":"SodaStream CEO: Our Sales Increased Massively Despite Anti-Israel Boycott","title_rss":"NULL","source_domain":"breitbart.com","text":"The Algemeiner reports: While the anti-Israel Boycott, Divestment and Sanctions (BDS) campaign aims to hurt Israeli companies, the movement’s actions have actually had the opposite effect, the head of a major Israeli company told The Algemeiner on Tuesday.\nSpeaking on the sidelines of the Ambassadors Against BDS International Summit at the United Nations, Daniel Birnbaum, the CEO of popular home soda-maker SodaStream, said that when people ask him whether there is a correlation between BDS and his company’s profits, his answer is always yes.\n“The more active the BDS movement was in a certain market of ours, the more successful we have been,” he said. “In the course of the last six to seven years, when BDS was attacking SodaStream, we grew from a $90 million revenue company to more than $400 million. I encourage any company that wants to grow its sales to be attacked by the BDS movement.”\nSodaStream made headlines in January 2014 when Hollywood actress and company spokeswoman Scarlett Johansson was harshly criticized by the BDS movement for a Super Bowl commercial endorsing the product. At the time, SodaStream operated one of its factories in the Mishor Adumim industrial park in the West Bank. It has since shut the plant down and moved inside the Green Line to a larger facility, which, Birnbaum said, was not done “because of BDS.”\nRead more here","url":"https://www.breitbart.com/middle-east/2016/06/01/sodastream-ceo-sales-increased-massively-despite-anti-israel-boycott/"}
