{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:31:59","date_modify":"2018-10-22 23:31:59","date_publish":"2017-03-10 03:13:47","description":"The 18-year-old wore a large navy blue coat dotted with gold symbols that featured broad lapels and wide cuffs. She paired it with white cotton pants and white tennis shoes","filename":"data/vaneerConsumption/SofiaRichiecoversupinlargeshadesandbaggynavycoat.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1F97B700000578-0-image-a-79_1489115622165.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299838_Sofia-Richie-covers-large-shades-baggy-navy-coat_1540251119.html","title":"Sofia Richie covers up in large shades and baggy navy coat","title_page":"Sofia Richie covers up in large shades and baggy navy coat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sofia Richie stopped by Fred Segal in West Hollywood on Thursday in yet another stunning ensemble.\nThe 18-year-old wore a large navy blue coat dotted with gold symbols that featured broad lapels and wide cuffs.\nShe paired it with white cotton pants and white tennis shoes for a more casual look.\nCut a dash: Sofia Richie wore a large navy blue coat dotted with gold symbols that featured broad lapels and wide cuffs as she stopped by Fred Segal in West Hollywood on Thursday\nLionel Richie's daughter, who has a burgeoning modeling career, wore her dark blonde hair tied back into a high ponytail.\nShe rocked large sunglasses and carried a small tan purse and a smartphone in a black case.\nSofia completed her look with drop pendant earrings.\nCasual: The 18-year-old paired her eye-catching coat with white cotton pants and white tennis shoes\nTeen model: Lionel Richie's daughter wore her dark blonde hair tied back into a high ponytail. She rocked large sunglasses and carried a small tan purse and a smartphone in a black case\nShopping trip: Sofia, who has a burgeoning modeling career, completed her look with drop pendant earrings\nAlso Thursday, Sofia shared an image via Snapchat to announce she was having the 'worst day ever.'\n'Lost my lucky ring,' she wrote over a selfie showing her wearing a yellow animal mask over her mouth and nose and with filter added leopard ears.\nShe didn't explain to fans how she had lost the ring or why it was 'lucky'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299838/Sofia-Richie-covers-large-shades-baggy-navy-coat.html"}
