{"authors":[],"date_download":"2018-10-22 21:35:47","date_modify":"2018-10-22 21:35:47","date_publish":"2014-06-05 19:34:28","description":"Japan's Softbank Corp. unveils a new humanoid robot named Pepper, which the company claims has the ability to identify and respond to human emotions.","filename":"data/vaneerConsumption/SoftbanksPepperRobotMakesEmotionalDebutinJapan.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/490046/140605-humanoid-jms-1257_f909e2e1f8752551b981b92a45cf9071.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_softbanks-pepper-robot-makes-emotional-debut-japan-n123856_1540244147.html","title":"Softbank's Pepper Robot Makes Emotional Debut in Japan","title_page":"Softbank's Pepper Robot Makes Emotional Debut in Japan","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTOKYO — Japanese telecommunications giant Softbank Corp. on Thursday unveiled a new humanoid robot named Pepper, which the company claimed can identify human emotions and respond to them.\nPepper joins the pantheon of other widely known humanoid robots, such as Honda's Asimo and NASA's Robonaut. Unlike Robonaut, Pepper isn't meant to take the place of humans in dangerous environments like deep space. Instead, it's designed to work alongside us.\nDeveloped together with French Aldebaran Robotics, the sleek and slender Pepper can move around on its roller wheels, but its main features include verbal and physical communication. It's equipped with an emotion recognition system to decipher what's behind voice tones.\n\"Our aim is to develop affectionate robots that can make people smile,\" Softbank CEO Masayoshi Son said during Thursday's unveiling at a Tokyo news conference. Son and Aldebaran founder Bruno Maisonnier shared the stage with Pepper for a demonstration of the robot's capabilities.","url":"https://www.nbcnews.com/tech/innovation/softbanks-pepper-robot-makes-emotional-debut-japan-n123856"}
