{"authors":[],"date_download":"2018-10-22 22:35:42","date_modify":"2018-10-22 22:35:42","date_publish":"2014-06-09 23:32:23","description":"An online tool reveals how your personality is reflected in what you say on Facebook, as an exercise to raise awareness about the data you're sharing.","filename":"data/vaneerConsumption/SoftwareSlurpsYourFacebookPoststoAssessYourPersonality.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/498116/140609-five_47976b5e469a205b31deb3bf341a951f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_software-slurps-your-facebook-posts-assess-your-personality-n126866_1540247742.html","title":"Software Slurps Your Facebook Posts to Assess Your Personality","title_page":"Software Slurps Your Facebook Posts to Assess Your Personality","title_rss":"NULL","source_domain":"nbcnews.com","text":"Just for fun, I compared my \"Big Five\" scores from Five Labs with the scores I got from one of the many online personality questionnaires. A couple of the scores were relatively close, but others were dramatically different. It appears that I'm way less agreeable and more neurotic on Facebook than I think I am in real life.\nThat's not surprising. \"People's personalities can change even on a weekly basis, depending on your mood,\" Bier said. And it turns out that agreeableness and neuroticism are the most difficult traits to predict using the online tool.\nPerhaps the most provocative aspect of the Five Labs experiment is the part where you get to see how you stack up against your Facebook friends as well as public figures such as President Barack Obama and Yahoo CEO Marissa Mayer. A level-headed former colleague of mine, investigative journalist Bob Sullivan, is almost a perfect match (which I take as a compliment). I also found out I'm no Barack Obama.\nIs there really anything to this? Marketers think so — and the way Bier sees it, that's the scary part. \"In fact, Facebook and Google are already doing this type of analysis, either in-house or through acquisitions,\" he said.\nBier emphasized that the Five Labs app doesn't store any personal information. Once a profile is created, the user's private content is discarded. Bier said Five.com drew up the experiment as a freebie, to whet the public appetite for a more private social experience the company is planning to roll out later this year.\nFor further perspective on Five Labs and the idea of online personality analysis, we emailed questions to H. Andrew Schwartz, the lead researcher for the PLOS ONE study and an adviser to Five.com. Here's an edited transcript of the Q&A:\nQ: Does the Five Labs app hew pretty closely to your research?\nA: \"It's quite close to our research. I haven't seen the code behind it to know 100 percent, but their algorithm in general was based on that described in our PLOS ONE article, and it produces results for myself that closely match what our research produces.\"\nQ: Are there certain scales that are more accurate than others?\nA: \"Yes. The scales are based on the 'Big Five' or five-factor model of personality, which psychologists have found time and time again to emerge as latent personality factors from questionnaires. In the case of prediction from Facebook language, we have found openness is most accurately predicted, while neuroticism and agreeableness were most difficult.\n\"It is surprising that openness is predicted so well online, because it's often regarded as the hardest to understand. For example, when someone tries to predict the personality of their friends, they seem to do the worst at openness. Of course, it does make sense that it comes out well in wall posts — interests in reading and writing are known correlates of openness, and such interests no doubt change the language people use in their posts (for example, using more sophisticated words).\n\"For a comparison of accuracies across the five factors, see the correlation values in the bottom row of our table here.\"\nQ: What sorts of applications, good or not so good, might this be put toward?\nA: \"This sort of technology is useful anytime one would want to use a personality questionnaire with someone or large numbers of people. These applications range from psychological or social research involving consenting participants, to self-help apps, to matching people for jobs, or even targeting advertising.\n\"I should add something about privacy: I think it's important that people know how their private data is being used and consent to it. People probably want to know if an advertisement, for example, was specifically selected for them based on their personality. In this sense, I don't think any single application is 'bad' — but it's important that such applications have policies to inform people how their data is being used and provide the means to agree to such use.\n\"My biggest interest is in the science itself — that is, better understanding links between behavior and psychological factors and health, based on language use in social media. Social media has enabled such studies at unprecedented scale, which not only gives us stronger confidence in results, but allows for a more data-driven scientific process.\"\nMore about personality assessment:","url":"https://www.nbcnews.com/science/science-news/software-slurps-your-facebook-posts-assess-your-personality-n126866"}
