{"authors":[],"date_download":"2018-10-30 01:13:03","date_modify":"2018-10-30 01:13:03","date_publish":"2015-10-13 00:00:00","description":null,"filename":"data/vaneerConsumption/SoJesuswasbornwhereandwaswhatRevWright.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_10_so_jesus_was_born_where_and_was_what_rev_wright_1540861983.html","title":"So Jesus was born where and was what, Rev. Wright?","title_page":"So Jesus was born where and was what, Rev. Wright?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Trust Rev Jeremiah Wright and his acolyte, President Barack Hussein Obama (D), to get the unsavory facts of the Muslim world – and just about everything else – wrong. The latest mistake was Wright's public pronunciemento that Jesus was a Palestinian at the Reverend Louis Farrakhan's grandiosely misnamed Million Man March last weekend. (There weren't even a tenth of that number of men present, and what about the ladies, Rev. Farrakhan? Are you a segregationist or something? A believer in gender apartheid? And what about diversity, pluralism, and multiculturalism?)\nIn his speech, Wright stated:\nThe same issue is being fought today and has been fought since 1948, and historians are carried back to the 19th century … when the original people, the Palestinians — and please remember, Jesus was a Palestinian — the Palestinian people had the Europeans come and take their country[.]\nNot surprisingly, Wright ignores several thousand years of history, when the Jews lived in the land.\nSo where is this imaginary \"Palestine,\" and who are the imaginary \"Palestinians\"? The Jewish Virtual Library provides some historically accurate facts and answers – important components missing from both Wright and Farrakhan as well as the Muslim narratives. Accuracy and truth, of course, would destroy the Muslim cause. And Wright and Farrakhan.\nThough the definite origins of the word \"Palestine\" have been debated for years and are still not known for sure, the name is believed to be derived from the Egyptian and Hebrew word peleshet. Roughly translated to mean \"rolling\" or \"migratory,\" the term was used to describe the inhabitants of the land to the northeast of Egypt - the Philistines. The Philistines were an Aegean people - more closely related to the Greeks and with no connection ethnically, linguisticly or historically with Arabia - who conquered in the 12th Century BCE the Mediterranean coastal plain that is now Israel and Gaza .\nIn other words, the original Palestinians were the Philistines, who were not indigenous to the area, but were brutal invaders – migrants – taking other people's land. Hmm, some things never change.\nA derivitave of the name \"Palestine\" first appears in Greek literature in the 5th Century BCE when the historian Herodotus called the area \"Palaistinē\" (Greek - Παλαιστίνη). In the 2nd century CE, the Romans crushed the revolt of Shimon Bar Kokhba (132 CE), during which Jerusalem and Judea were regained and the area of Judea was renamed Palaestina in an attempt to minimize Jewish identification with the land of Israel. [Emphasis added.]\nTherefore, Jesus – and his parents – were legal residents of the area – not migrants, not invaders, though Wright is calling them that.\nThe term \"Palestine\" was revived when another group of brutal invaders, first the Ottoman Empire –the Turks – and then the British – and yes, they were brutal – governed the land. They also sought to minimize the Jewish biblical, historical, legal connection with and presence in the land.\nUnder the Ottoman Empire (1517-1917), the term Palestine was used as a general term to describe the land south of Syria ; it was not an official designation. In fact, many Ottomans and Arabs who lived in Palestine during this time period referred to the area as \"Southern Syria\" and not as \"Palestine.\" After World War I , the name \"Palestine\" was applied to the territory that was placed under British Mandate ; this area included not only present-day Israel but also present-day Jordan . Leading up to Israel's independence in 1948, it was common for the international press to label Jews, not Arabs, living in the mandate as Palestinians. It was not until years after Israeli independence that the Arabs living in the West Bank and Gaza Strip were called Palestinians. In fact, Arabs cannot even correctly pronounce the word Palestine in their native tongue, referring to area rather as“Filastin.” (snip) The word Palestine or Filastin does not appear in the Koran . The term peleshet appears in the Jewish Tanakh (Jewish Bible) no fewer than 250 times.\nGot that, Reverend Wright?\nThe Palestinians are an artificial people with an artificial history; in reality, they are Arabs who later became Muslim and invaded Israel from elsewhere over the course of the past 1,500 years as conditions in their areas deteriorated – brutal warfare is endemic in their culture – while conditions in Israel improved.\nSome things never change. Sigh.","url":"https://www.americanthinker.com/blog/2015/10/so_jesus_was_born_where_and_was_what_rev_wright.html"}
