{"authors":["Gavin Lesnick"],"date_download":"2018-10-30 18:30:15","date_modify":"2018-10-30 18:30:15","date_publish":"2015-04-16 00:00:00","description":"One soldier who was killed and a second who was injured in a shooting outside of a recruiting station in Little Rock in 2009 will be awarded Purple Hearts, several members of Arkansas' congressional delegation announced Thursday.","filename":"data/vaneerConsumption/SoldiersshotatLRrecruitingstationwillgetPurpleHearts.json","image_url":"https://media.arkansasonline.com/img/photos/2015/04/16/FotorCreated_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_apr_16_soldiers-s_0f483bef0e0d1004bd84164587c6b8aa__page=3_1540924215.html","title":"Soldiers shot at LR recruiting station will get Purple Hearts","title_page":"Soldiers shot at LR recruiting station will get Purple Hearts","title_rss":"NULL","source_domain":"arkansasonline.com","text":"One soldier who was killed and a second who was injured in a shooting outside of a recruiting station in Little Rock in 2009 will be awarded Purple Hearts, several members of Arkansas' congressional delegation announced Thursday.\nPvt. William Long of Conway was killed and Pvt. Quinton Ezeagwula of Jacksonville was injured in the June 1, 2009, shooting at the Little Rock Army-Navy Career Center on Rodney Parham Road. Abdulhakim Muhammad was sentenced to life in prison for the shootings, which he said were in retaliation for U.S. policy in the Middle East.\nU.S. Sens. John Boozman and Tom Cotton and U.S. Rep. French Hill announced that the Army had decided the two soldiers were eligible, a determination made possible by a provision Boozman wrote in the National Defense Authorization Act allowing Purple Hearts for servicemen targeted because of their membership in the military or in an attack \"carried out by a foreign terrorist organization.\"\nIn a letter to the Secretary of the Army last year, Boozman, Cotton and Hill's predecessor in the 2nd District, former U.S. Rep. Tim Griffin, said Long and Ezeagwula were eligible because Muhammad made repeated statements that he was a \"soldier in the cause of war—or jihad—against the United States and that he targeted Privates William Andrew Long and Quinton Ezeagwula\" because they were military members.\nBoozman said Long and Ezeagwula \"rightfully deserve\" the honor.\n\"They were targeted for the service, devotion and dedication to our country in a war where the frontlines against terrorism extend within our nation,\" he said in a statement. \"Awarding Privates Long and Ezeagwula the Purple Heart for their service and sacrifice is simply the right thing to do.\"\nCotton and Hill each called the decision \"long overdue.\"\nRead Friday’s Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2015/apr/16/soldiers-shot-lr-recruiting-station-will-get-purpl/?page=3"}
