{"authors":["Press Association"],"date_download":"2018-10-23 03:27:40","date_modify":"2018-10-23 03:27:40","date_publish":"2017-04-26 14:49:09","description":"The pair developed an intense relationship over the internet while Lance Corporal Trimaan \"Harry\" Dhillon was serving in Afghanistan.","filename":"data/vaneerConsumption/SoldierjailedforstalkingandmurderingAliceRuggles.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/07/wire-470117-1493275779-559_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447896_Soldier-guilty-stalking-murdering-ex-girlfriend-Alice-Ruggles_1540265260.html","title":"Soldier jailed for stalking and murdering Alice Ruggles","title_page":"Soldier jailed for stalking and murdering Alice Ruggles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An obsessed soldier who stalked then murdered his ex girlfriend by slashing her neck in an act of “utter barbarism” has been jailed for life with a minimum term of 22 years.\nLance Corporal Trimaan “Harry” Dhillon broke into Alice Ruggles’ Gateshead flat last October and cut her throat from ear to ear after he found out she had found happiness with another man.\nThe 26-year-old had driven 120 miles from his barracks near Edinburgh to confront Miss Ruggles and grabbed a long, sharp carving knife cutting through to her spine.\nHe did not react when a jury at Newcastle Crown Court convicted him of murder after they took less than two hours to dismiss his fanciful story that she had accidentally stabbed herself while lunging at him.\nJudge Paul Sloan QC said: “Precisely what happened once you were in the flat only you now know, but you have never had the decency to say.”\nMiss Ruggles, 24 and who worked for Sky in Newcastle and came from Leicestershire, tried to lock herself in the bathroom but Dhillon kicked it down.\nAt 6ft 1ins and 12-and-a-half stone the 2 Scots signaller who was training for the Special Reconnaissance Regiment was nearly a foot taller and three stone heavier than his victim.\nThe judge said: “You were pinning her down, probably by kneeling on her back, and in an act of utter barbarism you slashed her throat with a knife, slashed her at least six times, causing catastrophic injuries.”\nTrimaan \"Harry\" Dhillon\nDhillon fled without dialling 999 but remembered to take her phone and the murder weapon, disposing of them on the way back to Edinburgh.\nAlice’s flatmate Maxine McGill made the gruesome discovery on the bathroom floor and a harrowing 999 call was played to the jury.\nDhillon told a series of lies to talk his way out of trouble, and in his defence, made a series of accusations about the woman he supposedly loved.\nJudge Sloan said: “Not a shred of remorse have you shown from first to last, indeed you were concentrating so hard on getting your story right when giving evidence, you forgot even to shed a crocodile tear.”\nThe murder was aggravated by the way Dhillon had made Miss Ruggles, described as normally fun-loving and a “ray of sunshine”, miserable over the last weeks of her life. Dhillon, who had been serially unfaithful, knocked on her door at night and terrified her by tapping on her window and leaving flowers and chocolates on the sill.\n(Northumbria Police/PA)\nThat led her to complain to the police and gain an official PIN warning, telling him to leave her alone, which he ignored.\nHe had tried to hack her social media accounts and messaged the new man in her life, trying to make out Miss Ruggles was two-timing him.\nDuring their intense relationship, jealous Dhillon had isolated her from her close circle of friends, manipulating and controlling her.\nDhillon stared intently ahead as moving victim statements were read on behalf of her father Clive, who is a professor, her mother Dr Sue Hills, sister Emma and brothers Nick and Patrick.\nJamie Hill QC, defending, said while there was no psychiatric illness or mental disorder, “the defendant’s personality traits are clearly discernible from the evidence”.","url":"https://www.dailymail.co.uk/wires/pa/article-4447896/Soldier-guilty-stalking-murdering-ex-girlfriend-Alice-Ruggles.html"}
