{"authors":["Associated Press"],"date_download":"2018-10-23 00:53:25","date_modify":"2018-10-23 00:53:25","date_publish":"2017-03-10 08:04:10","description":"WASHINGTON (AP) - U.S. employers are thought to have hired at a brisk pace in February, and the unemployment rate is expected to stay low - a result that...","filename":"data/vaneerConsumption/SolidhiringandpaygainsexpectedinFebruaryjobsreport.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195579-1489145053-315_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300318_Solid-hiring-pay-gains-expected-February-jobs-report_1540256005.html","title":"Solid hiring and pay gains expected in February jobs report","title_page":"Solid hiring and pay gains expected in February jobs report | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - U.S. employers are thought to have hired at a brisk pace in February, and the unemployment rate is expected to stay low - a result that would provide further evidence of a consistently solid job market.\nEconomists have forecast a job gain of 186,000 and a decline of one-tenth of a percentage point in unemployment to 4.7 percent, according to data provider FactSet. With employers competing to hire a dwindling supply of applicants and higher minimum wages taking effect in some states, average pay is also thought to have risen.\nThe Labor Department will release the February jobs report at 8:30 a.m. Eastern time.\nFILE - In this Feb. 15, 2015, file photo, the Space Needle towers in the background beyond a container ship anchored in Elliott Bay near downtown Seattle. U.S. employers are thought to have hired at a brisk pace in February, and the unemployment rate is expected to stay low _ a result that would provide further evidence of a consistently solid job market. (AP Photo/Elaine Thompson, File)\nIf the economists' forecasts prove roughly correct, the Federal Reserve will almost surely feel confident enough to resume raising interest rates when it meets next week. It would mark the Fed's third rate hike in 15 months, a reflection of how far the economy has come since the Great Recession ended nearly eight years ago.\nFriday's report will also be the first to cover a full month under President Donald Trump. Trump has already tweeted cheerfully about a survey of private-sector hiring released earlier this week that suggested a robust job gain in February.\nThat survey, by payroll provider ADP, concluded that private employers added 298,000 jobs in February, the biggest monthly gain in three years. Construction companies hired the most workers in 11 years and manufacturers the most in five, ADP found.\nThe surge in construction jobs likely reflected unseasonably warm February weather, particularly in the North, which kept job sites open that would otherwise have been shut down by winter weather. If warm weather boosted the pace of construction hiring in Friday's government report, other weather-sensitive industries, like retail and restaurants, will likely also show sharp job gains.\nApart from any effects of unusual weather, much evidence suggests that the U.S. job market is fundamentally healthy or nearly so. The number of people seeking first-time unemployment benefits - a rough proxy for the pace of layoffs - reached a 44-year low two weeks ago.\nAnd in January, employers added a vigorous 227,000 jobs, according to the government's figures, higher than last year's monthly average of 187,000.\nBusiness and consumer confidence has soared since the presidential election, with many business executives saying they expect faster economic growth to result from Trump's promised tax cuts, deregulation and infrastructure spending.\nThe U.S. economy is also benefiting from steadier economies overseas. Growth is picking up or stabilizing in most European countries as well as in China and Japan. The 19-nation alliance that uses the euro currency expanded 1.7 percent in 2016, an improvement from years of recession and anemic growth. Germany's unemployment rate has fallen to 3.9 percent, although in crisis-stricken Greece, unemployment remains a painful 23 percent.\nIn the United States, employers have been hiring solidly for so long that in some industries, they're being compelled to raise pay. Hourly wages for the typical worker rose 3.1 percent in 2016, according to a report Thursday by the Economic Policy Institute. That's much higher than the 0.3 percent average annual pay gain, adjusted for inflation, since 2007, the EPI said.\nMinimum wage increases last year in 17 states and Washington, D.C., helped raise pay among the lowest-paid workers, the EPI found. Pay increases for the poorest 10 percent of workers were more than twice as high in states where the minimum wage rose as in states where it did not.\nAt the start of 2017, minimum wages rose again in 19 states, a trend that might have helped raise pay last month.\nU.S. builders are breaking ground on more homes, and factory production has recovered from an 18-month slump, fueling growth and hiring. In February, manufacturing expanded at the fastest pace in more than two years, according to a trade group. Businesses have stepped up their purchases of industrial equipment, steel and other metals, and computers.\nAnd in January, Americans bought homes at the fastest pace in a decade despite higher mortgage rates. That demand has spurred a 10.5 percent increase in home construction in the past 12 months.","url":"https://www.dailymail.co.uk/wires/ap/article-4300318/Solid-hiring-pay-gains-expected-February-jobs-report.html"}
