{"authors":["Npr Staff"],"date_download":"2018-10-23 01:00:12","date_modify":"2018-10-23 01:00:12","date_publish":"2015-11-23 00:00:00","description":"Not everyone delights in turkey as the centerpiece to Thanksgiving. We asked three chefs around the country for their suggestions of winning alternatives. They came up with venison, pork and biryani.","filename":"data/vaneerConsumption/SoLongTurkey3WaysToSpiceUpThanksgivingWithoutTheBird.json","image_url":"https://media.npr.org/assets/img/2015/11/20/biriyanistuffedpumpkinedited_wide-d48bbbcd0de0952bdaef6ae5d4f2b63c4a4cdd0c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2015_11_23_456698512_so-long-turkey-3-ways-to-spice-up-thanksgiving-without-the-bird_1540256412.html","title":"So Long, Turkey: 3 Ways To Spice Up Thanksgiving Without The Bird","title_page":"So Long, Turkey: 3 Ways To Spice Up Thanksgiving Without The Bird : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"So Long, Turkey: 3 Ways To Spice Up Thanksgiving Without The Bird\nEnlarge this image toggle caption Amy Thielen Amy Thielen\nIf you are turkey-averse, turkeyphobic or just bored with the bird, fear not. We've got some other main dish ideas for you.\n\"What I think is cool is to put a center roast on the table that comes from the woods itself: something wild, something home-hunted, like venison,\" Amy Thielen, Minnesotan and author of The New Midwestern Table, tells All Things Considered's Ari Shapiro. Deer, says Thielen, is \"one of those secret underground proteins in the American meat-eating story.\"\nThielen rubs venison loin with spices, and then slow-cooks it. She serves it with a \"simple pan sauce\" made with sherry and butter. She also suggests adding cranberry juice since \"traditionally, venison likes a sweet-and-sour condiment to go with it.\" You can take that up a notch by making mostarda, an Italian hot mustard condiment, to go with the venison.\nThielen suggests topping the meal off with squash whipped with cream cheese or mascarpone cheese and walnuts.\nAnthony Lamas gives Thielen's idea for a turkey alternative a thumbs up. \"That sounds wonderful.\" Lamas is chef and owner of Seviche, a Latin restaurant in Louisville, Ky.\nAs for what he would serve in place of turkey? \"I gotta stick with my Latin culture so we love a pork roast,\" says Lamas, whose first book, Southern Heat: New Southern Cooking Latin-Style, came out in November.\nHe starts with a pork butt or shoulder and marinates it with smoky chipotle chiles and citrus. He slow-cooks it in the oven for about five hours. \"I'm telling you, the smell is intoxicating,\" says Lamas.\nAs for how to best enjoy this pork as leftovers, Lamas recommends warming up a corn tortilla, adding the pork and salsa verde, and \"boom, you have yourself some pork tacos the next day.\" You can also put a little barbecue sauce on it.\nAnd vegetarians, we haven't forgotten you. This suggestion for a meat-free Thanksgiving main dish comes from Preeti Mistry, chef and owner of Juhu Beach Club in Oakland, Calif.\n\"I'm of Indian origin and biryani is always something we would do for special occasions,\" says Mistry. \"Biryani is special on its own, but instead of just serving it in a normal casserole dish, we're going to stuff it inside a pumpkin.\"\nFirst she cooks the rice, adding spices like turmeric and saffron. Then she sautes vegetables. The next step is making the curry with coconut milk \"to give it a little bit more luxury,\" says Mistry. Then it all gets layered inside the pumpkin and baked.\n\"The awesome thing that happens ... is the sort of metamorphosis that takes place in the oven. You get this delicious curry and rice and, you know, I like to make it really festive and add nuts and dried fruit on top. ... But once you dig into the flesh of the pumpkin it's soaked up all of these juices,\" says Mistry.\nAnd, like a turkey that you've labored over all day, this is an exciting dish to present, says Mistry. \"It's that wonderful moment when it comes to the table — it feels like this special thing you're going to carve or dig into.\"\nEnlarge this image toggle caption Courtesy of Preeti Mistry Courtesy of Preeti Mistry\nRecipe: Amy Thielen's Roasted Venison With Shaken Cranberry Mostarda And Mascarpone Squash\nShaken Cranberry Mostarda\n1 cup sugar\n1 lemon, washed and dried\n12 ounces rinsed fresh cranberries\n1 tablespoon brandy\n1 cup prunes, diced\n3/4 teaspoon salt\n3 tablespoons freshly finely ground mustard seeds\n2 tablespoons whole mustard seeds\n1 tablespoon red wine vinegar\n1 tablespoon extra-virgin olive oil\nMascarpone Squash\n3 cups cooked winter squash, such as buttercup\nsalt and pepper\n4 tablespoons butter, divided\n5 ounces mascarpone cheese or cream cheese\n1/2 cup broken walnuts\nVenison\n2 1/2 pounds venison loin\n2 teaspoons minced rosemary, plus 2 sprigs\n1/2 teaspoon black pepper\n1/2 teaspoon salt\n2 tablespoons butter, plus 1 tablespoon to thicken the sauce\n2 smashed cloves of garlic\n1/4 cup sherry\n2/3 cup chicken stock\n1 tablespoon maple syrup\n3 tablespoons cranberry juice\nMake the mostarda at least 24 hours and up to one week ahead: Pour the sugar into a food processor and shave 5 wide strips of lemon zest (just the yellow peel, not the pith) over the top. Process until the lemon zest is reduced to bits, and pour the sugar into a bowl.\nAdd the cranberries to the processor and pulse until the cranberries are broken up but not pulverized; leave it coarse. In a one-quart glass jar, combine the cranberries, lemon sugar, brandy and prunes. Peel the pith and remaining skin from the lemon and dip your paring knife between the segments to free the lemon flesh. Chop the lemon flesh roughly and add to the jar. Shake the jar, turning it upside down to incorporate the sugar. In another hour, shake and turn the jar upside down again, repeating every few hours until no sugar remains and the cranberries glow bright fuchsia.\nAfter 8 hours, add the ground mustard seed, the whole mustard seeds, vinegar, and olive oil. If using that day, leave to macerate at room temperature. Stir to combine, and serve at room temperature, alongside the venison. (Refrigerate any leftovers for up to two weeks.)\nFor the mascarpone squash, bake the squash cut-side down on a baking sheet until tender. Scoop out three cups and place in the bowl of a food processor. Add half of the butter and the mascarpone, and salt and pepper to taste, and process until smooth and combined. Scrape the squash puree into a heavy heatproof bowl. For the walnut garnish, heat a small skillet over medium heat and add the remaining two tablespoons butter and the walnuts. Season lightly with salt and pepper and cook, over medium-low heat, until the walnuts are lightly golden and the butter is browned. Pour the walnut butter over the squash and keep warm.\nFor the venison, preheat the oven to 350 degrees Fahrenheit. Heat a large cast-iron skillet over medium-high heat. Combine the minced rosemary, salt, and pepper in a small bowl and rub evenly over the venison. Add the butter, and then the venison, to the cast iron pan, and cook gently — lowering the heat to medium if necessary — until lightly browned on all sides. Pop the pan into the oven and cook until the venison feels medium-rare to the touch and measures 125 degrees Fahrenheit on an internal-read thermometer. Remove the venison to a platter to rest while you make the pan sauce: Add the crushed garlic cloves and 2 rosemary sprigs to the pan, and quickly cook until lightly browned on both sides. Deglaze the pan with the sherry, and when it boils, add the chicken stock, maple syrup and cranberry juice. Boil gently until the liquid thickens to big bubbles and the sauce clings to the back of a spoon. Add the cold butter and whisk until it emulsifies and melts. Pour the sauce through a fine mesh sieve onto a warm platter.\nTo serve, slice the venison and place onto the sauce on the platter. Serve with the mascarpone squash and some of the cranberry mostarda.\nRecipe: Anthony Lamas' Thanksgiving Pork Loin\nJuice of 2 oranges, rinds reserved\nJuice of 2 lemons\nJuice of 2 limes, rinds reserved\n1 bunch cilantro, chopped\n2 ounces (about 16 cloves) cloves garlic, roughly chopped\n2 onions chopped\n2 carrots chopped\n3 celery ribs chopped\n1⁄4 cup kosher salt\nOne 4- to 5-pound bone-in pork butt or pork shoulder\n2 tablespoons Chipotle in Adobo Purée\nIn a small bowl, combine the juices, cilantro, chipotle and salt. Rub the mixture all over the pork, then place in a nonreactive dish. Add the orange and lime rinds, cover, and refrigerate overnight.\nWhen ready to cook the pork, position a rack in the center of a convection oven and heat the oven to 275 degrees Fahrenheit. Fill the pan about halfway with water, add onions, carrot and celery. Cover with foil, cook for 4 hours, until the meat is tender and falls off the bone. Then take the foil off and turn the oven up to about 425 degrees Fahrenheit and let the fat and skin get crispy. Remove, keep warm and carve.\nRecipe: Preeti Mistry's Coconut Biriyani Stuffed Pumpkin\nA large sugar pie pumpkin is the best choice for this recipe. Alternatively, if you are cooking for a smaller crowd you could use a kabocha squash or for a different \"boatlike\" look a delicate or butternut squash.\nCut the top off the pumpkin just like you would if you were making a jack-o-lantern. Scoop out seeds and discard. (Seeds could also be cleaned and roasted as a snack or crispy topping on dish.) Season the interior with salt and set aside. If you want to decrease the overall cooking time, you can par-roast the pumpkin in a 350-degree Fahrenheit oven for 10-15 minutes while working on the rest of the recipe.\nSpice Mix\n1/2 cup whole coriander seeds\n1/4 cup whole cumin seeds\n1/4 cup brown mustard seeds\n1 tablespoon whole green cardamom pods\nToast whole spices in dry saute pan until fragrant, about 3 minutes on high heat. Transfer to cool dry bowl and let cool. Grind in spice grinder or cleaned-out coffee grinder.\nVegetable Coconut Curry\n1/4 cup neutral oil like rice bran oil\n2 yellow onions, jullienned\n1/2 cup fresh curry leaves\n1/2 tablespoon whole fenugreek seeds\n2 tablespoons garlic, minced\n2 tablespoons ginger, minced\n2 tablespoons serrano chili, minced\n1 teaspoon turmeric powder\n2 bunches rainbow chard, cut into 1-inch-thick strips\n3 cups cremini mushrooms, cleaned and quartered\n1 cup tamarind pulp\n1 cup water\n4 cans coconut milk\nHeat oil in large sauce pan until hot. Add onions, curry leaves and fenugreek seeds to oil and stir frequently to soften onions. When onions are soft and translucent add garlic, ginger and green chilies. Season with a few pinches salt and continue stirring.\nAromatics will start to brown and slightly stick to the bottom of the pan. Add turmeric and spice blend to pan; some of the spices will stick to the bottom of the pan. Add chard and mushrooms and season with salt, and vegetables will begin to release their moisture. When chard begins to wilt add tamarind, water and coconut milk. Using a wooden spoon scrape any spices and aromatics that have stuck to the bottom of the pan. Bring liquid to a boil, reduce heat and simmer until mushrooms are fully cooked through, about 10 minutes.\nBasmati Rice\n4 cups basmati rice\n8 cups water\n1 tablespoon rice bran oil\n2 tablespoons salt\n1 teaspoon whole cloves\n1 teaspoon whole green cardamom\nMix rice with water and all other ingredients. Bring to a boil on high heat. When water reaches the level of the rice, reduce heat to very low and cover for 15 minutes. Remove lid and fluff rice.\nStuffing Pumpkin Assembly\nLayer vegetables in coconut curry sauce and rice, starting with vegetables on the bottom. Depending on the depth of your pumpkin you can assemble anywhere from 1-4 layers of vegetables and rice.\nRoast in 350-degree Fahrenheit oven for 20-30 minutes. Check doneness of pumpkin by piercing the side with a small knife. Let rest out of oven for 10-15 minutes. Slide pumpkin onto serving tray for presentation.\nI like to garnish the top with dried fruits such as cranberries or apricots and roasted nuts such as pistachios, slivered almonds or cashews.","url":"https://www.npr.org/sections/thesalt/2015/11/23/456698512/so-long-turkey-3-ways-to-spice-up-thanksgiving-without-the-bird"}
