{"authors":[],"date_download":"2018-10-22 22:03:17","date_modify":"2018-10-22 22:03:17","date_publish":"2014-06-07 21:02:40","description":"The men, sailors from Pakistan, Bangladesh, Sri Lanka and Iran, were crew on a Malaysian-owned cargo ship hijacked more than three years ago.","filename":"data/vaneerConsumption/SomaliPiratesFree11CrewKidnappedin2010.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/494601/140607-somali-pirates-1637_cdb98cffebf27a2891b3b9ef7ddb20d8.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_africa_somali-pirates-free-11-crew-kidnapped-2010-n125426_1540245797.html","title":"Somali Pirates Free 11 Crew Kidnapped in 2010","title_page":"Somali Pirates Free 11 Crew Kidnapped in 2010","title_rss":"NULL","source_domain":"nbcnews.com","text":"The 11 men freed on Friday were crew on Malaysian-owned cargo vessel MV Albedo which was hijacked 900 miles off Somalia in November 2010 while sailing from the United Arab Emirates to Kenya.\n\"They are all healthy,\" said Abdi Yusuf Hassan, the interior minister of Galmudug region. He said no ransom was paid.\nMV Albedo's 23-man crew was made up of sailors from Pakistan, Bangladesh, Sri Lanka and Iran when it was seized.\nSeven of the ship's crew were released in 2012 while four others drowned when the ship sank last year.\nMedia reports have suggested one hostage was killed soon after the vessel was hijacked.\nNick Kay, the U.N.'s envoy to Somalia, said the 11 crew have been flown to Kenya and will be sent back to their respective countries in coming days.\n\"I remain deeply concerned that 38 other crew members are still being held hostage by Somali pirates,\" Kay said in a statement.\n\"I call on those who continue to detain these crew members to release them without further delay so they can rejoin their families and loved ones.\"\n— Reuters","url":"https://www.nbcnews.com/news/africa/somali-pirates-free-11-crew-kidnapped-2010-n125426"}
