{"authors":["John Hayward"],"date_download":"2018-10-30 19:37:38","date_modify":"2018-10-30 19:37:38","date_publish":"2016-02-09 00:29:46","description":"The investigation into last Tuesday's explosion aboard a passenger jet outbound from Somalia has uncovered airport security video that evidently shows airport employees handing the bomb off to the passenger.","filename":"data/vaneerConsumption/SomaliaPlaneBombingWorkersReportedlyCaughtOnVideoGivingBombtoTerrorist.json","image_url":"https://media.breitbart.com/media/2016/02/Somalia-laptop-handoff.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_08__1540928258.html","title":"Somalia Plane Bombing: Workers Reportedly Caught On Video Giving Bomb to Terrorist","title_page":"Somalia Plane Bombing: Workers Reportedly Caught On Video Giving Bomb to Terrorist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The investigation into last Tuesday’s explosion aboard a passenger jet outbound from Mogadishu, Somalia has uncovered airport security video that evidently shows airport employees handing the bomb off to the passenger who would ultimately blow a hole in the side of the plane, becoming the only victim of the attack.\nThe chilling news that a man was sucked out of the plane at 11,000 feet by the explosion was soon followed by the revelation that he was the primary suspect in the bombing. A CNN report on Monday said that local officials had identified him as Abdullahi Abdisalam Borleh, a Somali national believed to have acted on behalf of al-Qaeda’s affiliate, al-Shabaab.\nAccording to the UK Express, the suspect was supposed to have been aboard a different plane, a Turkish Airlines flight that was canceled due to bad weather. He wound up on a plane operated by Dubai-based Daallo Airlines when it stepped forward to transport stranded Turkish Airlines passengers to Djibouti from Mogadishu.\nCNN reports that Somali intelligence officials have released a video that appears to show two airport workers helping Borleh get his explosive-laden laptop past airline security. The computer contained military-grade TNT, according to preliminary tests on the site of the explosion.\nBoth of the airport workers appearing in this video have reportedly been arrested, along with about 20 other people.\nA source within the investigation told CNN that Borleh “knew precisely where to sit and how to place the device to maximize damage.” For some reason, he set off his laptop bomb too early, blowing a hole in the plane far below the necessary altitude to bring the plane down by setting off a secondary explosion in the fuel tank.\nThe bombing highlighted concerns about security at the Mogadishu airport. “The security is zero,” complained Vlatko Vodopivec, the pilot of the plane attacked by Borleh told the Associated Press.\n“When we park there, some 20 to 30 people come to the tarmac,” Vodopivec added. “No one has a badge or those yellow vests. They enter and leave the plane, and no one knows who is who… They can put anything inside when passengers leave the aircraft.”\nHe said pilots are obliged to approach the Mogadishu airport from the seaside direction, because planes flying directly over the city have been hit by gunfire.\nHis employer, Daallo Airlines CEO Mohamed Ibrahim Yassin, agreed that there have been “some lapses” at the airport. Disturbingly, Yassin viewed Somalia as a “region which is under turmoil” where “you can expect such things to happen.”\nYassin said airports “all over the world” were encountering such security lapses. “You know, this threat is all over the place,” he asserted, promising that his airline would “add one more layer of security now” by employing a professional security company for secondary screening.\nThe Express reports that Turkish Airlines has temporarily canceled flights to Mogadishu due to security concerns. Somali officials are said to be tightening security at the airport and looking at reforms to their passenger screening procedures.","url":"https://www.breitbart.com/national-security/2016/02/08/somali-airport-video-shows-workers-handing-laptop-bomb-to-terrorist/"}
