{"authors":["Sam Greenhill And Nick Fagge In Gothenburg","Sweden For Mailonline"],"date_download":"2018-10-23 01:19:16","date_modify":"2018-10-23 01:19:16","date_publish":"2016-01-28 15:35:37","description":"Somali-born Youssaf Khaliif Nuur, appeared in court in Gothenburg, Sweden, charged with murdering Alexandra Mezher, 22, at the child migrant centre where she worked on Monday.","filename":"data/vaneerConsumption/SomaliboykillerofSwedishasylumworkerappearsincourtchargedwithmurder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB40B400000578-0-image-a-21_1453995909553.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421150_First-picture-Six-foot-tall-15-year-old-Somali-boy-killer-Swedish-asylum-worker-appears-court-charged-murder_1540257556.html","title":"'Somali boy killer' of Swedish asylum worker appears in court charged with murder","title_page":"'Somali boy killer' of Swedish asylum worker appears in court charged with murder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Six-foot tall, the 'child' accused of murdering a Swedish aid worker appeared in court today.\nSomali-born Youssaf Khaliif Nuur, ‎charged with murdering Alexandra Mezher, 22, towered over his translator as he walked into the courtroom in Gothenburg.\nShe was knifed to death as she tried to break up a fight at the shelter for unaccompanied child refugees where she worked alone in charge of ten youths.\nScroll down for video\nFirst picture: Somali-born Youssaf Khaliif Nuur, 15, pictured in court in Gothenburg today, is charged with murdering Swedish social worker Alexandra Mezher. At six foot tall, he towered over his translator when he walked into the courtroom in Gothenburg today\nKilled: Miss Mezher (left and right), 22, described as an 'angel' by her mother (left), was fatally stabbed in the back and thigh at the asylum centre for young, unaccompanied migrants in Molndal, Sweden, on Monday morning. She died saving the life of another resident whom allegedly knife-wielding Khaliif Nuur was trying to kill, police sources said\nShe died saving the life of another resident whom allegedly knife-wielding Khaliif Nuur was trying to kill, police sources said. Swedish prosecutors admit they do not know if Somalian Khaliif Nuur, supposedly aged 15, is his true identity.\nPsychology graduate Miss Mezher had warned her mother she ‎was caring for 'big powerful guys' aged up to 24 in the shelter for children aged 14 to 17.\nChildren's asylum applications are fast-tracked ‎in Sweden, prompting some grown men to lie and say they are teenagers. ‎Handcuffed Khaliif Nuur, looking older than his supposed 15 years, was ushered into court wearing a blanket over his head, a white T-shirt, light blue shirt and jeans.‎\nJudge Henrik Andersson asked him: 'Are you Youssaf Khaliif Nuur?' and he nodded and said yes.\nHe asked if he wanted to make a statement regarding the charges of murder and attempted murder, and his lawyer Nicklas Unger said: 'My client does not want to express himself in any way regarding the charges.'\nHe said his client objected to being held in custody, but prosecutor Linda Viking argued he might abscond or interfere with evidence if he was bailed.\nThe hearing then continued behind closed doors, and the alleged killer was ‎later remanded into custody until February 11.\nHearing: Somalian Khaliif Nuur, supposedly aged 15, towered over his translator during today's court hearing where court papers showed prosecutors do not know his true identity. Children's asylum applications are fast-tracked in Sweden so some men say they are teenagers\nKilled: Psychology graduate Miss Mezher, was working alone on a night shift at the child migrant centre on the morning she died\nArgument: Khaliif Nuur is being held in police custody at the high security Sahlgrenska University Hospital, Gothenburg, a psychiatric unit for patients with psychological and addiction issues. Miss Mezher was working at a shelter for unaccompanied child refugees (pictured)\nOutside court prosecutor Linda Viking said: 'The suspect has said he is 15 so that is what is charged as. But we are checking his date or birth and name to make sure they are accurate.'\nShe said he had arrived in Sweden last summer. Asked how he travelled, she said: 'I can't comment on that.'\nA source close to the investigation told MailOnline: 'Youssaf Khaliif Nuur is older than 15. You can see he has moustache and a beard. He shaves but you can see he has facial hair.\n'He is between 16 and 20 I believe. He is from Somalia. He left Africa less than a year ago. He has only recently arrived in Sweden. He spoke the Somalian language very well,' they added.\nThe bloodshed happened at breakfast on Monday at the child shelter in Mölndal, a suburb of Gothenburg, where Miss Mezher was the only member of staff on duty.\nKhaliif Nuur allegedly launched an unprovoked attack on another youth, and Miss Mezher intervened and was stabbed in the back and thigh, and died in hospital hours later. ‘The murder started with an attack on another man,’ a source at Gothenburg Police told MailOnline today.\n‘There was an argument between the suspect and another resident at the hostel. I don’t know the reason for the argument between the two residents. But in some way this woman got between them. She was trying to break up the fight.\n‘This lady [Alexandra Mezher] tried to separate them and told him [Youssaf Khaliif Nuur] to stop but he [allegedly] stabbed her.’\nTragedy: A police officer in Sweden has told MailOnline the psychology graduate (right) died trying to break up a fight between two migrants on Monday morning. She was the only member of staff on duty at the shelter when the fight broke out\nCourt papers: Khaliif Nuur, 15, appeared in court in Gothenburg today charged with murder and attempted murder. Court documents show the authorities have no proof that the suspect's name is his true identity\nLocked up: The suspect, Somali-born Youssaf Khaliif Nuur who is accused of murdering a Swedish aid worker, is being held at the high security psychiatric clinic at Sahlgrenska University Hospital in Gothenburg. The facility is for patients with psychotic illnesses\nThe source dismissed any suggestion that the killing had a sexual motive. He added murder suspect Youssaf Khaliif Nuur, 15, had complained of feeling ‘unwell’ the night before and had not slept at all in the hours before the alleged attack.\nThe teenager is currently being held at a secure psychiatric hospital on the outskirts of Gothenburg.\nThe Gothenburg Police source told MailOnline: ‘There was no sexual motive in the murder. This Somali man did not have a motive for the attack other than he was not feeling well. This lady tried to separate them and told him to stop but he stabbed her.\n‘The suspect had been up all night. He had said he was not feeling well the night before.’\nIt has been suggested that Nuur has psychological issues and had a breakdown in the hours before the attack and complained of hearing voices in his head.\nThe source revealed: 'The knifeman may have had some kind of breakdown. He may have suffered some trauma previously in his life.'\nThe source said he was heard pacing around his bedroom for most of the night before the attack at 8am on Monday.\nManagers of the adolescent migrant centre should not have let Miss Mezher work the night shift on her own if they knew one of the residents was suffering a mental health breakdown, the Gothenburg Police source claimed.\nHe told MailOnline: ‘If the management of the centre knew that one of the residents was not [mentally] well [they] should have got in extra staff to help her that night.'\nThe source, who has worked for Gothenburg Police for over 30 years, has detailed the ‘explosion in crime’ in the Swedish city since the country ‘threw open the doors’ to mass immigration.\nLife taken: Alexandra's mother said her daughter (second from left) had been warned four hours before she started her last shift that a knife had been stolen from the kitchen, but nothing was apparently done. She was working alone in charge of ten youths\nHe told MailOnline: ‘We have experienced an explosion in crime, particularly violent crime, since our politicians threw open the doors to immigrants from all over the world. I have worked in Gothenburg for over 30 years and I have never known anything like it.\n‘The city always had a bit of trouble, but it was usually among people who were drunk and knew each other.\n‘But now I will not let my children go into the city after 2pm and especially not at night. There are violent gangs roaming around the streets and the use of knives and other weapons have become normal, rather than a rarity as it used to be.\n‘There are 20 robberies in Gothenburg every day – usually with violence or the threat of violence. This week an 83-year-old lady had a gun put in her face when she was mugged on her way to play bingo. They got away with just 50 Kroner [about £4].\n‘In the summer there were mass shootings with lots of people killed, including a little girl.’ He added the city streets were now at the mercy of gangs of young men mainly from North Africa.\nThe source revealed: ‘In the past couple of months we have noticed a dramatic increase in street robbery. This is a new phenomenon.\n‘They will do anything to get money – steal a person’s wallet, iPhone, jewellery. And then they will attack their victim and kick them half to death.\n‘Drug crime has gone through the roof. Every drug is available on the street nowadays, even in broad daylight. And when the police arrest someone nowadays the suspect often fights back – with a knife or a screwdriver. This is not something we have seen before.’\nHard working: Psychology graduate Miss Mezher, who was a Lebanese Christian whose parents were from Beirut, was described by her mother Chiméne as an 'angel'. She was stabbed to death while working a night shift alone at a centre for migrant children","url":"https://www.dailymail.co.uk/news/article-3421150/First-picture-Six-foot-tall-15-year-old-Somali-boy-killer-Swedish-asylum-worker-appears-court-charged-murder.html"}
