{"authors":["Associated Press"],"date_download":"2018-10-23 01:21:55","date_modify":"2018-10-23 01:21:55","date_publish":"2017-03-16 11:14:37","description":"MOGADISHU, Somalia (AP) - Somali pirates who seized a Comoros-flagged oil tanker earlier this week after five years without a major hijacking in the region...","filename":"data/vaneerConsumption/Somalipiratesreleaseoiltankerandcrewofficialssay.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/20/wire-230611-1489696474-309_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319756_Somali-official-says-pirates-open-fire-local-naval-forces_1540257715.html","title":"Somali pirates release oil tanker and crew, officials say","title_page":"Somali pirates release oil tanker and crew, officials say | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MOGADISHU, Somalia (AP) - Somali pirates who seized a Comoros-flagged oil tanker earlier this week after five years without a major hijacking in the region have released the ship and its crew without conditions, officials said late Thursday.\nSecurity official Ahmed Mohamed told The Associated Press the pirates disembarked the ship, which was heading to Bossaso port, the region's commercial hub, with its eight Sri Lankan crew members aboard.\nMohamed said the release occurred after negotiations by local elders and officials with the pirates, who seized the tanker on Monday. The pirates were not arrested but instead were given passage to leave once they disembarked, he said.\nIn this photo taken Monday, Oct. 27, 2014, the Aris 13 oil tanker is seen from a helicopter in the harbor of Gladstone, Australia. Pirates have hijacked the Aris 13 oil tanker off the coast of Somalia, officials and piracy experts said Tuesday, March 14, 2017, the first such seizure of a large commercial vessel on the crucial global trade route since 2012. (Kevin Finnigan/Tropic Maritime Images via AP)\nNaval forces from the semiautonomous state of Puntland and the pirates had clashed earlier Thursday after the pirates opened fire.\nThe hijacking of the Comoros-flagged tanker Aris 13 was the first such seizure of a large commercial vessel off Somalia since 2012. International anti-piracy patrols on the crucial trade route had calmed such attacks, which once numbered in the hundreds.\nAbdirizak Mohamed Ahmed, the director of Puntand's anti-piracy agency, confirmed the release of the ship Thursday night and said naval forces had boarded it to escort it to port.\nThe European Union anti-piracy operation in the region had said the pirates had been holding the crew captive and demanding a ransom. The ship had been anchored off Somalia's northern coast, known to be used by weapons smugglers and the extremist group al-Shabab.\nAhmed said the Puntland naval forces had been dispatched to the area not to free the ship by force but to cut off any supplies to the pirates.\nFamilies of the crew members had tearfully pleaded for the men to be released unharmed. Somali pirates usually hijack ships and crew for ransom. They don't normally kill hostages unless they come under attack.\nThe ship had been carrying fuel from Djibouti to Somalia's capital, Mogadishu, on Monday when it was approached by men in two skiffs and the tanker issued a call for help.\nThe pirates told authorities that the only reason they seized the ship was in protest of the illegal fishing in the area that has threatened livelihoods, not for ransom, Mohamed said.\nCoastal Somalis, including pirates who quit as international patrols increased and became fisherman, have complained of growing harassment by illegal fishermen and attacks by large foreign trawlers.\nThey have blamed Yemeni, Chinese, Indian, Iranian and Djibouti-flagged fishing boats and trawlers, and some have threatened to return to a life of piracy to make money.\nMeanwhile, experts on piracy say some in the region have let down their guard as the number of hijackings decreased in recent years. In December, NATO ended its anti-piracy mission off Somalia's waters.\n___\nAssociated Press writer Bharatha Mallawarachi in Colombo, Sri Lanka contributed.","url":"https://www.dailymail.co.uk/wires/ap/article-4319756/Somali-official-says-pirates-open-fire-local-naval-forces.html"}
