{"authors":["Associated Press"],"date_download":"2018-10-23 05:27:53","date_modify":"2018-10-23 05:27:53","date_publish":"2016-01-29 21:13:53","description":"PROVIDENCE, R.I. (AP) — As affection poured in following the death of former Providence Mayor Buddy Cianci and city officials made plans for him to lie in re...","filename":"data/vaneerConsumption/SomestrugglewithhowtomarkdeathofBuddyCianci.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:b789bf972ce04edbb19c65e7e50c8439-4PuZeKVXE7cd9005b2c876e5c484-102_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422884_Buddy-Cianci-lie-repose-Providence-City-Hall_1540272473.html","title":"Some struggle with how to mark death of Buddy Cianci","title_page":"Some struggle with how to mark death of Buddy Cianci | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Some struggle with how to mark death of Buddy Cianci\nPROVIDENCE, R.I. (AP) — As affection poured in following the death of former Providence Mayor Buddy Cianci and city officials made plans for him to lie in repose at City Hall, other leaders struggled Friday to come up with the appropriate way to mark the death of a man forced from office twice due to felonies.\nCianci, the city's longest-serving mayor, died Thursday at age 74. He was convicted in 2002 of racketeering conspiracy for running the city as a criminal enterprise and spent 4½ years in prison.\nU.S. Sen. Sheldon Whitehouse, who was U.S. Attorney at the start of the criminal investigation that ultimately brought Cianci down, offered a terse reply when asked about his death on Friday.\nFILE - In this Sept. 10, 2014, file photo, former Providence Mayor Buddy Cianci attends a campaign fundraising event in Providence, R.I. The former mayor was hospitalized Wednesday, Jan. 27, 2016 after experiencing severe stomach pains. Cianci died Thursday, Jan. 28, in Providence. He was 74. (AP Photo/Steven Senne, File)\n\"I send my condolences to his family,\" Whitehouse replied, declining to answer further before walking out of the building where he had attended an unrelated event in the city.\nWhitehouse, a Democrat, was outspokenly opposed to Cianci in 2014 when Cianci ran as an independent to try to regain the mayor's office. Whitehouse said at the time that Cianci \"stained the city with corruption, and governed in a uniquely vengeful, vindictive style.\"\nU.S. Rep. David Cicilline, a bitter rival of Cianci's who won the mayor's office after he was sent to prison, sent out his condolences on Twitter, avoiding mention of any bad blood.\n\"Buddy Cianci is a part of the history of our great city and state. Everyone who knew him has a story to tell,\" Cicilline wrote. \"I suspect those stories will be told and retold at barber shops and coffee counters and board rooms throughout the state in the coming days.\"\nMeanwhile, Democratic Gov. Gina Raimondo reversed her position of Thursday and said state flags at government buildings would be flown at half-staff for Cianci — but only during the two days he will lie in repose and on the day of his funeral.\nThe governor said on Thursday that flags would not be lowered statewide because the city was lowering them, and that was a more appropriate place. On Friday, she said she reconsidered. Her spokeswoman says Rhode Island flags will be lowered out of respect for the office Cianci held.\nCianci's body will lie in repose for two days at City Hall, in front of the office he occupied for more than 21 years, said former Mayor Joseph Paolino, a close friend of Cianci's. Visiting hours will be Feb. 6-7 from 12 p.m. to 6 p.m.\nThe funeral mass will follow at 10 a.m. Feb. 8 at the Roman Catholic Cathedral of Saints Peter and Paul in downtown Providence and officiated by Bishop Thomas Tobin.\nPaolino, a Democrat, was elevated to mayor after Cianci, a Republican who eventually became an independent, resigned the first time in 1984. The two had once been political adversaries but became close in later years.\nPaolino said Providence \"lost its greatest champion\" when Cianci died, adding, \"He gave his heart to Providence.\"\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422884/Buddy-Cianci-lie-repose-Providence-City-Hall.html"}
