{"authors":[],"date_download":"2018-10-30 20:32:53","date_modify":"2018-10-30 20:32:53","date_publish":"2014-10-22 16:30:00","description":"WARWICK — Stroll through the tranquil Southwest Georgia town of Warwick and you’ll notice a new police headquarters and two new Chevrolet Tahoe patrol vehicles.","filename":"data/vaneerConsumption/SomeruralGeorgiatownspolicingforprofit.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/10/22/Images/photos.medleyphoto.6302649.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_some-rural-georgia-towns-policing-for-profit__1540931573.html","title":"Some rural Georgia towns policing for profit","title_page":"Some rural Georgia towns policing for profit","title_rss":"NULL","source_domain":"ajc.com","text":"WARWICK — Stroll through the tranquil Southwest Georgia town of Warwick and you’ll notice a new police headquarters and two new Chevrolet Tahoe patrol vehicles.\nThey’re renovating the community center, which doubles as a municipal court, and the town just bought two license plate readers for $25,000 apiece.\nSo how does a city of 416 residents and practically no business tax base afford such niceties?\n“We had the opportunity to generate revenue on Highway 300,” explained City Councilman Ronnie Fennell. “And that’s what we did.”\nThe Warwick Police Department racked up so much traffic ticket revenue, in fact, that the city once renowned as being home to the now-defunct National Grits Festival topped every other local government in the state for the amount collected per capita between 2008 and 2012. Small towns like Warwick — situated along busy state routes or interstates — ranked highest in an unprecedented statewide analysis of traffic ticket revenue by The Atlanta Journal-Constitution.\nIn fact, 30 of the top 35 revenue-generating jurisdictions in Georgia were beyond metro Atlanta in more rural areas of the state. In Georgia and nationwide, experts say, the worst ticket traps are often in sparsely populated burgs with little other revenue to draw upon.\nThe AJC reported on Sunday that Doraville leads the metro area in ticket revenue collected per capita, followed by Morrow, Jonesboro, Pine Lake and Avondale Estates. But none of them comes close to the ticket-generating machine that is Warwick.\nThe AJC’s analysis revealed that the city generated $3,113 for every man, woman and child living in its borders – more than 35 times the state median ($86.85).\n“I knew what revenue was being generated,” Councilman Fennell said. “And let me tell you something. I liked it.”\nNevertheless, the City Council fired its police chief in late July. Fennell and his colleagues are now working to establish better policies and oversight after hiring a new chief in September. It the city’s struggle is emblematic of how far some towns have gone to cash in on traffic fines, particularly from out-of-towners navigating unfamiliar highways and byways.\n‘We see the most abuses in rural areas’\nThe ability to squeeze profit from traffic enforcement is sometimes too tempting for small local governments to resist. Adding a few extra officers quickly brings in extra cash, which can be used to create parks and put up new buildings, or to bolster service programs.\nBut it’s a slippery slope. Those extra officers then must bring in a consistent stream of money to justify staying on the payroll.\nAnd it’s not only a Georgia phenomenon. The nation’s speed traps are concentrated in rural areas as well, said John Bowman, spokesman for the National Motorists Association (NMA). The grassroots organization operates www.speedtrap.org, a website where drivers can find and share information.\n“There is a lot of incentive in smaller communities that don’t really have much additional economic base to rely on traffic tickets for a large part of their revenue,” said Bowman. “We see the most abuses in small rural areas.”\nGa. 300, also known as the Georgia-Florida Parkway, is a popular cut-through for drivers headed through Georgia to the western part of Florida. It’s also a key artery between the regional hubs of Cordele and Albany.\nThe speed limit on the road banked by cotton fields drops from 65 mph to 55 mph a few miles outside of Warwick, and then to 45 mph within the city limits.\nTown with 400 people employs 8 to 10 cops\nLess than a decade ago, Warwick had only a handful of officers to police a small cross-hatch of four streets by six streets that occupies less than a square mile. But its police force doubled to between 8 and 10 officers (half of them part-time) under the last two police chiefs, both of whom were dismissed at least in part because of overzealous traffic enforcement.\nAs the department grew, so did the ticket revenue. Between 2008 and 2012, the value of traffic fines more than quadrupled.\n“It’s kind of addicting if you think about it,” said Warwick City Attorney Tommy Coleman. “There is this little town with this highway going through it, and with those revenues they could buy new equipment and get a new police department and all this stuff.”\nThe town’s former police chief, David Morris, was allegedly so aggressive in stopping cars on Ga. 300 that his department’s tactics prompted a backlash this summer from Coleman, the municipal court judge and a public defense attorney.\nThey alleged that Morris instituted a traffic ticket quota – some said as much as 10 tickets per officer, per shift. (Morris denies this). The court officials also voiced concerns that, besides citing drivers for the reason they were initially stopped, officers were piling on citations for lesser offenses to run up individuals’ fines.\nMorris said he told his officers not to cite anyone who was going slower than 63 mph (giving drivers an 18 mph cushion). But he encouraged them to cite drivers for other violations like window tint that was too dark, suspended registration and expired tags, Morris said.\n“There ain’t a whole lot to do here as far as calls for service, so I wanted them patrolling and not sitting around,” Morris said. “I call it an aggressive unit, and a unit doing their job.”\n‘Beware: you are approaching Oliver, Ga.’\nThere were plenty of other examples of Georgia cities reaping huge rewards from careless or reckless drivers.\nFor example, the city of Oliver, a town of 232 in Screven County. The one-caution-light town generated more than $671,000 in ticket revenue between 2008 and 2012. That made it the second highest per-capita revenue generator in the AJC’s analysis.\nCity officials did not return calls seeking comment for this article.\nFormer Effingham County Commissioner Jeff Utley wasn’t surprised. Over the years, several of his friends were ticketed in the town, which sits astride the intersections of Ga. 17 and Ga. 24, just over the border from Effingham County into Screven County.\nGa. 17 is often traveled by motorists cutting through from Atlanta to the Savannah coast.\nUtley said his son was stopped by Oliver police a few years ago for allegedly weaving. His son was asked to take both a urine and breath test for drunken driving (which he passed). Finally he was cited for having tinted windows, Utley said.\nUtley paid about $500 in 2010 to erect a 4-foot-by-8-foot aluminum sign on a relative’s land just outside the town that read “Beware: You are approaching Oliver, Ga., don’t get caught in a speed trap.”\nToo many tickets? Raise the speed limit!\nOne way to fight ticket traps: complain. Take the example of Poulan (pronounced PO-lan), where officials claim to have seen the error of their ways. The town of 833 took in $1.67 million in ticket revenue between 2008 and 2012, but the income has fallen steadily since then.\nPolice Chief Larry Whisenant attributed the change in part to a decision by the Georgia Department of Transportation to raise the speed limit from 45 to 55 mph on U.S. 82, the busiest road through town.\nIf GDOT receives multiple complaints about a jurisdiction, engineers will conduct a speed study to determine the safest speed at which motorists can travel there.\nThe department will then adjust the speed limit accordingly, said GDOT spokeswoman Natalie Dale. In the case of Poulan, GDOT raised the limit after receiving numerous complaints about it being a speed trap, Dale said.\n'I thought I was the traffic guy'\nThe reputation persists despite the ticketing slowdown. A Poulan police vehicle still sits on U.S. 82 about 50 percent of the time, Whisenant said.\nA man who lives just outside of town last month erected a sign on his property that depicts an overweight officer clutching a doughnut and wielding a radar gun. Dollar signs appear to be floating in the air in front of him. The sign warns “speed trap ahead.”\nMaylon Benson, 56, said he put up the sign because he’s tired of police pulling over motorists in his driveway and harassing travelers.\nThe police chief says Benson was seeking revenge against the department for citing his niece more than a year ago and refusing to drop the charges upon his request.\nWhisenant concedes that he handled traffic enforcement aggressively when he took over as chief in 2008. But he said he and his four-officer department have since scaled back, in part because residents complained that police were neglecting neighborhoods.\n“I thought I was the traffic guy, because I love traffic,” Whisenant said of his early days as chief. “Now I’ve realized I had to step back and do more community policing. And you can do both.”","url":"https://www.ajc.com/news/local/some-rural-georgia-towns-policing-for-profit/wdYjcTlZsqUo8Px07C48VJ/"}
