{"authors":["Sylvia Longmire"],"date_download":"2018-10-30 21:31:49","date_modify":"2018-10-30 21:31:49","date_publish":"2014-06-15 18:32:00","description":"On June 13, DHS Secretary Jeh Johnson told reporters in a press conference that the federal government would do what was in the","filename":"data/vaneerConsumption/SomeUnaccompaniedForeignChildrenReceivingBetterCarethanUSFosterKids.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/illegalimmigrants2jpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_06_15__1540935109.html","title":"Some Unaccompanied Foreign Children Receiving Better Care than US Foster Kids","title_page":"Some Unaccompanied Foreign Children Receiving Better Care than US Foster Kids | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On June 13, DHS Secretary Jeh Johnson told reporters in a press conference that the federal government would do what was in the “best interest” of thousands of unaccompanied alien children (UACs) crossing the border into south Texas every week. He also denied that the taxpayer-funded care being provided to them was serving as an incentive to Central American families to send more of their children. But a closer look at the services UACs are receiving while they go through removal proceedings tells a different story.\nOver the last several weeks, US Border Patrol stations in south Texas have been overrun with illegal immigrants from mostly Central America. Johnson said that since October 2013, agents have apprehended over 47,000 UACs, roughly double the 24,000 UACs who were apprehended the previous fiscal year. Prior to 2012, the average number of UACs under US government supervision averaged around 7,500 kids. According to procedures outlined in the Homeland Security Act of 2002, he stated the goal was to transport these children in “a safe and human manner” to the US Department of Health and Human Services, where they would be cared for by the Office of Refugee Resettlement (ORR).\nThe primary goal of the ORR is to reunited UACs with family members or other legal guardians in the United States while they go through removal proceedings. However, if those family members or guardians are in the country illegally, there was no indication by DHS officials that those individuals would also be placed into removal proceedings despite the fact they have to provide a considerable amount of identification in order to claim a UAC.\nProcedures for transporting and caring for UACs depend on the children’s ages. According to the ORR’s Division for Unaccompanied Children’s Services (DUCS), most UACs over the age of 13 are placed in shelters or group homes. However, for UACs ages 13 and younger who don’t have a relative or guardian who can care for them, “short and long-term foster care is available through ORR’s foster care program network.”\nThe services these 58 licensed ORR facilities provide are extensive: “The facilities, which operate under cooperative agreements and contracts, provide children with classroom education, health care, socialization/recreation, vocational training, mental health services, family reunification, access to legal services, and case management.” But perhaps the most interesting claim by DUCS is “Ensuring that the interests of the UAC are considered in decisions related to their care and custody.” The “best interest” of UACs coming from gang war-torn countries like Honduras is almost always a permanent stay here in the United States.\nJohnson defended the services being provided to UACs while going through removal proceedings. “We provide a number of things [for UACs] because our laws require it and our values require it,” he said. He also said that those apprehended at our borders are priorities for removal regardless of age–a sentiment echoed by ICE Executive Associate Director for Enforcement and Removal Operations Tom Homan, who said, “Every [unaccompanied] child is placed into removal proceedings.”\nBut the circumstances for those children in removal proceedings are plush in some cases compared to US citizen children placed in foster care. According to Children’s Rights, a national advocacy group working to reform failing child welfare systems, “many child welfare systems are underfunded, understaffed, beset by serious system-wide problems, and lacking the leadership necessary to fix them.” Some of the claims the group makes are that US child welfare systems fail to protect children in foster care from further abuse and neglect, don’t provide adequate medical and mental health services, and warehouse children in institutions, group homes, emergency shelters.\nThis means one of two things. Either UACs apprehended at the border are being placed into the same system as US citizen children and not receiving nearly the adequate level of care the ORR says it is providing, or UACs are placed into a different federal foster network that provides a superior level of care to that being provided to US citizen children.\nThe legal support US citizen children in foster care and UACs receive can also vary wildly. During court proceedings, American kids in foster care are assigned a lawyer by the judge in their family court to oversee their cases, according to The Legal Aid Society. For UACs, the DUCS engages in “coordination of a pro-bono attorney outreach project to pilot pro-bono capacity building models in major immigration apprehension areas so that more UAC can have access to legal representation.”\nWhile the US government does not pay for legal representation for UACs, many of the children receive assistance from top-notch immigration attorneys who take part in programs like The Safe Passage Project. In May 2014, Director Lenni Benson wrote a letter to The New York Times in which she said, “Our organization, Safe Passage Project, finds that nearly 90 percent of the unaccompanied minors we meet who are facing deportation qualify for immigration relief, allowing them to remain in the United States legally.” Benson also added, “While emergency shelters provide a temporary solution for unaccompanied minors entering the United States, appointed legal counsel to enable these vulnerable young people to receive the immigration remedies for which they might be eligible would provide permanency and would truly be in their best interests.”\nTo say that all these benefits being provided to UACs are not acting as an incentive for families in Central America to send even more children is misleading, irresponsible, and is further eroding the efforts of our law enforcement agencies to control our southwest border.\nSylvia Longmire is a border security expert and Contributing Editor for Breitbart Texas. You can read more about the evolution of cross-border migration in her new book, Border Insecurity: Why Big Money, Fences, and Drones Aren’t Making Us Safer.","url":"https://www.breitbart.com/border/2014/06/15/some-immigrant-children-recieving-better-foster-care-than-us-foster-kids/"}
