{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:50:08","date_modify":"2018-10-31 01:50:08","date_publish":"2018-09-11 13:59:25","description":"It's well-documented that women receive poorer healthcare than men: studies have indiciated that women wait longer for diagnoses, are less likely to be prescribed the most effective painkillers, and often see their concerns dismissed by doctors.…","filename":"data/vaneerConsumption/SomeMedicationIsStillOnlyTestedOnMaleMammalsThatCouldBeAProblemForWomen.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/62586272-19ad-4afe-82f2-cb70d82183ae-shutterstock_1124606594.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_some-medication-is-still-only-tested-on-male-mammals-that-could-be-a-problem-for-women-11867118_1540950608.html","title":"Some Medication Is Still Only Tested On Male Mammals & That Could Be A Problem For Women","title_page":"Some Medication Is Still Only Tested On Male Mammals & That Could Be A Problem For Women","title_rss":"NULL","source_domain":"bustle.com","text":"It's well-documented that women receive poorer healthcare than men: studies have indiciated that women wait longer for diagnoses, are less likely to be prescribed the most effective painkillers, and often see their concerns dismissed by doctors. Now, a new study has indicated that there are differences between the male and female immune systems — and yet medication for related diseases is not prescribed depending on sex (it should be noted that not all those with 'female' immune systems are women, and not all women have 'female' immune systems). What's more, some medication is still only tested on male mammals, as Wired reports, meaning that the resulting drugs might not be appropriate for female patients.\nDr. Susanne Wolf of the Max Delbrück Center for Molecular Medicine, Berlin, conducted a study into immune cells in the brain called microglia, in order to understand why male and female brains respond differently to diseases of the nervous system like Parkinson's disease or multiple sclerosis. She found that the microglia in female mice were different to those of male mice, telling Wired, \"Male microglia are more numerous and larger, so arguably they react faster and stronger in the case of an attack. But on the other hand, they tend to overreact and wear themselves down more easily than female microglia.\"\nHolger Kirk/Shutterstock\nWhy's this significant? Well, as Wired explains, \"To treat the same disease, different drugs have never been tested specifically for men and for women.\" What's more, drugs are often tested solely on male mammals, typically in order to sidestep female hormonal cycles. That's a particular problem in neuroscience — according to Wired, a 2010 study indicated that \"single-sex studies of male animals outnumbered those of females 5.5 to 1 in that field.\"\nSome research organisations are addressing this inequality, as the magazine observes. \"In 2014, the National Institutes of Health (NIH) passed a rule that obligated researchers to have a valid explanation when using single-sex animal models,\" Wired explains. \"The European Commission similarly started the Horizon 2020 campaign — a research and innovation program stretching over seven years with the objective, among others, of including gender differences in research.\"\nAnd Professor Gina Rippon of the Aston Brain Centre observed another reason scientists might hesitate to factor the sex of test subjects into their work. \"One of the concerns is that quite often people jump to interpretations of sex differences to prove that there are biological differences between men and women,\" Rippon told Wired. Still, Dr. Suzanne Wolf told the publication, \"If you are only using male models to research and then develop drugs to treat immune diseases, then clearly it will have an impact on the way we treat women because you will not have been producing drugs that are appropriate for everybody.\"\nVictor Torres/Stocksy\nWolf isn't the first to conclude that men and women experience healthcare differently. The BBC reports on a 2016 study by the Brain Tumour Charity that concluded female brain tumour patients \"were more likely than men to see 10 or more months pass between their first visit to a doctor and diagnosis\" as well as \"to have made more than five visits to a doctor prior to diagnosis.\" Moreover, women in acute pain are less likely to be prescribed opioids than men, according to the broadcaster. And women who visit A&E are more likely to wait longer and less likely to see their cases classed as urgent.\nHealthcare inequality is compounded for women of colour, as racial inequity also contributes to poorer healthcare outcomes. The Guardian reports that in the U.S., African-Americans are more likely to die of lung and liver cancer than white people, while colorectal cancer is particularly lethal for African-Americans in the south. \"Half the disparity comes down to late diagnosis,\" the newspaper says.\nLinda Blount, president of the Black Women's Health Imperative, told the BBC, “We want to think that physicians just view us as a patient, and they’ll treat everyone the same, but they don’t.\" She added, “Their bias absolutely makes its way into the exam room.”\nSean Locke/Stocksy\nPoverty also impacts treatment: Australian charity Cancer Council concluded in 2016, as the Guardian reports, that \"13 percent of cancer deaths [between 1996 and 2000 or 2004 and 2008] could have been prevented if health disparities, such as higher smoking rates and poor access to general practitioners, did not exist.\"\nLittle surprise, then, that the inequality that pervades doctors' surgeries and emergency rooms is also present in the laboratory. Studies continue to demonstrate that women, people of colour, and poor people — and especially those who sit at the intersections of those identities — receive poorer medical care than wealthy white men. What's more, they demonstrate that change, however laborious, is urgently overdue.","url":"https://www.bustle.com/p/some-medication-is-still-only-tested-on-male-mammals-that-could-be-a-problem-for-women-11867118"}
