{"authors":["Jaime Dunaway"],"date_download":"2018-10-30 17:50:30","date_modify":"2018-10-30 17:50:30","date_publish":"2018-10-30 00:00:00","description":"Heavy rain forecast for Halloween night is prompting some central Arkansas neighborhoods to reschedule their trick-or-treating plans.","filename":"data/vaneerConsumption/SomeLittleRockneighborhoodsmovetrickortreatingtoTuesdaywithheavyrainsforecastonHalloween.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/Screen_Shot_2018-10-30_at_10.44.39_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540921830.html","title":"Some Little Rock neighborhoods move trick-or-treating to Tuesday with heavy rains forecast on Halloween","title_page":"Some Little Rock neighborhoods move trick-or-treating to Tuesday with heavy rains forecast on Halloween","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Heavy rain forecast for Halloween night is prompting some central Arkansas neighborhoods to reschedule their trick-or-treating plans.\nShowers and thunderstorms will move into the state late Tuesday and drop up to 3 inches of rain before exiting Thursday evening, according to the National Weather Service.\nThe bulk of the heavy rain will fall Wednesday afternoon and evening when many people will be out trick-or-treating, National Weather Service meteorologist Sean Clarke said.\nIn Little Rock, more than 2 inches is expected to fall on Halloween, he said.\nThere is a chance of severe weather, but the greatest possibility exists in the region just south of Little Rock, according to the weather service. An area stretching from Texarkana to Brinkley is under a marginal risk, while the southeastern counties of Union, Ashley and Chicot are under a slight risk.\nTemperatures in the lower 70s are forecast for Wednesday, but they will drop quickly once a cold front moves into the area, Clarke said. He added that in Little Rock, the high will hit quickly by 1 p.m. and drop into the mid-60s by 6 p.m.\nTo avoid the rain, some neighborhoods are moving trick-or-treating activities to Tuesday night. Cloudy, but dry, skies with temperatures in the low 70s are forecast.\nCity of Little Rock spokesman Lamor Williams said that because the city does not have an official Halloween event, neighborhood associations are encouraged to make their own decisions about what day to trick-or-treat.\nSeveral associations have already announced plans.\nTrick-or-treating on Tuesday:\nLittle Rock Heights neighborhood\nLittle Rock Pleasant Valley neighborhood\nLittle Rock Villages of Wellington neighborhood\nTrick-or-treating on Wednesday:\nBryant\nConway\nJacksonville\nMaumelle","url":"https://www.arkansasonline.com/news/2018/oct/30/neighborhoods-change-trick-or-treating-plans-heavy/"}
