{"authors":[],"date_download":"2018-10-30 19:17:41","date_modify":"2018-10-30 19:17:41","date_publish":"2016-10-11 11:01:00","description":"Some Kennesaw State University students and faculty attempted to mount pressure Monday on a state bo...","filename":"data/vaneerConsumption/SomeKSUstudentsfacultyopposeSamOlenspresidency.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/11/Images/newsEngin.16417051_Sam-Olens2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_some-k_84b2239fc37f8c5fb31817b732c3b963__1540927061.html","title":"Some KSU students, faculty oppose Sam Olens presidency","title_page":"Some KSU students, faculty oppose Sam Olens presidency","title_rss":"NULL","source_domain":"ajc.com","text":"Some Kennesaw State University students and faculty attempted to mount pressure Monday on a state board to delay Wednesday’s scheduled vote on appointing Georgia Attorney General Sam Olens as the school’s president.\nA large group of students and faculty lined KSU’s Campus Green around midday Monday in a silent protest. Later Monday, the American Association of University Professors released a letter it sent to state Board of Regents chairman Kessel Stelling Jr. asking the board to conduct a national search and that KSU faculty be involved in the search.\n“While the decision of the regents to forego a national search may be permissible under the applicable University System of Georgia policies, the decision is at odds with widely observed principles of academic governance, as it deprives the faculty of its appropriate role in the process,” the association wrote.\nOlens, a former Cobb County commissioner and two-term commission chairman, is the only candidate who has been interviewed by a Regents committee for the job. Supporters say Olens’ legal and political experience, along with his Cobb County ties, make him an ideal president.\nTo read more about the debate surrounding whether Olens is the right man for the job, click here.\nFor more Cobb County News, like us on Facebook or follow us on Twitter and Instagram","url":"https://www.ajc.com/news/local-education/some-ksu-students-faculty-oppose-sam-olens-presidency/0jydiRlvIBivp6pRAvQSPO/"}
