{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 02:39:58","date_modify":"2018-10-23 02:39:58","date_publish":"2017-03-16 13:17:21","description":"Conservation volunteers at Collard Hill in Somerset are said to have watched Phillip Cullen chasing and swiping at a Large Blue butterfly with a net before leaving the site with white plastic bags hours later.","filename":"data/vaneerConsumption/SomersetmancaughtandkilledUKsrarestbutterfly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E545C6400000578-0-image-a-170_1489669726327.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320172_Collector-57-caught-killed-UK-s-rarest-butterfly_1540262398.html","title":"Somerset man 'caught and killed UK's rarest butterfly'","title_page":"Somerset man 'caught and killed UK's rarest butterfly' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Phillip Cullen, 57, pictured outside Bristol Magistrates Court today, is accused of six offences relating to Large Blue butterflies\nA collector went to protected sites to capture specimens of Britain's rarest butterfly which he killed and then kept at his home, a court heard today.\nPhillip Cullen is accused of six offences relating to Large Blue butterflies, which are endangered globally.\nThe 57-year-old defendant from Bristol was allegedly seen climbing over a locked gate with a net at Collard Hill, near Street, Somerset, in June 2015.\nConservation volunteers are said to have watched Cullen chasing and swiping at a Large Blue (Maculinea arion) butterfly with the net before leaving the site with white plastic bags hours later.\nCullen also clambered over a gate into Daneway Banks near Cirencester in Gloucestershire on the same day, Bristol Magistrates' Court was told.\nHe was approached by a volunteer after being seen with a net and claimed he was interested in parasitic wasps.\nThe court heard Large Blue butterflies were found at Cullen's home in Cadbury Heath, Bristol, in February last year.\nProsecutor Kevin Withey told the court: 'It is an offence to capture, kill or possess that butterfly because it is a protected species in the UK.\n'The Large Blue became extinct in around 1979 and was reintroduced in the 1980s.\n'It was reintroduced to two areas locally, the Collard Hill nature reserve and another location near Cirencester.'\nIt is an offence to capture, kill or possess the Large Blue butterfly (file picture) because it is a protected species in the UK, the court heard\nMr Withey said witnesses saw Cullen with a small net and a video camera at both sites on June 18.\nA warrant was executed at Cullen's home months later and officers found a large number of butterflies, including Large Blues, it is alleged.\n'It is critical to the case that some of those butterflies were labelled by the defendant,' Mr Withey said. 'One is labelled CH18 and one is labelled DB18.'\nMr Withey said these referred to Collard Hill and Daneway Banks and the date the butterflies were captured, June 18.\nIn interviews, Cullen claimed the labels were in relation to the colours of the butterflies - cobalt hue and dark blue.\nThe court heard butterflies are never labelled in this manner.\nUK's rarest butterfly The Large Blue is the largest and rarest of blue butterflies and has a row of black spots on its upper forewing. It spends most of the year within the nests of red ants, where the larvae feed on ant grubs. The globally-endangered species has always been rare in Britain but became extinct in 1979. In 2004, it occurred on nine sites in the country, following a major conservation programme.\nNeil Hulme, of the Butterfly Conservation charity, was at Collard Hill on June 18 and saw Cullen and another man arrive at 1am.\nHe told the court he watched the two men climb over a locked gate with plastic bags appearing to contain glass jars and a net.\n'I knew that to be carrying a net or to be catching anything would require a permit,' Mr Hulme said.\n'I saw him [Cullen] clearly chasing for a distance of 15 to 20 metres what I knew to be a Large Blue. I saw him take two swipes at it but I don't think they were successful.'\nMr Hulme took photographs of the man and later reported his behaviour to superiors at Butterfly Conservation.\nWhen asked about people who collect Large Blue butterflies, he replied: 'It is probably really a small hardcore of people.\n'It is not something which is widespread but people involved are usually quite determined in their efforts.'\nThe court heard the net Cullen was holding was smaller than a typical butterfly net.\n'It would be very easy to catch a Large Blue in a net like that without any damage,' Mr Hulme said.\nMark Greaves, a volunteer for Butterfly Conservation, saw Cullen and another man at Daneway Banks on June 18.\nHe told the court the Large Blue is a native British butterfly of which numbers began to decline from the 1800s.\nLarge Blue butterflies were found at Cullen's home in Bristol in February 2016, the court heard\nHowever, a reintroduction plan was started after the butterfly became extinct in the UK, using stock from Sweden.\nMr Greaves said there is a secondary market for Large Blue butterflies mocked up to look like 'old Victorian species'.\nThese can fetch between £200 and £300 each. The enthusiast approached Mr Cullen after spotting him with a net on the site.\n'He said he was interested in parasitic wasps but he hadn't seen one,' he said. 'There are very few people who are interested in parasitic wasps.'\nAfter leaving the site, Mr Greaves saw Cullen and the other man in a nearby lay by, looking in their white plastic bags. Cullen denies six charges, relating to two Large Blue butterflies.\nGeoffrey Martin, of the Natural History Museum, said there were up to 30 trays of butterflies at Cullen's home.\nThe court heard that Cullen was linked to an eBay account with the username biker205.\nIn interview, Cullen admitted selling butterflies at auction, including those from Britain.\nHe said he bought butterflies from farms in Europe, set and pinned them in cases and then sold them at auction.\nIn court today, Cullen said he had not caught or killed any Large Blue butterflies on June 18 but had done so 'decades' earlier.\n'I went out to catch butterflies and I am not sure when and where and that's the truth,' he said.\nHe insisted he went to Collard Hill to film the Large Blue and to collect parasitic wasps, which he had been interested in for about four years.\nCullen said he and his friend, Andrew Carter, climbed into the site as it was the quickest way in.\nHe admitted taking a small net but said this was only on a \"scrubby field\" and not the main parts of the site.\nWhen asked if he had used it to catch Large Blue butterflies, he replied: 'Absolutely not'.\nCullen told the court he had purchased the Large Blue butterflies found at his home from abroad.\n'The majority came from France, they were bought,' he said. 'I bought them in a big case of butterflies.'\nHe confirmed that CH referred to 'cobalt hue' and DB to 'dark blue', adding that 18 referred to the size of a butterfly's wingspan as it lands.\nThe trial continues.","url":"https://www.dailymail.co.uk/news/article-4320172/Collector-57-caught-killed-UK-s-rarest-butterfly.html"}
