{"authors":[],"date_download":"2018-10-30 19:38:17","date_modify":"2018-10-30 19:38:17","date_publish":"2018-08-13 20:14:00","description":"As work continues on the makeover of Philips Arena, the Hawks announced Monday that several of the b...","filename":"data/vaneerConsumption/SomepremiumspacessoldoutatremadePhilipsArenaHawkssay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/13/Images/PLAYERSCLUB.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_some-premium-spaces-_953ca748361897e0825b300a1ee4f885__1540928297.html","title":"Some premium spaces sold out at remade Philips Arena, Hawks say","title_page":"Some premium spaces sold out at remade Philips Arena, Hawks say","title_rss":"NULL","source_domain":"ajc.com","text":"As work continues on the makeover of Philips Arena, the Hawks announced Monday that several of the building’s new premium spaces are sold out for the 2018-19 season.\nThe $192.5 million renovation of the arena is scheduled for completion in mid-October. The Hawks will start the season with three road games before returning to Philips for their home opener Oct. 24 against the Dallas Mavericks.\nThe Hawks said the sold-out areas are the “Players Club,” located in the lower bowl behind the team benches; the “Veranda Suites,” also located in the lower bowl; and the “Courtside Club”, which includes the on-the-arena-floor bar that debuted last season.\n“We’ve experienced tremendous success in the marketplace,” Michael Drake, the Hawks’ senior vice president of corporate partnerships and premium sales, said in a statement, “and believe we’ve developed an appealing array of products for any guest who seeks a great night out in Atlanta.”\nAvailability remains for several other new premium spaces. Those include “Atlanta Social,” which features terrace tables, lounge suites and couches; the “Loft Suites,” which are located above the veranda suites; and the “Chef’s Club,” a supper club that will serve a food and beverage menu curated by executive chef Joe Schafer.\nThe premium spaces come with access to all Hawks games and right of first refusal to the arena’s other events. The Hawks said a wait list is open for the sold-out spaces.\nRELATED: Extreme makeover is transforming Philips Arena","url":"https://www.ajc.com/sports/some-premium-spaces-sold-out-remade-philips-arena-hawks-say/pOvrJF8xTQkZ0KAwKTeN0O/"}
