{"authors":["Associated Press"],"date_download":"2018-10-22 23:36:19","date_modify":"2018-10-22 23:36:19","date_publish":"2017-04-26 08:18:17","description":"DENVER (AP) - Deep snow is melting into Western mountain streams, but some farmers and ranchers on the high plains are struggling amid a lengthy dry spell...","filename":"data/vaneerConsumption/Somehighplainsfarmersstrugglingafterfiresdrought.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465849-1493217699-168_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446558_Some-high-plains-farmers-struggling-fires-drought_1540251379.html","title":"Some high plains farmers struggling after fires, drought","title_page":"Some high plains farmers struggling after fires, drought | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DENVER (AP) - Deep snow is melting into Western mountain streams, but some farmers and ranchers on the high plains are struggling amid a lengthy dry spell and the aftermath of destructive wildfires.\nA swath of Colorado, Kansas, Oklahoma and Texas has been in a drought or near-drought condition for six months, putting some of the winter wheat crop in doubt.\nThe March fires burned nearly 2,100 square miles (5,400 square kilometers) in the four states. Six people died. Agriculture officials say the fires also killed more than 20,000 cattle and pigs and damaged or destroyed about $55 million worth of fences.\nFILE - In this March 22, 2017 file photo, Kansas State student Reagan Butler and others from a Manhattan youth group help remove damaged fencing over thousands of acres in fire-ravaged Clark County, Ark. The Western mountains are flush with snow and California has canceled its drought emergency, but some farmers and ranchers on the high plains are struggling amid a lengthy dry spell and the aftermath of destructive wildfires. (Michael Pearce/The Wichita Eagle via AP, File)\n\"The first word you think of is devastating, financially,\" said David Clawson, a farmer and rancher in southwestern Kansas who lost 40 head of cattle to the fires. \"But it's hard to really quantify yet. We're just 30 days into it.\"\nThe governors of Kansas and Texas have signed disaster declarations. The U.S. Department of Agriculture hasn't calculated the total damages, but Texas alone estimated the cost to farmers and ranchers to be $25.1 million.\n\"That first week, we were in shock,\" said Clawson, who is also president of the Kansas Livestock Association.\nApril rains on parts of the high plains have eased the drought and helped the grassland recover, but it could be weeks or longer before cattle can be turned out to graze, leaving some ranchers a choice of buying costlier feed or culling their herds.\n\"Some of the ground will not be grazed this year at all to let it recover,\" said Oklahoma Agriculture Commissioner Jim Reese.\nThe U.S. Drought Monitor, operated by federal weather and agricultural agencies, showed much of the area either abnormally dry or in a moderate drought on April 18.\nThe outlook through June was for drought to persist in a crescent-shaped area from northeastern Colorado, across southwestern Kansas and into central Oklahoma. Drought could worsen in the Texas Panhandle, the outlook said.\nDrought is a constant threat in this semi-arid region, which saw the worst devastation from the Dust Bowl of the 1930s.\nScant precipitation last fall left newly planted winter wheat struggling to take hold in many areas.\n\"It needs to germinate and emerge to hold the ground from erosion,\" Colorado Agriculture Commissioner Don Brown said.\nFarmers won't know how healthy the wheat crop will be for a month or so.\n\"We just don't know if we've got enough green growth and root strength,\" Brown said.\nCrops and grassland across the high plains thrived last year after a far worse drought from about 2010 to 2015.\nSome ranchers had just begun to rebuild their herds after cutting back during the earlier drought, when grazing was poor.\nStanley Barby, a lifelong rancher in the Oklahoma Panhandle, said he had been adding to his herd slowly to protect the recuperating grassland.\n\"We were trying to let that grass recover from the drought and so we didn't overgraze,\" he said. \"We stocked really slow.\"\nBut the thicker grass turned into fuel for last month's wind-driven wildfire.\n\"That's why the fire was so hot, why it did so much more damage than usual,\" he said.\nBarby said his ranch is 65 to 70 square miles (160 to 180 square kilometers), and fire charred about 50 square miles (130 square kilometers). He lost nearly 50 cattle, three houses and more than 150 miles (240 kilometers) of fence.\n\"We just put our heads down and go to work,\" he said.\nBarby, Clawson and other farmers and ranchers said they were overwhelmed by a flood of donations from farmers, ranchers and others who offered feed, fencing materials and cash. Students and 4-H members helped clean up.\n\"They're just showing up, not asking for anything,\" Clawson said.\n\"We're just very grateful for all the support that we've gotten, and the thing is, none of us know how to say thank you, or in the right way,\" he said.\n___\nFollow Dan Elliott at http://twitter.com/DanElliottAP. His work can be found at https://apnews.com/search/dan%20elliott.\nFILE - In this March 7, 2017 file photo, a lone cow wanders charred prairie following devastating wildfires in Clark County, Ark. The Western mountains are flush with snow and California has canceled its drought emergency, but some farmers and ranchers on the high plains are struggling amid a lengthy dry spell and the aftermath of destructive wildfires. (Michale Pearce/The Wichita Eagle via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4446558/Some-high-plains-farmers-struggling-fires-drought.html"}
