{"authors":[],"date_download":"2018-10-30 21:29:07","date_modify":"2018-10-30 21:29:07","date_publish":"2015-05-22 12:59:13","description":"A friend of mine recently had a visit from the police after professional blackmailers got their hands on a video of him pleasuring himself during a Skype |","filename":"data/vaneerConsumption/SomeonePleaseBlackmailMeSoICanBecomeTheNextKimKardashian.json","image_url":"https://media.breitbart.com/media/2015/05/Screen-Shot-2015-05-22-at-12.38.45.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_05_22__1540934947.html","title":"Someone Please Blackmail Me So I Can Become The Next Kim Kardashian","title_page":"Someone Please Blackmail Me So I Can Become The Next Kim Kardashian | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A friend of mine recently had a visit from the police after professional blackmailers got their hands on a video of him pleasuring himself during a Skype chat. They were threatening to send the video to all his Facebook contacts if he didn’t cough up some money.\nWhat a lucky bastard. For years, I’ve been hoping that one of the many racy pictures and videos of me floating around the internet would show up. You see, I’m at that stage in my career when a sex tape would really boost my profile. It worked for my celebrity idols Paris Hilton and Kim Kardashian, so why not me?\nWhat’s a guy to do? It’s not like I haven’t been trying: whenever a sexual partner whips out a GoPro I can’t say yes fast enough.\nKardashian and I, in particular, have a lot in common. For instance, we’ve both left a string of heartbroken black guys in our wake and we both have implausibly huge bottoms. And the reason, I’m sure, why a reality show about my life is yet to be commissioned is simply that there is no saucy footage of me out there on the blogs.\nThe Adam and Eve of celebrity sex tapes are Pamela Anderson and Tommy Lee. Granted, no one ever heard of Tommy Lee again after the video came out – except maybe hepatitis researchers. But Pammie’s star was propelled into the stratosphere with the release of her dirty home movie.\nYou see, women always benefit from leaked sexual footage. Just look at the outpouring of sympathy for Jennifer Lawrence. Sex tape scandals are always presented as though an innocent ingénue has been violated by a rapey male pornographer. As if these canny bitches on the make didn’t know there was a camera in the room!\nAnd that’s before we get into whether or not some of these women had a hand in the leaks themselves: rumours have dogged Paris Hilton ever since One Night In Paris hit the shelves. To be frank, it was the best thing that ever happened to her.\nThen again, there’s a precedent for a bleach-blonde British Cypriot in need of a career lift releasing a sex tape with a black dude. It doesn’t bode well. Tulisa Contostavlos from The X Factor was the subject of a tape that seems in fact to have hampered her career, rather than eliciting any sympathy.\nIs it a British thing? Not only are British sex tapes a lot grubbier (low production values, shaky camera work, nasty bedrooms) but we have a more puritanical attitude toward sex, it seems to me. We don’t mind cheeky boobs on Page 3, but seeing a star sullied in a grimy home video really brings out our judgemental sides.\nAmericans tend to “own it” and take these things in their stride, often using temporary embarrassments as merely another rung on the ladder to personal redemption.\nAnyway, I reckon it’s worth a try. So if you’re a hacker out there with the keys to iCloud, or even just a vengeful would-be pornographer like Rick Salomon, call me! I’ll totally cut you in.","url":"https://www.breitbart.com/europe/2015/05/22/someone-please-blackmail-me-so-i-can-become-the-next-kim-kardashian/"}
