{"authors":[],"date_download":"2018-10-30 20:26:50","date_modify":"2018-10-30 20:26:50","date_publish":"2015-11-04 11:58:11","description":"When customers walked into the Citgo Food Mart on Empire Boulevard at Browns Mill Road with little or no money, the convenience store clerk regularly gave them something to eat — or offered them whatever he was eating.","filename":"data/vaneerConsumption/Somuchgoodyoucansayaboutclerkwhowasshotduring.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/04/Images/photos.medleyphoto.8350418.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_much-good-y_891f8343d6021f2dadd409e8185234ca__1540931210.html","title":"‘So much good you can say’ about clerk who was shot during...","title_page":"‘So much good you can say’ about clerk who was shot during...","title_rss":"NULL","source_domain":"ajc.com","text":"When customers walked into the Citgo Food Mart on Empire Boulevard at Browns Mill Road with little or no money, the convenience store clerk regularly gave them something to eat — or offered them whatever he was eating.\n“He’s just that kind of guy,” said Alfred Murrill, who works at a salvage business across the street and goes to the Citgo in southwest Atlanta every day.\nThat is why Murrill cannot understand why someone shot the clerk Wednesday during a predawn robbery.\nAtlanta police spokeswoman Elizabeth Espy said the victim, whose name has not been released, told police several men entered the store shortly before 5 a.m. and knocked on the door to the secured clerk’s booth.\nSurveillance video shows the clerk open the door and two men, hoods pulled up, walk in. One of them immediately pulls out a handgun and points it at the clerk, who was walking toward the rear of the store.\nThe clerk turns around, notices the gun and appears to try and direct it away from his body. The suspect steadies the gun at the clerk’s head as an accomplice, standing behind the clerk, fires.\nThe clerk was shot in the leg, and two more men enter the store as he lies on the floor.\nThe suspects took an undetermined amount of cash from the register and safe and then fled, Espy said.\nThe clerk was taken to Grady Memorial Hospital in stable condition.\nMurrill said the victim is “not a stranger to nobody.\n“There’s so much good you can say about him. I don’t know where to start.”\n—Staff writer Tyler Estep contributed to this article.","url":"https://www.ajc.com/news/crime--law/much-good-you-can-say-about-clerk-who-was-shot-during-robbery/eEB4xS0VmEflA2JZnnUNjN/"}
