{"authors":["Associated Press"],"date_download":"2018-10-22 22:28:15","date_modify":"2018-10-22 22:28:15","date_publish":"2017-04-26 04:30:20","description":"NEW YORK (AP) - Stephen Sondheim, whose fellow honorees at Tuesday night's gala for PEN America included an imprisoned Ukrainian filmmaker and the organizers...","filename":"data/vaneerConsumption/SondheimanhonoreeTrumpatargetatannualPENgala.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446214_Sondheim-honoree-Trump-target-annual-PEN-gala_1540247295.html","title":"Sondheim an honoree, Trump a target at annual PEN gala","title_page":"Sondheim an honoree, Trump a target at annual PEN gala | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Stephen Sondheim, whose fellow honorees at Tuesday night's gala for PEN America included an imprisoned Ukrainian filmmaker and the organizers of the women's marches in January, was in a humble mood.\n\"I write songs for musicals, for god's sake. Musicals, the runt of the arts,\" Sondheim said as he accepted a Literary Service Award from the literary and human rights organization. \"But then I thought if institutions of higher learning now not only offer courses on the subject but have entire departments devoted to musical theater; if you can sign up for Cole Porter 101, 102; if Bob Dylan can win the Nobel Prize; maybe it's OK to take musicals seriously - but not too seriously.\"\nSondheim's speech was one of the lighter moments for a night otherwise unique for PEN America. Past ceremonies have focused on threats to free expression abroad, but Tuesday's gala at the American Museum of Natural History was a long look homeward. Virtually every speech and segment referred to President Donald Trump and potential dangers in the U.S., from a short film at the beginning that cited his attacks against the media to a \"Call to Action\" at the end by former U.S. poet laureate Rita Dove to support the endangered National Endowment for the Arts and the National Endowment for the Humanities.\nTrump likes to boast that he is good for television ratings, but he has also proved an unintentional, even record-breaking fundraiser for liberal organizations such as PEN and an unexpected booster for dystopian fiction. The organization raised $2 million Tuesday, an all-time high for its annual gala, and a final bit of money - $28,000 - came from a live auction for a first edition of George Orwell's \"1984,\" a top seller this year thanks to concerns that Orwell's world of doublespeak and endless war could become ours.\nPEN's speakers were mostly celebrated for resistance. Bob Bland accepted the Freedom of Expression Award on behalf of herself and fellow organizers of the women's march held the day after Trump's inauguration. She vowed she and others would not rest until \"women have parity at all levels of society.\"\nThe winner of the PEN/Barbey Freedom to Write Award was Oleg Sentsov, a Ukrainian filmmaker serving a 20-year sentence on widely-disputed charges of terrorism. He sent a letter from prison, read aloud at the ceremony, in which he wrote about what really mattered to him: \"understanding that those close to you, the time you spend with them and the warmth that they gave you, this is the most important thing in life.\"\nSondheim made no similar claims to profundity, joking that plays such as \"A Little Night Music\" were unlikely to save the world. But he noted his sponsorship of young playwrights and his fight against a dangerous kind of repression - repression of the imagination. Meryl Streep, who introduced him, contended that his body of work had never mattered more, providing a soundtrack for a dynamic vision of America.\n\"And when we debate whether and how to hold on to the America we know and love, we're thinking of the America that Stephen Sondheim has revealed to us,\" she said, \"a place that's vibrant, expressive, dissonant and dramatic, moral, immoral, yearning, despairing, sensible and always funny.\"\nThe PEN gala often presents a contradiction, a roomful of like-minded people agreeing on the right to disagree. Macmillan CEO John Sargent, honored for his contributions as a publisher, warned that it was important to respect opinions a liberal community might otherwise find offensive and spoke of \"a steady drumbeat asserting lines should be drawn.\"\n\"The very act of drawing a line or making that decision runs counter to our obligations to defend free speech,\" he said.\nLater at the gala, Sargent would look on from his table up front and be reminded of his own company's pluralism. PEN Executive Director Suzanne Nossel praised the opposition so far to Trump and conservative culture and was greeted with cheers when she cited Bill O'Reilly's firing from Fox News.\nO'Reilly also is a million-selling author, published by the Macmillan-owned Henry Holt.","url":"https://www.dailymail.co.uk/wires/ap/article-4446214/Sondheim-honoree-Trump-target-annual-PEN-gala.html"}
