{"authors":["Saidah Blount"],"date_download":"2018-10-22 20:15:28","date_modify":"2018-10-22 20:15:28","date_publish":"2015-11-11 00:00:00","description":"The North London MC ends her break-out year with a boastful bonus track produced by Hit-Boy","filename":"data/vaneerConsumption/SongsWeLoveLittleSimzDontForget.json","image_url":"https://media.npr.org/assets/img/2015/11/09/dsc_1080-1-_wide-8aefaec13ee8887e2e81508023e86428d9aeab4d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_11_455323568_songs-we-love-little-simz-dont-forget_1540239328.html","title":"Songs We Love: Little Simz, 'Don't Forget'","title_page":"Songs We Love: Little Simz, 'Don't Forget'  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Songs We Love: Little Simz, 'Don't Forget'\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\nCourtesy of the artist\nBraggadocio is one of the undeniable cornerstones of hip-hop. Since the genre's birth, MCs have taken pride in the different ways they wordsmith their greatness. From the early battle rappers of the 1970s and '80s, to the poetic and politicized lyricism of modern legends like Rakim, Nas and Kanye, it's absolutely expected that any artist worth their salt would be ready, willing and able to expound upon their own dexterity — while also beating down the opposition.\nThat spirit of boasting and toasting is alive and well on \"Don't Forget,\" the newest track from the North London-based rap phenomenon Little Simz (born Simbi Ajikawo). Lacing her staccato flow and celebrated rhymes over Hit-Boy's bombastic beat, Simz posits that \"this here is what is missing from the scene,\" and goes on to argue her point with some pretty amazing allegorical proof — declaring herself to not only be the deadliest viper in the game, but also \"spacey, unique and ethereal.\" It's no wonder that Simz's lyrical prowess has earned her serious kudos in the industry the last few years, including a number of UK MOBO (Music of Black Origin) Awards nominations and a shout-out from King Kendrick himself. (In a note about \"Don't Forget,\" Simz identifies it as a bonus to her new album, A Curious Tale Of Trials + Persons, \"something me and my boy Hit-Boy cooked up in LA this summer,\" an exclamation point on a great year and a gift to the fans.)\nLittle Simz has been forthcoming in referencing the female MCs that have influenced her style. Listening to her jazzy, sophisticated flow, it's hard not to miss similar genre-shattering elements that Lauryn and Missy brought to the rap game; just as Simz is helping guide UK hip-hop into a life after grime. And as major producers and players in the game line up to work with her, it's easy to believe Simz when she says that \"this is only the beginning.\"\nA Curious Tale Of Trials + Persons is out now on Age 101 Music; \"Don't Forget\" is out now on Soundcloud.","url":"https://www.npr.org/2015/11/11/455323568/songs-we-love-little-simz-dont-forget"}
