{"authors":["Felix Contreras"],"date_download":"2018-10-22 20:33:07","date_modify":"2018-10-22 20:33:07","date_publish":"2015-10-12 00:00:00","description":"We celebrate Dia de La Raza with a posse remake of Kid Frost's Latin hip-hop classic that also features Mellow Man Ace, Niña Dioz, Das Racist's Kool A.D. and others.","filename":"data/vaneerConsumption/SongsWeLoveBrownoutLaRaza.json","image_url":"https://media.npr.org/assets/img/2015/10/09/brownout-pic_wide-1564056c3d86031b2285f74a54dab166e1e2d0ad.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_10_12_447229966_songs-we-love-brownout-la-raza_1540240387.html","title":"Songs We Love: Brownout, 'La Raza'","title_page":"Songs We Love: Brownout, 'La Raza' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Songs We Love: Brownout, 'La Raza'\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\nKid Frost is a bit of a pioneer in Latin rap, and his 1990 track \"La Raza\" is also a ground breaking track, sampling the El Chicano jazz/rock classic \"Viva Tirado.\" All of that is a given.\nWhat blows my mind is that it has been 25 years since that song was released!\nWatch Kid Frost's Original \"La Raza\" YouTube\nLots of things have changed since then in Latin hip-hop. The genre has exploded all over Latin America. Folk traditions have been respectfully sampled and expanded upon.\nAnd now, the superb Austin-based crew Brownout has revisited the track just in time for Columbus Day ... er, I mean, Dia de La Raza. Produced by Grupo Fantasma co-founder Adrian Quesada, the posse cut features luminaries such as the legendary Cuban-American rapper Mellow Man Ace; DJ Dus (aka El Dusty) and Mexstep of the group Third Root, representing the south Texas Chicano experience; Niña Dioz, an explosive female MC from Monterrey, Mexico; and Afro-Cuban MC Kool AD (from Das Racist) and his DJ, the Chicago-born Amaze 88.\nIt is short blast of brilliance, like visiting an old friend whom you haven't seen for a while, but the friend remains the coolest person in the room.","url":"https://www.npr.org/2015/10/12/447229966/songs-we-love-brownout-la-raza"}
