{"authors":[],"date_download":"2018-10-30 20:20:15","date_modify":"2018-10-30 20:20:15","date_publish":"2015-09-16 10:31:48","description":"Cobb County police were investigating a shooting early Wednesday at an apartment complex near Austell that left the son of a retired Atlanta police officer dead.","filename":"data/vaneerConsumption/SonofretiredAtlantapoliceofficershotandkilledinCobb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/16/Images/photos.medleyphoto.8160911.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_son-retired_6b3347b1a755eac9bd354913adc58a36__1540930815.html","title":"Son of retired Atlanta police officer shot and killed in Cobb","title_page":"Son of retired Atlanta police officer shot and killed in Cobb","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb County police were investigating a shooting early Wednesday at an apartment complex near Austell that left the son of a retired Atlanta police officer dead.\nOfficers responding to numerous calls about shots being fired about 12:30 a.m. found 23-year-old Anthony Terrell Tavarez of Mableton in the breezeway of a building at the Windwood Apartments on Shenandoah Trail off Hillcrest Drive.\nTavarez is the son of retired Atlanta police Det. Frank Tavarez, family members told The Atlanta Journal-Constitution.\n“He was a good-hearted person, wouldn’t hurt nobody,” the victim’s uncle, Tyrone Tucker, said. “I don’t know why somebody would just kill him like that. It’s a terrible tragedy.”\nPolice have not said what led to Tavarez’s shooting.\nHe had been shot at least once, Cobb police spokeswoman Alicia Chilton said.\nTavarez’s grandmother, Bobbie Hall, said her grandson “was just at my house yesterday.\n“He brought his dogs over to stay with me. He gave me a big hug.”\nAnyone with information on the shooting is asked to call Crime Stoppers Greater Atlanta at 404-577-8477 or text CSA plus the tip to 274637. Tipsters, who are eligible for a reward of up to $2,000, can remain anonymous.\n— Please return to AJC.com for updates.","url":"https://www.ajc.com/news/crime--law/son-retired-atlanta-police-officer-shot-and-killed-cobb/fvfiUsN8qv6Fk5scL3RMFI/"}
