{"authors":[],"date_download":"2018-10-22 22:49:23","date_modify":"2018-10-22 22:49:23","date_publish":"2014-05-12 20:03:48","description":"About 40 executives will give up amounts equivalent to 30-35 percent of their annual pay as the company's electronics business struggles.","filename":"data/vaneerConsumption/SonysTopExecutivestoReturnBonusesReport.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_sonys-top-executives-return-bonuses-report-n103511_1540248563.html","title":"Sony's Top Executives to Return Bonuses: Report","title_page":"Sony's Top Executives to Return Bonuses: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSony Corp.'s top executives will return their annual bonuses as the company's electronics business struggles with losses, the Nikkei reported.\nAbout 40 executives involved with the electronics and headquarters operations will give up amounts equivalent to 30 percent to 35 percent of their annual pay as proposed by Chief Executive Kazuo Hirai, the daily said.\nThe bonuses to be handed back could reach as much as 1 billion yen ($9.8 million), the Nikkei reported.\nSony on Wednesday will report results for the year ended March 31.\nThe company will also put on hold commercial development of OLED (organic-light emitting diode) television and focus on the 4K ultra high-definition LCD TVs to bring its TV business back to profitability, the daily said in a separate report.\nSony said in February it would spin off its TV operations into a separate business and sell its Vaio personal computer division as part of a broad restructuring.\n-Reuters","url":"https://www.nbcnews.com/business/business-news/sonys-top-executives-return-bonuses-report-n103511"}
