{"authors":["Associated Press"],"date_download":"2018-10-22 21:55:57","date_modify":"2018-10-22 21:55:57","date_publish":"2016-01-29 08:21:57","description":"TOKYO (AP) — Sony Corp. reported a 33.5 percent jump in quarterly profit as sales improved in its PlayStation 4 video game business. Tokyo-based Sony kept it...","filename":"data/vaneerConsumption/SonyreportsajumpinfiscalthirdquarterprofitonPS4.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422279_Sony-reports-jump-fiscal-quarter-profit-PS4_1540245357.html","title":"Sony reports a jump in fiscal third quarter profit on PS4","title_page":"Sony reports a jump in fiscal third quarter profit on PS4 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sony reports a jump in fiscal third quarter profit on PS4\nTOKYO (AP) — Sony Corp. reported a 33.5 percent jump in quarterly profit as sales improved in its PlayStation 4 video game business.\nTokyo-based Sony kept its full-year profit projection unchanged Friday at 140 billion yen ($1.2 billion), which would be a reversal from red ink in the previous fiscal year.\nSony recorded a 120 billion yen ($1 billion) October-December profit. Sales for the fiscal third quarter edged up 0.5 percent to 2.58 trillion yen ($21.4 billion).\nSony, which also makes Bravia TVs and Xperia mobile phones, has been undergoing a marathon restructuring to focus on more profitable operations.\nSony's sales were still struggling in image sensors and mobile communications. But it got a lift from better sales of PS4 game software as well as the machines.\nThe Japanese electronics and entertainment conglomerate, which also has a music division, benefited from the strong theatrical performances of the films \"Spectre\" and \"Hotel Transylvania 2.\"\nSales in its music business improved with the release of Adele's new album \"25.\" One Direction's \"Made in the A.M.\" was also a strong seller.\nThe results appeared to show that Sony was gradually getting its restructuring under control, after selling some assets, such as its Vaio personal computer business and its stake in Japanese game maker Square Enix.\nBut its once strong brand image has lost much of its luster in the face of competition from Apple Inc. in digital music players and smartphones as well as Samsung Electronics Co. of South Korea in TVs.\n___\nFollow Yuri Kageyama: twitter.com/yurikageyama","url":"https://www.dailymail.co.uk/wires/ap/article-3422279/Sony-reports-jump-fiscal-quarter-profit-PS4.html"}
