{"authors":[],"date_download":"2018-10-22 21:44:21","date_modify":"2018-10-22 21:44:21","date_publish":"2016-01-29 07:45:25","description":"Sony on Friday posted a nine-month net profit of almost $2.0 billion, as strong sales of its PlayStation video games console and image sensors found in mobil...","filename":"data/vaneerConsumption/Sonyswingsto195bnnetprofitasPlayStationsalessoar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7fp-3bmscybNe842cce83474b5225ffa-207_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422313_Sony-swings-1-95-bn-net-profit-PlayStation-sales-soar_1540244661.html","title":"Sony swings to $1.95 bn net profit as PlayStation sales soar","title_page":"Sony swings to $1.95 bn net profit as PlayStation sales soar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sony swings to $1.95 bn net profit as PlayStation sales soar\nSony on Friday posted a nine-month net profit of almost $2.0 billion, as strong sales of its PlayStation video games console and image sensors found in mobile gadgets help it move past years of losses.\nThe once-iconic Japanese giant has been working to claw back to profitability under a painful restructuring that has included layoffs and asset sales, including its Manhattan headquarters and laptop division.\nThe company, along with rivals Panasonic and Sharp, has struggled in the consumer electronics business that built its global brand, including losing billions of dollars in televisions over the past decade.\nSony says net profit came in at 236.1 billion yen ($1.95 billion) for the April-December period, reversing a 19.2 billion yen loss a year earlier ©Yoshikazu Tsuno (AFP/File)\nThe sector has faced fierce competition from lower-cost rivals from South Korea and Taiwan.\nIn a sign things are on the upswing, Sony said Friday its net profit came in at 236.1 billion yen ($1.95 billion) for the April-December period, reversing a 19.2 billion yen loss a year earlier.\nOperating profit more than doubled to 387.1 billion yen, while sales edged up 0.1 percent to 6.28 trillion yen.\n\"This was primarily due to the significant increase in sales in the game and network services segment and the impact of foreign exchange rates, substantially offset by the significant decrease in sales in the mobile communications segment,\" it said.\nIn November, Sony announced that sales of its PlayStation 4 video game consoles topped 30 million units worldwide.\nThe unit has seen the fastest and strongest adoption since the first generation of the video game console was introduced in late 1994.\nOn Tuesday, the company said it was moving its PlayStation business to Silicon Valley and consolidating its game console offerings under one roof.\nSony also bought Toshiba's image sensor business which could boost its position as a global leader in the components which are found in smartphones and other mobile devices.\nOn Friday, Sony said it was still on track for a 140 billion yen full-year net profit.\n\"Sony is now on the final stage of its restructuring,\" said Rakuten Securities analyst Yasuo Imanaka.\n\"The TV business is being revived as the company focuses on high-end products. Sales of image sensors and PS4 consoles also remain strong, offsetting losses in mobile phone businesses.\"\nBut Yasuo Nakane, senior analyst at Mizuho Securities, warned that the company still has more work to do.\n\"Sony has been changing dramatically over the past couple of years,\" Nakane added.\n\"However, its restructuring isn't over. There is room for more change in mobile communications, the movie sector, at headquarters, and in its battery businesses.\"\nSony's businesses include a music label and Hollywood studio, while it also operates a profitable but lesser-known financial unit.\nRivals Panasonic and Sharp report their latest earnings next week.\nPanasonic's results have been improving as it focus on its lesser-known endeavours, including energy and an auto division that makes various products found in vehicles, from electrical components to car navigation systems.\nSharp, however, continues to struggle and has repeatedly appeared on the brink of bankruptcy in recent years.\nIn November, Sony announced that sales of its PlayStation 4 video game consoles topped 30 million units worldwide ©Patrick Kovarik (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422313/Sony-swings-1-95-bn-net-profit-PlayStation-sales-soar.html"}
