{"authors":["Abc News"],"date_download":"2018-10-30 00:57:01","date_modify":"2018-10-30 00:57:01","date_publish":"2018-10-29 14:36:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/SoonerscoachLincolnRileynotinterestedinNFLrightnow.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_sooners-coach-lincoln-riley-interested-nfl-now_story_id=58833059_1540861021.html","title":"Sooners coach Lincoln Riley not interested in NFL 'right now'","title_page":"Sooners coach Lincoln Riley not interested in NFL 'right now' - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Only an hour after reports surfaced that the Cleveland Browns had fired coach Hue Jackson and offensive coordinator Todd Haley, Oklahoma coach Lincoln Riley was asked whether he had any interest in coaching in the NFL.\n\"I knew that was coming,\" Riley said during his weekly news conference. \"No, not right now. You sit here and answer these questions and I always want to be truthful. The truth is for me is I love Oklahoma. I love coaching here. I love college . I certainly don't have that itch right now. Don't know that I ever will.\n\"But I'm never going to be a guy that stands up here and says no way, no how with any of these things ever happening. I don't know that. But I know right now I could care less about the NFL.\"\nRiley, 35, who is in his second year as head coach of the Sooners, has a strong connection to the Browns, specifically starting quarterback Baker Mayfield.\nThis year's No. 1 overall NFL draft pick won the Heisman Trophy at Oklahoma last year playing for Riley.\nRiley arrived at Oklahoma as offensive coordinator in 2015, the same year Mayfield became eligible with the Sooners after transferring from Texas Tech. In their three seasons together, they combined to go 34-6 with three Big 12 titles and two College Football Playoff appearances.\nLosing Mayfield to the NFL hasn't slowed down the Oklahoma offense this season under Riley, who still calls plays.\nThe Sooners are averaging 8.9 yards per play, which leads the country. They're also averaging 4.0 points per drive, which is the highest FBS total dating back to at least 2004. As a result, quarterback Kyler Murray has become a Heisman Trophy contender himself.\nThe Browns, meanwhile, are 2-5-1 this season, after going a combined 1-31 the previous two years.\nIn his first NFL action, Mayfield led Cleveland to a come-from-behind victory over the Jets on Sept. 20. The Browns have since played in three overtime games, losing two of them.\nOklahoma is 7-1 and ranked seventh in the AP poll. The Sooners travel to Texas Tech this weekend.\n\"We're trying to win this game,\" Riley said. \"And trying to make a run we all think we have in us right now.\"","url":"https://abcnews.go.com/Sports/sooners-coach-lincoln-riley-interested-nfl-now/story?id=58833059"}
