{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-22 21:10:28","date_modify":"2018-10-22 21:10:28","date_publish":"2016-01-28 07:04:43","description":"Stepping out at the Australian Open in Melbourne, the Australia's Got Talent judge wore a Lillian Xu dress featuring an enormous black bow across the chest.","filename":"data/vaneerConsumption/SophieMonkcutsanoutlandishfigureattheAustralianOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6AA1700000578-0-image-a-6_1453955949013.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420386_Sophie-Monk-cuts-outlandish-figure-steps-ladies-luncheon-Australian-Open_1540242628.html","title":"Sophie Monk cuts an outlandish figure at the Australian Open","title_page":"Sophie Monk cuts an outlandish figure at the Australian Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was recently crowned Sexy Australian Of The Year 2016, and on Thursday, Sophie Monk quite literally became a gift of the gods courtesy of her outlandish designer dress.\nStepping out at the Australian Open in Melbourne, the Australia's Got Talent judge wore a Lillian Xu dress featuring an enormous black bow across the chest.\nThe 36-year-old was attending the Ladies Power Lunch function at Rod Laver Arena alongside other guests such as Natalie Bassingthwaighte and Real Housewife Andrea Moss.\nScroll down for video\n'I'm a present today': Sophie Monk stepped out at ladies' luncheon for the Australian Open on Thursday in grey strapless frock with big black bow\nSharing a snap to Instagram early in the day, Sophie wrote in her slightly self-deprecating sense of humor: 'I'm a present today ha.'\nThe strapless grey marle frock landed just above her knees, and appeared to be constructed using fused neoprene - a thicker fabric for the cool Melbourne weather.\nShe paired the look with some studded platform pumps by Christian Louboutin, and allowing for the dress to speak for itself, she opted for very minimal jewellery.\nAll wrapped up! The strapless grey marle frock, designed by Sydney-based label Lillian Xu\nMaking a statement: She paired the look with some studded platform pumps by Christian Louboutin, and allowing for the dress to speak for itself, she opted for very minimal jewellery\nCasual: Natalie Bassingthwaighte however was less formally dressed, wearing a simple, khaki singlet dress and battered white sneakers\nAdding a touch of sexiness to her look, the radio host's lips were painted a rich glossy red, with her luscious blonde tresses cascading over her shoulders in loose waves.\nPosing with her left hand on her hip, the blonde beauty flaunted her toned arms and trim pins as she popped her hip slightly.\nNatalie however was less formally dressed, wearing a simple, khaki singlet dress and battered white sneakers.\nLovely: Real Housewife of Melbourne Andrea looked glamorous in an white brocade minidress and went for white strappy wedges\nAll black: Fellow Neighbours stars were also in attendance, including Ashleigh Brewer, who opted for an all-black ensemble, and Krista Vendy, also in black\nAppearing fresh-faced, the former Neighbours star cinched her waist with a leopard-print shirt and kept jewellery to a minimum also.\nFellow Neighbours stars were also in attendance, including Ashleigh Brewer, who opted for an all-black ensemble, and Krista Vendy, also in black.\nReal Housewife of Melbourne Andrea looked glamorous in an white brocade minidress and went for white strappy wedges.\nMeanwhile Shane Warne's ex wife Simone Callahan dressed in a slightly bohemian white linen frock with tan sandals.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420386/Sophie-Monk-cuts-outlandish-figure-steps-ladies-luncheon-Australian-Open.html"}
