{"authors":["Andrew Court","Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-23 00:21:03","date_modify":"2018-10-23 00:21:03","date_publish":"2017-04-26 09:51:19","description":"Dropping hints! In an interview with Tom Gleeson, screened on the ABC on April 5, Sophie Monk stated that she would love be the next Bachelorette.","filename":"data/vaneerConsumption/SophieMonkdroppedhintshewasnewBachelorette.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D88D600000578-0-image-a-9_1493196073636.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446752_Sophie-Monk-dropped-hint-new-Bachelorette_1540254063.html","title":"Sophie Monk dropped hint she was new Bachelorette","title_page":"Sophie Monk dropped hint she was new Bachelorette | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There was collective shock on Sunday when it was confirmed that she was Channel Ten's unlikely new pick for The Bachelorette.\nBut Sophie Monk, 37, was already dropping hints about her new role more than two weeks before it was announced.\nIn an interview with comedian Tom Gleeson earlier this month, Sophie revealed that she would love to star on the romantic reality show.\nThat's sneaky! Sophie Monk, 37, was already dropping hints about her new role more than two weeks before it was announced\nIn the sit-down chat that aired on the ABC on April 5, funnyman Tom mentioned Sophie's rise to fame on the 2000 reality show, Popstars.\n'You were discovered through one of the very first reality shows, Popstars,' Tom stated, before asking, 'Do you wish you waited until a reality show came up that people actually remember?'\nSophie replied that she would have wanted to appear on a 'cooler' reality show, before specifically mentioning the Bachelorette.\nRevealed: In the sit-down chat that aired on the ABC on April 5, funnyman Tom mentioned Sophie's rise to fame on the 2000 reality show, Popstars\n'I'm very single,' the star cheekily stated.\nWhen Tom asked if there was a 'Celebrity Bachelorette' franchise, the former Bardot singer replied that there wasn't, but that she could 'be the first'.\nSophie's new role as the Bachelorette is the latest installment in her very colourful love-life, that has included two engagements, flings, celebrity bangs and threesome offers.\nSerial dater! Bachelorette Sophie's relationship past revealed: Two engagements, countless flings, threesome requests and cheeky celebrity 'bangs'\nAs the first celebrity to take part in the reality TV franchise, the 37-year-old has definitely had her fair share of the dating scene.\nSophie has been linked to actors, producers, millionaires, singers and sportsmen over the past two decades.\nHer mother Sandi convinced her to join the show after she complained that she only met people in the industry with 'big egos'.\nSpeaking to KIIS FM's Kyle And Jackie 'O', she also insisted she's only ever been with ONE partner at a time despite two offers in the past to join threesomes.\n'I felt very flattered, but no thank you. You know me I do missionary, I'm not getting anyone else involved in that,' she said.\nActor Jason Statham: 2005-2006 ['Banged']\n'Banged': The former Bardot singer confirmed to Kyle And Jackie 'O' on Monday that she had 'banged' English actor Jason Statham\nEnglish actor and former model Jason Statham was rumoured to have met Sophie after ending his seven-year relationship with English model and actress Kelly Brook in 2004.\nJason and Sophie were said to have casually dated for the year that followed. The pair both had roles in the 2005 film London.\nThis week, Sophie admitted to having sex with Jason during the 'Banged Or Haven't Banged' game on KIIS FM's Kyle And Jackie 'O'.\nSinger Benji Madden: 2006-2008 [Engaged]\nEngaged! Good Charlotte's Benji Madden proposed to Sophie in Australia on Christmas Eve in 2007 , but their relationship frizzled out a year later\nAfter dating for one year, Good Charlotte's Benji Madden proposed to Sophie in Australia on Christmas Eve in 2007.\nPeople Magazine reported Benji gave her a Neil Lane platinum diamond ring at the time.\nThe relationship soured in 2008, with the singer going on to marry Charlie's Angels star Cameron Diaz in 2015.\nAt the time, Sophie said 'I want him to be happy, so if he's found someone that makes him happy that's awesome,' during an interview with Sydney Confidential.\nAmerican Entrepreneur and Film Producer Joe Francis: 2008 [Rumoured Fling]\nNever happened? Sophie denies rumours of being linked to 'Girls Gone Wild' founder Joe Francis in 2008\nSophie was linked to the 'Girls Gone Wild' founder in 2008 after being spotted together on numerous occasions.\nIn the past Sophie has emphatically denied these rumours.\nRap Mogul Russell Simmons: 2010 [Rumoured Fling]\nRumoured fling: The American rap mogul Russell Simmons sparked rumours of a relationship with the radio star after they were spotted cosying up together at Maxim Hot 100 Party in Los Angeles in 2010\nThey sparked rumours of a relationship when they were spotted cosying up together at Maxim Hot 100 Party in Los Angeles in 2010.\nRussell Simmons, the American rap mogul, Tweeted at the time: 'Leaving Maxim 100 party took my client Sophie monk lots of fun .. Producing her show will be real pleasure.'\nSophie added fuel to the fire when she filmed a video of her preparing to attend the event for Radar Online, in which Simmons arrived to collect her and grabbed her bum as he helped her into the waiting car, as reported by PopSugar Australia.\nPlastic Surgeon John Diaz: 2010 [Dated]\nCheating partner! In 2010, Sophie confirmed she had split from plastic surgeon John Diaz after finding him in bed with another woman\nIn 2010, Sophie confirmed she had split from plastic surgeon John Diaz to Kyle and Jackie O on their 2DAYFM show.\nSophie Monk abruptly called off her relationship after finding her ex boyfriend in bed with another woman.\nAussie actress was being interviewed in LA by Kyle Sandilands when she dropped the bombshell: 'I rock up in the morning with a coffee and presents and he had a present there - a chick.'\nThe Date Movie star said she started shaking after catching him out and drove off, before turning back to confront John and the other woman.\nIn 2011 she admitted to having surgery 'everywhere', but it was never revealed whether her plastic surgeon boyfriend performed the procedures.\nActor Kevin Connolly: 2010 ['Banged']\n'Banged': After meeting in 2007 on the set of Entourage, PopSugar reported the Bardot singer had been spotted on dates with Kevin in 2010\nAfter meeting in 2007 on the set of Entourage, PopSugar reported the Bardot singer had been spotted on dates with Kevin in 2010.\nSophie revealed to Kyle And Jackie 'O' on Monday that she had 'banged' the actor in the past.\nAmerican Billionaire Jimmy Esebag: 2010-2011 [Engaged]\n'A male version of me': Sophie announced her surprise engagement to Jimmy, 20 years her senior, in 2011, but the pair broke off their engagement a few months later\nSophie announced her surprise engagement to Jimmy, 20 years her senior, while filling in for Jackie O on the Kyle and Jackie O show in 2011.\nAt the time she was sure of the relationship, describing the businessman as: 'a male version of myself.'\nMonths later the pair broke off their engagement.\nRapper Ray J: 2012 [Rumoured Fling]\n'I have some skeletons in my closet, but Ray J is not one of them': Sophie has fiercely denied rumours of a fling with rapper and Kim Kardashian 's ex Ray J (most famous for starring in Kim's notorious sex tape)\nAs a serial celebrity dater, Sophie also fell prey to rumours of a fling with rapper and Kim Kardashian 's ex Ray J (most famous for starring in Kim's notorious sex tape).\nSophie became linked to the American star after frolicking topless in an ad campaign, with US gossip sites claiming she left his house at 8.30am. fiercely\nShe told GlobalGrind at the time: 'I have some skeletons in my closet, but Ray J is not one of them.'\nActor Sam Worthington: 2013 [Dated]\nDated! Sophie was known to have dated Avatar star Sam Worthington in 2013, with Sam going on to date Lara Bingle the same year, who he is now married to and shares two children with\nSophie was known to have dated Avatar star Sam Worthington in 2013 and has openly told Kyle And Jackie 'O' that they indeed 'banged'.\nAfter news broke that Sam and Lara were dating in 2013, Sophie described bring bombarded by pictured of the loved-up couple: 'It really hurts.'\nIn 2015, Sophie also appeared to parody Lara's controversial Tourism Australia campaign by mocking her 'where the bloody hell are ya' line in a gaming ad for The Elder Scrolls Online.\nLara and Sam married in December 2014 and now share two young sons together.\n'It really hurts': After news broke that Sam and Lara were dating in 2013 (the same year she broke up with Sam), Sophie described bring bombarded by pictured of the loved-up couple as hurtful\nEx Rugby League Star Eric Grothe jnr: 2016 [Dated]\n'We've been dating on and off for, like, a couple of years': Ex-NRL player Eric Grothe Jr. is the most recent man to have dated Sophie before her decision to become the Bachelorette\nThe most recent man to have dated Sophie is ex-NRL player Eric Grothe Jr.\nSophie revealed she had been secretly dating the sportsman 'on and off' for a few years, with it being 'off again' when announcing the news on Kyle And Jackie 'O' in November last year.\n'We've been dating on and off for, like, a couple of years, and no-one really knew. You know how it is when you [go] public, and it creates drama. We wanted to keep it special. It's been on and off forever, but now it's off again,' she said.\nFormer AFL player Wayne Carey: 2017 [Rumoured Fling]\n'Hell no!': Earlier this month Sophie hit back at romance rumours that had linked her controversial former AFL player Wayne Carey\nEarlier this month Sophie hit back at romance rumours that had linked her controversial former AFL player Wayne Carey.\n'Hell no,' she emphatically said when Kyle Sandilands questioned the relationship.\nSophie, who also made a social media post denying the alleged relationship, went on to explain: '[What] happened is I went to a restaurant, he was at the restaurant, I met him, spoke to him for a little bit and that was all.'\n'I'd divide it by three': Sophie insists she won't reveal her 'real' number of partners she's slept with to the Bachelors vying for her affection on the series\nAmong her many other rumoured flings, she confirmed to Kyle And Jackie 'O' that she'd never been intimate with Jude Law, President Donald Trump, Charlie Sheen, Kanye West, Ryan Seacrest, her former radio co-host Jules Lund and Bachelor/Bachelorette host Osher Günsberg.\nMeanwhile, when Kyle And Jackie 'O' asked if Sophie would willingly reveal the 'number' of partners she's slept with, the star appears happy with keeping it a secret from her suitors.\n'Yeah,' Monk replied, while adding: 'But I'd divide it by three like everyone else does.'\nThe launch date for Channel 10's The Bachelorette is yet to be announced.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446752/Sophie-Monk-dropped-hint-new-Bachelorette.html"}
