{"authors":["Nkayla Afshariyan For Daily Mail Australia"],"date_download":"2018-10-22 23:58:47","date_modify":"2018-10-22 23:58:47","date_publish":"2017-04-26 09:03:12","description":"Gold Coast trainer Sophie Guidolin has shared her favourite healthy snacks. The 27-year-old is a gym owner with her husband and social media star. Favourite include rice cakes and tuna.","filename":"data/vaneerConsumption/SophieGuidolinrevealshertopweightlosssnacks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D3B3000000578-0-image-a-4_1493193762055.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446462_Sophie-Guidolin-reveals-weight-loss-snacks_1540252727.html","title":"Sophie Guidolin reveals her top weight loss snacks","title_page":"Sophie Guidolin reveals her top weight loss snacks  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's hard not to get peckish in the late afternoon and even harder when you're trying to be healthy.\nSo Gold Coast gym owner and social media star Sophie Guidolin has shared a few of her favourite healthy snacks to help get you through the day.\nThe mum-of-four said it's important to keep a manageable lifestyle and snacking on healthy food is great on top of a balanced diet.\nThe 27-year-old recommended a variety of snacks on her blog, all of which are healthy and easy to customise for those with picky taste buds.\nGold Coast gym owner and social media star Sophie Guidolin has shared a few of her favourite healthy snacks\nThe 27-year-old recommended a variety of snacks on her blog, all of which are healthy and easy to customise\nSpring-water tuna is one of Sophie's go-tos as a great source of protein and omega-3.\nThe fitness guru, who embarked on her own body transformation after gaining 28 kilos while pregnant, said protein isn't only great for lean muscle gain, but also to boost any issues with your fitness regime if you're protein deficient.\nRice cakes are another fan favourite, as they are easily paired with healthy fillings.\nSophie's favourite toppings include: salt, pepper and avocado; Peanut butter, banana and cinnamon; cottage cheese, cucumber and turkey and blueberries, greek yoghurt and honey.\nSpring-water tuna is one of Sophie's go-to's as a great source of protein and omega-3 (stock image)\nRice cakes are another fan favourite, as they are easily paired with healthy fillings like salmon and tomato (stock image)\nIf you like a sweet treat, the good news is that dark chocolate makes the trainer's healthy snacks list too.\nIt's long been heralded as a health food and studies have shown that people who regularly consume 20g or two squares of 70 per cent dark chocolate show a marked improvement in blood flow.\nBut no improvement is observed in those who eat 'processed' chocolate, which contains very little cocoa paste.\nStudies have shown that people who regularly consume 20g or two squares of 70 per cent dark chocolate show a marked improvement in blood flow (stock image)\nAnother easy snack is sliced vegetables and a nut butter, such as peanut butter (stock image)\nAnother snack that makes Sophie's list are fibrous vegetables like snow peas, green beans, capsicum, leafy greens, cabbage and broccoli.\n'An an important key to your nutrition intake when losing weight or balancing a healthy diet, fibre regulates the speed of digestion and contributes to that ‘feeling full’ sensation,' the trainer wrote on her blog.\n'It also stops cravings throughout the day and provides you with energy and all the important daily nutrients your body needs.\n'Too little fibre can make it tough for bowel movements (especially if your diet is high in protein). It can also be hard to control your blood sugar and appetite.'\nOne option Sophie suggests is slicing some carrot or celery and dunking it into some peanut butter.","url":"https://www.dailymail.co.uk/femail/article-4446462/Sophie-Guidolin-reveals-weight-loss-snacks.html"}
