{"authors":["Lee Stranahan"],"date_download":"2018-10-30 21:11:35","date_modify":"2018-10-30 21:11:35","date_publish":"2016-06-24 12:14:42","description":"Soros took on a very active and public interest in the Leave vote in the days leading up to his victory by penning a sky–is–falling piece for The Guardian that claims to be concerned about the financial well-being of the average British voter but left out the devastating effect Soros’s own profit-taking had on the people in the aftermath of 1992’s infamous Black Wednesday. | London / Europe","filename":"data/vaneerConsumption/SorosFAILTheManWhoBroketheBankofEnglandCantMakeThemStay.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-542740892.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_24__1540933895.html","title":"Soros FAIL: The Man Who Broke the Bank of England Can't Make Them Stay","title_page":"Soros FAIL: The Man Who Broke the Bank of England Can't Make Them Stay | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"George Soros—the multi-billionaire “man who broke the Bank of England”—couldn’t convince the British people to Remain.\nSoros took on a very active and public interest in the Leave vote in the days leading up to his victory by penning a sky–is–falling piece for The Guardian that claims to be concerned about the financial well-being of the average British voter but left out the devastating effect Soros’s own profit-taking had on the people in the aftermath of 1992’s infamous Black Wednesday.\nSoros hints at his financial gain in his Guardian piece, without giving his readers much detail, writing that should England vote to leave:\nI would expect this devaluation to be bigger and more disruptive than the 15% devaluation that occurred in September 1992, when I was fortunate enough to make a substantial profit for my hedge fund investors, at the expense of the Bank of England and the British government.\nCNN admits Soros profited from Black Wednesday:\nSeptember 16, 1992 – Soros bets $10 billion against the value of the British pound. After the currency collapse, known as “Black Wednesday,” Soros makes up to $1 billion and becomes known as the man who “broke the Bank of England” by the London press.\nThe cost to the UK Treasury was £3.4 billion and the effect on the public was equally devastating. A real estate crash followed as did job losses.\nWhile George Soros profited from Black Wednesday, so did both the Tories and Labour, something Soros actually takes credit for it in his Guardian piece:\nIn 1992 the devaluation actually proved very helpful to the British economy, and subsequently I was even praised for my role in helping to bring it about.\nPraise? Not from everyone and certainly not from the people whose lives were broken when Soros broke the Bank of England. Even left-leaning, Nobel prize-winning American economist Paul Krugman had harsh words for Soros, saying of him and his ilk in a 1999 book:\nNobody who has read a business magazine in the last few years can be unaware that these days there really are investors who not only move money in anticipation of a currency crisis, but actually do their best to trigger that crisis for fun and profit.\nGeorge Soros wanted voters to think that his meddling in the Leave vote was simply due to his sincere concern for working people, and not on whatever calculations he is making behind the scenes trying to cash in on currency trading.\nUnfortunately for Soros, British voters ignore the establishment and made up their own minds.\nThe establishment, the media, and George Soros got a short sharp shock in England on Thursday. In November, we will all find out if they get one in America.\nFollow Breitbart News investigative reporter and Citizen Journalism School founder Lee Stranahan on Twitter at @Stranahan.","url":"https://www.breitbart.com/europe/2016/06/24/soros-strikes-man-broke-bank-england-pushes-stay/"}
