{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:41:08","date_modify":"2018-10-30 19:41:08","date_publish":"2015-11-09 17:16:02","description":"Justice Sotomayor wrote a dissent chastising the U.S. Supreme Court for allowing a “shoot first, think later approach to policing.”","filename":"data/vaneerConsumption/SotomayorChastisesSCOTUSforShootFirstThinkLaterRulinginTexasPoliceCase.json","image_url":"https://media.breitbart.com/media/2015/11/KVII-Screenshot-from-Israel-Leija-Police-Chase.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_11_09__1540928468.html","title":"Sotomayor Chastises SCOTUS for ‘Shoot First, Think Later’ Ruling in Texas Police Case","title_page":"Sotomayor Chastises SCOTUS for ‘Shoot First, Think Later’ Ruling in Texas Police Case","title_rss":"NULL","source_domain":"breitbart.com","text":"The Supreme Court of the United States issued a per curium decision today reversing a 2014 U.S. Court of Appeals for the Fifth Circuit opinion holding that a Texas Department of Public Safety (DPS) trooper was not entitled to be granted qualified immunity. The officer had used deadly force to stop a driver in a high-speed car chase. Justice Sotomayor chastised the court for allowing a “shoot first, think later approach to policing.”\nIn its decision of Mullenix v. Luna (attached below), the nation’s highest court addressed only the issue of whether a DPS trooper was entitled to qualified immunity for his actions while in the scope of his employment.\nThe Supreme Court did not address whether there was a Fourth Amendment violation.\nIn question were the reasonableness of the actions of DPS trooper Chad Mullenix. The issue is whether the officer had acted recklessly, or acted as a reasonable, trained peace officer would have acted in the same or similar circumstances.\nIn 2010, Officer Mullenix was involved in a shooting connected to a high-speed police chase near Amarillo, Texas. Spikes had been put down on the roads to stop the vehicle but the officer fired six rounds in the dark. The car was traveling at speeds of 85 to over 100 miles per hour. The driver, Israel Leija, Jr., was killed after an 18-minute police car chase. Leija had twice called dispatchers and threatened to shoot at officers if they did not call off the pursuit.\nThe Fifth Circuit had agreed with the District Court that the “immediacy of the risk posed by Leija is a disputed fact that a reasonable jury could find either in the plaintiffs’ favor or in the officer’s favor, precluding us from concluding that Mullenix acted objectively reasonably as a matter of law.” The intermediate appellate court found that the officer was not entitled to immunity as a matter of law; thus, precluding summary judgment in his favor on the issue.\nA dissenting judge at the Fifth Circuit had opined that because spike strips are often ineffective, and because officers operating them are vulnerable to gunfire from passing cars, the officer reasonably feared that the officers manning them faced a significant risk of harm.\nThe majority at the Fifth Circuit concluded that the trooper’s actions in using deadly force were objectively unreasonable for several reasons. The lower appellate court found that several factors that had justified deadly force in prior opinions were absent. The Fifth Circuit reasoned that there were no innocent bystanders, Leija’s driving was relatively controlled, the officer had not first given the spikes a chance to work, and his decision was not a split-second judgment.\nThe Fifth Circuit concluded that the trooper was not entitled to qualified immunity because “the law was clearly established such that a reasonable officer would have known that the use of deadly force, absent a sufficiently substantial and immediate threat, violated the Fourth Amendment.”\nIn finding on behalf of the officer, the U.S. Supreme Court opined that it has “never found the use of deadly force in connection with a dangerous car chase to violate the Fourth Amendment, let alone to be a basis for denying qualified immunity.”\nJustice Sotomayor wrote in her dissent that “[b]y sanctioning a “shoot first, think later” approach to policing, the Court renders the protections of the Fourth Amendment hollow.”\nSotomayor opined that Mullenix “had no training in shooting to disable a moving vehicle and had never seen the tactic done before.” She also wrote the trooper “lacked permission to take the shots.”\nThe Obama appointee to the Court wrote, “the crux of the qualified immunity test is whether officers have ‘fair notice’ that they are acting unconstitutionally.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2\nThis article has been updated with additional information.\nMullenix v. Luna","url":"https://www.breitbart.com/border/2015/11/09/sotomayor-chastises-scotus-shoot-first-think-later-ruling-texas-police-case/"}
