{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 21:21:24","date_modify":"2018-10-30 21:21:24","date_publish":"2016-02-05 23:47:53","description":"Utilizing critical Iranian funds, Hamas has pressed on with completing the restoration of its network of tunnels, including those reaching into Israeli territory","filename":"data/vaneerConsumption/SourceIranFinancingSpeedyConstructionofHamasTerrorTunnels.json","image_url":"https://media.breitbart.com/media/2016/02/Tunnel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_02_05__1540934484.html","title":"Source: Iran Financing Speedy Construction of Hamas Terror Tunnels","title_page":"EXCLUSIVE – Source: Iran Financing Speedy Construction of Hamas Terror Tunnels","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Utilizing critical Iranian funds, Hamas has pressed on with completing the restoration of its network of tunnels, including those reaching into Israeli territory, a top Hamas diplomatic source told Breitbart Jerusalem.\n“The military wing has ensured the preparedness of our tunnels some time ahead of schedule,” the Hamas source said.\nSeven Hamas militants were killed last week, and another two on Tuesday, while working to restore tunnels slated to serve as launching pads for attacks on Israel.\nThe Hamas source added that the expedited project was made possible thanks to a grant from the Iranian government.\nDespite tensions between Hamas’ political leadership and Iran, he stressed, Tehran’s financial support for the organization’s military wing has been unhindered, and the relationship between the field commanders and Iran’s Revolutionary Guards remains cordial. This was recently expressed by an exchange of condolences between Hamas and Hezbollah over the killing of their respective operatives in action.\nThe Hamas source also said that Iran’s financial support has no connection to the lifting of international sanctions on the Tehran regime last month.\n“The Islamic Republic resumed financial support for the military wing months ago,” he said.\nBreitbart Jerusalem reported recently that Hamas had rejected Iran’s proposal to upgrade relations in exchange for a clear pro-Iranian stance in its conflict with Saudi Arabia.\nAfter Palestinian President Mahmoud Abbas, the leader of the rival Fatah faction, sided with Saudi Arabia’s decision to cut diplomatic ties with Iran, the Islamic Republic offered to recognize Hamas as the sole representative of the Palestinian people.\nIran wasn’t discouraged by Hamas’ refusal, and has invited top Hamas leader Moussa Abu Marzouk to meet in Lebanon with Iranian and Hezbollah officials, Breitbart Jerusalem reported.\nIn November, Breitbart Jerusalem reported that Hamas was in the process of building a sophisticated network of tunnels beneath​ the Gaza Strip, according to multiple sources with knowledge of the ​issue.\nThe tunnel infrastructure mirrors ​the network built by Hezbollah in Lebanon. The Iran-sponsored militia is known to have ​dug a vast underground tunnel ​complex replete with war rooms, internal communication lines, ventilation systems, and even missile silos.\nAsked for comment, a spokesperson for the Israel Defense Forces told Breitbart Jerusalem:\n“The IDF is aware of the fact that Hamas has been working to rebuild its sophisticated tunnel network within the Gaza Strip.\n“The IDF remains prepared and ready to defend Israel’s borders and its civilians, especially those living in close proximity to the Gaza Strip​,​ from any potential threat should it arise.”","url":"https://www.breitbart.com/middle-east/2016/02/05/exclusive-source-iran-financing-speedy-construction-of-hamas-terror-tunnels/"}
