{"authors":["Associated Press"],"date_download":"2018-10-22 22:52:51","date_modify":"2018-10-22 22:52:51","date_publish":"2017-03-10 01:39:08","description":"SEOUL, South Korea (AP) - In a historic, unanimous ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from...","filename":"data/vaneerConsumption/SouthKoreaspresidentformallyoustedbycourt.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/04/wire-193953-1489119852-620_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299738_100s-gather-ahead-court-decision-impeached-leader_1540248771.html","title":"South Korea's president formally ousted by court","title_page":"South Korea's president formally ousted by court | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - In a historic, unanimous ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil and worsened an already-serious national divide.\nIt capped a stunning fall for Park, the country's first female leader who rode a wave of lingering conservative nostalgia for her late dictator father to victory in 2012, only to see her presidency crumble as millions of furious protesters filled the nation's streets.\nThe ruling by the eight-member panel opens her up to possible criminal proceedings - prosecutors have already named her a criminal suspect - and makes her South Korea's first democratically elected leader to be removed from office since democracy replaced dictatorship in the late 1980s.\nA protester wearing a mask, attends during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Arrest Park Geun-hye.\" (AP Photo/Lee Jin-man)\nIt also deepens South Korea's political and security uncertainty as the country faces existential threats from perennial rival North Korea, reported economic retaliation from a China furious about Seoul's cooperation with the U.S. on an anti-missile system, and questions in Seoul about the new Trump administration's commitment to the countries' decades-long security alliance.\nPark's \"acts of violating the constitution and law are a betrayal of the public trust,\" acting Chief Justice Lee Jung-mi said. \"The benefits of protecting the constitution that can be earned by dismissing the defendant are overwhelmingly big. Hereupon, in a unanimous decision by the court panel, we issue a verdict: We dismiss the defendant, President Park Geun-hye.\"\nPark's lawyer, Seo Seok-gu, who had previously compared Park's impeachment to the crucifixion of Jesus Christ, called the verdict a \"tragic decision\" made under popular pressure and questioned the fairness of what he called a \"kangaroo court.\"\nSouth Korea must now hold an election within two months to choose Park's successor. Liberal Moon Jae-in, who lost to Park in the 2012 election, currently enjoys a comfortable lead in opinion surveys.\nPre-verdict surveys showed that 70 to 80 percent of South Koreans wanted the court to approve Park's impeachment. But there have been worries that Park's ouster would further polarize the country and cause violence between her supporters and opponents.\nSensing history, thousands of people - both pro-Park supporters, many of them dressed in army-style fatigues and wearing red berets, and those who wanted Park gone - gathered around the Constitutional Court building and a huge public square in downtown Seoul.\nA big television screen was set up near the court so people could watch the verdict live. Hundreds of police were on hand for any protests, wearing helmets with visors and black, hard-plastic breastplates and shin guards. The streets near the court were lined with police buses and barricades.\nThe government put South Korea's military and police on heightened alert after the court decision. There were no immediate reports of unusual activities by North Korea's military, which faces nearby Seoul across the world's most heavily armed border.\nSome of Park's supporters reacted with anger after the ruling, shouting and hitting police officers with plastic flag poles and climbing on police buses. Anti-Park protesters celebrated by marching in the streets near the presidential Blue House, carrying flags, signs and an effigy of Park dressed in prison clothes and tied up with rope.\nPark's parliamentary impeachment in December came after weeks of Saturday rallies that drew millions who wanted her resignation. Overwhelmed by the biggest rallies in decades, the voices of Park supporters were largely ignored. But they've recently regrouped and staged fierce pro-Park rallies since.\nPeople on both sides have threatened not to accept a Constitutional Court decision that they disagree with. One of Park's lawyers told the court last month that there will be \"a rebellion and blood will drench the asphalt\" if Park is booted from office. Many participants at anti-Park rallies had said they would stage a \"revolution\" if the court rejected Park's impeachment.\n\"If Park accepts the ruling and soothes those who opposed her impeachment, things will be quiet,\" said Yoon Tae-Ryong, a political scientist at Seoul's Konkuk University. \"But looking at what she's done so far, I think that might be wishful thinking.\"\nOthers disagreed, saying violent protests won't be supported by the general public.\nProsecutors have arrested and indicted a slew of high-profile figures over the scandal, including Park's confidante Choi Soon-sil, top Park administration officials and Samsung heir Lee Jae-yong. But Park has avoided a direct investigation thanks to a law that gives a sitting president immunity from prosecution for most of alleged crimes.\nSince she's now no longer in power, prosecutors can summon, question and possibly arrest her. Her critics want to see Park appear on TV while dressed in prison garb, handcuffed and bound like others involved in the scandal. But some analysts worry that could create a backlash by conservatives ahead of the presidential vote.\nEven after the election, imprisoning Park could still be a burden for a new government, which must pursue national unity to overcome security, economic and other problems, said Chung Jin-young, a professor at Kyung Hee University. Others say it won't be difficult.\nAmong the most serious problems facing South Korea is China's retaliation against the deployment of a U.S. high-tech missile defense system in the South. Ties with North Korea are terrible, with Pyongyang seeking to expand its nuclear and missile arsenal. Japan hasn't sent back its ambassador, which it recalled two months ago over history disputes. South Korea also worries about the Trump administration asking for a greater financial contribution for U.S. troop deployment in the South.\nPark rose to power in 2012 largely thanks to the support of voters who believed her father guided the country out of poverty after the 1950-53 Korean War and that his daughter would show the same charismatic leadership to revive the economy.\nBut her father was also a burden, as many here remember him as a ruthless thug. These critics have linked her alleged unclear and high-handed decision-making and attempts to infringe upon freedom of speech to her father's high-handed style.\n\"The nostalgia for Park Chung-hee's developmental dictatorship, which has existed as a sort of myth since the '60s, has been shattered along with Park Geun-hye's impeachment,\" said Lim Jie-Hyun, a professor at Sogang University. \"When people voted for Park Geun-hye, they didn't do so because of her.\"\nPark Geun-hye has offered a public apology several times and acknowledged she got some help from Choi for editing speeches and on the issue of public relations. But Park has denied any legal wrongdoing.\nThe two women became friends in the 1970s, around the time when Park began serving as first lady after her mother was killed during a failed 1974 assassination attempt on her father. Park Geun-hye said Choi helped her \"when I had difficulties\" in the past. Park and Choi had 573 phone calls between April 18, 2016, and Oct. 26, 2016, according to an investigation report by prosecutors.\nPrime Minister Hwang Kyo-ahn has led the government as acting leader since Park's impeachment, and he will continue to do so until South Korea elects new president by May. Some media reports said Hwang might run for president as a conservative candidate. If that happens, he would have to resign to run and a deputy prime minister would become interim leader.\nIn 2004, then President Roh Moo-hyun was impeached by parliament for alleged election law violations and incompetence, but the Constitutional Court later reinstated his power.\n__\nAssociated Press writer Kim Tong-hyung contributed to this report.\nFILE - In this Nov. 29, 2016, file photo, South Korean President Park Geun-hye makes a live televised address in Seoul, South Korea. South Korea's Constitutional Court rules to formally end impeached President Park's rule. (Pool Photo via AP, File)\nA protester opens a bottle of champagne to celebrate after hearing the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nProtesters react after hearing the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. Sensing history, hundreds of people gathered Friday ahead of a court ruling on whether impeached South Korean President Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment, Park Geun-hye.\" (AP Photo/Lee Jin-man)\nProtesters react after hearing the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nFILE - In this Sept. 4, 2016, file photo, South Korea's President Park Geun-Hye is seated during the opening ceremony of the G-20 Leaders Summit in Hangzhou, China. In a historic ruling Friday, March 10, 2017, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms.(Nicolas Asfouri/Pool Photo via AP, File)\nJudges are seated at the start of the ruling of impeached South Korean President Park Geun-hye at South Korea's Constitutional Court in Seoul Friday, March 10, 2017. In a historic ruling Friday, the court formally removed impeached Park from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (Pool Photo via AP)\nSouth Korean Constitutional Court's Chief Judge Lee Jung-Mi delivers judgment on the impeachment charge against South Korea President Park Geun-hye, at court in Seoul Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (Pool Photo via AP)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. Sensing history, hundreds of people gathered Friday ahead of a court ruling on whether impeached South Korean President Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment, Park Geun-hye.\" (AP Photo/Lee Jin-man)\nFILE - In this Jan. 1, 2017, file photo provided by the South Korean Presidential House, impeached South Korean President Park Geun-hye, center, listens to a reporter's question during a meeting with a selected group of reporters at the presidential house in Seoul, South Korea. In a historic ruling Friday, March 10, 2017, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (South Korean Presidential House via AP, File)\nProtesters react after hearing the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nSupporters of South Korean President Park Geun-hye wave national flags during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. (AP Photo/Ahn Young-joon)\nSupporters of South Korean President Park Geun-hye shout slogans during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached South Korean President Park will be removed from office over a corruption scandal or allowed to complete her term. (AP Photo/Ahn Young-joon)\nSupporters of South Korean President Park Geun-hye wave national flags during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. (AP Photo/Ahn Young-joon)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment.\" (AP Photo/Lee Jin-man)\nSupporters of South Korean President Park Geun-hye stage a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The sign reads \" South Koran President Park Geun-hye.\" (AP Photo/Ahn Young-joon)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment, Park Geun-hye.\" (AP Photo/Lee Jin-man)","url":"https://www.dailymail.co.uk/wires/ap/article-4299738/100s-gather-ahead-court-decision-impeached-leader.html"}
