{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:06:36","date_modify":"2018-10-30 21:06:36","date_publish":"2015-04-07 17:12:10","description":"A grassroots group of parents in South Carolina has organized a campaign to allow children to opt out of Common Core-aligned tests in the wake of a unanimous vote by the state’s Board of Education to replace the standards with “new” standards that are 90 percent aligned with Common Core. |","filename":"data/vaneerConsumption/SouthCarolinaParentsGovNikkiHaleyMIAonCommonCore.json","image_url":"https://media.breitbart.com/media/2015/01/gadsden-sc-flags-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_07__1540933596.html","title":"South Carolina Parents: Gov. Nikki Haley ‘MIA’ on Common Core","title_page":"South Carolina Parents: Gov. Nikki Haley ‘MIA’ on Common Core | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A grassroots group of parents in South Carolina has organized a campaign to allow children to opt out of Common Core-aligned tests in the wake of a unanimous vote by the state’s Board of Education to replace the standards with “new” standards that are 90 percent aligned with Common Core.\nSheri Few, president of South Carolina Parents Involved in Education (SCPIE), said that while former Tea Party candidate Gov. Nikki Haley (R), signed a bill to replace the Common Core standards last year, it was a “watered-down attempt” to eliminate the controversial standards.\n“Haley has been MIA on this issue from the beginning,” Few tells Breitbart News. “She would not even agree to meet with American Principles Project when I first attempted to arrange the meeting several years ago. Many think Haley is actively opposed to Common Core, but that is absolutely not true. She has not lifted a finger to help us in our fight against it.”\n“During the time that we were pushing for legislation to rewrite the standards, Gov. Haley was pushing her ‘Read to Succeed’ bill, which is now a law,” Few added. “’Read to Succeed’ has grown government by millions of dollars, added a new level of bureaucracy in the State Department of Education, established ‘reading czars’ at the state level, and will retain 3rd graders who are not reading on grade-level based on standardized test scores. The law is modeled after Jeb Bush’s Florida Read! program, which has been widely discredited.”\n“Gov. Haley, like many of our state and national legislators, is very ignorant when it comes to education policy,” Few continued. “They have fallen, and continue to fall for every federal gimmick that comes down the pike. Our state may vote like a red state when it comes to electing our representatives, but our representatives vote like a blue state when it comes to education policy.”\nIn response to a question from Breitbart News regarding the fact that the “new” South Carolina standards are 90 percent aligned with Common Core, Chaney Adams, Haley’s press secretary, emailed the following statement:\nThroughout this entire debate, Governor Haley has said that the most important thing is that the state retain its ability to set its own standards and be in control of how students are educated. In 2014, the governor signed a bill that abandoned a nationalized standard and retuned that control back to the people of South Carolina, and she is proud of that. The responsibility for setting new standards and a path forward for our students now is in the hands of the State Board of Education and the Education Oversight Committee.\nFew says her grassroots group is now launching its campaign to urge parents to refuse the state’s Common Core-aligned ASPIRE test.\n“We are hopeful that thousands of South Carolina parents will answer our call to civil disobedience in the coming weeks,” she said. “Then, this summer we will work hard to recruit strong candidates to challenge road blocks in the Legislature as every single member will be up for reelection, and we plan to bring major challenges in the Spring of 2016.”\nSouth Carolina parent Sara Wallace tells Breitbart News parents must advocate for their children. She noted that her own 6th grader, who had been placed in the school’s gifted program, suddenly failed several math tests based on the Common Core standards. That was not because he had reached incorrect answers, but because, according to the standards, he had not adequately explained how he came to the answers.\n“Every day there are stories of tears, homework fights, failed tests, complaints, and parents reaching out for answers,” Wallace said. “Here’s my answer for them: You and you alone are the only person who will advocate for your child to the fullest measure. If your instinct tells you something is wrong, push for an answer. Don’t give up, don’t be complacent, and never be afraid to look an expert in the face and question what you are being told.”\nParent Gina Buchardt said she is prepared to opt her child out of the Common Core-aligned state tests.\n“We need all of our state leaders to stand up to the federal government and quit throwing our children under the bus for federal funds,” she tells Breitbart News. “I will opt out of all Common Core testing if it comes to that, but I’m hoping that our state and federal leaders will see the light and do what is right for the future of all of our children and the United States.”\n“I feel my freedom as a parent is gone,” South Carolina parent Tamra Hood tells Breitbart News. “I am sick of being told – in so many words – that because I do not have letters after my name that I can’t possibly know what is best for my children, and that they, as school administrators, know best.”\n“The creativity and imagination of our elementary children is being squashed out of them,” Hood continues. “They are no longer allowed to be children. The standards are developmentally inappropriate and even above average children are floundering and dwindling in their classrooms.”\nHood said parents should take charge of making the changes necessary.\n“The only way to get something changed is to stand up to them and push back,” she asserted. “Let them know that we are not ignorant. We know what is happening, and we will not stand for it.”","url":"https://www.breitbart.com/politics/2015/04/07/south-carolina-parents-gov-nikki-haley-mia-on-common-core/"}
