{"authors":[],"date_download":"2018-10-30 00:57:15","date_modify":"2018-10-30 00:57:15","date_publish":"2016-11-04 09:58:30","description":null,"filename":"data/vaneerConsumption/SouthKoreanSolidarityWithHillary.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/KOCIS_Korea_President_Park_RedFort_06_12166116323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861035.html","title":"South Korean Solidarity With Hillary","title_page":"South Korean Solidarity With HillaryThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Hillarity at the New York Times continues. The other day it published an op-ed piece “Why American Needs a Female President.” It was by one Angie Kim, a writer in Virginia who as a third-grader in South Korea had been slapped on her hands by her teacher for daring to think she could run for class president. Yet for all of America’s egalitarianism, she writes, how is it that patriarchal South Korea actually has had a female president since 2013? In fact, many Asian countries have had women presidents and prime minister. In the Middle East too. With its usual subtlety, the Times is telling readers America has a lot of catching up to do — and there’s only one way to rectify the problem.\nAbsent in Ms. Kim’s account, alas, is any mention of the first South Korean woman president’s political problems at the moment. Her approval rating stands at 5 percent, and she’s embroiled in a terrible crony scandal, which involves a close relationship with a Huma-like character. There’s even this clincher According to the L.A. Times, “reports allege [this Huma] pushed businesses to donate millions of dollars to two foundations that she controlled.” At least Hillary has always been disciplined enough to shake down foundations on her own behalf.\nOn the other hand, we still have a lot of catching up to do if our Humas can’t do the shaking down for their own gain.","url":"https://spectator.org/south-korean-solidarity-with-hillary/"}
