{"authors":[],"date_download":"2018-10-23 01:25:42","date_modify":"2018-10-23 01:25:42","date_publish":"2016-01-29 15:20:25","description":"AB de Villiers was on Friday appointed South Africa’s full-time Test captain, Cricket South Africa announced. It said the decision was based on a recommendat...","filename":"data/vaneerConsumption/SouthAfricaappointDeVilliersasfulltimeTestcaptain.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i2fd-4PuZeKVXE7cd9005b2c876b9168e-944_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422969_South-Africa-appoint-De-Villiers-time-Test-captain_1540257942.html","title":"South Africa appoint De Villiers as full-time Test captain","title_page":"South Africa appoint De Villiers as full-time Test captain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Africa appoint De Villiers as full-time Test captain\nAB de Villiers was on Friday appointed South Africa’s full-time Test captain, Cricket South Africa announced.\nIt said the decision was based on a recommendation from the national selectors.\nDe Villiers, 31, took over the captaincy on a short-term basis for the last two Tests against England after Hashim Amla decided to resign after the second Test.\nSouth Africa's AB de Villiers had a harsh introduction to the Test captaincy in Johannesburg ©Gianluigi Guercia (AFP/File)\nAt the time there was speculation about De Villiers’ long-term future in international cricket and the player himself said he wanted to have discussions with chief executive Haroon Lorgat and chief selector Linda Zondi if he was to continue in the job.\nA statement from Cricket South Africa said De Villiers had accepted the appointment and quoted him as saying: \"This is an exciting time for South African cricket and I am honoured to have been asked to captain the Test team into a new era.\"\nLorgat said: \"AB’s commitment to the Proteas and international cricket is a lesson for many other cricketers and the Board was unanimous in appointing AB. I am confident that he will lead by example and display the brilliance and passion that he is so blessed with.\"\nSouth Africa’s next Test series is at home to New Zealand in August.\nThe board awarded contracts to 16 players.\nNotable exclusions from the list were opening batsman Stephen Cook, who made a century on debut in the fourth Test against England, and off-spinner Dane Piedt, who played in three of the four Tests.","url":"https://www.dailymail.co.uk/wires/afp/article-3422969/South-Africa-appoint-De-Villiers-time-Test-captain.html"}
