{"authors":[],"date_download":"2018-10-22 23:58:26","date_modify":"2018-10-22 23:58:26","date_publish":"2017-04-26 09:01:21","description":"Southeast Asian leaders will express concern this week about an \"escalation of activities\" in the South China Sea but avoid directly criticising China,...","filename":"data/vaneerConsumption/SoutheastAsianleaderstoavoiddirectChinacriticism.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/09/wire-464017-1493193683-598_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446676_Southeast-Asian-leaders-avoid-direct-China-criticism_1540252706.html","title":"Southeast Asian leaders to avoid direct China criticism","title_page":"Southeast Asian leaders to avoid direct China criticism | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A sign welcomes delegates to the upcoming ASEAN summit at the Philippine International Convention Center on April 25, 2017\nSoutheast Asian leaders will express concern this week about an \"escalation of activities\" in the South China Sea but avoid directly criticising China, according to the draft of a summit statement.\nThe statement, set to be released on Saturday at the end of a two-day leaders' meeting in Manila, reflects Philippine President Rodrigo Duterte's efforts to ease tensions with China over competing claims to the strategically vital waters.\nThe chairman's statement at the 10-member Association of Southeast Asian Nations (ASEAN) summit will merely hint at China's island-building in the sea without mentioning it by name, according to the draft obtained by AFP.\n\"We shared the serious concerns expressed by some leaders over recent developments and escalation of activities in the area which may further raise tensions and erode trust and confidence in the region,\" the statement said.\nHowever it did not mention China directly, nor an international tribunal's ruling last year rejecting Beijing's sweeping claims to the South China Sea, through which $5 trillion dollars in annual shipping trade passes.\nFour ASEAN members -- Brunei, Malaysia, the Philippines and Vietnam -- along with China and Taiwan, have claims in the sea, which security analysts say is a potential flashpoint for conflict.\nThe UN-backed tribunal ruled last July that China's claims to nearly all of the sea had no legal basis and its construction activities there were illegal.\nThe case was filed by Duterte's predecessor Benigno Aquino, who forcefully challenged Beijing through legal and diplomatic avenues including ASEAN events. This led to a sharp deterioration in bilateral relations.\nDuterte, who assumed the presidency shortly before the ruling was issued, has chosen to pursue friendly ties with China to try to win billions of dollars' worth of trade and aid.\nAs part of that, he has said he will not use the ruling to pressure China.\nThe draft follows a similar statement at an ASEAN summit in Laos last year when intensive Chinese lobbying helped to ensure there was no mention of the ruling.\nThe draft also noted \"progress\" on a so-called framework agreement for a code of conduct on the South China Sea.\nPhilippine diplomats have said the \"framework\" code of conduct might be completed by June, with China expressing optimism about the talks.\nBut negotiations for an actual code have already taken 15 years, after ASEAN and China adopted a non-binding agreement in 2002 to discourage hostile acts.\nMeanwhile, China has built its artificial islands, which are capable of serving as military bases.\n\"What's the point of having a code of conduct if China has successfully militarised the South China Sea?\" Renato de Castro, international studies professor at Manila's De La Salle University, told AFP.","url":"https://www.dailymail.co.uk/wires/afp/article-4446676/Southeast-Asian-leaders-avoid-direct-China-criticism.html"}
