{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:09:08","date_modify":"2018-10-30 20:09:08","date_publish":"2015-05-06 02:42:51","description":"An outbreak of HIV infections is still vexing portions of southeastern Indiana, affecting drug users and causing almost 150 cases so far.","filename":"data/vaneerConsumption/SouthernIndianaStillStrugglingtoCopeWithHIVOutbreak.json","image_url":"https://media.breitbart.com/media/2015/05/HIV-STD-handouts-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_05__1540930148.html","title":"Southern Indiana Still Struggling to Cope With HIV Outbreak","title_page":"Southern Indiana Still Struggling to Cope With HIV Outbreak","title_rss":"NULL","source_domain":"breitbart.com","text":"An outbreak of HIV infections is still vexing portions of southeastern Indiana, affecting drug users and causing almost 150 cases so far.\nIn March, Indiana’s governor Mike Pence declared a medical emergency over the situation, even going so far as to break his long-standing prohibition against offering fresh needles to drug users.\nAt his press conference, Gov. Pence said, “This is all hands on deck.” Pence also called the outbreak “a very serious situation.”\nSince that move late in March, the cases of HIV have grown from 70 some to almost 150.\nOne of the problems, as The New York Times recently reported, is that many drug users in the area think the virus is only for gays and are not aware that it can be contracted in any way other than gay sex.\nBut even the needle exchange program has found fewer takers than officials had hoped, as many in the community seem to think that being seen in the government distribution center is a bad idea and fear being registered with authorities.\nThere also seems to be a problem with drug users stealing the needles given out to those who have registered for the government’s offer.\nThe program, though, is growing, and more are taking advantage of the offer. Authorities are hopeful that the outbreak will soon begin to slow.\nBut one crime does seem to have slowed down. Men are no longer streaming into the area looking for women who will prostitute themselves for drug money.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2015/05/05/southern-indiana-still-struggling-to-cope-with-hiv-outbreak/"}
