{"authors":["Press Association"],"date_download":"2018-10-23 00:41:43","date_modify":"2018-10-23 00:41:43","date_publish":"2017-03-10 07:33:05","description":"Park Geun-hye was the country´s first female leader.","filename":"data/vaneerConsumption/SouthKoreaspresidentformallyremovedbycourt.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/07/wire-194549-1489131187-580_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300286_South-Korea-s-president-formally-removed-court_1540255303.html","title":"South Korea´s president formally removed by court","title_page":"South Korea´s president formally removed by court | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Korea’s Constitutional Court has formally removed impeached President Park Geun-hye over a corruption scandal that has plunged the country into political turmoil.\nIt was a stunning fall for Ms Park, who came to power in 2012 only to see her presidency descend into scandal.\nThe ruling by the eight-member panel opens her up to possible criminal proceedings, and makes her South Korea’s first democratically elected leader to be removed from office since democracy came to the country in the late 1980s.\nA protester carries a cutout of impeached President Park Geun-hye\nMs Park’s “acts of violating the constitution and law are a betrayal of the public trust,” acting Chief Justice Lee Jung-mi said.\n“The benefits of protecting the constitution that can be earned by dismissing the defendant are overwhelmingly big. Hereupon, in a unanimous decision by the court panel, we issue a verdict: We dismiss the defendant, President Park Geun-hye.”\nMs Park’s party said it “humbly accepts” the ruling and that it feels responsible for her downfall.\nSouth Korea must hold an election within two months to choose Ms Park’s successor. Liberal Moon Jae-in, who lost to Ms Park in the 2012 election, currently enjoys a comfortable lead in opinion surveys.\nWhoever becomes the next leader will take over a country facing a hostile North Korea, a stagnant economy and deep social and political divides.\n(Lee Jin-man/AP)\nPre-verdict surveys showed that 70-80% of South Koreans had wanted the court to approve Ms Park’s impeachment. But there have been worries that Ms Park’s removal would further polarise the country and cause violence between her supporters and opponents.\nThousands of people – both pro-Park supporters, many of them dressed in army-style fatigues and wearing red berets, and those who wanted Park gone – gathered around the Constitutional Court building and a huge public square in central Seoul.\nA supporter of South Korean President Park Geun-hye weeps during a rally opposing her impeachment\nHundreds of police were on hand, while the streets near the court were lined with barricades. Two people died as protests erupted following the court’s decision.\nA South Korean hospital official said a man in his 70s, believed to be a Park supporter, died from head wounds after falling from a police bus in front of the court. Police later confirmed a second death, without giving further details.\nThousands of Ms Park’s supporters reacted angrily to the verdict, shouting and hitting police officers with flag poles, and climbing on buses the police used to create a perimeter protecting the court.","url":"https://www.dailymail.co.uk/wires/pa/article-4300286/South-Korea-s-president-formally-removed-court.html"}
