{"authors":["Associated Press"],"date_download":"2018-10-22 23:13:42","date_modify":"2018-10-22 23:13:42","date_publish":"2017-03-16 06:09:15","description":"WELLINGTON, New Zealand (AP) - Henry Nicholls chose an opportune moment to reach his maiden test century as he led a concerted New Zealand fightback Thursday...","filename":"data/vaneerConsumption/SouthAfrica242inreplytoNZs268afterday12ndtest.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/06/wire-226715-1489644573-399_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319002_South-Africa-24-2-reply-NZs-268-day-1-2nd-test_1540250022.html","title":"South Africa 24-2 in reply to NZ's 268 after day 1, 2nd test","title_page":"South Africa 24-2 in reply to NZ's 268 after day 1, 2nd test | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WELLINGTON, New Zealand (AP) - Henry Nicholls chose an opportune moment to reach his maiden test century as he led a concerted New Zealand fightback Thursday on the first day of the second test against South Africa.\nThe left-hander went to the wicket with New Zealand at 21-3 and guided the hosts to 217-6 before he was out for 118. With his steady contribution, B.J. Watling's 34 and Jeet Raval's 36, New Zealand reached 268 before being dismissed in the 79th over.\nJ.P. Duminy's career-best 4-47 gave South Africa the upper hand at that point but the first day had one last twist when South Africa lost both openers, Stephen Cook (3) and Dean Elgar (9) to end the day at 24-2. Both batsman were caught at second slip by James Neesham - Cook from the bowling of Tim Southee (1-18) and Elgar from Colin de Grandhomme, who unexpectedly shared the new ball and returned 1-2 from three overs.\nNew Zealand's Tim Southee, center, with team mates after dismissing South Africa's Stephen Cook for 3 during the second cricket test at the Basin Reserve in Wellington, New Zealand, Thursday, March 16, 2017. (Ross Setford/SNPA via AP)\nNightwatchman Kagiso Rabada was 8 not out at stumps and Hashim Amla on 0.\nNicholls had a near miss three innings ago when he was out for 98 against Bangladesh but discarded any residual baggage from that innings to reach a century from 150 balls.\nHe first helped Raval steady the innings in a 52-run partnership which lifted New Zealand to 73-3 before Raval was out to the last ball before lunch. He then combined with Watling in a 116-run sixth-wicket partnership - a record for New Zealand against South Africa.\n\"It was nice after what happened against Bangladesh - getting out in the 90s - to get over that and contribute to a total,\" Nicholls said. \"They put us under pressure with the new ball and it was good through the middle to get a few partnerships.\"\nPart-time spinner Duminy bowled Nicholls with a delivery which dipped under his bat and clipped the pad as he pushed forward impulsively. He then had de Grandhomme (4) caught at first slip and Watling caught by Quinton de Kock, giving the wicketkeeper his second catch and third dismissal. At that stage he had three wickets from two overs and he returned to end the innings with the wicket of Neil Wagner (2), trapped lbw.\nIf New Zealand had any great regret on Thursday it was that five of their first eight wickets fell to spinners: almost unheard of on the first day of a test at the Basin Reserve, where fresh, green wickets almost always ensure the pre-eminence of fast bowlers.\n\"When I got out it was disappointing because I thought B.J. and I had got through when the ball was reversing a little,\" Nicholls said. \"To get out in a pretty soft way was a disappointing and we probably left a few runs out there but those two wickets tonight were massive.\"\nThe pitch did enough early to reward the quicks and the equivocal decision of Proteas captain Faf du Plessis to bowl on winning the toss.\nVeteran Morne Morkel bowled a lively first spell, including the wicket of Tom Latham (8).\nKagiso Rabada's first spell netted the wickets of New Zealand captain Kane Williamson (2) and Neil Broom for a duck on test debut.\nThe 33-year-old Broom waited through 165 first class matches to play his first test, then lasted only four balls.\nNew Zealand's Henry Nicholls hooks a ball to the boundary against South Africa during the second cricket test at the Basin Reserve in Wellington, New Zealand, Thursday, March 16, 2017. (Ross Setford/SNPA via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4319002/South-Africa-24-2-reply-NZs-268-day-1-2nd-test.html"}
