{"authors":[],"date_download":"2018-10-22 22:17:12","date_modify":"2018-10-22 22:17:12","date_publish":"2014-06-09 13:02:29","description":"Only one of the planes was carrying passengers, and no one was injured in the small collision.","filename":"data/vaneerConsumption/SouthwestJetBacksIntoJetBlueJetatLoganAirportinBoston.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/496286/140609-jetblue-southwest-jsw-938a_a982741fe75faf8040949fcd9ce1dbea.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_southwest-jet-backs-jetblue-jet-logan-airport-boston-n126121_1540246632.html","title":"Southwest Jet Backs Into JetBlue Jet at Logan Airport in Boston","title_page":"Southwest Jet Backs Into JetBlue Jet at Logan Airport in Boston","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Southwest Airlines Boeing 737 backed into parked JetBlue Airbus 320 at Logan International Airport in Boston on Monday, damaging both jets but causing no injuries, according to airport and airline officials.\nThe Southwest airliner was carrying passengers bound for Kansas City, said Miraj A. Berry, a spokesman for the Massachusetts Port Authority. The JetBlue plane was empty, Berry said.\nPhotos on social media showed that the Southwest jet's wing struck the tail fin of the JetBlue jet. The Southwest plane \"came in contact\" with the JetBlue plane, which was sitting at a neighboring gate, Southwest Airlines said in a statement.\nThe Southwest jet was \"out of service for repairs and inspections,\" but passengers would be accommodated on other flights, the airline said.\nA passenger on the affected Southwest flight, Aubin Dubois, said the airline offered passengers $200 vouchers but no explanation. “They just told us we had to be patient and wait while they were assessing the damages.”\nDubois said she boarded an alternative flight to Kansas City at 11:20 a.m.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/us-news/southwest-jet-backs-jetblue-jet-logan-airport-boston-n126121"}
