{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 22:28:40","date_modify":"2018-10-30 22:28:40","date_publish":"2016-12-13 00:00:00","description":"Southern Trains has cancelled services on Tuesday, Wednesday and Friday.","filename":"data/vaneerConsumption/SouthernRailtrainstrikesTimetableeconomicimpactreasons.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_aslef-southern-rail-train-strikes-timetable-economic-impact-reasons-2016-12_1540938520.html","title":"Southern Rail train strikes: Timetable, economic impact, reasons","title_page":"    Southern Rail train strikes: Timetable, economic impact, reasons - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"PA Half a million Southern Rail passengers have been hit by a total shutdown of the service in the worst train strike since the 1990s.\nThe strike, by members of train drivers union Aslef and the Rail, Maritime and Transport Union (RMT), is spread over December 13, 14 and 16 and is believed to cost the economy £20 million ($25.3 million) a day.\nAnd disputes could last for a decade, according to a report by The Times.\nAslef told Transport Secretary Chris Grayling to prepare for 10 years of strife after Southern's parent company failed to stop the strike in a last ditch court battle.\nGrayling said Aslef General Secretary Mick Whelan \"promised me ten years of industrial action\" earlier this year, in comments reported by The Times. \"I have believed it better to avoid direct ministerial involvement in negotiations during the autumn, as my involvement would make the issue even more political than it is.\"\nAbout 1,000 drivers are taking part in the action, shutting down more than 2,000 daily services operated by Southern. The franchise runs until 2021 and sees the government pay Govia Thameslink Railway (GTR), Southern's parent company, to run the service while the state collects the fares.\nThe dispute is over a proposed expansion of Southern's driver-only train network, whereby the driver operates the train doors rather than a guard. It has been rumbling on for years.\nAccording to the BBC, Southern has so far paid out around £38 million to compensate passengers for late or cancelled services and set aside an extra £15 million for season ticket holders.\nDriver-only-operated (DOO) trains were first introduced in the early 1980s and a third of the UK's services already operate this way. The whole of the London tube network is DOO.\nThe unions have claimed that an expansion of driver-only trains risks endangering passengers in the event of an accident. However, the rail safety regulator has ruled that it is safe.\nBut mainly the unions also see the more widespread use of DOO trains as a path to job cuts in the future — even thought Southern Rail has said that there will not be job cuts or pay cuts.","url":"https://www.businessinsider.com/aslef-southern-rail-train-strikes-timetable-economic-impact-reasons-2016-12"}
