{"authors":["Associated Press"],"date_download":"2018-10-23 00:19:11","date_modify":"2018-10-23 00:19:11","date_publish":"2016-01-28 14:03:55","description":"JUBA, South Sudan (AP) — When a delegation of South Sudanese rebels returned to the government-controlled capital Juba last month after two years of war, Nya...","filename":"data/vaneerConsumption/SouthSudanPeaceaccordfaltersrefugeesremainincamps.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:4c5f15abecf84bc4b1efa130d42ae8d7-4vVdYopwYQ7f641721b07adfa968-881_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420987_South-Sudan-Peace-accord-falters-refugees-remain-camps_1540253951.html","title":"South Sudan: Peace accord falters, refugees remain in camps","title_page":"South Sudan: Peace accord falters, refugees remain in camps | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Sudan: Peace accord falters, refugees remain in camps\nJUBA, South Sudan (AP) — When a delegation of South Sudanese rebels returned to the government-controlled capital Juba last month after two years of war, Nyajok Koat thought she would finally return to the home she fled when the fighting began.\nBut more than a month later, prospects of her leaving the U.N. base where she has taken shelter seem dim after the government and rebels missed a deadline last week to form a power-sharing government and end the war.\n\"It's only for God to know how long I'll be here,\" an exasperated Koat told a reporter who visited a U.N. camp in the capital that she shares with more than 27,000 other people.\nIn this photo taken Tuesday, Jan. 19, 2016, a displaced child holds clay model toys of a peacekeeper and a rifle, in the United Nations camp for displaced people in the capital Juba, South Sudan. When a delegation of South Sudanese rebels returned to the government-controlled capital Juba last month after two years of war, many refugees thought they would finally return to the homes they fled. But prospects for peace seem dim after the government and rebels missed a deadline last week to form a power-sharing government and end the war. President Salva Kiir, an ethnic Dinka, and rebel leader Riek Machar, a Nuer, signed a peace deal in August, but fighting continues. Machar said Tuesday, Jan. 26 in Kampala, Uganda that he won¿t return to Juba, South Sudan¿s capital, because the decree violated the peace accord. (AP Photo/Jason Patinkin)\nAlthough President Salva Kiir, an ethnic Dinka, and rebel leader Riek Machar, a Nuer, signed a peace deal in August, the fighting continues sporadically. Machar has not come to the capital to be Kiir's vice president, as agreed.\nThe peace deal said Machar's side would get control of South Sudan's two oil-producing states, but Kiir created 28 new states by decree, jeopardizing that provision of the agreement. Machar said Tuesday in Kampala, Uganda that he won't return to Juba because the decree violated the peace accord.\nKiir's spokesman, Ateny Wek Ateny, said reversing the decision would create more instability, and accused rebels of dragging their feet by refusing to nominate ministers to the transitional government.\nMachar also wants the government to pull its troops from Juba, as called for in the peace deal, according to his spokesman, James Gatdet Dak. Ateny said the government doesn't have money for tents to house the soldiers elsewhere.\nDespite the peace accord, both sides continue to seek new weapons, according to a report this week by a U.N. panel of experts. The panel said that as of mid-September, South Sudan's government was apparently trying to arrange payment for four attack helicopters from a Uganda-based company, Bosasy Logistics. The rebels have received ammunition and arms from neighboring Sudan, the report says.\nThe lack of progress toward peace leaves over 200,000 refugees in U.N. camps in makeshift tents of plastic sheets, dependent on food aid and enduring heat and dust in the dry season and mud and disease during rains.\nSpace is tight in the Juba camp, where Koat now lives. There isn't enough clean water trucked in for the camp's growing population, so residents dig deep holes in the hard packed earth to reach muddy groundwater.\nWhen the rebel delegation returned to Juba, Koat, a Nuer, was joyful.\n\"I was very happy. People were dancing. Even I danced,\" she said. \"But I danced for nothing ... I should have waited for real peace.\"\nIn this photo taken Tuesday, Jan. 19, 2016, Nyajok Koat sits with her one year-old son Thach Kuony in her makeshift home covered with plastic sheets, in the United Nations camp for displaced people in the capital Juba, South Sudan.When a delegation of South Sudanese rebels returned to the government-controlled capital Juba last month after two years of war, many refugees thought they would finally return to the homes they fled. But prospects for peace seem dim after the government and rebels missed a deadline last week to form a power-sharing government and end the war. President Salva Kiir, an ethnic Dinka, and rebel leader Riek Machar, a Nuer, signed a peace deal in August, but fighting continues. Machar said Tuesday, Jan. 26 in Kampala, Uganda that he won¿t return to Juba, South Sudan¿s capital, because the decree violated the peace accord. (AP Photo/Jason Patinkin)\nIn this photo taken Tuesday, Jan. 19, 2016,displaced people walk next to a razor wire fence at the United Nations base in the capital Juba, South Sudan. When a delegation of South Sudanese rebels returned to the government-controlled capital Juba last month after two years of war, many refugees thought they would finally return to the homes they fled. But prospects for peace seem dim after the government and rebels missed a deadline last week to form a power-sharing government and end the war. President Salva Kiir, an ethnic Dinka, and rebel leader Riek Machar, a Nuer, signed a peace deal in August, but fighting continues. Machar said Tuesday, Jan. 26 in Kampala, Uganda that he won¿t return to Juba, South Sudan¿s capital, because the decree violated the peace accord. (AP Photo/Jason Patinkin)","url":"https://www.dailymail.co.uk/wires/ap/article-3420987/South-Sudan-Peace-accord-falters-refugees-remain-camps.html"}
