{"authors":["Associated Press"],"date_download":"2018-10-22 23:37:27","date_modify":"2018-10-22 23:37:27","date_publish":"2017-03-10 03:39:25","description":"SEOUL, South Korea (AP) - With South Korea's Constitutional Court stripping President Park Geun-hye of power, the country slips into a political whirlwind...","filename":"data/vaneerConsumption/SouthKoreanpresidentremovedfromofficeWhatsNext.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/04/wire-193927-1489118955-547_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299904_South-Korean-president-removed-office-Whats-Next_1540251447.html","title":"South Korean president removed from office: What's Next?","title_page":"South Korean president removed from office: What's Next? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - With South Korea's Constitutional Court stripping President Park Geun-hye of power, the country slips into a political whirlwind building up to a presidential election likely in early May.\nHere's a look at possible scenarios in the frantic weeks ahead and some of the potential presidential contenders vying for the presidential Blue House:\n___\nFILE - In this Dec. 15, 2016 file photo, possible South Korean presidential contender Moon Jae-in laughs during a press conference at the Seoul Foreign Correspondents Club in Seoul, South Korea. With South Korea's Constitutional Court stripping President Park Geun-hye of power, the country slips into a political whirlwind building up to a presidential election likely in early May. Moon, who lost to Park in 2012, is now the clear presidential favorite. (AP Photo/Ahn Young-joon, File)\nINTO THE FIRE\nWith Park now formally unseated, the country, by law, must hold a presidential by-election within 60 days. This means the vote will likely take place on May 9.\nThe winner of the election will be immediately sworn in as the country's leader, according to South Korea's National Election Commission.\nWithout the luxury of having a presidential transition committee, the new president will have to rely on Park's presidential aides and Cabinet ministers, at least in the first few weeks, before piecing together a new government.\nThere's also a possibility that the presidential race could unfold while Park is being interrogated by prosecutors over suspicions that she conspired with a confidante to extort money and favors from companies and allowed the friend to secretly manipulate state affairs.\nProsecutors have already identified Park as a criminal suspect and now can now make a stronger push for indictment as she no longer has immunity from prosecution. Their investigations have already led to many arrests of former government officials, presidential aides and a globally famous tycoon, Samsung scion Lee Jae-yong, who is accused of bribing Park and her friend in exchange for business favors.\nPark repeatedly refused to be interviewed by prosecutors in recent months, but that will be harder to do now because prosecutors can get an arrest warrant.\nBeing dragged into a criminal court, and possibly serving time in jail, would mark a shocking downfall for Park, who defeated her liberal opponent in the 2012 election with overwhelming support from older South Koreans, who fondly remembered her dictator father as a hero.\n___\nBATTLE OF THE LIBERALS\nMany conservatives are seen as toxic because of their past association with Park, so some political pundits believe South Korea's next leader will be determined in the primaries of the liberal Democratic Party, the largest of the country's opposition parties.\nAnd the party's two leading presidential contenders have remarkably different tones on major issues, including the country's approach to belligerent North Korea.\nMoon Jae-in, who lost to Park in 2012 but is now the clear presidential favorite, argues that Seoul should pursue dialogue, not just the use of sanctions, to try to persuade Pyongyang to give up its nuclear ambitions. He vows to reopen an industrial park in the North Korean border town of Kaesong that was jointly run by the Koreas before Park's government closed it last year following a nuclear test and long-range rocket launch by the North.\nMoon has also shown a willingness to challenge the United States, the country's main ally, saying Seoul should reconsider its plans to deploy THAAD, an advanced U.S. anti-missile system, to cope with North Korean threats. Moon argues that THAAD's security benefits would be curtailed by worsened relations with China and Russia, which see the system's powerful radar as a threat.\nMoon's strongest challenger in the primaries will likely be An Heejung, the centrist governor of South Chungcheong Province.\nAn says it would be difficult for South Korea's next government to reopen the Kaesong park when Seoul has to stay committed to international sanctions to punish the North over its nuclear ambitions. He also supports the need for THAAD. An's stance has won him the support of many conservatives disappointed by Park.\n___\nCONSERVATIVE DISARRAY\nThe political turmoil surrounding Park has complicated politics for her conservative Liberty Korea Party, which failed to prevent the defection of dozens of lawmakers who created a new party for the presidential elections.\nSome party members have hinted at presidential ambitions, including South Gyeongsang Province Governor Hong Joonpyo, but polls show their support to be closer to zero than 5 percent.\nThings are not much better for the Bareun Party, consisting of those who defected from the Liberty Korea Party. Bareun had hoped to lure former United Nations chief Ban Ki-moon as its presidential candidate, but was left reeling after Ban abruptly decided he wouldn't run.\nBareun's flag-bearer may end up being Yoo Seong-min, a one-time Park aide who later became a critic. A recent poll by Gallup Korea showed Yoo's support at 1 percent.\nThe best hope for conservatives to win back the Blue House might be Prime Minister Hwang Kyo-ahn, who has been the country's acting head of state since lawmakers passed an impeachment motion against Park in December.\nHwang has never declared an ambition to run for president, but has never outright denied interest either.\nRecent polls show Hwang's support at about 10 to 15 percent in opinion polls. That would leave him still behind Moon, whose support has consistently been in the mid-30s.\nIf Hwang enters the presidential race, the role of government caretaker will go to Deputy Prime Minister Yoo Il-ho until the elections.\nFILE - In this Jan. 12, 2017 file photo, former U.N. Secretary-General Ban Ki-moon, center, waves upon his arrival at the Seoul Railway Station in Seoul, South Korea. With South Korea's Constitutional Court stripping President Park Geun-hye of power, the country slips into a political whirlwind building up to a presidential election likely in early May. Bareun Party had hoped to lure former United Nations chief Ban as its presidential candidate, but was left reeling after Ban abruptly decided he wouldn't run. (AP Photo/Ahn Young-joon, File)\nFILE - In this Jan. 23, 2017, file photo, South Korean acting leader and Prime Minister Hwang Kyo-ahn speaks during a press conference at the government complex in Seoul, South Korea. With South Korea's Constitutional Court stripping President Park Geun-hye of power, the country slips into a political whirlwind building up to a presidential election likely in early May. The best hope for conservatives to win back the Blue House just might be Prime Minister Hwang Kyo-ahn, who has been the country's acting head of state since lawmakers passed an impeachment motion against Park in December. (AP Photo/Ahn Young-joon. Pool, File)\nA supporter of South Korean President Park Geun-hye cries during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nFILE - In this Jan. 1, 2017, file photo provided by the South Korean Presidential House, impeached South Korean President Park Geun-hye, center, listens to a reporter's question during a meeting with a selected group of reporters at the presidential house in Seoul, South Korea. In a historic ruling Friday, March 10, 2017, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (South Korean Presidential House via AP, File)\nSupporters of South Korean President Park Geun-hye shout during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nProtesters react after hearing the Constitutional Court's verdict during a rally calling for impeachment of President Park Geun-hye near the court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)","url":"https://www.dailymail.co.uk/wires/ap/article-4299904/South-Korean-president-removed-office-Whats-Next.html"}
