{"authors":["Associated Press"],"date_download":"2018-10-22 23:10:50","date_modify":"2018-10-22 23:10:50","date_publish":"2016-01-28 11:52:03","description":"JOHANNESBURG (AP) — A referee and two athletes participating in a South African triathlon dived into the ocean to rescue two stricken men who were being swep...","filename":"data/vaneerConsumption/SouthAfricanathletesrescuemenatseathenfinishrace.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420740_South-African-athletes-rescue-men-sea-finish-race_1540249850.html","title":"South African athletes rescue men at sea, then finish race","title_page":"South African athletes rescue men at sea, then finish race | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South African athletes rescue men at sea, then finish race\nJOHANNESBURG (AP) — A referee and two athletes participating in a South African triathlon dived into the ocean to rescue two stricken men who were being swept out to sea. After pushing the men to shore, the athletes finished the grueling race a little later than they had planned.\nAthletes Martin Potgieter and Dylan Hartwig said Thursday that they were running the last miles (kilometers) of the contest when they stopped to help the men, who were struggling to stay afloat off the East London coast.\n\"We managed to push them little by little, just to get them to shore,\" said Potgieter, who headed into the sea after referee Ross Murray jumped over a wall, ran to the beach, discarded some clothes and started swimming to the panicked men.\nOne concern was that the men in trouble on Sunday would grab and pull down the referee and athletes in their effort to survive, according to 37-year-old Potgieter, who works in the coal distribution business.\nHe said the rescuers spoke \"a few hard words\" to the men to calm them.\nHartwig, meanwhile, started to cramp in the cold water. The athletes had already been competing for between five and six hours.\n\"There was only so much I could do because I was cramping,\" said Hartwig, a 21-year-old accounting student who focused on helping one of the men. \"I was trying to push him onto a wave.\"\nDelayed by 15 to 20 minutes, the athletes put their shoes back on, chatted for a bit while running and finished — Potgieter in six hours and 50 minutes and Hartwig in seven hours and 15 minutes. Matt Trautman of South Africa won the men's event in just over four hours.\nSouth Africa's Ironman 70.3 race includes swimming, cycling and running.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420740/South-African-athletes-rescue-men-sea-finish-race.html"}
