{"authors":[],"date_download":"2018-10-22 21:51:39","date_modify":"2018-10-22 21:51:39","date_publish":"2016-01-29 08:20:26","description":"A South Korean court on Friday handed down a 20-year jail sentence on a US citizen charged while still a teenager with brutally murdering a Korean man nearly...","filename":"data/vaneerConsumption/SouthKoreacourtsentencesUSmanto20yearsformurder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7qd-3bmscybNe842cce83474b5285a12-421_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422341_South-Korea-court-sentences-US-man-20-years-murder_1540245099.html","title":"South Korea court sentences US man to 20 years for murder","title_page":"South Korea court sentences US man to 20 years for murder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Korea court sentences US man to 20 years for murder\nA South Korean court on Friday handed down a 20-year jail sentence on a US citizen charged while still a teenager with brutally murdering a Korean man nearly two decades ago.\nArthur Patterson, now 36, was extradited from the United States in September last year to face trial in Seoul on charges of murdering Jo Jung-Pil, who was stabbed multiple times with a knife in a fast-food restaurant toilet.\nPatterson, who was the 17-year-old son of a US military contractor at the time, had denied any involvement in the crime in the nightlife district of Itaewon, close to the US military base in Seoul.\nUS national Arthur Patterson is escorted as he arrives at Incheon international airport on September 23, 2015 after being extradited from the US\nProsecutors, however, argued that Patterson had shown a \"devil-like brutality\" in stabbing Jo, who appeared to be a complete stranger to him, to death for no apparent reason.\nTwenty years in jail is a maximum penalty in South Korea for an offender under the age of 18.\nPatterson was initially tried in 1997 as an accomplice, while Edward Lee, a Korean-American man who was at the scene, was charged with murder. Both accused the other of killing Jo.\nPatterson served 18 months in prison for lesser charges including obstruction of justice, while Lee was sentenced to 20 years in jail for murder.\nIn 1998, Patterson was released as part of an amnesty programme, only to find himself a murder suspect again after Lee was acquitted on appeal for lack of evidence.\nHe fled to the United States a year later after investigators failed to renew his travel ban -- a mistake that sparked a storm of criticism.\nThe murder was made into a hit movie in 2009, refuelling public anger over the crime and forcing South Korean prosecutors to reopen the case.","url":"https://www.dailymail.co.uk/wires/afp/article-3422341/South-Korea-court-sentences-US-man-20-years-murder.html"}
