{"authors":["Lee Stranahan"],"date_download":"2018-10-30 21:54:46","date_modify":"2018-10-30 21:54:46","date_publish":"2016-12-10 23:56:05","description":"The Southern Poverty Law Center, aka the SPLC, has published a list of what they call “Terror from the Right” that categorizes two Islamic terror attacks—including the deadly assault on Orlando’s Pulse nightclub that left 49 dead and the Black Lives Matter-inspired murders of police officers in Baton Rouge and Dallas—as “radical-right terrorist plots.” | Politics","filename":"data/vaneerConsumption/SouthernPovertyLawCenterCallsIslamicandBlackLivesMatterAttacksRadicalRightTerroristPlots.json","image_url":"https://media.breitbart.com/media/2016/12/AP_HT_michah_johnson_omar_mateen_split_jt_160709.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_10__1540936486.html","title":"Southern Poverty Law Center Calls Islamic and Black Lives Matter Attacks 'Radical-Right Terrorist Plots'","title_page":"Southern Poverty Law Center Calls Islamic and Black Lives Matter Attacks 'Radical-Right Terrorist Plots' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Southern Poverty Law Center, aka the SPLC, has published a list of what they call “Terror from the Right” that categorizes two Islamic terror attacks—including the deadly assault on Orlando’s Pulse nightclub that left 49 dead and the Black Lives Matter-inspired murders of police officers in Baton Rouge and Dallas—as “radical-right terrorist plots.”\nThe motive for the SLPC’s bizarre definition of the political right remains unclear, but the list of the “stories of plots, conspiracies and racist rampages since 1995 — plots and violence waged against a democratic America” includes a section on the Orlando attack that says:\nJune 12, 2016 Omar Mir Seddique Mateen, a 29-year-old security guard of Ft. Pierce, Florida, enters Pulse, an LGBT nightclub in Orlando, with an assault rifle and a pistol. He kills 49 people and wounds 53. After a three-hour standoff, he is killed when law enforcement officers crash into the building with an armored vehicle and stun grenades. Mateen called 911 during the attack to pledge allegiance to ISIS and mentioned the Boston Marathon bombers. He also demanded that U.S. bombing of Syria and Iraq stop. His father initially told NBC News that his son had expressed outrage when he saw two men kissing in Miami. Others described Mateen as a violent, deeply conflicted man who had beaten his former wife and often frequented gay bars. The FBI interviewed Mateen in 2013 and 2014 but reportedly found no evidence that he was tied to terrorism.\nThe SLPC’s description notably includes the implication that Mateen was secretly gay, an allegation made by several left-wing media outlets in the wake of the attack. Sources like the New York Daily news flatly reported Omar Mateen was gay, and the Guardian published headlines like Omar Mateen’s interest in gay men makes this no ordinary act of terrorism.\nHowever, the Los Angeles Times reported in June, 2016 that law enforcement officials told them that the “FBI has found no evidence so far to support claims by those who say Mateen had gay lovers or communicated on gay dating apps.”\nThe SLPC made no mention that Omar Mateen’s father was a Hillary Clinton supporter and attended a Clinton rally in August.\nThe “Terror from the Right” list also includes an incident from Oct. 28, 2009 about another Muslim attack:\nLuqman Ameen Abdullah, identified by authorities as a member of a black Muslim group hoping to create an Islamic state within U.S. borders, is shot dead at a warehouse in Dearborn, Mich., after he fires at FBI agents trying to arrest him on conspiracy and weapons charges. The FBI says Abdulla encouraged violence against the United States, adding that 10 other group members are being sought.\nFurther confusing the issue, no other Islamic attacks were listed as “right-wing,” making the choice to include the Mateen and Abdullah stories even more inexplicable.\nThe SLPC list also includes the two shocking assassinations of police officers this past summer by Black Lives Matter inspired gunmen who have no clear connection to the political right, even the extremist groups such as white nationalists that the media labels as “far-right.” The SLPC writes:\nJuly 7, 2016 Army reservist and Afghanistan veteran Micah Xavier Johnson, 25, shoots 12 police officers, killing five, in downtown Dallas after a Black Lives Matter protest. Two protesters were also wounded. Johnson barricades himself in a building at El Centro College and tells a hostage negotiator he wanted to “kill white people,” especially white officers. Johnson, who had expressed support for several black separatist groups on Facebook, dies when a police robot detonates a bomb near him. Investigators find bomb-making materials, rifles, ammunition, ballistic vests and a personal journal of combat tactics in his home.\nJuly 17, 2016\nGavin Eugene Long, 29, of Kansas City, Missouri, kills three Baton Rouge, Louisiana, police officers in a coordinated ambush-style attack then dies in a shootout with law enforcement. Long, a military veteran, went by the name Cosmo Setepenra and had declared himself an antigovernment “sovereign citizen.” He was a member of the black sovereign group United Washitaw de Dugdahmoundyah Mu’ur Nation.\nThe Daily Caller contacted the SPLC about the bizarre and contradictory “Terror from the Right” list but were given no answers.\nNo other jihadis are included on the SPLC’s “Terror from the Right” list and the group did not offer an explanation to The Daily Caller about why Abdullah and Mateen are considered right-wing terrorists. Likewise, the SPLC did not explain to The DC why two black power-supporting cop killers are considered right-wing. Micah Xavier Johnson is responsible for the July ambush of police officers in Dallas that left 5 dead and 7 wounded. Dallas police said that Johnson told them he wanted to kill white people and a picture from his Facebook profile shows him holding up a “black power” fist.\nThe Southern Poverty Law Center is a go-to source for mainstream media reporting stories about “hate.” A media outlet linking to the SLPC “Terror from the Right” could easily cite the list in an article without revealing to their audience that list included murders by Muslims and Black Lives Matter advocates, creating the illusion that dozens of deaths attributed to the “right” was much higher than it is in reality.\nFollow Breitbart News investigative reporter and Citizen Journalism School founder Lee Stranahan on Twitter at @Stranahan.","url":"https://www.breitbart.com/politics/2016/12/10/southern-poverty-law-center-calls-islamic-and-black-lives-matter-attacks-radical-right-terrorist-plots/"}
