{"authors":[],"date_download":"2018-10-22 22:13:46","date_modify":"2018-10-22 22:13:46","date_publish":"2014-06-09 13:11:06","description":"The fight for the soul of the GOP is mostly taking place in the South -- and it's largely being fought over immigration.","filename":"data/vaneerConsumption/SouthernDiscomfortGOPClashesinSouthernStates.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/496171/texas_gop_convention-jpeg-0d2af_368c6bbb8992a0dde506594852316c14.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_southern-discomfort-gop-clashes-southern-states-n126131_1540246426.html","title":"Southern Discomfort: GOP Clashes in Southern States","title_page":"Southern Discomfort: GOP Clashes in Southern States ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSouthern Discomfort: Establishment vs. Tea Party fight is largely taking place in the South\nHere’s one important point that has gotten lost in all the coverage over this year’s GOP establishment-vs.-Tea Party fight: It’s largely been taking place in the South. Think Texas (where Sen. John Cornyn won his primary, but Lt. Gov. David Dewhurst lost his). Think North Carolina (where the Chamber of Commerce-backed Tom Tillis emerged victorious). Think Mississippi (where Sen. Thad Cochran is now in a runoff and in the fight of his political life). And think South Carolina (where Sen. Lindsey Graham faces a field of primary challengers tomorrow). Even Kentucky -- a quasi-Southern state -- was the venue for Mitch McConnell’s victorious primary over Tea Party challenger Matt Bevin:\nAnd it’s largely being fought over immigration\nHere’s one more point to consider in this establishment-vs.-Tea Party battle: The biggest ideological fault line has been with immigration reform. At a debate on Saturday, one of Graham’s primary opponents used the term \"Grahamnesty\" to describe the senator’s co-authorship of the “Gang of Eight” immigration-reform legislation that passed the Senate last year. In Virginia, which also holds its primaries tomorrow, House Majority Leader Eric Cantor’s Tea Party opponent has hit the incumbent on immigration. \"Eric Cantor is saying we should bring more folks into the country, increase the labor supply - and by doing so, lower wage rates for the working person,\" said primary opponent David Brat, per Reuters. Cantor has responded by sending out mailers saying he’s led the fight against “amnesty.” And at the Texas GOP convention over the weekend, delegates “adopted a hard-line immigration platform that included a call to end in-state tuition for illegal immigrants, a statute that Mr. Perry supported and defended as a presidential candidate in 2012,” the New York Times writes.\nIt’s Ted Cruz’s party in Texas -- not John Cornyn’s or Rick Perry’s\nOf course, there are some notable exceptions here when it comes to immigration. Thad Cochran voted against the “Gang of Eight” legislation, but that didn’t stop his Tea Party challenge. And in North Carolina, Thom Tillis doesn’t support comprehensive immigration reform, even though the Chamber of Commerce that backed him in the primary does. But if there is any issue that is TRULY dividing the Republican Party, especially in the South, it’s immigration. And the issue isn’t as much a policy disagreement as it is a cultural disagreement. Once an issue becomes more “cultural,” it’s usually very difficult for someone who fails that cultural litmus test to garner support based on other issues. Oh, and here is a final point to consider here: Even in the races that the GOP establishment has won in the South, the Tea Party has worked to push the party even more to the right. That was certainly on display at the Texas Republican convention over the weekend. Does anyone think that this is John Cornyn’s party in Texas? Or Rick Perry’s party? No, it’s current Ted Cruz’s party. As the Washington Post’s Karen Tumulty writes, “On Friday, convention attendees were enraptured by Cruz’s keynote address, in which he warned that ‘liberty is under assault like never before, and again today Texans will stand up and lead the fight for freedom.’ It sounded like a warm-up for a presidential stump speech, and many in the audience hope that will be the case, judging by the chants of ‘Run, Ted, run!’”\nResignation drama down in Virginia\nIn another great political drama down South, don’t miss what took place last night in Virginia, where Democrats and Republicans have been battling over the issue of whether the state should expand Medicaid under the health-care law. The Washington Post: “Republicans appear to have outmaneuvered Gov. Terry McAuliffe in a state budget standoff by persuading a Democratic senator to resign his seat, at least temporarily giving the GOP control of the chamber and possibly dooming the governor’s push to expand Medicaid under the Affordable Care Act. Sen. Phillip P. Puckett (D-Russell) will announce his resignation Monday, effective immediately, paving the way to appoint his daughter to a judgeship and Puckett to the job of deputy director of the state tobacco commission, three people familiar with the plan said Sunday.” More: “The news prompted outrage among Democrats — and accusations that Republicans were trying to buy the Senate with job offers in order to thwart McAuliffe’s proposal to expand health coverage to 400,000 low-income Virginians.” We remember when James Jeffords switched parties to give Democrats a majority in the U.S. Senate. And we remember when Arlen Specter switched, which paved the way for Democrats to get a filibuster-proof 60 votes. But we don’t ever remember someone RESIGNING to give the opposition party control of the chamber. Wow. This entire episode was so brazenly transactional, it’s stunning. By the way, this also shows how little control the new Democratic governor of Virginia, Terry McAuliffe, has over his own party.\nUpdates on the Bergdahl story\nOn Sunday, the New York Times reported that Bowe Bergdahl “has told medical officials that his captors locked him in a metal cage in total darkness for weeks at a time as punishment for trying to escape, and while military doctors say he now is physically able to travel he is not yet emotionally ready for the pressures of reuniting with his family.” The Times also notes criticism why the administration didn’t get something more from the Taliban (like renouncing international terrorism) as part of the swap. And on Friday, President Obama told NBC’s Brian Williams that he stood by his decision to swap five Taliban fighters for Bergdahl’s freedom. ”We have a rule, a principle, that when somebody wears our country's uniform and they're in a war theatre and they're captured-- we're going to do everything we can to bring 'em home. That's a promise that we make to the families of those who serve. That's a promise I make every time I meet moms and dads all across the country whose kids are serving in our military. Bowe Bergdahl was one of those individuals. And regardless of whatever circumstances there are, it is our obligation to bring them home.”\nHillary-palooza\nWith Hillary Clinton’s book officially being released this week -- and with all the interviews and promotions associated with it -- the Clintons are going to be in the news. A lot. We repeat what we wrote on Friday: The lack of “news” in her book is the “news.” Meaning: This book launch is clearly Phase One of the 2016 campaign. The book tour and rollout are as much organizing tools for taking over the Democratic Party than anything else. There aren’t any scores she seems intent on settling. It is a stark contrast to the Bob Gates memoir, who seemed to be more comfortable talking about what happened behind the scenes. Clinton is clearly holding back. Then again, this is how she served as secretary of state; she never did push back on Obama decisions very hard. She made her stance known when asked but she was NOT aggressive about it. She was always was the team player, and this memoir reflects it. And here’s a little Clinton scoop courtesy of the Wall Street Journal: “A Democratic strategist who is considered a possible Clinton campaign manager in 2016, Robby Mook, has been meeting with top aides to Mrs. Clinton and discussing strategies to win enough states to clinch the White House, two people familiar with the matter said. A Clinton spokesman and Mr. Mook didn't reply to requests for comment.”\nCleveland Clinic head no longer in the running to be VA secretary\nLast week, we wrote that the head of Cleveland Clinic, Toby Cosgrove, was in the running to be President Obama’s pick to be the new VA secretary. Well, he took his name out from consideration. \"As a physician, veteran, and hospital chief executive, I have great respect for the care provided to the veteran community and for those who work to care for them,\" Cosgrove said, per the Cleveland Plain Dealer. \"This has been an extraordinarily difficult decision, but I have decided to withdraw from consideration from this position and remain at the Cleveland Clinic, due to the commitment I have made to the organization, our patients and the work that still needs to be done here.\" So it’s back to the drawing board for the administration. But Cosgrove is exactly the type of person they’re looking for -- manager of a hospital system and a military veteran, to boot.\nMcConnell to host fundraiser for Cochran\nLastly, regarding the June 24 runoff in Mississippi between Sen. Thad Cochran and Tea Party challenger Chris McDaniel, NBC News has confirmed that Senate Minority Leader Mitch McConnell will host a runoff fundraiser for Cochran tomorrow at the National Republican Senatorial Committee. Also, via the AP: \"The Hinds County District Attorney's office will investigate how a staffer for state Sen. Chris McDaniel's U.S. Senate campaign and two other McDaniel supporters got locked in the county courthouse after Tuesday's primary election. The county sheriff's department has concluded that Janis Lane, Scott Brewster and Rob Chambers did nothing criminal.\"\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/southern-discomfort-gop-clashes-southern-states-n126131"}
