{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:26:43","date_modify":"2018-10-30 21:26:43","date_publish":"2015-10-10 07:12:04","description":"Sox-Loving Chicago Bar Disses the Cubs, Offers Free Drinks for Cardinals Homers","filename":"data/vaneerConsumption/SoxLovingChicagoBarDissestheCubsOffersFreeDrinksforCardinalsHomers.json","image_url":"https://media.breitbart.com/media/2015/06/ap_beer_ap-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_10_10__1540934803.html","title":"Sox-Loving Chicago Bar Disses the Cubs, Offers Free Drinks for Cardinals Homers","title_page":"Sox-Loving Chicago Bar Disses the Cubs, Offers Free Drinks for Cardinals Homers","title_rss":"NULL","source_domain":"breitbart.com","text":"A bar on Chicago’s Southwest Side is most assuredly not jumping on the Chicago Cubs bandwagon despite the fact that the north siders won a smashing Wild Card victory and head to the NLDS to face the St. Louis Cardinals. In fact, the bar is going the opposite way by offering free drinks for every Cardinals homer.\nThe Cubs haven’t gotten into the playoffs since 2008 and haven’t won a postseason game since 2003. They now for the first time ever face regional rivals the St. Louis Cardinals in an NL Division Series. Naturally, the Windy City is generally excited for this match up. But with the excitement over the Cubs, it is easy to forget there are fans of another MLB team in town: the Chicago White Sox.\nThe White Sox, Chicago’s south siders, have one big fan in President Barack Obama. But this week, even the baseball-fan-in-chief says he is rooting for the Cubs. Obama has even said he’s rooting for the Cubs to take the big title as World Series winners.\nBut not everyone in Chi-town is all excited about the Cubs.\nOn Friday, McNally’s bar in Morgan Park immediately put up a sign outside the bar boldly announcing, “Free beer every Cardinal home run.”\nIn a jab at Cubs pitcher Jake Arrieta, another sign reads: “Cub Fans, Who’s Gonna Pitch Now?”\nNow, technically, it is against a city ordinance to give away free beer, so the bar will actually charge a minimal price for beers ordered after every Cardinal homer. But the bitter feelings by McNally’s owners towards the Cubs seems clear.\nThe manager of the south side bar—who declined to state her name for fear that Cubs fans would vandalize her house—noted that she cheers for the Cardinals, anyway, so the bar offer works as another way to denote her dislike of the Cubs.\nBar patrons told The Chicago Tribune that they are eager for the game and the cut-price beer.\nThough one customer said he’s “not much of a baseball fan,” he eagerly noted “but I’ll have some of those beers.”\nAnother patron said that being long-time losers was part of the Cubs’ “charm” and that for decades they have been “kind of pathetic.” But if they won a World Series it would ruin their appeal as sad sacks.\nA final patron noted that even though he roots for the Sox, he bets on the Cubs. “I’m a Cubs hater, but I’m a moneymaker. I bet on the Cubs all year long,” he said.\nThe bar also announced that its cheap beer deal for opposing team homers holds as long as the Cubs stay in the playoffs and even if they play in the World Series.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/sports/2015/10/10/no-love-for-cubs-white-sox-loving-chicago-bar-offers-free-drinks-for-cardinals-homers/"}
