{"authors":["Warren Patterson"],"date_download":"2018-10-31 00:36:03","date_modify":"2018-10-31 00:36:03","date_publish":"2018-07-09 00:00:00","description":"The US and China have put into effect $34 billion worth of tariffs on one another. The tariffs seem to be fully priced into the soybean market, but it's now impacting other agricultural commodities.","filename":"data/vaneerConsumption/SoybeansChinesetariffsarecompletelypricedin.json","image_url":"https://amp.businessinsider.com/images/5b439ecb0bc37e2a008b4b99-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_soybeans-chinese-tariffs-are-completely-priced-in-2018-7_1540946163.html","title":"Soybeans: Chinese tariffs are completely priced in","title_page":"    Soybeans: Chinese tariffs are completely priced in - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"As the clock hit 12.01am on Friday, US tariffs on $34 billion worth of imports from China came into effect, and it did not take long for China to retaliate by imposing tariffs on a number of US goods, including a 25% import tariff on US soybeans. We believe the tariff impact is fully priced in already, and therefore do not expect further pressure on CBOT soybeans.\nWhat has happened to soybean prices since the initial announcement?\nUnsurprisingly, CBOT soybeans came under significant pressure following the initial announcement from China back in April that it would retaliate to any US tariffs. CBOT soybean prices have fallen by a little over 21% since mid-April, trading below $8.50/bu, levels last seen back in 2008. In fact, CBOT has traded down to levels where, even if we take into consideration the 25% import tariff, US soybeans are still workable into the Chinese market. At the moment, we estimate that import parity is around $8.70/bu, compared to the CBOT November 2018 contract trading at around $8.56/bu.\nMeanwhile, the Chinese domestic soybean futures market has strangely also traded lower, falling by around 7% since mid-April. If we look at the move in the domestic market in USD terms, prices have fallen by almost 12%, reflecting the depreciation that we have seen in the CNY recently. It appears that the domestic market started pricing in these tariffs earlier in the year, with domestic futures rallying strongly over 1Q18.","url":"https://www.businessinsider.com/soybeans-chinese-tariffs-are-completely-priced-in-2018-7"}
