{"authors":[],"date_download":"2018-10-23 05:52:31","date_modify":"2018-10-23 05:52:31","date_publish":"2017-03-16 16:36:08","description":"The company's Falcon 9 rocket blasted off from the Kennedy Space Center at 2 am (0600 GMT) carrying the EchoStar XXIII, a communications satellite for EchoStar.","filename":"data/vaneerConsumption/SpaceXlightsupFloridanightskywithsatellite.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E56F6F500000578-0-image-a-49_1489683203120.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4320972_SpaceX-lights-Florida-night-sky-launch_1540273951.html","title":"SpaceX lights up Florida night sky with satellite","title_page":"SpaceX lights up Florida night sky with satellite | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SpaceX on Thursday successfully launched a communications satellite into space from the Kennedy Space Center in Florida.\nThe company's Falcon 9 rocket blasted off at 2 am (0600 GMT) carrying the EchoStar XXIII, a commercial communications satellite for EchoStar Corporation.\nThe satellite will be place in orbit more that 35,000 kilometers above the earth and provide telecommunications service to Brazil, SpaceX said.\nScroll down for video\nThe mission took off from NASA's historic launchpad 39A, the origin of the pioneering US spaceflights that took astronauts to the Moon in the 1960s and 1970s at 2 am (0600 GMT) carrying the EchoStar XXIII, a commercial communications satellite for EchoStar Corporation\nHowever SpaceX said it will not attempt to land Falcon 9's first stage after launch 'due to mission requirements.'\nThe mission took off from NASA's historic launchpad 39A, the origin of the pioneering US spaceflights that took astronauts to the Moon in the 1960s and 1970s, as well as the space shuttle missions that ran from 1981 to 2011.\nOriginally built to support the Apollo program, LC-39A supported the first Saturn V launch (Apollo 4), and many subsequent Apollo missions, including Apollo 11 in July 1969.\nBeginning in the late 1970s, LC-39A was modified to support Space Shuttle launches, hosting the first and last shuttle missions to orbit in 1981 and 2011 respectively.\nThe rocket, carrying the Echostar XXIII communications satellite was delayed from Tuesday due to high winds\nIn 2014, SpaceX signed a 20-year lease with NASA for the use of historic Launch Complex 39A.\nSince then, the company has made significant upgrades to modernize the pad’s structures and ground systems, while also preserving its important heritage.\nExtensive modifications to LC-39A have been made to support launches of both commercial and crew missions on SpaceX’s Falcon 9 and Falcon Heavy launch vehicles.\nSpaceX, founded and led by billionaire Elon Musk, is emerging as leader of the modern commercial space industry after becoming the first to send a private cargo carrier to the International Space Station in 2010.\nThe rocket, carrying the Echostar XXIII communications satellite was delayed from Tuesday due to high winds\nSpaceX said it did not attempt to land Falcon 9's first stage after launch 'due to mission requirements'\nLast month Musk revealed SpaceX will launch a crewed mission beyond the moon for two private paying customers in 2018, it has been revealed.\nIt will be the first time in 45 years humans have been in deep space, said the company, promising its mission will go 'faster and further' than any humans before them.\nThe week-long mission will take place some time in late 2018 and will 'skim the surface of the moon' then venture into deep space before returning to Earth, Musk revealed.\nThe identity of the customers and how much they paid has been kept secret.\nSpaceX expects the mission to take place some time in late 2018, after it sends a crewed NASA Dragon craft to the International Space Station.\n'We have been approached by private individuals,' said SpaceX CEO Elon Musk, after announcing the mission by tweeting 'fly me to the moon... ok'.\nA SpaceX Falcon 9 rocket launches from Kennedy Space Center, as seen from Viera, Fla., Thursday, March 16, 2017. The rocket, carrying the Echostar XXIII communications satellite was delayed from Tuesday due to high winds.\n'This is a private mission with paying customers, who have placed significant deposits,' Musk said, but added that they have so far not authorized the company to reveal their names.\nMusk said the individuals know each other and are 'very serious' about the flight\n'This is a really exciting thing that's happened,' Musk told reporters.\nThe mission will use one of SpaceX's Dragon capsules, which will be modified to allow communications in deep space.\nA SpaceX Falcon 9 rocket lifts off from Pad 39A at Kennedy Space Center in Florida, Thursday, March 16, 2017. The rocket, carrying the Echostar XXIII communications satellite was delayed from Tuesday due to high winds.\nThe mission took off from NASA's historic launchpad 39A, the origin of the pioneering US spaceflights that took astronauts to the Moon in the 1960s and 1970s, as well as the space shuttle missions that ran from 1981 to 2011.\nMusk said it would be roughly the cost of a crewed mission to the International Space Station, and that other flight crews have already expressed interest in later flights.\n'This presents an opportunity for humans to return to deep space for the first time in 45 years and they will travel faster and further into the Solar System than any before them,' SpaceX said.\nThe mission would 'do a long loop around the moon' and would take about a week.\n'It would skim the surface of the moon, go quite a bit further out into deep space' and then return to Earth, Musk said.\n'There is some risk here,' he said, adding the hopeful passengers are not 'naive' about the dangers.\nThe California-based company has endured two costly disasters in the past two years - a launchpad blast that destroyed a rocket and its satellite payload in September, and a June 2015 explosion after liftoff that obliterated a Dragon cargo ship packed with provisions bound for the space station.","url":"https://www.dailymail.co.uk/sciencetech/article-4320972/SpaceX-lights-Florida-night-sky-launch.html"}
