{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-22 22:02:50","date_modify":"2018-10-22 22:02:50","date_publish":"2016-01-28 09:49:58","description":"MailOnline offers a hint at what to expect in 2016 and beyond. The round-up includes Jupiter missions, Mars exploration, and the distant signal of Voyager in interstellar space.","filename":"data/vaneerConsumption/Spacemissionsin2016fromExoMarstoJupitersJunoanddivingintoSaturnsring.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A8462800000578-0-image-a-13_1453973695012.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3410556_To-Pluto-2016-Astronomers-reveal-space-missions-excited-year-ExoMars-Jupiter-s-Juno-diving-Saturn-s-ring_1540245770.html","title":"Space missions in 2016 from ExoMars to Jupiter's Juno and diving into Saturn's ring","title_page":"Space missions in 2016 from ExoMars to Jupiter's Juno and diving into Saturn's ring | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"2015 was a bumper year for exploring our planetary backyard.\nSpace agencies landed a probe on a distant comet, received the most detailed close-ups from Pluto, brought rockets safely back from space - landing them upright - and sent the first British astronaut to the International Space Station (ISS).\nWith this flurry of activity it would seem that the space race has been reinvigorated. So what will the year ahead have in store for planetary exploration?\nScroll down for video\nEarth is increasingly becoming an interplanetary departures lounge. With a flurry of discoveries in the solar system in 2015, it would seem the space race has been reinvigorated. So what will 2016 have in store for planetary exploration? Stock image illustrates the solar system\nEarth is increasingly becoming an interplanetary departures lounge, as we wave off missions to distant alien worlds. But 2016 will see a stream of scientific data phoned home.\nProfessor David Rothery, a planetary geoscientist at the Open University told MailOnline: 'In terms of discoveries, I don't think we've got another year ahead like we did this time last year.'\nBut just because we were so spoiled for discoveries in 2015, doesn't mean that this year won't bring findings of its own.\nMARS\nThe red planet will again be at the centre of much of the exploratory attention this year, as a number of missions leave Earth and make their way to Mars.\nData collected could help lay the groundwork and assess the validity of future manned missions.\nThe red planet will again be at the centre of much of the exploratory attention this year, as a number of missions leave Earth terminus and make their way to Mars (pictured). Data collected could help lay the groundwork and assess the validity of future manned missions\nEXPLORING THE RED PLANET Mars will once again be at the centre of much of the exploratory attention, as this year a number of missions leave Earth terminus and make their way to Mars. Data collected could help lay the groundwork and assess the validity of future manned missions. The European Space Agency, for example, is preparing for the first arrival of its ExoMars programme in October. The mission aims to detect methane and other atmospheric gases in Mars's atmosphere which could be clues of biological activity. Nasa's own lander, InSight, had hoped to beat the European mission to the Martian surface, with a proposed scheduled arrival date of late September. However, in December a leak was found and its liftoff was pushed back. Nasa has not revealed what date the mission will now take place.\nThe European Space Agency, for example, is preparing for the first arrival of its ExoMars programme in October.\nThe mission aims to detect methane and other atmospheric gases in Mars's atmosphere which could be clues of biological activity.\nProfessor Andrew Coates, a planetary scientist at University College London, explained: 'Methane in the Martian atmosphere is very interesting as it shouldn't be there, it should be broken up by sunlight, so the fact that it's there means there must be a source,'\nHe told MailOnline: 'That source is either geothermal activity - which is interesting as we didn't know that Mars was active like that - or it's life.\n'And that, of course, would be a completely amazing discovery.'\nNasa has contributed the Trace Gas Orbiter, designed to sniff out methane, while Russian agency Roscosmos has provided the planetary lander, Schiaparelli for the mission and the mission will liftoff in March.\nNasa's own lander, InSight, had hoped to beat the European mission to the Martian surface, with a proposed scheduled arrival date of late September.\nThe European Space Agency is preparing for the first arrival of its ExoMars programme in October. The mission aims to detect methane and other atmospheric gases in Mars's atmosphere which could be clues of biological activity. The surface of Mars is pictured\nCuriosity keeps on rolling. The Nasa rover continues to explore the Martian surface and will drill more rocks, sample more dust and send back more images in 2016\nOne of the ExoMars instruments is pictured\nHowever, in December a leak was found in one of the lander's vacuum tubes and its liftoff was pushed back. Nasa has not revealed what date the mission will now take place.\nTHE ASTEROID BELT\nWhat better way to study the formation of solar system then to study the leftover debris?\nAt the tail end of 2015, Nasa's Dawn spacecraft sent back close ups of Ceres, the largest object in the rocky asteroid belt.\nOrbiting in the expanse between Mars and Jupiter, this lesser-known rock was revealed to have mountains, craters and shiny salt deposits.\nThe closest flyby may have been in October 2015, but more images will be beamed back to Earth throughout 2016.\nNew for this year will be Nasa's OSIRIS-REx mission, which will land on an asteroid called Bennu, mapping and analysing the space rock before returning a sample to Earth in 2023.\nMeanwhile, on other rocky bodies in the vicinity, the European Rosetta mission enjoyed much success last year after its Philae probe landed on spinning comet 67-P.\nHowever, after failing to respond, the probe may have given up the ghost.\nRosetta will follow its little lander to the bitter end with its own landing attempt on 67-P in September.\nRosetta continues to orbit and study duck-shaped comet 67P. The craft will follow its little lander to the bitter end with its own landing attempt on the comet planned for September\nJupiter's enormous red spot up close. A probe will reach the gas giant this year, but will need to deal with the planet's intense radiation\nJUPITER\nBeyond the asteroid belt, the Juno mission is on schedule to arrive at Jupiter by this summer.\nThe Nasa New Frontiers mission launched Juno in 2011 and has an arrival date of 5 July, where it will enter the gas giant's orbit.\nIt aims to bring back new data on the origins of the solar system's largest planet.\nBut according to Nasa, owing to the intense radiation churned out by Jupiter, the mission is expected to get a critical dosage quickly, and may only last 30 orbits of the planet before it flatlines.\nWith any luck, it will send back images of the Jovian aurora, as well as peering beneath the clouds to the deeper atmosphere and further, using gravity measurements to reveal details about the planet's core.\nWork will also continue on Esa's Jupiter icy moons explorer (Juice) mission, set for launch in 2022.\nThe mission will explore the gas giant and three of its larger moons: Ganymede, Callisto and Europa.\nThe Nasa New Frontiers mission launched Juno (illustrated) in 2011 and has an arrival date of 5 July. It aims to bring back new data on the origins of the solar system's largest planet. But according to Nasa, owing to the intense radiation churned out by Jupiter, the mission is expected to get a critical dosage quickly\nSATURN\nOut at Saturn's rings, Cassini is still going strong.\nAfter sending back key data on Enceladus - one of the contenders for microbial life in the solar system - the Nasa craft will continue this year with flybys of some of the ringed planet's smaller moons.\nThe mission will continue throughout 2016, culminating in a planned swan dive into Saturn next year.\nOut at Saturn's rings, Cassini is still going strong. The mission will continue to to send back data on some of the smaller moons during this year, before culminating in a planned swan dive into Saturn (pictured)\nCassini has sent back a wealth of data from Saturn and its moons, including this stunning shot of Earth as a pale blue dot in the distance\nTHE MOON\nThe Chinese space agency's lunar lander, Chang'e 3 and its Jade Rabbit (Yutu) rover, have just passed their second anniversary on the lunar surface.\nHowever, the technology has reportedly exceeded its life expectancy and it remains unclear how long it may last before the pilot light goes out.\nMeanwhile, Russian plans for a permanent moon base have been placed on hold.\nAccording to Russian newspaper Izvestia, the space agency has been subject to budgetary cuts, with the next manned lunar mission from Roscosmos pushed back to nearer 2030.\nReports have circulated recently that Roscosmos is to be relaunched as a state-owned corporation, and looks set to compete with SpaceX for manned space flights later this year.\nBut with China's penchant for state secrecy, surprises could be in store.\nA base on the moon? Not for a while. Russia's plans for a permanent moon base have been placed on hold. But the Chinese space agency is ramping up its activity and could launch a mission today\nProfessor Rothery explained: 'The Chinese are putting big landing packages down on the moon,'Who knows when they will put something on the moon for sample return. Once they've done that, they could put people there.'\nSpeculating on the future, he told MailOnline: 'My wild card prediction would be that in the next year or two we could see Chinese astronauts on the moon. They could pull it out of the bag and go for it.'\nPLUTO\nAfter the known planets comes our favourite hanger-on, the dwarf planet Pluto.\nPluto was the star of 2015, posing for close ups for New Horizon as we received images of the surface in unprecedented detail.\nNew Horizons' Plutonian visit was short-lived.\nBut although the probe may be long past the planetoid and on its way further out, it will continue to send back its Pluto snaps for months to come throughout 2016.\nThe next stop for New Horizons will be 2014MU69, a rocky body 21 miles (35km) across in the Kuiper belt.\nThe next stop for New Horizons will be 2014MU69, a body 21 miles (35km) wide in the Kuiper belt (pictured)\nA number of satellites are in position to monitor the solar weather through 2016, including Nasa's Soho and a suite of others, watching for changes on the sun's surface and solar wind, and sending back the data to Earth\nTHE SUN\nSolar activity has been ramping down of late, with the sun now past its peak activity of the current 11-year cycle.\nHowever, scientists warn of the increased potential for massive solar storms which could send bursts of charged particles and radiation our way during 2016.\n'It's a time at which any activity on the sun can really affect what happens on Earth, because in the climbing phase of solar activity you get more geomagnetic storms,' explained Professor Coates.\nHe told MailOnline: 'When the sun emits one of these very large coronal mass ejections, there is a chance that it will interact with Earth's magnetic field.\n'And those interactions can become more intense during the declining phase.'\nA number of satellites are in position to monitor the solar weather through 2016, including Nasa's Soho and a suite of others, watching for changes on the sun's surface and solar wind, and sending back the data to Earth HQ.\nTHE BEPICOLOMBO MISSION BepiColombo will set off to explore the composition and atmosphere of Mercury. The launch window had been scheduled for July, but hold-ups in the production of components has meant countdown has crept beyond 2016 into January. The dual mission from the European and Japanese space agencies should reach the planet by 2024. Scientists are excited as they think the data beamed back will provide an insight into the formation of the solar system's inner planets - Mercury, Venus, and Earth.\nMERCURY\nPlanetary scientists have long-awaited the dual mission from Esa and Japan's space agency Jaxa, which is destined for the solar system's innermost planet.\nBut they may have to wait a little longer.\nOne of the larger missions to come, BepiColombo, will set out to explore the composition and atmosphere of Mercury.\nDespite the planet's familiarity, it is one of the more poorly explored planets – racking up just a handful of flybys and a single orbiter.\nThe launch window had been scheduled for July, but hold-ups in the production of components has meant countdown has crept beyond 2016, to January 2017.\nBepiColombo should reach Mercury by 2024 and space agencies have aspirations that the data beamed back will provide insight into the history and formation of the solar system's inner planets – Mercury, Venus, and Earth.\nJapanese probe Akatsuki finally entered orbit around Venus (pictured) in December, after overshooting its an initial window in 2010. Nasa is also considering two further missions to explore the planet's atmosphere, but these are yet to be confirmed\nVENUS\nThe weather report from Venus remains cloudy, and 2016 is set to be comparatively quiet in relation to the other bodies of the solar system.\nJapanese probe Akatsuki finally entered orbit around Venus in December, after overshooting its initial window in 2010.\nWhile the planet is viewed as Earth's sister, she is considerably less hospitable.\nThe Jaxa probe will use infrared sensors this year to peer beneath the veil of clouds of sulphuric acid and capture data on the planet's surface.\nNasa is also considering two further missions to explore the planet's atmosphere, but these are yet to be confirmed.\nTHE SEARCH FOR LIFE BEYOND EARTH Two distant moons are the top contenders for harbouring remnants of life in the solar system beyond Earth. Enceladus (pictured left), which orbits Saturn; and Europa (right), an icy world orbiting Jupiter Aside from the possibility of methane on Mars, which could hint at a history of life, two distant moons are the top contenders for harbouring remnants of life: Enceladus, which orbits Saturn, and Europa, an icy world orbiting Jupiter. Professor David Rothery, a planetary geoscientist at the Open University, told MailOnline: 'Europa and Enceladus have to be the most exciting targets to go to. The omens are good for there being microbes there that we can sample. 'There should be microbes inhabiting those places, and we can go there and find out whether there are or not. 'If we do, then it's pretty good evidence that life has begun somewhere else independently of the Earth. 'It might have spread through the solar system, on bits of meteorite, but Earth and Europa are a long way apart, so would be great to find life on Europa. 'It's an important task being planned. We're not going to know the answer in the coming year or two, but we've certainly got the go ahead for it.'\nEARTH\nBefore we journey any further outwards, there are a number of missions occurring on, and near, Earth.\nLast year brought success as well as ratcheting up rivalry between Elon Musk and Amazon founder Jeff Bezos.\nBoth SpaceX and Blue Origin rockets successfully landed upright after short flights, beckoning the age of space tourism, lunar bases and cities on Mars, according to the aerospace firms.\nRecoverable rocket technology could drastically reduce the cost of space missions.\nIn other news, Major Tim Peake is set to return home from the ISS on 5 June.\nHowever, the future funding of the space station is being questioned.\nThe German and French space agencies, which are the biggest European backers of the space station, announced this month that they are carrying out detailed studies assessing the operating costs of the station, and whether the current level of funding is feasible.\nA further flurry of satellites are set to launch this year, and plans continue to design solutions to tackle Earth's growing problem of space trash.\nURANUS AND NEPTUNE\nIt has been 30 years since the Voyager passed this way.\nOther than the recent, if distant, wave from Nasa's New Horizons probe, all is quiet in this icy realm.\nHome sweet home: Along with reusable rockets, the space station and a suite of interplanetary missions, 2016 will see a further flurry of satellites launch. Attention will also turn to the tackling the issue of Earth's growing problem of space trash\n...AND BEYOND\nFollowing announcements earlier this month, 2016 will see astronomers will try to confirm if there is a ninth planet lurking at the edge of our planetary system or not.\nScientists in California have made their case for a planet ten times the mass of Earth, past Neptune, which could explain the pull on icy bodies in the Kuiper belt. But it is yet to be observed.\nAt the furthest reaches of the solar system are the Voyager spacecraft at more than 130 times the distance from the Earth to the sun (measured as one astronomical unit or AU).\nVoyager 1 has passed into interstellar space, outside the heliopause and the noise of the sun's radiation.\nProfessor Coates told MailOnline: '[Voyager 1] is tasting the region of space outside of that, measuring magnetic fields, energetic particles, low energy particles, and that really tells you about the boundary between the solar system and interstellar space.'\nHowever, our furthest probe it still far from the real edge of the solar system, the Oort cloud.\nGiving some sense of scale, Professor Coates explained: 'Voyager 1 is currently 134 AU away, the Oort cloud is at something like 10,000 AU.\nHe concluded: 'The solar solar system is really big, space is really big, and so we're really just looking at the very close things in our environment.'","url":"https://www.dailymail.co.uk/sciencetech/article-3410556/To-Pluto-2016-Astronomers-reveal-space-missions-excited-year-ExoMars-Jupiter-s-Juno-diving-Saturn-s-ring.html"}
