{"authors":["Associated Press"],"date_download":"2018-10-23 04:13:13","date_modify":"2018-10-23 04:13:13","date_publish":"2017-04-26 15:50:51","description":"CAPE CANAVERAL, Fla. (AP) - NASA's Cassini spacecraft ventured Wednesday into the never-before-explored region between Saturn and its rings.But flight...","filename":"data/vaneerConsumption/SpacecraftfliesbetweenSaturnandringsinhistoric1st.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/17/wire-466661-1493225455-288_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448152_Spacecraft-flies-Saturn-rings-historic-1st_1540267993.html","title":"Spacecraft flies between Saturn and rings in historic 1st","title_page":"Spacecraft flies between Saturn and rings in historic 1st | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CAPE CANAVERAL, Fla. (AP) - NASA's Cassini spacecraft ventured Wednesday into the never-before-explored region between Saturn and its rings.\nBut flight controllers won't know how everything went until Thursday when they are back in touch with the craft.\nCassini was out of radio contact with Earth as it became the first spacecraft to enter the gap between Saturn and its rings. That's because its big dish antenna was maneuvered face forward to protect science instruments from potentially damaging particles in the rings. The antenna could sustain minor damage like a small hole and still function properly, according to officials.\nThis image made available by NASA in April 2017 shows a still from the short film \"Cassini's Grand Finale,\" with the spacecraft diving between Saturn and the planet's innermost ring. Launched in 1997, Cassini reached Saturn in 2004 and has been exploring it from orbit ever since. Cassini's fuel tank is almost empty, so NASA has opted for a risky, but science-rich grand finale. (NASA/JPL-Caltech via AP)\n\"We're in a waiting period right now,\" said Jim Green, director of NASA's planetary science division. \"We won't know for a number of hours until Cassini gets in a position where it can radio back home, and so that's one of those things that keeps us on pins and needles.\"\nIf Cassini survives this first round, it will make 21 more crossings before its demise in September. The gap between Saturn's atmosphere and its rings is relatively narrow: 1,200 miles, or 1,900 kilometers.\n\"We're all crossing our fingers saying, 'Oh, geez, I hope we hear from it' - and we will,\" added guidance and control engineer Joan Stupik.\nLaunched in 1997, Cassini has been orbiting Saturn since 2004. Because the fuel tank is practically empty, NASA decided on one last dangerous, but science-rich adventure.\n___\nOnline:\nNASA: https://saturn.jpl.nasa.gov/\nThis undated photo made available by NASA shows one of Saturn's moons, Mimas, dwarfed by the planet's rings. Launched in 1997, Cassini reached Saturn in 2004 and has been exploring it from orbit ever since. Cassini's fuel tank is almost empty, so NASA has opted for a risky, but science-rich grand finale. (NASA/JPL-Caltech/Space Science Institute via AP)\nThis image made by the Cassini spacecraft and provided by NASA on March 12, 2006, shows two of Saturn's moons, the small Epimetheus and smog-enshrouded Titan, with Saturn's A and F rings stretching across the frame. Launched in 1997, Cassini reached Saturn in 2004 and has been exploring it from orbit ever since. Cassini's fuel tank is almost empty, so NASA has opted for a risky, but science-rich grand finale. (AP Photo/NASA)","url":"https://www.dailymail.co.uk/wires/ap/article-4448152/Spacecraft-flies-Saturn-rings-historic-1st.html"}
