{"authors":[],"date_download":"2018-10-22 23:37:09","date_modify":"2018-10-22 23:37:09","date_publish":"2017-03-16 07:33:14","description":"SpaceX on Thursday successfully launched a communications satellite into space from the Kennedy Space Center in Florida.The company's Falcon 9 rocket blasted...","filename":"data/vaneerConsumption/SpaceXlaunchescommunicationssatelliteintoorbit.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-227107-1489649598-312_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319126_SpaceX-launches-communications-satellite-orbit_1540251429.html","title":"SpaceX launches communications satellite into orbit","title_page":"SpaceX launches communications satellite into orbit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SpaceX is emerging as leader of the modern commercial space industry after becoming the first to send a private cargo carrier to the International Space Station in 2010\nSpaceX on Thursday successfully launched a communications satellite into space from the Kennedy Space Center in Florida.\nThe company's Falcon 9 rocket blasted off at 2 am (0600 GMT) carrying the EchoStar XXIII, a commercial communications satellite for EchoStar Corporation.\nThe satellite will be place in orbit more that 35,000 kilometers above the earth and provide telecommunications service to Brazil, SpaceX said.\nHowever SpaceX said it will not attempt to land Falcon 9's first stage after launch \"due to mission requirements.\"\nThe mission took off from NASA's historic launchpad 39A, the origin of the pioneering US spaceflights that took astronauts to the Moon in the 1960s and 1970s, as well as the space shuttle missions that ran from 1981 to 2011.\nSpaceX, founded and led by billionaire Elon Musk, is emerging as leader of the modern commercial space industry after becoming the first to send a private cargo carrier to the International Space Station in 2010.\nThe California-based company has endured two costly disasters in the past two years -- a launchpad blast that destroyed a rocket and its satellite payload in September, and a June 2015 explosion after liftoff that obliterated a Dragon cargo ship packed with provisions bound for the space station.","url":"https://www.dailymail.co.uk/wires/afp/article-4319126/SpaceX-launches-communications-satellite-orbit.html"}
