{"authors":["Associated Press"],"date_download":"2018-10-23 02:37:32","date_modify":"2018-10-23 02:37:32","date_publish":"2016-01-28 17:37:58","description":"MADRID (AP) — Spanish authorities are recommending Sevilla and third division club Cadiz should each be fined 120,000 euros ($130,000) for \"supporting and pr...","filename":"data/vaneerConsumption/SpainrecommendsfinesforSevillaandCadizoverfans.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:605348ccd8dd4052a6272b6b1821549a-4vVdYopwYQ7f641721b07afccfe0-273_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421325_Spain-recommends-fines-Sevilla-Cadiz-fans_1540262252.html","title":"Spain recommends fines for Sevilla and Cadiz over fans","title_page":"Spain recommends fines for Sevilla and Cadiz over fans | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spain recommends fines for Sevilla and Cadiz over fans\nMADRID (AP) — Spanish authorities are recommending Sevilla and third division club Cadiz should each be fined 120,000 euros ($130,000) for \"supporting and promoting\" activities of violent fan groups.\nThe government's anti-violence commission said Thursday the clubs failed to cooperate with authorities who had warned the teams about their actions favoring the groups.\nThe commission said the \"very serious\" fine to Sevilla is needed because the club failed to control the violent groups' behavior inside the Sanchez Pizjuan Stadium.\nAtletico Madrid's Juan Francisco Torres ¿Juanfran¿, left, tussles for the ball with Sevilla's Steven N¿Zonzi, center, during a Spanish La Liga soccer match between Atletico Madrid and Sevilla at the Vicente Calderon stadium in Madrid, Sunday, Jan. 24, 2016. The match ended in a 0-0 draw. (AP Photo/Francisco Seco)\nAuthorities said that in the team's game against city rival Real Betis earlier this month, two large banners promoting the violent fan groups were displayed. The banners used the by groups were different from those pre-approved by authorities ahead of the local derby, officials said.\nThe commission said the club had been warned six times about its support to the violent groups in the last two seasons, being sanctioned in 10 different occasions. The club also was denounced many times because of the fans' violent chants at the Pizjuan.\nAuthorities said Cadiz needs to be punished for giving violent fan groups a place inside its stadium to keep their banners, megaphones and other objects.\nThe commission said it told the club several times that it was not allowed to support the groups by giving them a place to use at the stadium. It said Cadiz also was punished for not providing enough security personnel to promote fan safety inside its Ramon de Carranza Stadium.\nSeparately, the commission fined Cadiz in 30,000 euros ($32,600) for not officially keeping track of fans suspected of wrongdoing. Cadiz was twice sanctioned last season for not implementing proper security measures at its stadium.\nIn a separate ruling, the commission recommended a 4,000 euro ($4,400) fine to first division team Espanyol because fans displayed banners insulting Colombian singer Shakira, wife of Barcelona defender Gerard Pique.\nThe recommendations were made to the Spanish federation's competition's committee, which will later decide whether to accept them. The teams will be allowed to appeal.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421325/Spain-recommends-fines-Sevilla-Cadiz-fans.html"}
