{"authors":["Associated Press"],"date_download":"2018-10-23 02:42:36","date_modify":"2018-10-23 02:42:36","date_publish":"2016-01-28 17:43:43","description":"BARCELONA, Spain (AP) — A prominent French whistleblower and Spanish anti-corruption activists who triggered an investigation of a former International Monet...","filename":"data/vaneerConsumption/Spainactivistswhistleblowercreatingdigitalpaysystem.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:b91132ebf99a4e68858a1b7bb6d21802-2vdWmEltwXfba0ce28e632b3c798-535_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421237_Spain-activists-whistleblower-creating-digital-pay-system_1540262556.html","title":"Spain activists, whistleblower creating digital pay system","title_page":"Spain activists, whistleblower creating digital pay system | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spain activists, whistleblower creating digital pay system\nBARCELONA, Spain (AP) — A prominent French whistleblower and Spanish anti-corruption activists who triggered an investigation of a former International Monetary Fund chief announced Thursday they are designing a digital payment system aimed at excluding middlemen companies that make money from online purchases.\nHerve Falciani and the Xnet group said their peer-to-peer payment system would work like PayPal on a local basis within European cities for citizen payments to participating businesses and governments.\nFalciani and Xnet said it will be nonprofit, with a pilot program in Italy starting in March. They said excluding online payment companies would mean savings for local consumers and businesses.\nFormer HSBC employee Herve Falciani pauses during a press conference in Barcelona, Spain, Thursday, Jan. 28, 2016. Having unmasked some of the world¿s worst tax evaders, HSBC whistleblower Herve Falciani is taking the next step in his crusade to root out financial corruption by designing a new way to spend money. With a worldwide wave of corruption probes sparked by his leaks ongoing, Falciani has teamed up with the Barcelona¿s anti-corruption group Xnet to design an alternative payment system that he says will ¿keep money local.¿ (AP Photo/Emilio Morenatti)\nFollowing a worldwide wave of ongoing corruption probes sparked by his document leaks from the HSBC bank, Falciani said he next wants to prevent online payment companies from profiting so much and transform the transactions to \"keep money local.\"\n\"There was a time for leaks, there was a time for politics, and now it is time for business,\" Falciani said at Xnet's grungy offices in downtown Barcelona.\nFalciani, seen by Xnet and other activists as a crusader, was convicted in November by a Swiss court in absentia for economic espionage for leaking documents he acquired while working for HSBC from 2006-08.\nIt sentenced him to five years in prison, but it appears unlikely he will serve time because France doesn't extradite its own citizens. Falciani had already won a case in Spain when arrested on a Swiss warrant after Spanish authorities argued he was cooperating with several European governments in tax evasion and money-laundering investigations.\nFalciani is working with Xnet and other activists groups around Europe to create the payment system inspired by experimental digital currencies like Bitcoin. But they said this service will be used to exchange any currency, and it would be focused on local businesses, endorsed by city governments, and open to audits by citizens.\n\"Each time we pay with a credit card we are charged 3-5 percent... so billions of euros reach hands that shouldn't have this money,\" Falciani said. \"Governments can't do anything to stop this because of European law, so it is up to us. This is our chance. If we don't take it over on a community level, it will all stay in the hands of the multinationals.\"\nXnet spokeswoman and co-founder Simona Levi said her group was providing much of the technical know-how to set up the open-source system.\nLevi said that Xnet would soon begin talks with public administrations in Spain to try and win their support. Their hope is to roll out the service in Spain after it gets its start in Italy.\n\"If it works in one city, others will take notice,\" Levi said.\nShe added Xnet's new project would not distract it from its role ferreting out corruption cases that have outraged Spaniards and helped generate support for two upstart political parties who had strong showings in last December's general election.\nXnet revealed documents in 2014 alleging former IMF chief Rodrigo Rato abused a company credit card while working as chief executive of Spain's Bankia bank.\nRato is now under investigation and the probe hurt the Popular Party's showing in the election because he was a prominent party member and government official for years. The election shattered Spain's traditional two-party system and the Popular Party has been unable to form a government despite winning the most votes.","url":"https://www.dailymail.co.uk/wires/ap/article-3421237/Spain-activists-whistleblower-creating-digital-pay-system.html"}
