{"authors":["Associated Press"],"date_download":"2018-10-23 00:02:43","date_modify":"2018-10-23 00:02:43","date_publish":"2016-01-29 12:44:29","description":"MADRID (AP) — Spain's Princess Cristina has lost a legal battle to avoid being tried for tax fraud and is expected to testify next month in a corruption tria...","filename":"data/vaneerConsumption/SpainPrincessloseslegalbattletoavoidtaxfraudtrial.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:12aee1f5d3954d7281f74c987fea7499-4PuZeKVXE7cd9005b2c8769e9a20-25_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422447_Spanish-princess-face-tax-fraud-trial_1540252963.html","title":"Spain: Princess loses legal battle to avoid tax fraud trial","title_page":"Spain: Princess loses legal battle to avoid tax fraud trial | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spain: Princess loses legal battle to avoid tax fraud trial\nMADRID (AP) — Spain's Princess Cristina has lost a legal battle to avoid being tried for tax fraud and is expected to testify next month in a corruption trial also featuring her husband and 16 other defendants, a panel of judges ruled Friday.\nLawyers for the sister of King Felipe VI, a prosecutor and a state attorney representing Spanish tax authorities all said earlier this month that the charges against Cristina should be thrown out because government officials agreed she committed no crimes and should face at most an administrative tax evasion fine.\nBut the three judges presiding over the case disagreed, according to a statement released by the court. They sided with an investigative judge who spent four years probing the case and ruled earlier she could be tried because of evidence presented by private anti-corruption group Manos Limpias (Clean Hands).\nFILE - In this Monday, Jan. 11, 2016, file photo, Spain's Princess Cristina arrives at a makeshift courtroom for a corruption trial, in Palma de Mallorca, Spain. A court official says Spain¿s Princess Cristina has lost her bid to avoid being tried for tax fraud in a corruption trial that also ensnared her husband and 16 others. The official says a panel of judges rejected Cristina¿s argument that she should not be tried because a prosecutor recommended she face at most administrative fines. (AP Photo/Emilio Morenatti, File)\nThat means the 50-year-old Cristina will face two counts of tax fraud carrying a maximum prison sentence of eight years for allegedly failing to declare taxes on personal expenses paid by a real estate company she owned with her husband, Inaki Urdangarin, an Olympic handball medalist turned businessman.\nAfter the decision was issued, the Royal Palace said it respects all Spanish judicial decisions but declined further comment. Cristina works for a Spanish bank in Switzerland where she lives with her family and has been excluded from royal appearances for years because of the case.\nHer lawyer, Miquel Roca, told reporters the decision was a disappointment but that Cristina received the news \"with the utmost serenity and all due respect that any judgment always deserves.\"\nShe will next appear in court on Feb. 9 when the defendants begin testifying and she is expected to be the last person to answer questions in proceedings scheduled to end by Feb. 26.\nDuring the trial, the judges will have to weigh whether the couple criminally abused the Aizoon real estate consulting firm described in court documents as a \"front company\" to fund luxury vacations, throw parties at their modernist Barcelona mansion and pay for salsa dancing classes.\nThe trial is the first time that a member of Spain's royal family has faced criminal charges since the monarchy was restored in 1975.\nUrdangarin and others face charges of embezzling up to 6.2 million euros ($6.8 million) from contracts that were allegedly inflated or never honored. The princess' husband, formerly the Duke of Palma, is accused of using his title to land the deals for the Noos Institute he ran with business partner Diego Torres.\nThe case is being heard in Palma de Mallorca, the regional capital of Spain's Balearic Islands, because many of Urdangarin's business deals under investigation were for the islands.\nCristina denied knowledge of her husband's business activities during a 2014 closed-door court appearance. But the investigative judge decided she could be tried for tax fraud allegedly committed in 2007 and 2008.\nDetails about the couple's regal lifestyle that emerged from the pre-trial investigation from 2011-2014 outraged Spaniards as the country teetered on the edge of an economic crisis and the unemployment rate hit 27 percent.\nThe case was also seen as one of the reasons for the 2014 abdication of King Juan Carlos in favor of his son Felipe.","url":"https://www.dailymail.co.uk/wires/ap/article-3422447/Spanish-princess-face-tax-fraud-trial.html"}
