{"authors":[],"date_download":"2018-10-22 20:37:43","date_modify":"2018-10-22 20:37:43","date_publish":"2014-06-02 16:03:05","description":"The king's son will take the throne following his decision to step down - but some Spaniards would favor a republic to lead their battered economy.","filename":"data/vaneerConsumption/SpainAsksWhatNextAfterAbdicationofKingJuanCarlos.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/481716/140602felipe-juan-carlos-jsw-1204p_acb5aae5b021ca4411be2373cf646f05.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_spain-asks-what-next-after-abdication-king-juan-carlos-n120346_1540240663.html","title":"Spain Asks 'What Next?' After Abdication of King Juan Carlos","title_page":"Spain Asks 'What Next?' After Abdication of King Juan Carlos ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSpain's King Juan Carlos I was championed decades ago for leading his country away from dictatorship and into democracy.\nBut after he announced Monday that he was stepping down from the throne — following a string of scandals, health concerns and economic catastrophe — many Spaniards were looking beyond his son and heir for their next head of state, many of them demanding their country become a republic with no monarchy at all.\nJuan Carlos acknowledged this dissatisfaction when announcing his decision to hand the throne to his son, 46-year-old Crown Prince Felipe, promising in a televised address that it would \"open a new era of hope.\"\n\"A new generation is quite rightly demanding to take the lead role,\" he said.\nBut for the country with an unemployment rate of more than 25 percent, the gesture rang hollow, according to Matthew Bennet, editor of thespainreport.com. Just hours after the king's announcement, anti-monarchy groups were planning marches in dozens of towns and cities across Spain on Monday evening.\nGalvanized by the king's historic move, they were demanding a referendum to decide whether to do away with their royal rulers.","url":"https://www.nbcnews.com/news/world/spain-asks-what-next-after-abdication-king-juan-carlos-n120346"}
