{"authors":["Associated Press"],"date_download":"2018-10-23 00:50:07","date_modify":"2018-10-23 00:50:07","date_publish":"2016-01-28 14:57:25","description":"MADRID (AP) — Spain's unemployment rate edged down to 20.9 percent in the fourth quarter from 21.2 percent the previous quarter, at the end of a year when th...","filename":"data/vaneerConsumption/SpainsjoblessratedropsinQ4afterrecordannualfall.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420537_Spains-jobless-rate-drops-Q4-record-annual-fall_1540255807.html","title":"Spain's jobless rate drops in Q4 after record annual fall","title_page":"Spain's jobless rate drops in Q4 after record annual fall | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spain's jobless rate drops in Q4 after record annual fall\nMADRID (AP) — Spain's unemployment rate edged down to 20.9 percent in the fourth quarter from 21.2 percent the previous quarter, at the end of a year when the number of jobless fell by a record amount, the National Statistics Institute said Thursday.\nThe institute said the number of people out of work dropped by 71,300 in the October-December period to a rounded total of 4.8 million. Over the year, the number of people without work dropped by a record 678,200.\nThe incumbent ruling Popular Party had hoped its record on creating jobs could help it stay in office but so far it has failed to muster the necessary support from other parties following an inconclusive election Dec. 20.\nThe institute said 525,100 jobs were created in 2015, below the 600,000 figure promised by the government.\nThe Popular Party won most seats in the election but failed to garner a majority. If it cannot obtain sufficient outside support, another party may be called on to form government.\nThe statistics institute said the jobless rate for people under 25 years of age edged down to 46.2 percent from 46.6 percent in the third quarter.\nUnemployment shot up in Spain as of 2008 due to the global financial crisis, but the economy started growing solidly in 2014.\nThe country is now the European Union's leading job-creator, although its unemployment rate remains the second highest in the 28-country bloc after Greece.","url":"https://www.dailymail.co.uk/wires/ap/article-3420537/Spains-jobless-rate-drops-Q4-record-annual-fall.html"}
