{"authors":[],"date_download":"2018-10-22 23:24:05","date_modify":"2018-10-22 23:24:05","date_publish":"2014-09-19 00:00:00","description":"Catalans see the Scottish independence referendum as an exercise of democracy that they've been denied. The Spanish government sees it as a threat.","filename":"data/vaneerConsumption/SpainTriesToTampDownCataloniasSeparatistMovement.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=349756468_1540250645.html","title":"Spain Tries To Tamp Down Catalonia's Separatist Movement","title_page":"Spain Tries To Tamp Down Catalonia's Separatist Movement : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nNow the lively contest in Scotland stirred hope for other separatist movements across Europe. They include Catalonia, the northeast region of Spain, which plans its own independence vote in November. The region's capital is Barcelona, which is where we find reporter Lauren Frayer.\n(SOUNDBITE OF BAGPIPES PLAYING)\nLAUREN FRAYER, BYLINE: The bar's stereo blasts Scottish bagpipes. Customers swill scotch, and the cook is hard at work.\nXAVI: Hi, my name is Xavi. I'm cooking a typical, traditional Scottish food. It is haggis. Yeah, it's a belly - yeah, it's a belly of a goat - a sheep. It's full of liver and heart, and I don't know...\nFRAYER: The haggis prep is briefly interrupted by drink orders from a customer draped in tartan plaid. But this is Barcelona, not Edinburgh. And the guy in plaid is Spanish, or rather Catalan, Gabriel Herredero.\nGABRIEL HERREDERO: And I'm wearing the typical - I guess it's called a kilt. I did it myself, actually. This is a dress I did.\nFRAYER: Tell me why you're wearing this. What...\nHERREDERO: Just for one day, I would like to be Scottish. The Scottish people are able to vote, and in Catalonia, we can't.\nFRAYER: Catalonia has its own language and culture, and has long sought autonomy from Spain. Catalan leaders have called for their own independence vote November 9th. But the Spanish government calls that illegal and vows to block it at all costs. As the polls close in Scotland, the bar man turns on the TV, and the crowd cheers for Scottish and Catalan independence.\n(SOUNDBITE OF CHANTING)\nUNIDENTIFIED CROWD: (Chanting in foreign language).\nFRAYER: But by dawn, the whiskey has worn off. And it's clear Scotland will stay in the U.K., though activist Carme Forcadell says the referendum itself was a victory.\nCARME FORCADELL: We think that independent of the result, the Scottish people have won because they can vote. They can decide their future.\n(SOUNDBITE OF INDEPENDENCE MARCH)\nUNIDENTIFIED ACTIVISTS: (Chanting in foreign language).\nFRAYER: Last week, 18 million people took to the streets of Barcelona, demanding that Catalonia get the same rights as Scotland and be allowed to vote.\nPRESIDENT ARTUR MAS: We admire the high-quality democratic system existing in the United Kingdom. If I had to choose, it is much better - the British one - than the Spanish one.\nFRAYER: Catalan President Artur Mas says it's the act of voting that's important.\nMAS: For us, it is more important, the concept of the referendum - so the right to decide our political future - than the concept of independence. The key point is, do we have the right to decide our political future, yes or no?\nFRAYER: The Spanish Constitution says no. Any referendum must be voted upon by all of Spain, not just one region. The government in Madrid is threatening to suspend the Catalan regional government if it goes ahead with the November vote.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRIME MINISTER MARIANO RAJOY: (Spanish Spoken).\nFRAYER: Scotland and Catalonia are trying to torpedo the Europe, Mariano Rajoy told Parliament this week. Everyone in Europe thinks this is very negative - not everyone in Catalonia, however. On the heels of Scotland's peaceful vote, the Catalan Regional Parliament plans to approve a law later today declaring a November 9th vote on independence from Spain. The Spanish government has called an emergency cabinet meeting for the weekend. For NPR News, I'm Lauren Frayer in Barcelona.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=349756468"}
