{"authors":["Bill Chappell"],"date_download":"2018-10-22 23:23:50","date_modify":"2018-10-22 23:23:50","date_publish":"2014-09-29 00:00:00","description":"Spain's central government in Madrid had appealed to the court to stop the vote, which had been approved with strong support from Catalonia's parliament and local governments.","filename":"data/vaneerConsumption/SpanishCourtBlocksCataloniasIndependenceVote.json","image_url":"https://media.npr.org/assets/img/2014/09/29/catalonia-spain_wide-7538a69ea9e69dcf6dee01e88226606ef03915c6.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_09_29_352545972_spanish-court-blocks-catalonia-s-independence-vote_1540250630.html","title":"Spanish Court Blocks Catalonia's Independence Vote","title_page":"Spanish Court Blocks Catalonia's Independence Vote : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Spanish Court Blocks Catalonia's Independence Vote\nEnlarge this image toggle caption Josep Lago/AFP/Getty Images Josep Lago/AFP/Getty Images\nTwo days after the region's president announced a November vote on whether Catalonia should break away from Spain, the nation's highest court has suspended that plan, making it illegal to continue organizing the referendum. It's not clear whether the region's leaders will abide by the ruling.\nSpain's central government in Madrid had appealed to the court to stop the vote, which was approved with strong support from Catalonia's parliament and local governments. In accepting the appeal today, the court automatically suspended the referendum.\nFrom Madrid, NPR's Lauren Frayer reports:\n\"Catalonia's parliament and president have already set a Nov. 9 vote on independence from Spain. They've outlined rules, and are setting up polling stations.\n\"But Spain's central government says the vote is illegal. And the country's Constitutional Court has now backed that claim, suspending Catalonia's plans while it weighs their legality.\n\"'It's not illegal,' Catalan President Artur Mas said in a televised statement. He suggested the vote would still be held.\n\"Meanwhile, pro-independence protesters have flocked to the streets of the Catalan capital, Barcelona.\"\nEarlier Monday, Spain's Prime Minister Mariano Rajoy said the poll isn't allowed under the country's constitution. which doesn't allow regions to opt out. He said that he was defending the rights of all Spaniards, including Catalans.\n\"Nothing and nobody, whether power or institution, can break this principle of single and indivisible sovereignty on which our coexistence is based,\" Rajoy said, according to Euronews. \"In other words, no one person or group has the right to deprive all the Spanish people of the right to decide what their country is.\"","url":"https://www.npr.org/sections/thetwo-way/2014/09/29/352545972/spanish-court-blocks-catalonia-s-independence-vote"}
