{"authors":["Frances Martel"],"date_download":"2018-10-30 20:48:24","date_modify":"2018-10-30 20:48:24","date_publish":"2015-02-03 17:09:00","description":"Spanish Budget Minister Cristobal Montoro has categorically rejected any attempts to \"change the rules\" regarding austerity measures imposed on Greece by European Union regulations. \"Europe is a club of democracies, and entering is voluntary,\" he stated, implying that, should Greece's new government refuse to impose austerity measures, they can leave the EU. |","filename":"data/vaneerConsumption/SpanishBudgetMinistertoGreeceRespectEUAusterityRulesAsWeDid.json","image_url":"https://media.breitbart.com/media/2015/01/Tsipras_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_03__1540932504.html","title":"Spanish Budget Minister to Greece: Respect EU Austerity Rules 'As We Did'","title_page":"Spanish Budget Minister to Greece: Respect EU Austerity Rules 'As We Did' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Spanish Budget Minister Cristobal Montoro has categorically rejected any attempts to “change the rules” regarding austerity measures imposed on Greece by European Union regulations. “Europe is a club of democracies, and entering is voluntary,” he stated, implying that, should Greece’s new government refuse to impose austerity measures, they can leave the EU.\n“Joining Europe is voluntary, and we belong to that club on the condition we respect the club’s rules, because it is in everyone’s interest we do so,” Montoro said, speaking to public television channel TVE. He insisted that Europe is not any one institution– “not the European Commission, nor the European Central Bank”– but the states on the continent, “and we are the ones who establish the rules.”\nThe harsh call on behalf of the senior Spanish statesman follows elections in Greece in which the Coalition of the Radical Left (Syriza), led by anti-austerity leftist leader Alexis Tsipras, took power. Prime Minister Tsipras’ government has already refused to negotiate with the European Union or the IMF on his anti-austerity measures, and is now sending representatives to various European states in order to convince EU nations to support their call for a renegotiation on the multiple bailout packages that has kept their economy afloat, the first in 2010. Both the EU and IMF have warned that they will not continue to give Greece money should Tsipras approve extensive spending packages that defy the austerity deal.\nMontoro, who belongs to Spain’s center-right Popular Party, also said in the TVE interview that electing Syriza leaders was a “turn down a wrong path” for Greece. He also expressed little patience for the nation’s apparent inability to pay back the debt, stating that Greece must pay “as we all have.” Spain exited its EU bailout program in 2013.\nThe strong language against any special accommodations for Greece follows not only Tsipras and company’s rebuttals on negotiation, but a push by the far left in Spain to topple the Popular Party and install their version of Syriza: Podemos, a radical left party organized by Iranian TV show host Pablo Iglesias calling for similar spending splurges as Syriza.\nPodemos organized a rally this Saturday in Madrid’s Cibeles Plaza to capitalize on Syriza’s momentum, after publicly congratulating their Greek analogs. Chanting “yes we can,” tens of thousands of Podemos supporters organized to call for a new government that would spend lavishly on social programs– defying EU protocol after bailouts– to help the nation’s unemployed. In interviews with The Guardian, many of those participating in the rally expressed frustration with political elites and a populist demand for grassroots government, with one person stating that “Greece gives us hope.” Podemos faces numerous challenges that Syriza did not, however: a more robust economy (which translates to fewer desperate voters) and election laws that are less favorable to minority parties.","url":"https://www.breitbart.com/national-security/2015/02/03/spanish-budget-minister-to-greece-respect-eu-austerity-rules-as-we-did/"}
