{"authors":["Gerard Couzens For The Mailonline"],"date_download":"2018-10-23 02:45:58","date_modify":"2018-10-23 02:45:58","date_publish":"2017-03-16 13:19:45","description":"Jose Antonio walked into the salon with grey unkempt hair and a straggly dirty beard which bore the ravages of 25 years on the streets - and came out looking like a stylish man-about-town.","filename":"data/vaneerConsumption/Spanishhomelessmanundergoesincredibletransformation.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5464EB00000578-0-image-a-30_1489670355742.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319576_Homeless-Spanish-man-s-INCREDIBLE-transformation_1540262758.html","title":"Spanish homeless man undergoes incredible transformation","title_page":"Spanish homeless man undergoes incredible transformation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A scruffy homeless man broke down in tears after seeing how he has been turned into a hipster at an upmarket Spanish hair salon.\nJose Antonio was offered the dramatic makeover by the salon owner who knew him from his day job working as an unlicensed car parking attendant to earn enough money for food.\nHe walked into the salon with grey unkempt hair and a straggly dirty beard which bore the ravages of 25 years on the streets - and came out looking like a stylish man-about-town.\nAs he was: Jose Antonio, who has been homeless for 25 years, walked into the salon with grey unkempt hair and a straggly dirty beard\nJose was a regular sight at the town square in Majorca\nJose Antonio was offered the dramatic makeover by the salon owner who knew him from his day job working as an unlicensed car parking attendant to earn enough money for food\nThe change was so great a local bar owner served him a beer on a terrace at the square in Majorca where he spends his days helping car drivers find spaces and looking after their vehicles while they're gone, without realising it was him.\nThe 55-year-old also caught the eye of several female admirers with his manicured look and stylish clothes.\nLast night the video - made by film producer Dr Filmgood and posted on hair salon La Salvajeria's Facebook page to coincide with the salon's third birthday - was going viral.\nHis hair and beard were trimmed, and he was virtually unrecognisable by the time his treatment was finished\nThe 55-year-old was transformed into a stylish man-about-town at the salon\nFormer electrician Jose Antonio, who lost his way in life and ended up homeless after suffering depression, is shown sitting at a chair in front of a mirror before his makeover, telling the cameraman: 'Leave the doors over the mirror open for the moment so I can see myself for the last time like this.\n'Then close them to see if when they open again, it's as if something else really opened up in my life, like a symbol.'\nHis emotions got the better of him when he was shown the result, tears flowing down his cheeks as he gasps: 'F***, My God, this is incredible, is this me? I'm so different, no-one's going to recognise me unless I tell them who I am.'\nThe video was shot in the Majorcan capital Palma in July 2015 but has only gone viral in the last few days after its release for the first time\nA video of the transformation has been widely viewed after being posted on Facebook\nThe cameras followed him as he donned a pair of designer shades and stepped out onto the streets of the neighbourhood where everyone knows him by his nickname of Josete dressed in an immaculate white shirt and red drainpipe trousers.\nA couple of women stopped to compliment him on his looks as other locals let in on the secret of who he was showed their astonishment.\nHe ordered a beer at a terrace bar next to where he spends most of his days, laughing as the waiter walked away without recognising him before revealing his true identity. One local couldn't resist asking him: 'Where's your Ferrari, mate?'\nJose Antonio was overcome with emotion after seeing his new look in the mirror\nHe looked completely different after the makeover, which saw his scraggly locks chopped off and his hair dyed black\nThe video was shot in the Majorcan capital Palma in July 2015 but has only gone viral in the last few days after its release for the first time.\nJose Antonio, who is now clean-shaven and has retained a healthier look although he has got his grey hair back, is still looking for work.\nHe is off the streets now and admitted today in an interview with a Spanish TV station, where hair salon owner Salva Garcia revealed Jose Antonio had received financial assistance from a company which wished to remain anonymous: 'It wasn't just a change of look. It changed my life. What I want now is a proper job.'\nHipster: One local said of the video: 'He's a wonderful person and the video is amazing'\nHe donned a pair of shades as he walked onto the streets to show off his new image\nGraciela Aguero, an Argentinian who saw the video of the transformation after the footage reached South America: 'I became so emotional when I saw his smile.\n'God wants to change his life just like he does his appearance.'\nLocal Paola Bocardo added: 'I'm lost for words. Jose helps me to park my car every day. When we saw him after his makeover we didn't recognise him. He's a wonderful person and the video is amazing.'\nLocals who saw him around every day could not believe their eyes","url":"https://www.dailymail.co.uk/news/article-4319576/Homeless-Spanish-man-s-INCREDIBLE-transformation.html"}
