{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 18:11:32","date_modify":"2018-10-30 18:11:32","date_publish":"2017-04-05 07:26:20","description":"Paul Ryan moved $7 million from his own fundraising committee to his joint account with the National Republican Congressional Committee.","filename":"data/vaneerConsumption/SpeakerPaulRyanDrops7MilliononHouseGOPCampaignFundBrings2017Totalto164Million.json","image_url":"https://media.breitbart.com/media/2017/04/ryano.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_04_05__1540923092.html","title":"Speaker Paul Ryan Drops $7 Million on House GOP Campaign Fund, Brings 2017 Total to $16.4 Million","title_page":"Speaker Paul Ryan Drops $7 Million on House GOP Campaign Fund, Brings 2017 Total to $16.4 Million","title_rss":"NULL","source_domain":"breitbart.com","text":"Speaker of the House Paul Ryan (R-WI) announced Tuesday he moved $7 million from his own political fundraising committee to his joint account with the National Republican Congressional Committee, the fundraising arm of House Republicans.\n“A year and a half ago, Paul Ryan became speaker with virtually no political infrastructure, since then, he has established a national political operation that can be put up against anyone else,” said Kevin Seifert, the speaker’s top political adviser, who also served as Ryan’s chief of staff when Ryan was the chairman of the Ways and Means Committee.\n“Team Ryan was built around the Speaker’s focus on policy and his ability to articulate a positive, conservative vision for America,” he said.\n“This remains the focus and in the early part of 2017, Ryan has been humbled by the interest in the Republican agenda – to enact bold reforms and get our country back-on-track,” said Seifer, the executive director of Team Ryan. “This continues to be a motivating force for our supporters across the country.”\nRyan has transferred close to $60 million to the NRCC, since he became speaker Oct. 29, 2015.\nTeam Ryan is Ryan’s federal Joint Fundraising Committee and his national political organization, including Ryan for Congress, Inc., Prosperity Action PAC, Inc. & the National Republican Congressional Committee.\nThe team raises money for the speaker’s campaign in his own district, Wisconsin-1, as well as contributing to other Republican candidates for Congress.\nTeam Ryan is separate from the Congressional Leadership Fund, the political action committee Ryan runs to support his own allies in the House Republican Conference. The CLF has also been used to run ads against House conservatives, such as members of the House Freedom Caucus.","url":"https://www.breitbart.com/politics/2017/04/05/speaker-paul-ryan-drops-7-million-on-house-gop-campaign-fund-brings-2017-total-to-16-4-million/"}
