{"authors":["Neil Munro"],"date_download":"2018-10-30 19:03:53","date_modify":"2018-10-30 19:03:53","date_publish":"2016-12-07 19:01:46","description":"GOP leaders, including House Speaker Paul Ryan, have quietly ended an unpopular 2015 program to outsource another 198,000 blue-collar jobs to lower-paid foreign workers. | Politics","filename":"data/vaneerConsumption/SpeakerRyanRetreatsonH2BVisaOutsourcingProgram.json","image_url":"https://media.breitbart.com/media/2016/05/Donald-Trump-and-Paul-Ryan.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_07__1540926233.html","title":"Speaker Ryan Retreats on H-2B Visa Outsourcing Program","title_page":"Speaker Ryan Retreats on H-2B Visa Outsourcing Program | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP leaders, including House Speaker Paul Ryan, have quietly ended an unpopular 2015 program to annually outsource another 198,000 blue-collar jobs to lower-paid foreign workers.\nThe quiet reversal by Ryan comes as President-elect Donald Trump moves forward with his very popular campaign promises to curb outsourcing of U.S. jobs via legal and illegal immigration, free-trade and guest-worker programs.\nThe new 2017 budget document, dubbed the “Continuing Resolution,” does not include a provision created in December 2015 by Ryan which allowed companies to outsource up to 198,000 extra jobs to foreign workers via the so-called “H-2B” guest worker program. The low-wage workers are not immigrants, but return to their homes after 10 months.\n“We’re going to have to regroup,” said Joe Bacigalupo, a government advocacy manager at the National Thoroughbred Racing Association, which favored the job outsourcing program. The new budget continues to late April, giving the various employer associations another chance to lobby for a revival of the Ryan expansion, he told Breitbart News.\nThe long-standing H-2B program allows companies to annually bring in 66,000 foreign workers instead of hiring Americans. The program provides the companies with cheap seasonal workers, minimizes the need for companies to recruit and train Americans, and it also cuts the salaries paid to full-time American workers, say advocates.\nRyan’s December 2015 language expanded the visa program by saying that foreign H-2B workers would not count towards the annual 66,000 limit if they had worked for a H-2B employer during the prior three years. In effect, the “returning worker exemption” covertly quadrupled the size of the H-2B program from 66,000 visas per year up to 264,000 visas per year. That is an increase of up to 198,000 outsourcing visas each year.\nThe H-2B visa program is one of many guest-worker programs — including the white-collar H-1B, OPT and L-1 visa programs, the J-1 summer-worker programs and the H-2A agriculture program – that import at least 700,000 guest workers each year. The programs are so large that at least 1 million white-collar guest-workers live and work year-round in the United States.\nThe December 2015 expansion was buried in the budget bill for 2016. The overall bill was such a victory for Democrats that they gloated that Ryan “gave away the store.”\nBreitbart described the 198,0000 increase as Ryan’s “Pink-Slip Plan,” and as a quadrupling of the program.\nIn response to critical coverage of his outsourcing program, Ryan complained about the media coverage and defended the 198,000-job expansion. “There’s one provision that I think has been so misconstrued… which is the H-2B visa program,” he told radio-host Hugh Hewitt Dec. 21. “This is a very small provision that was passed in the Homeland Security Appropriations bill last July,” he told Hewitt.\n“There has been so much hyperbole about this one provision pinging around the Internet, but that’s the problem with omnibus appropriations,” Ryan told radio host Bill Bennett Dec. 22. “Big legislation leads to lots of confusion, lots of misinformation. It doesn’t quadruple the [H-2B] program,” he said.\n“According to the Congressional Budget Office, it would result in less than 10,000 temporary workers coming to America next year,” Ryan told Bennett.\nRyan was proved wrong.\nYear-end data from the Department of Labor showed that companies were able to import up to 119,232 H-2B workers, or roughly 50,000 extra workers, under Ryan’s supposed 10,000-job expansion. “Nationwide, thousands of employers won permission to hire more than 119,000 workers through the H-2B visa program for 2016-17,” according to an analysis by the Palm Beach Post of data at the Department of Labor.\nIf expansion had continued into 2017, that 50,000 increase likely would have jumped again in 2017, because few companies were ready to use the sudden 2015 expansion.\nAfter approvals by the labor department, the Department of State provided H-2B visas to at least 84,626 foreign workers — plus at least 134,367 H -2A agriculture workers — during the 2016 fiscal year, the department told Breitbart. The Department of Homeland Security refused to tell Breitbart how many H-2B visa-holders it admitted into the country from October 2015 to the end of Sept. 2016.\nRyan’s office declined to comment for this article.\nRyan is a pro-business libertarian, who has long supported job outsourcing programs that would allow companies to hire foreign workers when American employees demand higher wages. Ryan has even supported the large-scale use of immigrant labor at government-set wages so that companies don’t have to invest in American-made robot technology, such as cow-milking machines, despite a massive level of hidden unemployment and a resulting drug epidemic.\nEven after Trump’s victory, and many Democrats’ public insistence that they gain from the nation’s high-immigration/low-wage economy, Ryan has not changed his public support for a cheap-labor national economic strategy, which was used against him in his 2016 primary battle.\nSince 2009, Ryan’s support for guest-workers has allowed President Barack Obama to gradually increase the inflow of white-collar and blue-collar guest-workers, from roughly 650,000 in 2009 to at least 750,000 in 2015. Obama has also awarded temporary work-permits to at least 1 million foreign migrants.\nMost of Ryan’s extra 50,000 H-2B visas in 2016 were snapped up by the landscaping industry, but some were also grabbed by construction firms eager to outsource skilled union jobs to low-wage countries.\nThe H-2B system is a a first-come, first-served process, so industries that have difficulty hiring workers — such as the shrimp-fishing industry, which send boats and trained crews out for weeks at a time — can’t get priority over the landscaping industry, which serves corporate customers in urban and suburban areas.\n“It is not really any time to comment on that,” Bacigalupo said.\nA horse-industry newspaper, the Thoroughbred Daily News, reported on executives’ reaction to news that the program would be limited to 66,000 foreign workers in 2017.\n“They can continue to use the H-2B program,” said Alex Waldrop, president of the Thoroughbred Racing Association. “They are just going to be using it subject to the 66,000 visa cap. They need to be proactive in putting in their applications for H-2B workers as soon as possible. They cannot delay, because there will be extraordinary competition [from other industries] for that limited number of H-2B workers.”\nIf the program is limited to 66,000 foreign workers, horse trainers “are going to be forced into the very bad decision to either hire undocumented workers or not have the staff to handle the horses,” Waldrop reportedly said.\nExecutives could offer higher wages to attract American workers, another executive suggested. The loss of easy access to migrant workers “means an increased overall payroll budget [and] a shortage of staff, which could then lead to a shortage of horses that could be in that stable,” said Eric Hamelback, chief executive officer for the National Horsemen’s Benevolent and Protective Association\nUnder Obama, the federal government annually imports at least one million legal immigrants, plus almost one million temporary white-collar guest workers and blue-collar guest workers for jobs sought by Americans. Those two million new foreign workers — plus the roughly eight million illegal immigrants in jobs — compete against the four million young Americans who begin looking for jobs each year. That wage-cutting competition shifts roughly $500 billion per year from wages and salaries into company profits, boosting investors and Wall Street, but reducing productivity growth and creating a huge population of government-dependent poor people in the United States.\nIn March 2016, Trump promised to protect Americans from the guest worker programs, such as the H-1B program, which outsources at least 650,000 white-collar jobs to foreign guest workers living in the United States: “I will end forever the use of the H-1B as a cheap labor program, and institute an absolute requirement to hire American workers first for every visa and immigration program,” he said “No exceptions.”\nIn August 2016, Trump laid out his pro-American immigration policy in an Arizona speech:\nThe truth is, our immigration system is worse than anyone realizes. But the facts aren’t known because the media won’t report on them, the politicians won’t talk about them, and the special interests spend a lot of money trying to cover them up. Today you will get the truth. The fundamental problem with the immigration system in our country is that it serves the needs of wealthy donors, political activists and powerful politicians. Let me tell you who it doesn’t serve: it doesn’t serve you, the American people. When politicians talk about immigration reform, they usually mean the following: amnesty, open borders, and lower wages. Immigration reform should mean something else entirely: it should mean improvements to our laws and policies to make life better for American citizens. … most illegal immigrants are lower-skilled workers with less education who compete directly against vulnerable American workers, and that these illegal workers draw much more out from the system than they will ever pay in… We will turn off the jobs and benefits magnet. We will ensure that E-Verify is used to the fullest extent possible under existing law, and will work with Congress to strengthen and expand its use across the country. Immigration law doesn’t exist just for the purpose of keeping out criminals. It exists to protect all aspects of American life – the worksite, the welfare office, the education system and much else. That is why immigration limits are established in the first place. If we only enforce the laws against crime, then we have an open border to the entire world. … The time has come for a new immigration commission to develop a new set of reforms to our legal immigration system in order to achieve the following goals … [including] to establish new immigration controls to boost wages and to ensure that open jobs are offered to American workers first.\nRead the full text here.\nFollow Neil Munro on Twitter @NeilMunroDC or email the author at NMunro@Breitbart.com.","url":"https://www.breitbart.com/politics/2016/12/07/ryan-ends-h2b-expansion/"}
