{"authors":[],"date_download":"2018-10-30 21:08:18","date_modify":"2018-10-30 21:08:18","date_publish":"2018-10-30 16:02:51","description":"The Office of Special Counsel Robert Mueller said Tuesday that it had referred to the FBI allegations that conservative activists had tried to pay money to women to get them to falsely claim that they had been sexually assaulted by Mueller, who is investigating Russian interference in the 2016 elect...","filename":"data/vaneerConsumption/SpecialCounselasksFBItoinvestigateschemeagainstMueller.json","image_url":"https://cmgajcjamiedupree.files.wordpress.com/2018/10/mueller11.jpg?w=122","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/jamiedupree.blog.ajc.com/2018_10_30__1540933698.html","title":"Special Counsel asks FBI to investigate scheme against Mueller","title_page":"Special Counsel asks FBI to investigate scheme against Mueller | Jamie Dupree - AJC","title_rss":"NULL","source_domain":"ajc.com","text":"View Caption Hide Caption\nThe Office of Special Counsel Robert Mueller said Tuesday that it had referred to the FBI allegations that conservative activists had tried to pay money to women to get them to falsely claim that they had been sexually assaulted by Mueller, who is investigating Russian interference in the 2016 elections, and any ties to the Trump Campaign.\n“When we learned last week of allegations that women were offered money to make false claims about the Special Counsel, we immediately referred the matter to the FBI for investigation,” said Peter Carr, a spokesman for the Special Counsel’s office.\nA series of reporters came forward Tuesday to say they had been sent information over the last two weeks about Mueller, but found the evidence to be lacking.\n2 weeks ago, I, along with other journalists were set an email from a woman who alleged that she was a former colleague of Mueller. She said that Jack Burkman, via an intermediary, offered her tens of thousands to make up sexual assault claims against Mueller. — Scott Stedman (@ScottMStedman) October 30, 2018\n13 days ago I received this tip alleging an attempt to pay off women to make up accusations of sexual misconduct against Special Counsel Bob Mueller. Other reporters received the same email. Now the Special Counsel's office is telling us they've referred the matter to the FBI pic.twitter.com/oqh4Fnel5u — Yashar Ali 🐘 (@yashar) October 30, 2018\nJust re-upping. It's baloney. They can serve whatever they want, but we don't have to bite. https://t.co/nsldVB9Fpl — Jane Mayer (@JaneMayerNYer) October 30, 2018\nBurkman is a GOP operative who in the past had pressed questions about the murder of DNC employee Seth Rich; Wahl is a young conservative activist.\nIn posts on Twitter and Facebook, Burkman said he was going to reveal information on Thursday about “Mueller’s sex assault victims.”\nThe Atlantic reported Tuesday that one woman said she was offered $20,000 to fabricate claims against Mueller.\nNew from me + @brandyzadrozny + @tom_winter: A company called “Surefire Intelligence” has ties to this Mueller smear. Jacob Wohl denied having ties to Surefire. Surefire’s official phone number redirects to a voicemail box registered to Jacob's mom.https://t.co/aVPzVDjGR4 — Ben Collins (@oneunderscore__) October 30, 2018\nWohl denied the allegations in a post on Twitter.\nThe MSM has launched a coordinated smear campaign against me, claiming that I offered money to a woman to make accusations against Mueller? Their claims are BASELESS! Who is this \"woman\"? — Jacob Wohl (@JacobAWohl) October 30, 2018\nMeanwhile – as amplified by Wohl on Twitter – conservative websites like Gateway Pundit jumped on the Mueller accusations, as well.","url":"http://jamiedupree.blog.ajc.com/2018/10/30/special-counsel-asks-fbi-to-investigate-scheme-against-mueller/"}
