{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 22:01:35","date_modify":"2018-10-30 22:01:35","date_publish":"2017-04-10 07:47:02","description":"Writing for the Spectator Sunday, Damian Thompson said the twin bombings of churches in Egypt on Palm Sunday was an attack on Christianity.","filename":"data/vaneerConsumption/SpectatorEgyptsPalmSundayMassacreWasAttackonChristianity.json","image_url":"https://media.breitbart.com/media/2017/04/attack-in-egypt.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_10__1540936895.html","title":"Spectator: Egypt’s Palm Sunday Massacre Was ‘Attack on Christianity’","title_page":"Spectator: Egypt’s Palm Sunday Massacre Was ‘Attack on Christianity’","title_rss":"NULL","source_domain":"breitbart.com","text":"Writing for the Spectator magazine on Sunday, Damian Thompson pointed out that the twin bombings of churches in Egypt on Palm Sunday constituted a religiously motivated attack on Christianity that must be recognized and dealt with as such.\nThompson took issue with a tweet by a spokesman for the Egyptian ministry of foreign affairs that the Palm Sunday massacres were “another obnoxious but failed attempts against all Egyptians.”\nTerrorism hits Egypt again, this time on Palm Sunday. Another obnoxious but failed attempt against all Egyptians #united_on_PalmSunday — Egypt MFA Spokesman (@MfaEgypt) April 9, 2017\nThe attacks, which killed 49 and left more than 100 injured, were not “against all Egyptians,” Thompson notes, but directed specifically to Christian in their houses of worship, precisely to avoid any ambiguity regarding the intent. This was rather “an attack on Christians simply because they are Christians,” he noted.\nThompson said that calling Sunday’s attacks an assault on “all Egyptians” would be like calling Boko Haram’s relentless slaughter of Christians an assault against “all Nigerians.” It simply isn’t the case.\nThe Spectator article points out something that should be obvious, but too often is brushed over or manipulated to look like something else. The people committing the massacre were Islamist radicals acting in the name of Allah and their attack targeted Christians in the act of worshiping God on the morning when Jesus Christ’s triumphal entry into Jerusalem is commemorated.\nFrustrated with the West’s misinterpretation of their motives, representatives of the Islamic State—which claimed responsibility for Sunday’s slaughter—produced a special issue of their propaganda magazine Dabiq last summer to disabuse Westerners of their misconceptions of jihad.\nThe issue, titled “Break the Cross,” intended to correct the “false narrative” about Islam, furnishing a litany of reasons “why we hate you and why we fight you.”\nThe list began with the most serious crime of the West: its failure to embrace Islam and convert. Christianity is blasphemy and an offense against Allah, the jihadists asserted, one which is punishable by death. The text stated:\nWe hate you, first and foremost, because you are disbelievers; you reject the oneness of Allah – whether you realize it or not – by making partners for Him in worship, you blaspheme against Him, claiming that He has a son, you fabricate lies against His prophets and messengers, and you indulge in all manner of devilish practices.\n“Furthermore, just as your disbelief is the primary reason we hate you, your disbelief is the primary reason we fight you, as we have been commanded to fight the disbelievers until they submit to the authority of Islam,” the authors added.\n“So in the end, you cannot bring an indefinite halt to our war against you. At most, you could only delay it temporarily,” they wrote.\nIslamic State representatives took special offense at Pope Francis’ claims that their war was not being waged for religious motives, assuring the pontiff that their sole motivation is religious and sanctioned by Allah in the Qur’an.\nISIS criticized the Pope for his naïveté in clinging to the conviction that Muslims want peace and that acts of Islamic terror are economically, rather than religiously, motivated.\n“This is a divinely-warranted war between the Muslim nation and the nations of disbelief,” the authors state in an article titled “By the Sword.”\nThe article directly attacked Francis for claiming that “authentic Islam and the proper reading of the Qur’an are opposed to every form of violence,” saying that by doing this, “Francis continues to hide behind a deceptive veil of ‘good will,’ covering his actual intentions of pacifying the Muslim nation.”\nPope Francis “has struggled against reality” in his efforts to portray Islam as a religion of peace, the article insisted, before going on to urge all Muslims to take up the sword of jihad, the “greatest obligation” of a true Muslim.\nDespite the obviously religious nature of their attacks, the article states, “many people in Crusader countries express shock and even disgust that Islamic State leadership ‘uses religion to justify violence.’”\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2017/04/10/spectator-egypts-palm-sunday-massacre-was-attack-on-christianity/"}
