{"authors":["Laurel Rosenhall","Amita Sharma"],"date_download":"2018-10-30 22:59:29","date_modify":"2018-10-30 22:59:29","date_publish":"2018-06-29 18:48:32","description":"An optimist might cheer the fact that lawmakers were doing their jobs. Others label it legal extortion.","filename":"data/vaneerConsumption/Specialinterestswinaslawmakerscutlastminutedealstopullinitiativesoffyourballot.json","image_url":"https://calmatters.org/wp-content/uploads/capitol-1-e1527892681456.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940369.html","title":"Special interests win as lawmakers cut last-minute deals to pull initiatives off your ballot","title_page":"Special interests win as lawmakers cut last-minute deals to pull initiatives off your ballot | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In a frenzy of Capitol wheeling and dealing this week, California legislators worked to pass new laws that will shorten your November ballot—by placating moneyed interests.\nAn optimist might cheer the fact that lawmakers were doing their jobs instead of punting to the voters to decide complicated policy questions via a slew of initiatives. Others might label it legal extortion.\nWhatever you call it, in one day on Thursday, proponents of three initiatives abruptly pulled their measures off the ballot. Gov. Jerry Brown signed two hastily-written laws, and legislators promised to keep negotiating toward a deal to enact a third.\nThe soda industry won a new law that places a 13-year ban on new soda taxes—a concession it extracted after qualifying a ballot initiative that would have raised the threshold for passing all local taxes.\nTech companies breathed a sigh of relief with passage of a new law that expands some internet privacy safeguards but allows them to keep lobbying to change it—because they feared voters would approve a qualified ballot initiative that would have gone further, and been harder to undo in the future.\nLead paint companies, accepting a promise from legislative leaders to continue negotiations, withdrew their initiative designed to get them out of hundreds of millions of dollars in liability that courts have slapped on them for knowingly selling a toxic product.\nIt was an unusual burst of activity, not only because so much happened so quickly, but also because lawmakers resolved issues they had previously shown little inclination to tackle.\nAnd it only went down because outside interests—corporate giants and wealthy individuals, many of whom are campaign donors—used the threat of a ballot initiative to pressure lawmakers: Cut a deal you don’t like now, or face something you like even less on the ballot.\nThe maneuvering in advance of Thursday’s deadline to decide what goes on the November ballot was triggered by changes to the law that give initiative proponents more time to yank their measures off the ballot. The reforms, enacted four years ago but just beginning to be used in earnest, were intended to eliminate some costly ballot box fights and shift complex policy negotiations to the Legislature. That, in some ways, was accomplished. But the outcome this week reveals that the new process allows anyone with enough money to qualify a measure for the ballot to use the threat of direct democracy as leverage to pressure the Legislature.\nIt’s “another example of how special interests hijack our political system,” Democratic state Sen. Ricardo Lara decried on the Senate floor as he prepared to vote for the ban on soda taxes.\nDemocratic Assemblyman Jim Wood of Healdsburg called it “extortion.”\nLegislators hadn’t considered bills to prohibit cities from passing new soda taxes until the soda industry spent nearly $6 million to put a measure on the ballot that would have made it harder for cities to pass all kinds of tax increases. The measure, supported by a coalition of business groups, would have required any new tax increases be approved by two-thirds of voters, instead of a simple majority. Cities—and their unionized workers—hated it, since many tax increases are used to pay for police, firefighters and other local services. So the unions and soda companies began negotiating, ultimately crafting a deal that became public just four days before it was signed into law. The compromise Brown signed bans local governments from passing taxes on soda and other groceries until 2031, but maintains the lower simple-majority threshold for voters to approve new taxes.\nRepublicans called it a “backroom deal” to diminish local control and many voted against it. Public health advocates blasted it for different reasons, saying the ban removed their ability to reduce the health impacts of soda by taxing it, prompting several Democrats to vote against it too.\nDynamics with the internet privacy measure were a little different. Legislators had considered a privacy bill last year but ultimately killed it under pressure from the tech lobby. Then this year a San Francisco real estate developer poured $3 million into putting a similar measure on the ballot after he became outraged by how much data companies collect as people move through the web. Tech companies put $1 million into fighting it.\nBehind the scenes, legislators began negotiating with the initiative proponent, Alastair Mactaggart. They agreed on a bill that achieved many of the same aims as his ballot measure—allowing Californians to find out what information is collected about them and where the information is sold, and opt out of having their data sold—but gives people fewer opportunities to sue when companies don’t follow the law. The bill also allows companies to charge users more, within certain limits, if they opt out of having their data sold.\nTech companies still don’t like it, but their lobbyists said they would prefer the bill over the ballot measure. Laws passed in the Legislature can be changed more easily than laws passed by voters, and lawmakers agreed to delay implementation of the privacy law for a year so it can be changed. That means tech lobbyists are likely to push hard next year to alter it. The American Civil Liberties Union said it will also push for changes, but likely in the other direction—for more privacy protections. Nonetheless, the bill earned bipartisan support, with many lawmakers praising Mactaggart for pressuring them to take action.\n“We know that privacy is an important issue, and yet we chose to ignore it because of the controversy involved,” said Republican Sen. Joel Anderson of Alpine.\nAssembly Speaker Anthony Rendon said the initiative process “is not perfect or ideal.”\n“But,” he added, “it can spur the Legislature to act on issues that challenge us.”\nThe lead paint deal was the biggest surprise of the three. Paint companies put $6 million into a campaign for a ballot measure to eliminate their liability for cleaning up deteriorating paint in old houses—shifting it to taxpayers instead. In recent months, lawmakers excoriated the companies in public hearings, called the initiative a cynical ploy and crafted bills to hold the paint manufacturers liable.\nLawmakers agreed to set those bills aside in exchange for the paint companies dropping their initiative. Legislative leaders announced late Thursday that the parties “have agreed to work collaboratively” and the companies promptly yanked their ballot measure.\nVoters will still face a dozen ballot measures in November: Should we cap prices at dialysis clinics? Repeal limits on rent control? Carve California into three states? Give chickens and other farm animals more room to roam?\nBut the news that three fights moved off the ballot and into the Capitol marked success for those who backed the law to change the initiative system.\n“Initiatives are a very important outlet but they are not the product of compromise—they are written by one side or the other,” said Sacramento Mayor Darrell Steinberg, who wrote the law changing the initiative process when he was the leader of the state senate. “The legislative process requires compromise.”\nCALmatters reporter Robbie Short contributed to this report.\nOne initiative that interest groups tried but failed to rescue from your November ballot? The repeal of Costa Hawkins, the landmark 1995 law that restricts rent control up and down the state. On the latest episode of our housing podcast Gimme Shelter, data journalist Matt Levin and the Los Angeles Times’ Liam Dillon ask landlord and tenant leaders why a deal has proven so elusive.","url":"https://calmatters.org/articles/special-interests-win-as-lawmakers-cut-last-minute-deals-to-pull-initiatives-off-your-ballot/"}
