{"authors":[],"date_download":"2018-10-22 21:25:14","date_modify":"2018-10-22 21:25:14","date_publish":"2016-01-29 06:40:25","description":"Speculation mounted Friday that North Korea is preparing a rocket or long-range missile launch to follow its recent nuclear test, with Japan reportedly order...","filename":"data/vaneerConsumption/SpeculationmountsofimminentNKorearocketlaunch.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7g5em-4PuZeKVXE7cd9005b2c8765d35bd-429_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420351_Images-suggest-N-Korea-preparing-missile-launch-report_1540243514.html","title":"Speculation mounts of imminent N. Korea rocket launch","title_page":"Speculation mounts of imminent N. Korea rocket launch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Speculation mounts of imminent N. Korea rocket launch\nSpeculation mounted Friday that North Korea is preparing a rocket or long-range missile launch to follow its recent nuclear test, with Japan reportedly ordering its military to shoot down any projectile that threatened its territory.\nWith existing UN Security Council resolutions banning North Korea from the use of ballistic missile technology, any launch would be a further slap in the face of the international community which is struggling to find a united response to the January 6 nuclear test.\nFollowing a Japanese report that cited government sources as saying a rocket launch could come as early as next week, two US defence officials confirmed ongoing activity at the North's Sohae satellite complex.\nA North Korean soldier stands guard at the Sohae Satellite Launch Station in Dongchang-Ri on April 8, 2012 ©Pedro Ugarte (AFP/File)\n\"The indications are that they are preparing for some kind of launch,\" one US official told AFP, speaking on condition of anonymity.\n\"Could be for a satellite or a space vehicle -- there are a lot of guesses. North Korea does this periodically -- they move things back and forth,\" the official said.\nThe United States regularly monitors North Korea from space, while Japan began satellite monitoring of the country in 2003.\nNorth Korea successfully put a satellite into orbit with its Unha-3 carrier in December 2012.\nAlthough Pyongyang insisted it was a purely scientific operation, that launch was condemned by the international community as a disguised ballistic missile test and resulted in a tightening of UN sanctions.\n- Disguised ICBM test -\n\"Our concern is that when they do a space launch, it happens to be the same components that can be used in an ICBM (inter-continental ballistic missile),\" a second US official said.\nSince early 2013, North Korea has been upgrading the Sohae launch complex to handle larger, longer-range rockets with heavier payloads, but most experts say Pyongyang is still years away from obtaining a credible ICBM capability that could threaten the US mainland.\nCiting an anonymous government source, Kyodo News in Japan said satellite imagery showed increased movement at Sohae that could suggest a launch as early as next week.\nThe main launch site also appears to have been covered over -- a precursor for launches in the past.\nAnalysts at the US-Korea Institute at Johns Hopkins University said the activity at Sohae was low-level, suggesting any launch preparations were in the \"early stages.\"\n\"However, it is important to note that there is a high level of uncertainty about this judgement for a number of reasons and Pyongyang may be further along in its preparations,\" they added.\nOther observers have noted that North Korea has yet to issue a maritime shipping alert -- a standard procedure it has adhered to with previous long-range tests.\nSeparate Japanese press reports said Defence Minister Gen Nakatani had ordered the shooting down of any missile seen as threatening Japan.\nTokyo had issued a similar destroy order at the time of the 2012 rocket launch.\nJapanese Foreign Minister Fumio Kishida said he had discussed the situation in a phone call Friday morning with US Secretary of State John Kerry.\n\"We can't deny the possibility that North Korea will take further provocative action,\" Kishida told reporters afterwards.\n- UN sanctions debate -\nThe prospect of a rocket launch comes with intense diplomatic efforts already under way to punish North Korea for its fourth nuclear test.\nWashington is pushing for a strong UN response, including enhanced sanctions, but China, North Korea's chief diplomatic protector and economic benefactor, is reluctant.\nPyongyang said the blast was a miniaturised hydrogen bomb -- a claim dismissed by most experts who say the yield was far too low.\nA US official quoted by CNN said the latest assessment, following further seismic analysis, suggested the test, while not of a full-fledged thermonuclear device, may have incorporated H-bomb \"components\" such as a detonator.\nKerry met with his Chinese counterpart Wang Yi in Beijing on Wednesday and said they had agreed to mount an \"accelerated effort\" to resolve their differences over a new UN resolution condemning the test.\nKerry, who said nuclear-armed North Korea poses an \"overt threat, a declared threat to the world,\" acknowledged that the two diplomats had not agreed on the \"parameters of exactly what (a resolution) would do or say.\"\nNorth Korea ©Adrian LEUNG, John SAEKI (AFP)\nNorth Korea displayed its ballistic missiles during a 2015 military parade at Kim Il-Sung Square in Pyongyang, to mark the 70th anniversary of its ruling Workers' Party","url":"https://www.dailymail.co.uk/wires/afp/article-3420351/Images-suggest-N-Korea-preparing-missile-launch-report.html"}
