{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:33:53","date_modify":"2018-10-30 21:33:53","date_publish":"2016-08-19 11:11:50","description":"\"Spider-Man: Homecoming\" has been filming in Atlanta for months now, and star Tom Holland took a lit...","filename":"data/vaneerConsumption/SpiderManstarTomHollandvisitsAtlantachildrenshospitalinco.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/19/Images/WPIMAGE_cmgajcbuzz_12925.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_spider-man-star-t_94f29f0ff73b2820270b6467da047b99__1540935233.html","title":"\"Spider-Man\" star Tom Holland visits Atlanta children's hospital in co","title_page":"\"Spider-Man\" star Tom Holland visits Atlanta children's hospital in co","title_rss":"NULL","source_domain":"ajc.com","text":"\"Spider-Man: Homecoming\" has been filming in Atlanta for months now, and star Tom Holland took a little time away from the set to visit an Atlanta children's hospital in costume.\nTom Holland at Egleston\nMORE: \"Spider-Man\" films at Atlanta high school campus\nCheck out Tom Holland's spidey selfie\nThe stars of \"Spider-Man\" and \"Guardians of the Galaxy\" together in Atlanta\nHe and a team from Marvel paid a visit to Children's Healthcare of Atlanta's Egleston location.\n\"Meeting you all today was such a wonderful experience and you're all such little inspirations,\" he posted with the above photo on Instagram. \"We're proud of you and we love and we hope to be back soon and thank you for having us Egleston Children's hospital.\"\nHere are some social media posts logged during the visit\nWhile it may appear that Ryan Seacrest joined the fun in this photo below, that's a likeness, not the real thing. The Ryan Seacrest Foundation established a broadcast media center at Egleston. Seacrest Studios Atlanta gives kids a chance to learn about radio and TV broadcasting while they are getting better at Children’s.","url":"https://www.ajc.com/blog/buzz/spider-man-star-tom-holland-visits-atlanta-children-hospital-costume/0S0BNCRsYVy7IBU5PArGlO/"}
