{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:37:20","date_modify":"2018-10-30 21:37:20","date_publish":"2016-06-24 07:42:08","description":"School's out for the summer, making it a great time for movies that want a campus to film on.","filename":"data/vaneerConsumption/SpiderManHomecomingandStepSistersfilmonAtlantacampuses.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/24/Images/WPIMAGE_cmgajcbuzz_11533.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_spider-man-homeco_6c793138f326c7b1d7bc836e8ea69901__1540935440.html","title":"\"Spider-Man: Homecoming\" and \"Step Sisters\" film on Atlanta campuses","title_page":"\"Spider-Man: Homecoming\" and \"Step Sisters\" film on Atlanta campuses","title_rss":"NULL","source_domain":"ajc.com","text":"School's out for the summer, making it a great time for movies that want a campus to film on. \"Spider-Man: Homecoming\" set up shop at Grady High School this week while \"Step Sisters\" stepped on over to Oglethorpe University.\nMORE:\nThis movie with Justin Timberlake and Clint Eastwood filmed at Dunwoody High School\nThis upcoming movie with Laura Graham filmed at Westlake High School and Atlanta International School\nTeen movie with Bella Thorne filmed at Marietta High School, Grady High School\n\"Spider-Man: Homecoming\" is the latest Marvel movie to film in Atlanta, following \"Ant-Man,\" \"Captain America: Civil War\" and the recently wrapped \"Guardians of the Galaxy 2.\"\nDirector James Gunn posted this nice post with a photo of himself with Spidey star Tom Holland and Guardians leading man Chris Pratt.\n\"Step Sisters\" is directed by \"Drumline\" director Charles Stone III, whose last project here was \"Lila and Eve.\"\nThe plot, per imdb: \"An African American sorority girl resorts to desperate measures to get into a top law school.\"","url":"https://www.ajc.com/blog/buzz/spider-man-homecoming-and-step-sisters-film-atlanta-campuses/Qmh4k3r6JgVknMSbLbMFkN/"}
