{"authors":["Associated Press"],"date_download":"2018-10-22 23:11:23","date_modify":"2018-10-22 23:11:23","date_publish":"2016-01-29 10:55:16","description":"SINGAPORE (AP) — Jordan Spieth slipped five shots off the lead at the Singapore Open on Friday when an electrical storm forced second-round play to be abando...","filename":"data/vaneerConsumption/SpiethfallsbehindatstormySingaporeOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422516_Spieth-falls-stormy-Singapore-Open_1540249883.html","title":"Spieth falls behind at stormy Singapore Open","title_page":"Spieth falls behind at stormy Singapore Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spieth falls behind at stormy Singapore Open\nSINGAPORE (AP) — Jordan Spieth slipped five shots off the lead at the Singapore Open on Friday when an electrical storm forced second-round play to be abandoned.\nSpieth was lurking just one shot off the pace after his opening round at Sentosa Country Club, but suddenly found himself five strokes behind and tied for sixth place after Song Young-han of South Korea capitalized on his early start to beat the arrival of the foul weather and post an 8-under 63 to go to the clubhouse leading at 9 under.\nSpieth, teeing off after lunchtime, completed just seven holes of his second round but failed to make up any ground on the new front-runner, remaining at 4 under after struggling with his putter, just as he did in Abu Dhabi last week.\nHe briefly got to 5 under when he drained a long putt to birdie the par-3 second hole, but gave the shot back with his first bogey of the tournament, on the fifth hole. His flat stick also let him down on the two par-5s on the front nine, which he comfortably birdied in the first round but could only par on Friday.\n\"Didn't get off to a great start but made a good birdie on No. 2,\" Spieth said.\n\"Had a couple of bad putts. Missed a short one on No. 4. On 7 I got a bit unlucky. I had a perfect distance to the hole, the par-5, and just when I hit my second the wind changed. My ball came up just short of the green and, when I went to play my putt, that's when the rain came in hard almost horizontally. My putt came up seven feet short.\"\nSpieth arrived in Southeast Asia already complaining of exhaustion after playing his last five events in five different countries. His hopes of a making a quick getaway back home to the United States, were at risk of being ruined by Singapore's fickle weather, with tournament officials racing against time to finish on Sunday. The second round was still to be completed by 75 players.\nWhile Spieth struggled to get any momentum going in the co-sanctioned Asian and Japan Tour event, Song made the most of the perfect early conditions to charge to the top of the leaderboard with seven birdies and an eagle.","url":"https://www.dailymail.co.uk/wires/ap/article-3422516/Spieth-falls-stormy-Singapore-Open.html"}
