{"authors":["Associated Press"],"date_download":"2018-10-22 23:22:32","date_modify":"2018-10-22 23:22:32","date_publish":"2016-01-28 12:11:58","description":"SINGAPORE (AP) — A good night's sleep and a helping hand from his manager was all Jordan Spieth needed to get back in the swing of things on the latest leg o...","filename":"data/vaneerConsumption/SpiethtakesearlyshareofleadatSingaporeOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:2b294c44d1bb451b9116c2b7cbf61b4a-4vVdYopwYQ7f641721b07acf41ea-549_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420375_Spieth-takes-early-share-lead-Singapore-Open_1540250552.html","title":"Spieth takes early share of lead at Singapore Open","title_page":"Spieth takes early share of lead at Singapore Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spieth takes early share of lead at Singapore Open\nSINGAPORE (AP) — A good night's sleep and a helping hand from his manager was all Jordan Spieth needed to get back in the swing of things on the latest leg of his globe-trotting tour.\nThe world's top-ranked player had arrived at the Singapore Open exhausted and complaining of fatigue after playing in the Middle East last week, but Spieth looked revitalized as he grabbed a share of third place in Thursday's opening round.\nWith his agent filling in as his caddie, Spieth began with a birdie at Sentosa Golf Club and birdied three of his last 10 holes to complete a bogey-free round of 4-under 67 at the co-sanctioned Asian and Japan Tour event.\nJordan Spieth of the United States tees off on the third hole during the first round of the SMBC Singapore Open golf tournament held at the Sentosa Golf Club's Serapong Course on Thursday, Jan. 28, 2016, in Singapore. (AP Photo/Wong Maye-E)\nThat left him just one stroke behind the clubhouse leader, South Africa's Keith Horne, and Berry Henson of the United States, who still had one hole to finish when play was suspended for the day because of a thunderstorm.\nAn Byeong-hun of South Korea, the next highest-ranked player in the field at 26 in the world, matched Spieth's 67. They were joined at 4-under by Japan's Shintaro Kobayashi and Thailand's Namchok Tantipokhakul, who were among 57 players still on the course when play was suspended.\nSpieth, who has played his past five tournaments in five different countries, turned to his manager and agent, Jay Danzi, to carry his bag after his long-time regular caddie, Michael Greller, injured an ankle in Abu Dhabi last week and canceled his trip to Southeast Asia.\n\"I thought Jay stepped in extremely well,\" Spieth said. \"It's a tough place to caddie when you are not used to carrying the bag, with the weather, but he took it like a champ.\"\nBy his own standards, Spieth was not at his best, missing four fairways off the tee and misjudging most of his approach shots to the green.\n\"I felt like the entire day today was very stress-free driving the ball, which is the most important part out there, but from there I just couldn't get it on the right tier,\" the 22-year-old American said. \"Ï just couldn't quite get the right distance. My distance control was just off, trying to judge the wind, the humidity and the heat.\"\nSpieth escaped the worst of Singapore's stifling humidity when he teed off just after sunrise and made a perfect start when he made a 20-foot birdie putt on his first hole. He struggled to get his yardage right on the unfamiliar Serapong course but birdied each of the three par-5s and did not three-putt a single hole.\n\"It's just the first round,\" Spieth said. \"Coming here, to a different country, a different time zone, it's still an adjustment and I think each day should get a bit better.\"\nJordan Spieth of the United States discusses his shot with caddy Jay Danzi, on the 13th hole during the first round of the SMBC Singapore Open golf tournament at the Sentosa Golf Club's Serapong Course on Thursday, Jan. 28, 2016, in Singapore. (AP Photo/Wong Maye-E)","url":"https://www.dailymail.co.uk/wires/ap/article-3420375/Spieth-takes-early-share-lead-Singapore-Open.html"}
