{"authors":[],"date_download":"2018-10-23 00:44:06","date_modify":"2018-10-23 00:44:06","date_publish":"2016-01-28 14:51:12","description":"South Africa's Keith Horne shot a five-under-par 66 to lead the SMBC Singapore Open after the first round of play Thursday, with world number one Jordan Spie...","filename":"data/vaneerConsumption/SpiethtrailsasSouthAfricasHornetakesearlyleadinSingapore.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g9v4-4vVdYopwYQ7f641721b07ae4e9b1-673_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421036_Spieth-lurks-S-Africas-Horne-takes-early-lead-Singapore_1540255446.html","title":"Spieth trails as South Africa's Horne takes early lead in Singapore","title_page":"Spieth trails as South Africa's Horne takes early lead in Singapore | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spieth trails as South Africa's Horne takes early lead in Singapore\nSouth Africa's Keith Horne shot a five-under-par 66 to lead the SMBC Singapore Open after the first round of play Thursday, with world number one Jordan Spieth breathing down his neck.\nSpieth and South Korea's An Byeong-Hun posted identical birdies in the fourth, seventh, 10th and 18th holes, to trail Horne by a stroke as the four-day tournament teed off at the Sentosa Golf Club Serapong Course.\nBad weather suspended play late afternoon and competition will resume tomorrow for 57 players who have not completed the first round.\nJordan Spieth trails leader Keith Horne by a single stroke after the first round of the SMBC Singapore Open on January 28, 2016 ©Paul Lakatos (Lagardere Sports/AFP)\nTeeing off on the back nine, Horne hit two bogeys but raised his game to top the leaderboard with his seventh birdie in the final hole.\nDespite not playing at Serapong for a couple of years, the 44-year-old said he usually has a good outing at the course.\n\"I had a bit of a walkabout in the middle of the round but then I also had a good run coming in,\" said Horne.\n\"I putted great today which was important. I put a new driver in the bag... and I hit it so far and straight and that made a huge difference.\"\nPlaying in the city-state for the first time, Spieth remains focused on winning the Singapore Open and while he was frustrated with his drives the 22-year-old Texan said he was still adjusting.\n\"It was a good start,\" said the 2015 US Open and Masters champion.\n\"I wish I had better chances of putting inside 15 feet to birdie. I just didn't have many today,\" he added.\n\"But that will come. It's just the first round in a different country, different time zone. It's still an adjustment and I think each day it will get a bit better.\"\n- Injured caddie -\nSpieth played without regular caddie Michael Greller, who is recovering from an ankle injury sustained at the Hyundai Tournament of Champions in Hawaii earlier this month, and his agent, Jay Danzi, stood in without a hitch in the heat.\nSpieth said: \"It's a tough place to come in and caddie when you're not used to carrying the bag in this weather. But he has caddied for me previously, at the Dunlop Phoenix in Japan, and he took it like a champ.\n\"We also played a lot together, so it's an easy one-week replacement while Michael is getting healthy.\"\nOverall, Spieth said Serapong lived up to what he had heard from PGA Tour pros who had played here previously.\n\"My expectations were high, considering how highly people have spoken of this golf course,\" Spieth told reporters.\n\"It played very similar to a pretty challenging PGA Tour.\"\nThe American has put aside earlier complaints of exhaustion after a top five finish at the Abu Dhabi HSBC Golf Championship on Sunday.\nReturning after a three-year hiatus and under new sponsorship, the Singapore Open offers a minimum prize purse of $1 million. It is co-sanctioned by the Asian Tour and Japan Golf Tour Organization.\nIt was formerly one of Asia's richest with a $6 million purse when last held in November 2012.\nThe tournament was cancelled in 2013 after British bank Barclays chose not to renew its sponsorship. Japan's Sumitomo Mitsui Banking Corporation is the current sponsor.\nLeading scores\n66 - Keith Horne (RSA)\n67 - An Byeong-Hun (KOR), Jordan Spieth (USA)\n68 - Hideto Tanihara (JPN), Rahil Gangjee (IND), Quincy Quek (SIN), Paul Peterson (USA)\n69 -Prayad Marksaeng (THA), Choi Jinho (KOR), Scott Strange (AUS), Miguel Tabuena (PHI), Javi Colomo (ESP), Chapchai Nirat (THA)\nSouth Africa's Keith Horne shot a five-under-par 66 in the first round of the SMBC Singapore Open on January 28, 2016 ©Khalid Redza (Lagardere Sports/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3421036/Spieth-lurks-S-Africas-Horne-takes-early-lead-Singapore.html"}
