{"authors":["Associated Press"],"date_download":"2018-10-22 23:09:43","date_modify":"2018-10-22 23:09:43","date_publish":"2016-01-11 04:55:27","description":"KAPALUA, Hawaii (AP) — The view from the top looks as spectacular as ever for Jordan Spieth. He was standing in the 18th fairway Sunday at Kapalua, his victo...","filename":"data/vaneerConsumption/SpiethopensthenewyearinstylewithwinatKapalua.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:1dec45d8488747cc9fd5aad30be179c8-56CX32zFKLb7123928b84ca7e833-136_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393307_Spieth-opens-new-year-style-win-Kapalua_1540249783.html","title":"Spieth opens the new year in style with win at Kapalua","title_page":"Spieth opens the new year in style with win at Kapalua | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spieth opens the new year in style with win at Kapalua\nKAPALUA, Hawaii (AP) — The view from the top looks as spectacular as ever for Jordan Spieth.\nHe was standing in the 18th fairway Sunday at Kapalua, his victory in the Hyundai Tournament of Champions easily secured, when his thoughts were interrupted by a comment from caddie Michael Greller: \"Way to make a statement.\"\nThe statement was nearly as big as his eight-shot victory.\nJordan Spieth poses for photographers as he holds the trophy after his win in the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. Spieth finished with at 30 under par for the tourney. (AP Photo/Matt York)\nComing off a year that Spieth knows will be tough to match — the Masters, U.S. Open, five wins, the FedEx Cup — the 22-year-old Texan backed up his sage comment at the start of the week that 2016 wasn't about an encore because that would mean the show was over.\nIt's not.\nSpieth crushed the winners-only field by closing with a 6-under 67 to become only the second player in PGA Tour history to finish a 72-hole tournament at 30-under par or lower. An 8-foot birdie on the final hole put him at 30-under 262, one short of the record Ernie Els set at Kapalua in 2003.\n\"I thought that was cool,\" Spieth said about his caddie's comment. \"It's not what I'm going for. It's not why I do what I do. I don't do it to talk back to any people that believe it's not possible or 'He got a lucky year' or something.\"\nAnd then he paused with a smile and added, \"But I still think it's going to be very difficult to have a year like last year.\"\nThis one could not have gotten off to a better start.\nStaked to a five-shot lead, Spieth made two straight birdies around the turn to restore his margin, and he spent the rest of the afternoon soaking up sights of the sun and surf on Maui. The view of him at No. 1 in the world only looks daunting to the guys trying to catch him.\nPatrick Reed got within three shots before he stalled on the back nine and Spieth poured it on with a combination of great shots and smart shots. It was like last year never ended, and that's what Spieth wanted.\n\"I felt like it was short three-week break and continue what we were doing last year,\" Spieth said. \"That's the way I'll keep on thinking about it. It worked this week. All parts were firing.\"\nReed, the defending champion at Kapalua, got within three shots with a birdie on the par-5 ninth. Spieth answered with a two-putt birdie in the group behind him, and then rolled in a 15-foot birdie putt on the 10th and was on his way.\nReed ended his bogey-free week on the 15th hole and closed with a 69. Brooks Koepka, playing with Spieth in the final group, had a wild start to his round but never got closer than the five-shot deficit he faced at the start. Koepka closed with a 71 and tied for third with Brandt Snedeker (67).\nSpieth won for the seventh time on the PGA Tour, joining Tiger Woods as the only players to get that many at age 22 since complete records began in 1970.\nThat requires a little context.\nSpieth won his seventh title in his 77th start as a pro. Woods won his seventh PGA Tour event in his 38th start, and he had 18 wins in his first 77 tournaments.\nEven so, comparisons with Woods in golf can only mean great play, and no one is playing better.\n\"Nowhere near,\" Spieth said on how his record stacks up with Woods. \"I don't think there's any reason to compare. It's awfully early. We're excited about where we're at to start our career. What Tiger has done, I can't imagine ever being done. But it's nice to be in that company. It's fantastic being out here with what we're trying to do, and doing it well.\"\nIt was the fifth time in the last 13 months that Spieth had at least a two-shot lead going into the final round, and he was never seriously challenged. That's not to suggest it felt like a breeze, especially early. His approach shot on No. 1 somehow ended up just out of a steep bunker on the very edge of sand, some 50 yards to the hole. He pitched it onto the green and let the grain take it to 4 feet for a save, and then he holed a 35-foot birdie putt on the next hole.\nSpieth called those two holes the toughest because of the Kona wind. He played them in 1 under. He wasted birdie chances on a pair of holes, made another bogey on No. 8 as Reed closed within three, but any tension didn't last long.\n\"I knew I had to make birdies early to put pressure on him,\" Reed said. \"I got it to within three. The next time I saw a board it was back to five. He's not going to shoot over par, especially the way he's playing now.\"\nThe next questions is how good he can get.\nAfter a week at home in Dallas, he heads to the Middle East for the HSBC Abu Dhabi Golf Championship and Asia for the Singapore Open before resuming his PGA Tour schedule at Pebble Beach and Riviera.\nMuch like Woods in 2000, and even David Duval in 1999, he sent an early message by winning Kapalua that he wasn't interested in this wave to end.\nJordan Spieth hits from the 18th tee during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. Spieth finished at 30 under par for the tournament win. (AP Photo/Matt York)\nJordan Spieth hits on the 13th tee during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii.(AP Photo/Matt York)\nJordan Spieth hits from the 12th tee during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii.(AP Photo/Matt York)\nJordan Spieth inspects the lie of his ball on the first green during the final round of the Tournament of Champions golf tournament, Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. (AP Photo/Matt York)\nJordan Spieth looks at his lie on the 11th green during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii.(AP Photo/Matt York)\nJordan Spieth walks up the second fairway during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course on Kapalua, Hawaii.(AP Photo/Matt York)\nJordan Spieth pumps his fist after making his birdie putt on the second green during the final round of the Tournament of Champions golf tournament, Sunday, Jan. 10, 2016, at Kapalua Plantation Course on Kapalua, Hawaii. (AP Photo/Matt York)\nPatrick Reed hits from the second tee during the final round of the Tournament of Champions golf tournament, Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii.(AP Photo/Matt York)\nBrooks Koepka hits from the fourth tee during the final round of the Tournament of Champions golf tournament, Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. (AP Photo/Matt York)\nJordan Spieth smiles as he acknowledges the crowd as he walks up the 18th fairway during the final round of the Tournament of Champions golf tournament, Sunday, Jan. 10, 2016, at Kapalua Plantation Course on Kapalua, Hawaii. Spieth finished 30 under par for the tournament win. (AP Photo/Matt York)","url":"https://www.dailymail.co.uk/wires/ap/article-3393307/Spieth-opens-new-year-style-win-Kapalua.html"}
