{"authors":["Associated Press"],"date_download":"2018-10-23 00:18:34","date_modify":"2018-10-23 00:18:34","date_publish":"2016-01-11 09:20:03","description":"KAPALUA, Hawaii (AP) — Jordan Spieth went on Twitter in the final hour of 2015 to say, \"Would rather this year not end.\" Maybe it never did. Coming off a blo...","filename":"data/vaneerConsumption/Spiethsendsstatementasbigashis8shotwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:168c12d1e681493a8b15fa52ec596226-56CX32zFKLb7123928b84ccbf9ed-851_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393578_Spieth-sends-statement-big-8-shot-win_1540253914.html","title":"Spieth sends statement as big as his 8-shot win","title_page":"Spieth sends statement as big as his 8-shot win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spieth sends statement as big as his 8-shot win\nKAPALUA, Hawaii (AP) — Jordan Spieth went on Twitter in the final hour of 2015 to say, \"Would rather this year not end.\"\nMaybe it never did.\nComing off a blockbuster year including the Masters, U.S. Open, five victories and the FedEx Cup, Spieth delivered a statement Sunday in the Hyundai Tournament of Champions by crushing the winners-only field at Kapalua for an eight-shot victory.\nJordan Spieth poses for photographers as he holds the trophy after his win in the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. Spieth finished with at 30 under par for the tourney. (AP Photo/Matt York)\n\"I felt like it was a short three-week break and continue what we were doing last year,\" he said. \"That's the way I'll keep on thinking about it. It worked well this week. All parts were firing.\"\nHe made an 8-foot birdie putt on the 18th hole for a 6-under 67 and a spot in the PGA Tour record book with Ernie Els. They are the only two players at 30-under par or lower in a 72-hole event. Spieth, playing smart with a big lead on the back nine, finished at 30-under 262. That was one short of the record Els set at Kapalua in 2003.\nHe also joined Tiger Woods as the only players since full records began in 1970 to win seven times on the PGA Tour at age 22. Woods was a month younger, and he turned pro later. Spieth collected his seventh win in his 77th start. Woods won his seventh in only his 38th tournament as a pro.\n\"My putting feels like it's 100 percent ready for major championships, and I've just got to dial in everything else just a little bit more,\" he said. \"But I can sit here and say that my putting certainly is ready for the Masters to be next week. It's a really good feeling to have that confidence with the flat stick.\"\nBrooks Koepka played with Spieth in the final round and started five shots behind. On the first hole, Spieth's approach somehow settled inches away on the top of a steep bunker about 50 yards from the hole. His pitch rode the grain to 4 feet for par. Koepka three-putted for bogey. Then, Spieth rolled in a 35-foot birdie putt.\n\"It's incredible the way Jordan manages his game going around all 18 holes,\" Koepka said. \"He doesn't seem to make a mistake. When he does get in trouble, he gets out of it and he makes those 15-foot clutch putts to keep the round going. It's impressive to watch, it really is. It's fun to watch.\"\nKoepka shot 71 and tied for third.\nDefending champion Patrick Reed had three birdies in five holes, and he pulled within three shots with a birdie at No. 9. The next time he saw a leaderboard, Spieth was five shots in front and the gap only got bigger from there. Reed closed with a 69 and was runner-up.\n\"He hasn't given anyone opportunities to really catch up,\" said Rickie Fowler, who finished 10 shots behind in fifth place. \"It's just solid golf, and I think you're going to see a lot of that like he did last year. You're going to have to play a good, solid golf tournament to have a chance to win.\"\nSpieth is uncomfortable with comparisons with Woods, though he bought into one philosophy going into the final round.\n\"When Tiger is in contention, why is his record so phenomenal? Well, sure, he played the best golf and he was the strongest mentally,\" Spieth said. \"But everyone else knew that he could do it and maybe tried to do a bit too much.\"\nSpieth was waiting in the 18th fairway when he said caddie Michael Greller said to him, \"Way to make a statement.\"\n\"That was cool,\" Spieth said. \"It's not what I'm going for. It's not why I do what I do. I don't do it to talk back to any people that believe it's not possible or 'He got a lucky year' or something.\"\nAnd then he paused with a smile and added, \"But I still think it's going to be very difficult to have a year like last year.\"\nJordan Spieth hits from the 18th tee during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. Spieth finished at 30 under par for the tournament win. (AP Photo/Matt York)\nJordan Spieth smiles as he acknowledges the crowd as he walks up the 18th fairway during the final round of the Tournament of Champions golf tournament, Sunday, Jan. 10, 2016, at Kapalua Plantation Course on Kapalua, Hawaii. Spieth finished 30 under par for the tournament win. (AP Photo/Matt York)\nJordan Spieth places the trophy on the podium after the final round of the Tournament of Champions golf event, Sunday, Jan. 10, 2016, at Kapalua Plantation Course in Kapalua, Hawaii. Spieth finished at 30 under par for the tournament win. (AP Photo/Matt York)\nJordan Spieth walks up the second fairway during the final round of the Tournament of Champions golf event Sunday, Jan. 10, 2016, at Kapalua Plantation Course on Kapalua, Hawaii.(AP Photo/Matt York)","url":"https://www.dailymail.co.uk/wires/ap/article-3393578/Spieth-sends-statement-big-8-shot-win.html"}
