{"authors":["Associated Press"],"date_download":"2018-10-22 21:29:27","date_modify":"2018-10-22 21:29:27","date_publish":"2016-01-11 00:49:10","description":"NEW ORLEANS (AP) — The U.S. Army Corps of Engineers opened a major spillway Sunday near New Orleans for the first time in nearly five years, seeking to decre...","filename":"data/vaneerConsumption/SpillwayofswollenMississippiRiveropennearNewOrleans.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:4a10b120ae5d47eeba030a22e0476c70-56CX32zFKLb7123928b84c7f827c-66_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393111_Spillway-swollen-Mississippi-River-open-near-New-Orleans_1540243767.html","title":"Spillway of swollen Mississippi River open near New Orleans","title_page":"Spillway of swollen Mississippi River open near New Orleans | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spillway of swollen Mississippi River open near New Orleans\nNEW ORLEANS (AP) — The U.S. Army Corps of Engineers opened a major spillway Sunday near New Orleans for the first time in nearly five years, seeking to decrease the vast flow of the swollen Mississippi River as a safeguard to the low-lying city.\nHeavy Mississippi Valley rain has propelled the river to its highest levels since record flooding in 2011, the last time the Bonnet Carre spillway was opened as a key relief valve in south Louisiana.\nNew Orleans Mayor Mitch Landrieu praised the spillway for protecting the city, the NOLA.com/The Times-Picayune reported (http://bit.ly/1Zlu1vl ). The spillway was built 28 miles upriver from New Orleans after a devastating 1927 flood.\nCORRECTS TO REFLECT POOL STATUS OF PHOTO - Workers with the U.S. Army Corps of engineers pull wooden pins to drain water from the Mississippi River into the Bonnet Carre Spillway Sunday, Jan. 10, 2016, in Norco, La. The Mississippi River water levels are rising because of heavy December rain in the Midwest. The opening of the Bonnet Carre Spillway helps relieve pressure on New Orleans-area levees by making sure the water doesn¿t flow faster than 1.25 million cubic feet per second through the city. (Scott Threlkeld/The Advocate via AP, Pool)\n\"What we're witnessing right now is really an engineering miracle,\" Landrieu said at a news conference Sunday, lauding the spillway and other river defenses near the city. \"So many of us for so long wanted to make sure our homes and our lives were protected by creating a levee system.\"\nThe Army Corps of Engineers' New Orleans District commander had said Tuesday that he was confident the high Mississippi River will pass safely through Louisiana to the Gulf of Mexico. Col. Rick Hansen then announced he was recommending the weekend opening of the spillway.\nThe Bonnet Carre has been opened 10 times since 1931. Corps officials said the spillway is intended to help keep the immense flow of the Mississippi River at New Orleans below 1.25 million cubic feet per second — enough to fill the equivalent of the city's Superdome in less than 2 minutes.\nThe spillway opens up more than a mile of the Mississippi's east bank and pulls diverted river waters into a 5.7-mile floodway that empties into Lake Pontchartrain and, eventually, into the Gulf of Mexico. Authorities said it may be open for several weeks.\nCrowds gathered to watch the opening of the spillway, gasping as frothy white water tumbled and roared through, The Advocate reports (http://bit.ly/1K7uq8j ).\nAnne Landry, 35, a fifth-grade school teacher from the New Orleans suburb of Metairie, took photos and video for her class, which has been studying the source and tributaries of the river.\nLandry's friend, fellow elementary school teacher Jennifer Lojszczyk, tagged along for the educational experience and spoke of what she called \"the wow factor.\"\nThe National Weather Service said the river was cresting Sunday at Tunica, Mississippi, and Helena, Arkansas, amid reports of some flooding in low-lying areas near Vicksburg and Natchez in Mississippi. Some local officials in Mississippi said they were making plans in the event some residents need to move temporarily.\nWorkers with the U.S. Army Corps of engineers pull wooden pins to drain water from the Mississippi River into the Bonnet Carre Spillway Sunday, Jan. 10, 2016, in Norco, La. The Mississippi River water levels are rising because of heavy December rain in the Midwest. The opening of the Bonnet Carre Spillway helps relieve pressure on New Orleans-area levees by making sure the water doesn¿t flow faster than 1.25 million cubic feet per second through the city. (Scott Threlkeld/The Advocate via AP, Pool)\nCORRECTS TO REFLECT POOL STATUS OF PHOTO - Workers with the U.S. Army Corps of engineers drain water from the Mississippi River, right, into the Bonnet Carre Spillway Sunday, Jan. 10, 2016, in Norco, La. The Mississippi River water levels are rising because of heavy December rain in the Midwest. The opening of the Bonnet Carre Spillway helps relieve pressure on New Orleans-area levees by making sure the water doesn¿t flow faster than 1.25 million cubic feet per second through the city. (Scott Threlkeld/The Advocate via AP, Pool)","url":"https://www.dailymail.co.uk/wires/ap/article-3393111/Spillway-swollen-Mississippi-River-open-near-New-Orleans.html"}
