{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:41:54","date_modify":"2018-10-30 21:41:54","date_publish":"2016-12-14 10:52:52","description":"is set to open a second location in Toco Hills next year.","filename":"data/vaneerConsumption/SpillerParkCoffeeopeningasecondlocationinTocoHills.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/14/Images/WPIMAGE_cmgajcfoodandmore_12428.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_sp_f542fab450ed8fded247561dda396160__1540935714.html","title":"Spiller Park Coffee opening a second location in Toco Hills","title_page":"Spiller Park Coffee opening a second location in Toco Hills","title_rss":"NULL","source_domain":"ajc.com","text":"is set to open a second location in Toco Hills next year.\nDale Donchey, who co-owns Spiller Park with Georgia restaurateur Hugh Acheson (Empire State South, Five & Ten), said the new spot will open in late spring/early summer in a 1080-square-foot space at Toco Hills Shopping Center that was home to a former shoe store.\n\"As we move forward with our ideas, design and menu we're really starting to get a view of what a Spiller Park with walls really means,\" Donchey, who previously owned Steady Hand in the Emory area. \"If you think we have a good time now...oh, man, just wait.\"\nBoth locations will expand on the food menu with a focus on gourmet toasts (doughnuts have been cut from the lineup), and will continue to serve a variety of coffees and specialty coffee drinks.\n\"The goal is to be an added pillar to the already strong community around Toco Hills,\" Donchey said. \"My old coffee shop was in the same area and I live in the area as well, and it's almost a coming back home feel for me. I'm also hopeful that we're merely the first step to bringing more great eats and drinks to one of the oldest shopping centers in Georgia.\"\nThe center will see some changes before Spiller Park moves in -- Famous Pub recently announced it will close by the end of the year after 30 years , and Petite Auberge will relocate at the end of the year after 40 years in the complex.\nRead more about Spiller Park Coffee here","url":"https://www.ajc.com/blog/atlanta-restaurants/spiller-park-coffee-opening-second-location-toco-hills/6NVyLmQc6dmYDW4ioJY98I/"}
