{"authors":[],"date_download":"2018-10-30 14:34:09","date_modify":"2018-10-30 14:34:09","date_publish":"2015-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/Spinelessleadershaveinfiltratedthemilitary.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_spineless_leaders_have_infiltrated_the_military_1540910049.html","title":"Spineless leaders have infiltrated the military","title_page":"Spineless leaders have infiltrated the military","title_rss":"NULL","source_domain":"americanthinker.com","text":"This week, the Army ROTC cadets at Arizona State University were forced to walk around campus in uniform wearing red pumps for an event called “Walk A Mile in Her Shoes” to raise awareness of sexual violence against women on college campuses. As reported by the Washington Times, in 2014, the Army encouraged participation in the April event. However; this year, the ROTC candidates at ASU were faced with a volunteer event that became mandatory. Or they were voluntold, the term we used to use in the military.\nLiberalism has succeeded in infiltrating the U.S. military, America’s last bastion of discipline, honor, and respect. Liberals have succeeded in destroying the family, education, the economy, and just about everything they set their sights on. It seems that they were not satisfied until they could force their agenda on the world’s most powerful and disciplined military.\nAs a retired veteran, to see the photo of the young future leaders being humiliated walking around in red pumps made my blood boil. There are a number of things wrong with this situation. First, the so-called rape culture on college campus is an invention by feminists. Secondly, the soldiers are out of uniform. According to Army Regulations AR670-1 – Wear and Appearance of Army Uniforms and Insignia, a military member must wear his or her uniform in a way that projects an image of discipline and order and is prohibited from wearing a combination of civilian and military clothing.\nAppearance. (1) All personnel will maintain a high standard of professional dress and appearance. Uniforms will fit properly; the proper fitting of uniforms is provided in DA Pam 670–1. Personnel must keep uniforms clean, serviceable, and rollpressed, as necessary. Soldiers must project a military image that leaves no doubt that they live by a common military standard and uphold military order and discipline. Required or prohibited wearing of the Army uniform e. Wearing a combination of civilian and military clothing is prohibited, unless prescribed in this regulation or directed by the Secretary of the Army.\nThe most infuriating part of the entire situation is the realization that some spineless military leader pressured these young men into participating in such lunacy. Whoever is responsible for caving to this foolishness deserves a steel-toed combat boot planted firmly in his or her gluteus maximus. One of the humiliated ROTC cadets took to social media to complain about it:\nAttendance is mandatory and if we miss it we get a negative counseling and a ‘does not support the battalion sharp/EO mission’ on our CDT OER for getting the branch we want. So I just spent $16 on a pair of high heels that I have to spray paint red later on only to throw them in the trash after about 300 of us embarrass the U.S. Army tomorrow[.]\nIt is disheartening to realize that it took only a few short years to turn the finest military into some kind of social experiment. If there is anything that liberals hate the most, it is an organization that trains and develops young men and women to love their country and to be strong leaders, self-reliant, and independent thinkers. The image of strong, disciplined men and women does to liberals what the image of the cross does to Dracula.\nChristian Commentary (http://patriciascornerblog.com), or contact the author at dicksonpat@sky.com. Follow me on twitter@Patrici15767099.","url":"https://www.americanthinker.com/blog/2015/04/spineless_leaders_have_infiltrated_the_military.html"}
