{"authors":["Lauren Grounsell For Daily Mail Australia"],"date_download":"2018-10-22 22:46:27","date_modify":"2018-10-22 22:46:27","date_publish":"2016-01-11 03:38:06","description":"Psychic and medium, Sydney's Kerrie Erwin, has regular contact with spirit children but one spirit girl proved she was different from the rest when she performed Kylie Minogue's hit song The Loco-Motion.","filename":"data/vaneerConsumption/SpiritperformsKylieMinoguesTheLocoMotionformediumKerrieErwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/03/30046A8E00000578-0-image-a-2_1452483018524.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393064_Spirit-performs-Kylie-Minogue-s-Loco-Motion-medium-psychic-Kerrie-Erwin_1540248387.html","title":"Spirit performs Kylie Minogue's The Loco-Motion for medium Kerrie Erwin","title_page":"Spirit performs Kylie Minogue's The Loco-Motion for medium Kerrie Erwin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mrs Erwin also helps spirits that inhabit a persons' house to 'cross over'\nShe said the songs are a way for spirits to show evidence of their identity\nSpirits have also sung Elvis songs or John Lennon's song Imagine\nA spirit girl visited her and performed Kylie Minogue's The Loco-Motion\nThe spirit of a young girl who died from cancer performed Kylie Minogue’s hit song The Loco-Motion when she visited Sydney medium Kerri Erwin.\nThe girl, who passed away when she was about eight years old, told Mrs Erwin her mother would phone - and not long after, she did.\n‘She said: “My mother’s going to ring, I died and she wants to get in contact with me”,’ Mrs Erwin told Daily Mail Australia.\nScroll down for video\nUsing her gift: Psychic, medium, clairvoyant and healer Kerrie Erwin, of Sydney, is able to communicate with spirits\nDo The Loco-Motion: One spirit girl, who died of cancer, performed Kylie Minogue's hit song when she visited Mrs Erwin\n‘Often I get songs when people come through, if someone really loved Elvis I’ll hear an Elvis song.\n‘The little girl was singing Kylie Minogue and dancing around the room.\n‘It’s a spirit’s way of giving evidence.’\nMessage in a song: Spirits who sing a song do so a way of giving evidence to prove their identity to loved ones\nMrs Erwin, who is in her fifties, has been visited by spirits since she was about eight years old.\nWhen the spirit girl’s mother did phone, Mrs Erwin was able to better describe her by referencing her love of Kylie.\n‘When we lose someone we want to know if they’re okay,’ she said.\nCelebrity reference: ‘She said: “my mother’s going to ring, I died and she wants to get in contact with me”,’ Mrs Erwin said of the spirit girl who sung Kylie Minogue\nSinging spirits: Spirits have also sung Elvis Presley songs (left) or performed Imagine by John Lennon (right)\nSpeaking to loved ones who have passed away is just one part of Mrs Erwin’s job as a psychic, medium, clairvoyant and healer.\nThe Sydney resident performs healing, helps people sort out their lives by providing insight and works with natural therapies and hypnotherapy.\nMrs Erwin said she is also able to clear spirits who do not want to leave or are having problems ‘crossing over’ out of a person’s home.\nHelping others: As well as communicating with spirits, Mrs Erwin does healing and provides insight in to peoples' lives\nThe work can be both physically and emotionally tiring, and she often brings other energy workers along to assist.\n‘Once I was picked up and thrown across the room,’ she said.\n‘A lot of them won’t go and they’re a real menace in your home.\n‘For example things get moved around, that’s a poltergeist, rapping on the wall, the telephone rings all the time, the lights go on and off, electrical problems, plumbing problems, sewage problem or freezing cold rooms.’\nNatural abilities: She discovered her psychic and medium abilities when she was a child and was able to read Tarot cards without training\nThe big questions: People ask Mrs Erwin what happens once they die and whether they will see loved ones again\nMrs Erwin, who runs private sessions and events, said people visited her for a number of reasons.\nThe main questions people ask are what happens once they die, will they ever see a relative again, inquiries about the welfare of lost ones and an insight in to their current job or relationship.\nShe also said she has psychic abilities.\n‘I know when things are going to happen, like when the lady died across the street,’ she said.\nPsychic ability: ‘I know when things are going to happen, like when the lady died across the street,’ she said\nFor a long time Mrs Erwin tried to ignore her psychic and medium abilities and instead worked as a nurse.\n‘In the hospital I would see ghosts all the time, I knew when someone was going to die, I could see the energy coming out the tops of their heads, their aura,’ she said.\n‘I just tried to ignore it … but it never goes away.’\nInsight: Mrs Erwin tried to ignore her psychic abilities and worked as a nurse where she saw spirits leave peoples' bodies\nWarding off spirits: She said a mixture of dried gum leaves and sage could help rid spirits and toxic energy from a home\nShe said while her abilities scared her as a child, they no longer did.\nInstead she sometimes becomes angry as there is no break from the spirit world.\n‘I can’t pretend to ignore them, they’re everywhere I go,’ she said.\n'It's a really big responsibility': Mrs Erwin has written six educational books and holds a number of shows, including events for charity\nWork as a medium: She captured a photo of 'spirit orbs' found in a client's house\nHer work has seen her star on Psychic TV and she holds a number of events, including events for charity that she promotes on her Facebook page.\nShe has written six educational books, and said she has no plans to retire.\n‘It’s a really big responsibility when you throw yourself into it,’ she said.","url":"https://www.dailymail.co.uk/femail/article-3393064/Spirit-performs-Kylie-Minogue-s-Loco-Motion-medium-psychic-Kerrie-Erwin.html"}
