{"authors":["Allum Bokhari"],"date_download":"2018-10-30 21:15:40","date_modify":"2018-10-30 21:15:40","date_publish":"2015-08-15 23:01:58","description":"The Society of Professional Journalists’ debate on the GamerGate controversy had to be evacuated earlier today after the venue hosting the event was |","filename":"data/vaneerConsumption/SPJAirplayGamerGatedebatetargetedbybombthreat.json","image_url":"https://media.breitbart.com/media/2015/08/Screen-Shot-2015-08-15-at-18.56.08.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_15__1540934140.html","title":"SPJ Airplay #GamerGate debate targeted by bomb threat","title_page":"SPJ Airplay #GamerGate debate targeted by bomb threat","title_rss":"NULL","source_domain":"breitbart.com","text":"The Society of Professional Journalists’ debate on the GamerGate controversy had to be evacuated earlier today after the venue hosting the event was targeted by multiple bomb threats.\nPolice arrived at the venue shortly after 2pm, interrupting a panel discussing how the media should cover GamerGate, a movement calling for improved standards in video games journalism, as well as other amorphous online movements.\nThe afternoon panel featured Breitbart editor Milo Yiannopoulos, Reason contributing editor Cathy Young and Christina Hoff Sommers, resident scholar at the American Enterprise Institute. Also present on the panel were independent game developer Derek Smart, Poynter Institute educator Ren LaFome, and prospective SPJ president Lynn Walsh.\nThe SPJ event, known as Airplay, aimed to address concerns about journalistic ethics and accurate reporting raised by the GamerGate movement, which began last September after gamers raised questions about ethical standards and groupthink in the games press.\nThis is the second time a GamerGate event has been targeted by a bomb threat. Earlier this year, a gathering of more than three hundred supporters in Washington DC had to be evacuated after a similar anonymous threat, which proved to be a hoax.\nSPJ organisers told Breitbart that the event received ten separate bomb threats before it police decided to act. The organiser had anticipated bomb threats, and had previously sought to reassure the police that such threats were unlikely to be legitimate.\nThe threats only fuelled external attention in the SPJ Airplay debate, which was already trending on Twitter in multiple countries.\nUndeterred by the need to evacuate, the organisers of Airplay took the unusual step of restarting the debate outside the venue, on the porch of a nearby property, including a mixture of panelists from the morning and afternoon sessions. Official SPJ accounts continued to livetweet the debate as it continued outside, and a video recording will also be released.\nSommers and Yiannopoulos had already departed, but provided GamerGate with copies of their speaking notes. You can listen to Yiannopoulos’s opening statement here.\nDisclosure: the author of this piece attended the debate as a panelist, and was the target of a ‘doxing’ attempt during the session","url":"https://www.breitbart.com/politics/2015/08/15/society-of-professional-journalists-gamergate-debate-suspended-by-by-bomb-threat/"}
