{"authors":[],"date_download":"2018-10-30 01:02:11","date_modify":"2018-10-30 01:02:11","date_publish":"2018-06-27 00:05:58","description":null,"filename":"data/vaneerConsumption/SpoliatedBrats.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/2015_03_10_Hillary_Clinton_by_Voice_of_America_cropped_to_collar.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861331.html","title":"Spoliated Brats","title_page":"Spoliated BratsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"My grandmother expected me to become a lawyer. I had made up my mind not to, but it took some time for me to work up the courage to give her the news. Eventually a time came when she put me on the spot and I blurted: “Grandma, I want to be a writer. There are enough Jewish lawyers!” The reaction was not at all what I had feared. She got such a kick out of the formulation she repeated it to friends for years afterward: “You heard what my grandson said? He said there are enough Jewish lawyers!”\nStill, law is a big part of my beat as a political writer, and has recently become a dominant theme in my screen writing as well. But of all the legal matters I have read up on over the years, the one that puzzles me most is the “spoliation inference.” Actually, the idea does not puzzle me at all. The basis of my astonishment is the total disappearance of this principle from the legal talk surrounding Washington scandals.\nThe spoliation inference may be used more in civil matters than in criminal, but the logic should carry in all legal matters. The reasoning is that all spoliated evidence should be assumed to have carried maximum jeopardy. That is to say, if I claim you owe me $1000 and you say you only owe me $100 and I subpoena the promissory note which is in your possession, if you destroy the note rather than deliver it, the court will assume the note said the full amount of $1000. There is an inference from the very fact that you chose to destroy it to prevent us from seeing it, that it would have proven our case against you.\nThroughout the years of the Clinton presidency, scandal after scandal featured missing and withheld evidence. Some of those items eventually came to light, such as Hillary Clinton’s billing records from the Rose Law Firm in Little Rock, Arkansas, which were somehow missing from the firm’s files and from Hillary’s personal files (we searched every nook and cranny, every crook and nanny) until some White House employee found them sitting open in one of the White House bedrooms. It was never clear why those were hidden and if the Clintons intended for them ever to be discovered.\nBut many items under subpoena were never located at all. Yet no one argued the spoliation inference, save for a few conservatives who were immediately berated by the press for thinking the worst of our dedicated First Couple. And somehow the liberal view carried the day. The most egregious example of this came during the Whitewater investigation, when special Counsel Kenneth Starr jailed Susan McDougal, wife of the Clintons’ partner in the Whitewater real estate development in Arkansas, because she refused to talk to his team. She succeeded in winning a public relations war, and getting much of the country to cheer for her in standing up to that mean old Kenneth Starr. She said she was not talking because Starr was trying to make her say bad things that were not true. So why not say the good things that were true instead of refusing to say anything?\nNow, like a bad dream that recurs with only slight variations, we are back to Inspector General reports analyzing whether the prosecutors’ decisions in choosing not to prosecute Hillary Clinton were swayed by political bias. But one thing is certain, the way the prosecutors set up their decision went like this: from the evidence we have, we are not certain there was a knowing setup of using a private email account as a clearinghouse for classified documents, since very few such documents turn up and they were generally not clearly marked as such.\nWe could accept that kind of judgment call. We could even swallow hard and call it good faith tempered by discretion. But only when we consider the evidence that is PRESENT. Once we use the Spoliation Inference, we can assume that every single one of the 33,000 deleted emails under subpoena was in fact the most damning kind of evidence, clearly marked documents with the highest level of classification.\nPerhaps the greatest irony of all is that Hillary began her career in government on the Watergate Committee seeking to impeach the man whose most famous public utterance was: “I am not a crook.” I want to offer Hillary a plea deal. We will agree not to prosecute if she promises to reveal the full extent of her predations and depredations in a confessional autobiography: I AM A CROOK! ​","url":"https://spectator.org/spoliated-brats/"}
