{"authors":[],"date_download":"2018-10-22 21:53:55","date_modify":"2018-10-22 21:53:55","date_publish":"2014-06-06 18:17:57","description":"The spy agency cracked a joke in its inaugural tweet.","filename":"data/vaneerConsumption/SpookyCIALaunchesTwitterAccount.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_50/244586/140311-cia-hq-004_3505b0b8164d0e3808319e1ee37d7568.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_spooky-cia-launches-twitter-account-n124711_1540245235.html","title":"Spooky! CIA Launches Twitter Account","title_page":"Spooky! CIA Launches Twitter Account","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe CIA has a Twitter account — and a sense of humor, apparently.\nThe spy agency began tweeting on Friday and racked up more than 35,000 followers in its first half-hour. By late afternoon, it had more than 100,000.\nIt kicked things off with an inside joke: \"We can neither confirm nor deny that this is our first tweet.\" That tweet was quickly retweeted tens of thousands of times.\nThe CIA's Twitter is only following a couple of dozen other accounts, all government agencies.\nOr so they say.\nThe CIA, which already has Flickr and YouTube accounts, also joined Facebook on Friday.\n“By expanding to these platforms, CIA will be able to more directly engage with the public and provide information on CIA’s mission, history, and other developments,” CIA Director John Brennan said in a statement.\n“We have important insights to share, and we want to make sure that unclassified information about the Agency is more accessible to the American public that we serve, consistent with our national security mission.”\nThe CIA said it couldn't get on Twitter sooner because someone else had its handle — @CIA.\n\"There was someone out there impersonating CIA via Twitter. Earlier this year, CIA filed an impersonation complaint with Twitter and they secured the @CIA account for us, which is routine for government agencies,\" spokesperson K. Jordan Caldwell said.\n\"This has been a lengthy process. It’s been in the works for a long time.”\nReaction to the CIA's catapult into the world of social media was bemused.\nThe FBI's New York office tried to get in on the game by recycling the CIA's own wisecrack in a reply.\n— Tracy Connor","url":"https://www.nbcnews.com/news/us-news/spooky-cia-launches-twitter-account-n124711"}
