{"authors":["Thomas Colson"],"date_download":"2018-10-30 23:10:23","date_modify":"2018-10-30 23:10:23","date_publish":"2016-12-08 00:00:00","description":"Profits at the retailer plummeted by over 50%, according to its half year report.","filename":"data/vaneerConsumption/SportsDirectinterimresultsProfitsdowndealwithMikeAshleysdaughterand40millionplane.json","image_url":"https://amp.businessinsider.com/images/584935c0dd089536448b4e5b-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_sports-direct-profits-down-mike-ashley-daughter-corporate-plane-2016-12_1540941023.html","title":"Sports Direct interim results: Profits down, deal with Mike Ashley's daughter and £40 million plane","title_page":"    Sports Direct interim results: Profits down, deal with Mike Ashley's daughter and £40 million plane - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Sports Direct founder Mike Ashley outside his Shirebrook warehouse Thomas Colson LONDON — Sports Direct is buying a £40 million corporate plane and doing a makeup deal with Mike Ashley's daughter, its half-year report reveals.\nThe report, released on Thursday, says that the firm will take delivery of a $51.1 million (£40.25 million) corporate plane within weeks. It will join the fleet of corporate vehicles, which includes a helicopter Mike Ashley uses to fly to work.\nThe budget sportswear retailer has also struck a licensing deal with makeup brand SPORT FX, which is owned by a company where Matilda Ashley is a director. Matilda is the daughter of Sports Direct founder Mike Ashley.\nThe arrangement is the latest in a string of deals involving Ashley's family members. In August, Sports Direct was found to be paying hundreds of thousands of pounds to a company run by Ashley's brother for making international deliveries on behalf of the retailer. The Financial Reporting Council (FRC) has since announced that it is investigating Sports Direct's auditors for failing to disclose the arrangement as a \"related party.\"\nSports Direct says in Thursday's update that the deal was done \"under market terms and makes good commercial sense.\"\nAshley was also forced to defend himself in January after he gave his daughter's boyfriend a £10 million loan on behalf of the company and a high-powered job managing property for Sports Direct.\nMatilda Ashley's company Double Take will get no royalties or other fees until at least September 2019, Sports Direct says, when the terms of the deal will be reassessed.\nSports Direct's interim report also revealed a 57% slump in half-year profits to £71.6 million, despite a 14.2% rise in revenue to £1.63 billion. The profit slump has hit shares hard, with shares down over 7% at close to 10.20 a.m. GMT (5.20 a.m. ET): Investing.com Sports Direct chairman Keith Hellawell blamed an \"extreme political, union and media campaign\" for the profit slump, saying it has \"damaged its reputation and influenced our customers.\" The company is reeling from a year rocked by scandal, with allegations of abusive working practices and numerous PR gaffes.\nHellawell questioned whether this \"intense scrutiny is all ethically motivated,\" saying: \"The Board accepts responsibility for our shortcomings, but there has also been disproportionate, inaccurate and misleading commentary.\"\nSports Direct's governance has come under scrutiny from MPs with Mike Ashley admitting the company has become too big for him to control solely. (Despite this, he has taken on the role of CEO since making those comments.) Sports Direct announced on Thursday that veteran banker David Brayshaw is joining the board as a non-executive director and joining the company's audit committee.\nAlso on Thursday, the FRC wrapped up an earlier investigation into Sports Direct, which probed why the firm failed to discuss the development and performance of the firm's international stores in its last Annual Report. The FRC said that Sports Direct had agreed to include more detailed commentary in future reports, and considered the matter \"concluded.\"","url":"https://www.businessinsider.com/sports-direct-profits-down-mike-ashley-daughter-corporate-plane-2016-12"}
