{"authors":["Jack Gaughan For Mail Online"],"date_download":"2018-10-22 23:51:22","date_modify":"2018-10-22 23:51:22","date_publish":"2016-01-28 13:07:01","description":"How is each Premier League forward line shaping up as the season edges towards the run in? Sportsmail's JACK GAUGHAN takes a look and rates each attack...","filename":"data/vaneerConsumption/SportsmailrateseverystrikeforceinthePremierLeague.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA3BE400000578-0-image-a-49_1453983316729.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420857_Crystal-Palace-brought-Emmanuel-Adebayor-try-bolster-struggling-attack-best-strikeforce-Premier-League-Sportsmail-rates-one_1540252282.html","title":"Sportsmail rates every strikeforce in the Premier League","title_page":"Sportsmail rates every strikeforce in the Premier League | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Crystal Palace have swooped for Emmanuel Adebayor in a bid to boost a faltering strikeforce that has struggled badly for goals in the Premier League this season.\nThe Eagles are not the only club to spend big in an attempt to boost their fortunes in front of goal in the second half of the season. Bournemouth have signed Benik Afobe and Lewis Grabban, Southampton swooped for Charlie Austin and Chelsea have gambled on a loan deal for Alexandre Pato.\nBut how is each Premier League forward line shaping up ahead as the season edges towards the run in? Sportsmail takes a look and rates each attack...\nARSENAL\nOlivier Giroud - 9/10 (32 appearances, 18 goals)\nBecoming that striker capable of winning a Premier League title and is now a talisman for Arsenal.\nDanny Welbeck - n/a (0 apps, 0 goals)\nInjured for the entire season, hoped to be back in the coming months. Dangerous when fit.\nTheo Walcott - 7 (25 apps, 5 goals)\nTricky customer but the argument that he does not score enough goals holds weight.\nAVERAGE: 8\nArsenal's strikeforce has been led by Theo Walcott (left) and Olivier Giroud this season\nASTON VILLA\nRudy Gestede - 5 (26 apps, five goals)\nHas had his moments in a Villa shirt - the winner at Bournemouth and equaliser against Leicester. Struggling in a struggling side.\nGabriel Agbonlahor - 2 (10 apps, 0 goals)\nFrozen out for the majority of the campaign, hasn’t scored and time with the club is drawing to a close.\nLibor Kozak - 1 (5 apps, 0 goals)\nLooked to be leaving, then he wasn’t, and could now be off again. Awful against West Brom.\nJordan Ayew - 6 (23 apps, five goals)\nA rare bright spot in Aston Villa's season. Regularly looks to be their only player capable of finding the net.\nAVERAGE: 3.5\nJordan Ayew has been one of Aston Villa's more impressive players as they've struggled this season\nBOURNEMOUTH\nBenik Afobe - 7 (3 apps, 2 goals)\nToo early to make any judgments but has started pretty well for Eddie Howe. Could be a force.\nGlenn Murray - 6 (19 apps, 4 goals)\nLooks a decent signing on the surface and will go down in Cherries folklore for that winner at Chelsea.\nCallum Wilson - 6 (7 apps, 5 goals)\nSo unlucky to be struck down by injury and had been scoring goals up until that point, including a hat-trick at West Ham.\nTokelo Rantie - 3 (6 apps, 0 goals)\nJust not impacting on their season.\nLewis Grabban - 6 (2 apps, 0 goals)\nBack at Bournemouth for a huge fee with much to prove.\nAVERAGE: 5.6\nBenik Afobe has scored twice in three games since joining Bournemouth earlier this month\nCHELSEA\nDiego Costa - 6 (27 apps, 10 goals)\nRediscovering some sort of form now but cannot overlook his tantrums under Jose Mourinho.\nLoic Remy - 3 (15 apps, 3 goals)\nIf ever there was a time to step up this season was it. He hasn’t.\nAlexandre Pato - 5 (0 apps, 0 goals)\nSign of the times that Chelsea are taking such a gamble on a man who has not yet lived up to his reputation.\nRadamel Falcao - 2 (10 apps, 1 goal)\nHe’s moaned about lack of games this week. If he’d performed when called upon that might not have been such a problem.\nPatrick Bamford - 4 (0 apps, 0 goals)\nDefinitely something to work with but not deemed good enough for Crystal Palace.\nAVERAGE: 4\nDiego Costa is rediscovering some sort of form now but cannot overlook his tantrums under Jose Mourinho\nCRYSTAL PALACE\nEmmanuel Adebayor - 5 (0 apps, 0 goals)\nGoing to go one way or the other - could be a deluge of goals from Adebayor or just drama.\nConnor Wickham - 5 (12 apps, 1 goal)\nAlan Pardew has faith in Wickham, whose hold-up play is improving. One goal all season though.\nFraizer Campbell - 3 (9 apps, 1 goal)\nJust not happened for him this year. Could be off this week.\nDwight Gayle - 3 (10 apps, 4 goals)\nAgain, should be banging them in - even if the supply is occasionally wayward - but can’t find consistent form.\nMarouane Chamakh - 4 (9 apps, 0 goals)\nPardew loves the Moroccan and so do the supporters, he offers something different but not goals.\nAVERAGE: 4\nFormer Tottenham and Arsenal striker Emmanuel Adebayor joined Crystal Palace on a free transfer this week\nEVERTON\nRomelu Lukaku - 8 (29 apps, 19 goals)\nHolds this Everton team together in an attacking sense. Well worth the money they splurged.\nArouna Kone - 6 (25 apps, 6 goals)\nIn and out, can go through spells where he is superb. Equally, Kone can be bafflingly poor.\nAVERAGE: 7\nRomelu Lukaku has been one of the stars of the season in the Premier League for Everton\nLEICESTER CITY\nJamie Vardy - 9 (25 apps, 16 goals)\nWhat a season he’s had. Lively, eye for a goal and never stops running.\nShinji Okazaki - 7 (24 apps, 5 goals)\nA very shrewd customer, gets enough goals to justify involvement and harries defenders.\nLeonardo Ulloa - 6 (21 apps, 2 goals)\nGives Leicester a different option, can come short or long.\nAVERAGE: 7.3\nLeicester striker Jamie Vardy has been impressive up front so far this campaign\nLIVERPOOL\nDaniel Sturridge - 5 (6 apps, 4 goals)\nWhen fit one of the most dangerous strikers in the division. He’s never fit.\nChristian Benteke - 5 (27 apps, 7 goals)\nHas found life tough at Anfield. Has chipped in with a few goals but doesn’t exude confidence.\nDanny Ings - 6 (8 apps, 3 goals)\nJust started to really hit the ground running after the summer move when injury ruled him out for the season. Something to build on though.\nDivock Origi - 5 (16 apps, 4 goals)\nScintillating during that hammering of Southampton in the Capital One Cup. Until then he’d been average and it’s been largely the same after.\nRoberto Firmino - 7 (28 apps, 5 goals)\nLiverpool’s biggest threat going forward in recent weeks - beginning to kick on.\nAVERAGE: 5.6\nLiverpool striker Christian Benteke has found life tough so far at Anfield since joining in the summer\nMANCHESTER CITY\nSergio Aguero - 9 (23 apps, 16 goals)\nNo better striker in English football. Sensational.\nWilfried Bony - 6 (23 apps, 8 goals)\nCan produce and has started to more often, particularly in the Champions League against Borussia Monchengladbach last month.\nKelechi Iheanacho - 7 (17 apps, 5 goals)\nA very strong start to life at the top. Winner at Palace and looks to have a bright future.\nAVERAGE: 7.3\nSergio Aguero celebrating scoring for Manchester City against Everton in the Capital One Cup semi-final\nMANCHESTER UNITED\nWayne Rooney - 6 (28 apps, 12 goals)\nUnited fans have been highly critical of Rooney, but where would Louis van Gaal’s side be without his goals?\nAnthony Martial - 6 (30 apps, 8 goals)\nRecord does not reflect the menace he’s shown - a shining light and is still learning the game.\nAVERAGE: 6\nWayne Rooney and Anthony Martial celebrate Manchester United's winner against Swansea\nNEWCASTLE UNITED\nAleksandar Mitrovic - 6 (21 apps, 4 goals)\nAlready a cult figure at Newcastle. Jury remains out on him though.\nPapiss Cisse - 4 (13 apps, 2 goals)\nCurrently ruled out but has not scored nearly enough goals since he burst onto the Premier League scene.\nEmmanuel Riviere - 2 (1 app, 0 goals)\nLooked one of the worst buys in Premier League history last year. Back from injury now but hopes not high for him.\nAyoze Perez - 6 (24 apps, 5 goals)\nHas that jink Newcastle crave and popped up with a few important goals. Fans still left wanting more.\nIvan Toney - 4 (4 apps, 0 goals)\nCame on against Manchester United but 19-year-old likely to go back out on loan.\nAVERAGE: 4.4\nAleksandar Mitrovic in action for Newcastle during their defeat at Watford last Saturday\nNORWICH CITY\nDieumerci Mbokani - 5 (16 apps, 4 goals)\nA strange one, looks menacing in the air and has nodded in a couple of rousing goals but you always feel there’s more to give.\nSteven Naismith - 6 (1 app, 1 goal)\nCould well be a super signing, already netting against Liverpool. Wasn’t given a run by Roberto Martinez at Everton.\nCameron Jerome - 5 (24 apps, 3 goals)\nSolid central striker and will give you six out of 10 most weeks.\nKyle Lafferty - 4 (3 apps, 1 goal)\nNever been able to replicate his international form for clubs and Alex Neil has used the Northern Irishman sparingly.\nAVERAGE: 5\nSteven Naismith scored on his debut for Norwich in their defeat against Liverpool last Saturday\nSOUTHAMPTON\nGraziano Pelle - 6 (23 apps, 9 goals)\nHas netted this year but not hit the heights of his first campaign at St Mary’s.\nCharlie Austin - 8 (1 app, 1 goal)\nA goalscorer who a few other clubs should have snapped him up. Showed that at Old Trafford.\nJay Rodriguez - 6 (12 apps, 3 goals)\nUnfair to truly judge after coming back from a horror injury then picking up another long-term knock.\nShane Long - 7 (21 games, 8 goals)\nWilling runner, gets enough goals to warrant consistent inclusion.\nAVERAGE: 6.75\nCharlie Austin (left) celebrates his winner at Manchester United with Southampton team-mate Shane Long\nSTOKE CITY\nMame Biram Diouf - 6 (17 apps, 3 goals)\nHas suffered this year after learning his mother died in the September Hajj crush.\nPeter Crouch - 5 (11 apps, 2 goals)\nNot picked as much and slipped down the pecking order.\nJoselu - 7 (16 apps, 2 goals)\nHas come into his own in recent weeks and looking the real deal.\nBojan - 7 (21 apps, 5 goals)\nMagic for the most part, although form has dripped over the last month.\nJon Walters - 7 (24 apps, 7 goals)\nOften picked out wide nowadays but can do a job through the middle when called up. Mr Reliable.\nAVERAGE: 6.4\nStoke forward Bojan (right) attempts to take the ball away from Liverpool's Roberto Firmino\nSUNDERLAND\nFabio Borini - 3 (15 apps, 2 goals)\nTwo goals, both in away defeats, is not a good enough return.\nJermain Defoe - 7 (20 apps, 12 goals)\nBailed Sunderland out on a few occasions this term - 12 in 20 in all competitions.\nDame D’Doye - 6 (0 apps, 0 goals)\nSigned on loan from Trabzonspor and previously did OK at Hull City.\nSteven Fletcher - 3 (18 apps, 4 goals)\nSam Allardyce wants rid and has been poor.\nDuncan Watmore - 6 (19 apps, 3 goals)\nGoing to be a star, gives everything for Sunderland.\nAVERAGE: 5\nJermain Defoe has bailed out Sunderland on a few occasions with his goals this season\nSWANSEA\nBafetimbi Gomis - 4 (23 apps, 6 goals)\nSpent most of his season offside and, but for an early purple patch, has found life tough.\nEder - 2 (17 apps, 0 goals)\nSeventeen games this season. No goals.\nAndre Ayew - 7 (23 apps, 8 goals)\nThe real spark for Swansea this year and scorer of some vital goals - not least at Everton last weekend.\nMarvin Emnes - 3 (3 apps, 1 goal)\nUsed just once in the Premier League.\nAVERAGE: 4\nAndre Ayew celebrates scoring the winner for Swansea at Everton in the Premier League last Sunday\nTOTTENHAM\nHarry Kane - 8 (31 apps, 16 goals)\nJust continuing where he left off - could fire Spurs into the Champions League.\nSon Heung-Min - 7 (23 apps, 5 goals)\nA favourite with supporters and has operated centrally as well as wide when needed.\nClinton N’Jie - 5 (13 apps, 0 goals)\nNeeds time and yet to start a Premier League game. Currently injured.\nAVERAGE: 6.7\nStriker Harry Kane (right) celebrating with fellow Tottenham forward Son Heung-Min\nWATFORD\nOdion Ighalo - 8 (24 apps, 14 goals)\nA sensation. The Iggy Chop is marvellous, his eye for goal clinical.\nTroy Deeney - 7 (24 apps, 7 goals)\nTerrific foil for Ighalo and has netted a few times himself.\nObbi Oulare - 5 (2 apps, 0 goals)\nNot been given the opportunity because of Ighalo and Deeney’s form.\nAVERAGE: 6.7\nTroy Deeney (left) and strike partner Odion Ighalo have been impressive for Watford this season\nWEST BROM\nSalomon Rondon - 4 (25 apps, 4 goals)\nTaking his time to get with English football - four goals in all competitions.\nSaido Berahino - 4 (19 apps, 4 goals)\nDoesn’t want to be at The Hawthorns. Barely playing at The Hawthorns, either.\nVictor Anichebe - 4 (6 apps, 0 goals)\nNot really used by Tony Pulis during a frustrating stint at West Brom.\nRickie Lambert - 4 (22 apps, 1 goal)\nAgain, not producing enough for Pulis.\nAVERAGE: 4\nSaido Berahino laughs as he sat on the bench for West Brom against Aston Villa\nWEST HAM\nAndy Carroll - 6 (15 apps, 3 goals)\nWhen fit looks sharp, but doesn’t spend enough time in claret and blue.\nDiafra Sakho - 6 (14 apps, 5 goals)\nInjuries are stunting this campaign, Sakho’s time will come again. Will be huge for West Ham in the Olympic Stadium.\nEnner Valencia - 7 (11 apps, 5 goals)\nAnother to have succumb to knocks - missed the season’s first three months - but was brilliant against Manchester City.\nNikica Jelavic - 4 (13 apps, 2 goals)\nJust not doing it, used as back-up.\nAVERAGE: 5.75","url":"https://www.dailymail.co.uk/sport/football/article-3420857/Crystal-Palace-brought-Emmanuel-Adebayor-try-bolster-struggling-attack-best-strikeforce-Premier-League-Sportsmail-rates-one.html"}
