{"authors":[],"date_download":"2018-10-30 01:12:06","date_modify":"2018-10-30 01:12:06","date_publish":"2016-11-19 00:00:00","description":null,"filename":"data/vaneerConsumption/SpottheDemocratracists.json","image_url":"https://www.americanthinker.com/images/bucket/2016-11/197426.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_11_spot_the_democrat_racists_1540861926.html","title":"Spot the Democrat racists","title_page":"Spot the Democrat racists","title_rss":"NULL","source_domain":"americanthinker.com","text":"Civil rights lawyers told The Daily Caller that President Barack Obama 's 2012 campaign managers may have violated employment law by hiring an overwhelmingly white office staff for his campaign headquarters in Chicago.\nDespite all the Democratic babble of the value of diversity, not to mention its siblings pluralism and multiculturalism, for the Democrats, it is babble – meaningless babble that sounds good to accuse others of lacking. But for themselves – hmm, not so much. Nothing demonstrates this as well as the pale skin, so to speak, of the employees and volunteers of President Barack Hussein Obama (D)'s presidential campaign office in Chicago back in 2012.\nThat skewed workforce is starkly visible in an April photo released by Obama's Chicago office, which shows roughly 100 of the office's staff. Only two of the people in the photo, far in the back, are clearly African-American, far below their 13 percent of the national population, and their 33-percent representation in Chicago.\nThis is despite – or because of? – the race of Obama, which is African-American.\nHillary Rodham Clinton, the Democratic candidate for president, has sadly embraced this bigotry, judging by the photos. Kristinn Taylor has posted on The Gateway Pundit:\nPhotos: Black Workers Scarce at Clinton HQ as Official Tweets 'America is Killing Black People' The Hillary Clinton campaign posted photos of workers at the campaign's Brooklyn headquarters Monday night that shows hardly any Black workers. Four photos posted by Addisu Demissie, Clinton's National Voter Outreach and Mobilization Director, shows dozens of mostly white workers. Also Monday night, Jessica Morales Rocketto, Clinton's Digital Organizing Director, posted that \"America is killing Black people.\" Demissie's tweet was meant as a jab at the Trump campaign over a photo that alleged to show an empty New Hampshire campaign office, but the photos posted of the Clinton campaign office show a stunning lack of diversity for a campaign that is desperately trying to motivate African-Americans to get out and vote for Clinton. (snip) This picture shows about thirty people with only one African-American, a male, readily visible in the foreground.\nClinton, who is a white, elderly female, has numerous white females plus males, all who are definitely not elderly, hard at work on her campaign in these pictures. Oh, and not a wheelchair or cane in sight.\nIs she ageist and ableist as well as racist?\nWith Democrats, all forms of bigotry, warped as inclusiveness, are possible.","url":"https://www.americanthinker.com/blog/2016/11/spot_the_democrat_racists.html"}
