{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:46:01","date_modify":"2018-10-30 21:46:01","date_publish":"2017-01-02 15:29:51","description":"On the heels of the closing of The Cockentrice in early November 2016\n, Megan and K...","filename":"data/vaneerConsumption/SpottedTrotterandFranklyhaveclosedatKrogStreetMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/02/Images/WPIMAGE_cmgajcfoodandmore_12797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_sp_4fb6d4168e326d2e007ea3ccf2fe1b0c__1540935961.html","title":"Spotted Trotter and Frankly have closed at Krog Street Market","title_page":"Spotted Trotter and Frankly have closed at Krog Street Market","title_rss":"NULL","source_domain":"ajc.com","text":"On the heels of the closing of The Cockentrice in early November 2016 , Megan and Kevin Ouzts have decided to close their related hot dog stand, Frankly, and butcher shop stall, The Spotted Trotter at Krog Street Market.\nBefore opening The Cockentrice in January 2015, Kevin Ouzts, an Atlanta native, was best known as the chef behind the boutique charcuterie and butcher shop, the Spotted Trotter in Kirkwood , which remains open.\nThe final day for the two businesses was Dec. 31, according to a statement from Krog Street Market, which included word that \"Megan and Kevin Ouzts have decided to close Frankly and The Spotted Trotter at Krog Street Market after determining the need for only one brick and mortar location to complement their wholesale business.\"\nMore news from the statement: \" Castellucci Hospitality Group has confirmed they will add the market stall to their recently announced KSM footprint . Details regarding their market stall and restaurant concept will be shared in the new year.\"","url":"https://www.ajc.com/blog/atlanta-restaurants/spotted-trotter-and-frankly-have-closed-krog-street-market/2VuWco4Ij55H71TDbpFzMK/"}
