{"authors":["Brian Viner For The Daily Mail"],"date_download":"2018-10-22 20:28:33","date_modify":"2018-10-22 20:28:33","date_publish":"2016-01-29 01:48:57","description":"To get five stars, a film should surely be one of two things: one you absolutely have to see, or one that is unimprovable. Rarely does a movie fulfil both - but Spotlight does, writes BRIAN VINER.","filename":"data/vaneerConsumption/SpotlightisthebestfilmyoullseeALLyearwritesBRIANVINER.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/308EEF0800000578-0-image-a-19_1454032103211.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422085_The-best-film-ll-year-Exquisitely-acted-thriller-reporters-exposing-abuse-priests-unmissable_1540240113.html","title":"Spotlight is the best film you'll see ALL year, writes BRIAN VINER","title_page":"Spotlight is the best film you'll see ALL year, writes BRIAN VINER | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spotlight\nRating:\nVerdict: Troubling but superb\nJudging films, as everyone knows, is a highly subjective business. One person’s unmissable is another’s unwatchable. But with three five-star assessments dished out here in recent weeks (The Revenant, Room and now Spotlight), it seems timely to consider what, from where I’m sitting, makes a film deserving of the full caboodle of stars.\nIt should surely be one of two things — a film you absolutely have to see, or one that is unimprovable. Only rarely does a movie come along that fulfils both those criteria, but I think Spotlight does.\nScroll down for videos\nSpotlight, starring Rachel McAdams as Sacha Pfeiffer, Mark Ruffalo as Michael Rezendes and Brian díArcy James as Matt Carroll, tells the tale of how the Boston Globe exposed the long, systematic concealment by the Catholic Church of the sexual abuse of children by almost 100 priests in the area\nIt tells a seismically important and troubling story with such integrity, such a lack of showiness on the part of the actors and their director, Tom McCarthy, that it would unequivocally get my vote, if only I had one, for Best Picture at next month’s Academy Awards. In both tone and theme, it is strongly reminiscent of 1976 film All The President’s Men: a true story of investigative reporters doggedly uncovering a scandal. But this scandal is far more shocking even than the Watergate conspiracy.\nIn 2002, the Boston Globe exposed the long, systematic concealment by the Catholic Church of the sexual abuse of children by almost 100 priests in the area.\nThe film tells the story not of the paedophilia, but of the investigation. It is really nothing more than what you might call a press procedural, but it is one of the very best.\nMichael Keaton is Walter ‘Robby’ Robinson, who runs the Globe’s ‘Spotlight’ special investigations team. He is Bostonian born and bred, part of the fabric of the city, with connections everywhere, making him the polar opposite to the Globe’s new editor Marty Baron (Liev Schreiber).\nBaron has arrived from Florida, is Jewish, unmarried, unclubbable, and, on being offered Boston Red Sox tickets, reveals, most blasphemously of all, that ‘to be honest, I’m not much of a baseball fan’.\nAs it turns out, however, Baron’s outsider status makes him exactly the right man to ignite the investigation. He wants to know why nobody at the paper has ever dug further into the case of a local paedophile priest, and asks the Spotlight team to do so.\nn both tone and theme, it is strongly reminiscent of 1976 film All The President’s Men: a true story of investigative reporters doggedly uncovering a scandal, writes BRIAN VINER\nGradually, Robinson and his most tenacious reporter, Mike Rezendes (Mark Ruffalo), become as committed to uncovering the truth as Robert Redford and Dustin Hoffman ever were, playing Woodward and Bernstein in All The President’s Men.\nAnd the truth is that there is not one child-abusing priest in Boston but dozens. Yet they have all been quietly moved or put out to pasture.\nSpotlight is 'exquisitely' acted, with McAdams (pictured) and Ruffalo nominated for Oscars\nCardinal Bernard Law (Len Cariou), whose moral authority in Boston is nigh-on absolute, has presided over a cover-up.\nBut to expose it, the Globe and its Spotlight team must take on the Church, well aware that 53 per cent of the paper’s subscriber base is Catholic. Even if they can unearth the facts, it might be risky telling the story.\nThe doughty little posse of reporters, one of whom, Sacha Pfeiffer (Rachel McAdams), has the added burden of a devoutly religious Catholic grandmother, cannot hope for support from the Establishment.\nInstead, they must enlist the help of those who have been abused, and of the spiky lawyer representing them. This is Mitchell Garabedian (Stanley Tucci), who knows what the journalists are up against.\nThe Church doesn’t address issues in terms of years or even decades, he says. ‘The Church thinks in centuries. Have you got the resources?’\nThat all this is as richly compelling as it is, without any car chases or fights, or so much as a single late-night meeting with an anonymous informant in a shadowy car park, owes much to the searingly intelligent screenplay by McCarthy and his co-writer Josh Singer.\nA quiet, sad explanation by one victim of how predatory priests operate is a scene as heart-thumpingly tense as any in a bombs-and- bullets thriller.\nBut it is also exquisitely acted. Ruffalo and McAdams have both been nominated for Oscars, but it could just as easily be Keaton or Schreiber or Tucci, all of them rising to what paradoxically must be one of the biggest acting challenges of all — playing dedicated professionals doing the job expected of them. In real life, the journalists depicted won a deserved Pulitzer Prize. Now, they have the film the story deserves.\nThe 33 (12a)\nRating:\nVerdict: Flawed but moving\nThe same is not quite so of the 33 Chilean men who in 2010 spent 69 days underground, first waiting to die and then to be rescued, after the San Jose gold mine caved in.\nWhen eventually they were located, 2,300 ft underground, and brought one by one to the surface in a capsule not much bigger than a coffin, more than a billion people around the world were watching on TV.\nIn making her film, The 33, Mexican director Patricia Riggen confronted a number of challenges that she doesn’t entirely overcome.\nThe 33, starring Antonio Banderas, tells the story of the Chilean miners stuck underground for 69 days\nThe main one is language. Her cast speak broken, South American-accented English, which is all very well if you’re Antonio Banderas, who plays the self-styled leader of the trapped miners, Mario Sepulveda, but the engineer in charge of the rescue operation, Andre Sougarret, is played by Gabriel Byrne. The absurdity of an Irishman speaking English with a Chilean accent is difficult to overlook.\nRiggen also does her best, without entirely succeeding, to give her miners enough of a backstory to make us really care about them, even though we know how the narrative ends.\nSo we get four or five rushed personal portraits before they head down into the mine on the fateful day, and then, in the film’s biggest misjudgment, a lavish dream sequence in which, deep underground and close to starvation, they are each served their favourite dinner by a beloved wife, girlfriend or mother.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422085/The-best-film-ll-year-Exquisitely-acted-thriller-reporters-exposing-abuse-priests-unmissable.html"}
