{"authors":[],"date_download":"2018-10-22 20:57:35","date_modify":"2018-10-22 20:57:35","date_publish":"2014-05-05 12:25:22","description":"The continued spread of polio is a global health emergency and requires extraordinary measures to stop it, the World Health Organization says.","filename":"data/vaneerConsumption/SpreadingPolioaGlobalHealthEmergencyWHOSays.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/420341/140505-polio-afghanistan-kabul-1020a_075221a02e8d6bad0d87a7c34ec07e5f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-care_spreading-polio-global-health-emergency-who-says-n97096_1540241855.html","title":"Spreading Polio a Global Health Emergency, WHO Says","title_page":"Spreading Polio a Global Health Emergency, WHO Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe spread of polio is an international health emergency that requires “extraordinary measures” to control it, the World Health Organization said Monday.\nThree countries are spreading the virus to the rest of the world and need to act immediately to stop it, by vaccinating the population and vaccinating travelers, WHO said.\n“If unchecked, this situation could result in failure to eradicate globally one of the world’s most serious vaccine preventable diseases. It was the unanimous view of the Committee that the conditions for a Public Health Emergency of International Concern have been met,” WHO said in a statement.\n“If the virus is re-introduced into a polio-free area it could become endemic again.\"\n“Pakistan, Cameroon, and the Syrian Arab Republic pose the greatest risk of further wild poliovirus exportations in 2014,” it added. The war in Syria has interrupted vaccination and allowed the virus to return. In Pakistan, Taliban militants have attacked workers trying to vaccinate children.\nWHO said 417 cases of the disease, which was once nearly eradicated, were reported in 2013. The virus only infects human beings and WHO has been close many times to completely eradicating polio, like smallpox was eradicated in the 1970s. Currently, vaccination efforts cost about $1 billion a year.\nBut conflict often intervenes, like it has in Pakistan and Syria, making it difficult to vaccinate children.\nWHO said Pakistan, Cameroon and Syria should make sure that all residents and long-term visitors receive a dose of polio vaccine at least a month before traveling internationally and should require proof of vaccination to travel.\n“If the virus is re-introduced into a polio-free area it could become endemic again,” WHO’s Dr. Bruce Aylward told reporters on a conference call. “Indeed it could become endemic again in the world.”\nThere is clear evidence that travelers are spreading the virus, WHO says\n\"At end-2013, 60 percent of polio cases were the result of international spread of wild poliovirus, and there was increasing evidence that adult travelers contributed to this spread,\" WHO said. \"During the 2014 low transmission season there has already been international spread of wild poliovirus from three of the 10 states that are currently infected.\"\nThe seven other countires that still have polio -- Afghanistan, Equatorial Guinea, Ethiopia, Iraq, Israel, Somalia and Nigeria -- also need to step up vaccination efforts, WHO said.\nThe virus has been found in the sewers in Israel, although not in people. The vaccine that is usually used keeps people from getting sick but allows the virus to live in the gut, so it can be found in raw sewage. Israeli officials have redoubled vaccination efforts.\n\"In polio the best defense is a good offense.\"\nThe last time WHO declared a global health emergency was when the H1N1 swine flu virus appeared in 2009. It killed more than a quarter of a million people.\nWHO's action is mostly bureaucratic and doesn't place any legal obligation on the countries named. Some vaccine experts said it's most important to keep up vaccination efforts in the worst-hit areas.\n\"In polio the best defense is a good offense,\" said Dr. Walt Orenstein, vaccine expert at Emory University in Atlanta who is former head of the U.S. National Immunization Program. The main goal should be to stop the day-to-day transmission in Pakistan, Syriaa and Cameroon, he said. \"Anything being done to prevent spread out of those countries, while important, must in no way interfere with the effort.\"\nAnother problem is that polio vaccines are not perfect. The oral vaccine, given as drops, is made with a \"live\" virus and is very effective. But in very rare cases it can cause polio and paralyze newly vaccinated children.\nAnother vaccine is injected and is far safer, but it doesn't provide quite as much immunity. So, Orenstein says, the best approach is to give kids a shot first and then, once they are protected, follow up with an oral vaccine to really keep the virus at bay.\nAt this point, he said, any booster is better than no booster.\n\"There is no reason for the United States to change its vaccination policy,\" Orenstein said. \"But I do think it is important to try and stop anybody from traveling out of infected countries.\"\nPolio has been found Iraq, where it spread from neighboring Syria. The virus has spread to Afghanistan from Pakistan and to Equatorial Guinea from neighboring Cameroon.","url":"https://www.nbcnews.com/health/health-care/spreading-polio-global-health-emergency-who-says-n97096"}
