{"authors":["Luke Barnes For Mailonline"],"date_download":"2018-10-23 02:34:25","date_modify":"2018-10-23 02:34:25","date_publish":"2017-03-16 13:12:19","description":"Astonishing footage has emerged showing a bikini-clad woman (pictured) twerking on top a moving car as it speeds down the MacArthur freeway in Miami, even managing to stretch out her hands.","filename":"data/vaneerConsumption/SpringBreakgirltwerksonamovingcarinMiami.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E543EF300000578-0-image-a-24_1489668516838.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320028_Moment-woman-twerks-MOVING-CAR_1540262065.html","title":"Spring Break girl twerks on a moving car in Miami","title_page":"Spring Break girl twerks on a moving car in Miami | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The spirit of Spring Break is alive and well on the freeways of Miami, Florida.\nBizarre footage has emerged showing a young woman twerking on top a moving car as it speeds off into the sunset.\nThe scantily-clad woman seems completely unfazed by the passing cars or the fact that she's only a slip away from a potentially deadly fall onto the MacArthur Causeway.\nAt one point she even manages to go hands free, lifting her arms up to her hair before coming back down to grip the roof of the car.\nThe video was first posted on Twitter by filmmaker Billy Corben, who had it passed along to him by a friend.\nCorben said: 'For anyone who thought that twerking had its moment and now it's gone, that is clearly not the case.\n'As social media has taught us, twerking is forever; it is a timeless tradition.'\nIn a daring moment the women lifts up her hands and balances herself on the roof of the car\nThe video has clearly captured the imagination of would-be-twerkers and Floridians alike. It's been viewed nearly 1.2 million time since it was uploaded on March 13.\nFlorida Highway Patrol spokeswoman Lieutenant Yosdany Veloz told Miami New Times that they have 'no record' of the incident.\nThe bizarre incident has been viewed nearly 1.2 million times online\nPerhaps fellow motorists were too wide-eyed in disbelief to phone the police.\nMiami has been inundated with thousands of college students on Spring Break over the last week.","url":"https://www.dailymail.co.uk/news/article-4320028/Moment-woman-twerks-MOVING-CAR.html"}
