{"authors":[],"date_download":"2018-10-30 18:38:33","date_modify":"2018-10-30 18:38:33","date_publish":"2016-10-04 15:55:00","description":"Tucker Meridian is planned to include Sprouts Farmers Market, DICK’s Sporting Goods, Einstein Bagels and Caribou Coffee.","filename":"data/vaneerConsumption/SproutsDICKsSportingGoodscomingtoTucker.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/04/Images/Tucker%20development%201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_slew-popular-sto_43719f1d339d339f622340a692502a7f__1540924713.html","title":"Sprouts, DICK's Sporting Goods coming to Tucker","title_page":"Sprouts, DICK's Sporting Goods coming to Tucker","title_rss":"NULL","source_domain":"ajc.com","text":"With a ground-breaking ceremony Wednesday, the newly-chartered city Tucker is celebrating its first major retail development, a 207,000-square-feet project set to feature a variety of popular stores.\nTucker Meridian, on Northlake Parkway near Lavista Road, is planned to include Sprouts Farmers Market, DICK’s Sporting Goods, Einstein Bagels, Caribou Coffee, Jimmy John’s and Newk’s Eatery, among others, according to a news release.\n“Tucker Meridian is exactly the kind of real estate development we want to attract to our city,” said Frank Auman, mayor of Tucker, which was officially incorporated last year. “It has a well-planned, attractive design and is already bringing in the kind of high-end retailers, restaurants and specialty shops our residents want.”\nThe 22-acre development, expected to open in May 2017, is being built by Ben F. Kushner Co.\nRELATED: Another big development coming to DeKalb\nRELATED: Whole Foods development approved near Decatur\nThe CEO, Kushner, said there has been “strong interest” in the center. He said the location is “superior,” as it is near \"the perimeter with easy access to I-285 and I-85, Buckhead, Midtown and the Emory area, along with close proximity to desirable neighborhoods in Northlake, Tucker and Decatur.”\nTucker is an old community, which was only officially incorporated last year, as one of the latest new jurisdictions in metro Atlanta’s cityhood movements of recent years.\nTucker-Northlake CID President Ann Rosenthal said a master plan is in place calling for new retail and dining options along the “Lavista Road/Northlake Parkway retail corridor” by Northlake Mall.\nThe groundbreaking is set for 1 p.m. Wednesday at 2175 Northlake Parkway and is expected to draw local officials, including those from the Tucker-Northlake and Tucker community improvement districts.\nThe mayor hopes it’s a big step in redeveloping the area.\n-\nMORE DEKALB DEVELOPMENT NEWS:\nWhat's with the 'eyesore' near DeKalb Farmers Market?\nCoca-Cola family mansion may become a boutique hotel [...]\n-\nLike DeKalb County News Now on Facebook. | Follow us on Twitter and Instagram.","url":"https://www.ajc.com/news/local/slew-popular-stores-restaurants-planned-one-dekalb-center/du072OPcZ0NH72CfoZJ15I/"}
