{"authors":["Associated Press"],"date_download":"2018-10-22 20:49:28","date_modify":"2018-10-22 20:49:28","date_publish":"2016-01-28 04:07:01","description":"NEW YORK (AP) — San Antonio's Gregg Popovich will coach the NBA's West All-Stars, even though Golden State has the best record in the conference. With the Wa...","filename":"data/vaneerConsumption/SpursPopovichtocoachWestinNBAAllStarGame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:3cc3eb89920846179624b206dc541c61-4vVdYopwYQ7f641721b07a858fe3-551_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419934_Spurs-Popovich-coach-West-NBA-All-Star-Game_1540241368.html","title":"Spurs' Popovich to coach West in NBA All-Star Game","title_page":"Spurs' Popovich to coach West in NBA All-Star Game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Spurs' Popovich to coach West in NBA All-Star Game\nNEW YORK (AP) — San Antonio's Gregg Popovich will coach the NBA's West All-Stars, even though Golden State has the best record in the conference.\nWith the Warriors' Steve Kerr ineligible because he coached last year and Luke Walton not receiving official credit for the team's early success, Popovich earned the nod as West coach for the fourth time.\n\"It's a pretty awesome feeling to know that you're going to be in the locker room with some of the best athletes in the world,\" Popovich said. \"That's pretty humbling. It's kind of cool.\"\nSan Antonio Spurs head coach Gregg Popovich yells at players on the bench during the second half of an NBA basketball game against the Golden State Warriors Monday, Jan. 25, 2016, in Oakland, Calif. The Warriors won 120-90. (AP Photo/Marcio Jose Sanchez)\nPopovich will coach one of his own, San Antonio Spurs forward Kawhi Leonard, who earned a starting nod in his first All-Star Game.\nThe All-Star coaches are determined by the teams with the best records in each conference two weeks before the game, which is Feb. 14 in Toronto.\nWalton led the Warriors to an NBA-record 24-0 start and was 39-4 before Kerr returned following complications from two back surgeries for last Friday's game against Indiana. However, NBA rules state that all Walton's victories earned on an interim basis actually go to Kerr, and league rules prevent coaches from participating in two consecutive All-Star games.\n\"We all got to coach it last year. Even though Luke wasn't the head coach he was on the staff and he was there,\" Kerr said Wednesday night. \"So, the rule is the rule. Maybe we'll get to go back next year.\"\nPopovich said Monday at Golden State how impressed he was with Walton's leadership and performance filling in for Kerr, Popovich's close friend.\n\"It doesn't diminish what Luke did,\" Popovich said of Kerr's return to the bench. \"Luke was amazing. He did a great job for his first go at it. I'm sure he's happy to have Steve back, too.\"\nThe league said recently it was reviewing its policy to determine if Walton would still be eligible for the All-Star spot, but announced Wednesday that it would be Popovich, who has won five NBA championships.","url":"https://www.dailymail.co.uk/wires/ap/article-3419934/Spurs-Popovich-coach-West-NBA-All-Star-Game.html"}
