{"authors":["Amitai Winehouse For Mailonline"],"date_download":"2018-10-23 02:35:45","date_modify":"2018-10-23 02:35:45","date_publish":"2017-03-10 11:51:18","description":"The Tottenham Hotspur striker Harry Kane has collected the trophy for the fourth time in his career after a sterling month in which scored four goals in his three Premier League appearances.","filename":"data/vaneerConsumption/SpursHarryKanenamedPremierLeagueplayerofthemonth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E229E6600000578-0-image-a-14_1489146673922.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301006_Spurs-Harry-Kane-named-Premier-League-player-month_1540262145.html","title":"Spurs' Harry Kane named Premier League player of the month","title_page":"Spurs' Harry Kane named Premier League player of the month | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Harry Kane has been named the Premier League player of the month for February.\nThe Tottenham Hotspur striker has collected the trophy for the fourth time in his career after a sterling month in which scored four goals in his three Premier League appearances.\nKane played a key role in Tottenham's excellent 4-0 home victory against Stoke, hitting a hat-trick as he helped Spurs continue their push towards a top-two finish.\nHarry Kane poses with the Premier League player of the month trophy on Friday morning\nFEBRUARY KEY STATS 4 Goals (2nd in PL behind Romelu Lukaku) 5 Shots on target (Joint 3rd in PL behind Pogba and Lukaku) 56 per cent Shooting Accuracy 44 per cent Goals to Shots Ratio (2nd in PL behind Jesus) [Those with 3 or more shots] 66 minutes per goal | 1 assist Data Courtesy of EA SPORTS, the Lead Partner of the Premier League. To vote in the EA SPORTS Player of the Month Award, head to www.premierleague.com\nThe England international was proud to collect the trophy, admitting that it was 'a great honour' to do so.\n'It was a good month for me and obviously for the team as well, so it's a real honour to accept this award,' he said.\nAsked about the Stoke game, he continued: 'It was a great match for us, to win 4-0 shows how well we're playing at the moment.\n'For the first goal, the ball just dropped to me in the box, so I thought I'd get a quick shot off.\n'It went through one of their player's legs and went in.\n'The second one against Stoke was technically one of the most difficult goals of my career - it's in the top five goals. With the left-foot as well, it was hard. When I watch that one back I was glad it went in.'\nKane scored four goals in his three Premier League appearances for Spurs in February\nBut he admitted the third goal relied on a spot of 'luck'. Kane also highlighted how his diet has changed since January.\n'I've got a new chef I've been working with on my nutrition to try and get me a bit leaner and a bit quicker. That seems to be working,' he continued.\nSpurs take on Millwall, where Kane half a season on loan in 2012, in their FA Cup quarter-final on Sunday.","url":"https://www.dailymail.co.uk/sport/football/article-4301006/Spurs-Harry-Kane-named-Premier-League-player-month.html"}
