{"authors":["John Hayward"],"date_download":"2018-10-30 20:43:37","date_modify":"2018-10-30 20:43:37","date_publish":"2016-02-10 22:43:24","description":"During the same laugh-a-minute Senate report where he said North Korea was a major nuclear threat, and that Iran would soon join them, and that ISIS was using the \"torrent of migrants\" from Syria to infiltrate the Western world, Director of National Intelligence James Clapper also said on Tuesday that electronic surveillance would soon be possible through nearly every device in the home. |","filename":"data/vaneerConsumption/SpyFridgeTheInternetofThingsMeetstheSurveillanceState.json","image_url":"https://media.breitbart.com/media/2016/02/smart-refrigerator-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_10__1540932217.html","title":"Spy Fridge: The Internet of Things Meets the Surveillance State","title_page":"Spy Fridge: The Internet of Things Meets the Surveillance State | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During the same Senate report where he said North Korea was a major nuclear threat and that Iran would soon join them while ISIS was using the “torrent of migrants” from Syria to infiltrate the Western world, Director of National Intelligence James Clapper also said on Tuesday that electronic surveillance would soon be possible through nearly every device in the home.\nIn other words, as Newsweek puts it, your smart fridge, smart thermostat, and smart light bulbs could soon be spying on you.\nThis isn’t really a surprising revelation, as computer experts have long warned that the “Internet of Things” is creating an immense communications network linking devices large and small. The ability of countless devices to send and receive information over the Internet offers tremendous efficiency increases, from seamless software updates to self-adjusting smart systems. Programmable thermostats give way to thermostats you don’t have to program. You can use your smartphone to tell your TVR to record that TV show you almost forgot about.\nWired imagined the possibilities for the Internet of Things to offer not just improved products and services, but entirely new industries:\nWhat can you achieve when a smart car and a smart city grid start talking to each other? We’re going to have traffic flow optimization, because instead of just having stoplights on fixed timers, we’ll have smart stoplights that can respond to changes in traffic flow. Traffic and street conditions will be communicated to drivers, rerouting them around areas that are congested, snowed-in, or tied up in construction. So now we have sensors monitoring and tracking all sorts of data; we have cloud-based apps translating that data into useful intelligence and transmitting it to machines on the ground, enabling mobile, real-time responses. And thus bridges become smart bridges, and cars smart cars. And soon, we have smart cities, and….\n… and sensors. Sensors everywhere, feeding data into the cloud. The cloud will become nearly omniscient, especially in dense urban areas. It’s easy to see dozens of possibilities for surveillance in just those two paragraphs from Wired. When your smart car rolls over that smart bridge into a smart city, some smartass at an alphabet-soup agency will know about it. Probably more than one agency, in more than one country.\nDNI Clapper is warning, to paraphrase Nietzsche: Do not gaze too long into the Internet of Things, for it gazes also into you.\n“Devices, designed and fielded with minimal security requirements and testing, and an ever-increasing complexity of networks could lead to widespread vulnerabilities in civilian infrastructures and U.S. government systems,” Clapper told the Senate Intelligence Committee. “These developments will pose challenges to our cyber defenses and operational tradecraft but also create new opportunities for our own intelligence collectors.”\nFortune recalls a similar warning coming from the CIA’s chief technology officer, Gus Hunt, in 2013:\nYou’re already a walking sensor platform… As you walk around – and remember, I told you mobile is not secure – you are aware of the fact that somebody can know where you are at all times because you carry a mobile device. Even if that mobile device is turned off. You know this I hope. Yes? No? Well you should… You guys know the Fitbit, right?… We like these things… just simply by looking at the data what they can find out is with pretty good accuracy what your gender is, whether you’re tall or you’re short, whether you’re heavy or light, but what’s really most intriguing is that you can be 100% guaranteed to be identified by simply your gait – how you walk.\nFortune and Newsweek both cite cybersecurity experts who warn that the Internet of Things isn’t terribly secure — in fact, its security tends toward the lowest common denominator, with the least-secure component offering entry to the entire system. The technology for smart devices isn’t standardized yet. Many of the players are small companies that might not survive in the long run, and their demise will leave behind products that never receive security patches.\nFortune observes that Big Brother spying on us through our smart refrigerators might be the least of our worries, because criminal gangs will be more motivated to exploit the Internet of Things for stealing valuable data.\nIt’s unlikely these security warnings will dampen public hunger for smart devices. It was fun to notice that Fox Mulder keeps a piece of tape over his laptop camera in the X-Files revival, but most people no longer bother to baffle all the sensors surrounding them. They’re probably unaware of how many Internet-connected sensors are in their home, or even on their person. The advantages of connectivity outweigh the perils… for now.","url":"https://www.breitbart.com/tech/2016/02/10/in-the-future-your-refrigerator-will-spy-on-you/"}
