{"authors":[],"date_download":"2018-10-22 20:43:09","date_modify":"2018-10-22 20:43:09","date_publish":"2014-05-02 18:43:01","description":"A U-2 confused the computers of Southern California air traffic controllers, cancelling and delaying hundreds of flights.","filename":"data/vaneerConsumption/SpyPlaneFriesAirTrafficControlComputersShutsDownLAX.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/416841/140502-nasa-er-2-plane-1419_afecde834414369e0bf0c1cd09e9ab49.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_spy-plane-fries-air-traffic-control-computers-shuts-down-lax-n95886_1540240989.html","title":"Spy Plane Fries Air Traffic Control Computers, Shuts Down LAX","title_page":"Spy Plane Fries Air Traffic Control Computers, Shuts Down LAX","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA relic from the Cold War appears to have triggered a software glitch at a major air traffic control center in California Wednesday that led to delays and cancellations of hundreds of flights across the country, sources familiar with the incident told NBC News.\nOn Wednesday at about 2 p.m., according to sources, a U-2 spy plane, the same type of aircraft that flew high-altitude spy missions over Russia 50 years ago, passed through the airspace monitored by the L.A. Air Route Traffic Control Center in Palmdale, Calif. The L.A. Center handles landings and departures at the region’s major airports, including Los Angeles International (LAX), San Diego and Las Vegas.\nThe computers at the L.A. Center are programmed to keep commercial airliners and other aircraft from colliding with each other. The U-2 was flying at 60,000 feet, but the computers were attempting to keep it from colliding with planes that were actually miles beneath it.\nThough the exact technical causes are not known, the spy plane’s altitude and route apparently overloaded a computer system called ERAM, which generates display data for air-traffic controllers. Back-up computer systems also failed.\nA NASA ER-2 high altitude research aircraft is shown in flight on Nov. 4, 1997. AP\nAs a result, the Federal Aviation Administration (FAA) had to stop accepting flights into airspace managed by the L.A. Center, issuing a nationwide ground stop that lasted for about an hour and affected thousands of passengers.\nAt LAX, one of the nation’s busiest airports, there were 27 cancellations of arriving flights, as well as 212 delays and 27 diversions to other airports. Twenty-three departing flights were cancelled, while 216 were delayed. There were also delays at the airports in Burbank, Long Beach, Ontario and Orange County and at other airports across the Southwestern U.S.\nIn a statement to NBC News, the FAA said that it was “investigating a flight-plan processing issue” at the L.A. Air Route Traffic Control Center, but did not elaborate on the reasons for the glitch and did not confirm that it was related to the U-2’s flight.\n“FAA technical specialists resolved the specific issue that triggered the problem on Wednesday, and the FAA has put in place mitigation measures as engineers complete development of software changes,” said the agency in a statement. “The FAA will fully analyze the event to resolve any underlying issues that contributed to the incident and prevent a reoccurrence.”\nSources told NBC News that the plane was a U-2 with a Defense Department flight plan. “It was a ‘Dragon Lady,’” said one source, using the nickname for the plane. Edwards Air Force Base is 30 miles north of the L.A. Center. Both Edwards and NASA’s Neil A. Armstrong Flight Research Center, which is located at Edwards, have been known to host U-2s and similar, successor aircraft.\nThe U.S. Air Force is still flying U-2s, but plans to retire them within the next few years.\nGary Hatch, spokesman for Edwards Air Force Base, would not comment on the Wednesday incident, but said, “There are no U-2 planes assigned to Edwards.”\nKevin Rohrer, a spokesman for the Armstrong Flight Research Center, said that neither of the two high-altitude ER-2 planes used by the agency for earth science research were flying that day.\nDeveloped more than a half-century ago, the U-2 was once a workhorse of U.S. airborne surveillance. The plane’s “operational ceiling” is 70,000 feet. In 1960, Francis Gary Powers was flying a U-2 for the CIA over the Soviet Union when he was shot down. He was held captive by the Russians for two years before being exchanged for a KGB colonel in U.S. custody. A second U.S. U-2 was shot down over Cuba in 1962, killing the pilot.","url":"https://www.nbcnews.com/news/investigations/spy-plane-fries-air-traffic-control-computers-shuts-down-lax-n95886"}
