{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:03:17","date_modify":"2018-10-30 23:03:17","date_publish":"2016-12-09 00:00:00","description":null,"filename":"data/vaneerConsumption/SquareCashusersgainaccesstoApplePay.json","image_url":"https://amp.businessinsider.com/images/584ab9aaa1a45ed2008b47b9-2560-1280.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_square-cash-users-gain-access-to-apple-pay-2016-12_1540940597.html","title":"Square Cash users gain access to Apple Pay","title_page":"    Square Cash users gain access to Apple Pay - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nUsers of Square Cash, Square's peer-to-peer (P2P) product, can now use Apple Pay to pay with the money stored in their accounts, according to announcements at Code Commerce.\nThis means Square Cash users can now enter the Visa-branded \"virtual payment card\" Square unveiled in September to Apple's mobile wallet, allowing them to use Square Cash balances to pay anywhere that accepts NFC-based Visa payments. Integration with Android mobile wallets will come later, Square said.\nApple Pay integration means more use cases for Square Cash's virtual card product.\nThe move makes the virtual card function more like a traditional prepaid card.Previously, the Square Cash virtual card would be easy for customers to use for online purchasing. Because it had no physical companion, using the product in person was challenging — Recode noted that it would be uncommon for a user to read off their card number in a grocery store, for example. The new partnership brings the card into the physical realm in a big way, because Apple Pay is accepted at 35% of US retailers and expects to nearly double that in 2017.\nBut if customers weren't using Apple Pay before, it's not clear that said integration will cause them to start using it now. US Apple Pay adoption has stagnated just below a quarter of eligible users, according to data from PYMNTS and InfoScout. That could be largely a result of consumer disinterest. If users haven't loaded their traditional credit or debit cards into Apple Pay, it's unlikely they would adopt the service through a niche product like the virtual card. That said, it's worth noting that there could be a compelling use case here for Square Cash users that might find themselves having lost or forgotten their other cards in-store.","url":"https://www.businessinsider.com/square-cash-users-gain-access-to-apple-pay-2016-12"}
