{"authors":["Myriah Towner For Dailymail.Com"],"date_download":"2018-10-23 02:08:59","date_modify":"2018-10-23 02:08:59","date_publish":"2016-01-28 16:51:22","description":"Christopher Wroten, Tommy Jarrit Wroten, Bonnie Foster and a fourth person allegedly occupied a north Tulsa home without authorization after the owner died in September 2014.","filename":"data/vaneerConsumption/SquattersinhabitOklahomaresidenceforaYEARafterhomeownerdied.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC3E4300000578-0-image-a-29_1453998976501.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421201_Squatters-inhabit-Oklahoma-residence-YEAR-homeowner-died_1540260539.html","title":"Squatters 'inhabit Oklahoma residence for a YEAR after homeowner died'","title_page":"Squatters 'inhabit Oklahoma residence for a YEAR after homeowner died' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Four squatters have been evicted and two of them were arrested on drug charges after the group had reportedly been living in an Oklahoma home for more than a year since the owner died.\nChristopher Wroten, Tommy Jarrit Wroten, Bonnie Foster and a fourth person allegedly occupied a north Tulsa home without authorization after the owner died in September 2014, Tulsa World reported.\nPolice received several nuisance-related calls about the home and when officers searched the residence they reportedly found meth, six stolen trailers, two vehicles and ammunition among other stolen items.\nScroll down for video\nChristopher Wroten, Tommy Jarrit Wroten, Bonnie Foster and a fourth person allegedly occupied a north Tulsa home (pictured) without authorization after the owner died in September 2014\nOn Wednesday, the home was boarded up by city workers after officers served a search warrant and arrested 31-year-old Tommy Wroten (left) and 36-year-old Foster (right) on drug charges\nOn Wednesday, the home was boarded up by city workers after officers served a search warrant and arrested 31-year-old Tommy Wroten and 36-year-old Foster on drug charges.\nChristopher Wroten, 36, is still at large who police said waited until the owners passed away to break in and take possession of the home, according to NewsOn6.\nCounty assessor records show the home belongs to Betty and Lavon Kastner, who are both deceased, the station reported.\nPolice received several nuisance-related calls about the home and when officers searched the residence they reportedly found meth, six stolen trailers, two vehicles and ammunition among other stolen items\nCounty assessor records show the home belongs to Betty and Lavon Kastner, who are both deceased\nWhile inhabiting the home, the group allegedly changed the locks, stole water from other homes and some of them even had mail sent to the residence\nThe alleged squatters are believed to have inhabited the home in late 2014 or early 2015, living there without running water while running a generator for electricity, according to Tulsa World.\n'They just kind of claimed it as their own,' Tulsa Police Corporal Craig Johnson said.\nJohnson noted that some of the nuisance-related calls they received from residents were complaints about the 24-hour use of the generator.\nWhile inhabiting the home, the group allegedly changed the locks, stole water from other homes and some of them even had mail sent to the residence.\n'We believe a few of the things they did to try to disguise their criminal activity is to go as far as break in and change the locks so they would have a key to the home to try to have mail sent here,' said Tulsa Police Corporal Jason Muse told NewsOn6.\nFoster (pictured right) was arrested on charges including suspicion of marijuana possession and outstanding traffic warrants\nChristopher Wroten, 36, is still at large who police said waited until the owners passed away to break in and take possession of the home. Authorities said it is likely the city will take ownership of the home\nTommy Wroten was booked on charges including knowingly concealing stolen property, possession of a controlled substance, possession of marijuana and possession of drug paraphernalia.\nMeanwhile, Foster was arrested on charges including suspicion of marijuana possession and outstanding traffic warrants.\nWhile it is not clear who owns the home, police said they are going to be investigating the group's claim to the home to see 'why the feel they need to be here,' Muse said.","url":"https://www.dailymail.co.uk/news/article-3421201/Squatters-inhabit-Oklahoma-residence-YEAR-homeowner-died.html"}
