{"authors":[],"date_download":"2018-10-30 18:47:45","date_modify":"2018-10-30 18:47:45","date_publish":"2016-09-06 23:22:12","description":"Creekside Forest off I-20 is littered with garbage and has been failed by the county, a commissioner said.","filename":"data/vaneerConsumption/SquatterstossedfromDeKalbslumcomplex.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/07/Videos/5116050261001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_squatters-violen_8e3c5a30e29a6b564851ed755dd3c069__1540925265.html","title":"Squatters tossed from DeKalb 'slum' complex","title_page":"Squatters tossed from DeKalb 'slum' complex","title_rss":"NULL","source_domain":"ajc.com","text":"In this place of little visible hope, Johnson and other residents were at least pleased this week to see the conditions getting some attention. DeKalb police were at the Ember Drive development Tuesday, with armed security guards who said they were running off squatters.\nThe process appeared to be in part spurred on by the presence of media and County Commissioner Nancy Jester. Jester met reporters to call attention to the apartments, which she said are eroding without quality management or strong enforcement from the county.\n“How did it get like this?” Jester said. “DeKalb County let it get like this.”\nThe complex is emblematic of the struggles of south DeKalb, which is plagued by crime and ramshackle apartments with sometimes absentee landlords.\nDeKalb spokesman Burke Brennan said county officials have met with the Creekside Forest owner and are “reasonably optimistic\" for change. Brennan said DeKalb is taking the owner to court and plans to help some residents find new housing.\nJester’s decision to call attention to the complex is unusual, she acknowledged, because it isn’t in her district. But she said having such a development in what could be a prime area for growth off I-20 should be of concern for all. Commissioner Larry Johnson is the representative for the area but didn't respond to requests for comment.\nMany of Creekside Forest's challenges are obvious: the leasing office is empty, the window busted. The pool water is brown. A note left on the mailboxes says deliveries are suspended. The buildings are all boarded up, damaged by flooding and the work of vandals, or loaded with trash. In one unit, someone put cigarettes out on the carpet and left empty liquor bottles and a bag of an unknown crystalized substance.\n»Related: 1 critically injured in DeKalb shooting\n»Related: Unreleased reports finds wanted felons living in public housing\nResidents said conditions went down drastically when Creekside Forest was sold last year. Some have electricity and water, some don't, and all are fearful for the children. The tenants said they stopped paying rent because no one could figure out who was cashing the checks.\nAsked who's in charge at the complex, residents could only give the name \"Chester.\"\nA number said to be for Chester was answered by a man claiming to work for Chester. “He’s doing everything in his power,” said the man, who hung up on a reporter. The county spokesman, Brennan, said the owner is a man named Nisels Cheskel. Efforts to locate him for comment weren't successful. Brennan said Cheskel seems committed to cleaning up — and the county is pushing \"aggressively,\" issuing 228 citations in July and setting a court date for Sept. 27. Told that the county feels the owner intends to cooperate, residents burst out laughing. One man stormed away in anger. Ebony Pugh, who was smoking a cigarette and complaining of the heat in her unit, contorted her face in disbelief at the thought of the owner taking care of the complex. Security guard Francis Johnson said there are good people in bad positions in the apartments, but the ease of squatting brings myriad problems, including fugitives who find a good place to hide in the units. He claimed he recalled seeing a body on the pavement one morning while children loaded on a school bus. Creekside Forest's issues brought another complex to mind for Commissioner Jester: Brannon Hill, the notorious burned-out condo community in Clarkston. Creekside Forest might be “Brannon Hill 2.0,” she said. Then, why do people choose to live here? Most said they are trying to save money to get out. On Tuesday, with police and security on hand, there appeared to be some hope. In front of one unit, a man hastily loaded TVs and other belongings into a car. He was a squatter, who knew it was time to go, a guard said. But that was Tuesday. On Wednesday morning, the security guards were gone. Recommended for you Recommended for you Recommended for you Most read 1 Notorious gangster James 'Whitey' Bulger found dead in prison 2 What is the ‘birthright citizenship,’ and can Trump terminate it? 3 Tyler Perry to end Madea franchise\nThings to do","url":"https://www.ajc.com/news/local/squatters-violence-and-garbage-plague-slum-like-dekalb-complex/ZjwW37RNqZIcchneIMomHK/"}
