{"authors":[],"date_download":"2018-10-22 20:50:01","date_modify":"2018-10-22 20:50:01","date_publish":"2014-06-03 11:52:00","description":"A giant replica of a prescient octopus made suckers of London commuters Tuesday when the truck carrying it broke down at a busy intersection.","filename":"data/vaneerConsumption/SquidlockGiantReplicaofPsychicOctopusSnarlsLondonCommute.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/483226/140603-octopus-6a_943263ab5fcf8f4136fd5427ea52c70a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_squidlock-giant-replica-psychic-octopus-snarls-london-commute-n121036_1540241401.html","title":"Squidlock! Giant Replica of Psychic Octopus Snarls London Commute","title_page":"Squidlock! Giant Replica of Psychic Octopus Snarls London Commute","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLONDON - A giant replica of a prescient octopus made suckers of commuters in Britain’s capital Tuesday when the truck carrying it broke down, blocking one of London's busiest intersections in the morning rush hour.\nThe cephalopod statue was being towed on behalf of a betting company that had used it as a prop in a promotional campaign ahead of this month’s soccer World Cup when the truck apparently broke down.\nIt is a replica of Paul, a celebrated aquarium octopus from Germany that became famous for correctly predicting the results of games.\nThe truck blocked the intersection of Oxford Street and Regent Street – two of London’s busiest shopping thoroughfares – at about 8.30 a.m. local time (3.30 a.m. ET), snarling traffic and forcing the diversion of the city’s red double-decker buses.\nAngry Londoners took to Twitter, saying the breakdown had been deliberately staged to attract publicity. The company, Betfair, said the incident was unplanned. “We’d like to apologize for any inconvenience,” it said in a statement.\nThe blockage, caught on surveillance cameras by city transit authority Transport for London, provided some with an unlikely excuse for being late for work.\nPaul gained global fame in 2010 when keepers at the Sea Life Aquarium in Oberhausen, Germany used his tentacles to predict the outcome of games in that year’s tournament, hosted in South Africa.\nHandlers set up two plastic boxes in the aquarium, festooned with the flags of Germany and its opponent in various games. Each box contained a mussel treat, and the flag on the first box that Paul went for was considered his pick for the winner.\nPaul correctly predicted the outcome of every Germany game – and picked the tournament winner, Spain – but his career as an underwater clairvoyant ended with his death later the same year.\nAlastair Jamieson","url":"https://www.nbcnews.com/news/world/squidlock-giant-replica-psychic-octopus-snarls-london-commute-n121036"}
