{"authors":[],"date_download":"2018-10-22 23:43:39","date_modify":"2018-10-22 23:43:39","date_publish":"2017-03-10 04:13:09","description":"President Maithripala Sirisena came to power in Sri Lanka promising justice for war crimes, breaking from his hawkish predecessor and presenting the island...","filename":"data/vaneerConsumption/SriLankariskscensureaspresidentfaltersonwarlegacy.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/04/wire-193945-1489119192-987_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299932_Sri-Lanka-risks-censure-president-falters-war-legacy_1540251819.html","title":"Sri Lanka risks censure as president falters on war legacy","title_page":"Sri Lanka risks censure as president falters on war legacy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Maithripala Sirisena rejects UN calls for Sri Lankan soldiers to stand trial for war-era abuses\nPresident Maithripala Sirisena came to power in Sri Lanka promising justice for war crimes, breaking from his hawkish predecessor and presenting the island with its first real shot at a lasting peace.\nBut that optimism has been sorely tested as Sirisena, having missed a two-year deadline to investigate war-era abuses, declared he would never prosecute his soldiers, rejecting outright fresh UN calls for an international trial.\n\"I am not going to allow non-governmental organisations to dictate how to run my government,\" he said a day after the UN criticised Sri Lanka's \"worrying slow\" progress in facing its wartime past.\n\"I will not listen to their calls to prosecute my troops.\"\nHis defiant tone marked a sharp shift from the conciliatory approach that had earned praise from the international community, and drew unfavourable comparisons to Sri Lanka's wartime leader Mahinda Rajapakse.\nThe strongman resisted international pressure to probe allegations government forces under his control killed up to 40,000 Tamil civilians in the final months of the war, which ended in May 2009.\n\"Sirisena's remarks are worrisome and alarmingly reminiscent of speeches by his rival and predecessor Mahinda Rajapakse,\" the International Crisis Group's Alan Keenan told AFP.\nSirisena has made inroads towards shedding Sri Lanka's status as global pariah since defeating Rajapakse in January 2015.\nA member of the majority Sinhalese community, he received the support of the Tamil minority after promising accountability for excesses carried out by the largely Sinhalese military.\nIn October 2015 he went one step further, agreeing to a UN Human Rights Council resolution which called for special tribunals and gave Sri Lanka 18 months to establish credible investigations.\nBut the deadline lapsed without those commitments being met.\n\"We put too much trust in him, and he's badly disappointed us,\" said Eswarapatham Saravanapavan, a politician from the war-ravaged Tamil heartland of Jaffna.\n\"We didn't ask for handouts. All we wanted was justice.\"\n- Politically constrained -\nTamils abroad, fed up with inaction, have been pressuring the Geneva-based rights council to censure Sirisena at meetings later this month, Saravanapavan said.\nIn a new report last week the council acknowledged Sri Lanka had taken some steps towards reconciliation but cautioned the measures had been \"inadequate, lacked coordination and a sense of urgency\".\nSirisena's blunt rejection of fresh demands for tribunals with foreign judges has raised concerns that no military personnel may ever be held accountable.\nBut experts say the president is juggling pressures from a muscular army, which opposes any trials, and an unwieldy political coalition that helped bring him to power.\n\"The political constraints facing Sirisena from a popular military are considerable, and the participation of foreign judges has always been a hard sell for many Sinhalese,\" Keenan said.\nThere have been symbolic gestures towards reconciliation. The national anthem was sung in Tamil during national day celebrations last year for the first time in 67 years -- an unthinkable act under Rajapakse.\nSwathes of military-occupied land have been returned to Tamils in Jaffna, where Sirisena hit the streets last week promising reconciliation just moments after railing against the UN.\nBut there have been false steps, too.\nDraconian anti-terror laws have not been repealed as promised, and rights groups expressed outrage when Sirisena sent a police officer implicated in abuse to defend his administration at a UN inquiry into torture.\nThe president also raised eyebrows in November when he asked US-president elect Donald Trump to use America's clout at the UN to clear Sri Lanka's war crimes record.\nDiplomatic sources say a UN rights council session later this month poses a key test for Sri Lanka, which narrowly avoided a censure motion soon after Sirisena came to power.\nThe island nation bought time on that occasion by promising to address past abuses -- an approach it has taken again with Sri Lanka's foreign minister appealing for a second chance.\nIt's a worrying case of deja vu for those who backed Sirisena in his shock victory over Rajapakse, often despite threats to their own lives.\n\"The president's mandate was for reform. We are very disappointed he has not kept his pledges,\" said civil society leader Sarath Wijesuriya.","url":"https://www.dailymail.co.uk/wires/afp/article-4299932/Sri-Lanka-risks-censure-president-falters-war-legacy.html"}
