{"authors":["Associated Press"],"date_download":"2018-10-23 03:21:43","date_modify":"2018-10-23 03:21:43","date_publish":"2017-03-16 14:13:27","description":"A century for Dinesh Chandimal and three late wickets in the space of seven deliveries helped put Sri Lanka in command on day two of the second Test against Bangladesh in Colombo.","filename":"data/vaneerConsumption/SriLankaincommandofsecondTestagainstBangladesh.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E5219FC00000578-0-image-a-39_1489673254379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4320456_Sri-Lanka-command-second-Test-against-Bangladesh_1540264903.html","title":"Sri Lanka in command of second Test against Bangladesh","title_page":"Sri Lanka in command of second Test against Bangladesh | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A century for Dinesh Chandimal and three late wickets in the space of seven deliveries helped put Sri Lanka in command on day two of the second Test against Bangladesh in Colombo, where the tourists trailed by 124 runs.\nResuming on 86 with the hosts at 238 for seven overnight, Chandimal chalked up his eighth Test hundred as Sir Lanka were eventually all out for 338.\nBangladesh, who were playing their 100th Test match, lost opener Tamim Iqbal for 49 and Soumya Sarkar for 61 before three costly late wickets saw their progress checked to 214 for five at stumps.\nDinesh Chandimal salutes the crowd after reaching his century on day two of the second Test\nSri Lanka are 124 runs ahead with five wickets remaining in the Bangladesh first innings\nEarlier, Bangladesh had hoped to mop up the Sri Lanka tail quickly once captain Rangana Herath had departed for 25 following a thick edge off Shakib Al Hasan to Soumya at first slip with the total at 250.\nHowever, Suranga Lakmal, who finished with a battling 35, helped Chandimal bring up his century and provide some late resistance as Sri Lanka moved past 300.\nChandimal, though, needed a review to remain at the crease when on 113 after he was initially given out caught behind off Mustafizur Rahman, with replays showing their was no contact with his bat.\nEventually, Bangladesh had Chandimal dismissed just before lunch when an attempted sweep off Mehedi Hasan fell to Mosaddek Hossain at midwicket, his 138 coming off 300 deliveries as he left the field at the P Sara Oval to a standing ovation.\nLakshan Sandakan took three wickets for 65 runs leaving Bangladesh with plenty of work to do\nIn reply, Tamim and Soumya put on an opening 95-run partnership before Sri Lanka made the breakthrough just before tea when Tamim was trapped lbw by Herath just one run short of a half-century. Soumya was then bowled by Lakshan Sandakan, with Bangladesh at 130 for two.\nImrul Kayes, who suffered an injured toe whilst fielding, had added 34 when he went the same way in the 57th over as Sandakan struck him on the pads in front of off stump.\nNightwatchman Taijul Islam was then sent straight back to the pavilion next ball without troubling the scorers after Sandakan's delivery spun back in sharply, with the dismissal given on review .\nBangladesh's earlier hard work was quickly being undone during the closing session as Sabbir Rahman gloved a short delivery from Suranga Lakmal to leg gully where Dhananjaya de Silva took a diving catch to leave the hosts at 198 for five.\nShakib Al Hasan finished 18 not out and captain Mushfiqur Rahim on two as Bangladesh edged through to the close without suffering any more losses.\nSandakan ended the day with three for 65 to help Sri Lanka wrestle back the advantage.","url":"https://www.dailymail.co.uk/sport/cricket/article-4320456/Sri-Lanka-command-second-Test-against-Bangladesh.html"}
