{"authors":[],"date_download":"2018-10-23 00:56:42","date_modify":"2018-10-23 00:56:42","date_publish":"2016-01-29 14:31:05","description":"Sri Lanka's cricket board on Friday confirmed it would rehire Graham Ford as head coach to help the national team defend its World Twenty20 title in India, a...","filename":"data/vaneerConsumption/SriLankahireGrahamFordtodefendcricketWorldT20.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h63f-3bmscybNe842cce83474b56aa4ad-408_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422388_Sri-Lanka-hire-Graham-Ford-defend-cricket-World-T20_1540256202.html","title":"Sri Lanka hire Graham Ford to defend cricket World T20","title_page":"Sri Lanka hire Graham Ford to defend cricket World T20 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sri Lanka hire Graham Ford to defend cricket World T20\nSri Lanka's cricket board on Friday confirmed it would rehire Graham Ford as head coach to help the national team defend its World Twenty20 title in India, after his English club announced his departure.\nThe 55-year-old South African previously coached Sri Lanka from 2012 until 2014 before taking over the reins at English county championship title-holder Surrey.\n\"The new board of Sri Lanka Cricket head-hunted Ford to be the new head coach and prepare the team for the World T20,\" an SLC official told AFP. \"His term will be for 45 months starting Monday.\"\nSri Lanka's Mahela Jayawardene (R) speaks with coach Graham Ford during a practice session at the Sharjah International Cricket Stadium in Sharjah, in 2014 ©Ishara S.Kodikara (AFP/File)\nThe contract period would also cover the 2019 World Cup hosted by England and Wales.\nSri Lanka Cricket (SLC) declined to give further details of the contract.\nLocal officials said he would start by preparing the team to defend the World T20 title, with its recent poor form leading it to fall to second position in the T20 rankings, after the West Indies.\nThe World T20 will be held at stadiums throughout India from March 8, with the final to be played at the historic Eden Gardens in Kolkata on April 3.\nSri Lanka has also been hit by the retirement of cricketing stars such as Mahela Jayawardene and Kumar Sangakkara.\nFord worked with Sangakkara at Surrey and last season guided the club to the county championship second division title.\n\"As the national team continues its transition following high-profile retirements, Ford's reputation for being good with young players was among the reasons for the new Executive Committee to secure him for the job,\" the board said in a statement.\n- 'Back to glory days' -\nFord's main task would be to rebuild the national team, the board said.\nIt added that his hiring was part of a \"plan towards restoring Sri Lanka Cricket back to its glory days.\" Since winning the 1996 Cricket World Cup, Sri Lanka has made it to the finals twice but failed to win.\nSurrey said it was unhappy to lose Ford.\n\"We are extremely disappointed to be losing Graham Ford, who has not just been an outstanding head coach but has played an integral role in the progress that we have achieved over the last two years,\" Surrey director of cricket Alec Stewart told the club's official website Thursday.\n\"He has worked tirelessly with the players and his efforts can be seen in their individual performances and the team's results, culminating in promotion back to the first division,\" Stewart said.\n\"It was a very tough decision for Graham to leave Surrey but we understand that the opportunity to go back and coach at international level with Sri Lanka was too good to turn down.\"\nSri Lanka's new cricket management earlier this month decided to step up its search for a new head coach, with the job temporarily held by interim coach Jerome Jayaratne, who replaced Marvan Atapattu.\nJayaratne, 49, the head of coaching at SLC, was appointed for the West Indies Series in October and November 2015 and extended to cover Sri Lanka's tour of New Zealand.\nJayaratne's appointment came after Atapattu quit before his contract was due to expire following India's 2-1 win of a Test series in Colombo in September.\nSince 2010, Trevor Bayliss, Stuart Law, Rumesh Ratnayake, Geoff Marsh and Ford have also had periods as Sri Lanka coach.","url":"https://www.dailymail.co.uk/wires/afp/article-3422388/Sri-Lanka-hire-Graham-Ford-defend-cricket-World-T20.html"}
