{"authors":[],"date_download":"2018-10-22 23:53:54","date_modify":"2018-10-22 23:53:54","date_publish":"2017-03-16 08:08:14","description":"Sri Lanka took a flurry of late wickets to put the brakes on Bangladesh at the second Test in Colombo Thursday after the tourists made a promising start to...","filename":"data/vaneerConsumption/SriLankarattleBangladeshwithlatestrikesin2ndTest.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-228869-1489674207-588_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319160_Chandimal-guides-Sri-Lanka-338-Bangladesh-Test_1540252434.html","title":"Sri Lanka rattle Bangladesh with late strikes in 2nd Test","title_page":"Sri Lanka rattle Bangladesh with late strikes in 2nd Test | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sri Lankan's Lakshan Sandakan (centre) celebrates after he dismissed Bangladesh batsman Soumya Sarkar on the second day of the second Test in Colombo on March 16, 2017\nSri Lanka took a flurry of late wickets to put the brakes on Bangladesh at the second Test in Colombo Thursday after the tourists made a promising start to their first innings with a 95-run partnership.\nSoumya Sarkar top-scored for Bangladesh with 61 while sharing a solid opening stand with Tamim Iqbal which gave the visitors te upper hand on day two before their innings unravelled late in the afternoon.\nLeft-arm spinner Lakshan Sandakan claimed two wickets in two balls in the final hour as Sri Lanka reduced Bangladesh to 214-5 at the close after the latest in a string of collapses by Test cricket's newest team.\nIt means the hosts still lead Bangladesh by 124 runs after making 338 in their first innings, thanks largely to a fighting century by Dinesh Chandimal.\nBangladesh thought they were in a comfortable position after Soumya made his third fifty in the series in as many innings, and Tamim made 49 before being trapped lbw by Sri Lankan skipper Rangana Herath.\nSri Lanka's Dinesh Chandimal celebrates reaching his century on the second day of the second Test against Bangladesh in Colombo on March 16, 2017\nSandakan then trapped Imrul Kayes plumb in front to dismiss him for 34 and then successfully reviewed a not out decision to remove nightwatchman Taijul Islam off the next ball.\nSuranga Lakmal delivered a further blow to the visiting side when he removed Sabbir Rahman after he had scored 42, playing the lead role in a 62-run partnership with Imrul for the third wicket.\nAfter Herath earned Sri Lanka's first breakthrough, Sandakan then bowled Soumya before finishing the day with 3-65.\n\"Honestly I am out of ideas, the same thing happened every time,\" said Bangladesh's batting coach Thilan Samaraweera.\n\"When we start to collapse we cannot control it. Tomorrow is a new day, hopefully we can get close to Sri Lanka's score.\"\nShakib Al Hasan lived dangerously to see out the day with unbeaten 18 alongside skipper Mushfiqur Rahim, who was on two at the close.\nThe hosts earlier added exactly 100 runs to their overnight 238-7 before they were all out on the stroke of lunch break.\n- 'Top Test ton' -\nChandimal, who was unbeaten on 86 overnight, made 138, his eighth in Test cricket, off 300 balls after an innings which contained more than its share of good fortune.\nAfter surviving two TV reviews on the first day, he was again given out caught behind on Thursday off Mustafizur Rahman's bowling but the decision was overturned when replays showed the ball had not touched his bat.\n\"I rate this is as my number one century in Test cricket so far because I batted four sessions -- I've never batted four sessions in my Test career,\" Chandimal said after the day's play.\n\"We were in a tough spot with three wickets down for 30-odd. I had a responsibility at the time to think about how I can take the team beyond 250.\"\nBangladesh were hoping to wrap up the innings quickly once Shakib removed Herath for 25 in the ninth over of the morning session after the Sri Lankan skipper added just seven runs to his overnight score.\nSoumya managed to grasp the catch after several fumbled attempts but Chandimal and Lakmal then continued to frustrate Bangladesh as they put on a 55-run partnership for the ninth wicket.\nOff-spinner Mehedi finally dismissed Chandimal, who now has four Test centuries against Bangladesh in six Tests, as debutant Mosaddek Hossain took the catch at midwicket.\nChandimal, who struck only four boundaries on the opening day while helping his side recover from 70-4, batted aggressively on the second day to hit 10 fours and a six overall in his innings.\nLakmal swung his bat to add 35 runs to Sri Lanka's total before he became the last man to be dismissed with a catch to Soumya at third man off pace bowler Subashis Roy\nMehedi finished with 3-90 for Bangladesh.","url":"https://www.dailymail.co.uk/wires/afp/article-4319160/Chandimal-guides-Sri-Lanka-338-Bangladesh-Test.html"}
