{"authors":["Press Association"],"date_download":"2018-10-23 01:19:05","date_modify":"2018-10-23 01:19:05","date_publish":"2016-01-28 15:36:01","description":"Energy giant SSE became the second supplier in a week to announce lower gas prices, but the industry faced a backlash amid calls for cuts to be faster and de...","filename":"data/vaneerConsumption/Sseannouncesgaspricecutasenergyrivalsurgednottodragtheirheels.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-63f947b1-9430-4e3d-b9eb-a98bf1e8f66d-2vdWmEltwXfba0ce28e632a335ef-115_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420504_Energy-company-SSE-cut-gas-prices-5-3_1540257545.html","title":"Sse announces gas price cut as energy rivals urged not to 'drag their heels'","title_page":"Sse announces gas price cut as energy rivals urged not to 'drag their heels' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SSE announces gas price cut as energy rivals urged not to 'drag their heels'\nEnergy giant SSE became the second supplier in a week to announce lower gas prices, but the industry faced a backlash amid calls for cuts to be faster and deeper.\nThe group said it will lower standard gas tariffs by 5.3%, saving household gas customers on average £32 a year, a lthough the move was dismissed as \"trivial\" while rivals were accused of \"dragging their heels\".\nSSE said the reduction will not take effect until after Easter - on March 29.\nSSE is to cut gas prices by 5.3% from March 29\nIt follows just a week after rival E.ON announced it was lowering gas prices by 5.1% from February 1.\nSecretary of State for Energy and Climate Change Amber Rudd said the reduction was a \"step in the right direction\" and called on other providers to bring their prices down.\nShe said: \"I'm absolutely clear that the market must provide a fair deal for consumers and that's why I've been pressing energy companies to put their customers first and pass on savings to them.\n\"SSE has taken a step in the right direction and I urge other suppliers to follow suit.\"\nConsumer groups said households were not seeing the full benefits of recent steep falls in wholesale energy prices.\nMartin Lewis, founder of MoneySavingExpert, said: \"A gain it's just a trivial 5% on gas only, not electricity, nothing close to the drop in wholesale prices.\n\"Energy firms must be whooping for joy that they can get away with such small cuts.\"\nGillian Guy, chief executive of Citizens Advice, added: \" Rival suppliers have no excuse for dragging their heels and urgently need to cut their bills.\n\"There is also an opportunity to go further by offering a more generous reduction than the cuts to bills so far.\"\nSSE insisted wholesale energy prices make up an \"ever smaller proportion\" of customer bills.\nIt also said that w hile the price cut will not take effect for another two months, it comes before its current price freeze comes to an end.\nThe group pledged in March 2014 to keep energy prices on hold until the end of June 2016.\nDermot Nolan, chief executive of energy watchdog Ofgem, said: \"If the market is as competitive as suppliers claim, we would expect to see further price cuts.\n\"Ofgem referred the market to the Competition and Markets Authority because we feel competition is not bearing down fast or hard enough on consumers' bills.\"\nThe Competition and Markets Authority (CMA) has been investigating the energy market since last summer.\nAn early report by the CMA in February found that the large companies were overcharging loyal customers who did not switch suppliers by up to £234 a year.\nIn an update on trading, SSE also revealed it lost 30,000 customers since last March, with electricity and gas accounts dropping to 8.28 million.\nIt said customers used less electricity, down 3%, while gas usage remained flat.\nAlistair Phillips-Davies, chief executive of SSE, said market conditions were \"challenging\", with the group hit by one of the warmest winters on record and the impact of Storm Frank on its networks in the north of Scotland last month, which saw winds of 90mph and caused significant flooding.","url":"https://www.dailymail.co.uk/wires/pa/article-3420504/Energy-company-SSE-cut-gas-prices-5-3.html"}
