{"authors":["Associated Press","Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-23 02:56:07","date_modify":"2018-10-23 02:56:07","date_publish":"2016-01-28 18:14:00","description":"The SS United States, a historic and record-breaking ocean liner that once hosted royalty and presidents, has escaped the scrap heap and will undergo a rebirth.","filename":"data/vaneerConsumption/SSUnitedStateswillbesavedfromscrapyardandredeveloped.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD80B500000578-0-image-a-34_1454017284711.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421363_Deal-struck-save-historic-ocean-liner-SS-United-States_1540263367.html","title":"SS United States will be saved from scrap yard and redeveloped","title_page":"SS United States will be saved from scrap yard and redeveloped | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The SS United States, a historic and record-breaking ocean liner that once hosted royalty and presidents, has escaped the scrap heap and will undergo a rebirth, supporters announced Thursday.\nThe ship's conservancy group issued a statement saying it has an option agreement with a redevelopment partner.\nNo further details will be released until a news conference February 4 at the Manhattan Cruise Terminal in New York, according to conservancy spokesman Tom Basile.\n'At the announcement, an exciting future for the ship will be revealed that envisions the SS United States again as an iconic symbol of America the world over,' the statement said, noting an artistic rendering of the redeveloped ship will be unveiled.\nScroll down for video\nThis July 1, 2010, file photo shows the SS United States, a luxury ocean liner removed from service in 1969 and moored for nearly two decades in Philadelphia\nThe SS United States being towed by dozens of tugboats past New York City in June, 1952\nThis photo shows the SS United States passing by Manhattan on the Hudson River during its maiden voyage on July 3, 1952\nThe luxury vessel had its maiden voyage in 1952 and still holds the record for the fastest westward trans-Atlantic passenger ship crossing.\nSinger Carly Simon wrote in her memoir Boys In The Trees that Bond actor Sean Connery proposed a threesome with her and her sister Lucy aboard the ship in 1965, in what a friend of Simon's called a 'Simon sisters sandwich.'\nSimon wrote that she declined the invitation, but became so irate at her sister for allegedly spending the night with the actor that she broke up the sisters' musical act, the Simon Sisters, upon arrival in New York.\nTaken out of service in 1969, the SS United States was stripped of its interior years ago.\nThe rusting hulk, which is larger than the Titanic, has been moored in Philadelphia for nearly two decades.\nIn 2014, the conservancy said it was chasing redevelopment options that could bring the ship back to its home port of New York as a stationary, mixed-use attraction likely featuring retail, restaurants, offices and/or hotel space.\nBut as negotiations continued for competing sites in Brooklyn and Manhattan, the ship was racking up unsustainable costs Philadelphia, where the conservancy spends $60,000 monthly to maintain the vessel on the Delaware River, where it sits amid working piers and looms over a strip of big box stores.\nPreservationists feared running out of money before a ship-saving deal was reached and had retained a scrap-metal broker.\nLast fall, they received a lifeline — $600,000 in donations — to keep it afloat while discussions continued.\nA spokesperson for the New York City Economic Development Corp., which runs the Manhattan Cruise Terminal, did not immediately respond to an email sent by the Associated Press.\nThe ocean liner SS United States, pictured left in a July 1, 2010, file photo, and right in a 1952 file photo, will not be scrapped\nThis Nov. 22, 2013, file photo shows the rusting hull of the SS United States, which will soon be put to use again","url":"https://www.dailymail.co.uk/news/article-3421363/Deal-struck-save-historic-ocean-liner-SS-United-States.html"}
