{"authors":[],"date_download":"2018-10-22 20:58:15","date_modify":"2018-10-22 20:58:15","date_publish":"2014-05-05 14:59:15","description":"Franklin Regional High School says it wants to bring an \"added sense of safety and security.\"","filename":"data/vaneerConsumption/StabbingSpreePromptsClearBagRuleatPennsylvaniaSchool.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/420446/140505-fr-strong-bag-1050a_797bdee9e44fa172b8ad515b82f47975.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_school-stabbing-spree_stabbing-spree-prompts-clear-bag-rule-pennsylvania-school-n97251_1540241895.html","title":"Stabbing Spree Prompts Clear-Bag Rule at Pennsylvania School","title_page":"Stabbing Spree Prompts Clear-Bag Rule at Pennsylvania School ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Pennsylvania high school where a sophomore stabbed 20 teens and a security guard gave out clear plastic bags that students must use to carry their belongings from class to class.\nThe precaution is intended to \"bring an added sense of safety and security during the school day as the school community continues to heal,\" district spokeswoman Mary Catherine Reljac said in a statement.\nThe move comes three weeks after Franklin Regional Senior High School student Alex Hribal allegedly smuggled two 8-inch kitchen knives into the building and went on a bloody rampage in the hall, knifing kids at random.\nStudents have been prohibited from carrying backpacks in the halls for years at Franklin Regional, but they could use drawstring bags to carry gym clothes, laptops, and other small items.\n\"Now, students will be required to carry the clear bags during the school day for these items,\" Reljac wrote.\nHribal, 16, has been charged with attempted homicide for the April 9 attack. Court papers filed last week revealed investigators found a note in his locker that suggested he planned the stabbings.\n\"I can't wait to see the priceless and helpless looks on the faces of the students of one of the 'best schools in Pennsylvania' realize their precious lives are going to be taken by the only one among them that isn't a plebian,\" it read.\nAn assistant principal tackled Hribal and told him to drop the knives. He allegedly replied: \"No, I am not dropping them, my work is not done, I have more people to kill.\"\n— Tracy Connor","url":"https://www.nbcnews.com/storyline/school-stabbing-spree/stabbing-spree-prompts-clear-bag-rule-pennsylvania-school-n97251"}
