{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:44:47","date_modify":"2018-10-30 18:44:47","date_publish":"2016-01-29 23:14:37","description":"Outspoken actress Stacey Dash has written another blog post, this time urging black people to not \"listen to liberals who try to limit you.\"","filename":"data/vaneerConsumption/StaceyDashtoBlackAmericansStopListeningtoLiberals.json","image_url":"https://media.breitbart.com/media/2016/01/Stacey-Dash-Getty-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_01_29__1540925087.html","title":"Stacey Dash to Black Americans: Stop Listening to Liberals","title_page":"Stacey Dash to Black Americans: Stop Listening to Liberals - 'I Am Sick of Settling for Breadcrumbs'","title_rss":"NULL","source_domain":"breitbart.com","text":"Outspoken actress Stacey Dash has written another blog post, this time urging black people to not “listen to liberals who try to limit you.”\n“Black History should be apart of social studies and history curriculum EVERYDAY OF EVERY MONTH OF EVERY YEAR. not just 28 days out of 365!!!!,” the actress wrote Thursday in response to criticism she received for calling an end to Black History Month.\n“In a hundred years, do you really want the legacy of Martin Luther King, Jr, Frederick Douglass, and even Barack Obama to be discussed only in the month of February?!” she asked. “Black history IS American history. We are not a category or a special interest group.”\n“We are Americans,” the Fox News contributor wrote (emphasis in original).\nLast week, Dash found herself in the middle of a mushroom cloud of criticism when she decided to denounce those calling for a boycott of the Oscars over the lack of black Academy Award nominees.\n“I think it’s ludicrous. We have to make up our minds. Either we want to have segregation or integration,” Dash said Wednesday on Fox and Friends.\nDash is encouraging black Americans to ignore the diminishing liberal message.\n“Our accomplishments cannot be limited to 28 days,” she wrote. Do not listen to liberals who try to limit you, to put you into a box, to tell you that you MUST believe one way or another, that you cannot think for yourselves, and that the government can “give” you a “special month”\nNo. I am sick of settling for breadcrumbs,” she said.\nDash is already being mocked for her lasted musing. New York Daily News reporter Denis Slattery called Dash’s blog “rambling.”\nFormer Fresh Prince star Janet Hubert said of Dash that “Somebody needs to slap the little bit of Black she got on her off of her, OK?”\n“I am an American and I cannot be categorized or limited by anyone else’s definition of me,” Dash wrote to her detractors. “I can tell by the hysterical reactions that it’s not WHITE PEOPLE who are trying to keep black Americans in their place. It’s BLACK people.”\n“We need to swipe the breadcrumbs on the floor and eat of the wonderful, rich food this nation offers.”\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/01/29/white-new-york-daily-news-writer-criticizes-clueless-rambling-stacey-dash/"}
