{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:44:48","date_modify":"2018-10-30 18:44:48","date_publish":"2016-06-02 20:44:22","description":"Actress and model Stacey Dash weighed in on the contentious debate over so-called transgender bathroom laws in an interview with Entertainment Tonight this week. | Entertainment","filename":"data/vaneerConsumption/StaceyDashOnTransBathroomsImNotPuttingMyChildsLifeAtRiskBecauseYouWanttoChangeaLaw.json","image_url":"https://media.breitbart.com/media/2015/02/stacey-dash-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_06_02__1540925088.html","title":"Stacey Dash On Trans Bathrooms: 'I'm Not Putting My Child’s Life At Risk Because You Want to Change a Law'","title_page":"Stacey Dash On Trans Bathrooms: 'I'm Not Putting My Child’s Life At Risk Because You Want to Change a Law' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Actress and model Stacey Dash weighed in on the contentious debate over so-called transgender bathroom laws in an interview with Entertainment Tonight this week.\nIn her new book, There Goes My Social Life: From Clueless to Conservative, the Clueless star criticizes Bruce Jenner and calls men who want to use women’s restrooms “tyranny by the minority.”\nThe 49-year-old Fox News co-host is also mother to a 13-year-girl named Lola. Dash told ET’s Nichelle Turner that she’s not comfortable with her daughter using the same public restroom as a man who happens to identify as a woman.\n“I’m not gonna put my child’s life at risk because you want to change a law,” she said. “So that you can be comfortable with your beliefs — which means I have to change my beliefs and my rights? No.”\n“Why do I have to suffer because you can’t decide what you wanna be that day?” Dash asked.\nPlaying the part of devil’s advocate, Turner suggested that transgender people wouldn’t necessarily classify their gender identity issue as a “choice.”\n“OK, then go to the [bathroom] in the bushes,” Dash said in response. “I don’t know what to tell you.”\nDash also criticized Lady Gaga’s anti-bullying campaign, characterizing it as another example of Hollywood forcing its “liberal agenda” on the rest of America.\n“Hollywood pushes a liberal agenda to the rest of the country,” she added. “And, whether we like it or not, Hollywood dictates the culture of the country.”\nFollow Jerome Hudson on Twitter: @jeromeehudson","url":"https://www.breitbart.com/entertainment/2016/06/02/stacey-dash-transgender-rights-im-not-putting-childs-life-risk-want-change-law/"}
