{"authors":["Greg Bluestein"],"date_download":"2018-10-30 21:01:07","date_modify":"2018-10-30 21:01:07","date_publish":"2016-07-25 19:00:31","description":"House Minority Leader Stacey Abrams drew a rousing applause for her forceful defense of Hillary Clin...","filename":"data/vaneerConsumption/StaceyAbramsatDNCDemocratsonthecuspofanewAmericanmajority.json","image_url":"https://politics.myajc.com/rf/image_large/Pub/p7/Politics-MyAJC/2016/07/25/Images/WPIMAGE_cmgajcpolitics_26073.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_stacey-abrams_eda7cd02c0fb52a6b96e7637d966109d__1540933267.html","title":"Stacey Abrams at DNC: Democrats on the cusp of a 'new American majority'","title_page":"Stacey Abrams at DNC: Democrats on the cusp of a 'new American majority'","title_rss":"NULL","source_domain":"ajc.com","text":"House Minority Leader Stacey Abrams drew a rousing applause for her forceful defense of Hillary Clinton, declaring her to be a leader for a \"new American majority.\"\nThe Georgia Democrat told the delegates about her hardscrabble upbringing in Mississippi in a family that was \"hit time and again by economic insecurity that was too often driven by racism, sexism and the ills that come with being born in the wrong Zip code.\"\n\"No matter how little we may have had, there was always someone with less,\" said Abrams, long considered a potential candidate for higher office in Georgia. \"And it was our job to serve that person. To know that even the most powerful among us, the strongest among us, did not rise up alone.\"\nThen Abrams launched into her case for Clinton, who she said \"understands that government at all levels is a profound expression of our common humanity, and our shared values - our aspirations not our fears.\"\nSaid Abrams, invoking some of her party's fights in Georgia:\n\"I'm here today as part of a new American majority, one that has the courage to work together rather than tear our nation apart. We are the architects of solutions to help families raise healthy children and make a living wage rather than crippling our economic future and pushing dangerous policies that deny Medicaid expansion and reproductive choice. We fight for more because that is who we are.\"\nHere's the full text:","url":"https://politics.myajc.com/blog/politics/stacey-abrams-dnc-democrats-the-cusp-new-american-majority/skzE0G00pDaNKwMJsf0qBN/"}
