{"authors":[],"date_download":"2018-10-21 02:50:37","date_modify":"2018-10-21 02:50:37","date_publish":"2018-09-05 10:22:04","description":"Alemany will anchor \"Power Up,\" a new early morning newsletter coming this fall.","filename":"data/vaneerConsumption/StaffannouncementJacquelineAlemanyjoinsThePost.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_05__1540090237.html","title":"Staff announcement: Jacqueline Alemany joins The Post","title_page":"Staff announcement: Jacqueline Alemany joins The Post - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Steven Ginsberg, national editor, Lori Montgomery, deputy national editor, Rachel Van Dongen, PowerPost editor, and Sara Sorcher, deputy PowerPost editor:\nWe’re thrilled to announce that Jacqueline Alemany will join The Washington Post as the anchor of a new early morning newsletter dedicated to breaking news about the people and power centers of Washington. The newsletter will chronicle the most important stories of the day for those who work in the nation’s capital and those who need to understand it, whether members of Congress, White House staffers, lobbyists, political news junkies or trade association executives.\nJackie comes to us from CBS News, where she has worked for the past year as a White House reporter. On that beat, she broke numerous stories about the Trump administration, including scoops about Scott Pruitt’s excessive spending, proposed cuts to the White House drug czar’s office and the lack of staffers in the Office of Science and Technology Policy. She also found time to travel to Tanzania, where she reported on civic engagement and climate change as a fellow for the International Women’s Media Foundation.\nIn 2016, Jackie was on the presidential campaign trail, covering the New Hampshire primary, the state of Ohio and the Bush, Kasich and Trump campaigns. She has worked as a digital producer for “60 Minutes” and a broadcast associate for “Face the Nation” on CBS.\nBefore joining CBS in 2013, Jackie graduated from Harvard University with a degree in government. She was also captain of the women’s basketball team. Please join us in welcoming her when she starts Sept. 17.","url":"https://www.washingtonpost.com/pr/wp/2018/09/05/staff-announcement-jacqueline-alemany-joins-the-post/"}
