{"authors":["Associated Press"],"date_download":"2018-10-22 21:57:03","date_modify":"2018-10-22 21:57:03","date_publish":"2017-04-26 03:05:24","description":"MANCHESTER, England (AP) - There were handshakes, smiles, even an embrace, in the first two head-to-heads between Pep Guardiola and Jose Mourinho in English...","filename":"data/vaneerConsumption/Stakeshigherfor3rdshowdownbetweenGuardiolaMourinho.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/03/wire-462823-1493172955-750_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446128_Stakes-higher-3rd-showdown-Guardiola-Mourinho_1540245423.html","title":"Stakes higher for 3rd showdown between Guardiola, Mourinho","title_page":"Stakes higher for 3rd showdown between Guardiola, Mourinho | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MANCHESTER, England (AP) - There were handshakes, smiles, even an embrace, in the first two head-to-heads between Pep Guardiola and Jose Mourinho in English soccer.\nWith the pressure and tension ramped up a notch for the third Manchester derby of the season, will the two coaching adversaries be able to retain their new-found cordiality on Thursday?\n\"This is about the clubs, the teams; this is about the positions at the end of the season,\" Mourinho, the United manager, said ahead of the Premier League match at City's Etihad Stadium. \"This is not about myself and Guardiola.\"\nFILE - In this Wednesday, Oct. 26, 2016 file photo, Manchester City's manager Pep Guardiola, left, and Manchester United's manager Jose Mourinho smile ahead of their English League Cup soccer match at Old Trafford stadium in Manchester. There were handshakes, smiles, even an embrace, in the first two head-to-heads between Pep Guardiola and Jose Mourinho in English soccer. With the pressure and tension ramped up a notch for the third Manchester derby of the season, will the two coaching adversaries be able to retain their new-found cordiality on Thursday, April 27? (AP Photo/Dave Thompson, file)\nSo far, it's Guardiola 1, Mourinho 1.\nGuardiola had arguably the more important victory, 2-1 at Old Trafford in the league on Sept. 10 when his City team produced a dazzling first-half performance at Old Trafford in the midst of a 10-match winning start to the season.\nMourinho got his own back six weeks later when United beat City 1-0 in the fourth round of the English League Cup.\nOn both occasions, in the build-up and during the game, there was no sign of the bitterness and animosity that marked their meetings in Spanish soccer from 2010-12 when in charge of Barcelona and Real Madrid.\nIndeed, they seemed to make a point of showing respect for one another, dispensing with any mind games pre-match and being courteous in the technical area in the heat of battle.\nThe stakes will be higher on Thursday, though, with the teams separated by one point and one place with five league games left. City, in fourth place, and United, in fifth place, might finish the season fighting for one Champions League qualification spot.\nOne flashpoint in a game that is too close to call, and the old tensions between the two managers could yet resurface.\nAnder Herrera wasn't downplaying the significance of this latest derby.\n\"It is going to be the game of the season,\" the United midfielder said with relish.\nMourinho has won just two of his last 11 meetings with Guardiola's teams, and four of 18 in total.\nHe might just have the edge this time round, with United having finally reeled in the top four after a 23-match unbeaten run in the league dating back to a 4-0 loss at Chelsea on Oct. 23. If United avoids defeat, it will equal the club's longest unbeaten top-flight run in a single season (24 matches in the 2010-11 season).\n___\nSteve Douglas is at www.twitter.com/sdouglas80\nManchester United manager Jose Mourinho applauds the fans after the English Premier League soccer match against Burnley at Turf Moor, Burnley, England, Sunday April 23, 2017. (Martin Rickett/PA via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4446128/Stakes-higher-3rd-showdown-Guardiola-Mourinho.html"}
