{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:10:57","date_modify":"2018-10-30 21:10:57","date_publish":"2015-04-14 16:39:44","description":"A junior at Stanford University has filed an official complaint after being questioned about whether her Jewish faith would affect her ability to serve in the student Senate. The allegedly antisemitic incident is the second such recent case in California, coming a month after UCLA's student council questioned a candidate for student office about her Jewish faith. |","filename":"data/vaneerConsumption/StanfordStudentFilesComplaintafterJewishFaithQuestioned.json","image_url":"https://media.breitbart.com/media/2015/01/Stanford-Wikimedia-Commons.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_04_14__1540933857.html","title":"Stanford Student Files Complaint after Jewish Faith Questioned","title_page":"Stanford Student Files Complaint after Jewish Faith Questioned | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A junior at Stanford University has filed an official complaint after being questioned about whether her Jewish faith would affect her ability to serve in the student Senate. The allegedly antisemitic incident is the second such recent case in California, coming a month after UCLA’s student council questioned a candidate for student office about her Jewish faith.\nDuring a March 13 endorsement interview, a member of the Students of Color Coalition reportedly asked Molly Horowitz, “Given your strong Jewish identity, how would you vote on divestment?” according to the Times of Israel.\nIn February, the student Senate at Stanford joined Northwestern University and a host of UC schools in passing a resolution calling for divestment from Israel. That same month, the UC Student Association voted at UCLA to divest from Israel (as well as America and much of the rest of the world). And one week prior to that vote, Jewish students at UC Davis awoke on their Sabbath to swastikas spray-painted on the side of a fraternity after their own student association had passed an anti-Israel resolution, accompanied by shouts of “Allahu Akbar!” as pro-Israel students walked out of the meeting.\nHorowitz reportedly told the Stanford student coalition that she had disapproved of her school’s Senate vote for divestment, but reiterated her belief in the Senate’s democratic system, the Times writes. She also expressed her hope for a peaceful Middle East: in her endorsement application, she had reportedly written, “I identify as a proud South American and as a Jew” and “I felt like I was not enough for the Latino community and further embraced my Jewish identity.”\nHorowitz filed a complaint shortly after facing question and has asked for a public apology from the student coalition. The coalition reportedly gave a different account of the incident. The elections will be held on Tuesday, according to the Times.\nAt UCLA, the Jewish student was unanimously confirmed only after intervention by a faculty member who noted that a student’s religious affiliation could not be considered a conflict of interest. The students who had voted against her because she is Jewish apologized, However, the incident suggested a broader problem of antisemitism within the UC system.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/local/2015/04/14/stanford-student-files-complaint-after-jewish-faith-questioned/"}
