{"authors":[],"date_download":"2018-10-31 00:16:21","date_modify":"2018-10-31 00:16:21","date_publish":"2016-12-02 00:00:00","description":"The penalties were the latest punitive measures taken by the Singapore central bank in its crackdown on money laundering.","filename":"data/vaneerConsumption/StandardCharteredandCouttsfinedinAsiamoneylaunderingcrackdown.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-singapore-central-bank-slaps-penalties-on-stanchart-coutts-in-1mdb-related-probe-2016-12_1540944981.html","title":"Standard Chartered and Coutts fined in Asia money laundering crackdown","title_page":"    Standard Chartered and Coutts fined in Asia money laundering crackdown - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A man walks past the name of Coutts displayed on a branch of the bank in central London August 11, 2014. Reuters SINGAPORE (Reuters) - Singapore's central bank said on Friday it imposed penalties on the local units of U.K.-based Standard Chartered Bank and Coutts for money laundering breaches related to Malaysia's scandal-tainted 1MDB fund.\nThe penalties - of S$5.2 million ($3.65 million)and S$2.4 million, respectively - were the latest punitive measures taken by the central bank in its crackdown on money laundering, having ordered the closure earlier this year of the local units of Swiss banks BSI and Falcon.\nThe inspection at Standard Chartered \"revealed significant lapses in the bank's customer due diligence measures and controls for ongoing monitoring,\" the Monetary Authority of Singapore said.\nWhile the 28 breaches were \"serious\", the central bank did not find \"wilful misconduct.\" Standard Chartered said in a statement it is taking action to strengthen controls and surveillance systems.\n\"We regret that 1MDB-related transactions passed through Standard Chartered Bank Singapore accounts from 2010 to early 2013,\" the statement said. \"We reported the suspicious transactions, both before and at the time we exited the accounts in early 2013, and have been fully cooperating with the authorities investigating this matter.\"\nMalaysia's 1MDB, once a pet project of Prime Minister Najib Razak who chaired its advisory board, is the subject of money-laundering investigations in at least six countries, including Switzerland, Singapore and the United States.\nAt Coutts, a private bank, the investigation revealed 24 breaches of AML requirements in relation to customer due diligence measures for politically exposed persons.\nThis was the result of actions or omissions of officers who have since left the bank, including Yak Yew Chee and Yvonne Seah, who had left Coutts to join BSI Bank in late 2009.\nCoutts International was sold by Royal Bank of Scotland to Union Bancaire Privee in March 2015 and is in the process of winding down its Singapore operations. UBP did not immediately respond to requests for comment.\nMAS is also in the process of issuing a prohibition order against Tim Leissner, a former director and representative of Goldman Sachs Singapore.\nLeissner was responsible for managing the relationship with 1MDB when Goldman Sachs was engaged by the fund to arrange three bond issues from 2012 to 2013. MAS's investigation found he had made false statements on behalf of his bank without its knowledge or consent.\n\"Today's announcement refers to a matter we discovered in January of this year and identified as a clear violation of the firm's standards...We continue to cooperate with the MAS,\" Goldman Sachs said in a statement.\nThe proposed order will prohibit Leissner for a period of 10 years from performing any regulated activity under the Securities and Futures Act or taking part, directly or indirectly, in the management of any capital market services firm in Singapore.\nThe central bank said it was nearing the end of its 1MDB-related investigations and will provide a final update early next year.","url":"https://www.businessinsider.com/r-singapore-central-bank-slaps-penalties-on-stanchart-coutts-in-1mdb-related-probe-2016-12"}
