{"authors":["Simon Black","Sovereign Man"],"date_download":"2018-10-30 23:24:52","date_modify":"2018-10-30 23:24:52","date_publish":"2018-07-19 00:00:00","description":"The US missed an opportunity to offset revenue loss and tackle generational equity when Congress passed tax reform. Instead, government debt is set to increase to levels only reached during World War II over the next decade.","filename":"data/vaneerConsumption/STANLEYDRUCKENMILLERItstimetogiverealcapitalismachance.json","image_url":"https://amp.businessinsider.com/images/5b50e43996957319008b4880-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_federal-debt-soars-congress-missed-opportunity-for-real-capitalism-2018-7_1540941892.html","title":"STANLEY DRUCKENMILLER: It's time to give real capitalism a chance","title_page":"    Federal debt soars, Congress missed opportunity for real capitalism - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty/Neilson Barnard\nOver the weekend I came across a recent speech given by hedge fund billionaire Stanley Druckenmiller that really lays out the pitiful state of free markets around the world.\nDruckenmiller gave the speech a few months ago upon receiving the 2018 Alexander Hamilton award- which is given to a figure that best carries out the spirit of one of America's Founding Fathers.\nThe Alexander Hamilton Institute promotes free markets, free trade and limited government.\nAnd Druckenmiller's speech below is an excellent discussion of where our economy stands today and how government intervention is grossly distorting the economy- not just in the US, but around the world.\nI couldn't agree more with his sentiment. I've edited the piece for length, so this is just a series of excerpts. But there's a link to the full speech at the bottom:\n—-\nCan we try capitalism? Real capitalism. Give it a chance.\nNot the increasingly bastardized version we have been practicing the last two decades.\nAnd then let's just see whether a capitalist economic system is the most effective way to bring about broad-based prosperity and the flourishing of human dignity.\nFor eight years I watched the Obama administration disparage the efficacy and fairness of capitalism.\nThe influence of government increased in every aspect of our lives. The cost of regulation doubled. Corporate America was attacked in the name of social equality.\nAnd our healthcare system, hard to believe, was made even more inefficient.\nNow, I did not support Donald Trump. But, after he was elected, I was at least hopeful that it would represent an inflection point in the trend away from capitalism.\nBut . . . we missed the golden opportunity to offset some revenue loss and address generational equity when Congress passed tax reform.\nInstead, government debt, which has doubled over the last decade, is set to increase to levels only reached during World War II over the next decade.\nSo we will have sacrificed our future during a relatively peaceful economic period . . . simply because politicians can't say no.\nFinally, let me address a distortion that is one of the greatest threats to a properly functioning capitalist system.\nFor years now a mix of financial repression and central bank intervention has made long-term interest rates largely determined by government fiat.\nBond-buying by central bankers, commonly referred to as Quantitative Easing (QE), has become so ingrained in current thinking that it is now in the Fed's conventional toolkit- a tool once reserved for a depression or financial crisis is now to be used at the first inkling of the next recession.\nFor those of us old enough to have seen the dangers of price controls, they led to shortages, wasted resources, and disincentives to invest in what consumers want.\nThey inevitably led to an allocation of resources by political actors in another great affront to capitalism.\nSo, it is most surprising that forty years after wage and price controls were sadly rejected by every economic textbook and policymakers, today we have settled to allowing the most important price of all, long-term interest rates, to be regularly distorted by [the central bank.]\nThe excuse of this radical monetary policy has been the obsession with a fixed 2.0% inflation targeting rule.\nThe decimal point shows the absurdity of the exercise: anything below 2.0% was a failure and risked deflation- the boogeyman of the 1930s- to be avoided at all costs.\nThis has meant that years after the Great Recession ended the Fed has not only kept interest rates below inflation but have accumulated an unprecedented $4.5 trillion on their balance sheet by doing QE.\nGlobal central banks, in part to keep their currencies from appreciating of these overabundant dollars, have followed with $10 trillion of their own.\nNow, the irony of this is over the last 700 years inflation has averaged barely over 1% and interest rates have averaged just under 6%. So, we are seeing an unprecedented, ultra-monetary, radical monetary expansion during a time of average, average inflation over the last number of centuries.\nMoreover, the three most pernicious deflationary periods of the past century did not start because inflation was too close to zero. They were preceded by asset bubbles.\nIf I were trying to create a deflationary bust, I would do exactly what the world's central bankers have been doing the last six years. I shudder to think that the malinvestment that occurred over this period.\nCorporate debt has soared, but most of it has been used for financial engineering. Bankruptcies have been minimal in the most disruptive economy since the Industrial Revolution.\nWho knows how many corporate zombies are out there because free money is keeping them alive?\nIndividuals have plowed ever-increasing amounts of money into assets at ever-increasing prices, and it is not only the private sector that is getting the wrong message, but Congress as well.\nOf all the interventions by the not-so-invisible hand, not allowing the market to set the hurdle rate for investment is the one I see with the highest costs.\nCompetition is a better tool than price control for protecting consumers. That applies to Amazon AND the bond market.\nYou can read the full speech here.","url":"https://www.businessinsider.com/federal-debt-soars-congress-missed-opportunity-for-real-capitalism-2018-7"}
