{"authors":["John Nolte"],"date_download":"2018-10-30 19:36:29","date_modify":"2018-10-30 19:36:29","date_publish":"2015-12-18 05:07:32","description":"Disney has done an amazing job keeping the plot under wraps. This review will honor that. The strokes will be broad. Biases upfront. I am no \"Star Wars\" |","filename":"data/vaneerConsumption/StarWarsTheForceAwakensReviewJJAbramsRepentsfortheSinsofGeorgeLucas.json","image_url":"https://media.breitbart.com/media/2015/12/Star-Wars-Force-Awakens-Poster.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_17__1540928189.html","title":"'Star Wars: The Force Awakens' Review: J.J. Abrams Repents for the Sins of George Lucas","title_page":"'Star Wars: The Force Awakens' Review: J.J. Abrams Repents for the Sins of George Lucas | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Disney has done an amazing job keeping the plot under wraps. This review will honor that. The strokes will be broad.\nBiases upfront. I am no “Star Wars” fanboy. The original trilogy is terrific, at least until the Ewoks show up in “Jedi.” The prequels are a watchable, if hollow spectacle. If this reboot didn’t happen, that would be just fine with me. Nevertheless, as the lights dimmed and the now-familiar beats of the opening of a “Star Wars” movie played out, I found myself smiling.\n“The Force Awakens” (TFA) is far better than the prequels but not as good as the original trilogy, most especially “A New Hope” and “The Empire Strikes Back.” The first half is near-perfect — very entertaining. Lots of action. Lots of laughs. The exact right touches of nostalgia. As the 135 minutes rolled on, things do start to drag. The guy next to me checked his watch more than once.\nOn the downside, you are not left wanting more. On the upside, you are not left wondering if that’s all there is. That’s not exactly the sweet spot, let’s agree to call it close enough. The climax is a bit of a disappointment — plenty busy but lacking in suspense. As you might imagine, the stakes are enormous, and there are a few emotional surprises, but I was nowhere near the edge of my seat or in awe. In ways big and small, TFA’s main story is shockingly similar to “A New Hope,” which is actually a distraction as you compare the two.\nOverall, I walked away with the sense that Abrams is using TFA to cleanse the franchise’s palate. Disney wants to pop one of these out every year until the end of time, and TFA feels like an apology, a repentance for the sins of creator George Lucas. Abrams and Disney are saying, “We hear you. We’ve fixed it. Let’s kiss and make up so we can hold hands and walk off into a marvelous future together.”\nLet’s take these one-by-one:\nThe Prequels\nEpisodes I, II, and III have been completely erased from the canon. This is unspoken and unspoken loudly. There are plenty of opportunities for characters to reference things like “midi-chlorians,” and no one does. The nods to the original trilogy, however, are everywhere.\nOne of the biggest mistakes Lucas made with the prequels was creating a world that felt nothing like the original “Star Wars” universe. If we had felt more at home and less like we were watching a computer videogame, the goodwill might have helped paper over the prequel’s many flaws.\nFixing this might be TFA’s greatest accomplishment. Every scene, every prop, every costume feels like a homecoming. Good stuff.\nShameless Merchandising\nSince the arrival of the Ewoks straight through to the prequels, you always felt a little used, a tad taken for granted as you watched a hybrid of a movie and toy commercial.\nThere is none of that here.\nRacism\nFrom “Star Wars” (are there no black people in space?) on, Lucas has faced numerous complaints about ethnic stereotyping and a lack of diversity. I’m not talking about that idiot Melissa Harris Perry freaking out over Darth Vader; but complaints like these seemed to pop up with each new chapter.\nAbrams not only cast a young black man (a fantastic John Boyega as Finn) in a lead role, the familiar ethnic touchstones Lucas was so fond of have been completely stripped away.\nSexism\nPrincess Leia is now General Leia, and in just a few lines of dialogue Abrams signals early on that the era of the damsel in distress is over. As they run from danger, Finn reflexively grabs the hand of Rey (Daisy Ridley) only to have her protest, “I know how to run!”\nAgain, I don’t want to give too much away, but by the end the franchise takes a major leap into “Hunger Games” territory. The poster doesn’t lie. A woman is now driving the action and something else.\nThis is the only change that felt a bit too precious and programmed for me. I’m fine with women action heroes. Hell, I dig the “Resident Evil” franchise a lot more than “Star Wars.” It just seemed like TFA went out of its way to ensure Rey is never put in a position where she is saved by a man. You could feel the movie avoiding that, taking a wider path than necessary.\nThere are also female stormtroopers and female rebellion pilots. I know that we now live in a world where the horrors of feminism have morphed into this bizarre era where liberating yourself from men means acting exactly like a man, but does Leia have to dress like a 60 year-old lesbian?\nIn the original trilogy, Leia was perfect. She was both feminine and capable, a beauty who gave as good as she got, a woman who could handle a blaster and Han Solo’s ego, a princess who rocked out a slave bikini while strangling the pig who made her wear it.\nThere are women in TFA but there’s no femininity, no female beauty or grace, none of the qualities that make women so special.\nIs it my age speaking when I say why even bother to create female characters who are only going to dress and act like men?\n—\nOne thing that might worry Disney is the fact that TFA would not be much without the original cast of characters. Harrison Ford’s Han Solo is the real star, and even more so, he’s the entire heart and soul of the movie. There wouldn’t be much of a movie without him and the others. Eventually, as this cinematic universe expands, Disney won’t have Luke, Han, Chewie, and Leia to lean on.\nThe new “Star Trek” franchise (another Abrams reboot) is successful, but without the original cast, so much is missing. We enjoy the new movies, we just don’t fall in love with them. We have fun at these movies, we do not, though, cherish them. Without that emotional connection, the movies feel disposable — closer to an amusement park ride than to a touchstone in our lives.\nIt would be a shame if the same happened to the “Star Wars” universe.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/12/17/star-wars-the-force-awakens-review-j-j-abrams-repents-for-the-sins-of-george-lucas/"}
