{"authors":["Alana Wise"],"date_download":"2018-10-30 22:53:06","date_modify":"2018-10-30 22:53:06","date_publish":"2018-07-26 00:00:00","description":"Wall Street braced for a disappointing quarter from the ubiquitous coffee brand, and its shares were relatively unchanged in after-market trading.","filename":"data/vaneerConsumption/Starbucksreportsrecordrevenuebuttrimsoutlookfortheyear.json","image_url":"https://amp.businessinsider.com/images/5b5a5bacdcee302e008b46da-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_starbucks-reports-cooling-quarterly-growth-and-pares-outlook-2018-7_1540939986.html","title":"Starbucks reports record revenue but trims outlook for the year","title_page":"    Starbucks tops estimates and reports record highs but trims outlook for the year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Gustavo Devito/Flickr\nNEW YORK (Reuters) - Starbucks forecasts slower growth for the current fiscal year as boutique coffee chains and fast-food retailers won business in the United States and other established markets and the bloom came off once-booming China.\nWall Street had been braced for a disappointing quarter from the ubiquitous coffee brand, and its shares were relatively unchanged in after-market trading.\nSeattle-based Starbucks last month warned of lower quarterly sales growth and announced plans to close about 150 U.S. cafes in the next fiscal year, triple the typical number of closures, as it seeks to enter under-served markets in the U.S. South and Midwest.\nBut investors saw bright spots in the results, as Starbucks, the world's biggest coffee retailer, reported revenue rose to a record high in its fiscal third quarter. The company also pledged a $10 billion increase in its share buyback and dividend commitment, to $25 billion through fiscal year 2020.\nJason Lee / REUTERS\nStarbucks said its same-store sales rose just 1 percent globally and in its U.S. cafes in its third quarter ended July 1. Same-store sales in China slipped 2 percent amid fierce competition and stricter regulations on delivery services.\n\"While acknowledging a disappointing Q3, I want to be clear that we have 100 percent confidence in our growth strategy and the sustainability of the leadership position we have built in the market,\" Chief Executive Officer Kevin Johnson said in the company's quarterly earnings call.\nStarbucks blamed a combination of cannibalization of its own stores and hiccups in its China delivery program for much of the slowdown in the country.\nIn the year-ago quarter, Starbucks' same-store sales grew by 5 percent in the United States and Americas and 4 percent globally. The sales dip in China is an even steeper departure from the 7 percent growth rate reported in last year's quarter.\nRevenue rose to $6.3 billion from $5.7 billion in the year prior. Starbucks' closely monitored digital membership program grew 14 percent year-over-year to 15.1 million active users.\nStarbucks' shares are down 10.4 percent year to date.\nThe company said it now expects full-year same-store sales growth to be \"just below\" its 3 percent to 5 percent targeted range, and sees fourth-quarter growth at the lower end of its 3 percent to 5 percent range.\nStarbucks' report comes exactly one month after Howard Schultz, the brand's elder statesman and former chief executive, stepped down as executive chairman, in a move that stoked investor concerns on how the company would evolve after nearly four decades of Schultz's near-constant presence.\n(Reporting by Alana Wise; Editing by Leslie Adler)","url":"https://www.businessinsider.com/starbucks-reports-cooling-quarterly-growth-and-pares-outlook-2018-7"}
