{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:34:18","date_modify":"2018-10-30 19:34:18","date_publish":"2015-12-27 22:27:30","description":"'Star Wars'-Themed Disneyland Expansion Begins","filename":"data/vaneerConsumption/StarWarsThemedDisneylandExpansionBegins.json","image_url":"https://media.breitbart.com/media/2015/12/Disney-WireAP_.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_27__1540928058.html","title":"'Star Wars'-Themed Disneyland Expansion Begins","title_page":"'Star Wars'-Themed Disneyland Expansion Begins","title_rss":"NULL","source_domain":"breitbart.com","text":"Construction is set to begin next month on the new galaxy-sized Star Wars expansion at the Disneyland theme park in Anaheim.\nThe California park will close 10 attractions, some permanently, on January 10 as it kicks off construction on the 14-acre expansion. Disney CEO Bob Iger had announced the expansion plans at the D23 Fan Expo in August.\nTo make room for the new Star Wars attractions, the park will permanently shutter the Big Thunder Ranch area of Frontierland, including the Big Thunder Ranch petting zoo and Jamboree, according to the Los Angeles Times. Attractions that will close temporarily include the Fantasmic show, the Mark Twain Riverboat, the Sailing Ship Columbia, the Disneyland Railroad, the Dacy Crockett Explorer Canoes and the Pirates Lair on Tom Sawyer Island.\nIt is not yet known which attractions the Star Wars-themed area will include, but Iger revealed two in August: a ride where guests can pilot Han Solo’s classic spaceship the Millennium Falcon, and an adventure that would put guests in the middle of a “climactic battle between the First Order and the Resistance.”\nNo completion date has been set for the project.\nIn addition to closing down attractions, Disney will move employees from office buildings located near Big Thunder Ranch into two new office buildings located a few blocks from the park. In total, 14 precent of the park will reportedly be closed while construction gets underway.\nThe construction at the park likely won’t hurt attendance, one theme park consultant told the Times. Sylmar resident Daniel Bowmen, who has reportedly held a premium annual pass for the last 24 years, told the paper he’ll still be attending the park, and even recently renewed his pass.\nDisneyland has already made minor adjustments to the park in conjunction with the December 18 release of Star Wars: The Force Awakens. The park added Star Wars effects to the Space Mountain rollercoaster, turning it into “Hyperspace Mountain,” and transformed an underused space into Star Wars Launch Bay, a space-themed arcade and restaurant area. The changes are part of the park’s “Season of the Force,” which kicked off November 15 and does not yet have an end date.\nMany had predicted that Disney would look to incorporate Star Wars into its theme parks shortly after the company acquired Lucasfilm for $4 billion in 2012.","url":"https://www.breitbart.com/local/2015/12/27/star-wars-themed-disneyland-expansion-begins/"}
