{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:39:55","date_modify":"2018-10-30 22:39:55","date_publish":"2016-12-12 00:00:00","description":null,"filename":"data/vaneerConsumption/StarbuckspartnerswithWeChat.json","image_url":"https://amp.businessinsider.com/images/584ebb5da1a45e60398b4a65-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_starbucks-partners-with-wechat-2016-12_1540939195.html","title":"Starbucks partners with WeChat","title_page":"    Starbucks partners with WeChat - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII This story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nA new pact between Starbucks and Tencent-owned messaging app WeChat stands to help both parties.\nThe deal will let WeChat users in China digitally send Starbucks-branded gifts and products to friends and family and enable in-store payment at the coffee chain's 2,500 Chinese locations with the WeChat Pay mobile wallet.\nHere's how the deal will help Starbucks extend its reach in the world's most populous country:\nAnd the strategic partnership will be instrumental in helping WeChat push features consumers are interested in. WeChat is massive for peer-to-peer (P2P) payments, but lags behind rival Alipay in-store. This is likely why the the company has added a popular retailer like Starbucks to its portfolio of stores that accept WeChat Pay, joining KFC, Disney and Uniqlo. On top of partnering with a popular brand, WeChat is also adding a feature that has been successful in the past.\nIn China, it's traditional for individuals to send red envelopes of money to friends and family for the Chinese New Year. WeChat saw over 8.1 billion digital red envelopes sent this year alone. It's likely the social app could increase payments volume on its mobile wallet by leveraging interest in social gifting, and partnering with a retailer that now accepts WeChat Pay.\nThe U.S. payments ecosystem is in the midst of a shift toward mobile, and countless new and old stakeholders are attempting to accelerate this migration, which is moving at a glacial pace relative to other markets globally. But mobile payments can rise to the mainstream. For companies seeking to build out a robust mobile payments product, China's thriving mobile payments ecosystem offers some insight — and some lessons.\nTotal mobile payments volume in China will reach $6.3 trillion by 2020, according to our estimates based on iResearch data. This marks a healthy 33% five-year compound annual growth rate (CAGR). In comparison, the U.S. will generate $154 billion in mobile payments volume this year by our estimates, which amounts to just 6.5% of China's mobile payments volume.\nEven accounting for population discrepancies, China will generate over $1,700 in mobile payments volume per capita in 2016, compared with $475 in the U.S., based on forecasts from BI Intelligence and eMarketer. China's advantage will eventually diminish, but it will still produce around twice as much volume per capita in 2020.\nChina has unique factors buoying the industry, like the dominance of mobile phones, a lack of legacy infrastructure, and the surging popularity of digital retail marketplaces. Some of the characteristics behind the country's success can be mimicked, or even replicated to some extent, in other markets like the U.S. However, one fundamental barrier in the U.S. is that it's being forced to layer mobile payments on top of an existing payments system, and the ecosystem is very fragmented.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed report on mobile payments in China that takes a deep dive into China's mobile payments ecosystem and deciphers which growth drivers can be exported to the U.S. to help spark its relatively lackluster market.\nHere are some of the key takeaways:\nChina claims the world's largest mobile payments market and serves as the global benchmark for other markets to pursue.China will process a whopping $6.3 trillion in total mobile payments by 2020, according to our estimates based on iResearch data. This marks a healthy 33% five-year compound annual growth rate (CAGR).\nIt dwarfs the U.S.' mobile payments industry.The US will generate $154 billion in mobile payments volume this year by our estimates, which equates to just 6.5% of China's mobile payments volume.Meanwhile, China will generate over $1,700 in mobile payments volume per capita in 2016, compared with $475 in the U.S., based on forecasts from BI Intelligence and eMarketer.\nMobile commerce, a lack of legacy infrastructure, and marketplaces have fueled China's enormous success.Consumers in China are much more comfortable shopping on their mobile phones compared with their counterparts in the U.S., and the devices face less resistance from other legacy payments methods like credit cards. The open approach to mobile shopping has been fortified by Alibaba, a Goliath-sized marketplace, and WeChat, a go-to messaging platform, which support Alipay and Tenpay, respectively.\nIn full, the report:\nForecasts and compares mobile payments volume, in-store mobile payments users, mobile payments volume per capita, and mobile commerce penetration in China and the U.S.\nOverviews the key competitors in China's mobile payments market, and how new entrants may shuffle the hierarchy of dominant players.\nUncovers the key drivers propelling China's mobile payments market.\nIdentifies which drivers the U.S. can import from China, and which barriers may be standing in the way.\nInterested in getting the full report? Here are two ways to access it:","url":"https://www.businessinsider.com/starbucks-partners-with-wechat-2016-12"}
