{"authors":[],"date_download":"2018-10-22 22:39:43","date_modify":"2018-10-22 22:39:43","date_publish":"2017-03-10 01:20:45","description":"On January 29, Starbucks CEO Howard Schultz vowed to hire 10,000 refugees over five years in the countries where it does business. Since then, critics have been boycotting the coffee chain.","filename":"data/vaneerConsumption/StarbucksCEOsrefugeecommentssourviewsofchain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E238EA600000578-0-image-a-2_1489160919444.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299672_Starbucks-CEOs-refugee-comments-sour-customer-views-chain-survey_1540247983.html","title":"Starbucks CEO's refugee comments sour views of chain","title_page":"Starbucks CEO's refugee comments sour views of chain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Starbucks' vow to hire thousands refugees in response to President Donald Trump's first travel ban appears to be hurting customer sentiment of the coffee chain, and financial analysts say it is denting their sales.\nTrump supporters have called for a boycott of the chain since January 29, when Starbucks Chief Executive Howard Schultz vowed to hire 10,000 refugees over five years.\nSchultz in a letter to employees said the promise of the American Dream was 'being called into question' and that 'the civility and human rights we have all taken for granted for so long are under attack.'\nAfter the letter was made public, consumer perception levels took an immediate hit as measured by YouGov BrandIndex's Buzz score, falling by two-thirds between January 29 and February 13, and have not recovered.\nSince Starbucks CEO Howard Schultz pledged to hire 10,000 refugees, the brand's consumer perception levels have fallen two thirds. Consumer perception is determined by surveying a group of people and asking 'If you've heard anything about the brand in the last two weeks, through advertising, news or word of mouth, was it positive or negative?'\nYouGov BrandIndex, which tracks consumers' sentiment toward companies and their willingness to purchase from those brands, noted that the data around this boycott is different because both measures are declining.\nAnalysts at Credit Suisse also believe the coffee giant's move has had a negative impact on recent sales, and could continue to hurt them in the near future, CNBC reported.\nStarbucks Buzz score fell to 4 from 12 during that time. Such scores can range from 100 to -100 and are compiled by subtracting negative feedback from positive. A zero score means equal positive and negative feedback.\nPrior to Schultz's refugee comments, 30 per cent of consumers said they would consider buying from Starbucks the next time they made a coffee purchase.\nThat fell to a low of 24 per cent and now stands at 26 per cent, according to a YouGov spokesman.\n'Consumer perception dropped almost immediately,' said YouGov BrandIndex CEO Ted Marzilli, who added that the statistically significant drop in purchase consideration data showed that consumers became less keen to buy from Starbucks.\nCritics of Schultz's (above) comments have been boycotting the chain ever since\n'That would indicate the announcement has had a negative impact on Starbucks, and might indicate a negative impact on sales in the near term,' he said.\nMarzilli noted that the Starbucks holiday 'red cup' controversy from November 2015 corresponded with an even larger drop in perception, but no real impact on purchase consideration scores.\nAmong other things, boycott supporters are urging like-minded friends to support Starbucks rival Dunkin' Donuts . Representatives from Starbucks and Dunkin' Donuts declined to comment on the surveys and the boycott's impact on sales.\nThe consumer sentiment data comes at a sensitive time for Starbucks, which reported an accelerated decline in traffic to established U.S. restaurants during the latest quarter.\nStarbucks executives pinned much of the blame for its traffic setback on a pileup of mobile orders, which caused bottlenecks at drink pickup stations that thwarted walk-in customers.","url":"https://www.dailymail.co.uk/news/article-4299672/Starbucks-CEOs-refugee-comments-sour-customer-views-chain-survey.html"}
