{"authors":["Jerome Hudson"],"date_download":"2018-10-30 17:57:35","date_modify":"2018-10-30 17:57:35","date_publish":"2016-12-27 19:41:47","description":"Mark Hamill, David Prowse, Billy Dee Williams and Peter Mayhew paid tribute to their late Star Wars co-star on social media.","filename":"data/vaneerConsumption/StarWarsCoStarsMournDeathofActressCarrieFisher.json","image_url":"https://media.breitbart.com/media/2016/12/CarrieFisherPrincessLeia.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_12_27__1540922255.html","title":"'Star Wars' Co-Stars Mourn Death of Actress Carrie Fisher","title_page":"'Star Wars' Co-Stars Mourn Death of Actress Carrie Fisher","title_rss":"NULL","source_domain":"breitbart.com","text":"Star Wars cast members and a slew of other Hollywood celebrities took to social media Tuesday afternoon to offer condolences in reaction to the death of acclaimed actress Carrie Fisher.\nThe Star Wars star died on Tuesday, just days after suffering a massive heart attack on a flight from London to Los Angeles. The actress, writer, producer and mother, best known for her iconic role as Princess Leia in the original Star Wars trilogy, was 60 years old. She is survived by her mother Debbie Reynolds, her 24-year-old daughter, Billie Lourd, one brother and two sisters.\nFisher’s Star Wars co-stars, including Mark Hamill (Luke Skywalker), Billy Dee Williams (Lando Calrissian), Peter Mayhew (Chewbacca) and David Prowse (Darth Vader) weighed in with their condolences on Twitter, along with dozens of other celebrities.\nI'm deeply saddened at the news of Carrie's passing. She was a dear friend, whom I greatly respected and admired. The force is dark today! — Billy Dee Williams (@realbdw) December 27, 2016\nThere are no words for this loss. Carrie was the brightest light in every room she entered. I will miss her dearly. pic.twitter.com/GgIeYGeMt9 — Peter Mayhew (@TheWookieeRoars) December 27, 2016\nI am extremely sad to learn of Carrie's passing. She was wonderful to work with. Condolences to her friends, family & fans around the world. pic.twitter.com/DGRYQYPZgO — DARTH VADER (@isDARTHVADER) December 27, 2016\nI'm deeply saddened to learn of the death of Carrie Fisher. I will miss our banterings. A wonderful talent & light has been extinguished. — William Shatner (@WilliamShatner) December 27, 2016\nR.I.P. Carrie Fisher. A brilliantly funny, talented woman. We will miss your humor now more than ever. — Albert Brooks (@AlbertBrooks) December 27, 2016\nWhen I was a young man, Carrie Fisher was the most beautiful creature I had ever seen. She turned out to be witty and bright as well. — Steve Martin (@SteveMartinToGo) December 27, 2016\nCarrie Fisher has passed, she was funnier&smarter than anyone had the right to be. Sail On Silver Girl. Condolences Debbie & Billie\nR.I.P. — Whoopi Goldberg (@WhoopiGoldberg) December 27, 2016\nCarrie Fisher was smart, funny, talented, surprising, and always a hell of a fun time to be around. Family Guy will miss her immensely. — Seth MacFarlane (@SethMacFarlane) December 27, 2016\nSuch a sad day for her family, friends and millions of fans. Carrie Fisher is deeply missed. — Jon Favreau (@Jon_Favreau) December 27, 2016\nNo. No. Fuck this shit. Carrie Fisher is a fucking legend and this is bullshit. — Anna Kendrick (@AnnaKendrick47) December 27, 2016\nDear #carrieFisher every time an artist is born the world gains everytime we lose an artist the world loses! R.I.P pic.twitter.com/EqO46xiLIQ — John Leguizamo (@JohnLeguizamo) December 27, 2016\n.@CarriefFisher was a brilliant writer, actor, and friend. She was so much fun. I can't believe she's gone. https://t.co/wpxGvBWA0b — Ellen DeGeneres (@TheEllenShow) December 27, 2016\nthoughts and prayers to Carrie Fisher's family — Ryan Seacrest (@RyanSeacrest) December 27, 2016\nOh no!! Carrie wasn't done yet! https://t.co/hAvLtKfLmA — mia farrow (@MiaFarrow) December 27, 2016\nSweet, Brilliant, Irreverent, Huge hearted Carrie, You gave me advice I live by to this day, & always will. On the wings of angels fly…❤️ — Sarah Paulson (@MsSarahPaulson) December 27, 2016\n#CarrieFisher was so witty and provocative and unrelentingly interesting. Goddamn, I loved her. Everyone did. — Elizabeth Banks (@ElizabethBanks) December 27, 2016\nIf I heard Carrie Fisher was going to make an appearance I wanted to see it. U know ur special when Meryl Streep plays YOU in a movie. RIP. — billy eichner (@billyeichner) December 27, 2016\nFollow Jerome Hudson on Twitter: @JeromeEHudson","url":"https://www.breitbart.com/entertainment/2016/12/27/hollywood-mourns-carrie-fisher/"}
