{"authors":["Breitbart News"],"date_download":"2018-10-30 19:36:06","date_modify":"2018-10-30 19:36:06","date_publish":"2015-12-27 17:02:21","description":"\"Star Wars: The Force Awakens\" has reached $1 billion at the box office, reaching the milestone with record-setting hyper speed.","filename":"data/vaneerConsumption/StarWarsTheForceAwakensBecomesFastestFilmtoEarn1Billion.json","image_url":"https://media.breitbart.com/media/2015/12/2979968-star-wars-bb-8-force-awakens.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_27__1540928166.html","title":"'Star Wars: The Force Awakens' Becomes Fastest Film to Earn $1 Billion","title_page":"'Star Wars: The Force Awakens' Becomes Fastest Film to Earn $1 Billion | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES (AP) — “Star Wars: The Force Awakens” has reached $1 billion at the box office, reaching the milestone with record-setting hyper speed.\nThe Walt Disney Co. said “The Force Awakens” crossed the billion-dollar mark Sunday, accomplishing the feat in just 12 days. The previous movie to reach $1 billion the fastest was Universal’s “Jurassic World,” which did it in 13 days in June. “Jurassic World” also had the benefit of record grosses in China. “The Force Awakens” doesn’t open in the world’s second-largest movie market until Jan. 9.\nJ.J. Abrams’ installment of “Star Wars” also posted the biggest Christmas Day box office in history with $49.3 million and the best second-weekend earnings with $153.5 million.\n“The Force Awakens” has been setting records since its debut Dec. 17. It brought in a galactic $238 million in North America over its opening weekend, besting previous record-setter “Jurassic World,” and set international opening-weekend records in Australia, New Zealand and throughout Europe. It scored the biggest worldwide debut with $529 million.","url":"https://www.breitbart.com/entertainment/2015/12/27/star-wars-the-force-awakens-becomes-fastest-film-to-earn-1-billion/"}
