{"authors":["Associated Press"],"date_download":"2018-10-23 00:36:00","date_modify":"2018-10-23 00:36:00","date_publish":"2016-01-11 10:08:07","description":"BEVERLY HILLS, Calif. (AP) — Win or lose, Golden Globe guests get to party after the ceremony ends. There were a variety of post-show options scattered throu...","filename":"data/vaneerConsumption/StarsgetinapartymoodaftertheGoldenGlobe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:87f556a8320b4c81a4b18e4dd8f435ea-48qEJGFphM8d437f0aaf9234499d-731_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393618_Stars-party-mood-Golden-Globe_1540254960.html","title":"Stars get in a party mood after the Golden Globe","title_page":"Stars get in a party mood after the Golden Globe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stars get in a party mood after the Golden Globe\nBEVERLY HILLS, Calif. (AP) — Win or lose, Golden Globe guests get to party after the ceremony ends.\nThere were a variety of post-show options scattered throughout the Beverly Hilton, with studios, networks and others doing their best to impress the stars and industry bigwigs who had patiently endured Sunday's three-hour awards show.\nAs the hotel's ballroom emptied, the parties quickly became packed with people eager for food, drink and more schmoozing. With the Globes celebrating a varied cross-section of TV shows and movies, the guest lists were predictably unpredictable.\nxxx arrives at the HBO Golden Globes afterparty at the Beverly Hilton Hotel on Sunday, Jan. 10, 2016, in Beverly Hills, Calif. (Photo by Richard Shotwell/Invision/AP)\nHere are highlights from some of the bashes:\n___\nFOX'S HAPPY DANCE\nWith big wins for \"The Martian\" and \"The Revenant,\" the studio had plenty to celebrate, and its after-party was appropriately starry and festive.\nIt turned what is normally a parking lot into a glamorous greenhouse for the gathering, which also celebrated the studio's nominated shows: \"Empire\" and \"American Horror Story: Hotel.\"\nInside a massive clear tent, mounds of ferns hung above suspended chandeliers over a giant center bar; pockets of white sofas dotted the perimeter and filled the corners. Outside, a photo booth offered guests a chance to pose in an \"Empire\"-style setting. Inside, Terrence Howard and Gabourey Sidibe occupied the show's reserved section.\nAt a dark corner in back, \"Martian\" director-producer Ridley Scott collected accolades for the film's best picture (comedy) win, while star Matt Damon, toting his best actor (comedy) trophy, gregariously posed for photos with fans.\nMeanwhile, partygoers had their phones aimed at Lady Gaga, who cradled her Golden Globe for actress in a miniseries. She kissed \"Horror Story\" creator Ryan Murphy, then collapsed onto a couch with her fiancé, Taylor Kinney.\nNearby, \"Love & Mercy\" star Paul Dano chatted with Garrett Hedlund while \"Fargo\" actress Kirsten Dunst stole away for a smoke.\nLeonardo DiCaprio was a late arrival, but with good reason: After \"The Revenant\" won best picture (drama), DiCaprio and his best actor (drama) trophy joined best director winner Alejandro G. Inarritu for the press rounds. When DiCaprio finally made it to the party, he held court in the corner.\n____\nNBC UNIVERSAL\nNBC-Universal brought a Moroccan feel to its after-party with an exotic setting that evoked the North African nation. Architectural columns and arches inside the white structure made guests forget they were actually standing on the top level of the Beverly Hilton Hotel's parking garage.\nPalm trees anchored the room. Golden lanterns dangled from the ceiling. There was even a fountain and small pond.\nBut the menu was all about comfort food. There were cheeseburger sliders, mini chicken pot pies and a make-your-own sundae station. Eddie Redmayne chomped on French fries from a small plastic cup.\nAlicia Vikander, with beau Michael Fassbender, danced to an Ariana Grande song. Fassbender rushed over to fellow guest Kate Winslet, a winner for their recent film together, \"Steve Jobs.\" He pretended to bow to her, then kissed her on the cheek. Winslet's husband stood nearby, holding her Golden Globe.\nOther celebrating with the studio included Amy Adams, America Ferrera, Eva Longoria and \"Mr. Robot\" star Rami Malek.\n___\nHBO'S POOL PARTY\nHarrison Ford was the starring attraction at the cable channel's party, with excited guests clustering to watch him interviewed by Al Roker of NBC's \"Today.\"\nFord did get a chance to eat first, sharing a table with wife Calista Flockhart and David Oyelowo. He cleaned his plate after choosing from a buffet that included porcini gnocchi, glass noodle salad and steak.\nAmong those on the eclectic guest list who ended up in conversation: Bryan Cranston and Larry David; Kaley Cuoco and David Spade; Maggie Gyllenhaal and Andy Samberg. Other partygoers included Jon Hamm, Liev Schreiber and Patrick Stewart.\nRob Lowe made a quick pre-party stop, giving in to the entreaties of fans in the hotel lobby who begged him to pose for a group selfie. He did in grand style, mugging for them patiently until they got the right shot.\nAt the party, one Ford fan wasn't so lucky: The star declined to pose for a photo, leaving the man to smile and shrug it off.\nHBO took over the hotel's pool area for its bash, covering nearly all of the plunge to use it as an extended dining room complete with graphics projected on the hotel's exterior wall, plush couches and tables. The El Nino rains remained at bay but, even with heat lamps scattered around, most guests chose to avoid the winter chill — that's about 50 degrees for Southern California — and stayed inside, braving a packed room instead.","url":"https://www.dailymail.co.uk/wires/ap/article-3393618/Stars-party-mood-Golden-Globe.html"}
