{"authors":[],"date_download":"2018-10-22 22:02:39","date_modify":"2018-10-22 22:02:39","date_publish":"2014-05-07 17:30:24","description":"An Israeli startup's new ad features the \"fake\" sign-language interpreter from Nelson Mandela's memorial service.","filename":"data/vaneerConsumption/StartupHiresFakeMandelaSignLanguageInterpreterForBizarreAd.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/426896/140507-interpreter-thamsanqa-jantjie-1404_d6e28f3383ccc22a3b28055ed3d2a194.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_mobile_startup-hires-fake-mandela-sign-language-interpreter-bizarre-ad-n99486_1540245759.html","title":"Startup Hires 'Fake' Mandela Sign Language Interpreter For Bizarre Ad","title_page":"Startup Hires 'Fake' Mandela Sign Language Interpreter For Bizarre Ad","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn Israeli startup's new ad features the \"fake\" sign-language interpreter from Nelson Mandela's memorial service -- and the company says they pulled him out of a psychiatric hospital to film it.\nThe commercial featuring Thamsanqa Jantjie is a stunt from Tel Aviv-based Livelens, which recently raised $2 million for its social livestreaming app.\nJantjie's meaningless gestures at Mandela's memorial provoked anger from the deaf community, and Jantjie later blamed the incident on schizophrenia.\nDespite the high potential for blowback from both mental-health and deaf advocates, Livelens insisted in an interview to NBC News that the company stands behind its choice.\n\"We decided that the guy who had the worst live show ever would be the best person,\" Livelens CEO Max Bluvband told NBCNews.\nSefi Shaked, the company's marketing manager, came up with the idea to approach Jantjie after seeing a \"Saturday Night Live\" parody. But they soon found out Jantjie had been in a South African psychiatric hospital since December.\nUndaunted, Livelens said they worked with an Israeli production company to get a Zulu-speaking journalist to visit the hospital in February -- and tell staffers that Jantjie needed to be released for one day for a \"family event.\"\nThe stunt worked, according to Shaked, and Livelens shot the ad in a few hours. The company wasn't concerned that Jantjie's status as a psychiatric patient could make him unable to do the job, Shaked said.\n\"We saw him with our own eyes; he's a normal guy,\" Shaked added. \"Now he can have the closure and earn some money from it. It’s morally right.\"\nLivelens wouldn't say how much the company paid Jantjie.\nAt least one advocacy group disagrees with Shaked's characterization of the commercial as a moral choice.\nIn an email to NBC News, the National Association of the Deaf expressed \"outrage and disappointment that any company would think it appropriate to hire and portray any individual who has become synonymous with mockery of sign language interpreting.\" The association called for a boycott of Livelens.\nShaked said he isn't worried about controversy, however.\n\"We helped him get on the right track,\" Shaked said. \"At the end of the day, a schizophrenic guy got paid and did a nice campaign ... We see it as sort of a sad story with a happy ending.\"\nLivelens is happy with the campaign so far, Shaked said, adding that the company has \"a lot more exciting plans\" coming.\n\"Richard Branson once said a good campaign is loved by 50 percent of people and hated by 50 percent,\" Shaked said. \"A good campaign creates awareness and maybe an argument. We did that here.\"","url":"https://www.nbcnews.com/tech/mobile/startup-hires-fake-mandela-sign-language-interpreter-bizarre-ad-n99486"}
