{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:10:52","date_modify":"2018-10-30 23:10:52","date_publish":"2016-12-08 00:00:00","description":null,"filename":"data/vaneerConsumption/Starbucksfiveyearplanleansheavilyondigital.json","image_url":"https://amp.businessinsider.com/images/5849606ae02ba7c45e8b70bf-480-240.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_starbucks-five-year-plan-leans-heavily-on-digital-2016-12_1540941052.html","title":"Starbucks' five-year plan leans heavily on digital","title_page":"    Starbucks' five-year plan leans heavily on digital - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nStarbucks announced resounding digital success at its 2016 Investor Day, held Wednesday.\nStarbucks Rewards, the firm's rewards and loyalty program, now counts 12 million active members, up 18% on a year-over-year (YoY) basis. Among those, 8 million pay via mobile, and 33%, or roughly 4 million, use Mobile Order & Pay, the firm's mobile ahead offering.\nAnd they do so regularly — in Q3 2016, over one in four US Starbucks transactions came from its mobile app. The firm's engaged digital audience could be the catalyst to its robust five-year sales and revenue targets, which is pushing it to find new ways to further capitalize on this engaged user base.\nStarbucks has two new digital launches on the horizon.\nConversational ordering: Starbucks is planning to launch an artificial intelligence-based chatbot next year. The platform, called My Starbucks Barista, will allow users to order via voice or messaging. Starbucks believes it could help further lift digital ordering by making the process even more seamless and convenient for users. Chatbots are becoming more popular, and if Starbucks can successfully onboard users to the offering, it could make it easier for users to pay in a variety of contexts, which could grow engagement.\nIncreased personalization: Next year, the firm also plans to complete the rollout of personalized offerings, like suggested order additions or pairings, to mobile order-ahead customers. Encouraging add-ons often grows average order value (AOV) — for example, Taco Bell sees 30% higher AOVs on app-based orders. And higher spend is rewarded by Starbucks Rewards, which is a dollar-based program, which could encourage users to make more expensive orders on a regular basis. Personalization could thus help Starbucks leverage its most engaged customer base to meet its five-year targets.","url":"https://www.businessinsider.com/starbucks-five-year-plan-leans-heavily-on-digital-2016-12"}
