{"authors":[],"date_download":"2018-10-23 00:41:55","date_modify":"2018-10-23 00:41:55","date_publish":"2017-03-10 07:38:10","description":"Australia's hopes of victory in their bitterly-fought series against India suffered a severe blow Friday when pace spearhead Mitchell Starc had to head home...","filename":"data/vaneerConsumption/StarcoutofIndiaserieswithfootfracture.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194833-1489134493-37_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300290_Injured-Starc-ruled-India-series_1540255315.html","title":"Starc out of India series with foot fracture","title_page":"Starc out of India series with foot fracture | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A stress fracture to his right foot rules Mitchell Starc out of the Australia side touring India\nAustralia's hopes of victory in their bitterly-fought series against India suffered a severe blow Friday when pace spearhead Mitchell Starc had to head home with a stress fracture to his right foot.\nTeam physio David Beakley said Starc felt pain in his right foot during Australia's 75-run defeat in the the second Test in Bangalore which has failed to subside since the match ended on Tuesday.\n\"We made the decision to scan his foot in Bangalore this morning and unfortunately it has revealed a stress fracture,\" Beakley said in a Cricket Australia statement.\nStarc, who is also one of the world's leading all-rounders, would \"return home to Australia to start his rehabilitation\" and therefore \"be unavailable for the remainder\" of the four-match series, Beakley added.\nSelectors would name a replacement \"in due course\", the statement said.\nThe 27-year-old Starc is the second Australian to be ruled out of the series between the world's top two sides after Mitchell Marsh had to return home following a deterioration of a long-running shoulder injury.\nStarc has been hampered by injuries during his career but he has emerged as a key player for his side in all formats of the game and is ranked in the world's top 10 in both Test and ODI cricket.\nHe was also named recently in the International Cricket Council's Test team of the year (ICC).\nAlthough Starc has only taken five wickets in the first two Tests, his lower-order half-century in the first game in Pune proved to be a turning point in the match, which Australia won.\nAhead of the series, Indian captain Virat Kohli singled out Starc as the tourists' dangerman, saying he \"is a world-class bowler\".\n\"He has learnt the art of reverse swing and bowling with the old ball as well. It's amazing to see, the way he has developed his skills,\" Kohli added.\nThe four-Test series, which resumes next week in Ranchi, has been marred by a row between Kohli and his opposite number Steve Smith which led the ICC to call a clear-the-air meeting between the pair.\nStarc has suffered a number of injury setbacks during his career, including in September when he suffered a leg wound which required 30 stitches by colliding with training equipment during a practice session.\nHe also also spent six months on the sidelines after fracturing his foot in the historic day-night Test in Adelaide against New Zealand in November 2015, before then undergoing ankle surgery.\nHe returned to play a starring role on Australia's tour of Sri Lanka, where he took 24 wickets at an average of 15.16.","url":"https://www.dailymail.co.uk/wires/afp/article-4300290/Injured-Starc-ruled-India-series.html"}
