{"authors":["Anucyia Victor For Mailonline"],"date_download":"2018-10-23 02:54:59","date_modify":"2018-10-23 02:54:59","date_publish":"2016-01-11 15:23:59","description":"The coffee chain’s decision to include the plant-based milk alternative has been met with derision from those on Twitter, who have been flooding social media with their negative feedback.","filename":"data/vaneerConsumption/StarbucksintroducescoconutmilktoitslattesintheUKbutTwitterhatesthegarbagedrink.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B6D5E00000578-0-image-a-18_1452525753528.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-3393793_Starbucks-introduces-coconut-milk-lattes-UK-Twitter-hates-garbage-drink_1540263299.html","title":"Starbucks introduces coconut milk to its lattes in the UK - but Twitter hates the 'garbage' drink","title_page":"Starbucks introduces coconut milk to its lattes in the UK - but Twitter hates the 'garbage' drink | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After a successful trial run in the US, Starbucks has introduced introduction of coconut milk lattes to its UK menus.\nBut the coffee chain's decision to include the plant-based milk alternative has been met with derision from those on Twitter, who have been flooding social media with their negative feedback.\nMany said the drink was 'garbage' and 'not nice', and claimed to instantly regret purchasing it.\nAfter a successful trial run in the US, Starbucks has introduced introduction of coconut milk lattes to the UK\nPrad Patel tweeted: 'Work colleague orders a Starbucks Coconut Milk Latte out of intrigue. He now knows what regret tastes like.'\nEchoing the regret was Rosie, who wrote: 'Ordered a Starbucks coconut milk latte. Filled with regret from the first sip. Just in case you were thinking of ordering one.'\nAnother customer, Bill Dann, agreed, posting:' Just had a coconut milk latte in Starbucks to see what it tasted like - absolutely disgusting, threw most of it away.\nSome Twitterati took it upon themselves to warn others. Akesha Reid wrote: 'GUYS. The coconut milk latte from Starbucks is NOT NICE' and accompanied her message with 'disgusted' emoticons.\nCooper Vuna was also unhappy with his drink, writing: 'Just tried a coconut milk latte at Starbucks. Disappointing,'\nOne woman was so unhappy with the drink that she claimed the chain's coconut milk was 'garbage' and posted a picture of the ingredients used to make the drink.\nTwitter user Socal Mom slammed Starbucks for the drink, calling it 'garbage' rather than coconut milk\nBut despite the negative feedback, there were a few who were full of praise for the drink.\nAlly wrote: 'I am so excited about the coconut milk latte at Starbucks.'\nJo Yo claimed to be so happy with the new offering that they were unsure as to how to react, writing: 'Starbucks has coconut milk now and idk [I don't know] what to do with my life.'\nWilliam Paris said he tried a mocha dink with coconut milk. He posted: 'Had one last week at a mocha. Tastes like a little bit of paradise.'\nStarbucks started testing coconut milk in stores in US last year as an alternative to dairy products.\nThe coffee chain is not testing almond milk, a popular non-dairy option, at this time due to the 'critically important safety of our customers with nut allergies,' a spokesperson said.\nThey continued: 'We're pleased to offer our customers another non-dairy milk alternative and we've received some very positive feedback on our Coconut Milk Latte.","url":"https://www.dailymail.co.uk/femail/food/article-3393793/Starbucks-introduces-coconut-milk-lattes-UK-Twitter-hates-garbage-drink.html"}
