{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:31:26","date_modify":"2018-10-30 22:31:26","date_publish":"2014-08-15 14:11:27","description":"When you think of Starbucks, do you think of awesome cold-brewed iced coffee? I don’t — generally I think, “overpriced, overly caloric paper cups of seasonal joy” — but it seems that sometime in the near future, that might change. Word on the street…","filename":"data/vaneerConsumption/StarbucksIsTestingOutColdBrewIcedCoffeeAndThisNewDrinkCouldChangeEverything.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/6/25/314b1ca5-435d-42f2-ac1d-63b346b2a092-getty-456344398.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35909-starbucks-is-testing-out-cold-brew-iced-coffee-and-this-new-drink-could-change-everything_1540938686.html","title":"Starbucks Is Testing Out Cold Brew Iced Coffee, And This New Drink Could Change Everything","title_page":"Starbucks Is Testing Out Cold Brew Iced Coffee, And This New Drink Could Change Everything","title_rss":"NULL","source_domain":"bustle.com","text":"When you think of Starbucks, do you think of awesome cold-brewed iced coffee? I don’t — generally I think, “overpriced, overly caloric paper cups of seasonal joy” — but it seems that sometime in the near future, that might change. Word on the street has it that Starbucks is testing out cold brew iced coffee, although I wouldn’t get too excited about it just yet.\nHere’s the deal: According to unofficial ‘Bux news blog Starbucks Melody, Starbucks is currently running a small, fairly under-the-radar test for cold-brewed ice coffee in one tiny district in the Boston area. It’s apparently using the brand’s Ethiopia blend, a medium roast with hints of citrus and dark cocoa. Brewed in a Toddy system, it’s only being made in small batches, with signs going up in the stores featuring it when it’s out for the day. The tipster who wrote into the blog said that advanced word is good; customers apparently love it. As well they should, because cold brew is awesome.\nStarbucks Melody also points out, though, that the chain tests many more items than they’ll actually launch. As such, you might not want to get your hopes up for nationwide Starbucks cold brew. I also suspect that a cold brew iced coffee from Starbucks would be, shall we say, a wee bit pricey. We already know that the cost of an iced coffee these days is only going one place — up — and part of the reason for the rise in price is cold brewing itself. Not only is the equipment to do it a bit of an investment, but it can be difficult to estimate how much of it you’ll need to make at any given time. Since cold brewing takes a full 24 hours, you can’t just brew up a batch when you want it.\nSorry, Veruca. No dice.\nMy advice? Either get your cold brew from a locally owned shop — or make your own. It’s always, without fail, more cost-effective to brew your java at home, no matter which coffee shop you’re comparing it with. But hey, while we're on the subject, go ahead and pour yourself another cup. It's good for you!\nImages: Getty Images; Giphy","url":"https://www.bustle.com/articles/35909-starbucks-is-testing-out-cold-brew-iced-coffee-and-this-new-drink-could-change-everything"}
