{"authors":[],"date_download":"2018-10-30 21:52:54","date_modify":"2018-10-30 21:52:54","date_publish":"2016-12-19 18:22:00","description":"The fate of Lucky, a half-starved dog found Saturday locked in a crate at an empty Smyrna house, has...","filename":"data/vaneerConsumption/StarvingSmyrnadogpromptssocialmediauproar.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/19/Images/newsEngin.17185898_Lucky-dog-3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_starving-smyrna-dog-prompts-social-media-uproar__1540936374.html","title":"Starving Smyrna dog prompts social media uproar","title_page":"Starving Smyrna dog prompts social media uproar","title_rss":"NULL","source_domain":"ajc.com","text":"The fate of Lucky, a half-starved dog found Saturday locked in a crate at an empty Smyrna house, has prompted a firestorm on social media and an outpouring of support for his rehabilitation.\nAt last count Lucky’s story has been shared 67,000 times on Facebook and his well-wishers have raised thousands of dollars to help cover doctor bills. Also recovered was a blind American bulldog mix named Simpson.\nLocal pet rescue advocate Justine Stinnett wrote on her Facebook page that a woman who was fostering the two dogs “moved away and left him to die without contacting me to let me know. After missing his vet appointment I grew very concerned and suspicious. Nothing she said added up. When I was finally able to get him back I was in shock. After only a few weeks in her care he was almost dead. Skin and bones.”\nStinnett posted a heart-wrenching video of her discovery, in which she bursts into tears as she finds the skeletal dog. Stinnett started a fund-raising page to cover the cost of veterinary care for Lucky and Simpson. Pledges exceeded $15,000 on Tuesday.\nThe more than 3,000 comments online have ranged from compassionate to vengeful. “I am praying for Lucky’s life… and for JUSTICE and KARMA to strike down this evil sick woman,” wrote one. “She needs to rot in hell,” posted another.\n“You took a young, healthy, beautiful dog, and you broke him,” wrote Stinnett.\nDetective Steve Hammond, an animal cruelty investigator with Cobb County, said both dogs are in the care of veterinarians and that Cobb is conducting an investigation into the incident. “We’re interviewing the parties involved,” he said, adding that no charges have been filed.\nEfforts Monday to reach Stinnett and the woman who fostered Lucky — who Stinnett writes may have moved to Tennessee — were unsuccessful.","url":"https://www.ajc.com/news/starving-smyrna-dog-prompts-social-media-uproar/0e23nXiciHudjEG4afedIK/"}
prompts-social-media-uproar/0e23nXiciHudjEG4afedIK/?icmp=AJC_internallink_122016_digesttease_1220"}
