{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 22:09:02","date_modify":"2018-10-22 22:09:02","date_publish":"2016-01-11 02:40:41","description":"Most people at the age of 73 look forward to spending their Sunday evenings relaxing at home with their feet up.","filename":"data/vaneerConsumption/StarWars7sHarrisonFordattheGoldenGlobes2016withwifeCalistaFlockhart.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/300542BE00000578-0-image-a-11_1452497840771.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393266_Star-Wars-legend-Harrison-Ford-73-grins-glee-shows-younger-wife-Calista-Flockhart-Golden-Globes_1540246142.html","title":"Star Wars 7's Harrison Ford at the Golden Globes 2016 with wife Calista Flockhart","title_page":"Star Wars 7's Harrison Ford at the Golden Globes 2016 with wife Calista Flockhart | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most people at the age of 73 look forward to spending their Sunday evenings relaxing at home with their feet up.\nSo no wonder Harrison Ford was grinning with glee as he showed off his much younger wife Calista Flockhart at the Golden Globes on Sunday.\nThe handsome actor was grinning like a Cheshire cat as he graced the red carpet with the Ally McBeal favourite.\nScroll down for video\nNot going Solo: Star Wars legend Harrison Ford showed off his much younger wife Calista Flockhart at the Golden Globes on Sunday\nThe Star Wars legend looked as cool as they come in a classic tuxedo, bow tie and wonderfully shiny leather shoes.\nBut it was the father-of-five's 51-year-old's other half who was really turning heads in a snazzy dark turquoise dress, which boasted ornate embroidery at the bust.\nCalista looked delighted to be back at the venue where their love affair began away back in 2002, when she was still a star in her own right as the leading lady of smash hit show Ally McBeal.\nSee the latest updates on Star Wars: The Force Awakens star Harrison Ford\nNo wonder he's smiling: Harrison will be the envy of his peers after marrying a woman 22 years his junior\nFord focus: He showed laser beam-like awareness of the cameras as he posed up on the red carpet\nA Force to be reckoned with: Harrison is still going strong in both his professional and personal lives\nAlly McStealing his heart: Calista and Harrison first hooked up at the awards show in 2002 and got married just over eight years later\nShe is now featuring as Cat Grant in the new CBS superhero show Supergirl, who in the show is the shallow and superficial founder of the CatCo Worldwide Media.\nWhile her career is ticking over nicely, Harrison's has just blasted into hyperspace after he reprised his career launching role of Han Solo in what could be the biggest box office hit of all time, Star Wars: The Force Awakens.\nAlly McStealing the show: His other half left her husband in the shade after donning this elegant dress\nThe Fugitive makes his getaway: Eventually the actor tired of posing up and headed indoors to find his seat\nCome here young lady: Harrison was looking full of beans at the HBO party after the event\nThe Disney film, which premiered in China on Saturday, brought in an estimated $53 million in China this weekend according to studio.\nIn North America it raked in another $41.6 million this weekend, and has topped the charts for the fourth weekend in a row.\nIt has now made an estimated $812 million in the US, and is the only picture in history to make more than $800 million domestically.\nFord fiesta: The pair looked like they were having a great time together at the posh Beverly Hilton Hotel\nJust like old times: The pair looked like they were reliving their first romantic meeting in 2002\nHis Last Crusade: It is unlikely the Indiana Jones star and his wife would have been partying all night\nA Star is born: His turn as Han Solo in A New Hope saw him become a leading man overnight\nEnd of an era? Harrison finally reprised his role for what may be the final time in The Force Awakens\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393266/Star-Wars-legend-Harrison-Ford-73-grins-glee-shows-younger-wife-Calista-Flockhart-Golden-Globes.html"}
