{"authors":["Katie French For Mailonline"],"date_download":"2018-10-23 00:28:46","date_modify":"2018-10-23 00:28:46","date_publish":"2017-03-16 09:50:56","description":"This tiny London coffee hut (pictured) received a letter from Starbucks' legal team demanding it changed its name. Nasser Kamali, 52, next to Swiss Cottage tube station, was forced to change his signs.","filename":"data/vaneerConsumption/StarbucksforcesStarBoxCoffeetochangeitsname.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E543B7100000578-0-image-a-16_1489669083599.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319260_Starbucks-forces-Star-Box-Coffee-change-name_1540254526.html","title":"Starbucks forces Star Box Coffee to change its name","title_page":"Starbucks forces Star Box Coffee to change its name | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In a David and Goliath-style battle, one of the biggest corporations on the planet is taking on a tiny coffee stand - and its owner - by demanding it changes its name.\nStarbucks claims the London-based Star Box Coffee could 'weaken' its global brand by having a similar name.\nLawyers hand-delivered a letter to owner Nasser Kamali, warning that the trading name of Star Box Coffee was 'technically an infringement of trademark rights', despite running for five years without complaint.\nThe boss of the one-man kiosk was stunned when he received the demand from the American heavyweights who has 25,000 retails locations across the globe.\n'I'm not taking their money and I'm not scared of them': The owner of popular Star Box Coffee, pictured above, has been forced to paint over the word 'star' after receiving a letter from Starbucks' legal team\nUnder pressure, Mr Kamali removed the word 'star' from his menus, posters and stickers and changed his main sign at the kiosk next to Swiss Cottage underground station.\nBut the 52 year old is refusing on principle to accept a £300 'goodwill payment' from Starbucks - who made a record-breaking profit last year.\nThe world's biggest coffee retailer took home almost £3.4 billion pounds, up 16 per cent from the previous year.\nBy comparison Star Box Coffee's accounts are not publicisied but expected to be much more humble, manned by just one full-time member of staff.\nMr Kamali told the Camden New Journal: 'I may be small, but inside I am big. I'm not taking their money and I'm not scared of them.\n'But I could not beat Starbucks in court. Be realistic. They have all the lawyers - and the government - so I just made the changes.'\nThe legal letter from lawyers acting for Starbucks Corporation was hand-delivered to the hut last month.\nIt said that as the world's biggest coffee company it was 'critical' Starbucks protected its name and clamped down on 'unauthorised use to avoid the strength of its brand being weakened'.\nIt added: 'Starbucks requests that you adopt a different trading name (not commencing STAR) and change the signage used at your premises, along with the stickers currently applied to coffee cups.'\nThe legal letter, from solicitors Burges Salmon, boasted that Starbucks is the 'leading retailer, roaster and brand of specialty coffee in the world, with almost 25,000 retail locations'.\nIt is not the first time the company has cracked down on companies with similar names.\nIn New York, a coffee company, Charbucks, successfully challenged Starbucks in court in a similar row, according to reports.\nMr Kamali fled Iran in the early 1990s after being imprisoned for two years for his political beliefs.\nHe told the Camden New Journal that he ran a shop in Fortune Green before his trade was 'smashed' by the opening of a new Tesco.\nGlobal giants: Starbucks Cooperation, who took on tiny coffee kiosk Star Box Coffee, recorded record-breaking profits in 2016, cashing in £3.4 billion pounds\nHe then started running the new business in Swiss Cottage.\nMr Kamali said: 'I also do believe that money means nothing in this world. I don't buy from these big companies like Starbucks and Tesco. With this letter, you see the power of capitalism.'\nHe added: 'I always pay my rates and rents. It is very difficult. Do they?'\nMr Kamali keeps a Karl Marx mug and red star on the shelf of his hut.\nExplaining the name choice, he said: 'I do believe in Marxism and that is very important to me. That is why I had the red star logo on my stickers. I am in a box. It's my red, star box.'\nHe has visited 32 countries around the world on his own socialist pilgrimage to find out more about alternatives to capitalism.\n'I visited east European cities and they say they had free education, always work and a house. A lot of good things,' he added.\nA big supporter of Jeremy Corbyn, he could not bring himself to join Labour, however, as it was 'not a revolutionary party'.\nA Starbucks spokesman told the Camden New Journal: 'Trademark law is there to protect brand identity. In this instance it was too close to our brand and could lead to such confusion.'","url":"https://www.dailymail.co.uk/news/article-4319260/Starbucks-forces-Star-Box-Coffee-change-name.html"}
