{"authors":[],"date_download":"2018-10-22 22:16:57","date_modify":"2018-10-22 22:16:57","date_publish":"2014-06-09 15:14:12","description":"Master Chief, Mario and other video game stars will make an appearance at E3 2014 in Los Angeles.","filename":"data/vaneerConsumption/StarWarsHaloandMore5ReasonstoBeExcitedAboutE3.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/496721/smashbros_8e00fa6651976aebada18f847223c491.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_video-games_star-wars-halo-more-5-reasons-be-excited-about-e3-n126276_1540246617.html","title":"Star Wars, Halo and More: 5 Reasons to Be Excited About E3","title_page":"Star Wars, Halo and More: 5 Reasons to Be Excited About E3","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt's the most wonderful time of the year, for gamers at least. This week is the Electronic Entertainment Expo (E3), when companies unveil their latest games and people who never go outdoors are forced into the Los Angeles sunshine.\nThere are no big hardware reveals this year, seeing as the Xbox One and PlayStation 4 are already on sale. Still, there are plenty of big-name titles on the horizon, including a few highly anticipated sequels.\nHalo 5: Guardians\nRight now, the world knows very little about \"Halo 5: Guardians,\" except that it will be released around the same time as the Halo TV series on Showtime in the fall of 2015. On Monday, 343 Industries, the studio behind the game, revealed that a multiplayer beta would be released in December.\nLast month, Bonnie Ross, general manager of 343 Industries, promised that this was not just another sequel, writing in Xbox Wire that they were “retooling our tech to take full advantage of the Xbox One’s hardware and ecosystem to create worlds and experiences worthy of next-gen.” At the very least, we know that means a game that will run at a smooth 60 frames per second.\nAside from Master Chief, the return of another video game favorite was announced at Microsoft's press conference on Monday: Lara Croft. She comes back in \"Rise of the Tomb Raider,\" which will be released during the 2015 holiday season.\nSuper Smash Bros. for Wii U\nNintendo’s Wii U has not exactly been flying off the shelves since the Xbox One and PlayStation 4 came on the scene. Two new versions of beloved classics could turn things around. One is \"Mario Kart 8,\" which was released on Friday.\nThe other big release will be \"Super Smash Bros. for Wii U.\" Nintendo is holding a tournament at E3, pitting 16 of the world’s top Smash Bros. players against each other in a live-streamed Wii U battle. (We can only hope that Fred Savage wins with the help of the Power Glove.) On the same day, 100 Best Buy locations across the country will give ordinary gamers a chance to play a demo of the game, which does not hit stores until winter.\nDestiny\nSo, what has Bungie been up to since Microsoft’s 343 Industries took over Halo? A first-person shooter called \"Destiny.\" The twist is that the multiplayer mode is big … really big, kind of like \"World of Warcraft,\" with gamers able to upgrade their characters and join in huge, coordinated missions with other players.\nBungie will release more details at E3 on Tuesday. The game goes on sale for the Xbox 360, Xbox One, PlayStation 3 and PlayStation 4 on Sept. 9.\nFacebook-Backed Oculus Rift\nBack in 2012, when the Oculus Rift made its first appearance at E3, nobody knew what to expect. Now, at the first E3 since Facebook bought Oculus VR for $2 billion, expectations will be a little higher. Yes, models of the Star Trek: Enterprise bridge are fun, but a slick, new game would be a lot more impressive. Still, Oculus VR has some time, seeing as no commercial launch date has been announced yet.\nStar Wars: Battlefront\nWith buzz over the new Star Wars movies from J.J. Abrams building, fans will get something new to geek out over: a Star Wars-themed first-person shooter from Electronic Arts. A very short teaser trailer was unveiled at E3 in 2013, but this year, expect to learn more about it than \"things blow up on the ice planet Hoth.\"\nThis is the first \"Star Wars: Battlefront\" game since the original and its sequel were released in 2004 and 2005, respectively. The game could come out for the Xbox One and PlayStation 4 as early as the summer of 2015.","url":"https://www.nbcnews.com/tech/video-games/star-wars-halo-more-5-reasons-be-excited-about-e3-n126276"}
