{"authors":["Alicia Lu"],"date_download":"2018-10-30 22:35:59","date_modify":"2018-10-30 22:35:59","date_publish":"2014-08-15 00:00:02","description":"Starbucks prides itself on being a socially responsible corporation that look out for its employees. In fact, the coffee giant refers to its workers as partners, and the CEO has emphasized the company's \"employees first\" philosophy that puts workers…","filename":"data/vaneerConsumption/StarbucksTakesTheNewYorkTimesHintOverhaulsItsShiftSchedulingSystem.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a4747bb5-8288-4015-955e-8ad904b696f5.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35840-starbucks-takes-the-new-york-times-hint-overhauls-its-shift-scheduling-system_1540938959.html","title":"Starbucks Takes 'The New York Times'' Hint, Overhauls Its Shift-Scheduling System","title_page":"Starbucks Takes 'The New York Times'' Hint, Overhauls Its Shift-Scheduling System","title_rss":"NULL","source_domain":"bustle.com","text":"Starbucks prides itself on being a socially responsible corporation that look out for its employees. In fact, the coffee giant refers to its workers as partners, and the CEO has emphasized the company's \"employees first\" philosophy that puts workers even ahead of consumers, offering its employees exceptional benefits that include free tuition and free company stock. Sounds like a perfect place to work, right? Not so fast. The chain has been using a rather arcane software for determining shifts, but after years of worker complaints, Starbucks took The New York Times' hint and is now revising its automated scheduling system to allow for more human input.\nStarbucks has been using an automated software to designate shifts to its workers, perhaps because with 151,000 full-time employees worldwide, it can be pretty difficult to keep track of everyone's hours and time off requests manually. But after a recent New York Times article detailed the struggles of a single mother and Starbucks barista who had to juggle life and school with her erratic shifts, the coffee chain announced on Thursday that it would overhaul its computerized scheduling system.\n\"We must do all we can to deliver the best for our partners because they deserve our very best,\" Cliff Burrows, the group president in charge of U.S. stores, wrote in an email to 130,000 workers.\nThis isn't the first time Starbucks has restructured its scheduling policy. In 2008, the company implemented a change that had fewer employees working longer hours at its stores. According to the company, the move was an effort to create a more familiar environment for customers.\nIn addition, the change addressed workers' complaints that they had trouble securing enough hours each week by creating a full-time description for non-management employees for the first time, which aimed to give them at least 32 hours a week.\nNow it appears that revision only scratched the surface. The new revision will address many more scheduling issues that employees have long complained about.\nMelanie Conner/Getty Images News/Getty Images\nNo more \"clopening\": As the name suggests, clopening is when an employee closes a store and then has to return the next morning to open again. Some locations, like the Grand Central store in NYC, open as early as 5 a.m. and close as late as midnight, so you can imagine how much workers must have hated clopening.\nSchedules must be posted at least a week in advance, so you can make doctor's appointments accordingly and plan your life in general.\nEmployees who live more than an hour away from their current station will be relocated to a closer store if possible.\nImage: Getty","url":"https://www.bustle.com/articles/35840-starbucks-takes-the-new-york-times-hint-overhauls-its-shift-scheduling-system"}
