{"authors":["Frances Martel"],"date_download":"2018-10-30 20:40:55","date_modify":"2018-10-30 20:40:55","date_publish":"2015-05-22 13:58:17","description":"The US State Dept. warns China to stop building 'sandcastles' in the South China Sea, and China tells the U.S. to stay out of Asian affairs.","filename":"data/vaneerConsumption/StateDepartmentWarnsChinaStopBuildingSandcastlesinSouthChinaSea.json","image_url":"https://media.breitbart.com/media/2015/05/Antony-Bilken-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_22__1540932055.html","title":"State Department Warns China: Stop Building 'Sandcastles' in South China Sea","title_page":"State Department Warns China: Stop Building 'Sandcastles' in South China Sea | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tensions are rising in the South China Sea as American officials have become increasingly vocal regarding their opposition to China’s development of islands over which Vietnam and the Philippines contend China has no sovereignty. In a scathing opinion piece in state media Friday, China has responded by telling American officials to stay out of Asian affairs.\n“As China seeks to make sovereign land out of sandcastles and redraw maritime boundaries, it is eroding regional trust and undermining investor confidence,” said U.S. Deputy Secretary of State Antony Blinken on Wednesday while on a diplomatic trip to Jakarta, Indonesia. The “sandcastles” in dispute are artificial islands being developed on the Johnson Sound Reef near the Spratly Islands. Most recently, Vietnamese media, which claims the Spratly Islands as Vietnamese sovereign territory, claimed to have evidence that China was erecting “multi-story structures” on artificial islands in the reef. Vietnamese newspapers published alleged photos of the construction along with their reports.\nWhile American officials have previously warned China to respect the sovereignty of its neighbors and called reports of such constructions “concerning,” Blinken’s language this week has heightened the position of the United States from concern to stern reprimand. “Its behavior threatens to set a new precedent, whereby larger countries are free to intimidate smaller ones, and that provokes tensions, instability and can even lead to conflict,” Blinken added.\nIn addition to Blinken’s comments, reports in both Reuters and CNN last week indicate that the United States is considering concrete modes of intervention to protect the sovereignty of Vietnam, the Philippines, and other neighboring countries. One American official told Reuters that the U.S. was specifically considering “how to demonstrate freedom of navigation in an area that is critical to world trade.”\nAs Al Jazeera notes, the Spratly Islands are sparsely populated but “believed to be rich in oil and gas.” China’s claim to them parallel tensions in the East China Sea over the Senkaku Islands, which Japan insists are part of its sovereign territory, but China claims belong to them. While the tensions in the South China Sea have accelerated much more quickly than the dispute with Japan, China’s imposition of an Air Defense Identification Zone (ADIZ) over the Senkaku Islands in November 2013 was the first such act of dominance in the region that indicated the government of President Xi Jinping would aggressively contest sovereignty claims on the high seas.\nIn response to Blinken’s “sandcastles” comment on Wednesday, the Chinese Foreign Ministry argued that it was the United States, and not China, that was exacerbating tensions in the region. “Comments of this sort are not good for the solving of tensions and are not beneficial for the mutual trust between countries as well as maintaining the peace and the stability of the South China Sea region,” said spokesman Hong Lei.\nChinese media have taken an even more belligerent stance against the United States’ statements on the region. On the front page of state media outlet Xinhua Friday, an opinion piece blasts American officials as “back[seat] drivers” in an affair that does not concern them. “Recent statements made by some U.S. military officials are contrary to regional peace and stability, and it is Uncle Sam who should explain its irresponsible behavior over the South China Sea,” the column begins, adding, “The South China Sea disputes, to which the United States is not a party, are between China and other claimants and should be handled by those directly involved in a peaceful way.” It also claims that tensions in the region were not triggered by illegal construction on the part of the Chinese government, but President Obama’s “Pivot to Asia strategy.”\n“Washington’s botheration over the so-called maritime safety is groundless and ill-motivated,” the column concludes.\nThe dispute between China and the United States over construction on the islands left the realm of words this week as the Chinese navy intercepted a U.S. surveillance plane over the Spratly Islands. “Foreign military aircraft. This is Chinese navy. You are approaching our military alert zone. Leave immediately,” the Chinese military told the crew of a P-8A Poseidon plane as it entered the disputed territory. CNN, whose journalists were onboard the American plane, has published video of the incident. The video is the first of its kind regarding the Spratly dispute to be declassified by the Pentagon, CNN reports.\nReports that China had constructed a plane runway and entire factories on the Johnson Reef area begun to circulate as early as September 2014. Following complaints from neighboring countries that the Chinese government has no legal permission to build constructions on these islands, China accused the government of the Philippines of violating its sovereignty by “constructing military and civilian facilities on certain disputed islands.”","url":"https://www.breitbart.com/national-security/2015/05/22/state-dept-warns-china-to-stop-building-sandcastles-in-south-china-sea-as-u-s-plane-intercepted/"}
