{"authors":[],"date_download":"2018-10-30 21:47:41","date_modify":"2018-10-30 21:47:41","date_publish":"2017-04-12 00:00:00","description":null,"filename":"data/vaneerConsumption/Statesetsdeathsof7menover11days.json","image_url":"http://media.arkansasonline.com/img/photos/2017/04/12/Screen_Shot_2017-04-12_at_1.53.31_PM.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/__1540936061.html","title":"State sets deaths of 7 men over 11 days","title_page":"Arkansas Executions: State sets deaths of 7 men over 11 days","title_rss":"NULL","source_domain":"arkansasonline.com","text":"_______\nMARY ELIZABETH PHILLIPS\nMary Elizabeth Phillips, 35, of Bradford worked at a Bald Knob tax service office and married her high school sweetheart, James Phillips.\nTogether, they had three children and had “a pretty good family going then,” her husband said at a 2007 clemency hearing for Jones.\n“You need to love your family and understand that they can come and go.”\n— Lacey Phillips Seal, Mary Phillips’ daughter, at Jones’ 2007 clemency hearing, responding to a question from a television news reporter\nJACK JONES\nFound guilty in the death of Mary Phillips, who was beaten, raped and choked with an electrical cord in June 1995\nApril 24, 2017\nDate of original condemnation: April 17, 1996\nCounty in which crime occurred: White\n______\nProsecuting attorneys argued at a 1996 trial that then-31-year-old Jack Jones Jr. had visited Phillips' office twice on the day of her death. The first time, he was looking for work. The second, he returned with a BB pistol, latex gloves and wire. (In later hearings, the attorneys said Jones saw Phillips while painting a sign nearby.)\nLacey Phillips Seal speaks during a clemency hearing for inmate Jack Jones Jr. in Little Rock. When she was 11, Seal survived an attack by Jones in which her mother was killed. Jones reportedly told a state police investigator how he committed the crime: First, he forced the two to lie on the floor, tied up their hands using the wire and took Lacey to an adjoining bathroom and tied her to a chair, police told the jury. Then, he returned to Mary Phillips and raped her, beat her and “choked her with my hands,” then wrapped an electrical cord around her neck, Jones reportedly told investigators.\nJones later hit Lacey in the head with a BB pistol, causing severe injury, police said.\nWhen the charges were read against Jones in June 1995, he reportedly told White County Circuit Court Judge Robert Edwards: \"Just go ahead and kill me. Just get it over with.”\nA jury convicted Jones on April 17, 1996, and sentenced him to death for the murder of Phillips. He was also sentenced to life in prison for the rape of Phillips and to 30 years in prison and a $15,000 fine for the attempted murder of Lacey.\nBefore he was sentenced, Jones apologized to the courtroom, saying, \"I'm deeply sorry. If at any time I could give up my life to bring back everything I've taken, I wouldn't even think about it.\"\nIn 2005, Jones pleaded guilty to another murder in Florida. In May 1991, 32-year-old Lorraine Barrett was found dead in a Fort Lauderdale hotel. The Pennsylvania woman had just arrived in Florida for vacation and met Jones in the hotel's bar. She also was beaten, raped and strangled.\nChallenges to Jones’ Arkansas conviction in the following years have focused on mitigating evidence as well as the legality of Arkansas’ death penalty laws. Attorney Jeff Rosenzweig argued in a 2007 clemency hearing that jury forms in Jones’ trial had conflicting information. Ambiguities in other cases have been resolved with new sentencing hearings, ordered by the Supreme Court, he said.\nRosenzweig also reportedly argued that Jones’ bipolar disorder had not been properly presented to jurors. \"None of which excuses what he did, but it does explain it,\" Rosenzweig said.\nJones declined to attend his April 2017 clemency hearing and instead had Rosenzweig read a handwritten letter to the state Parole Board. In the letter, Jones wrote, \"I'm sorry, not only for what I did but for you having to come here.”\nIf granted clemency, Jones said, he would decline it.\n\"There's no way in hell I would spend another day or 20 years in this rat hole,” he wrote.\nLacey Phillips, now Lacy Phillips Seal, told officials at the hearing she does not want to live another day knowing that Jones is alive.\nMary Phillips’ body was found in the office of a bookkeeping and accounting firm where she worked on June 6, 1995, after she had been raped, beaten and strangled with an electric coffee-maker cord while her daughter, Lacey, was in the next room. The then-11-year-old, who was also severely beaten, was reportedly at work with her mother because she had a dentist appointment that day.Prosecuting attorneys argued at a 1996 trial that then-31-year-old Jack Jones Jr. had visited Phillips' office twice on the day of her death. The first time, he was looking for work. The second, he returned with a BB pistol, latex gloves and wire. (In later hearings, the attorneys said Jones saw Phillips while painting a sign nearby.)Jones reportedly told a state police investigator how he committed the crime: First, he forced the two to lie on the floor, tied up their hands using the wire and took Lacey to an adjoining bathroom and tied her to a chair, police told the jury. Then, he returned to Mary Phillips and raped her, beat her and “choked her with my hands,” then wrapped an electrical cord around her neck, Jones reportedly told investigators.Jones later hit Lacey in the head with a BB pistol, causing severe injury, police said.When the charges were read against Jones in June 1995, he reportedly told White County Circuit Court Judge Robert Edwards: \"Just go ahead and kill me. Just get it over with.”A jury convicted Jones on April 17, 1996, and sentenced him to death for the murder of Phillips. He was also sentenced to life in prison for the rape of Phillips and to 30 years in prison and a $15,000 fine for the attempted murder of Lacey.Before he was sentenced, Jones apologized to the courtroom, saying, \"I'm deeply sorry. If at any time I could give up my life to bring back everything I've taken, I wouldn't even think about it.\"In 2005, Jones pleaded guilty to another murder in Florida. In May 1991, 32-year-old Lorraine Barrett was found dead in a Fort Lauderdale hotel. The Pennsylvania woman had just arrived in Florida for vacation and met Jones in the hotel's bar. She also was beaten, raped and strangled.Challenges to Jones’ Arkansas conviction in the following years have focused on mitigating evidence as well as the legality of Arkansas’ death penalty laws. Attorney Jeff Rosenzweig argued in a 2007 clemency hearing that jury forms in Jones’ trial had conflicting information. Ambiguities in other cases have been resolved with new sentencing hearings, ordered by the Supreme Court, he said.Rosenzweig also reportedly argued that Jones’ bipolar disorder had not been properly presented to jurors. \"None of which excuses what he did, but it does explain it,\" Rosenzweig said.Jones declined to attend his April 2017 clemency hearing and instead had Rosenzweig read a handwritten letter to the state Parole Board. In the letter, Jones wrote, \"I'm sorry, not only for what I did but for you having to come here.”If granted clemency, Jones said, he would decline it.\"There's no way in hell I would spend another day or 20 years in this rat hole,” he wrote.Lacey Phillips, now Lacy Phillips Seal, told officials at the hearing she does not want to live another day knowing that Jones is alive. Scheduled for execution onDate of original condemnation:County in which crime occurred:______","url":"https://www.arkansasonline.com/arkansasexecutions/"}
