{"authors":[],"date_download":"2018-10-30 20:29:59","date_modify":"2018-10-30 20:29:59","date_publish":"2015-11-21 15:44:44","description":"They enrolled with hopes of earning a college degree and a more promising future. But broken promises and mountains of debt were all that many students walked away from Argosy University, Brown Mackie College and Art Institutes came away with, according to an investigation by attorneys general that concluded with a multi-state settlement this week.","filename":"data/vaneerConsumption/StatesuesArgosyUniversityBrownMackieCollegeArt.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_state-sues-argos_49b575ec21ebadbd54cae4f24d4be02a__1540931399.html","title":"State sues Argosy University, Brown Mackie College, Art...","title_page":"State sues Argosy University, Brown Mackie College, Art...","title_rss":"NULL","source_domain":"ajc.com","text":"They enrolled with hopes of earning a college degree and a more promising future.\nBut broken promises and mountains of debt were all that many students walked away from Argosy University, Brown Mackie College and Art Institutes came away with, according to an investigation by attorneys general that concluded with a multi-state settlement this week.\nEducation Management Corporation (EDMC), based in Pittsburgh, Penn., is the parent company of Argosy University, The Art Institutes, Brown Mackie College and South University.\nOn Nov. 16, EDMC agreed to forgive more than $6.8 million in loans for thousands of former students in Georgia. Nationwide, the agreement requires the for-profit college company to forgive $102.8 million in outstanding loan debt held by more than 80,000 former students. The agreement is expected to provide an average of $1,370 per person in loan forgiveness.\nEDMC also agreed to pay a $95 million settlement as part of a separate federal whistleblower lawsuit brought by the U.S. Department of Justice. That lawsuit alleged that the colleges illegally paid incentives to its admissions recruiters that were tied to how many students they enroll.\nThe multistate investigation started in January 2014, and was initiated on the basis of numerous complaints from current and former students.\nAttorney General Sam Olens had claimed in a Fulton County Superior Court complaint that the schools were using false and misleading information to recruit students.\n“EDMC’s practices were unfair to our state’s students, and they were also unfair to our nation’s taxpayers who backed many of these federal student loans that were destined to fail,” Olens said in a statement. “This is a rigorous agreement that not only provides some relief to a large number of former students through loan forgiveness, but helps ensure that the company will make substantial changes to its business practices for future students.”\nAmong the more troubling findings, the lawsuit said that EDMC schools misrepresented their graduate employment rates. Recruiters may have said a graduate got a job in his or her chosen field, although the job in question was far below the graduates’ actual field of study.\nFor example, a recruiter said a graduate with an accounting diploma was “placed in the field,” when in fact the graduate was working as a fast-food cashier.\nThe Georgia lawsuit made several other accusations against EDMC, including that its colleges:\nUsed high-pressure tactics to recruit students that it knew or should have known would not benefit from its programs.\nMisled students about program costs, emphasizing the costs per credit hour rather than the total cost.\nFalsely claimed students who obtained their degrees would earn substantially higher incomes than graduates actually earned.\nFalsely claimed some of its programs were accredited by a body necessary to become licensed in a chosen profession, or that they were seeking accreditation for those programs.\nAs part of the settlement. EDMC agreed to significantly reform its recruiting and enrollment practices. For example, the company will provide more accurate disclosures to prospective students and grant them more opportunities to withdraw without incurring costs.","url":"https://www.ajc.com/news/local/state-sues-argosy-university-brown-mackie-college-art-institutes/mQj7HmoPuaFxhLG0AZKbiN/"}
