{"authors":["Associated Press"],"date_download":"2018-10-23 00:53:09","date_modify":"2018-10-23 00:53:09","date_publish":"2017-03-16 10:29:18","description":"BRUSSELS (AP) - The European Union's statistical agency says more than 1.2 million people applied for asylum in the bloc last year, mostly Syrians, Afghans...","filename":"data/vaneerConsumption/Statsshow12millionpeoplesoughtasyluminEUlastyear.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227735-1489660169-405_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319588_Stats-1-2-million-people-sought-asylum-EU-year_1540255989.html","title":"Stats show 1.2 million people sought asylum in EU last year","title_page":"Stats show 1.2 million people sought asylum in EU last year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BRUSSELS (AP) - The European Union's statistical agency says more than 1.2 million people applied for asylum in the bloc last year, mostly Syrians, Afghans and Iraqis.\nIn data released Thursday, Eurostat said first-time applications for international protection were slightly down on numbers from 2015.\nBut the figure is almost double the 562,700 people who applied for asylum for the first time in 2014.\nFILE - In this Monday, Sept. 7, 2015 file photo, migrants and refugees queue as they wait for a police bus to take them to a detention center close to Hungary's border with Serbia in Roszke, Hungary. Dozens of asylum-seekers in Hungary are continuing a hunger strike launched this week, demanding to be released from detention, authorities said Tuesday, March 14, 2017. (AP Photo/Marko Drobnjakovic, File)\nOf those arriving last year, around one third - 334,800 - were from war-torn Syria, while 183,000 Afghans and 127,000 Iraqis also sought sanctuary.\nEurostat says 60 percent of applications were filed in Germany, followed by Italy with 10 percent. Applications dropped markedly in Sweden, Finland, Denmark and Hungary.\nIt said around 1 million files were still being processed at the end of last year.","url":"https://www.dailymail.co.uk/wires/ap/article-4319588/Stats-1-2-million-people-sought-asylum-EU-year.html"}
