{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:17:27","date_modify":"2018-10-30 22:17:27","date_publish":"2015-01-30 13:00:20","description":"Anti-deportation groups organized protests in three California cities Wednesday, demanding that California Attorney General Kamala Harris stop deportations and push the U.S. Immigration and Customs Enforcement (ICE) of California. |","filename":"data/vaneerConsumption/StatewideAntiDeportationProtestsinCA.json","image_url":"https://media.breitbart.com/media/2015/01/Screen-Shot-2015-01-29-at-10.20.25-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_30__1540937847.html","title":"Statewide Anti-Deportation Protests in CA","title_page":"Statewide Anti-Deportation Protests in CA | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Anti-deportation groups organized protests in three California cities Wednesday, demanding that California Attorney General Kamala Harris stop deportations and push the U.S. Immigration and Customs Enforcement (ICE) of California.\nAnti-deportation groups including the Immigrant Youth Coalition and the San Diego Dream Team protested at the San Diego, Los Angeles and Oakland offices of the Attorney General, holding signs such as “ICE OUT OF CA” and “NOT 1 MORE DEPORTATION.”\nAn announcement for the event read, “As immigrants living in California, we are unsatisfied with Attorney General Kamala Harris’ inaction to take a stronger stand to defend the rights of Californians and enforcing state laws like the Trust Act.”\nRoofers and Waterproofers Local 36 Union in Los Angeles joined the protest, promoting the event on the group’s Facebook page.\nIn San Diego, protesters rallied at the San Diego Central Jail, moving on to the building that houses Harris’s office. The building was put on lockdown and California Highway Patrol officers were called in to keep the peace, reported CBS8.\nLate Wednesday, the activist group RAIZ posted an “Emergency!” call for supporters to demand the release of Los Angeles protestors that the group refers to “brave migrant organizers who were arrested for trying to meet with Kamala Harris staff regarding TRUST Act Violations.”\nEffective January 1, 2014, The Trust Act, or AB-4, is described in Assembly Floor Analysis as prohibiting “a law enforcement official from detaining an individual on the basis of a United States Immigration and Customs Enforcement (ICE) hold after that individual becomes eligible for release, unless the individual has been convicted of or charged with specified crimes.”\nAn Associated Press report released just months after AB-4 went into effect indicated a 44% drop in deportations among reporting sheriff’s departments in California. A CBS San Francisco report on the AP study connected the shift to President Barack Obama’s unilateral executive actions to defer deportations for certain categories of illegal aliens.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/01/30/statewide-anti-deportation-protests-in-ca/"}
