{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:38:25","date_modify":"2018-10-30 21:38:25","date_publish":"2015-07-14 16:34:09","description":"Kelli Ward says McCain’s seniority and power has risen, but Arizonans continue to see a McCain record lacking meaningful accomplishments.","filename":"data/vaneerConsumption/StateSenKelliWardLaunches2016PrimaryChallengetoSenJohnMcCain.json","image_url":"https://media.breitbart.com/media/2015/06/Kelli-Ward-and-John-McCain-Facebook-and-AP-Photos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_14__1540935505.html","title":"State Sen. Kelli Ward Launches 2016 Primary Challenge to Sen. John McCain","title_page":"State Sen. Kelli Ward Launches 2016 Primary Challenge to Sen. John McCain | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Kelli Ward is a doctor, a state senator and now a candidate for United States Senate as a primary challenger to entrenched Arizona Republican John McCain.\nWard joined Breitbart News Executive Chairman Stephen K. Bannon on his radio program to discuss the much-anticipated Tuesday announcement. She has repeatedly exceeded expectations in her pursuit of serving fellow Arizonans as an elected official.\n“The people here in Arizona and I think the people across the country are crying out for new, fresh, bold leaders who are fearless, who are standing up for them, who have a backbone, who aren’t beholden to special interests, whose only special interest is the people that they represent,” Ward told Bannon when asked what her inspiration was for taking on the challenge that has been called a David versus Goliath battle.\n“I’ve been asked from all different entities across this state and across this country to consider doing this.”\nBannon pointed out that in 2010, McCain ran as a conservative who wanted to “build the danged [border] fence” when he squared off against primary challenger J.D. Hayworth.\nAsked whether she thinks McCain has lived up to the conservative image he portrayed in 2010, Ward said, “I don’t. I think that every time election comes around he moves to the right.”\nWard’s assertion is backed up in the trends of McCain’s American Conservative Union voting record. Breitbart previously reported when McCain tweeted about a high 91 percent rating in 2014 and ignored an offensively low 52 percent in 2013.\nArizona Republicans officially censured McCain in 2014, the year he claims a lofty conservative rating. Since the censure reports have surfaced that McCain and his allies have launched a political cleansing of Arizona Republican leadership.\n“The illegal immigration issue is a huge hot button issue. I think that Senator McCain would like us to move away from that; however, that is one of the number one issues, if not the number one here in Arizona.”\nWhy does McCain need to be challenged? Ward said McCain’s seniority and power has risen, but Arizonans continue to see a McCain record lacking meaningful accomplishments.\n“People are looking for new ideas. You are not getting new ideas from Senator McCain.”\nMcCain’s work on the “Gang of Eight” amnesty bill was referenced. Bannon asked Ward to name a few things that she most takes issue with regarding the failed bill.\n“We have got to enforce our existing laws rather than having selective enforcement that’s going on right now. One of the problems is we don’t know who’s coming across our borders.” She pointed out crimes committed by foreign nationals illegally in the United States including those resulting in the deaths. It’s an issue that’s been hot in the public eye recently as 2016 Presidential candidate Donald Trump has increased attention to the problem of crimes committed by illegal aliens in the U.S.\n“It’s overwhelming our justice system, it’s overwhelming our prison system, it’s overwhelming law enforcement with the costs that are associated with people who are coming here illegally.” The lack of border security is costing volumes of resources as the same illegal border crossers must be repeatedly deported, Ward explained.\n“We’re a country of laws, we’re a country that’s supposed to have a border,” she commented.\nBannon brought the media backlash against Donald Trump into the conversation, asking Ward if she was ready for impending attacks. She responded powerfully:\nI’ve got a pretty darn strong backbone and I’ve got a pretty darn thick skin. I think that there will be media attacks. I think there will be attacks from the establishment. I think there will be attacks from the McCain camp of course. I think many of those things may not even be true because the media can report whatever they want to report whether it’s true, false or otherwise. It’s up to the American people, it’s up to the people of Arizona to do their homework to find out the truth, to meet the people and to have a two way communication strategy with the people who represent them rather than having a top down approach to government, that is not working, that is what the establishment has right now. They don’t get out and speak to the people that they represent. They speak over them. They speak to them but they don’t speak with them. That’s some of the things that people want to see changed. They something different. They want government of for and by the people and the only way to do that is to actually change Washington, D.C., not exchange the parts, not take certain people and move them around and expect something different to happen, to get people who have proven records, who are able to get things done regardless of the situation and put them into place and then hold them accountable to do what they say.\nState Senator Kelli Ward is holding an event Tuesday night from 5-7 p.m. at Shugrue’s Bridgeview room in Lake Havasu City, AZ. For more information go to www.KelliWard.com.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/07/14/state-sen-kelli-ward-launches-2016-primary-challenge-to-sen-john-mccain/"}
