{"authors":["Sarkis Zeronian"],"date_download":"2018-10-30 19:47:36","date_modify":"2018-10-30 19:47:36","date_publish":"2015-08-13 14:34:28","description":"Veiled and bloodied effigies of women have been installed in parks across Prague, apparently intended as a warning of the dangers of Islam.","filename":"data/vaneerConsumption/StatuesErectedToProtestTheStoningOfWomenUnderIslam.json","image_url":"https://media.breitbart.com/media/2015/08/podebrady-e1439475576907.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_13__1540928856.html","title":"Statues Erected To Protest The Stoning Of Women Under Islam","title_page":"Statues Erected To Protest The Stoning Of Women Under Islam","title_rss":"NULL","source_domain":"breitbart.com","text":"A number of veiled and bloodied effigies of women were yesterday installed in parks across Prague, apparently intended as a warning of the dangers of Islam. Police in the city have said supporters of two anti-Islamic groups, ‘Bloc Against Islam’ and ‘We Do Not Want Islam in the Czech Republic’ were responsible for the statues representing religious executions by means of the stoning of women.\nThe Czech News Agency (ČTK) reports Prague police spokesman Tomas Hulan saying police are dealing with the effigies. However, he added that the representations of the stoning of women which have appeared in a number of places in Prague veiled in blood-stained white cloths and surrounded by stones, do not appear to have breach any laws.\nThe effigies placed in such places as Charles Square and the Square of George of Poděbrady [pictured above] are accompanied by captions explaining the alleged reasons for the stoning of women. Signs reading “Pregnant after Rape” or “She Was Unfaithful” point out common reasons for being stoned to death in some Islamic countries.\nArtur Fiser, spokesman for ‘We Do Want Islam in the Czech Republic‘, explained to ČTK that the statues of the stoning victims are intended to warn of Islamic barbarism and violence committed against women. He said:\n“Islamic barbarism is infiltrating us with a growing speed, but it has not touched upon majority society.\n“We hope that if we open the eyes to the public before it gets here in full, people will not have to watch real stoning or read in the papers that a neighbour killed his daughter over the perverted notion of ‘honour’.”\n‘We Do Not Want Islam in the Czech Republic’ is regularly mentioned in the reports on extremism published by the Czech Ministry of the Interior. Identified by the Ministry as part of the “extreme right” it has staged anti-Islamic events before, but followers are mainly active online.","url":"https://www.breitbart.com/national-security/2015/08/13/pics-bloody-veiled-statues-erected-to-protest-the-stoning-of-women-under-islam/"}
