{"authors":["Camila Domonoske"],"date_download":"2018-10-23 01:08:17","date_modify":"2018-10-23 01:08:17","date_publish":"2017-01-09 00:00:00","description":"Around the time of the \"Red Scare,\" the \"Lavender Scare\" pushed gay people out of government service. Secretary of State John Kerry has now apologized for \"the practices of the past.\"","filename":"data/vaneerConsumption/StateDepartmentApologizesForDecadesOfAntiLGBTDiscrimination.json","image_url":"https://media.npr.org/assets/img/2017/01/09/gettyimages-628011028_wide-79213a7cc1da36c888370346710cc253ee7aaec8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_09_508966318_state-department-apologizes-for-decades-of-anti-lgbt-discrimination_1540256897.html","title":"State Department Apologizes For Decades Of Anti-LGBT Discrimination","title_page":"State Department Apologizes For Decades Of Anti-LGBT Discrimination : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"State Department Apologizes For Decades Of Anti-LGBT Discrimination\nEnlarge this image toggle caption JOHN THYS/AFP/Getty Images JOHN THYS/AFP/Getty Images\nOn behalf of the U.S. State Department, John Kerry has issued a formal apology for the department's pattern of discrimination against LGBT employees during a period beginning in the 1940s and stretching for decades.\nSen. Ben Cardin, D-Md., had asked the secretary of state for such an apology in late November, calling the historical discrimination \"un-American and unacceptable.\"\nThe Washington Blade reported on Cardin's request in early December, noting at the time that the State Department said it was preparing a response.\nThe mass purge of gay staffers during the mid-20th century was known as the \"Lavender Scare,\" which coincided with the \"Red Scare.\"\nBooks Eric Berkowitz, Author of 'The Boundaries Of Desire,' Discusses Laws On Sex And Sexuality Legislating Desire: An Author's Take On 'Bad Laws And Good Sex' Listen · 19:04 19:04\nAuthor Eric Berkowitz, speaking to Terry Gross on Fresh Air in 2015, said the systematic discrimination against gay people in that era has \"gotten short shrift in the popular imagination.\"\nAt the same time as the persecution of alleged communists, \"there was no less energetic a hunt to root out what were called 'perverts' ... from the federal government,\" he said.\nAnd it started in the State Department, explains David Johnson, the author of The Lavender Scare. He says that in the '40s, the State Department was already systematically firing gay employees.\nThen, in 1950, Joseph McCarthy claimed to have a list of communists in the State Department. In an attempt to defend itself against the charges, the department pointed out that it was working hard to expel \"subversives\" — by firing gay people. That disclosure kicked off the wider \"Lavender Scare.\"\n\"The purges begin in the State Department,\" Johnson says. \"And then in the politicized atmosphere of McCarthyism, they doubled down.\"\nIn 1953, years after the State Department began firing gay employees, Dwight Eisenhower instituted a nationwide ban on gay men and lesbians working for the federal government. Purges lasted for decades. Careers were destroyed, and some employees committed suicide, Johnson says.\nCardin, the ranking Democrat on the Senate Committee on Foreign Relations, wrote to Kerry on Nov. 29 to ask that in his last months as secretary of state, he address that history.\nCardin said that more than 1,000 people were dismissed from the Department of State for their alleged sexual orientation, and \"many more\" prevented from joining the department through discriminatory hiring practices. As recently as the 1990s, he said, the State Department drove out personnel thought to be gay, calling them \"security risks.\"\nCardin urged Kerry to acknowledge the discrimination, apologize for it — and perhaps install an exhibit about it at the State Department's museum.\n\"Of course, the measures we take today cannot bring back years of anguish or erase decades of institutionalized homophobia, but we can ensure that such injustices levied against the LGBT community are never repeated again,\" Cardin said in a statement in early December.\nKerry responded with a statement released Monday. He began by highlighting the State Department's recent support for LGBT and intersex employees. Then he wrote:\n\"In the past — as far back as the 1940s, but continuing for decades — the Department of State was among many public and private employers that discriminated against employees and job applicants on the basis of perceived sexual orientation, forcing some employees to resign or refusing to hire certain applicants in the first place. These actions were wrong then, just as they would be wrong today. \"On behalf of the Department, I apologize to those who were impacted by the practices of the past and reaffirm the Department's steadfast commitment to diversity and inclusion for all our employees, including members of the LGBTI community.\"\nHuman Rights Campaign Government Affairs Director David Stacy said in a statement that \"although it is not possible to undo the damage that was done decades ago, Secretary Kerry's apology sets the right tone for the State Department as it enters a new and uncertain time in our country under a new administration.\"\nBut David Johnson, a history professor at the University of South Florida and the author of The Lavender Scare, says that while the apology is welcome and overdue, Kerry's statement misrepresents the State Department's role in the purge.\n\"The apology made it sound like the State Department was just one of many institutions that was discriminating against gay men and lesbians ... that it was just sort of run-of-the-mill 1950s anti-gay discrimination,\" he says.\n\"In fact, the State Department was unique in its level of homophobia,\" he says.","url":"https://www.npr.org/sections/thetwo-way/2017/01/09/508966318/state-department-apologizes-for-decades-of-anti-lgbt-discrimination"}
