{"authors":["John Hayward"],"date_download":"2018-10-30 19:13:10","date_modify":"2018-10-30 19:13:10","date_publish":"2016-05-25 15:32:56","description":"Another bombshell just hit Hillary Clinton’s presidential campaign, as the State Department’s Office of the Inspector General has released a long-awaited audit that concludes Secretary of State Clinton “did not comply with the Department’s policies that were implemented in accordance with the Federal Records Act.” | Politics","filename":"data/vaneerConsumption/StateOIGClintonDidNotComplyWithDepartmentPoliciesImplementedinAccordanceWiththeFederalRecordsAct.json","image_url":"https://media.breitbart.com/media/2016/05/GettyImages-533315294.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_25__1540926790.html","title":"State OIG: Clinton ‘Did Not Comply With Department Policies Implemented in Accordance With the Federal Records Act’","title_page":"State OIG: Clinton ‘Did Not Comply With Department Policies Implemented in Accordance With the Federal Records Act’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Another bombshell just hit Hillary Clinton’s presidential campaign, as the State Department’s Office of the Inspector General has released a long-awaited audit that concludes Secretary of State Clinton “did not comply with the Department’s policies that were implemented in accordance with the Federal Records Act.”\nThe OIG tries to cushion the blow by judging that previous Secretaries of State, under both Democrat and Republican Administrations, haven’t done a great job of meeting those standards either. Politico quotes the report saying that the State Department is dealing with “longstanding, systemic weaknesses” that “go well beyond the tenure of anyone one Secretary of State.”\nNotably, current SecState John Kerry, and his predecessors Madeleine Albright, Colin Powell, and Condoleezza Rice, cooperated with the OIG… but Hillary Clinton and her highly controversial top aides Cheryl Mills, Jake Sullivan, and Huma Abedin did not. That’s a massive scandal, bordering on a national embarrassment, in its own right.\nNo amount of padding can soften the blow of what the OIG determined about Hillary Clinton’s uniquely furtive tenure as Secretary of State.\n“At a minimum, Secretary Clinton should have surrendered all emails dealing with Department business before leaving government service,” says the Inspector General report. No amount of bleating about what Condi Rice did, back when America Online and dial-up Internet were all the rage, can excuse Clinton for deliberately refusing to comply with such a basic, common-sense requirement.\nThe Washington Post reports that the Inspector General could find no evidence that Clinton ever obtained a review by legal counsel for her email arrangement, even though her aides have insisted the system was legally approved. Another Clinton lie bites the dust.\nBloomberg News cites the OIG report concluding that the State Department and its secretaries have been “slow to recognize and to manage effectively the legal requirements and cybersecurity risks associated with electronic data communications, particularly as those risks pertain to its most senior leadership.”\nWe could look at this as another story of ponderous Big Government failing to live up to the standards it imposes on the private sector. Email has been around for decades now. A gigantic staff of highly-paid officials is tasked with maintaining security. And yet, the OIG is telling us things haven’t really improved all that much from Madeleine Albright’s day.\nLet’s not lose sight of what lurks at the heart of this Inspector General report: what Hillary Clinton did is uniquely bad, absolutely unprecedented, and she did it after decades of government experience with the Information Age had already passed. We’ve been told through her career that she’s the “smartest woman in the world,” but now her campaign will ask us to believe she learned nothing by studying the experiences of her predecessors.\nThat excuse should fall on deaf ears, because there is no way to continue pretending that Hillary Clinton made a mistake. This was a deliberate conspiracy to avoid State Department policies and federal law, involving a great many people… and the most important figures in the scandal refused to cooperate with the Inspector General.\nIn case you’re wondering how the Clinton syndicate will spin this disastrous report, the Washington Post offers a preview:\nThe timing of the report is inconvenient for Clinton, who now faces an intense onslaught of attacks from presumptive Republican nominee Donald Trump. But its release — as well as the conclusion of an ongoing FBI investigation — have also been seen for months by her allies as key milestones to finally putting the email issue to rest. They have worked to inoculate her against potentially critical findings, accusing the State Department’s inspector general of working in concert with congressional Republicans to harm her presidential campaign and noting that a top inspector general official used to work for Sen. Charles E. Grassley (R-Iowa).\nEverybody in government is corrupt, except the noble Clintons and their loyal retainers? Good luck with that, kids.","url":"https://www.breitbart.com/politics/2016/05/25/state-oig-clinton-not-comply-department-policies-implemented-accordance-federal-records-act/"}
