{"authors":[],"date_download":"2018-10-30 17:59:48","date_modify":"2018-10-30 17:59:48","date_publish":"2017-03-03 20:02:00","description":"State Rep. Karla Drenner delivered an emotional plea before the House regarding campus carry.","filename":"data/vaneerConsumption/StateRepdeliversemotionalpleaconcerningCampusCarry.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/03/Images/newsEngin.17968951_032216-leg-religious-ba01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_d9bacd305c4d6435faa773592743220b__1540922388.html","title":"State Rep. delivers emotional plea concerning 'Campus Carry'","title_page":"State Rep. delivers emotional plea concerning 'Campus Carry'","title_rss":"NULL","source_domain":"ajc.com","text":"Karla Drenner — a Democratic state representative, mother and college professor — made a surprising confession Friday before the state House: Last summer, she considered buying a gun.\nIn a personal and provocative account during a discussion of a campus gun bill, Drenner revealed that while on an early evening run near her home in Avondale Estates, she was the victim of a physical assault.\n“Before I could turn back around, this man runs back toward me and grabbed me — grabbed me to hurt me,” Drenner said, shaking while talking. “At the moment, you know what I knew? I knew that I could be hurt.”\nIt was enough to push the liberal lawmaker to action.\n“I was convinced I was going to buy a gun,” Drenner said. “Even if you looked at me wrong, I was going to pull my gun out. I was going to shoot you.”\nDays afterward, she bought mace, a stun gun and a club and researched guns. Yet, during the attack, she couldn’t remember how to dial 911, prompting a re-evaluation.\n“Imagine me with all this on my running belt,” she said. “It looks like I’m going to war, and all I wanted to do is run a couple of miles.”\nThe Atlanta Journal-Constitution will again have Georgia’s largest team covering the Legislature. Get complete daily coverage during the legislative session at myAJC.com/georgialegislature.\nThe legislation that prompted the debate — House Bill 280 — would allow anyone with a concealed weapons permit to carry firearms on public college and university campuses, with the exception of inside dormitories, fraternity and sorority houses, and buildings used for athletic events. The bill also would require guns to be concealed, and only those who hold a permit would be allowed to carry the weapons.\n“We’re talking about giving kids guns because we want to protect them,” she said. “But if I had a gun, that wouldn’t have protected me.”\nIn introducing the bill, state Rep. Mandi Ballinger, R-Canton, cited campus crime statistics that she said underscore a need for such legislation. Other lawmakers, including state Rep. Alan Powell, R-Hartwell, spoke out in support of the bill.\nYet, many within the state’s higher education system, including University System of Georgia Chancellor Steve Wrigley, do not find the legislation necessary.\n“With respect to campus carry, we feel strongly current law strikes the right balance to provide security on our campuses,” Wrigley said in a testimony before lawmakers Feb. 20. “We, therefore, respectfully oppose any change to current law.”\nDrenner, who has a daughter attending the University of Georgia in Athens, worries about the consequences of allowing students to carry weapons on campus.\n“We cannot give guns to our kids and expect them to protect themselves and protect others when they’re going to have moments like I did when they’re going to freeze and they’re not going to know how to call 911,” she said.\nDrenner implored her fellow House members to consider her experience, and in an interview with The Atlanta Journal-Constitution she said she “wasn’t comfortable telling the story by any stretch of the imagination.” But it failed to influence enough votes. The bill passed 108-63.\n“The river of polarization runs deep,” Drenner said.","url":"https://www.ajc.com/news/state--regional-govt--politics/had-gun-that-wouldn-have-protected-lawmaker-tells-house/Vsft41VOid3tvmcbI85EyO/"}
