{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 22:07:40","date_modify":"2018-10-30 22:07:40","date_publish":"2017-01-27 13:37:32","description":"Calexit enthusiasts received a boost when California Secretary of State Alex Padilla approved \"California Nation\" to collect signatures.","filename":"data/vaneerConsumption/StateOKsCaliforniaNationtoCollectSignatures.json","image_url":"https://media.breitbart.com/media/2016/12/Calexit-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_27__1540937260.html","title":"State OKs 'California Nation' to Collect Signatures","title_page":"#CalExit: State OKs 'California Nation' to Collect Signatures","title_rss":"NULL","source_domain":"breitbart.com","text":"California Secretary of State Alex Padilla announced Thursday that a ballot initiative called “California Nation” has been approved by the state to begin collecting signatures to qualify for the 2018 ballot.\nThe effort is supported by the “Yes California” campaign, an organization that enjoys the support of the Russian government and whose founder, Louis Marinelli, now lives in Russia.\nCALIFORNIA: Are you ready to secede from the United States? #Calexit — Yes California (@YesCalifornia) November 9, 2016\nPadilla announced that the Attorney General had prepared the following “official title and summary for the measure” (original emphasis):\nCALIFORNIA NATIONHOOD. INITIATIVE CONSTITUTIONAL AMENDMENT AND STATUTE. Repeals provision in California Constitution stating California is an inseparable part of the United States and that the United States Constitution is the supreme law of the land. Places question of whether California should become a separate country on a future ballot. Treats result of such future vote as declaration of independence from the United States if 50 percent of registered voters participate and 55 percent of those voting approve. Requires Governor to request California admission to the United Nations if voters approve independence. Summary of estimate by Legislative Analyst and Director of Finance of fiscal impact on state and local government: The fiscal impact of this measure is dependent on various factors, including a vote by the people on this measure, a subsequent vote on California independence, possible legal challenges, and implementation issues. Assuming that California actually became an independent nation, the state and its local governments would experience major, but unknown, budgetary impacts. This measure also would result in tens of millions of dollars of one-time state and local election costs.\nThe supporters of “California Nation” now have 180 days — i.e. until July 25, 2017 — to gather valid signatures from 585,407 registered voters, 8% of the votes cast for governor in 2014. Otherwise, the measure will not qualify for the ballot.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/local/2017/01/27/calexit-california-nation-may-begin-collecting-signatures-ballot/"}
