{"authors":[],"date_download":"2018-10-30 18:21:08","date_modify":"2018-10-30 18:21:08","date_publish":"2017-01-31 18:56:00","description":"Cobb County School District students are working hard and efficiently, according to Georgia Financial Efficiency Star Rating rankings.","filename":"data/vaneerConsumption/StateCobbgetsmorebangperbuckfromstudentsthan143districts.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/09/Images/CobbRussellElem.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_state-cobb-gets-_8936a5a16c4381f940680393ca4e7318__1540923668.html","title":"State: Cobb gets more bang per buck from students than 143 districts","title_page":"State: Cobb gets more bang per buck from students than 143 districts","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb County’s students deserve a gold star.\nApparently, they’re out-working many other students in Georgia compared to how much the district spends on them.\nState education officials released Friday its Financial Efficiency Star Rating rankings based on a school system’s per-pupil spending compared to its three-year average results on the College and Career Ready Performance Index, or CCRPI.\nCobb ranked 37 out the 180 Georgia school systems analyzed. The Marietta school system ranked 140th.\n“Our district does an exceptional job of maximizing our financial resources while providing quality education for each of our students,” Cobb Superintendent Chris Ragsdale said in a statement.\nThe CCRPI scores for Cobb and Marietta were released in early December. Schools are scored on a point scale from 0 to 100, with a possibility of 10 additional points.\nThe financial efficiency ranking works on a scale from one to five stars, with five being the best.\nThe Cobb County School District came in at three-and-a-half stars with an average CCRPI of 79.2 during the past three years. During that time, Cobb’s yearly average spending was $8,059 per student.\nMarietta City Schools earned two stars and had a three-year average CCRPI of 75.4. The school system spent an average of $9,487 per student in that time.\nRead more about the rankings online.\nYou can find information about your school, such as test scores, graduation rates and school climate rating at the Ultimate Atlanta School Guide.","url":"https://www.ajc.com/news/local/state-cobb-gets-more-bang-per-buck-from-students-than-143-districts/b3J677b5k45RhNEpMGOi7H/"}
