{"authors":["John Hayward"],"date_download":"2018-10-30 21:35:27","date_modify":"2018-10-30 21:35:27","date_publish":"2016-01-26 06:22:01","description":"Fox News has uncovered a video from 2013 that could cause huge legal problems for Hillary Clinton and her closest deputies.","filename":"data/vaneerConsumption/StateDeptOfficialBragsHillaryClintonSentSensitiveInfobyEmail.json","image_url":"https://media.breitbart.com/media/2016/01/under-secretary-wendy-sherman-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_25__1540935327.html","title":"State Dept. Official Brags Hillary Clinton Sent Sensitive Info by Email","title_page":"State Dept. Official Brags Hillary Clinton Sent Sensitive Info by Email | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Fox News has uncovered a video from 2013 that could cause huge legal problems for Hillary Clinton and her closest deputies.\nIn the video, seen a little over one minute into the clip below, former Under Secretary of State Wendy Sherman boasts that BlackBerry mobile phone technology allowed top State Department officials to share information “that would never be on an unclassified system.”\nBut that’s exactly the kind of material that, by law, should never have been allowed on an unclassified system, such as a BlackBerry, and should never have been on Secretary of State Hillary Clinton’s highly irregular, unsecured private email server.\n“Now we have BlackBerrys, and it has changed the way diplomacy is done,” Sherman told her audience at an American Foreign Service Association event in 2013. “Things appear on your BlackBerrys that would never be on an unclassified system. But you’re out traveling, you’re trying to negotiate something. You want to communicate with people, it’s the fastest way to do it.”\nSherman went on to recall that, during a meeting between Hillary Clinton and Lady Ashton of the European Union at the United Nations General Assembly in 2011, “they sat there, as they were having the meeting, with their BlackBerrys, transferring language back and forth between them and between their aides to multitask in quite a new fashion, to have the meeting and, at the same time, be working on the quartet statement.”\nThe problem is that Hillary Clinton wanted that level of convenience, without using the secure State Department mail system she was supposed to be using. All of that sensitive material Sherman gushes about in the clip was being pumped to Clinton’s unsecure, homebrew server in her home.\nFox News followed up by checking the Clinton emails produced by the State Department, and, sure enough, they found top aide Jake Sullivan forwarded notes on that “quartet statement” to Clinton’s private mail server. The email chain has been deemed classified by the State Department, and portions were redacted before it was released to the public.\nFurthermore, Fox News cites the America Rising PAC, noting that under State Department guidelines, such information about “foreign relations or foreign activities of the United States” is considered born classified—that is, classified at the moment of its creation. The Secretary of State is well aware of these protocols. Sherman’s comments would appear to provide further confirmation that numerous officials at the State Department knew she wasn’t following them.\nThe “quartet” referred to by Wendy Sherman is the Middle East Quartet of the United States, United Nations, European Union, and Russia, working together on the Israeli-Palestinian political fight, or the so-called “peace process.” Clinton is touting her “resume” on the campaign trail.\nAnyone with a modicum of knowledge or concern about national security would have known better than to expose the kind of information Clinton routinely put at risk, for no better stated reason than her reluctance to carry two cell phones around when she traveled.","url":"https://www.breitbart.com/politics/2016/01/25/state-dept-official-brags-about-clinton-sending-classified-material-from-cell-phone/"}
