{"authors":["Elizabeth Ballou"],"date_download":"2018-10-31 01:35:35","date_modify":"2018-10-31 01:35:35","date_publish":"2014-08-12 19:53:43","description":"It may seem as if your average selfie-snapper has little in common with classical/neoclassical works of art, but there are certain traits shared by both groups. Consider: weirdly contorted poses, carefully chosen facial expressions, occasional…","filename":"data/vaneerConsumption/StatueSelfiesClassicWorksofArtGetAllZeitgeistyWithThisNewTrend.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/290b54eb-f78e-40f6-a10a-3c54d9cba01a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35456-statue-selfies-classic-works-of-art-get-all-zeitgeisty-with-this-new-trend_1540949735.html","title":"Statue Selfies: Classic Works of Art Get All Zeitgeisty With This New Trend","title_page":"Statue Selfies: Classic Works of Art Get All Zeitgeisty With This New Trend","title_rss":"NULL","source_domain":"bustle.com","text":"It may seem as if your average selfie-snapper has little in common with classical/neoclassical works of art, but there are certain traits shared by both groups. Consider: weirdly contorted poses, carefully chosen facial expressions, occasional nudity, and public display. Though this thought may have wandered through my mind on occasion (who hasn't snapped selfies with statues at least once?), I never thought of setting up photos that made it look as if the statues themselves were taking a few pics with their iPhones. Luckily, Reddit genius Jazus_ur_lookin_well has done us all the favor of grabbing those shots for us.\nWhile wandering through the Crawford Art Gallery in Cork, Ireland, Jazus (as I will henceforth refer to him) arranged his cell phone camera so that it looked as if the statues had taken a few moments to self-document their poses. Forget #elegantselfies, #globalselfies, and #felfies: the #statueselfie is poised to top them, at least in terms of entertainment value. \"The staff in that art gallery were giving me some strange looks!\" he wrote in a Reddit thread he created. A commentator pointed out that one of the statues should perhaps be concerned about the hairline fracture on his left shoulder.\n\"Maybe he'll get a plaster for that,\" said another.\nThe collections from the Cork museum are reproductions, cast by 18th-century artist Antonio Canova, of Greek and Roman works. The originals are located in the Vatican. From what I can tell, one of Jazus' subjects is the Fighting Gladiator, who has taken a break from bloody bouts in the arena to document his rock-hard (heh, literally, get it?) abs.\nJazus made it clear that he didn't touch any of the statues while photographing them, which is a relief. Earlier this year, a student broke the leg off a 19th-century Greco-Roman statue in the Academy of Fine Arts of Brera, Milan. And, as you may have already gathered from the subject of this article, he was indeed trying to take a selfie with it...while sitting on it.\nImages: Statue Selfies/Reddit","url":"https://www.bustle.com/articles/35456-statue-selfies-classic-works-of-art-get-all-zeitgeisty-with-this-new-trend"}
