{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 02:02:10","date_modify":"2018-10-23 02:02:10","date_publish":"2017-03-10 10:48:26","description":"Cancer survivor Peter Norton, 79, suffered a traumatic brain injury when he fell while riding down an aisle in the store in St Austell, Cornwall, as he tested the gears.","filename":"data/vaneerConsumption/StAustellmandiesafterbikefallinHalfordsstore.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22445500000578-0-image-a-35_1489143415931.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300798_Grandfather-died-brain-injury-fell-bike_1540260130.html","title":"St Austell man dies after bike fall in Halfords store","title_page":"St Austell man dies after bike fall in Halfords store | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cancer survivor Peter Norton, 79, suffered a traumatic brain injury when he fell while riding down an aisle in the store in St Austell, Cornwall, as he tested the gears\nA 79-year-old grandfather died from a brain injury after he fell off a bike he was testing inside a branch of Halfords while not wearing a helmet.\nCancer survivor Peter Norton, 79, suffered a traumatic brain injury when he fell while riding down an aisle in the store in St Austell, Cornwall, as he tested out the gears.\nFollowing an inquest into his death a coroner has recommended that Halfords set aside a separate area for test rides and ask customers to wear to helmets.\nBut after a jury recorded ruled his death was an accident, Mr Norton's family accused Halfords of a lack of care for customers.\nHis son Chris welcomed the coroner's recommendations and said he believed it was even more important to wear them inside a store than it was on roads outside.\nThe grandfather, who was recovering from cancer and was described as 'active', had only purchased the pushbike two days earlier but was returning it having discovered an issue with the gears.\nStaff made a 'minor adjustment' on the bike before giving it back and inviting Mr Norton to try it out.\nSales assistant Matthew Noy told the inquest he was one of three staff members working on September 21 last year and watched Mr Norton, who had no head protection, ride towards the till area until he was out of sight.\nHe said he then heard a screech, which he assumed was Mr Norton breaking, as he took a tumble.\nFollowing an inquest into his death a coroner has recommended that Halfords (St Austell branch pictured) set aside a separate area for test rides and ask customers to wear to helmets\nHe said: 'I went to him and saw him on the floor. I offered him my forearm to help him get up but he refused.\n'I asked if there was anything I could do and he said no. He was red in the face but I assumed that it was because he was embarrassed.'\nMr Noy said he couldn't remember if he noticed a bruise or cut on Mr Norton's forehead and watched him leave the store and returned to work.\nThe inquest heard how Mr Norton went out to see his wife Jean who was waiting in the store car park and noticed a slightly swollen cut on his forehead.\nShe said: 'Peter came into the camper van and was quite cross. I said what happened to your head and he said he fell over.'\nShe said that he told her he 'wanted to get home' and went for a lie down.\nSeveral hours later he became unresponsive and never regained consciousness.\nThe cause of death given was a brain haemorrhage.\nAfter the verdict coroner Guy Davies said he would write to Halfords chief executive with recommendations for the company policy with a view of preventing future deaths.\nHe asked for a review of company policy of riding bikes in the store and suggest an area was set aside in stores for riding the bikes.\nHe also suggested that helmets are worn when bikes are tested and that it reviews staff training and the need for risk assessments.\nCornwall Council Health and Safety officer Darren Hambly had inspected the St Austell Halfords store in the days following Mr Norton's death.\nHe said: 'From discussions with the staff, what was done to the bike was a simple adjustment.\n'Mr Norton had made a sharp left turn around a shelving unit but no staff witnessed the turn.\n'After hearing the fall, staff went to check if assistance was required and there was no mention that he had hit his head.'\nHe said the shelving units were particularly tight in the area where Mr Norton fell and that it was possible he lost his balance.\nHe said that an accident report form had not been completed until the day he attended the store.\nMr Hambly also explained that the store had been experiencing some issues with the CCTV system, so was unable to watch what had happened to Mr Norton.\nBut he also said that there was no breach of health and safety regulations, despite staff having failed to provide first aid care, complete an accident report form or ask for Mr Norton to wear a helmet.\nSpeaking after the inquest, Mr Norton's son Chris, 51, of Torquay, Devon, welcomed the coroner's recommendations which he hoped would stop anything similar happening in the future.\nHe said Mr Norton was grandfather-of-one and father-of-two. His other son is Stephen, 62.\nChris said: 'Thinking about it, that's the most important place to wear a helmet - inside the store.\n'You're far more likely to hit your head with all the shelves and bikes and pointing out bits. In theory, they should've looked after him.'\nChris said the inquest heard that staff at Halfords are not obliged to look after anyone in their store.\nHe added: 'I re-asked the public protection officer if that's the case three times. The jaws of all the people in the jury dropped.\n'I am disappointed at the health and safety regulations, you are not protected and that health and safety in the work place is only for staff.\n'I think it would be different if the CCTV was working.'\nA Halfords spokesman said: 'We were deeply saddened by this tragic accident and, although there was no breach in health and safety legislation, we are reviewing the initial recommendations made at the inquest, pending the formal report. Our thoughts and condolences are with the family of Mr Norton at this time.'","url":"https://www.dailymail.co.uk/news/article-4300798/Grandfather-died-brain-injury-fell-bike.html"}
