{"authors":[],"date_download":"2018-10-30 01:06:12","date_modify":"2018-10-30 01:06:12","date_publish":"2015-07-07 08:00:00","description":null,"filename":"data/vaneerConsumption/StayingintheFightAnInterviewWithBradThor.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/07/Screen20Shot202015-07-0620at201.59.0720PM_0.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861572.html","title":"Staying in the Fight: An Interview With Brad Thor","title_page":"Staying in the Fight: An Interview With Brad ThorThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Ned Ryun: I’m always fascinated with origin stories, on where something all began. So I have to ask: how did you become an author? Where did it begin?\nBrad Thor: For as long as I can remember, I have always wanted to be an author. I didn’t pursue it until my thirties, though, because I was afraid of failing. It wasn’t until my wife asked me on our honeymoon, “What would you regret on your deathbed never having accomplished?” That was when I committed to becoming a writer. When we returned home, I began spending two hours a day working on my debut novel, The Lions of Lucerne. If it wasn’t for the support of my wife and her belief in me, I don’t know if I ever would have taken the plunge.\nNR: I’m a big fan of your books, and one of the reasons is that I can absolutely see what you write about taking place right now in the real world. Can you talk a little about your research process and sources?\nBT: I call what I do “Faction,” which means you aren’t really sure where the facts end and the fiction begins. One of my favorite comments from readers is that they love to read my thrillers with their laptops open because they can’t believe so many things in my books are real. They go off and search them and come back saying, “Wow! I never knew that existed.”\nI start each novel, trying to peer over the horizon and anticipate what is coming next in the world. Sometimes, I get pretty close — within months. Sometimes my thrillers are years ahead.\nOver time, I have built a great network of contacts in the intelligence, law enforcement, and Special Operations communities. These are the people I go to bounce ideas off of and to make sure that my books are as accurate as possible. One of my favorite questions to ask them is, “What keeps you up at night?” Their answers often make it into my thrillers.\nNR: You sign your books with “Stay in the fight.” Why that phrase?\nBT: It was suggested by a friend in the Unit (Delta Force). I was signing a book for him and I asked him what he wanted me to write. He said, “Stay in the fight!” He then told me he thought I should sign all of my books that way.\nThe more I used it, the more the phrase took on special meaning for me. Stay in the fight isn’t a rallying cry only for people on a battlefield. It can apply to anyone fighting for something they believe in. If you get knocked down, you get back up. You stay in the fight. You don’t give up.\nI am an entertainer. My job is to give you the most thrilling, edge-of-your-seat, roller coaster ride I am capable of. I am also an American and believe very strongly that we don’t own the Republic. We are merely stewards and it is incumbent upon us to hand a freer, stronger, and more prosperous nation to the next generation than was handed to us. Stay in the fight, to me, means staying in the fight for freedom.\nI am positive my publisher would rather I kept my politics and my patriotism to myself. Who knows how many more books I could sell if I wasn’t constantly calling out the failures of the progressive policies and their Utopian, big government vision? But I am an American, a steward of the Republic before I am anything else. People before me didn’t bleed and die so that I could remain silent in order to sell more books. They fought to help protect my freedoms. What kind of man would I be if I didn’t strive to live up to their sacrifices?\nDo I want to sell more books? Of course. In fact, I’d like to see it become an act of conscience for Conservatives to support other Conservatives in popular culture. It isn’t easy, but I know my voice makes a difference and I gladly take our message anywhere I can. I do it with sunny Reagan optimism because I know that politics is downstream of culture. Our side has the better ideas, but it needs better storytellers. If my thrillers are successful, it allows me to do everything else.\nNR: Your previous two books have been #1 on the New York Times’ bestselling list, and hopefully Code of Conduct, coming out today, will be the third in a row, which would be an amazing accomplishment. How on earth does an unabashed conservative accomplish this? Is it because you think you’re tapping into something with the American people?\nBT: Absolutely. People love the short, cinematic chapters, the fast pacing, the rich characters, the twists and turns… It’s about entertaining people, not preaching to them. Along the way, do certain Conservative themes appear in my books? If a belief in American exceptionalism and the need for strong national defense are considered the realm solely of Conservatism, then you bet they do.\nI believe, though, that those are American themes and that’s why my thrillers resonate with so many people.\nNR: One of my great frustrations is when an inferior book or movie or documentary is conservative and conservatives laud it and I’m sitting there going, “It sucks and no one in the greater world will every read or watch that crap.” If we’re going to win the culture, we need more talented conservatives who are succeeding at a higher level in the greater culture, where even those who might disagree with us will go, “Yeah, it’s a conservative message, but it’s so good you have to read or watch it.” How do we make that happen? (As though there’s an easy answer to this.)\nBT: Simple. We make it that act of conscience I spoke of to seek out and support conservatives in the popular culture. It’s still a meritocracy, but we need to ask ourselves — before we hand over a single dollar for a movie ticket or a novel — am I helping further the career of someone whose ideas I believe in and agree with, or not?\nToo many of us are contributing to the bank accounts of figures in the popular culture whose worldviews are completely at odds with our own. We’re building silos of wealth for them, which they in turn use to help elect politicians and fund campaigns directly opposed to what we know is best for the country.\nNR: You recently moved from Illinois to Tennessee. What was your motivation for that?\nBT: My children say it best: freedom. The states are the laboratories of democracy. If liberal economic and social policies were so brilliant, California and Illinois would lead the nation. Instead, they are at the bottom, with Illinois having the worst bond ratings in the country and huge debts that it, along with the City of Chicago, cannot and will not ever be able to repay.\nLike the cartoons I used to watch as a little boy, where one starving character looks at another and sees a pork chop, the one-party, Democrat machine that runs Chicago and Illinois saw me and other productive citizens as ATMs.\nThere is no course-correction in liberalism. The answer to their failed economic policies is always to do more of what failed. “We didn’t go big enough! We should have spent more…” I could see the writing on the wall.\nNot only were they coming at me for more of my hard-earned money, which meant I had to spend more time working and less time with my family just to keep up, violence is exploding in Chicago. I paid some of the highest property taxes in the country, only to find we could enjoy less and less of what we were paying for because our beaches and shopping avenues were no longer safe. Why would I pay more just to get less?\nCapital goes where it’s wanted and stays where it is well treated. We extensively researched “no income tax” states and settled on Tennessee with its balanced budget. As Charles Dickens said in Great Expectations, money is indeed portable property. We fled Illinois one year ago and couldn’t be happier in Nashville. It has fantastic schools, great restaurants, wonderful people, and a booming economy.\nMy only regret is that we didn’t move here sooner. In fact, some — who would listen to me on the radio in Chicago — accused me of running away, of not staying in the fight in Illinois. Sometimes, discretion is the better part of valor. I watched as voters reelected the same corrupt politicians cycle after cycle, as if those who created the crisis would ever fix it. It was the definition of insanity.\nMy response to critics became, “At what point would you have told Tina it was okay to leave Ike?” It got laughs, sure, but more importantly it got the point across. Move is a four-letter word, but I thank God we had a place to move to.\nNR: Last question: if you could pick any gun to have, what’s your favorite gun?\nBT: What a terrible thing to ask. It’s like asking a parent to choose their favorite child. LOL.\nI own lots of firearms, and I own them for lots of different reasons. My favorite, though, is always the one I don’t have yet, but am in pursuit of.\nRight now, that would be a WWII era, .45 ACP single-shot “Liberator” pistol. There’s an interesting history surrounding this weapon and I’m enamored by the original notion of air-dropping these into occupied territory so that civilians could use them to kill Axis soldiers and commandeer their weapons.\nI am a fan of seeing good people win — whether in war, or in popular culture, which is a very important war of its own.\n(You can grab your copy of Code of Conduct here.)","url":"https://spectator.org/63365_staying-fight-interview-brad-thor/"}
