{"authors":[],"date_download":"2018-10-22 21:45:27","date_modify":"2018-10-22 21:45:27","date_publish":"2014-06-05 19:40:33","description":"The U.S. economy created 217,000 jobs in May and the unemployment rate is at 6.3 percent, the government said on Friday.","filename":"data/vaneerConsumption/SteadyasSheGoesEconomyKeepsPaceJoblessRateat63.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/better_careers_steady-she-goes-economy-keeps-pace-jobless-rate-6-3-n123866_1540244727.html","title":"Steady as She Goes: Economy Keeps Pace, Jobless Rate at 6.3%","title_page":"Steady as She Goes: Economy Keeps Pace, Jobless Rate at 6.3%","title_rss":"NULL","source_domain":"nbcnews.com","text":"Get the Better newsletter.\nThe U.S. economy created 217,000 jobs last month -- slightly fewer than expected -- as the unemployment rate held steady at 6.3 percent, according to numbers released Friday by the Bureau of Labor Statistics.\nThe markets liked the news and stocks rose, with the Dow Jones Industrial Average and the S&P 500 continuing to climb to record highs.\nMost of the job gains came as wages rose modestly, increasing 5 cents an hour to maintain the modest 2.1 percent growth over the past 12 months, the so-called nonfarms payroll report said. Average hours worked came in flat at 34.5.\nEconomists surveyed by Reuters had expected 218,000 jobs to be created last month, down from April's upwardly revised 288,000 addition. The unemployment rate had been expected to rise to 6.4 percent.\nA broader measure of joblessness that includes those working part-time for economic reasons and those who have quit looking remained elevated at 12.2 percent, though that was a low for the year.\nOver the past 12 months, the U.S. economy has averaged 197,000 new jobs per month.\n\"There does seem to be upshift in the nonfarm payrolls higher to a plus-200,000 number, which is good,\" Mike Materasso, co-chair of the Franklin Templeton Fixed Income Policy Committee, said in an interview. \"You have an economy that is doing better and probably growing above trend.\"\nMarket reaction to the report was muted, with stock market indexes edging higher and interest rates nudging lower.\nTaken together, the numbers seem unlikely to change Federal Reserve policy as the U.S. central bank unwinds its monthly bond-buying program while keeping short-term interest rates near zero.\nMaterasso said the report was \"definitely not a needle-mover\" in terms of Fed policy, though he does expect the Open Market Committee's tone on the economy to improve over the course of the year and ultimately push bond yields higher.\nIndeed, the internals of the report showed that while actual job growth continues in line with trends, there remains weakness in terms of job quality and other metrics.\nProfessional and business services along with health led the way in May, with both sectors creating 55,000 new jobs. Hospitality—primarily bars and restaurants—grew by 32,000.\nManufacturing and construction, by contrast, were about flat. Labor force participation, a key metric whose sharp decline has played a major role in the falling unemployment rate, remained flat at 62.8 percent, matching the worst level since March 1978.\nBreaking down the numbers, 145,000 more people were employed, while 46,000 more were unemployed. Long-term unemployment remains a problem, though the average duration of joblessness fell to 34.5 weeks, the lowest level November 2010.\n-- CNBC.com","url":"https://www.nbcnews.com/better/careers/steady-she-goes-economy-keeps-pace-jobless-rate-6-3-n123866"}
