{"authors":["Clemence Michallon For Dailymail.Com"],"date_download":"2018-10-23 04:44:48","date_modify":"2018-10-23 04:44:48","date_publish":"2017-03-16 15:54:40","description":"Ava Tarantino (right), of Waukesha, Wisconsin, loves the Steelers, especially running back Le'Veon Bell (left).She dared him to be her prom date if she could get 500 retweets - and got 2,000.","filename":"data/vaneerConsumption/SteelersfanwinsapromdatewithherfavoriteNFLplayer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55239700000578-0-image-a-63_1489678095369.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320574_Steelers-fan-wins-prom-date-favorite-NFL-player_1540269888.html","title":"Steelers fan wins a prom date with her favorite NFL player","title_page":"Steelers fan wins a prom date with her favorite NFL player | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teenage girl has won a prom date with her favorite NFL player thanks to a Twitter challenge she started herself - and he wants to make good on his promise.\nAva Tarantino, of Waukesha, Wisconsin, loves the Pittsburgh Steelers, but is particularly fond of the team's running back, 25-year-old Le'Veon Bell.\nLast week, Ava dared him to go to her high school prom with her if she could get more than 500 retweets on one message. Le'Veon said he'd do it for 600 - not that the difference mattered, since Ava's tweet has now been shared more than 2,000 times.\nBig fan: Ava Tarantino, of Waukesha, Wisconsin, loves the Pittsburgh Steelers, especially their running back Le'Veon Bell. She is pictured enjoying mashed potatoes during a game\nSmart: The teen started her own Twitter challenge in a bid to get Le'Veon (pictured) to come with her to her high school prom dance in May\nLe'Veon, who was drafted by the Steelers four years ago, tweeted back: 'Welllll, a deal is a deal......see youu at your prom.'\nThe running back intends to bring his mother to the dance as well as his own girlfriend, who will be doing Ava's makeup, WISN reported.\nAva has been over the moon ever since his response came in.\n'I feel like I'm on top of the world,' she told the station . 'It's been my dream since freshman year, and it's like starting to come true. It doesn't seem real.'\nBut in order for her dream to come true, Ava needs one more thing: her school's permission.\nNumbers matter: Ava challenged Le'Veon, who was drafted by the Steelers four years ago, to be her prom date if she managed to get 500 retweets on one message\nBargaining: The running back actually replied to Ava's message and said he'd do it if she could get her original tweet to be shared 600 times\nShe won: The 100-retweet difference ended up not mattering at all, since Ava's message got shared more than 2,000 times. Le'Veon told her he intends to honor the deal\nWaukesha West High School, which she attends, has a strict age limit for prom dates. They cannot be more than 19 years old.\nThe rule is there to preserve the 'safety and appropriateness' of the dance, and 'has been in place for decades with no exceptions', a school district spokesperson said.\nBut Ava, whose father is also a Steelers' fan and who has visited Pittsburgh on each of her birthdays since she turned 4, hasn't given up on her dream prom.\nShe has filed a request asking the school's administration to make an exception and allow her to bring the NFL star as her prom date during the dance in May.\nThe district is actually considering it and is reviewing her request. Meanwhile, Ava still can't believe her luck.\n'I think it's pretty special and cool that I get to go to prom with my favorite football player,' she said. 'Not many people get to say that.'","url":"https://www.dailymail.co.uk/femail/article-4320574/Steelers-fan-wins-prom-date-favorite-NFL-player.html"}
