{"authors":["Caroline May"],"date_download":"2018-10-30 22:15:30","date_modify":"2018-10-30 22:15:30","date_publish":"2015-09-01 17:48:23","description":"Steinle family will file the suit Tuesday and it will name San Francisco Sheriff Ross Mirkarimi, ICE and the U.S. Bureau of Land Management.","filename":"data/vaneerConsumption/SteinleFamilyToFileLawsuitAgainstSFFedOfficials.json","image_url":"https://media.breitbart.com/media/2015/07/kathryn-steinle.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_01__1540937730.html","title":"Steinle Family To File Lawsuit Against SF, Fed Officials","title_page":"Steinle Family To File Lawsuit Against SF, Fed Officials | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The family of Kathryn Steinle — the woman whose shooting death sparked a national outcry over illegal immigrant crime — is filing a lawsuit against local and federal officials over her murder, according to reports.\nSteinle family is slated to file the suit Tuesday and it will name San Francisco Sheriff Ross Mirkarimi, Immigration and Customs Enforcement (ICE) and the U.S. Bureau of Land Management, according to ABC7 News.\nThe sheriff’s department released alleged killer Juan Francisco Lopez-Sanchez from custody less than three months before Steinle was shot, ignoring an immigration detainer ICE had lodged against him. Sanchez is a seven-time convicted felon who had been deported from the U.S. five times. San Francisco’s sanctuary city policies have been blamed for the release.\nThe gun that was used to shoot Steinle was a BLM gun that the agency says was stolen from an agent’s car.\nSpeaking to ABC7 News, Steinle’s mother, Liz Sullivan said the release of violent illegal immigrants must stop.\n“It’s something that needs to end. We don’t need them here, not violent felons,” she said. “They’re violent felons and they’re illegal, enough said. It’s too late for us, that ship has sailed but we want it for future, possible victims. We’ve got to put an end to it.”\nDespite the Steinle family’s calls for change, Mirkarimi has stood firm in his decision to ignore ICE detainers and, according to ABC7 News continues to refuse ICE detainer requests.\n“Federal courts have actually held that detaining someone for ICE is unconstitutional, it’s unlawful,” sheriff’s office attorney Mark Nicco told ABC7.\nSteinle was shot and killed while walking with her father at San Francisco’s Pier 14 on July 1.\n“Sometimes we’re together and then sometimes we’re falling apart at the seams,” Sullivan told ABC7.\nSteinle’s murder has inspired legislation aimed at cracking down on sanctuary cities and deported illegal immigrants who re-enter the U.S.\nLast month the House passed one such bill that would block jurisdictions with sanctuary policies from receiving certain law enforcement grants. It has also become a topic of debate in the 2016 presidential election, with top candidates weighing in on the policies that may or may not have contributed.","url":"https://www.breitbart.com/politics/2015/09/01/steinle-family-to-file-lawsuit-against-sf-fed-officials/"}
