{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 04:26:05","date_modify":"2018-10-23 04:26:05","date_publish":"2016-01-28 20:33:03","description":"She never fails to add a touch of class to the red carpet. And Stephanie Pratt lived up to her fashionable reputation at the Concussion film screening on Thursday in a neon crop top.","filename":"data/vaneerConsumption/StephaniePrattcutsanelegantfigureinfloralsatstarstuddedfilmscreening.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD48D900000578-0-image-a-60_1454013293010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421627_Stephanie-Pratt-flaunts-toned-abs-neon-crop-cuts-elegant-figure-florals-star-studded-film-screening_1540268765.html","title":"Stephanie Pratt cuts an elegant figure in florals at star-studded film screening","title_page":"Stephanie Pratt cuts an elegant figure in florals at star-studded film screening | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She never fails to add a touch of class to the red carpet.\nAnd Stephanie Pratt lived up to her fashionable reputation at the Concussion film screening on Thursday, injecting a splash of colour to the evening with a neon pink crop top.\nBeaming as she made her way into The Ham Yard hotel, the 29-year-old's smile seemed to be infectious as she chatted with her fellow celebrity guests.\nHello petal! Stephanie Pratt lived up to her fashionable reputation at the Concussion film screening on Thursday, injecting a splash of colour to the evening with a neon pink crop top\nFlashing a hint of her toned abs in the halter top, she added to the brightness of her flirty ensemble in a rose printed navy midi skirt.\nKeeping with her colour scheme, she added some height to her petite frame in a pair of navy strappy heels.\nWith her honey coloured locks styled in a centre parting, the Made In Chelsea star brushed the bouncy waves behind one shoulder, exposing her pretty face.\nFlower power! Flashing a hint of her toned abs in the halter top, she added to the brightness of her flirty ensemble in a rose printed navy midi skirt\nWell heeled! Keeping with her colour scheme, she added some height to her petite frame in a pair of towering high navy strappy heels\nKeeping her make-up simple, Stephanie brought attention to her sparkling blue eyes with a flick of mascara, whilst lashings of pink gloss covered her plump pout.\nContoured to perfection, the pretty star used expertly placed sweeps of highlighter and blusher to give herself a healthy, rosy glow.\nKeeping her accessories to a minimum, Stephanie opted for a smattering of silver rings that dazzled under the lights.\nHappy days: Will Smith - who was controversially snubbed by the Oscars for his role in the medical drama - seemed to be in good spirits as he met with fans outside his Soho-based hotel on the day of the screening\nFamous friends: Keeping with her colour scheme, she added some height in a pair of navy strapped heels. Once in the venue, she rubbed shoulders with the likes of her Made In Chelsea co-star Jamie Laing\nThumbs up! Jamie seemed to be in particularly good spirits on the red carpet, pulling funny faces and poses\nDapper: Jamie cut a dapper figure in a floral bomber jacket that he teamed with black skinny jeans and brown ankle boots, accessorising with layered up jewellery\nKeeping it in the family! Jack Whitehall attended the screening with his well turned out father Michael\nHere come the boys! Jack opted for a more low-key look, donning a jumper and jeans for the film screening whilst Kriss Akabusi donned a fitted black suit\nOnce in the venue, the blonde beauty rubbed shoulders with the likes of her Made In Chelsea co-star Jamie Laing and Jack Whitehall, who seemed eager to catch the Will Smith flick.\nThe biographical film - which earned Will a Golden Globe nomination - sees him take on the role of pathologist Dr. Bennet Omalu, who uncovers the full extent of brain damage that can occur in sports players who repeatedly suffer from concussion.\nMeanwhile, the leading man himself - who was controversially snubbed by the Oscars for his role in the medical drama - seemed to be in good spirits on the day as he met with fans outside his Soho-based hotel.\nSporting chance! Fulham FC players Tom Cairney (left) and Matt Smith turned out to watch the film\nQuick to the punch! No doubt keen to hear about the effects of multiple concussions, professional boxer Anthony Ogogo cut a dapper figure on the red carpet alongside Charlie Webster\nGoal! Female footballer Eniola Aluko put on a stylish display in a faux fur gilet and floral shirt on the night\nDenim darlings: Sky Sports presenter Olivia Wayne put on a stylish display in a black blazer and rolled up jeans, whilst Hayley McQueen injected a touch of glamour in a star printed black shirt\nThe 47-year-old recently announced he would not be attending this year's Academy Awards out of loyalty to his wife, Jada, who was boycotting the ceremony on account of the lack of ethnic minorities nominated for a gong.\nSpeaking on Good Morning America he said he had to 'protect and fight for ideals that make our country and make our Hollywood community great, so when I look at the series of nominations of the Academy, it's not reflecting that beauty.'\nWhilst he acknowledged his two Oscar nominations in 2001 and 2006, he added that he thought it was interesting that on both occasions he 'never lost to a white person'.\nHe said: 'When I see this list and series of nominations that come out, everybody is fantastic and t hat's the complexity of this issue, everyone is very beautiful and deserving and it's fantastic, but it feels like it's going in the wrong direction.'\nLondon style: Will cut a dapper figure as he made his way out of his hotel in a tailored suit and cosy coat\nDr Smith: The biographical film - which earned Will a Golden Globe nomination - sees him take on the role of pathologist Dr. Bennet Omalu, who uncovers the full extent of brain damage after concussion\nNight in: The 47-year-old recently announced he would not be attending this year's Academy Awards out of loyalty to his wife, Jada, who is boycotting the ceremony on account of the lack of ethnic minorities nominated\nSnubbed: There was widespread outrage when Will did not receive an Oscar nomination for his role, despite receiving a nod at the Golden Globes","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421627/Stephanie-Pratt-flaunts-toned-abs-neon-crop-cuts-elegant-figure-florals-star-studded-film-screening.html"}
