{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-23 01:34:32","date_modify":"2018-10-23 01:34:32","date_publish":"2016-01-11 12:40:13","description":"Speaking to scientists in Stockholm in August, Professor Hawking teased the theory when he said black holes may not be so black after all. He has now published a paper explaining the theory.","filename":"data/vaneerConsumption/StephenHawkingexplainshowinformationescapesfromblackholes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3007BD8100000578-0-image-a-28_1452516122827.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393660_Black-hole-mystery-solved-Stephen-Hawking-claims-soft-electric-hair-explain-information-escapes-abyss_1540258472.html","title":"Stephen Hawking explains how information escapes from black holes","title_page":"Stephen Hawking explains how information escapes from black holes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Just when you thought the world of black holes couldn't get any more bizarre, Professor Hawking has claimed the destructive chasms may contain coatings of what he has called 'soft electric hair'.\nLast year, the physicist revealed black holes were not the 'eternal prisons' many think them to be, and it is possible for data to escape from the abyss.\nThe 74-year-old has now expanded this theory in a recently published scientific paper, and said the answer lies in the zero-energy particles, or 'soft hair', that sit on the black hole's horizon.\nScroll down for video\nLast year, Stephen Hawking revealed black holes were not the 'eternal prisons' many think them to be, and it is possible for data to escape from the abyss. The 74-year-old has now expanded this theory in a recently published paper, and said the answer lies in particles, or 'soft hair', that sit on the black hole's horizon\nThe long-awaited theoretical calculations behind the theory have been published in the paper 'Soft hair on black holes', on arXiv.\nThe paper seeks to tighten up the rules regarding how information can escape from the clutches of oblivion by providing 'concrete tools' to address what's known as the 'information paradox'.\nSpeaking to scientists in Stockholm in August, Professor Hawking teased the theory when he explained that black holes may not be so black after all.\nHe challenged the assumption that anything sucked into the massive objects is lost forever.\nIn particular, the theoretical physicist claimed to have discovered a mechanism 'by which information is returned out of the black hole.'\nSTEPHEN HAWKING AND GREY 'BLACK' HOLES The information paradox has fascinated Stephen Hawking and others for decades. In the 1970s, he proposed black holes are capable of radiating particles and that the energy lost through this process would cause the black holes to shrink and eventually disappear. Last year, he revised his theory by declaring black holes were in fact 'grey'. The grey hole theory allows matter and energy to be held for a period of time before being released back into space. He said the idea of an event horizon, from which light can't escape, is flawed and suggested instead that light rays attempting to rush away from the black hole's core are held as though stuck on a treadmill and that they could slowly shrink by spewing out radiation. He has now built-on and tweaked the idea with his latest theory, with physicists Malcolm Perry and Andrew Strominger. Professor Strominger compared the 'soft hair' - zero energy particles on the black hole's horizon - to a recording device, which captures and stores the information stripped from particles as they fall into a black hole.\nIn fact, his theory suggested information lost in black holes could even be stored in alternative universes.\nDuring his presentation, Professor Hawking talked about finding a solution to what happens to the information about the physical state of things that are swallowed up by black holes.\nThe laws of quantum mechanics demand that it should be retrievable, but that presents a paradox for our current understanding of black holes.\n'This has been an outstanding problem in theoretical physics for the last 40 years...no satisfactory resolution has been advanced,' Professor Hawking said.\n'I propose that the information is stored not in the interior of the black hole as one might expect, but on its boundary - the event horizon.'\nThis is the 'casing' of a black hole and the point at which matter is drawn into its 'centre'.\nProfessor Hawking explained: 'The answer I propose is that the information is stored in a super translation of the horizon that the in-going particles caused.\n'The information about in-going particles is returned, but in a chaotic and useless form...for all practical purposes the information is lost.'\nThe theoretical physicist likened the return of information to a burned encyclopedia, where information wouldn't technically be lost, but would be incredibly hard to decipher.\nInstead, a 'translation of the scrambled information' would create a 'hologram' of original particles, and the radiation leaving the black hole would carry some of the information stored on the event horizon with it.\nThe scientific paper detailing his theory now expands on this.\nThe laws of quantum mechanics demand that any information that falls into a black hole should be retrievable, but our knowledge of how the holes behave suggests it would be lost forever. This creates what's known as the 'information paradox' - a mystery that has baffled physicists for 40 years\nLast year, Professor Hawking (pictured) told scientists in Stockholm: 'I propose that the information is stored not in the interior of the black hole as one might expect, but on its boundary, the event horizon.' This may be in the form of 'soft hair' particles that capture data in a similar way to how nose hairs catch dust\nIt states that the particles that sit on the event horizon would consist of photons and gravitons, which are subatomic packets of light and gravitational energy.\nThese very low, or even zero-energy, quantum particles deposited on the edge of the black hole, can capture and store information stripped from the particles falling into the black hole.\nThis effectively means that while the particles falling into the black hole may be gone, their information continues to linger at the edge of oblivion in this 'soft hair' of quantum particles.\nThis has been likened to the way nose hairs catch dust, for example.\nAccording to the hologram theory, these particles are 'pixels' in the hologram which store the information.\nIn an interview with Scientific American, one of the co-authors and a theoretical physicist at Harvard University, Professor Andrew Strominger said: 'We show that when a particle goes in, it adds a soft photon to the black hole. So it adds hair to the black hole.\n'And more generally if particle goes in - because all particles carry mass and are coupled to gravity- they always add a soft graviton. So there’s a kind of recording device.\n'These soft photons and gravitons record information about what went into the black hole- infinitely more information than we previously believed is recorded by this mechanism.'\n'The existence of alternative histories with black holes suggests this might be possible,' Professor Hawking added.\nHe said the hole would need to be large and if it was rotating it might have a passage to another universe.\n'But you couldn't come back to our universe. So although I'm keen on space flight, I'm not going to try that,' he quipped.\nHowever, despite these new calculations, a full understanding of exactly how the holographic plate might work may still be some way off.\nThe authors wrote: 'A complete description of the holographic plate and resolution of the information paradox remains an open challenge, which we have presented new and concrete tools to address.'","url":"https://www.dailymail.co.uk/sciencetech/article-3393660/Black-hole-mystery-solved-Stephen-Hawking-claims-soft-electric-hair-explain-information-escapes-abyss.html"}
