{"authors":["Jason Chester For Daily Mail Australia"],"date_download":"2018-10-22 21:15:08","date_modify":"2018-10-22 21:15:08","date_publish":"2016-01-11 00:33:18","description":"In what proved to be a classic case of over-sharing the Olympic swimmer didn't hold back in her praise for long-term coach and close friend.","filename":"data/vaneerConsumption/StephanieRicestepsoutfordinnerwithcoachMichaelBohl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001CCD500000578-0-image-a-15_1452475169074.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393115_Stephanie-Rice-shares-social-media-steps-dinner-coach-Michael-Bohl_1540242908.html","title":"Stephanie Rice steps out for dinner with coach Michael Bohl","title_page":"Stephanie Rice steps out for dinner with coach Michael Bohl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stephanie Rice has paid tribute to her manager in a gushing post shared across social media on Sunday evening.\nIn what proved to be a classic case of over-sharing, the Olympic swimmer didn't hold back in her praise for long-term coach and close friend Michael Bohl as she stepped out for a bite to eat.\nPosting a cheerful snap of herself in an elegant beige dress, she wrote: 'Heading out to dinner with my #1 man. Bohly.\nScroll down for video\nHigh praise: Stephanie Rice captioned a recent snap of herself stepping out to dinner with a gushing tribute to her coach Michael Bohl\nMy best interests at heart: In what proved to be a classic case of over-sharing, the Olympic swimmer didn't hold back in her praise for long-term coach and close friend Michael Bohl as she stepped out for a bite to eat\n'As a woman, I am so grateful to have an older man in my life that loves and supports me and always has my best interests at heart in a non-sexual way.\n'I can & do talk to him about absolutely everything and he knows me better than any other person in my life. Our catch ups are so incredibly rewarding and fulfilling and I'm sure this one will be no different.'\nThe post elicited a mixed response from her followers across social media, with one fan commenting: 'Too much information??'\nHer rock: The gold medallist has previously credited Bohl for being a supportive presence in her personal and professional life\nElsewhere another follower praised the swimmer, writing: 'That's awesome Steph. I had someone in my life like that until a couple of years ago. We both had safe & fulfilling relationships with our respective partners but we \"clicked\" on a certain level without it ever getting awkward or beyond plutonic.\n'She inspired me and I've advanced my career accordingly and I motivated / encouraged her to get her business ideas off the ground. I know exactly what you're saying and hope yours lasts a lifetime. Good work.'\nThe gold medallist has previously credited Bohl for being a supportive presence in her personal and professional life.\nClose: Stephanie and coach Bohl have worked together throughout her career\n'He is so much more than just a coach to me. I am so thankful to have worked with him for so long,' she told the Daily Telegraph in 2012.\n'He has really developed me, been open to the change and he is a great listener. There have been a lot of things I have gone through - not only with training but outside of the pool - and he has always been the person I can talk to so openly.'\nIn 2014 Bohl, a Head Coach with St Peters Western Swim Club (SPW) who also trains swimmer Emma McKeon - praised the athlete following her retirement from competitive swimming.\n'When Steph had a big meet to prepare for, like the Olympic Games, she left no stone unturned,' he told Swimming Australia.\n'She really understood the need to prepare at a high level, to perform at a high level, and you could always depend on Steph to deliver at the major meets.'\nHe added: 'It’s disappointing that she had to overcome a number of injuries late in her career, because she really loved to compete and compete at her best.'\nMentor: In 2014 Bohl, a Head Coach with St Peters Western Swim Club (SPW) who also trains swimmer Emma McKeon - praised the athlete following her retirement from competitive swimming","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393115/Stephanie-Rice-shares-social-media-steps-dinner-coach-Michael-Bohl.html"}
