{"authors":["Trent Baker"],"date_download":"2018-10-30 21:32:05","date_modify":"2018-10-30 21:32:05","date_publish":"2015-09-17 16:51:33","description":"Stephen A. Smith: Richard Sherman Right on Black-on-Black Violence, Obama Should Speak Out","filename":"data/vaneerConsumption/StephenASmithRichardShermanRightonBlackonBlackViolenceObamaShouldSpeakOut.json","image_url":"https://media.breitbart.com/media/2015/09/SAS.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_09_17__1540935125.html","title":"Stephen A. Smith: Richard Sherman Right on Black-on-Black Violence, Obama Should Speak Out","title_page":"Stephen A. Smith: Richard Sherman Right on Black-on-Black Violence, Obama Should Speak Out | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ESPN2’s Stephen A. Smith reacted on Thursday’s “First Take” to Seattle Seahawks cornerback Richard Sherman’s comments on “Black Lives Matter,’ agreeing with Sherman that if black lives matter, black-on-black violence needs to end and Smith took it a step further by calling for President Obama to speak up more about the black-on-black violence, especially in Chicago, which happens to be in the state where Obama served as a senator.\nSmith explained that he did not hear “black lives matter” “when black folks were getting murdered in the streets of Chicago by other black folks,” and while he loves Obama “dearly,” he has an issue with Obama for not speaking up enough about the black-on-black crime there, even though “the system has black folks behind the eight ball.”\n“What I did say that offended folks was that I didn’t hear ‘black lives matter’ when black folks were getting murdered in the streets of Chicago by black folks. I didn’t hear that when black folks was losing lives by the hands of other black folks in Baltimore and that’s just those two cities. To be quite honest with you, one of the issues I have with our president, who I love dearly, is the fact I think he hasn’t spoken up enough about Chicago, which is where he’s a junior senator from. That’s the only thing I would say about that.”\n“Richard Sherman is absolutely right,” Smith continued. “As a black man, it is disgusting and disgraceful to see the lives of black people that are lost at the hands of other black folk. Yes, there is racism. Those problems have — the prejudices that exist, you know, the problems economically and what have you at the hands of a system that clearly, clearly has black folks behind the eight ball. All those things are true.”\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2015/09/17/stephen-a-smith-richard-sherman-right-on-black-on-black-violence-obama-should-speak-out/"}
