{"authors":["Keith Griffith For Dailymail.Com"],"date_download":"2018-10-22 23:08:17","date_modify":"2018-10-22 23:08:17","date_publish":"2017-03-16 05:58:21","description":"Stephen Colbert (right) mocked MSNBC host Rachel Maddow (left) on Wednesday, a day after the cable news presenter revealed information from President Donald Trump's 2005 tax returns.","filename":"data/vaneerConsumption/StephenColbertroastsRachelMaddowoverTrumptaxeshype.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E521EDE00000578-0-image-a-9_1489643406776.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318934_Stephen-Colbert-roasts-Rachel-Maddow-Trump-taxes-hype_1540249697.html","title":"Stephen Colbert roasts Rachel Maddow over Trump taxes hype","title_page":"Stephen Colbert roasts Rachel Maddow over Trump taxes hype | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The late shows had their round at MSNBC host Rachel Maddow on Wednesday, one day after the cable news presenter revealed information from President Donald Trump's 2005 tax returns on her own evening show.\nMaddow's report on the authenticated tax returns marked the most recent tax information available on Trump, who unlike every president for decades has refused to release his tax returns.\nThe return, sent anonymously to a journalist friend of Maddow's showed that Trump paid $38million in federal tax on $150million in income for 2005.\nDespite the substantive revelation, Maddow drew criticism from many quarters over her splashy, highly hyped presentation of the tax info, which followed several teaser tweets on Tuesday and a lengthy preamble once her show began.\nEven the brass at NBC News, the network cousin of Maddow's cable channel MSNBC, were reportedly peeved.\nScroll down for video\nRachel Maddow (left) had a legitimate scoop in her revelation of Trump's 2005 tax returns, but many, including Late Show host Stephen Colbert (right) have criticized her for over-hyping\nThe authenticated tax return revealed that Trump payed $38million in federal taxes in 2005\n'It’s their cable network, but it’s still NBC News. [NBC] did not appreciate being kept in the dark,' an inside source told Page Six.\nThe insider went on to say that NBC brass only found out about Maddow's scoop when she hyped it on Twitter in advance of the show.\nThe source went on to join criticism of Maddow for the lengthy monologue she delivered before finally revealing the relatively straightforward details in the 2005 return.\n'To hype such a big story and not really deliver is a bit embarrassing. Airing a story you’ve hyped 20 minutes into your broadcast makes it a lot less of a ‘breaking news’ story.'\nLate Show host Stephen Colbert joined the chorus of criticism on that point from his Wednesday show on rival network CBS.\n'I hold in my hand something very significant,' Colbert said in the bit parodying Maddow. 'A joke that we have confirmed has been heard by Donald Trump,' he continues, before delivering a meandering soliloquy to delay the punchline.\nMaddow took to NBC's own late-night show on Wednesday.\nTonight Show host Jimmy Fallon had the MSNBC presenter on his show for a valedictory lap, a hint that relations may not be so frosty between the network and its cable news cousin.\n'Was there a huge damning bombshell in these returns? No,' Maddow told Fallon. 'The bombshell is that some of his tax returns have been released.'\nMaddow obliquely justified the hype and preamble she delivered before revealing the returns.\n'Was there a huge damning bombshell in these returns? No,' Maddow told Tonight Show host Jimmy Fallon. 'The bombshell is that some of his tax returns have been released.'\n'It's like speaking to people in a desert, and we have one drop of water,' Maddow told the late show host on Wednesday\n'I think the reason people are so excited about it is that it's really weird that the President hasn't released his tax information.'\n'It's like speaking to people in a desert, and we have one drop of water.'\nThe 2005 tax returns, received from an anonymous source by Pulitzer Prize-winning journalist David Cay Johnston, came in the mail on Monday while Johnston was on assignment researching Trump's real estate deals in Florida, where he heard about them through one of his children, Maddow said.\nMaddow revealed that the White House did not confirm the returns' authenticity until 7pm on Tuesday, two hours before her show airs.\nAs a precaution, Maddow had produced an entire separate show that was ready to run in case the tax return story had to be sidelined over authenticity questions.\nMaddow, in an interview with Fallon that was shorter than her Tuesday preamble to reporting on the tax returns, restated her case for why Trump's tax history is of vital public interest.\n'You want to know if he might be acting as president with divided loyalties' due to financial entanglements, Maddow said.\n'That's why every president back to Watergate has done it,' she said of Trump's refusal to release his tax returns.\nThe first page of Donald Trump's tax return, which was leaked to David Cay Johnston","url":"https://www.dailymail.co.uk/news/article-4318934/Stephen-Colbert-roasts-Rachel-Maddow-Trump-taxes-hype.html"}
