{"authors":["Mary Kate Mcgrath"],"date_download":"2018-10-31 01:46:10","date_modify":"2018-10-31 01:46:10","date_publish":"2018-08-27 19:18:47","description":"Women's rights have become a conversation topic that isn't going anywhere — nor should it. And now, NBA star Stephen Curry is taking an official stand. On Sunday, Curry published a powerful letter about women's equality on The Players Tribune. The…","filename":"data/vaneerConsumption/StephenCurrysEssayAboutHisDaughtersTakesAStrongStanceOnWomensEquality.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/c1c252b4-46d3-4902-9c94-8dfdbc73f857-getty-813490130.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_stephen-currys-essay-about-his-daughters-takes-a-strong-stance-on-womens-equality-10250952_1540950370.html","title":"Stephen Curry's Essay About His Daughters Takes A Strong Stance On Women's Equality","title_page":"Stephen Curry's Essay About His Daughters Takes A Strong Stance On Women's Equality","title_rss":"NULL","source_domain":"bustle.com","text":"Women's rights have become a conversation topic that isn't going anywhere — nor should it. And now, NBA star Stephen Curry is taking an official stand. On Sunday, Curry published a powerful letter about women's equality on The Players Tribune. The post opened with Curry explaining how he'd been fortunate enough to be surrounded by women who are role models throughout his entire life, from his mother Sonya to his wife Ayesha.\nIn the essay, Curry explained how these women in his life have influenced his outlook. The athlete wrote,\n\"So for my whole life, really, I feel like I’ve been receiving this education on what it means to be a woman in America. And one lesson from that education that’s really stood out to me is: to always stay listening to women, to always stay believing in women, and, when it comes to anyone’s expectations for women, to always stay challenging the idea of what’s right.\"\nHowever, raising his daughters Riley and Ryan further changed his perspective and made the issue of gender inequality feel more urgent than ever. Curry continued,\n\"Riley and Ryan are growing up so fast. And with Ayesha and I suddenly seeing things through the eyes of these daughters of ours, who we brought into this world, and now are raising to live in this world, you know, I’d be lying if I didn’t admit that the idea of women’s equality has become a little more personal for me, lately, and a little more real.\"\nThe Currys have three children together — two daughters Riley, 6, and Ryan, 3, and a newborn son Canon, who they welcomed in July. Ayesha is a successful cookbook author, and she will also host the upcoming ABC reality series Family Food Fight. In the essay, Curry cites her career as setting an example for his daughters.\nHowever, he still worries about the obstacles his daughters may face in achieving their goals. \"I want our girls to grow up knowing that there are no boundaries that can be placed on their futures, period. I want them to grow up in a world where their gender does not feel like a rulebook for what they should think, or be, or do,\" he wrote. \"And I want them to grow up believing that they can dream big, and strive for careers where they’ll be treated fairly.\"\nHe also addressed the financial inequality in society, and the work that will be involved to close this gender wage gap. He wrote:\n\"I think it’s important that we all come together to figure out how we can make that possible, as soon as possible. Not just as 'fathers of daughters,' or for those sorts of reasons. And not just on Women’s Equality Day. Every day — that’s when we need to be working to close the pay gap in this country. Because every day is when the pay gap is affecting women. And every day is when the pay gap is sending the wrong message to women about who they are, and how they’re valued, and what they can or cannot become.\"\nThe Warriors star also opened up about the recent basketball camp for girls he hosted, and how he hopes it will help shift perspectives in the sport. Curry felt that there are a lot of assumptions about basketball being exclusive to boys, and he wants the world to get to a place where women are even more included and celebrated in the sport. He said, \"One thing we’ve always maintained about our camp, is that we want it to be world class. And in 2018? Here’s the truth: You’re not world class if you’re not actively about inclusion.\"\nCurry's essay makes a statement, whether advocating for women's role in the sport of basketball or their status in society. The athlete ended the article by urging others to take action and advocate for gender equality. By standing up for his beliefs in this essay, he's already helping pave the way for his daughters to pursue their dreams, just like their strong mom.","url":"https://www.bustle.com/p/stephen-currys-essay-about-his-daughters-takes-a-strong-stance-on-womens-equality-10250952"}
