{"authors":["Lani Seelinger"],"date_download":"2018-10-31 01:50:09","date_modify":"2018-10-31 01:50:09","date_publish":"2018-09-11 13:52:43","description":"The drive to find the writer of the anonymous New York Times op-ed, who claimed to be an official working against the president from within the White House, continues. The vice president has repeatedly denied being the person in question, even…","filename":"data/vaneerConsumption/StephenColbertGivesMikePenceALieDetectorTestInAHilariousFakeInterview.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/0f28c632-b9e4-4e5c-a275-b1f677e12308-screen-shot-2018-09-11-at-64843-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_stephen-colbert-gives-mike-pence-a-lie-detector-test-in-a-hilarious-fake-interview-11867649_1540950609.html","title":"Stephen Colbert Gives Mike Pence A Lie Detector Test In A Hilarious Fake Interview","title_page":"Stephen Colbert Gives Mike Pence A Lie Detector Test In A Hilarious Fake Interview","title_rss":"NULL","source_domain":"bustle.com","text":"The drive to find the writer of the anonymous New York Times op-ed, who claimed to be an official working against the president from within the White House, continues. The vice president has repeatedly denied being the person in question, even saying that he would take a lie detector test to prove it. Well, on Monday, Stephen Colbert gave Mike Pence the lie detector test during a fake interview — and in Colbert's vision of it, the test didn't go exactly how Pence might have imagined it.\n\"A lot of people have speculated that Pence is the mystery author,\" Colbert said in his opening segment, referring to the theory that Pence wrote the op-ed because it contains the word \"lodestar,\" an uncommon word that Pence has used fairly frequently in his writing and speeches. \"But he's willing to go to any length to prove that it wasn't him.\"\nColbert then showed a clip of Pence from his recent appearance on Fox News Sunday, in which he claimed that he would take a lie detector test to show that he didn't write the op-ed.\n\"I would agree to take [a lie detector test] in a heartbeat,\" Pence told Fox News Sunday host Chris Wallace.\nThe Late Show with Stephen Colbert on YouTube\n\"Well, actually, I had the chance to sit down with the vice president this weekend, and I asked him the same question,\" Colbert said — and then his \"interview\" with Pence began. The comedian hadn't actually scored an interview with the vice president — instead, he wove together clips of Pence's Fox News Sunday interview with clips of his own doing.\n\"Now if you don't mind me saying so, sir, you look stressed,\" Colbert said. \"What's the toughest part of your job?\"\n\"I spend about four hours a day with the president when we're both in Washington D.C. every day,\" Pence said, seemingly in answer to Colbert's question. Colbert then moved forward with setting up the lie detector test, of course with the vice president's approval.\n\"Do you think the Russians helped to elect President Trump?\" Colbert asked Pence.\n\"I think — look — this is a president that was elected by speaking directly to the American people and being candid,\" Pence stammered. As he made that statement, a video of a lie being detected appeared on screen.\n\"Now according to Bob Woodward's book, the Trump administration is experiencing a nervous breakdown,\" Colbert went on. \"Sir, is there chaos within the White House?\"\n\"It's absolutely absurd,\" Pence said, shaking his head. The video then cut to the lie detector, which had drawn a silhouette of the vice president with an elongated, Pinocchio-style nose.\nColbert then ended his clip with the vice president, and it seems as though that might end up being the only lie detector test that Pence gets subjected to over the op-ed. According to Politico, the White House announced that it would not carry out lie detector tests, even though President Trump asked his attorney general, Jeff Sessions, to turn his attention to sussing out the writer.\n“Frankly, the White House and the staff here are focused on doing our jobs,” White House Press Secretary Sarah Huckabee Sanders said, when asked about the potential lie detector test.","url":"https://www.bustle.com/p/stephen-colbert-gives-mike-pence-a-lie-detector-test-in-a-hilarious-fake-interview-11867649"}
