{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 05:27:37","date_modify":"2018-10-23 05:27:37","date_publish":"2016-01-28 21:24:28","description":"Lori Harvey, 19, is dating Memphis Depay, 21, the Dutch soccer star who started playing for Manchester United last summer, signing a four-year contract worth a reported $40million.","filename":"data/vaneerConsumption/SteveHarveysstepdaughterLoridatingManchesterUnitedsMemphisDepay.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD741100000578-0-image-a-29_1454016260861.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421543_Steve-Harvey-s-stepdaughter-Lori-19-dating-Dutch-soccer-star-Memphis-Depay-21-just-signed-40MILLION-contract-Manchester-United_1540272457.html","title":"Steve Harvey's stepdaughter Lori dating Manchester United's Memphis Depay","title_page":"Steve Harvey's stepdaughter Lori dating Manchester United's Memphis Depay | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The pair have been sharing photos of themselves in Paris alone and out with friends,\nIt seems that Miss Universe host Steve Harvey's stepdaughter has gone international to find her new boyfriend.\nLori Harvey, 19, is dating Memphis Depay, 21, the Dutch soccer star who started playing for Manchester United last summer, signing a four-year contract worth a reported $40million.\nIt is not clear how long Lori and Depay have been dating, but the two shared photos of themselves as they were in Paris celebrating Lori's birthday and while Lori and her mother Marjorie attended Haute Couture Week.\nScroll down for video\nRomance: Steve Harvey's stepdaughter Lori, 19, is dating Dutch soccer star Memphis Depay (above)\nHappy times: The pair have been sharing photos of themselves in Paris alone (left) and out with friends, including Lori's mom Marjorie (right)\nBank: Depay, 21, started playing for Manchester United last summer after signing a four-year contract worth a reported $40million\nThe two were seen embracing in front of the Eiffel Tower and out to dinner with friends in the pictures, and in another Lori shared a snap of an arrangement of flowers along with two large Fendi bags and three smaller ones, writing; 'Special Delivery #HappyBirthdayToMe.'\nShe did not say who the gift was from.\nAs for Depay, he was previously linked to Chris Brown's ex Karrueche Tran, but the two appear to have called it quits last year.\nClose: Lori's mother Marjorie married Steve in 2007 when she was 10-years-old, and the comedian has raised her as his own daughter since that time\nLucky: Lori shared a snap of an arrangement of flowers along with two large Fendi bags and three smaller ones on her birthday recently (above)\nLori's mother Marjorie married Steve in 2007 when she was 10-years-old, and the comedian has raised her as his own daughter since that time.\nIt was a difficult December for the funnyman after he misread the winner of the Miss Universe contest last month, a gaffe that he eventually fixed and which forced him to apologize to the woman he accidentally crowned.\nDuring the pageant on December 20, Miss Colombia was initially crowned the winner by Harvey, when he accidentally announced the runner-up's name first instead of the winner.\nA few seconds later he was forced to apologize, and say that he had made a mistake.\nThe crown was then taken off Arevalo's head and given to an equally confused and emotional Wurtzbach.","url":"https://www.dailymail.co.uk/news/article-3421543/Steve-Harvey-s-stepdaughter-Lori-19-dating-Dutch-soccer-star-Memphis-Depay-21-just-signed-40MILLION-contract-Manchester-United.html"}
