{"authors":["Press Association"],"date_download":"2018-10-23 01:43:18","date_modify":"2018-10-23 01:43:18","date_publish":"2017-03-16 11:54:44","description":"Australia captain Steve Smith responded to the controversy surrounding him since the second Test with India by making an unbeaten century on day one of the third Test in Ranchi.","filename":"data/vaneerConsumption/SteveSmithgivesAustraliastrongstartagainstIndia.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E538F9200000578-0-image-a-71_1489664608220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4319898_Steve-Smith-gives-Australia-strong-start-against-India_1540258998.html","title":"Steve Smith gives Australia strong start against India","title_page":"Steve Smith gives Australia strong start against India | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia captain Steve Smith responded to the controversy surrounding him since the second Test with India by making an unbeaten century on day one of the third Test in Ranchi.\nSmith's conduct was questioned by India skipper Virat Kohli after the former appeared to look to Australia's dressing room for advice over reviewing an lbw decision against him on the last day of the hosts' series-levelling win.\nThe International Cricket Council took no action against Smith but the two countries' boards nevertheless felt the need to meet to resolve the issue.\nAustralia captain Steve Smith salutes the pavilion after reaching his milestone on Thursday\nSmith took control of day one of the third Test to set the platform for a high first innings score\nSmith, who on the eve of this match criticised Kohli's comments, made good on his decision to bat first with 117 of 299 for four.\nIt was his 19th Test ton and second of the series, passing team-mate David Warner's 18 and matching the mark of Australia legends Mark Taylor and Mike Hussey.\nSmith shared an unbroken stand of 159 with Glenn Maxwell, whose 82 including two sixes comfortably beat his previous Test-best of 37.\nHe reached 5,000 runs and is the third visiting captain to score two or more centuries in India\nRavichandran Ashwin celebrates with team-mates the dismissal of Australia's Shaun Marsh\nIndia will resume their fight to end Australia's first innings after taking four wickets at stumps\nAt stumps Smith told Sky Sports 2: 'You can't control the past, that's gone. You've got to let that go as quickly as you can.\n'Obviously I came out and said 'I made a mistake' at the end of the last game and moved on from it. It was about focusing on this Test match in Ranchi.'\nSmith and Maxwell joined forces at 140 for four after most of the top order had failed to build on starts. Opener Matt Renshaw's 44 was the best score after the fifth-wicket pair's efforts.\nAustralia earlier handed paceman Pat Cummins a second Test cap, more than five years after his first, in place of the injured Mitchell Starc while India replaced out-of-form opening batsman Abhinav Mukund with Murali Vijay.","url":"https://www.dailymail.co.uk/sport/cricket/article-4319898/Steve-Smith-gives-Australia-strong-start-against-India.html"}
