{"authors":["Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-23 01:28:43","date_modify":"2018-10-23 01:28:43","date_publish":"2016-01-11 12:30:18","description":"Steven Seagal, an American actor known for his roles in action films, has become a Serbian citizen, state television in the European country announced on Monday","filename":"data/vaneerConsumption/StevenSeagalgrantedSerbiancitizenship.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BA41A00000578-0-image-a-4_1452526663778.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393803_American-action-hero-Steven-Seagal-gets-Serbian-citizenship_1540258123.html","title":"Steven Seagal granted Serbian citizenship","title_page":"Steven Seagal granted Serbian citizenship | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"American actor Steven Seagal has won Serbian citizenship\nAmerican action hero Steven Seagal has become a Serbian citizen.\nThe decision to grant Seagal citizenship was announced on Serbian state television on Monday after the veteran actor, producer, and martial artist made two recent visits to the country.\nSeagal has praised Serbia's populist leadership and said he feels like a Serb.\nDuring one visit, Seagal was offered to train Serbian special police forces in Aikido, a Japanese martial art that Seagal has practiced since he was a teenager.\nHis visits to Serbia were sponsored by a pro-Russian Serb group.\nThe 63-year-old actor debuted in the 1988 action film Above The Law and went on to star in several successful movies in the 1990s.\nFrom 2001 until 2010, when he returned to the big screen in Robert Rodriguez's Machete, Seagal appeared in direct-to-video films.\nSeagal is thought to be an acquaintance of Vladimir Putin and has been seen alongside the Russian leader on several occasions.\nIn this file photo, Russian leader Vladimir Putin shakes the hand of American actor Steven Seagal, who was granted Serbian citizenship on Monday\nSteven Seagal signs autographs in Moscow after receiving a star at the Moscow Alley of Glory in September 2015\nThe two share a love for marital arts, and seem to have some agreement on policy, as well.\nSeagal told the Russian state-run newspaper Rossiskaya Gazeta in March 2014 that he thinks Russia's annexation of Crimea from Ukraine was 'very reasonable,' according to the Moscow Times.\nHe went on to say that he considered Putin his 'brother,' and that he considered seeking Russian citizenship.\nSerbia is a candidate for European Union membership but has faced opposition from pro-Kremlin nationalists.","url":"https://www.dailymail.co.uk/news/article-3393803/American-action-hero-Steven-Seagal-gets-Serbian-citizenship.html"}
