{"authors":["Riley Morgan For Daily Mail Australia"],"date_download":"2018-10-22 23:26:43","date_modify":"2018-10-22 23:26:43","date_publish":"2017-03-10 03:05:19","description":"Steve Price was eliminated from I'm A Celebrity Get Me Out Of Here, but he admits he will return to Australia a changed man.","filename":"data/vaneerConsumption/StevePricerevealshisgreaterappreciationofMuslims.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F510B00000578-0-image-a-3_1489111677253.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299750_Steve-Price-reveals-greater-appreciation-Muslims_1540250803.html","title":"Steve Price reveals his greater appreciation of Muslims","title_page":"Steve Price reveals his greater appreciation of Muslims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Steve Price was voted out of Channel 10's I'm A Celebrity Get Me Out Of Here, but he admits he left the African jungle a changed man.\nThe often uncompromising journalist and broadcaster admitted he had a greater appreciation of the challenges facing Muslim Australians in society after his heart-to-heart chat with Nazeem Hussain.\nThe radio broadcaster said his chat with Nazeem Hussain, who revealed his family's fears after the 2014 Martin Place siege in Sydney, opened his eyes.\nSteve found himself at odds with a number of celebrities during his stay in Kruger National Park - but struck up a friendship with Nazeem Hussain\nBessies: Steve picked out Nazeem Hussain as the camp mate he became best friends with in camp, but said that Casey Donovan deserves to win\n'I certainly think I have a greater appreciation of the pressure Muslim Australians are under,' he told Fairfax after leaving the jungle.\n'He [Nazeem] told me a very touching story about his sister after the Lindt Cafe Siege. She's a lawyer, and called him up and said I don't think I can wear my hijab home on the train.\n'I think they [Muslims] are under threat. I don't think I ever quite understood.'\nSteve Price and Nazeem Hussain struck up a friendship in the jungle\nMr Price said while he has not jumped onto the 'leftie' train he claimed he has learned to be more tolerant and understanding of other people's opinion.\n'My one message out of all this is no matter how old you are and how set you are in your ways, you can change.'\nSteve Price is hoping the 'remarkable' Casey Donovan will win.","url":"https://www.dailymail.co.uk/news/article-4299750/Steve-Price-reveals-greater-appreciation-Muslims.html"}
