{"authors":["Alex Michael For Daily Mail Australia"],"date_download":"2018-10-23 05:53:18","date_modify":"2018-10-23 05:53:18","date_publish":"2017-03-10 15:28:37","description":"Shock jock Steve Price and male model Kris Smith may be polar opposites when it comes to occupation and personality, the pair have managed to form a unique bond on I'm A Celebrity","filename":"data/vaneerConsumption/StevePriceonbromancewithImACelebritysKrisSmith.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23794C00000578-0-image-a-38_1489158445683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301406_Steve-Price-wants-turn-Kris-Smith_1540273998.html","title":"Steve Price on bromance with I'm A Celebrity's Kris Smith","title_page":"Steve Price on bromance with I'm A Celebrity's Kris Smith | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celebrities from all walks of life come together each year to compete on I'm A Celebrity... Get Me Out Of Here!\nAnd while shock jock Steve Price and male model Kris Smith may be polar opposites when it comes to occupation and personality, the pair have managed to form a unique bond during their time in the jungle.\nSpeaking with Now To Love, 62-year-old Steve spoke of his bromance with his hunky cast-mate pal, revealing the model has asked him out on 'power walks' and even offered to become his personal trainer.\nDynamic duo! Steve Price hinted at a bromance with I'm A Celebrity...Get Me Out Of Here! Cast mate Kris Smith, revealing the model had offered to be his personal trainer\nOpening up about how he's going to maintain his very impressive 10kg weight loss on the show, the AM radio shock-jock was quick to single out one of his special 'advisers'.\n'Do you think I can turn myself into a Kris Smith?' he pondered.\n'I just need to do a few weights'.\nShowing no intention of stopping there, the personality's tongue-in-cheek admiration of his friend continued.\nComing soon, Kris Smith 2.0: 'Do you think I can turn myself into a Kris Smith?' the 62-year-old pondered in a recent interview. 'I just need to do a few weights,' he added\n'He’s offered to become my own personal trainer and take me on power walks and runs and put me through the weights,' Steve boasted.\n'Why wouldn’t I take up that offer? I could be strutting the stage, he says I can become a mature-age model for Lowes'.\nThe cheeky regular panelist on The Project appeared to be on a roll as he was allowed to continue his routine.\n'I’m going to get a sponsorship with Lowes and Kris has shown me a few moves from the catwalk and how to look vacantly into the distance,' he revealed.\nBelle of the ball: 'He's offered take me on power walks and runs and put me through the weights,' Steve joked\nBromance: 'Kris has shown me a few moves from the catwalk and how to look vacantly into the distance,' he added\nThe once-hardened conservative appeared to have been softened in his interview with the publication.\n'I will be a much more forgiving person. I’m going to see other people’s side to the argument a little more willingly,' he said of his transformation.\nThe 'unguarded' personality also revealed he'd made a promise to The Project cast mate Carrie Bickmore and her son Ollie that he would try and raise as much of the $100,000 he missed out on raising for their Beanies 4 Brain Cancer foundation.\nSoftened? The usually hardened radio shock-jock appeared to have been softened in his interview\nNot giving up: The 'unguarded' personality also revealed he'd made a promise to The Project cast mate Carrie Bickmore and her son Ollie that he would still try and raise the $100,000 for Carrie's Beanies 4 Brain Cancer foundaiton\nAnd as for who the star wanted to win the show? Casey Donovan.\n'I think she’d be a wonderful queen of the jungle and we need a woman to finally win this show,' he stated.\nMeanwhile, if you see a hunky model and his 62-year-old doppelganger power-walking past at the local park, rest easy knowing the shock-jock and his mate had come good on their promise.\nAnd the winner is! And as for who the star wanted to win the show? Casey Donovan: 'I think she’d be a wonderful queen of the jungle and we need a woman to finally win this show,' he stated","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301406/Steve-Price-wants-turn-Kris-Smith.html"}
