{"authors":["Tony Lee"],"date_download":"2018-10-30 18:05:22","date_modify":"2018-10-30 18:05:22","date_publish":"2014-09-17 04:18:00","description":"A GOP lobbyist who has been advising House Majority Whip Steve Scalise (R-LA) is urging Republicans to pass comprehensive amnesty legislation","filename":"data/vaneerConsumption/SteveScaliseLobbyistAdviserGOPMustPassAmnestyProntoAfterMidterms.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Immigration/deferred-action-for-all-now-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_09_16__1540922722.html","title":"Steve Scalise Lobbyist Adviser: GOP Must Pass Amnesty 'Pronto' After Midterms","title_page":"Steve Scalise Lobbyist Adviser: GOP Must Pass Amnesty 'Pronto' After Midterms | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A GOP lobbyist who has been advising House Majority Whip Steve Scalise (R-LA) is urging Republicans to pass comprehensive amnesty legislation “pronto” if they gain control of Congress after the midterms.\nEven though Republicans may take back the Senate by running against President Barack Obama’s executive amnesty, John Feehery argued that Republicans must not oppose Obama and ram through amnesty if they control Congress.\n“They should pass immigration reform, pronto,” he wrote in Tuesday’s The Hill.\nThough former House Majority Leader Eric Cantor (R-VA) was ousted because of his support for amnesty, House Speaker John Boehner (R-OH) has reportedly told Obama that there would be a “good chance” of comprehensive amnesty legislation passing in the next Congress.\nAs Breitbart News has noted, “Feehery has supported Arlen Specter over Pat Toomey and favored Charlie Crist over Marco Rubio,” and he “works at a lobbying firm founded by a Bill Clinton adviser who persuaded Clinton to infamously pardon Marc Rich.“\nFeehery wrote that “Republicans will gain more for their brand by proving they can govern than they will in continuing to oppose the president,” and that is why they should no longer view Obama as the enemy. Feehery’s theory is that Republicans will take back the White House in 2016 only if they “prove they can run the country in 2014 — and they can only do that with the cooperation of President Obama.”\nBreitbart News previously reported that Feehery, who has referred to conservatives and Tea Partiers as “haters” and the “bad guys,” also “worked for former House Minority Leader Bob Michel (R-IL), whom Rush Limbaugh has described a ‘sweetly irrelevant’ pushover who was the ‘most compliant loser on the face of the earth.'”\nMichel infamously used to tell freshman Republicans, “Every day I wake up, I look in the mirror, and I say to myself, ‘Today you’re going to be a loser.’ And after you’re here awhile [freshmen], you’ll start to feel the same way. But don’t let it bother you. You’ll get used to it.'”\nAs Limbaugh noted, Newt Gingrich “refused to get used to it, and instead spent ten years methodically recruiting and training his own private army” and eventually took back the House for Republicans in the historic 1994 “Contract with America” election. But Feehery doesn’t like Republican winners, and he said the Contract with America “was an exercise in overpromising and underdelivering.”\nThis is nothing new for Feehery, who, as Breitbart News noted, “has a history of being critical if not outright hostile about the Tea Party”:","url":"https://www.breitbart.com/politics/2014/09/16/Steve-Scalise-Lobbyist-Adviser-GOP-Must-Pass-Amnesty-Pronto-After-Midterms/"}
