{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-22 22:23:29","date_modify":"2018-10-22 22:23:29","date_publish":"2017-03-10 00:41:56","description":"He was voted off I'm A Celebrity... Get Me Out Of Here! on Thursday night. And radio shock jock Steve Price has revealed he's amazed by his weight loss, having lost 10kg in the South African jungle.","filename":"data/vaneerConsumption/StevePricerevealshelost10kgonImACelebrity.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F13A200000578-0-image-a-25_1489107325616.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299124_Steve-Price-reveals-lost-10kg-m-Celebrity_1540247009.html","title":"Steve Price reveals he lost 10kg on I'm A Celebrity","title_page":"Steve Price reveals he lost 10kg on I'm A Celebrity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was voted off I'm A Celebrity... Get Me Out Of Here! by Australian viewers on Thursday night.\nAnd while radio shock jock Steve Price was disappointed he didn't win the money for his chosen charity, he is amazed by his weight loss.\nSpeaking to KIIS FM's Kyle And Jackie O on Friday from the South African jungle, he revealed he lost more than 10 per cent of his body weight.\n'10kg! Can you believe that?' Steve Price reveals he lost more than 10 per cent of his body weight on I'm A Celebrity... Get Me Out Of Here! when interviewed by KIIS FM's Kyle And Jackie O on Friday\n'It's amazing': Clearly chuffed by the 10kg weight loss, Steve claimed it was 'amazing' to see his 'two-year-old short fat little body' change while spending five weeks in the jungle\nHost Kyle Sandilands was first to mention the media personality's changing appearance saying 'You've lost weight, you look good!', while his co-host asked him to confirm the exact figure.\nSteve happily obliged: '10kg! can you believe that?'\n'On a sixty two-year-old short fat little body. It's amazing!' he spoke of his frame.\nLike his celebrity co-stars, Steve lost weight thanks to the show's food rations and sometimes strenuous tasks.\nThe Project panelist said they often were 'cooking beans and rice, you wouldn't seriously feed your dog.'\nAt his request, the star was reunited with a cold beer and a hearty steak for his first meal after exiting the jungle.\nMuch-needed meal! After living on meals 'you wouldn't seriously feed your dog' Steve was happy to enjoy a steak with a refreshing beer\nCelebrity weight loss: Like his celebrity co-stars, Steve lost weight due to the show's food rations and sometimes strenuous tasks over the past five weeks\nWhile he didn't last until Monday's finale to win the $100,000 for his chosen charity, he intends to raise money on his own radio show 2GB.\nHe told the team he's going to ask the sponsors to chip in and raise the funds for Carrie Bickmore's Beanies 4 Brain Cancer.\n'We've all lost friends through brain cancer. It's an awful disease and we want to fix it if we can,' Steve said.\nHe then joked that Kyle could benefit from entering the show next year: 'You could do with losing 10kg, maybe see you in there next year?'\nKyle laughed off his suggestion: 'I could be in there for four years and still not actually lose weight.'\n'You could do with losing 10kg, maybe see you in there next year?': Steve cheekily joked that Kyle could benefit from entering the show, while Kyle laughed off his suggestion by saying he could be in there for years and continue to lose weight\nFormer AFL player Dane Swan, singer Casey Donovan, comedian and TV star Nazeem Hussain and musician and actress Natalie Bassingthwaighte are left in jungle.\nAs of Friday morning, Sportsbets odds placed Casey as the front-runner at $1.80, while Nazeem was the underdog at $11.\nThe Starlight Foundation, N.I.C.K Foundation, Sister 2 Sister and inTouch are the charities likely to benefit from the $100,000 prize donation.\nThe I'm A Celebrity... Get Me Out Of Here! finale will air on Monday March 13 on Channel Ten at 7.30pm\nWho will win? Former AFL player Dane Swan, singer Casey Donovan, comedian and TV star Nazeem Hussain and musician and actress Natalie Bassingthwaighte are left in jungle with the finale set to air on Monday night at 7.30pm","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299124/Steve-Price-reveals-lost-10kg-m-Celebrity.html"}
