{"authors":[],"date_download":"2018-10-30 19:43:05","date_modify":"2018-10-30 19:43:05","date_publish":"2018-10-30 19:19:00","description":"Knudsen says the district needs vision and responsible stewardship.","filename":"data/vaneerConsumption/SteveKnudsenDistrict2.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23310953_101818-gwx-boe-candidate-forum_AP6.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_gwinne_b48370300489cc688ace5a9f2d164abe__1540928585.html","title":"Steve Knudsen, District 2","title_page":"Gwinnett school board race:  Steve Knudsen, District 2","title_rss":"NULL","source_domain":"ajc.com","text":"With 25 years in the nonprofit sector, Steve Knudsen says his background is the perfect fit for the Gwinnett County Board of Education. He defeated Carol Ranft with 66.35 percent of the votes in the Republican primary and is a candidate for District 2.\n“The school district has a myriad of experts from Superintendent Wilbanks to to the assistant superintendents, the principals, the assistant principals … I think the positive of not being in education is that I bring an objective outside view to the board of education. I like to overlay it with my nonprofit background.”\nKnudsen cited vision and responsible stewardship. The current board has done a good job setting forth the right vision for the county, he said. But what makes him stand out is stewardship.\n“Many people look at a budget of over $2 billion and they don’t look at it as limited resources … You can’t just spin out more widgets and create more revenue. You have to come up with a vision that people will buy in and support with their hard-earned money,” he said. “They forgo something in order for you to do what your doing at the nonprofit level. And so the stewardship of what you do is extremely important. “\nHe said, “For 25 years it’s constantly been a part of the organizations that I’ve been a part of.”\nWith rising property assessments, taxpayers are shelling out more and more to the county.\n“I’m a taxpayer and the county of Gwinnett said last year my house is worth 50 percent more than it was before. I feel the pinch. And I want to make sure that as other people feel the pinch that we are doing the absolute best that we can with the money that they are sending to us to educate their children.”\nHe’s been married for 32 years to his college sweetheart, who is also a teacher.\n“I know a lot about the ins and outs of what she’s been through in the classroom and how to balance the limited resources,” he said. “The best thing that a teacher brings to the classroom can’t be bought. … It’s almost a calling.”\nFrom his experience with the school system, Knudsen said he understands the role of the board members.\n“One of the strengths of being an outsider is that I’m not going to be telling principals and teachers what they need to do to achieve excellence in their classrooms. My job is to put policies and processes and the procedures in place along with the right personnel so that they can have the creativity and freedom to pursue excellence in the classroom,” he said. “Those are things that you need a good common-sense business mind to do.”\nHe said he’s looking forward to allowing teachers to give feedback.\n“At my job we call it a skip meeting where you ‘skip’ past your boss and go straight to the head of the organization,” he said.\nHe’d like to give teachers an opportunity to directly to provide input with worrying about what supervisors will think if they says that the latest, greatest, new-fangled thing doesn’t make sense in the classroom.\nAs someone who deals with finances, Knudsen would like to see the board “balance our instructional dollars.”\nThis was the first year in more than a decade that school systems were fully funded using the state formula. He’d like to be ready in case the cycle of austerity returns.\n“We should look at what we had to do during the downturn. If we had to take on debt, I like to see us retiring some of that debt. it will free up dollars for a future budget,” Knudsen said. “I want to look at the budget with a fine-tooth comb. Let’s get rid of all the possible waste and see if there’s some things we might be able to pay off. It will put us in a better position every year no matter what the economy does. Let’s create stability moving forward. It’s more important than immediately spending few extra dollars on new things.”","url":"https://www.ajc.com/news/local-education/gwinnett-school-board-race-knudsen-emphasizes-vision-stewardship/IW9mxlNLEZAZOMLMClKayL/"}
