{"authors":[],"date_download":"2018-10-30 14:20:31","date_modify":"2018-10-30 14:20:31","date_publish":"2016-12-13 00:00:00","description":null,"filename":"data/vaneerConsumption/Stillwaitingforthe19celebritieswhopromisedtoleaveAmericaifTrumpwaselectedtogetout.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_12_still_waiting_for_the_19_celebrities_who_promised_to_leave_america_if_trump_was_elected_to_get_out_comments_1540909231.html","title":"Still waiting for the 19 celebrities who promised to leave America if Trump was elected to get out","title_page":"Blog: Still waiting for the 19 celebrities who promised to leave America if Trump was elected to get out","title_rss":"NULL","source_domain":"americanthinker.com","text":"So far as I know, not a single celebrity, even from the D-list, has left the United States, as promised, if Donald Trump were elected. Fair is fair: Lena Dunham alone must have motivated thousands of voters to choose Trump, in order to be rid of her. Let the Canadians deal with her. I am a hard-liner on getting them out of the country. Every time one of these people appears in public, he should be asked why he is still inhabiting the United States. Have they decided that Donald Trump is not so bad? Or have they decided that nobody should ever pay attention to their promises and threats? Ilya Shapiro of The Federalist lists 18 celebrities who promised to leave but now are going back on their word: Bryan Cranston said he’d move to Canada, the most popular destination—and also far above the United States in the latest economic-freedom rankings. Raven-Symoné—whom I only knew as a Cosby kid but apparently now is... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/12/still_waiting_for_the_19_celebrities_who_promised_to_leave_america_if_trump_was_elected_to_get_out_comments.html"}
an gets nominated [did she mean elected?].”\nNeve Campbell, who’s already Canadian, would return to her (and my) home province of Ontario.\nChloë Sevigny likewise had a particular Canadian province in mind, Nova Scotia.\nLena Dunham was even more specific, pointing to Vancouver as her choice. “I know a lot of people have been threatening to do this, but I really will.” I can’t confirm reports that Dunham is being sued for not doing so by the not-insignificant number of people who voted for Trump on this basis alone.\nBarbra Streisand was picking between Canada and Australia (which is also freer than America ).\nChelsea Handler has a house in Spain already, and threatened to move there permanently.\nAmy Schumer also promised to move to Spain “or somewhere.”\nGeorge Lopez said he’d go back to Mexico.\nSamuel L. Jackson had perhaps the most original choice: South Africa.\nJustice Ruth Bader Ginsburg—a celebrity in my circles—joked about moving to New Zealand in a New York Times interview that may yet get her into more trouble.\nBilly Crystal had the same Kiwi idea\nMiley Cyrus, Al Sharpton, and Whoopi Goldberg would exile themselves to some\nunspecified country.\nSpike Lee, perhaps misunderstanding the concept of leaving the country, said he’d move to the “Republic of Brooklyn.”\nCher, apparently feeling that the Earth was too small for her to share with a President Trump, promised to move to Jupiter—where she’d possibly be joined by\nJon Stewart, who “would consider getting in a rocket and going to another planet, because clearly this planet’s gone bonkers.” Ed Driscoll of Instapundit adds one more celeb to the list: Mrs. George Stephanopoulos, aka Ali Wentworth. If we are ever going to make America great again, we need to get rid of all those who made an offer and now won’t deliver on their promises.","url":"https://www.americanthinker.com/blog/2016/12/still_waiting_for_the_19_celebrities_who_promised_to_leave_america_if_trump_was_elected_to_get_out.html"}
