{"authors":[],"date_download":"2018-10-30 20:19:02","date_modify":"2018-10-30 20:19:02","date_publish":"2015-05-19 23:34:00","description":"After raising his two sons as a single father and teaching high school for 30 years, Larry Bolen was looking forward to retirement.","filename":"data/vaneerConsumption/StillnosignofmissingDouglasCountyteacher.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/16/Images/photos.medleyphoto.8695067.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_still-sign-missing-douglas-county-teacher__1540930742.html","title":"Still no sign of missing Douglas County teacher","title_page":"Still no sign of missing Douglas County teacher","title_rss":"NULL","source_domain":"ajc.com","text":"After raising his two sons as a single father and teaching high school for 30 years, Larry Bolen was looking forward to retirement. But he didn’t have any specific plans, his son said Tuesday.\n“He said he was going to enjoy his free time and pick up some hobbies,” James Bolen told The Atlanta Journal-Constitution.\nLarry Bolen (Credit: Douglas County Sheriff’s Office)\nHis pending retirement and the school year ending make Larry Bolen’s disappearance even more baffling. Investigators with the Douglas County Sheriff’s Office picked up the 62-year-old’s computer Tuesday in hopes it will offer more clues to the man’s disappearance, his younger son said.\n“This is not something he would typically do,” James Bolen said. “I’ve never known him to go anywhere but to his school or the grocery store.”\nLate on May 8, James and his girlfriend returned home to Douglas County after a quick trip. The two, who live with Bolen, didn’t talk to him that night because he was already asleep.\nThe next morning, Larry Bolen was gone.\nIt was a Saturday morning, and Bolen left home in his minivan and had breakfast at Chick-fil-A, his son said. James Bolen said he’s checked his dad’s bank account for any activity, but that breakfast, likely a biscuit and coffee, was the last purchase.\nLate last week, Bolen’s minivan was found parked at Hunter Park, a park where James played baseball as a boy. But there was no sign of his father, and searches of the area haven’t yielded clues for detectives.\n“Investigators are still hard at work on this case, but we have no new updates,” the sheriff’s office posted on its Facebook page Tuesday.\nDetectives have worked nonstop to find his father, James Bolen said. And he’s learned just how important his dad is to his students and colleagues at Alexander High School. Despite the passing days, James Bolen said he believes his father is still alive.\n“I just keep running every possible scenario through my head,” Bolen said. “It doesn’t seem like he planned this. I just don’t know what to think.”\nLarry Bolen took his keys and wallet from his home, but not his cellphone or blood pressure medication.\nAnyone with information on the man’s whereabouts is asked to contact the sheriff’s office or call 911.","url":"https://www.ajc.com/news/still-sign-missing-douglas-county-teacher/qCXoDr7AURJPJS4Y5B72bL/"}
