{"authors":["Associated Press"],"date_download":"2018-10-22 23:33:53","date_modify":"2018-10-22 23:33:53","date_publish":"2016-01-28 12:32:35","description":"LOS ANGELES (AP) — Sting is trading \"Fields of Gold\" for a court of all-stars. The Grammy-winning artist known for hits like \"Roxanne\" and \"Desert Rose\" will...","filename":"data/vaneerConsumption/StingtoperformhalftimeshowatNBAAllStarGame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:342f8dbff84d43b4b6071ce35e46c95b-2vdWmEltwXfba0ce28e6328920e5-824_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420827_Sting-perform-halftime-NBA-All-Star-Game_1540251233.html","title":"Sting to perform halftime show at NBA All-Star Game","title_page":"Sting to perform halftime show at NBA All-Star Game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sting to perform halftime show at NBA All-Star Game\nLOS ANGELES (AP) — Sting is trading \"Fields of Gold\" for a court of all-stars.\nThe Grammy-winning artist known for hits like \"Roxanne\" and \"Desert Rose\" will perform the halftime show at the NBA All-Star Game on Feb. 14 at the Air Canada Centre in Toronto.\nCirque du Soleil will perform a routine before the game that illustrates \"the story of a basketball dream.\"\nFILE - In this Nov. 18, 2015 file photo, Sting performs at Shining a Light: A Concert for Progress on Race in America at the Shrine Auditorium in Los Angeles. Sting is trading \"Fields of Gold\" for a court of stars. The Grammy-winning artist known for hits like \"Roxanne\" and \"Desert Rose\" will perform the halftime show at the NBA All-Star Game on Feb. 14, 2016, at the Air Canada Centre in Toronto. (Photo by Rich Fury/Invision/AP, File)\nActor-rapper Drake and actor-comedian Kevin Hart will serve as coaches for the NBA All-Star Celebrity Game on Feb. 12.","url":"https://www.dailymail.co.uk/wires/ap/article-3420827/Sting-perform-halftime-NBA-All-Star-Game.html"}
