{"authors":[],"date_download":"2018-10-23 02:00:47","date_modify":"2018-10-23 02:00:47","date_publish":"2017-03-19 00:00:00","description":"Italian-Americans celebrate St. Joseph's Day on March 19 with a traditional pastry called a zeppole — a specialty for a family bakery in Providence, R.I.","filename":"data/vaneerConsumption/StJosephsDayMeansPastryDayInProvidence.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=520708202_1540260047.html","title":"St. Joseph's Day Means Pastry Day In Providence","title_page":"St. Joseph's Day Means Pastry Day In Providence : NPR","title_rss":"NULL","source_domain":"npr.org","text":"LOURDES GARCIA-NAVARRO, HOST:\nToday, Italian-Americans around the country are celebrating St. Joseph's Day. There's a luscious pastry associated with this holiday, and reporter John Bender of Rhode Island Public Radio tells us all about it.\nJOHN BENDER, BYLINE: In the kitchen at LaSalle Bakery in Providence, R.I., a state where zeppole are famous, a team of bakers furiously prepare. They know lines will be forming to snap up this seasonal treat.\nMIKE MANNI JR.: Right now they're topping the zeppoles. So the same cream that's inside they're putting on the tops.\nBENDER: For extra decadence.\nMANNI JR.: For extra calories (laughter).\nBENDER: Mike Manni is a baker and the owner of LaSalle Bakery, zeppole, or zeppola singular, a kind of super deluxe cream puff. Here you can get your zeppole baked or the traditional way, fried, says Manni.\nMANNI JR.: Right, dad? Fried was the original way of doing them, right?\nMIKE MANNI SR.: Yeah.\nBENDER: LaSalle Bakery is a family affair. Manni's father, also Mike, owned this shop until his retirement a few years ago. Now the elder Manni only comes in when they need ringers like today. Zeppole are finished off with a dusting of powdered sugar and a maraschino cherry. They're then laid onto crinkly white papers. Bakers then slide tray after tray of zeppole onto racks, ready to be sold. LaSalle Bakery's been churning out thousands of these bad boys each March since 1932, for years piped out by hand, now by machine, says Manni.\nMANNI JR.: So whether you're doing it with a machine or by hand, there's absolutely no difference. It's just you don't get carpal tunnel syndrome in your hand.\nBENDER: The treat became famous in Italy then traveled the Atlantic with waves of Italian immigrants, many of whom settled in The Ocean State. But Manni the elder says it doesn't take a saint to get people to eat good food.\nMANNI SR.: Everybody celebrates around food. So when you have the right mix of a quality product, a celebration, then, oh, it's St. Joseph's Day. Let's eat a zeppola.\nBENDER: Standing in line, waiting for a zeppola, June Spencer of Lincoln, R.I., agrees. She says it wouldn't be St. Joseph's Day without one.\nJUNE SPENCER: It's just a tradition. It's an Italian pastry. And it's part of the celebration of St. Joseph's Day, you know, at a big Italian dinner. And it just makes it more festive.\nBENDER: If all this is making you hungry and you want to get to your nearest bakery, better call ahead. Zeppole are popular, sell out fast and are hard to come by.\nFor NPR News, I'm John Bender in Providence.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=520708202"}
