{"authors":["Trent Baker"],"date_download":"2018-10-30 21:26:47","date_modify":"2018-10-30 21:26:47","date_publish":"2015-05-25 05:11:19","description":"A picture of St. Louis Cardinals mascot Fredbird holding up a sign reading “Police Lives Matter” recently surfaced on Twitter, as well as other social |","filename":"data/vaneerConsumption/StLouisCardinalsMascotCausesControversyAfterPoliceLivesMatterSignEmerges.json","image_url":"https://media.breitbart.com/media/2015/05/Cardinal.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_05_24__1540934807.html","title":"St. Louis Cardinals Mascot Causes Controversy After ‘Police Lives Matter’ Sign Emerges","title_page":"St. Louis Cardinals Mascot Causes Controversy After ‘Police Lives Matter’ Sign Emerges | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A picture of St. Louis Cardinals mascot Fredbird holding up a sign reading “Police Lives Matter” recently surfaced on Twitter, as well as other social media sites.\nThe photo later made its way onto the St. Louis Police Officers Association’s Facebook page, causing the Cardinals to ask for it to be taken down, both of which caused an uproar.\nThe team later clarified that Fredbird was handed the sign before taking a picture with a fan without knowing what was written on it.\nVice president of communications for the Cardinals Ron Watermon responded to the controversy, saying, “A man and a woman stopped Fredbird to request a quick photograph. While the man was taking the picture, the woman standing next to Fredbird asked him to hold up the sign. Fredbird was unaware of the content of the sign.”\nThe Cardinals have since apologized, saying their mascot should not get caught up in political activity or social commentary.\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2015/05/24/st-louis-cardinals-mascot-causes-controversy-after-police-lives-matter-sign-emerges/"}
