{"authors":[],"date_download":"2018-10-22 22:32:07","date_modify":"2018-10-22 22:32:07","date_publish":"2014-06-10 14:28:18","description":"Roman Catholic Archbishop Robert Carlson was the chancellor of the Twin Cities archdiocese in the 1980s when allegations of sexual abuse came to light.","filename":"data/vaneerConsumption/StLouisArchbishopDidntKnowSexWithChildrenWasaCrime.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/499011/140610-robert-carlson-jsw-945a_516426f3a6877cc79aa0b8513c557fbe.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_religion_st-louis-archbishop-didnt-know-sex-children-was-crime-n127291_1540247527.html","title":"St. Louis Archbishop Didn't Know Sex With Children Was a Crime","title_page":"St. Louis Archbishop Didn't Know Sex With Children Was a Crime","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe St. Louis archbishop embroiled in a sexual abuse scandal testified last month that he didn’t know in the 1980s whether it was illegal for priests to have sex with children, according to a court deposition released Monday.\nArchbishop Robert Carlson, who was chancellor of the Archdiocese of Minneapolis and St. Paul at the time, was deposed as part of a lawsuit against the Twin Cities archdiocese and the Diocese of Winona, Minnesota.\nIn a video released by the St. Paul law firm Jeff Anderson & Associates, the Catholic archbishop is asked whether he had known it was a crime for an adult to engage in sex with a child.\n“I’m not sure whether I knew it was a crime or not,” Carlson responded. “I understand today it’s a crime.”\nWhen asked when he first realized it was a crime for an adult — including priests — to have sex with a child, Carlson, 69, shook his head.\n“I don’t remember,” he testified.\nAttorney Jeff Anderson, who is representing an alleged clergy abuse victim, also released documents Monday indicating Carlson was aware in 1984 of the seriousness of child abuse allegations. He wrote to then-Archbishop John Roach that parents of one of the alleged victims was planning to go to police.\nCarlson’s role at the time was to investigate abuse claims. He admitted in his deposition that he never personally went to police, even when a a clergy member admitted to inappropriate behavior.\nIn last month’s testimony, Carlson responded 193 times that he did not recall abuse-related conversations from the 1980s to mid-1990s.\nAnderson provided a report from a previous deposition in 1987 in which now-deceased Bishop Loras Watters said he advised Carlson to answer “I don’t remember” if questioned in court.\nCarlson responded last month that he had “no knowledge of the discussion.”\nCarlson left the Twin Cities in 1994, and eventually became St. Louis archbishop in 2009.\nThe Archdiocese of St. Louis said in a statement Monday that Carlson had given testimony “several times many years ago” about the same allegations, according to NBC affiliate KSDK.\n“In this most recent deposition, while not being able to recall his knowledge of the law exactly as it was many decades ago, the Archbishop did make clear that he knows child sex abuse is a crime today,” the statement said. “The question does not address the Archbishop’s moral stance on the sin of pedophilia, which has been that it is a most egregious offense.”\nThe trial against the Twin Cities archdiocese is slated to begin in September.\n— Erik Ortiz","url":"https://www.nbcnews.com/news/religion/st-louis-archbishop-didnt-know-sex-children-was-crime-n127291"}
