{"authors":[],"date_download":"2018-10-22 21:19:08","date_modify":"2018-10-22 21:19:08","date_publish":"2014-05-06 13:44:15","description":"Stocks tumbled, a day after the Dow and S&P 500 closed near record highs, as Twitter shares fell sharply and insurance giant AIG reported a profit drop.","filename":"data/vaneerConsumption/StocksTumbleSharplyasTwitterAIGSharesFall.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_stocks-tumble-sharply-twitter-aig-shares-fall-n98101_1540243148.html","title":"Stocks Tumble Sharply as Twitter, AIG Shares Fall","title_page":"Stocks Tumble Sharply as Twitter, AIG Shares Fall","title_rss":"NULL","source_domain":"nbcnews.com","text":"Stocks tumbled on Tuesday, a day after the Dow and S&P 500 closed near record highs, as Twitter shares fell sharply and insurance giant American International Group reported a decline in profit.\nThe Dow Jones Industrial Average closed unofficially 129 points lower, while the S&P 500 lost 16 points and the Nasdaq shed 57 points, or 1.38 percent.\n\"The primary reason we're down today is we're at all-time highs. If you don't continue to rally, people just start to take profits,\" said JJ Kinahan, chief strategist for TD Ameritrade.\n\"We've had an earnings season that's been better than expectations, but not strong enough to get investors terribly excited about the future, and we may be seeing a little hint of a risk-off trade with nervousness over this Ukrainian story, although it doesn't affect the ability of U.S. companies to make money,\" said Jerry Webman, chief economist at Oppenheimer Funds.\n\"Good money can be made in a fairly valued market, but to go higher we're going to need some confirmation on earnings and expected earnings,\" Webman added.\nShares of Twittertumbled 17 percent as nearly 500 million shares of the social media stock from company insiders hit the market for the first time since the company's initial public offerng.\nAIG stock fell over 4 percent after the insurer posted a 27-percent drop in quarterly profit. But Office Depot surged 15 percent after the retailer increased its full-year forecastand said it would close at least 400 stores in the United States over the next two years.\nThe Commerce Department reported that the U.S. trade deficit shrank in March as exports increased, with the gap narrowing to $40.4 billion from $41.9 billion in February.\n\"Exports in the first quarter were particularly weak, but that's on paper. It doesn't really tell you anything about the underlying health of the economy, as that was when transport was frozen, you couldn't build a house or go to the store. Most of the data points now are telling us the economy is reasonably healthy,\" said Andrew Wilkinson, chief market analyst at Interactive Brokers.\nThe 10-year Treasury yield used in figuring mortgage rates and other consumer loans fell 2 basis points to 2.59 percent. The dollar fell against the currencies of major U.S. trading partners, especially the euro, which rose on data showing a strong European service sector.","url":"https://www.nbcnews.com/business/markets/stocks-tumble-sharply-twitter-aig-shares-fall-n98101"}
