{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:46:18","date_modify":"2018-10-30 23:46:18","date_publish":"2018-07-14 00:00:00","description":"BI PRIME: The stock market is at a turning point toward more-defensive sectors, according to Morgan Stanley's equity strategists. They downgraded the tech sector to underweight, with a list of reasons it may not be as rewarding to investors in the near term.","filename":"data/vaneerConsumption/StockmarketturningdefensivetechdowngradedatMorganStanley.json","image_url":"https://amp.businessinsider.com/images/54109f256da811b624e9d29d-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-turning-defensive-tech-downgraded-at-morgan-stanley-2018-7_1540943178.html","title":"Stock market turning defensive, tech downgraded at Morgan Stanley","title_page":"    Stock market turning defensive, tech downgraded at Morgan Stanley - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders have rotated toward more-defensive sectors since June. Mario Tama/Getty Images\nThe stock market is at a turning point, according to Morgan Stanley.\nFor many months, the bank's equity strategists have written to clients about a forthcoming rotation toward defensive sectors, which investors prefer during downturns. They warned about a long, drawn-out bear market in valuations marked by slower profit growth. They recommended utilities as the best defensive sector as the broader stock market risked losses.\nIn a note Monday, the firm's chief US equity strategist, Mike Wilson, said the market's turning point arrived in June. Since June 18, defensive sectors like utilities and real estate have outperformed cyclical sectors like tech and financials.\nMorgan Stanley\nWilson also identified that two out of three conditions for a rotation to defensive sectors were happening and that investors were discounting them: peaking S&P 500 earnings growth on a year-on-year basis and a top in the 10-year Treasury yield. The third would occur if the 10-year yield were to fall below the two-year — a so-called yield-curve inversion.\nMorgan Stanley\nThey took their defensive call into a higher gear by downgrading small-caps to equal weight, and tech stocks to underweight, in a client note on Monday. They also upgraded consumer staples and telecom stocks to equal weight.\n\"We think it makes sense to lower broad [tech] exposure in the near term, or, at the very least, hedge sector exposure aggressively into earnings season as elevated valuations, lack of material earnings upside, extended positioning, technicals, and trade related risks all add up to a poor risk reward for the sector in the near term,\" Wilson said in a note on Monday.\nAnalysts project 25% earnings growth for tech companies, which will report second-quarter results shortly. Wilson, however, said there's not much room to meaningfully beat expectations.\nThis \"remarkable\" earnings forecast is already reflected in stock prices, Wilson said. Similarly, the fundamentals that would drive the earnings growth are already priced in. While not in \"bubble\" territory, he added, the price-to-earnings ratio for S&P 500 tech companies is over two standard deviations above the postcrisis average.\nTech companies, particularly hardware providers that source parts from all over the world, have benefitted from global trade but are in the crosshairs of a trade war. Wilson expects managements to address trade during earnings calls, which could dampen their guidance and earnings growth.\nOn a technical note, Wilson observed that fewer stocks were trading below their 200-day moving averages.\n\"Given its exceptional growth and quality characteristics, tech has been a holdout to date,\" Wilson said.\n\"However, we suspect it will not be immune from the changing attitudes toward risk assets we are seeing across markets and think the sector may have benefitted from a false sense of security the past few months.\"","url":"https://www.businessinsider.com/stock-market-turning-defensive-tech-downgraded-at-morgan-stanley-2018-7"}
