{"authors":["Gina Heeb"],"date_download":"2018-10-30 23:05:16","date_modify":"2018-10-30 23:05:16","date_publish":"2018-07-23 00:00:00","description":"Stocks were mostly higher Monday as Wall Street shifted focus from ongoing tensions surrounding the Trump administration to a wave of tech earnings out this week. The dollar rose, and the 10-year Treasury yield jumped to its highest level in more than a month.","filename":"data/vaneerConsumption/Stocksclosemostlyhigheraheadofawaveoftechearnings.json","image_url":"https://amp.businessinsider.com/images/5b56335457a20734008b45d4-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-closes-higher-tech-earnings-2018-7_1540940716.html","title":"Stocks close mostly higher ahead of a wave of tech earnings","title_page":"    Stocks close mostly higher ahead of a wave of tech earnings - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders work on the floor of the NYSE in New York Thomson Reuters\nStocks were mostly higher Monday as Wall Street shifted focus from ongoing tensions surrounding the Trump administration to a wave of tech earnings out this week. Financial stocks rallied, with JPMorgan gaining 1.9%. The dollar rose, and the 10-year Treasury yield jumped to its highest level in more than a month.\nHere's the scoreboard:\nDow Jones industrial average: 25,045.35 −12.77 (-0.051%)\nS&P 500: 2,807.52 +5.69 (0.20%)\nPresident Donald Trump and Iranian President Hassan Rouhani hurled ominous threats at one another. After Rouhani said in a speech that a conflict between Iran and the US would be the \"mother of all wars,\" Trump fired back on Twitter. He warned that if there are more threats, \"YOU WILL SUFFER CONSEQUENCES THE LIKES OF WHICH FEW THROUGHOUT HISTORY HAVE EVER SUFFERED BEFORE.\" In a separate tweetstorm, the president lashed out at Amazon. He claimed again that the e-commerce company takes advantage of the US Postal Service and attacked the Washington Post, which is owned by Amazon CEO Jeff Bezos. The outburst came after a weekend of critical news reports on the White House and the Trump campaign. US home sales dropped unexpectedly last month as a housing shortage sent prices soaring. Existing home sales fell 0.6% in June, the National Association of Realtors said, to a seasonally-adjusted annual rate of 5.38 million units. Tesla appears to have asked some of its suppliers for refunds in attempt to meet profitability goals. The Wall Street Journal reports that a memo sent to a supplier said the cash back would be \"essential to Tesla's continued operation.\"\nAnd a look at the upcoming economic calendar:","url":"https://www.businessinsider.com/stock-market-closes-higher-tech-earnings-2018-7"}
