{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:10:46","date_modify":"2018-10-31 00:10:46","date_publish":"2018-07-12 00:00:00","description":"BI PRIME: Fourteen out of 19 signposts that Bank of America Merrill Lynch is watching for a bear market have now been triggered. The firm's equity strategists say there's reason for longer-term caution on stocks.","filename":"data/vaneerConsumption/StockmarketbearsignposttriggeredonBankofAmericaslist.json","image_url":"https://amp.businessinsider.com/images/5ac3d5db2f2ece19008b49da-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-bear-signal-triggered-bank-of-america-2018-7_1540944646.html","title":"Stock market bear signpost triggered on Bank of America's list","title_page":"    Stock market bear signpost triggered on Bank of America's list - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"One more bear market signpost on Bank of America's list has been triggered. Reuters / Lucas Jackson\nFourteen down, five to go: That's the status update on Bank of America Merrill Lynch's signposts for the next bear market in stocks.\nThe latest signal was triggered by the recent outperformance of low-quality stocks — companies with the highest levels of debt and weakest profitability — over high-quality stocks, the firm said in a note to clients on Wednesday.\nBAML found that relative to the rest of the market, active fund managers were the most invested in low-quality stocks. \"Since we began to track large cap fund holdings in 2008, managers have been increasing their tilts towards expensive, large, low dividend yield and low quality stocks,\" Savita Subramanian, the head of US equity and quant strategy, said in a July 2 note.\n\"Their respective factor exposure relative to the S&P 500 is near its record level.\"\nBank of America Merrill Lynch\nThis was enough to tick another checkbox on BAML's bear-market list, and shifted its Bull & Bear Indicator further left into \"extreme bearish\" territory. This indicator is a scale of zero to 10 and is not intended to be a benchmark.\nIt's a contrarian indicator, meaning that when it's in \"extreme bearish\" territory, it's usually a sign to buy. When stocks surged at the beginning of the year, the indicator swung into \"extreme bullish\" territory. And within a week of the market's correction in early February, BAML alerted clients that its indicator was flashing a sell signal.\n\"The BofAML Bull & Bear Indicator — which triggered a contrarian sell signal in January of this year, coinciding with the recent market peak — is now at 2.3, close to triggering a trading buy signal however longer term reasons for caution on stocks are building,\" Marc Pouey, an equity and quant strategist, said in a note on Tuesday.\nBank of America Merrill Lynch\nThe other bear-market signposts that have been triggered provide some ideas on why BAML thinks there's reason for longer-term caution on stocks. They include the Federal Reserve, which has always preceded bear markets by raising rates by at least 75 basis points. Also, companies that beat on both earnings per share and sales are getting smaller stock-price lifts from investors.\nThe signpost count of 14 out of 19 equals about 74% of the checklist. According to Subramanian, it took 21 months on average to hit a stock-market peak after this threshold was reached during the last seven market cycles.\nReturns averaged 30% until the peak. And so, it might not be time to throw in the towel on this bull market just yet, based on what the Bull & Bear Indicator is saying. BAML still has a year-end S&P 500 target of 3,000, a 7% gain from current levels.\nOne signpost that's yet to be triggered is an inversion of the yield curve, though the difference between the two- and 10-year yields is at its lowest level since the recession.\nHere's the full list of signposts for reference:","url":"https://www.businessinsider.com/stock-market-bear-signal-triggered-bank-of-america-2018-7"}
