{"authors":[],"date_download":"2018-10-22 21:53:52","date_modify":"2018-10-22 21:53:52","date_publish":"2014-06-06 13:35:41","description":"Stocks rose to record highs on Friday, for a third week of gains, after the May jobs report showed slow but steady improvement in the labor market.","filename":"data/vaneerConsumption/StocksKeepClimbingDowSPatRecordHighsAfterJobsReport.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_stocks-keep-climbing-dow-s-p-record-highs-after-jobs-n124396_1540245232.html","title":"Stocks Keep Climbing; Dow, S&P at Record Highs After Jobs Report","title_page":"Stocks Keep Climbing; Dow, S&P at Record Highs After Jobs Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nStocks rose to record highs on Friday, for a third week of gains, after the May jobs report showed slow but steady improvement in the labor market.\nThe Dow Jones Industrial Average closed unofficially 88 points higher at 16,924.28, eclipsing Thursday's record high close. The S&P 500 also hit a new record, rising 8 points to 1949.44, higher than the previous day's record. The Nasdaq added 25 points.\n\"Investors are getting a little more confident that the U.S. economy will recover from that sluggish first quarter. But it's still not enough to propel the labor market from its slow, steady uptrend,\" said Chris Gaffney, senior market strategist at EverBank Wealth Management.\nThe Labor Department's monthly data showed nonfarm payrolls rising 217,000 and the jobless rate at an unchanged 6.3 percent.\n\"There is diminishing slack in the labor market and wages are starting to rise; we didn't knock the ball out of the park, but all the details of the report confirm the view that economic growth is in fact rebounding in the second quarter,\" said Joseph Tanious, a global market strategist at J.P. Morgan Asset Management.\nIn addition to a slight gain in average hourly earnings, positive aspects of the jobs report included the fact that the largest gains came in business services and health care, so \"we're starting to create good quality jobs,\" said JJ Kinahan, chief strategist at TD Ameritrade.\nThe report \"continues a positive trend of government numbers that we've seen so far, and is similar is many we've seen over the last six months—good, not great,\" Kinahan added.\nEquities extended gains into a third session as cheer also lingered from the European Central Bank's policy move on Thursday, as \"the ECB decreased rates and is going to remain supportive of the global economic recovery there,\" said Chris Gaffney, senior market strategist at EverBank Wealth Management.\n\"It's a combination of both today and yesterday. The ECB announcement and the jobs report, both came in line or exceeded expectations,\" said Tanious at J.P. Morgan Asset Management.\nTreasury prices reversed lower, with the 10-year Treasury note yield that factors into mortgage rates and other consumer loans rising a basis point to 2.60 percent.\nThe dollar edged higher against other global currencies, while dollar-denominated commodities were mixed.\nGold futures for August delivery dropped 0.04 percent to $1,252.80 an ounce, while crude futures for July delivery rose to $102.85 a barrel just before close.","url":"https://www.nbcnews.com/business/markets/stocks-keep-climbing-dow-s-p-record-highs-after-jobs-n124396"}
