{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:36:32","date_modify":"2018-10-31 00:36:32","date_publish":"2018-07-07 00:00:00","description":"BI PRIME: Ten stocks contributed more than 100% of the S&P 500's returns in the first half of the year, according to Goldman Sachs. An unusual overlap with another factor could continue to lift these stocks as financial conditions tighten, Goldman's equity strategists said.","filename":"data/vaneerConsumption/Stockmarketandmutualfundperformancebeststocksin2018.json","image_url":"https://amp.businessinsider.com/images/5b3b72361ea59920008b4654-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-and-mutual-fund-performance-best-stocks-in-2018-2018-7_1540946192.html","title":"Stock market and mutual fund performance, best stocks in 2018","title_page":"    Stock market and mutual fund performance, best stocks in 2018 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders on the floor of the New York Stock Exchange. Thomson Reuters\nAt the halfway point of 2018, Goldman Sachs' equity analysts took stock of how mutual funds performed and what worked for them.\nThey found that fewer than a dozen stocks contributed to over 100% of the market's gains, and they were also the stocks that fund managers were well exposed to, David Kostin, the chief US equity strategist, said in a recent note to clients.\n\"Our basket of the most overweight large-cap mutual fund positions has been highly correlated with our growth factor during the last 3 years and has outperformed S&P 500 by 3 percentage points in 2018 (5% vs. 3%),\" Kostin said. \"As a result, 49% of large-cap mutual funds has outperformed its benchmark this year, above the 45% of funds that outperformed in 2017 and a 10-year average of 37%.\"\nInvestors have favored growth stocks over value this year as it has become clear that the synchronous global-growth climate that characterized 2017 is no more. Value stocks typically outperform during the earlier stages of the economic cycle when gross-domestic-product growth is more robust, Kostin said.\nTen stocks have contributed to 122% of the S&P 500's return this year, according to data crunched by Goldman Sachs. Almost all are in the tech and consumer-discretionary sectors, which are loaded with growth stocks.\nGoldman Sachs\nAnother feature of many of these growth stocks is that they have strong balance sheets. This overlap of the growth factor and strong balance sheets is historically unusual, Kostin said, and it represents both a risk and an opportunity.\nThough companies loaded with cash would normally be best positioned to weather a market downturn, an investor rotation away from growth stocks would be detrimental to stocks with this overlap.\nFor now, investors aren't full-on defensive, and that's helping growth stocks with strong balance sheets. Goldman's strong-balance-sheet basket of stocks has outperformed a group of weak-balance-sheet firms by 5 percentage points this year.\n\"We expect strong balance sheet stocks will continue to outperform given record-high net leverage for the median S&P 500 stock and tightening financial conditions,\" Kostin said.","url":"https://www.businessinsider.com/stock-market-and-mutual-fund-performance-best-stocks-in-2018-2018-7"}
