{"authors":[],"date_download":"2018-10-22 20:58:52","date_modify":"2018-10-22 20:58:52","date_publish":"2014-06-03 13:42:56","description":"Stocks closed in the red on Tuesday in lackluster trading, a day after the Dow and S&P 500 hit all-time highs.","filename":"data/vaneerConsumption/StocksCloseLowerADayAfterReachingRecordHighs.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_stocks-close-lower-day-after-reaching-record-highs-n121181_1540241932.html","title":"Stocks Close Lower A Day After Reaching Record Highs","title_page":"Stocks Close Lower A Day After Reaching Record Highs ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Stocks closed in the red on Tuesday in lackluster trading, a day after the Dow and S&P 500 hit all-time highs.\nThe Dow Jones Industrial Average ended unofficially 21 points lower, the S&P 500 fell less than a point and the Nasdaq lost 3 points. The Dow had finished at a record 16,743.70 on Monday and the S&P 500 also hit an all-time high of 1,924.97.\nStocks initially pared their losses after a better-than-expected factory orders report. New orders for factory goods climbed 0.7 percent in April, rising for a third-straight month and topping expectations for 0.5 percent.\n\"We've had some hesitation this morning but factory orders looked a bit better than expected and seemed to give a little more life into the market,\" said Todd Salamone, director of research at Schaeffer's Investment Research. \"There's still a lot of data coming out later in the week—a lot of eyes are on the ECB.\"\nInvestors will be looking ahead to the monthly non-farm payrolls report on Friday. Economists expect to see 218,000 jobs added in May and a 6.4 percent unemployment rate, according to a Reuters poll.\nGeneral Motors and Ford stocks gained after both automakers reported sales that rose above estimates in May. Japanese rival Toyota also topped sales estimates.\nOvernight, an HSBC survey showed that China's factory sector put in its best performance in four months in May as export orders rebounded, although activity remained in contraction territory.\nEuropean and Asian shares failed to rise on the news, which was already priced in following Monday's positive official manufacturing data from China.\nTraders in Europe remain cautious ahead of Thursday's European Central Bank Governing Council meeting. Many economists expect President Mario Draghi to announce policy measures to combat low inflation, such as interest rate cuts, cheap loans to banks or even Federal Reserve-style asset purchases.","url":"https://www.nbcnews.com/business/markets/stocks-close-lower-day-after-reaching-record-highs-n121181"}
