{"authors":["Will Martin"],"date_download":"2018-10-30 22:28:03","date_modify":"2018-10-30 22:28:03","date_publish":"2016-12-13 00:00:00","description":"Tuesday was a good day for stocks in Europe.","filename":"data/vaneerConsumption/StocksacrossEuropehadakillerday.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_european-stock-price-movements-on-tuesday-december-13-2016-12_1540938483.html","title":"Stocks across Europe had a killer day","title_page":"    European stock price movements on Tuesday December 13 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Woman holds an EU flag during a pro-democracy demonstration at the Old Town in Warsaw Kacper Pempel/Reuters European stocks enjoyed a bumper day on Tuesday, with all major bourses closing the day deep into positive territory on a risk-on day for equities.\nStocks began the day slowly, but gradually gained as the day progressed.\nThe day's biggest winner was Italy's FTSE MIB, which climbed 2.27% to close at 18,787 points, boosted by the country's largest lender, and the country's only globally systemically important bank, Unicredit.\nUnicredit saw shares climb almost 16% after it announced that it is cutting 14,000 jobs and raising €13 billion (£11 billion) in a record share sale as part of a plan to streamline its business and restructure its balance sheet.\nAn even bigger winner in Italy on the day was media company Mediaset, which closed the day a huge 32% higher following news that the company is resisting a hostile takeover bid from French firm Vivendi.\nHere's the index-wide chart:\nInvesting.com\nThe mood in Europe was dictated by the upcoming Federal Reserve meeting on Wednesday, when the Fed is expected to hike interest rates for the first time since the end of 2015, pushing its key interest rate up to 0.75%.\nIn Britain, stocks climbed after the latest inflation data was released by the Office for National Statistics. T he ONS said that the UK's consumer price index — the key measure of inflation — was 1.2%, up from 0.9% in October, and ahead of the 1.1% forecasted by economists.\nCore inflation figures, which strip out volatile goods like oil and food, rose to 1.4% in the month, up from 1.2% at the previous reading, and ahead of the predicted 1.3%.\nThe FTSE 100 ended the day 1.15% higher, boosted by a 4.2% gain from Rolls-Royce, along with a 3.9% pick-up from BT Group. Here's the FTSE's chart:\nInvesting.com\nAnd here's how Europe as a whole shaped up:","url":"https://www.businessinsider.com/european-stock-price-movements-on-tuesday-december-13-2016-12"}
