{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:11:08","date_modify":"2018-10-30 23:11:08","date_publish":"2018-07-23 00:00:00","description":"BI PRIME: This week is paradise for stock pickers, according to Bank of America Merrill Lynch's equity and quant strategists. They observed a consistent earnings-season trend since 2009 that provides many opportunities for short-term traders.","filename":"data/vaneerConsumption/StockmarketearningsseasonparadisestartsthisweekBAMLsays.json","image_url":"https://amp.businessinsider.com/images/5b55e3033b49fc1b008b45b5-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-earnings-season-paradise-bank-of-america-2018-7_1540941068.html","title":"Stock market earnings-season paradise starts this week, BAML says","title_page":"    Stock market earnings-season paradise starts this week, BAML says - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Earnings season is in it's busiest week, making it ideal for stock pickers, according to Bank of America Merrill Lynch. Erik De Castro/Reuters\nThis is one of the most important weeks of the year for stock pickers.\nIt's the busiest of the second-quarter earnings season, with Alphabet, Boeing, Facebook, and AT&T among the companies about to report their results. Altogether, 39% of companies on the S&P 500 will report earnings this week, and it's going to be a \"stock picker's paradise,\" according to Savita Subramanian, Bank of America's head of US equity and quant strategy.\nDuring the busiest periods of earnings season, short-term traders can capitalize on the outperformance of companies that crush earnings expectations relative to the rest of the market. This differentiation has been consistently higher since 2009, and is stronger when more companies announce results.\nBank of America Merrill Lynch\nThe busiest days of earnings season are July 23-26 and July 30-August 1.\nEven before the busiest period, companies are off to a strong start. According to Subramanian, 81% of companies beat on earnings per share and 67% have outnumbered sales expectations. These are \"near-record\" proportions, suggesting there's more to come, Subramanian said.\n\"Companies which beat on EPS and sales have outperformed by 1.5ppt the following day, still below the historical average of 1.6ppt but so far the highest we've seen in seven quarters.\"\nThe best opportunities in this \"paradise\" can be found in the tech and healthcare sectors, according to Subramanian. That conclusion was based on a study of how many companies in each sector surprise analysts with better-than-forecast profits relative to disappointments. In the first quarter, the ratio of EPS and sales beats to misses for tech companies was 21.5, much higher than second-placed healthcare at 6.6. It was just 1.3 for telecom companies.\n\"Given positive surprises tend to persist, sectors with a higher ratio of positive to negative surprises in the previous quarter may be more likely to enjoy similar results in the current quarter,\" Subramanian said.\nUtilities and staples came out as the least attractive sectors.","url":"https://www.businessinsider.com/stock-market-earnings-season-paradise-bank-of-america-2018-7"}
