{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:09:39","date_modify":"2018-10-30 19:09:39","date_publish":"2016-11-09 13:34:55","description":"It should not be surprising that anticipation of Donald Trump’s presidential victory caused a 900-point plunge in the Dow Jones stock average.","filename":"data/vaneerConsumption/StockMarketCrashAnticipatingTrumpsWinisJustLikeReagan.json","image_url":"https://media.breitbart.com/media/2016/11/Trump-stock-market-crash-Michael-Probst-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_09__1540926579.html","title":"Stock Market Crash Anticipating Trump’s Win is Just Like Reagan","title_page":"Stock Market Crash Anticipating Trump’s Win is Just Like Reagan","title_rss":"NULL","source_domain":"breitbart.com","text":"It should not be surprising that anticipation of Donald Trump’s presidential victory caused a 900-point plunge, over several days, in the Dow Jones stock average. Wall Street sent stocks down by over 20 percent after Ronald Reagan won the presidency.\nThe only Wall Street research and institutional advisory firm that saw a higher probability of a Donald Trump victory was Strategas Research Partners. Their analysts gave a 42 percent probability of a Trump win, due to the FBI’s October 25 reopening of the Hillary Clinton email probe causing her negative ratings with voters to fall to Trump’s negatives.\nWhen Donald Trump first entered the race in June 2015, the Las Vegas betting parlors gave him less than a 1 percent probability of becoming President. On November 7, his election eve odds of winning the highest office in the land was just a 23.5 percent probability.\nTrump’s triumph is even more shocking to Wall Street, because the vast majority of analysts expected Democrats to win a four-seat majority in (and control of) the U.S. Senate, and be very close to taking the U.S. House.\nWith Republicans holding 54 Senate seats going into the election, Strategas projected that both the Senate and the House would stay comfortably in the hands of the Republicans.\nSince equity markets hate surprises, both Donald Trump’s and Ronald Reagan’s against-the-odds victories caused big short-term stock losses. But Trump now has the opportunity to follow President Reagan’s four point pro-growth plan for economic growth that reversed falling family incomes, raised millions out of poverty, and led to doubling of stock prices during his term:\nReagan cut tax rates to restore incentives for economic growth by slashing the 70 percent top personal income tax rate down to 50 percent, and gave a 25 percent across-the-board income tax rate reduction to everyone. Six years later, he reduced taxes to just two rates, 28 percent and 15 percent; Reagan cut spending by $31 billion, or 5 percent. The equivalent today would be a $175 billion cut. Even with Reagan’s defense buildup, which won the Cold War without firing a shot, total federal spending still declined from a high of 23.5 percent of GDP in 1983 to 21.2 percent of GDP by 1989; Regan’s anti-inflation monetary policy restrained money supply growth, which led to a stronger, more stable dollar value; Reagan used his executive authority to take deregulation actions that saved consumers over $100 billion per year in lower prices. Industrial production soared, leading to full employment with good paying jobs.\nReagan’s policies resulted in the most successful economic experiment in the history of the world. The Reagan recovery was the longest peacetime expansion in American history. The longest previous expansion was just 58 months.\nPresident Reagan’s expansion only ended in July 1992, when President George H.W. Bush’s tax increase caused a nasty recession.","url":"https://www.breitbart.com/politics/2016/11/09/stock-market-crash-trumps-win-just-like-reagan/"}
