{"authors":["Michael Paulenoff"],"date_download":"2018-10-30 23:35:38","date_modify":"2018-10-30 23:35:38","date_publish":"2018-07-18 00:00:00","description":"The charts are pointing to the potential for a retest of all-time highs with the potential for the S&P 500 to climb over the 3,000 level.","filename":"data/vaneerConsumption/StockmarkettechnicalanalysisforSP500.json","image_url":"https://amp.businessinsider.com/images/524c63a7ecad045c030d823d-2732-1365.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-technical-analysis-for-sp-500-2018-7_1540942538.html","title":"Stock market technical analysis for S&P 500","title_page":"    Stock market technical analysis for S&P 500 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"SPX Big Picture Nearer-Term Scenario\nMy big picture work in the cash SPX shows that the most recent upleg off of the June 28 low at 2,691.99 has climbed to a new high at 2816.25, or +4.6%, and in so doing, has hurdled its prior two significant rally peaks at June 13 (2,791.47) and at March 13 (2,801.90), and positions the index for upside continuation to my next optimal target zone of 2845-2860. Should such a scenario unfold, SPX in effect, will be climbing towards a test of its all-time high at 2,872.87 (January 26). Only a break below 2,789 will trigger initial signals that the June-July upleg needs a breather.\nMPtrader\nSPX Intermediate-Term Scenario:\nWhat if, all of the action since the January high at 2,872.87 turns out to morph into a 7-month accumulation period? As Larry Kudlow intimated this morning in his Delivering Alpha interview, he remains open minded to the idea that after eight years of subdued business activity and growth, just maybe the US economy is only starting to shift into a faster gear precipitated by the unleashing of regulations, tax benefits, and pent-up demand from shelved capex from the Obama years?\nHis suggestion dovetails with a potentially very bullish scenario that we see on the below SPX chart, that views the past seven months as an accumulation/corrective base formation that is putting increasing upward pressure on the price structure, and is just beginning to \"squeeze\" SPX to the upside. Such a scenario projects to targets at 2,930/60 and at 3,040/70 to reflect the economic \"combustion.\" Again, if SPX weakens, breaks, and sustains beneath 2,789, then all bets are off about a forthcoming squeeze.\nI am just thinking out loud here as I look at the SPX set up from various angles.","url":"https://www.businessinsider.com/stock-market-technical-analysis-for-sp-500-2018-7"}
