{"authors":[],"date_download":"2018-10-22 21:03:33","date_modify":"2018-10-22 21:03:33","date_publish":"2014-05-05 13:29:51","description":"Stocks close higher, with the Dow rebounding from a triple-digit morning drop, on an upbeat report on the services sector.","filename":"data/vaneerConsumption/StocksCloseHigherAfterDowRecoversFromTripleDigitAMDrop.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_stocks-close-higher-after-dow-recovers-triple-digit-am-drop-n97161_1540242213.html","title":"Stocks Close Higher After Dow Recovers From Triple-Digit AM Drop","title_page":"Stocks Close Higher After Dow Recovers From Triple-Digit AM Drop","title_rss":"NULL","source_domain":"nbcnews.com","text":"Stocks advanced on Monday, with the Dow rebounding from a triple-digit morning drop, as an upbeat report on the services sector countered concern about the conflict in Ukraine and growth in China.\nThe Dow Jones Industrial Average, which had initially fallen almost 150 points, recovered later in the day and closed unofficially 17 points ahead. The S&P 500 added 3 points and the Nasdaq put on 14.\nThe morning's sharp drop eased after the release of the Institute for Supply Management's non-manufacturing index for March, which found the service sector grew at its fastest clip in eight months. The ISM report said U.S. manufacturing growth accelerated for a third straight month in April, boosted by a pickup in employment growth. The index of national factory activity rose to 54.9 in April, up from 53.7 in March. It was the best reading since December.\nThe report beat analyst expectations for a reading of 54.3, though the index remains below November's recent peak of 57, which was the highest since April 2011.\n\"We got the drop down as a reaction to a weaker overseas, but then ISM for non-manufacturing came out and investors decided things aren't that bad, that we're not heading into a recession, so maybe it's okay to buy stocks,\" said Paul Nolte, SVP and portfolio manager at Kingsview Asset Management in Chicago.\nEarlier, stocks fell on jitters about UIkraine, after pro-Russian separatists ambushed Ukrainian forces on Monday, setting off fighting around a rebel stronghold a day after a Ukrainian police station was targeted in Odessa.\nPfizer shares dropped over 2 percent after posting earnings that missed estimates. Target fell 3 percent after news Chief Executive and Chairman Gregg Steinhafel would depart the discount retailer in the aftermath of the massive data breach late last year.\nMarkets were negatively affected also by HSBC Holdings and Markit Economic's report showing its index of Chinese manufacturing contracted in April for a fourth straight month.\nOn the New York Mercantile Exchange, crude fell 28 cents to $99.48 a barrel; gold futures rose $6.40 to $1,309.30 an ounce. The dollar fell against other global currencies and the 10-year Treasury yield rose 2 basis points to 2.605 percent.","url":"https://www.nbcnews.com/business/markets/stocks-close-higher-after-dow-recovers-triple-digit-am-drop-n97161"}
