{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:10:53","date_modify":"2018-10-31 00:10:53","date_publish":"2018-07-12 00:00:00","description":"BI PRIME: Defensive sectors of the stock market have recently outperformed cyclical growth sectors. Strategists at Morgan Stanley, Bank of America, and elsewhere have offered different analyses of what this implies.","filename":"data/vaneerConsumption/Stockmarketrotationtodefensiveswhatitmeansforinvestors.json","image_url":"https://amp.businessinsider.com/images/5b466559f2052936008b462d-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-rotation-to-defensives-what-it-means-for-investors-2018-7_1540944653.html","title":"Stock market rotation to defensives: what it means for investors","title_page":"    Stock market rotation to defensives: what it means for investors - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders work on the floor of the NYSE in New York Thomson Reuters\nInvestors are a lot more defensive of late.\nSince mid-June, so-called defensive sectors that are preferred when investors sense a meltdown is approaching have outperformed cyclicals, which tend to be supported by a booming economy.\nIt's a rotation that Morgan Stanley's equity strategists have been writing to clients about all year. In their view, hot sectors like technology, which have been driving the market's gains, would eventually give way to defensive sectors like utilities.\nAs the telecoms, real estate, and consumer-staples sectors joined utilities in outperforming, it signaled to them that the market had shifted. \"We think this is likely to continue and could portend a more difficult market environment overall as we enter the seasonally worst time of the year,\" Mike Wilson, the chief US equity strategist, said in a note on Monday.\nThe chart below shows how this has rotation has played out:\nMorgan Stanley\nWilson downgraded the tech sector while upgrading consumer staples and telecoms.\nBlackRock, the world's largest asset manager, is also more modestly bullish on the market.\nWhile Morgan Stanley has downgraded tech to underweight, BlackRock is leaning into the sector. However, the key is to identify quality stocks, or those with plenty of cash, minimal debt, and strong earnings growth.\n\"We prefer to take risk in equities and still favor momentum,\" Richard Turnill, BlackRock's global chief investment strategist, said in the firm's mid-year outlook on Monday. \"Momentum has been the market leader, but quality companies demonstrating high profitability and low leverage have also outperformed global equities broadly.\"\nOther strategists view the consequence of the rotation away from growth sectors slightly differently.\n\"I think it's a big head fake,\" Chris Hyzy, the chief investment officer of Bank of America Global Wealth and Investment Management, told Business Insider in a recent interview.\n\"In most cycles — but particularly in this cycle — when the defensives began to outperform, it was one of two reasons: the search for yield, or risk aversion was going up.\" Hyzy cited the latter as the reason why defensives have outperformed. He pointed to the growth slowdowns in Europe and Japan earlier this year as reasons why investors shied away from risk assets.\n\"We think it [the stock market] will go back to cyclical growth based upon fundamentals,\" Hyzy said.\nFor Kate Warne, the investment strategist at Edward Jones, the rotation is a short-term move related to the fact that US interest rates are rising.\n\"We actually think most investors would be better off paying less attention to those short-term types of shifts from more cyclical to more defensives,\" Warne told Business Insider on Wednesday. Investors made a similar shift to defensive stocks after the February correction, and as Facebook and other tech companies were scrutinized for their handling of users' data.\nWarne added that although the bull market is not on the brink of ending, investors need to start positioning for when the time comes. But that doesn't involve rotating from growth to defensive sectors. She recommended short-term fixed income instruments, including credit-default swaps, as a way of earning higher yields as interest rates rise.\n\"We'd rather actually just own fixed income,\" Warne said. \"But we think that while technology is likely to lead, the other sectors aren't likely to lag as much as they have in the first part of the year.\"","url":"https://www.businessinsider.com/stock-market-rotation-to-defensives-what-it-means-for-investors-2018-7"}
