{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:11:49","date_modify":"2018-10-30 23:11:49","date_publish":"2018-07-21 00:00:00","description":"BI PRIME: Options traders are underestimating the volatility that could arise as companies report second-quarter earnings, according to a team of strategists at Goldman Sachs. They have a strategy that has profited every year since 1996.","filename":"data/vaneerConsumption/Stockmarketearningsseasonwinningstrategysince1996fromGoldman.json","image_url":"https://amp.businessinsider.com/images/5a32b714b0bcd5e3178b4d33-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-earnings-season-goldman-sachs-winning-strategy-since-1996-2018-7_1540941109.html","title":"Stock market earnings-season winning strategy since 1996, from Goldman","title_page":"    Stock market earnings-season winning strategy since 1996, from Goldman - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chris Hondros/Getty Images\nTraders are underestimating the gains that could be made during this earnings season, according to Goldman Sachs.\nThe average implied earnings-day move for second-quarter earnings, based on options-trading activity, is 4.2%, Goldman's John Marshall said in a recent note. That's down from last quarter and the 11-year average.\nWhile earnings-growth surprises remain the most important catalyst for stock prices, traders are betting on smaller rewards after a rally last year and early in 2018 that some strategists described as parabolic.\nAdditionally, analyst forecasts suggest that first-quarter earnings growth, the strongest for the S&P 500 in seven years, represented a peak. According to FactSet, earnings growth for the second quarter is projected at 20%, down from 23% in Q1. Earnings are expected to continue slowing through the first half of 2019.\nIn spite of this, Marshall is recommending an options strategy designed to profit from higher volatility during this earnings season: buying call options, or bets that stocks that beat earnings estimates will spike.\nSpecifically, it has been profitable to buy out-of-the-money call options five days before earnings announcements and sell one day after. Call options give the buyer the right, not the necessity, to buy an asset at a certain price. When out of the money, the price at which the option can be exercised is higher than the current trading price.\n\"Call buying has been profitable ahead of earnings in each year on aggregate since 1996,\" Marshall said. \"While the returns from call buying in 1Q2018 and 2Q2018 were negative, we expect this to reverse this quarter.\"\nMarshall also cautioned that despite the strong track record of this strategy, it may fail this time.\nGoldman Sachs\nThat trend could reverse because this earnings season is set to be more volatile than options markets are pricing in, Marshall said. In second-quarter earnings releases, investors will be looking out for the way tariffs are affecting companies as well as the continued impact of tax cuts and wage inflation, among other issues. All these moving parts should make for an eventful season.\n\"Separately, we note that single stock options market implied moves are the lowest of the year relative to subsequent earnings-day moves in the July quarter,\" Marshall said. \"Together, these studies suggest that option buyers have seasonality in their favor in July.\"","url":"https://www.businessinsider.com/stock-market-earnings-season-goldman-sachs-winning-strategy-since-1996-2018-7"}
