{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:11:40","date_modify":"2018-10-30 23:11:40","date_publish":"2018-07-21 00:00:00","description":"BI PRIME: An indicator of the so-called smart money on Wall Street has been in free fall for most of this year, and Morgan Stanley's equity strategists say it's a bad signal for the market.","filename":"data/vaneerConsumption/StockmarketsmartmoneyindicatorisbadsignalMorganStanleysays.json","image_url":"https://amp.businessinsider.com/images/5aafc78f873dc626008b49f3-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stock-market-smart-money-indicator-bad-signal-morgan-stanley-says-2018-7_1540941100.html","title":"Stock market smart-money indicator is bad signal, Morgan Stanley says","title_page":"    Stock market smart-money indicator is bad signal, Morgan Stanley says - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The \"smart money\" is sending a bad signal about the stock market, Morgan Stanley says. REUTERS/Brendan McDermid\nIf you're looking for reasons to be cautious about the stock market, Morgan Stanley has a chart you'd want to look at.\nIt's shows the Smart Money Index, which is called that because it tracks the Dow Jones industrial average outside the first half-hour of trading, when activity is believed to be driven by emotions. The cooler, more professional heads trade toward the end of the day.\nStudying trading patterns at various times of the day can be useful for tactical traders. For example, the tail end of a quarter is sometimes volatile as fund managers perform portfolio rebalancing. Also, earlier this year, Bespoke Investment Group observed a trend of last-hour selling in contrast to 2017 when stocks would open lower but then ramp up into close.\nWith this index, Morgan Stanley is making the point that the smart money — a nickname for large, professional investors — is sending a dire signal about the stock market. The smart-money index is viewed as a leading indicator for where the stock market is headed.\nMorgan Stanley\n\"The price action between 10-4 p.m. is deemed to be the money that is better informed (a.k.a. 'smart'),\" Mike Wilson, Morgan Stanley's chief US equity strategist, said in a client note on Monday.\n\"When this index broke out in March 2016, it was a very positive signal that proved to be right and in line with our own thinking at the time that it's the business and earnings cycle that matters much more than the political one. We think this time, the 'smart' money is well aware of the same issues we have been highlighting all year such as lower quality earnings growth, a real risk of margin pressure, tighter financial conditions than most appreciate and political issues (trade tensions) that may prove to be a bigger headwind for the business cycle than the typical politics as usual.\"\nWilson's note came a week after he urged clients to take a full-on defensive posture in the stock market, ahead of an expected rotation to sectors like utilities and real estate. He said the market's turning point arrived in mid-June, when these defensive sectors started to outperform growth and momentum-driven sectors like tech.\nHe said Monday that some clients had pushed back on this call and were unwilling to pare risk in their portfolios. They argued, for example, that the more expensive tech stocks had earned their premium valuations because of how transformative the companies are.\n\"Our take is that the crowding has reached its limits, because it's no longer fundamentally driven but about performance,\" Wilson said. Savita Subramanian, his counterpart at Bank of America Merrill Lynch, published a note Monday showing that Facebook, Amazon, Apple, Netflix, and Google/Alphabet— the FAANG stocks — contributed to 98% of the S&P 500's total return in the first half of the year.\nAt the very least, it's time to think about reducing exposure to the risk of a crack in tech stocks, Wilson said.\n\"If we are wrong,\" he said, \"we should know fairly quickly and will not be slow to admit our mistake and reverse our call.\"","url":"https://www.businessinsider.com/stock-market-smart-money-indicator-bad-signal-morgan-stanley-says-2018-7"}
