{"authors":["Phil Medlicott","Press Association"],"date_download":"2018-10-23 01:58:42","date_modify":"2018-10-23 01:58:42","date_publish":"2016-01-29 16:13:56","description":"Stoke boss Mark Hughes feels Saturday's FA Cup fourth-round trip to Crystal Palace can provide a significant pick-me-up for his side after their Capital One Cup semi-final disappointment.","filename":"data/vaneerConsumption/StokebossMarkHughestargetingFACuprunafterCapitalOneCupheartbreak.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/309BFA7700000578-0-image-a-44_1454084032760.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423075_Stoke-boss-Mark-Hughes-targeting-FA-Cup-run-Capital-One-Cup-heartbreak_1540259922.html","title":"Stoke boss Mark Hughes targeting FA Cup run after Capital One Cup heartbreak","title_page":"Stoke boss Mark Hughes targeting FA Cup run after Capital One Cup heartbreak  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stoke boss Mark Hughes feels Saturday's FA Cup fourth-round trip to Crystal Palace can provide a significant pick-me-up for his side after their Capital One Cup semi-final disappointment on Tuesday.\nThe Potters lost the League Cup clash with Liverpool via a penalty shoot-out they had forced by finishing 1-0 up on the night after 120 minutes of the second leg at Anfield, making it 1-1 on aggregate.\nThis weekend's contest is the third of four straight away games for Hughes' men.\nMark Hughes feels Saturday's FA Cup fourth-round trip to Crystal Palace can provide a pick-me-up for his side\nThe Potters lost their League Cup semi-final clash with Liverpool via a penalty shoot-out in midweek\nAnd the Welshman, whose team lost a Barclays Premier League match at Leicester last Saturday and face another at Manchester United next Tuesday, said: 'It is a tough period we are in, with away games with very little respite.\n'But we want to get positive results on the board, and we want to progress in the FA Cup.\n'The disappointment of not getting to a Wembley final is still with us, so to progress in another competition that leads to Wembley would be a great tonic.'\nHughes won the FA Cup four times - as well as plenty of other trophies - as a player, but is still searching for his first piece of silverware as a manager.\nAnd although he is set to ring the changes to his side this weekend, he has stressed the importance of the selection still being 'strong'.\n'It's a great competition and we want to stay in it,' Hughes said. 'There's only so many competitions we can win and the FA Cup now is the only one realistically - so why wouldn't you have a go? We are certainly of that mindset.\n'It is a competition that was very good to me as a player and as a manager I'd love to have success in it.'\nStoke's Premier League rivals Palace - currently 11th in the table, two places and two points worse off than the Potters - could give a debut to Emmanuel Adebayor on Saturday after he joined them this week on a deal to the end of the season.\nPeter Crouch (pictured) and Marc Muniesa both saw their penalties saved by Simon Mignolet\nEmmanuel Adebayor in training action during his time at Manchester City under then boss Mark Hughes\nAdebayor last played a competitive match in May, the striker having been a free agent since his release from his contract with Tottenham in September.\nThe 31-year-old former Arsenal, Manchester City and Real Madrid man has a reputation for being problematic for the managers he is under.\nBut Hughes, who signed Adebayor for City, has praised the Togolese player and backed him to shine for Palace.\n'He is a great player,' Hughes said. 'If you get him going and on fire, then he is a real handful.\n'I had him at Man City. For whatever reason he seems to court a little bit of bad publicity about himself as a person and as a player, but I never really experienced it - I enjoyed working with him.","url":"https://www.dailymail.co.uk/sport/football/article-3423075/Stoke-boss-Mark-Hughes-targeting-FA-Cup-run-Capital-One-Cup-heartbreak.html"}
