{"authors":["Press Association"],"date_download":"2018-10-22 23:17:46","date_modify":"2018-10-22 23:17:46","date_publish":"2016-01-29 10:58:56","description":"Stoke boss Mark Hughes admits it is \"nice\" to be linked with Chelsea but has stressed it is just speculation and that he is \"very happy\" in his current job. ...","filename":"data/vaneerConsumption/Stokebossmarkhughesplaysdownchelsealink.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-fdcc22b6-88c4-4c3c-a0aa-4847ce6b38a8-3bmscybNe842cce83474b5489ac6-274_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421404_Stoke-boss-Mark-Hughes-plays-Chelsea-link_1540250266.html","title":"Stoke boss mark hughes plays down chelsea link","title_page":"Stoke boss mark hughes plays down chelsea link | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stoke boss Mark Hughes plays down Chelsea link\nStoke boss Mark Hughes admits it is \"nice\" to be linked with Chelsea but has stressed it is just speculation and that he is \"very happy\" in his current job.\nReports this week have suggested the Welshman is among several managers the Blues are considering as they look for a permanent successor to Jose Mourinho.\nWhen asked about that on Thursday, Hughes - whose side lost on penalties in Tuesday's Capital One Cup semi-final second leg at Liverpool, and are ninth in the Barclays Premier League - said: \"It's just speculation.\nStoke manager Mark Hughes played for Chelsea between 1995 and 1998\n\"There is a little bit of speculation about certain roles in the Premier League at the moment, and at some point, if you have a decent spell, you get mentioned in dispatches. I think it is no more and no less than that.\n\"I think everyone just tries to cover all bases and mentions everybody, and this week I got a mention.\n\"It's nice to be mentioned I suppose, because that reflects well maybe on me but more so on the players and how well they are doing, which is how it should be because we are having a decent season.\n\"But we are fully focused here and enjoying what we are doing.\n\"It is a good time to be at Stoke. Everybody feels we are going in the right direction and building something. So I'm very happy.\"\nHughes - whose own contract with Stoke runs until 2019 - also dismissed talk of the club preparing to enter talks with forward Bojan Krkic over a new deal.\n\"I'm not quite sure where that's come from,\" Hughes said.\n\"Bojan has two-and-a-half years left on his contract, so it seems a little bit premature to be talking about that.\"\nHughes was speaking ahead of Saturday's FA Cup fourth-round trip to Crystal Palace, where Stoke will be without midfielder Charlie Adam.\nAdam was forced off in Tuesday's contest with a calf tear, and Hughes revealed on Thursday the Scot is facing five to six weeks out.\nThere was more positive news regarding skipper Ryan Shawcross, who had been ruled out for up to a month earlier this week by a back problem.\n\"He feels a lot better and the injury seems to be settling down,\" Hughes said of the defender.\n\"Initially we said three to four weeks, but hopefully it will be sooner than that.\"\nMarko Arnautovic will have his condition checked after taking some knocks on Tuesday, while Geoff Cameron (ankle) remains sidelined.\nMeanwhile, Hughes says Stoke are \"still hopeful\" of being active before the transfer window closes on Monday, with them yet to have brought any new signings in so far this month.\n\"We're still hopeful - but a few of the things we are involved in need to accelerate a little bit more quickly,\" Hughes said.\n\"If they don't, then we will probably run out of time. But what we've already got isn't bad at the moment.","url":"https://www.dailymail.co.uk/wires/pa/article-3421404/Stoke-boss-Mark-Hughes-plays-Chelsea-link.html"}
