{"authors":["Laurie Whitwell For Mailonline"],"date_download":"2018-10-23 02:14:56","date_modify":"2018-10-23 02:14:56","date_publish":"2016-01-28 17:00:38","description":"Mark Hughes will only make a signing this January if significant progress is made quickly, although injury to Charlie Adam may impact his pursuit of Porto's Giannelli Imbula.","filename":"data/vaneerConsumption/StokebossMarkHugheshopefulofJanuarysigningandhintsPortowouldsellGiannelliImbulaforlessthan38mclause.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC7B8100000578-0-image-a-32_1454000434850.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-3421342_Stoke-boss-Mark-Hughes-hopeful-January-signing-hints-Porto-sell-Giannelli-Imbula-38m-clause_1540260896.html","title":"Stoke boss Mark Hughes 'hopeful' of January signing and hints Porto would sell Giannelli Imbula for less than £38m clause","title_page":"Stoke boss Mark Hughes 'hopeful' of January signing and hints Porto would sell Giannelli Imbula for less than £38m clause | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mark Hughes will only make a signing this January if significant progress is made quickly, although injury to Charlie Adam may impact his pursuit of Porto's Giannelli Imbula.\nAdam has been ruled out for up to six weeks with a torn calf muscle, while Geoff Cameron has suffered a minor setback on his ankle problem, leaving Hughes a little light on midfield options.\nImbula, 23, is a target but reports have claimed Porto are refusing to budge on the France Under 21 international's €50million (£38m) release clause, a figure Stoke would not contemplate paying.\nFrench midfielder Giannelli Imbula (right) is wanted at the Britannia Stadium this winter\nImbula (right) has a colossal release clause with Porto, which Mark Hughes did not want to discuss\nAsked directly about Imbula and his cost, Hughes seemed to hint Porto's fee is lower in reality. 'We have discussions about a lot of players, I will not highlight an individual,' he said. 'Of all the players we are interested in we have all the information we need.'\nThe Stoke manager said he was 'hopeful' of doing at least one deal but added: 'It's fair to say the few things we're involved in need to accelerate more quickly. If they don't not we'll probably run out of time, we won't get anything done. We go with what we have, which isn't bad.\n'We'd like to add if we think the right person is available and we can bring them to the club, but if it's a case of having to wait we'll do that.\n'It's not easy to get players over the line. There is a danger sometimes that if you go from you're immediate target and then that falls by the wayside, all of a sudden you start scrambling around thinking you need to do some business when sometimes what you have in the building is more than adequate.\nCharlie Adam (left) has suffered a torn calf muscle\n'I've been through this process a long time so I understand that. There will be no hurried decision. There wont be any last-minute deals that we haven't though through and done work on.'\nOn Adam, Hughes said: 'Charlie unfortunately has a pretty bad tear in his calf so is likely to be out five to six weeks. So that's a blow for him and us.\n'We'll have to compensate for that. But we have good players in the building so we should be fine.'\nCameron's ankle injury should begin to resolve itself in the next few days, Hughes said. But the American has been out since January 5.\nRyan Shawcross's back injury looks better than anticipated, however. 'He is quite positive at the moment, feels a lot better within himself,' said Hughes. 'The injury seems to be settling down. It was initially three to four weeks, we hope it will be sooner.'\nHughes played down suggestion contract talks had been opened with Bojan.","url":"https://www.dailymail.co.uk/sport/article-3421342/Stoke-boss-Mark-Hughes-hopeful-January-signing-hints-Porto-sell-Giannelli-Imbula-38m-clause.html"}
