{"authors":["Kelli Serio"],"date_download":"2018-10-30 18:32:23","date_modify":"2018-10-30 18:32:23","date_publish":"2015-10-13 16:54:50","description":"Shia Labeouf has taken his method acting too far this time, seemingly finding it difficult to distinguish real life from a character he played in a recent film.","filename":"data/vaneerConsumption/StolenValorShiaLaBeoufLiestoCopsAboutMilitaryServicetoAvoidArrest.json","image_url":"https://media.breitbart.com/media/2015/10/Shia-fury-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_13__1540924343.html","title":"Stolen Valor: Shia LaBeouf Lies to Cops About Military Service to Avoid Arrest","title_page":"Stolen Valor: Shia LaBeouf Lies to Cops About Military Service to Avoid Arrest | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Shia LaBeouf has taken his method acting too far this time, seemingly finding it difficult to distinguish real life from a character he played in a recent film.\nTMZ reports the Transformers actor was arrested for a misdemeanor public intoxication in Austin, Texas this past weekend, and allegedly told his arresting officers they had to let him go because he is a member of the United States military.\nLocal police initially stopped LaBeouf, who was in the Texas capital last Friday for a music festival, after he jaywalked across a busy street in downtown Austin and appeared to be under the influence of alcohol and/or marijuana.\nAfter multiple, failed attempts to break free from police officers, telling authorities they had to let him go because LAPD killed one of his friends, Labeouf allegedly became agitated, said he was a member of the National Guard, and barked, “Do whatever the f*ck you gotta do!”\nIt turns out LaBeouf has been spreading falsehoods about his military service for several months.\nBreitbart News previously reported the actor exuded several instances of bizarre behavior to prepare for his role in the WWII epic Fury, even cutting his face on set and getting a tooth pulled, but took it a step further by claiming to have joined the military.\n“The day I got the job, I joined the US National Guard. I was baptized – accepted Christ in my heart – tattooed my surrender and became a chaplain’s assistant to Captain Yates for the 41st Infantry,” he told Dazed magazine ten months ago. “I spent a month living on a forward operating base. Then I linked up with my cast and went to Fort Irwin.”\nHere is the real story behind LaBeouf’s alleged service in the United States National Guard, as told by Fury director, David Ayer.\n“The rumors are all fun, but at the end of the day you have a guy who’s a child actor and is seen and known for a body of work but happens to be the real deal,” Ayer told Esquire.\n“He was all in. He went and embedded himself with the National Guard unit, he started prep before anybody. He shadowed a military chaplain, learned how to minister to troops, scripture, he really went in deep in these incredible ways,” Ayer continued.\nWhile LaBeouf’s work ethic regarding his acting career may be commendable, lying about enlisting and serving in the military is not.\nIt is nothing more than a high-profile case of stolen valor.\nUnfortunately for the actor, “embedded” and “shadowed” do not constitute a true form of actual service in the national guard.\nJoining the military is a serious commitment, which requires members to sign an enlistment contract, and to literally sign their lives away for the greater good of others.\nSoldiers don’t come and go as they please.\nLaBeouf is an actor, not a soldier. Playing a hero is easy when you’ve never served a tour alongside thousands of them.","url":"https://www.breitbart.com/entertainment/2015/10/13/stolen-valor-shia-labeouf-lies-cops-military-service-avoid-arrest/"}
