{"authors":["Press Association"],"date_download":"2018-10-22 23:31:00","date_modify":"2018-10-22 23:31:00","date_publish":"2017-03-16 07:03:08","description":"Severe bleaching is killing coral in Australia´s Great Barrier Reef.","filename":"data/vaneerConsumption/Stoppingglobalwarmingonlywaytosavecoralreefsstudyfinds.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-226971-1489647796-461_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319084_Stopping-global-warming-way-save-coral-reefs-study-finds_1540251060.html","title":"Stopping global warming only way to save coral reefs, study finds","title_page":"Stopping global warming only way to save coral reefs, study finds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A war on global warming is the only way to save the world’s coral reefs, researchers have said.\nReducing pollution and curbing overfishing will not prevent the severe bleaching that is killing coral at catastrophic rates, according to a study of Australia’s Great Barrier Reef.\nScientists say that local protection of reefs can help damaged coral recover from the stress of rising ocean temperatures.\nBut the new research shows that such efforts are ultimately futile when it comes to stopping heat-induced bleaching in the first place.\n“We don’t have any tools to climate-proof corals,” said Terry Hughes, director of Australia’s ARC Centre of Excellence for Coral Reef Studies and lead author of the study published in the journal Nature.\n“That’s a bit sobering. We can’t stop bleaching locally. We actually have to do something about climate change.”\nUndated handout photo issued by the WWF of Australia's Great Barrier Reef which has been hit by mass coral 'bleaching' for the second year in a row\nAcross the world, scores of brilliantly coloured coral reefs once teeming with life have in recent years become desolate, white graveyards.\nTheir deaths due to coral bleaching have grown more frequent as ocean temperatures rise, mainly due to increasing greenhouse gases in the atmosphere.\n(WWF/PA)\n(WWF/PA)\nThe hot water stresses corals, forcing them to expel the colourful algae living inside them, which leaves the corals vulnerable to disease and death.\nGiven enough time, bleached coral can recover if the water cools, but if the temperature stays too high for too long, the coral will die. Preserving coral reefs is crucial, given that humans depend on them for everything from food to medical research and protection from damaging coastal storms.\nThe researchers conducted aerial and underwater surveys of the Great Barrier Reef, which has experienced three major bleaching events, the worst of which occurred last year.\nThe scientists found that the severity of bleaching was tightly linked to how warm the water was.\nIn the north, which experienced the hottest temperatures, hundreds of individual reefs suffered severe bleaching last year, regardless of whether the water quality was good or bad, or whether fishing had been banned.\nThat means even the most pristine parts of the reef are just as prone to heat stress as those which are are less protected.\nPrior exposure to bleaching also did not appear to provide any protective benefit to the coral.\nThe scientists found the reefs that were highly bleached during the first two events, in 1998 and 2002, did not experience less severe bleaching last year.\nUltimately, the study concluded, saving reefs from the ravages of bleaching requires urgent action to reduce global warming.\n“I think it’s a wake-up call,” Mr Hughes said.\n“We’ve been hoping that local interventions with water quality and fishing would improve the resistance of the corals to bleaching. We found no evidence that that’s actually true, at least during a very severe event.”","url":"https://www.dailymail.co.uk/wires/pa/article-4319084/Stopping-global-warming-way-save-coral-reefs-study-finds.html"}
