{"authors":["Robert Astorino","Rep. Paul Gosar"],"date_download":"2018-10-30 18:17:01","date_modify":"2018-10-30 18:17:01","date_publish":"2015-12-07 22:17:27","description":"HUD, with its AFFH rule, seeks to radically subvert local zoning laws in the United States.","filename":"data/vaneerConsumption/StopHUDsTakeoverofLocalZoning.json","image_url":"https://media.breitbart.com/media/2015/02/Department-of-Housing-and-Urban-Development-Flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_07__1540923421.html","title":"Stop HUD's Takeover of Local Zoning","title_page":"Stop HUD's Takeover of Local Zoning | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The founders of our nation understood that successful governance in a democracy depends on the consent of the governed.\nIn return for the people’s consent, they set limits on government, divided authority, and established checks and balances to control the use of power.\nThis system, which has served our nation well for more than 200 years, is now being put at risk by the rise of a regulatory dictatorship in Washington. Unelected bureaucrats in federal agencies under the direction of the Obama administration have taken enormous power unto themselves, all with the troubling intent of keeping their actions out of the reach of Congress.\nThe stories of administrative abuse from the IRS, the U.S. Attorney General, and the EPA are well known. Now, HUD is continuing the Obama Administration’s trend of executive overreach with its new Affirmatively Furthering Fair Housing regulation—an oxymoronic idea that only a bureaucrat could love. This ill-conceived rule aims to diversify our nation’s neighborhoods by homogenizing all their differences.\nSpecifically, the AFFH rule seeks to radically subvert local zoning laws in the United States—reengineering America’s neighborhoods to fit the administration’s utopian philosophy ” of what it thinks 1,200 communities around the country should look like. Failure to comply will put these local communities at risk of losing millions of dollars in federal funding.\nThe first problem with this misguided approach is that the real world is just too complicated to be reduced to a statistical formula concocted by bureaucrats in Washington. HUD even admits it cannot apply its new regulation uniformly because states like Vermont (95% white) don’t have enough minorities.\nElsewhere in the country, if your zip code doesn’t measure up to HUD’s ideals, the agency will be prescribing corrective measures, which essentially come down to running roughshod over local zoning ordinances. HUD has even questioned whether single-family, quarter-acre neighborhoods are discriminatory. In other words, if you now live in a neighborhood of single family homes, you could be living next to apartment buildings in the future, if that’s what HUD determines is needed to cure the demographic imbalances.\nThe epicenter of the fight against federal neighborhood engineering is Westchester County, N.Y.\nSince 2009, Westchester has been operating under an agreement with the federal government to build 750 units of affordable housing. The agreement settled a suit brought against a Democratic County Executive contending the county had taken money from HUD without properly analyzing impediments to building affordable housing.. There was no finding of liability against the county, but it agreed to develop the housing as part of the settlement.\nThe initial suit was brought by a group called the Anti-Discrimination Center. The ADC is an organization of two people, Craig Gurian and his wife, that pocketed $7.5 million from the settlement, none of which has gone toward affordable housing in Westchester. According to an investigation by Watchdog.org, “Gurian lives in and owns property worth millions—located far from the low-income housing developments he promotes.”\nPutting the legitimacy of the case aside, Westchester’s experience provides a canary in the coal mine with respect to the risks communities face from the arrival of HUD’s AFFH regulation.\nThe county has met every benchmark for developing the 750 units of affordable housing, and there has never been a finding that Westchester’s local zoning codes are discriminatory—a fact backed up by a recent opinion of the U.S. Court of Appeals for the Second Circuit.\nYet, the response from HUD has been to withhold $20 million in Community Development Block Grants from the county’s neediest residents—the very people HUD claims to champion—because the county refuses to ignore its thousands of pages of documentation showing there is no evidence that Westchester’s zoning laws are exclusionary and discriminatory.\nLet’s be clear. There is no place for discrimination in the United States. There are federal and state laws to protect the civil rights of every American, and housing discrimination has rightly been illegal since the 1960s. But we also have to be honest about what discrimination is and what it is not. The government should not be abusing its power against people and communities who have done nothing wrong. Zoning and discrimination are not the same thing. Zoning permits or prohibits what can be built and where, not who lives there.\nThe time has come to reign in runaway federal agencies. A simple, effective solution is at hand with respect to HUD: defund the agency’s ability to implement the AFFH regulation.\nThis spring, the U.S. House of Representatives passed the Gosar amendment to the Transportation, Housing and Urban Development and Related Agencies Appropriations Act for Fiscal Year 2016 that would zero out funding for the implementation of HUD’s AFFH rule A similar rider is currently before the Senate. Putting this defunding effort into the upcoming fiscal year 2016 omnibus spending bill would block HUD’s misguided AFFH rule—and equally important—would give elected officials the means to place a much needed check on administrative and executive overreach by the Obama administration.\nWashington has no business moving to unilaterally overturn our federal system of checks and balances and strip local governments of their control over zoning laws.\nIt is time Congress stopped accommodating such executive intrusions and pushed back against this overreach.\nPaul Gosar represents Arizona’s 4th congressional district in the U.S. House of Representatives. Robert P. Astorino is the Westchester County (N.Y.) Executive.","url":"https://www.breitbart.com/politics/2015/12/07/stop-huds-takeover-of-local-zoning/"}
