{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:38:48","date_modify":"2018-10-30 18:38:48","date_publish":"2015-01-23 20:49:35","description":"J Street, a George Soros-funded, far-left organization that styles itself as \"pro-Israel\" but spends its energy opposing Israeli policies, is trying to stop Israeli Prime Minister Benjamin Netanyahu from addressing Congress in a special session in March. |","filename":"data/vaneerConsumption/StopBibiJStreetGivesNetanyahutheSarahPalinTreatment.json","image_url":"https://media.breitbart.com/media/2015/01/Sarah-Palin-American-Flag-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_23__1540924728.html","title":"Stop Bibi: J Street Gives Netanyahu the Sarah Palin Treatment","title_page":"Stop Bibi: J Street Gives Netanyahu the Sarah Palin Treatment | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"J Street, a George Soros-funded, far-left organization that styles itself as “pro-Israel” but spends its energy opposing Israeli policies, is trying to stop Israeli Prime Minister Benjamin Netanyahu from addressing Congress in a special session in March.\nIn an email appeal, J Street President Jeremy Ben-Ami is urging supporters “to make sure that Congress knows Bibi’s upcoming speech to Congress shouldn’t go forward as scheduled” because “the timing here couldn’t be worse.”\nJ Street’s attempt to shut down the Netanyahu event reprises its infamous 2008 campaign against a scheduled appearance by Gov. Sarah Palin at a New York rally against the Iranian nuclear program. At that time, Democrats were concerned that Palin would share a platform with Hillary Clinton. Under pressure, Clinton withdrew, whereupon Democrats pressured organizers to disinvite Palin, partly on the grounds that the Vice Presidential candidate would make it a partisan rally.\nIn addition to the J Street campaign, Democrats allegedly threatened the Jewish organizations involved in the rally that they would jeopardize their IRS tax-exempt status if the demonstration went ahead as planned. The effort, which was one of the first tests of J Street’s clout in the Obama camp, and which many critics called a suppression of free speech, rendered the rally a flop. Palin later published a version the remarks she would have delivered at the rally in the New York Sun.\nIn addition to J Street, the liberal Anti-Defamation League (ADL) is also opposed to Netanyahu’s speech. The ADL’s Abe Foxman told the Jewish Telegraphic Agency that the Israel issue was “too important to politicize.” House Minority Leader Nancy Pelosi also criticized the invitation.\nThe Zionist Organization of America fired back on Friday, urging Foxman to apologize and congratulating the 79 Republicans and 19 Democrats who had signed a letter supporting the invitation.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/politics/2015/01/23/stop-bibi-j-street-gives-netanyahu-the-sarah-palin-treatment/"}
