{"authors":[],"date_download":"2018-10-30 01:08:31","date_modify":"2018-10-30 01:08:31","date_publish":"2018-07-13 00:05:04","description":null,"filename":"data/vaneerConsumption/StoptheFakeNewsThatHungaryIsAntiSemitic.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Bibi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861711.html","title":"Stop the Fake News That Hungary Is Anti-Semitic","title_page":"Stop the Fake News That Hungary Is Anti-SemiticThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Next week Hungarian Prime Minister Viktor Orban makes his first visit to the state of Israel. This symbolic and diplomatic event, considered against a consistent record of pro-Israel support and concrete measures to confront anti-Semitism in Hungary, should bring closure to the myth, popular among the Left, global Jewish organizations, and in the world press, of Hungary’s contemporary anti-Semitism. Instead of derision and conjecture, Orban deserves praise for his zero-tolerance policy on anti-Semitism and commitment to protecting all Hungarian citizens, including Hungary’s Jews.\nOrban’s July 18-20 visit is the bookend of Benjamin Netanyahu’s historic trip, exactly one year ago, to Budapest, during which Mr. Orban laid out in the clearest of terms his rejection of anti-Semitism and his desire for an enhanced Hungary-Israel relationship. The Hungarian leader even took Netanyahu’s visit as an opportunity to apologize for Hungary’s role in the Holocaust nearly 80 years ago, stating that “Hungary erred and sinned when it cooperated with the Nazis and did not protect its Jews during World War II” and further made clear that his government will guarantee the security of the country’s Jewish minority and that it has “zero tolerance for anti-Semitism.”\nHungary’s foreign minister, Péter Szijjártó,underscored Hungary’s partnership with Israel in a recent statement: “Bilateral relations between Hungary and Israel have never been as good as they are now.” Szijjártóeven positioned Hungary as one of the world’s defenders of Israel in International forums:\n“Achieving a balanced approach towards Israel on the part of the international community is one of the focal points of Hungarian foreign policy.”\nAnd these are not mere words. Hungary consistently proves through actions its resolve to tackle anti-Semitism within its borders as well as its friendship with Israel. To name but a few of its accomplishments in this regard:\nThe new “Fundamental Law of Hungary” entered into force in 2012, officially recognized Hungarian Jewry as an inseparable part of the Hungarian nation.\nBudapest will soon see the construction of the first new synagogue after 85 years.\nJust months after PM Orbán returned to power in 2010, Budapest’s oldest synagogue was rededicated — the first event of its kind in Central Europe in 60 years, which PM Netanyahu called “the symbol of a Jewish renaissance.”\nThe pensions of Holocaust survivors have been increased.\nLikewise, in international forums, Hungary’s support for Israel has been notable. On July 3, Hungary condemned the growing threat of anti-Semitism during the UN Human Rights Council’s 38th session in Geneva. In December, it abstained from a UN General Assembly vote condemning U.S. President Donald Trump’s recognition of Jerusalem, and also in May when the UNHRC voted to establish an investigation into the violence along Gaza’s border. It also joined with the Czech Republic and Romania to block a joint EU statement criticizing the U.S. embassy move to Jerusalem.\nThis approach of pro-Israel/Jewish support is corroborated by a discussion I had this week with a leading Hungarian Rabbi who shared that Orban is personally changing the equation by insisting to reference Hungary and the West’s “Judeo-Christian” values and heritage. The rabbi further indicated, while one may encounter the odd anti-Semitic attitude in day to day discussions, that Hungary’s Jews are far safer because, thanks to Orban’s immigration policies, there are no communities of disaffected Muslims in Hungary — the greatest existential threat to Jews and non-Jews alike in other European countries.\nWhy then does the mythology persist notwithstanding crystal clear evidence to the contrary? First, there is the Left’s declared war on patriotism and national exceptionalism espoused by Mr. Orban. Second, there is the rejection by the Left, of our Judeo-Christian heritage that is the foundation of Western Civilization. And finally, there is the Left’s disenchantment with Israel because it rejected the mantle of victimhood that progressives seek to cast upon it.\nMoreover, Jewish groups perpetuate the mythology of Hungary’s anti-Semitism by expressing alarm over its conflict with George Soros, who aims to bring immigrants Hungary does not want. Time and again, Soros uses his billions to bring unfavorable outcomes to the globe. There is indeed so much to criticize in his motivations and well-financed campaigns, but only the truly paranoid could discern anti-Semitism in opposing Soros, simply because he happens to be Jewish.\nThe world press and the Left treat Mr. Orban with the same derision that they do President Trump. Both leaders deploy policies that have proven to make their respective nations safer and more prosperous, but neither the methods nor the results fit the Left’s, nor the biased media’s narrative favoring globalism and multiculturalism at the expense of national sovereignty. So the achievements of these effective leaders are neglected by the news cycle, and replaced by manufactured negative allegations.\nKierkegaard said: “There are two ways to be fooled. One is to believe what isn’t true; the other is to refuse to believe what is true.” An avalanche of facts, notably, Victor Orban’s historic visit to Israel next week, proves how true were the Danish philosopher’s words in the invented delusion promulgated by the liberal media. Like the manufactured nonsense that Trump is racist or intolerant, it is beyond time to bury the delusional fiction that Hungary is anti-Semitic.\nLee Cohen is a Visiting Senior Fellow at the Danube Institute in Budapest. He is also a Senior Fellow in European Affairs at the London Center for Policy Research in New York.","url":"https://spectator.org/stop-the-fake-news-that-hungary-is-anti-semitic/"}
