{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 01:41:27","date_modify":"2018-10-31 01:41:27","date_publish":"2018-08-28 12:53:41","description":"Lots has changed for this Resistance icon since she first took on President Donald Trump over that non-disclosure agreement — and not just in the courtroom. According to a new Vogue profile, on her nationwide \"Make America Horny Again\" tour, she's…","filename":"data/vaneerConsumption/StormyDanielsNewFanBaseHasBeenMakingHerUneasyForThisReason.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/8a272806-0688-47c3-a0cf-6340577930a2-getty-961965056.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_stormy-daniels-new-fan-base-has-been-making-her-uneasy-for-this-reason-10259427_1540950087.html","title":"Stormy Daniels' New Fan Base Has Been Making Her Uneasy For This Reason","title_page":"Stormy Daniels' New Fan Base Has Been Making Her Uneasy For This Reason","title_rss":"NULL","source_domain":"bustle.com","text":"Lots has changed for this Resistance icon since she first took on President Donald Trump over that non-disclosure agreement — and not just in the courtroom. According to a new Vogue profile, on her nationwide \"Make America Horny Again\" tour, she's been attracting a whole new demographic. Instead of middle-aged white men, the \"so-called Resistance\" has been showing up to her tour stops, and these new fans make Stormy Daniels a bit uneasy.\n\"My fan base is completely different,\" Daniels told reporter Amy Chozick for Vogue. As she explained it, the white guys who used to buy her movies aren't showing up anymore, and in working class towns like Milwaukee, Wisconsin, the clubs won't always reach capacity. \"Those guys are just gone,\" she told the magazine. But in college towns like Madison, it's a full house. \"It’s pretty much these packs of women, and they are angry.\"\nThe reason this makes Daniels uneasy is that she's being turned into their liberal savior, when that wasn't exactly what she was going for when she went after the president. Daniels told Vogue:\nPeople come up and they’re so emotional and they put so much on me. They’re like, 'You’re going to save the world, you’re a patriot, you’re a hero.'\nIt’s funny. It’s actually easier for me to handle the negative stuff. It’s not like I turned on Twitter today and was called a whore for the first time.\nThe new support comes with its own complexities. \"There are people crying every night, and I’m like, 'There’s no crying in titty bars!'\"\nThere is new merchandise, though, that these new fans like more than the old naked photos. And some are generous when she's on stage. \"Women tip the best!\" she told the magazine.\nDaniels doesn't necessarily think of herself on the same political team as the fans from the Resistance. \"I’m not like some big Hillary supporter,\" she told Chozick. \"I’m a Republican.\" A socially liberal Republican, though, who supports abortion rights and LGBTQ rights — even if she lives in Texas, rides horses, and owns a gun.\nShe says that she didn't take on Trump for anyone but herself. \"When I started this, I just wanted to save my own ass,\" she told Vogue, \"not everybody else's.\"\nDaniels might end up doing both. The guilty plea from Trump's longtime fixer and personal lawyer Michael Cohen for campaign law violations may allow her lawyer Michael Avenatti to move forward with her lawsuit. \"How ya like me now?!\" Daniels tweeted the day the guilty plea became public.\nThe lawsuit was put on hold in the spring after agents raided Cohen's office, home, and hotel back in April. Shortly after, Cohen pleaded the Fifth Amendment in Daniels' civil lawsuit to avoid self-incrimination in the criminal investigation that was then underway by the FBI.\nBut now that Cohen has plead guilty to those charges, Avenatti argues he can be called as a witness in Daniels' case — and that could lead to Trump himself being deposed.\n\"The developments of today will permit us to have the stay lifted in the civil case & should also permit us to proceed with an expedited deposition of Trump under oath about what he knew, when he knew it, and what he did about it,\" Avenatti tweeted after Cohen's plea.\nDaniels is an uneasy Resistance icon — and also an effective one.","url":"https://www.bustle.com/p/stormy-daniels-new-fan-base-has-been-making-her-uneasy-for-this-reason-10259427"}
