{"authors":["Rachel Hubbard"],"date_download":"2018-10-23 00:46:26","date_modify":"2018-10-23 00:46:26","date_publish":"2014-05-21 00:00:00","description":"After a tornado hits, emergency crews looking for survivors in storm shelters face a problem: Streets and landmarks are suddenly unrecognizable. One Moore, Okla., firefighter developed an app to help.","filename":"data/vaneerConsumption/StormShelterAppHelpsPinpointPeopleAmidTornadosRubble.json","image_url":"https://media.npr.org/assets/img/2014/05/20/photo_wide-312230074135df2ce84838dea1f3127c07052d5d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_alltechconsidered_2014_05_21_314235543_storm-shelter-app-helps-pinpoint-people-amid-tornados-rubble_1540255586.html","title":"Storm Shelter App Helps Pinpoint People Amid Tornado's Rubble","title_page":"Storm Shelter App Helps Pinpoint People Amid Tornado's Rubble : All Tech Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Storm Shelter App Helps Pinpoint People Amid Tornado's Rubble\nEnlarge this image toggle caption Courtesy of Shonn Neidel Courtesy of Shonn Neidel\nAfter a devastating tornado rolled through Moore, Okla., last May, firefighters were scrambling to pull people out of storm shelters. Actually finding those shelters, though, was difficult. Landmarks had been swept away, and the town's emergency dispatcher was overwhelmed with calls.\n\"Yes, we're at 604 South Classen. There's people down,\" one caller said. \"We're stuck under rubble. ... Please hurry.\"\nShonn Neidel was one of the firefighters rushing to rescue people that day, and he quickly saw a problem.\nEnlarge this image toggle caption Courtesy of Shonn Neidel Courtesy of Shonn Neidel\n\"We decided to just go out into the neighborhood and see if we could help anybody,\" Neidel says. The crews had addresses of homes, he says, \"and that's all we ever really thought we needed.\"\nBut when they reached an affected neighborhood, it looked like a landfill, with hundreds of homes and all their contents, from mattresses to cars to insulation, blended together. The street signs and house numbers were gone.\n\"That's when I really realized that we really didn't have a great system,\" Neidel says.\nBecause they didn't know where to dig, it took firefighters three days to check all the shelters to make sure no one was trapped. Even for a fit firefighter, the endless digging was overwhelming.\nThat's where the idea for a new app was born. \"If I could walk up and say, 'This is where we're going to dig,' ... it would speed [rescue efforts] up a lot,\" Neidel says.\nHe's an easygoing guy with a quick smile, and he likes when things work. The existing storm shelter registry didn't.\nNeidel had worked at IBM as a field tech before he became a firefighter. After the tornado, he recruited his computer programmer brother-in-law, Dan McIntyre, and they started building an app that firefighters can use to find people more efficiently — even when cell service is down.\n\"If you've ever been in a situation like this, it's already stressful enough, and it's chaotic,\" Neidel says. \"You don't want to try to learn something in that situation. I call it nuts and bolts. It's simple, but it works.\"\nIn his neatly pressed, gray-blue uniform, Neidel holds an iPad and points to a dot on a map as he demonstrates how the app works. Drawing information from a database of shelter registrations, it shows how many people are likely to be in a shelter and what their medical needs are. That way, first responders can better delegate workers and equipment.\nThe new app looks like the map you find on your phone, with red pins indicating the storm shelter locations. And because GPS is not always accurate, the app also includes actual coordinates, collected, verified and manually pinned by an inspector.\nThe app also details physical descriptions of what's above the shelter — for example, indicating that a shelter lies 5 feet from the northwest corner of a home's foundation slab.\n\"If we can see the slab, we can figure out roughly where it is, if we need to,\" Neidel says.\nThe app also enables first responders to check off each storm shelter as it's cleared, to prevent other crews from duplicating search efforts.\nWhat started as a hobby to solve a problem in Moore is now something other first responders are asking about. Firefighters from other storm-prone communities are interested in Neidel's ideas.\n\"Having good coordinates for the shelter would be very important,\" says Bill Jorgensen, the public safety director for Williamson County, Tenn., just south of Nashville. \"That's probably something we'll implement here, too, because that's a great idea.\"\nNeidel has been paying to develop the app out of his own pocket, but now, he's trying to figure out how he can get it funded so he can get it into the app store to share with other fire departments.","url":"https://www.npr.org/sections/alltechconsidered/2014/05/21/314235543/storm-shelter-app-helps-pinpoint-people-amid-tornados-rubble"}
