{"authors":["Press Association"],"date_download":"2018-10-23 04:00:41","date_modify":"2018-10-23 04:00:41","date_publish":"2016-01-28 19:47:17","description":"Storm Gertrude is expected to bring further heavy rain and wind gusts of up to 90mph on Friday. Snow and ice are also forecast in some areas as extreme weath...","filename":"data/vaneerConsumption/Stormgertrudesettosweepinwith90mphgusts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-9b98f515-1454-447a-828a-a2a3509c559d-2vdWmEltwXfba0ce28e632c3d8e2-149_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420953_Storm-Gertrude-set-sweep-90mph-gusts_1540267241.html","title":"Storm gertrude set to sweep in with 90mph gusts","title_page":"Storm gertrude set to sweep in with 90mph gusts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Storm Gertrude set to sweep in with 90mph gusts\nStorm Gertrude is expected to bring further heavy rain and wind gusts of up to 90mph on Friday.\nSnow and ice are also forecast in some areas as extreme weather continues to batter the British Isles.\nA succession of storms since December has seen widespread flooding and major disruption to travel, with the latest misery expected to continue through to the weekend.\nA succession of storms have battered Britain since December\nThe Met Office has issued an amber \"be prepared\" warning for high winds in Northern Ireland, Scotland and north west and north east England.\nYellow \"be aware\" warnings for rain, snow and ice are in place across much of the UK.\nForecasters said: \"West to south-westerly gales are expected to develop widely across Scotland, Northern Ireland and parts of northern England early on Friday.\n\"Winds are expected to widely gust 60-70mph, possibly up to 80mph along exposed coasts and over hills.\n\"Be prepared for the likelihood of difficult driving conditions and disruption to travel, such as cancellation to ferry services and bridge closures.\n\"Some structural damage is also possible, as well as disruption to power supplies. Heavy rain and surface water will be additional hazards in places.\"\nThe Met Office said gusts of up to 90mph across Orkney and Shetland are likely.\nEngineers are on standby to deal with power outages caused by the extreme weather but householders are urged to be prepared for possible disruption.\nA statement from Scottish Hydro Electric Power Distribution (SHEPD) said: \" We have 400 front line and support staff standing by and we have moved engineers to the areas we expect to be hit by the storm. Mobile generators and other resources are also being moved.\n\"Members of the public should not approach fallen or damaged power lines, which may still be live.\"\nAround 600 people were evacuated from their homes in the Scottish Borders on Wednesday over renewed flooding fears and f irefighters had to rescue a bus driver caught in water on the B6405 route near Hawick.\nThe Forth Road Bridge is likely to be closed to all traffic except cars on Friday morning and may be shut entirely as winds peak at around 8am.\nOperator Amey said: \"The bridge is expected to be closed to cyclists and pedestrians throughout the day, and remains closed to HGVs while repairs to the truss end links continue.\n\"Public transport is likely to be affected, with winds forecast in excess of the level at which buses would be permitted to cross from approximately 4am onwards.\"\nThe amber warning means all schools in the Western Isles will close for the day and bus services have been suspended on Friday until noon.\nScotRail will operate a limited service on Friday with routes in the Highlands and west coast particularly affected.\nNo trains are expected to run until at least the afternoon between Perth and Inverness; Glasgow and Fort William; Dumbarton and Helensburgh; Kilmarnock and Stranraer; Kilwinning and Ardrossan; Ayr and Girvan; and Glasgow and Dunblane.\nThe routes are likely to bear the brunt of 90mph winds with high tides also forecast.\nOperators said hundreds of engineers will be deployed across the network to inspect lines, repair damage and reopen routes as quickly as possible.\nPhil Verster, ScotRail Alliance managing director, said: \"We will be withdrawing some services until the worst of the storm has passed.\n\"The safety of our passengers and workforce is our top priority and we cannot run services on these lines until our engineers have thoroughly inspected the network for any damage.\n\"In order to get the most up to date information about their journey, customers should check our website or app before setting out to travel. Leaving more time for travel is also advised.\n\"We will be monitoring the weather conditions closely throughout the day and have specialist teams ready to deploy quickly to deal with any issues caused by the storm.","url":"https://www.dailymail.co.uk/wires/pa/article-3420953/Storm-Gertrude-set-sweep-90mph-gusts.html"}
