{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 03:53:45","date_modify":"2018-10-23 03:53:45","date_publish":"2016-01-29 19:17:58","description":"A pet rabbit is to be renamed Gertrude after the storm's strong winds blew it on to the roof of a care home in Omagh, Northern Ireland, where it is kept as a pet.","filename":"data/vaneerConsumption/StormGertrudethrowsrabbitontoroofinNorthernIreland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E87100000578-0-image-a-20_1454094543428.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423298_Storm-Gertrude-throws-rabbit-roof-Northern-Ireland_1540266825.html","title":"Storm Gertrude throws rabbit onto roof in Northern Ireland","title_page":"Storm Gertrude throws rabbit onto roof in Northern Ireland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pet rabbit had a miracle escape after being blown onto a roof in Northern Ireland by Storm Gertrude.\nFirefighters rescued the bunny, formerly known as Bumper, after it was unexpectedly dumped on top of the Omagh residential home where it lives.\nIt appears the pet's terrifying experience was due to the owner not battening down the hutches outside the property.\nStorm Gertrude blew Bumper's hutch into the air and the rabbit onto a roof in Omagh, Northern Ireland\nA gale force gust swept the animal's wooden home into the air on Friday morning and sent it crashing toward the building.\nDistrict Commander of Omagh Fire Station, David Doherty, said the rabbit had a lucky escape.\n'The wind caught the hutch and sent it flying into the air and it has catapulted the rabbit out of the hutch and onto the roof,' he said.\n'Now the hutch has come down and smashed, so it was probably lucky for the rabbit that it did come out.'\nCrew Commander Mike Cullinan pictured with Bumper after the roof rescue\nMr Doherty explained why firefighters chose to respond to the unusual request for help.\n'It's not the sort of thing we would usually go to, but because of the conditions, it was so windy, we were scared if we didn't go out and deal with this, a member of the public would try to go up and end up getting injured or worse,' he said.\n'The guys went up on the ladders and used a really long reach pole we use for rescuing casualties out of water and we used that to basically coax it down off the roof.\n'It came to the top of the ladder and the guys were able to carry it down.'\nThe rabbit is to be renamed Gertrude by the residents at the care home in honour of the incident, pictured\nHe said the residents of the home were now going to re-name their pet.\n'They are going to re-name it Gertrude now after the storm, because of the adventure it's had,' he said.\nMr Doherty said the escapade had caused a storm of public interest since he posted it on Twitter on Friday morning, and he hoped to use that to highlight the Northern Ireland Fire and Rescue Service's adverse weather safety messages.\n'We want to get the message out to tell people to be safe in power cuts, to make sure their smoke alarms are working, be safe using candles and be careful on the roads,' he said.","url":"https://www.dailymail.co.uk/news/article-3423298/Storm-Gertrude-throws-rabbit-roof-Northern-Ireland.html"}
