{"authors":[],"date_download":"2018-10-30 18:27:46","date_modify":"2018-10-30 18:27:46","date_publish":"2017-03-02 15:02:15","description":"A state representative has introduced two bills aimed at resolving what have been contentious issues...","filename":"data/vaneerConsumption/Stovalllegislationaimedathelpingcharterschoolspubliccomment.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/02/Images/newsEngin.17951116_IMG_3080-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_s_ab93e7a90fa9ca570235271cbbf3641b__1540924066.html","title":"Stovall legislation aimed at helping charter schools, public comment","title_page":"Stovall legislation aimed at helping charter schools, public comment","title_rss":"NULL","source_domain":"ajc.com","text":"A state representative has introduced two bills aimed at resolving what have been contentious issues in Clayton County.\nOn Feb. 23, Rep. Valencia Stovall, D- Forest Park, introduced HB 423 which would enable charter schools to inhabit unused buildings held by public school districts. The bill stems from a dispute a few of years ago between Clayton County Public Schools and Utopian Academy for the Arts in Riverdale. The Clayton school district blocked the charter school from opening using a series of red-tape involving building permits and other documents.\nThe second piece of legislation, HB 493 introduced Feb. 28, will allow public comments made during videotaped government meetings such as county commission meetings and school board meetings to be aired for public viewing. The Clayton commissioners recently voted to remove public comments from their meetings which air on the local access television channel CCTV 23, sparking outrage in the community. The bill passed a subcommittee of the Governmental Affairs and is now headed to the full committee, Stovall said.\n“If meetings are open to the public, you need to be transparent about what takes place at the meetings, including public comments,”Stovall said. “My bill ensures that public comment is included in a video recording of the meeting. They’re taking more time to edit it out of the video when they could just leave it in there.”\nPublic comments will still be allowed during the meeting but will not be televised. While some community residents see it as a violation of the First Amendment and Open Meetings Act. One expert say it’s falls into a grey area.\n“It’s a valid concern,” said Jennifer Colangelo, assistant attorney general who specializes in open meeting issues for the state Attorney General’s Office. “Technically, (public comments) are not part of the Open Meetings Act. It’s great it was broadcast but (the law) doesn’t require it to be broadcast. Thus, the Open Meetings Act can’t compell them to do so.”\nThe bills would have to pass the House by Friday’s Crossover Day deadline, but Stovall can push them next year. This is the first year of a two-year session, so bills that don’t move this year can be brought up again next year.","url":"https://www.ajc.com/news/local-govt--politics/stovall-legislation-aimed-helping-charter-schools-public-comment/PEUfXyCRfhwCVHSjkJTcxK/"}
