{"authors":["Associated Press"],"date_download":"2018-10-23 00:48:13","date_modify":"2018-10-23 00:48:13","date_publish":"2017-03-10 07:54:08","description":"BOSTON (AP) - Organizers of the city's St. Patrick's Day parade reversed course on Friday and said they would allow a group of gay veterans to march in this...","filename":"data/vaneerConsumption/StPatricksparadeorganizerswillallowgayvetstomarch.json","image_url":"https://i.dailymail.co.uk/1/2017/03/11/05/wire-199801-1489211953-110_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300308_St-Patricks-parade-organizers-revisit-gay-veterans-ban_1540255693.html","title":"St. Patrick's parade organizers will allow gay vets to march","title_page":"St. Patrick's parade organizers will allow gay vets to march | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BOSTON (AP) - Organizers of the city's St. Patrick's Day parade reversed course on Friday and said they would allow a group of gay veterans to march in this year's parade.\nThe South Boston Allied War Veterans Council announced on the parade's Twitter account that it had signed an \"acceptance letter\" that would clear the way for OutVets to participate.\nA lawyer for OutVets said late Friday that the group looked forward to \"marching proudly\" and representing LGBTQ veterans.\nOutVets founder Bryan Bishop wears the logo of his group while speaking with a reporter at his house in Boston, Friday, March 10, 2017. The organizers of Boston's embattled St. Patrick's Day parade have scheduled an emergency meeting to reconsider their vote to shut out the gay veterans group. This week's decision to bar OutVets from marching drew immediate condemnation from high-profile politicians and stirred up a furor on social media. (AP Photo/Michael Dwyer)\n\"We are honored and humbled by all the outpouring of support that has been displayed for our LGBTQ veterans - who are one of the most unrepresented demographics in our veterans community,\" said lawyer said Dee Dee Edmondson.\nAn earlier vote by the council to bar OutVets from marching drew immediate condemnation from high-profile politicians, some of whom said they would not march if the gay veterans were excluded. It caused some sponsors to back out and stirred up a furor on social media.\nSouth Boston Allied War Veterans Council member Edward Flynn said Friday night he was proud the group invited OutVets to be part of the parade. \"South Boston is an inclusive community, and with this development, we are one step closer to a parade that reflects that spirit,\" he said.\nIt was unclear if the reversal of the decision was a result of a second vote by the council.\n\"I decided this is a wrong that has to be corrected,\" the parade's lead organizer, Tim Duross, told WHDH-TV.\nEarlier Friday, OutVets executive director Bryan Bishop said the vets had been told the original decision to bar them was because of their rainbow symbols.\nBishop said the council offered to allow the group to march if its members did not display the rainbow flag, a symbol of gay pride, which is on their banner and their jackets.\nThe group said no.\n\"I almost fell out of the chair at that point, said, 'You gotta be kidding me,'\" Bishop said.\nHe said OutVets has displayed the rainbow at the parade the last two years.\n\"It infuriates me to look at the veterans that I know, gay and straight, who have served this country with valor and honor and distinction, and just because you're a veteran who happens to be gay your service is somehow less than someone who is not of the LGBT community or someone who's not gay,\" he said.\nEdmondson, the OutVets lawyer, earlier Friday described the acceptance letter as \"generic\" and said it did not make fully clear whether the gay group would be allowed to display its banner.\nAnother veterans group, Veterans for Peace, said it also had been denied permission to participate. That group has been trying unsuccessfully for several years to march.\nOutVets was first allowed to participate in the parade in 2015, in what was seen as a groundbreaking decision after parade organizers had, for decades, resisted the inclusion of gay groups. The case went to the U.S. Supreme Court, which in 1995 upheld the council's right to bar gay groups on free speech grounds.\nThe council said in a statement Thursday its decision had been misinterpreted.\n\"The council is accepting of all people and organizations, but it will not permit messages that conflict with the overall theme of the parade,\" the statement said.\nThat decision resulted in backlash from other veterans' organizations.\nThe council is made up of representatives from several South Boston American Legion and Veterans of Foreign Wars posts.\nThe Michael J. Perkins American Legion Post said it had withdrawn from the council.\nThe Perkins post in a statement on its Facebook page didn't mention the OutVets decision but said it decided to withdraw because \"recent efforts by several non-veteran parade volunteers to guide decision making has resulted in the subversion of the council as an organization being led by veterans.\"\nAnother former member of the council, the Thomas J. Fitzgerald VFW Post, assailed the council's decision to bar OutVets.\nThe Fitzgerald post withdrew from the council last year over the decision to bar Veterans for Peace.\n___\nAssociated Press writers Rodrique Ngowi and Bob Salsberg contributed to this report.\nOutVets founder Bryan Bishop poses in his house in Boston, Friday, March 10, 2017. The organizers of Boston's embattled St. Patrick's Day parade have scheduled an emergency meeting to reconsider their vote to shut out the gay veterans group. This week's decision to bar OutVets from marching drew immediate condemnation from high-profile politicians and stirred up a furor on social media. (AP Photo/Michael Dwyer)","url":"https://www.dailymail.co.uk/wires/ap/article-4300308/St-Patricks-parade-organizers-revisit-gay-veterans-ban.html"}
