{"authors":[],"date_download":"2018-10-30 01:04:37","date_modify":"2018-10-30 01:04:37","date_publish":"2017-04-04 00:00:00","description":null,"filename":"data/vaneerConsumption/StPetersburgattackshowsRussiasgrowingproblemwithitsnearabroad.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_st_petersburg_attack_shows_russias_growing_problem_with_its_nearabroad_1540861477.html","title":"St. Petersburg attack shows Russia's growing problem with its near-abroad","title_page":"St. Petersburg attack shows Russia's growing problem with its near-abroad","title_rss":"NULL","source_domain":"americanthinker.com","text":"St. Petersburg attack shows Russia's growing problem with its near-abroad\nRT News is reporting that the terrorist attack on the St. Petersburg subway Monday was the work of a Kyrgyz national with Russian citizenship. Based on the photos shown, he appears to be an Islamic militant. We don't hear much from Kyrgyzstan, a relatively small Central Asian Muslim state situated among three giants: China, Russia, and Kazakhstan. It is a major producer of gold, and its fertile green valleys are ideal for agriculture, which it has been trying to develop. It was last heard from in the news when one of its nationals shot up a club in Istanbul, Turkey on New Year's Eve, creating massive casualties.\nWell, they are back. It's exceptionally bad news because terrorism tends to encourage other terrorism, and it may mean that ISIS, which claimed credit for the Petersburg attack, has infiltrated its society. Here's another reason it's bad: it raises questions as to whether Russia can be of any use as a partner to the West in the war on ISIS. President Vladimir Putin does talk tough about terrorists and, where he has the space to do it, can crack down hard. But with Russians wary of any war (they all know how badly their soldiers have been treated in the aftermath; there is no wounded warrior social network), Putin may not have the public behind him. Ergo, Russia may be too weak as an ally to fight ISIS despite its national interests as the cultural guardian of orthodoxy, its geographical proximity to terrorist nesting grounds in the Middle East, and its impressive reputation for a hard hand against miscreants. They might just not be able to do it, given the problems emerging in what is known as its \"Near Abroad,\" the scruffy Central Asian states on much of its southern border. They've got a big emerging problem here. And don't think they aren't the first victim of it. Russia has a largely unguarded border and the largest population of illegals outside the U.S. (go figger – the reality is, the place is not as bad as the human rights groups paint it – its World Bank rankings on economic freedom are fairly good), and Russia is a major trans-shipment point of migrants to Europe through Murmansk and St. Petersburg. So this emerging terrorism problem with Kyrgyzstan is not just a problem for themselves; rather, it has potential to spread to western Europe. They may not be able to be helpful. Fundamentalism has been popping up a lot in Kyrgyzstan and neighboring Kazakhstan. Over the summer, there were several internal incidents, apparently combinations of coups and terrorism, though the Russian and Kazakh governments dismissed these incidents as tribal. Neighboring Uzbekistan seems to be more stable – the place has a lot of people and dates back to the tsarist empire and so seems to be an articulate state – and so far, the fundamentalist infection has not hit them. But those other areas are emerging trouble spots. Kyrgyzstan also is quite close to Xinjiang, where Islamic fundamentalism is a growing problem and of great concern to China. Kazakhstan (which RT names in its report as an initial possible supplier of suspects) is significant because it has had currency devaluation that is horrifically destabilizing to anyone who has to live inside the country because it drives up prices and destroys savings. It was done by state policy with likely Russian connivance, in a conversation I roughly recall last summer with Johns Hopkins University economist Steve Hanke because it enabled Kazakhstan to corner the global uranium market, including our uranium with their hard currency, through Hillary Clinton's dirty deal. This had been the plan since 2009, and Hanke had firsthand knowledge of the Kazakhs' initial efforts to stabilize their currency. The weak Kazakh currency drove down the global commodity price of uranium (they are the Saudi Arabia of uranium) and made it impossible for legitimate producers to stay in business over in Australia, Canada, and the states. The U.S. has just one or two working uranium mines as a result, something that alarms some of my sources in the Department of Energy. Australia is in a very similar bad way. The Canadians, who control very big companies such as Cameco, are in best shape, but they have suffered, too. Driving down the currency, which drove down the price of uranium, upon which all nuclear power and nuclear weapons are derived, was a strategy to take over the industry. It worked, but now we have a Muslim fundamentalism problem in that country and in Kyrgyzstan, which has also seen fearsome devaluations as a small country with an economy tied to Russia and China, both of which have devalued in recent years. It has desperately tried to stabilize its currency, probably with only partial luck. It does not help that it is a major shipper of legal illegal immigrants (1 million) and relies on remittances, which the World Bank says tend to keep a country underdeveloped. But give it credit: it has tried. Currency devaluation may be great for cornering the market on strategic national resources, but it makes everyone and everything suffer on the inside. Now it's spilling over to Russia's borders and may go beyond that. Unless a hardcore free-market regime is instituted (something Hanke would be more than capable of doing), the terror attacks on St. Petersburg only expose the quietly festering problems Russia has with its near abroad, which may impact its capacity to fight terror beyond its borders to keep it from spreading.","url":"https://www.americanthinker.com/blog/2017/04/st_petersburg_attack_shows_russias_growing_problem_with_its_nearabroad.html"}
