{"authors":["Chris Summers For Mailonline"],"date_download":"2018-10-23 05:36:23","date_modify":"2018-10-23 05:36:23","date_publish":"2017-04-26 17:01:40","description":"Complete strangers raised more than $130,000 in only four days to help a woman who fell into poverty with her daughter after the Venezuelan economy crashed.","filename":"data/vaneerConsumption/Strangersraise130000forVenezuelanwomanRose.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0790E00000578-0-image-a-62_1493220354547.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448226_Strangers-raise-130-000-Venezuelan-woman_1540272983.html","title":"Strangers raise $130,000 for Venezuelan woman 'Rose'","title_page":"Strangers raise $130,000 for Venezuelan woman 'Rose' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Complete strangers raised more than $130,000 in only four days to help a woman who fell into poverty with her daughter after the Venezuelan economy crashed.\nAmerican photographer Brandon Stanton posted a picture of the woman - known only as Rose - on the verge of tears on his Twitter feed.\nStanton, who has 25 million followers and is best known for his Humans of New York project, posted 200 words underneath about Rose's predicament.\nMore than 6,000 strangers raised $131,000 for Rose after reading about her online\nStanton and his interpreter Juan Laserna met the woman in Colombia and she told him her story.\nShe said: 'I'm starting from nothing. I lost everything back in Venezuela. I had my own natural soup factory but the crisis made it impossible to get ingredients.\n'Things got so bad that I couldn't even find food for my baby. I had little money, but there was nowhere to buy food…we would go days without eating. When I tried to breastfeed my daughter, I'd almost faint.'\nThousands of demonstrators have shut down the main highway in Caracas to express their anger with President Nicolas Maduro, who is blamed for Venezuela's economic woes. More than 23 people have been killed during the protests.\nRose traveled to Colombia in a bid to get help and left her daughter with friends.\nBrandon Stanton (pictured) has 25 million followers on Twitter and he steered more than 6,000 of them towards the crowdfunding page\nShe said: 'I'd never said \"goodbye\" to my daughter before. She was screaming my name when I left. It hurt worse than giving birth. But I didn't have a choice.'\nRose said she told her daughter she was going to Colombia to 'make a diamond' and bring it back.\nBut in fact she sells key chains on the streets of the capital, Bogota, and sends packets of food back home when she makes some money.\nShe added: 'I grew up very poor. I came from nothing so I've been here before.'\nLaserna set up a crowd funding page to help her and Stanton shared the link to the page.\nThey had hoped to raise $5,000 but were astonished when generous strangers donated $131,201 to Rose.\nStanton said all the money would go to Rose, enabling her to return home and be with her daughter.\nTwo years ago Stanton helped a 13-year-old boy raise $1.2million for his hard-up school in New York's Brownsville neighborhood.","url":"https://www.dailymail.co.uk/news/article-4448226/Strangers-raise-130-000-Venezuelan-woman.html"}
