{"authors":["Sarah Harris For The Daily Mail"],"date_download":"2018-10-23 02:16:07","date_modify":"2018-10-23 02:16:07","date_publish":"2016-01-29 16:40:37","description":"London academics Rebecca Steinfeld and Charles Keidan want to enjoy the same rights as same-sex couples and mark their commitment with a civil union. But the pair lost their legal bid today.","filename":"data/vaneerConsumption/StraightcoupleloseHighCourtbattletobeallowedtoenteracivilpartnership.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B1C5DD00000578-0-image-a-184_1454085187262.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423080_Heterosexual-couple-lose-High-Court-battle-allowed-enter-civil-partnership-vow-appeal_1540260967.html","title":"Straight couple lose High Court battle to be allowed to enter a civil partnership","title_page":"Straight couple lose High Court battle to be allowed to enter a civil partnership | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A heterosexual couple who object to marriage vowed to appeal today after losing a legal bid to be allowed to enter a civil partnership.\nRebecca Steinfeld and Charles Keidan want to enjoy the same rights as same-sex couples and mark their commitment with a civil union.\nThe academics, from Hammersmith, West London, who have an eight-month-old baby and do not want to get married, took the case to London’s High Court.\nScroll down for video\nCharles Keidan, 39, and Rebecca Steinfeld, 34, want to enjoy the same rights as same-sex couples and mark their commitment with a civil union - but they lost their legal bid\nThe judge, Mrs Justice Andrews, said that although many people may have ‘sympathy’ with the couple, the Government’s refusal of their demand was not unlawful and not in breach of their human rights for private and family life.\nThe couple were given leave to appeal because the judge said the case ‘raises issues of wider importance’.\nThe couple said they would now launch an appeal against the decision\nDr Steinfeld, 34, said after the ruling: ‘We made this claim because the UK Government is barring us, and many thousands of opposite-sex couples like us, from the choice of forming a civil partnership, and we want this to change.\n‘Personally, we wish to form a civil partnership because that captures the essence of our relationship and values.\n‘Civil partnerships are a modern social institution conferring almost identical legal rights and responsibilities as marriage, but without its history and social expectations.\n‘We don’t think there is sufficient justification for stopping us or other opposite-sex couples from forming civil partnerships. Unfortunately the judge has concluded otherwise.’\nThe visiting fellow at the Middle East Centre of the London School of Economics (LSE) said she and her partner would go to the Court of Appeal ‘on behalf of ourselves and the more than 36,000 people who signed our petition calling for civil partnership equality’.\nMr Keidan, 39, added: ‘We believe that opening civil partnerships to opposite-sex couples would complete the circle of full relationship equality that began with a hard won victory for same-sex marriage.\n‘We campaigned for equal marriage and believe that the significance and symbolism of opening marriage to same-sex couples cannot be overstated.\n‘Regrettably, the courts have so far been unable to compel the Government to open civil partnerships to all, so it’s now time for Parliament to demonstrate its commitment to creating a level playing field for all its citizens by opening up civil partnerships to same-sex couples and opposite-sex couples alike.’\nThe couple have been together for more than five years since November 2010 and are engaged.\nThey claimed the 2004 Civil Partnership Act discriminated against them on human rights and equality grounds.\nIt’s now time for Parliament to demonstrate its commitment to creating a level playing field Charles Keidan\nIn dismissing their claim for Judicial Review, the judge accepted that many people would ‘sympathise’ with their view that it was ‘unfair’ to deny them the same means of formal recognition as same sex couples.\nBut she said the Government was ‘unconvinced that extending civil partnerships to opposite-sex couples was a necessary change’.\nTheir counsel Karon Monaghan QC had argued that without the change the couple would be ‘forced to enter into marriage against their consciences or remain without the legal protection and privileges that they and their child need, and to which they believe they should be entitled’.\nMrs Justice Andrews said even if their human rights were affected by the denial of a civil partnership, the Government was still making available the alternative means of recognition in marriage which has always existed.\nMinisters had decided to ‘wait and see’ how the extension of marriage to same-sex partners affects civil partnerships before determining what to do about them.\nIn her judgment, she said that ‘maintaining that difference in the short term is objectively justified’.\nThe judge accepted many people would ‘sympathise’ with Charles Keidan and Rebecca Steinfeld's view that it was ‘unfair’ to deny them the same means of formal recognition as same sex couples\nShe added: ‘The Government’s decision to wait and see serves the legitimate aim of avoiding the unnecessary disruption and the waste of time and money that plunging into a programme of legislative reform without waiting is likely to produce.’\nThe couple’s solicitor, Louise Whitfield, said: ‘It is clear that there is unjustified discrimination here in what the judge acknowledged was an important case, but she has set the bar too high.’\nTim Loughton, Tory MP for Worthing East and Shoreham, currently has a Private Members’ Bill going through Parliament, to amend the Civil Partnership Act to remove the clause limiting civil partnerships to same sex couples.","url":"https://www.dailymail.co.uk/news/article-3423080/Heterosexual-couple-lose-High-Court-battle-allowed-enter-civil-partnership-vow-appeal.html"}
