{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:49:06","date_modify":"2018-10-30 20:49:06","date_publish":"2016-12-27 00:00:00","description":null,"filename":"data/vaneerConsumption/Stripeisinstrongpositionheadinginto2017.json","image_url":"https://amp.businessinsider.com/images/58627782f10a9a22008b54cc-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_stripe-is-in-strong-position-heading-into-2017-2016-12_1540932546.html","title":"Stripe is in strong position heading into 2017","title_page":"    Stripe is in strong position heading into 2017 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nIn November, online payment gateway Stripe closed a $150 million funding round, which ultimately valued the firm at $9.2 billion — a total that has nearly doubled in the past year and makes it the most valuable financial technology startup.\nDespite that resounding success, Stripe has \"no plans to go public in the foreseeable future,\" and remains happy as a private company, according to remarks made by CFO Will Gaybrick to Business Insider. The firm doesn't feel a need to rush, because it believes it still has a long growth runway and much upside.\nStripe will continue to capitalize as e-commerce grows.\nOnline and mobile shopping is on the rise. Digital commerce is rising. BI Intelligence forecasts that US e-commerce retail sales will hit $631 billion in 2020, up from $341 billion last year. Stripe is poised to profit from that growth, because the firm takes a cut of its client sales, which means an increase in digital volume could boost its revenue, according to Business Insider.\nThe firm has a long runway for client acquisitions. Stripe already counts major firms, including Lyft and Macy's, as clients, in addition to smaller sellers. But more merchants are enabling digital sales — 89% of merchants have a website and 65% offer mobile sales, up from 76% and 25%, respectively, five years ago. As more merchants continue to enable digital channels, Stripe could be left with an opening to grab market share.","url":"https://www.businessinsider.com/stripe-is-in-strong-position-heading-into-2017-2016-12"}
