{"authors":["Emma Madden"],"date_download":"2018-10-31 01:52:40","date_modify":"2018-10-31 01:52:40","date_publish":"2018-09-06 09:43:59","description":"You've probably got the takeaway booked and the wine chilling already, as Strictly Come Dancing is coming back this Saturday. The dancers have been announced, the celebs have been confirmed, and rehearsals are well underway — but this one will be a…","filename":"data/vaneerConsumption/StrictlyComeDancingsRuleChangeIsSeriouslyDividingTheInternet.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/5/f54b2b37-bd24-4239-8324-61afaf319c10-getty-840276806.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_strictly-come-dancings-rule-change-is-seriously-dividing-the-internet-11703966_1540950760.html","title":"'Strictly Come Dancing's Rule Change Is Seriously Dividing The Internet","title_page":"'Strictly Come Dancing's Rule Change Is Seriously Dividing The Internet","title_rss":"NULL","source_domain":"bustle.com","text":"You've probably got the takeaway booked and the wine chilling already, as Strictly Come Dancing is coming back this Saturday. The dancers have been announced, the celebs have been confirmed, and rehearsals are well underway — but this one will be a series of unlike ever before. You see, BBC bosses have confirmed a Strictly Come Dancing rule change, and it's a pretty huge deal.\nIn the biggest shake-up the show has seen in years, a new dance category is being added. For the first time ever, each couple will get to choose from less traditional dance styles, including commercial, street/commercial, and theatre/jazz.\nA spokesperson elaborated on these new additions to the Daily Mail, stating that contemporary could take inspiration from \"ballet, lyrics, and modern dance.\" They explained: \"Street/Commercial covers all styles of urban dance as well as allowing couples to go in a more pop, commercial direction,\" while theatre/jazz is \"very much the style of musical theatre, including elements of tap, soft shoe, burlesque, and Jazz.\"\nThe change has been introduced to \"make the show more contemporary,\" a spokesperson told The Sun. \"This will give our celebrities and professional dancers an even greater opportunity to showcase their skills and for the show to celebrate even more styles of dance.\"\nIt is the first time a new dance category has been introduced to the show since 2009, when the Charleston was added in Series 7. But the decision has divided fans. Some worry that adding the contemporary styles might spoil the traditional, ballroom aspect of the show:\nHowever, according to the Mirror, the 15th dance category won't feature until after the first few weeks, then at least one couple will be granted the Couples Choice each week. While some fans are still skeptical of the addition, others are excited to see what the new flavours can bring to the show. In fact, there were quite a few tweets praising the new rule change:\nPersonally, I'm excited to see Strictly changing up the game. While I love the original format, I don't see how embracing other styles of dance could ever be a bad thing. Bring it on, I say, and give the new rule a chance.\nStrictly Come Dancing 2017 will kick-off on Saturday for its first episode this year. As always, the first show will simply focus on which professional dancers the celebrity contestants will be coupled up with. This year's line-up includes Dr. Ranj Singh, Stacey Dooley, Ashley Roberts, Katie Piper, Lauren Steadman, Danny John-Jules, and Susannah Constantine. Seann Walsh, Graeme Swann, Faye Tozer, Kate Silverton, Lee Ryan, Vick Hope, Charles Venn, and Joe Sugg are also competing.\nChristopher Furlong/Getty Images Entertainment/Getty Images\nAlthough the new series hasn't started yet, bookmaker Betway has tipped former Pussycat Doll Roberts to win. Spokesperson Alan Alger told Bustle UK in a press release: \"With her dancing experience and general popularity on both sides of the Atlantic, Ashley Roberts has been installed as our 9/2 favourite to win the series after being announced as Strictly’s ninth star.\"\nStrictly Come Dancing 2017 starts on BBC One on Saturday at 7.35 p.m.","url":"https://www.bustle.com/p/strictly-come-dancings-rule-change-is-seriously-dividing-the-internet-11703966"}
