{"authors":["Breitbart News"],"date_download":"2018-10-30 18:19:40","date_modify":"2018-10-30 18:19:40","date_publish":"2015-11-10 17:41:20","description":"The University of Missouri Tigers ended their two-day strike in solidarity with student activists calling for the removal of the school's president, Tim Wolfe. |","filename":"data/vaneerConsumption/StrikingMizzouPlayersReturntoPracticeAfterPresidentResigns.json","image_url":"https://media.breitbart.com/media/2015/11/Missouri-Football-Boycott.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_11_10__1540923580.html","title":"Striking Mizzou Players Return to Practice After President Resigns","title_page":"Striking Mizzou Players Return to Practice After President Resigns | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The University of Missouri Tigers ended their two-day strike in solidarity with student activists calling for the removal of the school’s president, Tim Wolfe.\nWolfe resigned his post on Monday in the wake of allegations that he mishandled incidents involving swastika graffiti and the use of the n-word on the campus that he presided over.\nDefensive back Ian Simon told reporters:\nIt’s not about us, we just wanted to use our platform to take a stance for a fellow concerned student on an issue, especially being as though a fellow black man’s life was on the line. Due to the end of the hunger strike, we will be ending our solidarity strike to not practice and returning to our normal schedule as football players. It is a privilege to be playing for the University of Missouri’s football team and we are very thankful for this opportunity. We love the game, but at the end of the day, it is just that — a game…. Though we don’t experience everything the general student body does and our struggles may look different at times, we are all Concerned Student 1950.\nThe players skipped practice on Sunday as a result of an impromptu strike called over the weekend. The team’s coach, Gary Pinkel, publicly supported the stance taken by his players even as some of his student-athletes criticized the stoppage. The players backing a graduate student’s hunger strike generated massive media attention and catalyzed the resignation of the University of Missouri system’s president and the chancellor of the Columbia campus’s announcement of his departure.\n“It started with a few individuals on our team and look what it’s become,” defensive end Charles Harris told the student newspaper after Wolfe’s resignation. “Look where we are right now. This is nationally known, and it started with just a few.”\nThe school stood to lose $1 million because of a contractual stipulation, aside from forfeited TV money and gate receipts, if its football team refused to take the field on Saturday at Arrowhead Stadium in Kansas City. The Tigers, losers of four in a row, take on BYU in a game that will help determine whether they play on a bowl or watch at home.","url":"https://www.breitbart.com/sports/2015/11/10/striking-mizzou-players-return-to-practice-after-president-resigns/"}
