{"authors":["Associated Press"],"date_download":"2018-10-23 00:27:30","date_modify":"2018-10-23 00:27:30","date_publish":"2017-04-26 10:05:23","description":"JOHANNESBURG (AP) - South African Airways on Wednesday cancelled nearly three dozen flights, most of them domestic, because of a strike by some cabin...","filename":"data/vaneerConsumption/StrikeforcesSouthAfricanAirwaystocancel32flights.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446856_Strike-forces-South-African-Airways-cancel-flights_1540254450.html","title":"Strike forces South African Airways to cancel 32 flights","title_page":"Strike forces South African Airways to cancel 32 flights | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"JOHANNESBURG (AP) - South African Airways on Wednesday cancelled nearly three dozen flights, most of them domestic, because of a strike by some cabin crew.\nThe national carrier doesn't have enough crewmembers to operate all its flights and is working to help passengers affected by cancellations and delays, the airline said. It said 32 flights, including 28 domestic ones, were cancelled.\nAbout 200 striking flight attendants protested outside the head office of South African Airways in Johannesburg, the African News Agency reported.\nMembers of a labor union, the South African Cabin Crew Association, want more money for meals when working outside South Africa. They say their international meal allowances have not increased in the past six years, they stay in hotels where food is expensive and their spending power has diminished because of the depreciation of the South African currency.\nCurrently, cabin crewmembers get a meal allowance of $130 per trip. The African News Agency quoted union treasurer Gift Bilankulu as saying protesters want $170, but are willing to negotiate.\nManagers of O. R. Tambo International Airport, the main international airport in Johannesburg, said they are monitoring the strike and that they have contingency plans to deal with any disruption.","url":"https://www.dailymail.co.uk/wires/ap/article-4446856/Strike-forces-South-African-Airways-cancel-flights.html"}
