{"authors":["William Lee Adams","Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 05:43:01","date_modify":"2018-10-23 05:43:01","date_publish":"2016-01-29 21:38:21","description":"They've spent countless hours working up a sweat together as part of the Strictly tour. But Georgia May Foote and her partner Giovanni were all smiles as they posed for a sexy photo on Thursday.","filename":"data/vaneerConsumption/StrictlyComeDancingsGeorgiaMayFootecosiesuptoGiovanniPernice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B4F81F00000578-0-image-a-42_1454101743697.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423356_This-Peach-Georgia-Foote-cosies-dancer-beau-Giovanni-Pernice-sweet-selfie-Strictly-tour-heats-up_1540273381.html","title":"Strictly Come Dancing's Georgia May Foote cosies up to Giovanni Pernice","title_page":"Strictly Come Dancing's Georgia May Foote cosies up to Giovanni Pernice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's already conquered the dancefloor in Birmingham and Sheffield as part of the Strictly Come Dancing tour.\nAnd ahead of her performance at the First Direct Arena in Leeds on Thursday, Georgia May Foote proved she's still got plenty of energy left as she cosied up to Giovanni Pernice, her partner both on and off the dance floor.\nRocking dark eye liner, lashings of mascara and a pink lip, she snuggled up to her Italian stallion as he smiled ear-to-ear.\nScroll down for video\nLoving every minute: Georgia May Foote has shared this cute image of herself snuggling up to her part-time dancing partner and full-time beau Giovanni Pernice\nShe captioned the photo, 'This Peach' , adding an emoji of a peach and another of a heart.\nThe 24-year-old is clearly enjoying her tour of the UK, as she uploaded several other photos that depict the happy cast relishing their time together.\nIn one image she can be seen puckering up to the camera alongside Strictly dancer Joanne Clifton, along with the caption, 'my Strictly sisters x.'\nIn another shot, which she posted Monday during the Birmingham leg of the tour, she can be seen sharing drinks with six of her 'Strictly gang'.\nHey girl: Georgia, who previously starred on Coronation Street, uploaded this pic of her with Strictly dancer Joanne Clifton. The caption read: 'my strictly sisters x'\nThe 'Strictly gang': Georgia posted this photo of herself and fellow members of the tour in Birmingham\nCentral to her happiness, however, is Giovanni.\nOn Thursday the former Coronation Street star was seen chowing down on pain au chocolat and clutching a coffee as the pair left a cafe.\nGiovanni, who has spent months lifting and twisting Georgia, refueled with a much-deserved chocolate-covered shortbread.\nBit peckish? Strictly's Georgia and Giovanni appeared to have worked up an appetite as they grabbed a quick bite to eat from a coffee shop in Sheffield on Thursday\nGeorgia was clad in a casual ensemble, as was her hunky boyfriend, as they sauntered along the street together.\nWrapping up in the chilly weather, Georgia sported a knitted khaki jumper, which she paired with grey sweatpants and black hi-top trainers.\nShe added extra layers by wrapping a scarf around her neck, though ensured her look wasn't too androgynous by adding some large gold hoop earrings.\nSee more of the latest on the Strictly couple Georgia May Foote and Giovanni Pernice\nYum! The 24-year-old actress was seen chowing down on a tasty pain au chocolat and a no doubt much needed coffee as they refuelled on their latest tour stop\nDressed down: The former Coronation Street star was clad in a casual ensemble, as was her dancer beau, as they sauntered along the street together\nKeeping warm: Wrapping up in the chilly weather, Georgia sported a knitted khaki jumper, which she paired with grey sweatpants and black hi-top trainers\nHer brunette locks were swept into an easy top knot, and she sported a minimal make-up look - reinforcing just how comfortable she is around her man.\nGiovanni was dressed just as pared-back in a navy padded jacket and tracksuit bottoms as he too tucked into a sweet treat.\nGeorgia and the Sicilian dancing champion have already revealed that they are planning to move in together in London, and it seems that the prospect of spending an infinite amount of time together isn't the least bit daunting.\nBling bling! Georgia added extra layers by wrapping a scarf around her neck, though ensured her look wasn't too androgynous by adding some large gold hoop earrings\nSo, long! It looked as though the Strictly team were on their way out of the city as judges Len Goodman, Bruno Tonioli and Craig Revel Horwood were seen hauling their suitcases out of their hotel the same morning\nKeeping close: Jay McGuiness departed alongside dance partner Aliona Vilani\nSpeaking to Star Magazine, the actress revealed: 'At the end of the tour it will be six months where we've been together every single day.'\nAnd while after one month many couples are still unsure of each other, Georgia explained she's hoping to replicate the 'amazing experience' she had with Giovanni on TV on the live tour.\n'We had such an amazing experience on Strictly,' she said. 'It's nice to be able to go on tour together now and experience this together now.'\nSwoon: Gleb Savchenko looked typically handsome as he posed for photos with fans before leaving the city\nLooking good! Helen George and Anita Rani both opted for stylish jumpsuits for their day in the city\nIt looked as though the Strictly team were on their way out of the Northern city as judges Len Goodman, Bruno Tonioli and Craig Revel Horwood were seen hauling their suitcases out of their hotel the same morning.\nCelebrity dancers Jay McGuiness, Ainsley Harriot, Jake Wood, Frankie Bridge, Anita Rani and Helen George were also seen departing the hotel, as well as tour host Mel Giedroyc.\nOn to the next one: Ainsley Harriot cut a casual figure in a padded jacket and sweatpants\nTravelling in style: Jake Wood and pop star Frankie Bridge whizzed off in the EastEnders actor's convertible\nToned: Professional Karen Clifton showcased her dance-honed legs in printed leggings","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423356/This-Peach-Georgia-Foote-cosies-dancer-beau-Giovanni-Pernice-sweet-selfie-Strictly-tour-heats-up.html"}
