{"authors":["Associated Press"],"date_download":"2018-10-22 23:16:43","date_modify":"2018-10-22 23:16:43","date_publish":"2016-01-28 11:59:02","description":"GENEVA (AP) — Pharmaceuticals company Roche says a strong Swiss franc weighed on its earnings last year and contributed to a 5 percent drop in net income, wh...","filename":"data/vaneerConsumption/StrongSwissfrancdentsearningsatdrugmakerRoche.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:fa28f2591aed4e5daa7dfdb2d3a62cdc-4vVdYopwYQ7f641721b07acdcb2b-812_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420680_Strong-Swiss-franc-dents-earnings-drug-maker-Roche_1540250203.html","title":"Strong Swiss franc dents earnings at drug maker Roche","title_page":"Strong Swiss franc dents earnings at drug maker Roche | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Strong Swiss franc dents earnings at drug maker Roche\nGENEVA (AP) — Pharmaceuticals company Roche says a strong Swiss franc weighed on its earnings last year and contributed to a 5 percent drop in net income, which fell short of analysts' estimates.\nThe Basel-based maker of Avastin and other cancer treatments reported Thursday that net income declined to 9.06 billion Swiss francs ($8.92 billion), from 9.54 billion in 2014, though income was up 4 percent after accounting for currency fluctuations. According to FactSet, analysts expected net income at 10.57 billion francs.\nCEO Severin Schwan hailed a \"successful\" year and pointed to progress in Roche Holdings AG's product pipeline and \"important clinical data\" in areas including cancer, multiple sclerosis, immune and blood diseases.\nSeverin Schwan, CEO of Swiss pharmaceutical company Roche Holding AG, presents the facts and figures for 2015, during the annual press conference in Basel, Switzerland, on Thursday, Jan. 28, 2016. Pharmaceuticals company Roche says a strong Swiss franc weighed on its earnings last year and contributed to a 5 percent drop in net income, which fell short of analysts' estimates. (Georgios Kefalas/Keystone via AP)\nSales rose 5 percent to 48.1 billion francs, largely behind U.S. pharmaceutical sales and strong demand for immunodiagnostic products.\nSeverin Schwan, CEO of Swiss pharmaceutical company Roche Holding AG, center, speaks during the annual press conference in Basel, Switzerland, on Thursday, Jan. 28, 2016. Pharmaceuticals company Roche says a strong Swiss franc weighed on its earnings last year and contributed to a 5 percent drop in net income, which fell short of analysts' estimates. (Georgios Kefalas/Keystone via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420680/Strong-Swiss-franc-dents-earnings-drug-maker-Roche.html"}
