{"authors":[],"date_download":"2018-10-22 21:13:53","date_modify":"2018-10-22 21:13:53","date_publish":"2014-05-06 15:52:52","description":"“They won't be strong enough to rip an aircraft off the seabed and move it along but what they can do is bury the aircraft,” Dr. Simon Boxall.","filename":"data/vaneerConsumption/StrongCurrentsCouldBuryMissingJetExpert.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/396466/140423-malaysia-search-plane-1831_4c3fe80de37b667d925332847db863b5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_strong-currents-could-bury-missing-jet-expert-n98251_1540242833.html","title":"Strong Currents Could Bury Missing Jet: Expert","title_page":"Strong Currents Could Bury Missing Jet: Expert","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nStrong currents could bury the wreckage from the missing Malaysia Airlines jet, a leading British oceanographer has warned.\n“They won't be strong enough to rip an aircraft off the seabed and move it along but what they can do is bury the aircraft,” said Dr. Simon Boxall at the University of Southampton.\n“Where they are looking is like the foothills of a mountain, only underwater,” he added. “You can have strong currents or what we call gravitational flows pulling earth or other debris off that mountain.”\nAn international panel of experts will re-examine all data gathered in the nearly two-month hunt for the missing Malaysia jet to ensure search crews who have been scouring a desolate patch of ocean for the plane have been looking in the right place.\nStarting Wednesday, that data will be re-analyzed and combined with all information gathered thus far in the search, which hasn't turned up a single piece of debris despite crews scouring more 1.8 million square miles of ocean.\n— Henry Austin","url":"https://www.nbcnews.com/storyline/missing-jet/strong-currents-could-bury-missing-jet-expert-n98251"}
