{"authors":[],"date_download":"2018-10-30 18:50:39","date_modify":"2018-10-30 18:50:39","date_publish":"2016-05-03 13:50:11","description":"CCRPI scores show gains for many Opportunity School District-eligble schools","filename":"data/vaneerConsumption/Strugglingschoolsimproveonstatetests.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_dekalb_f45fede70953899c99570a973c6b606a__1540925439.html","title":"Struggling schools improve on state tests","title_page":"DeKalb County Schools: Struggling schools improve on state tests","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County School District officials say they see signs of hope in College and Career Ready Performance Index scores released Tuesday morning, where schools at risk of state takeover are mostly showing improvement.\nBut a list offered by Gov. Nathan Deal’s office today shows while three DeKalb County schools left the Opportunity School District list, six were added.\nThe CCRPI is a type of school report card that grades schools on several factors, including student performance on standardized state tests. Schools at risk of state takeover under Gov. Nathan Deal’s proposed Opportunity School District received scores of 60 points on a 100-point scale for three consecutive years.\nThree schools in DeKalb County — Columbia High School, Salem Middle School and Towers High School — are no longer at risk of takeover under the governor’s proposal. Six — Allgood, Chapel Hill, Montclair and Woodward elementary schools, McNair Middle School and Stone Mountain High School — were added to the list.\nTwenty schools on the list are showing improvement, which Deal has said could find schools exempt from possible state takeover as well. Of those, six schools have a CCRPI average of between 55 and 60 for the three-year period and 13 more schools scored between 45 and 55, with the district saying they are on track to leave the takeover list in a few years.\nThree schools — Stoneview, Flat Shoals and Meadowview elementary schools — were deemed in need of intensive, enhanced assistance and services because of declining scores.\n•Stoneview showed a .7-point decline from 2014 to 2015, from 47 to 46.3.\n•Flat Shoals showed a 5.6-point decline from 2014 to 2015, from 50.8 to 45.2.\n•Meadowview showed an 8.7-point decline from 2014 to 2015, from 53.8 to 45.1.\nDeal’s proposal would let the state take control and, hopefully, transform poorly performing schools across the state. Voters will be asked at the polls in November whether to authorize the OSD.\n“Our students demonstrated significant academic growth, which is a precursor to achievement,” DeKalb schools superintendent Stephen Green said.\nGreen’s plan to turn around schools at risk of state takeover calls for a sharp focus on curriculum, heavy parental involvement and millions of dollars to get top teachers in struggling schools. It includes a team of administrators observing and tweaking the way students are taught in the classroom, providing tutors and mentors for assistance ahead of Georgia Milestones testing and pushing for more parent involvement. Hard data to gauge its success is not yet available, though, as the data released this morning came from testing mostly under former Superintendent Michael Thurmond, currently running for DeKalb County’s top government job.\nFind a rating for any Georgia school here.","url":"https://www.ajc.com/news/local-education/dekalb-schools-danger-state-takeover-show-improvement/CsKH9sBA5T9rzU6ZBrwNTP/"}
