{"authors":["Breitbart London"],"date_download":"2018-10-30 20:44:25","date_modify":"2018-10-30 20:44:25","date_publish":"2016-06-21 16:24:22","description":"Eurozone governments have eased up on efforts to overhaul their struggling economies because of the ECB's ultra-easy monetary policy.","filename":"data/vaneerConsumption/StrugglingEurozoneEconomiesRejectStructuralReformInFavourOfUltraEasyMoney.json","image_url":"https://media.breitbart.com/media/2016/06/FRANCE-EU-ECONOMY-CURRENCY-EURO-FEATURE-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_21__1540932265.html","title":"Struggling Eurozone Economies Reject Structural Reform In Favour Of 'Ultra-Easy' Money","title_page":"Struggling Eurozone Economies Reject Structural Reform In Favour Of 'Ultra-Easy' Money","title_rss":"NULL","source_domain":"breitbart.com","text":"LONDON (Reuters) — Eurozone governments have eased up on efforts to overhaul their struggling economies because the ECB’s ultra-easy monetary policy has pushed their borrowing costs to record lows, ratings agency Standard & Poor’s said on Tuesday.\nSpeaking in London, S&P’s top EMEA analyst Moritz Kraemer said there was a strong relationship between government bond yields — an indicator of how much countries must pay to borrow — and their willingness to undertake structural reforms.\nThe European Central Bank’s 1.7 trillion euro asset purchase scheme has helped push yields lower across the euro area, with yields on German bonds maturing in eight years or less now in negative territory.\n“All of these (reform) efforts from the governments have really fallen by the wayside under the palliative that the ECB is providing,” Kraemer told the Euromoney Global Borrowers & Bond Investors Forum.\nECB policymakers have been urging governments to take advantage of easy financing conditions to implement reforms and make sure the bloc’s slow recovery becomes more sustainable.\nBut “the moment the pressure goes away, the action goes away as well”, said Kraemer.\nIn a normal interest rate environment, Kraemer said, government deficits across the bloc would be 1.5 to 2 percentage points of GDP higher, which would force the issue of reform up the agenda for many states.\n“I’m not just talking of Italy’s deficit being close to 3 percent, I’m talking of close to 5 percent, and there would certainly not be a surplus in Germany.”\nS&P said earlier this month that a number of major economies could see their credit ratings cut or outlooks lowered if record low interest rates rise to more normal levels.\n(Reporting by John Geddie; Editing by Catherine Evans)","url":"https://www.breitbart.com/europe/2016/06/21/struggling-eurozone-economies-reject-structural-reform/"}
