{"authors":["Press Association"],"date_download":"2018-10-23 00:53:15","date_modify":"2018-10-23 00:53:15","date_publish":"2017-03-16 10:28:22","description":"The 40-year-old was charged on Wednesday with a breach of the World Professional Billiards and Snooker Association (WPBSA) regulations.","filename":"data/vaneerConsumption/StuartBinghamreadytotakehispunishmentafterbreakingbettingrules.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/17/wire-229681-1489684393-391_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319604_Stuart-Bingham-ready-punishment-breaking-betting-rules_1540255995.html","title":"Stuart Bingham ready to take his punishment after breaking betting rules","title_page":"Stuart Bingham ready to take his punishment after breaking betting rules | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former world snooker champion Stuart Bingham has said he will accept whatever punishment comes his way after admitting he broke the sport’s betting rules.\nBingham, 40, was charged on Wednesday with a breach of the World Professional Billiards and Snooker Association (WPBSA) regulations.\nWPBSA rules bar players from betting on any aspect of sanctioned tournaments, or from encouraging others to do so if it is deemed to be to the player’s direct or indirect benefit.\nAlthough the organisation stressed the alleged offence does not entail match manipulation or corruption, it was determined that Bingham had a case to answer.\nBingham said on his own website: “This was just a case of me not being clear on the rules. I did not know I was not allowed to bet on other players’ matches, I thought it was just my own I could not bet on, and I have never done that.\n“I have nothing to hide on the matter and have co-operated fully with the investigation and I now await the outcome.”\nBingham could be fined or face a ban, or both. One possible yardstick for the punishment coming his way is the fine of £5,000 and six-month suspended ban handed to fellow professional Alfie Burden in January for similar offences.\nSpeaking in The Times, Bingham added: “There have been enquiries going on over the last few weeks. I have used another account to place bets on snooker matches.\nStuart Bingham\n“It is similar to what Alfie Burden did, but I have never bet against myself, and never been involved in any match-fixing or corruption. I did some accumulators, and used someone else’s account. It was boredom, really.\n“It looks as if I have got it wrong, it was stupid, and I wasn’t aware enough of the rules. I have fully co-operated with the enquiries and will continue to do so.\n“But basically I did it, I can’t change that, and will have to take whatever is coming. We have to be seen to be whiter than white.”\nBingham was a surprise winner of the World Championship in 2015 and is currently ranked third in the world. He won the Welsh Open last month, beating Judd Trump in the final.\nStuart Bingham\nBingham’s case is unlikely to be heard until May at the earliest, given the length of time it takes the WPBSA to process such matters of discipline.\nThat means he should be clear to head into the World Championship, which starts in Sheffield on April 15, without the distraction of a hearing in the run-up.\nIt is understood there are notable distinctions between his case and that involving Burden, meaning it is not a foregone conclusion that a similar punishment would be handed out.\nWhile Burden was not represented when his case was heard, Bingham is expected to have legal guidance when he appears before the WPBSA disciplinary committee.\nIn the meantime, Bingham is due to play at the China Open, which begins in Beijing on March 27.","url":"https://www.dailymail.co.uk/wires/pa/article-4319604/Stuart-Bingham-ready-punishment-breaking-betting-rules.html"}
