{"authors":["Simeon Gholam For Mailonline"],"date_download":"2018-10-23 00:13:47","date_modify":"2018-10-23 00:13:47","date_publish":"2016-01-28 13:55:07","description":"Stuart Pearce is coming out of retirement at the age of 53 after signing for non-league Longford AFC, the Gloucestershire side who have lost all 18 of their games this season, conceding 179 goals.","filename":"data/vaneerConsumption/StuartPearcecomesoutofretirementaftersigningforLongfordAFC.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AAC80500000578-0-image-a-24_1453989208314.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421007_Stuart-Pearce-comes-retirement-signing-non-league-Longford-AFC-dubbed-worst-football-club-England_1540253627.html","title":"Stuart Pearce comes out of retirement after signing for Longford AFC","title_page":"Stuart Pearce comes out of retirement after signing for Longford AFC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stuart Pearce is coming out of retirement at the age of 53 after signing for non-league Longford AFC.\nThe legendary England left back, who won 78 caps for his country, has joined the Gloucestershire side dubbed 'the worst football club in England'.\nThey have lost all 18 of their games so far this season in the Gloucestershire Northern Senior League Division Two, conceding 179 goals in the process and scoring just once.\nStuart Pearce is coming out of retirement at the age of 53 after signing for non-league Longford AFC\nPearce poses with Longford manager Nick Dawe after joining the club on Thursday\nPearce has joined the Gloucestershire side dubbed 'the worst football club in England'\n'I believe grassroots football is essential to the lifeblood of the game so I jumped at the chance,' said Pearce.\n'I started out in non-league football playing for Wealdstone before joining Coventry City so I'm looking forward to working with manager Nick Dawe, and helping a group of talented young footballers achieve their dreams and, hopefully transform both the dressing room confidence, as well as, the on the pitch performance and seeing how far they can go up the league.'\nManager Dawe, meanwhile, was delighted with the signing of the defender nicknamed 'Psycho' during his playing days.\n'A year ago we were playing in front of one man and his dog and now we are set to [attract] hundreds for Stuart Pearce's debut,' he added.\n'Stuart knows that there will be no special treatment, he will still need to pay his £5 a game subs.'\nThey've lost all 18 of their games so far this season in Gloucestershire Northern Senior League Division Two\nPearce will be joining up with a defence that has conceded 179 times so far already this season\n'I believe grassroots football is essential to the lifeblood of the game so I jumped at the chance,' said Pearce\nPearce made more than 400 appearances for Nottingham Forest in a 12-year spell between 1985-97, before continuing his career at Newcastle, West Ham and Manchester City.\nThe former defender then pursued a managerial career, taking charge at former clubs Forest and City, as well as at international level for England's Under 21 side between 2007-13.\nIn 2012, he took caretaker charge of an England senior game, and also managed Team GB at the London Olympics.","url":"https://www.dailymail.co.uk/sport/football/article-3421007/Stuart-Pearce-comes-retirement-signing-non-league-Longford-AFC-dubbed-worst-football-club-England.html"}
