{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 02:06:17","date_modify":"2018-10-23 02:06:17","date_publish":"2017-04-26 12:59:54","description":"A study of 2,000 adults aged 50 to 59 shows the average has been in a relationship for over 23 years, and earns just over £19,000 a year for working an average of 21 hours a week.","filename":"data/vaneerConsumption/Studyrevealsthelifeoftheaveragefiftysomething.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F794100000578-0-image-a-9_1493207824685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446992_Study-reveals-life-average-fifty-something_1540260377.html","title":"Study reveals the life of the average fifty-something","title_page":"Study reveals the life of the average fifty-something | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The average fifty-something prefers Queen over The Rolling Stones, Grease over Ghostbusters and loves watching repeats of Fawlty Towers and Only Fools and Horses, according to new research.\nA study of 2,000 adults aged 50 to 59 shows the average has been in a relationship for over 23 years, and earns just over £19,000 a year for working 21 hours a week.\nHowever, despite harbouring big plans for the future, the average adult over 50 has just £4,511 in savings, and only £297 disposable income each month.\nAnd despite being halfway to 100, the average quinquagenarian still has a number of things to tick off their bucket list - from seeing the Northern Lights, to visiting a dream destination and swimming with dolphins according to the poll.\nHow do you match up? The average fifty-something has been in a relationship for over 23 years, and earns just over £19,000-a-year for working 21 hours-a-week\nA fifth of those polled do not have a penny to their name in savings, and top worries for this age group revolve around money and lack of plans in place for the future.\nThe study indicates four in 10 people over 50 have paid off their mortgage in full, while 28 per cent are still paying off their property-related debt.\nHowever, the average person still has debts of up to £4,641.45, three in 10 don't have any sort of pension plan set up and 52 per cent haven't yet written a will.\nUnderstandably, while health tops the list of worries for 58 per cent of people, 46 per cent are concerned about saving money and 38 per cent worry about financial security.\nThe average fifty-something in the UK has an annual income of £19,615 according to the study, and has around £4,500 in savings - although one in five has no savings at all\nBrits in their fifties love watching Only Fools and Horses, and listening to Queen, it seems\nLarry Banda, Director of Financial Planning for The Nationwide Savings, who conducted the survey, said: 'Hitting the half century in terms of years really is middle of the road.\n'Often we are squeezed from both sides - supporting both our grown-up children but also our parents as they get older.\n'Our research reveals a mixed bag of experiences. While money tends to be tight for the average fifty-something, with debt narrowly outweighing savings, they are an aspirational group, intent on enjoying the good times.'\nHaving a decent pension to retire on, and being able to support the children and grandchildren financially also appear among the top 10 worries.\nOnly 40 per cent of quinquagenarians have paid off their mortgage while 28 per cent still rent\nThe study has also revealed that their biggest worries are health and saving money overall\nBut despite concerns about money, those in their fifties claim to be reasonably content with life and the average month will see at least one night down the pub, an evening in a nice restaurant and two days out with the family.\nExercise is also on the wane for those in this age category, three in five people don't exercise at all while only a third work out the recommended three times a week or more.\nAlthough one in five people polled do work out ten times a month or more.\nTravel aspirations are low among fifty-somethings with just 20 per cent keen to travel the world\nBiggest worries 1. My health 2. Saving money overall 3. Financial security 4. Partner's health 5. Whether I'll have a decent pension 6. Paying the bills 7. Retirement 8. Changes in my body 9. Supporting children / grandchildren 10. Children's health\nFavourite bands 1. Queen 2. David Bowie 3. Fleetwood Mac 4. ABBA 5. Eagles 6. Electric Light Orchestra 7. The Beatles 8. Bee Gees 9. Blondie 10. Carpenters\nWhen it comes to retirement - which for some is less than ten years away - 29 per cent of people say they have no plans whatsoever.\nHowever, 27 per cent want to go on multiple hobbies and 24 per cent would like to use the time to embark on new hobbies and interests.\nA further 15 per cent would like to spend more time with the grandchildren and 13 per cent intend to downsize their property.\nLarry Banda for Nationwide continues: 'Planning ahead for life events - whether retirement, helping the kids get on the housing ladder or building a nest egg that will enable you to enjoy life - is a worthwhile habit to get into.\nMeanwhile the majority of people in their fifites own a Fiesta and work 21 hours a week\n'And with around half of those in their fifties either renting or still paying off their mortgage, it could prove the difference between going on that fantastic holiday of a lifetime or staying in windowsill bay. Even saving a little over a period of time can make a real difference'.\nHeather Small, 52, singer from classic 90s house band M People said: 'The research shows how hitting your fifties is a real balancing act, with responsibilities on all sides - putting in the hours at work, looking after grown-up children but also ensuring you take care of your own parents.\n'It's no wonder that money is tight in this age bracket, although what is good to see is that we are an aspirational bunch. Despite pressures, we keep our dreams in our back pockets - from dream holidays to learning a new language'.\nFavourite TV 1. Only Fools and Horses 2. Fawlty Towers 3. Blackadder 4. Dad's Army 5. The Vicar of Dibley 6. Star Trek 7. The Two Ronnies 8. Doctor Who 9. Emmerdale 10. Steptoe and Son","url":"https://www.dailymail.co.uk/femail/article-4446992/Study-reveals-life-average-fifty-something.html"}
