{"authors":[],"date_download":"2018-10-30 01:21:03","date_modify":"2018-10-30 01:21:03","date_publish":"2018-08-29 21:03:00","description":"Georgia needs small business growth to make up for trade threat, GSU says.","filename":"data/vaneerConsumption/StudyJobgrowthshouldcontinueinGeorgiathisyear.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/29/Videos/4471529.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_study-job-growth-should-continue-state-this-year__1540862463.html","title":"Study: Job growth should continue in Georgia this year","title_page":"Georgia corporate jobs have slipped, GSU forecaster says","title_rss":"NULL","source_domain":"ajc.com","text":"Solid job growth in Georgia will continue through this year and into the future, defying the odds against a pick-up in hiring so late in an expansion, according to a high-profile forecast from Georgia State University.\nThe state will add 78,400 jobs this year – the lion’s share of them in metro Atlanta – which is significantly stronger than last year’s results, according to the Economic Forecasting Center’s report.\nJob growth may even be stronger than the official data so far, said Rajeev Dhawan, director of the center, at the organization’s quarterly conference on Thursday. “It is very rare to see a pick-up like that this far into an expansion. And I think a lot of the small business haven’t been counted yet.”\nAfter a vicious recession that eliminated more than one in every 12 jobs in Georgia, the economy since early 2010 has added nearly 700,000 jobs while the unemployment rate dropped to a 17-year low. But that expansion is now one of the oldest on record.\nPatrick Beharelle, Atlanta-based president and chief operating officer of TrueBlue, a $3 billion-a-year staffing and recruiting company, said his business is a leading indicator – a signal of where the economy is heading.\nWhen their businesses dip, companies can quickly cut back on temporary help or the search for full-timers dips, he said. “We generally see the downturn about nine months before the recession comes on.”\nWhile the U.S. trade tussles have hurt a small number of companies, most have seen no impact, Beharelle said. “What our clients tells us is that they expect to continue to grow during the next couple of quarters.”\nDemand has been robust in healthcare, construction and the companies that serve e-commerce, he said. “We feel pretty good about where the economy is.”\nRajeev Dhawan, director of the Economic Forecasting Center at Georgia State University (AJC file photo) (The Atlanta Journal-Constitution)\nDhawan said that while unexpected economic trauma – say, spiking oil prices – could wreak havoc, none of the obvious threats are likely to spin the economy into a ditch.\nFor example, he dismissed concerns about an apparent drop in the rate at which consumers save money.\n“There are people who are worried about the expansion running out of steam,” he said. “But that is accounting jiggering which has had no impact on the way the economy is going to go.”\nAnd while higher rates are often the death of expansions, the Federal Reserve will remain cautious this time, Dhawan predicted.\nThe Fed’s campaign to ratchet up the cost of borrowing money – which means higher consumer payments to credit cards as well as higher mortgage rates for homebuyers – will be limited, he said. “They will raise rates in September. My forecast is that there will be no December hike.”\nThe Fed historically raises those rates to head off inflation, but the data shows only modest escalation in prices – and very little of it from higher pay to workers, he said.\nWhen the Fed is focused on killing inflation, it can raise rates aggressively, and the danger is that those short-term rates might climb higher than long-term rates in what is called “an inversion of the yield curve.”\nVirtually every time that has happened, a recession has followed.\nBut Dhawan said that recent statements by Fed Chairman Jerome Powell have convinced him that the Fed will be careful this time. “They will not invert the yield curve. They just won’t take that gamble.”\nEmbedded in the good Georgia job numbers is one troubling puzzle.\nThe data so far this year shows job growth concentrated in sectors that are driven by domestic spending construction, retail, finance, healthcare, hospitality and government. In contrast, there have been job losses in the sectors that are influenced by global factors: corporate, technology and manufacturing.\nThat could spell trouble for Georgia. But Dhawan said he thinks that the first set of data about jobs itself is dubious, since it conflicts with the growth in income.\n“I have the feeling that the last year’s numbers will get revised up,” he said. “If there were really a problem, it would show up in the income numbers.”","url":"https://www.ajc.com/business/study-job-growth-should-continue-state-this-year/m0XFX6erKhn5waTcwJ76sM/"}
