{"authors":[],"date_download":"2018-10-30 18:16:15","date_modify":"2018-10-30 18:16:15","date_publish":"2017-04-13 20:56:00","description":"Morehouse College tries to move past recent drama","filename":"data/vaneerConsumption/StudentshopefulaboutnewMorehousepresident.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/13/Images/newsEngin.18386683_041417-morehouse-ba02.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_moreho_cc01bdcdeea18ac13123e0ac43945bb2__1540923375.html","title":"Students 'hopeful' about new Morehouse president","title_page":"Students 'hopeful' about new Morehouse president","title_rss":"NULL","source_domain":"ajc.com","text":"Morehouse College’s interim president held his first meeting Thursday with students in an attempt to unify them, faculty and alumni after months of turmoil on the Atlanta campus.\nThe board of trustees last week terminated the contract of its prior president, John S. Wilson, two months before it was set to expire. The board also announced that longtime board chairman Robert Davidson and the other trustee leaders were no longer in their positions. William Taggart, a longtime business executive, was named interim president.\nChannel 2's Nefertiti Jaquez reports.\nTaggart said he discussed with students his ties to the college, such as Morehouse alumni who’ve mentored to him, and his decades-long friendship with the new board chairman, Willie Woods.\n“I have a great, natural affinity to Morehouse,” said Taggart, an Atlanta native who earned his undergraduate degree from Howard University. “I may not have been a Morehouse man, but I’m one in spirit.”\nTaggart said about two dozen alumni gave him contributions for the college after the meeting. The interim president said he plans more outreach with alumni and major businesses in Atlanta to increase fundraising.\nTaggart also said he plans to meet with the Southern Association of Colleges and Schools, Morehouse’s accreditation agency, later this month to present to them “the real Morehouse.”\nFaculty last month requested that SACS visit the college to address concerns that board members weren’t following their bylaws by acts such as not permitting student and faculty trustees to participate in key board decisions. The board voted last week to change that policy.\nStudent trustee Johnathan Hill said students are so far “hopeful” about the college’s new leadership and want to learn more about Taggart.\n“The students feel engaged,” Hill said. “The students want to be a part of the conversation.”","url":"https://www.ajc.com/news/local-education/morehouse-college-new-leaders-attempt-turn-the-page/Sacd7LAxMaYDCttMsNoQRN/"}
