{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:10:09","date_modify":"2018-10-30 21:10:09","date_publish":"2015-02-20 19:16:20","description":"In January, students at UC Davis passed a resolution urging the school to divest from companies doing business in Israel. On Wednesday, UC Davis's student court declared the resolution to be unconstitutional (i.e. not in accordance with standards outlined in the student court) and ruled against it, following an appeal from the university's students. |","filename":"data/vaneerConsumption/StudentCourtatUCDavisStrikesdownAntiIsraelDivestmentResolution.json","image_url":"https://media.breitbart.com/media/2015/01/israel-boy-flag-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_02_20__1540933809.html","title":"Student Court at UC Davis Strikes down Anti-Israel Divestment Resolution","title_page":"Student Court at UC Davis Strikes down Anti-Israel Divestment Resolution | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In January, students at UC Davis passed a resolution urging the school to divest from companies doing business in Israel. On Wednesday, UC Davis’s student court declared the resolution to be unconstitutional (i.e. not in accordance with standards outlined in the student court) and ruled against it, following an appeal from the university’s students.\nAccording to the Sacramento Bee, the Court of the Associated Students of UC Davis found that the ASUCD Senate resolution was political in nature, and that it did not fall within the purview of the student government which is to deal with issues affecting student welfare.\nThe student court’s decision rescinds the resolution and does not require any action by the student senate. The ASUCD’s president is Maxwell Kappes. Many have posited that the original resolution had been symbolic, yet the UC Students Association expressly stated that they were going after the UC Regents (the school system’s governing body) next.\nLast month, two apparently antisemitic hate crimes were carried out on UC Davis’s campus, targeting two of the school’s Jewish student organizations. Swastikas were spray-painted outside of the Alpha Epsilon Pi fraternity and a janitor had discovered “grout out the Jews” written into the tile grout at the Hillel House there. The incidents are reportedly under investigation, although campus authorities were reluctant to tie them to the divestment votes.\nFollowing the UC Davis vote, radical comedienne Roseanne Barr tweeted that she hoped the school would be “nuked.” On Thursday night, Davis’s ASUCD’s President Kappes told the Bee that he drew up a “Roseanne Barr Resolution” urging the comedienne “not to nuke the campus.” He said that while he did not take her statement seriously, that he wrote the resolution in to be facetious.\nUC officials have held the same position they have had since 2010, when they stated that they would not divest from businesses working with Israel and expressed concerns that Israel was being unfairly targeted in the resolutions, notes the Bee. Many believe that Israel is often held to a much higher standard than the rest of the world.\nEarlier this month, the UCSA voted at UCLA to divest from Israel and America. The UCSA is an independent, student-run organization. In an email to Breitbart News, the school used a statement issued by the school’s Chancellor Gene Block last fall: “The Board of Regents does not support divestment in companies that engage in business with Israel and UCLA agrees with that position.”\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/local/2015/02/20/student-court-at-uc-davis-strikes-down-anti-israel-divestment-resolution/"}
