{"authors":["Sarah Rumpf"],"date_download":"2018-10-30 21:24:36","date_modify":"2018-10-30 21:24:36","date_publish":"2015-01-30 15:02:22","description":"A new nonpartisan study released on Thursday revealed positive effects from juvenile justice reforms passed in Texas during recent years, with the state showing a significant drop in the juvenile incarceration rate while the juvenile crime rate also fell during the same time period. |","filename":"data/vaneerConsumption/StudyTexasJuvenileJusticeReformsHavingPositiveEffect.json","image_url":"https://media.breitbart.com/media/2015/01/texas-youth-commission-facility-marlin-tx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_01_30__1540934676.html","title":"Study: Texas Juvenile Justice Reforms Having Positive Effect","title_page":"Study: Texas Juvenile Justice Reforms Having Positive Effect","title_rss":"NULL","source_domain":"breitbart.com","text":"A new nonpartisan study released on Thursday revealed positive effects from juvenile justice reforms passed in Texas during recent years, with the state showing a significant drop in the juvenile incarceration rate while the juvenile crime rate also fell during the same time period.\nThe study by the Council of State Government’s Justice Center showed that, from 2007 to 2012, the number of juveniles detained in Texas state facilities dropped from around 4,305 to about 1,500, a decrease of 66 percent, while the juvenile crime rate fell by a third, as reported by the Associated Press.\nThe reforms including shifting many juvenile offenders from state facilities to community-based programs that were managed by counties and located closer to the juveniles’ homes, allowing them more contact with their families and making it easier for them to stay enrolled in school. According to the study, the juveniles who were assigned to community programs were 20 percent less likely to be arrested again, as compared to those sent to state facilities, and were three times less likely to commit serious crimes.\nThe reforms have been funded by the $150 million that Texas has saved as the state has cut the number of juvenile offenders in state-run facilities, with the majority of those funds being redirected to community-based programs.\nState Senator John Whitmire (D-Houston), who chaired the Senate Criminal Justice Committee when these reforms were passed, praised the efforts to keep juvenile offenders closer to home. “Out of sight, out of mind was no longer the standard,” he said. “Getting them back in their community has been very successful.” As Breitbart Texas reported, Whitmire will retain his chairmanship of this committee, as one of two Democrats who Lieutenant Governor Dan Patrick appointed as committee chairs for this legislative session.\nDianna Muldrow, policy analyst at the Right on Crime campaign at the Texas Public Policy Foundation’s Center for Effective Justice, said that the study results showed the wisdom of Texas’ approach to criminal justice reform. “The report reiterates what the Texas Public Policy Foundation has been advocating for years, that big spending and expanded facilities do not translate into lowered crime rates,” said Muldrow. “Texas is now a model for other states wanting to take on their high juvenile incarceration rates, illustrating that low-risk children can be handled close to their homes and communities while improving public safety and at a savings to the taxpayer. We are optimistic that the legislature will continue to forward policies that keep the Lone Star State ahead of the curve in efficient governance.”\nWith 1.3 million individual juvenile offenders in Texas’ juvenile justice system, the nation’s second largest system, criminal justice advocates say more reforms are needed. Right on Crime, for example, has advocated eliminating the use of criminal penalties to punish school truancy, as Breitbart Texas reported.\nFollow Sarah Rumpf on Twitter @rumpfshaker.\n[Disclosure: Sarah Rumpf was previously employed by the Texas Public Policy Foundation.]","url":"https://www.breitbart.com/border/2015/01/30/study-texas-juvenile-justice-reforms-having-positive-effect/"}
