{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:02:14","date_modify":"2018-10-30 21:02:14","date_publish":"2016-03-24 15:22:51","description":"Artwork showing a white police officer in a KKK hood pointing a gun at a small black child in a hoodie with his hands raised has outraged community members.","filename":"data/vaneerConsumption/StudentsArtworkinCityBuildingDepictsCopinKKKHoodSparkingOutrage.json","image_url":"https://media.breitbart.com/media/2016/03/Denver-students-art-KKK-cop-pointing-gun-at-black-kid-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_24__1540933334.html","title":"Student's Artwork in City Building Depicts Cop in KKK Hood, Sparking Outrage","title_page":"Student's Artwork in City Building Depicts Cop in KKK Hood, Sparking Outrage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Artwork showing a white police officer clad in a Ku Klux Klan hood and pointing a gun at a small black child in a hoodie, hands raised, has outraged community members and prompted a meeting between city officials and the artists’s mother.\nThe piece, which was part of a Denver Public Schools outreach program and had been displayed in a city building, has sparked “concerns from the community,” according to a statement from Denver Mayor Michael Hancock.\n“Students were asked to select a master work of art, research it and re-contextualize it,” the release explains. “After learning of the negative impact of her work, the student has asked that it be taken down.”\nThe artist and her mother were scheduled to meet on Wednesday with Mayor Hancock, Chief of Police Robert White, and Acting Superintendent Susana Cordova at Kunsmiller Creative Arts Academy.\n“I’m greatly concerned about how this painting portrays the police,” White said in the release. “I look forward to having a conversation with the student and her parents.”\nMayor Hancock says he wants to use this situation as an “opportunity to listen and learn from each other and to encourage students to engage in difficult conversations.\nThank you for your comments and concerns surrounding this issue. pic.twitter.com/HzFO6fluRM — Michael B. Hancock (@MayorHancock) March 23, 2016\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/politics/2016/03/24/students-artwork-in-city-building-depicts-cop-in-kkk-hood-sparking-outrage/"}
