{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:18:18","date_modify":"2018-10-30 18:18:18","date_publish":"2016-04-02 19:12:20","description":"Snowflakes triggered as pro-Trump messages spread on American campuses. | Tech","filename":"data/vaneerConsumption/StudentsAfraidAfterProTrumpChalkMessagesAppearonCampusesAcrossAmerica.json","image_url":"https://media.breitbart.com/media/2016/03/afp_c4d6ac4454ef4a1bbe43f4c36b9e937358ade1b8-e1458226091153.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_04_02__1540923498.html","title":"Students 'Afraid' After Pro-Trump Chalk Messages Appear on Campuses Across America","title_page":"Students 'Afraid' After Pro-Trump Chalk Messages Appear on Campuses Across America | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Colleges around the country are facing an epidemic; an epidemic of Trump supporters, who are causing panic among the regressive left by scrawling chalk messages in support of Donald Trump around campuses.\nThe trend began at Atlanta’s Emory University on March 21st, where a message entitled “TRUMP 2016” appeared in chalk on a campus sidewalk. Student immediately began protesting, telling campus officials that the pro-Trump messages made them feel “afraid” and “in pain.”\nSimilar incidents occured at the University of Kansas, where “TRUMP 2016” and “VOTE TRUMP 2016” chalk messages also appeared.\nPro-Trump messages also appeared at the University of Michigan, in addition to a giant “STOP ISLAM” slogan scrawled in pink chalk. (This was presumably a reference to the #StopIslam hashtag which emerged on Twitter in the wake of the recent Brussels terror attacks).\nGiant #stopislam sign scribbled on U of M Diag. many Islamic students here woke up to this today @wxyzdetroit pic.twitter.com/YEhJUc8RSi — Jonathan Carlson (@TVreporter) March 31, 2016\nThe most recent incident occurred at the University of California, Santa Barbara. Chalk messages included “Trump build the wall 2016,” “Obama is a Muslim,” “Muhammed f***ed children” and “the wall just got 10 feet higher.”\nThere have also been reports of pro-Trump chalk messages at Louisiana State University, the University of Maryland, Kansus University, Central Michigan University, Texas A&M, Texas State, Mississippi State University, Arizona State University, Florida State University, Oklahoma State University, the University of Houston, The University of Alabama at Birmingham, and the University of Arkansas, Fort Smith.\nThe chalk messages have caused outraged reactions from some students. Alejandra Melgozer, a Chicano studies and social science major at UCSB, told the college paper that she feared the pro-Trump messages would scare off future students: “It concerns me to have families and potential incoming students not want to enrol into our beautiful campus due to hateful speech they may see while they walk around our lovely campus.”\nAt the University of Michigan, students were so triggered by the pro-Trump messages that they called the police. Anti-Islam chalk messages on campus were also denounced by the UoM administration, and are being investigated by an Arab-American advocacy group, who called them “hate graffiti.”\nAt Scripps College, a pro-Trump message that appeared on a college whiteboard was condemned as “racist” and “violent” by the student body president.\nSMH. @ScrippsCollege, are you trying to be the next Emory?! pic.twitter.com/bPObz6BOOs — Hannah Oh (@hannahoh16) March 26, 2016\nMeanwhile, at Emory, students staged a 40-man protest against Trump supporters on campus and urged the university administration to “decry the support for this fascist, racist candidate.”\nHowever, despite meeting with anti-Trump students and initially promising potential disciplinary action against students found to be writing the chalk messages, Emory President James W. Wagner instead chose to come down on the side of free speech. Surrounded by students from the Emory chapter of Young Americans for Liberty (YAL), Wagner chalked a message stating “Emory stands for free expression.”\nNevertheless, the Emory administration also issued an official statement condemning the pro-Trump messages as representing “values regarding diversity and respect that clash with Emory’s own.”\nDan Scavino, Director of Social Media for the Trump campaign, has been using Twitter to encourage the pro-Trump chalk messages on Campus. Scavino said he would pass on the “best” pro-Trump chalk messages to the candidate himself.\nThe pro-Trump messages are the latest challenge to the regressive left on college campuses, who in recent months have been put on the defensive against resurgent defenders of free speech, who increasingly enjoy the support of university faculties.\nYou can follow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/04/02/students-terrorised-pro-trump-chalk-messages-appear-campus/"}
