{"authors":[],"date_download":"2018-10-30 20:09:41","date_modify":"2018-10-30 20:09:41","date_publish":"2016-12-20 23:03:00","description":"A legal dispute between a metro Atlanta college student and school administrators over his Christian evangelism highlights free speech issues on campuses.","filename":"data/vaneerConsumption/StudentevangelizingsparkslawsuitagainstGwinnettcollege.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/20/Images/newsEngin.17198887_Ga-Gwinnett-College-library.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_studen_6e8018c5e2e0dc8fa0dd57d33a3fad2d__1540930181.html","title":"Student ‘evangelizing’ sparks lawsuit against Gwinnett college","title_page":"Student ‘evangelizing’ sparks lawsuit against Gwinnett college","title_rss":"NULL","source_domain":"ajc.com","text":"A legal dispute between a metro Atlanta college student and school administrators over his Christian evangelism has exposed the frequent friction schools encounter over determining where students can speak on campus.\nGeorgia Gwinnett College student Chike Uzuegbunam filed a lawsuit Monday in U.S. District Court in Atlanta against the college, arguing his free speech rights were violated.\nUzuegbunam distributed fliers sharing his Christian faith and spoke with other students one day last summer near the library on the Lawrenceville campus, which has about 11,000 students. He said a school official told him he couldn’t continue what he was doing in that area. School policy required Uzuegbunam to ask for permission to speak three days in advance and limited him to only two areas on campus his attorneys described as “tiny.”\nGeorgia Gwinnett College has two “free speech expression areas.” One is located between the student housing and the student center. The other is near the food court. The areas are available a total of 18 hours a week.\nThe student said campus police told him on another occasion he couldn’t speak in one permitted zone because officials received complaints about his remarks.\n“Free speech on campus is supposed to be a no-brainer,” said Travis Barham, legal counsel with the Alliance Defending Freedom, which is representing the student. “The only permit students are supposed to need is the Constitution.”\nThe college declined comment on the lawsuit, saying through a spokeswoman it doesn’t comment on pending litigation.\nThe alliance’s battle with GGC is the latest disagreement between the Christian organization and a Georgia college over campus speech. It sued the University of Georgia in 2014 on behalf of some students over a somewhat similar complaint. UGA required groups to secure a permit from the dean of students for demonstrations outside two designated free-expression areas. The alliance withdrew its lawsuit last year after UGA made revisions to its policy.\nStudents and others walk on the Georgia Gwinnett College campus. BOB ANDRES / BANDRES@AJC.COM\nIn 2006, the alliance sued Georgia Tech for its use of a free speech zone and portions of the university’s “Safe Space” training manual that were considered unconstitutional. The university eliminated part of its speech code and in 2008, a federal court judge agreed that the training manual should be changed.\nThe alliance is also representing Atlanta’s former fire chief, Kelvin Cochran, who was fired by the city in 2015 after writing a book that described homosexuality as an “unclean” act. City officials said Cochran didn’t receive city approval to publish the book and risked sending a message to his staffers that they were expected to embrace his beliefs. Cochran said he was fired because of his Christian beliefs and sued, arguing his Constitutional rights — including freedom of speech and free exercise of religion — were violated.\nOther areas and other times may be authorized upon written request. Student Affairs official is responsible for reservation scheduling. The Dean of Students reviews rejected applications. Sally Ramey, a spokeswoman for the college, said it reviews its policy on its free speech expression areas annually.\nStudents who violate the college’s speech code policy can be disciplined with penalties as severe as expulsion, the alliance noted in its lawsuit.\nDavid L. Hudson Jr., who’s written several books about student-speech issues, free speech zones became popular at many colleges, starting in the 1990s when administrators wanted greater control over outside groups speaking on the campus. Many colleges typically change their policies when challenged legally.\n“The idea of zoning speech actually limits it,” said Hudson, who teaches at three colleges in Tennessee. “It’s not an expansion of student speech.”\nThe alliance contacted the college in June 2013 to raise concerns about its policy and offered its help, it said in its complaint. The college, the alliance said, never responded.\n“Now,” Barham said, “we’ve had to take them to court to change the policy.”","url":"https://www.ajc.com/news/local-education/student-evangelizing-sparks-lawsuit-against-gwinnett-college/aHS5I30X78uu6zWZLGgNiI/"}
