{"authors":[],"date_download":"2018-10-22 21:44:28","date_modify":"2018-10-22 21:44:28","date_publish":"2014-05-08 00:00:00","description":"Saffron Cassady is just 26 years-old but her directorial debut “Cyber-Seniors” is focused on helping the older generation get connected.","filename":"data/vaneerConsumption/StudentsHelpSeniorsBridgeTheDigitalGenerationGap.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/429181/140508-marion-rapping-granny-1108_c5a6a5a7aa3f56a650bf2cbd32ac2ac3.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_maria-shriver_students-help-seniors-bridge-digital-generation-gap-n100021_1540244668.html","title":"Students Help Seniors Bridge The Digital Generation Gap","title_page":"Students Help Seniors Bridge The Digital Generation Gap - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Filmmaker Saffron Cassaday The Best Part Inc.\nSaffron Cassaday is just 26 years-old but today she celebrates the Los Angeles premiere of her directorial debut “Cyber-Seniors,” a documentary that follows a group of seniors as they tackle their digital deficiencies with the help of some very patient high-school students.\nThe results are alternately charming (families reconnecting via Facebook), hilarious (93-year-old Marion rapping about her O.G. Teeth on YouTube), and poignant -- many of the students have stayed in touch with the seniors they helped.\nThe film has partnered with the American Association of Retired Persons (AARP) Foundation, which has its own initiative to bridge the digital generation gap, to spread the word and encourage seniors to get online.\n“Cyber-Seniors” began as a family affair: Cassaday initially became interested in the story thanks to the work of her two younger sisters, Kascha and Macaulee, who began offering seniors computer tutorials as part of a high school community project, which was originally inspired by their own grandparents who had benefited from being online.\nBut the film is about a lot more than forgotten passwords and passing Facebook flirtations.\n“What is the internet? How did all this information get on there? It’s kind of a foreign concept,” says director Cassaday as she explains how seniors can struggle to get their bearings online. She illustrates her point by sharing the experience of Shura, a senior featured prominently in the film.\n“A moment that didn’t make it into the film, was one day Shura said, ‘I had a dream last night and it all makes sense to me now. I went into the library and I asked for the book called “Internet” and in the book each page was a web page.’ Before she thought of it in that way, she couldn’t understand what a web page was in relation to the rest of the internet, but her student Max had kept giving her that analogy, and one day it just clicked for her, and then all of a sudden it just became way easier for her to navigate from site to site.”\nShura passed away towards the end of last year, but her student Max, who had kept in touch with her, attended her funeral, and her family expressed their appreciation for all the work he had done with her.\nCyber-Senior Shura toasts her mentor Max The Best Part Inc.\nHere, Cassaday discusses how the digital revolution has accelerated the generation gap, how the young students she filmed discovered they had more in common with the seniors than they first thought, and what the seniors taught her about the reality of growing old.\nThe digital revolution magnified the generation gap for seniors who were not web savvy. What impact do you think that had?\nI just think the internet has really changed the way that we communicate. In the past, senior citizens lived with their kids and grandkids in the same house, then they lived in the same town, now we have families who are living across the world from each other. The rest of us adapted by staying in touch through technology, but they’ve kind of been left behind and left out of that. As they get older, they can’t move around as much; they can’t fly to Australia or another country to visit family members. The internet really does help them to reconnect with family members that they don’t get to do that often.\nWhat did the high-school students think of the seniors at first, and how did their attitude towards them evolve as they began working together?\nI think at first they were a little bit nervous working with that demographic because it’s not a demographic that they were used to hanging out with. But I think they quickly started to realize that they had more in common then they thought. They started to like them as people and to enjoy their company. I mean we had some students working with seniors who didn’t need a full hour of lessons, so they would just kind of come and bring their laptop and sit next to the senior and hang out and show each other cool things on the internet. They realized that they had things they could talk about, that they could have fun together.\nBeyond digital know-how, what do you think the seniors derived from working with these young people?\nI think learning anything at that age is really good for your mind. So, joining any kind of club which teaches you something new and gets you out of your room and gets you to meet new people, really improves your quality of life as you get older. It was great for them to learn how to use technology but any kind of lesson or club that seniors can join I think can really impact their life quality.\nAll the seniors said they liked being around young people. I think they’re so used to being around senior citizens all the time, that being around young people who have this energy really gives them energy, and it’s just fun to meet new people.\nWhat did you learn from working with senior citizens that surprised you?\nI think it taught me that you can have a lot of fun in your later years and that retirement age isn’t something to be afraid of. I think a lot of people dread getting older and think that there’s no fun to be had, and that’s just not true. People are living way longer now and they’re living healthy, happy lives. A lot of these senior citizens weren’t sitting around bored. They’re active, they’re out there, they have busy schedules. It’s good to know that there are things to look forward to in later life.\nWhat do you hope younger generations will take away from the movie?\nWhat I’ve found is that young people come to see the film thinking it might be kind of an educational movie and what they realize is that it’s quite an entertaining movie that they can laugh at. We hope that it inspires them to teach a senior how to get online, teach a senior something tech related -- it can be their grandparents, it can be through a community center, or through a retirement residence in their community. It’s a great way for them to take on a leadership role in their community that looks great on college resumes, but it’s also a lot of fun.\nThe age of the seniors didn’t necessarily correlate with their passion for the web. What was the common denominator amongst the seniors who became the most active online?\nI think the ones who had the most to gain by getting online were the ones who succeeded the most. So, the ones who had relatives in far off places. If a senior still lived with relatives or had relatives nearby, it wasn’t as much of a need. And also for the seniors who stay active and are constantly learning new things, it just comes easier for them.\nOne senior called Marion, who is 93 years-old, she was still taking university courses when we met her. She would just go down to the local college campus and just sit in on classes. She picked up the internet really quickly because clearly her brain is just used to learning new things and it’s something that really excites her.\nHow did the seniors respond when they saw the film?\nThey loved it! One senior, Annette, is obsessed with the film. She’s constantly updating her Facebook status and just telling everyone where it’s screening and wanting everyone to see it. She loves the idea of being in a movie. But in general they were all really happy with it and they were all really happy to have gotten this experience of learning how to get online and seeing it documented in a way that can inspire other senior citizens to do the same thing.\nFor more information and inspiration visit MariaShriver.com","url":"https://www.nbcnews.com/feature/maria-shriver/students-help-seniors-bridge-digital-generation-gap-n100021"}
