{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-22 23:34:40","date_modify":"2018-10-22 23:34:40","date_publish":"2016-01-29 11:34:18","description":"Miss Ashurst is cheered on after taking on teenage student, Alfy Mackay, in an impressive rap battle in a playground. The video was filmed last year at Kings of Wessex Academy in Cheddar, Somerset.","filename":"data/vaneerConsumption/StudentAlfieMackayfacesteacherinimpressiveplaygroundrapbattleatKingsofWessexAcademyinCheddarSomerset.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1DDAF00000578-0-image-a-25_1454067180176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422477_Teacher-takes-teenage-male-student-impressive-playground-rap-battle_1540251280.html","title":"Student Alfie Mackay faces teacher in impressive playground rap battle at Kings of Wessex Academy in Cheddar, Somerset","title_page":"Student Alfie Mackay faces teacher in impressive playground rap battle at Kings of Wessex Academy in Cheddar, Somerset | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It takes a brave person to take on a teenage boy in a rap battle in front of a large crowd of shouting pupils - but this young teacher firmly holds her own.\nIn a video from last year that has emerged online Miss Ashurst, an English teacher at Kings of Wessex Academy in Cheddar, Somerset, is surrounded by cheering school children in the playground as she faces off with Alfy Mackay, 16.\nToday Mackay praised Ashurst as 'a sick teacher'.\nThe teenager had been running a rap battle stand as part of a charity event at the school. Mackay, originally from Camden, London, was offering a rap battle with himself for the price of 50p.\nBring it on: It takes a brave teacher to put their professionalism - and possibly their dignity - to one side and enter a rap battle with a teenage boy, but Miss Ashurst holds her own when facing Alfy Mackay at Kings of Wessex Academy in Cheddar, Somerset\nConfident Mackay (now 16) starts the battle, rapping: 'Miss, you wish you could see me, you wish you could teach me, but I'm like a genie, give me your wishes, you better go home and clean up my dishes.'\nEveryone shouts and yells in admiration of the boy's audacity. Ashurst, who didn't realise she was being filmed, seems to be showing mock shock, but takes no real insult.\nHe continues: 'Listen to this, no matter what it is you're just weak, you still get paid at the end of the week, I pay your wages, so step back.'\nTaking it all in her stride, the teacher is doubled up in laughter as she listens to the student.\n'Grab a pen and start writing more lyrics because your lyrics are like whack gimmicks. Don't come around here with all these critics because I will ruin you in front of everyone.\nLater he raps: 'I could be your son, I could be your mum but I don't care.'\nThey all encourage their teacher in her rap. She begins: 'Alfy Mackay you are so dumb you can't even walk, you crawl off your bum' and later 'Alfy Mackay lose all the attention, your lyrics are cr*p imma put you in a detention'\nHe finishes with: 'You're my teacher, I'm gonna come around and sneak her, I'm gonna grab you and throw you in the boot'.\nHis rap over, it's now her turn. 'You got to bring it back, Miss', the crowd encourages Ashurst.\n'I can't do it for as long as you, I can only do two-liners.' she admits. But some kind boys begin beat-boxing to ease her into her rap.\nAshurst stands thinking before launching in: 'Alfy Mackay you lose all the attention, your lyrics are cr*p imma put you in a detention' she finishes, squaring up to him jokingly before the group of schoolchildren erupt in glee.\nThe crowd screams and laugh as the camera focuses on the excited, open-mouthed faces of the teenagers, amazed at what they are witnessing.\nThe charity event was repeated this year but Mackay said that Miss Ashurst wasn't 'up for doing it again'.","url":"https://www.dailymail.co.uk/news/article-3422477/Teacher-takes-teenage-male-student-impressive-playground-rap-battle.html"}
