{"authors":["Associated Press"],"date_download":"2018-10-22 20:59:10","date_modify":"2018-10-22 20:59:10","date_publish":"2016-01-28 05:33:57","description":"DETROIT (AP) — Vehicles equipped with automatic braking or front-collision warning are less likely to cause a rear-end crash, according to a study released T...","filename":"data/vaneerConsumption/Studyfindsautomaticbrakingcutsrearendcrashrisk.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420383_Study-finds-automatic-braking-cuts-rear-end-crash-risk_1540241950.html","title":"Study finds automatic braking cuts rear-end crash risk","title_page":"Study finds automatic braking cuts rear-end crash risk | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Study finds automatic braking cuts rear-end crash risk\nDETROIT (AP) — Vehicles equipped with automatic braking or front-collision warning are less likely to cause a rear-end crash, according to a study released Thursday by the insurance indu33stry.\nThe Insurance Institute for Highway Safety says automatic braking — which can bring the car to a stop if it senses an imminent collision — can reduce rear-end crashes by 40 percent. Front collision warning — which warns the driver but doesn't brake — cuts the risk of a rear-end crash by 23 percent.\nThe institute measured the systems' effectiveness by looking at police records for 7,490 rear-end crashes in 27 states. All of the crashes happened between 2010 and 2014. They only considered crashes caused by Acura, Honda, Subaru, Mercedes and Volvo vehicles that offered optional automatic braking or forward-collision warning. Then they compared the performance of the vehicles that were equipped with the optional systems and those that weren't.\nThe institute said that if all vehicles were equipped with systems that worked as well as the ones studied, there would have been 700,000 fewer rear-end crashes in 2013 alone.\n\"As this technology becomes more widespread, we can expect to see noticeably fewer rear-end crashes,\" said David Zuby, the institute's chief research officer.\nForty percent of vehicles sold in the U.S. currently offer automatic braking, while 61 percent offer forward-collision warning, the institute says. They can be expensive options, however. Subaru offers it on the Impreza sedan, for example, but it's part of a $2,895 safety package.\nBut the technology will soon be more widely available. Last fall, 10 automakers agreed to make automatic braking a standard feature on all of their cars. A deadline hasn't yet been set for that to happen, but it will likely be in the next few years.","url":"https://www.dailymail.co.uk/wires/ap/article-3420383/Study-finds-automatic-braking-cuts-rear-end-crash-risk.html"}
