{"authors":["Tony Lee"],"date_download":"2018-10-30 18:51:55","date_modify":"2018-10-30 18:51:55","date_publish":"2014-06-27 06:05:00","description":"Illegal and legal immigrants have accounted for all of the job growth in the United States since 2000.  On the one-year anniversary of the passage of the |","filename":"data/vaneerConsumption/StudyAllJobGrowthSince2000WenttoImmigrants.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2013/Economy/employment_guide_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_06_26__1540925515.html","title":"Study: All Job Growth Since 2000 Went to Immigrants","title_page":"Study: All Job Growth Since 2000 Went to Immigrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Illegal and legal immigrants have accounted for all of the job growth in the United States since 2000.\nOn the one-year anniversary of the passage of the Senate’s “Gang of Eight” comprehensive immigration reform bill, the Center for Immigration Studies (CIS) released a report on Friday that revealed that even though native-born Americans accounted for two-thirds of the growth in the total working-age population since 2000, the number of native-born Americans with jobs declined by 127,000.\nWhile there were 114.8 million working-age native-born Americans with jobs in the first quarter of 2000, there were only 114.7 million with jobs in the first quarter of 2014. On the other hand, 17.1 million working-age immigrants (legal and illegal) had jobs in 2000 while 22.8 million did in 2014, which is an increase of 5.7 million.\nSen. Jeff Sessions (R-AL), who has relentlessly encouraged his colleagues to put American workers first during the immigration debate, told Breitbart News that the report’s findings are “shocking” and “represent a dramatic indictment of immigration policy in Washington D.C” while underscoring the “economic catastrophe that would have ensued” had the Gang of Eight’s bill been signed into law and further hollowed out the middle class.\n“There is no doubt that a long, sustained period of high immigration, combined with increased automation and the offshoring of jobs, has produced a loose, low-wage labor market,” Sessions said. “In spite of this, the President continues to champion legislation that would place further substantial downward pressure on wages.”\nChampions of comprehensive immigration reform have said amnesty and more legal immigration are needed because the country has a labor shortage and more immigration increases job opportunities for native-born Americans. But the report, consistent with others, found that there is a labor surplus and that massive immigration reduces employment opportunities for native-born Americans.\nSteven Camarota, who co-authored the report with Karen Ziegler, told Breitbart News that there is “no indication that things are about to change, so why double immigration as S.744 does?”\nAs the report points out, even though there are approximately 58 million working-age natives who are not employed, the Gang of Eight bill would, according to the Congressional Budget Office, roughly double the number of new immigrants to about “20 million over the next decade, adding to the 40 million immigrants (legal and illegal) already here.” The CIS report found that there were nearly 17 million new immigrants who came to the country during the last 14 years, and that coincided with “a long-term deterioration in the employment rate for natives of every education level, race, and age.”\nFurther, occupations that saw immigrant employment growth from 2003 to 2014 included lower-skilled jobs like “building cleaning and maintenance,” middle-skilled jobs like “health care support, office and administrative support, sales, and construction” and even higher-skilled jobs like “management, computers, and healthcare practitioner.”\nThe report also found that the number of working-age native-born Americans who are not in the labor force “increased from 35.7 million in 2000 to 42.1 million in 2007 to 49.2 million in 2014,” which means that “13.5 million (79 percent) of the 17 million increase in the number of working-age natives not working from 2000 to 2014 is due to an increase in the number not in the labor force rather than an increase in unemployment.”\nAnd while this rate has gotten worse for working-age native-born Americans since 2010 when the so-called recovery began, which “means that the decline in the unemployment rate in recent years is being driven to a significant extent by an increase in the number of working-age natives leaving the labor market and not by an increase in the number getting a job,” the story has been different for working-age immigrants.\nAccording to the report, the labor force participation rate for illegal and legal immigrants generally improved from 2000 to 2007, and it did not decline as it did for native-born Americans after 2007. Those who have a job or have looked for one in the previous four weeks are considered as being in the labor force.\nContrary to the notion that immigrants, especially illegal immigrants, take jobs that Americans will not do, CIS determined that in “all 472 civilian detailed occupations as defined by the Department of Commerce,” there were only six “majority immigrant (legal and illegal)” occupations. And those occupations only accounted for 1 percent of the total U.S. workforce, according to a previous report.\nFor instance, the study found that 51 percent of maids and housekeepers are U.S.-born, as are 63 percent of butchers and meat processors, 64 percent of grounds maintenance workers, 66 percent of construction laborers and 73 percent of janitors.\nWidespread immigration over the last fourteen years has hurt native-born minorities the most, especially those looking for low-skilled work and are young. The report found that the “employment rate for working-age, native-born blacks declined 9.2 percentage points, compared to 6.1 percentage points for whites and 7.7 percentage points for native-born Hispanics,” over the last 14 years. It concluded that the “very large decline in work among those under age 30 may have significant long-term negative consequences for those individuals as they age” and the “failure of young people to gain work experience earlier in their adult lives may also have negative implications for the larger American society.”\nU.S. Civil Rights Commissioner Peter Kirsanow has urged the Congressional Black Caucus to vote against amnesty because it would hurt black workers the most. Camarota noted that “Hispanic and African American leaders have been at the forefront of arguing not just for amnesty but supporting proposals like” the Senate’s amnesty bill that “dramatically increases the number of foreign workers allowed into the country at a time when native-born blacks and Hispanics” have seen increases in their respective unemployment rates.\nSessions, the Alabama Senator, said that President Barack Obama and Congressional Democrats, despite the data, “remain focused on the demands of activist CEOs who want new labor at the lowest price.”\nHe said the immigration and amnesty debate gives Republicans a chance to be the party that represents all American workers and urged the GOP to “sever themselves from these demands and present themselves to the American public as the one party focused on everyday working people.”\n“The sensible, conservative, fair thing to do after 40 years of record immigration is to slow down a bit, allow assimilation to occur, allow wages to rise, and to help workers of all backgrounds rise together into the middle class,” Sessions said.","url":"https://www.breitbart.com/politics/2014/06/26/study-all-job-growth-since-2000-went-to-immigrants/"}
