{"authors":[],"date_download":"2018-10-22 21:44:20","date_modify":"2018-10-22 21:44:20","date_publish":"2014-05-08 00:34:45","description":"Students at a New Jersey high school rallied for their fellow peers who were arrested in an annual prank.","filename":"data/vaneerConsumption/StudentsRallyForArrestedTeensinSeniorPrankGoneWrong.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/427851/140507-high-school-protest-jms-2006_9cd7eb45d83db7a0ad1578651b2e438c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_students-rally-arrested-teens-senior-prank-gone-wrong-n99961_1540244660.html","title":"Students Rally For Arrested Teens in Senior Prank Gone Wrong","title_page":"Students Rally For Arrested Teens in Senior Prank Gone Wrong","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"I went, blew up some balloons and then I got arrested by the cops,\" said the honor student.\n\"A lot of people want to say we're bad kids, and we're really not. We're really not. It was overexaggerated,\" she said. \"We were gonna do the prank, we were gonna go home, say good night to our parents, and we were gonna go to school the next morning and have a good laugh.\"\nSuperintendent Barbara Pinsak said in a statement last week there was no damage to school property and the cleanup consisted of removing petroleum jelly from doorknobs, sweeping floors of debris and removing graffiti.\nShe said the district doesn't condone the students' behavior but exaggerated reports of mayhem \"misrepresent\" their school and community.\nThe school did not allow media on the property Wednesday, but students approached reporters, eager to defend themselves in the yearly prank they describe as harmless.\n\"I feel like they were treated like criminals, as if they killed somebody,\" said senior Hanifa Abbasi.\nThe student who was arrested said she fears her friends' futures are at risk.\n\"By charging my peers, they're destroying futures, they're destroying careers,\" she said. \"I had a talk with one of my peers who wants to go into criminal justice, and he was arrested. How's that gonna look?\"\nAnother student who asked to remain anonymous agreed that police \"overreacted. It was just a harmless prank.\"\n- Rob Schmitt contributed to this report","url":"https://www.nbcnews.com/news/us-news/students-rally-arrested-teens-senior-prank-gone-wrong-n99961"}
