{"authors":["Michelle Moons"],"date_download":"2018-10-30 22:14:56","date_modify":"2018-10-30 22:14:56","date_publish":"2015-03-20 18:25:08","description":"University of California students stripped down, shouted, stood on their seats and threw fake money this week in protest of tuition hikes in the UC system, but Governor Jerry Brown and UC President Janet Napolitano aren’t backing down on the UC’s plans to make up a funding shortage. |","filename":"data/vaneerConsumption/StudentsStriptoProtestTuitionHikeNapolitanoApologizesforHotMicCrap.json","image_url":"https://media.breitbart.com/media/2015/01/janet.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_20__1540937696.html","title":"Students Strip to Protest Tuition Hike; Napolitano Apologizes for Hot Mic 'Crap'","title_page":"Students Strip to Protest Tuition Hike; Napolitano Apologizes for Hot Mic 'Crap' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"University of California students stripped down, shouted, stood on their seats and threw fake money this week in protest of tuition hikes in the UC system, but Governor Jerry Brown and UC President Janet Napolitano aren’t backing down on the UC’s plans to make up a funding shortage.\nTuition is set to rise over the next years, with Napolitano threatening to bar any additional in-state students if state funds are withheld according to the San Francisco Chronicle. Brown and Napolitano have been meeting on the issue in what they call their “Committee of Two.”\nNapolitano is saying the UC system needs a $220 million raise next year on top of the $3 billion in state funding it already receives. Brown has countered with a still-hefty $120 million raise, but with the qualification that tuition rates will not rise. Napolitano and the UC regents have moved for a 5% tuition hike in the 2015-16 school year and potentially 28% over the next five years.\nThe protesting students interrupted a regents meeting in Mission Bay with their shouts of “UC regents! Put people over profits!” UC Police described by the Chronicle as dressed in riot gear, moved the protesters out of the meeting.\n“This is all what we have got left,” one student yelled before pulling the fake cash from her brassiere and throwing it, as seen in video of the event. Throwing off her dress, the woman revealed her “student debt”-labeled underwear.\nNapolitano was caught on a hot mic, reacting: “Let’s go. We don’t have to listen to this crap.” She later apologized.\nNapolitano and Brown are set to meet again on the issue in April hoping to bridge the reportedly wide gap between their proposals.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/03/20/students-strip-to-protest-tuition-hike-napolitano-apologizes-for-hot-mic-crap/"}
