{"authors":["Trent Baker"],"date_download":"2018-10-30 20:59:12","date_modify":"2018-10-30 20:59:12","date_publish":"2016-02-25 20:36:35","description":"Per a report by Wave3, a piece of student artwork is the cause of controversy at a Kentucky school district. The artwork, being displayed at North Oldham |","filename":"data/vaneerConsumption/StudentArtworkComparingCopstoKKKMembersCausingControversyinKentucky.json","image_url":"https://media.breitbart.com/media/2016/02/student-artwork.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_02_25__1540933152.html","title":"Student Artwork Comparing Cops to KKK Members Causing Controversy in Kentucky","title_page":"Student Artwork Comparing Cops to KKK Members Causing Controversy in Kentucky | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Per a report by Wave3, a piece of student artwork is the cause of controversy at a Kentucky school district.\nThe artwork, being displayed at North Oldham High School, depicts a police officer aiming a gun at the head of an African-American child labeled “2015” with an American flag at the bottom next to an image of a Ku Klux Klan member pointing a gun at an African-American man’s head labeled “1930” with a Confederate Battle flag at the bottom.\nThe piece also depicts the child as Trayvon Martin being shot by a police officer, who was actually shot by a local neighborhood watch coordinator.\nAccording to Oldham County Schools spokeswoman Tracy Green, the drawing was created by a student during the 2014-15 school year during the time there was unrest about African-Americans being shot by police, such as Ferguson, MO.\n“My requests to the school to abstain from this obvious hostile learning environment were met with deaf ears,” Dan Hamblin, a police officer whose daughter is a current student in the honors English class at North Oldham High School, wrote on Facebook. “My daughter is not unlike other children of first responders. She fears for my safety every day, and believes me to be a man of honesty and courage. She is proud to say I am her father and tells others what I do for a living. What this propaganda creates, are future cop haters, which endanger me, and 800,000 other courageous protectors. We speak of tolerance, we speak of changing hostile environments, we speak of prejudice, and we speak of racial relations, yet, when it comes to hostility toward police, their families, and profiling them through bigotry we are expected to tolerate it. I will not, nor will my child.”\nGreen said the district will not force the teacher to remove the artwork, but the teacher will likely take it down when the class’ “To Kill a Mockingbird” discussion ends in the next week.\nWave3 reported that the school received over 100 complaints about the artwork on Wednesday, and the school district office received around 50 more.","url":"https://www.breitbart.com/video/2016/02/25/student-artwork-comparing-cops-to-kkk-members-causing-controversy-in-kentucky/"}
