{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 22:10:13","date_modify":"2018-10-30 22:10:13","date_publish":"2016-12-07 22:09:12","description":"Students and faculty have formed a coalition called \"Columbia Against Trump,\" which \"seeks to take action against the Trump presidency.\"","filename":"data/vaneerConsumption/StudentsandFacultyFormColumbiaAgainstTrumpGroup.json","image_url":"https://media.breitbart.com/media/2016/11/trump-protester-goony-beard-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_12_07__1540937413.html","title":"Students and Faculty Form 'Columbia Against Trump' Group","title_page":"Students and Faculty Form 'Columbia Against Trump' Group | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Students and faculty at Columbia University have formed a coalition called “Columbia Against Trump,” which “seeks to take action against the Trump presidency.”\nLast week, over 45 students and faculty members gathered at the first meeting of the “Columbia Against Trump” group. They discussed their future activism efforts, such as their plans to send 500 students to protest at Donald Trump’s inauguration on January 20th.\nThe Columbia Against Trump coalition is the combined effort of a number of student activist groups on campus. At the meeting, representatives from each activist group addressed the students who showed up for the inaugural meeting.\nThe group is a combined effort of various student activist groups on campus, such as Columbia Divest for Climate Justice, and Graduate Workers of Columbia. Five representatives from these groups, including Sonam Singh, a faculty member in Barnard’s English department and member of the Barnard Contingent Faculty union, spoke on behalf of different issues and values they felt were in jeopardy. These issues included ones of hate crimes, workers’ rights, climate change, and protection of undocumented students. With these topics on the table, the speakers and the audience began to draft possible strategies that could help address these pressing issues. One of the major solutions was pressuring the administrators to take on a bigger role by mobilizing students and faculty.\nStudents made it clear that they intend for the Columbia Against Trump coalition to be focused on activism efforts rather than as a solidarity or a group for students distressed over Trump’s presidency to come together for support.\n“We’re a group that is all about action; we are action-oriented. It is a solidarity network, but we’re really based on action,” Sumaya Awad, a visiting student from Williams College at Columbia College, said.\nTom Ciccotta is a libertarian who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/12/07/students-faculty-form-columbia-trump-group/"}
