{"authors":[],"date_download":"2018-10-30 19:03:12","date_modify":"2018-10-30 19:03:12","date_publish":"2018-08-28 18:48:00","description":"A Kennesaw State University student was arrested after social media posts circulated of him rubbing a female student’s foot with his foot in a campus library.The 23-year-old man later told investigators he had been “playing footsies” with between 10 and 20 women, according to police records.","filename":"data/vaneerConsumption/StudentwasplayingfootsieswithwomenatKSU.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/Politics-MyAJC/2018/05/04/Images/newsEngin.21957998_Kennesaw-State-crop.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_tweet-leads-ksu-_c997288c4c5dba4be25be80ad9c21e8f__1540926192.html","title":"Student was ‘playing footsies’ with women at KSU","title_page":"Kennesaw State cops: Student was ‘playing footsies’ with women at KSU","title_rss":"NULL","source_domain":"ajc.com","text":"A Kennesaw State University student was arrested after social media posts circulated of him rubbing a female student’s foot with his foot in a campus library.\nThe 23-year-old man later told investigators he had been “playing footsies” with between 10 and 20 women, according to police records, none of whom he knew.\nHe faces two counts of misdemeanor simple battery. The Atlanta Journal-Constitution typically does not name those charged solely with misdemeanors.\nREAD | Ex-Kennesaw State student gets prison for raping 3 women near campus\nThe arrest came after a female student reported a man who “touched her on the foot inappropriately with his foot” in the Sturgis Library on Aug. 17, university spokeswoman Tammy Demel told The AJC on Tuesday.\nThe female student posted a picture of the man’s face on Twitter at 11:50 p.m. She recounted how he sat right next to her; she said it was a near-empty library on a Friday night.\nShe said he kept eyeing her feet, but she brushed it off.\nThis is the photo Kennesaw State University police used when looking for the man who was eventually arrested on two simple battery charges.\nThen in the tweet thread, she included a video of what appears to be his bare foot inching closer to her foot. She said that he then put his foot on hers, and she left.\nREAD | Warrant: After raping woman in dorm, KSU student texted to apologize\nKennesaw State University police saw her social media posts. They issued a warning to students that included a photo the female student shared on Twitter.\nAt the end of her thread, there was a reply from another woman claiming he had done that to her last year.\nThat generated the second simple battery charge against the man.\nHe bonded out of Cobb jail for $4,290 on Thursday, about 12 hours after being arrested, according to jail records.\nLike Cobb County News Now on Facebook | Follow us on Twitter\nIn other news...","url":"https://www.ajc.com/news/local/tweet-leads-ksu-student-arrest-for-playing-footsies-with-women/obnVpoP0HaLbszY8hVkPWM/"}
