{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:20:46","date_modify":"2018-10-30 18:20:46","date_publish":"2016-04-15 20:54:16","description":"Another day, another story of left-wing students getting inordinately upset over words. This time the ruckus comes from Ohio University.","filename":"data/vaneerConsumption/StudentsatOhioUniversityWantPolicetoInvestigateMockeryofSafeSpaces.json","image_url":"https://media.breitbart.com/media/2016/01/south-park-safe-space.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_04_15__1540923646.html","title":"Students at Ohio University Want Police to Investigate Mockery of 'Safe Spaces'","title_page":"Students at Ohio University Want Police to Investigate Mockery of 'Safe Spaces' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Another day, another story of left-wing students getting inordinately upset over words.\nThis time the ruckus comes from Ohio University (not to be confused with Ohio State University), where students are up in arms over graffiti mocking their beliefs. They now want a police investigation to apprehend the “culprits” behind the message.\nAccording to Campus Reform, students from Ohio’s College Republicans wrote a message on the college’s designated “free speech wall” mocking the idea of “safe spaces” and “trigger warnings,” two popular concepts used by the regressive left to regulate and censor speech on campus.\nThe message said, “Trigger Warning: There are no safe spaces in real life. You can’t wall off the First Amendment”\nThis followed an incident where OU students wrote “Build the Wall” and “Trump 2016” on the free speech wall, which prompted an apology from the university’s president after complaints from OU’s Hispanic and Latino Student Union.\nNow students are calling for a police investigation. “We can start [with] a mandatory investigation, because trigger warnings is literally a threat,” wrote one student on Twitter. “My kids will not even be allowed to even think about attending OU,” the same student wrote in a later tweet.\nCampus police are, it seems, already involved. After the initial pro-Trump messages appeared on the free speech wall, OU police hosted an open discussion with the school’s LGBT center about the slogans.\nThis is the latest in a long line of pro-Trump and anti-PC messages that have been written on college campuses across the country. Dubbed “the chalkening,” the scrawled slogans have become adopted by conservatives and libertarians on campus as a means of resistance against left-wingers on campus, who are increasingly hostile to free speech.\nThe chalkening has generated hysterical reactions from campus activists: some say the messages make them “feel afraid,” while the slogans have already prompted calls for police action on other campuses.\nYou can follow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/04/15/students-ohio-u-want-police-investigate-mockery-safe-spaces/"}
