{"authors":["Chriss W. Street"],"date_download":"2018-10-30 18:07:10","date_modify":"2018-10-30 18:07:10","date_publish":"2017-02-06 08:01:05","description":"A new study by the Economic Policy Institute has found that California lost a net 589,100 jobs from 2001 to 2015, after China entered the WTO","filename":"data/vaneerConsumption/StudyCaliforniaLost589100JobstoChinafrom20012015.json","image_url":"https://media.breitbart.com/media/2017/02/Made-in-China-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_02_06__1540922830.html","title":"Study: California Lost 589,100 Jobs to China from 2001-2015","title_page":"Study: California Lost 589,100 Jobs to China from 2001-2015","title_rss":"NULL","source_domain":"breitbart.com","text":"A new study by the Economic Policy Institute (EPI) has found that California lost a net 589,100 jobs from 2001 to 2015, after China entered the World Trade Organization.\nResearchers at EPI found that the growing U.S. goods trade deficit with China displaced a net 3.4 million jobs in the United States. About 2.6 million, or 74.3 percent, of those jobs lost were in manufacturing.\nImports from China during the 15-year period increased from $102.3 billion in 2001 to $483.2 billion in 2015. U.S. exports also rose on a rapid percentage, but from a smaller base of $19.2 billion in 2001 to $116.1 billion in 2015. EPI called the trade deficit with China the United States’ most unbalanced trade relationship.\nThe top four states in terms of total jobs lost were California, Texas, New York, and Illinois. California lost 589,100 jobs, compared with 321,300 in Texas, 191,500 in New York, and 149,400 in Illinois. California accounted for 17 percent of all net American job losses to China.\nEPI found job losses to China in every state and in all 435 U.S. Congressional Districts. Eight of the top twenty districts that suffered job losses to China were in California. Those California districts hit hardest, in ranked order, were the 17th, 18th, 19th, and 15th in the South Bay Area; and the 40th, 34th, 52nd, and 45th in the San Diego region.\nEPI observed that China suppressed the purchasing power of its own middle class with a weak currency exchange rate. As a result, EPI says, China amassed $4 trillion in foreign exchange reserves, while net U.S. borrowing from the rest of the world increased by nearly $5 billion, and the net U.S. debt to the rest of the world more than tripled between 2001 and 2015.\nThe Economic Policy Institute researchers also found: “China both subsidizes and dumps massive quantities of exports. Specifically it blocks imports, pirates software and technology from foreign producers, manipulates its currency, invests in massive amounts of excess production capacity in a range of basic industries, often through state owned enterprises (SOEs).”","url":"https://www.breitbart.com/local/2017/02/06/study-finds-california-lost-589100-jobs-china-2001-2015/"}
