{"authors":["Logan Pike","Justin Haskins"],"date_download":"2018-10-30 18:15:09","date_modify":"2018-10-30 18:15:09","date_publish":"2015-03-20 19:49:38","description":"When Congress promoted welfare reform as a top priority in 1995, opponents accused them of being unsympathetic to impoverished Americans.","filename":"data/vaneerConsumption/StudyRevealstheSevenStateswithFailingWelfarePrograms.json","image_url":"https://media.breitbart.com/media/2015/01/social-security-checks-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_20__1540923309.html","title":"Study Reveals the Seven States with ‘Failing’ Welfare Programs","title_page":"Study Reveals the Seven States with ‘Failing’ Welfare Programs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When the Republican-controlled Congress promoted welfare reform as one of its top priorities in 1995, opponents accused them of being unsympathetic to the plight of impoverished Americans and insisted the proposed policies would end up harming true reforms.\nThomas R. Carper (D), then-Governor of Delaware and currently a U.S. Senator, fought hard against the bill. “The [Republican-support reform bill in Congress] will undercut my own efforts to reform the welfare system in Delaware,” said Carper.\nDespite their vociferous objections, Carper and his compatriots, nearly all of whom were Democrats, have been proven wrong.\nSince the Personal Responsibility and Work Opportunity Reconciliation Act (PRWORA) was signed into law in 1996, welfare rolls have dropped across the United States by roughly 9 million, a decline of 73 percent. Few—possibly no other—pieces of legislation have had such a meaningful and lasting impact as PRWORA.\nThe effects of PRWORA have been significant, but some states have done a better job of taking advantage of welfare reform than others. In 2008, The Heartland Institute conducted extensive research on welfare reform practices among the states and published its findings in its welfare reform report card. An updated version of the report card was recently published by Heartland on March 19.\nIn its report, The Heartland Institute analyzes every state’s welfare program and makes policy recommendations that myriad academic research proves help move welfare recipients off of welfare rolls and into self-sufficient careers.\nTo create its report card, Heartland studied and scored each state’s welfare program outcomes, which is measured based on overall poverty rates, work participation rates, unemployment figures, teen birthrates, and the decline in the number of Temporary Assistance for Needy Families (TANF) program recipients.\nWelfare policies were also examined and scored. Cash diversion, state work requirements, service integration, time limits, and sanctions were all considered when a state’s welfare policy score was developed.\nAfter all of the rankings were completed and scores calculated, seven states stood out as being among the worst in the nation for welfare reform, all receiving grades of “F” for poor performance:\n#44 Georgia, Grade: F (52/100 points)\nGeorgia has the nation’s seventh-worst welfare reform policies and ranked 49th in unemployment. Its “cash diversion” program is a big reason why the state finished so poorly, receiving 0 of 100 possible points in that category. Strong cash diversion policies help case workers provide lump-sum cash payments to meet short-term recipient needs in exchange for agreeing not to enroll in TANF for an established period.\n#45 (tied) Alabama, Grade: F (51/100 points)\nHeartland’s study identified Alabama as having some of the poorest welfare reform policies in the nation, which contributed to finishing 42nd in TANF recipient decline. The Cotton State received grades of “F” for having poor cash diversion and sanctions programs. Sanctions are tools officials can use to ensure recipients comply with work mandates and other requirements needed to qualify for continued use of government services.\n#45 (tied) Oregon, Grade: F (51/100 points)\nOregon may have beautiful scenery, but its welfare policies are about as ugly as it gets. It finished in the bottom 10 for overall poverty rates, work participation rates, and TANF recipient decline. Oregon also received “F” grades for its cash diversion and sanctions policies.\n#45 (tied) Rhode Island, Grade: F (51/100 points)\nThe Ocean State finished 42nd in unemployment and 49th in work participation rates. Rhode Island’s welfare rolls have been flooded in part due to its poor service integration and cash diversion policies, both of which earned “F” grades in Heartland’s study.\n#48 Vermont, Grade: F (46/100 points)\nIt’s called the “Green Mountain State” for the gigantic heaps of cash Vermont wastes due to its poor welfare policies (not really, but it could be with all of that wasted spending!). It earned an “F” grade for having a dismal time limit policy, which is the amount of time a recipient is able to receive aid in a given period, usually a lifetime.\n#49 Massachusetts, Grade: F (24.7/100 points)\nMassachusetts is home to some of the world’s most prestigious colleges and universities, but there is nothing smart about its welfare program. The Bay State earned “F” grades in nearly all policy categories: cash diversion, time limits, sanctions, and work requirements.\n#50 Missouri, Grade: F (24.3/100 points)\nThe Show Me State has little to show for its poor welfare policies. It earned the title of Heartland’s “worst state in the nation for welfare reform,” finishing third from last in poverty outcomes and receiving “F” grades for its poor cash diversion policies, sanctions, and work requirements. It also earned “D” grades for its weak service integration and for having atrocious time limit policies.\nSix states—Idaho, Michigan, Nevada, South Dakota, Utah, and Wisconsin—received “A” grades for strong welfare reform results and, most importantly, for enacting proven reform policies that help the impoverished citizens of their states.\nYou can read Heartland’s complete welfare reform report card, titled “2015 Welfare Reform Report Card” by going to The Heartland Institute’s website, where the report is available to download for free: www.heartland.org/welfare-reform\nLogan Pike (Lpike@heartland.org) is state government relations manager at The Heartland Institute and co-author of Heartland’s “2015 Welfare Reform Report Card.”\nJustin Haskins (Jhaskins@heartland.org) is editor-in-chief of New Revere Daily Press and editor at The Heartland Institute, a leading free-market think tank headquartered in Chicago.","url":"https://www.breitbart.com/politics/2015/03/20/study-reveals-the-seven-states-with-failing-welfare-programs/"}
