{"authors":["Emma Cueto"],"date_download":"2018-10-30 22:56:50","date_modify":"2018-10-30 22:56:50","date_publish":"2014-08-14 16:03:44","description":"There are a lot of ways to compliment a person's appearance: say you love their hair, or their sense of style, or just call them beautiful. One thing you shouldn't call them: \"exotic.\" Because as nice as you think it may sounds, it really doesn't…","filename":"data/vaneerConsumption/StuffMomNeverToldYouVideoExplainsWhyYouShouldntCallSomeoneExotic.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/71d33a7d-7339-423d-bd56-c70408c4564d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35775-stuff-mom-never-told-you-video-explains-why-you-shouldnt-call-someone-exotic_1540940210.html","title":"\"Stuff Mom Never Told You\" Video Explains Why You Shouldn't Call Someone \"Exotic\"","title_page":"\"Stuff Mom Never Told You\" Video Explains Why You Shouldn't Call Someone \"Exotic\"","title_rss":"NULL","source_domain":"bustle.com","text":"There are a lot of ways to compliment a person's appearance: say you love their hair, or their sense of style, or just call them beautiful. One thing you shouldn't call them: \"exotic.\" Because as nice as you think it may sounds, it really doesn't come across that way.\nAs the \"Stuff Mom Never Told You\" podcast and video blog explains, telling someone they look \"exotic\" is actually a racial micro-aggression. It tells a person that while they might be attractive they also aren't \"normal.\" And since the basis for \"normal\" is pretty much synonymous with \"white,\" it's actually offensively Euro-centric, too.\nAnd yet we see the term used all the time. Celebrities, from Jessica Alba to Naomi Campbell to Lupita Nyong'o and beyond are classed as being \"exotic,\" — which often coincides with being not white. Which sort of begs the question why stereotypically white appearances are ingrained as our default, given that most of the world is not going to fit into that category, but I digress.\nThe point is that the term \"exotic\" is, pretty much by definition, synonymous with \"the other.\" It's a way of telling someone that they aren't just a person but some sort of separate entity set apart from normal humans. They become something more akin to parrots than people, something to be other-ed, objectified, and fetishized.\nSo the next time you feel like telling someone they look exotic, head the wise words of \"Stuff Mom Never Told You\" and just don't.\nStuff Mom Never Told You - HowStuffWorks on YouTube\nImage: Stuff Mom Never Told You - HowStuffWorks/YouTube","url":"https://www.bustle.com/articles/35775-stuff-mom-never-told-you-video-explains-why-you-shouldnt-call-someone-exotic"}
