{"authors":["Jessica Taylor"],"date_download":"2018-10-23 01:00:27","date_modify":"2018-10-23 01:00:27","date_publish":"2015-10-02 00:00:00","description":"The former Florida governor sparked controversy when he cautioned against quick political reactions to the Oregon school shooting, saying that \"stuff happens.\"","filename":"data/vaneerConsumption/StuffHappensCommentCreatesFirestormForJebBush.json","image_url":"https://media.npr.org/assets/img/2015/10/02/ap_833875316365_wide-80dc5be95eab04dc854e18873bb1a0f8df37456a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_10_02_445379809_stuff-happens-comment-creates-firestorm-for-jeb-bush_1540256427.html","title":"'Stuff Happens' Comment Creates Firestorm For Jeb Bush","title_page":"'Stuff Happens' Comment Creates Firestorm For Jeb Bush : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'Stuff Happens' Comment Creates Firestorm For Jeb Bush\nEnlarge this image toggle caption Jeff Chiu/AP Jeff Chiu/AP\nJeb Bush sparked controversy yet again with his word choice on the campaign trail Friday.\nWhen asked about Thursday's shooting at an Oregon community college, the former Florida governor argued for caution against more gun control as an instant reaction, saying that \"stuff happens, there's always a crisis\" you have to respond to when in leadership.\n\"I had this challenge as governor,\" Bush said of the way government should respond after such incidents. \"Look, stuff happens, there's always a crisis. And the impulse is always to do something, and it's not necessarily the right thing to do.\"\nBush wasn't flippant in discussing the tragedy on Thursday, earlier calling it \"heartbreaking.\" But when asked about the appropriate response to these types of incidents, Bush cautioned that \"more government\" wasn't \"necessarily the answer.\"\nThe \"stuff happens\" part of his remark is what many on Twitter and Democratic opponents immediately zeroed in on.\nAnd in the full context, Bush isn't dismissive of the shooting in Roseburg, Ore., that killed nine people.\nPresident Obama was asked about Bush's remarks at his Friday afternoon news conference. He responded, \"I think the American people should hear that and make their own judgments based on the fact that every couple of months we have a mass shooting. And they can decide whether they consider that 'stuff happening.' \"\nBush spokeswoman Allie Bradenburger criticized the furor, calling it \"sad and beyond craven that liberal Democrats, aided and abetted by some in the national media, would dishonestly take Governor Bush's comments out of context in a cheap attempt to advance their political agenda in the wake of a tragedy.\"\nBut it's another statement — and one that Bush didn't back down from speaking with media after the event — that the Republican is left having to explain as his poll numbers slip. And there have been others.\nJust last week, Bush said Republicans didn't have to promise \"free stuff\" to win over African-American voters.\n\"Our message is one of hope and aspiration,\" Bush said. \"It isn't one of division and get in line and we'll take care of you with free stuff. Our message is one that is uplifting — that says you can achieve earned success.\"\nBut the remark echoed one Mitt Romney made on the campaign trail in 2012, saying that if people \"want more stuff from government tell them to go vote for the other guy — more free stuff.\"\nHere are some of his other controversial comments:\nHe said \"I'm not sure we need half a billion dollars in funding for women's health programs\" when asked about defunding Planned Parenthood. He later said he misspoke and just believed that the money shouldn't be given to the organization but instead to other centers.\nTo expand the economy to the 4 percent growth he projects, Bush told the New Hampshire Union Leader editorial board that \"people need to work longer hours.\" Bush later clarified he meant boosting the hours of part-time or underemployed people, not adding longer work hours for full-time employees.\nAmid criticism for using the term \"anchor babies\" — a derogatory term for women who come to the U.S. to have babies so that they gain birthright citizenship — Bush said he wasn't referring to Hispanics, but that \"frankly it's more Asian people\" who are guilty.\nBush said we should not have a \"multicultural society\" in the U.S., which slows assimilation to American society.\nAfter first fumbling an answer on whether he would have gone into Iraq as his brother did \"knowing what we know now,\" Bush spent a week trying to finally walk it back before saying, \"I would not have gone into Iraq.\"\nWhile one single comment or gaffe hasn't been responsible for Bush's tumble in the polls, many Republicans have said the inartful comments over several months suggest rust on the part of the former governor — who hadn't run for office since 2002, well before the age of social media and instant reporting.\nSo no, Bush wasn't callously dismissing this week's tragic shooting in Oregon by any means. But word choice is important for any candidate — especially for Bush, given the way he needs to shake the image of George W. Bush's presidency. And continued comments he is left explaining aren't good news for his own White House hopes.","url":"https://www.npr.org/sections/itsallpolitics/2015/10/02/445379809/stuff-happens-comment-creates-firestorm-for-jeb-bush"}
