{"authors":["Tim Collins For Mailonline"],"date_download":"2018-10-23 04:22:53","date_modify":"2018-10-23 04:22:53","date_publish":"2017-03-16 15:42:03","description":"A uniquely beautiful glimpse into domestic life in Datong City, an ancient city in north China, has been found inside a circular burial tomb believed to date back to the Liao Dynasty.","filename":"data/vaneerConsumption/Stunningmuralsdatingback1000yearsuncoveredinChina.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/15/3E4B631100000578-0-image-a-2_1489591427278.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4309358_Stunning-murals-dating-1-000-years-uncovered-China_1540268573.html","title":"Stunning murals dating back 1,000 years uncovered in China","title_page":"Stunning murals dating back 1,000 years uncovered in China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A beautiful glimpse into domestic life and fashion in ancient China has been found by archaeologists.\nBrightly coloured images adorn the walls of the circular burial chamber, which was the final resting place of a married couple.\nTheir cremated remains were found inside the tomb, which dates back 1,000 years, alongside some of their possessions.\nScroll down for video\nThe entrance to the tomb was blocked off by bricks 1,000 years ago. Two servants standing guard can be seen on either side\nTHE TOMB The tomb is believed to date from the Liao Dynasty, which flourished between the 10th and 12th centuries. From 907 to 1125 AD, the Khitan people ruled over much of eastern Asia, including modern day Mongolia, northeast China and the Russian far east. It was relatively common practice during this period to bury the dead in these kinds of decorated tombs. The tomb itself was built from long, gray, grooved bricks bonded with fine loess clay.\nA team of researchers from Datong Municipal Institute of Archaeology (DMIA) uncovered the tomb in Datong City, in the northern part of the country.\nThe DMIA team investigated 31 such burial plots during their digs, according to the journal Chinese Cultural Relics (CCR) who published their findings.\nThe entrance was blocked off with bricks a millennia ago and two servants standing guard can be seen on either side.\nBecause of this, the researchers had to access the tomb via a hole in its roof.\nInside they found murals covering each wall.\nOn the western wall a tableau depicting the domestic life of servants was found, with meal preparations and laundry taking place.\nA mural of four cranes - a symbol of life, death, longevity and immortality in Chinese culture - was found on the north wall.\nThe the east wall depicted an image of another servant alongside a clothes stand, adorned with various items of clothing.\nAs well as the murals, the DMIA team found 18 pottery and porcelain artefacts - including plates, bowls and jars.\nA mural on the west wall of the tomb shows the domestic life of servants at the time\nPart of the mural on the western wall appears to show a servant preparing a meal. On the table are four round plates, black on the outside and red inside, holding a headdress, bracelets, hairpins and combs\nA closeup of the mural, showing a servant washing clothes. The garment hanging on a clotheshorse to the far left has a green-diamond grid pattern, each of which contains a small decorative red flower\nThe tomb is believed to date from the Liao Dynasty, which flourished between the 10th and 12th centuries.\nFrom 907 to 1125 AD, the Khitan people ruled over much of eastern Asia, including modern day Mongolia, northeast China and the Russian far east.\nIt was relatively common practice during this period to bury the dead in these kinds of decorated tombs.\nA mural of four cranes was found on the North Wall of the tomb. Each of the four cranes is just under a metre tall. The crane's are represented in line drawing, with ink and colour used to add further detail\nThe crane is a symbol of life, death, longevity and immortality in Chinese culture. Each crane has rich plumage, a fine long neck, a red crown, round eyes, a long beak, slender legs and a drooping tail\nThe east wall contained an image of another servant alongside a clothes stand. On the stand, hang beige, light green, bluish-gray, pink and brown clothes. On one of the garments hangs a ring-shaped pendant accompanied by a string of black beads\nThe tomb itself was built from long, gray, grooved bricks bonded with fine loess clay.\nSpeaking in the report, the DIMA team said: 'In this cemetery, approximately half of the tombs are earthen cave tombs with long ramps, and the other half are brick tombs.\n'These tombs were arranged in a regular order, and should belong to several lineage cemeteries.\n'They can be dated to the early to late Liao dynasty, and to the period when the Liao and Jin dynasties coexisted.'\nThe team of researchers from Datong Municipal Institute of Archaeology had to access the tomb via a hole in its roof\nInside the tomb, which is the resting place of a husband and wife, they found 18 pottery and porcelain artefacts, including plates, bowls and jars\nThe tomb was excavated by DIMA in 2007 and they published their first report in Chinese in 2015, which was then translated into English and has just been published in Chinese Cultural Relics.\nAnd this is not the first time that archaeologists have uncovered historically significant finds in Datong City.\nA previous dig in the city found the tomb of a woman named Farong - the wife of a Chinese magistrate - who was laid to rest in all her finery around 1,500 years ago.\nAround 1,500 years ago, a woman named Farong was laid to rest wearing fantastic jewellery. The skeleton was found in a tomb in China, along with a series of artefacts. The researchers were surveying the area before a construction project when they found the tomb\nThe find, also featured in Chinese Cultural Relics, was from the decades preceding the collapse of the Northern Wei dynasty in 534 AD.\nResearchers were surveying the area before a construction project when they came across the tomb.\nAmong the haul of ancient bling uncovered by the team of archaeologists was a necklace of 5,000 beads and 'exquisite' golden earrings.\nEarrings (pictured) found at the site were decorated with gold, teardrop-shaped designs inlaid with gemstones, as well as gold chains and amethysts that would have hung down the sides of Farong's face\nFarong wore a pendant with a sequin-bead pattern (shown left). The thread holding the beads in necklace together had decomposed. Made of gold, the earrings (pictured right) contain images of dragons and a human face\nDecorated with gold, the teardrop-shaped earings were inlaid with gemstones.\nThey also found gold chains and amethysts that would have hung down the sides of Farong's face.\nShe also wore a pendant with a sequin-bead pattern.","url":"https://www.dailymail.co.uk/sciencetech/article-4309358/Stunning-murals-dating-1-000-years-uncovered-China.html"}
