{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:06","date_modify":"2018-10-30 22:13:06","date_publish":"2017-01-22 15:37:42","description":"The FBI is on the hunt for a Heckler and Koch MP5 10mm and a bullet proof vest that were stolen from an agent's car in California on January 8 or January 9.","filename":"data/vaneerConsumption/SubmachineGunBulletProofVestStolenfromFBIAgentsCar.json","image_url":"https://media.breitbart.com/media/2015/12/FBI-agent-AFP-800x430.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_22__1540937586.html","title":"Submachine Gun, Bullet Proof Vest Stolen from FBI Agent's Car","title_page":"Submachine Gun, Bullet Proof Vest Stolen from FBI Agent's Car | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The FBI is on the hunt for a Heckler and Koch MP5 10mm and a bullet proof vest that were stolen from an agent’s car in California on January 8 or January 9.\nThey believe the gun and vest were stolen in “Concord, Orinda or Lafayette.”\nAccording to the San Francisco Chronicle, a fully loaded ammunition magazine was stolen as well.\nThe MP5 10mm was manufactured by H&K at the FBI’s request. It was a follow-up to H&K’s wildly popular MP5 9mm, and was built after the FBI pushed for a submachine gun in a more powerful round.\nVickers Tactical provides a good overview of the H&K MP5 10mm:\nThe Chronicle reports that the Contra Costa County Sheriff’s Office is helping the FBI search for the submachine gun, the vest, and the ammunition.\nIn September, California Governor Jerry Brown (D) signed legislation requiring that civilians and members of law enforcement lock up guns that are left in vehicles. The FBI has yet to clarify how the H&K MP5 10mm was stored in the vehicle.\nThe theft of the submachine gun refocuses attention on the death of Kathryn Steinle. She was shot and killed on July 1, 2015, with a handgun that had been stolen from a federal agent’s car. In early January 2017, Steinle’s family was given the go ahead to sue the federal government over the way the stolen gun was stored in the agent’s car. The Chronicle quoted U.S. Magistrate Joseph Spero saying the Steinle family “can sue the federal government for negligence because a ranger allegedly left the gun used in the shooting in his unlocked car.” He added, “Leaving a gun loaded makes (its) capability for harm readily accessible in the same way as leaving the key in the ignition of a vehicle.”\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2017/01/22/submachine-gun-bullet-proof-vest-stolen-fbi-agents-car/"}
