{"authors":[],"date_download":"2018-10-30 01:08:08","date_modify":"2018-10-30 01:08:08","date_publish":"2018-08-31 00:05:36","description":"I love a perfectly seared medium-rare steak more than almost anyone, but my preference doesn’t dictate what other people can do. That is basically the question being discussed here. No one owns the words that we all use. Who am I to decide that a hot dog can only be called as such when it’s made of what I want it to be.","filename":"data/vaneerConsumption/SubstitutesArentMisinformation.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Vegan_Meat_Pie_01_Pengo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861688.html","title":"Substitutes Aren't Misinformation","title_page":"Substitutes Aren't MisinformationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"I love a perfectly seared medium-rare steak, but my preference doesn’t dictate what other people can do, or what they’re allowed to refer to things as. That is basically the question being discussed in the Missouri meat labeling case. No one owns the words that we all use, and evolving word usage is not the same thing as misinformation. Who am I to decide that a hot dog can only be called as such when it’s made of what I want it to be.\nIf vegans want to call their plant-based meat alternatives by names that make obvious what they are trying to imitate, I say all power to them. In no version of reality are consumers looking at what is clearly a meat substitute and being confused into somehow thinking it is real meat. They look different, they’re marketed differently, and usually, they’re even kept in different sections of the store.\nMissouri decided in May that people are somehow unable to tell the difference between meat and plant-based meat alternatives. Senate Bill’s 627 and 925 went into effect this week. The Missouri law reads, “No person advertising, offering for sale or selling all or part of a carcass or food plan shall engage in any misleading or deceptive practices.” This includes a whole host of pricing display and quality guidelines. It makes sense to want to prevent misinformation of consumers, and the guidelines in the law before amendment do a good job of that by banning “misrepresenting the cut, grade, brand or trade name, or weight or measure of any product.” But, the new version goes much further than that. It outlaws “misrepresenting a product as meat that is not derived from harvested production livestock or poultry.”\nThis doesn’t really make sense. No one is out there selling plant-based alternatives to meat in an attempt to trick unwitting consumers. The people who buy these don’t want meat. That’s the whole point. A vegan or vegetarian food company would be hurting its own interest by making it’s product too similar to meat because it’s target customers would be unable to discern the meatless option from the meat.\nNo one is unable to discern real meat that clearly displays itself as such and is located in a separate area of the store from the pseudo-meat products favored by vegetarians and vegans. This is really a non-issue. It is obviously an attempt by the meat industry to prevent these substitutes from co-opting its descriptors. But, they need to realize that they don’t own the words that people use, and they don’t control what people choose to call things.\nAttempts by these companies to use the word meat aren’t a trick. They’re an explanation. They’re a way of using the words that people understand to express what something is. The best way to convey what an avocado-based oil product that one could use to grease a pan, or bake a cake. is to call it butter. That’s the word that carries the meaning of the thing. It tells people what it’s used for, without going into an excessively definitional description.\nMy vegan friends know that the Daiya shredded cheese they’re buying isn’t cheese, it say’s it’s dairy-free right on the bag. But, what they care about is that they can turn it into a grilled cheese sandwich, put it on tacos, or top off a salad with something that feels a lot like the cheese they’re used to, but isn’t animal-based. These words are useful to communicate what something is for, what it behaves like, and how it should be used. Sure, it isn’t real cheese, but that word still provides important information about it to the consumer.\nAlthough cheese and butter aren’t necessarily part of this law, a vein of thought like this extends to encompass them easily enough. If we start assuming that consumers are utterly mindless, and companies are set on providing people with products that they don’t actually want, our laws would have to be much stricter than even this. But luckily neither of those is the case. People know what they’re looking for when they go to the grocery store, and companies exist to fill those needs and make money. It would be a poor and unsustainable business model to attempt to trick consumers into purchasing a product that is clearly not what they were looking for. One would have few repeat customers and quickly go out of business.\nPeople are smart. Much smarter than what the government generally gives us credit for. No one is trying to lie to customers by misrepresenting meatless options as meat. This is needless government intervention that will help no one, accomplish nothing, and unnecessarily complicate something straightforward.","url":"https://spectator.org/substitutes-arent-misinformation/"}
