{"authors":[],"date_download":"2018-10-22 21:14:10","date_modify":"2018-10-22 21:14:10","date_publish":"2014-05-06 17:10:10","description":"Subway is testing hummus and thinner slices of deli meats that look more appealing as it tries to keep pace with changing eating trends.","filename":"data/vaneerConsumption/SubwayTestsHummusThinnerMeatSlicestoFreshenOfferings.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_06/172646/140207-140207-subway2-1708_3b1e672ffb662ae014a9d7d78d4a4c37.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_subway-tests-hummus-thinner-meat-slices-freshen-offerings-n98341_1540242850.html","title":"Subway Tests Hummus, Thinner Meat Slices to Freshen Offerings","title_page":"Subway Tests Hummus, Thinner Meat Slices to Freshen Offerings","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSubway is testing hummus and thinner slices of deli meats that look more appealing as it looks to keep pace with changing eating trends.\nTony Pace, Subway's chief marketing officer, said in interview Tuesday that the chain began testing hummus as a topping in early April. Pace noted that many customers already order vegetarian sandwiches and that the chickpea spread would give people looking for meatless options another choice.\n\"It's something we've been talking about for the last three or four years,\" Pace said, saying it has \"tremendous potential.\"\nIf the test is successful, Pace said it would be the first time the chain rolled out hummus nationally. Individual franchisees may have offered it independently in the past, he said.\nGetting hummus as a topping will cost more, much like the avocado Subway added to its menu in recent years.\nThe hummus test comes at a time when many Americans are trying to cut back on how much meat they eat. In particular, Pace noted that people in their 20s are more \"nutritionally aware\" than any other past generation. In coming years, he predicted their eating habits will force the restaurant industry to adapt their menus.\nIn a separate interview, Subway co-founder Fred DeLuca said the chain also started testing thinner slices of deli meat in December. In the test, which is taking place at restaurants in Illinois, DeLuca said franchisees are putting 12 slices of meat on a Footlong sandwich, instead of eight. He said the meat is the same but that it's just sliced thinner to improve its \"bite\" and appearance.\n\"For some reason, it looks better. It looks like more meat,\" DeLuca said.\nDeLuca expressed optimism about the thinner slices and that the franchisees in Illinois were \"very enthusiastic\" about the change. Still, he noted that such a change would take considerable research and investment to roll it out nationally. The earliest it could be available nationally would be in about a year, he said.\n-The Associated Press","url":"https://www.nbcnews.com/business/consumer/subway-tests-hummus-thinner-meat-slices-freshen-offerings-n98341"}
