{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:17:15","date_modify":"2018-10-30 18:17:15","date_publish":"2016-07-06 20:33:00","description":"America's campuses will once again be triggered by the Dangeorus Faggot this fall.","filename":"data/vaneerConsumption/SuckItUpButtercupsDangerousFaggotTourReturnsToCollegesInSeptember.json","image_url":"https://media.breitbart.com/media/2016/01/my640.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_06__1540923435.html","title":"Suck It Up Buttercups: Dangerous Faggot Tour Returns To Colleges In September","title_page":"Suck It Up Buttercups: Dangerous Faggot Tour Returns To Colleges In September | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Triggered social justice warriors and cowering college administrators were breathing a sigh of relief. They thought it was all over. They were wrong.\nBreitbart senior editor Milo Yiannopoulos, the Dangerous Faggot himself will be returning to America’s campuses in the fall semester in a tour that promises to be bigger, badder, and more dangerous than ever.\nMilo is already confirmed to appear at 26 campuses this fall, with more schools signing on every week. Be sure to keep an eye on the tour page for updates. Students interested in adding the most memorable speaker their university will hear from this year (or in some cases for all time) can contact the tour manager for more information.\nHis list of appearances, copied in full below, includes a number of return visits to campuses from the previous tour. Regular readers will remember DePaul University, where violent threats towards Milo from protesters and pressure from black activists on campus were followed by the resignation of the college president. Milo will also return to Bucknell, where the student government sought to punish campus conservative and Breitbart contributor Tom Ciccotta after he invited Milo to campus.\n9/12/16 – Texas Tech – Lubbock,TX\n9/15/16 – Texas A&M – College Station,TX\n9/19/16 – University of Houston – Houston,TX\n9/20/16 – DePaul University – Chicago,IL\n9/23/16 – Florida State – Tallahassee,FL\n10/10/16 – University of Alabama – Tuscaloosa,AL\n10/11/16 – Vanderbilt – Nashville,TN\n10/18/16 – Clemson University – Clemson,SC\n10/19/16 – Davidson College – Davidson,NC\n10/21/16 – George Washington University – Washington,D.C.\n10/22/16 – Yale – New Haven,CT\n10/24/16 – University of Richmond – Richmond,VA\n10/26/16 – University of Maryland – College Park,MD\n10/27/16 – University of Pennsylvania – Philadelphia,PA\n11/16/16 – Columbia University – New York,NY\n11/17/16 – NYU – New York,NY\n11/29/16 – Bucknell University – Lewisburg,PA\n12/2/16 – Ohio University – Athens,OH\n12/6/16 – Cleveland State – Cleveland,OH\n12/7/16 – Michigan State – East Lansing,MI\n12/15/16 – Minnesota State – Mankato,MN\n12/16/16 – North Dakota State – Fargo,ND\n1/9/17 – Santa Clara University – Santa Clara,CA\n1/18/18 – Portland State University – Portland,OR\n1/19/17 – Washington State University – Pullman,WA\n1/20/17 – University of Washington – Seattle,WA\nMilo’s previous tour, which took place in the spring and summer, grabbed headlines across the country as panicked social justice warriors threw tantrums, stormed stages, and held therapy sessions — all because they couldn’t handle the Dangerous Faggot.\nUniversity administrations like UC Irvine, DePaul, and Bucknell did their best to appease triggered activists, with methods ranging from releasing statements condemning Yiannopoulos to making life difficult for the college conservatives who invited him. But, as revealed by the ignominious resignation of DePaul’s President and the rekking of UC Irvine at the hands of the College Republicans, such tactics were prone to backfire.\nThe smart ones took the opportunity to push for new, robust free speech protections. The University of Minnesota stood out as a college that used Milo’s visit to their advantage, proposing new rules to protect the speaking rights of controversial guests on campus from censorious left-wing activists.\nWhat will administrations do this time? Will they take after Minnesota stand up for free speech, or will they take after DePaul’s ex-president — or even the University of Missouri?\nYou can follow Allum Bokhari on Twitter, add him on Facebook. Email tips and suggestions to abokhari@breitbart.com.","url":"https://www.breitbart.com/social-justice/2016/07/06/milo-yiannopoulos-dangerous-faggot-tour-returns-campuses-fall/"}
