{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:15:11","date_modify":"2018-10-30 18:15:11","date_publish":"2017-02-18 23:56:55","description":"A Sudanese cleric and politician has called for his country to declare a truce with Israel, saying that Sharia law permits it.","filename":"data/vaneerConsumption/SudaneseClericShariaPermitsNormalizingTieswithIsrael.json","image_url":"https://media.breitbart.com/media/2016/10/Sudanese-President-Omar-al-Bashir.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_18__1540923311.html","title":"Sudanese Cleric: Sharia Permits Normalizing Ties with Israel","title_page":"Sudanese Cleric: Sharia Permits Normalizing Ties with Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A Sudanese cleric and politician has called for his country to declare a truce with Israel, saying that Sharia law permits it and prolonging the lack of relations only harms Sudan and not the Jewish state.\nYousuf Al-Koda, head of the Islamic Wasat Party, delivered a speech entitled “The Relations with Israel – Religious Aspects” in the Sudanese capital of Khartoum earlier this month.\nNews website Sudanese Online, in an article translated by the Middle East Media Research Institute (MEMRI), quoted Al-Koda as saying “the occupation of the Al-Aqsa Mosque does not prevent establishing relations with Israel.”\n“The fact that Jerusalem is in the hands of the Jews should not prevent us from maintaining ties with them,” he said.\nThe cleric added that establishing diplomatic ties with Israel was “perfectly permissible according to the Muslim sharia” law. The prophet Muhammed’s own actions attest to this fact, because he signed agreements with infidels, Al-Koda said.\nHe also noted that “very powerful countries” had normalized relations with Israel, including Turkey, Qatar, Jordan and Egypt, not to mention the fact that the Palestinian Authority itself maintains ties and security coordination with Israel.\n“The boycott has not harmed Israel but rather Sudan,” Al-Koda said, adding that it seemed the only reason it was in place was out of a misguided sense of “religious duty.”\n“Why then do we know only about the fighting and the jihad, as though they are the only option and there is no other option, in any form and under any circumstances?” he said.\nAl-Koda noted that the time was ripe to establish ties with Israel, but that did not mean Sudan should avoid “talking about the settlements or about Israeli violations.”\nAccording to another report in the Sudanese newspaper Al-Jarida, Al-Koda said that he had received murder threats if he went ahead and delivered his speech, which would “open the gates of evil.” Nevertheless, advocating ties between Sudan and Israel was important enough to Al-Koda to risk his life and even the lives of his children, the report said.","url":"https://www.breitbart.com/middle-east/2017/02/18/sudanese-cleric-we-must-call-for-truce-with-israel-sharia-permits-it/"}
