{"authors":[],"date_download":"2018-10-22 20:59:57","date_modify":"2018-10-22 20:59:57","date_publish":"2016-01-11 00:01:29","description":"Sudanese security forces in West Darfur's state capital on Sunday dispersed protesters who had gathered outside government buildings, with rebels claiming fo...","filename":"data/vaneerConsumption/SudansecurityforcesbreakupWDarfurdemosources.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5a4-3bWLCvS3pZb5eb4fce05c5da2abd-979_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393145_Sudan-security-forces-break-W-Darfur-demo-sources_1540241997.html","title":"Sudan security forces break up W.Darfur demo: sources","title_page":"Sudan security forces break up W.Darfur demo: sources | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sudan security forces break up W.Darfur demo: sources\nSudanese security forces in West Darfur's state capital on Sunday dispersed protesters who had gathered outside government buildings, with rebels claiming four demonstrators were killed but officials saying there had been no casualties.\nThe unrest began after a group of people rallied outside the West Darfur government secretariat in Geneina, both government and rebel sources said.\n\"Security services supported by tribal militia opened fire on civilians protesting at the buildings of the secretariat of the West Darfur state government,\" leading to the deaths of four protesters and wounding others, the rebel Sudan Liberation Movement (SLM) said in a statement.\nA Sudanese girl walks past a truck carrying leaving soldiers following a visit by President Omar al-Bashir in the West Darfur state capital of El Geneina on July 24, 2008 ©Khaled Desouki (AFP/File)\nIt said the crowd was demonstrating \"after government militia burned their homes and they became homeless\".\nThe group gave the names of two of those it said were killed but said the other two were unknown.\nThe claims were denied by a West Darfur government spokesman, who said the security forces dispersed a group of demonstrators in front of the buildings after they burned three cars, without causing casualties.\n\"Events started in the village of Mulli (50 kilometres south of Geneina) when the discovery was made of the body of a herder missing for two days who had been killed near the village,\" Abdallah Mustafa told AFP.\nThe herder's relatives surrounded the village, prompting its residents to flee to Geneina, where they congregated outside the government buildings, he said.\n\"Youths and displaced people from the camps around the town joined them and surrounded the government buildings and burned three cars,\" he added.\nIt was not immediately possible to independently verify the accounts.\nDarfur has been mired in violence since 2003 when ethnic rebels -- including the SLM -- mounted a campaign against the Arab-dominated government of President Omar al-Bashir, saying they were being marginalised.\nBashir unleashed a brutal counter-offensive using aircraft, ground troops and allied militia.\nHe has been indicted by the International Criminal Court over alleged war crimes, crimes against humanity and genocide charges related to the conflict, although he dismisses the charges.\nEthnic violence has further complicated the security situation in the region, and parts of Darfur have been hit by rising criminality.","url":"https://www.dailymail.co.uk/wires/afp/article-3393145/Sudan-security-forces-break-W-Darfur-demo-sources.html"}
