{"authors":[],"date_download":"2018-10-30 14:08:47","date_modify":"2018-10-30 14:08:47","date_publish":"2018-10-28 19:37:58","description":"Sugar Hill’s E Center recently received a Community Redevelopment Award from Partnership Gwinn...","filename":"data/vaneerConsumption/SugarHillsECenterwinscommunityredevelopmentaward.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/28/Images/newsEngin.23303093_Sugar-Hill-E-Center-West-Rear-View.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_sugar-hill-cente_d76462d57ea20065134e05f1dc02314a__1540908527.html","title":"Sugar Hill’s E Center wins community redevelopment award","title_page":"Sugar Hill’s E Center wins community redevelopment award","title_rss":"NULL","source_domain":"ajc.com","text":"Sugar Hill’s E Center recently received a Community Redevelopment Award from Partnership Gwinnett. Scheduled to open in the fall of 2018, the E Center is a $46 million mixed-use development owned and operated by Sugar Hill’s Downtown Development Authority.\nThe 180,000-square-foot E Center facility is home to the Eagle Theatre, a 406-seat, Art Deco style performing arts theatre that will be the venue for Sugar Hill’s performing arts groups, The Players Guild at Sugar Hill and Broad St. Concert Band.\nThe E Center campus also houses a gymnasium, community rooms and over 51,000 square feet of leasable commercial space and storage. The facility has space for nine restaurants, retail shops and class-A office space. A public promenade provides gathering space with outdoor seating and cascading waterfalls, all connected to the city hall parking deck via pedestrian bridge. The entire complex sits on top of an underground 100-space parking facility.\nThe rear promenade of the E Center overlooks The Bowl at Sugar Hill, the city’s outdoor concert venue. The Bowl boasts a capacity of 1,800 seats as well as over $4 million in recent upgrades to the venue and adjacent plaza.\nTwo additional private sector projects totaling over $125 million in investment will break ground in fall 2018, just after the E Center’s ribbon cutting, bringing over 500 residential units and new commercial opportunities to downtown Sugar Hill.","url":"https://www.ajc.com/news/local/sugar-hill-center-wins-community-redevelopment-award/9IU7jGjVMeJvIzz0bL4pzO/"}
