{"authors":["Ben Spencer","Medical Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:29:43","date_modify":"2018-10-22 20:29:43","date_publish":"2016-01-28 01:31:03","description":"Use of antidepressants has doubled in the past decade – to 57million prescriptions in England and Wales in 2014, according to the NHS Health and Social Care Information Centre.","filename":"data/vaneerConsumption/Suiciderisktoteenagerswhotakeantidepressantsisdoubled.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/19CC5034000005DC-0-image-a-48_1453944516154.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420236_Suicide-risk-teenagers-antidepressants-Chance-suicidal-behaviour-aggression-doubled-taking-one-five-common-drugs_1540240183.html","title":"'Suicide risk' to teenagers who take antidepressants is doubled","title_page":"'Suicide risk' to teenagers who take antidepressants is doubled | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Research: A major study has concluded teenagers who take common antidepressants are more likely to feel suicidal and aggressive (file photo)\nTeenagers who take common antidepressants are more likely to feel suicidal, researchers say.\nA major study concluded children and adolescents have a doubled risk of aggression or suicidal behaviour when taking one of five common drugs to combat depression.\nThe experts accused drug firms of failing to record the risks properly – and warned young people’s antidepressant use should be ‘minimal’.\nExperts said the ‘deeply worrying’ findings, published last night in the British Medical Journal, should make doctors think hard about whether to rely on the drugs.\nOthers, however, insist antidepressants are vital and effective in fighting mental illness.\nUse has doubled in the past decade – to 57million prescriptions in England and Wales in 2014, according to the NHS Health and Social Care Information Centre.\nAuthors of the latest study looked at five drugs, including Prozac, which together make up more than a third of all antidepressant use in the country.\nThe Danish researchers examined 70 previous trials, involving 18,500 patients. They found teenagers or children who took one of the drugs were twice as likely to become aggressive, severely restless or suicidal, as those on placebo pills.\nNone were reported to have taken their own life, but many were recorded as attempting or threatening suicide. The absolute risk of a young person harming themselves was still very small, the study showed. The researchers also found that among adults the drugs did not significantly increase suicidal behaviour or aggression.\nThe Copenhagen University team analysed fluoxetine (often sold under trade name Prozac), paroxetine (Seroxat), sertraline (Zoloft), venlafaxine (Effexor) and duloxetine (Cymbalta).\nThey warned that existing trials, including those led by the manufacturers, had ‘seriously underestimated the harms’ – and that suicidal events had often been wrongly classified as ‘emotional’ problems in the past.\nThey cited summary reports of trials by pharma giant Lilly, maker of Prozac and Cymbalta, in which the researchers claimed records of suicide attempts were missing in 90 per cent of instances.\n‘The true risk for serious harms is still unknown because the low incidence of these rare events, and the poor design and reporting of the trials, makes it difficult to get accurate effect estimates,’ the authors wrote.\n‘We suggest minimal use of antidepressants in children, adolescents and young adults, as the serious harms seem to be greater.’\nThe NHS recommends antidepressants should not usually be given to under-18s, acknowledging the drugs can trigger suicidal thoughts and self-harm in the age group.\nBut it suggests they can be given to young people if therapy has not helped.\nReading University’s Professor Shirley Reynolds said the ‘startling’ results will make GPs, parents and young people ‘think harder’ about use of antidepressants, but added: ‘Combining antidepressant treatment and psychological treatment … can lead to a more rapid reduction in symptoms.’\nLucie Russell, of charity Young Minds, added: ‘This new study is deeply worrying, and it’s very concerning that some clinical trials have been misreported or poorly designed …We believe that prescribing antidepressants should never be the only course of action.’\nA Lilly spokesman said: ‘The medical issues about these antidepressants have been addressed in our data submissions … for more than 20 years … Lilly is committed to sharing the results of our clinical trials and ensuring this information is available to the people who need it.’\nVirginia Acha of the Association of the British Pharmaceutical Industry said: ‘Any allegation against medicines produced by our members is treated seriously not only by our members but by our regulators.’\nPeople should never come off antidepressants without consulting their doctor.\nThe Connecting with People organisation has published an online safety guide for people with suicidal thought which can be accessed here.","url":"https://www.dailymail.co.uk/health/article-3420236/Suicide-risk-teenagers-antidepressants-Chance-suicidal-behaviour-aggression-doubled-taking-one-five-common-drugs.html"}
