{"authors":["Mehreen Kasana"],"date_download":"2018-10-31 01:48:36","date_modify":"2018-10-31 01:48:36","date_publish":"2018-09-13 23:56:21","description":"A new study conducted by the University of Arizona shows an alarming rate of suicide attempts among transgender teenage boys. Titled \"Transgender Adolescent Suicide Behavior,\" the study, published by the American Academy of Pediatrics, found that…","filename":"data/vaneerConsumption/SuicideAttemptsAmongTransgenderTeenageBoysHappenAtAnAlarmingRateANewStudySays.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/f2c9a902-d0f9-4f28-a630-fa2d6c19905b-getty-694297092.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_suicide-attempts-among-transgender-teenage-boys-happen-at-alarming-rate-a-new-study-says-11915501_1540950516.html","title":"Suicide Attempts Among Transgender Teenage Boys Happen At An Alarming Rate, A New Study Says","title_page":"Suicide Attempts Among Transgender Teenage Boys Happen At An Alarming Rate, A New Study Says","title_rss":"NULL","source_domain":"bustle.com","text":"A new study conducted by the University of Arizona shows an alarming rate of suicide attempts among transgender teenage boys. Titled \"Transgender Adolescent Suicide Behavior,\" the study, published by the American Academy of Pediatrics, found that teenage transgender boys show the \"highest rate of attempted suicide\" at 50.8 percent.\nAuthors of the study, Russ Toomey, Amy Syvertsen, and Maura Shramko said that their aim was to understand the link between \"key socio-demographic characteristics and suicide behavior\" and different gender groups among youths. The researchers concluded that suicide attempts were the highest among transgender boys aged between 11 and 19.\nOne of the authors of the study, Toomey, told BuzzFeed News that while they could not specify an exact reason for the attempts, he had an idea as to why suicide attempt rates were higher among transgender teenage boys. The author, who also is an associate professor at University of Arizona, told BuzzFeed, \"Transmasculine youth, as well as non-binary youth, really lack a sense of community or visibility.\"\nLack of representation in popular culture for transgender teenage boys may contribute to a culture of loneliness and isolation, he added. \"In mass media, we have some transfeminine actors, for example, represented in the media, however there are very few transmasculine or nonbinary people represented in the larger culture,\" Toomey said.\nDavid McNew/Getty Images News/Getty Images\nAuthors of the study also noted that non-binary youths were likely to attempt suicide at 41.8 percent. That percentage decreased among transgender teenage girls (29.9 percent) and among youths who were still questioning their gender identities (27.9 percent).\nToomey cautioned to BuzzFeed News to read the study while keeping mind that the results may carry survivor bias. He said that it was likely that suicide rates for transgender girls were higher than suicide attempts.\nCollectively, researchers determined that transgender youths were more likely to attempt suicide compared to cisgender youths. Researchers reported, \"Identifying as nonheterosexual exacerbated the risk for all adolescents except for those who did not exclusively identify as male or female (ie, non-binary). For transgender adolescents, no other socio-demographic characteristic was associated with suicide attempts.\"\nPrevention, according to the authors, was key. They noted that \"efforts can be enhanced by attending to variability within transgender populations, particularly the heightened risk for female to male and non-binary transgender adolescents.\"\nScott Olson/Getty Images News/Getty Images\nResearchers for the study surveyed 120,617 teenagers, according to BuzzFeed News. Of that number, over 1,700 said they were still questioning their gender identity. National Center for Transgender Equality's external relations director Raffi Freedman-Gurspan told BuzzFeed News that the study was \"exceedingly upsetting, but this is not, unfortunately, anything new to our ears.\"\nAdding to Toomey's assessment, Freedman-Gurspan said social ostracization was one of the reasons young transgender people attempt suicide. \"Overall what we hear from people who attempt is that they can’t deal with the stigma,\" she said.\nAt National Center for Transgender Equality's, Freedman-Gurspan told BuzzFeed that their emphasis is on helping transgender youths feel less like pariahs. \"What we always try and say is that there’s nothing that transgender people have done,\" she added. \"Society is just so slow in accepting and it creates scenarios where people don’t feel supported and safe.\"\nIf you or someone you know are experiencing suicidal thoughts, call 911, or call the National Suicide Prevention Hotline at 1-800-273-8255 or text HOME to the Crisis Text Line at 741741.","url":"https://www.bustle.com/p/suicide-attempts-among-transgender-teenage-boys-happen-at-alarming-rate-a-new-study-says-11915501"}
