{"authors":[],"date_download":"2018-10-23 03:33:53","date_modify":"2018-10-23 03:33:53","date_publish":"2016-01-29 18:40:26","description":"A suicide bomber attacked a mosque in Shiite-populated eastern Saudi Arabia during Friday prayers, killing four people before worshippers disarmed and tied u...","filename":"data/vaneerConsumption/Suicideattackkills4atmosqueinSaudiShiiteregion.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h9jq-4PuZeKVXE7cd9005b2c876d2f110-795_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422619_Gun-bomb-attack-Shiite-mosque-Saudi-residents_1540265633.html","title":"Suicide attack kills 4 at mosque in Saudi Shiite region","title_page":"Suicide attack kills 4 at mosque in Saudi Shiite region | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Suicide attack kills 4 at mosque in Saudi Shiite region\nA suicide bomber attacked a mosque in Shiite-populated eastern Saudi Arabia during Friday prayers, killing four people before worshippers disarmed and tied up his accomplice who had fired on them.\nThe state Al-Ekhbariya news channel quoted an interior ministry spokesman as saying four people died and 18 were wounded.\nAn initial ministry toll said two people were killed and seven hurt in the attack at the Al-Rida mosque in Mahasen, a neighbourhood in the eastern Al-Ahsa region.\nA suicide attack on a mosque during Friday prayers in Shiite-populated eastern Saudi Arabia killed four people ©Fayez Nureldine (AFP/File)\n\"We started to pray, and then we were surprised to hear shooting,\" said Mohammad bin Salman al-Ahmadi, 25, who was slightly injured in the attack.\n\"We rushed and closed the doors. After that they shot at the door trying to break in. The suicide bomber blew himself up and the door flew open.\"\nPower inside went out, leaving the mosque in darkness and filled with smoke as a second attacker \"randomly\" shot at worshippers, who tried to hide, Ahmadi said.\n\"Eventually the worshippers attacked him and took away his gun and took off his suicide belt. We tied him up using our 'shemaghs' and held him till police came,\" he said, referring to a traditional cloth head covering.\nFriday's incident was the latest assault on members of the Sunni-dominated kingdom's Shiite minority, after a string of shootings and bombings claimed by the Islamic State (IS) group.\nThe interior ministry said two suicide bombers were prevented from entering the mosque by security personnel.\n\"When security approached to intercept them, one of them responded by blowing himself up at the mosque entrance while an exchange of fire took place with another,\" it said.\nThe ministry said the second suspect was injured, and arrested with help from citizens.\n\"A suicide belt was found in his possession,\" it said, adding that automatic weapons were also recovered.\n- Increased security -\nSince deadly attacks claimed by IS last year against Shiite mosques in the kingdom's east, security has been increased and community guards now inspect visitors to houses of worship.\nFriday's attack happened in an area largely populated by employees of the state-owned Saudi Aramco oil company, a resident said.\nMost of Saudi Arabia's Shiites live in the kingdom's Eastern Province which includes Al-Ahsa, an oasis region where much of the kingdom's oil reserves are located.\nA video circulated on social media purportedly showed the aftermath of the attack, where several people lay still on a carpet, surrounded by broken glass.\nOne man could be seen applying a tourniquet to the thigh of a victim whose white robe was soaked with blood.\n\"People were so angry,\" and apprehended one of the alleged suspects themselves, the resident told AFP, asking for anonymity.\n\"Police started shooting in the air so they could take him away.\"\nAnother resident said Mahasen is a mostly Sunni neighbourhood, and the mosque that was attacked \"is a house that they turned into a mosque.\"\nIS, a Sunni extremist group, has claimed several deadly attacks against Saudi Shiites, whom the jihadists consider heretics, since late 2014.\nFriday's bombing was the first against Eastern Province Shiites since October, when a gunman fired on faithful commemorating Ashura in the Qatif area, killing five before police shot him dead.\nAshura is one of the holiest occasions for the Shiite faith.\nIn June, four Shiites died preventing a suicide bomber from entering the hall of Al-Anoud mosque in Dammam city.\nDays earlier, 21 people were killed in another Shiite mosque bombing in Eastern Province.\nGroups claiming affiliation with IS said they carried out those blasts and the Ashura shooting.\nDuring Ashura in 2014, gunmen killed seven Shiite worshippers, including children, in the eastern town of Al-Dalwa. The interior ministry said the suspects had links to IS.\nThe group has also claimed deadly attacks on Saudi security forces.\nSince deadly attacks claimed by IS last year against Shiite mosques in the kingdom's east, security has been increased and community guards now inspect visitors to houses of worship","url":"https://www.dailymail.co.uk/wires/afp/article-3422619/Gun-bomb-attack-Shiite-mosque-Saudi-residents.html"}
