{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-23 00:30:49","date_modify":"2018-10-23 00:30:49","date_publish":"2016-01-28 14:29:58","description":"Psychologists at the University of Florida believe suicide could be caused when the same system used by bees when they sacrifice themselves for the sake of the colony goes awry.","filename":"data/vaneerConsumption/Suicidalthoughtsmayoccurwhenourselfsacrificesystemgoesawry.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA6A8400000578-0-image-a-6_1453986265107.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420934_Suicidal-thoughts-occur-self-sacrifice-goes-awry-Behaviour-used-bees-protect-colony-reveal-clues-people-harm-themselves_1540254649.html","title":"Suicidal thoughts may occur when our 'self-sacrifice' system goes awry","title_page":"Suicidal thoughts may occur when our 'self-sacrifice' system goes awry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Suicidal behaviour and thoughts in humans could be as a result of a malfunction in the same system used by bees when they sacrifice themselves for the sake of the colony.\nPsychologists believe suicide could be rooted deep within human evolution, and even linked to the self-sacrificial behaviour shown by honeybees, ants and mole rats.\nThe theory draws parallels with these 'eusocial' species, suggesting that when it goes awry, the same hard-wired mechanism could play a role in suicide in humans.\nPsychologists believe that suicide could be rooted deep within human evolution, and even linked to the self-sacrificial behaviour shown by honeybees, ants and mole rats. Stock image. In particular, they believe that suicide is an example of this self-sacrificial suite of behaviours, found in other eusocial species, gone rogue\n'The idea that something mysterious and scary like suicide in humans could have some sort of analog in animals is not only kind of fascinating, but also really promising in terms of trying to figure it all out,' explained Professor Thomas Joiner, a psychologist at University of Florida and lead author of the study.\nIn social species, such as a colony of ants or a hive of bees, individuals will display a number of eusocial characteristics.\nThese include shared caring of young, dividing labour and defending the group, often at the cost of their own life. As a species, humans show many of these same traits.\nSELF-SACRIFICE AND SUICIDE In social species, such as a colony of ants or a hive of bees, individuals will display a number of eusocial characteristics. These include shared caring of young, dividing labour and defending the group, often at the cost of their own life. As a species, humans show the same traits. People may care for a niece or nephew, or a friend's child, divide household chores, and in times of war, many willingly lay down their lives for their family and even their country. Psychologists believe that suicide is an example of this self-sacrificial suite of behaviours, found in other eusocial species, gone rogue.\nPeople may care for a niece or nephew, or a friend's child, divide household chores, and in times of war, many willingly lay down their lives for their family and even their country.\n'Humans are a species that is eusocial, and that's an important starting point,' said Professor joiner.\n'That suggests a certain set of characteristics, including some really striking self-sacrifice behaviours.'\nIn many people with suicidal thoughts, their thoughts can become warped, and they may feel they are becoming a burden on their friends and family, giving rise to a \"better off without me\" mindset.\nThis, said the team, could indicate that the eusocial element of self-sacrifice has gone rogue.\n'The idea is if you give up yourself, which would include your genes, it can be evolutionarily speaking \"worth it\" if you spare or save multiple copies of your genes in your relatives,' said Professor joiner.\nWriting in the journal Psychological Review, the authors explain that suicide is an example of psychopathology, and is a derangement of the suite of behaviour found in other eusocial species.\nIn social species, such as a colony of ants or a hive of honeybees (stock image of a bee pictured), individuals will display a number of eusocial characteristics. Many of these simple traits are shared by humans, such as collective caring for young and division of labour, and perhaps, self-sacrifice for the good of others\nEusocial animals, such as naked molerats (stock image pictured) will exhibit altruistic behaviour and sacrifice themselves for their colony\nThey wrote: 'Suicidal behavior has been viewed by many as baffling, perhaps even inexplicable. One potential contribution of our ideas is to demystify the phenomenon, and by so doing, facilitate understanding, destigmatization, and ultimately prevention of this grave form of suffering.\nThe theory has the potential to offer a unique biological insight into how suicidal behaviour evolves and could perhaps help to identify personality traits of those most at risk.\nProfessor Joiner concluded: 'If you can identify animal models for this behaviour and understand its circuitry at the neurochemical and neurophysiological levels, then it might lead to new insights about similar circuitry that fail in human suicide.'\nFor confidential support call the Samaritans on 116123 or visit a local Samaritans branch, see www.samaritans.org for details","url":"https://www.dailymail.co.uk/sciencetech/article-3420934/Suicidal-thoughts-occur-self-sacrifice-goes-awry-Behaviour-used-bees-protect-colony-reveal-clues-people-harm-themselves.html"}
