{"authors":["Gianluca Mezzofiore For Mailonline"],"date_download":"2018-10-23 02:21:43","date_modify":"2018-10-23 02:21:43","date_publish":"2016-01-29 16:53:23","description":"Two gunmen attacked a Shia mosque in eastern Saudi Arabia killing three worshippers. Footage from the scene shows moment the first attacker blew himself up.","filename":"data/vaneerConsumption/SuicidebomberdetonateshimselfinSaudiArabianmosquekillingtwocaughtonvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B42DCE00000578-0-image-a-99_1454086315448.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422948_Terrifying-moment-suicide-bomber-detonates-Saudi-mosque-killing-two-caught-camera-moment-fellow-terrorist-beaten-crowd-vest-fails-off_1540261303.html","title":"Suicide bomber detonates himself in Saudi Arabian mosque killing two caught on video","title_page":"Suicide bomber detonates himself in Saudi Arabian mosque killing two caught on video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the terrifying moment a gunman wearing suicide belt blew himself up inside a Shia mosque in the eastern Saudi Arabia's al-Ahsa province during Friday prayers.\nFootage of the attack, which killed at least three people and wounded seven, shows the instant the bomb went off, breaking windows and causing a blackout.\nDuring the confusion and chaos that followed, people can be heard shouting invocations to Allah as they try to escape the mosque. Gunfire is also heard outside as worshippers begin to panic.\nScroll down for video\nFootage of the attack shows a room inside the mosque going dark as an explosion is heard. Gunfire can be heard outside\nThe attack struck the Imam Reza Mosque in the neighbourhood of Mehasin, an area popular with Shia workers of the state-run Saudi Arabian Oil Co.\nDuring the confusion and chaos that follow the explosion, people can be heard shouting invocations to Allah as they try to escape the mosque\nThe attack struck the Imam Reza Mosque in the neighbourhood of Mehasin, an area popular with Shia workers of the state-run Saudi Arabian Oil Co., the world's largest oil-producing firm.\nWhile one of the attackers detonated his explosives, the other opened fire - but was quickly stopped from blowing himself up.\nAnother video from the scene showed worshippers attacking the second militant inside the mosque. The gunman is seen laying on the ground surrounded by an angry mob who starts kicking and punching him.\nWhile one of the attackers detonated his explosives, the other opened fire - but was quickly stopped from blowing himself up\nThe second gunman, who failed to detonate his suicide belt, is seen laying on the ground surrounded by an angry mob who starts kicking and punching him\nASaudi worshipper removes the suicide belt from the militant\nThe clip continues with graphic footage of injured people covered in blood\nAt some point, a Saudi worshipper removes the suicide belt from the man. The clip continues with graphic footage of injured people covered in blood.\nSaudi police had to fire assault rifles into the air to drive away the mob that surrounded a police car holding the suspected attacker.\nShia in Saudi Arabia make up some 10 to 15 percent of the ultra-conservative, Sunni-ruled kingdom's population.\nThe graphic video shows injured worshippers inside the Imam Reza Mosque in the neighbourhood of Mehasi. The attack took place during Friday prayers\nAnother Shia worshipper is seen laying on the ground after the attack\nBodies can be seen one on top of each other inside the mosque after the suicide blast\nThe minority group, many of whom live in the country's oil-producing east, previously have been targeted in attacks by the Islamic State group, which views Shiites as heretics.\nIn August 2015, Daesh claimed responsibility for a suicide bomb that killed 15 worshippers.\nIn May, a suicide bomber killed 21 and wounded 81 in the village of al-Qadeeh, again during Friday prayers.\nNo group immediately claimed Friday's attack.","url":"https://www.dailymail.co.uk/news/article-3422948/Terrifying-moment-suicide-bomber-detonates-Saudi-mosque-killing-two-caught-camera-moment-fellow-terrorist-beaten-crowd-vest-fails-off.html"}
