{"authors":["Breitbart London"],"date_download":"2018-10-30 17:55:20","date_modify":"2018-10-30 17:55:20","date_publish":"2015-05-23 15:15:02","description":"ISIS jihadis are complaining in online forums that the best suicide missions in Iraq and Syria are being handed to those with the right \"connections\" |","filename":"data/vaneerConsumption/SuicideVestedInterestsISISJihadisBemoanSaudiQueueJumpersforBestBombingRuns.json","image_url":"https://media.breitbart.com/media/2015/05/isis-marching-ap-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_05_23__1540922120.html","title":"Suicide Vest-ed Interests: ISIS Jihadis Bemoan Saudi Queue Jumpers for Best Bombing Runs","title_page":"Suicide Vest-ed Interests: ISIS Jihadis Bemoan Saudi Queue Jumpers for Best Bombing Runs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ISIS jihadis are complaining in online forums that the best suicide missions in Iraq and Syria are being handed to those with the right “connections” through their Saudi Arabian friends and families.\nThe Express reports that preacher Kamil Abu Sultan ad-Daghestani warned of ‘corruption’ inside ISIS on a Russian-language jihadist website. He quoted a Chechen jihadist, who said: “Those Saudis have got things sewn up, they won’t let anyone in, they are letting their relatives go to the front of the line.”\nSome Syrian fighters are reportedly leaving and going to Iraq because the queue for a good suicide mission is so long in Bashar al-Assad’s embattled country.\nIn early 2014, British-born Kabir Ahmed told the BBC’s Panorama programme how “Everybody has got their name on the list to become a suicide bomber and everyone is forcing the leader to push their name up… everybody wants to fight in the name of Allah”.\nHe added: “An emir decides who to choose. There is a waiting list. I am lobbying him to move me up.”\nAhmed is believed to have killed himself in November while using a suicide truck to attack the convoy of an Iraqi police official.\nAccording to Foreign Policy magazine, an ISIS handbook on suicide bombing urges patience from new recruits. But ad-Daghestani complained that those in line are having to wait for so long that they are often being killed on the battlefield first.\nWhether or not such information will disrupt the recruitment process for ISIS remains to be seen.","url":"https://www.breitbart.com/europe/2015/05/23/suicide-vest-ed-interests-isis-jihadis-bemoan-saudi-queue-jumpers-for-best-bombing-runs/"}
