{"authors":[],"date_download":"2018-10-22 21:57:31","date_modify":"2018-10-22 21:57:31","date_publish":"2014-05-08 19:33:30","description":"If you want to cut a figure on your run, you'll need the newest and coolest piece of kit: an electronics-infused smart shirt from OMsignal.","filename":"data/vaneerConsumption/SuitingUpSmartShirtForTechSavvyAthletesGoesOnSale.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/430066/homepage-04-01_ee7076dc3e97721722ecb9f9dea8311e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gift-guide_suiting-smart-shirt-tech-savvy-athletes-goes-sale-n100666_1540245451.html","title":"Suiting Up: Smart Shirt For Tech-Savvy Athletes Goes On Sale","title_page":"Suiting Up: Smart Shirt For Tech-Savvy Athletes Goes On Sale","title_rss":"NULL","source_domain":"nbcnews.com","text":"For runners, knowing not just the steps taken, but where you were breathing hardest and when you slowed down can be critical knowledge for training.\nThere's a catch, of course — actually, a couple. First, the shirt uses a battery/wireless unit about the size of a pack of gum that you charge and attach at the side of your rib cage. Second, it only works with iOS devices for now — and you can't use multiple devices with the same shirt, something OMsignal dubiously calls \"technically impossible.\" Third, it costs $200, and that's the special pre-order price!\nAnd last, it's only available for men right now. The company is working on a women's version, but due to the wider variety of shapes women's bodies come in, more research is needed to get the sizing and fit right. Expect it this fall.\nEven with the caveats, it's a pretty cool device for someone who enjoys tracking themselves as they jog, bike, hit the gym, and so on. The shirts are available for pre-order, and should ship starting this summer.","url":"https://www.nbcnews.com/tech/gift-guide/suiting-smart-shirt-tech-savvy-athletes-goes-sale-n100666"}
