{"authors":[],"date_download":"2018-10-22 21:50:33","date_modify":"2018-10-22 21:50:33","date_publish":"2014-05-08 15:30:42","description":"Kellogg will no longer use the labels \"All Natural\" or \"Nothing Artificial\" on certain Kashi products to settle a class-action lawsuit.","filename":"data/vaneerConsumption/SuitPromptsKelloggstoDropNaturalLabelsonKashiProducts.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/429596/140508-kashi-mn-1300_92b692221ad58c2d72511b941081da01.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_suit-prompts-kelloggs-drop-natural-labels-kashi-products-n100391_1540245033.html","title":"Suit Prompts Kellogg's to Drop \"Natural\" Labels on Kashi Products","title_page":"Suit Prompts Kellogg's to Drop \"Natural\" Labels on Kashi Products","title_rss":"NULL","source_domain":"nbcnews.com","text":"The settlement was filed May 2 in U.S. District Court in California and is subject to court approval.\nAs people look to stick to diets they feel are wholesome, companies have flooded supermarket shelves with products marketed as being \"natural.\" But more recently, numerous lawsuits have challenged their use of the term on products that contain ingredients some say don't fit that definition.\nThe mounting legal challenges have prompted several companies to remove the word from packaging. PepsiCo Inc., for instance, changed its \"Simply Natural\" line of Frito-Lay chips to \"Simply,\" even though the ingredients didn't change. Likewise, its \"Natural Quaker Granola\" was changed to \"Simply Quaker Granola.\"\nPepsiCo also agreed to remove the words \"all natural\" from its Naked juices to settle a lawsuit that noted the drinks contained artificial ingredients.\nThe Food and Drug Administration says it doesn't have an official definition for the term \"natural,\" noting that a food product has likely been processed and is \"no longer the product of the earth.\" But the agency notes that it has not objected to the use of the term if the food does not contain added color, artificial flavors or synthetic substances.\n- The Associated Press","url":"https://www.nbcnews.com/business/consumer/suit-prompts-kelloggs-drop-natural-labels-kashi-products-n100391"}
