{"authors":[],"date_download":"2018-10-22 22:17:05","date_modify":"2018-10-22 22:17:05","date_publish":"2014-06-09 15:55:30","description":"Lawsuits against GM from customers who suffered economic damages from a recall over faulty ignition switches will be heard in New York.","filename":"data/vaneerConsumption/SuitsvGMForEconomicLossfromRecalltobeHeardinNYCourt.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/496741/140609-140609-gm-1157_2f58518be47b4f0bf78694a60be98a99.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_gm-recall_suits-v-gm-economic-loss-recall-be-heard-ny-court-n126316_1540246625.html","title":"Suits v GM For Economic Loss from Recall to be Heard in NY Court","title_page":"Suits v GM For Economic Loss from Recall to be Heard in NY Court","title_rss":"NULL","source_domain":"nbcnews.com","text":"GM had asked that the cases be consolidated and transferred to New York, the same district in which it filed for bankruptcy and emerged from it in 2009. GM is asking the federal bankruptcy court in Manhattan to determine whether claims brought by plaintiffs over the recall are blocked by the terms of its bankruptcy sale order, which created \"new GM\" and largely barred liability against the new company for the pre-bankruptcy conduct of \"old GM.\"\nThe order does not affect lawsuits over personal injuries or deaths alleged to have been caused by the vehicles.\nPlaintiffs' lawyers suing the company had also asked that the cases be consolidated but disagreed on where. The forums they suggested were Los Angeles - where litigation against Toyota over acceleration issues was transferred - as well as Miami, New Orleans, San Francisco and Texas.\nIn its order on Monday, the panel said that the Manhattan district was the most appropriate choice, since it was the same district that handled GM's bankruptcy, as well as the bankruptcy of Delphi Automotive, a GM supplier that made the switch at issue. Delphi has been named a defendant in some of the cases.\n- Reuters","url":"https://www.nbcnews.com/storyline/gm-recall/suits-v-gm-economic-loss-recall-be-heard-ny-court-n126316"}
