{"authors":["Mailonline Reporter"],"date_download":"2018-10-22 22:28:21","date_modify":"2018-10-22 22:28:21","date_publish":"2016-01-29 09:34:04","description":"She may only be 24 years-old. But British actress Suki Waterhouse proved that she has a fashion sensibility way beyond her years when she attended a star-studded charity fundraiser on Thursday.","filename":"data/vaneerConsumption/SukiWaterhousenailsredcarpetstylewithclassicLBDinParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0E68F00000578-0-image-a-18_1454060025088.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422405_Suki-Waterhouse-nails-red-carpet-style-classic-LBD_1540247301.html","title":"Suki Waterhouse nails red carpet style with classic LBD in Paris","title_page":"Suki Waterhouse nails red carpet style with classic LBD in Paris | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She may only be 24 years-old.\nBut British actress Suki Waterhouse proved that she has a fashion sensibility way beyond her years when she attended a star-studded charity fundraiser on Thursday.\nThe blonde beauty represented British talent with a classic approach to style as she stepped out at the Sidaction dinner as part of Paris Haute Couture Fashion Week at Pavillon d'Armenonville.\nScroll down for video\nGlam: Suki Waterhouse proved that she has a fashion sensibility way beyond her years when she attended a star-studded charity fundraiser on Thursday\nKeeping it classy for the bash, which raises money for HIV care and research, the Hammersmith-born starlet deftly turned heads in her choice of attire.\nProving that less is more, she dazzled in a traditional LBD which also managed to be thoroughly modern.\nFeaturing capped sleeves and an a-line skirt, the gown also boasted damask lace detail across her decolletage.\nSophisticated: Keeping it classy for the bash, which raises money for HIV care and research, the Hammersmith-born starlet deftly turned heads in her choice of attire\nSo cool: Suki Waterhouse also represented British talent with a classic approach, which impressed\nComplimenting the wardrobe selection, she added plenty of smokey eye make-up for a sexy finish, which certainly had the desired effect.\nShe added perfectly coiffed hair, which has heavily back-combed and parted in the middle for a Brigitte Bardot-inspired aesthetic.\nShe capped the look with a silver clutch and matching heels.\nTimeless style: The blonde beauty represented British talent with a classic approach to style as she stepped out at the Sidaction dinner as part of Paris Haute Couture Fashion Week at Pavillon d'Armenonville\nCool: Proving that less is more, she dazzled in a traditional LBD which also managed to be thoroughly modern\nNot that she was the only super-stylish attendee, of course. Diane Kruger also scored a serious fashion hit while attending the event in her dynamic choice of outfit, which consisted of a thigh-skimming mini-dress in bright white.\nFeaturing ruffle detail with an embroidered flower across the chest, it managed to be both sexy and classy without revealing too much.\nAlso showing off her fantastic figure, the petite number flaunted her arms thanks to its sleeveless design.\nLooking good: She added perfectly coiffed hair, which has heavily back-combed and parted in the middle for a Brigitte Bardot-inspired aesthetic\nSexy: Diane Kruger will surely not be surprised that the blonde beauty scored a serious fashion hit while attending a Paris fundraiser on Thursday\nKeeping it classy: The German-born star wowed onlookers in her dynamic choice of outfit, which consisted of a thigh-skimming mini-dress in bright white\nDemure: The 39 year-old turned heads as she attended the Sidaction dinner as part of Paris Haute Couture Fashion Week at Pavillon d'Armenonville\nClasping a rigid clutch bag, which perfectly synced-up to her dress detail, the screen star deftly turned heads as she enjoyed her turn on the red carpet.\nAmping-up the glamour even further, she anchored it all with a pair of black, strappy shoes.\nHaving styled her hair in a loose lot of relaxed waves, she capped the ensemble with a flash of red lipstick for added effect.\nSo stylish: Clasping a rigid clutch bag, which perfectly synced-up to her dress detail, the screen star deftly turned heads as she enjoyed her turn on the red carpet\nTurning heads: Having styled her hair in a loose lot of relaxed waves, she capped the ensemble with a flash of red lipstick for added effect\nSadly, there wa sno sign of her handsome boyfriend, Joshua Jackson.\nDiane and Joshua celebrated their 10-year anniversary, last year - but in recent months have hardly been seen together. The Fathers and Daughters actress spent the holiday season with her grandparents and family, as well as battling flu.\nMeanwhile, Joshua has had a hectic few months wrapping up filming on season two of The Affair, before heading on a three week trip to Japan, the Philippines and Dubai, filming a documentary.\nDiane's last photo of Joshua on her Instagram account was six weeks ago, where she posted a fun selfie with the actor of the pair sticking their tongues out.\nMan about town: French fashion designer Jean-Paul Gaultier kept it simple in a pair of black jeans and matching jumper, which he topped with a leather jacket\nAll-black: Juliette Binoche wasn't far behind in her classic style, which saw her step out in a black trouser suit with white piping which maintained her effortless chic\nYouthful: The 51 year-old certainly appeared younger than her years at the charity bash\nFortunately, there were plenty of other celebs who helped populate the money-generating bash.\nThey included French fashion designer Jean-Paul Gaultier, who kept it simple in a pair of black jeans and matching jumper, which he topped with a leather jacket.\nJuliette Binoche wasn't far behind in her classic style, which saw her step out in a black suit with white piping which maintained her effortless chic.\nMonica Bellucci was also one of the VIP guests at the annual dinner in the French capital on Thursday night, which aimed to raise funds for vital HIV research\nThe 51-year-old Spectre actress made her grand arrival on the red carpet wearing a slinky bodycon number boasting an eye-catching geometric print\nMonica Bellucci was also one of the VIP guests at the annual dinner in the French capital on Thursday night, which aimed to raise funds for vital HIV research.\nThe 51-year-old Spectre actress made her grand arrival on the red carpet wearing a slinky bodycon number boasting an eye-catching geometric print.\nFollowing suit, Olga Kurylenko had also dressed to impress.\nKeeping the fashion bar high: Olga Kurylenko also looked fantastic in her choice of attire\nNow that's a dress that'll impress! The brunette beauty also turned head sin her floor-length choice of attire\nTaking the plunge! Marina Hands showed off her decolletage as she posed up a storm for the cameras\nHit or miss? Olga Rudnicka suffered the only real fashion fail of the evening in her olive green ensemble","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422405/Suki-Waterhouse-nails-red-carpet-style-classic-LBD.html"}
