{"authors":["Tom Farmery For Mailonline"],"date_download":"2018-10-23 03:25:33","date_modify":"2018-10-23 03:25:33","date_publish":"2016-01-28 19:00:04","description":"The perfect preparation for showdown against Manchester City: Patrick Van Aanholt challenges the world after he and team-mates win against other members of the first team at paintballing.","filename":"data/vaneerConsumption/SunderlandplayerskeentofindtheirrangeastheygopaintballingaheadofduelwithfreefiringManchesterCity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2A02A00000578-0-image-a-6_1454074825705.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421488_Sunderland-players-keen-range-paintballing-ahead-dual-free-firing-Manchester-City_1540265133.html","title":"Sunderland players keen to find their range as they go paintballing ahead of duel with free-firing Manchester City","title_page":"Sunderland players keen to find their range as they go paintballing ahead of duel with free-firing Manchester City | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It would be a fair to suggest that Sunderland haven't been bad when it comes to finding the target this season yet they have been particularly messy when under fire themselves.\nIt is pretty apt, then, that members of Sam Allardyce's first team spent Thursday afternoon firing paintballs at each other.\nFans of the Black Cats were made aware of their side's extra session of target practice when defender Patrick van Aanholt posted a picture of him and his team-mates on his Instagram account.\nPatrick van Aanholt posted this picture of him and his Sunderland team-mates after their paintballing session\nThe Dutch left-back boasted that his team were the winners and ready to take on the world.\nIt's probably no surprise though that his team consisted mainly of fellow team-mates who play predominantly in attacking or attacking-minded positions.\nFabio Borini, Ola Toivonen, Yann M'Vila, Vito Mannone, Jack Rodwell, Jermain Lens and Jan Kirchoff all made up Van Aanholt's winning group.\nIn the same post, the defender also included some of the other players who competed in Sunderland's paintball tournament such as Jermain Defoe, John O'Shea, Steven Fletcher, Jordan Pickford and Adam Matthews.\nThere's no doubt that Van Aanholt is still on a high after scoring the equaliser for his side in the 1-1 draw against Bournemouth at the Stadium of Light.\nYet the defender knows as well as his manager that Sunderland are four points from safety and desperately need to start picking up more than a point in games if they are to avoid relegation.\nVan Aanholt's equaliser against Bournemouth earned Sunderland a 1-1 draw at the Stadium of Light\nSam Allardyce has confirmed Sunderland have called off their attempts to sign Swansea striker Andre Ayew\nAyew, who scored against Everton on Sunday, only joined the Welsh club in the summer but will not be leaving\nSurprisingly, Sunderland have scored 28 goals in the Premier League - the same as fifth-placed Manchester United.\nUnfortunately they have conceded 46 - more than any other team in the top division.\nSUNDERLAND'S 2015-16 PREMIER LEAGUE SEASON IN NUMBERS Games played: 23 Wins: 5 Draws: 4 Losses: 14 Goals scored: 28 Goals conceded: 46 Goal difference: -18 Points: 19 Position in the table: 19th\nAnd although they have a break this weekend due to not being in the FA Cup fourth round, they do have a difficult game at home to Manchester City on Tuesday to prepare for.\nThe January transfer window will close hours before kick-off and Allardyce has already given up on the chance of getting one of his top targets.\nThe Sunderland manager admitted on Thursday that he has called off attempts to sign Swansea City striker Andre Ayew.\nThe deal Sunderland were understood to be preparing included a £10million transfer fee plus striker Borini.\nBut Allardyce said: ‘Have we given up? Yes.\n‘I can’t see Swansea selling Andre Ayew. I never really thought they would to be honest, and we haven’t put a bid in. It was a bit more speculation about whether Swansea would let him go.’\nAllardyce also confirmed that Sebastian Coates will join Sporting Lisbon on loan while ruling out a move for Arsenal's Mathieu Debuchy.","url":"https://www.dailymail.co.uk/sport/football/article-3421488/Sunderland-players-keen-range-paintballing-ahead-dual-free-firing-Manchester-City.html"}
