{"authors":["Press Association"],"date_download":"2018-10-22 23:28:08","date_modify":"2018-10-22 23:28:08","date_publish":"2016-01-28 12:22:21","description":"Sunderland have completed the signing of Lorient central defender Lamine Kone for an undisclosed fee. The France-born Ivory Coast international has signed a ...","filename":"data/vaneerConsumption/Sunderlandcompletesigningofdefenderlaminekone.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-bb43ed7d-cbb7-4fcc-9c33-b8dbb6be7b94-2vdWmEltwXfba0ce28e632881248-677_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3419816_Sunderland-complete-signing-defender-Lamine-Kone_1540250888.html","title":"Sunderland complete signing of defender lamine kone","title_page":"Sunderland complete signing of defender lamine kone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sunderland complete signing of defender Lamine Kone\nSunderland have completed the signing of Lorient central defender Lamine Kone for an undisclosed fee.\nThe France-born Ivory Coast international has signed a deal which commits him to the Wearside club until the end of the 2019-20 season.\nBlack Cats boss Sam Allardyce told his club's official website: \"Strengthening our defensive options was a priority for us and Lamine is a player that has impressed me when I've seen him play.\"\nSam Allardyce is closing in on a new signing\nAllardyce continued: \"He is big and strong, attributes you need to play in central defence in the Premier League, and his arrival will give us healthy competition for places in a key position.\"\nThe news ends a protracted pursuit of Kone for the Barclays Premier League's 19th-placed team.\nAllardyce had twice ended his interest in the 26-year-old this month, with the Black Cats initially cooling on a £5million swoop before a proposed loan move broke down.\nAllardyce has signalled his intention to bring in another defender and an attacking player before the end of the transfer window having already signed Jan Kirchhoff, Dame N'Doye and Steve Harper.\nSunderland are also monitoring full-back Mathieu Debuchy's situation at Arsenal as he looks for regular club football ahead of this summer's Euro 2016 finals, although they face a battle with fellow Barclays Premier League strugglers Aston Villa if they are to strike a loan deal.\nA successful swoop for Kone could see Uruguayan defender Sebastian Coates leave Wearside with the former Liverpool player understood to be the subject of talks with Portuguese club Sporting Lisbon.\nMeanwhile, Greek midfielder Charis Mavrias has joined Bundesliga 2 Fortuna Dusseldorf on loan for the remainder of the season.","url":"https://www.dailymail.co.uk/wires/pa/article-3419816/Sunderland-complete-signing-defender-Lamine-Kone.html"}
