{"authors":["Associated Press"],"date_download":"2018-10-22 20:24:24","date_modify":"2018-10-22 20:24:24","date_publish":"2016-01-28 01:13:34","description":"PARK CITY, Utah (AP) — Gun violence was on the minds of more than a few filmmakers this year. The ongoing issue was the main subject of four new films at the...","filename":"data/vaneerConsumption/SundancefilmstakeonmassshootingsandgunsinAmerica.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:0a9204a674f6433e954289b865f5840a-4vVdYopwYQ7f641721b07a7020af-826_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419822_Sundance-films-mass-shootings-guns-America_1540239864.html","title":"Sundance films take on mass shootings and guns in America","title_page":"Sundance films take on mass shootings and guns in America | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sundance films take on mass shootings and guns in America\nPARK CITY, Utah (AP) — Gun violence was on the minds of more than a few filmmakers this year.\nThe ongoing issue was the main subject of four new films at the Sundance Film Festival — two feature documentaries (\"Newtown,\" ''Under the Gun\") one short documentary, \"Speaking is Difficult,\" and one feature, \"Dark Night.\"\nThe wave of films dealing with essentially the same subject — mass shootings in America — is both a coincidence and an indicator that the filmmaking community is engaging with the national consciousness.\nJournalist Katie Couric poses for a portrait to promote the film, \"Under the Gun\", at the Toyota Mirai Music Lodge during the Sundance Film Festival on Tuesday, Jan. 26, 2016 in Park City, Utah. (Photo by Matt Sayles/Invision/AP)\n\"We don't program films based on ideas we have of what issues we want to spark conversations about at the festival. We respond to the films,\" said Trevor Groth, Sundance's director of programming. \"Those films stood out to us because of the way they were made and the power within them.\"\nSundance founder Robert Redford echoed Groth's sentiments, joking that if they did seek out certain issues to spotlight, he'd make sure there would be lots of environmentalist films. But he also sees why the gun issue is so urgent for filmmakers.\n\"Guns, of course, are a big issue,\" Redford said. \"It's not just going to sit there because the deaths keep coming. It's going to keep rising up and rising up and it's going to get heated and I think there will be some resolve of some kind. I think it's time.\"\n\"Speaking Is Difficult\" director AJ Schnack believes the multiple films were borne out of frustration and a feeling of powerlessness.\n\"I think it's great that filmmakers are addressing this topic and are going to come at it from a bunch of different perspectives,\" Schnack said. \"It gives people permission to ignite those conversations in their communities and with their families and elected officials.\"\nHere's a look at the various ways filmmakers tackled the subject:\nNEWTOWN\nDirector Kim Snyder goes deep into the community of Newtown, Connecticut, in the aftermath of the Sandy Hook Elementary School shootings where 20 children and 6 educators were murdered.\nIn her documentary, Snyder explores the lives of those affected by the tragedy — the parents of children who were killed, parents of children who survived, Sandy Hook teachers, local law enforcement, religious leaders, and even a volunteer EMT.\n\"I didn't really have any big agenda,\" Snyder said, other than showing the community truthfully. \"But, as (Sandy Hook parent) David Wheeler says, the people who have the most motivation to allow that intrusion of a camera are people who, as he said, feel compelled to say something or do something that might prevent another town or family from having to go through this.\"\nDARK NIGHT\n\"Dark Night\" is the sole narrative feature in the bunch, and deals with a mass shooting in a Florida suburb. The not-so-oblique title references the Aurora, Colorado, massacre of 2012 during a midnight screening of \"The Dark Knight Rises.\"\n\"It starts with the massacre in Aurora,\" director Tim Sutton said. \"There was something that happened to the movie theater that day. The movie theater became unsafe. It became corrupted, possibly forever. I felt as a filmmaker a responsibility to try to touch on this theme.\"\nUNDER THE GUN\nKatie Couric and director Stephanie Soechtig (\"Fed Up\") returned to Sundance with a sweeping overview of guns in America — melding jaw-dropping stats (like how gun stores outnumber Starbucks and McDonald's combined in the U.S.), historical perspective (how the NRA used to stay out of politics), and emotional accounts from the families of the deceased (including mothers in Chicago and the brother of a girl killed in Aurora). They also speak to a variety of pro-gun advocates, from those who support background checks to those who scoff at the idea.\n\"Even people who've been immersed in this issue for years told us they learned some things from the film,\" Couric said. \"I was surprised how the NRA's tentacles spread so far and wide and how the organization has its finger prints on so many things.\"\nSPEAKING IS DIFFICULT\n\"Speaking is Difficult\" may never be finished. The short documentary is a living film, meaning every time there is another mass shooting, director AJ Schnack and his team will update it. He'd submitted a rough cut of the film to Sundance months ago and had to update it twice since then as new events occurred.\nSchnack's film shows the locations of the shootings, as they exist now, overlaid with 911 calls from the event.\n\"It's becoming almost a ritual where an event happens, there is a level of outrage for a few days and then as it gets further away it recedes and we go through it again,\" Schnack said. \"The events were starting to become like echoes of previous events.\"\nSchnack found the now-normalcy of the settings quite striking.\n\"A lot of the locations have returned to being the same place — a restaurant, a salon, a school,\" he said. \"People walk past as if nothing has happened.\"\nFILE - In this Sunday, Jan. 24, 2016 file photo, producer Maria Cuomo Cole, left, and director Kim A. Snyder pose for a portrait to promote the film, \"Newtown,\"at the Toyota Mirai Music Lodge during the Sundance Film Festival in Park City, Utah. Gun violence was on the minds of more than a few filmmakers this year at Sundance. Snyder goes deep into the community of Newtown, Conn., in the aftermath of the Sandy Hook Elementary School shootings where 20 children and 6 educators were murdered. (Photo by Matt Sayles/Invision/AP, File)\nDavid Wheeler, from left, Nicole Hockley and Mark Barden pose for a portrait to promote the film, \"Newtown\", at the Toyota Mirai Music Lodge during the Sundance Film Festival on Sunday, Jan. 24, 2016, in Park City, Utah. (Photo by Matt Sayles/Invision/AP)\nFilmmaker Stephanie Soechtig, left, and journalist Katie Couric pose for a portrait to promote the film, \"Under the Gun\", at the Toyota Mirai Music Lodge during the Sundance Film Festival on Tuesday, Jan. 26, 2016 in Park City, Utah. (Photo by Matt Sayles/Invision/AP)\nDirector Tim Sutton poses for a portrait to promote the film, \"Dark Night\", at the Toyota Mirai Music Lodge during the Sundance Film Festival on Sunday, Jan. 24, 2016 in Park City, Utah. (Photo by Matt Sayles/Invision/AP)\nThis image provided by the Sundance Institute shows people praying at a church in a scene from the documentary film, \"Newton,\" directed by Kim. A. Snyder. The film is included in the U.S. Documentary Competition at the 2016 Sundance Film Festival. The festival kicked off Jan. 21 and runs through Jan. 31. (MotoFilms/Sundance Institute via AP)\nFILE - In this Sunday, Jan. 24, 2016 file photo, Tim Sutton, writer-director of \"Dark Night,\" poses at the premiere of the film at the 2016 Sundance Film Festival in Park City, Utah. Gun violence was on the minds of more than a few filmmakers this year at Sundance. \"Dark Night\" is the sole narrative feature in the group, and deals with a mass shooting in a Florida suburb. The not-so-oblique title references the Aurora, Colo., massacre of 2012 during a midnight screening of \"The Dark Knight Rises.\" (Photo by Chris Pizzello/Invision/AP, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3419822/Sundance-films-mass-shootings-guns-America.html"}
