{"authors":["Craig Hope For Mailonline"],"date_download":"2018-10-22 23:04:45","date_modify":"2018-10-22 23:04:45","date_publish":"2016-01-28 11:40:31","description":"The Black Cats were preparing an offer of £10million plus Fabio Borini for the 26-year-old Frenchman, who only joined the Swans in the summer.","filename":"data/vaneerConsumption/SunderlandhaltpursuitofSwanseasAndreAyewasSamAllardycerulesoutDebuchymove.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/3088359F00000578-0-image-a-15_1453981163960.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420802_Sunderland-call-pursuit-Swansea-striker-Andre-Ayew-Sam-Allardyce-rules-Arsenal-s-Mathieu-Debuchy_1540249485.html","title":"Sunderland halt pursuit of Swansea's Andre Ayew as Sam Allardyce rules out Debuchy move","title_page":"Sunderland halt pursuit of Swansea's Andre Ayew as Sam Allardyce rules out Debuchy move | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Deal for Arsenal defender Mathieu Debuchy also looks unlikely\nSam Allardyce admits he can't see Swansea selling Andre Ayew\nSam Allardyce has confirmed that Sunderland have called off their attempts to sign Swansea striker Andre Ayew.\nThe Black Cats were preparing an offer of £10million plus Fabio Borini for the 26-year-old Frenchman, who only joined the Swans in the summer.\nBut Allardyce said: ‘Have we given up? Yes.\nSam Allardyce has confirmed Sunderland have called off their attempts to sign Swansea striker Andre Ayew\nAyew, who scored against Everton on Sunday, only joined the Welsh club in the summer but will not be leaving\n‘I can’t see Swansea selling Andre Ayew. I never really thought they would to be honest, and we haven’t put a bid in. It was a bit more speculation about whether Swansea would let him go.’\nAnd Allardyce says that his pursuit of Arsenal defender Mathieu Debuchy is another deal which looks unlikely to happen.\n‘I’m not sure he really wants to leave Arsenal, or that Arsene Wenger would let him go,’ explained the Sunderland boss.\nAllardyce says his pursuit of Arsenal defender Mathieu Debuchy is also unlikely to happen\nUruguay international and former Liverpool defender Sebastian Coates is set to join Sporting Lisbon on loan\nThe arrival of £5m Lorient centre-back Lamine Kone has pushed Coates out of the door at the Stadium of Light\nMeanwhile, Black Cats defender Sebastian Coates is set to join Sporting Lisbon on loan following the arrival of £5m Lorient centre-back Lamine Kone at the Stadium of Light.\nAllarydce added: ‘It’s a balancing act, and if we move people out it helps free up wages.\n‘Jordi Gomez may go, and then there’s also Adam Matthews, who might go somewhere to play some football.’","url":"https://www.dailymail.co.uk/sport/football/article-3420802/Sunderland-call-pursuit-Swansea-striker-Andre-Ayew-Sam-Allardyce-rules-Arsenal-s-Mathieu-Debuchy.html"}
