{"authors":["Mark Walker","Press Association"],"date_download":"2018-10-23 04:07:57","date_modify":"2018-10-23 04:07:57","date_publish":"2016-01-11 17:07:17","description":"Sunderland boss Sam Allardyce expects striker Dame N'Doye to complete his move to the Stadium of Light shortly and hopes the Senegal international can have an instant impact on the club's survival bid.","filename":"data/vaneerConsumption/SunderlandsSamAllardyceadmitsclubareclosetodealforDameNDoye.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/2902E86000000578-0-image-a-31_1452531284049.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394282_Sunderland-manager-Sam-Allardyce-admits-club-close-completing-deal-former-Hull-City-striker-Dame-N-Doye_1540267677.html","title":"Sunderland's Sam Allardyce admits club are close to deal for Dame N'Doye","title_page":"Sunderland's Sam Allardyce admits club are close to deal for Dame N'Doye | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sunderland boss Sam Allardyce expects striker Dame N'Doye to complete his move to the Stadium of Light shortly and hopes the Senegal international can have an instant impact on the club's Barclay's Premier League survival bid.\nStriker N'Doye, 30, sold by Hull to Turkish club Trabzonspor for £2.2million in August, was at the Academy of Light on Monday afternoon to finalise the move.\n'Dame N'Doye is going through the process,' Allardyce said. 'He's in the building at the moment.\nSunderland boss Sam Allardyce expects striker Dame N'Doye to complete his move to the Stadium of Light\nSunderland manager Sam Allardyce said N'Doye was at the Academy of Light on Monday to finalise the move\n'We hope to pull off a deal until the end of the season with a view to a more permanent move.\n'He's experienced the Premier League before with Hull City last season and scored five goals in 12 matches. I hope he can emulate that for us or maybe do even better.'\nN'Doye joined Hull from Lokomotiv Moscow in a £3million deal in early 2015 and Allardyce feels the forward's previous spell in the English top flight will help him settle in quickly as Sunderland bid to beat the drop.\n'Having had that experience last year, when Hull were struggling, and scoring on a regular basis, it can be very important for him settling in straight away and scoring for us,' said Allardyce, who hopes to further strengthen his squad.\nN'Doye joined Hull from Lokomotiv Moscow in a £3million deal in early 2015 but he could not keep them up\nAllardyce spoke to Steve Bruce about the striker\n'We've been linked with 39 players since December and probably 30 of them have been wrong,' he said.\nAllardyce, whose side were knocked out of the FA Cup following the 3-1 weekend defeat at Arsenal, has quickly turned his attentions to Wednesday's crucial match at relegation rivals Swansea and next Saturday's lunchtime kick-off at Tottenham.\nVictory for the Black Cats, second bottom, would see them close to within a point of the Welsh side, who are one place and two points above the bottom three.\nSunderland completed their first transfer window signing last week when they paid a reported fee of around £750,000 for former Bayern Munich defender Jan Kirchhoff and he could be involved at Swansea.\n'We'll train him for the next couple of days and I think we'll probably take him in the squad,' Allardyce added.\n'We'll probably make a decision (on Tuesday) whether we go with him as substitute or whether he starts.\nSunderland's new defender Jan Kirchhoff will travel with the squad to face Swansea on Wednesday\n'He'll certainly be involved against Tottenham. Hopefully he can hit the ground running. That's the hard bit for a young man who enters the Premier League for the first time at this time of year.\n'Can they hit the ground running and can he produce what we know he can produce straight away? That's the hard bit.","url":"https://www.dailymail.co.uk/sport/football/article-3394282/Sunderland-manager-Sam-Allardyce-admits-club-close-completing-deal-former-Hull-City-striker-Dame-N-Doye.html"}
