{"authors":["Harry Slavin For Mailonline"],"date_download":"2018-10-23 00:39:17","date_modify":"2018-10-23 00:39:17","date_publish":"2017-04-26 10:28:01","description":"Sunderland boss David Moyes has been charged by the Football Association over comments he made to BBC journalist Vicki Sparks after his side's draw with Burnley.","filename":"data/vaneerConsumption/SunderlandbossDavidMoyeschargedbyFAforslapcomment.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F98CE5200000578-0-image-a-10_1493198723039.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-4446954_Sunderland-boss-David-Moyes-charged-FA-slap-comment_1540255157.html","title":"Sunderland boss David Moyes charged by FA for slap comment","title_page":"Sunderland boss David Moyes charged by FA for slap comment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sunderland boss David Moyes has been charged by the Football Association over comments he made to BBC journalist Vicki Sparks.\nThe FA deemed the Scot's comments to be 'improper and/or threatening and/or brought the game into disrepute'.\nThe former Manchester United manager has until 6pm on Wednesday May 3 to respond to the charge.\nSunderland's David Moyes has been charged by the FA with bringing the game into disrepute over his threatening comments to BBC Radio 5 Live reporter Vicki Sparks\nFollowing an interview after his side's 0-0 draw with Burnley in March, Moyes was caught on a mobile phone camera telling Sparks: 'You were just getting a wee bit naughty at the end there, so just watch yourself.\n'You still might get a slap even though you're a woman. Careful the next time you come in.'\nThe 54-year-old was forced to apologies for his remarks, and has since expressed his regret at his behaviour.\nThe Black Cats boss was interviewed by Sparks after his side's goaless draw with Burnley\nSpeaking at a press conference at the beginning of April, after the video had been made public, Moyes said: 'I deeply regret (what I said) and I've done what I had to do and apologised, which I was right to do so.\n'In the heat of the moment, I made a mistake in my comment to a BBC reporter which I profoundly regret.\n'I was disappointed with myself for it. I subsequently phoned the reporter and apologised, which she accepted.'\nMoyes faced demands he resign from him position at the North East club, but refused to do so, despite groups and individuals, such as BBC Match of the Day commentator Gary Lineker, condemning his actions.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-4446954/Sunderland-boss-David-Moyes-charged-FA-slap-comment.html"}
