{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 20:03:38","date_modify":"2018-10-22 20:03:38","date_publish":"2016-01-29 00:14:31","description":"They celebrated their five-year anniversary last week.","filename":"data/vaneerConsumption/SunrisesEdwinaBartholomewkissesboyfriendNeilVarcoeonscreen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30ADEAF500000578-0-image-a-33_1454023363094.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421856_Sunrise-star-Edwina-Bartholomew-kisses-boyfriend-Neil-Varcoe-screen_1540238618.html","title":"Sunrise's Edwina Bartholomew kisses boyfriend Neil Varcoe on screen","title_page":"Sunrise's Edwina Bartholomew kisses boyfriend Neil Varcoe on screen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They celebrated their five-year anniversary last week.\nSo it was no surprise that Edwina Bartholomew couldn't keep her eyes off boyfriend Neil Varcoe when he appeared alongside her on Sunrise on Friday.\nAnnouncing she will be stepping down from her roving weather presenting role to commit to a gig in the main studio, the 32-year-old Channel Seven star promised her beau that more time together could see her 'do more washing'.\nScroll down for video\nSealed with a kiss: Edwina Bartholomew was thrilled to see her boyfriend Neil Varcoe on the Sunrise set on Friday morning, giving him a kiss as she announced she was stepping down from her weather presenting gig\nBlonde beauty Edwina was over the moon when Neil and her parents arrived on set to celebrate her final day as a Sunrise weather presenter.\nAfter giving her parents a quick hug, she didn't hesitate giving her man a sweet smooch on the lips, before cuddling up to him as she tried to compose herself.\nHaving been on the road as the weather presenter for the past three years, Edwina and Neil have had to manage a long-distance romance to some extent.\nAnd when asked how they will deal with being together more often, Edwina laughed: 'I might do more washing'.\nCuddles: The 32-year-old Channel Seven star promised her beau that more time together thanks to her new studio role may mean 'I might do more washing'\nLoved ones: Edwina's parents also joined her, Neil and Sunrise hosts Samantha Armytage and David 'Kochie' Koch on set\n'How have you coped with her being on the road for so long?' Sunrise host David 'Kochie' Koch then asked Neil.\n'Look I think it's been good for us,' Neil responded.\n'We kind of really focus on the time we have together and weekends are kind of really special and I eat a lot of pizza,' he added.\nWhile Edwina is stepping down from her weather presenting role, she is still a part of the popular breakfast show's team, seemingly joining the main panel of hosts at Brekky Central going forward.\nProud boyfriend: Neil took to Twitter to congratulate his lady love on her next career move\nFuture plans: Kochie was cheeky enough to tease the couple, saying ''Now's a chance for you two to settle down which is great'\nEyes for each other: Neil said that the last three years has made the couple really appreciate the limited time they have had together\n'I can't wait to be back in the studio on Monday,' Edwina said, her replacement for the weather presenting role meanwhile being television and radio star Sam Mac (McMillan).\n'Now's a chance for you two to settle down which is great,' Kochie then added, teasing the star and her writer boyfriend about future marriage and family plans.\n'Oh shut up,' an embarrassed Edwina laughed before stealing a glance from her beau.\nMeanwhile Kochie cheekily insisted: 'We look forward to other news in the future'.\nLast week Neil took to Instagram to gush about his famous girlfriend as the pair celebrated their five-year anniversary.\nCelebrations: Last week Neil shared this snap to celebrate the pair's five-year anniversary\n'Celebrating five magical years with this one, today. She has my heart. She is my everything,' the spectacled, dark-haired writer captioned the image, in which he was seen wrapping his arms around Edwina.\nNeil also shared a tweet on Friday morning to further congratulate his love on her next career move.\n'Very proud — of @edwina_b,' he wrote.\nOn Friday morning Edwina took the opportunity to reflect on the array of experiences she has had as the resident Sunrise weather presenter over the last three years.\n'Look, when I started this job they told me I could write my own ticket to the world and we certainly have done that.\nSmitten: 'She has my heart. She is my everything,' Neil wrote about his famous girlfriend\n'We've visited over 700 locations, probably about 550 bacon and egg rolls, driven tens of thousands of kilometres, made friends for life right across Australia including of course those great blokes I work with every single day.\n'I've laughed so hard that I've cried. I'm now crying so hard that I'll soon be laughing,' she concluded, before a highlights reel of her past three years with Sunrise was showcased to viewers.\nEdwina has been the Sunrise weather reporter up until now, and has most recently been hosting Weekend Sunrise on Saturday and Sunday.\nShe has also co-hosted the last few seasons of Dancing With The Stars alongside the likes of Dan MacPherson and Shane Bourne.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421856/Sunrise-star-Edwina-Bartholomew-kisses-boyfriend-Neil-Varcoe-screen.html"}
