{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 20:45:34","date_modify":"2018-10-22 20:45:34","date_publish":"2016-01-29 03:33:13","description":"It has almost been three months since Sam Frost joined forces with Rove McManus to front a new 2Day FM breakfast radio show.","filename":"data/vaneerConsumption/SunrisesSamMacrevealsheandSamFrostwereplanningradioshowtogether.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AE753E00000578-0-image-a-70_1454036780930.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422092_New-Sunrise-weather-presenter-Sam-Mac-reveals-Sam-Frost-planning-radio-joined-Rove-McManus-2DayFM_1540241134.html","title":"Sunrise's Sam Mac reveals he and Sam Frost were planning radio show together","title_page":"Sunrise's Sam Mac reveals he and Sam Frost were planning radio show together | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It has almost been three months since Sam Frost joined forces with Rove McManus to front a new 2DayFM breakfast radio show.\nBut it seems the program wasn't the first on-air project considered by the 26-year-old Bachelorette star, with Sam Mac (McMillan) revealing he and Frost had previously been in talks to do their own weekend radio show.\nSpeaking to Daily Mail Australia on Friday, newly appointed Sunrise weather presenter Mac said: 'Sam and I have actually recorded some stuff together previously that we were potentially looking at doing'.\nScroll down for video\nWhat could've been: New Sunrise weather presenter Sam Mac told Daily Mail Australia on Friday that he and Sam Frost had been considering a weekend radio show together before she joined Rove McManus on 2DayFM\nElaborating further about the pair's plans, he said: 'We were just looking at possibly doing a weekend show'.\nAccording to Mac, these talks took place as The Bachelorette 'was sort of wrapping up' last year.\nWhile he didn't divulge which radio station the potential program was linked to, he did share some name ideas the pair had tossed around.\n'We were wondering what we were going to call it - like Sam squared, The Sam Experience (and) Frosty reception was my favourite,' he laughed.\nOn-air duo: Frost currently hosts the 2DayFM Sydney breakfast radio show alongside Rove McManus\nMac and Frost recorded some content together, but obviously nothing materialised of it with Frost going on to secure a hosting gig with Rove McManus.\nWhile Mac says he hasn't listened to the 2Day FM duo much, he is sure the reality star is bringing some value to the new radio show.\n'I think she's actually really funny and has a lot to give. I genuinely really like Sam and I hope it's a success for them,' he said.\n'Rove's a great guy and I really want to see them do well.'\nRadio fun: In terms of his radio career, Mac has most recently been working with the Nova network, co-hosting shows alongside the likes of Rachael Finch\nHost with the most: Over December Mac co-hosted Nova's breakfast radio show alongside Kate Mac and James Mathison\nMac, who has previously hosted the Austereo network's Hot 30 Countdown show, acknowledged Frost and McManus have a steep challenge ahead of them after taking over the reigns from previous 2Day FM breakfast hosts Dan Debuf and Maz Compton.\n'It's just so competitive. There's so many big, strong, well-known shows and personalities in the Sydney breakfast market,' Sam explained.\n'It doesn't just switch like that. You don't launch a new show and then suddenly they're number one, unless you're Kyle and Jackie O who have been together for 10 years in the first place and everyone already knew them.'\nMore recently Mac has been associated with the Nova network, fronting a Summer breakfast program alongside James Mathison and Kate Mac over December.\nNew team: Australia's first Bachelorette Frost commenced her radio gig with Logie award winner Rove in November last year\nPrevious presenters: Frost and McManus took over from Dan Debuf and Maz Compton\n'The last couple of years I've been working with Nova so I've filled in for Fitzy and Wippa and I've done a lot with them,' Mac told Daily Mail Australia.\n'I've got a really good relationship with Nova so I've done the show with Kate Ritchie there, I've done it with Rachael Finch.'\nWhile he has just been announced as the new Sunrise roving weather reporter, Mac hopes there's a way he can still do a little bit of radio further down the track.\nOn Friday morning Channel Seven's Sunrise announced that Mac would be replacing Edwina Bartholomew as their weekday weather presenter.\n'It feels pretty surreal, like it's a huge opportunity,' he reflected on the new gig while speaking to Daily Mail Australia.\n'I understand I'm in for a big, big job - a lot of work, a lot of travel. It's going to be long hours but the trade-off is this is an opportunity to see parts of Australia and the world that I haven't seen.'\nNew gig: On Friday Mac was announced as the new weather presenter for Sunrise","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422092/New-Sunrise-weather-presenter-Sam-Mac-reveals-Sam-Frost-planning-radio-joined-Rove-McManus-2DayFM.html"}
