{"authors":["Kate Darvall For Daily Mail Australia"],"date_download":"2018-10-22 23:30:14","date_modify":"2018-10-22 23:30:14","date_publish":"2017-04-26 07:46:42","description":"Young Sunshine Coast father suffered second-degree burns after his pressure-cooker exploded while making dinner for his sick daughter, 4, at home on Easter Sunday.","filename":"data/vaneerConsumption/SunshineCoastmansuffersburnsaftercookerexplodes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C7B3500000578-0-image-a-60_1493185260702.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446408_Sunshine-Coast-second-degree-burns-Bellini-pressure-cooker_1540251014.html","title":"Sunshine Coast man suffers burns after cooker explodes","title_page":"Sunshine Coast man suffers burns after cooker explodes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Sunshine Coast man has suffered second-degree burns after his pressure-cooker exploded in his kitchen.\nTysonn Loughran was making his four-year-old daughter Indyanna vegetable soup on Easter Sunday when the pressure-cooker exploded, leaving him severely injured.\nMr Loughran's partner Elyssa-Belle Lofay said he yelled at her to jump back right before the machine's contents erupted.\nMr Loughran's partner Elyssa-Belle Lofay (pictured together) said he yelled at her to jump back right before the machine's contents erupted\n'He said to me \"get back, get back' and then it just exploded,\" Ms Lofay told the Sunshine Coast Daily.\n'There was vegie steam and liquid everywhere, it completely covered the downstairs of our house.'\nMs Lofay said it was sheer luck her four-year-old daughter Indyanna was not in the room when it happened.\n'If she had been in the way it could have killed her,' she said.\nMr Loughran was treated for second and third degree burns (pictured) following the incident\nMs Lofay said she immediately phoned an ambulance and her partner was treated for second and third degree burns\nMs Lofay said she immediately phoned an ambulance and her partner was treated for second and third degree burns.\nShe said his injuries were so severe he was forced out of work for the next month at least.\nThe young couple reached out to manufacturer Bellini for compensation, but were told Target was responsible because that's where the pressure cooker was purchased.\nMs Lofay said Mr Loughran's injuries were so severe he was forced out of work for the next month at least\nThey also contacted the Electrical Safety Office and Consumer Affairs and reached out to a lawyer for advice, according to the Sunshine Coast Daily.\nWhen Daily Mail Australia reached out to Bellini, it was told Target was responsible for all communication.\nDaily Mail Australia reached out to Target but received no reply before publication.","url":"https://www.dailymail.co.uk/news/article-4446408/Sunshine-Coast-second-degree-burns-Bellini-pressure-cooker.html"}
