{"authors":[],"date_download":"2018-10-30 14:07:35","date_modify":"2018-10-30 14:07:35","date_publish":"2018-10-30 10:30:00","description":"ATLANTA FORECAST\nTuesday: High: 72\nTuesday night: Low: 52\nWednesday: High: 76\n»...","filename":"data/vaneerConsumption/SunshinetowarmAtlantatothelow70s.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/10/30/Videos/4518811.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_tuesday-weather-tra_41f490f9ad31b41c2e6207cdf7645256__1540908455.html","title":"Sunshine to warm Atlanta to the low 70s","title_page":"TUESDAY’S WEATHER-TRAFFIC: Sunshine to warm Atlanta to the low 70s","title_rss":"NULL","source_domain":"ajc.com","text":"ATLANTA FORECAST\nTuesday: High: 72\nTuesday night: Low: 52\nWednesday: High: 76\n» For a detailed forecast, visit The Atlanta Journal-Constitution weather page.\n﻿North Georgia woke up to cooler temperatures Tuesday than the day before, but the region should warm up considerably now that the sun is up, according to Channel 2 Action News.\nSome spots in the mountains started in the 30s, while Atlanta started in the 40s and is warming into the 50s, the news station reported. Temperatures across North Georgia were 5 to 16 degrees cooler than Monday morning, Channel 2 meteorologist Karen Minton said.\n“We're starting out a little chilly,” she said. “ ... Pull on that jacket before you head on out.”\nIt's a bit chilly this morning. Temperatures are 5 to 16 degrees colder this morning than 24 hours ago. Expect a nice warm up this afternoon when temperatures reach the low 70s. pic.twitter.com/DOmDQ3nPqH — Karen Minton (@KarenMintonWSB) October 30, 2018\nWith plenty of sunshine on tap for Tuesday, Minton said metro Atlanta can expect a nice increase in temperatures.\n“High pressure is in place,” she said. “It is going to keep us dry for today, and warm, too, with many areas rising into the lower 70s this afternoon.”\nMore dry, warm weather is expected Wednesday for Halloween with a high of 76 degrees. When most trick-or-treaters begin their candy grab about 7 p.m., Minton expects temperatures to be in the lower 70s. By 9 p.m., temperatures should still be in the upper 60s.\n“It’s going to be nice for us during the day tomorrow for Halloween, although clouds will begin to increase as we go through Wednesday,” she said.\nMinton said a “weather-maker” cold front is on its way to the state and is expected to bring showers and some storms Thursday. The models are still changing, she said, so the timing of the rain is still uncertain.\nThursday's cold front has slowed. It won't impact Halloween. Timing may change: These are the current arrival times.\nNW GA: NOON-6PM\nATLANTA METRO: 3-9pm\nNE GA 6PM-MIDNIGHT\nSTAY TUNED FOR UPDATES pic.twitter.com/a21nHZggGt — Karen Minton (@KarenMintonWSB) October 30, 2018\nWestern metro Atlanta counties and central Georgia could be at risk for severe weather when the front rolls through, according to Channel 2.\n“We need to watch for the potential for some damaging winds, perhaps even that isolated tornado in the area,” Minton said.\nA cold front will bring storms on Thursday. Severe storms with damaging winds and isolated tornadoes are possible. Severe Weather Team2 will have new data throughout the day and track storms when they develop. pic.twitter.com/l649GEcjNj — Karen Minton (@KarenMintonWSB) October 30, 2018\nThose regions will also see the most rain accumulation. Minton expects 1 to 2 inches of rain to fall over the area, with lighter rain to the east.\nWhile you will enjoy a mild day today and Wednesday, Thursday is setting up to be potentially stormy. Wind will be one of the primary threats Thursday afternoon. As new data comes in we will fine tune the timing of storms in your area. pic.twitter.com/LLcvaTlxhk — Karen Minton (@KarenMintonWSB) October 30, 2018\n“Some of the models bring it in late in the day on Thursday,” she said. “Others have it slowed down about 4-6 hours, so our timing may be adjusted. You will want to stay with us for the next couple of days as we fine-tune this.”\nCooler weather is on the way on the other side of the front, with weekend highs in the mid-60s.\n“It cools off and it is really going to be quite pleasant,” Minton said. “Just a little chilly in the mornings.”\nAtlanta interstates have seen wreck after wreck for the better part of the Tuesday morning rush, according to the WSB 24-hour Traffic Center.\nThe Top End Perimeter is jammed at 9 a.m. with several trouble spots adding to delays. On the Outer Loop, the ramp from I-285 West to northbound Peachtree Industrial Boulevard has been blocked for several hours after a tractor-trailer overturned.\nCrews are on scene working to clear the wreck.\nMORE: Overturned tractor-trailer blocks I-285 ramp in DeKalb County\nTRAVEL ADVISORY: Dekalb Co.: Overturned Tractor Trailer Crash Clearing: I-285/wb (outer loop) ramp to Peachtree Industrial Blvd/nb; ramp is still blocked; wreckers on scene; delays; https://t.co/RuPa64SzPC; #ATLtraffic pic.twitter.com/fHMTnmkvgl — Triple Team Traffic (@WSBTraffic) October 30, 2018\nAnother crash blocks a right lane on I-285 North at Covington Highway in DeKalb, and the Outer Loop remains crowded through Cobb and north Fulton, the Traffic Center reported.\nGa. 400 has seen its share of delays Tuesday morning. A stalled vehicle on Ga. 400 South past Holcomb Bridge Road blocks a right lane, further complicating the morning drive.\nFulton Co.: Stalled Vehicle: GA-400/sb past Holcomb Bridge Rd.; blocks the right lane; adding to the delays; https://t.co/RuPa64SzPC; #ATLtraffic pic.twitter.com/OsHn4K0Oby — Triple Team Traffic (@WSBTraffic) October 30, 2018\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\n» Download The Atlanta Journal-Constitution app for weather alerts on-the-go.","url":"https://www.ajc.com/weather/tuesday-weather-traffic-sunshine-warm-atlanta-the-low-70s/Z7uR3tzsJNf7bwgTBrxcpN/"}
