{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 19:58:08","date_modify":"2018-10-30 19:58:08","date_publish":"2017-04-07 00:37:15","description":"BY MELISSA RUGGIERI/AJC Music Scene\n(This story was origin...","filename":"data/vaneerConsumption/SunTrustParkAlookatthenewCocaColaRoxyvenue.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_suntrust-park-look-the-new-coca-cola-roxy-venue__1540929488.html","title":"SunTrust Park: A look at the new Coca-Cola Roxy venue","title_page":"SunTrust Park: A look at the new Coca-Cola Roxy venue","title_rss":"NULL","source_domain":"ajc.com","text":"BY MELISSA RUGGIERI/AJC Music Scene\n(This story was originally posted on April 7, 2017)\nLive Nation Atlanta president Peter Conlon poses against the front wall of the new Coca-Cocal Roxy, which is adorned with posters from shows that took place in the era of the original Roxy in Buckhead. Photo: HYOSUB SHIN / HSHIN@AJC.COM\nPeter Conlon stands in front of a wall at the entrance of the new Coca-Cola Roxy , pointing out highlights in this colorful mishmash of Atlanta rock ‘n’ roll history.\nJohnny Cash. Gregg Allman. Leonard Cohen. The Black Crowes.\nConcert posters replicated from his personal collection tell the story of hundreds of acts who played at the original Roxy in Buckhead—his joint venture with deceased friend and business partner Alex Cooley —in the 1990s and 2000s.\nThe two-tiered Roxy will hold close to 4,000 fans. HYOSUB SHIN / HSHIN@AJC.COM\nThat building is now the Buckhead Theatre. But on Saturday, a fresh generation of music fans will step into the polished lobby of the nearly 4,000-capacity venue that’s just steps from the Atlanta Braves’ SunTrust Park at The Battery that takes its name from one of the city’s most fondly remembered music havens.\nRELATED: SunTrust Park: 3 must-attend entertainment venues near ballpark\n“The name is iconic,” Conlon said. “We’re trying to walk the balance between what it was and what it is. We want to keep the historic feel of the Roxy in a millennial position.”\nConlon is the president of Live Nation Atlanta, the concert behemoth that will book about 40 shows per year in the 53,000-square-foot site, the majority of them on non-game days.\nSaturday’s launch is a sold-out concert from British indie rockers Glass Animals (for Radio 105.7’s birthday celebration). Upcoming shows include country rocker Corey Smith (April 22); ‘90s alt-gods Bush (May 10); and rappers Lil Wayne (May 8) and T.I. (June 18).\nRELATED: T.I. will play hometown show at new Coca-Cola Roxy Theatre\nThe lobby of the new venue. Photo: HYOSUB SHIN / HSHIN@AJC.COM\nIn front of the stage, the venue floor is flat—unlike the similarly laid-out Tabernacle downtown, which slopes upward–which will provide ample room for fans to congregate during general admission shows and allow for better table placement during private events.\n“This floor makes (The Roxy) different,” Conlon said. “A lot of artists want that general admission space, that’s the appeal.”\nThe two-tiered venue offers permanent seating for 800 in the balcony; the strips of gray chairs constructed of thick, hard plastic will be general admission for most shows (though, like the Tabernacle, could become reserved seating depending upon the concert), while the front rows of plush red and black seating can be purchased as a premium upgrade. The sides of the balcony are lined with cozy box seating, which have already been sold for the inaugural season.\nDownstairs, Conlon gestured to the six massive chandeliers dangling overhead and the red velvet curtains draping the walls, part of the $3 million price tag for interior work at the venue.\n“We never had anything that nice at the (old) Roxy,” he said with a laugh. “We would have liked to have this in the original, but we didn’t have the money…It was a different time. We didn’t have the luxury of building the venue we had then, but we created a good vibe. That’s why I wanted the name—to have an identity when it opened.”\nOther touches from its famous predecessor will be sprinkled throughout the venue, such as the grinning Elvis head that hung over the bar at the original Roxy. It will now adorn the bar in the swanky VIP room, decorated, as are the four artist dressing rooms, in the burgundy shades affiliated with the Buckhead classic.\nConlon goes through memorabilia, which will soon adorn the walls of the venue. Photo: HYOSUB SHIN / HSHIN@AJC.COM\nIn an upstairs office, Conlon excitedly pawed through stacks of professionally bundled memorabilia—also from his personal collection—which he anticipates seeing on the walls throughout the new building.\nNot all are Roxy-specific, but if they’re of the same time period—such as Robert Plant’s encased pants from a 1995 show at The Omni (“He left them behind,” Conlon shrugged) or an autographed dressing room sign from Whitney Houston during an early-‘90s Atlanta visit—fans will see them.\nThere are still a few aesthetic touches to complete, including a wall-length mural on the second floor depicting scenes from the old Roxy (those driving along the The Battery on Windy Ridge Parkway will notice a similarly colorful mural of rock posters outside) and a final menu of concession offerings.\nBut fans can be assured that most fundamentals are set.\nParking is plentiful, but lot location and price will vary by show, said Molly Sandman, marketing manager for the venue. Parking for Saturday’s concert will be $20 in the Red lot across the street from the Coca-Cola Roxy and ride-sharing service areas are clearly marked at the end of the Roxy block.\nExpansive bathrooms—one male, one female—are located on each floor.\nFree Wi-Fi is available throughout the venue.\nFour public bars—three downstairs, one upstairs—are large and stylish, with mood lighting that blinks softly behind and under the countertop. A fifth bar is stationed in the VIP room.\nThe lobby is sleekly decorated with red and silver couches, where fans can hang before entering the stage area.\nIt will, Conlon hopes, compute to an experience that pays homage while still moving forward.\n“I wanted to bring the brand back,” Conlon said, “and this was the right building and the right time.”\nVENUE PREVIEW\nCoca-Cola Roxy\nAt The Battery Atlanta, 800 Battery Ave. S.E., Atlanta. www.cocacolaroxy.com, 1-800-745-3000.\nBox office hours: TBD.\nUpcoming shows: Glass Animals (Saturday ); Corey Smith (April 22); Lil Wayne (May 8); Bush (May 10); and T.I. (June 18).\nFollow the AJC Music Scene on Facebook and Twitter.","url":"https://www.ajc.com/blog/music/suntrust-park-look-the-new-coca-cola-roxy-venue/q3LcqIxpwRxUtzsfUGQ17K/"}
