{"authors":[],"date_download":"2018-10-30 19:54:16","date_modify":"2018-10-30 19:54:16","date_publish":"2017-04-12 19:56:00","description":"Braves fans Jeff Donahoo and Nikki Hobus had their engagement at SunTrust Park. Sort of. They were thousands of feet above the Cobb County ballpark.","filename":"data/vaneerConsumption/SunTrustParkhasitsfirstproposalanditwasinanairplane.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/12/Images/proposal_1015x635.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_suntrust-park-ha_f8f949a3d52e7d4073f04fe42bcfb3f8__1540929256.html","title":"SunTrust Park has its first proposal - and it was in an airplane","title_page":"SunTrust Park has its first proposal — and it was in an airplane","title_rss":"NULL","source_domain":"ajc.com","text":"It’s like a classic fairy tale:\nBoy and girl eye each other on Twitter. They trade tweets about their favorite baseball team. Girl hopes boy comes to tailgate she’s hosting. Boy does. He asks girl to marry him in an airplane thousands of feet above baseball team’s stadium.\nJeff Donahoo’s proposal, worthy of a fellow Braves megafan like Nikki Hobus, is the first in SunTrust Park’s short history.\n(Yes, smartypants, we KNOOOOW the proposal wasn’t technically inside the stadium, but in Georgia property owners also own the air above their land, so just work with us here.)\nThe tailgate where they met two years ago was at Turner Field, so Donahoo figured he had to do something to make the new stadium special to them, too.\nHe pulled off the surprise 48 hours after coming up with the idea. The 39-year-old was lucky the team was out of town because you can’t get your proposal on the big screen during games.\nHe’d gotten the ring Thursday, but the execution required steps most proposals usually don’t: a pilot, clearance to use Dobbins Air Reserve Base airspace, permission from a MLB team to use their new ballpark and getting the stadium’s graphics department to program the sign.\n“I didn’t really have a backup plan,” he said. “This is the only way I wanted to do it.”\nDonahoo works for an aviation company at DeKalb-Peachtree Airport and has had coworkers take the Acworth couple up for night flights a few times before. So that was the setup.\nHe asked other friends who work for the team if all this was possible. They obliged. As did the military base when he called.\nSo at 8 p.m. Tuesday, Hobus found herself sitting in front of her boyfriend inside a four-seat Cessna 172.\nShe realized they were flying near the new Braves stadium and saw something bright. It was the big screen at the stadium.\nNIKKI...\nWILL YOU MARRY ME?\nShe gasped, Donahoo reached around from behind to show her the ring and she blurted out a yes.\nWhen asked less than 16 hours after the flight if she was surprised, Hobus said: “I was completely shocked ... I didn’t even know what else to think ... I could not have asked for anything better.”\nHobus moved to metro Atlanta from her native Watkinsville a couple years ago to become youth minister at Kennesaw United Methodist Church.\nEvery conversation at church this morning:\nMe: Welcome! So glad you're here today!\nThem: So how was SunTrust Park? — Nikki Hobus (@NikkiHobus) April 2, 2017\nShe’s been on Twitter since February 2011 and a Braves fan her whole life. The 30-year-old often tweets about the team and has caught the attention of other fans.\n“Nikki’s pretty popular on Braves Twitter,” Donahoo said.\nAnd it shows. Her tweet about the proposal has raked in 100 replies, 50 retweets and more than 400 favorites.\nThey’re both season ticket holders. But when asked over the phone if Hobus was the bigger Braves fan, he chuckled and asked his now-fiance who then shouted, “oh, absolutely!”\nThe couple has different versions of what happened after the proposal while they were still in the air circling SunTrust.\nShe says: “I immediately said yes and then stared at the scoreboard for the rest of the [flight].”\nBut to him: “She just stared at her hand the rest of the flight.”\nLike Cobb County News Now on Facebook | Follow on Twitter and Instagram\nWATCH: Another heart-warming Braves couple","url":"https://www.ajc.com/news/local/suntrust-park-has-its-first-proposal-and-was-airplane/aamoh4OzZsjU7vDRjsFoMI/"}
