{"authors":[],"date_download":"2018-10-22 22:43:23","date_modify":"2018-10-22 22:43:23","date_publish":"2014-06-10 22:04:09","description":"The sun unleashed two major solar flares in back-to-back storms, but forecasters don't expect them to have a major geomagnetic impact on Earth.","filename":"data/vaneerConsumption/SunUnleashesTwoXClassFlaresBacktoBack.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/500626/140610-flare2_cd8efdc1a11498dd893b504e9bdbe320.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_sun-unleashes-two-x-class-flares-back-back-n127796_1540248203.html","title":"Sun Unleashes Two X-Class Flares, Back to Back","title_page":"Sun Unleashes Two X-Class Flares, Back to Back","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe sun unleashed two major solar flares early Tuesday in amazing back-to-back storms.\nThe first outburst, an X2.2-class solar flare, hit its maximum at about 7:42 a.m. ET. An X1.5-class flare followed at 8:36 a.m. EDT (1236 GMT). Both flares were capable of causing radio communication blackouts on Earth, according to an alert from the U.S. Space Weather Prediction Center in Boulder, Colorado.\nSign up for top science news direct to your inbox.\nNASA's sun-observing Solar Dynamics Observatory captured a video of the flares from space.\n\"Solar flares are powerful bursts of radiation,\" Karen Fox of NASA's Goddard Space Flight Center said in a statement. \"Harmful radiation from a flare cannot pass through Earth's atmosphere to physically affect humans on the ground. However, when intense enough, they can disturb the atmosphere in the layer where GPS and communications signals travel.\" [Photos: The Biggest Solar Flares of 2014]\nOfficials with the prediction center do not think Earth will experience significant impact from the bursts of plasma sent out by the flare-ups. \"After heavy consideration and analysis of the coronal mass ejections produces as a result of today's X-flare activity, SWPC forecasters are anticipating below G1-Minor geomagnetic storming on 13 and 14 June,\" the center said on its Facebook page.\nBoth flares emanated from the sun's Region 2087, close to the southeastern limb of the solar disk, which is \"not an ideal place to produce significant Earth-directed storming,\" the center said.","url":"https://www.nbcnews.com/science/space/sun-unleashes-two-x-class-flares-back-back-n127796"}
