{"authors":[],"date_download":"2018-10-22 22:49:21","date_modify":"2018-10-22 22:49:21","date_publish":"2014-05-12 20:11:45","description":"With its four-fingered, three-jointed hand, a new robot can catch a ball thrown in its direction in less than five-hundredths of a second.","filename":"data/vaneerConsumption/SuperFastRobotArmCatchesObjectsontheFly.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/437166/140512-science-catching-robot-arm_a7542a0cb60b8a5ee80291b8f08eb5c8.1200;630;7;70;5.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_super-fast-robot-arm-catches-objects-fly-n103516_1540248561.html","title":"Super-Fast Robot Arm Catches Objects on the Fly","title_page":"Super-Fast Robot Arm Catches Objects on the Fly","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Increasingly present in our daily lives and used to perform various tasks, robots will be able to either catch or dodge complex objects in full motion,\" Aude Billard, head of the team at the École polytechnique fédérale de Lausanne (EPFL) that developed the arm, said in a statement. [See Video of Robot Catching Arm in Action]\nTo catch flying objects, a robot must react to unpredictable events and integrate several pieces of information in very little time, the researchers said. Many robots today have preprogrammed behavior, and make calculations that take too long for them to respond in a rapidly changing situation, such as to catch a moving object.\nTo achieve such rapid responses, researchers took inspiration from human learning methods of imitation, and trial and error. They used a technique called \"programming by demonstration,\" in which the robot is not given specific instructions. Instead, researchers manually guided the arm to a catching position several times, until the robot learned to move into position itself.\nThe team tested the arm by throwing several different objects at it: a ball, an empty bottle, a half-full bottle, a hammer and a tennis racket. These objects have different centers of gravity, presenting unique challenges for the robot.\nDuring the first learning phase, the researchers threw objects at the robot several times. The robot used a series of cameras positioned around it to measure the trajectory, speed and rotation of the object in order to model its movement. It then performed a speedy calculation to move itself in the right direction, correcting its trajectory in real time and synchronizing its finger movements to catch the object.\nThe robotic arm is already being used as part of EPFL's Clean-mE project to develop technologies for recovering and disposing of space junk orbiting the Earth, researchers said.\n— Tanya Lewis, Live Science\nFollow Tanya Lewis on Twitter and Google+. Follow us @livescience, Facebook & Google+. Original article on Live Science.","url":"https://www.nbcnews.com/science/weird-science/super-fast-robot-arm-catches-objects-fly-n103516"}
