{"authors":["Ollie Gillman For Dailymail.Com"],"date_download":"2018-10-23 03:18:43","date_modify":"2018-10-23 03:18:43","date_publish":"2016-01-28 18:46:36","description":"Super Bowl adverts will cost an estimated $5million per 30 seconds - up from $4.4million last year - so firms are desperate to maximize what time they can afford with big names.","filename":"data/vaneerConsumption/SuperBowl2016adstofeatureAmySchumerRyanReynoldsandWillemDafoe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/22/30ADC11C00000578-0-image-a-26_1454021092847.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421078_Celebrities-going-huge-Super-Bowl-ads_1540264723.html","title":"Super Bowl 2016 ads to feature Amy Schumer, Ryan Reynolds and Willem Dafoe","title_page":"Super Bowl 2016 ads to feature Amy Schumer, Ryan Reynolds and Willem Dafoe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most watch it for game. Others love the half-time show. But for some, the Super Bowl is all about the ads.\nThis year won't be any different, with companies already putting out teasers of what they have planned for the breaks in the big game next Sunday - and celebrities are going to play a massive role.\nAdverts will cost an estimated $5million per 30 seconds - up from $4.4million last year - so firms are desperate to maximize what time they can afford with big names.\nAmong the stars set to feature are Ryan Reynolds, Kevin Hart, Amy Schumer, Seth Rogen, Serena Williams, Alec Baldwin, Liam Neeson and even Willem Dafoe dressed as Marilyn Monroe.\nScroll down for Super Bowl ad teaser videos\nTeasers have been released for adverts during the Super Bowl next Sunday, including Bud Light's, which stars Amy Schumer and Seth Rogen forming a political party\nBizarre: Snickers' advert has Willem Dafoe singing on a darkened stage while dressed as Marilyn Monroe\nKevin Hart and Ryan Reynolds star in adverts for Hyundai, including this one where two women get distracted by Reynolds\nThe big game between the Denver Broncos and the Carolina Panthers is more than a week away but teasers have already been released for some of the star-studded advertisements.\nBud Light is creating its own fake political party with actors Amy Schumer and Seth Rogen, with the bizarre teaser showing them getting dressed.\nMeanwhile first-time advertiser Amazon's teaser - for its wireless speaker and command gadget, Echo - shows Alec Baldwin and Dan Marino planning a Super Bowl party.\nHyundai's adverts will have Kevin Hart and Ryan Reynolds starring in them, but their teasers did not picture the pair.\nOne, called Ryanville, shows two women stopping their car to ogle at someone, presumably Reynolds.\nBMW Mini have a total of eight adverts on their website, all showing celebrities talking about labels.\nAerosmith front man Steven Tyler will appear in a Skittles ad in what will be the first time Skittles has ever featured a celebrity in a TV commercial\nActor Christopher Walken is in car manufacturer Kia's advert - waiting in a couple's walk-in closet with a pair of beige socks\nStrange: Apartments.com's advert shows rapper Lil Wayne letting a man dressed as George Washington into his house because he has a delivery of bread rolls\nSure to star during the Super Bowl ad breaks is the one containing Serena Williams, with T-Pain and Tony Hawk also likely to feature.\nApartments.com's advert can definitely be filed under strange, with it showing rapper Lil Wayne letting a man dressed as George Washington into his house because he has a delivery of bread rolls.\nMeanwhile Snickers' teaser shows Willem Dafoe singing on stage while dressed as Marilyn Monroe.\nLG's advert stars Liam Neeson, while fellow actor Christopher Walken is in car manufacturer Kia's advert - waiting in a couple's walk-in closet with a pair of beige socks.\nPre-game buzz is crucial this year, with ads costing as much as an estimated $5million for a 30-second spot, up from $4.4million last year.\nThe cost, and risk, is worth it to the advertisers battling it out for the more than 114 million pairs of eyeballs that the Super Bowl is expected to draw on February 7, when the Panthers and the Broncos face off in Levi's Stadium in Santa Clara, California.\nBMW Mini have a total of eight adverts on their website, all showing celebrities such as Serena Williams talking about labels\nLG's advert stars Taken actor Liam Neeson. Adverts during the Super Bowl will set companies back an estimated $5million for 30 seconds\nAmazon's teaser - for its wireless speaker and command gadget, Echo - shows Alec Baldwin and Dan Marino planning a Super Bowl party\nPre-game teasers, which debut online one or two weeks before the game, can help advertisers stretch that investment over weeks instead of seeing it gone in 60 seconds (or even 30).\n'If an advertiser can get people thinking about the brand before the game, the risk goes down and returns go up,' Tim Calkins, a Northwestern University marketing professor, said.\n'A celebrity is a great hook.'\nCompanies also appreciate celebrities' reach on social media, which can help boost online buzz.\n'Celebrities like Kevin Hart are adding thousands of followers a day,' said Dean Evans, Hyundai's chief marketing officer. 'We never know how much organic shares or unearned media (media mentions that aren't paid for) we're going to get from that kind of celebrity and social reach that that celebrity might have.'\nThere are, of course, downsides. A star can sometimes eclipse the brand, or worse, drag it down if people react negatively to a particular celebrity. Last year, T-Mobile's Kim Kardashian ad was a dud on social media, said Devra Prywes, vice president of marketing for research firm Unruly, which monitors Super Bowl ads' online buzz. The famous-for-being-famous celebrity just provoked too much Internet hate to be effective.\n'No matter how carefully you choose a celebrity, they're polarizing,' said Peter Daboll, chief executive of Ace Metrix, a firm that rates the effectiveness of ads. 'Not everybody loves Justin Bieber.'\nWhen there's a good fit between celebrity and a brand, though, the payoff can be huge. Daboll pointed to popular ads by Snickers, which in the past have featured Betty White tossing around a football and character actor Danny Trejo playing a hungry Marcia Brady, an ad that landed in Ace Metrix' list of top 25 Super Bowl ads of the past five years. Snickers has teased a spot this year featuring Willem Dafoe playing Marilyn Monroe.\nBud Light is hoping something similar happens with its ad showcasing Amy Schumer and Seth Rogen. They focused on regular-Joe Bud Light fans in last year's Super Bowl ad, but this year, they went with celebrities to introduce Bud Light's new packaging and logo.","url":"https://www.dailymail.co.uk/news/article-3421078/Celebrities-going-huge-Super-Bowl-ads.html"}
