{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-22 22:42:04","date_modify":"2018-10-22 22:42:04","date_publish":"2016-01-29 09:54:00","description":"In addition to sought-after tickets to America's most-watched event, six guests at Fairmont San Francisco will be treated to plenty of perks, including access to VIP parties attended by celebrities.","filename":"data/vaneerConsumption/SuperBowlpackageofferedfor1millionbyFairmontSanFrancisco.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B1F18000000578-0-image-a-18_1454085717341.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3422353_Super-Bowl-package-offered-1-million-Fairmont-San-Francisco_1540248124.html","title":"Super Bowl package offered for $1 million by Fairmont San Francisco","title_page":"Super Bowl package offered for $1 million by Fairmont San Francisco | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hotel rates in San Francisco have skyrocketed ahead of Super Bowl 50, but none is more expensive than a jaw-dropping package that comes with 22 tickets to the sold-out game.\nFairmont San Francisco is offering its penthouse suite for $1million (£700,000), but the price tag comes with plenty of perks for high rollers who are diehard football fans.\nUp to six guests will be able to mingle with NFL legends and celebrities while they receive VIP treatment from the five-star hotel.\nScroll down for video\nFairmont San Francisco's lavish penthouse suite boasts a terrace with sweeping views of the city and the bay from Nob Hill\nThe $1million hotel package includes accommodation for six people in the 6,000 square foot suite, plus plenty of football-related perks\nIf someone books the ‘Million Dollar Fantasy Big Game 50 Package’, they will be well taken care of when they attend the championship game at Levi’s Stadium, in nearby Santa Clara, on February 7.\nAlthough the package is only for six people, they will receive 22 tickets in a fully-catered suite to watch the Denver Broncos take on the Carolina Panthers.\nThey will also mingle and pose for photos with American football legends, and be given access to exclusive parties attended by celebrities, the hotel said.\nIn addition to highly sought-after tickets to America’s most-watched event, the seven-figure package includes four nights in Fairmont San Francisco’s swanky penthouse suite, where famous guests such as US President John F Kennedy and Prince Charles have stayed previously.\nFootball fans who book the package will stay at a hotel where past guests include US President John F Kennedy and Prince Charles\nThe $1million rate includes luxury transportation to and from the game along with a tailgate party with a chef and bartender from the hotel\nWith three bedrooms, a terrace and 6,000 square feet of luxury, the suite boasts panoramic views of the city and San Francisco Bay from Nob Hill.\nIt also has a formal dining room and kitchen, billiard room, two-storey library with a secret passageway and a lavish living room.\nDuring their stay, the guests will be treated to an open bar and a pantry stocked with their favourite snacks, and each will receive a monogrammed robe and NFL merchandise.\nFairmont San Francisco's penthouse suite also has a formal dining room, billiard room, and two-storey library with a secret passageway\nDenver Broncos quarterback Peyton Manning, who refuses to discuss whether he will retire, is looking for his second Super Bowl title\nThe $1million rate includes ‘luxury transportation’ to and from the game, along with a pop-up tailgate party with a chef and bartender from the hotel.\nThe hotel said $150,000 (£105,000) will be donated to charity in the name of the person who purchases the package.\nGuests will need to pay for transportation to and from San Francisco, but given that they can afford the hefty price tag, it wouldn't be a surprise if they arrived in a private jet.\nHotel room prices have nearly doubled in the days leading up to Super Bowl 50, while homeowners are cashing in through private rentals and websites such as Airbnb.\nFans who are looking to stay near the stadium can expect to pay up to $4,000 (£2,800) a night if they book through Airbnb, while more luxurious properties have been advertised for as much as $10,000 (£7,000) a night.\nThrifty fans can find accommodation for as little as $50 (£35) a night, although it won’t get them a room in a hotel or someone’s home. That’s the rate someone is charging for a tent in their back garden.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3422353/Super-Bowl-package-offered-1-million-Fairmont-San-Francisco.html"}
