{"authors":["Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-22 21:46:58","date_modify":"2018-10-22 21:46:58","date_publish":"2017-03-16 02:02:46","description":"Supermarkets have put their white, wholemeal and grain loaves to the test, separating the wheat from the chaff to find the ultimate breadwinners in Australia.","filename":"data/vaneerConsumption/Supermarketsputbreadtothetesttofindthetoploaves.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E504C1400000578-0-image-a-5_1489629712338.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318100_Supermarkets-bread-test-loaves_1540244818.html","title":"Supermarkets put bread to the test to find the top loaves","title_page":"Supermarkets put bread to the test to find the top loaves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Supermarkets have put their breads to the taste test in an attempt to find the best white, wholegrain and grain loaves.\nCanstar Blue lined up a selection of market leading breads from Aldi, Coles and Woolworths to compare price, taste and freshness.\nAldi's Baker's Life bread, priced at 85c, rose to the top for white loaves after it beat other brands.\nHelga's, costing $3.50, was ranked first place in the wholegrain category - again beating Coles own brand.\nAn independent study found that for white bread, Aldi (left) rose to the top, rating high for freshness, taste and value for money, while Woolworths (right) came in last\nTHE BREAD WINNERS AND LOSERS White Bread First : Aldi's Bakers Life, $0.85. Last: Woolworths home brand, $0.85 Wholegrain Bread First: Helga's, $3.50 Last: Woolworths Wholemeal loaf, $1.90 Grain and Seeded Bread First: Abbott's Village Bakery, $3.50 Last: Woolworths Bread Grain Loaf, $2.90\nJudging by cost, taste and freshness - an independent study asked 3,000 Australians to determine which bread is best.\n'Which products are ticking the boxes for taste, for good texture and really for good value for money,' Simon Downes of Canstar Blue told 9 News.\nHopeful loaves were sorted into three categories: white, wholemeal and grain and seeded bread.\nFor white bread, Aldi's Bakers Life was the top brand, rating high for freshness, taste and value for money at $0.85.\nWoolworths home brand loaf didn't fare so well and trailed in last for their bread, which also cost shoppers $0.85.\nHelga's rated five stares for their wholegrain bread - which will set back shoppers and average of $3.50, beating supermarket giants $1.90 Woolworths and $1.50 Coles, home brands.\nFor grain and seeded bread, Abbott's Village Bakery came first for their $3.50 loaf, again beating Woolworths $2.90 home grown offering which came in last.\nMr Downes acknowledged supermarkets like Coles and Woolworths will be disappointed with the breadwinners.\nBut experts say there are more factors to consider when choosing the best loaf for you.\n'I definitely steer people towards choosing a whole grain bread because that usually has a lower GI but it certainly has all that fibre and nutrients there,' nutritionist Joanna McMillan told 9 News.\nLoaves with low salt levels as well as being high in fibre are also recommended.\nHelga's rated five stares for their wholegrain bread, beating supermarket giants Woolworths and Coles\nMore breadwinners: For grain and seeded bread, Abbott's Village Bakery (left) came first while Helga's (right) rated fives stars for their wholegrain loaf","url":"https://www.dailymail.co.uk/news/article-4318100/Supermarkets-bread-test-loaves.html"}
