{"authors":[],"date_download":"2018-10-22 20:57:45","date_modify":"2018-10-22 20:57:45","date_publish":"2014-05-05 13:09:30","description":"Beginning tomorrow and lasting over the next six weeks, we are going to see a primary race or runoff contest each and every Tuesday.","filename":"data/vaneerConsumption/SuperTuesdaysPrimarySeasonRevsUp.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/420056/senate_north_carolina-jpeg-0a5a3_14e8f4051c6cbb99f9d75cca9e2db22c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_super-tuesdays-primary-season-revs-n97126_1540241865.html","title":"Super Tuesdays: Primary Season Revs Up","title_page":"Super Tuesdays: Primary Season Revs Up ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLet the Super Tuesdays begin (again)\nIt’s time to rev up those 2014 primary engines. Beginning tomorrow and lasting over the next six weeks, we are going to see a primary race or runoff contest each and every Tuesday. Tomorrow (May 6), it’s Indiana, North Carolina, and Ohio. The next week (May 13), it’s Nebraska and West Virginia. After that (May 20), it’s the really big Super Tuesday -- Arkansas, Georgia, Idaho, Kentucky, Oregon, and Pennsylvania. The week after (May 27), it’s the runoffs in Texas. Then the first week of June (June 3), it’s Alabama, California, Iowa, Mississippi, Montana, New Jersey, New Mexico, and South Dakota. And the week after that (June 10), it’s Maine, Nevada, North Dakota, South Carolina, and Virginia. Folks, that’s contests in 25 states -- or half the country. And then even after that, we’ll be seeing primaries on most Tuesdays with just a few exceptions (June 17, July 1, July 8, July 29). So let’s get ready to follow a lot of races over the next three months. And the chief story we’ll be watching is the one we mentioned a couple of weeks ago: How does the Tea Party end up faring, especially by the end of May? Will the movement have any bite left? The supporters of the Tea Party movement seem to be stronger than the organizations that were formed to speak for these folks. And it’s those organizations that are in the crosshairs this month. And if the Tea Party fails to win any major primaries, expect last week’s Washington Post story (about how these Tea Party folks are enriching themselves as much as the candidates they’re supporting) to get a lot more attention.\nThe 2016 GOP proxy fight\nWhat’s especially interesting about tomorrow’s GOP Senate primary in North Carolina is how it’s become a proxy fight among the 2016 potential presidential contenders: Jeb Bush is backing establishment favorite Thom Tillis, Rand Paul is supporting physician Greg Brannon, and Mike Huckabee has endorsed minister Mark Harris. Each of the three parts of today’s Republican Party is represented -- the establishment, the libertarians, and the social conservatives. By the way, Rand Paul today is attending a rally in Charlotte for Brannon. The question is whether this stepped-up activity by Paul helps keep the favored Tillis below the 40% threshold needed to avoid a runoff in July. That will be the storyline to watch tomorrow in North Carolina. Obviously, Democrats are hoping Tillis has to spend a few more weeks defending his right flank rather than making a move to the middle.\nThe Benghazi risk for Republicans\nWe understand why Republicans are again seizing on Benghazi in their effort to establish a select committee in the House to investigate the 2012 terrorist attack there. It fires up the base, puts the Obama administration on the defensive, and allows Republicans to knock likely 2016 candidate Hillary Clinton. (In many ways, the House leadership has no choice since some of their members have spent months claiming it’s one the great scandals of American history; it would be odd if they didn’t attempt to elevate it “special” select committee status.) But our NBC/WSJ poll from last week suggested that this is a riskier move for the GOP than it may realize. According to the poll, 47% of Americans want the United States to be LESS ACTIVE in world affairs, versus just 19% who want it to be more active. This is a country that wants it politicians to focus on the problems at home, not the problems abroad -- or that happened two years ago. And after multiple congressional hearings on the subject, an independent review, and a months-long debate over the administration’s “talking points,” the question becomes: How much more does the public -- outside the GOP base -- want to hear about Benghazi? Does a larger summer focus on Benghazi make the GOP seem out of touch in this election year?\nIs it about substance or politics?\nConservatives have charged that the press has unfairly dismissed the legitimate questions about the 2012 Benghazi attack. What did the Obama administration know and when did it know it? Why wasn’t there better security? And why haven’t the attackers been brought to justice? But the problem these conservatives face is that every time they invoke Hillary Clinton’s name -- especially in the context of 2016 -- the more it looks like a political ploy rather than a substantive quest for information. Indeed, on “Meet the Press” yesterday, Rep. Jason Chaffetz (R-UT) made more references to Hillary Clinton (three) than President Obama or the Obama White House (one) when the subject turned to Benghazi. There’s also a risk here that the GOP repeating its 2013 “Summer of Investigation” -- Benghazi, calling on Attorney General Eric Holder to appoint a special prosecutor in the IRS investigation -- gives off the impression that it doesn’t have a real legislative agenda on jobs, health care, or immigration. Oh, and another Benghazi-related point: House Speaker John Boehner wanting this select committee is more than just placating the right; it’s about taking the issue out of Rep. Darrell Issa’s (R-CA) hands. Don’t miss what House Armed Services Committee Chairman Buck McKeon (R-CA) said about the testimony coming from Issa’s committee last week. “McKeon … called Brig. Gen. Robert Lovell an unreliable witness and criticized Lovell’s assertion that the State Department was not quick to deploy troops to respond to the 2012 terrorist attack in Libya,” Politico writes. Boehner needs to control this more, and a special select committee actually allows him to call more of the shots (and keep Issa out of the spotlight).\nAnd is it about keeping Hillary from running?\nPolitico’s Michael Hirsch makes a final Benghazi-related point: Is all of this simply a way to keep Hillary Clinton AWAY from running in 2016? “Perhaps if the Republicans can’t beat Hillary Clinton fairly in 2016, they can make her so disgusted by the prospect of running that she’ll stay out of the race. That’s where the Benghazi-Industrial Complex comes in. Clinton’s 20-year sojourn in public life has been bracketed, jarringly, by two pseudo-scandals, both involving the tragic and less-than-fully-explained death of an important man in Hillary’s orbit. In between there have been assorted smears and public humiliations, including real traumas like Monicagate, the cumulative effect of which has been to make Hillary reluctant to reenter the political game. Or so many of her friends and aides say, and so Republicans must be hoping.” Then again, if that’s what Republicans are hoping, what does that say about what they think their chances are if she DOES RUN in 2016?\nOn Rick Perry and second chances\nOn “Meet the Press” yesterday, Texas Gov. Rick Perry talked about “second chances” in the context of whether he’ll make another White House run in 2016. “Listen, I think America is a place that believes in second chances,” he told NBC’s David Gregory. “I think that we see more character out of an individual by how do you perform after you fail and you go forward.” And that brings up one of our favorite points to make about successful presidential candidates: They’ve all lost before, and that loss was important on their eventual journey to the White House. Think Reagan’s loss to Ford in ’76. Bush 41’s loss to Reagan in ’80. Bill Clinton’s defeat for re-election as Arkansas governor. Bush 43’s loss in that Texas congressional contest. And Obama’s defeat to Rep. Bobby Rush (D-IL) in 2000. To make it to the White House, you often have to lose first. Of course, that rule can now apply to Hillary Clinton, too (who lost to Obama in ’08)\nLook who was Rand Paul’s guest at the Kentucky Derby\nRupert Murdoch: And also on the 2016 front, don’t miss the story about Rand Paul and his special guest at the Kentucky Derby -- Rupert Murdoch. The New York Times: “For Mr. Paul, the would-be candidate, and Mr. Murdoch, arguably the most powerful broker in Republican politics, Saturday’s day at the races was filled with betting, losing, drinking and a long chat over kettle corn. It was part getting-to-know-you and part political audition, and marked a potential turn in the race for president.” Paul knows he probably isn’t Murdoch’s first choice, but this is the type of campaign Paul seems to be running -- trying to defang some potential critics. He doesn’t need Murdoch’s support to win the GOP nod, but he certainly has a better shot if Murdoch isn’t actively trying to stop him.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/super-tuesdays-primary-season-revs-n97126"}
