{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:33:46","date_modify":"2018-10-30 18:33:46","date_publish":"2016-11-01 18:21:50","description":"A Labour MP has said a long-awaited government inquiry into Britain’s sharia courts is ‘Islamophobic’ and should be dropped.","filename":"data/vaneerConsumption/SupportShariaCourtsandScrapRacistInquiry.json","image_url":"https://media.breitbart.com/media/2016/11/Naz-Shah.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_01__1540924426.html","title":"‘Support’ Sharia Courts and Scrap ‘Racist’ Inquiry","title_page":"Labour MP: ‘Support’ Sharia Courts and Scrap ‘Racist’ Inquiry","title_rss":"NULL","source_domain":"breitbart.com","text":"A Labour MP has said a long-awaited government inquiry into Britain’s sharia courts is ‘Islamophobic’ and should be dropped, proposing the religious legal system should be offered state ‘support’.\nSpeaking ahead of Tuesday’s launch of the Home Affairs Select Committee inquiry Naz Shah, who will give evidence, argued the courts were “complimentary” to British law and were simply “under-resourced”.\nShe also claimed members of the Muslim community had said they thought the inquiry was “Islamophobic and racist”.\nThe MP’s intervention comes as more than 100 Muslim women, lead by the Muslim Women’s Network UK, called for the inquiry to be shut down, arguing it would treat women like “political footballs”.\nMs. Shah, the MP for Bradford West, told BBC Radio 4’s Today programme: “There are issues with Sharia councils, usually they’re under-resourced, there’s not that professional standard.\n“What we need to be doing is supporting the Sharia councils. Sharia councils sometimes are last resorts, where people have lost legal aid, we’ve had austerity kicking in and the courts don’t want to deal with small disputes.\n“So they [Sharia courts] can act as a complimentary arbitration service but what we need to be careful of is that whether they are discriminating against women and that is where the issue lies.”\nThe MP conceded that British law should take precedence over any Sharia rulings and admitted the courts could be used to “oppress” women, but added:\n“However, we need to be clear that we have to look at issues because my measuring yardstick is one woman who suffers discrimination is one too many and so we have to be really balanced in what we’re looking at here, so I welcome the inquiry.”\nBack in May of this year, as she announced the inquiry, then-Home Secretary Theresa May also claimed Muslims in Britain “benefit greatly” from Sharia law.\nOver the weekend, it was reported that evidence submitted to the committee claimed that one of the UK’s leading sharia courts “protects wife-beating suspects by sabotaging criminal proceedings against them”.","url":"https://www.breitbart.com/europe/2016/11/01/labour-mp-support-sharia-courts-scrap-racist-government-inquiry/"}
