{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:46:19","date_modify":"2018-10-30 18:46:19","date_publish":"2015-09-30 16:20:27","description":"Melania Trump: Supports Husband's Campaign To Make America Great Again","filename":"data/vaneerConsumption/SupportsHusbandsCampaignToMakeAmericaGreatAgain.json","image_url":"https://media.breitbart.com/media/2015/09/GettyImages-trumpmelania.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_30__1540925179.html","title":"Supports Husband's Campaign To Make America Great Again","title_page":"Melania Trump: Supports Husband's Campaign To Make America Great Again","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP frontrunner Donald Trump and his wife, Melania, sat down with People magazine to explain their rushed life on the campaign trail.\n“I just don’t have the time that I would love to spend with my children and my wife,” Trump, the father of five said. “I see less of my grandchildren than I might like. But they get how important this is.”\nIn Melania’s first major interview since Trump launched his presidential campaign, she told People that her goal is to support Trump. “My husband is traveling all the time,” she told People. Their son, Barron, “needs somebody as a parent, so I am with him all the time.”\nWhen asked about Trump’s comments, Melania told People she’s “not ready to get political yet.”\n“He is who he is,” she added. “Even if you give him advice, he will maybe take it in, but then he will do it the way he wants to do it. You cannot change a person. Let them be. Let them be the way they are.”\nTrump’s daughter, Tiffany, said her dad speaks clearly. “He’s clear… It’s nice not to have to overanalyze someone’s speech to see what the meaning really is,” she explained.\nTrump’s strategy appears to be working, because he is the frontrunner in every poll since he launched his campaign in June. “When you see you’re number one in every poll, that makes any criticism go away very quickly,” Trump said. “If I’m able to get the nomination, my polling looks very good against Hillary or whoever it may be. I think I’ll win.”\nPeople reported Trump is willing to spend whatever he wants on his campaign, noting that President Obama spent one billion dollars in 2012.\n“It’s a little scary for Barron,” Trump concedes, when asked about the potential future of living in the White House. “He thinks he is going to be taken away from friends. But I tell him if this happens, Daddy will help people, and can help children like him, and that makes him happy.”\nPeople wrote that Melania is “cautiously optimistic.”\n“It’s a long road. I take it day by day,” she told People. “My husband has a lot of people cheering for him. We will see.”","url":"https://www.breitbart.com/politics/2015/09/30/melania-trump-supports-husbands-campaign-make-america-great/"}
