{"authors":["Ken Klukowski"],"date_download":"2018-10-30 17:55:15","date_modify":"2018-10-30 17:55:15","date_publish":"2016-12-01 12:18:01","description":"Federal law requires that aliens who are caught crossing the border are not entitled to a bond hearing during removal proceedings. A separate law passed by Congress mandates that terrorist suspects and certain criminal aliens apprehended anywhere in the country shall not receive a bond hearing. | Politics","filename":"data/vaneerConsumption/SupremeCourtConsidersDueProcessRightsofCriminalandTerroristAliens.json","image_url":"https://media.breitbart.com/media/2016/02/illegal-minors-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_01__1540922115.html","title":"Supreme Court Considers Due-Process Rights of Criminal and Terrorist Aliens","title_page":"Supreme Court Considers Due-Process Rights of Criminal and Terrorist Aliens | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Members of the Supreme Court are considering arguments about the fate of foreigners who commit crimes or are suspected of terrorist acts and are facing deportation.\nThe justices will decide whether the Constitution requires that such suspects must instead be released into the general public while court proceedings are ongoing unless the federal government can present enough evidence to prove how dangerous they are.\nFor decades, the Immigration and Nationality Act passed by Congress requires that when a foreigner attempts to cross the U.S. border, federal agents shall detain that alien unless he is “beyond a doubt” entitled to cross. (In addition to allowing aliens to enter because they present proper documentation for visiting the country, the law also allows for certain emergency and humanitarian reasons to allow foreigners to enter the country on a case-by-case basis.)\nIn most areas of law, a person held by authorities can have a court hearing where the judge determines whether to allow that person to offer money as a bond in exchange for going free until his court date.\nBut not when it comes to immigration. Federal law requires that aliens who are caught crossing the border are not entitled to a bond hearing during removal proceedings. A separate law passed by Congress mandates that terrorist suspects and certain criminal aliens apprehended anywhere in the country shall not receive a bond hearing.\nNonetheless, the U.S. Court of Appeals for the Ninth Circuit held last October that sometimes those sorts of aliens must receive a bond hearing within six months of being detained by federal agents. And then they must get another hearing every six months if not deported during that time. If they are not given that hearing, they must be released without being deported.\nIn Jennings v. Rodriguez, lawyers for criminal and terrorist-suspect aliens brought a class-action lawsuit, arguing that the Constitution’s Due Process Clause from the Fifth Amendment in the Bill of Rights requires thousands of aliens governed by these federal laws to instead be given bond hearings. federal judges can release them indefinitely into the general population.\nIn a case decided in 2003, Justice Anthony Kennedy had written in a concurring opinion that as a general matter due process does not allow for detentions that are unreasonably long. Lawyers for both sides were clearly playing for Kennedy’s vote in this case.\nThe Obama administration found itself in the unusual position of fighting against aliens’ rights, with Acting Solicitor General Ian Gershengorn arguing that Congress made it clear that the federal government should continue to detain these aliens until they can be removed from the country.\nJustice Elena Kagan asked that if “the government just has very, very big backlogs,” could things reach the point where a court could “simply say, well, three years is too long?”\nGershengorn hedged on three years, but said that if it were approaching maybe 20 years that at some point constitutional problems would arise.\nChief Justice John Roberts seemed to push off the idea that this would trigger the Due Process Clause, pointing out that at some point indefinite detention would trigger habeas corpus rights (which are not near as broad as due process, and therefore would not potentially open Pandora’s Box the way due process could).\nJustice Sonia Sotomayor asked the most aggressive questions of Gershengorn, asking “at what point does indefinite, albeit with a lengthy, far-off detention date, become unconstitutional?”\n“What makes it unconstitutional in my mind is the unreasonable delay or detention,” she added.\nJustice Samuel Alito asked questions suggesting that he might think it better if courts were to do case-by-case assessment where foreigners could petition for a writ of habeas corpus if they were detained too long, possibly sharing Roberts’ concerns of the sweeping nature of the High Court handing down a due-process decision in this case.\nKennedy also expressed skepticism regarding the due-process claim, pointing out that this case is a class action representing thousands of aliens, and that in such situations the Court must grant or deny the requested relief to all the members of the class.\nHe seemed to suggest that the different circumstances of different criminal aliens might mean that what is appropriate in one case might not be appropriate in others.\nIt is not entirely clear how the eight-member Supreme Court will decide this case, since the successor to the late Justice Antonin Scalia will not be part of this decision. If the Court ties 4-4 on the case, the justices could vote to rehear the case after a ninth justice is confirmed.\nKen Klukowski is senior legal editor for Breitbart News. Follow him on Twitter @kenklukowski.","url":"https://www.breitbart.com/politics/2016/12/01/supreme-court-considers-due-process-rights-criminal-terrorist-aliens/"}
