{"authors":[],"date_download":"2018-10-22 20:43:27","date_modify":"2018-10-22 20:43:27","date_publish":"2014-06-02 20:44:07","description":"The Supreme Court says the world chemical weapons treaty doesn't really cover a minor thumb burn inflicted by a woman whose husband cheated on her.","filename":"data/vaneerConsumption/SupremeCourtRulesWifesRevengeNotaChemicalWeaponsAttack.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/482491/140602-scotus-carol-anne-bond-1602_03bfcb1a4d9f0f9bcf63600475a5d9b6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_supreme-court-rules-wifes-revenge-not-chemical-weapons-attack-n120656_1540241007.html","title":"Supreme Court Rules Wife's Revenge Not a Chemical Weapons Attack","title_page":"Supreme Court Rules Wife's Revenge Not a Chemical Weapons Attack","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFederal prosecutors went overboard — way overboard — when they used an international chemical weapons treaty to convict a Pennsylvania woman who tried to injure a romantic rival by smearing rash-causing irritants on her door handles and mailbox, the Supreme Court ruled Monday.\nIn a unanimous ruling (PDF) entertainingly written by Chief Justice John Roberts, the court found that the Justice Department didn't really need the Chemical Weapons Convention Implementation Act of 1998 to prosecute \"an amateur attempt by a jilted wife to injure her husband's lover, which ended up causing only a minor thumb burn readily treated by rinsing with water.\"\n\"The notion that some things 'go without saying' applies to legislation just as it does to everyday life.\"\nThe dispute started in 2006 when Carol Anne Bond, a microbiologist, learned that her friend Myrlinda Haynes of Norristown, Pennsylvania, was pregnant with a child from Bond's husband.\nAccording to court documents filed when she conditionally pleaded guilty in 2007, Bond bought potassium dichromate on Amazon.com and stole an arsenic compound.\nThe chemicals soon started showing up on the door handles of Haynes' home and car and on her mailbox. When she burned her thumb, she turned to police, who rebuffed her, so she asked the post office to investigate.\nPostal inspectors placed surveillance cameras around Haynes' home, which caught Bond opening Haynes' mailbox and stealing an envelope and also stuffing potassium dichromate inside the muffler of Haynes' car, according to the case record.\nLocal prosecutors chose to charge Bond only with harassment, at which point the feds stepped in, arguing that Bond \"knowingly\" use a \"chemical weapon\" for something other than \"peaceful purpose.\"\nProsecutors acknowledged that besides being \"almost entirely unsuccessful,\" the attempted assaults were intended only to cause Haynes to \"develop an uncomfortable rash.\" But the law's the law, they contended.\nBond pleaded guilty to possessing and using a chemical weapon and mail theft, reserving her right to appeal the weapons conviction on the ground that prosecutors improperly used Congress' ratification of the international treaty on the wartime use of chemical weapons to prosecute a local assault.\nThe Supreme Court agreed, saying, in essence, that smearing the equivalent of itching powder on someone's doorknob wasn't envisioned in the \"years of worldwide study, analysis, and multinational negotiation ... in response to war crimes and acts of terrorism\" that gave rise to the treaty.\n\"No speaker in natural parlance would describe Bond's feud-driven act of spreading irritating chemicals on Haynes's door knob and mailbox as 'combat,'\" Roberts wrote.\n\"The notion that some things 'go without saying' applies to legislation just as it does to everyday life,\" he wrote.","url":"https://www.nbcnews.com/news/crime-courts/supreme-court-rules-wifes-revenge-not-chemical-weapons-attack-n120656"}
