{"authors":["Nate Raymond"],"date_download":"2018-10-30 23:38:53","date_modify":"2018-10-30 23:38:53","date_publish":"2016-12-06 00:00:00","description":"The U.S. Supreme Court ruled against Bassam Salman, who was appealing a 2013 conviction stemming from federal charges that he had committed insider trading.","filename":"data/vaneerConsumption/SupremeCourtdecisiononBassamvSalmaninsidertrading.json","image_url":"https://amp.businessinsider.com/images/5846ebc1ba6eb634008b7b7b-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_supreme-court-decision-on-bassam-v-salman-insider-trading-2016-12_1540942733.html","title":"Supreme Court decision on Bassam v Salman insider trading","title_page":"    Supreme Court decision on Bassam v Salman insider trading - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Preet Bharara, U.S. Attorney for the Southern District of New York, speaks during a news conference in New York Thomson Reuters (Reuters) - The U.S. Supreme Court, ruling in an insider trading case for the first time in two decades, on Tuesday upheld a Chicago man's conviction in a decision that could make it easier to prosecute people accused of profiting from confidential information.\nThe justices, in an 8-0 decision, ruled against Bassam Salman, who was appealing a 2013 conviction stemming from federal charges that he made nearly $1.2 million trading on non-public information that came from his brother-in-law at Citigroup Inc.\nSalman had argued that prosecutors in insider trading cases must prove that an alleged source of corporate secrets like the brother-in-law received a tangible benefit like cash in exchange for any tips, something his brother-in-law did not receive.\nSuch proof, prosecutors have said, would make it more difficult for authorities to pursue insidertrading cases, potentially preventing cases in which executives tip friends or relatives without any getting anything tangible in return.\nWriting for the court, though, Justice Samuel Alito said the court rejected Salman's arguments, ruling that friends and family members could be held liable even if a tipper provides inside information as a \"gift.\"\n\"In such situations, the tipper benefits personally because giving a gift of trading information is the same thing as trading by the tipper followed by a gift of the proceeds,\" Alito wrote.\nA lawyer for Salman did not immediately respond to a request for comment. The U.S. Justice Department declined comment.\nProsecutors said Maher Kara, a Citigroup investment banker and Salman's brother-in-law, provided tips about deals involving Citi clients to Kara's brother, who in turn tipped Salman.\nA federal jury in San Francisco in 2013 found Salman guilty of conspiracy and securities fraud charges, and he was sentenced to three years in prison.\nThe Supreme Court heard Salman's appeal on Oct. 5 amid competing rulings by federal appeals courts in San Francisco, where his case was heard, and New York, where a wave of insidertrading prosecutions has been pursued recently.\nThe New York-based 2nd U.S. Circuit Court of Appeals in 2014 overturned the conviction of two hedge fund managers, Todd Newman and Anthony Chiasson, and narrowed prosecutors' ability to pursue such cases in the process.\nThat ruling adopted a narrow definition of what constituted an illegal benefit to an insider, and forced prosecutors under Manhattan U.S. Attorney Preet Bharara to drop charges against 12 other defendants, out of 107 people charged since 2009.\nSalman had relied on the 2nd Circuit's ruling to argue that he could not be convicted because no proof existed that Kara received anything beneficial in return.\nThe San Francisco-based 9th U.S. Circuit Court of Appeals rejected that position. And in Thursday's ruling, Alito said that to the extent the 2nd Circuit's ruling could be read that way, the holding was \"inconsistent\" with Supreme Court precedent.\nThe case is Salman v. United States, U.S. Supreme Court, No. 15-628.","url":"https://www.businessinsider.com/supreme-court-decision-on-bassam-v-salman-insider-trading-2016-12"}
