{"authors":["Associated Press"],"date_download":"2018-10-23 00:06:31","date_modify":"2018-10-23 00:06:31","date_publish":"2016-01-11 08:32:38","description":"The Supreme Court is hearing arguments in a case that challenges the right of public-employee unions to collect fees from public sector workers who disagree with the unions' political positions.","filename":"data/vaneerConsumption/SupremeCourtcouldsounddeathknellforpublicsectorlaborunions.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:6baf24acbf984024a138a472bb597f7f-56CX32zFKLb7123928b84cc5e23d-761_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393546_High-court-hear-dispute-public-sector-union-fees_1540253191.html","title":"Supreme Court could sound death-knell for public-sector labor unions","title_page":"Supreme Court could sound death-knell for public-sector labor unions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Supreme Court dispute over public-sector union fees could sap the finances of organized labor and further erode the power of the nation's labor movement.\nThe justices hear arguments Monday in a case that challenges the right of public-employee unions to collect fees from teachers, firefighters and other state and local government workers who choose not to become members.\nA group of California public school teachers claims that such mandatory fees violate the First Amendment rights of workers who disagree with the union's positions.\nTheir lawsuit against the California Teachers Association seeks to overturn a nearly four-decade-old Supreme Court precedent that allows public unions to collect 'fair share' fees from non-members to help cover the costs of collective bargaining.\nRebecca Friedrichs sued on behalf of public school teachers who claim mandatory union fees violate the First Amendment rights of workers who disagree with the union's political positions\nThe Supreme Court ruled in the 1977 case, Abood v. Detroit Board of Education, that states can require non-members to pay the fees as long as the money doesn't go to political causes.\nThe court said the arrangement prevents non-members from becoming 'free riders' who get all the benefits of union bargaining and grievance procedures without paying for it.\nBut the high court has raised serious doubts about the rationale of Abood in two recent cases. It has stopped short of overturning it both times, but four justices joined a 2014 opinion by Justice Samuel Alito that called Abood 'questionable.'\nAlito said it is now harder to draw the line between collective bargaining and political ends.\nThe California teachers argue that unions have become more political over time.\nThey say even a push for higher salaries and pension benefits raises political questions about the best use of tax dollars for cash-strapped localities.\nThe unions argue that the First Amendment applies differently to public employees performing their jobs.\nThey assert that the state has a strong interest in promoting efficiency and avoiding costly workplace disruptions by designating the union as the exclusive bargaining representative for workers.\nThe case also threatens to unravel thousands of contracts around the country that were negotiated relying on the four-decade-old system.\nA federal district court ruled against the teachers, saying the outcome was clear under Abood. The 9th U.S. Circuit Court of Appeals affirmed.\nThe U.S. Supreme Court will hear Friedrichs' case on Monday and could deal a decisive blow to teachers' unions if she prevails\nHalf the states already have right-to-work laws banning mandatory fees, but most members of public-employee unions are concentrated in states that don't, including California, New York and Illinois.\nLabor officials fear that union members will leave in droves if they realize they can get all the benefits of representation without paying for it.\nUnion advocates say the lawsuit is part of a conservative agenda to weaken powerful labor unions, known for reliably supporting Democratic candidates and policies.\nThe teachers are backed by the conservative Center for Individual Rights.\nFor decades, the growth of union workers in government has helped compensate for steep losses in manufacturing, construction and other private industries where unions once thrived.","url":"https://www.dailymail.co.uk/news/article-3393546/High-court-hear-dispute-public-sector-union-fees.html"}
