{"authors":[],"date_download":"2018-10-22 20:57:55","date_modify":"2018-10-22 20:57:55","date_publish":"2014-05-05 13:44:04","description":"The justices turned away challenge to a New Jersey law that sharply restricts the authority to carry a handgun in public.","filename":"data/vaneerConsumption/SupremeCourtDeclinestoConsiderGunRightsCase.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_supreme-court-declines-consider-gun-rights-case-n97176_1540241875.html","title":"Supreme Court Declines to Consider Gun-Rights Case","title_page":"Supreme Court Declines to Consider Gun-Rights Case","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Supreme Court declined again Monday to take up a hotly contested issue of gun rights that has divided the nation's federal and state courts.\nThe justices turned away challenge to a New Jersey law that sharply restricts the authority to carry a handgun in public.\nIn 2008, the Supreme Court ruled that the Second Amendment guarantees the right to possess a gun at home for self-defense. Since then, the lower courts have split over the nature of gun rights outside the home, but repeated efforts to get the issue back before the Supreme Court have so far failed.\nThe New Jersey law at issue Monday requires proof of a justifiable need to carry a gun, defined as \"the urgent necessity for self-protection, as evidenced by specific threats or previous attacks which demonstrate a special danger to the applicant's life.\"\nAmong the challengers was a Sussex County man, John Drake, who services and restocks ATM's — a job that requires him to carry large amounts of cash. His application for a permit to carry a gun was denied.\n\"In practice, few ordinary people can hope to obtain a New Jersey handgun carry permit,\" said Drake's lawyer, Alan Gura of Virginia, in legal papers that urged the Supreme Court to take the case.\nAround the time the legal challenge was launched, Gura said, about 1,200 permits had been issued in a state with an adult population of nearly seven million.\nBut New Jersey's acting attorney general, John Hoffman, defended the law as part of a careful grid of gun regulations.\nThe state legislature, he said in his court brief, \"long ago made the predictive judgment that widespread carrying of handguns in public would not be consistent with public safety because of the inherent danger it poses.\"","url":"https://www.nbcnews.com/news/us-news/supreme-court-declines-consider-gun-rights-case-n97176"}
