{"authors":["Bob Holt Tom Murphy"],"date_download":"2018-10-30 01:24:36","date_modify":"2018-10-30 01:24:36","date_publish":"2018-09-02 00:00:00","description":"Chad Morris said he expects both tight end Jeremy Patton and defensive tackle Briston Guidry to return this season after both players had surgery this week.","filename":"data/vaneerConsumption/Surgeriescompletefor2Hogs.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/02/HOGS_vs_EIU_BG_088_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_04_surgeries-complete-for-2-hogs-20181004__page=1_1540862676.html","title":"Surgeries complete for 2 Hogs","title_page":"Surgeries complete for 2 Hogs","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas defensive lineman Briston Guidry (7) is blocked by Eastern Illinois offensive lineman Johari Branch (64) during a game Saturday, Sept. 1, 2018, in Fayetteville. - Photo by Ben Goff\nFAYETTEVILLE -- University of Arkansas Coach Chad Morris said he expects both tight end Jeremy Patton and defensive tackle Briston Guidry to return this season after both players had surgery this week.\nPatton's surgery was on his ankle, which he bent badly the wrong way while trying to plant and catch a first-quarter pass in Saturday's 24-17 loss to Texas A&M.\n\"We anticipate him being back,\" Morris said.\nMorris was asked whether the loosened redshirt rules might help Patton get another year of eligibility, even though he was injured after playing two plays into his fifth game.\n\"That would be something we'd have to go in and look and see,\" Morris said. \"Now with them changing the rule that may be a moot point. We would have to go back in and look at it. But we are hoping to get him back.\"\nMorris said Guidry had cleanup work done on a previous knee injury.\n\"He'll be back in a couple of weeks,\" Morris said.\nStarting tailback Devwah Whaley, who still has not been cleared after suffering a concussion at Auburn two weeks ago, is doubtful this week, Morris said.\nTight end Cheyenne O'Grady, who was out with strep throat Tuesday, returned to Wednesday's practice in shoulder pads and shorts while wearing a green (limited contact) jersey.\nIn other injury news, Morris said center Dylan Hays -- the projected starter before undergoing back problems in camp -- has been granted a medical hardship and is done with football. The hardship allows Hays to have his schooling paid for but frees up the scholarship for the Razorbacks to use elsewhere. Hays is the third Arkansas offensive lineman to receive a medical hardship in the past year, joining Jake Heinrich and Jalen Merrick.\nBack in the day\nArkansas Coach Chad Morris said he was a high school coach in Texas when he first met Alabama Coach Nick Saban.\n\"He recruited my school several times when I was coaching high school ball,\" Morris said.\nMorris said Saban was \"just what you see now\" as a recruiter.\n\"Very intense and understanding of what he wants,\" Morris said. \"A great evaluator of talent. Knows exactly what fits his style.\"\nFull class\nChad Morris said Wednesday night on his radio show that the Razorbacks are targeting a full signing class of 25 this year. He added that his projected number of signees on the early signing date of Dec. 19 is as many as 22 or 23. The Razorbacks landed eight players in last year's December signing class, the first year of the new recruiting calendar.\n'Chiz'-dom\nFormer Auburn coach and current ESPN analyst Gene Chizik touched on the state of Arkansas football during his presentation at the Northwest Arkansas Touchdown Club on Wednesday.\n\"I know the expectations at Arkansas should be very high, but you've got to walk before you can run,\" Chizik said.\nChizik added that first-year Coach Chad Morris is having to implement a \"complete culture change\" and that recruiting must \"go to the next level\" for the Razorbacks to return to contender status.\nChizik said he was most impressed by how the Razorbacks responded to their 17-0 deficit against Texas A&M last week.\n\"It was an amazing, amazing feat of guys digging their cleats in and digging their heels in and saying 'no,' \" Chizik said. \"Next thing, you look up in the fourth quarter and it's a one-possession game with a chance to win at the end. Now the downside is you have absolutely no chance of that happening this week [against No. 1 Alabama].\n\"No offense. But I'm an analyst, and I've got to tell it the way I see it.\"\nEnos insider\nAlabama Coach Nick Saban jumped at the chance to hire former Arkansas offensive coordinator Dan Enos away from Michigan, where Enos had worked for about a month without a specific title after departing with the rest of the Bret Bielema staff.\nEnos has one of the best position groups in the country under his tutelage with Alabama quarterbacks Tua Tagovailoa and Jalen Hurts. Saban was defensive coordinator at Michigan State in 1987 when Enos was the Spartans' scout team coach.\n\"He's always been a very bright guy and had great competitive character,\" Saban said. \"I followed him when he was head coach at Central Michigan and happened to play against him when he was at Arkansas the last few years.\n\"We were always very challenged by the system and scheme and things they did. I thought their offense was always really well coached. I guess I've always had a high opinion of him, but playing against him you develop an even greater respect for how they're doing what they do.\"\nBryant pursuit\nESPN analyst Gene Chizik was asked at the Northwest Arkansas Touchdown Club whether it would be a good idea for Arkansas to pursue \"the young man from Clemson,\" in reference to transfer quarterback Kelly Bryant.\n\"I think it would be wise to recruit the young man from Clemson,\" said Chizik, drawing bouts of laughter. \"Kelly Bryant is really, really good. Trevor Lawrence must be extraordinary to beat out Kelly Bryant.\"\nBryant led Clemson to the College Football Playoff in 2017 during his first year as a starter. Lawrence beat him out for the starting job after Clemson started 3-0 this year, and Bryant has received his transfer papers.\n\"If it's me and I'm anywhere in the country, and I'm running the offense that suits Kelly Bryant -- which Chad Morris absolutely does -- I'm all over it,\" Chizik said. \"I'm all over it. I'm pushing all of my chips in with that guy.\"\nTackle question\nAlabama preseason All-SEC left tackle Jonah Williams, who sprained an ankle against Louisiana-Lafayette last week, returned to practice Wednesday in preparation for Arkansas.\n\"We think he'll be able to play in the game, but it's probably a little bit of a question mark right now,\" Tide Coach Nick Saban said. \"I think he has played very well. I think he is one of the best players at his position.\"\nWilliams, a junior, is 6-5 and 300 pounds.\n\"I don't get to evaluate everybody else, so it's hard to make comparisons, but I think he's a smart player,\" Saban said. \"Always knows what to do, how to do it and why it's important to do it that way. Always prepares very well for every game.\"\nQuick score\nAlabama leads the nation with 12 touchdown drives of less than one minute. That figure is three ahead of Utah State, which ranks second with nine such scoring drives, followed by Penn State, Memphis and Massachusetts with eight each.\nThe Crimson Tide also have five touchdown drives that have taken less than 30 seconds.\nKicker struggles\nIf there's one area in which Alabama doesn't excel, it's kicking.\nJoseph Bulovas and Austin Jones have combined to hit 5 of 9 field goals, including 3 of 7 inside 40 yards.\nIn last week's 56-14 victory over Louisiana-Lafayette, Bulovas missed from 24 and 31 yards.\nNow a team just needs to make field goals matter against Alabama, which has beaten its five opponents by an average of 44.6 points.\n\"Joseph is very capable,\" Alabama Coach Nick Saban said. \"I think he hit both balls well, he just didn't finish exactly right. Maybe his focus wasn't what it needed to be, but he has been making progress.\"\nBulovas, a redshirt freshman, is 4 of 7, including 4 of 5 against Texas A&M, with a long of 47 yards.\nSports on 10/04/2018","url":"https://www.arkansasonline.com/news/2018/oct/04/surgeries-complete-for-2-hogs-20181004/?page=1"}
