{"authors":["Associated Press"],"date_download":"2018-10-23 01:06:15","date_modify":"2018-10-23 01:06:15","date_publish":"2017-03-10 08:44:09","description":"TOKYO (AP) - On a World Baseball Classic high, Israel will be aiming to extend its unexpected run at the tournament when it arrives in Tokyo for the second...","filename":"data/vaneerConsumption/SurprisingIsraelpreparesfor2ndroundatWBC.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/14/wire-196303-1489154681-404_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300404_Surprising-Israel-prepares-2nd-round-WBC_1540256775.html","title":"Surprising Israel prepares for 2nd round at WBC","title_page":"Surprising Israel prepares for 2nd round at WBC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - On a World Baseball Classic high, Israel will be aiming to extend its unexpected run at the tournament when it arrives in Tokyo for the second round after winning its first three games in Seoul.\nTeam Israel beat 2009 silver medalist South Korea 2-1, Taiwan 15-7 and a Netherlands team that included such bona fide major leaguers as Didi Gregorius, Xander Bogaerts and Jonathan Schoop by a score of 4-2.\nIsrael will begin the second round against Cuba on Sunday at Tokyo Dome looking to go 4-0. The top two teams advance to the March 20-22 championship round at Dodger Stadium.\nIsrael's pitcher Josh Zeid celebrates his team's victory against Netherlands after the first round game of the World Baseball Classic at Gocheok Sky Dome in Seoul, South Korea, Thursday, March 9, 2017. (AP Photo/Ahn Young-joon)\nIsrael manager Jerry Weinstein is making sure to tone down the rhetoric for a team making its first appearance in the WBC.\n\"We're not ruled by other people's expectations,\" Weinstein said. \"The expectations outside and the expectations inside that locker room are a lot different. The most important expectations are the players. We know who we are and the other people really don't.\"\nJust 41st in the world rankings, Israel is the lowest-ranked team in the tournament and has caught everyone by surprise.\nIsrael's roster is made up almost entirely of Jewish-American players with major or minor league experience. Some of the familiar names include veteran pitcher Jason Marquis, formerly of the Cincinnati Reds, and catcher Ryan Lavarnway, who has MLB experience with Boston, Baltimore and Atlanta.\nAfter Cuba, Israel will face the Netherlands on Monday before taking on Japan on Wednesday.\nChicago White Sox reliever Brad Goldberg will join the team in Tokyo. Goldberg picked up two saves for Israel in the qualifiers in Brooklyn in September.\nAfter losing to Japan in its opening game, Cuba's bats have come alive.\nOutfielder Alfredo Despaigne hit a grand slam in the fifth inning on Friday as Cuba beat Australia 4-3 to book its place in the second round.\nIsrael's third base coach Pat Doyle, right, passes by his team mascot, The Mensch on the Bench, during at the first round game of the World Baseball Classic at Gocheok Sky Dome in Seoul, South Korea, Thursday, March 9, 2017. (AP Photo/Ahn Young-joon)","url":"https://www.dailymail.co.uk/wires/ap/article-4300404/Surprising-Israel-prepares-2nd-round-WBC.html"}
