{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:40:04","date_modify":"2018-10-22 21:40:04","date_publish":"2018-08-13 00:00:00","description":"Afghanistan's military was launching a counteroffensive aimed at flushing militants out of the strategically vital city of Ghazni, which was attacked on Friday.","filename":"data/vaneerConsumption/SurpriseTalibanAttackLeadsToDaysOfFightingHundredsOfDeaths.json","image_url":"https://media.npr.org/assets/img/2018/08/13/gettyimages-1016007780_wide-b7948b05e28f4eddadd447e1de08c7b9d8d894c7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_13_638194440_surprise-taliban-attack-leads-to-days-of-fighting-hundreds-of-deaths_1540244404.html","title":"Surprise Taliban Attack Leads To Days Of Fighting, Hundreds Of Deaths","title_page":"Surprise Taliban Attack Leads To Days Of Fighting, Hundreds Of Deaths : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Surprise Taliban Attack Leads To Days Of Fighting, Hundreds Of Deaths\nEnlarge this image toggle caption Mohammad Anwar Danishyar/AFP/Getty Images Mohammad Anwar Danishyar/AFP/Getty Images\nThe Taliban's surprise attack Friday on the city of Ghazni has now killed around 100 members of Afghanistan's police and security forces and between 20 and 30 civilians, Afghan officials said Monday.\nA U.S. military spokesman told NPR's Diaa Hadid that some 140 Taliban insurgents have also died – meaning the fighting has already cost nearly 300 lives since the Taliban launched its assault. Afghan officials differed in their account, saying nearly 200 Taliban fighters have been killed.\nThe Afghan military was launching a counteroffensive aimed at flushing Taliban militants out of Ghazni, a strategically important city that sits on a major highway less than 100 miles southwest of Kabul — and between the capital and Kandahar.\nSince the Taliban attacked the city on Friday, its fighters have taken control of some areas and have tried to entrench themselves in defensive positions.\n\"The ministers of Interior and Defense said despite the high death tolls, Afghan forces had reclaimed parts of the city,\" Hadid reports from Islamabad. \"They said fighting was slow because insurgents were holed up in mosques and people's homes — but another 1,000 troops were sent to Ghazni for reinforcements.\"\nAfghan officials said their forces will strike the Taliban from all four sides of the city. The casualty report they issued Monday was the first official tally of the human toll since the fighting began four days ago.\nSome 270,000 people live in Ghazni — and they're caught in an increasingly dangerous situation, says Dr. Rik Peeperkorn, acting U.N. humanitarian coordinator for Afghanistan.\n\"Medication at the main hospital is reportedly becoming scarce and people are unable to safely bring casualties for treatment,\" Peeperkorn said in a statement released Monday. \"Main access roads both north and south of the city to larger cities where medical facilities are available are contested and unsafe for people to travel.\"\nPeeperkorn urged all sides in the fighting to respect medical missions. He added that the city's electricity and water supply have had problems, and that food supplies were reportedly running low.\nIn addition to Ghazni's importance for the central government, its namesake province in eastern Afghanistan has long been considered a stronghold of the Taliban, as it straddles the group's supply routes to and from Pakistan.\nFor the U.S. military, Ghazni province was a key front in 2012 in what was billed as the Americans' last major combat offensive of the Afghan War.\nIn 2015, Taliban fighters stormed a prison in Ghazni province, \"freeing more than 350 inmates, nearly half of whom have been deemed especially dangerous,\" as NPR's Scott Neuman reported.\nThat 2015 assault is believed to have freed a number of local Taliban commanders.","url":"https://www.npr.org/2018/08/13/638194440/surprise-taliban-attack-leads-to-days-of-fighting-hundreds-of-deaths"}
