{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 21:08:10","date_modify":"2018-10-22 21:08:10","date_publish":"2016-01-11 00:24:32","description":"Surrey Roads Policing Unit has revealed some of the excuses used by drivers caught using their phones on the road. Officers drove along the M25 and M27 in Surrey for the nine day operation.","filename":"data/vaneerConsumption/Surreypolicerevealbizarreexcusesofdriverscaughtonmobilephones.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/00/1FA3F22900000578-0-image-a-33_1452471728482.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393147_Police-reveal-bizarre-excuses-drivers-caught-mobiles-including-trying-Shazam-song_1540242490.html","title":"Surrey police reveal bizarre excuses of drivers caught on mobile phones","title_page":"Surrey police reveal bizarre excuses of drivers caught on mobile phones | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A police force has released some of the unbelievable excuses used by drivers caught using their phones on the road, including - 'I have a new girlfriend and our song came on the radio, so I had to call her.'\nSurrey Roads Policing Unit has revealed the ludicrous explanations in a bid to raise awareness of the dangers of driving with a mobile phone.\nOne distracted driver, who was pulled over by officers, told them: 'I was only looking at a photo - drivers using their mobiles really annoys me.'\nAnother motorist caught in the act claimed they liked the song they were listening to and were trying to identify it on the mobile app SHAZAM, which tells listeners the name of a song while it is playing.\nThe driver said: 'I'm so sorry, I like this song and was trying to find it on SHAZAM.'\nIn a nine day operation, officers drove along the M25 and M27 in Surrey in an unmarked HGV vehicle to catch motorists in the act of committing offences.\n'I was only looking at a photo', 'I was trying to find a song on SHAZAM', 'I have a new girlfriend and our song came on the radio' - some of the excuses used by drivers caught on their phones (file photo)\n'Operation Tramline' focused on drivers who displayed poor habits such as not wearing seatbelts, careless and dangerous driving, and using mobile phones.\nThe height of the HGV tractor unit used by police allowed officers a better view of drivers, who they filmed committing offences.\nAs well as mobile phone use, other shocking behaviour observed by police included a lorry driver using his phone to watch TV, and drivers with their laptops open and in use.\nOne lorry driver was caught with no hands on the wheel while driving - because he was reading a map.\nThe height of the unmarked HGV gave officers a better view of drivers who were holding their phones below the height of the window - which may otherwise not have been visible from a lower vehicle.\nSergeant Sharon Kingston, who led the operation, said: 'Some of the excuses our officers were given were unbelievable and goes to show that unfortunately there are a lot of people who still do not give driving the full attention it needs.\n'Every single offence officers saw could quite easily have resulted in a serious injury or a fatality.\n'Next time you think of using your phone or distracting yourself while driving by some other means then think of the family who could be without their loved one because of your actions.'\nSergeant Kingston said that the aim of the operation was to reduce the number of collisions on the roads.\nShe added: 'The impact a collision can have should not be underestimated and goes way beyond the initial incident.\n'Police officers not only stop drivers who are committing these offences, but they will also be the ones dealing with the fatal road traffic collisions, delivering death messages and supporting the families of those who have tragically lost loved ones.\n'This should be a reminder to all motorists that they should always drive appropriately, not just when they see a marked police car, as there may well be an officer in an unexpected vehicle driving alongside them.\n'I hope this reassures the public that we are acting upon their concerns about road safety and we are taking positive action and using different approaches to change driving behaviour.'","url":"https://www.dailymail.co.uk/news/article-3393147/Police-reveal-bizarre-excuses-drivers-caught-mobiles-including-trying-Shazam-song.html"}
