{"authors":[],"date_download":"2018-10-30 14:23:18","date_modify":"2018-10-30 14:23:18","date_publish":"2014-07-14 00:00:00","description":null,"filename":"data/vaneerConsumption/SurrealintheMiddleEastHamassHumanShields.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_07_surreal_in_the_middle_east_hamass_human_shields_comments_1540909398.html","title":"Surreal in the Middle East: Hamas's Human Shields","title_page":"Articles: Surreal in the Middle East: Hamas's Human Shields","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hamas terrorists continued firing rockets indiscriminately at Israel for the sixth day, and Israel continued its efforts to counter with its anti-missile Iron Dome shield, along with coordinated systematic surgical air strikes directed against select Hamas terrorist sites. Yet most of the international media’s focus of the conflict continues to be one-sided, aimed at limited Palestinian civilian casualties and critical of Israel’s defense actions to protect it civilian population. As with previous assaults and conflicts orchestrated by an array of regional Islamic terrorist groups against Israel, not much attention is being paid to the way Hamas uses its own Palestinian citizens as human shields, or its deliberate and intentioned strikes on Israeli civilian neighborhoods and population centers. Hamas sees the use of human shields as a win-win, since if the tactic deters an Israeli response, its fighters and weapons will be safe, and if Israel does respond,... (Read Full Article)","url":"https://www.americanthinker.com/articles/2014/07/surreal_in_the_middle_east_hamass_human_shields_comments.html"}
c, few in the mainstream media find it necessary to be critical and report on Hamas’s efforts both to encourage Palestinians to unknowingly serve as human shields and to directly and deliberately target Israeli areas of population – many of which, by the way, consist of Jews, Muslims, and Christians.\nIn order to better understand the rationale for Hamas’s intent and purpose, it is necessary to look at the covenant and charter of the Islamic Resistance Movement, otherwise known as HAMAS, which was issued on August 18, 1988. This is an extremist fundamentalist Islamic organization operating in the territories under Israeli control. As a reminder, the U.S. State Department placed Hamas on its Foreign Terrorist Organizations list in 1997, on par with al-Qaeda, which was added to the list two years later. Hamas’ Covenant is a comprehensive manifesto comprising 36 separate articles, all of which promote the basic HAMAS goal of murdering Jews and those who support and ally with Israel, and with the ultimate goal of destroying the State of Israel through jihad (Islamic holy war). Historically, by way of its charter, we should also be aware that Hamas is an affiliate of the Muslim Brotherhood. That, of course, will not be what you hear from left-of-center media and sympathetic foreign policy experts and organizations, who are busily drafting and refining their narratives on Hamas and the Muslim Brotherhood in an effort to portray them as moderate political groups who have renounced violence and are really nothing for us to be very concerned about. Unfortunately, the stubborn fact is that Hamas is the most prominent of the Brotherhood’s Palestinian branches, whose operations long predated Hamas and brought Hamas, aka the Islamic Resistance Movement, into being. Hamas is identified as a “wing of the Muslim Brotherhood,” according to the Hamas Charter, which also calls for the “murder” of Jews, the “obliteration” of Israel, and Israel's replacement with an Islamist theocracy otherwise known as a caliphate. With regard to current conflict between Hamas and Israel, in contrast to that of Hamas’s actions, are those of the Israel Defense Forces, or the IDF – whose modus operandi and rules of engagement are to issue advanced warnings to Palestinians living in and around Hamas missile launcher locations and sites as well as Hamas command, control, logistics, and operations facilities and centers throughout in Gaza strip. Israel’s warnings come by way of direct phone calls to residents and building occupants; radio, TV, and internet alerts identifying exact addresses and time-frames of defensive strikes; and information disseminated regarding the type of Hamas target in a respective building, such as “a Hamas battalion mortar team on the 2nd floor balcony of your apartment.\" But having decided to escalate another round of violence by launching hundreds of rockets into Israel, Hamas is still hoping to use the presence of its own Palestinian civilians living and in some cases placed intentionally around legitimate military targets, with the specific intent to be used as propaganda weapons against the Jewish state. As Israel has stepped up its efforts to spare civilians casualties, even as it seeks pinpoint tactics to silence the Hamas terrorist fire, Hamas has also increased its efforts to ensure that as many inhabitants of Gaza as possible are hurt in the fighting. To do so, Hamas leaders have called on Palestinians, particularly women and children, to ignore Israel’s pre-attack warnings to evacuate their homes and neighborhoods. Hamas leaders and even Islamic clerics have gone as far as to tell their people not to listen to the Israeli announcements, because the Israelis are after all lying. In fact, the Hamas-run Palestinian Authority’s Interior Ministry said in an on-air TV announcement to Gaza residents this week that Israeli’s warning messages \"are designed to weaken our resolve and to sow panic and fear among us, in light of the failures of our enemies. We call on all Gaza residents not to pay attention to these messages and not to leave their homes.\" Another example of this was noted this past Tuesday, when Hamas’s Al Aqsa TV in Gaza aired the group’s spokesperson, Sami Abu Zuhri, urging the population of the Gaza strip to refuse to heed warnings and to use their bodies to shield Hamas facilities: [T]his attests to the character of our noble, Jihad-fighting people, who defend their rights and their homes with their bare chests and their blood. The policy of people confronting the Israeli warplanes with their bare chests in order to protect their homes has proven effective against occupation. Also, this policy reflects the character of our brave, courageous people. We in Hamas call upon our people to adopt this policy, in order to protect the Palestinian homes. The cynicism of this tactic is transparent, but even though Hamas is making no secret of its intentions, international media news reports about the conflict remain centered on the “disproportionate” use of force used by Israel and the contrast between Palestinian and Israeli casualty figures. It is true that Hamas’s weaponry is no match for the sophisticated Israeli missile defense system known as the Iron Dome, created to shield civilians from rocket fire from Gaza. It is a defensive system; it does not kill people, whether friend or foe. Nevertheless, the media continue to remind us that Palestinians have no Iron Dome system to protect them against Israeli counter-strikes against Hamas and Islamic Jihad missile and rocket sites. Thus, it is assumed that the war between Israel and Hamas is not a fair fight. In this manner, Hamas, cheered on by the so-called “moderate” Palestinians like Palestinian Authority leader Mahmoud Abbas, who accused Israel of “genocide” in its attacks on Gaza, reinforces the idea that it is a “David” fighting the Jewish “Goliath.” The notion that Israel faces challenges in what is a classic case of asymmetrical warfare is a given in this conflict. The Palestinians have perpetuated this war by continually refusing to make peace and recognize the legitimacy of a Jewish state, no matter where its borders are drawn. They are also attempting to manipulate Western public opinion into believing their version of the conflict, in which they falsely portray Israel as a “colonial” power occupying another people’s land rather than admitting that the dispute is part of an existential struggle aimed at wiping out the one Jewish state on the planet. The lopsided casualty figures bolster these specious talking points. In the modern information war, Hamas’s human shield tactics have given its leaders a winning strategy, even if the results are a tragedy for its own people. But the problem with those who draw superficial conclusions from the daily casualty figures and body counts is not just that they don’t understand what Hamas is doing to inflict as much pain and suffering on their own people as they can. It’s that these numbers obscure the basic point of the conflict. Hamas is not seeking to end the occupation of Gaza or the West Bank, or to force Israel to draw its borders differently. Hamas’s purpose is to destroy Israel and kill as many Jews as it can – it is Hamas’s goal and its purpose for existence. When they speak of “resistance” it is not an effort to push back against particular Israeli policies, but a refusal to accept the permanence of the return of the Jews to their land. The misleading blood feud narrative adopted by Hamas's supporters and sympathizers in response to the carnage may seem even-handed. But there should be no mistake about the fact that Hamas’s human shields of Gaza are merely a ploy aimed at diverting the world from the truth about their intentions. Jim Waurishuk is a retired USAF colonel and a 30-years career senior intelligence and political-military affairs officer, with expertise in strategic intelligence, international strategic studies and policy, and asymmetric warfare. He served as deputy director for intelligence for U.S. Central Command (USCENTCOM) during the peak of the wars in Afghanistan and Iraq and the War on Terrorism fr0m 2004-2007. He is a former White House National Security Council staffer and former distinguished senior fellow at the Atlantic Council, Washington, D.C.","url":"https://www.americanthinker.com/articles/2014/07/surreal_in_the_middle_east_hamass_human_shields.html"}
