{"authors":["Press Association"],"date_download":"2018-10-22 20:02:37","date_modify":"2018-10-22 20:02:37","date_publish":"2016-01-29 00:05:51","description":"Graham Ford has left Surrey after two years at the Kia Oval to rejoin Sri Lanka as head coach. The 55-year-old South African previously coached Sri Lanka from 2012 until 2014.","filename":"data/vaneerConsumption/SurreysufferbigblowascoachGrahamFordquitsinordertotakeupSriLankarole.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/0EC22A3700000514-0-image-a-47_1454025906280.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3421960_Surrey-suffer-big-blow-coach-Graham-Ford-quits-order-Sri-Lanka-role_1540238557.html","title":"Surrey suffer 'big blow' as coach Graham Ford quits in order to take up Sri Lanka role","title_page":"Surrey suffer 'big blow' as coach Graham Ford quits in order to take up Sri Lanka role | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Graham Ford has left Surrey after two years at the Kia Oval to rejoin Sri Lanka as head coach.\nThe 55-year-old South African previously coached Sri Lanka from 2012 until 2014, before taking over the reins at Surrey.\nFord was instrumental in bringing Kevin Pietersen and Kumar Sangakkara to the club, and last season guided Surrey to the second division title in the County Championship and the Royal London One-Day Cup final, where they were beaten by Gloucestershire.\nGraham Ford has left Surrey after two years at the Kia Oval to rejoin Sri Lanka as head coach\nSurrey director of cricket Alec Stewart admitted that losing Ford was a big blow, especially with the new county season less than three months away.\n'We are extremely disappointed to be losing Graham Ford, who has not just been an outstanding head coach but has played an integral role in the progress that we have achieved over the last two years,' he said in a statement on the club's official website.\nFord was instrumental in bringing Kevin Pietersen and last season guided Surrey to the second division title\nSurrey director of cricket Alec Stewart admitted that losing Ford was a big blow\n'He has worked tirelessly with the players and his efforts can be seen in their individual performances and the team's results, culminating in promotion back to the first division.\n'It was a very tough decision for Graham to leave Surrey but we understand that the opportunity to go back and coach at international level with Sri Lanka was too good to turn down.","url":"https://www.dailymail.co.uk/sport/cricket/article-3421960/Surrey-suffer-big-blow-coach-Graham-Ford-quits-order-Sri-Lanka-role.html"}
