{"authors":["Trent Baker"],"date_download":"2018-10-30 20:49:43","date_modify":"2018-10-30 20:49:43","date_publish":"2015-11-20 19:27:15","description":"Surveillance Videos Show Teacher's Last Moments Allegedly Before Being Murdered by Student","filename":"data/vaneerConsumption/SurveillanceVideosShowTeachersLastMomentsAllegedlyBeforeBeingMurderedbyStudent.json","image_url":"https://media.breitbart.com/media/2015/11/chism.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_11_20__1540932583.html","title":"Surveillance Videos Show Teacher's Last Moments Allegedly Before Being Murdered by Student","title_page":"Surveillance Videos Show Teacher's Last Moments Allegedly Before Being Murdered by Student | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Jurors in the trial of a Massachusetts teenager accused of killing his high school math teacher were shown surveillance footage of the teen following the teacher into the school bathroom just mere moments before her death.\nThe video shows then-14-year-old Philip Chism, with the hood of his jacket partially covering his face, following Colleen Ritzer as she walked alone in the hallway and into the a bathroom of Danvers High School on October 22, 2013.\nThe now 16-year-old is accused of killing Ritzer, 24, with a box cutter in a girls’ bathroom at the school. Chism pleaded not guilty to aggravated rape, robbery and murder charges in January. He is now being tried as an adult.\nRitzer, whose body was found a day after the murder in a recycle bin in the woods, was found with a slashed throat and to have been raped with an object, authorities said. A handwritten note was found next to her body, reading “I hate you all,” according to court documents.\nChism’s attorney argued his client was going through a psychotic episode, but he was found earlier this month competent to stand trial.\n“He was severely mentally ill,” Chism’s attorney, Denise Regan, explained Monday. “He had been suffering from a psychiatric disorder since the age of 10.”\n(h/t Fox4KC)\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2015/11/20/surveillance-videos-show-teachers-last-moments-allegedly-before-being-murdered-by-student/"}
