{"authors":["Bill Chappell"],"date_download":"2018-10-23 05:17:21","date_modify":"2018-10-23 05:17:21","date_publish":"2014-10-14 00:00:00","description":"A survey of people in 148 countries finds that those in Latin America are least likely to say women who live there are treated with respect and dignity, ranking below the Middle East.","filename":"data/vaneerConsumption/SurveyLatinAmericaRanksLastInRespectForWomen.json","image_url":"https://media.npr.org/assets/img/2014/10/14/LatinAmericaSurvey1_wide-42332fc1c6a4fb27afef5773c88efad873b62219.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_10_14_356111652_survey-latin-america-ranks-last-in-respect-for-women_1540271841.html","title":"Survey: Latin America Ranks Last In Respect For Women","title_page":"Survey: Latin America Ranks Last In Respect For Women : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Survey: Latin America Ranks Last In Respect For Women\nEnlarge this image toggle caption Raul Arboleda/AFP/Getty Images Raul Arboleda/AFP/Getty Images\nFor the second consecutive year, a wide survey found people in Latin America are the least likely to say they live in countries where women are treated with respect and dignity, ranking below the Middle East and North Africa.\nThe Gallup survey found a wide range of opinions within Latin America: while 63 percent of respondents in Ecuador said women get respect, only 20 percent said the same in Peru and Colombia.\nEnlarge this image toggle caption Gallup Gallup\n\"A median of 35 percent of adults across 22 Latin American countries said their women are treated [with respect] — about half as high as percentages in any other region of the world,\" Gallup says.\nAsia ranked highest in the survey, with 76 percent saying women are respected. Europe wasn't far behind in second place, with 72 percent. The survey was conducted among thousands of people in some 150 countries in 2012 and 2013.\nUpdate at 5 p.m. ET: The U.S. Results\nResponding to a request for more information, Gallup says that in the U.S., 77 percent of respondents said women are treated with respect and dignity.\nOur original post continues:\nEcuador was the only Latin American nation where more than 60 percent of respondents said women were respected, a result that Gallup's analysts attribute to new laws and awareness campaigns. It's one of just five countries in the region where more than 50 percent said women are treated with respect.\nThe survey also found an interesting disparity: In some countries, men were far more likely than women to say that women are respected. The widest gap was in Jamaica, where men were more than twice as likely to say women were respected (41 percent to 19 percent). Argentina had the second-largest gap (50 percent to 36 percent).\n“Do you believe women in this country are treated with respect and dignity, or not?” % Yes % No % Don't Know Ecuador 63 35 2 Uruguay 57 38 5 Venezuela 54 43 3 Mexico 54 43 4 Panama 51 45 4 Suriname 47 49 4 Costa Rica 45 49 5 Argentina 43 54 3 Nicaragua 42 57 1 Chile 38 60 3 Haiti 37 59 4 El Salvador 32 63 5 Honduras 31 68 2 Dominican Republic 30 68 1 Jamaica 30 66 4 Bolivia 28 69 3 Paraguay 27 72 1 Brazil 27 69 4 Guatemala 27 72 1 Trinidad & Tobago 25 66 9 Colombia 20 78 2 Peru 20 76 4\nGallup says its survey was conducted through face-to-face interviews with around 1,000 people in 19 Latin American countries, and 500 in three others.","url":"https://www.npr.org/sections/thetwo-way/2014/10/14/356111652/survey-latin-america-ranks-last-in-respect-for-women"}
