{"authors":["Associated Press"],"date_download":"2018-10-23 01:59:04","date_modify":"2018-10-23 01:59:04","date_publish":"2016-01-29 16:16:04","description":"WASHINGTON (AP) — American consumers lost some confidence this month after the stock market tumbled and the economy showed signs of weakness, the University ...","filename":"data/vaneerConsumption/SurveyUSconsumerconfidenceslipsinJanuary.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:b6c41d3d6f714d14b46b22e6c2613dfd-4PuZeKVXE7cd9005b2c876c1f62e-571_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422980_Survey-US-consumer-confidence-slips-January_1540259944.html","title":"Survey: US consumer confidence slips in January","title_page":"Survey: US consumer confidence slips in January | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Survey: US consumer confidence slips in January\nWASHINGTON (AP) — American consumers lost some confidence this month after the stock market tumbled and the economy showed signs of weakness, the University of Michigan said Friday.\nThe university's index of consumer sentiment slipped to 92 in January from 92.6 last month. A year ago, the index stood at 98.1.\nRichard Curtin, chief economist for Michigan's surveys, blamed a drop in stocks that caused an \"an erosion of household wealth, as well as weakened prospects for the national economy.\"\nIn this Wednesday, Jan. 20, 2016, photo, a shopper strolls down the street in Carytown, a stretch of shops and restaurants a few miles west of downtown Richmond, Va. On Friday, Jan. 29, 2016, the University of Michigan issues its monthly index of consumer sentiment for January. (AP Photo/Steve Helber)\nThe Dow Jones industrial average has dropped more than 6.5 percent so far this year, largely on fears that China's slowing economy is dragging down global growth. And the U.S. government reported Friday that the U.S. economy expanded at an anemic 0.7 percent annual pace from October through December.\n\"Consumers anticipate that the growth slowdown will be accompanied by smaller wage gains and slight increases in unemployment by the end of 2016,\" Curtin said.\nHe noted that the massive snowstorm that hit the East Coast last week appeared to have had no impact on consumers' spirits.\nConsumers' assessment of current economic conditions dimmed in January, compared to December; their outlook for the future was unchanged.\nLaura Rosner, economist at BNP Paribas, said in a research note that the Michigan survey showed \"a somewhat less healthy, though still elevated, level of consumer optimism.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3422980/Survey-US-consumer-confidence-slips-January.html"}
