{"authors":["Andy Dolan","Christian Gysin","Emily Kent Smith For The Daily Mail"],"date_download":"2018-10-23 00:37:30","date_modify":"2018-10-23 00:37:30","date_publish":"2016-01-28 14:41:21","description":"The winner has chosen to remain anonymous, but it is not grandmother-of-four Susanne Hinte, 48, of Worcester, (pictured) who said she had washed the winning ticket in her jeans.","filename":"data/vaneerConsumption/SusanneHintecouldbeprosecutedasNationalLotterywinnercomesforward.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B0955500000578-0-image-a-2_1454056471241.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421068_Winner-comes-forward-REAL-winning-ticket-33million-Lotto-jackpot-s-NOT-woman-claimed-s-wash_1540255050.html","title":"Susanne Hinte could be prosecuted as National Lottery winner comes forward","title_page":"Susanne Hinte could be prosecuted as National Lottery winner comes forward | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Miss Hinte claimed to have winning ticket but had put it in washing machine\nThis means it could not have been grandmother Susanne Hinte, 48\nThe grandmother who said she had accidentally put a £33million lottery ticket through her washing machine could now face prosecution after the true winner claimed the jackpot.\nLottery organiser Camelot announced that, after days of speculation, the lucky ticket-holder had finally announced themselves, but wished to remain anonymous. Camelot has now warned it could take action if it suspected anyone of attempting to 'defraud the National Lottery'.\nThis rules out Susanne Hinte as Camelot does not pay out on damaged tickets till after its six-month claim deadline.\nHinte poses in front of her washing machine after claiming her winning £33million ticket was ruined in there\nThe winner of the £33m jackpot has chosen to remain anonymous, but it is not grandmother-of-four Susanne Hinte, 48, of Worcester, (right) who said she had washed the winning ticket in her jeans\nThe news sparked calls for the 48-year-old – who has not been seen since Saturday – to be prosecuted over her production of a crumpled lottery ticket on which the ‘winning’ numbers were virtually the only information still legible.\nAs neighbours accused her of attempting fraud, Camelot left the door open to taking action against anyone who had tried to fraudulently claim the outstanding £33,035,323. Earlier this week, it said it would act if it thought someone had ‘intentionally attempted to defraud the National Lottery’. It received hundreds of claims in addition to Miss Hinte’s.\nShula de Jersey, a criminal lawyer at firm Slater and Gordon, said an intentional attempt to make a fake claim could be deemed ‘fraud by false representation’, an offence with a maximum ten-year jail sentence.\nMiss Hinte, who moved to the UK from her native Germany at 19, was at the centre of the hunt for the winner after it emerged last weekend that the ticket was bought in Worcester.\nShe claimed she laundered the ticket in her jeans after buying it at a newsagent’s near her home in the suburb of Warndon.\nMs Hinte's photocopied ticket. The draw date has been obliterated by a tear. The barcode at the bottom and the ticket's ID number have also been ruined. The numbers, however, were still visible\nHer past was described last night by the daughter of an ex-boyfriend. Charlotte Payne, 24, lived at Miss Hinte’s home six years ago for around 12 months, when her father was going out with the would-be Lotto winner.\nMiss Payne, from Walsall, West Midlands, said: ‘Susanne had a shiny steel pole in the bedroom … She was quite open about working as a dancer in the past.’\nHer father has confirmed he was once in a relationship with Miss Hinte. Last night there was no answer at Miss Hinte’s semi-detached home or at the home of her daughter Natasha Douglas, 28.\nHinte sent a lorry driver topless snaps soon after getting in contact with him on an internet dating site\nGrandmother-of-four Ms Hinte, of Worcester, said she had washed the winning ticket in her jeans - and sent her crumpled and torn piece of paper to Camelot to be verified\nMiss Hinte claimed to have bought the ticket at Ambleside News in Warndon, Worcester, which was used during a publicity campaign by Camelot as lottery bosses tried to track down the winner. But it became apparent that she was not the real winner when Camelot declined an offer from owner Natu Patel (pictured) to be sent the video of her apparently buying the ticket\nCOUNTDOWN TO THE BIG WIN January 9 - The draw for the record-breaking Lotto jackpot of £66million is made. Two tickets match the winning numbers of 26, 27, 46, 47, 52 and 58. January 13 - David and Carol Martin, both 54, from Hawick, Scotland, announced they had one of the winning tickets to the £3,035,323 prize. January 21 - Camelot announce the holder of second ticket bought it in Worcester. Ambleside News is used by TV crews as one shop where customers are checking tickets. January 22 - Susanne Hinte walks into Ambleside News near her home in Warndon, Worcester, and presents a tatty ticket she claims was damaged in a washing machine. January 24 - Ms Hinte's family claim she is the winner but faces agonising 180 day for Camelot to confirm her win. January 28 - Camelot announce a winning ticket holder has come forward and confirm Ms Hinte is not a winner.\nA neighbour of Miss Hinte said she hoped the former prison custody officer and barmaid would be prosecuted for her claim. Susan Gormley, 70, said: ‘I didn’t think for one minute that she had won it. She’s never been truthful … I think she should go to court … I was hoping she had won so she’d move.’\nDozens took to social media calling for Miss Hinte to be prosecuted. Rachel Smith wrote on Facebook ‘she should be done for fraud’.\nMiss Hinte has had court appearances for non-payment of fines, failing to reveal a driver’s identity and failure to pay her TV licence. She is facing two trials in March for theft and motoring offences.\nWest Mercia Police said it could investigate only if it received a complaint from Camelot over a deception allegation. A National Lottery spokesman declined to comment last night on whether would be referring Miss Hinte’s case to police.","url":"https://www.dailymail.co.uk/news/article-3421068/Winner-comes-forward-REAL-winning-ticket-33million-Lotto-jackpot-s-NOT-woman-claimed-s-wash.html"}
