{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:43:31","date_modify":"2018-10-30 18:43:31","date_publish":"2016-06-27 20:07:28","description":"White House National Security advisor Susan Rice had some strong opinions to share on whether working women could “have it all,” a successful career and be a great mother.","filename":"data/vaneerConsumption/SusanRiceTellsWomenCriticstoShutUp.json","image_url":"https://media.breitbart.com/media/2015/03/Susan-Rice-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_27__1540925011.html","title":"Susan Rice Tells Women Critics to 'Shut Up'","title_page":"Susan Rice Tells Women Critics to 'Shut Up'","title_rss":"NULL","source_domain":"breitbart.com","text":"White House National Security advisor Susan Rice had some strong opinions to share on whether working women could “have it all,” a successful career and be a great mother.\nDuring a conversation at the Aspen Ideas Summit moderated by The Atlantic‘s David Bradley, Rice was asked if she believed former State Department employee Anne Marie Slaughter’s famous argument (penned in The Atlantic) that career women could not have it all.\n“I have a very strong view on this topic, which is women should just shut up and let everybody else live their own lives and not tell anybody else how to do it because everybody’s experience is different,” Rice replied bluntly.\nShe pointed to her own career as an example, noting that her husband was an executive producer at ABC News when she was working for President Barack Obama as the United States Ambassador to the United Nations. She admitted that her frequent trips to New York City and her husband’s work producing a network Sunday show made life difficult for them.\nHer husband, she explained, retired in 2011 and stayed home with their children.\n“That was a choice that he made and that we made together,” she said, admitting that the decision made it much easier for her to serve the Obama administration as the U.S. ambassador to the United Nations and later as the president’s National Security advisor.\n“I really do have the greatest husband in the world,” she said.\nRice also appeared to dismiss a book on the issue by Facebook’s Sheryl Sandberg, titled Lean In: Women, Work, and the Will to Lead.\n“Whether you lean in or lean out or stay at home or give up your career and come back to it, that is in my view the most personal of decisions and there’s no cookie-cutter answer to this,” she said, pointing to the variety of circumstances that women lived with. “We just have to respect each other’s choices. There are no wrong choices in this enterprise.”","url":"https://www.breitbart.com/politics/2016/06/27/susan-rice-tells-women-critics-to-shut-up/"}
