{"authors":["Australian Associated Press","Leith Huffadine For Daily Mail Australia"],"date_download":"2018-10-22 23:05:13","date_modify":"2018-10-22 23:05:13","date_publish":"2016-01-29 10:45:34","description":"Susan Gristwood, wife of Order of Australia member Doctor Ronald Gristwood, has been fined $10,500 and banned form having cattle after 29 emaciated cows and six dead cows were found on her land.","filename":"data/vaneerConsumption/SusanGristwoodfinedafter29emaciatedandsixdeadcowsfoundonherproperty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B12E2100000578-0-image-a-3_1454063594388.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422247_Woman-fined-10-000-29-emaciated-six-dead-cows-property_1540249513.html","title":"Susan Gristwood fined after 29 emaciated and six dead cows found on her property","title_page":"Susan Gristwood fined after 29 emaciated and six dead cows found on her property | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The wife of an Order of Australia member has been fined $10,500 after 29 emaciated and lice-infested cows, and a further six dead cows were found on her property.\nIn the Adelaide Magistrates Court on Friday, Susan Gristwood, wife of surgeon Doctor Ronald Gristwood, was sentenced after earlier pleading guilty to animal cruelty charges and was fined and banned from keeping cattle.\nMagistrate Susan O'Connor said Gristwood's offending was 'callous' and she had 'steadfastly' refused to assist with an investigation, the ABC reported.\nOne of the emaciated cows that were discovered by an RSPCA inspector and seized\nThe pneumonia she was suffering from at the time could not explain her 'high-handed approach to those intent on putting an end to animal cruelty'.\nThe malnourished and in some cases dead animals, as well as 11 calves were found on a property south of Adelaide in 2014 and seized by RSPCA inspectors.\nThose animals that were already dead were in various stages of decay.\nOf the animals seized, one had to be put down, but the others recovered with care and put on weight.\nGristwood had allowed the cows to be 'inadequately' fed for three months and made little effort to fix the issue.\nA RSPCA inspector had to chase her at one point, eventually locating her at her husband's offices, the ABC reported.\nA magistrate called Gristwood's offending 'callous' and said she refused to assist in an investigation into the animal cruelty\nRSPCA South Australia chief inspector Andrea Lewis said the fine was 'reasonable' given that the suffering of the cows could have easily been remedied.\n'This case serves to demonstrate that anyone who owns any animals, whether they be livestock or companion animals, has full responsibility under the Animal Welfare Act to ensure the animals are adequately cared for, and all their needs are met,' she said.\nA spokeswoman for RSPCA SA told Daily Mail Australia the group was always pushing for tougher sentencing for animal cruelty.\n'In the context of the offence the maximum penalty would have been $20,000.'\nThe ban from having any other cattle was pleasing, she said.","url":"https://www.dailymail.co.uk/news/article-3422247/Woman-fined-10-000-29-emaciated-six-dead-cows-property.html"}
