{"authors":["Associated Press"],"date_download":"2018-10-23 04:37:28","date_modify":"2018-10-23 04:37:28","date_publish":"2016-01-29 20:20:13","description":"KANSAS CITY, Mo. (AP) — The suspended University of Missouri assistant professor who was charged with assault linked to a November run-in with two student jo...","filename":"data/vaneerConsumption/SuspendedMissouriprofessorreachesdealinassaultcase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423253_Suspended-Missouri-professor-reaches-deal-assault-case_1540269448.html","title":"Suspended Missouri professor reaches deal in assault case","title_page":"Suspended Missouri professor reaches deal in assault case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Suspended Missouri professor reaches deal in assault case\nKANSAS CITY, Mo. (AP) — The suspended University of Missouri assistant professor who was charged with assault linked to a November run-in with two student journalists during campus protests reached a deal Friday with prosecutors, getting community service but no jail time or fines if she stays out of trouble for a year.\nColumbia city prosecutor Steve Richey said he decided to forego pursuing the misdemeanor assault case against assistant communications professor Melissa Click, whom he said has pledged no further illegal behavior for a year and to complete 20 hours of community service.\nIf Click fails to comply, \"prosecution of the case will resume at that point,\" Richey said in a statement, adding that he believes \"this disposition to be appropriate.\" Click was charged Monday and could have faced up to 15 days in jail, if convicted.\nClick, who is seeking tenure with the university, did not respond to an email seeking comment Friday. Her university voicemail was full, and her home number was disconnected.\nThe university system's governing board of curators suspended Click on Wednesday and ordered an investigation by its general counsel to determine whether additional discipline \"is appropriate,\" board chairwoman Pam Henrickson said in a statement.\nA message regarding whether Friday's action would affect the suspension was left with Hendrickson's law office.\nClick had a confrontation with a student photographer and a student videographer during the Nov. 9 protests at the Columbia campus over what some saw as university leadership's indifference to racial issues. Click called out to recruit \"some muscle\" from protesters she hoped would help remove the videographer, Mark Schierbecker.\nThat same day, the president of the four-campus University of Missouri system and the Columbia campus' chancellor resigned over the unrest.\nClick later said publicly she regretted her actions. She also apologized to Schierbecker, all journalists and the university community for detracting from the students' efforts to improve the racial climate on the Columbia campus.\nSchierbecker said Friday that Richey notified him by email of the deal with Click shortly before it was made public.","url":"https://www.dailymail.co.uk/wires/ap/article-3423253/Suspended-Missouri-professor-reaches-deal-assault-case.html"}
