{"authors":["Abc News","Armando Garcia","Victor Oquendo","Kaitlyn Folmer","Aaron Katersky","More Meghan","More Armando","More Victor","More Kaitlyn","More Aaron"],"date_download":"2018-10-30 00:50:10","date_modify":"2018-10-30 00:50:10","date_publish":"2018-10-29 10:00:12","description":"Cesar Sayoc is alleged to have sent at least 14 explosives in packages.","filename":"data/vaneerConsumption/SuspectedmailbomberCesarSayochadalistofnamesandaddresses.json","image_url":"https://s.abcnews.com/images/US/cesar-sayoc-court-sketch-02-ap-jc-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_suspected-mail-bomber-ce_d094c9a4200eafd254ceeb04ebdbca42_story_id=58826045_1540860610.html","title":"Suspected mail bomber Cesar Sayoc had a list of names and addresses","title_page":"Suspected mail bomber Cesar Sayoc had a list of names and addresses - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The FBI has compiled a list of names and addresses found in the possession of suspected mail bomber Cesar Sayoc.\nInterested in Mail Bomb Investigation? Add Mail Bomb Investigation as an interest to stay up to date on the latest Mail Bomb Investigation news, video, and analysis from ABC News. Add Interest\nThe belief is these were people -- including politicians, media figures and celebrities -- to whom he was considering sending additional devices.\nThe FBI is now notifying everyone on that list, per the FBI’s so-called \"duty to warn\" policy of notifying people who are the subjects of threats of violence.\nFederal officials had previously warned that additional improvised explosive devices still could be traveling through the mail system.\nThere were 14 suspicious packages discovered last week that were linked to Sayoc, who was arrested on Friday and charged with five federal crimes.\nSayoc appeared in court today in Florida and was seen talking and smiling with his lawyers.\nDaniel Pontet via AP\nFlanked by his newly retained three private attorneys, Dan Aaronson, James Scott Benjamin and Peter Patanzo, Sayoc appeared in a federal courthouse in Miami Monday afternoon.\nSporting a tan jumpsuit with a bright orange undershirt, he seemed engaged with his lawyers and very talkative – often smiling.\nWhen Magistrate Judge Edwin Torres addressed Sayoc, he nodded and spoke softly into the microphone. The government is asking to detain him before the trial, leading the judge to set a detention hearing for Friday Nov. 2. For now, removal proceedings are delayed.\nAttorney General Jeff Sessions announced Friday that Sayoc was charged with five federal crimes: interstate transportation of an explosive, illegal mailing of explosives, threats against former presidents and certain other persons, threatening interstate communications and assaulting current and former federal officers.\nBroward County Sheriffs Office via AP\nAll told, those charges could lead to a maximum of 48 years in prison.\nSayoc has not yet entered a plea.","url":"https://abcnews.go.com/US/suspected-mail-bomber-cesar-sayoc-smiling-court-appearance/story?id=58826045"}
