{"authors":["Associated Press"],"date_download":"2018-10-23 01:38:22","date_modify":"2018-10-23 01:38:22","date_publish":"2017-03-10 09:59:07","description":"BERLIN (AP) - German crime scene specialists are searching for evidence at an apartment in the western city of Herne where the body of a man was found,...","filename":"data/vaneerConsumption/SuspectinboyskillingarrestedGermanpolicecombscene.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195185-1489139954-131_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300642_Suspect-boys-killing-arrested-German-police-comb-scene_1540258702.html","title":"Suspect in boy's killing arrested; German police comb scene","title_page":"Suspect in boy's killing arrested; German police comb scene | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - German crime scene specialists are searching for evidence at an apartment in the western city of Herne where the body of a man was found, believed to be the second victim of a 19-year-old suspected of earlier killing a boy.\nThe suspect, Marcel Hesse, was arrested after a four day manhunt late Thursday at a fast food stall in the city west of Dortmund.\nHe had been sought after police allege he killed a 9-year-old neighbor and posted gruesome images of the slain child online.\nA police vehicle stands in front of a destroyed roller shutter that hangs from a burnt out apartment window in Herne, western Germany, Friday, March 10, 2017. German police say they have arrested a 19-year-old man suspected of killing a 9-year-old boy in the western city of Herne and posting pictures of the victim's body on the internet. Officers made the arrest after the man called from a fast food stall and reported a fire in a nearby apartment, where police later found another male body. (Marcel Kusch/dpa via AP)\nWhen he was picked up, he told police of a fire in a nearby apartment. Police found the body of an adult male there.\nProsecutor Paul Jansen told the dpa news agency Friday that Hesse gave a statement to authorities after his arrest.\nA fast food establishment is pictured in Herne, Germany, Friday, March 10, 2017. Police said they have arrested a 19-year-old man suspected of killing a 9-year-old boy in the western city of Herne and posting pictures of the victim's body on the internet. Officers made the arrest after the man called from the fast food stall and reported a fire in a nearby apartment, where police later found another male body. (Marcel Kusch/dpa via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4300642/Suspect-boys-killing-arrested-German-police-comb-scene.html"}
