{"authors":[],"date_download":"2018-10-22 21:57:40","date_modify":"2018-10-22 21:57:40","date_publish":"2014-06-06 21:28:54","description":"A police affidavit says Aaron Rey Ybarra confessed to the shooting spree and intended to kill as many people as he could before killing himself.","filename":"data/vaneerConsumption/SuspectedGunmanAaronYbarraAdmitsSeattleCollegeRampagePolice.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/493671/140606-aaron-ybarra-1813_36cf43f18db0f81dedd630848665b75b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_suspected-gunman-aaron-ybarra-admits-seattle-college-rampage-police-n124931_1540245460.html","title":"Suspected Gunman Aaron Ybarra Admits Seattle College Rampage: Police","title_page":"Suspected Gunman Aaron Ybarra Admits Seattle College Rampage: Police","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe man accused of carrying out a deadly shooting spree at a Seattle college confessed to the rampage and told authorities he planned to kill as many as possible — but he's now \"sorry\" for what happened, police and his attorney said Friday.\nAaron Rey Ybarra, 26, was ordered held without bond pending an arraignment next week on a count of premeditated murder and a count of assault in the incident Thursday at Seattle Pacific University. One person was killed and three others were wounded, one of them critically.\nRamona Brandes, Ybarra's public defender, read a statement saying her client has suffered from mental illness for years and was \"delusional\" on Thursday.\n\"I do not know at this point in time why Mr. Ybarra's illness brought him to Seattle Pacific University, but I can tell you that he does now recognize the suffering of the victims and the families, as well as the entire Seattle Pacific University community, and he is sorry for their pain,\" Brandes said.\nYbarra, who lives with his parents in the northern Seattle suburb of Mountlake Terrace, admitted walking into the lobby of the engineering and math hall at Seattle Pacific shortly after 3 p.m. (6 p.m. ET) Thursday and firing shots, according to a probable-cause affidavit filed by Seattle police.\nYbarra told detectives that he had been planning a mass shooting for a long time and wanted to kill as many people as possible before killing himself, according to the affidavit. He then planned to kill himself.\n\"He does now recognize the suffering of the victims and the families ... and he is sorry for their pain.\"\nHis rampage was cut short, however, when a student identified as Jon Meis, who was working as a desk lobby monitor, subdued the gunman with pepper spray. Police said the gunman had stopped to reload, giving Meis a moment to put him in a chokehold and force him to the ground.\n\"I saw one of my students sitting on top of somebody, and a big pile of shell casings,\" said Kevin Bolding, an associate professor who's head of SPU's Engineering Department. \"As far as I know, he tackled the shooter and took him out and saved us all.\"\nPaul Lee, 19, a student at the university from Portland, Ore., died at a Seattle hospital, authorities said Friday. A second student, Sarah Williams, 19, was upgraded to serious condition Friday after five hours in surgery, while a 24-year-old man was discharged, Harborview Medical Center of Seattle said.\nMeis was taken to the hospital after the incident, treated and released.\nIn 911 audio released Friday, witnesses — including of the victims — calmly described how the gunman began unleashing terror on the campus of the small private Christian school.\n\"There were two people standing there, and this guy walked up behind one of them, lifted his rifle and shot directly into the back of the person's head,\" a woman told dispatchers on one of the calls.\nSeattle police said they were making the audio public to highlight \"the remarkable calm and resourcefulness\" of the students and faculty.\n\"There were two people standing there, and this guy walked up behind one of them, lifted his rifle and shot directly into the back of the person's head.\"\nAmong those who coolly told his story was one of the victims himself, who told dispatchers: \"I think I got hit with birdshot or something.\"\nAs he was being treated, the young man said he could see a woman who had been seriously wounded in the chest. As for the gunman, \"he was wearing a blue hoodie and sweatpants — grey,\" the man said.\n'He Had a Rage Inside Him'\nYbarra has a history of mental health issues, according to police records in Mountlake Terrace, which show that he was twice involuntary committed for mental health evaluations after incidents with local police.\nIn October 2010, Ybarra called 911 and said he wanted to hurt himself and other people, according to an incident report. He was sent to involuntary committed for evaluation after he said \"he had a rage inside him\" and \"has had previous suicidal thoughts,\" the report says.","url":"https://www.nbcnews.com/news/crime-courts/suspected-gunman-aaron-ybarra-admits-seattle-college-rampage-police-n124931"}
