{"authors":[],"date_download":"2018-10-22 21:54:19","date_modify":"2018-10-22 21:54:19","date_publish":"2014-06-06 17:39:35","description":"Aaron Ybarra, 26, was arrested after Thursday afternoon's shooting when a student forced him to the ground, according to reports.","filename":"data/vaneerConsumption/SuspectinSeattlePacificUniversityRampageResearchedMassShootings.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/492736/seattle-ejo-60614_684050b165feda832e5ca68d9b0cee91.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_suspect-seattle-pacific-university-rampage-researched-mass-shootings-n124666_1540245259.html","title":"Suspect in Seattle Pacific University Rampage Researched Mass Shootings","title_page":"Suspect in Seattle Pacific University Rampage Researched Mass Shootings","title_rss":"NULL","source_domain":"nbcnews.com","text":"Sarah Williams, 19, remained in intensive care Friday following five hours in surgery, while a 24-year-old man remained in satisfactory condition, Harborview Medical Center of Seattle said.\nThe fourth victim, a 22-year-old man, was treated and released.\nThe gunman was stopped when a student identified as Jon Meis — working as a desk lobby monitor at the time — subdued him with pepper spray. Police said the suspect had stopped to reload — giving Meis a moment to put a chokehold on the shooter and force him to the ground.\nPolice records in Mountlake Terrace, a suburb north of Seattle where Ybarra lived with his parents, show that he at one time worked at a gun range and was twice involuntary committed for mental health evaluations after incidents.\nIn October 2010, Ybarra called 911 and said he wanted to hurt himself and other people, according to an incident report. He was involuntary committed for evaluation after he said he \"had a rage inside him\" and \"has had previous suicidal thoughts,\" the report says.\nTwo years later, in October 2012, Ybarra was discovered lying in the middle of a street \"very intoxicated,\" according to a separate report, which says Ybarra told officers \"he wanted [the] SWAT team to get him and make him famous\" because \"no one cares about him.\"\nAssistant Mountlake Terrace Police Chief Pete Caw told NBC News on Friday that it wasn't known what happened after Ybarra was sent to a hospital for mental evaluations in either case.\nPolice said Ybarra was armed with a shotgun, a knife and extra rounds of ammunition. He wasn't a student at the school, and investigators are trying to determine why he targeted Seattle Pacific, a private Christian college, some 12 miles from his home.\nHis decision to attack appeared to have be planned in advance, sources told NBC News.\nSources said Ybarra made a private purchase of a shotgun two years go. He was also described as being angry, anti-social and disaffected.\nA bail hearing is scheduled for Friday afternoon. Ybarra was booked into the King County Jail on homicide charges.\nSarah Ford and Andrew Blankstein of NBC News contributed to this report.","url":"https://www.nbcnews.com/news/crime-courts/suspect-seattle-pacific-university-rampage-researched-mass-shootings-n124666"}
