{"authors":[],"date_download":"2018-10-30 20:33:01","date_modify":"2018-10-30 20:33:01","date_publish":"2015-09-17 13:42:27","description":"An Atlanta firefighter suspended after sexually provocative photos were taken at a firehouse said lots of people take pictures at the station but the department would not approve the ones allegedly used to advertise an escort service.","filename":"data/vaneerConsumption/SuspendedAtlantafirefightersaysphototakingcommonatstation.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/14/Images/photos.medleyphoto.8151514.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_suspended-a_9b2fe2df6e9b741f279fad8d7ea58a54__1540931581.html","title":"Suspended Atlanta firefighter says photo-taking common at station","title_page":"Suspended Atlanta firefighter says photo-taking common at station","title_rss":"NULL","source_domain":"ajc.com","text":"An Atlanta firefighter suspended after sexually provocative photos were taken at a firehouse said lots of people take pictures at the station but the department would not approve the ones allegedly used to advertise an escort service.\nTelevision station WXIA, known locally as 11Alive, interviewed the firefighter, identified in the report as Lt. Jathan Dortch. He has been placed on paid administrative leave pending the outcome of the probe into the photo sessions\nAsked how a photo could be taken of a woman on a fire truck, Dortch replied: “I’m not sure. We get a lot of visitors at the station.”\nThe Atlanta Professional Firefighters Association released a statement Thursday saying it is “extremely disturbed” by the pictures.\n“It is our understanding these inappropriate acts were not done by our firefighters, nor were our firefighters aware that the pictures were going to be placed on such an ad.”\nDortch didn’t know the photos would be used to advertise an escort service, according to 11Alive. The station reported department sources said one woman involved in the the photo taking may have talked her way into the firehouse claiming to be related to a retired firefighter.\nAssistant Chief Todd Edwards said the lieutenant was in charge of Fire Station No. 2 at the time the photos were taken. He said the investigation may be finished this week or by the end of the month.\nThe images show multiple women posing provocatively in front of a fire truck while wearing Atlanta Fire Rescue gear. They appeared on Backpage, an online classifieds portal that advertises escort services. Some say the site facilitates sex trafficking.\nMayor Kasim Reed is vowing to fire any city employee who had a role in the scandal.","url":"https://www.ajc.com/news/crime--law/suspended-atlanta-firefighter-says-photo-taking-common-station/hqReemiAyPh8Mj5xLGmLzN/"}
