{"authors":[],"date_download":"2018-10-30 20:42:56","date_modify":"2018-10-30 20:42:56","date_publish":"2014-07-03 11:43:52","description":"A 27-year-old man has been identified as a suspect in a murder of an East Point restaurant manager earlier this week.","filename":"data/vaneerConsumption/SuspectidentifiedinEastPointrestaurantshooting.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/07/06/Videos/3661121576001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_suspect-identified-east-point-restaurant-shooting__1540932176.html","title":"Suspect identified in East Point restaurant shooting","title_page":"Suspect identified in East Point restaurant shooting","title_rss":"NULL","source_domain":"ajc.com","text":"A 27-year-old man has been identified as a suspect in a murder of an East Point restaurant manager earlier this week.\nEast Point police said Yusuf Abdul Alkarim, who had not been arrested as of Saturday, shot and killed Riyadh Nuriddin, 36, of Austell. Nuriddin was found dead shortly after 11 p.m. Wednesday at Ikhlas Superb Seafood in the 2700 block of Sylvan Road, according to the Fulton County Medical Examiner’s office.\nMustafaa Nuriddin said his younger brother routinely closed up at the restaurant, where he helped their mother.\n“He was devoted to his community, he was devoted to his family, he was devoted to his children,” Mustafaa Nurridin told Channel 2 Action News. “You know, one way to touch people’s souls is when you feed them. So, my brother touched a lot of souls.”\nPolice say robbery was the apparent motive for the shooting.\nEast Point police told Channel 2 Action News that they believe the suspect stole Nuriddin’s 1999 Ford F-150 pickup truck with Georgia license BQI 3987.\nAlkarim is not to be approached, East Point police Lt. Clifford Chandler said. Anyone who has information about his whereabouts should contact East Point police at 404-559-6226.\n— Staff writer Daniel Wilco contributed to this report.","url":"https://www.ajc.com/news/suspect-identified-east-point-restaurant-shooting/WuIXGdD2wAfOhjdmas64aN/"}
