{"authors":["Associated Press"],"date_download":"2018-10-23 05:37:45","date_modify":"2018-10-23 05:37:45","date_publish":"2017-03-10 15:19:10","description":"SANAA, Yemen (AP) - A Yemeni coast guard vessel on Friday hit a naval mine suspected of being planted in the Red Sea by rebels and the explosion killed two...","filename":"data/vaneerConsumption/SuspectedrebelplantedminehitsYemenishipkills2.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301666_Suspected-rebel-planted-hits-Yemeni-ship-kills-2_1540273065.html","title":"Suspected rebel-planted mine hits Yemeni ship, kills 2","title_page":"Suspected rebel-planted mine hits Yemeni ship, kills 2 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SANAA, Yemen (AP) - A Yemeni coast guard vessel on Friday hit a naval mine suspected of being planted in the Red Sea by rebels and the explosion killed two sailors and wounded eight, including the ship's captain, security officials said.\nThe officials spoke on condition of anonymity because they weren't authorized to brief journalists.\nSaudi-led coalition forces combating Shiite rebel forces, known as Houthis, in Yemen's civil war had previously warned of the presence of naval mines planted by Houthi militants in the Red Sea.\nLate on Friday, medical and security officials said an airstrike by the coalition killed at least a dozen civilians and wounded dozens more when it hit a crowded market in Yemen's coastal Hodeidah province. They said the death toll was likely to rise. The officials insisted on anonymity because they weren't authorized to speak to the press.\nThe war in Yemen, which began when Houthis seized Yemen's capital of Sanaa in September 2014, has killed more than 10,000 civilians and displaced over 3 million people.\nThe Saudi-led coalition began a campaign against the rebels in March 2015 in support of Yemen's internationally recognized government. The war has ground into a stalemated conflict in recent months. Peace efforts by the United Nations also have faltered.","url":"https://www.dailymail.co.uk/wires/ap/article-4301666/Suspected-rebel-planted-hits-Yemeni-ship-kills-2.html"}
