{"authors":["Abc News","Aaron Katersky","Jack Date","More Meghan","More Aaron","More Jack"],"date_download":"2018-10-30 00:56:05","date_modify":"2018-10-30 00:56:05","date_publish":"2018-10-29 11:25:04","description":"Comes after a week of other suspected bombs found in packages.","filename":"data/vaneerConsumption/SuspiciouspackagefoundinAtlantaaddressedtoCNN.json","image_url":"https://abcnews.go.com/US/suspicious-package-found-atlanta-addressed-cnn/story?id=58827673","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_suspicious-package-found-atlanta-addressed-cnn_story_id=58827673_1540860965.html","title":"Suspicious package found in Atlanta, addressed to CNN","title_page":"Suspicious package found in Atlanta, addressed to CNN - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The FBI was notified of a suspicious package at an Atlanta postal facility on Monday.\nInterested in Mail Bomb Investigation? Add Mail Bomb Investigation as an interest to stay up to date on the latest Mail Bomb Investigation news, video, and analysis from ABC News. Add Interest\nCNN released a statement from its president, Jeff Zucker, saying that the package was addressed to CNN, which is headquartered in Atlanta.\n\"There is no imminent danger to the CNN Center,\" Zucker said in the statement.\nCNN's New York bureau was targeted last week with two apparent mailed explosives, which authorities believe were part of a string of 14 suspicious packages sent to public figures and well-known Democrats across the country. On Friday, authorities arrested Cesar Sayoc for the mailed explosives and warned at the time that more such devices could already by in the postal system.\nThe Atlanta police responded to a call from the city's postal facility at 9:38 a.m. Monday, and the FBI was taking a lead in investigating the incident. Authorities have not yet made any formal connections to the other packages.\nZucker said in his note Monday morning, \"All mail, at all CNN domestic bureaus, is being screened at off-site facilities,\" a system that he said was started Wednesday. \"Our screening process is working,\" he wrote","url":"https://abcnews.go.com/US/suspicious-package-found-atlanta-addressed-cnn/story?id=58827673"}
