{"authors":[],"date_download":"2018-10-23 00:02:09","date_modify":"2018-10-23 00:02:09","date_publish":"2016-01-28 13:30:53","description":"Suspected Russian air strikes killed at least 54 civilians in rebel- and jihadist-held areas of Syria in the past 24 hours, a monitoring group said Thursday....","filename":"data/vaneerConsumption/SuspectedRussianraidskill54Syrianciviliansmonitor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g6sm-4vVdYopwYQ7f641721b07adbb62c-748_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420585_Suspected-Russian-raids-kill-44-Syrian-civilians-monitor_1540252929.html","title":"Suspected Russian raids kill 54 Syrian civilians: monitor","title_page":"Suspected Russian raids kill 54 Syrian civilians: monitor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Suspected Russian raids kill 54 Syrian civilians: monitor\nSuspected Russian air strikes killed at least 54 civilians in rebel- and jihadist-held areas of Syria in the past 24 hours, a monitoring group said Thursday.\nThe Syrian Observatory for Human Rights said strikes on Wednesday had killed 29 civilians, including nine women and three children, in villages controlled by the Islamic State group in the eastern Deir Ezzor province and its provincial capital of the same name.\nThe strikes killed another 15 civilians, including five young brothers, in and around the city of Al-Bab, an IS bastion in the northern province of Aleppo, the Observatory said.\nRussian warplanes have been conducting air strikes against Islamic State jihadists and other groups in Syria since September 30, 2015 ©Paul Gypteau (AFP/File)\nTen more civilians, including seven children, were killed in Russian strikes in Ghanto, a town held by Islamist rebels in the central province of Homs, it said.\nThe Britain-based monitor relies on a network of activists on the ground and says it distinguishes between Syrian, Russian and US-led coalition aircraft based on flight patterns, as well as the type of planes and ordnance used.\nRussia launched air strikes in Syria in September in support of President Bashar al-Assad's regime, a key ally. The US-led coalition has been carrying out strikes against IS targets in Syria and Iraq since the summer of 2014.\nRussian backing has helped Assad's forces make significant advances in recent months and the Observatory said Thursday that regime troops had moved to within eight kilometres (five miles) of Al-Bab.\nIt was the closest pro-government forces had been to the city, a key IS stronghold in Aleppo, since 2012, it said.\nAl-Bab, about 30 kilometres (20 miles) south of the Turkish border, fell to rebel forces in July 2012 and was taken over by IS in November 2013.\nRegime forces are seeking to sever IS-held territory in Aleppo province from that held by the group in neighbouring Raqa.\nThe Observatory said last week that Russian strikes in Syria had killed more than 1,000 civilians, including around 200 children, since September.\nRussia has denounced accusations that its raids have killed large numbers of civilians as \"absurd\".\nThe Observatory says the US-led strikes have killed 322 civilians, including more than 90 children.","url":"https://www.dailymail.co.uk/wires/afp/article-3420585/Suspected-Russian-raids-kill-44-Syrian-civilians-monitor.html"}
