{"authors":["Ryan Tarinelli"],"date_download":"2018-10-30 21:39:39","date_modify":"2018-10-30 21:39:39","date_publish":"2016-12-23 00:00:00","description":"The day after he surrendered to authorities on Dec. 22, 2016, Gary Eugene Holmes told a Pulaski County jailer he wanted to talk with investigators at the Little Rock police station on West 12th Street.","filename":"data/vaneerConsumption/SuspectinroadrageshootingthatkilledLittleRocktoddlersaysgunwentoffbyaccident.json","image_url":"https://media.arkansasonline.com/img/photos/2016/12/23/AcenKing_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_dec_17__1540935579.html","title":"Suspect in road-rage shooting that killed Little Rock toddler says gun went off by accident","title_page":"Suspect in road-rage shooting that killed Little Rock toddler says gun went off by accident","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Gary Holmes Sr., 34, (right) faces one count of capital murder and two counts of committing a terrorist act in the death of 3-year-old Acen King (left) in Little Rock on Saturday, Dec. 17, 2016.\nThe day after he surrendered to authorities on Dec. 22, 2016, Gary Eugene Holmes told a Pulaski County jailer he wanted to talk with investigators at the Little Rock police station on West 12th Street.\nAt the station, police gave him crackers and Dr Pepper. Then, during an interview with investigators in an upstairs conference room, according to an investigative case file, the suspect recalled the moments before one of the most high-profile homicides in recent Little Rock memory: the death of 3-year-old Acen King.\n\"I just want a fair chance to,\" Holmes said, according a transcription of the interview. \"I've been getting in trouble all my life and it's not even just intentional trouble. It's just, it's like I had the worst, the worst of the worst luck. And you know I never intended to shoot nobody.\"\nHolmes, 34, is accused of firing a single shot into the back of a Dodge Charger last December, fatally hitting the toddler, according to the case file, which reveals new details on the homicide. Little Rock police have described the shooting as a case of road rage.\nIn his interview with investigators, Holmes said he was not angry but told police the gun was in his hand and the firearm went off after he opened the door of the vehicle he was driving, according to the case file.\nA woman riding with Holmes told police he was upset because he \"thought that a vehicle behind them was following them too close,\" according to an affidavit.\nHolmes pulled over to the side of the road and let the car pass and pull up to a stop sign, the affidavit from Little Rock police said. The affidavit said Holmes later opened the car door, stood up and fired a shot at the Dodge Charger.\n\"After he got back into the car [Holmes] said 'that's what you get for following me around,'\" according to the affidavit.\nThe case file shows that police spoke with another witness, who said he was in the vehicle with Holmes during the shooting. According to the case file, the man said they were behind a red Dodge when Holmes started to get mad and honked the horn.\nThe witness said Holmes then got out of the vehicle and fired the gun, according to the documents.\nHolmes faces one count of first-degree murder, one count of terroristic act and one count of possession of a firearm by certain persons. Trial dates have been set for February.\nAcen's killing sparked anger in Little Rock and garnered national and international headlines. Today is the one-year anniversary of his death. During last year's holiday season, Little Rock police were also investigating the killing of 2-year-old Ramiya Reed, who also was fatally shot while riding in a vehicle with family members.\nIn Acen's death, police were called to a shopping center in west Little Rock and found the toddler with a gunshot wound in his chest and back, authorities said. The toddler was taken to Arkansas Children's Hospital but died from the injuries.\nAcen's grandmother told police the shooting occurred at a southwest Little Rock intersection, but she did not realize her grandson was shot until she arrived at the shopping center.\nAt the intersection, the grandmother exchanged honks with another driver, according to the case file. The grandmother told police the other driver exited the vehicle, and she heard a single gunshot.\nIn his interview with police, Holmes said he had the gun in his lap, and was driving \"when two cars came up behind him quickly,\" according to the case file.\nHolmes said he pulled over and let the cars pass. According to the case file, he said he arrived at the intersection and saw one of the cars was in front of him.\nHolmes said he waited, but the car did not move, and he exchanged honks with the other driver, according to the case file.\n\"Mr. Holmes stated that he began to get out of the car and had the gun in his left hand. Mr. Holmes stated that as he got out the gun went off,\" according to a case report.\nIn May, Holmes' lawyer submitted a motion arguing that any statement Holmes gave to authorities violated his constitutional rights, court records show.\nHe was listed on the Pulaski County jail's inmate roster Saturday afternoon.\nADVERTISEMENT\nMore headlines\nMetro on 12/17/2017","url":"https://www.arkansasonline.com/news/2017/dec/17/file-recounts-lr-toddler-s-death-201712/"}
