{"authors":[],"date_download":"2018-10-22 20:32:03","date_modify":"2018-10-22 20:32:03","date_publish":"2014-06-01 14:14:05","description":"\"He spent over a year in Syria, where he seems to have joined the ranks of combatant groups, jihadist terrorist groups,\" said a French prosecutor.","filename":"data/vaneerConsumption/SuspectinJewishMuseumKillingsHadTraveledtoSyria.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/467231/140526-brussels-shooting-jms-1817_da2366ff46338beaee192583966d383e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_suspect-jewish-museum-killings-had-traveled-syria-n119591_1540240323.html","title":"Suspect in Jewish Museum Killings Had Traveled to Syria","title_page":"Suspect in Jewish Museum Killings Had Traveled to Syria","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Frenchman arrested over killings at a Belgian Jewish museum had traveled to Syria and claimed responsibility for the shootings in a video, prosecutors say.\nBelgian federal prosecutor Frederic Van Leeuw said Sunday that the suspect had tried to film the killings on May 24 but his camera failed.\nA video found after his arrest shows his weapons and clothes, and includes his voice claiming responsibility for the attack.\nParis Prosecutor Francois Molins says police arrested the suspect, Mehdi Nemmouche, on Friday in Marseille after he arrived on bus coming from Amsterdam.\nHe says the suspect had an automatic weapon like that used in the Brussels attack, and a white sheet scrawled with the name of the Islamic State of Iraq and the Levant, an extremist group fighting in Syria.\nMolins said that Nemmouche had been behind bars at least five previous times in France, and became radicalized therein.\n\"During his last stay in jail he was noticed for extremist (Islamic) proselytism,\" Molins said. \"On Dec. 31, 2012, three weeks after he was freed, he traveled to Syria.\"\nHe added, \"He spent over a year in Syria, where he seems to have joined the ranks of combatant groups, jihadist terrorist groups.\"\nNemmouche is being held on charges of murder, attempted murder and possession of weapons, all of which in the framework of a terrorist activity, Molins said. Nemmouche has said nothing so far, he added.\nExperts have for years been worried about the radicalization of foreign nationals who travel to Syria fight for one side or another in the 3-year-old civil war. Now the Brussels shootings raises fears that the hundreds of Europeans who have gone to join Islamic extremists in Syria could stage attacks back home.\n\"The new elements in this investigation draw attention once more to the problem of the 'returnees' —in other words the people going to Syria to participate in combat and return afterward to our country,\" said Van Leeuw. \"All European countries are confronted at this moment with this problem.\"\n— with Reuters and the Associated Press","url":"https://www.nbcnews.com/news/world/suspect-jewish-museum-killings-had-traveled-syria-n119591"}
