{"authors":[],"date_download":"2018-10-22 20:24:39","date_modify":"2018-10-22 20:24:39","date_publish":"2014-06-01 15:22:25","description":"Three men have confessed to the gang rape and slaying of two teenage girls who were found hanging from a tree in northern India, police said Sunday.","filename":"data/vaneerConsumption/SuspectsConfessinRapeandHangingofTwoIndianTeens.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/480131/140601-india-rape-1118_596ea578c0c7b4ed4426efa91c9f39a2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_suspects-confess-rape-hanging-two-indian-teens-n119661_1540239879.html","title":"Suspects Confess in Rape and Hanging of Two Indian Teens","title_page":"Suspects Confess in Rape and Hanging of Two Indian Teens","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLUCKNOW, India — Three men have confessed to the gang rape and slaying of two teenage girls who were found hanging from a tree in northern India, police said Sunday, in a case that has recast a light on rampant sexual violence in the country.\nAuthorities continued to search for two additional suspects in last week's attack on the 14- and 15-year-old cousins in Uttar Pradesh state, police officer Atul Saxena said.\nThe girls, from an impoverished family with no toilets in their home in the tiny village of Katra, about 180 miles from Lucknow, the state capital, disappeared Tuesday night after going into fields to relieve themselves.\nAfter the girls were found hanging from a mango tree on Wednesday, hundreds of angry villagers stayed next to the tree, demanding that police find the attackers before allowing them to remove the bodies. Indian television stations showed footage of the villagers sitting under the girls' bodies as they swung in the wind.\nPolice arrested two suspects on Wednesday and another on Saturday.\nWhen questioned by police, the men admitted they had attacked the girls, Saxena said.","url":"https://www.nbcnews.com/news/world/suspects-confess-rape-hanging-two-indian-teens-n119661"}
