{"authors":[],"date_download":"2018-10-22 21:23:55","date_modify":"2018-10-22 21:23:55","date_publish":"2016-01-28 07:25:25","description":"Suspected Maoist rebels attacked a police convoy in a remote part of eastern India, killing five officers and two civilians, police said Thursday. The attack...","filename":"data/vaneerConsumption/SuspectedMaoistrebelskillsevenineasternIndia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5xl-4vVdYopwYQ7f641721b07aa31108-443_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420443_Suspected-Maoist-rebels-kill-seven-eastern-India_1540243435.html","title":"Suspected Maoist rebels kill seven in eastern India","title_page":"Suspected Maoist rebels kill seven in eastern India | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Suspected Maoist rebels kill seven in eastern India\nSuspected Maoist rebels attacked a police convoy in a remote part of eastern India, killing five officers and two civilians, police said Thursday.\nThe attackers set off a powerful landmine blast before opening fire on the convoy, which was on an anti-Maoist operation in the forests of Jharkhand state on Wednesday.\n\"Seven people died in yesterday's landmine blast,\" police officer Nav Kumar Singh told AFP by phone from Palamu district, 190 kilometres (120 miles) from the state capital Ranchi.\nIndian Maoists patrol their village in Bijapur district on July 6, 2012, after an encounter between Maoist rebels and security forces in the central Indian state of Chhattisgarh ©Noah Seelam (AFP/File)\n\"Five were police officers, one was the driver and the other a guard.\"\nHe said another six police were wounded and a search operation was under way.\nThe ambush is the latest in a simmering conflict that pits the insurgents against security forces in remote areas of India.\nThe rebels, who claim to be fighting for the rights of poor tribal minorities and farmers, have waged a decades-long battle across central and eastern Indian states to overthrow government authorities.\nThey draw recruits from tribal communities whose members are often desperately poor and living in underdeveloped areas neglected by successive governments.\nThe Maoist insurgency has claimed more than 12,300 lives between 1999 and 2014, according to the South Asia Terrorism Portal website which tracks separatist trends.\nThey are believed to be present in at least 20 Indian states but are most active in forested, resource-rich areas in the states of Chhattisgarh, Orissa, Bihar, Jharkhand and Maharashtra.\nTheir insurgency was described by former prime minister Manmohan Singh as the country's most serious internal security threat.\nPrime Minister Narendra Modi has been seeking to stem the insurgency by earmarking development funds for revolt-hit areas and improving policing.\nLast year, he urged Maoists to put down their guns and take up ploughs, saying \"violence has no future\".","url":"https://www.dailymail.co.uk/wires/afp/article-3420443/Suspected-Maoist-rebels-kill-seven-eastern-India.html"}
