{"authors":["Anucyia Victor For Mailonline"],"date_download":"2018-10-23 01:12:52","date_modify":"2018-10-23 01:12:52","date_publish":"2016-01-11 11:54:15","description":"Amateur gardeners can grow the luxury food in their back gardens thanks to Devon-based Suttons Seeds which has started to sell special truffle trees for just £29.99.","filename":"data/vaneerConsumption/SuttonsSeedscreatetruffleTREESyoucanplantinthebackgarden.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3008352200000578-0-image-a-40_1452512600666.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-3393738_Why-spend-10-000-grow-30-British-gardeners-create-truffle-TREES-plant-garden_1540257172.html","title":"Suttons Seeds create truffle TREES you can plant in the back garden","title_page":"Suttons Seeds create truffle TREES you can plant in the back garden | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Historically they have been exclusive to only the top chefs and those with deep enough pockets to fork out for a few precious grams.\nTruflles, a mushroom-like fungi, are among the most expensive and sought-after foods in existence, with prices for the best reaching a staggering £10,000 a kilo.\nBut now amateur gardeners can grow the luxury food in their back gardens thanks to Devon-based Suttons Seeds which has started to sell special truffle trees, for just £29.99.\nHistorically truffles have been exclusive to only the top chefs and those with deep enough pockets to fork out for a few precious grams\nSuttons, based in Paignton, Devon, is selling 'truffle trees' as 3ft saplings (left) that can grow up to 20ft tall (right)\nSuttons, based in Paignton, Devon, is selling 'truffle trees' as 3ft saplings that can grow up to 20ft tall.\nAnd foodies and foragers alike are celebrating after the British horticulturalists came up with an ingenious way to grow coveted truffles in back gardens.\nThe roots of young hazel trees have been impregnated with truffle fungi which begins to grow once planted in soil.\nBut those wanting their own truffle crop will have to be patient as it will take between four to seven years for the first to appear. The good news is that the tree will then keep producing them for 25 years.\nTom Sharples, senior horticultural manager at Suttons, said: 'Truffles are a kind of 'underground mushroom' that grow on the roots of certain tree species.\n'They are highly prized by top chefs and connoisseurs for their exquisite, intense flavour and can be used to add an indulgent twist on everything from pasta and seafood to scrambled eggs.\nTruflles, a mushroom-like fungi, are among the most expensive and sought-after foods in existence, with prices for the best reaching a staggering £10,000 a kilo\n'The summer truffle is very similar to the winter truffle although milder in flavour, but it's much more at home in cooler climates and in the UK has been reported to have been found as far north as Scotland.\n'The young hazel trees we're supplying are a UK grown native whose roots have been inoculated with native truffle fungi.\n'It means that when they're planted the truffles are encouraged to grow. We use hazels because they are quick growers but also because you can keep them under control.\n'You can use oak but who's got room for one in their garden?\n'There's no absolute guarantee the truffle trees will produce truffles but they're given the best chance they can have when they leave us - the rest is down to the grower.\n'That said, they are very easy to grow - you certainly don't need to be a gardening expert.\n'The first crop of truffles will come between four and seven years after planting, but thereafter it will keep cropping for 25 years.\n'Truffles are usually seen as something for the wealthy but now you really can grow them in your back garden.\n'Britain was actually a hotbed for the truffle trade up until around 500 years ago but it slowly died off as we put in roads and hedgerows.\n'By growing truffles in back gardens it helps keep alive our country's great truffle heritage.'\nSummer truffles - Tuber aestivum in Latin - are found wild throughout Europe, mostly in Mediterranean France, Spain and Italy, and are highly prized in cooking.","url":"https://www.dailymail.co.uk/femail/food/article-3393738/Why-spend-10-000-grow-30-British-gardeners-create-truffle-TREES-plant-garden.html"}
