{"authors":["Associated Press"],"date_download":"2018-10-22 22:48:23","date_modify":"2018-10-22 22:48:23","date_publish":"2016-01-28 11:08:34","description":"NAYPYITAW, Myanmar (AP) — The pro-democracy party in Myanmar led by Aung San Suu Kyi announced ethnically diverse choices Thursday for leadership of the legi...","filename":"data/vaneerConsumption/SuuKyispartynameschoicestoleadMyanmarparliament.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420639_Suu-Kyis-party-names-choices-lead-Myanmar-parliament_1540248503.html","title":"Suu Kyi's party names choices to lead Myanmar parliament","title_page":"Suu Kyi's party names choices to lead Myanmar parliament | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Suu Kyi's party names choices to lead Myanmar parliament\nNAYPYITAW, Myanmar (AP) — The pro-democracy party in Myanmar led by Aung San Suu Kyi announced ethnically diverse choices Thursday for leadership of the legislature as it prepares to take over the government from a military-backed party after parliament convenes Monday.\nNational League for Democracy executive Win Thein told reporters that it will nominate a member of the Burman ethnic majority, Win Myint, for lower house speaker and an ethnic Kachin, Ti Khun Myat, for his deputy. It will propose a Karen, Win Khaing Than, for speaker of the upper house, and an Arakanese, Aye Thar Aung, for his deputy.\nIn what is seen as another gesture toward unity and reconciliation, the proposed deputies come from other parties. Ti Khun Myat is a member of the Union Solidarity and Development Party, the outgoing ruling party, and Aye Thar Aung is from the Arakan National Party, one of the better-performing ethnic parties in the election representing a politically volatile area.\nEthnic conflict has bedeviled Myanmar for decades, with minority groups fielding guerrilla armies in a bid for greater autonomy.\nSuu Kyi is constitutionally barred from taking the presidency, and has vowed to rule from behind the scenes through a proxy. She has not announced who her party will nominate for president.\nDespite its landslide victory, the NLD in practice will have to share power with the military, for which the constitution reserves 25 percent of the seats in parliament. Suu Kyi has met with senior military leaders to try to ensure a smooth change of government, and they have vowed not to interfere.\nThe NLD easily won last November's general election, allowing it to unseat the USDP and replace President Thein Sein, who on Thursday gave what is likely to be his last speech in parliament, reviewing his government's accomplishments. Thein Sein, a former army general, led a transitional administration after almost a half century of military rule.","url":"https://www.dailymail.co.uk/wires/ap/article-3420639/Suu-Kyis-party-names-choices-lead-Myanmar-parliament.html"}
