{"authors":["Phil Blanche","Press Association Sport"],"date_download":"2018-10-23 05:52:28","date_modify":"2018-10-23 05:52:28","date_publish":"2017-03-16 16:35:42","description":"Top scorer Fernando Llorente has boosted Swansea by being declared fit to face Bournemouth as Paul Clement insists there is no need to panic after the setback against Hull.","filename":"data/vaneerConsumption/SwanseastrikerFernandoLlorentefitforBournemouthgame.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E2A8DB100000578-0-image-a-126_1489681740135.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320994_Swansea-striker-Fernando-Llorente-fit-Bournemouth-game_1540273948.html","title":"Swansea striker Fernando Llorente fit for Bournemouth game","title_page":"Swansea striker Fernando Llorente fit for Bournemouth game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Top scorer Fernando Llorente has boosted Swansea as boss Paul Clement insists there is no need to panic following their Premier League setback at Hull.\nSwansea's six-point buffer at the bottom was cut in half by their 2-1 defeat to relegation rivals Hull last weekend, a game in which 11-goal Llorente was forced off before half-time with a dead leg.\nBut Spain striker Llorente has been declared fit to take on another relegation rival Bournemouth this Saturday.\nSwansea talisman Fernando Llorente has overcome a dead leg and will face Bournemouth\nThe Spaniard was forced off in the 2-1 defeat by Hull at the KCOM Stadium last weekend\n'Fernando is okay and is training with the group, as is Kyle Naughton who we lost in the latter stages of the Burnley game,' head coach Clement said at his pre-match press conference.\n'Both of those players have returned to training, but Martin Olsson has not, and Stephen Kingsley will replace him this weekend.\n'We picked up a few injuries at Hull last week.\n'Angel Rangel has had surgery on a broken bone in his foot. He actually tried to carry on in the game thinking he had rolled his ankle, but the scan showed a crack in the bone.\nLlorente scored twice in the win against Burnley and he is integral to their battle for survival\nSwansea boss Paul Clement is hoping to see his side respond strongly after the Hull setback\nSeason at a glance Live tables\nFixtures\nScores Premier League\nPremier League\nChampionship\nLeague One\nLeague Two\nScottish Premiership\nScottish Div 1\nScottish Div 2\nScottish Div 3\nLigue 1\nSerie A\nLa Liga\nBundesliga\n'The surgery is to quicken the healing process and he will be out between eight and 12 weeks, so he is unlikely to play this season.'\nSwansea's defeat at Hull was the first real setback of Clement's reign, with his only previous defeats coming against Arsenal, Chelsea and Manchester City.\nBottom half teams Burnley, Crystal Palace and Leicester have all been beaten since Clement was appointed at the start of January, as well as Liverpool and Southampton.\n'We were nowhere near safe before the game and we're nowhere near safe after the game,' Clement said.\nMartin Olsson has been ruled out of the visit to the Vitality Stadium due to an ankle injury\n'It's more than likely that we will not be safe before the end of the season. We have done very well against teams through January and in to February.\n'Clearly we're very disappointed after Hull, not necessarily we lost the game but that we allowed a team below us to get closer to us.\n'It was a big result for them on an occasion when there was a lot of pressure on the game, particularly for them being six points behind us.'\nBournemouth are two places and three points above Swansea after enjoying a mini-revival in the last fortnight.\nClement has helped turn around the fortunes of Swansea but the job is far from done yet\nAngel Rangel now faces a lengthy period on the sidelines to allow his broken foot to mend\nThe Cherries drew 1-1 against Manchester United after being reduced to 10 men for the entire second half at Old Trafford, and backed that excellent point up with a 3-2 home victory over West Ham.\n'There's going to be a lot of movement with 10 weeks to go,' Clement said. 'But we've reflected on the defeat at Hull, and it was very clear where we hadn't done as well as we had in recent games.\n'We have done really well over the last eight to nine weeks, and we don't need to panic if we can get back to our level of performance.'","url":"https://www.dailymail.co.uk/sport/football/article-4320994/Swansea-striker-Fernando-Llorente-fit-Bournemouth-game.html"}
