{"authors":["Phil Blanche","Press Association"],"date_download":"2018-10-23 01:07:45","date_modify":"2018-10-23 01:07:45","date_publish":"2016-01-28 15:16:37","description":"Swansea goalkeeper Gerhard Tremmel has joined Bundesliga side Werder Bremen on loan for the rest of the season, the Welsh club have confirmed.","filename":"data/vaneerConsumption/SwanseagoalkeeperGerhardTremmeljoinsWerderBremenonloanforrestofseason.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/16D6E157000005DC-0-image-a-15_1453994194200.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421144_Swansea-goalkeeper-Gerhard-Tremmel-joins-Werder-Bremen-loan-rest-season_1540256865.html","title":"Swansea goalkeeper Gerhard Tremmel joins Werder Bremen on loan for rest of season","title_page":"Swansea goalkeeper Gerhard Tremmel joins Werder Bremen on loan for rest of season  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swansea goalkeeper Gerhard Tremmel has joined Bundesliga side Werder Bremen on loan for the rest of the season.\nThe move, subject to international clearance, was confirmed on the official Swansea website with struggling Werder Bremen keen to strengthen in their bid to avoid the drop from Germany's top flight.\nTremmel rejoined Swansea on a two-year deal last August after his original contract had expired earlier in the summer.\nGerhard Tremmel has joined Bundesliga side Werder Bremen on loan for the rest of the season\nBut the 37-year-old, who secured a Capital One Cup winner's medal in 2013, has failed to make a single appearance this season.\nLukasz Fabianski has been ever-present in the Barclays Premier League, with Kristoffer Nordfeldt preferred to Tremmel for the cup games.\nMunich-born Tremmel first joined Swansea from Red Bull Salzburg in 2011 and has made 52 appearances for the Welsh club.\nSwansea have also confirmed that Diego Bortoluzzi has joined Francesco Guidolin's coaching staff at the Liberty Stadium.\nBortoluzzi worked under Guidolin at Palermo, Parma and Udinese and was most recently at Verona.\nThe 49-year-old becomes the third Italian on the Swansea coaching staff, which also includes former Chelsea midfielder Gabriele Ambrosetti.","url":"https://www.dailymail.co.uk/sport/football/article-3421144/Swansea-goalkeeper-Gerhard-Tremmel-joins-Werder-Bremen-loan-rest-season.html"}
