{"authors":["Simon Jones For Mailonline"],"date_download":"2018-10-23 00:38:43","date_modify":"2018-10-23 00:38:43","date_publish":"2016-01-29 13:56:48","description":"Swansea have made a £7m offer to Crystal Palace for struggling striker Dwight Gayle. The Welsh side are targeting a striker, having been forced to play Andre Ayew up front in recent weeks.","filename":"data/vaneerConsumption/Swanseabid7millionforCrystalPalacestrikerDwightGayle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30A45FFA00000578-0-image-a-32_1454075736796.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422808_Swansea-bid-7million-Crystal-Palace-striker-Dwight-Gayle_1540255123.html","title":"Swansea bid £7million for Crystal Palace striker Dwight Gayle","title_page":"Swansea bid £7million for Crystal Palace striker Dwight Gayle  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swansea have made a £7m offer to Crystal Palace for struggling striker Dwight Gayle.\nThe Welsh side are targeting a striker, having been forced to play Andre Ayew up front in recent weeks following the struggles of Bafetimbi Gomis.\nGomis scored four times in his first four Premier League games this season, but has found the net just twice since as Swansea have dropped towards the relegation zone.\nSwansea have made a £7m offer to Crystal Palace for struggling striker Dwight Gayle (left)\nGayle (right) in action against Everton's Ramiro Funes Mori earlier this season\nGayle has failed to score yet in the Premier League for Palace this season.\nHe has scored four goals this season in the Capital One Cup, netting in the 4-1 win over Shrewsbury in the second round in August, before a hat-trick in the victory over Charlton by the same scoreline in the next round.\nHe managed 10 goals in 29 games in all competitions for the Eagles last season.","url":"https://www.dailymail.co.uk/sport/football/article-3422808/Swansea-bid-7million-Crystal-Palace-striker-Dwight-Gayle.html"}
