{"authors":["Riath Al-Samarrai For Mailonline"],"date_download":"2018-10-22 20:01:51","date_modify":"2018-10-22 20:01:51","date_publish":"2016-01-29 00:04:47","description":"The Italian boss cycles 12,000 miles a year but will have to get up to speed quickly in the Premier League if he is to turn Swansea's dreadful season around.","filename":"data/vaneerConsumption/SwanseajobcouldbecyclingfanaticFrancescoGuidolinstoughestclimbyetasnewbosschasesPremierLeaguesurvival.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/3088C77100000578-0-image-a-66_1454025872861.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421930_Swansea-job-cycling-fanatic-Francesco-Guidolin-s-toughest-climb-new-boss-chases-Premier-League-survival_1540238511.html","title":"Swansea job could be cycling fanatic Francesco Guidolin's toughest climb yet as new boss chases Premier League survival","title_page":"Swansea job could be cycling fanatic Francesco Guidolin's toughest climb yet as new boss chases Premier League survival | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The 60-year-old man who cycles 12,000 miles a year is going to have to get up to speed pretty fast on his next climb.\nThat much is plainly obvious to Francesco Guidolin, the unknown quantity hired by Swansea City to attack the mountain between them and Premier League survival.\nHis appointment on January 18 was such a shock his new players had to Google who he was; those same players were so deep in trouble it is perhaps surprising that Guidolin ‘ran as quick as I could to get here’.\nFrancesco Guidolin could face his toughest test yet in keeping Swansea in the Premier League\nThe Italian enjoyed the perfect start to life in English football with a 2-1 win at Everton on Sunday\nIt is just as well that he did because everything about Swansea’s current situation requires speed - they simply don’t have time to waste in this relegation fight.\nSuch a realisation was slow in coming following Garry Monk’s sacking in December, but once it dawned, the club got a move on. That much was made clear by Guidolin on Thursday, when he held his first lengthy meeting with the British media and gave a telling answer when asked about the timeframe between Huw Jenkins’ first approach and his appointment 11 days ago.\nHe said: ‘It was two weeks ago that I first heard. I had an appointment with my agent and the chairman. We went back to Italy after it and then last Saturday I had a call from my agent and I am here. It happened very quickly. I was happy to have this possibility and I ran as quick as I could to get here.’\nGylfi Sigurdsson gave Swansea an early lead when he lashed his penalty into the top corner\nAndre Ayew recovered the lead for the visitors after Jack Cork's own goal levelled for Everton\nHe has made a suitably quick impression since arriving for what he revealed was his first trip to Wales.He watched Swansea beat Watford from the stands, then took charge as they won a second against Everton and on Thursday opened his press conference by saying ‘bore da’.\nHe is, by nature, said to be a quiet man, not at all bombastic, though he is a coach of high-pressing, high-energy football.\nGiven that is one significant area of Swansea’s game that has collapsed this season, there is good potential for him to make an impact, which he has succeeded in doing at the majority of his 18 managerial appointments.\nThe bullet-points of his CV are impressive, with three clubs under his charge promoted to Serie A, with the Italian Cup won at Vicenza. He also took Udinese to the Champions League twice and acquired huge knowledge of multiple player markets by working as technical advisor for the three teams controlled by the Pozzo family - Watford, Udinese and Granada CF.\nGuidolin says he likes London but prefers the quiet life and is enjoying being in Wales\nThe Italian celebrates with Swansea staff including former caretaker manager Alan Curtis (right)\nThroughout the first two thirds of his career he was frequently linked to the bigger jobs in Italy without ever landing one and admitted on Thursday: ‘It was frustrating when I was younger. I never worked for the top teams in Italy. I always did small teams or medium teams – I am used to these situations.\n‘Now, in the last few years, I refused to go to the top teams, like Napoli for example, because I wanted to stay at Udinese. That was my habitat. Napoli were interested before Rafa Benitez was manager.’\nIt will be fascinating to see how Swansea’s gamble pays off, not least because Guidolin’s one previous job outside of Italy was a poor season at Monaco.\nOf his adaptation to Wales, he said: ‘My wife has come here with me. I like this town, I like this country and I like the kind of people here.\n'I am happy to be here, these are my first impressions. This is my first time in Wales, but my son lives in London. He has been there five or six years - he is a football agent.\nthe Italian favours a high pressing style which is an area Swansea have looked lacklustre in\n‘I have been there quite a few times and I like it. But I prefer the quiet life. London is very big and very busy, too big really. I prefer a quiet life.’\nA fanatical cyclist, he will soon ship over his bike. ‘It’s my great passion. It's more than a hobby - it's an important thing for me, to be active, to do sport and above all to cycle,' he said. 'It takes away my stress.'\n‘Every year I go on television (to commentate) for a stage of the Giro d’Italia. In the past, when I was younger they asked me to do a climb too. When I was younger I competed in races a little, now it's just a hobby.\n‘I am a big fan of Alberto Contador. Eddie Merckx before that. Geraint Thomas from Wales, I also like very much. I hope to meet him.\n‘Every year I go to the Tour de France. I have an apartment in the Cote d'Azur. I worked for Monaco and I like the area very much. But even before that me and my family went to the Tour for one or two stages almost every year.’","url":"https://www.dailymail.co.uk/sport/football/article-3421930/Swansea-job-cycling-fanatic-Francesco-Guidolin-s-toughest-climb-new-boss-chases-Premier-League-survival.html"}
