{"authors":["Phil Blanche","Press Association Sport"],"date_download":"2018-10-23 03:37:36","date_modify":"2018-10-23 03:37:36","date_publish":"2017-03-10 13:09:53","description":"Paul Clement hopes to exact revenge over Hull boss Marco Silva for his first defeat as Swansea manager. Clement's first official game at Swansea was January's 2-0 FA Cup defeat at Hull.","filename":"data/vaneerConsumption/SwanseabossPaulClementeyesrevengeoverMarcoSilva.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E13D84300000578-0-image-a-12_1489151186545.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301188_Swansea-boss-Paul-Clement-eyes-revenge-Marco-Silva_1540265856.html","title":"Swansea boss Paul Clement eyes revenge over Marco Silva","title_page":"Swansea boss Paul Clement eyes revenge over Marco Silva | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paul Clement hopes to exact revenge over Hull boss Marco Silva for his first defeat as Swansea manager.\nClement's first official game at Swansea was January's 2-0 FA Cup defeat at Hull. The third-round tie also marked Portuguese Silva's opening game in charge of the Tigers.\nThe two sides meet again on Saturday with crucial Premier League points at stake, 19th-placed Hull being six points adrift of Swansea.\nPaul Clement hopes to exact revenge over Hull boss Marco Silva for his first defeat at Swansea\nClement is preparing his side for the clash against Hull, with both teams bidding for survival\n'I look back to the FA Cup game in January when we started at the same time,' Clement said.\n'They had the edge over us, but it was a tight game and went to 80 minutes before there was a goal.\n'Then they hit us on the counter at the end. But looking at the statistics - shots on target, possessions, crosses - the two teams are very similar. I am looking forward to go up against him (Silva) and coming out on top this time.'\nSwansea's revival under Clement has given them a crucial advantage over some of their rivals in the relegation battle.\nThey were bottom of the table with only 12 points from 19 games when Clement took over at the start of January.\nBut five wins from eight games since then have lifted Swansea to 16th spot and established a five-point buffer between themselves and the relegation zone.\nHull manager Silva pictured delivering instructions to his team during the FA Cup victory\n'The first thing is we go there to try and win the game,' Clement said. 'But if we don't it is very important not to lose based on the gap of points between us and them.\n'A point there would not be a bad result. I have watched their games and they were ahead against Leicester, but they probably played them at a bad time compared to when we played them.\n'They also lost against Chelsea and Arsenal, but I thought they played very well in both those games.'\nClement spent some time this week catching up with the staff and players of former club Bayern Munich.\nSwansea players celebrate after beating Burnley 3-2 at the Liberty Stadium\nHe was at the Emirates Stadium on Tuesday night as Carlo Ancelotti's side thrashed Arsenal 5-1 in the Champions League, and he does not dismiss the idea of using those contacts in the summer to strengthen his squad.\n'You never know, I've always tried to keep good relationships with all the clubs I have worked at,' Clement said.\n'Hopefully that will help myself and this club in the future.\n'But it was nice to see everyone as I left the club during the winter break.\n'It was my first opportunity to see the players, the coaching staff and Carlo and I went in to the dressing room before the game to wish them well.'","url":"https://www.dailymail.co.uk/sport/football/article-4301188/Swansea-boss-Paul-Clement-eyes-revenge-Marco-Silva.html"}
