{"authors":["Ralph Ellis For Mailonline"],"date_download":"2018-10-23 01:24:29","date_modify":"2018-10-23 01:24:29","date_publish":"2016-01-11 12:28:30","description":"Newcastle are set to beat their former boss Alan Pardew to the £12million signature of Swansea midfielder Jonjo Shelvey. The 23-year-old who has fallen out of favour with interim boss Alan Curtis.","filename":"data/vaneerConsumption/SwanseaCitysJonjoShelveyreadytosign12mNewcastledeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/2FFCA89900000578-0-image-a-35_1452515201196.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393823_Jonjo-Shelvey-ready-sign-five-year-deal-Newcastle-12million-falling-favour-Swansea_1540257869.html","title":"Swansea City's Jonjo Shelvey ready to sign £12m Newcastle deal","title_page":"Swansea City's Jonjo Shelvey ready to sign £12m Newcastle deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Newcastle are set to beat their former boss Alan Pardew to the £12million signature of Swansea's unsettled England midfielder Jonjo Shelvey.\nThe 23-year-old, who has fallen out of favour with Swans interim boss Alan Curtis, has told friends he's ready to sign a five-year deal at St James' Park.\nThe two clubs are expected to tie up the details of the transfer fee this week, but Shelvey is already set on the idea of working for former England manager Steve McClaren.\nJonjo Shelvey trudges off after Swansea's defeat by Oxford in the FA Cup on Sunday\nHe has been told he will be used at the heart of the Newcastle midfield and encouraged to be creative as McClaren tries to turn round a miserable first half of the season which has left the club in the Premier League relegation zone and now out of the FA Cup.\nShelvey is aware that there will be a contract on the table to take him to the summer of 2020 - the deal he signed last summer at Swansea runs out in 2019.\nShelvey found himself in an argument with Swansea fans when some of them abused him as he went to applaud travelling supporters at the end of the club's 3-2 FA Cup defeat by League Two Oxford on Sunday.\nShelvey has fallen out of favour with Swansea's interim boss Alan Curtis and is set to join Newcastle\nShelvey believes Newcastle boss Steve McClaren will encourage him to take risks and express himself\nBut he had already decided it was time to move on after three seasons in Wales, worried that losing his place in the side under first Garry Monk then Curtis would jeopardise his chances of staying in Roy Hodgson's plans for Euro 2016.\nCrystal Palace have also been keen to sign him but Shelvey believes he'll have more opportunity to play his own game at Newcastle and that McClaren will encourage him to take risks and express himself in the way he likes.","url":"https://www.dailymail.co.uk/sport/football/article-3393823/Jonjo-Shelvey-ready-sign-five-year-deal-Newcastle-12million-falling-favour-Swansea.html"}
