{"authors":[],"date_download":"2018-10-23 05:37:07","date_modify":"2018-10-23 05:37:07","date_publish":"2017-03-16 16:27:56","description":"Swatch said this would offer absolute data protection and ultra-low energy consumption and would not need regular updates.","filename":"data/vaneerConsumption/SwatchtolaunchSwisssmartwatchoperatingsystemby2018.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/17/3E532A0100000578-0-image-a-55_1489684461687.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4320944_Swatch-launch-Swiss-smartwatch-operating-2018_1540273027.html","title":"Swatch to launch Swiss smartwatch operating system by 2018","title_page":"Swatch to launch Swiss smartwatch operating system by 2018 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swatch is set to take on Apple and Google with its own smartwatch software, the Swiss firm has revealed.\nIt says it will offer the software to other watchmakers and tech firms, and claims it will be more flexible and use less power than Apple's WatchOS and Google's Android Wear.\nSwatch Group, whose brands include Omega, said it was working with Swiss research institute CSEM to launch an 'ecosystem' for connected objects by the end of 2018.\nScroll down for video\nNick Hayek CEO and Chairman of the Board of the Swatch Group shows a new Swatch during the Swiss watchmaker's annual news conference in Switzerland. The firm is developing a Swiss-made operating system as it seeks to offer a smaller, more flexible alternative to\nThe world's biggest watchmaker has been sceptical about smartwatches, which use systems like Google's Android Wear, Samsung's Tizen OS and Apple's WatchOS to connect to the internet, and has so far launched watches with limited connected features under its Tissot and Swatch brands.\nCCS Insight expects the market for smart wearables to almost double to 185 million units worth $16.9 billion by 2021.\nNick Hayek said the biggest problems facing competitors' smartwatches related to energy consumption and privacy.\nSwatch said this would offer absolute data protection and ultra-low energy consumption and would not need regular updates.\n'I don't want to become the industry standard for smartwatches,' Nick Hayek said on Thursday, adding it would be dangerous if everybody depended on just one or two dominant operating systems.\nThe firm has already launced a connected watch called 'Swatch Touch Zero One'\n'But in Switzerland we have a lot of expertise when it comes to creating something that is smaller, consumes much less energy, is independent and more cost-efficient and can go into little objects,' he said.\nSwatch had many requests from small U.S. startups looking for flexible open-source systems and would serve these customers while also using the system in its own watches, he said.\nBen Wood, an analyst with CCS Insight, said there were dangers in Swatch trying to build its own system, adding that it would be hard to compete with Google, Samsung and Apple, which had more resources in this area.\nSwatch said it had many requests from small U.S. startups looking for flexible open-source systems and would serve these customers while also using the system in its own watches, he said.\n'Swatch may be able to develop its own software platform, but attracting developers to get access to the most popular apps needs an operating system with scale. Just look at how BlackBerry ended up abandoning its own software,' Wood said.\nBut if Swatch was able to offer people something unique it might be able to break into the market, Francisco Jeronimo at IDC said, adding that this was a 'a gigantic task'.\nHowever, users had not yet locked in to a specific interface in what is a still new segment, therefore offering an opportunity for Swatch, Jeronimo said.","url":"https://www.dailymail.co.uk/sciencetech/article-4320944/Swatch-launch-Swiss-smartwatch-operating-2018.html"}
