{"authors":[],"date_download":"2018-10-22 21:01:49","date_modify":"2018-10-22 21:01:49","date_publish":"2016-01-29 05:30:57","description":"Swedish detectives have travelled to Thailand to look into the disappearance of a Hong Kong-based bookseller who vanished in the kingdom and later resurfaced...","filename":"data/vaneerConsumption/SwedishpolicetraveltoThailandoverbooksellerdisappearance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h77j-3bmscybNe842cce83474b50c9182-146_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422223_Swedish-police-travel-Thailand-bookseller-disappearance_1540242109.html","title":"Swedish police travel to Thailand over bookseller disappearance","title_page":"Swedish police travel to Thailand over bookseller disappearance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swedish police travel to Thailand over bookseller disappearance\nSwedish detectives have travelled to Thailand to look into the disappearance of a Hong Kong-based bookseller who vanished in the kingdom and later resurfaced in Chinese custody, Thai police said Friday.\nGui Minhai, a Swedish national, went missing from his seaside apartment in the resort city of Pattaya in October.\nHe was one of five people from a Hong Kong publishing house known for producing salacious titles critical of Chinese leaders to have disappeared in recent months as Beijing pursues dissidents far beyond its borders.\nPhotos of missing bookseller Lee Bo (L) and his associate Gui Minhai (R) are seen left by members of the Civic party outside the China liaison office in Hong Kong on January 19, 2016 ©Philippe Lopez (AFP/File)\nMajor General Apichart Suriboonya, head of Thai Foreign Affairs Police, told AFP Swedish officers had arrived in the kingdom.\n\"They came here, not for investigation because they have no legal rights to do so. But they have been sent to help expedite the Thai police investigation,\" he said.\nHong Kong newspaper Apple Daily reported that Swedish detectives visited Gui's apartment on Wednesday, interviewing residents and taking copies of the building's surveillance footage.\nMajor General Apichart did not comment on the reports, nor did the Swedish Embassy in Bangkok.\nGui is one of at least three Beijing critics who have disappeared in recent months in Thailand, raising alarms that Thai military rulers are secretly sending dissidents back to China or allowing the Chinese free reign to pursue them on Thai soil.\nThailand's junta, which has cosied up to Beijing since seizing power in May 2014, has remained largely silent on what their policy is towards refoulement to China.\nIn the summer they forcibly returned 109 Uighur refugees, only announcing the move after it had taken place, causing widespread international condemnation, including from the UN.\nThe New York Times has also reported that a fourth man, Chinese dissident journalist Li Xin, also went missing a little over a fortnight ago while trying to seek refuge in Thailand.\nThe paper reported that he was last heard of making his way to the Laos border from where he intended to re-enter Thailand and claim asylum.\nThailand's Ministry of Foreign Affairs told AFP it had no information on Li Xin but said that Thai and Swedish officials were \"cooperating\" on Gui's disappearance.\nAfter nearly two months of silence, Chinese state TV earlier this month broadcast a video of Gui confessing to a years-old mainland drink-driving offence and saying he did not want Stockholm to interfere with his case.\nSweden has previously condemned China's detention of Gui, and the recent arrest and eventual release of Swedish human rights activist Peter Dahlin, as \"unacceptable\".\nChina-born Gui and his four missing colleagues were rumoured to be preparing a tell-all book about the love life of President Xi Jinping.\nOne of his publishing house co-workers, British citizen Lee Bo, disappeared from Hong Kong, fuelling concerns freedoms in the semi-autonomous Chinese city are being eroded.\nThe others are believed to have been apprehended in southern China.","url":"https://www.dailymail.co.uk/wires/afp/article-3422223/Swedish-police-travel-Thailand-bookseller-disappearance.html"}
