{"authors":[],"date_download":"2018-10-23 00:56:11","date_modify":"2018-10-23 00:56:11","date_publish":"2016-01-28 15:06:43","description":"Sweden said it expects to expel up to 80,000 migrants whose asylum requests will likely be rejected, as another 24 people including children drowned off Gree...","filename":"data/vaneerConsumption/Swedenexpectstoexpelupto80000asylumseekers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5vu-2vdWmEltwXfba0ce28e6329eb9c6-134_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420374_Sweden-plans-expel-80-000-asylum-seekers-minister_1540256171.html","title":"Sweden expects to expel up to 80,000 asylum seekers","title_page":"Sweden expects to expel up to 80,000 asylum seekers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sweden expects to expel up to 80,000 asylum seekers\nSweden said it expects to expel up to 80,000 migrants whose asylum requests will likely be rejected, as another 24 people including children drowned off Greece Thursday in the latest tragedy in the Mediterranean.\nAs the continent grapples with efforts to stem a record flow of migrants, Swedish Interior Minister Anders Ygeman said the mass expulsions of people who arrived in the Scandinavian country last year would require the use of specially chartered aircraft.\nThe deportations would be staggered over several years, Ygeman said.\nSweden, a country of 9.8 million, took in more than 160,000 asylum seekers in 2015, putting it among the EU states with the highest proportion of refugees per capita ©JOHAN NILSSON (TT NEWS AGENCY/AFP/File)\n\"We are talking about 60,000 people but the number could climb to 80,000,\" he told Swedish media.\nThe country of 9.8 million is among the European Union states with the highest proportion of refugees per capita.\nOf the 58,800 asylum requests handled by Swedish migration authorities last year, 55 percent were accepted. Many of those requests were however submitted in 2014, before the large migrant flow began.\nYgeman said he used the 55 percent figure to estimate that around half of the 163,000 asylum requests received in 2015 would likely be rejected.\nMigration Minister Morgan Johansson said authorities faced a difficult task in deporting such a large number of migrants, but insisted the rejected applicants would have to return home.\n\"Otherwise we would basically have free immigration and we can't manage that,\" he told news agency TT.\nHowever, 7,590 people who had their asylum applications rejected last year went underground, and for the period 2010-2015 their number totalled 40,345, according to the migration agency.\n- Tighter asylum rules -\nMore than one million people travelled to Europe last year -- the majority of them refugees fleeing conflict in Syria, Iraq and Afghanistan -- in the continent's worst migration crisis since World War II.\nMost cross by boat from Turkey to Greece and the United Nations said Thursday more than 50,000 people have turned up on the EU member's beaches so far this year, while 200 people died making the dangerous journey.\nFlimsy boats packed with migrants are still arriving on Greek beaches every day, undeterred by Europe's wintry conditions.\nOn Thursday, the bodies of 24 migrants, including 10 children, were discovered off the Greek island of Samos after their boat capsized and 11 others were still missing, the coastguard said, a day after seven other bodies were found near the island of Kos.\nWith the influx showing little sign of abating, many countries -- including Austria, Germany, Denmark, Sweden and France -- have tightened asylum rules in a bid to discourage new arrivals.\nReflecting the mounting tensions, Brussels on Wednesday blasted Greece's handling of the crisis and warned it could face border controls with the EU's passport-free Schengen zone if it does not protect the bloc's frontiers.\nAthens is worried its border with Macedonia will be closed, leaving refugees trapped in the country.\nAfter having closed its border for several hours last week, Macedonia again blocked refugees from entering from Greece for several hours overnight.\nAn interior ministry official said that was because 600 people were queuing at Macedonia's northern border to cross into Serbia.\nSeveral hours later the refugees were allowed on their way and the situation returned to normal. Some 3,000 people were on Thursday waiting at the Macedonian border on the Greek side, police there said.\n- Overcrowded centres -\nGreece is not the only country under fire -- Denmark has faced heavy criticism after lawmakers passed a bill this week allowing authorities to seize valuables from refugees in a bid to deter new arrivals.\nSome have likened the move to the Nazis' confiscation of gold from Jews during the Holocaust, with Human Rights Watch denouncing the bill as \"despicable\".\nNeighbouring Sweden has seen the number of new migrants entering the country plunge since it brought in systematic photo ID checks on travellers on January 4.\nConcerns have grown over conditions in Sweden's overcrowded asylum facilities, however, and officials have called for greater security after an employee at a refugee centre for unaccompanied youths was stabbed to death earlier this week.\nA 15-year-old male allegedly attacked the 22-year-old employee, Alexandra Mezher, at the centre in Molndal on Sweden's west coast.\nHer death has led to questions about conditions inside some centres, with too few adults and employees to care for the children, many traumatised by war.\nSweden took in around 35,400 unaccompanied minors in 2015, nine times more than in 2014.\nNational Police Commissioner Dan Eliasson earlier this week requested 4,100 additional officers and support staff to help counter terrorism, deport migrants and police asylum facilities.\nThe European Commission said Greece could face border controls with the rest of the EU's passport-free Schengen zone if it fails to act ©Armend Nimane (AFP)\nTurkish solders take photos of the body of a migrant washed up ashore in Izmir's Dikili district on January 5, 2016 ©Taylan Yildrim (Dogan News Agency/AFP/File)\nThe UN says more than 46,000 people have arrived in Greece so far this year, with more than 170 people killed making the dangerous crossing ©Angelos Tzortzsinis (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420374/Sweden-plans-expel-80-000-asylum-seekers-minister.html"}
