{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:13:54","date_modify":"2018-10-30 18:13:54","date_publish":"2016-11-20 13:31:48","description":"Sweden paid the equivalent of more than £4300 in welfare to an Islamic State terrorist as he fought with the Jihadist group in Syrian.","filename":"data/vaneerConsumption/SwedenPaysThousandsinWelfaretoIslamicStateTerrorist.json","image_url":"https://media.breitbart.com/media/2016/11/Michael-Skråmo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_20__1540923234.html","title":"Sweden Pays Thousands in Welfare to Islamic State Terrorist","title_page":"Sweden Pays Thousands in Welfare to Islamic State Terrorist","title_rss":"NULL","source_domain":"breitbart.com","text":"Sweden paid the equivalent of more than £4,300 in welfare to an Islamic State terrorist as he fought with the Jihadist group in their Syrian stronghold of Aleppo.\nSwedish Muslim convert Michael Skråmo left for Syria with his wife and four small children in August 2014, and now goes by the name Abdul Samad al Swedi.\nSince then, he has appeared in a series of propaganda videos, sometimes alongside his children, brandishing a Kalashnikov assault rifle.\nIt is claimed the family had been living off handouts of £627 (5,814 Kroner) a month.\nHowever, according to Sweden’s Göteborgs Tidning (GT), it took more than a year for Sweden’s welfare agency, Försäkringskassan, to suspend his generous welfare handouts after he became a terrorist.\nThe agency recently sent a letter to Mr. Skråmo’s Gothenburg address, informing him that his child and housing benefit had been discontinued.\n“Försäkringskassan has stopped payments of child benefits and housing benefits for your children,” read the letter, which has been passed to the newspaper.\nMagnus Ranstorp, a terrorism researcher at Sweden’s National Defence University, told the paper: “It exposes how weak the system seems to be in its control mechanisms.\n“Michael Skråmo has been one of the most well-known IS sympathisers for quite some time.”\nAdding: “Police should be able to somehow sound the alarm and inform all the authorities when someone has journeyed down there.”\nFurthermore, Mr. Skråmo reportedly owes his landlord £6,671 (61,842 Kroner) in unpaid rent.\nIn April, his wife sent a sarcastic email to Gothenburg’s court, telling debt collectors to abandon the cases against them, as they were planning to never return to Sweden.\n“To make it simple for you, you don’t need to send more papers to me,” she wrote in the email.\n“I am not in Sweden and am probably never in my life going to come back… so for your own sake, can you just drop it all ;).”","url":"https://www.breitbart.com/europe/2016/11/20/sweden-pays-thousands-welfare-islamic-state-terrorist/"}
