{"authors":["Lydia Willgress For Mailonline"],"date_download":"2018-10-23 02:22:02","date_modify":"2018-10-23 02:22:02","date_publish":"2016-01-29 16:55:27","description":"Officers in Sweden have been called out to nearly 600 assaults in the last three months as well as four rapes, two bomb threats, 194 violent threats, 58 fires, nine robberies and 450 fights.","filename":"data/vaneerConsumption/Swedishpolicehavedealtwith5000incidentsinvolvingmigrantssinceOctober.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B11DB900000578-0-image-a-71_1454086398665.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423090_Swedish-police-reveal-dealt-5-000-incidents-involving-migrants-October-say-problem-increasing_1540261322.html","title":"Swedish police have dealt with 5,000 incidents involving migrants since October","title_page":"Swedish police have dealt with 5,000 incidents involving migrants since October | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swedish police have dealt with 5,000 incidents involving migrants since October as they revealed they are concerned the problems are getting worse.\nOfficers in the country have been called out to nearly 600 assaults in the last three months as well as four rapes, two bomb threats and 450 fights.\nMigrants and asylum seekers have also been involved in 194 violent threats, 58 fires and nine robberies, according to data obtained by SvD .\nSwedish police have dealt with 5,000 incidents involving migrants since October as they revealed they are concerned the problems are getting worse. Above, migrants wait to board a boat in Canakkale, Turkey which they hope will take them to Lesbos, Greece, on Friday\nDan Eliasson, police commissioner, told SvD an increasing number of officers were needed to deal with the problems.\nHe said: 'I am concerned about these developments. I fear that there may be even more trouble.'\nHe added: 'The unrest in asylum accommodation is something that requires more and more of us.\n'[The accommodation] is crowded, some people bring with them the baggage of traumatic events. There can be various disagreements between groups.'\nOfficers in Sweden have been called out to nearly 600 assaults in the last three months as well as four rapes, two bomb threats and 450 fights. Above, migrants queue for a security check after crossing into Serbia on Friday\nVolunteers pull a raft packed with refugees and migrants as they arrive on a beach on the Greek island of Lesbos on Friday. The Swedish police commissioner said an increasing number of officers were needed to deal with crime problems linked to migrants\nA young girl's cries as she is carried through a throng of people following their arrival on Lesbos on Friday\nA migrant woman carries a baby wrapped with a thermal blanket as refugees and migrants arrive on a raft on a beach on Lesbos on Friday\nA volunteer helps a woman out of the boat that arrived on Lesbos on Friday. The data from Sweden emerged less than a month after a number of German cities saw a wave of sex attacks and mob violence, with the majority of suspects of North African origin\nThe figures were collected after forces introduced a code to distinguish the incidents that involved asylum seekers or migrants, thelocal.se reported.\nAround 80,000 migrants are currently thought to be in or have travelled through Sweden.\nThe data emerged less than a month after a number of German cities saw a wave of sex attacks and mob violence, with the majority of suspects of North African origin.\nMore than 800 women claimed they were sexually assaulted or robbed by mobs of young men in Cologne on New Year's Eve.\nThe murder of social worker Alexandra Mezher (pictured) at a home for unaccompanied refugees in Sweden has shone the spotlight on the country’s controversial open-door immigration policy\nMölndal's main shopping centre is a no go zone for most people at night because they fear the armed gangs roaming the streets at night looking for trouble\nThere have also been complaints of assaults in Hamburg, Munich and Berlin prompting officials to give migrants entering the country instruction manuals telling them not to grope women.\nFourteen cartoons have been released and migrants have been told to look women in the eyes rather than any other part of their body when talking to them.\nA picture of a man touching a woman's bottom has a big cross through it.","url":"https://www.dailymail.co.uk/news/article-3423090/Swedish-police-reveal-dealt-5-000-incidents-involving-migrants-October-say-problem-increasing.html"}
