{"authors":["Kenneth Dickerman","Photo Editor","Loulou D'Aki"],"date_download":"2018-10-21 03:05:13","date_modify":"2018-10-21 03:05:13","date_publish":"2018-08-30 10:02:20","description":"Swedish photographer Loulou d'Aki takes us inside Sweden's military","filename":"data/vaneerConsumption/SwedishmilitarypresenceonGotlandtodefendagainstaggressionfromRussia.json","image_url":"https://www.washingtonpost.com/resizer/DUMrMswkCg9ZAbTdw-tff8mC8qc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RLPGYKH3UE35ZLSPYDXBNZN4EE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_30__1540091113.html","title":"Swedish military presence on Gotland to defend against aggression from Russia","title_page":"Swedish military presence on Gotland to defend against aggression from Russia - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Soldiers relax in the grass after a day of war games during “Vareld,” a military defense drill that was also known as “Spring Fire.” (Loulou d’Aki)\nA lighthouse on Gotland. Due to its location, the island would prove crucial in conflicts in the Baltic region. The Swedish military has recently decided to reintroduce permanent troops there. (Loulou d’Aki)\nEarlier this year, it was announced that in May-June 2018, the MSB (Ministry for Society Protection and Preparedness) in Sweden would send out a brochure titled “If Crisis or War Comes” to all of Sweden’s 4.7 million homes. The last time this sort of brochure was printed and distributed was during World War II, in 1943.\nThe leaflet drop was part of a recent effort by the authorities to revamp their defenses as Russian aggression has increased, starting with the invasion of Crimea in 2014.\nSweden, which is not a NATO member, decided to reintroduce a permanent military presence on Gotland in 2016. The strategically important island, due to its eastern position in the Baltic Sea, would be a key target for Moscow should a conflict break out between Russia and NATO.\nLast March, conscription was reintroduced, with 4,000 young people selected for military service each year starting in 2018. Last September, Sweden arranged “Aurora,” the largest military exercise in 23 years, with more than 20,000 troops from Denmark, Estonia, Finland, France, Lithuania, Norway and the United States. At the same time, Russia conducted its own annual military exercise, with an official count of 13,000 troops.\nSweden has a long history of wars with Russia, but has not been this concerned about a potential threat since the Cold War. My ongoing project investigates historical facts dating back to when Sweden was still a great power, to the Winter War and to the more recent Cold War. It’s a balance between history and current events based on individuals’ thoughts, theories and fears in society today.\nSoldiers read and nap aboard a transport on the way from Gotland to the mainland for the military defense drill “Vareld,” also known as “Spring Fire.” (Loulou d’Aki)\nSurrounded by portraits of his predecessors, Mattias Ardin, head of the Defense Forces on Gotland, poses for a portrait. (Loulou d’Aki)\nU.S. troops from North Carolina secure a truck tailgate after descending to meet the rest of the unit and to continue on foot. (Loulou d’Aki)\nA military band performs. (Loulou d’Aki)\nCostumes sit on stage before a theater performance in an “eco village” near Tofta Skjutfalt, a military shooting field. The village’s activists oppose military rearmament. They say they are concerned about waste created by exercises and drills with foreign forces whose environmental laws differ from Swedish regulations. The activists also argue that drills such as “Aurora” may attract aggression instead of prevent it. (Loulou d’Aki)\nSoldiers dressed in snow camouflage eat during the winter defense drill “Vintersol” or “Wintersun” in Boden, Sweden. (Loulou d’Aki)\nPortrait of a soldier. (Loulou d’Aki)\nA commander sticks a blue and yellow ribbon on his jacket before heading to the field during the winter exercise “Vintersol” or “Wintersun.” The ribbons are worn by drill instructors. (Loulou d’Aki)\nA soldier peers into the woods. (Loulou d’Aki)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nConfronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’\nStunning aerial photos of the worst drought in Australia’s living memory\nWhat it was like in the nightclubs of Chicago’s South Side in the 1970s","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/30/inside-the-swedish-military-presence-on-gotland-the-most-strategic-island-for-defense-against-russian-aggression/"}
