{"authors":["Associated Press"],"date_download":"2018-10-23 03:30:49","date_modify":"2018-10-23 03:30:49","date_publish":"2017-03-10 13:04:48","description":"STOCKHOLM (AP) - A Russian employee in the Swedish offices of plane and train maker Bombardier has been detained in pre-trial custody for two weeks on...","filename":"data/vaneerConsumption/SwedendetainsBombardieremployeeforallegedbribery.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196715-1489159774-433_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301218_Sweden-detains-Russian-Bombardier-worker-alleged-bribery_1540265449.html","title":"Sweden detains Bombardier employee for alleged bribery","title_page":"Sweden detains Bombardier employee for alleged bribery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"STOCKHOLM (AP) - A Russian employee in the Swedish offices of plane and train maker Bombardier has been detained in pre-trial custody for two weeks on suspicion of aggravated bribery, a Swedish prosecutor said Friday.\nThomas Forsberg said Evgeny Pavlov, a Russian national living in Stockholm, was one of several Bombardier employees \"suspected to have been colluding\" with Azerbaijan railway authorities \"in order to adapt a contract\" to fit Bombardier.\nForsberg said Pavlov worked with Bombardier Transportation Sweden AB. On LinkedIn, Pavlov described himself as \"Head of sales, Marketing and Country coordinator for the north region.\"\nDefense attorney Cristina Bergner, right, and her client, a Bombardier employee, second right, pictured prior to the pre-trial at the Stockholm District Court, Sweden, Friday, March 10, 2017. A Russian employee in the Swedish offices of plane and train maker Bombardier has been detained in pre-trial custody for two weeks on suspicion of aggravated bribery, a Swedish prosecutor said Friday. (Soren Andersson / TT via AP)\nPavlov was ordered held in pre-trial custody to prevent him from fleeing or tampering with evidence. Two others were briefly detained during the week but were released, Forsberg told The Associated Press. Both remain suspects while the investigation continues. Formal charges have not yet been made.\n\"All I can say is that my client denies any wrongdoing,\" said his lawyer, Cristina Berger, adding it was up to the Stockholm District Court to decide on March 24 whether to remand Pavlov in custody.\nForsberg said emails seized in October 2016 during a search of Bombardier offices in Sweden were considered evidence in the case.\nHe said that the suspicion is that Azerbaijani officials cooperated with Bombardier, which is headquartered in Canada, to \"receive rewards for having favored the Bombardier contract.\"\n\"Despite the fact that Bombardier was in fifth place in terms of price, it won the contract in 2013 and competitors with better prices were disqualified by the railway authority in Azerbaijan,\" Forsberg said.\nIn 2013, Bombardier was part of a consortium awarded a $288-million contract to supply signaling equipment for a 503-kilometer (312-mile) track along a corridor connecting Asia and Europe to Azerbaijan Railways. Bombardier then said it was its \"first major signaling contract in Azebaijian.\"\nForsberg said Azerbaijani companies made $56 million in earnings from the contract.\nThe allegations against Pavlov also included dealings with a private company that joined the consortium that won the tender with Bombardier. Swedish broadcaster SVT and news agency TT report that the private company, based in London, added 550 percent to the overall price when selling the equipment to Bombardier Azerbaijan.\nBombardier Inc. spokeswoman Barbara Grimm said the company is cooperating with Swedish authorities and will provide more information when available and appropriate.\nIf tried and found guilty, the maximum penalty in Sweden is six years, Forsberg said.\n___\nJan M. Olsen in Copenhagen, Denmark, contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4301218/Sweden-detains-Russian-Bombardier-worker-alleged-bribery.html"}
