{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:28:34","date_modify":"2018-10-30 20:28:34","date_publish":"2016-04-25 15:09:50","description":"Sweden's Liberal Party have revealed a new logo which is being mocked online for its apparently phallic appearance. The party, currently the seventh | London / Europe","filename":"data/vaneerConsumption/SwedishLiberalPartyRidiculedForNewPenisLogo.json","image_url":"https://media.breitbart.com/media/2016/04/Screen-Shot-2016-04-25-at-14.08.17.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_04_25__1540931314.html","title":"Swedish Liberal Party Ridiculed For New ‘Penis’ Logo","title_page":"Swedish Liberal Party Ridiculed For New ‘Penis’ Logo | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sweden’s Liberal Party have revealed a new logo which is being mocked online for its apparently phallic appearance.\nThe party, currently the seventh largest in Sweden, was formerly known as Folkpartiet, changing their name to Liberalerna in November 2015.\nAccording to Aftonbladet, they unveiled a new logo over the weekend at a parliamentary session in Linköping. The Party’s leader, Jan Björklund, also posted the logo on social media, tweeting the image alongside the caption: “It’s here now”.\nUsers of the social media platform did not respond favourably.\nLiberalernas nya logga har presenterats. Det enda jag ser är det här. Hur har de tänkt? @bjorklundjan @liberalerna pic.twitter.com/ayKkAvA9bC — Bibi Andersson ✎ (@BylineBelife) April 23, 2016\n“What do you have in your pocket, Jan?” asked one user. “Could not have chosen a small, sterilised penis. But good for you “, joked another.\n“Two tampons forming a penis ?? Worse than the Social Democrats!” said a third.\n“Are there any politically active liberals who dare to be critical of the new logo?” pondered a fourth.\nIdeologically, Liberalerna is a centrist, social liberal party, and they were part of the centre-right coalition government led by Prime Minister Fredrik Reinfeldt from 2006 to 2014.\nSwedish politics is currently in turmoil, with euroscepticism on the rise and a new, right wing populist force, the Sweden Democrats, surging ahead of establishment parties who won just five per cent of the vote in the 2014 elections.\nA poll in August last year found that the Sweden Democrats had become the country’s largest party for the first time, commanding 25 per cent support.\nThe most recent poll by YouGov, released in January of this year, found them commanding 28 per cent support. This put them seven points clear of their closest party, the centre-left Social Democrats, well out of the margin of error.\nJust weeks ago, a poll for Swedish television revealed record levels of euroscepticism in the traditionally Europhile nation.\nJust 39 per cent of Swedes said being in the European Union was a good thing, compared with 59 per cent in autumn last year. Furthermore, around a fifth of the 1,142 respondents said membership was a bad idea.","url":"https://www.breitbart.com/europe/2016/04/25/struggling-swedish-liberal-party-adopts-penis-logo/"}
