{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:40:31","date_modify":"2018-10-23 00:40:31","date_publish":"2017-03-16 10:12:57","description":"The Swedish singer, 29, lifted up her T-shirt and flashed her bare breasts to the crowd on Wednesday, revealing her braless chest to shocked audience members at the O2 Ritz in Manchester.","filename":"data/vaneerConsumption/SwedishsingerToveLoshocksbyflashingherbarebreasts.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E534A0F00000578-0-image-a-63_1489659170793.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319510_Swedish-singer-Tove-Lo-shocks-flashing-bare-breasts_1540255231.html","title":"Swedish singer Tove Lo shocks by flashing her bare breasts","title_page":"Swedish singer Tove Lo shocks by flashing her bare breasts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's become known for her daring performances, and Wednesday night was no different for Tove Lo.\nThe Swedish singer, 29, lifted up her T-shirt and flashed her bare breasts to the crowd, revealing her braless chest to shocked audience members at the O2 Ritz in Manchester.\nTove's X-rated antics went down a storm with fans, who cheered as she made the bold onstage statement.\nScroll down for video\nDaring to bare: Singer Tove Lo lifted up her T-shirt and flashed her bare breasts to the crowd at the O2 Ritz in Manchester on Wednesday night\nDramatic: Tove's X-rated antics went down a storm with fans, who cheered as she made the bold onstage statement\nThe star was clad in a simple rock T-shirt and tan leather trousers bearing red lettering running down the sides.\nShe teamed the look with a high-waisted pair of fishnet tights for added sex appeal.\nJust last month, Tove also flashed her chest while performing onstage at Boston's House of Blues.\nDuring the US leg of her Lady Wood tour, she nonchalantly hoisted up her black top and gave her braless bosom a moment in the spotlight while continuing to sing.\nLaid back: The star was clad in a simple rock T-shirt and tan leather trousers bearing red lettering running down the sides\nTop of the crops: She teamed the look with a high-waisted pair of fishnet tights for added sex appeal\nCheeky: The star went braless underneath her loose T-shirt\nBarefoot: The star was in her element as she took to the stage\nAnd the blonde stunner, who is supporting Justin Bieber at British Summer Time Hyde Park on 2 July, appeared to be quite satisfied with her performance, as she later took to Instagram to share a shot of herself enjoying a celebratory drink.\nIn the image, she is seen sipping from an ice-filled oversized cocktail glass at the popular live music venue, while wearing a baggy denim jacket.\n'Boston I'm celebrating your awesomeness you were a f***king maaaagical crowd... THANK YOU,' she captioned the shot.\nBare: Tove Lo flashed her bare breasts while performing at Boston's House of Blues on Sunday\nFar from shy: The Swedish singer showed she's far from shy about showing off her assets\nThis isn't the first time that the Talking Body hitmaker - real name Ebba Tove Elsa Nilsson - has given fans a live view of her ample assets.\nAt Philadelphia's Jingle Ball in December, she took to the stage braless once again, wearing a mustard mesh top over black pasties, which covered her nipples.\nThe singer-songwriter rounded off her look with a pair of high-waisted pink leopard print hotpants.\nAnd in November, she turned heads when she stepped out at Australia's ARIAs wearing a sheer orange dress with a uterus printed on it.\nRoadshow: The 29-year-old star is currently on the US leg of her international Lady Wood tour\nThe graduate of musical magnet school Rytmus Musikergymnasiet hit a career high in 2014 the US.\nHer single Habits (Stay High) scored international success despite Lo initially self-released Habits in March 2013, and then reissuing it in December.\nThe song was remixed with California duo Hippie Sabotage and the remix hit the top 10 in a half-dozen countries in Europe and Oceania.\n'The thing that I love about pop music is the simplicity and the directness of it.' she previously told Entertainment Weekly.\nI'll drink to that! After the show, she shared a shot of herself enjoying a giant cocktail\n'For me, I love the mix of when it’s bittersweet in that sense. It can be a happy beat that you can dance to, but it still has to have a little bit of pain in there.\n'Even if it’s a party song, if you’re having the best night of your life, it’s still going to end.\n'You get kind of this desperation to not want something good to end. And that’s beautifully sad in a way.\n'All that mixed together is what I want my songs to be. All of that at the same time. That’s kind of how I am—a roller coaster of emotions.'\nFeeling nippy? Tove Lo exposed her breasts at the Jingle Ball in Philadelphia in December","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319510/Swedish-singer-Tove-Lo-shocks-flashing-bare-breasts.html"}
