{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-23 02:49:12","date_modify":"2018-10-23 02:49:12","date_publish":"2016-01-28 18:03:53","description":"A Stockholm couple has built a giant greenhouse around their abode, keeping their home toasty all year round just by harnessing the sun’s warmth.","filename":"data/vaneerConsumption/Swedishfamilysurroundtheirhomewithglasstokeepintheheatandlowertheirbills.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC944C00000578-0-image-a-7_1454002543555.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421412_Now-s-GREEN-house-Swedish-family-surround-home-glass-heat-lower-bills-grow-veg_1540262952.html","title":"Swedish family surround their home with glass to keep in the heat and lower their bills","title_page":"Swedish family surround their home with glass to keep in the heat and lower their bills | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"How far would you go to save on your heating bill?\nWhile most of us might add a few draft excluders, install double-glazing, or even wear an extra jumper, one Swedish family has taken things a step further.\nA Stockholm couple has built a giant greenhouse around their abode, keeping their home toasty all year round simply by harnessing the sun's warmth.\nA Stockholm couple has built a giant greenhouse around their abode, keeping their home toasty all year round simply by harnessing the sun's warmth. The eco-home is surrounded by 4mm glass to trap the sun's heat. Marie Granmar and Charles Sacilotto live in the Naturhas, or 'Nature House', with their young son\nThe actual house itself is a summer home, perfectly suited to the clement weather of the Scandinavian summer. However, it was not built for the harsher winters.\nIn a move to build a greener house and to winter-proof the summer house, the couple built a greenhouse around their property to capture the heat from the sun.\nThis makes it more suitable for year-round living, including through the long winter, which can last from October to April.\n'This is a normal greenhouse. It's like any greenhouse you can buy on the market,' explains Marie Granmar, who lives in the Naturhas, or 'Nature House', with partner Charles Sacilotto and their son.\nIt is a summer home, perfectly suited to the clement weather of the Scandinavian summer, but has been reinforced for the winter by surrounding it with glass to harness solar heat. In winter the average temperature in Stockholm can be -2˚C, but the upstairs of the house can reach a comfortable 15 to 20˚C (59 to 68˚F)\nIn a video tour of the home, from video journalist Kirsten Dirksen, the couple explain the how's and why's behind their house within a house.\nLIVINING IN THE NATURHAS Stockholm couple Marie Granmar and Charles Sacilotto designed and built the Naturhas, or 'Nature House', when they were unable to find a plot of land to build a new house. It is a summer home, perfectly suited to the clement weather of the Scandinavian summer, but has been reinforced for the winter by surrounding it with glass to harness solar heat. In winter the average temperature in Stockholm can be -2˚C, but the upstairs of the house can reach a more than comfortable 15 to 20˚C (59 to 68˚F). Thanks to the warm climate created by glass, the family are able to grow vegetable such as tomatoes and figs on wooden decking. The eco-home's water supply is collected from rainwater, and the waste system is also off grid.\n'This is a house that's very dependent on the sun,' explained engineer Charles Sacilotto: 'If there's no sun, it's almost the same temperature inside and outside.'\nHowever, it doesn't take much sun to heat the home.\nGiving the example of early January, in which the average temperature can struggle to rise above -2˚C, the upstairs of the house can reach a more than comfortable 15 to 20˚C (59 to 68˚F).\nThe self-sufficient home is styled on designs from Swedish eco-architect Bengt Warne.\nIn addition to the solar heating generated from the 4mm glass, the house's water supply is collected from rainwater, and the waste system is also off-grid.\nThanks to the climate created by glass, the family are able to grow vegetable such as tomatoes and figs on wooden decking.\nThe couple had originally planned to build a new house, but due to scarce availability of plots, they opted to reinforce the summerhouse.\n'The nice thing about [the house] is that we don't have a roof on the house anymore, we actually have a terrace on top and an extra living area,' explained Granmar.\nThe design works so well that the there are vents in the top and sliding doors on multiple levels to let out the heat when it gets too hot.","url":"https://www.dailymail.co.uk/sciencetech/article-3421412/Now-s-GREEN-house-Swedish-family-surround-home-glass-heat-lower-bills-grow-veg.html"}
