{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-23 03:45:45","date_modify":"2018-10-23 03:45:45","date_publish":"2016-01-11 16:41:13","description":"Stockholm Police have now admitted to playing down the fact that girls were sexually assaulted by 'male unaccompanied underage refugees', at the We Are Sthlm festival in August last year.","filename":"data/vaneerConsumption/Swedishpoliceareaccusedofcoveringupsexattacksafternewsblackout.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300CC73E00000578-0-image-a-93_1452532402853.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394161_Now-Swedish-police-accused-covering-sex-attacks-news-blackout-migrant-gang-surrounding-molesting-teenage-girls-music-festival_1540266345.html","title":"Swedish police are accused of covering up sex attacks after news blackout","title_page":"Swedish police are accused of covering up sex attacks after news blackout | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swedish police have been accused of covering a number of sexual assaults on teenage girls at a music festival in Stockholm last summer - because a number of the suspects were underage refugees.\nTeenage victims have spoken of being groped between the legs, while boys 'ran their hands' over their bodies in the crowds at the festival in August, but official police reports makes no mention of the assaults.\nPolice have now admitted to playing down the events at the We Are Sthlm festival last summer, as they feared the information could be used by right-wing campaigners for anti-immigrant propaganda.\nHushing up: Stockholm Police have admitted to playing down the fact that girls were sexually assaulted by 'male unaccompanied underage refugees' at the We Are Sthlm festival in August last year\n'You only had to move a few feet to get grabbed. They pushed you in, and then one hand came out of nowhere and grabbed your breasts - or for some of my friends who wore dresses, between the legs,' Molly, 17, who attended the youth festival with four of her friends, told Expressen.\n'You locked eyes with other girls who were standing with a guy behind them, and they looked like they were panicking.'\n'If you said no, they were their with the hand again, if you pushed them away it egged them on and they called their mates. It was impossible to get away on your own.'\nRoger Ticoalu, who heads Stockholm city government's events department, said Monday that a 'large part' of those detained were from Afghanistan, many carrying temporary ID-cards issued to asylum-seekers.\nHe said about 20 teenage girls filed complaints of sexual assault and that about 200 suspects were detained and ejected from the festival for sexual assault and other offenses. It wasn't immediately clear whether any of them were arrested and charged.\nHorrific: Victims at the festival, which is aimed at teens from 13 to 19, has told of how they could not move in the crowd without being groped and assaulted, with one saying protests only 'egged them on'\nTicoalu said organizers received reports already in 2014 of groups of young men and boys groping girls in a systematic manner. Efforts were put in place, including more security guards, to prevent a repeat in 2015 but instead the problem got worse, he said.\n'We've always had individual cases' of sexual assault, he said. 'But here we have a larger group doing it almost in an organized way. It's a completely new level of obscenity.'\n'You have a large group of boys surrounding the girls,' he said. 'They pretend to dance. They come closer and closer. Then they start touching their breasts and genitals. In some cases in combination with theft.'\nHowever, despite what appears to have been dozens of sexual assaults, local police summarised the 2015 edition of the festival, aimed exclusively at teens from 13 to 19, as a quiet event.\n'We had comparatively few crimes and few arrests considering the number of attendants,' a statement on Stockholm Police's website read.\nThe police have now been accused of 'hushing up' internal reports of sexual assaults filed during the youth festival, attended by some 170,000 teenagers in 2015, because the suspects were refugees.\nOutraged: Swedish Prime Minister Stefan Lofven has called for an investigation into the potential police cover up of migrant sex attacks, calling it 'a problem for our entire nation'\nQuoting sources within the force, Dagens Nyheter says Stockholm Police consciously avoids to report on phenomenons which can be tied to perpetrators of a foreign background, because they fear it may be used as propaganda by right-wing politicians.\n'This is a sore point. Sometimes we dare not tell how it is because we think it plays into the hands of the [right wing populist party] Sweden Democrats,' Stockholm police chief Peter Ågren, who was in charge of police at the event in 2014, told Dagens Nyheter.\nSwedish Prime Minister Stefan Löfven has today expressed his outrage at a potential cover up by police, firing off some stern words in an official statement.\n'Police should prosecute crime, and sue guilty people. And should not for any kind of reason try to hide something. This is a problem and we are going to bring it to light.\n'I feel a very strong wrath over the fact that you women cant go to a music festival without being violated, sexually harassed and attacked. This is a huge problem for those who are affected and for our entire nation. We will not back down an inch, and we will not turn out gaze.\nToday, opposition leader Anna Kindberg-Batra has called interior minister Anders Ygeman to explain the alleged police cover up to the Parliamentary Committee of Justice.","url":"https://www.dailymail.co.uk/news/article-3394161/Now-Swedish-police-accused-covering-sex-attacks-news-blackout-migrant-gang-surrounding-molesting-teenage-girls-music-festival.html"}
