{"authors":[],"date_download":"2018-10-30 01:22:31","date_modify":"2018-10-30 01:22:31","date_publish":"2016-04-06 08:00:00","description":null,"filename":"data/vaneerConsumption/SweepingtheNationat15anHour.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/04/Secretary_Kerry_Walks_and_Talks_With_California_Gov._Brown_at_the_COP21_Climate_Change_Summit_in_Paris_282298335695329.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862551.html","title":"Sweeping the Nation at $15 an Hour","title_page":"Sweeping the Nation at $15 an HourThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"By 2022, if a small business owner attempting to prosper in Planet California wants someone to sweep the floor or cook the fries, it will cost him/her $31,200 per year ($15 x 40 hours per week x 52 weeks) plus Social Security costs and plus the cost of whatever benefits Democrat California legislators and the federals mandate in the name of “economic justice.”\nMonday both California and New York signed laws moving those states to the $15 per hour starting wages in steps. (I’ll wait here while TAS readers try to remember how old they were before they first made $31K per year for work at a considerably higher level than sweeping the floor or cooking the fries.)\n“This is about economic justice,” California governor Jerry “Moonbeam” Brown said while signing the bill into law (ironically, at the Ronald Reagan State Building). “This is about people. It’s about creating a little tiny amount of balance in a system that every day becomes more unbalanced.”\nIf anything or anyone is unbalanced, it is Brown and the Democrats who enacted this job-killing, inflation-producing abomination. (I’d also throw in unhinged.) The cost to Californians and New Yorkers is almost incalculable. First there’s the cost of raises for government employees now making less than what the new and grandiose floor calls for. One study puts this at $3.6 billion per year for California. Then there’s the cost of higher prices for goods and services as businesses must raise their prices to cover their higher overhead. Then there’s the price of increased welfare payments for those who can’t get on the first rung of the job ladder because they aren’t worth $15 per hour doing anything, let alone sweeping the floor or cooking the fries (not to mention the cost of additional law enforcement to deal with what some of these idle hands will get up to). Then there’s the cost of inflation that all of this will surely cause. And there’s the cost of businesses that will go belly-up, and businesses that won’t be started because the potential entrepreneurs who would start them would see that the deck is too steeply stacked against them.\nBut these very real costs, measured both in dollars and in damaged lives for those who can’t find work, are of no concern to the class demagogues whose political careers depend on the votes of the something-for-nothing crowd. Many beating the drum of “economic justice” understand economics about as well as Kim Kardashian understands nuclear physics. And the sentient few on the left who do understand the havoc their policies will cause don’t care, their politics and their careers being more important than the welfare of the republic. Way more important.\n“Wage disparity,” you see, is to Hillary Clinton and Bernie “Mustache Pete” Sanders what global warming is to Barack Obama. The most important issue out there. To Clinton and Sanders, and those who “think” like them, the republic can’t continue to stand if experienced, skilled workers with good work habits who contribute significantly to the creation of wealth are rewarded financially more than unskilled, inexperienced workers who barely hit their weight, if they hit it at all. To paraphrase and bring Marx up to date: “From each according to his ability, to each according to the extent he/she is willing to vote Democrat in order to keep this unarmed robbery going.”\nClinton and Sanders, bowling for votes on the populist left, were quick to praise this economic train wreck and suggest that the movement to overpay new and unskilled workers will “sweep our nation.”\nSadly, they may be right. How insane an idea is seems to bear little relationship to how likely it is that it will be made public policy. This idea has its supporters in other jurisdictions, many of which will surely fall in line. This really bad idea may indeed “sweep our nation.” If it does, there will be few out there sweeping the floors in the nation’s businesses. And how many folks will then be stepping across the unswept floors to order their $12 burger and fries from a machine?\nThat lefties should pursue this transparently destructive policy doesn’t surprise me at all. These folks recognize no limit they are bound to respect in pursuit of the votes of “low-information-voters” (an unlovely euphemism, but accurate enough). What does surprise me a bit is what pikers they are turning out to be. Why $15 an hour? If these folks believe, as they implausibly insist that they do, that a high minimum wage doesn’t kill jobs, doesn’t destroy businesses, and doesn’t cause inflation, then why not insist on a $1000 per hour minimum wage? Then we would all be rich and our troubles would he over.\nMaybe this is what Governor Moonbeam was getting at in his Monday remarks on the new law: “It’s not the end of the struggle,” His Mooniness said. “But it’s a very important first step. Let’s keep it going. We’re not stopping here.”\nStand by. We’ve been warned. The craziness isn’t over.","url":"https://spectator.org/65975_sweeping-nation-15-hour/"}
