{"authors":[],"date_download":"2018-10-22 22:58:27","date_modify":"2018-10-22 22:58:27","date_publish":"2014-05-13 00:00:00","description":"A common yearning for change coupled with pragmatism swept Rouhani into power, ushering in a dramatic change in tone for the government of Iran.","filename":"data/vaneerConsumption/SwepttoPoweronDesireforChangeIransRouhaniNowMustDeliver.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/432136/140509-iran-rouhani-mn-1130_2bfc6faa16eaa5128e6a7e2500acd122.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_twitter-diplomacy_swept-power-desire-change-irans-rouhani-now-must-deliver-n101516_1540249107.html","title":"Swept to Power on Desire for Change, Iran's Rouhani Now Must Deliver","title_page":"Swept to Power on Desire for Change, Iran's Rouhani Now Must Deliver - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"TEHRAN - Like millions of Iranians, “Shayan” just wanted the government to listen to him in the wake of disputed 2009 elections.\n“I was out on the streets during 2009 protesting peacefully,” said the student, who asked that his real name not be used out of fear for his security. “I was not looking for regime change, I just wanted my voice heard.”\nBut after months of turmoil, Iranian authorities cracked down on protesters demanding social liberalization, democracy and economic reform. Shayan, who was among thousands who are thought to have been detained, says he was beaten and held incommunicado for days.\nPlay Facebook\nTwitter\nEmbed Chapter 1: Twitter Diplomacy 5:52 autoplay autoplay Copy this code to your website or blog\nAlthough Shayan was released without being charged with a crime, the memory still haunts him.\nSo his friends reacted with disbelief when Shayan decided to vote for centrist candidate Hassan Rouhani in elections last summer.\n“My friends thought I was crazy but I told them Iran is constantly evolving, and if you don’t participate you are not going to be part of the evolution,” he said. “So I voted for Rouhani.”\nShayan was not alone. A common yearning for change coupled with pragmatism swept Rouhani into power, ushering in a dramatic change in tone for the government of Iran.\nDuring his campaign, Rouhani promised to bring the country in from the cold internationally, revive the economy, sort out its nuclear dispute with the West and give people more social freedoms. Months later, Iran and the United States, France, Germany, Britain, China and Russia restarted long-stalled negotiations over the country’s disputed nuclear program.\n“[Rouhani] was not ideal but he was the best choice we had, he is not a moderate Khatami but he seemed to be offering us what we wanted,” Shayan said, referring to reformist Mohammad Khatami who was president from 1997 to 2000.\nAccording to former British ambassador to Iran, Richard Dalton, Iranians are like any other set of voters around the world: They choose the candidate most likely to deliver what they want, or at least to prepare the ground for others who will do so later.\nPlay Facebook\nTwitter\nEmbed Iran's President Hassan Rouhani speaks in exclusive interview 8:13 autoplay autoplay Copy this code to your website or blog\nMany Iranians “didn’t vote because they thought [Rouhani] was one of their own stripe,” said Dalton, an associate fellow at London-based think tank Chatham House. “They thought he was most likely of the candidates on offer to prepare the country for movement in the direction they aspired to in the long-term, and would meanwhile at least try to do some things well.”\nThere are those in Iran who demand fundamental changes from the theocratic government, but Rouhani isn’t one of them. The moderate cleric has walked the Islamic Republic’s corridors of power throughout his career.\nRouhani was a member of Iran’s parliament for 20 years, and held important positions in government, heading both civilian and military bodies. When Robert McFarlane, President Ronald Reagan's national security adviser, came to Tehran in May 1986, Rouhani was one of the three people who talked to him about buying weapons. Eventually, this sale came to light as part of the infamous Iran-Contra affair.\nPlay Facebook\nTwitter\nEmbed FROM NBC'S ARCHIVES: Iran protest turns violent 2:10 autoplay autoplay Copy this code to your website or blog\nRouhani was also the country’s chief nuclear negotiator, which earned him the moniker the \"diplomat sheikh.\" With a resume like that you could not be anything but a trusted insider.\nIt was his mild manner, smiling disposition, good grasp of English, use of social media and promises of moderation that won over so many voters.\nSo while Rouhani’s landslide victory was also widely seen as the result of the 2009 Green Movement and its crowds chanting pro-reform slogans, religious conservatives also celebrated his victory and marched in celebration.\nNow Rouhani is under immense pressure to deliver. He must keep happy - or at least in check - hardliners who are suspicious of a nuclear deal.\n“There is a sense that [Rouhani] might put Iran on a slippery slope to seriously diluting the revolution and taking power out of the hands of people who have wielded it hitherto,” Dalton said.\nPlay Facebook\nTwitter\nEmbed Iran's President Rouhani speaks in exclusive interview, part 3 5:52 autoplay autoplay Copy this code to your website or blog\nRouhani also has to revive an economy in tatters. If he doesn’t make these changes, hardliners will be emboldened and voters could well turn on him.\nAs Shayan says, “It’s still too early to see if he can deliver.”\nPlay Facebook\nTwitter\nEmbed A Tale of Two Leaders 2:55 autoplay autoplay Copy this code to your website or blog\nF. Brinley Bruton reported from London.","url":"https://www.nbcnews.com/feature/twitter-diplomacy/swept-power-desire-change-irans-rouhani-now-must-deliver-n101516"}
