{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-22 23:46:56","date_modify":"2018-10-22 23:46:56","date_publish":"2017-04-26 08:32:17","description":"Catherine Gladwyn, 40, from Swindon, started being absent minded in February 2011 - often going upstairs to fetch something, but forgetting what it was.","filename":"data/vaneerConsumption/Swindonwomansmemoriesofdaughterwipedbybraintumour.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D33A600000578-0-image-a-29_1493191721767.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4446538_Mother-s-memories-daughter-wiped-brain-tumour_1540252016.html","title":"Swindon woman's memories of daughter wiped by brain tumour","title_page":"Swindon woman's memories of daughter wiped by brain tumour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother whose memories of her daughter's childhood were wiped out by a brain tumour has revealed how they came flooding back moments after the growth was removed through her nose.\nCatherine Gladwyn, 40, from Swindon, started being absent minded in February 2011 - often going upstairs to fetch something, but forgetting what it was.\nAs the instances became more frequent and frightening - culminating in her inability to recall Chloe's upbringing, doctors believed it was the sign of an early menopause.\nBut a routine test in March the next year revealed she had a thumbnail-sized tumour on her pituitary gland - the same as former It girl Tara Palmer Tomkinson.\nIncredibly, a complex four-hour operation in November allowed her memories of her daughter growing up to come straight back to her.\nCatherine Gladwyn, 40, started being absent minded in February 2011 - often going upstairs to fetch something, but forgetting what it was. The instances became more frequent and more frightening - culminating in her inability to recall Chloe's upbringing\nMs Gladwyn, who thought she was suffering from dementia, said: 'I couldn't picture anything about my daughter Chloe growing up, or what she was like.\n'It was like all those memories had completely been wiped. It was really frightening.\n'But the minute I had the surgery, where the tumour was removed through my nose, the first thing I thought off when I woke up was when she was about 18 months old.\n'I had vivid memories of her ... playing in a little blue dress with a yellow body suit underneath and then I slowly remembered more and more. It was amazing.'\nWhen her spontaneous memory loss first started, doctors noticed it coincided with her periods stopping.\nShe also suffered considerable hair loss, whenever she washed it and went from having a very active lifestyle, to feeling constantly exhausted.\nBut she realised her memory problems were becoming serious, after a shopping trip with Chloe, now 19, in November 2011.\nShe added: 'I think one of the most significant times was when I found a brand new denim jacket in my wardrobe and I thought Chloe had bought me a present or something.\nIncredibly, a complex four hour operation in November allowed her memories of her daughter growing up to come straight back to her (pictured at Great Western Hospital, in Swindon, in December 2012 after surgery)\n'When I asked her about it, she reminded me that we had bought it together, just a few weeks earlier.\n'The adverts would come on in the middle of a programme and after 30 seconds I'd have completely forgotten what programme I'd been watching.'\nLooking for answers, she went to her GP and after 12 months of going back and forth, was referred to a gynaecologist.\nThe minute I had the surgery, where the tumour was removed through my nose, the first thing I thought off when I woke up was when she was about 18 months old Catherine Gladwyn, 40\nAfter performing a full blood count, including a prolactin test to determine the levels of the hormone, which is usually only high in breastfeeding mothers, she discovered that, instead of the normal reading of 20, her level was 10,337.\nMs Gladwyn was then diagnosed with a Macro-prolactinoma tumour on the pituitary gland in her brain, which controls many of the body's hormones.\nShe said: 'It was difficult to hear, but I was glad to have a diagnosis. But it was also so difficult because by this stage, my memory was so bad, I was struggling to take anything they told me in.'\nDoctors gave her medication called Cabergoline in an attempt to reduce the amount of prolactin being produced.\nMs Gladwyn, who thought she was suffering from dementia, said: 'I couldn't picture anything about my daughter Chloe growing up, or what she was like'\nBut the drug proved unsuccessful. She had developed a resistance and her only option was neurosurgery.\nBy this stage, the tumour had wiped out her ability to read, meaning the Pituitary Foundation charity had to help her to understand the surgery consent forms.\nShe said: 'They were amazing. It was so difficult for me to process anything, so having someone who understood everything was really important.'\nOn November 21, 2012, the tumour was removed through her nose in a four hour operation at the Great Western Hospital, Swindon.\nThe minute Ms Gladwyn woke up from surgery, clear memories of her daughter came flooding back.\nFollowing the procedure, her life started returning to normal and she was able to go back to work.\nBut in June 2013, her symptoms came back, as she struggled to remember day to day tasks.\nMs Gladwyn said: 'At first, I thought it was because it was just stress from moving house, but my memory deteriorated quite quickly and I was constantly forgetting things again.'\nAfter seeking help, she was told the tumour had returned, but she was offered radiotherapy as it was too soon for further surgery.\nIn June 2013, her symptoms came back, as she struggled to remember day to day tasks. She underwent radiotherapy after being told the tumour had returned (picture in hospital after having gamma knife radiation - a treatment that specifically targets tumours)\nShe chose to have gamma knife radiation - a specifically targeted treatment, where a helmet is screwed into the skull and narrow beams are aimed at the tumour.\nMs Gladwyn said: 'It was horrible having the frame screwed into my skull, but it was just one dose, unlike conventional radiotherapy and I wouldn't have to travel back and forth to hospital every day for treatment.'\nIn March 2015, she was told that her tumour was shrinking and her prolactin levels has started to reduce.\nBut the reduction in the function of the pituitary gland means she needs to take a cocktail of drugs to maintain the hormone levels in her body.\nHer health problems gave her a new perspective on life and she left her job to set up her own business, working as a virtual assistant - helping businesses with admin tasks from home.\nShe said: 'Everything I have been through has been really difficult, but it's made me think about what I want to be doing and to just go out there and do it.'\nThe Pituitary Foundation estimate that there are at least 70,000 people in the UK with pituitary conditions. But it could be more because a lot of symptoms are vague.\nPeople with recurring symptoms like headaches, nausea, poor concentration, irritability, tiredness, problems sleeping, lack of appetite, sexual and fertility difficulties, depression, increased thirst and excessive urinating should ask their GP to consider a pituitary problem.\nFor more information about the Pituitary Foundation, visit its website here.\nHer health problems gave her a new perspective on life and she left her job to set up her own business, working as a virtual assistant - helping businesses with admin tasks from home (pictured on holiday with Chloe in Turkey, August 2013)","url":"https://www.dailymail.co.uk/health/article-4446538/Mother-s-memories-daughter-wiped-brain-tumour.html"}
