{"authors":["Gianluca Mezzofiore For Mailonline"],"date_download":"2018-10-23 00:20:27","date_modify":"2018-10-23 00:20:27","date_publish":"2016-01-29 13:14:45","description":"Swiss residents will vote on a radical plan to guarantee a basic monthly income to everyone, regardless if they work or not. The initiative was proposed by a group of intellectuals.","filename":"data/vaneerConsumption/Swissgovernmentproposespayingeveryone1700amonth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/25838BD000000578-0-image-a-46_1454072812375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422775_Swiss-government-proposes-paying-1-700-month-work-not-bid-end-poverty-insists-people-want-job_1540254027.html","title":"Swiss government proposes paying everyone £1,700 a month","title_page":"Swiss government proposes paying everyone £1,700 a month | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swiss residents are to vote on a countrywide referendum about a radical plan to pay every single adult a guaranteed income of £425 a week (or £1,700 a month).\nThe plan, proposed by a group of intellectuals, could make the country the first in the world to pay all of its citizens a monthly basic income regardless if they work or not.\nBut the initiative has not gained much traction among politicians from left and right despite the fact that a referendum on it was approved by the federal government for the ballot box on June 5.\nSwiss residents could get a guaranteed monthly basic income of £1,700 a month regardless if they work or not\nThe radical plan also proposes that each child receives £100 a week\nUnder the proposed initiative, each child would also receive 145 francs (£100) a week.\nThe federal government estimates the cost of the proposal at 208 billion francs (£143 billion) a year.\nAround 153 billion francs (£105 bn) would have to be levied from taxes, while 55 billion francs (£38 bn) would be transferred from social insurance and social assistance spending.\nThe group proposing the initiative, which includes artists, writers and intellectuals, cited a survey which shows that the majority of Swiss residents would continue working if the guaranteed income proposal was approved.\n'The argument of opponents that a guaranteed income would reduce the incentive of people to work is therefore largely contradicted,' it said in a statement quoted by The Local.\nHowever, a third of the 1,076 people interviewed for the survey by the Demoscope Institute believed that 'others would stop working'.","url":"https://www.dailymail.co.uk/news/article-3422775/Swiss-government-proposes-paying-1-700-month-work-not-bid-end-poverty-insists-people-want-job.html"}
