{"authors":["Joshua Franklin"],"date_download":"2018-10-30 21:13:25","date_modify":"2018-10-30 21:13:25","date_publish":"2016-12-21 00:00:00","description":"RBS received full immunity for revealing the existence of the cartel to the Swiss Competition Commission.","filename":"data/vaneerConsumption/SwissCOMCOfinesJPMorganBarclaysandotherforLiborrigging.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_swiss-comco-fines-jpmorgan-barclays-and-other-for-libor-rigging-2016-12_1540934005.html","title":"Swiss COMCO fines JPMorgan, Barclays, and other for Libor rigging","title_page":"    Swiss COMCO fines JPMorgan, Barclays, and other for Libor rigging - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JPMorgan received the biggest fine. REUTERS/Reinhard Krause ZURICH — The Swiss Competition Commission (COMCO) fined several European and US banks almost 100 million Swiss francs ($97.3 million) over interest rate cartels, the latest punishment dished out in connection with rate-rigging scandals.\nCOMCO began its investigation in December 2012, after Barclays became the first bank to settle allegations it had attempted to manipulate the London Interbank Offered Rate (LIBOR), paying a $450 million fine to U.S. and UK authorities.\nThe COMCO penalties announced on Wednesday, the largest of which was a 33.9 million franc fine for JPMorgan Chase & Co, are relatively small compared to other sanctions doled out in rate-rigging cases.\nBut they are a further sign of the collusion which took place in the setting of interest rate derivatives, used by banks and companies to manage the risk of interest rates fluctuations.\nCOMCO said several banks had participated in cartels over Swiss franc Libor, the bid-ask spread on Swiss franc interest rate derivatives, Yen Libor, Euroyen TIBOR and Euribor.\nThe JPMorgan fine came after COMCO concluded it operated a bilateral cartel with Royal Bank of Scotland (RBS) with the aim of influencing the Swiss franc Libor benchmark between March 2008 and July 2009, COMCO said in a statement.\nRBS received full immunity for revealing the existence of the cartel to the COMCO.\nBarclays was fined 29.8 million francs for participating in a cartel in euro interest rate derivatives, COMCO said.\nProceeding are ongoing against BNP Paribas, Credit Agricole, HSBC, JPMorgan and Rabobank over the euro interest rate cartel, COMCO said.\n($1 = 1.0273 Swiss francs) (Editing by Michael Shields)","url":"https://www.businessinsider.com/swiss-comco-fines-jpmorgan-barclays-and-other-for-libor-rigging-2016-12"}
