{"authors":["Press Association"],"date_download":"2018-10-23 01:24:52","date_modify":"2018-10-23 01:24:52","date_publish":"2016-01-28 15:44:58","description":"Swiss prosecutors say they have been given important evidence by a whistle-blower in their investigation into FIFA and its suspended president Sepp Blatter. ...","filename":"data/vaneerConsumption/Swissprosecutorsfifaprobeaidedbynewinformationfromwhistleblower.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-311a7d05-36d5-4983-8767-3f98670f86c9-2vdWmEltwXfba0ce28e632a3c8e1-112_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421107_Swiss-prosecutors-FIFA-probe-aided-new-information-whistle-blower_1540257892.html","title":"Swiss prosecutors' fifa probe aided by new information from whistle-blower","title_page":"Swiss prosecutors' fifa probe aided by new information from whistle-blower | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Swiss prosecutors' FIFA probe aided by new information from whistle-blower\nSwiss prosecutors say they have been given important evidence by a whistle-blower in their investigation into FIFA and its suspended president Sepp Blatter.\nThe Swiss attorney general's spokesman Andre Marty said the case was making progress and says formal charges could be brought by the end of the year.\nMarty told German broadcaster ARD: \"A witness, a so-called whistle-blower, gave us interesting information relevant to the case, which brought us markedly forward in the criminal investigation.\"\nSwiss prosecutors have moved 'markedly forward' in FIFA investigation\nSwiss attorney general Michael Lauber opened criminal proceedings against Blatter in September over suspected criminal mismanagement and misuse of FIFA money in two cases - a £1.3million payment made to UEFA president Michel Platini in 2011, and selling undervalued World Cup TV rights to the disgraced former FIFA vice-president Jack Warner.\nBlatter and Platini were both banned for eight years last month by FIFA's ethics committee over the payment.\nMeanwhile, the election contest to find Blatter's successor is hotting up with a series of nominations being announced for Gianni Infantino, the UEFA general secretary who is one of five candidates for the vote on February 26.\nCONMEBOL, the confederation which represents the 10 South American countries, has formally announced its support for Infantino, a Swiss/Italian lawyer.\nThe Central American Football Union (UNCAF), which represents seven small central American countries, has also announced its support for Infantino, as have several Caribbean countries.\nThat support should see Infantino make a determined push against the current favourite Sheikh Salman Bin Ebrahim Al Khalifa, the president of Asian football who also has strong backing in Africa.","url":"https://www.dailymail.co.uk/wires/pa/article-3421107/Swiss-prosecutors-FIFA-probe-aided-new-information-whistle-blower.html"}
