{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:38:40","date_modify":"2018-10-30 18:38:40","date_publish":"2016-07-25 10:17:30","description":"Switzerland has added dozens of guards and a surveillance drone at its Italian border to stanch the flow of migrants heading north to Europe.","filename":"data/vaneerConsumption/SwissTightenBordersasMigrantsSeekNewRouteIntoEurope.json","image_url":"https://media.breitbart.com/media/2016/07/migrants-italy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_07_25__1540924720.html","title":"Swiss Tighten Borders as Migrants Seek New Route Into Europe","title_page":"Swiss Tighten Borders as Migrants Seek New Route Into Europe","title_rss":"NULL","source_domain":"breitbart.com","text":"Switzerland has added dozens of guards and a surveillance drone at its Italian border in an effort to reinforce security and stanch the flow of migrants heading into northern Europe.\nEver since an agreement between the European Union and Turkey closed down the “Balkan route” to Germany last March, migrants trapped in Italy after crossing the Mediterranean from North Africa have focused on Italy’s northern borders, and particularly the route through southern Switzerland.\nNew Swiss measures have included the deployment of an Aerospace Ranger Su-27 surveillance drone, which patrols along the border in an attempt to catch sight of migrants trying to cross illegally into Switzerland. Some migrants have resorted to hiking obscure mountain trails in order to elude Italian and Swiss authorities.\nSince January 1, more than 14,000 migrants have entered, or attempted to enter, Switzerland illegally. According to data reported by Swiss television, the new measures have made a notable difference in the effectiveness of border security, with some 70% of illegal being sent back to Italy, as opposed to only 10% up to a month ago.\nThe migrants’ new itinerary takes migrants through northern Italy’s beautiful Great Lakes region, in the foothills of the Italian Alps.\nMigrants caused a media stir earlier this month after setting up a makeshift camp around the San Giovanni train station at the southern tip of Lake Como, vacation home to such celebrities as George Clooney.\nA vocal spokesman for open European borders to migrants, Clooney came under fire earlier this year for the apparent inconsistency between his demands for privacy in his 22-room luxury villa in Lake Como and his insistence that others take in more migrants.\nReports from northern Italy over the past year suggest that the Clooney couple has found their $100 million Lake Como property to be too public, and rumors that they might be selling the estate have continued to circulate.\nLocal mayor Roberto Pozzi has made extra efforts to guarantee the actor’s privacy, Going so far as to impose a $600 fine for anyone found trespassing on or around the actor’s 18th-century estate.\nThough many find it glamorous to have Clooney as a neighbor, some, like local fisherman Livio de’ Angeli, resent the restrictions imposed to ensure the actor’s privacy.\n“I used to be able to leave my car here on the ramp leading down to the water, but now I can’t—I’d get fined by the police,” the man said. “You’re not allowed to park anywhere near the villa and you can’t take a boat within 100 meters of the house. It’s like living in a mini dictatorship.”\nCurrently, there are more than 130,000 mostly African migrants living in welcome centers throughout Italy, waiting for their asylum requests to be processed. Many have expressed their unwillingness to remain in Italy, insisting that they be transferred to Germany and other countries in northern Europe.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/europe/2016/07/25/swiss-tighten-borders-migrants-seek-new-route-northern-europe/"}
