{"authors":["Ollie Gillman For Daily Mail Australia"],"date_download":"2018-10-22 22:36:57","date_modify":"2018-10-22 22:36:57","date_publish":"2017-04-26 05:20:03","description":"The boy had to be rescued by firefighters after wiggling his way inside the toy machine at The Australian Hotel and Brewery at Rouse Hill in Sydney's west.","filename":"data/vaneerConsumption/Sydneyfirefightersfreeboyfromtoyvendingmachine.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9C1FD800000578-0-image-a-52_1493179203816.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446252_Firefighters-free-boy-toy-vending-machine-Sydney_1540247817.html","title":"Sydney firefighters free boy from toy vending machine","title_page":"Sydney firefighters free boy from toy vending machine | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Not much can come between a child and their favourite toy.\nBut this three-year-old took things to a whole new level, getting himself stuck inside a soft toy vending machine.\nThe boy had to be rescued by firefighters after wiggling his way inside the claw machine and becoming trapped.\nDespite the claustrophobic experience, firefighters said the boy was having 'the time of his life' inside and appeared to be in no rush to get back out.\nA three-year-old boy had to be rescued by firefighters after getting trapped inside a soft toy vending machine\nThe boy had to be rescued by firefighters after wiggling his way inside the machine and becoming trapped\nThe boy's family were having a drink at The Australian Hotel and Brewery at Rouse Hill in Sydney's west on Anzac Day when he clambered into the skill tester machine.\nThe boy's mother called in firefighters after it became clear the boy - who remained calm throughout the ordeal - could not work out how to get back out.\nCaptain David Richards of 083 Riverstone Fire and Rescue told the Daily Telegraph that the boy said he 'felt good' and happily took a drink of cold water from rescuers as he waited to be freed.\n'When we arrived, we found the boy had crawled through the hole in the machine but was enjoying himself, playing with the toys. He was not distressed,' Captain Richards said.\n'We then used our rapid intervention kit which has door-busting tools to break open the door to the vending machine to take him out.\n'This is the first time we have rescued someone from a vending machine though we had done rescues on someone's hand stuck inside.'\nDespite the claustrophobic experience, firefighters said the boy was having 'the time of his life' inside the machine and appeared to be in no rush to get back out\nThe boy's family were having a drink at The Australian Hotel and Brewery (pictured) at Rouse Hill in Sydney's west on Anzac Day when he clambered into the machine\nCaptain Richards added that pub staff had been 'fantastic' throughout the unusual incident.\nRiverstone Firefighters later revealed on Facebook that the boy did not particularly want to get out of the machine and had been having fun playing with all the toys.\n'The young boy was not distressed and was having the time of his life playing with all the toys,' it said.\n'Firefighters were able to talk to the child and reassure him whilst carefully opening the door as to not cause the machine to break and injure the child.\n'Using our Rapid Intervention Kit and some careful manipulation techniques Firefighters were able to open the door and free the child.\n'Firefighters returned the very happy child to his parents who were very relieved.'\nComments on Facebook suggested it was not the first time children had got themselves stuck inside the machine.\n'I have been there off-duty and on three occasions I have gotten kids out of that/ those machines,' firefighter Mick Kerslake said.\nMatt Cross added: 'Oh no it happened again.'","url":"https://www.dailymail.co.uk/news/article-4446252/Firefighters-free-boy-toy-vending-machine-Sydney.html"}
