{"authors":["Rachel Eddie For Daily Mail Australia"],"date_download":"2018-10-22 20:44:40","date_modify":"2018-10-22 20:44:40","date_publish":"2016-01-28 03:30:15","description":"A woman, 91, has died after a silver Toyota sedan veered off the road and smashed into a wall. The 63-year-old woman driving and a 77-year-old man were also injured at the Greenacre, Sydney crash.","filename":"data/vaneerConsumption/Sydneywomanaged91diesafterbeinghitbyacarinGreenacre.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6971400000578-0-image-a-111_1453953931400.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420292_Fire-fighters-free-driver-trapped-wreckage-car-critical-injuries-ploughed-wall-injuring-two-others_1540241080.html","title":"Sydney woman aged 91 dies after being hit by a car in Greenacre","title_page":"Sydney woman aged 91 dies after being hit by a car in Greenacre | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 91-year-old woman has died in hospital after she was struck by a 63-year-old driver who then crashed into a wall where a man was sitting, which left both pedestrians and the driver in hospital.\nThe silver Toyota sedan had veered off Boronia Road in Greenacre, western Sydney, around 11am on Thursday, and struck the 91-year-old woman after mounting the footpath, witnesses told police.\nThe 63-year-old motorist then allegedly continued driving along the road for about 200 metres before again veering off and smashing a power pole and wall where a man was sitting.\nThe 91-year-old woman suffered critical injuries to her head, chest and limbs, but later died at Liverpool Hospital.\nScroll down for video\nTwo women have suffered severe injuries after a 63-year-old driver ploughed her silver Toyota sedan into a wall on Boronia Road in Greenacre around 11am on Thursday. A 77-year-old man is in a stable condition\nThe driver was trapped inside the wreckage of her car for an hour until emergency services could free her. She was then transported to Liverpool Hospital in a serious condition\nThe 77-year-old man injured was taken to the same hospital in a stable condition with minor injuries to his head and limbs.\nHe'd been sitting on the wall when the silver Toyota sedan struck.\nThe 63-year-old woman driving was trapped inside her silver Toyota sedan for an hour before emergency services managed to free her.\nShe was taken to Liverpool Hospital in a serious condition with injuries to her head, chest and limbs, the NSW Ambulance spokesperson told Daily Mail Australia.\nAt about 5pm on Thursday, NSW Police said the 63-year-old remained in a serious but stable condition.\nThe crash, near the intersection at Highview Avenue, has caused road blockages along Boronia Road between Hume Highway and Hillcrest Avenue, Live Traffic Sydney said.\nBus routes 913 and M90 are experiencing delays and have been diverted from Boronia Road to Rawson Road.\nInvestigations are continuing by Crash Investigation Unit and a report will be prepared for the Coroner.\nA NSW Ambulance spokesperson said the woman in her 90s who was struck suffered injuries to her head, chest and limbs\nA 63-year-old woman has been trapped in her silver Toyota sedan for an hour in Greenacre, western Sydney, after the car struck two pedestrians and smashed into a wall\nThe driver and a female pedestrian in her 90s, have both been taken to Liverpool Hospital. The driver is in a serious condition and the female pedestrian is in a critical condition\nA 90-year-old pedestrian struck was transported to Liverpool Hospital in a critical condition\nA 77-year-old male pedestrian was sitting on the wall when it was struck and has been taken to hospital with minor injuries to his head\nA woman has been trapped in the wreckage of her car for an hour in Greenacre, western Sydney, after she struck a woman in her 90s and smashed into a wall where a man was sitting","url":"https://www.dailymail.co.uk/news/article-3420292/Fire-fighters-free-driver-trapped-wreckage-car-critical-injuries-ploughed-wall-injuring-two-others.html"}
