{"authors":["Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-22 21:34:31","date_modify":"2018-10-22 21:34:31","date_publish":"2017-03-16 01:35:58","description":"A Mosman couple have bought back their stunning Sydney home for r $7.1 million, after selling it nearly seven years ago for $5.8 million.","filename":"data/vaneerConsumption/Sydneycouplebuyhomebackaftersellingit7yearsago.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E5014DD00000578-0-image-a-59_1489627526572.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318430_Couple-buy-home-selling-seven-years-ago_1540244071.html","title":"Sydney couple buy home back after selling it 7 years ago","title_page":"Sydney couple buy home back after selling it 7 years ago | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple have bought back their home for $7.1 million after selling it nearly seven years ago for $5.8 million.\nWith a stunning architectural design, views of Sydney harbour and an elegant L-shaped pool to cool off in, it's no wonder Armada Fund Management boss Christopher Monaghan and his wife, Kerryn, decided to return to their Mosman home, in Sydney's north.\n'It's like they had a good piece of art work and wanted it back,' said Monika Tu, of Black Diamondz, told Domain.\nScroll down for video\nA couple have bought back their home (pictured) for $7.1 million, after selling it seven years ago for $5.8 million\nThe property boasts a stunning architectural design, Sydney Harbour views and an elegant L-shaped pool to cool off in\nNatural light floods on of the main living areas - where Christopher Monaghan and his wife, Kerryn, will once again make themselves at home\nWith the luxurious design, it's no surprise why Armada Fund Management boss Christopher Monaghan and his wife Kerryn decided to return to the stunning Mosman home in Sydney's north\nA balcony perfect for taking in those harbour views. The property was listed in May 2016 with an $8 million guide, before it was relisted once more in the Spring later that year with a guide between $6.8 million and $7.4 million\nWooden floors and large living spaces means the Mosman property is perfect for families and entertaining guests\nAn L-shaped sofa to match the pool: The sleek living space opens out onto the extravagant pool area, shrouded in stylish vegetation\nThe property had been listed in May 2016 with an $8 million guide, before it was relisted once more in the Spring of that year with a guide between $6.8 million and $7.4 million.\n'When it first came back on the market they wanted it, but said they couldn't afford it, but things must have changed a few months later because they came back and snapped it up,' Ms Tu said.\nAnd while the couple's reason to return to the residence is not known – one can hardly blame them looking at the luxurious property.\nThe extravagant pool snakes around the various choice of alfresco areas - perfect for taking in the sweeping harbour views.\nHailed an 'entertainer's paradise dedicated to relaxed in and outdoor living' the four-bedroom home also boasts a 'spacious family environment'.\nWooden floors and large living spaces throughout means the property is perfect for families and entertaining guests.\nThe sleek main living space opens out onto the extravagant pool area, shrouded in stylish vegetation.\nThe Monaghan's took the keys off Future Fund founding board member Susan Doyle and her veteran equities husband Richard Douglas - whom they had originally handed them to nearly seven years ago.\nDaily Mail Australia has contacted Black Diamondz for comment.\nJust as luxurious in the nighttime as it is in the day. While the couple's reason to return to the residence is not known, one can hazard a guess why they chose the familiar and beautiful space\n'It's like they had a good piece of art work and wanted it back,' said Monika Tu, of Black Diamondz said of the couple's return to the Mosman property\nThe extravagant pool snakes around the various alfresco areas - perfect for taking in the sweeping harbour views\nIf the couple happen to tire of the stunning views, they can always turn on the wall-mounted television in one of the many living areas\nGlass and neautral tones are a main design focus at the Mosman property, which sprawls out over multiple floors\nHailed an 'entertainer's paradise dedicated to relaxed in and outdoor living' the four-bedroom home also boasts a 'spacious family environment'\nPerfect for wining and dining: The Mosman home features a stunning and sleek kitchen design\nThe Monaghan's took the keys off Future Fund founding board member Susan Doyle and her veteran equities husband Richard Douglas - whom they had originally handed them to nearly seven years ago","url":"https://www.dailymail.co.uk/news/article-4318430/Couple-buy-home-selling-seven-years-ago.html"}
