{"authors":["Laura House For Daily Mail Australia"],"date_download":"2018-10-22 23:20:39","date_modify":"2018-10-22 23:20:39","date_publish":"2017-03-10 02:49:01","description":"Lucy Baker, 25, who lives in Sydney, tried fad diets and gym memberships to lose weight. But after starting a 12 week program she learned about healthy eating and saw her body transform.","filename":"data/vaneerConsumption/SydneywomansayseatingMOREwaskeytoherfitphysique.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F79F200000578-0-image-a-22_1489113843898.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299648_Woman-reveals-eating-key-fit-physique_1540250439.html","title":"Sydney woman says eating MORE was key to her fit physique","title_page":"Sydney woman says eating MORE was key to her fit physique | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After graduating university, Lucy Baker, 25, tried everything to boost her fitness and get into better shape.\nThe London-born marketing executive, who moved to Sydney in January, would join gym memberships, purchase countless fad diets and restrict or count her calories.\nBut after finally signing up to a 12 week program and teaching herself about the importance of moderation and balance, Ms Baker saw her body transform and her energy levels skyrocket.\nLucy Baker, 25, (left in 2013 and right, now) spent years trying fad diets to lose weight and get fit but she only saw results after relaxing her strict diet and following a 12 week program\nMs Baker saw her body transform and her energy levels skyrocket\n'Before I started the program I was bad - I would binge on some days and do things like buy a family size box of chocolates and eat them all at once,' Ms Baker told Daily Mail Australia\n'Before I started the program I was bad - I would binge on some days and do things like buy a family size box of chocolates and eat them all at once,' Ms Baker told Daily Mail Australia.\n'I would eat quick and easy foods and while I did enjoy nice and healthy food, I would often just pick something up for dinner on the way home which is bad.\n'I also tried stupid fad diets and even tried eating salad every day for a week which was ridiculous because I hate salads.'\nAt first Ms Baker was overdoing it with her restrictive diet (left) so she ate more, gained seven kilos (right) and has never looked or felt better\n'The whole thing was about not getting on the scales or being restrictive and just looking at yourself in the mirror and seeing results or feeling them,' she said\nAfter seeing impressive transformation photos and reviews online, Ms Baker decided to sign up for Kayla Itsines' fitness program [not the diet program] for 12 weeks which saw her try a variety of quick workouts involving HIIT training and weights.\n'It was brilliant - all I needed was adjustable dumbbells, a mat and a resistance band at home,' Ms Baker said.\n'The whole thing was about not getting on the scales or being restrictive and just looking at yourself in the mirror and seeing results or feeling them. Within four weeks I was seeing results.\n'After four weeks I felt so much better. Before, I would get home and sit on the couch and go to bed at 9pm whereas afterwards, I would get home and feel so energetic and happy and I would look in the mirror and see my legs and stomach toning up.'\n'After four weeks I felt so much better. Before I would get home and sit on the couch and go to bed at 9pm whereas afterwards I would get home and feel so energetic,' Ms Baker said\nIn terms of diet, Ms Baker admits she probably overdid it at first as she became so excited by her transforming body\nWhat are Lucy Baker's top fitness tips? * Get advice from friends into fitness or see a personal trainer * Go to a class to build up confidence * You only need 30 minutes per day - not an hour or two hours * Small changes are the most important thing - and stick to them * Progress takes time - take it slow, drink lots of water and enjoy the process without being restrictive\nIn terms of diet, Ms Baker admits she probably overdid it at first as she became so excited by her transforming body.\nBut after learning that undereating would do nothing for her physique or energy levels, she researched healthy eating and instead of eating around 1,000 calories per day, she was eating closer to 2,000.\n'Eating more was so important. I saw my body get stronger and I felt so much better. At first I couldn't do any press ups and then I was able to do 20 in a row without a problem,' she said.\n'I try and keep all my meals nutritionally balanced - protein, good fats and vegetables - but I am so flexible as well and believe that treats or cheat meals are necessary.\n'Eating more was so important. I saw my body get stronger and I felt so much better. At first I couldn't do any press ups and then I was able to do 20 in a row without a problem,' she said\n'My personal experience is don't be afraid of food. Food is your friend. I was 100 per cent scared of carbs early on and I thought strict dieting was the only way,' she said\n'My personal experience is don't be afraid of food. Food is your friend. I was 100 per cent scared of carbs early on and I thought strict dieting was the only way. I am so relaxed now and if I want a treat every day I will have one.'\nMs Baker still incorporates Kayla Itsines' program into her everyday routine but she also recently joined the gym to have access to group classes and more weights.\nSince beginning her journey she has shared her fitness and health tips on her Instagram page, FitLifeLucy, where she has close to 80,000 followers.\nWriting on her page on Thursday, Ms Baker said: 'Absolutely anyone can be fit and healthy if you're willing to put in hard work. You need to set yourself goals, exercise regularly and eat good, nutritious food.'\nWriting on her page on Thursday, Ms Baker said: 'Absolutely anyone can be fit and healthy if you're willing to put in hard work,' she said\nWhat is a good short HIIT workout to do? Ms Baker recommends this 15 minute workout for first thing in the morning: HIIT training: 40 seconds on, 20 seconds rest of: Burpees Mountain climbers Squat jumps Jump lunges Abs/toe touches/pressups\n'Yep, that's it! No crazy diets, no cutting carbs or low calorie plans. Just plain and simple: exercise & good food. So if you want to have a donut or piece of cake today.. DO IT.\n'You don't need to deprive your body of the things you love, you just need to have them in moderation. I honestly used to wonder how people exercised regularly and enjoyed it. I now exercise probably 5 times a week, eat when I want and I'm SO happy for it.'\nAnd the most important thing? Enjoy it!\n'Progress can take time and sticking to it is so important,' she said.\n'Once you do, you start to enjoy it, your stress levels plummet and you feel fantastic.'","url":"https://www.dailymail.co.uk/femail/article-4299648/Woman-reveals-eating-key-fit-physique.html"}
