{"authors":["Jacob Polychronis For Daily Mail Australia"],"date_download":"2018-10-23 02:19:39","date_modify":"2018-10-23 02:19:39","date_publish":"2017-03-10 11:25:51","description":"John 'Sean' O'Malley is taking part in the Music & Memory program at Blacktown Hospital in northwest Sydney. He presented as 'angry' but begins happily dancing when Elvis plays.","filename":"data/vaneerConsumption/SydneydementiapatientdancestoElvis.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22300100000578-0-image-a-5_1489145001447.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300352_Sydney-dementia-patient-dances-Elvis_1540261179.html","title":"Sydney dementia patient dances to Elvis","title_page":"Sydney dementia patient dances to Elvis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the heartwarming moment an 'angry and agitated' dementia patient starts happily dancing to Elvis.\nJohn 'Sean' O'Malley is taking part in the Music & Memory program at Blacktown Hospital in northwest Sydney.\nThe program uses the personalised playlists of individuals to help those accessing health care to be happier and more social.\nScroll down for video\nJohn 'Sean' O'Malley is taking part in the Music & Memory program at Blacktown Hospital in northwest Sydney\nMr O'Malley is described as being 'distressed, angry and agitated' when he arrived at the hospital, but once the headphones are on, Mr O'Malley is seen clicking his fingers and wiggling his hips to the tune of Elvis\nIn the video by Western Sydney Health, Mr O'Malley is described as being 'distressed, angry and agitated' when he arrived at the hospital.\nBut once the headphones are on, Mr O'Malley is seen clicking his fingers and wiggling his hips to the tune of Elvis Presley's classic, Heartbreak Hotel.\nAs Elvis tunes continue to play, Mr O'Malley sings to the camera and begins to smile while dancing with his daughter and a nurse.\n'His whole behaviour has changed, so for us at home we haven't been as worried about how he is going in hospital,' daughter Trish Scerri said.\nAs Elvis tunes continue to play, Mr O'Malley sings to the camera and begins to smile while dancing within the wards\n'We know that his music has brought a lot of happiness while he has been here dancing around the wards.'\nClinical nurse consultant Katie Conciatore said the program allows for a more enjoyable atmosphere for dementia patients.\n'[The music] just creates a really positive and happy environment when we have this program running.'\nMore than 400,000 Australians are currently living with dementia.\nAustralian dementia rates rise by around 244 new diagnoses a day, according to Alzheimer's Australia.","url":"https://www.dailymail.co.uk/news/article-4300352/Sydney-dementia-patient-dances-Elvis.html"}
