{"authors":["Rachel Eddie For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 22:14:23","date_modify":"2018-10-22 22:14:23","date_publish":"2017-03-16 03:09:43","description":"Rain is continuing to batter NSW as locals are rescued from floodwaters in the state's northern coastline, as showers continue in Sydney - while Melbourne slept through a warm night.","filename":"data/vaneerConsumption/SydneyweatherAtleast10DAYSofraintodrenchNSW.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E506BE100000578-0-image-a-91_1489632889293.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318694_Sydney-NSW-flood-Melbourne-weather-forecast_1540246463.html","title":"Sydney weather: At least 10 DAYS of rain to drench NSW","title_page":"Sydney weather: At least 10 DAYS of rain to drench NSW | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rain is still drenching New South Wales with more people rescued from rising floodwaters in the state's north, as showers continue in Sydney.\nThe wet-weather trough is still sitting over Sydney and surrounding regions, while the Northern Rivers and Mid-North Coast enjoy some much-needed respite from heavy rain.\nBut residents in the regions have again been warned to expect further flooding over the next few days.\n'They've seen the worst of the system so far, and are probably going to see the worst to come as well,' Weatherzone meteorologist Rob Sharpe told Daily Mail Australia.\nScroll down for video\nA cow is pictured walking through minor flooding on a farm in Eungella\nThe North and Mid-North Coast generally saw between 100mm and 150mm of rain from 9am Wednesday into early Thursday morning.\n'They're going to be seeing the showers returning during Friday, and then it's going to be quite wet on the weekend,' Mr Sharpe said.\n'They've seen some flooding already and there's a good chance they're going to see some further flooding.'\nSawtell received 214mm of rain from Wednesday morning, while 166mm fell over Port Macquarie, and Taree was hit with 116mm.\nThe Bureau of Meteorology warned minor and moderate flooding is expected in Brunswick, Wilsons, Richmond, Clarence, Orara, Coffs Coast, Bellinger, Nambucca, Macleay, Hastings, Manning, and the Wilsons River.\nA car is pictured submerged in floodwaters in Coffs Harbour on Wednesday\nFlooding on the NSW Central Coast on Wednesday is pictured\nOn Wednesday, NSW SES carried out nine flood rescues in Coffs Harbour and Lismore areas - including freeing people trapped in their cars.\nFour people were rescued from rising waters overnight in flash flooding.\nThe SES received more than 80 calls for help on Wednesday night, mainly for leaky roofs.\nDuring the day, rescue crews in Coffs Harbour were hard at work.\nThe Pacific Valley Christian School and a disability crew had to be sandbagged. Crews also attended to damage at the Coffs Harbour High School hall, and a leaking roof at Tyalla Primary School.\nStreets in Byron Bay are pictured underwater on Wednesday after heavy rain\nFloodwaters are pictured near Byron Bay on the Northern Rivers on Thursday morning\nA car was found submerged in the North Coast city.\nThe rain is expected to ease back at the start of next week, but on-and-off showers and possible thunderstorms will continue through the week.\nShowers will continue in Sydney on Friday, Saturday and Sunday - mirroring conditions we have seen over recent days.\nThe weather will dry up substantially from Sunday, 'with just the odd shower or two each day after that', Mr Sharpe said.\nNSW SES state incident controller Wayne Snell told Nine's Today Show the wet weather could continue for the next seven to 10 days.\nSoutheast Queensland could be spared the worst of the upcoming trough, and can expect some showers on Sunday and Monday.\nFlooding in Sawtell on the NSW North Coast is pictured on Wednesday\nNSW Search Emergency Service crews are pictured attending to a house damaged on Wednesday\n'They're not going to get the thorough drenching that the Northern Rivers and Mid-North Coast are going to see,' Mr Sharpe said.\nForecaster David Crock said it was still 'uncertain' where exactly the trough will strike.\n'The position of the trough dictates whether we'll get widespread rain around the southeast or whether that rain might stay off the coast or stay down in NSW.'\nHe said while rainfall levels were largely typical for this time of year, Tewantin on the Sunshine Coast had recorded its wettest day since 1955 this week.\nThe Noosa suburb was drenched with 198mm from Tuesday into Wednesday morning.\nRoads at Lennox Head on the NSW North Coast are pictured flooded over on Thursday\nCorndale, north of Lismore on the NSW North Coast, is pictured on Wednesday\n'It's by and large not unusual for this time of year but it has been particularly dry, so it will be some welcome rainfall for those who get it in the next few days,' he said.\nMeanwhile, minor flooding is easing in the lower reaches of the Boyne River as well as the upper and middle parts of the Auburn River and Cadarga Creek.\nBut levels are rising in the lower Auburn River around Flagstone Bridge.\nQLD SES volunteers has carried out more than 1000 calls for help since heavy rains started moving across the state on Monday.\nSouthern Cross University in Lismore was flooded in on Wednesday\nThe Coffs Harbour Golf Club was rained in on Wednesday\nMelbourne slept through a warm night, with temperatures staying above 24.8 degrees.\nBut a hot weekend is ahead, with temperatures in the low-30s forecast for Saturday and Sunday.\nRain came through the city, with a chance of showers continuing.\nBOM said there was a chance of a thunderstorm in the afternoon.\nIn NSW, the SES has called on motorists not to drive through floodwaters.\nFor emergency assistance call the SES on telephone number 132 500.\nFor life threatening emergencies, call 000 immediately.\nFORECAST FOR THE WEEK AHEAD SYDNEY Thursday: Max 26 and showers Friday: Max 24 and windy with showers Saturday: Max 26 and showers Sunday: Max 27 and possible showers BRISBANE Thursday: Max 29 and possible showers Friday: Max 31 and possible thunderstorm Saturday: Max 29 and showers Sunday: Max 28 and showers CANBERRA Thursday: Max 29 and possible showers Friday: Max 25 and possible showers Saturday: Max 26 and possible showers Sunday: Max 28 and possible showers DARWIN Thursday: Max 33 and possible thunderstorm Friday: Max 32 and possible thunderstorm Saturday: Max 32 and possible thunderstorm Sunday: Max 32 and possible thunderstorm MELBOURNE Thursday: Max 26 and possible thunderstorm Friday: Max 24 and increasing sunshine Saturday: Max 31 and sunny Sunday: Max 32 and sunny ADELAIDE Thursday: Max 24 and mostly sunny Friday: Max 28 and sunny Saturday: Max 34 and sunny Sunday: Max 34 and mostly sunny PERTH Thursday: Max 28 and sunny Friday: Max 27 and mostly sunny Saturday: Max 24 and possible showers Sunday: Max 24 and mostly sunny HOBART Thursday: Max 24 and showers Friday: Max 21 and sunny Saturday: Max 25 and mostly sunny Sunday: Max 30 and sunny Source: Weatherzone\nOne happy punter took the opportunity to get out an inflatable boat to paddle down a flooded road in Tuggerah on the Central Coast earlier in the week","url":"https://www.dailymail.co.uk/news/article-4318694/Sydney-NSW-flood-Melbourne-weather-forecast.html"}
