{"authors":["Matilda Rudd For Daily Mail Australia"],"date_download":"2018-10-22 22:58:58","date_modify":"2018-10-22 22:58:58","date_publish":"2017-03-16 05:04:57","description":"Micah June, 7, from Sydney, danced on stage with Justin Bieber on Wednesday night after a Youtube competition she entered the week before saw her win it and meet her idol.","filename":"data/vaneerConsumption/SydneygirldancesonstageatJustinBieberconcert.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E50ABD300000578-0-image-a-6_1489635182238.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318654_Girl-7-dances-stage-Justin-Bieber-concert_1540249138.html","title":"Sydney girl dances on stage at Justin Bieber concert","title_page":"Sydney girl dances on stage at Justin Bieber concert | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When Micah June, seven, found out about a competition to dance on stage with her idol Justin Bieber she thought 'that should be me'.\nThe superstar asked children of all ages to learn the steps to his songs Purpose and Children and post a video link to Youtube.\nSix kids would then be chosen to dance alongside Justin when he arrived in Sydney on Wednesday.\nScroll down for video\nMicah June, 7, at Justin Bieber's concert on Wednesday night at Sydney's ANZ stadium\nThe competition had been going for almost a year but young Micah hadn't heard about it.\nWhen she eventually did just one week before the concert, she frantically scrambled to learn the moves.\nMicah's mother Anna Jacques spoke to Daily Mail Australia about her daughter's incredible opportunity.\nMicah has been dancing 'forever' says her mother Anna, who owns a dance studio her daughter dances at\nPower pose: The little star took to the stage dancing behind her idol Justin to songs like Purpose and Children\n'Our family owns a dance studio so she's been dancing forever. There isn't a day that goes by that she's not singing and dancing.\n'We were actually away on holidays when we found out about it so we only entered a day or so before the competition ended.\nThey uploaded the video of Micah introducing herself and answering questions about why she'd like to be chosen on Wednesday night. But the next day the seven-year-old was worried about her chances.\n'Mummy I might not even get it, she'd say to me. I just told her to be positive,' said Ms Jacques.\nBy Sunday the family received a message to say she'd won.\n'We couldn't believe it was real. It was such a last minute thing. She was screaming when we got the news.\n'She went to a rehearsal with Justin's back up dancers and they rehearsed with the other five kids who had won. She was the youngest though,' said Micah's mum.\nThe Parramatta school girl was the youngest child dancing on the stage that night\nOn Wednesday night Micah took to the stage full of energy with mum Anna watching on in the crowd. Unfortunately Ms Jacques almost didn't get her performance on tape.\n'I filmed everything right up until the point when Justin hugged all the kids. And then I looked at my phone and realised I hadn't even pressed record. Some of the other mums sent me through their video though!' said Ms Jacques.\nThe Parramatta school girl, who is 'a bit of a perfectionist', was just worried about coming on the stage in time. But her once-in-a-lifetime performance went off without a hitch.","url":"https://www.dailymail.co.uk/femail/article-4318654/Girl-7-dances-stage-Justin-Bieber-concert.html"}
