{"authors":["Cindy Tran","Matt Ogilvie For Daily Mail Australia"],"date_download":"2018-10-23 00:30:34","date_modify":"2018-10-23 00:30:34","date_publish":"2016-01-11 09:56:31","description":"Tourists are putting their lives at risk by posing with the Figure 8 Pools at Sydney's Royal National Park. More than 100 visitors were left injured after a powerful wave knocked them off their feet.","filename":"data/vaneerConsumption/SydneytouristsareriskingtheirlivesforInstagrampicturesatFigure8Pools.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/300712A200000578-0-image-a-29_1452506096065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393603_Tourists-risking-lives-Figure-8-Pools-Sydney_1540254634.html","title":"Sydney tourists are 'risking their lives' for Instagram pictures at Figure 8 Pools","title_page":"Sydney tourists are 'risking their lives' for Instagram pictures at Figure 8 Pools | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With its perfectly round circles of crystal blue water, Figure 8 Pools was once a secret hotspot.\nBut the naturally formed geographical spectacle at Sydney's Royal National Park has triggered scores of tourists after becoming a social media sensation in recent years.\nHowever, sightseers are putting their lives at risk by posing for the perfect Instagram photographs in dangerous positions along the rock shelf that is inundated at high tide at the dazzling attraction.\nTucked away in the southern reaches, more than 100 visitors were left with cuts, grazes and bruises after a powerful wave knocked terrified swimmers off their feet on Saturday afternoon.\nScroll down for video\nFigure 8 Pools has become a social media sensation in recent years but tourists are risking their lives by posing in dangerous positions along the rock shelf that is inundated at high tide\nCoastal Cabins Protection League and resident Helen Voysey said tourists are arriving at the site with no knowledge or awareness of the ocean conditions or when it's safe at low tide.\n'It [Royal National Park] was dedicated for a small population of Sydney as a small recreational area, but we now have 2.5 million people coming to the park [each year],' she told ABC News.\n'There is limited access and now we're inundated by car visitors who are not serious bush walkers and who don't understand what a national park is about or the surf.\n'They want to get to the place that's advertised and they don't have the understanding of how dangerous the coastal fringe is.'\nTourists from all walks of life are travelling to dazzling attraction, tucked between coastal headlands\nThe naturally formed eight shape has triggered scores of tourists after becoming a social media sensation\nFigure 8 Pools has become the latest social media trend, with tourists attempting to capture the perfect photo\nThanks to the enormous attention on Instagram, the Figure 8 Pools has become the latest social media trend, with tourists from all walks of life travelling far just to capture that 'perfect' photo.\nNational park's area manager Kane Weeks said the rock pools has gained popularity over the past year, with social media being a significant influence.\n'From general observations, it definitely is Generation Y visiting, and a high proportion of international visitors, and they're getting that photo opportunity of the Figure 8 Pools for Instagram. From our point of view, this is a very new thing,' Mr Weeks told Sydney Morning Herald.\n'Gen Y is looking for adventure in the park, they're looking for unique spots that have an element of excitement and where there's a degree of risk, so to speak.\n'We're getting a whole new demographic to the park, but they just need to be aware of the safety issues that are associated with the coastal environment.'\nNational park's area manager Kane Weeks said the rock pools has gained popularity over the past year, with social media being a significant influence\nThanks to the enormous attention on Instagram, the Figure 8 Pools has become the latest social media trend\nRun for cover: Distressing footage has emerged of the moment keen weekend beach revelers were smashed by a rogue wave\nThe latest trend follows after distressing footage emerged at the weekend of the moment keen weekend beachgoers were catapulted along a rocky foreshore by a rogue wave.\nIn the video concerned swimmers can be heard screaming out to those further out in the surf to get out of the water as the wave encloses on them.\n'Get out,' shouts the cameraman.\n'Oh F**K brace yourselves!' Yells one man who is stationed higher up on the foreshore.\nAs swimmers attempted to run for safety, the freak wave sweeps them off their feet and painful screams emerge from its wake.\nThree women - aged 20, 22 and 53 were airlifted to St George Hospital with serious injuries after being bowled over by the freak wall of water. All three have now been discharged.\nChopper rescue: Two rescue helicopters were deployed to the scene, airlifting three women to St George Hospital.\nMoments before the rogue wave smashed the figure eight pools in Sydney's National Park\nWipe out: National park rangers are now warning visitors to exercise care when walking along the rocky coast\nOther unlucky swimmers suffered cuts, grazes and bruises, including one woman with several cuts to her head, a Westpac Rescue Helicopter spokesman told AAP.\nNSW Fire and rescue, police and the rural fire service all descended on the remote beach, which is an hour and a half long walk from the National Park's car park. Surf lifesavers had to access the rocks with an inflatable boat to treating injured swimmers.\nNational park rangers are now warning visitors to exercise care when walking along the rocky coast.\n'The Bureau of Meteorology issued a hazardous surf warning for the entire NSW coast and yet we are seeing people flocking to low lying coastal rock platforms,' the wildlife service's area manager Kane Weeks told the Sydney Morning Herald.\n'With several rescues already this weekend at Royal National Park, including at Figure 8 Pool, we would urge people to use common sense and stay away from the rocks.","url":"https://www.dailymail.co.uk/news/article-3393603/Tourists-risking-lives-Figure-8-Pools-Sydney.html"}
