{"authors":["Khaleda Rahman For Daily Mail Australia"],"date_download":"2018-10-22 23:25:16","date_modify":"2018-10-22 23:25:16","date_publish":"2017-04-26 07:36:22","description":"Frosty morning temperatures are expected over Victoria and New South Wales on Thursday after a major cold front crosses the southeast parts of Australia.","filename":"data/vaneerConsumption/SydneyweatherWinterblastendsendlesssummer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C796B00000578-0-image-a-39_1493185703867.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446300_Winter-blast-ends-Australia-s-endless-summer_1540250716.html","title":"Sydney weather: Winter blast ends endless summer","title_page":"Sydney weather: Winter blast ends endless summer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australia's long summer is coming to a close as both Sydney and Melbourne are hit by a blast of wintry weather this week.\nFrosty morning temperatures are expected over Victoria and New South Wales on Thursday after a major cold front crosses the southeast parts of Australia.\nClear skies and cold air in the system's wake are likely to lead to the first of the season for non-alpine areas, Weatherzone reports.\nIt will be the coldest morning so far this year for southeast Australia and potentially the coldest April morning for two years for most of NSW.\nAustralia's long summer is coming to a close as both Sydney and Melbourne are hit by a blast of wintry weather this week\nEarly morning temperatures below 10C have been forecast for at least some towns in both states, while many places across NSW are likely to see temperatures close to zero.\nSydney and Melbourne will see lows of 10C on both Thursday and Friday this week, with the weather not set to be much better as the weekend rolls around.\nThe Bureau of Meteorology said temperatures dropped to around 9 to 10C in Melbourne this morning as the city dealt with a winter blast and rain that caused the closure of two train stations due to flooding.\n'So far today, we have had a top temperature of 14.5C, it's the coldest day of the year so far and there's been quite a lot of rainfall,' senior forecaster Scott Williams told Daily Mail Australia.\nFrosty morning temperatures are expected over Victoria and New South Wales on Thursday after a major cold front crosses the southeast parts of Australia.\nSydney and Melbourne will see minimum temperatures of 10C on both Thursday and Friday\n'In the last 48 hours, the city has had 42mm of rain and other parts of Victoria have had up to 70mm.\n'So a lot of rainfall and very gusty winds around the metropolitan area of up to about 70km/h, which makes it feels a lot cooler. It feels like 9 degrees.'\nMr Williams said the weather in Melbourne will remain cold for the next few days.\n'It will stay cold tomorrow, it will be cold and cloudy, around 15 degrees. We are in for a pretty extended spell of cooler weather.'\nHail and rain hit Melbourne during peak hour on Wednesday with a thunderstorm moving across the CBD.\nA women sits under her umbrella as a large cold front brings unsettled weather across Victoria\nThe Bureau of Meteorology said temperatures dropped to around 9 to 10C in Melbourne this morning as the city dealt with a winter blast and rain\nA severe weather warning in place for most of Victoria was lifted early on Wednesday afternoon.\nParts of Victoria have already received almost twice the average rainfall this month, with some areas, including Melbourne, recording the wettest April in 16 years.\nThe BoM has recorded 107mm in rainfall in Melbourne so far this month –compared with the usual 57mm for the full 30 days, making it the wettest April since 2001.\nIt's been even wetter in other parts of the state, such as Hamilton in western Victoria, which has experienced its wettest April in 33 years.\nThunderstorms in Melbourne caused the closure of two train stations due to flooding\nA severe weather warning for most of Victoria was lifted early on Wednesday afternoon\nMeanwhile, Sydney will be hit by a cold spell – but will not see as much rain as Melbourne.\n'A blustery cold change is on the way – we are looking at gusts around 80km/h,' Mr Williams said.\n'Sydney has been up to 25 degrees today but it's going to be quite a bit cooler over the next few days.'","url":"https://www.dailymail.co.uk/news/article-4446300/Winter-blast-ends-Australia-s-endless-summer.html"}
