{"authors":["Brianne Tolj","Liam Quinn For Daily Mail Australia"],"date_download":"2018-10-22 23:33:18","date_modify":"2018-10-22 23:33:18","date_publish":"2016-01-11 06:28:10","description":"A massive thunderstorm forecast to hit Sydney has missed the city and headed out to sea, after severe weather warnings for parts of New South Wales and Melbourne were also downgraded.","filename":"data/vaneerConsumption/SydneyandMelbournenarrowlymisswildweatherwiththunderstormsandhail.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/30056CDB00000578-0-image-a-5_1452493454432.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393444_Hail-stones-damaging-winds-heavy-rain-set-lash-Sydney-Melbourne-heatwave-continue-Tuesday_1540251198.html","title":"Sydney and Melbourne narrowly miss wild weather with thunderstorms and hail","title_page":"Sydney and Melbourne narrowly miss wild weather with thunderstorms and hail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A massive thunderstorm forecast to hit Sydney has missed the city and headed out to sea, after severe weather warnings for parts of New South Wales and Melbourne were also downgraded.\nThe Bureau of Meteorology had earlier warned Sydney would be smashed by huge hailstones and heavy rain as storms roll across the city from about 6pm.\nA severe storm warning was also issued for parts of New South Wales, as experts advised residents to stay indoors throughout the extreme conditions.\nScroll down for video\nMassive thunderstorms are set to smash Sydney and Melbourne on Monday evening, with the Bureau of Meteorology predicting wild weather on the east coast\nA warning was also issued for Melbourne and parts of Victoria, including regional cities Ballarat, Bendigo, Geelong and Mildura.\nThe State Emergency Service warns that residents should stay clear of fallen powerlines, secure loose objects around their homes, stay indoors if possible or avoid sheltering under trees and switch off computers and appliances.\nDrivers were also advised to take extra care on the road during the storms.\nIt comes after people sweated through a scorching heatwave earlier in the days, as temperatures soared into the high 30s and low 40s.\nThe Bureau of Meteorology warned Sydney will be hit by huge hailstones and heavy rain as storms roll across the city from about 6pm\nThe New South Wales warning covered a large area of the coast near Sydney, and stretched as far south as Wollongong and north to Newcastle\nHot air from Western Australia that is now moving east pushed temperatures across the outback well into the upper 30s on Sunday and they will continue to rise until a cooler front takes over on Friday.\nThe interior and western areas of New South Wales and northern Victoria will be the hottest areas in Australia with temperatures possibly reaching 45 beginning Monday until Wednesday, Bureau of Meteorology Forecaster Andrew Haigh said.\n‘There will be persistent hot temperatures in Western inland of NSW west of the Great Dividing Range – from Mildura to Wagga Wagga,’ he said.\nA woman soaks up the sunshine in front of the Sydney Opera House on Monday afternoon\nA simmering heatwave has taken over most of Australia as of Monday, driving temperatures in north Victoria and west New South Wales into the upper 30s to mid 40s\nHot air from Western Australia that is now moving east pushed temperatures across the outback well into the upper 30s on Sunday, pushing a lot of people to seek solace from the heat at beaches across the country\nThe heat wave is expected to continue with temperatures persisting in the upper 30s and 40s until Friday\n‘We are also expecting some quite hot temperatures in the Hunter Valley and a few other parts of the east coast as well but not as persistent over several days.’\nInland South Australia, Northern Territory and Queensland will also reach the 40s as coastline cities remain in the mid to upper 30s.\nSydney temperatures will heat up to the mid 30s throughout this week - a stark contrast to last week’s constant rainfall and low temperatures.\n‘There will be persistent hot temperatures in Western inland of NSW west of the Great Dividing Range – from Mildura to Wagga Wagga,’ Bureau of Meteorology Forecaster Andrew Haigh said\n‘We are also expecting some quite hot temperatures in the Hunter Valley and a few other parts of the east coast as well but not as persistent over several days’\nThe heatwave began on Monday, sweeping across from the west into the east (pictured)\nTemperatures in the west of New South Wales and northern Victoria will begin to reach the mid 40s on Tuesday (left) and Wednesday (right)\nCAPITAL WEATHER FORECASTS Monday Sydney - 20/31 Melbourne - 19/34 Canberra - 15/35 Brisbane - 20/31 Darwin - 26/33 Adelaide - 24/34 Perth - 17/27 Hobart - 15/25 Tuesday Sydney - 22/31 Melbourne - 17/26 Canberra - 18/36 Brisbane - 20/34 Darwin - 26/33 Adelaide - 21/38 Perth - 18/26 Hobart - 14/21 Wednesday Sydney - 20/28 Melbourne - 17/38 Canberra - 15/37 Brisbane - 21/33 Darwin - 26/32 Adelaide - 24/37 Perth - 15/30 Hobart - 15/31 Thursday Sydney - 21/33 Melbourne - 19/22 Canberra - 20/36 Brisbane - 21/31 Darwin - 26/32 Adelaide - 17/25 Perth - 16/33 Hobart - 18/21\nA cold front will cool down Victoria and South Australia but NSW and Queensland will remain warm on Thursday (pictured)\nSydney temperatures barely didn't reach above the teens on January 4 - a record breaking low for January in 37 years, according to Weather Zone.\nJust one week later the temperature will be almost 20 degrees hotter.\nA trough system over the east of NSW last week was favourable for rainfall, Mr Haigh said.\nSydney temperatures will heat up to the mid 30s throughout this week - a stark contrast to last week’s constant rainfall and temperatures that didn't reach out of the teens\nPeople across the country took to social media on Monday to post their ways of staying cold in the simmering heat\nPeople flocked to Bondi Beach (pictured) on Sunday as the heatwave began to stretch east\nSydney temperatures barely didn't reach above the teens on January 4 - a record breaking low for January in 37 years, according to Weather Zone. Just one week later the temperature will be almost 20 degrees hotter\n‘The weather pattern is fairly changeable in the summertime,’ he said.\nMelbourne will surpass Sydney by possibly reaching a high of 40.\nAdelaide will be close behind with a high of 38.\n‘The weather pattern is fairly changeable in the summertime,’Mr Haigh said\nPeople are soaking up the sun in lakes and beaches around the east coast (pictured)\nMelbourne will surpass Sydney by possibly reaching a high of 40\nWagga Wagga (pictured) is expected to reach 45 degrees every day though out the week\nNorthern Territory, Tasmania and Western Australia will remain relatively cool with temperatures in the mid 20s to low 30s.\nA cold change will move into southeast Australia on Wednesday night, cooling temperatures in Victoria down to the low 20s, a spokesperson and the Bureau of Meteorology said.\nNew South Wales will remain hot on Thursday until the cool front reaches the state on Thursday night, dropping temperatures from the mid 30s in Sydney to the low 20s on Friday.","url":"https://www.dailymail.co.uk/news/article-3393444/Hail-stones-damaging-winds-heavy-rain-set-lash-Sydney-Melbourne-heatwave-continue-Tuesday.html"}
