{"authors":["Ashleigh Davis For Daily Mail Australia"],"date_download":"2018-10-23 00:06:12","date_modify":"2018-10-23 00:06:12","date_publish":"2017-03-10 05:47:57","description":"A beloved mini golf course in North Sydney has announced it is closing its doors for the last time in April, after the site was sold by the Parramatta Council in 2014 to developers.","filename":"data/vaneerConsumption/SydneyPuttPuttErmingtongolfcourseisshutdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1EC46200000578-0-image-a-42_1489115666281.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299112_Tears-iconic-Sydney-putt-putt-golf-course-shut-down_1540253172.html","title":"Sydney Putt Putt Ermington golf course is shut down","title_page":"Sydney Putt Putt Ermington golf course is shut down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A beloved Sydney icon has announced it will be closing its doors for good to make way for a million-dollar development.\nPutt Putt Ermington mini golf course will be closing for the last time on April 30, reported the Daily Telegraph.\nThe site was sold by the Parramatta Council to developers in 2014 and will be redeveloped into a mixed use development including 1,078 apartments.\nScroll down for video\nA beloved Sydney mini golf course has announced it will be closing its doors for good in April to make way for a million-dollar development\nThe colourful course with its quirky statues and decorations has been a firm favourite for Sydneysiders celebrating birthdays, dates and family outings.\nOwner Tom Wykoff told the Daily Telegraph it was the 'end of the line' for the course.\n'We have had hundreds of people say how disappointed they are,' he said.\n'This place meant a whole lot to a whole lot of people.\n'There’s not very many people in Sydney who haven’t played Putt Putt at Ermington.'\nPutt Putt Ermington mini golf course will be closing for the last time on April 30. Pictured are long time golfers at the course Ron Lamplough (left) and Will Cowie (right) in the 80s\nThe site was sold by the Parramatta Council to developers in 2014 and will be redeveloped into a mixed use development including 1,078 apartments. Pictured are Allan Cox (left) and Denis Bingley (right) at the course in the 80s\nThe colourful course with its quirky decorations has been a favourite for Sydneysiders celebrating birthdays, dates and family outings. Pictured is a golf tournament held at the course in 1985\nThere are three courses in the mini golf - Fun Run, Waterways and Jungle Trail, with 18 holes in each course.\nIt's estimated that almost four million people have played the three courses since Putt Putt opened in 1969.\nFans have shared their disappointment at the closure on the Putt Putt Facebook page.\nOwner Tom Wykoff said it was the 'end of the line' for the course (pictured) and that hundreds of customers were disappointed with the closure\nMr Wykoff said there weren't very many people in Sydney who haven’t played Putt Putt at Ermington. Pictured is the course back in the 1980s\nIt's estimated that almost four million people have played the three courses since Putt Putt (pictured) opened in 1969\nOne person wrote: 'A local treasure, a wholesome, natural place for family and friends to have an absolute ball.'\nAnother said: 'My first job was at that Putt Putt, just up the road from parents in the 1980's. I did parties. I got paid $2.00. Yay. Although I could play Putt Putt for free. It was a very different looking place back then. We used to ride our skateboards in the car park, and play the Space invaders machine. Great memories.'\nAnother person said: 'We are going to miss you terribly when April arrives.'\nFans have shared their disappointment at the closure on the Putt Putt Facebook page\nOne person wrote: 'A local treasure, a wholesome, natural place for family and friends to have an absolute ball'\nThe course is popular with all ages and is a firm favourite for Sydneysiders and visitors alike","url":"https://www.dailymail.co.uk/news/article-4299112/Tears-iconic-Sydney-putt-putt-golf-course-shut-down.html"}
