{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:16:15","date_modify":"2018-10-22 22:16:15","date_publish":"2016-01-11 02:50:36","description":"Sylvester Stallone received a standing ovation as he was named Best Supporting Actor for Creed at the Golden Globes.","filename":"data/vaneerConsumption/SylvesterStallonewins2016GoldenGlobeforBestSupportingActorforCreed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/30023AE900000578-0-image-a-7_1452480548663.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393299_Sylvester-Stallone-gets-standing-ovation-wins-Golden-Globe-Best-Supporting-Actor-Creed_1540246575.html","title":"Sylvester Stallone wins 2016 Golden Globe for Best Supporting Actor for Creed","title_page":"Sylvester Stallone wins 2016 Golden Globe for Best Supporting Actor for Creed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"See our full Golden Globes coverage at www.dailymail.co.uk/goldenglobes\nSly did go back on stage to thank Coogler, but his words were not aired because the show had gone to commercial break\nSamuel L Jackson agreed, writing: '#waitwaitwait, Ryan Coogler & Michael B Jordan, Thanks for acting with me!!! Loved Sly but...'\non Twitter: 'Well. I'm gonna go ahead and thank RYAN COOGLER + MICHAEL B. JORDAN since no one else is.'\nSylvester Stallone received a standing ovation as he was named Best Supporting Actor for Creed at the Golden Globes.\nIn an emotional speech, the visibly shocked actor gushed: 'I wanna thank Rocky, the best friend I ever had!'\nHowever Stallone raised eyebrows by initially forgetting to mention black director Ryan Coogler or star Michael B. Jordan - a situation he stopped the music to rectify.\n'You did it all, I just hung on for dear life,' he told Coogler - but his words were not aired as the show had gone to commercial break.\nEmotional: Teary-eyed Sylvester Stallone won the Golden Globe for Best Supporting Actor for Creed\nOn their feet: The veteran actor received a standing ovation from the A-list crowd\nForgot them: Michael B. Jordan and Ryan Coogler are seen Saturday; Coogler said afterwards he was happy with Sly's words of thanks, even if they were not aired on television\n'I am the sum total of everyone I’ve ever met,' the 69-year-old had gushed.\nHe then enthusiastically thanked a long list of those who helped him in his career, including his representatives and various producers.\nBut he saved his most touching words for his wife, Jennifer Flavin.\n'Having your love is the greatest award in the world every day,' he told the 47-year-old.\nTaking in the moment: Sly was definitely emotional as he addressed his peers\nProud: The legendary actor gripped tightly onto his new prize\nVisibly touched: Stallone paused before getting to his feet as the room erupted upon hearing his name\nWow! Stallone's wife Jennifer covered her mouth in shock as her husband's name was read out\nHowever the apparent omission of Cooger and Jordan didn't go unnoticed by fans, who tweeted their outrage.\nSelma director Ava DuVernay responded by writing: 'Well. I'm gonna go ahead and thank RYAN COOGLER + MICHAEL B. JORDAN since no one else is. Thank you, brothers. Good work. #smh #goldenglobes.'\nAnd Samuel L Jackson agreed, writing: '#waitwaitwait, Ryan Coogler & Michael B Jordan, Thanks for acting with me!!! Loved Sly but...'\nForgot someone? Stallone raised eyebrows by not thanking Creed director Ryan Coogler - a situation he reportedly rectified as the show went to commercial break\nBig fans: Christian Bale and Brad Pitt were among those giving him a standing ovation\nProtege: Michael B. Jordan looked very excited for his Creed co-star\nCheering section: Will, Jada and Trey Smith energetically clapped for the star\nUnited: Both Quentin Tarantino and Jonah Hill expressed their admiration\nStanding room only: Most of the room got on their feet to cheer for the veteran actor\nWonderful moment: Emotions definitely ran high\nReaction: Both Selma director Ava DuVernay and Samuel L Jackson were surprised by Sly's omission of Creed's director and star\nCoogler himself was surprised by the reaction, saying backstage when asked if he was upset that Sylvester didn't mention him more prominently: 'No, no, no! Not at all.\n'I don't know what's happening on Twitter but I love Sly.'\nAnd he told the LA Times: 'And what he said was so nice!'\nStallone fan club: The actor celebrates with daughters Sistine, Sophia and Scarlet, and wife Jennifer\n'Tumbleweed': Stallone remembered the lukewarm reaction - to his 1977 win for Rocky\nIt was only the second time Stallone has won a Globe, with the gong, and the gong joins his 1977 win for the original Rocky movie.\nThe actor has won rave reviews after reprising his role as boxer Rocky Balboa in spin-off Creed.\nEarlier Sly looked proud and relaxed as he walked the red carpet with his wife and daughters Sophia, 19, Sistine, 17, and 13-year-old Scarlet.\nProud family: Stallone with wife Jennifer Flavin and their daughters, from left, Sistine, Sophia and Scarlet at the Beverly Hilton in Los Angeles on Sunday\nStarring role: Michael B Jordan appeared alongside Stallone in Creed, but didn't receive a nomination\nJennifer wore a strapless grey gown with sheer, flowing skirt and train.\nThe dress featured dark metallic detailing on the waist, and she added a dark clutch.\nThe couple's daughters also looked pretty as they posed on the red carpet.\nFamily affair: The actor is nominated for Best Supporting Actor in a Motion Picture for his role in Creed\nPretty: Jennifer looked gorgeous in a strapless gown with sheer skirt and flowing train\nSophia, 19, wore a long black gown with plunging neckline and cinched in her waist with a black and gold metallic belt.\nSistine, 17, matched her famous father with a dark navy material, wearing a strapless gown and holding a dark blue clutch.\nAnd 13-year-old Scarlet wore a white outfit featuring a see-through, strapless bodice, side cut outs and floor-length skirt.\nYo Adrian! He attended the InStyle and Warner Bros. 73rd Annual Golden Globe Awards Post-Party\nEyes on the prize: He did not attend the showbiz after party without his new prized possession\nFabulous five: He was also joined by his beautiful wife and three daughters at the hotspot\nProud of their papa: The girls all looked glad to spend time with their father on his special night\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393299/Sylvester-Stallone-gets-standing-ovation-wins-Golden-Globe-Best-Supporting-Actor-Creed.html"}
