{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:56:06","date_modify":"2018-10-22 21:56:06","date_publish":"2016-01-29 08:24:05","description":"Sylvester Stallone, 69, cuddled a homeless woman before giving her a handout in Beverly Hills on Thursday","filename":"data/vaneerConsumption/SylvesterStallonecuddleshomelesswomanthengivesherahandoutinBeverlyHills.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B082FA00000578-0-image-a-92_1454055839985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422325_Sylvester-Stallone-cuddles-homeless-woman-gives-handout-Beverly-Hills_1540245366.html","title":"Sylvester Stallone cuddles homeless woman then gives her a handout in Beverly Hills","title_page":"Sylvester Stallone cuddles homeless woman then gives her a handout in Beverly Hills | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was the star of cult action classic Tango And Cash.\nSo it seems only appropriately Sylvester Stallone cuddled a homeless woman before giving her a handout in Beverly Hills on Thursday.\nThe generous actor, who experienced poverty himself before hitting the big time with Rocky, was happy to stop for a chat with the woman before handing off some money.\nA Sly cuddle: Sylvester Stallone embraced a homeless woman in Beverly Hills on Thursday\nFather-of-five Sly, 69, was looking sharp in a grey blazer, blue polo shirt, black jeans and leather shoes.\nBefore the Creed actor got his career off the ground Sly was forced to sell his beloved dog to make ends meet.\nHe said: 'I sold my bullmastiff Butkus to a little person. You can't use the word \"dwarf\" any more? Let's just say a little person.\n'I tied my dog up at the store with a sign that said a hundred bucks. I got $50 from this guy called Little Jimmy.\nNo Apollo Greed here: He then asked if he could help her out by giving her some cash\nF.I.S.T-ful of dollars: He made sure she would be eating well by handing over some notes\n'When I sold the Rocky script, I went to see Little Jimmy and begged for the dog back. He limed up his children, \"Oh my kids love the dog.\" I said, \"You've only had him for a f***ing week.\"\n'He wanted to fight me and said he was gonna kill me - he was a crazy little person. I couldn't fight him - they'd arrest me - so I offered to pay double. Anyway, $3,000 and several threats later...'\nAnd despite the tough negotiations they remained friendly, with the Golden Globe winner even casting him in his breakthrough film.\nHe said: 'Do you remember in Rocky where the little guy goes, \"Hey, did ya win?\" and I go, \"What are you deaf?\" and he goes, \"No, I'm short.\" That's him.'\nTime to get Judge fed: The hungry actor then headed to a nearby restaurant to pick up some food\nWell he is the Italian Stallion: And the movie beefcake indulged himself by getting some pizza pies","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422325/Sylvester-Stallone-cuddles-homeless-woman-gives-handout-Beverly-Hills.html"}
