{"authors":["Louise Cheer","Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-23 05:40:58","date_modify":"2018-10-23 05:40:58","date_publish":"2016-01-28 21:29:05","description":"A pregnant woman who contracted food poisoning after she ate at a Sydney bakery (pictured) revealed she had to have an emergency caesarean at 35 weeks because she was so sick.","filename":"data/vaneerConsumption/SylvaniaBoxVillageBakeryownersapologisetocustomersforfoodpoisoning.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEF0FF00000578-0-image-a-10_1454041696686.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421586_Sylvania-Box-Village-Bakery-owners-note-apologising-customers-food-poisoning_1540273258.html","title":"Sylvania Box Village Bakery owners apologise to customers for food poisoning","title_page":"Sylvania Box Village Bakery owners apologise to customers for food poisoning | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pregnant woman who got sick from salmonella after she ate at a Sydney bakery at the centre of a food poisoning outbreak was forced to have a caesarean.\nAshley Buchanan had to give birth at 35 weeks because she had become too sick after her meal at Box Village Bakery in Sylvania, in Sydney's south.\n'I ended up deteriorating quite rapidly because the infection was so severe,' Ms Buchanan, from Wollongong - south of Sydney, told 2UE radio, according to Eyewitness Ten News.\nScroll down for video\nAshley Buchanan had to give birth at 35 weeks because she had become too sick after her meal at Box Village Bakery in Sylvania, in Sydney's south\nA pregnant woman has revealed she had to have an emergency caesarean when she fell ill after eating at Box Village Bakery in Sylvania, in Sydney's south. Customers ate hot chicken rolls or chicken schnitzel rolls\n'By Monday they were discussing delivering early, and then Tuesday I deteriorated more and they had to do an emergency caesarean.\n'It was all quite frightening because my blood pressure went right down and they had to rush me to ICU straight after the delivery.'\nTo add more stress to the situation, Ms Buchanan's husband was not allowed into the delivery theatre with her because he was also ill.\nLuckily Ms Buchanan's new baby girl, Ava, is doing well and her family was on the mend.\nA week after the outbreak, the owners of the bakery accused of giving about 150 people food poisoning have taped up a handwritten note to apologise to their sick customers.\nIt reads: 'Dear Customer We are Realy Sorry about what happen We hope every one get well soon We are sorry again [sic].'\nLuckily Ms Buchanan's new baby girl, Ava, is doing well and her family was on the mend\nTo add more stress to the situation, Ms Buchanan's husband was not allowed into the delivery theatre with her because he was also ill\nOwners of the Box Village Bakery have taped up an apology note to sick customers (right) but one angry father, Damian Sullivan, has put up his own (left)\nThe note was stuck up on the front window of the bakery almost a week after the outbreak\nBut the father of a young boy who was struck down with salmonella after eating at the bakery says he is still 'p***ed off' with its owners.\nDamian Sullivan's 11-year-old son, Cooper, remains in hospital five days after he first complained of severe 'cramping, stitches', and a fever following a visit with his family to Box Village Bakery in Sylvania, in Sydney's south.\nMr Sullivan had his own response to the note, also in the same form.\n'You grubs. My son is still in hospital because of you,' he wrote on an orange piece of paper and wedging it in the front roller door of the bakery.\n'I'm just really p***ed off with them. I think the fact that they put a small hand written note up [is meant to] show how much they care,' Mr Sullivan told Daily Mail Australia.\n'My wife has video of my son crying when the doctors are putting more needles in him and he is begging them to stop and says I want to go home.'\nMr Sullivan said he was also dissatisfied with the response he received from the New South Wales Food Authority, who have since shut down the bakery to investigate the incident.\n'I am really p***ed off with the food authority as we reported this to them and they didn't even ring us back. We have had to chase them,' he told Daily Mail Australia.\nBut a spokeswoman for the Food Authority said they did return his call and left a voicemail message on Wednesday afternoon.\nMr Sullivan's 11-year-old son, Cooper (pictured in hospital), was struck down with salmonella after reportedly eating at a Sydney bakery with his family\nHere is another photo of Cooper in hospital and in pain. The number of people who are infected with food poisoning is about 150 people\nFollowing its shut down, a note was spotted outside the bakery on Tuesday, saying: 'You made my family very sick'\nAs of Thursday afternoon, 151 people have presented themselves at hospital with symptoms of food poisoning and 27 were admitted.\nSince last Friday, 144 people have been to The Sutherland Hospital and seven people have shown up to The St George Hospital, according to the NSW Department of Health.\nBakery owner Hien 'Johnny' Dau, who used to run two other bakeries without any trouble at Gymea and Sutherland, told The Daily Telegraph he wanted to apologise to his customers.\nHe said he wanted and needed to do something to say sorry so he would be giving away food for a couple of days if the Food Authority gives him the green light to re-open.\n'I feel really bad. I feel sick for people in hospital,' Mr Dau said.\n'If it happens again - finish, no more business.\nAfter becoming incredibly sick overnight, Cooper was rushed to his local doctor and later admitted to The Sutherland Hospital\nIt is thought customers got food poisoning had eaten hot chicken or chicken schnitzel rolls from the bakery\nThe NSW Food Authority has shut down the bakery as the outbreak is being investigated\n'I learn from my mistake, I don't want it to happen again.'\nInspectors from the Food Authority visited the bakery, which made more than 200 rolls every day, on Wednesday and would come back on Wednesday to take food samples for testing, the Telegraph reported.\nMr Dau will speak with inspectors on Monday to find out how the food poisoning outbreak happened and so far he has only been asked to patch up a hole in the ceiling.\nHe said he was not sure how the incident could have occurred as his employees hands were clean and they wore plastic gloves when they prepared food.\nPreviously Mr Sullivan told Daily Mail Australia, his son had become sick overnight after eating at the bakery.\n'Cooper came into my bedroom on Sunday night, jumped on the toilet and was there all night basically,' Mr Sullivan told Daily Mail Australia on Tuesday night.\nAbout 40 people presented themselves at The Sutherland (pictured) and St George hospitals with symptoms of food poisoning over the weekend. But this number has risen considerably\nBakery owner Hien 'Johnny' Dau (pictured above is a woman walking past the bakery) said he wanted to apologise to sick customers\nMr Dau said he would be handing out free food if the Food Authority gives them the green light to re-open\n'When we got to the hospital the staff asked if we had eaten at the Box Village Bakery and said they had been inundated with patients who ate there.\n'When we went back after Cooper was admitted, there were six other people on drips with salmonella poisoning.'\nIt is thought the outbreak started after people consumed hot chicken or chicken schnitzel rolls from the bakery.\n'Cooper came into my bedroom on Sunday night, jumped on the toilet and was there all night basically,' Mr Sullivan told Daily Mail Australia.\nPatients were also admitted to The St George Hospital over the weekend for food poisoning\n'When we got to the hospital the staff asked if we had eaten at the Box Village Bakery and said they had been inundated with patients who ate there.\n'When we went back after Cooper was admitted, there were six other people on drips with Salmonella poisoning.'\nMr Sullivan said Cooper has since gotten worse and is expected to spend at least two more nights in hospital.\nIn a video taken by his mother, the little boy bursts into tears after as he lay on a hospital bed on Tuesday.","url":"https://www.dailymail.co.uk/news/article-3421586/Sylvania-Box-Village-Bakery-owners-note-apologising-customers-food-poisoning.html"}
