{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:12:53","date_modify":"2018-10-31 00:12:53","date_publish":"2016-12-14 17:41:21","description":"As the Legislature opened a new two-year session this month, staffers lined up before 9 a.m. to hand freshly-written bills to the clerk, who assigns them","filename":"data/vaneerConsumption/Symbolicsuperstitiousorsillylegislatorsscrambleforbillnumbers.json","image_url":"https://calmatters.org/wp-content/uploads/BillNumbersjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944773.html","title":"Symbolic, superstitious or silly-legislators scramble for bill numbers","title_page":"Symbolic, superstitious or silly—legislators scramble for bill numbers | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As the Legislature opened a new two-year session this month, staffers lined up before 9 a.m. to hand freshly-written bills to the clerk, who assigns them an all important number. Whether a bill lives or dies won’t be known for many months, but the work to nab the right bill number starts the minute the session opens.First up in the state Senate: a bill by Sen. Jim Beall (D-San Jose) that would raise gas taxes and car registration fees to pay for a backlog of road repairs. The plan envisions spending $6 billion a year for the next decade fixing roads, bridges and transit systems—repairs that have been delayed for years and are now widely seen as urgent. After getting its official stamp, the legislation became Senate Bill 1.\n“When you put number one on the bill that means it’s a high priority,” said Beall, who’s worked unsuccessfully for the last two years to pass similar legislation. “Whether or not that means, in the final analysis, that people vote for it is another question. But it indicates that it’s a priority.”\nPolitics is full of symbolism and it’s no different when it comes to the arcane system of numbering bills. With the start of a new session of the California Legislature, the numbering begins anew. And if past years are any indication, laws proposed in the coming months will be slapped with clever, silly and superstitious numbers.\nIn past years, a bill dealing with optometry was AB 2020. Legislation about emergency phone lines was AB 911. A proposal to change gambling licenses got lucky number 777. And an Assembly bill declaring denim the official state fabric carried the number of a famous pair of jeans: 501.\n“Some numbers are very important to members,” said Bernadette McNulty, the Senate official who gives bills their numbers. “I try to accommodate that as a much as I can.”\nFor the most part, assigning bill numbers is haphazard. Legislative staff line up at McNulty’s desk inside the Senate chambers and she stamps bills in the order received. “Who’s 56? 56 next,” she called out on a recent afternoon as a senator’s staffer stepped up to hand her a new bill.\nBut timing is critical because McNulty and her counterpart in the Assembly won’t skip numbers. Take 420—the number that became a code after some stoners popularized their tradition of getting high at 4:20 p.m. Now it’s a number senators request for bills dealing with marijuana.\n“If I’m in the process and I’m at 410, I’ll call them and say, ‘Bring the (folder) down,’” she said.\nWith the Legislature processing thousands of bills each session, symbolic numbers help lawmakers market their bills, providing fodder for social media slogans or nerdy humor. When Sen. Mike McGuire last year presented his SB 747—a bill dealing with airport funding—the Healdsburg Democrat opened his speech joking that “there are four exits, two in the front of the room and two in the back.”\nFormer Democratic Assemblyman Luis Alejo of Watsonville went after bill number 10 for his 2013 legislation to raise the minimum wage to $10 an hour. “He thought it would be a way to make it stand out,” said spokesman Andrew Bird.\nThe same year, former Assemblyman Mike Gatto carried a bill to alleviate freeway congestion. “So naturally we sought AB 405, a freeway number which southern Californians instantly associate with commuting delays,” the Los Angeles Democrat said by email.\nOther legislators take a cultural approach to seeking bill numbers. Democratic Sen. Richard Pan of Sacramento, who is Chinese-American, said he often tries to get his legislation tagged with anything that includes the number 8, a symbol for good luck in many Asian cultures. (He also tries to avoid bills with the number 4, which represents bad luck.)\nA few years ago, while Pan carried AB 888 (about procedures for giving students medicine at school), other Chinese-American legislators carried SB 888 (about picketing at funerals) and SB 88 (about translating candidate names on ballots). Despite the auspicious numbers, all three bills died or were vetoed.\nStill, Pan said “it’s fun” to play the numbers game. And hope, it seems, springs eternal: For the new session, he’s already nabbed Senate bills 18 and 28.","url":"https://calmatters.org/articles/symbolic-superstitious-or-sillylegislators-scramble-for-bill-numbers/"}
