{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:33:07","date_modify":"2018-10-30 20:33:07","date_publish":"2016-09-02 01:42:46","description":"The co-leader of the Kurdish Democratic Union Party (PYD), which controls large swathes of Syria, has solicited help from the Iraqi Kurds.","filename":"data/vaneerConsumption/SyrianKurdsReachingOuttoIraqiCounterparts.json","image_url":"https://media.breitbart.com/media/2015/11/Peshmerga-sinjar-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_01__1540931587.html","title":"Syrian Kurds Reaching Out to Iraqi Counterparts","title_page":"Syrian Kurds Reaching Out to Iraqi Counterparts","title_rss":"NULL","source_domain":"breitbart.com","text":"The co-leader of the Kurdish Democratic Union Party (PYD), which controls large swathes of northern Syria, has solicited help from the Kurdistan Regional Government (KRG) in Iraq.\nTurkey, which considers the PYD to be the Syrian affiliate of the communist terrorist group known as the Kurdistan Workers’ Party (PKK), has sought to increase military cooperation with the KRG against the Islamic State (ISIS/ISIL).\nLast year, KRG President Masoud Barzani appeared to side with Turkey against the PKK.\nCurrently, the Syrian Democratic Forces (SDF) — led by the armed wing of the PYD, the People’s Protection Units (YPG) — are fighting the Ankara-backed rebels from the Free Syrian Army (FSA) in northern Syria, near the country’s border with Turkey.\nThe SDF and FSA have both received military assistance from the United States. Additionally, the Syrian and Iraqi Kurds, under the PYD and KRG respectively, are considered allies of the Obama administration.\nRudaw reports:\nSalih Muslim, the co-leader of the Syrian Kurdish Democratic Union Party (PYD) on Thursday called for help from the Kurdistan Regional Government (KRG) in Iraq. Speaking to reporters at the European Parliament, he also claimed his group had evidence of links between Turkey and the Islamic State (ISIS).\nAlluding to the ongoing clashes between the SDF and FSA, Muslims accused Turkey of invading PYD territory in northern Syria.\nU.S. NATO ally Turkey has designated the PYD and its military component, YPG, to be the Syrian wing of PKK, which has been deemed a terrorist organization by both Washington and Ankara.\nThe White House and U.S. State Department, however, do not consider the Syrian Kurdish groups to be terrorists. In fact, the YPG is reckoned to be the most effective U.S. ally taking on ISIS on the ground in Syria.\nThe U.S. has warned the PYD against supporting the PKK. Drawing ire from Turkey, the U.S., and the Bashar al-Assad regime in Syria, the PYD voted to seek autonomy earlier this year.\nThere have been disagreements between the Iraqi KRG and Syrian PYD.\nEarlier this year, KRG President Barzani, echoing Turkey, accused the PYD of being linked to the terrorist PKK, saying the two groups “are exactly one and the same thing.”\n“Iraqi Kurds have said that the PYD cannot be considered a group that represents all Kurds in Syria and that the group’s legitimacy has declined for them,” reported Turkey’s Daily Sabah in late February.\nThe Turkish news outlet noted that the KRG had angrily accused the PYD of becoming a wing of the Assad regime after the Syrian Kurdish group blocked the return of 6,000 members of Iraqi Kurdistan’s Peshmerga force from returning to Syria to combat ISIS","url":"https://www.breitbart.com/national-security/2016/09/01/syrian-kurds-reaching-out-to-iraqi-counterparts-amid-clashes-with-turkey-backed-rebels/"}
