{"authors":["Associated Press"],"date_download":"2018-10-23 01:32:29","date_modify":"2018-10-23 01:32:29","date_publish":"2017-03-16 11:39:35","description":"BEIRUT (AP) - An airstrike on a mosque in a rebel-held area of northern Syria on Thursday killed at least 35 people, first responders and activists said.The...","filename":"data/vaneerConsumption/Syrianactivistssayairstrikeonmosquekillsatleast35.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319786_Syrias-Bar-Association-chief-16-lawyers-killed-blast_1540258349.html","title":"Syrian activists say airstrike on mosque kills at least 35","title_page":"Syrian activists say airstrike on mosque kills at least 35 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIRUT (AP) - An airstrike on a mosque in a rebel-held area of northern Syria on Thursday killed at least 35 people, first responders and activists said.\nThe Syrian Civil Defense, volunteer paramedics known as the White Helmets, said first responders were racing to the scene after the airstrike in the Jeeneh area, near the rebel-held province of Idlib. It said at least 35 people were killed.\nThe Britain-based Syrian Observatory for Human Rights said at least 42 people were killed, mainly civilians.\nJeeneh is in the western Aleppo countryside, which along with Idlib is home to hundreds of thousands of Syrians displaced by fighting in other areas.\nRussian and Syrian aircraft are known to operate in the opposition-held region.\nThe U.S. Central Command based in Tampa, Florida, said separately that U.S. forces killed \"several terrorists\" in a strike at an Al Qaeda meeting place in Idlib. It said in a statement that Idlib has been a significant safe haven for Al Qaeda in recent years. The U.S. has struck dozens of locations in northwestern Syria in the past, targeting al-Qaida-linked militants.\nThe airstrike on the mosque came a day after suicide attacks in the capital, Damascus, killed at least 30 people on the sixth anniversary of the start of the Syrian conflict.\nThe civil war has killed about 400,000 people, wounded more than a million and displaced half the country's population.","url":"https://www.dailymail.co.uk/wires/ap/article-4319786/Syrias-Bar-Association-chief-16-lawyers-killed-blast.html"}
