{"authors":[],"date_download":"2018-10-23 04:59:58","date_modify":"2018-10-23 04:59:58","date_publish":"2016-01-11 18:07:16","description":"Syria's foreign minister arrived in New Delhi Monday for talks with his Indian counterpart, trying to build international support for President Bashar al-Ass...","filename":"data/vaneerConsumption/SyrianforeignministervisitsIndiabeforepeacetalks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z74l-3WAQP5SaQH704788ebcf7e1b48f8-616_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394344_Syrian-foreign-minister-visits-India-peace-talks_1540270798.html","title":"Syrian foreign minister visits India before peace talks","title_page":"Syrian foreign minister visits India before peace talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Syrian foreign minister visits India before peace talks\nSyria's foreign minister arrived in New Delhi Monday for talks with his Indian counterpart, trying to build international support for President Bashar al-Assad's government before peace talks in Geneva.\nWalid Muallem will meet Sushma Swaraj and \"other government functionaries\" during a three-day official visit, foreign ministry spokesman Vikas Swarup told AFP.\nPeace talks between Assad's government and the Syrian opposition are due to begin in January 25 as part of an ambitious 18-month plan endorsed by the UN Security Council.\nSyrian Foreign Minister Walid Muallem, pictured on November 27, 2015, is on a three day visit to India ©Vasily Maximov (AFP/File)\nMore than 260,000 people have died since Syria's brutal civil war erupted in March 2011, and previous efforts to find a political solution to the war have failed.\nThe UN-backed plan foresees a rapid ceasefire, and calls for talks that would lead to the \"establishment of an inclusive transitional governing body with full executive powers\" within six months, although it does not directly address Assad's fate.\nAnalysts said the Syrian minister's India visit, which follows trips to Russia and China, was an attempt to build international support for the Syrian president, who is backed by Russia.\n\"The fact that the Syrian foreign minister is visiting India is a clear indication that India supports and has given legitimacy to the Assad government,\" said Ranjit Gupta, an independent analyst and former Indian ambassador.\n\"India is not expected to give explicit public support, except to say that there should be no regime change through external force... which in itself is a big boost for the Syrian government.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3394344/Syrian-foreign-minister-visits-India-peace-talks.html"}
