{"authors":[],"date_download":"2018-10-22 21:29:12","date_modify":"2018-10-22 21:29:12","date_publish":"2014-05-07 13:59:27","description":"Nearly 2,000 rebels and their families would be evacuated from the heart of Homs, where anti-Assad forces had holed up for more than a year.","filename":"data/vaneerConsumption/SyrianRebelsEvacuatedfromCapitaloftheRevolution.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/425961/140507-homs-destoryed-cover-10a_c6c2b5f10ef2095f976097f4b4f3d957.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_syrian-rebels-evacuated-capital-revolution-n99186_1540243752.html","title":"Syrian Rebels Evacuated from 'Capital of the Revolution'","title_page":"Syrian Rebels Evacuated from 'Capital of the Revolution'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHundreds of beleaguered Syrian rebels began withdrawing from the city dubbed “the capital of the revolution” on Wednesday, handing a victory to President Bashar Assad three years into a war that has left well over 100,000 dead and forced millions from their homes.\nAccording to activists, nearly 2,000 rebels and their families would be evacuated from the heart of Homs, where anti-Assad forces holed up under fierce bombardment for more than a year. The mainly Sunni fighters had held out in the Old City of Homs and districts close-by despite being out-gunned and under-supplied.\nMost of those boarding buses, some with the word “police” on the side and surrounded by men in government flak jackets, were men of fighting age, according to Reuters.\n\"We are very sad for what is happening today. We kept urging the international community to lift the siege but there was no response,\" a rebel fighter going by the name Abu al-Homsi told The Associated Press. \"We have lost more than 2,000 martyrs in nearly two years of siege.\"\nEvery rebel was allowed to take a rifle and a bag of belongings, he added.\nAnd unlike a civilian evacuation in February, those fleeing were allowed to keep their light weapons and would not be held for questioning and checks by security forces, activists said. Indeed, the deal brokered by the United Nations allowed for a rocket-propelled grenade launcher and a machine gun per bus as well, al-Homsi said.\n\"The opposition has no significant support and is not capable of confronting well-trained foreign fighters. No one believes the opposition can sustain long term against the military.\"\nFighters were expected to leave the city where protests first sparked in 2011, their departures synchronized with aid delivery and release of captives held by the rebels near two northern Shiite towns, Nubl and Zahraa, and the town of Kassab in Latakia province.\nAccording to the deal, rebels would be taken close by to the rebel-held towns a short distance away in Homs province.\nRebels were maintaining a toe-hold in Homs, however, with fighters in a district just outside the Old City refusing to join the evacuation, according to the AP.","url":"https://www.nbcnews.com/news/world/syrian-rebels-evacuated-capital-revolution-n99186"}
