{"authors":[],"date_download":"2018-10-23 03:10:49","date_modify":"2018-10-23 03:10:49","date_publish":"2016-01-28 18:35:42","description":"Syrian opposition members meeting in Riyadh have postponed until Friday a decision on whether to attend peace talks due to start in Geneva the same day, dele...","filename":"data/vaneerConsumption/SyriaoppositionputsoffpeacetalksdecisionuntilFriday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h3hj-2vdWmEltwXfba0ce28e632ba675e-17_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421491_Syria-opposition-puts-peace-talks-decision-Friday_1540264249.html","title":"Syria opposition puts off peace talks decision until Friday","title_page":"Syria opposition puts off peace talks decision until Friday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Syria opposition puts off peace talks decision until Friday\nSyrian opposition members meeting in Riyadh have postponed until Friday a decision on whether to attend peace talks due to start in Geneva the same day, delegates said.\n\"I believe tomorrow we will take a decision\" on whether or not to attend the UN-brokered negotiations, said one delegate from the Saudi-backed High Negotiations Committee.\n\"We will not be in Geneva tomorrow,\" said another opposition source.\nA fighter from Jaish al-Islam (Islam Army) holds a position during clashes with regime forces in Harasta Qantara, on the eastern outskirts of Damascus, on January 23, 2016 ©Amer Almohibany (AFP)\nThe Committee was formed in December when the main Syrian political opposition and armed factions came together in Riyadh for an unprecedented bid at unity, after months of Saudi effort.\nIt insists that it is the sole permitted representative of Syria's opposition, despite objections from others.\nThe Committee has met for three days in the Saudi capital to discuss whether or not to participate in the Geneva process.\nIt had said it was waiting for UN \"clarifications\" after the UN issued invitations to other opposition figures.\nBut delegate Monzer Makhos told AFP that members \"would not be there\" in Geneva for the planned start of talks \"as we have yet to make a decision\".\nThe Committee wants assurances from the international community that it will move to end regime attacks on civilians and allow humanitarian aid.\nThe Riyadh discussions were to resume at 0600 GMT on Friday, the delegate said.","url":"https://www.dailymail.co.uk/wires/afp/article-3421491/Syria-opposition-puts-peace-talks-decision-Friday.html"}
