{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor","James Slack Political Editor For The Daily Mail"],"date_download":"2018-10-22 20:10:28","date_modify":"2018-10-22 20:10:28","date_publish":"2016-01-28 00:27:57","description":"Britain is to spend £10m to on Europe's system for dealing with migrants and part of the money will be spent on making the UK 'more proactive' in finding unaccompanied children who have family in the UK.","filename":"data/vaneerConsumption/SyrianorphanchildrenwhoreachEuropeWILLbeflowntotheUK.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A1DC0100000578-0-image-a-24_1453940795186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420101_Why-not-3-000-migrant-children-PM-Cameron-says-caving-just-encourage-thousands-risk-journey-Mediterranean_1540239028.html","title":"Syrian orphan children who reach Europe WILL be flown to the UK","title_page":"Syrian orphan children who reach Europe WILL be flown to the UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Syrian children who make it to Greece or Italy and have family in Britain will be flown here, it emerged today.\nBritain is to spend £10million to help improve Europe's system for dealing with migrants fleeing war in the Middle East.\nPart of the money will be spent on making the UK 'more proactive' in finding unaccompanied children who have family in the UK.\nThe announcement comes despite David Cameron repeatedly insisting he would not support any policies to relocate refugees already in Europe to Britain because this would create a 'magnet' for more people to try and make the journey.\nDavid Cameron last night rejected calls for Britain to take in 3,000 migrant children who have made the journey to Europe (pictured, migrants arriving on the Greek island of Lesbos)\nDavid Cameron (pictured) said caving in would encourage thousands of youngsters to undertake dangerous boat journeys across the Mediterranean\nUnder the so-called Dublin convention, refugees have to claim asylum in the country where they first arrive in the European Union.\nBut the rules allow for families to be reunited if a new refugee can show they have a relative legally in another country - including Britain.\nThe process is automatic for a parent while aunts, uncles and grandparents can also trigger the rule.\nThe announcement was part of a package aimed at easing pressure on the government after Mr Cameron ruled out taking 3,000 unaccompanied Syrian children identified by Save the Children as already in Europe.\nInstead, Britain will ask the UN to identify the most vulnerable children in refugee camps on the border of Syria so they can be brought to the UK - over and above the 20,000 resettlements already promised.\nImmigration Minister James Brokenshire today said Britain was taking a 'measured' approach to the migration crisis in Europe.\nAnd he told MPs: 'We have asked the UNHCR to make an assessment of the numbers and needs of unaccompanied children in conflict regions and advise on when it is in the best interests of the child to be resettled in the UK and how that process should be managed.\n'The UNHCR has already been clear that these are likely to be exceptional cases.'\nThe minister added: The UK Government will also commit to providing further resources to the European Asylum Support Office to help in “hotspots” such as Greece and Italy to help identify and register children at risk on first arrival in the EU.\n'And we will, of course, continue to meet our obligations under the Dublin Regulations.'\nThe Prime Minister's official spokesman today confirmed Britain will be 'more proactive' in identifying children in Greece and Italy who have a family link to the UK.\nMr Cameron's refusal to take in the 3,000 unaccompanied children mirrors a decision last summer not to take a fixed number of the refugees arriving in Europe from Syria and elsewhere (pictured, migrants in Macedonia)\nCameron said 'no country in Europe has been more generous than Britain in funding refugee camps, whether they are in Syria, Turkey, Lebanon or Jordan' (pictured, migrants in Macedonia)\nThe spokesman said: 'We are looking at the areas where you have the largest amount of refugees arriving and what we’re trying to do is protect children as much as possible from exploitation, from traffickers and so on.\n'The clear driver from the Government has been to keep people in the region and that remains our core goal.\n'But where people have made have made that perilous journey and travelled across where people we want to dissuade further engagement between children and traffickers who might want to take them across Europe.\n'This is very much about trying to identify those children who have arrived in Greece and Italy who have a direct family link with the UK.'\nHOW HIS AID MINISTER JUSTINE GOT IT SO WRONG David Cameron's decision on child refugees comes only days after the International Development Secretary dropped a heavy hint that the UK would take in 3,000 youngsters from Europe. On Sunday, The Observer newspaper claimed the PM was close to giving in to demands by charities and taking children directly from the continent. No 10 insiders dismissed the report, insisting that no decision had been taken. But Justine Greening told Dermot Murnaghan on Sky News: 'We've steadily evolved our approach as this crisis has evolved, we've been right at the forefront, frankly, of helping children who have been affected by this crisis and will continue to look at how we can do that over the coming days and weeks.' Her comments followed a visit to refugee camps in France on Saturday by Jeremy Corbyn. The Labour leader called on Mr Cameron to offer children not just a refuge in the UK but proper homes and education, saying: 'We must reach out the hand of humanity to the victims of war.'\nMr Cameron's refusal to take in the 3,000 unaccompanied children mirrors a decision last summer not to take a fixed number of the refugees arriving in Europe from Syria and elsewhere.\nThe Prime Minister was under pressure to throw open the UK's doors when photographs were published of the body of three-year-old Aylan Kurdi on a Turkish beach after an overcrowded boat carrying his family capsized.\nBut he said this would only make matters worse, which has been proved correct by the chaos triggered by Germany's decision to say the country would accept a million asylum seekers.\nInstead of helping to solve the humanitarian crisis, it has led to even more people trying to flood into Europe.\nYesterday, Mr Cameron faced down his critics – saying 'no country in Europe has been more generous than Britain in funding refugee camps, whether they are in Syria, Turkey, Lebanon or Jordan'.\nHe added: 'We said that we would resettle 20,000 people in our country, and we promised to resettle 1,000 by Christmas. We achieved that.\n'If we add up all that Europe has done under its relocation and resettlement schemes, we find that all the other 27 member states have done less than we have done here in the United Kingdom, because of those 1,000.\n'Yes, we should take part in European schemes when it is in our interests to do so, and help to secure the external European border; but we are out of Schengen, we keep our own borders, and under this Government that is the way it will stay.'\nRather than taking children direct from mainland Europe, the UK is to work with UNHCR on an initiative to identify and resettle unaccompanied refugee children direct from conflict regions such as Syria.\nOfficials will look for the most vulnerable cases but check they are genuinely on their own without relatives to look after them.\nMeanwhile, the Department for International Development will use the aid budget to create a fund of up to £10 million to support the needs of 'vulnerable' migrant children in Europe.\nExtra funds will also be ploughed into the European Asylum Support Office to help Greece and Italy identify migrants, including children, who could be reunited with family members elsewhere in Europe. In a small number of cases, this could involve allowing them to move to Britain.\nThe Prime Minister's wife Samantha is an ambassador for Save the Children, which has been leading the campaign to let in unaccompanied children.\nShe spoke recently of her horror at the tragic stories of Syrian mothers and children living in refugee camps in Lebanon. This led to speculation at the weekend that Mr Cameron would agree to take children direct from Europe.\nIt was further fuelled by Justine Greening, the International Development Secretary, who said the Government was 'looking at whether we can do more… over the coming days and weeks'.\nTory MPs have cautioned against the Government making the same mistakes as other EU countries, which have suffered a backlash after letting in large numbers of migrants.","url":"https://www.dailymail.co.uk/news/article-3420101/Why-not-3-000-migrant-children-PM-Cameron-says-caving-just-encourage-thousands-risk-journey-Mediterranean.html"}
