{"authors":[],"date_download":"2018-10-22 20:40:21","date_modify":"2018-10-22 20:40:21","date_publish":"2016-01-28 02:40:25","description":"A major Syrian opposition group postponed a decision on joining peace talks in Switzerland, as wrangling over who will go threatened to derail the biggest pu...","filename":"data/vaneerConsumption/Syrianoppositionputsoffdecisiononpeacetalks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g25r-2vdWmEltwXfba0ce28e6322ec882-829_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3419694_Syria-opposition-delays-peace-talks-decision-Thursday_1540240821.html","title":"Syrian opposition puts off decision on peace talks","title_page":"Syrian opposition puts off decision on peace talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Syrian opposition puts off decision on peace talks\nA major Syrian opposition group postponed a decision on joining peace talks in Switzerland, as wrangling over who will go threatened to derail the biggest push yet to resolve the war.\nThe Saudi-backed High Negotiations Committee -- formed last month in an effort to unite Syria's fractious political and armed opposition -- met in Riyadh for a second day on whether to accept a UN invitation to the Geneva talks.\nSalem al-Meslet, a Committee spokesman, said the group could not make a decision until it has received a response from UN Syria envoy Staffan de Mistura.\nAn unexploded mortar shells sticks out of the ground in front of Syrian pro-government forces standing on a street in the town of Sheikh Miskeen in southern Daraa province on January 26, 2015 after they retook the strategic town from rebel forces\nThe Committee insists it must be the sole opposition delegation at the talks and wants \"clarifications\" after the United Nations issued invitations to other regime opponents.\n\"Whether we say 'yes' or 'no' depends on the reply of De Mistura,\" Meslet told AFP and Al-Arabiya television.\nBut he added there was a \"positive\" atmosphere at the Riyadh meeting.\nMeslet said the Committee also needed clarification that the international community would address humanitarian issues.\nThe Geneva negotiations had already been delayed from Monday over the issue of who will represent the myriad forces opposing President Bashar al-Assad in Syria's nearly five-year civil war.\nInstead of meeting face-to-face, Geneva delegations are expected to engage in indirect negotiations.\nOfficials have said the talks, only the second intra-Syrian dialogue since the start of the conflict, would run over six months, with the first round expected to last between two and three weeks.\n- International pressure -\nSyria's regime has designated its UN envoy Bashar al-Jaafari as its chief negotiator.\nDiplomats, including US Secretary of State John Kerry who met Committee members last weekend, have pressured the opposition to go to Geneva.\nThe United States, which sympathises with the rebels and sees the talks as the start of a transition process that would see Assad step down, urged them to take part in the talks.\n\"We believe that the HNC delegation and the various factions of the Syrian opposition have an historic opportunity to go to Geneva and propose serious practical ways to implement a ceasefire, humanitarian access and other confidence-building measures, and that they should do so without preconditions,\" State Department spokesman Mark Toner said.\nThe talks are part of a UN-backed plan, agreed by top diplomats last year in Vienna, that envisages negotiations followed by a transitional government, a new constitution, and elections within 18 months.\nThe roadmap is the most ambitious plan yet to end the conflict which has killed more than 260,000 people and forced millions from their homes.\nDe Mistura's office said on Tuesday it had issued invitations to the talks, but refused to say who had been invited.\nThe Committee, which earlier this month named Mohammed Alloush of the Islamist rebel group Army of Islam as its chief negotiator, confirmed it had received an invitation, but so did several other opposition figures not belonging to the body.\nIt was unclear whether the others had been invited as official delegates or as observers.\nFrench Foreign Minister Laurent Fabius said Wednesday it was his understanding that only the Committee would be recognised as a negotiating delegation.\n\"(The Committee) is representative and it must be the negotiator, that is what was confirmed to me by Mr De Mistura, even if there can be other people\" at the talks, Fabius told France Culture radio.\nCommittee coordinator Riad Hijab said a UN Security Council resolution calling for an end to sieges in Syria and the delivery of humanitarian aid \"should not be ignored\".\n- Myriad interests -\nUN aid chief Stephen O'Brien on Wednesday said almost 75 percent of UN requests last year to get aid into \"besieged\" and other difficult areas went unanswered by Syria's government.\nMany civilians are on the brink of starvation.\nThe row over who will attend reflects not only internal divisions but also the interests of diplomatic powers embroiled in the Syria conflict.\nRussia, a main Assad ally, has pushed for a broader range of opposition at the talks, with Foreign Minister Sergei Lavrov saying Tuesday that negotiations \"will not achieve results\" if Syria's Kurds are unrepresented.\nAssad's other main ally is Iran, Saudi Arabia's regional rival.\nSyria's most powerful Kurdish organisation, the Democratic Union Party (PYD), said Tuesday it had not yet received an invitation.\nTurkey, a leading backer of the opposition, considers the PYD to be an offshoot of the Kurdistan Worker's Party (PKK) that has waged an insurgency in southeastern Turkey.\nThere have been no suggestions that jihadist movements, including the Islamic State group, which has seized control of large parts of Syria and neighbouring Iraq, should be invited.\nUN Syria envoy Staffan De Mistura looks on at the United Nations Offices on January 25, 2016 in Geneva as he arrives to a press conference on efforts to restart peace talks ©Fabrice Coffrini (AFP/File)\nSyrians inspect damaged buildings following a reported air strike by Syrian government forces in the rebel-held area of Douma, east of the capital Damascus on October 29, 2015 ©Sameer Al-Doumy (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3419694/Syria-opposition-delays-peace-talks-decision-Thursday.html"}
