{"authors":[],"date_download":"2018-10-23 01:47:44","date_modify":"2018-10-23 01:47:44","date_publish":"2016-01-29 15:55:48","description":"Multiple attempts to resolve the Syrian conflict since 2011 have failed. With new peace talks to open on Friday in Geneva, here is a recap of previous effort...","filename":"data/vaneerConsumption/SyriaFouryearsofeffortstoendtheconflict.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i1va-4PuZeKVXE7cd9005b2c876bf2dc7-929_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423035_Syria-Four-years-efforts-end-conflict_1540259264.html","title":"Syria: Four years of efforts to end the conflict","title_page":"Syria: Four years of efforts to end the conflict | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Syria: Four years of efforts to end the conflict\nMultiple attempts to resolve the Syrian conflict since 2011 have failed.\nWith new peace talks to open on Friday in Geneva, here is a recap of previous efforts:\nARAB INITIATIVES\nThe Syrian conflict has killed more than 260,000 people and facilitated the meteoric rise of the extremist Islamic State group ©Amer Almohibany (AFP/File)\n- November 2, 2011: The Arab League says it has reached an agreement with Syria to end the fighting, free detainees and get troops to pull out of cities. None of the clauses is respected. The League eventually suspends Syria and approves unprecedented sanctions against it. In early 2012, Damascus formally rejects the plan and says it is determined to crush the rebellion.\nANNAN PLAN\n- April 12, 2012: UN and Arab League envoy Kofi Annan manages to establish a truce, but it collapses within just a few hours.\nGENEVA I\n- June 30, 2012: A so-called action group meeting in Geneva says it has reached agreement on a Syrian transition of power, but quickly reveals differing interpretations of the deal.\nThe group consists of Arab states, Britain, China, France, Russia, Turkey, and the United States. Washington says it marks the start of a \"post-Assad\" period, in reference to Syrian President Bashar al-Assad, while Beijing and Moscow maintain that it is up to Syrians to determine their own future.\nCHEMICAL WEAPONS AGREEMENT\n- September 14, 2013: Russia and the United States agree in Geneva to dismantle Syria's chemical weapons, after an attack using the banned arsenal and attributed to Assad's regime kills hundreds near Damascus.\nThe deal averts a threatened US-led strike against Syria at the last minute.\nGENEVA II\n- January 22-31, 2014: Negotiations take place in Switzerland between representatives of the Syrian government, backed by Russia, and opposition figures, backed by the United States. They end without results.\nOn February 15 UN mediator Lakhdar Brahimi, who has replaced Annan, puts an end to the talks. He resigns on May 13, after more than 20 months of fruitless efforts. In July he is replaced by Italian-Swedish diplomat Staffan de Mistura.\nRUSSIAN OFFENSIVE/VIENNA TALKS\n- October 30, 2015: A month after the start of Russian air strikes in Syria at the request of Damascus, 17 countries, including Russia, the United States, France, and for the first time Iran, meet in Vienna to find a political solution. The regime and opposition are absent from the talks. The meeting breaks up with participants in deep disagreement over the fate of Assad.\n- November 14: World diplomats gathered in Vienna agree on a fixed calendar for Syria but remain sharply at odds over Assad.\n- December 10: The main Syrian opposition groups, meeting in Riyadh, say they are open to talks with the regime but demand that Assad step down at the start of a transitional period.\n- December 18: For the first time, the 15 members of the UN Security Council unanimously adopt a plan for a political solution, including negotiations between the opposition and the regime as well as a ceasefire.\nGENEVA III\n- January 20, 2016: Syria's largest opposition coalition names Mohammed Alloush, a political leader of the Saudi-backed armed group Jaish al-Islam, as its chief negotiator for talks with the regime. The tolerated domestic opposition criticises the appointment, while Russia describes his group as \"terrorist\".\n- January 28: The Saudi-backed opposition High Negotiations Committee says it will not attend Geneva negotiations until an agreement is reached on aid entering besieged towns.","url":"https://www.dailymail.co.uk/wires/afp/article-3423035/Syria-Four-years-efforts-end-conflict.html"}
