{"authors":[],"date_download":"2018-10-22 21:03:45","date_modify":"2018-10-22 21:03:45","date_publish":"2014-05-05 21:44:03","description":"Syrian rebels will be making the case tomorrow that the Syrian regime used chemical weapons in the past and continues to use poisons.","filename":"data/vaneerConsumption/SyrianRebelstoPresentNewEvidenceofChemicalWeaponsUse.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_17/393111/140422-syria-chlorine-02_1fcebd552ca485f12edb65f226d177b1.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_syrian-rebels-present-new-evidence-chemical-weapons-use-n97606_1540242225.html","title":"Syrian Rebels to Present New Evidence of Chemical Weapons Use","title_page":"Syrian Rebels to Present New Evidence of Chemical Weapons Use","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Chief Foreign Correspondent Richard Engel and Lawahez Ja'abari\nIstanbul, Turkey — In a press conference in Istanbul tomorrow, Syrian rebels plan to present new evidence of what they describe as a poisonous chlorine attack. NBC News got a sneak preview and here are the key claims along with the evidence that will come out in the press conference tomorrow:\n1. The rebels claim that at around 11 a.m. on April 21, 2014, two chlorine bombs were dropped from a helicopter on the rebel stronghold of Talmanes. One of the bombs exploded, killing one person and injuring several others (the rebels have medical documents to support this claim). The other bomb, which did not explode seems, from photos that NBC News has reviewed, to carry the logo of Norinco, a Chinese arms company which has said that it was \"investigating\" the claims that its products are being used by the Syrian regime.\nThe rebels say that the bombs, which were modified to be dropped out of a helicopter, could only have been used by the regime, as no other forces operate aircrafts in Syria — NBC News cannot verify the claims independently. The use of chlorine, while not in direct violation of the U.S.-Russian weapons deal that mandates the removal of Syrian chemical weapons, would, if proven, be a violation of the spirit of the agreement.\n2. The rebels will also show evidence of what they claim is further proof of the alleged sarin gas attack on Saraqib last year. NBC has seen video and photos ahead of tomorrow's press release, which the rebels say show an unexploded canister in a lake that they believe contains Sarin. There is no way of knowing from watching the footage what the canister contains or where it was produced.\nIn summary, the Syrian rebels will be making the case tomorrow that the Syrian regime used chemical weapons in the past and continues to use poisons such as chlorine gas against civilian towns and villages, despite the much-lauded U.S.-Russian chemical weapons agreement.","url":"https://www.nbcnews.com/news/world/syrian-rebels-present-new-evidence-chemical-weapons-use-n97606"}
