{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:34:02","date_modify":"2018-10-30 20:34:02","date_publish":"2017-01-03 14:16:31","description":"Contents: Video emerges from Burma (Myanmar) showing police beating Rohingya Muslims; Syrian opposition groups suspend negotiations of peace talks | National Security","filename":"data/vaneerConsumption/SyrianOppositionGroupsSuspendNegotiationsofPeaceTalks.json","image_url":"https://media.breitbart.com/media/2016/12/wi/ap/14/333g3gb-photo-50-e1483452980564.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_03__1540931642.html","title":"Syrian Opposition Groups Suspend Negotiations of Peace Talks","title_page":"Syrian Opposition Groups Suspend Negotiations of Peace Talks","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nVideo emerges from Burma (Myanmar) showing police beating Rohingya Muslims\nSyrian opposition groups suspend negotiations of peace talks\nVideo emerges from Burma (Myanmar) showing police beating Rohingya Muslims\nScreen grab from video. Dozens of Rohingyas on the right are being forced to watch the beating\nFor months, Burma (Myanmar) police and soldiers have been committing ethnic cleansing of Rohingya Muslims in Rakhine State by scorched earth attacks, burning down their villages, and committing massacres, rapes and other atrocities that have forced tens of thousands to flee for their lives across the border into Bangladesh.\nBurma has forbidden any journalists or humanitarian groups from entering Rakhine State to investigate, which many people consider to be an implied admission of guilt by Burma’s government.\nHuman Rights Watch (HRW) has documented the ethnic cleansing through a series of “before and after” satellite images. Burma’s government agrees that the satellite images show that Rohingya villages are being burned down, but they make the laughable claim that the Rohingyas are burning down the villages themselves in order to embarrass the government. There have also been dozens of videos showing Burma’s police beating and raping Rohingya civilians, but Burma’s government claims that all of these videos are phony and have been fabricated.\nSo now a new video has emerged showing police beating and kicking a civilian, and forcing dozens of other Rohingyas to watch as the beating takes place. The video was taken by a policeman smoking a cigarette. Other policemen obviously knew that he was taking the video, suggesting that taking videos of policemen beating, killing and raping Rohingyas is some kind of standard procedure.\nThe mystery is how this video became public. It is thought that some dissident official with access to the video, and shocked by the behavior of his fellow policeman, published the video on the internet surreptitiously, where it has gone viral.\nThe second remarkable thing, beyond the fact of the video itself, is that Burma’s government is acknowledging that the video is portraying a real event. The policemen appearing the video have been arrested, and the government says that there will be an investigation for police brutality.\nNobody seriously believes that anything will change. The investigation may lead to the conviction of one or two policemen, but the Buddhist xenophobic hatred of Muslims in Burma goes very deep. The root of the violence is xenophobic attacks by Buddhists led by Buddhist monk Ashin Wirathu and his “969 movement,” against the Rohingya Muslims, including rapes, torture and other atrocities committed by Buddhists, targeting the Rohingyas. The Rohingyas have a darker skin than Burmese, and they speak a Bengali dialect.\nThere are about a million Rohingyas living in Rakhine State, where they have lived for generations, but Burma’s government refuses to recognize them as citizens. They are, for all practical purposes, a stateless ethnic group, living on the Bangladesh-Burma border for generations, but rejected by both countries. In fact, Burma refuses to identify the Rohingya as a unique ethnic group, preferring to call them Bengali, and referring to them as illegal immigrants from Bangladesh. In the last few years, large mobs of Buddhists have massacred entire neighborhoods of Muslims in various regions of the country, mutilating, raping and killing hundreds, and displacing thousands from their homes. We’re used to hearing about atrocities committed by Muslim jihadists in the Mideast, but in Burma the situation is reversed — it’s the Buddhists who are committing the atrocities, while the Muslims are, for the most part, innocent victims. Russia Today and Bangkok Post and YouTube: Rohingya beating video\nRelated Articles\nSyrian opposition groups suspend negotiations of peace talks\nThe Free Syrian Army (FSA), a coalition of “moderate” groups opposing Syria’s president Bashar al-Assad, have suspended peace talks because of repeated ceasefire violations by al-Assad’s warplanes and by al-Assad’s ally, the Iran-backed Lebanon militia Hezbollah.\nThe ceasefire was announced last week, brokered by Russia, Iran, and Turkey, and was to lead to peace talks soon, taking place in Astana, the capital city of Kazakhstan. The United States, the United Nations, and the European Union were all excluded from negotiations about the ceasefire and peace talks, which presumably was supposed to make them more likely to succeed.\nAl-Assad has always been the most volatile of the participants in any of these discussions. Al-Assad started the civil war in 2011, when his bombers started targeting innocent women and children, including Palestinians in a refugee camp near Latakia, which drew young jihadists from around the world to Syria to fight al-Assad, resulting in the formation of the so-called Islamic State (IS or ISIS or ISIL or Daesh).\nSo the question that I’ve asked repeated for months and years is how can any “peace deal” ever succeed in view of al-Assad’s evident determination to exterminate as many Sunni women and children as he can?\nThe FSA has issued its statement suspending its participation in the peace talks because his warplanes have been bombing civilian targets in a region near Damascus in which the city’s water supply is located. Hezbollah and Syrian army troops are also headed for the same region. According to the FSA, “Any (advance) on the ground goes against the (ceasefire) agreement and if things don’t return to how they were before, the accord will be considered null and void.”\nIt has been assumed that Russia and Iran would control al-Assad and force him by any means necessary to honor the ceasefire, but it appears that assumption is wrong. Unless Russia and Iran find a way to control al-Assad, then the “ceasefire” will collapse completely within a few days. France 24 and VOA\nRelated Articles\nKEYS: Generational Dynamics, Burma, Myanmar, Rohingyas, Rakhine state, Bangladesh, Syria, Damascus, Bashar al-Assad, Russia, Iran, Hezbollah, Free Syrian Army, FSA, Latakia, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2017/01/03/3-jan-17-world-view-syrian-opposition-groups-suspend-negotiations-peace-talks/"}
