{"authors":["Associated Press"],"date_download":"2018-10-23 02:29:16","date_modify":"2018-10-23 02:29:16","date_publish":"2017-03-10 11:34:22","description":"ANKARA, Turkey (AP) - The main Syrian Kurdish force fighting Islamic State militants in northern Syria claimed on Friday that it has enough fighters to take...","filename":"data/vaneerConsumption/SyriaKurdishledfightersseeforceboostinginpushonIS.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195663-1489145663-810_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300918_Syria-Kurdish-led-fighters-force-boosting-push-IS_1540261756.html","title":"Syria Kurdish-led fighters see force boosting in push on IS","title_page":"Syria Kurdish-led fighters see force boosting in push on IS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ANKARA, Turkey (AP) - The main Syrian Kurdish force fighting Islamic State militants in northern Syria claimed on Friday that it has enough fighters to take the extremists' de facto capital of Raqqa with the help of the U.S.-led coalition - remarks that reflected a veiled warning to Ankara and also to rival, Turkey-backed opposition forces making headway toward the city.\nThe comments by Cihan Sheikh Ehmed, the spokeswoman of the Syria Democratic Forces, came as U.S. troops are playing a bigger role on the ground in the battle to conquer Raqqa in northern Syria.\nGen. Joseph Votel, the top U.S. commander in the Middle East signaled on Thursday that there will be a larger and longer American military presence in Syria to accelerate the fight against IS and quell friction within the complicated mix of warring factions there.\nFILE - This frame grab from a video provided by the Syria Democratic Forces (SDF), shows fighters from the SDF opening fire on an Islamic State group's position, in Raqqa's eastern countryside, Syria, Monday, March 6, 2017. The main U.S.-backed force fighting the Islamic State group in Syria has enough fighters to capture the extremists' de facto capital of Raqqa north of the country at a time when U.S. troops are playing a bigger role on the ground in the battle to conquer the city, a spokeswoman for the force said Friday, March 10, 2017. (Syria Democratic Forces, via AP)\nThe SDF spokeswoman said their numbers are increasing with more residents of newly-liberated areas from IS joining the ethnically-mixed force, which has been the most effective group on the ground in Syria in the battle against IS.\n\"We have enough forces to liberate Raqqa with the help of the coalition,\" Sheikh Ehmed said, adding that their troops have intelligence that the Islamic State group is moving some of its leaders outside the city and are digging tunnels in preparations for intense street battles - much like those underway in neighboring Iraq where the Iraqi forces, backed by the U.S.-led coalition, are fighting to rout IS from the western part of the city of Mosul, the extremists' last remaining urban stronghold in Iraq.\nBut the spokeswoman's remarks are likely to anger Turkey, which has insisted that Syrian opposition fighters backed by Ankara should lead the offensive on Raqqa rather than the SDF, which is dominated by the Syrian Kurdish militia known as the People's Protection Units, or YPG. Turkey has declared the YPG a terrorist organization and considers it to be linked to its own home-grown Kurdish insurgency.\nAlso Friday, Turkey's military said Turkish troops and Turkey-backed Syrian opposition forces have killed - or \"neutralized\" - 71 Syrian Kurdish fighters in northern Syria this week. The operations are part of Turkey's months-long incursion into its war-torn neighbor in a push against IS but also in an effort to restrict U.S.-backed SDF.\nSince the Turkish operation started in August, the joint Turkish and Syrian opposition forces have killed as many as 2,647 IS militants and 425 Syrian Kurdish fighters in Syria, said a Turkish military statement. It added that more than 2,000 square kilometers (772 square miles) in northern Syria are now under control of the Turkish-backed forces.\nSDF fighters have been on the offensive in the Raqqa area since November and have closed major supply roads used by IS. They have captured wide areas from IS since then under the cover of airstrikes of the U.S.-led coalition.\nLate last month, Pentagon leaders sent a new plan on how to defeat IS to the White House, including a variety of options for the ongoing fight in Iraq and Syria. The White House hasn't yet approved the plans, but the recent deployments into Syria suggest that President Donald Trump may be leaning toward giving the Pentagon greater flexibility to make routine combat decisions in the IS fight.\nSheikh Ehmed said troops from the U.S.-led coalition have increased in northern Syria and are playing a bigger role in the battle for Raqqa. She did not give any figures of troops from the U.S.-led coalition.\nRussia is not likely to stay out of the push on Raqqa, nor are the Syrian President Bashar Assad's forces, which Moscow backs.\nThe Russian military said on Friday that its warplanes killed more than 600 militants in just one week while backing the Syrian army's offensive against IS. Col. Gen. Sergei Rudskoi of the military's General Staff said Russian aircraft have carried out 452 airstrikes in support of the Syrian government forces.\nIn addition, Rudskoi stated that Syrian government forces have recaptured 92 towns and villages across a territory of 479 square kilometers, or 185 square miles, from IS in the past week.\n___\nAssociated Press writers Suzan Fraser in Ankara, Turkey, and Vladimir Isachenkov in Moscow contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4300918/Syria-Kurdish-led-fighters-force-boosting-push-IS.html"}
