{"authors":[],"date_download":"2018-10-22 20:50:04","date_modify":"2018-10-22 20:50:04","date_publish":"2014-06-03 04:36:20","description":"Tuesday's balloting comes amid a devastating, three-year civil war that activists say has killed more than 160,000 people.","filename":"data/vaneerConsumption/SyrianVotersLineUptoCastBallotsforPresident.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483201/140603-syria-election-cover-5a_8f895dd0c15f1c3a3708373b1ce8e37c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_syrian-voters-line-cast-ballots-president-n120951_1540241404.html","title":"Syrian Voters Line Up to Cast Ballots for President","title_page":"Syrian Voters Line Up to Cast Ballots for President","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDAMASCUS, Syria - Waving photos of their leader and dancing with flags, thousands of Syrians pledged renewed allegiance to President Bashar Assad as they voted Tuesday in the country's presidential election decried by the opposition as a charade.\nSome stamped ballots with their blood, others chose to vote in full sight of other voters and television cameras — rather than go behind a partition curtain for privacy.\nMen and women wore lapel pins with Assad's picture and said re-electing him would give the Syrian leader more legitimacy to find a solution to the devastating three-year conflict that activists say has killed more than 160,000 people, about a third of whom were civilians.\nThe balloting is only taking place in government-controlled areas and Assad's win — all but a foregone conclusion — would give him a third seven-year term in office, tighten his hold on power and likely further strengthen his determination to crush the insurgency against his rule.\nThe opposition's Western and regional allies, including the U.S., Britain, France, Saudi Arabia and Turkey, have called the vote a sham. The so-called internal Syrian opposition groups seen as more lenient are also boycotting the vote, while many activists around the country are referring to it as \"blood elections\" for the horrific toll the country has suffered.\nThe vote is also Syria's first multi-candidate presidential election in more than 40 years and is being touted by the government as a referendum measuring Syrians' support for Assad. He faces two government-approved challengers in the race, Maher Hajjar and Hassan al-Nouri.\nSyrian TV said Assad cast his ballot in the morning hours at a school in the posh Damascus neighborhood of al-Malki where he resides.","url":"https://www.nbcnews.com/news/world/syrian-voters-line-cast-ballots-president-n120951"}
