{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:48:26","date_modify":"2018-10-30 20:48:26","date_publish":"2015-01-29 15:28:05","description":"This week, Palestine's Islamist Hamas movement congratulated the head of Greece's newly-elected, far-left Syriza coalition on his party's victory and hailed him for his staunch opposition to \"Israeli crimes, aggression, and siege on Gaza.\" |","filename":"data/vaneerConsumption/SyrizaIsHereHamasHailsGreecesNewRadicalStaunchlyAntiIsraelPoliticalFaction.json","image_url":"https://media.breitbart.com/media/2015/01/Greek-Syriza-party-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_29__1540932506.html","title":"Syriza Is Here: Hamas Hails Greece's New Radical, Staunchly Anti-Israel Political Faction","title_page":"Syriza Is Here: Hamas Hails Greece's New Radical, Staunchly Anti-Israel Political Faction | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This week, Palestine’s Islamist Hamas movement congratulated the head of Greece’s newly-elected, far-left Syriza coalition on his party’s victory and hailed him for his staunch opposition to “Israeli crimes, aggression, and siege on Gaza.”\nGreece’s new Prime Minister Alexis Tsipras and his Syriza party, which includes a slew of leftists ranging from Marxists to Green Party members, have openly expressed their disdain for Israel and attempted to disguise their anti-Semitism by proceeding under the front of anti-Zionism, according to a report by the Jerusalem Post. Hezbollah takes on a similar stance.\nLast year, Tsipras reportedly said “The world should make every possible effort so that Israel ends its criminal attack and brutality against Palestinians.” His words were delivered during a speech he gave at a march in Athens protesting Israel’s defensive Operation Protective Edge war against Hamas in Gaza last summer. The war began following the kidnapping and brutal murders of three young Israel teens by Hamas terrorists. One of the teens held dual U.S.-Israel citizenship.\nDespite the fact that Israel and Greece have shared strong and positive bilateral relations in their military, intelligence, economy, and culture (since 2008), Syriza’s anti-Israel roots run deep. The party has constantly identified itself with the Palestinian cause and the faction’s former head, defense lawyer Nikos Konstandopoulos, has reportedly represented convicted and alleged Arab terrorists who have been arrested in Greece, the Post notes.\nAdditionally, Syriza has expressly stated its support for the creation of a Palestinian state within the 1967 borders, echoing the suggestions placed forth by United States President Barack Obama in 2011. The 1967 lines are, in reality, the armistice lines at the end of Israel’s war of independence in 1949, and pose a huge security risk for Israel because they are virtually “indefensible.”\n“When civilians and children are killed at beaches facing the same sea that borders on the European continent, we cannot remain passive, because if this happens on the other side of the Mediterranean today, it can happen on our own side tomorrow,” Tsipra’s said according to the Post. His words echoed years of warnings throughout Europe and the west about the spread of the rise of radical Islam.\nTsipras’s Syriza party victory marks the first time in the history of the European Union that a leftist radical group has been elected into power. Syriza’s victory is greatly attributed to a last-ditch attempt and tremendous anger Greece’s population possess against the ailing nation’s German-backed austerity which has driven poverty up and pushed employment rates beyond the 25% mark, notes the Post.\nAmong the promises Tsipras has made to Greece’s desperate-for-change population are raising the minimum wage (despite the underpinnings of economic instability to carry out such a move), rehiring laid-off government workers, and hiking up government expenditures with the goal of having those funds go towards free health care and electricity for those who cannot afford it.\nThe viability of Tsipras’s largely seen as empty promises have come under tremendous scrutiny by economists in Europe and throughout the world.\nFollow Adelle Nazarian on Twitter: @AdelleNaz.","url":"https://www.breitbart.com/national-security/2015/01/29/syriza-is-here-hamas-hails-greeces-new-radical-staunchly-anti-israel-political-faction/"}
