{"authors":["Jacob Polychronis For Daily Mail Australia"],"date_download":"2018-10-22 23:14:04","date_modify":"2018-10-22 23:14:04","date_publish":"2017-03-16 06:07:40","description":"Tabcorp received the highest civil penalty in Australian corporate history on Thursday. Chief executive David Attenborough (pictured) said Tabcorp has accepted the $45million fine.","filename":"data/vaneerConsumption/TabcorpfinedhighestAustraliancivilpenaltyinhistory.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E52307F00000578-0-image-a-90_1489644368336.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318864_Tabcorp-fined-highest-Australian-civil-penalty-history_1540250044.html","title":"Tabcorp fined highest Australian civil penalty in history","title_page":"Tabcorp fined highest Australian civil penalty in history | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tabcorp has been dealt the highest civil penalty in Australian corporate history of $45million for breaching anti-money laundering and counter-terrorism financing laws.\nThe Federal Court imposed the fine on Thursday after finding that the gambling company breached the AML/CT Act on 108 occasions over a five-year period.\nTabcorp failed to alert the Federal Government's financial intelligence and regulatory agency of suspicious behaviour that included money laundering and credit card fraud, according to ABC.\nTabcorp were dealt the highest civil penalty in Australian corporate history of for breaching anti-money laundering and counter-terrorism financing laws. Chief executive David Attenborough said the company have taken measures to ensure they comply with regulations in the future\nThe Australian Transaction Reports and Analysis Centre filed papers to the Federal Court in July 2015 against three Tabcorp companies for non-compliance with legislation.\nAUSTRAC chief executive Paul Jevtovic said failure to comply with AML/CTF laws places national security at risk.\n'Failing to uphold a robust AML/CTF program creates opportunities for serious and organised crime and terrorist groups to conceal the movement and use of illicit funds for attacks and crimes against Australian citizens,' Mr Jevtovic said.\n'There can be no doubt that this was a serious failure in the corporate governance and the size of the penalty reflects a consistent and extensive noncompliance.'\nTabcorp failed to alert the Federal Government's financial intelligence and regulatory agency of suspicious behaviour that included money laundering and credit card fraud\nThe Federal Court found that the gambling company breached the Anti-Money Laundering and Counter-Terrorism Financing Act on 108 occasions over a five-year period.\n'The noncompliance arises from a corporate culture that is indifferent to money laundering and terrorism financing requirements.'\nTabcorp chief executive David Attenborough said the company has taken measures to ensure they comply with regulations in the future.\n'We have made a significant investment in enhancing our compliance over the last three years and remain focused on being the industry leader in regulatory compliance across all of our operations,' Mr Attenborough said.\n'We remain firmly committed to continuing to work cooperatively with AUSTRAC into the future.'","url":"https://www.dailymail.co.uk/news/article-4318864/Tabcorp-fined-highest-Australian-civil-penalty-history.html"}
