{"authors":[],"date_download":"2018-10-30 01:21:58","date_modify":"2018-10-30 01:21:58","date_publish":"2016-11-04 13:48:19","description":null,"filename":"data/vaneerConsumption/TacklingtheMiddleEastAftertheElection.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/Recep_Tayyip_Erdoğan_and_George_Papandreou_Erzurum_January_2011_11.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862518.html","title":"Tackling the Middle East After the Election","title_page":"Tackling the Middle East After the ElectionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The next U.S. president will have a difficult job in the Middle East. The Obama administration’s failure to appreciate the long-term consequences of its actions (and inactions) have allowed forces unfriendly to the United States to make unprecedented strategic, political, and even territorial gains.\nThe Obama administration’s recently reaffirmed strategy toward ISIS has required Iraq’s security forces to spend two years gradually getting the upper hand hand over an enemy they outnumber well over 10 to 1. Nonetheless, ISIS is on the verge of losing Mosul. The next administration should help the Iraqi Government consolidate these gains, even if it means more boots on the ground. Additionally, it should get over our hang-up about providing heavy weapons to Kurdish Peshmerga who have proven themselves loyal U.S. allies time and again.\nIn Syria, the years-long conflagration and the Obama administration’s failure to deter heavy Russian military intervention has left the next administration with few good options. The status quo is producing not only a cataclysmic death toll, but also a massive refugee crisis that threatens political stability in Europe. One presidential candidate has proposed no-fly zones and safe-havens, while working to arm and protect certain, narrowly-defined rebel groups who stand against both the Assad regime and ISIS. While far from perfect, it beats our current policy of symbolic gestures.\nA longer-term problem is what to do with the Islamist, increasingly authoritarian President Recep Tayyip Erdogan of Turkey, the man responsible for channeling the flow of refugees from Syria into Europe. This longstanding NATO “ally” has clearly jumped off the secular democratic train. The historic role of the military in preserving secular democracy is a thing of the past.\nErdogan’s Turkey is busy establishing itself as an Islamist force, oppressing its Kurdish minority, and even threatening to expand into Iraq and other surrounding areas. The effects are aiding ISIS and further destabilizing the region. Erdogan nevertheless has the gall to actively provoke nearby Russian forces and then call on NATO for support. This kind of behavior risks drawing the West into a much larger conflict with Russia.\nThe next administration will be forced to redefine our relationship with Turkey. It should work with our European allies to exert maximum pressure on Erdogan to change course. If he won’t, we must disentangle ourselves from Turkey, including working to end its NATO membership.\nIran is arguably the gravest immediate and long-term threat to American security in the region. The Iran deal is not working to moderate the regime or end the threat posed by the Islamic Republic’s nuclear program, and the price keeps getting higher. The costs now include ransom payments, allowing Iran access to ballistic missiles, and increased Iranian terror financing. Though international sanctions have been lifted and funds transferred, the U.S. can still back out of the agreement.\nBut this will not be enough — the next president must prioritize the roll-back of Iran’s nuclear program, as well as its aggressive bid for regional hegemony, for which Syria, Iraq, and Yemen are paying a devastating daily toll. A robust effort to weaken Iran (like opposition to the Iran deal last year) is sure to command large, bipartisan majorities.\nThe Iranian regime is not popular at home or in the region, and a thousand signs, small and large, show its vulnerability. The next administration should use all its leverage working with our allies and the regime’s opponents, internal and external, to change course. Of course, as the existential threat of a nuclear-armed Iran draws nearer, the military option must be considered.\nNo individual policy decision, or series of decisions, will fix these problems. As former Secretary of State Dean Acheson said, “At the top there are no easy choices. All are between evils, the consequences of which are hard to judge.” However, a forward-looking policy that prioritizes long-term interests over expediency can reassert America’s leadership and help improve our lot in the Middle East, and that of those in the region who want peace and stability. The U.S. is still the “indispensable nation.”","url":"https://spectator.org/tackling-the-middle-east-after-the-election/"}
