{"authors":[],"date_download":"2018-10-30 19:57:11","date_modify":"2018-10-30 19:57:11","date_publish":"2016-02-03 13:05:33","description":"Sunday is not only a big game day. As fans everywhere prepare to watch the Carolina Panthers and the Denver Broncos compete, there is another rivalry to keep in mind: you versus the chips and dip.","filename":"data/vaneerConsumption/TackletheurgetoovereatataSuperBowlpartywiththese.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/03/Images/photos.medleyphoto.8648117.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_health_tackle-th_eb4f470781bf8b1ec6317e6b07fa2793__1540929431.html","title":"Tackle the urge to overeat at a Super Bowl party with these...","title_page":"Tackle the urge to overeat at a Super Bowl party with these...","title_rss":"NULL","source_domain":"ajc.com","text":"Sunday is not only a big game day.\nAs fans everywhere prepare to watch the Carolina Panthers and the Denver Broncos compete, there is another rivalry to keep in mind: you versus the chips and dip.\nIn fact, the Super Bowl is the nation’s second-largest day for food consumption, next to Thanksgiving Day, according to the U.S. Department of Agriculture. That’s gobs of chips and salsa, spicy meatballs and, of course, the staple food of the Super Bowl, chicken wings (we are talking more than 1 billion chicken wings).\nBut Sunday doesn’t have to be one endless buffet of snacking. A few simple adjustments — such as swapping out processed foods for raw vegetables and sliced fruit, and getting off the couch (even if it’s just during the commercials) — can help curb unnecessary calorie consumption, according to experts.\nJennifer Hill Booker, a personal chef in Atlanta and owner of the catering company Your Resident Gourmet, likes to serve food in courses, which can help keep the menu exciting (even if the battle between Carolina Panthers and the Denver Broncos isn’t). Bringing out food little by little also ensures food doesn’t sit too long.\nShe likes to mix traditional Super Bowl bites with low-fat options. For example, she often begins with a hummus platter paired with a plate of hot wings, followed by fruit kebabs accompanied by queso and chips, and finishes with a build-your-own-salad and side of meatballs.\nMORE: Can too much sitting cause the so-called Super Bowl flu?\nMORE: How to reach your goals in 2016\nOne of Booker’s favorite low-fat munchies is homemade popcorn dishes. By adding some spices such as cayenne or brown sugar for sweetness, popcorn can be an enticing and high-fiber, vitamin-rich alternative to chips. (One of her stove-top recipes calls for up to 1/4 cup of oil and 1/2 to 2/3 cup of popcorn kernels; once popcorn is popped, add 1-2 teaspoons of fresh, cracked black pepper, 1/3 cup of shredded Parmesan cheese and sea salt to taste.)\nKristen Smith, a registered dietitian in Atlanta, said one of the best ways to keep noshing in check is through portion control. She suggests using small and single-size serving dishes, such as mini cups for dips and coffee mugs for chili, along with mini-size cans of soda.\nSmith, founder of and contributor to the blog www.360FamilyNutrition.org, said her favorite game day treats include mini brownies cut in the shape 0f little footballs, and sliced strawberries with a sweet topping that mixes equal amounts of Greek yogurt and whipped topping.\nTips for fun and healthy Super Bowl eating\n• Don’t skip meals: Since the game isn’t until after dinner, serve your family breakfast, lunch and dinner so they will have filled up on healthy foods and be less tempted by snacks later.\n• Be active: Let this day of sports inspire your family, anything from taking a walk around the block to walking the dog to a friendly family pickup football game. During the game, channel that energy into dancing around when Coldplay performs at halftime. Let your kids create their own touchdown moves and do them each time a team scores.\n• Sack sugary beverages: Have plenty of water on hand for the kids in place of sugary juices or sodas (even if you choose to drink them during the game). Wake up your water by adding slices of fruit.\n• Adults, go easy on the alcohol: Alcohol is full of empty calories, and excess alcohol can lower inhibitions and lead to overeating. For those drinking alcohol, experts recommend sipping a glass of water between alcoholic beverages.\n• Go easy on processed starches: Watch the intake of chips, crackers, french fries, etc., and keep plenty of raw vegetables around for easy, healthy munching.\n• Get creative: Fruit kebabs, homemade popcorn and build-your-own salads are fun and healthy options.\nSources: local nutritionist Keith Kantor, personal chef Jennifer Hill Booker and Children’s Healthcare of Atlanta’s Strong4Life\nMORE: Sometimes, back pain is about more than your back\nGAME DAY FOOD ADVICE\nMany Super Bowl menus are not only high in fat and calories but also a recipe for indigestion and, if not careful, food-borne illness.\nTips for preparing, serving party food\n• Safe food handling: Always wash your hands before and after handling food. Always serve food on clean plates, not those previously holding raw meat or poultry.\n• Cook meat thoroughly: Beef and pork should reach an internal temperature of 145 degrees. And poultry should reach a minimum internal temperature of 165 degrees.\n• The two-hour rule: Foods should not sit at room temperature for more than two hours. Keep track of how long foods have been sitting out and discard anything left out for two hours or more.\n• Keep hot foods hot, cold foods cold: Hot foods should be held at 140 degrees or warmer (you can use chafing dishes, slow cookers or warming trays). Cold foods should be held at 40 degrees or colder (you can nest dishes in bowls of ice or use small serving bowls and replace them).\nSource: USDA Food Safety and Inspection Service\nMORE: No reason for Manning to have to worry about his legacy\nMORE: Curry recalls the first, simpler Super Bowl","url":"https://www.ajc.com/lifestyles/health/tackle-the-urge-overeat-super-bowl-party-with-these-easy-tips/mMuRWPvMo1rC5gGfj4dKlO/"}
