{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:17:20","date_modify":"2018-10-30 19:17:20","date_publish":"2016-09-04 12:58:32","description":"Latinos For Trump founder warned that if Trump lost, Mexico's \"dominant culture\" would result in \"taco trucks on every corner.\"","filename":"data/vaneerConsumption/TacoTrucksonEveryCorner.json","image_url":"https://media.breitbart.com/media/2016/05/Trump-Taco-Bowl-Tweet.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_04__1540927040.html","title":"'Taco Trucks on Every Corner'","title_page":"Latino Trump Supporter Threatens: 'Taco Trucks on Every Corner'","title_rss":"NULL","source_domain":"breitbart.com","text":"Mexican-born Latinos For Trump founder Marco Gutierrez told MSNBC this week that if U.S. immigration is left unchecked, Mexico’s “dominant culture” is going to result in “taco trucks on every corner.”\nDuring his interview last week with Joy-Ann Reid, who was filling in for Chris Hayes, Gutierrez said: “My culture is a very dominant culture. And it’s causing problems. If you don’t do something about it, you’re going to have taco trucks [on] every corner.”\nSen. Adriano Espaillat (D-NY) also participated in the interview. In response to Gutierrez’s statement, he said “I don’t know what culture Mr. Gutierrez is talking about, but I know that the Hispanic culture has a saying — a very prominent saying: ‘Mi casa, tú casa‘ — My house, your house.”\nLater in the discussion, Gutierrez told Reid and Espaillat, “I think you haven’t been in Mexico for a long time. And that’s the problem that you guys [the left] have… You guys defend a Mexico that doesn’t exist anymore. There is a new Mexico that’s rising with crime and we need to stop that. And it starts right here.”\nPrior to his interview with Reid, Gutierrez did a live broadcast from his car ride up to San Francisco, which was posted to social media, in which he said: “Let’s be honest: If you guys, as Americans, don’t do something about it, us as Hispanics, we’re going to have the White House full of taco trucks and we are going to be selling paletas [frozen fruit popsicles] on every corner around the White House. And, we are going to have piñatas and atole [a Mexican beverage] … I know my people guys … You need to defend your country.”\nHe added, “A business that doesn’t take inventory will soon fail,” and expressed his belief that Trump is taking inventory in order to ensure people are coming to America legally and are accounted for. “The law is the law … nothing personal. It’s business.” He explained that he had to suffer without having a driver’s license for one year prior to attaining his citizenship and criticized the fact that illegal immigrants now have access to that same right which he had to attain through legal means.\nGutierrez’s comment caused the hashtag #TacoTrucksOnEveryCorner to surface on social media in response to his “taco trucks” comment. Proponents of the idea expressed their support for the hypothetical:\nDude, so how is this a bad thing? Tacos are life. #TacoTrucksOnEveryCorner pic.twitter.com/QCthBHRiDn — Trevor Donovan (@TrevDon) September 2, 2016\nOthers saw hypocrisy inherent in the responses, suggesting liberals embrace “racist” hashtags so long as they serve a purpose to help them garner more support from a specific demographic:\nToday I learned that racist hashtags that marginalize Hispanic people are OK if they were started by liberals.#TacoTrucksOnEveryCorner — Richard A. Mills (@RAMrants) September 2, 2016\n#TacoTrucksOnEveryCorner confirms the left only see Hispanics as taco makers and voters they can use. NEVER FORGET: pic.twitter.com/OByi2s4z7m — Richard A. Mills (@RAMrants) September 2, 2016\nHonestly, if a candidate ran on #TacoTrucksOnEveryCorner and nothing else, I suspect they would win around 80% of the vote. — Will McAvoy (@WillMcAvoyACN) September 2, 2016\nApparently the left doesn't understand metaphors.#TacoTrucksOnEveryCorner — LatinoPATRIOTS2016 (@AmericanMex067) September 2, 2016\nIf Democrats love minorities so much why are Black & Hispanics in more poverty than ever? #TacoTrucksOnEveryCorner pic.twitter.com/4ec0Xi5B0c — Irma (@latinaafortrump) September 2, 2016\nLast Sunday, Latinos for Trump held its first rally in Orange County, named “Operation Taco Bowl” after an infamous Donald Trump tweet (and Democrats’ response). Hispanics and African Americans joined other Trump supporters in voicing both their support for the Republican presidential nominee, and their opposition to Democratic Party nominee Hillary Clinton.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2016/09/04/latino-trump-supporter-threatens-america-with-taco-trucks-on-every-corner/"}
