{"authors":[],"date_download":"2018-10-30 19:57:52","date_modify":"2018-10-30 19:57:52","date_publish":"2016-08-25 15:19:30","description":"Pros know that tailgating isn't simply a parking lot picnic. The autumn ritual gears you up for the main event: crushing the opposing team on the...","filename":"data/vaneerConsumption/Tailgatinggearandtipsforfirsttimers.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_shopping_tips-an_56ab00d292aa899e695a60061f4fbc6f__1540929472.html","title":"Tailgating gear and tips for first timers","title_page":"Tailgating gear and tips for first timers","title_rss":"NULL","source_domain":"ajc.com","text":"Pros know that tailgating isn't simply a parking lot picnic. The autumn ritual gears you up for the main event: crushing the opposing team on the field -- one hopes.\nIf you're new to tailgating, we've got some gear -- and tips -- that will ensure you and your guests have a blast before kickoff.\nThe tips\nThe folks at Publix take tailgating seriously, and offer a slew of tips (including recipes) for a successful event. Here are a few helpful pieces of advice to get the first-timer started:\nIf you're packing the morning of the game, someone is already taking the best tailgating spot. Pack the night before.\nDo you have a bottle opener for your tailgate? Good. Do you have four? Better.\nIce in your cooler lasts longer if it has less work to do. Refrigerate beverages overnight before packing up for game day.\nA frozen water bottle is like a giant ice cube for your cooler. Then it becomes water. Win. Win.\nBring plates and silverware to your tailgate in a plastic bin with a lid. Seal it tight on the way home when it's full of dirty dishes.\nBring more trash bags to your tailgate than you think you'll need. Because, sometimes, trash bags become ponchos.\nRoughly 96 percent of tailgate problems can be solved with duct tape, hand sanitizer and a permanent marker.\nThe gear\nCuisinart CGG-180 Petit Gourmet\nWhat is it?\nA handy portable gas grill with VersaStand, also known as clever telescoping legs.\nWhy do I need it?\nFirst, note that this grill is ideal for the newbie who is inviting a few friends, this is not for the pit master pro who throws a tailgate blowout for 50.\nPetit Gourmet offers 145-square inches of grilling area, which roughly translates to about eight smallish steaks, eight large burgers, six to 10 chicken breasts and four pounds of fish. It features a 5,500 BTU stainless-steel burner and even-heating porcelain-enameled grate, and is powered by a small propane tank.\nIt sets up and packs away easily and quickly, and the briefcase-style handle makes the grill, which weighs in at 17 pounds, easy to carry.\nPrice, please.\n$122.98\nWhere can I buy it?\nAmazon and Home Depot.\nBottom line:\nIdeal portable grill to get your tailgate going.\nThe Fusion chair by Picnic Time\nWhat is it?\nYou know that Iron Throne everyone gets worked up about on the HBO show Game of Thrones? Well, the Fusion chair will make you feel like tailgate royalty.\nWhy do I need it?\nThe frame is crafted from lightweight aluminum and features padded backpack straps, making it easy to carry. But, that's not the main reason you need this chair. Once you sit in the Fusion chair, you won't want to leave -- there's no need. It's designed with ribbed padding for comfort, but it also features an attached fold-out side table with expandable shelves and a molded cup holder. That's not all. On the other side of the wide, comfy chair there's a detachable, insulated cooler that holds about 24 cans. It also features storage pockets and an adjustable shoulder strap so that you can tote the cooler without the chair. Fusion chair has a 350-pound weight capacity and folds flat so you can easily stash it in your trunk.\nPrice, please.\n$119.95\nWhere can I buy it?\nHayneedle.com\nBottom line:\nThis should be your official tailgating throne.\nWAE Outdoor Rush\nWhat is it?\nA full-featured wireless Bluetooth speaker made for the rugged outdoors, and that includes tailgating.\nWhy do I need it?\nSmall in stature but packing big sound, Outdoor Rush is dust and immersion-resistant, meaning that if you drop it in your beer, you haven't ruined your tunes. In fact, you've got 30 minutes too fish it out before real damage ensues. Plus, it features an FM radio, so if your Smartphone conks out, your speaker won't.\nPrice, please.\n$115.83\nWhere can I buy it?\nAmazon\nBottom line:\nPerfect little speaker for most outdoor activities.","url":"https://www.ajc.com/lifestyles/shopping/tips-and-gear-for-tailgating-first-timers/CwAEVxcTs86FAHCgYItJJI/"}
