{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-23 01:06:44","date_modify":"2018-10-23 01:06:44","date_publish":"2016-01-11 11:33:05","description":"Local officials at a popular tourist destination in Taiwan have come up with a new way to entice more women to go to church. They have constructed a Cinderella-like high-heeled house of god.","filename":"data/vaneerConsumption/Taiwanesetownbuildsahighheelshoeshapedchurchtoattractfemaleworshippers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/30070A3B00000578-0-image-a-5_1452507524944.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3393680_It-s-not-just-devil-wears-Prada-Taiwanese-town-builds-church-shaped-like-HIGH-HEEL-attract-female-worshippers_1540256804.html","title":"Taiwanese town builds a high heel shoe shaped church to attract female worshippers","title_page":"Taiwanese town builds a high heel shoe shaped church to attract female worshippers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Local officials at a seaside town in Taiwan have come up with a new way to entice more women to go to church.\nA Cinderella-like high-heeled shaped house of god made almost entirely out of glass was completed yesterday by the Southwest Coast National Scenic Area in Jaiyi County, reports Huanqiu.com, an affiliation of the People’s Daily Online.\nZheng Rongfeng, the area’s spokesman, said the church is expected to open before the Chinese New Year, which falls on February 8.\nIf the shoe fits: A church has been built in the shaped of a high heel in Taiwan to entice female worshippers\nSpectacular: The blue building stands 55 feet tall, 36 feet high and is made out of 320 pieces of glass\nThe shiny blue church is situated at the Ocean View Park in Budai town, on the east coast of Taiwan.\nMeasuring 55 feet tall and 36 feet wide, the giant structure took over two months to build.\nA video released by China Central Television Station shows the huge building, which is made out of 320 pieces of blue tinted glass, stands on the an empty sandy area near the waterfront.\nAccording to Huanqiu.com, the fashionable church is specially designed to appeal to female worshippers, with many attractive design features.\nHouse of god: Official said the church is expected to open before the upcoming Chinese New Year on Feb. 8\nTread carefully: The new landmark has already attracted hundreds of visitors to the area to take pictures\nZheng Rongfeng, spokesman of the Southwest Coast National Scenic Area, said there will be a total of 100 female-oriented features in the church, among which 71 have been finished.\nThey include chairs for ‘lovers,’ maple leaves, biscuits and cakes - all ideal for romantic photographs.\nSince construction of the stunning high-heeled church began, many tourists have been flocking to the area to take pictures.\nAlthough the reports say this is a church catered towards female worshippers, it is unclear what type of church it is.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3393680/It-s-not-just-devil-wears-Prada-Taiwanese-town-builds-church-shaped-like-HIGH-HEEL-attract-female-worshippers.html"}
