{"authors":[],"date_download":"2018-10-23 03:01:29","date_modify":"2018-10-23 03:01:29","date_publish":"2017-03-10 12:23:11","description":"Investigators probing a bus crash in Taiwan which killed 33 people in one of the island's worst ever road accidents said Friday the driver was travelling at...","filename":"data/vaneerConsumption/Taiwanbusatdoublespeedlimitbeforefatalcrash.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/12/wire-195881-1489148598-641_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301074_Taiwan-bus-double-speed-limit-fatal-crash_1540263689.html","title":"Taiwan bus at double speed limit before fatal crash","title_page":"Taiwan bus at double speed limit before fatal crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A group of tourists had been returning from a trip to see cherry blossoms at a farm in Taiwan in February when their bus veered off a highway on the outskirts of capital Taipei\nInvestigators probing a bus crash in Taiwan which killed 33 people in one of the island's worst ever road accidents said Friday the driver was travelling at double the speed limit.\nThe group of local tourists had been returning from a trip to see seasonal cherry blossoms at a farm when their bus veered off a highway and flipped on its side on the outskirts of capital Taipei last month.\nOccupants, many of them elderly, were tossed out as the roof ripped off.\nIt was the latest in a series of deadly incidents in Taiwan after a bus fire last July killed 25 Chinese holidaymakers.\nIn the first official findings since the crash last month, prosecutors said the bus had hit speeds of up to 98 kilometres (61 miles) per hour as it neared a sliproad which it veered off.\nIt was travelling at 79 kph when it went off the carriageway.\nA bus left the road in eastern Taipei in February, killing 33 on board\n\"The road section is labelled with speed limits of 50 km, and 40 km at four different places,\" a statement from Shi-Lin District Prosecutors Office said.\nDashcam footage from the car travelling behind the bus was used in the investigation, they said.\nFootage shown by local media straight after the crash from a vehicle following the bus shows it turning off the main highway and flipping over, leaving behind a mangled pile of metal.\nThe prosecutors' report said the bus had passed safety inspections and there were no faults with the brakes.\nIt did not address whether the driver had been overworked, which his daughter has said was the case.\nThe driver had two outstanding traffic violations, including one for not wearing a seatbelt, but no drunk-driving record, the transport ministry said at the time.\nThere is a separate ongoing investigation into the travel agency and bus company, prosecutors said.\nAn investigation into last year's fatal bus inferno outside Taipei found the driver had intentionally set fire to it in a suicide bid before it veered into a crash barrier.\nIn February this year 21 Chinese tourists suffered injuries after their bus rammed into a railway bridge in southern Taiwan.","url":"https://www.dailymail.co.uk/wires/afp/article-4301074/Taiwan-bus-double-speed-limit-fatal-crash.html"}
