{"authors":["Frances Martel"],"date_download":"2018-10-30 20:30:49","date_modify":"2018-10-30 20:30:49","date_publish":"2016-03-29 01:45:58","description":"The latest country to arrest Chinese fishermen present illegally in their territory is Taiwan, which has announced the arrest of 41 fishermen in possession of illegal turtles and coral.","filename":"data/vaneerConsumption/TaiwanIsLatestNationtoArrestChineseFishermeninSouthChinaSea.json","image_url":"https://media.breitbart.com/media/2016/03/taiwan-coast-guard-fishing-boats-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_28__1540931449.html","title":"Taiwan Is Latest Nation to Arrest Chinese Fishermen in South China Sea","title_page":"Taiwan Is Latest Nation to Arrest Chinese Fishermen in South China Sea | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The nations in the community of the South China Sea have begun to take growing action against China’s intrusions into their waters. The latest country to arrest Chinese fishermen present illegally in their territory is Taiwan, which has announced the arrest of 41 fishermen in possession of illegal turtles and coral in their territorial waters.\nTaiwanese Coast Guard authorities arrested the fishermen near Tongsha island, which Taiwan asserts is its sovereign territory. Authorities announced they had recovered 88 pounds of toxic chemicals used to kill fish in the sea, as well as three endangered turtles and a collection of 15 tons of illegally-harvested reef material. The arrest occurred March 22, though the announcement of the arrest occurred this week. The fishermen will be prosecuted, authorities confirmed, and could face up to a year in prison.\nThe Chinese government does not recognize Taiwan as a sovereign nation, instead as a rogue state of China. As such, it has not contested Taiwan’s claims in the South China Sea, but instead asserted that any territory belonging to Taiwan also belongs to China, because all of Taiwan belongs to China. Beijing even celebrated a visit to disputed territory in the Spratly Islands by Taiwan’s outgoing president Ma Jing-Yeou as a sign that Taiwan supported China’s claims in the region.\nChina claims most of the South China Sea, including territory belonging to Taiwan, Brunei, Malaysia, Vietnam, and the Philippines. No other nations support China’s claims in the region. The Philippines has filed a case before the Permanent Court of Arbitration at The Hague, demanding the court settle the borders of China’s maritime territory once and for all. The Chinese government has asserted it will ignore any verdict the court hands down, favorable or not.\nIn addition to routine disputes with the nations contesting these claims as theft of their own sovereign territory, nations outside of the realm of China’s claims are protesting that Chinese ships are illegally navigating their waters. The government of Argentina, for example, issued a statement acknowledging it had been forced to sink a Chinese ship illegally within its borders earlier this month.\nIn a particularly contentious incident last week, the government of Indonesia arrested the crew of a Chinese ship for entering the waters near Natuna Island. When attempting to seize the ship itself, Indonesian coast guard officials reported that a Chinese Coast Guard vessel began to ram the seized ship, forcing the Indonesians to hand over the vessel or let it — and all the evidence aboard — sink. When questioned regarding the incident, Beijing’s Foreign Ministry acknowledged that Indonesia owns Natuna Island, but referred to the water surrounding it as “traditional Chinese fishing grounds.”\nA column in the Chinese state-run Global Times urges Indonesia to drop the claim because “China does not wish for disputes with several neighboring countries in the South China Sea all at the same time.” “Beijing will not escalate tensions, but it will neither make unprincipled concessions to please other nations,” it asserts. Beijing often uses its sanctioned media outlets to issue statements the Foreign Ministry, in its attempts to be diplomatic, would rather avoid stating officially.\nIndonesian authorities also recently fired at Taiwanese ships it asserted had trespassed into their territory. One ship was significantly damaged, and Taiwanese authorities are demanding answers.\nIndonesian politicians have made clear an intention to strengthen its military presence in Natuna following these incidents. A base on Natuna, the head legislator on defense in the nation asserted last week, would be “important for the defense system” of Indonesia.\nThe government of Malaysia has also issued a statement calling for China and Malaysia to resolve its territorial dispute “bilaterally.” Defence Minister Hishammuddin Hussein refused to confirm reports that up to 82 foreign ships had been caught trespassing in Malaysian waters, arguing instead for calm regarding these incidents.\nJapan, meanwhile, is working to strengthen its presence in the East China Sea, as it notes the increasingly aggressive behavior of Chinese ships in the South China Sea. Japan has no claims in the south but asserts sovereignty over the uninhabited but resource-rich Senkaku Islands in the East China Sea. China established an Air Defense Identification Zone (ADIZ) over the Senkaku Islands in 2013 that has been largely ignored following Washington’s assertion that America would be treaty-bound to enter any military dispute in which Japanese aircraft were attacked preemptively.\nJapanese officials announced Monday the re-establishment of a radar system in the East China Sea, to be used for surveillance. “Until yesterday, there was no coastal observation unit west of the main Okinawa island. It was a vacuum we needed to fill,” Daigo Shiomitsu, a Ground Self Defence Force lieutenant colonel, told Reuters. China has responded negatively, with a statement asserting it is “resolutely opposed to any provocative behavior” on Japan’s part.","url":"https://www.breitbart.com/national-security/2016/03/28/taiwan-latest-nation-to-arrest-intruding-chinese-fishermen-in-south-china-sea/"}
