{"authors":[],"date_download":"2018-10-22 20:43:47","date_modify":"2018-10-22 20:43:47","date_publish":"2016-01-29 03:20:25","description":"Taiwan sank into recession in October-December, data showed Friday, posting its slowest annual growth in six years, with weak international demand and greate...","filename":"data/vaneerConsumption/Taiwanfallsintorecessionpostsslowestgrowthin6years.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6qw-4PuZeKVXE7cd9005b2c87640045e-105_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422159_Taiwan-falls-recession-posts-slowest-growth-6-years_1540241027.html","title":"Taiwan falls into recession, posts slowest growth in 6 years","title_page":"Taiwan falls into recession, posts slowest growth in 6 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Taiwan falls into recession, posts slowest growth in 6 years\nTaiwan sank into recession in October-December, data showed Friday, posting its slowest annual growth in six years, with weak international demand and greater competition from China hitting the export-dependent island.\nThe growth rate of 0.85 percent in 2015 missed an earlier official forecast of 1.06 percent.\nThe full-year figure was dragged down by an unexpected contraction in the three months through December, the second straight quarter of declines that meets the definition of a technical recession.\nTaiwanese frustrated at the anaemic economy this month elected Tsai Ing-wen from the main opposition party as the island's new leader, setting the stage for frostier ties with the mainland ©Sam Yeh (AFP/File)\n\"Inventories of electronic products continue to be digested, affected by weak global growth,\" the Directorate General of Budget, Accounting and Statistics said in a statement.\nIt also cited the rise of technology manufacturing -- a key sector for Taiwan -- in China and declines in raw materials as factors for the struggling economy.\nTaiwan's economic woes come as China's economy last year slowed to 6.9 percent, its weakest annual rate in 25 years.\nChina is Taiwan's biggest export market, accounting for a quarter of products shipped.\nExports fell by a 10th last year, with sales to China dropping 12.3 percent from the previous year.\nThe government has been trying to spur the economy, cutting its key interest rate twice in the last two quarters and pushing a stimulus package to boost consumer spending.\nTaiwanese frustrated at the anaemic economy this month elected Tsai Ing-wen from the main opposition party as the island's new leader, setting the stage for frostier ties with the mainland.","url":"https://www.dailymail.co.uk/wires/afp/article-3422159/Taiwan-falls-recession-posts-slowest-growth-6-years.html"}
