{"authors":["Associated Press"],"date_download":"2018-10-22 21:24:15","date_modify":"2018-10-22 21:24:15","date_publish":"2016-01-28 07:38:30","description":"TAIPEI, Taiwan (AP) — Taiwan's president, defying a rare dose of criticism from key ally the United States, visited an island in the disputed South China Sea...","filename":"data/vaneerConsumption/TaiwanpresidentvisitsislandindisputedSouthChinaSea.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:f614561b6644429bb82abd2015c7eaf2-4vVdYopwYQ7f641721b07aa54c65-547_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420319_Taiwan-president-visits-island-disputed-South-China-Sea_1540243455.html","title":"Taiwan president visits island in disputed South China Sea","title_page":"Taiwan president visits island in disputed South China Sea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Taiwan president visits island in disputed South China Sea\nTAIPEI, Taiwan (AP) — Taiwan's president, defying a rare dose of criticism from key ally the United States, visited an island in the disputed South China Sea on Thursday and called for peaceful development in the increasingly tense region.\nAccompanied by about 30 staff members, Ma Ying-jeou (MAH YEENG JOH) left the capital Taipei early in the morning aboard an air force C-130 cargo plane bound for Taiping Island, also known as Itu Aba.\nTaiping lies in the Spratly island group, an area where Taiwan shares overlapping claims with China, Vietnam, Malaysia and the Philippines. The city state of Brunei also claims a part of the South China Sea.\nFILE - In this Nov. 7, 2015 file photo, Taiwanese President Ma Ying-jeou speaks during a press conference at the Shangri-la Hotel in Singapore. Taiwan's president, defying criticism from key ally the United States, visited to an island holding in the disputed South China Sea on Thursday, Jan. 28, 2016 and called for peaceful development in the increasingly tense region. (AP Photo/Chiang Ying-ying, File)\nAfter arriving, Ma spoke at a national monument on the islet and reiterated his call made last year for peaceful coexistence and joint development. He cited infrastructure developments on the islet, including a 10-bed hospital and a lighthouse, saying they reinforced Taiwan's claim of sovereignty and granted it rights over the surrounding waters.\nTaiwan is spending more than $100 million to upgrade the island's airstrip and build a wharf capable of allowing its 3,000-ton coast guard cutters to dock.\n\"All this evidence fully demonstrates that Taiping Island is able to sustain human habitation and an economic life of its own. Taiping Island is categorically not a rock, but an island,\" Ma said.\nRoughly 2,000 kilometers (1,200 miles) south of Taiwan and 46 hectares (110 acres) in size, Taiping is the largest naturally occurring island in the area.\nIt has recently been eclipsed in size, however, by man-made islands created by China out of reefs and shoals. China has built housing, ports, airstrips and other infrastructure on the newly created islands, drawing accusations from the U.S. and others that it is exacerbating tensions in the strategically vital region.\nTaiwan stations about 200 coast guard personnel, scientists and medical workers on Taiping. It occupies a number of other islets in the South China Sea, including the Pratas island group to the north.\nThere was no immediate response to Ma's visit from China, although a spokesman for the Cabinet's Taiwan Affairs Office on Wednesday repeated Beijing's claim to \"indisputable sovereignty\" over the South China Sea islands.\n\"Safeguarding national sovereignty and territorial integrity and the overall interests of the Chinese nation are the common responsibility and obligation of compatriots on both sides\" of the Taiwan Strait, Ma Xiaoguang said at a biweekly news briefing.\nThe Philippines, which occupies a string of islands and reefs near the island Ma will visit, expressed its concern over the trip.\n\"We remind all parties concerned of our shared responsibility to refrain from actions that can increase tension in the South China Sea,\" Department of Foreign Affairs spokesman Charles Jose said in Manila.\nComing near the end of his eight years in office, Ma's visit is the second by a Taiwanese leader and aims to emphasize Taiwan's sovereignty claims in the South China Sea. Former president Chen Shui-bian visited in 2008 when he delivered a similar message.\nMa, who has been criticized at home as weak on foreign policy, must step down in May due to term limits and analysts said he considers the island visit a capstone to his time in office. Opposition party president-elect Tsai Ing-wen declined an invitation to go on the trip.\n\"President Ma...views advancing (Taiwan's) maritime interests as part of his legacy,\" said Bonnie Glaser, senior adviser for Asia at the Center for Strategic and International Studies, a think tank in Washington. \"His visit to Taiping will further incite nationalistic fervor in the claimant countries and increase tensions.\"\nU.S. State Department spokesman Mark Toner said Wednesday that the United States was disappointed by Ma's trip, saying it could exacerbate tensions, and renewed a call for dialogue between parties to the dispute.\n\"President Ma Ying-jeou has every right to make his position clear on the South China Sea. We just disagree with this particular action. We view it as, frankly, as raising tensions rather than what we want to see, which is de-escalation,\" Toner said.\nDuring a visit to Beijing on Wednesday, U.S. Secretary of State John Kerry encouraged all parties in the South China Sea to clarify their territorial claims, exercise restraint and engage in negotiations on the basis of international law.\nThe U.S. takes no position on who owns the islands, but says developments in the South China Sea are a matter of national security. The sea is home to key shipping lanes as well as important fisheries and a possible wealth of oil and natural gas reserves.\nTensions have been especially high since Beijing transformed seven disputed reefs into islands. The U.S. says the new islands don't enjoy the status of sovereign territory and sent a guided-missile destroyer close to one of them, called Subi Reef, in October in a challenge to Beijing's territorial claims, sparking warnings from China.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420319/Taiwan-president-visits-island-disputed-South-China-Sea.html"}
