{"authors":["Associated Press"],"date_download":"2018-10-22 23:59:35","date_modify":"2018-10-22 23:59:35","date_publish":"2017-03-16 08:39:41","description":"TAIPEI, Taiwan (AP) - Taiwan is planning to upgrade its F-16 fighter jets and will seek cutting-edge stealth aircraft from the United States in the face of a...","filename":"data/vaneerConsumption/Taiwanmilitarytoupgradefightersseekstealthcapability.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319286_Taiwan-military-upgrade-fighters-seek-stealth-capability_1540252775.html","title":"Taiwan military to upgrade fighters, seek stealth capability","title_page":"Taiwan military to upgrade fighters, seek stealth capability | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TAIPEI, Taiwan (AP) - Taiwan is planning to upgrade its F-16 fighter jets and will seek cutting-edge stealth aircraft from the United States in the face of a growing military threat from rival China, the Defense Ministry said Thursday.\nThe announcement follows the release of this year's $11.4 billion defense budget, an increase of less than 1 percent from last year, reflecting strains on the government's finances resulting from a heavy entitlements burden and slowing growth in the high-tech, export-oriented economy.\nThat compares to China's 7 percent rise in defense spending, announced this week, bringing its defense budget to about $151 billion, the world's second largest after the United States.\nIn response, Defense Minister Feng Shih-kuan told lawmakers that Taiwan is focusing on inexpensive but effective \"asymmetric warfare\" techniques to combat threats in the air and seas.\nFeng said the budget amounted to 2.05 percent of Taiwan's economy but that he hoped it would increase to nearly 3 percent next year.\nTaiwan's forces are also capable of striking Chinese bases across the 160-kilometer (100-mile) -wide Taiwan Strait, operations planning chief Lt. Gen. Chiang Chen-chung said at the hearing. Asked if that strike ability extended to bases charged with operations against Taiwan as far as 1,300 kilometers (810 miles) away, Chiang said yes.\nChina considers the self-governing island to be its own territory, to be brought under its control by force if necessary. China has threatened to attack if Taiwan declares formal independence or if it considers peaceful unification no longer achievable. The sides split during a civil war in 1949.\nIn a quadrennial defense review mapping out challenges and strategies for coming years, the Defense Ministry said Taiwan faces an increased threat from the air, sea and by missiles, thousands of which China has targeted at the island. It said China's immediate goals in a conflict would be to blockade Taiwan, use \"diverse military means\" to attack, and take control of outlying island groups.\nThe report also warned of the threat of cyberwarfare, saying China has the means to attack both military and civilian networks on the island.\nWithout giving details, the report said Taiwan would also seek fighters able to take off vertically, more surface-to-air missiles and a revitalized navy deploying domestically made submarines and fast attack craft.\nPresident Tsai Ing-wen's government has renewed efforts to develop the domestic arms industry in response to difficulties in procuring weapons abroad because of Chinese diplomatic and economic pressure.","url":"https://www.dailymail.co.uk/wires/ap/article-4319286/Taiwan-military-upgrade-fighters-seek-stealth-capability.html"}
