{"authors":[],"date_download":"2018-10-23 01:31:58","date_modify":"2018-10-23 01:31:58","date_publish":"2017-03-16 11:38:15","description":"Taiwan said for the first time publicly that it is capable of launching missiles at China, as the government on Thursday unveiled a major defence report...","filename":"data/vaneerConsumption/TaiwansayscapableofstrikeagainstChina.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-228055-1489664296-838_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319780_Taiwan-says-capable-strike-against-China_1540258318.html","title":"Taiwan says capable of strike against China","title_page":"Taiwan says capable of strike against China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Taiwanese fighter jets take part in an annual drill in Tainan\nTaiwan said for the first time publicly that it is capable of launching missiles at China, as the government on Thursday unveiled a major defence report warning of increased risk of Chinese invasion.\nChina still sees Taiwan as part of its territory to be brought back into its fold, by force if necessary, even though the island has been self-governing since the two sides split after a civil war in 1949.\nTies have worsened since Beijing-sceptic President Tsai Ing-wen took power last year, ending an eight-year rapprochement.\nDelivering the four-yearly report to parliament, defence minister Feng Shih-kuan replied \"yes\" when asked by a lawmaker whether Taiwan was capable of firing at mainland China.\n\"It is the first time the ministry has confirmed this,\" lawmaker Wang Ting-yu told AFP, saying Taiwanese missiles may be able to travel more than 1,500 kilometres.\nThe ministry has said in the past that it has produced cruise missiles, but has never publicly stated their capabilities.\nThe report also pledged to create an enhanced military front that would protect Taiwan.\n\"Should the enemy insist on invading, we will weaken their capabilities by striking enemy troops at their home bases, fighting them at sea, crushing them as they approach the coastlines and wiping them out on the beaches,\" it said.\nChina has more than 1,500 missiles aimed at Taiwan, according to the defence ministry.\nThe island's military, which consists of around 200,000 troops, is a fraction of China's 2.3 million-strong army.\nDefence minister Feng said he hoped to raise spending to three percent of GDP in 2018, up from two percent this year and the highest proportion of Taiwan's budget dedicated to the military for 10 years.\nSince Tsai came to power, Beijing has severed all official communications with Taipei and upped its military drills near the island following a protocol-smashing telephone call between Tsai and Donald Trump.\nThe United States is Taiwan's most powerful ally and its main arms supplier, even though the two sides do not have official diplomatic ties after Washington switched recognition to Beijing in 1979.\nThursday's report came as Taiwan was also hit by the latest in a string of espionage cases involving China.\nLocal media said a former bodyguard of former vice president Annette Lu had been arrested for allegedly spying for China and trying to recruit military officials to join him.\nNational Security Bureau director-general Peng Sheng-chu said in parliament earlier this month that Chinese espionage is \"more serious than before\" as some reports claimed that up to 5,000 people may be spying for China on the island.","url":"https://www.dailymail.co.uk/wires/afp/article-4319780/Taiwan-says-capable-strike-against-China.html"}
