{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 02:30:12","date_modify":"2018-10-23 02:30:12","date_publish":"2016-01-11 14:42:34","description":"A young female gymnast had a lucky escape after falling 35ft to the ground while performing a high-wire act at a circus in Tajikistan - and surviving without any major injuries.","filename":"data/vaneerConsumption/Tajikistancircusgymnastissentplummetingtogroundduringact.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B1F6C00000578-0-image-a-32_1452523241303.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394027_Tajikistan-circus-gymnast-falls-35ft-high-wire-act_1540261812.html","title":"Tajikistan circus gymnast is sent plummeting to ground during act","title_page":"Tajikistan circus gymnast is sent plummeting to ground during act | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the shocking moment a young circus gymnast plummeted to the ground during a high-wire act - but survived with only minor injuries.\nWhen the crowds at the circus dome in Tajikistan's capital Dushanbe witnessed the accident, they were certain she must have been killed - or at the very least seriously injured.\nThe unidentified victim was balancing herself on the legs of a man on a high wire when something caused her to lose poise and topple 35ft to the ground below.\nThe gymnasts go higher and higher until the woman lets go of the wire and loses her grip on her male partner\nShe then spirals through the air as she plummets 35ft down to the ground while the audience screams\nThe house lights come up immediately as her partner and other circus workers rush to her aid\nOne audience member said: 'It was horrifying. A collective gasp went up in the crowd followed by a long silence.\n'Several circus people ran into the arena to her side to see how badly injured she really was. I for one thought she would not be getting up again.'\nBut the young woman's luck was in as she survived with barely a scratch upon her.\nThere was huge applause from the crowd as she gave a bow and left the arena for a thorough medical check-up.\nMiraculously she escaped relatively unharmed from the fall, sustaining only minor injuries\nShe was eventually able to stand and even bowed to the crowd as they gave her a round of applause\nRussian news site Lifenews reported that an X-Ray carried out hours after the accident showed she had no broken bones whatsoever - a miracle as falls of anything over 20 feet can be fatal.\n'One can tell from the video the girl fell from the height of around 33 feet', said Vassily Bogan, a member of the audience.\n'I work on a building site and have seen guys mutilated and even killed after falling from scaffolding at that height.\n'Perhaps the suppleness of her body as a performer in some way protected her. I am just so happy for her.'","url":"https://www.dailymail.co.uk/news/article-3394027/Tajikistan-circus-gymnast-falls-35ft-high-wire-act.html"}
