{"authors":["John Hayward"],"date_download":"2018-10-30 18:41:46","date_modify":"2018-10-30 18:41:46","date_publish":"2015-05-11 03:20:33","description":"Tajikistan's anti-Islam campaign has the government cracking down on beards and hijabs, the traditional female garment in Muslim culture.","filename":"data/vaneerConsumption/TajikistanConsidersBanningArabicNamestoHoldIslamatBay.json","image_url":"https://media.breitbart.com/media/2015/01/Muslim-Students-UK.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_10__1540924906.html","title":"Tajikistan Considers Banning Arabic Names to Hold Islam at Bay","title_page":"Tajikistan Considers Banning Arabic Names to Hold Islam at Bay | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tajikistan’s curious anti-Islam campaign has already seen the government cracking down on beards and hijabs, the traditional female garment in Muslim culture. They have also asked imams to include praise for the secular government in their sermons and applied travel restrictions to Muslim citizens seeking to make the hajj pilgrimage to Mecca. The beard ban has reportedly been taken as far as the forcible shaving of illegally luxurious facial hair by security forces.\nNow Tajikistan is thinking about taking things up another notch by refusing to register baby names that sound Arabic. According to the UK Guardian, they might go even further and demand adults with Arabic names adopt Tajik-sounding names instead.\nWhat makes this anti-Islam campaign particularly strange is that Islam is not an invading cultural force, expanding from a small beachhead to displace traditional Tajik culture. Fully 98 percent of the country is said to be Muslim. If the hardest of hard-line parliamentarians gets their way, and adults are forced to drop Arabic-sounding names, it is likely that Tajikistan’s president would be affected—his name is “Emomali,” which the Guardian notes is derived from “Imam Ali,” the name of Mohammed’s son-in-law, considered the first Shiite imam.\nThe no-Arabic-names law was actually President Emomali Rahmon’s idea, according to the Guardian. If it passes, a Justice Ministry official explained, “the registry offices will not register names that are incorrect or alien to the local culture, including names denoting objects, flora and fauna, as well as names of Arabic origin.”\n“The growing popularity of names associated with Islam, such as Aisha, Asiya and Sumayah, as well as the addition of traditionally Islamic suffixes at the ends of names, including -khalifa and -amir, have left authorities in the Muslim-majority country uneasy,” reports International Business Times.\nAmong the sources of their apprehension is a Tajik Islamic State recruiting video encouraging jihad against the secular government. Russia has promised the former Soviet republic over a billion dollars in military aid to combat the spread of ISIS. Impoverished rural villages are said to be fertile recruiting ground for Islamist extremists.\n“Despite its sweeping crackdown on Muslim religious expression in the country, the Tajik state has denied targeting Islam, pointing to its plans to build the biggest mosque in Central Asia, which is designed to hold as many as 100,000 worshippers,” IBT notes.\nThey are shaving off beards, banning the hijab, blocking travel to Mecca, and even considering a ban on Arabic names… but they claim they’re not “targeting Islam?” Tajikistan is a former Soviet satellite, all right.","url":"https://www.breitbart.com/national-security/2015/05/10/tajikistan-considers-banning-arabic-names-to-hold-islam-at-bay/"}
