{"authors":["Chris Talgo"],"date_download":"2018-10-30 22:08:36","date_modify":"2018-10-30 22:08:36","date_publish":"2018-08-24 02:05:09","description":"A recent Gallup poll found 57 percent of Democrats view socialism positively, as opposed to only 16 percent of Republicans.","filename":"data/vaneerConsumption/TalgoIronyAlertProgressiveDemocratsEmbraceObsoleteSocialism.json","image_url":"https://media.breitbart.com/media/2018/08/French-workers-striking-in-1995-carry-a-banner-of-Marx.-Photo-Steve-EasonHulton-Archive-via-Getty-Images-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_23__1540937316.html","title":"Talgo: Irony Alert! ‘Progressive’ Democrats Embrace Obsolete Socialism","title_page":"Talgo: Irony Alert! ‘Progressive’ Democrats Embrace Obsolete Socialism","title_rss":"NULL","source_domain":"breitbart.com","text":"Karl Marx’s brand of socialism, an unequivocal disaster that has produced mass poverty, tyranny, and untold deaths, is mounting a comeback among so-called “liberal progressive” Democrats. A recent Gallup poll found 57 percent of Democrats view socialism positively, as opposed to only 16 percent of Republicans.\nPerhaps these liberals are confused about the definition of socialism. According to Merriam-Webster, socialism is a political-economic ideology that advocates for the “collective or governmental ownership and administration of the means of production and distribution of goods.” In plain English: Under socialism, the government runs the economy, liberty yields, and prosperity plummets.\nApparently, progressives didn’t pay much attention in history class, because the historical record is chock-full of the horrors of socialism. According to The Black Book of Communism, a world-renowned bestseller, socialism’s death toll is grim: 25 million in the former Soviet Union, 65 million in China, and 1.7 million in the Cambodian Killing Fields.\nMaybe these socialism-loving Democrats slept through history class, but do they follow the news? If so, they ought to be aware of the catastrophic situation in socialist Venezuela. For instance, the International Monetary Fund (IMF) recently stated, “The situation in Venezuela is similar to that in Germany in 1923 or Zimbabwe in the late 2000s.”\nThe IMF expects Venezuela’s inflation to reach one million percent by the end of the year! Basic necessities like medicine, flour, and toilet paper are no longer available in this modern-day socialist nightmare state. Furthermore, Venezuelans have lost an average of 24 pounds in 2018, and it’s not because of a nationwide diet initiative, either!\nBeyond the mind-numbing death tallies and dire destitution, what else lies in store under a socialistic regime? How about substantial reductions in personal freedom and income? According to the Freedom House’s Freedom in 2018 report, North Korea scored an abysmal three points out of 100 in world freedom. Even worse, the GDP per capita in the Hermit Kingdom is an incomprehensible $1,800. By comparison, the United States scored 86 in world freedom and the GDP per capita is $56,469.\nInevitably, the question arises: Why is socialism, which used to be universally despised in the United States, gaining popularity? For starters, Millennials (the largest generation in American history) seem quite susceptible to the siren call of socialism. Consider this frightening finding from a 2017 poll: “More Millennials would prefer to live in a socialist country (44%) than in a capitalist one (42%), or even a communist country (7%).” Yikes!\nMarion Smith, executive director of the Victims of Communism Memorial Foundation, put it bluntly: “The largest generation in America would prefer to live under socialism or communism than under a free-market system that respects the rule of law, private property, and limited state intervention.”\nGee, where could these crazy kids have possibly come up with the insane idea that living under socialism is good? Well, “Karl Marx is the most assigned economist in U.S. college classes,” a MarketWatchstudy found. Furthermore, K–12 education is more collectivist-oriented than ever. From Common Core to the cooperative learning craze to the social justice-dominated curriculum, American students are inundated with socialistic philosophy from the moment they enter the public education system.\nAlthough Millennials are in rapture with the revisionist version of socialism they are taught in classrooms, this isn’t a new phenomenon. During the depths of the Great Depression, many Americans advocated for an economic transformation akin to the socialistic revolution in the Soviet Union that had taken place just years before. This Red Scare eventually abated as prosperity returned to the United States, courtesy of capitalism.\nThe Great Recession had a similarly devastating impact on Americans, and many Millennials are still recovering from the economic havoc resulting from the 2008 financial crisis. However, if past performance is a barometer for the future, then the long-overdue economic recovery now being ushered in by President Donald Trump’s tax cuts, regulatory rollbacks, and other free-market policies ought to convince many Millennials that capitalism always trumps socialism.\nAnd if for some reason Millennials refuse to embrace capitalism in favor of socialism, they will eventually discover Margaret Thatcher was correct when she stated, “The problem with socialism is that you eventually run out of other people’s money.” Let’s just hope the largest generation in American history heeds this valuable lesson before it’s too late.\nChris Talgo (ctalgo@heartland.org) is an editor at The Heartland Institute.","url":"https://www.breitbart.com/politics/2018/08/23/talgo-irony-alert-progressive-democrats-embrace-obsolete-socialism/"}
