{"authors":[],"date_download":"2018-10-22 22:10:35","date_modify":"2018-10-22 22:10:35","date_publish":"2014-06-09 07:55:13","description":"Gun battles between militants dressed as security officers and Pakistani forces went on for five hours at Karachi's international airport.","filename":"data/vaneerConsumption/TalibanAttackonKarachiAirportLeavesatleast23Dead.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/495766/140609-karachi-airport-cover-3a_57ab06016af0afa8be9bdfda7d15d1ba.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_taliban-attack-karachi-airport-leaves-least-23-dead-n125991_1540246235.html","title":"Taliban Attack on Karachi Airport Leaves at least 23 Dead","title_page":"Taliban Attack on Karachi Airport Leaves at least 23 Dead","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nISLAMABAD, Pakistan - Militants brandishing machine guns and a rocket launchers stormed Pakistan's busiest airport on Sunday night, setting off an all-night battle with security forces that left at least 23 people dead.\nPakistan's Taliban claimed responsibility for the attack, which saw militants dressed as security officers battling Pakistani forces for at least five hours. Television images of the scene showed raging fires at Jinnah International Airport in Karachi, a teeming city of some 18 million. Loud explosions could be heard as militants blew up their suicide vests, according to Reuters.\nOfficials said all passengers had been evacuated from the airport as militants and Pakistani forces battled for control of two areas, one of which is used for VIP flights and cargo. Fires lit up the sky with an orange glow as the silhouettes of jets could be seen.\nOfficials denied multiple reports that gunfire had broken out again at daybreak.\n\"There is a rumor about a fire fight resuming. No attack, I repeat no attack is happening. The troops are clearing the extended area,\" Maj. Gen. Rizwan Akhtar, who was in charge of the paramilitary Rangers forces leading the fighting at the airport, told NBC News. \"We are looking for any booby traps that may have been left.\"\nEarlier, military spokesman Gen. Asim Bajwal said that the airport would be cleared by midday, Karachi time (3 a.m. ET).\nThe Associated Press put the death toll at 23, including the ten attackers. Reuters said 27 had been killed. There was no explanation for the different counts.\n\"Ten militants aged between 20 and 25 have been killed by security forces,\" a spokesman for the paramilitary Rangers force told Reuters.","url":"https://www.nbcnews.com/news/world/taliban-attack-karachi-airport-leaves-least-23-dead-n125991"}
