{"authors":[],"date_download":"2018-10-22 21:35:27","date_modify":"2018-10-22 21:35:27","date_publish":"2014-06-05 19:31:52","description":"“Our people at the time couldn’t understand his language, but it was after he was shifted to a safe location, he said he wasn’t happy with his countrymen,” one of the commanders said.","filename":"data/vaneerConsumption/TalibanCommandersSayTheyFoundBergdahlCursingHisCountrymen.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/481626/140602-bowe-bergdahl-smokes-foxhole-jsw-1131a_bf2c1b5084b5dc70987dbde25274cdc8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_taliban-commanders-say-they-found-bergdahl-cursing-his-countrymen-n123846_1540244127.html","title":"Taliban Commanders Say They Found Bergdahl Cursing His Countrymen","title_page":"Taliban Commanders Say They Found Bergdahl Cursing His Countrymen","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Taliban found Pfc. Bowe Bergdahl walking alone, acting abnormally and cursing his countrymen before they captured him in Afghanistan in 2009, two men who were Taliban commanders at the time told NBC News on Thursday.\nThey said that Afghan locals first informed fighters about the soldier, and then the fighters rushed to capture him.\n“Our people at the time couldn’t understand his language, but it was after he was shifted to a safe location, he said he wasn’t happy with his countrymen, but he didn’t intend to convert to Islam or join mujahideen (holy warriors),” one of the commanders said.\nThe commanders said that Taliban officers first thought it was a trick — perhaps an American soldier sent out alone to spy on the enemy.\n“As we never saw their soldier patrolling alone … we would ask him how he managed to walk out of his base,” one of the commanders said. “He would tell us that it was personal issue.”\nThe descriptions filled in some of the details about the capture of Bergdahl, who was held by the Taliban for five years before he was released to U.S. forces. In exchange, five Taliban operatives were freed from the American prison at Guantanamo Bay, Cuba.\nOne of the two commanders quit the Taliban fighting U.S. forces in 2010. He joined another faction that is working to find a negotiated political solution to the Afghan conflict. He is now living in the United Arab Emirates.\nThe second of the two commanders is based in Helmand province in Afghanistan.\nThe commander who left in 2010 said that, at least through that time, Bergdahl did not convert to Islam.\n“Think he had deserted his army with a mission and wanted to accept Islam, but our people didn’t trust him. That shattered his belief,” he said.\nIn the initial hours after Bergdahl was reported missing, on June 30, 2009, the United States mounted a furious search operation to find him. It included armed drones, teams of dogs, raids on suspected enemy hideouts and F-15 fighter jets for air cover.\nThe Taliban officials would not say where they took Bergdahl immediately after the capture, only that it was a safe location.\nLater, according to Taliban sources, he was taken to the South Waziristan region of Pakistan. Later he was shifted to the forested, mountainous area of Shawal Valley, also in Pakistan.\nBergdahl was returned to American forces over the weekend and is recovering at an American military hospital in Germany. He was promoted twice in captivity and holds the rank of sergeant.\nThe trade for the five Taliban at Guantanamo has drawn outrage, primarily from Republicans. Former members of Bergdahl’s platoon have described him as a deserter who walked away from his outpost.\nIn addition, members of Congress have faulted the Obama administration — even suggesting that it broke the law — for failing to notify Congress before it executed the trade.\nThe administration has argued that it had to move quickly because Bergdahl’s health was deteriorating quickly.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/taliban-commanders-say-they-found-bergdahl-cursing-his-countrymen-n123846"}
