{"authors":[],"date_download":"2018-10-22 22:42:59","date_modify":"2018-10-22 22:42:59","date_publish":"2014-05-12 15:57:04","description":"This year's Taliban spring offensive comes at a pivotal time as U.S. troops thin out and a presidential election is underway.","filename":"data/vaneerConsumption/TalibanLaunchesSpringOffensiveAttacksAsPromised.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/436456/140512-afghanistan-taliban-attack-1145a_85e6a0e9aaf42729f8c7f6dabcc4af55.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_taliban-launches-spring-offensive-attacks-promised-n103216_1540248179.html","title":"Taliban Launches Spring Offensive Attacks, As Promised","title_page":"Taliban Launches Spring Offensive Attacks, As Promised","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Taliban made good on their promise to unleash an annual spring offensive Monday, storming a government building in the east and striking a police checkpoint to the south, killing nine policemen.\nLast week, the Taliban brashly scheduled their assault, vowing \"backbreaking martyrdom strikes\" and insider attacks.\nRockets hit inside the grounds of the Kabul international airport but caused no damage. Rockets also struck the NATO base at Bagram, just north of the Afghan capital, causing minor damage, the alliance said.\nThis year's Taliban spring offensive comes at a sensitive time, against the backdrop of a key presidential election.\nFewer than 30,000 U.S. troops remain on the ground in Afghanistan, the lowest number since the 2001 invasion. Last summer, Afghan security forces took full responsibility for the country's defense, making this Taliban spring offensive an important gauge of how well they will face insurgent attacks once international forces are gone.\nMonday's attack on the provincial justice ministry building in the city of Jalalabad began around 9 a.m., just as employees were arriving for work, said Nangarhar provincial government spokesman Ahmad Zia Abdulzai.\nAccording to the spokesman and the provincial police chief, three attackers shot and killed the two police guards, broke into the ministry and took over the building.\nSecurity forces retook the building after a shootout with the Taliban, four and a half hours later. Inside, five civilians were found dead and seven others were wounded, said Gen. Fazel Ahmad Sherzad, Nangarhar's police chief.\n— The Associated Press","url":"https://www.nbcnews.com/news/world/taliban-launches-spring-offensive-attacks-promised-n103216"}
