{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 19:02:01","date_modify":"2018-10-30 19:02:01","date_publish":"2015-03-15 13:35:48","description":"A Pakistani branch of the Taliban has claimed responsibility for bombings outside two churches in Lahore Sunday morning. According to local media, the blasts killed 14 people and wounded more than 70. |","filename":"data/vaneerConsumption/TalibanBombsTwoChristianChurchesinPakistanDuringSundayServicesKillingFourteen.json","image_url":"https://media.breitbart.com/media/2015/03/AP983632395371.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_15__1540926121.html","title":"Taliban Bombs Two Christian Churches in Pakistan During Sunday Services, Killing Fourteen","title_page":"Taliban Bombs Two Christian Churches in Pakistan During Sunday Services, Killing Fourteen | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Pakistani branch of the Taliban has claimed responsibility for bombings outside two churches in Lahore Sunday morning. According to local media, the blasts killed 14 people and wounded more than 70.\nEarlier reports from Khawaja Rafiq, the health adviser to the provincial chief minister, had placed the death toll at 10 people, but the figure has since been raised as more bodies have been discovered. “The rescue operation is still underway and the death toll may increase,” rescue services spokesman Sajjad Hussain said.\nThe bombers coordinated their attacks so that the explosives were detonated just minutes apart. The terrorists targeted two churches, one Protestant and the other Catholic, in a majority Christian suburb of Lahore.\nEhsanullah Ehsan, spokesman for the Taliban faction Jamaat-al-Ahrar, said in a message that suicide bombers from the “Aafia Siddiqui Brigade” were responsible for the bombings. Siddiqui is a Pakistani scientist who is serving an 86-year prison term in the Unites States on charges of terrorism.\n“We have carried out the attack… We have reached Lahore, the center of Punjab province, which is a challenge and a warning to the rulers,” Ehsan said.\nLarge crowds were already present in the area to attend Sunday services, and after the explosions they broke into spontaneous protest.\nAccording to a police official, after the bombs went off a mob of local residents lynched two men they suspected of involvement. The mob beat them to death and then set fire to their bodies, according to Pakistani TV news channels.\n“I was sitting at a shop near the church when a blast jolted the area. I rushed towards the spot and saw the security guard scuffle with a man who was trying to enter the church, after failing, he blew himself up,” said witness Amir Masih. “I saw his body parts flying through the air.”\nThe guard died as well, Masih said.\nMany Christians and other minorities accuse the government for doing little to protect them. After Sunday’s attacks sparked violent protests, the Punjab government appealed for calm, saying that destroying state and private property is not a solution to any problem.\nA government spokesman, Zaeem Qadri, said that his government would control the mob through negotiations.\nMuch of the country is on edge after years of militant violence against Pakistan’s Christian community. Pakistan is overwhelmingly Muslim, with Christians making up less than 2% of the population.\nIn September 2013, two explosions at the All Saint’s Church in Peshawar killed 127 people and injured more than 250, and an attack on a Peshawar school in December 2014 killed 150 people, mostly students.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2015/03/15/taliban-bombs-two-christian-churches-in-pakistan-during-sunday-services-killing-fourteen-2/"}
