{"authors":[],"date_download":"2018-10-22 20:24:12","date_modify":"2018-10-22 20:24:12","date_publish":"2014-06-01 00:29:04","description":"The fighters who held a U.S. Army sergeant captive for five years and used him for propaganda videos claim prisoner left with 'good memories'","filename":"data/vaneerConsumption/TalibanSpinWeTreatedCaptiveasGuest.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/479411/140531-bowe-bergdahl-mn-1350_3acc93b89b544e51781d7af92bddd3ca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_taliban-spin-we-treated-captive-guest-n119461_1540239852.html","title":"Taliban Spin: We Treated Captive as 'Guest'","title_page":"Taliban Spin: We Treated Captive as 'Guest' ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Pleading anonymity, he said talks for a prisoners' swap had been going on for several weeks.\nHe said a Muslim country that has sympathies with the Taliban played an important role in bringing together the Taliban and U.S. officials to broker the prisoner exchange. He did not name the country involved, but U.S. officials and the Taliban confirmed that Qatar helped with the talks.\n\"It is war in which they kill us and we kill them, but we did whatever we could to make him happy and return with good memories\nThe Taliban commander said Bergdahl had mostly been held in the tribal areas between Pakistan and Afghanistan after his kidnapping from Afghanistan’s Paktika province in June 2009.\nAfter Bergdahl’s release deal was finalized, he was taken to Ali Sher town in Afghanistan's eastern Khost province by a third party, and then delivered to the American forces.\n“We don't know further what happened to him,\" the Taliban commander said.\nMeanwhile, an official statement from the Taliban, which calls itself the Islamic Emirate of Afghanistan, focused on the \"leaders\" it said were being released in exchange for Bergdahl.\n\"They were released as a result of indirect talks between the Islamic Emirate and the US which has been going for some time with the mediation of Qatari government,\" according to the statement translated into English by NBC News. \"They will live normal lives in Qatar with their families.\"\nTraditional turban\nThe Taliban commander who spoke to NBC News directly said Bergdahl was given a traditional Afghan turban as a parting gift before his release.\n\"It is war in which they kill us and we kill them, but we did whatever we could to make him happy and return with good memories,\" he said.\nBut in videos released by the Taliban that have been criticized as propaganda, Bergdahl pleaded to go home.\nIn a 2009 video after his capture, Bergdahl said he was “scared,” and in later videos he is seen gaunt and blindfolded.\nIn a 2010 video he pleads, “Let me go … I’m a prisoner. I want to go home. Every day I want to go home. The pain in my heart to see my family again doesn’t get any smaller.”\nThe Department of Defense declined to comment on the Taliban’s claims, saying it is focused on getting Bergdahl healthy and back in the U.S. before getting into the details of his imprisonment.\n“Right now first priority is his medical care; we’re going to proceed at a pace he’s comfortable with.”\n— Phil Helsel contributed to this report","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/taliban-spin-we-treated-captive-guest-n119461"}
