{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-22 20:34:31","date_modify":"2018-10-22 20:34:31","date_publish":"2016-01-28 01:52:08","description":"She's fresh from a sun-soaked winter break in Barbados, where she rubbed shoulders with the rich and famous.","filename":"data/vaneerConsumption/TalliaStormdisplaysflatstomachincroptopandsilvertrousers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A622D100000578-0-image-a-4_1453945290138.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420278_Tallia-Storm-displays-flat-stomach-crop-silver-trousers_1540240471.html","title":"Tallia Storm displays flat stomach in crop top and silver trousers","title_page":"Tallia Storm displays flat stomach in crop top and silver trousers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's fresh from a sun-soaked winter break in Barbados, where she rubbed shoulders with the rich and famous.\nAnd Tallia Storm was spotted enjoying a catch up with her gal pals on Thursday night as she attended the launch of UKAI restaurant in London.\nThe 17-year-old Scottish singer, who recently swapped her trademark voluminous quiff for relaxed curls, was dressed in a rock chic ensemble for her evening on the town.\nScroll down for video\nRock chic: Tallia Storm looked effortlessly cool in a pair of snakeskin print trousers and a leather jacket as she attended the launch of UKAI restaurant in London on Wednesday\nTallia wore a black crop top teamed with statement snakeskin print silver trousers.\nShe gave the look an edge thanks to a leather jacket and a shoulder bag with a silver chain strap.\nThe rising starlet dressed the look down with a pair of flat trainers and opted for natural make-up, wearing her blonde hair in loose waves.\nEdgy accessories: The Scottish starlet added a pair of patent black trainers and a leather shoulder bag\n'Having the most amazing time at @Ukai_sushi launch this evening Food of dreams!!!', she enthused while tucking into a selection of the Japanese food on offer.\nDespite her tender years, Tallia rose to fame when she was just 13 and had a chance encounter with Elton John's partner David Furnish while on holiday with her family.\nThe producer was staying at the same hotel and Tallia plucked up the courage to hand him her demo CD in the hope he and the famous singer would listen to it.\n'Food of dreams!': Tallia revealed on social media she was having a great time at the restaurant launch party\n'He was absolutely charming and so nice,' she previously recalled. 'He asked where I was from and what kind of music I liked. That was it.\nTallia was about to fly back to UK from San Francisco when she picked up the phone to Elton, who was so impressed with her recordings he invited her to open his show.\nShe spent six months rehearsing and then took to the stage at the beginning of one of his concerts for a lengthy five-song 25 minute slot.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420278/Tallia-Storm-displays-flat-stomach-crop-silver-trousers.html"}
