{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:18:21","date_modify":"2018-10-22 23:18:21","date_publish":"2017-04-26 07:06:10","description":"It appears that bridges might have been left unmended with couple Tallena and Brad nowhere to be seen at a cast reunion party attended by Jackie and Tim.","filename":"data/vaneerConsumption/TallenaandBradabsentfromSevenYearSwitchrenunion.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C9D8000000578-0-image-a-57_1493185566804.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446374_Tallena-Brad-absent-Seven-Year-Switch-renunion_1540250301.html","title":"Tallena and Brad absent from Seven Year Switch renunion","title_page":"Tallena and Brad absent from Seven Year Switch renunion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They came to blows over a tiny tattoo on last year's season of Seven Year Switch.\nAnd it appears that bridges might have been left unmended with couple Tallena and Brad nowhere to be seen at a cast reunion party attended by Jackie and Tim.\nA photo shared to Jackie and Tim's Instagram account on Tuesday show the two noticeably absent, suggesting the couple may not have stayed in touch once filming ended.\nStill not over THAT tattoo? Seven Year Switch 2016's Jackie and Tim at cast reunion party but Tallena and Brad are nowhere to be seen\nIn the picture, Jackie and Tim pose happily for the the photo alongside couple Jason and Michelle, as well as newly split Ryan and Cassie.\n'Not much 'watching' going on here!' Jackie captions the photo, also adding the hashtags '#sevenyearswitch #theoriginalcrew #season1 #season2 #goggleboxstyle'.\nFollowers were quick to jump on the absence of Tallena and Brad, asking in the comments why the two weren't also there.\nJackie and Tallena had swapped partners during the experiment, coming to blows when Tallena took Tim to get his first tattoo together.\nPromised no tattoos: Jackie threatened to break up with Tim over the perceived betrayal, after making him promise not to get ink with someone else because of the emotional significance\nJackie threatened to break up with Tim over the perceived betrayal, after making him promise not to get ink with someone else because of the emotional significance a tattoo has.\nThe couple later reconciled and became engaged, welcoming their first child together last September.\nBut Jackie and Tim continued to feud with Tallena and Brad after the show wrapped up, with Tallena slamming Tim for making her feel uncomfortable when he jumped into a spa naked with her.\n'You have to ask yourself what this world has come to when getting nude in front of another mans fiancé is acceptable and deemed \"funny\" but having a break down from the stress and exposing raw emotions you're deemed a \"sook, or controlling or possessive\",' she wrote on Instagram last May.\nHit back: Tallena and Brad slammed Tim for making her feel uncomfortable when he jumped into a spa naked with her\nJackie hit back at Tallena's post soon after, revealing Tim had been left 'furious' with how she had spoken of their time together.\nShe told news.com.au last August: 'Tim has been furious about some of the (comments) and allegations she has spread about him, to cover her own guilty conscience for enjoying her time with him.'\nSince appearing on the show Tallena and Brad have married and since kept a low profile, deleting a joint public Instagram account they shared during the series.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446374/Tallena-Brad-absent-Seven-Year-Switch-renunion.html"}
