{"authors":["Karishma Sarkari For Daily Mail Australia"],"date_download":"2018-10-23 01:03:32","date_modify":"2018-10-23 01:03:32","date_publish":"2016-01-29 14:44:28","description":"Australian psych-rock band Tame Impala have revealed their thrilled with Rihanna's cover of their song.","filename":"data/vaneerConsumption/TameImpalaarethrilledwithRihannascoverofSameOldMistakesonANTI.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3DA0400000578-0-image-a-36_1454085746914.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422891_Tame-Impala-thrilled-Rihanna-s-cover-song-ANTI_1540256612.html","title":"Tame Impala are thrilled with Rihanna's cover of Same Old Mistakes on ANTI","title_page":"Tame Impala are thrilled with Rihanna's cover of Same Old Mistakes on ANTI | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rihanna's new offering, ANTI, featured an Australian twist.\nWhen the long-awaited eighth studio album dropped on Thursday many fans were surprised to find the RnB queen had covered a song by Australian psych-rock band Tame Impala.\nHowever, the group themselves weren't shocked, after Ri-Ri's management got in touch during the recording process, saying: 'We're all really happy with how the song turned, love it!'\nScroll down for video\n'Really happy with how the song turned out': Australian psych-rock band Tame Impala released a statement while on tour in Europe on Friday, saying they are happy with how Rihanna's cover of their song sounds\n'Rihanna loved the Tame Impala track': The 27-year-old Bajan beauty was inspired by the Aussie boys track New Person, Same Old Mistakes\nAs the band tour around Europe, they revealed in a statement on Friday morning: 'The Roc Nation team got in touch with us here at Spinning Top letting us know that Rihanna loved the Tame Impala track New Person, Same Old Mistakes.\n'They asked if she could cover the song for her new record - Kevin was more than happy to send it her way.'\nThis new offering is the Bajan beauty's follow-up to 2012's Unapologetic and was released for free via streaming service Tidal, owned by her record company boss Jay Z.\nThe track that closes out their Grammy-nominated 2015 release Currents, features at number nine on Ri-Ri's new release with a tweak to the title.\n'More than happy to send it over': The group revealed song-writer Kevin Parker (left) was happy to give the song to Rihanna when she asked to have it on her recrod\nMake no Mistake, she's a fan! The RnB queen's rendition of the Australian psych-rock band's song sits at number nine on her ANTI album\nListed as Same Ol' Mistakes, the song features a highly produced electro-pop sound that is very different to her first single off the album Work, featuring Drake.\nNo word yet on what Tame Impala's think of the version of their song, however, Daily Mail Australia has contacted the group for comment.\nAnother song set to appear on the soon-to-be released deluxe edition of ANTI, Goodnight Gotham, samples Florence and the Machine's Only If For A Night.\nSee more of the latest news and video updates on Rihanna's new album ANTI\nHighly ANTI-cipated! The singer dropped her long-awaited eighth studio album on streaming service Tidal a week ahead of it's general release\nCollaboration: Rihanna's first single off the album is her collaboration with Drake, called Work\nInterestingly for fans, the singer's biggest hits of last year didn't make the cut - with B**** Better Have My Money, American Oxygen and FourFiveSeconds (with Kanye West and Paul McCartney) all left off the track-list.\nRihanna's interpretation of the Tame Impala track is just the latest in a series of big wins for the band from Perth.\nKevin Parker, Jay Watson, Cam Avery, Dominic Simper, Julien Barbagallo and Nick Allbrook collected five trophies at the Australian Record Industry Association (ARIA) Awards in November.\nWinning big! The band won five Australian Record Industry Association (ARIA) Awards last November and couldn't believe their night, with Kevin feigning fainting on stage\nThey won Album of the Year for Currents, Best Group and Best Rock Album among others.\nNext month, the group's third studio album will be up for a Grammy Award for best alternative album, going up against the likes of the Alabama Shakes, Bjork, My Morning Jacket and Wilco.\nThe 58th Annual Grammy Award winners will be announced on February 15 from the Staples Centre in Los Angeles","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422891/Tame-Impala-thrilled-Rihanna-s-cover-song-ANTI.html"}
