{"authors":["Lauren Ingram For Daily Mail Australia"],"date_download":"2018-10-22 22:14:33","date_modify":"2018-10-22 22:14:33","date_publish":"2017-03-16 03:09:03","description":"Australian actress Tammin Sursok (pictured) has opened up about her struggle with postpartum anxiety. In a poignant Instagram post she said it 'hit me like a ton of bricks after I had my daughter'.","filename":"data/vaneerConsumption/TamminSursokrevealsshehadpostnatalanxiety.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E50756500000578-0-image-a-23_1489633373816.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318592_Tammin-Sursok-reveals-postnatal-anxiety_1540246473.html","title":"Tammin Sursok reveals she had postnatal anxiety","title_page":"Tammin Sursok reveals she had postnatal anxiety | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian actress and blogger Tammin Sursok has opened up about her struggle with postpartum anxiety.\nThe 33-year-old Pretty Little Liars star gave birth to her daughter, Phoenix Emmanuel, in 2013, with husband Sean McEwen.\nIn a poignant post to her 932,000 Instagram followers the actress talked about her postpartum anxiety which, she said, 'hit me like a ton of bricks after I had my daughter'.\nAustralian actress and blogger Tammin Sursok (pictured) has opened up about her struggle with postpartum anxiety\nThe actress talked candidly about her postpartum anxiety which, she said, 'hit me like a ton of bricks after I had my daughter'\nHer Instagram post pointed to a piece Tammin wrote for News.com.au about the experience.\nIn it, the mum recounted how she was terrified by the diagnosis of postpartum anxiety, when told by her doctor.\n'I sat on the uninviting, stark doctor’s bed, hunched over in fear. Fear that I wouldn’t be able to get out of the dreamlike state of detachment,' Tammin wrote.\n'Fear that I wouldn’t realise my potential as the mother I knew I could be, fear that my life would forever be that of a never-ending slow motion horror film.'\n'I remember staring at the medication in the palm of my hands and it triggering a complete panic attack,' she wrote\nThe 33-year-old said that while she was prescribed medication, she couldn't bring herself to take it, which probably made things worse.\n'I remember staring at the medication in the palm of my hands and it triggering a complete panic attack.\n'I lost my balance, as the room started to spin, with the almost cartoon like voices yelling \"failure, faulty, imperfect, let down.\"'\nThe biggest theme, she said, was feeling like a failure of a mother.\nIt took Tammin three years to recover, and she said that meditation, mindfulness, yoga and prayer helped, as well as reading experiences from other mums\nShe said that while she is doing better than before, mothers need to break the stigma associated with postpartum anxiety and depression\nIt took Tammin three years to recover, and she said that meditation, mindfulness, yoga and prayer helped, as well as reading experiences from other mums.\nShe said that while she is doing better than before, mothers need to break the stigma associated with postpartum anxiety and depression.\n'My daughter is three and a half years old now and the great days far outweigh the panic, my hands no longer shake and eyes have readjusted to where I can truly take her in,' the mum ended.","url":"https://www.dailymail.co.uk/femail/article-4318592/Tammin-Sursok-reveals-postnatal-anxiety.html"}
