{"authors":[],"date_download":"2018-10-22 21:10:19","date_modify":"2018-10-22 21:10:19","date_publish":"2014-05-06 10:24:41","description":"“I was planning for a Saturday massacre,” Julie Schenecker allegedly wrote in one entry read aloud in court Monday by a police crime scene technician.","filename":"data/vaneerConsumption/TampaMomonTrialWroteofPlanningforaSaturdayMassacre.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/422466/140506-julie-0703_5d4d7b648c471b6a3d938fe9c90a74f5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_tampa-mom-trial-wrote-planning-saturday-massacre-n97906_1540242619.html","title":"Tampa Mom on Trial Wrote of 'Planning for a Saturday Massacre'","title_page":"Tampa Mom on Trial Wrote of 'Planning for a Saturday Massacre' ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe trial of a Tampa mom charged with killing her two children opened with chilling testimony from Julie Schenecker’s journal, where the 53-year-old allegedly wrote of planning a “massacre” and how she couldn’t wait to get her hands on a gun.\nScheneker is charged with two counts of first-degree murder for shooting her 13-year-old son Beau in the head and 16-year-old daughter Calyx in the face in January 2011.\nShe has pleaded not guilty by reason of insanity. Prosecutors allege she planned the killings over several days.\nHer journal appeared to lay out a plot to kill herself and her children — including frustration over a mandatory waiting period to pick up a firearm — and how she fatally shot the teens with the gun she had purchased, according to NBC affiliate WFLA.\n“I was planning for a Saturday massacre,” Schenecker wrote in one entry read aloud in court Monday by police crime scene technician Matthew Evans.","url":"https://www.nbcnews.com/news/us-news/tampa-mom-trial-wrote-planning-saturday-massacre-n97906"}
