{"authors":["Marenah Dobin"],"date_download":"2018-10-31 01:46:04","date_modify":"2018-10-31 01:46:04","date_publish":"2018-08-27 19:32:36","description":"It's hard to remember a time before Tamra Judge was on Real Housewives of Orange County, but that short era actually did exist. Tamra joined the show in Season 3 and it was a big change for her. Not only was she entering the reality TV world, but…","filename":"data/vaneerConsumption/TamraFromRealHousewivesOfOrangeCountyChangedHerNameForThisStraightforwardReason.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/42daad1a-d5d6-4a41-90ce-e30e9e69d442-getty-467978039.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_tamra-from-real-housewives-of-orange-county-changed-her-name-for-this-straightforward-reason-10250455_1540950364.html","title":"Tamra From 'Real Housewives Of Orange County' Changed Her Name For This Straightforward Reason","title_page":"Tamra From 'Real Housewives Of Orange County' Changed Her Name For This Straightforward Reason","title_rss":"NULL","source_domain":"bustle.com","text":"It's hard to remember a time before Tamra Judge was on Real Housewives of Orange County, but that short era actually did exist. Tamra joined the show in Season 3 and it was a big change for her. Not only was she entering the reality TV world, but Tamra Judge changed her name when she became a Real Housewife. It's not as shocking as it initially sounds once you hear the backstory, but it's intriguing nevertheless.\nIn an interview with Entertainment Tonight, Tamra shared, \"Growing up, my mom called me ‘Tammy.\" So why did she stop going by Tammy all of a sudden? Tamra recalled to ET:\n\"When I got [cast on] the show, there already was a Tammy, Tammy Knickerbocker. So, when I got hired, I remember on the phone I'm like, 'Really? I got hired? I got hired?' And I'm like, you know, 'I know there's already another Tammy, but my real name's Tamra,' and they're like, 'OK, we're calling you Tamra,' and there it was.\"\nTammy Knickerbocker is a name that the longtime fans will remember. But still, she hasn't been on the show in years, so it's interesting that her role had such an impact on Tamra, who's become such a mainstay on RHOC, holding up that center orange in the opening credits plenty of times.\nThat same Entertainment Tonight article confirmed it wasn't just Tamra's mom who called her \"Tammy\" when she was growing up. She went by that name for her whole life, up until she became a reality star.\nNot only that, but Tamra has always been known for being outspoken. She unforgettably yelled, \"That's my opinion!\" during the Season 9 reunion. With that said, it's pretty surprising that she just switched it up from to Tammy to Tamra so easily.\nSure, that was the early stage of the Real Housewives franchise, so it makes sense that Tamra would want to differentiate herself, but she definitely could have made it work. Plus, Tammy Knickerbocker was only a Housewife for Season 2 and Season 3. Tamra has been in the game since Season 2, and the show is currently on Season 13. She's definitely made her mark and could've done so no matter which name she chose to go by.\nIt has worked on another show in the franchise, albeit many years later. When Lisa Rinna joined Real Housewives of Beverly Hills in Season 5, there was another Lisa: Lisa Vanderpump. They both still go by their given first names, and the ladies just throw in their last names or last initial for clarification during conversation. There definitely could've been two Tammy's on RHOC if that's what Tamra wanted.\nThere have been several repeat names on Real Housewives of Orange County, just never at the exact same time, which makes things a lot less confusing.\nThere have been two different Peggyss. Peggy Tanous was a Housewife for Season 6, and Peggy Sulahian was also a one-year Housewife for Season 12. Meanwhile, Jeana Keough was an original Orange County Housewife from Season 1 to Season 5, with some guest appearances since then. On the current season, Season 13, Gina Kirschenheiter joined the show, although to be fair they do spell their names differently, so it's easier to differentiate between the two in written conversation.\nIn retrospect, Tamra actually went through two different name changes on this show. She changed her preferred name to Tamra when she joined Real Housewives of Orange County. She changed her last name from Barney when she got married to Eddie Judge in 2013.\nTamra shouldn't have felt pressure to change her name, but it could be nice to look at the name change as the mark of a new era. She went from Tammy to Tamra when she became a Real Housewife, which has been nothing short of life-changing. She went from Tamra Barney to Tamra Judge when she got married, another life-changing moment.\nNow it's hard to look at the Orange County Housewife and not see her as a \"Tamra,\" but then again, it sort of felt that same way at first when she changed her last name. Who knows, maybe she'll start a whole new era in her life and become Tammy Judge for Season 14.","url":"https://www.bustle.com/p/tamra-from-real-housewives-of-orange-county-changed-her-name-for-this-straightforward-reason-10250455"}
