{"authors":["Casey Rackham"],"date_download":"2018-10-30 23:04:56","date_modify":"2018-10-30 23:04:56","date_publish":"2014-08-14 02:48:29","description":"Well, this is the worst night for reality-TV dancing ever. Both Tanisha Belnap and Rudy Abreu were voted off of So You Think You Can Dance . That's right — the cherub that is Ruby and the dangerously strong beauty that is Tanisha will not be…","filename":"data/vaneerConsumption/TanishaBelnapAndRudyAbreuWereEliminatedFromSYTYCDItsTheWorstNewsEver.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b00a2394-4b10-48e9-865d-f270dd6959d6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35717-tanisha-belnap-and-rudy-abreu-were-eliminated-from-sytycd-its-the-worst-news-ever_1540940696.html","title":"Tanisha Belnap And Rudy Abreu Were Eliminated From 'SYTYCD' & It's The Worst News Ever","title_page":"Tanisha Belnap And Rudy Abreu Were Eliminated From 'SYTYCD' & It's The Worst News Ever","title_rss":"NULL","source_domain":"bustle.com","text":"Well, this is the worst night for reality-TV dancing ever. Both Tanisha Belnap and Rudy Abreu were voted off of So You Think You Can Dance . That's right — the cherub that is Ruby and the dangerously strong beauty that is Tanisha will not be advancing in the competition. I'm sorry, but doesn't anyone else think that the show's voters need to figure some shit out? I mean, Rudy has been a delight to watch since day one, and Tanisha has rapidly become one of the strongest dancers in the show's history, IMHO.\nThe worst part about this whole thing for Rudy is that he completely redeemed himself with his Top 8 performance. His less-than Top 10 Cha Cha performance with All-Star Jenna Johnson definitely put him towards the bottom, but I can't believe that people thought it was blah enough to warrant elimination. And now after his stellar Top 8 jazz routine with All-Star Allison Holker, voters must be hitting their heads against the wall. Plus, this means that now Rudy and Jacque LeWarne are no more (well, no more on the show), and that's it's own sucky dilemma. However, the real SYTYCD tragedy here is the fact that Tanisha is out of the competition.\nYouTube\nThroughout her time on Season 11, Tanisha completely transformed into one of the most talented female dancers on the show. With her insanely strong legs and core — seriously, her core is insane — and her gracefulness, she was able to prove that she's much more than a ballroom dancer. And when she wasn't busy floating across the stage like she was in a dream, she was setting the stage on fire with her sexiness. I mean, is there anyone else on the show that can pull off a black-and-red bodysuit with such ferocity? (The answer is no.) And don't even get me started on how much I'm going to miss her ridiculously weird and oddly adorable hiccups, because they were the best/strangest things ever.\nThe only thing that's making me slightly okay right now is the knowledge that Valerie Rockey is still in the competition. Although I don't think she's going to win the entire competition — even though I would be so ecstatic if she did — I'm just excited that we'll get to see her grow more. After her sultry Top 8 Samba performance, we now know that Tappy McTapperson — thanks for that name, Christina Applegate — can be utterly sexy, and that she's not just a cutie-patootie. Crossing my fingers that next week won't be filled with more upsets.\nImage: Adam Rose/Fox","url":"https://www.bustle.com/articles/35717-tanisha-belnap-and-rudy-abreu-were-eliminated-from-sytycd-its-the-worst-news-ever"}
