{"authors":[],"date_download":"2018-10-30 14:20:23","date_modify":"2018-10-30 14:20:23","date_publish":"2018-10-28 23:11:00","description":"Georgia Tech quarterback TaQuon Marshall will return to his starting role this week, coach Paul John...","filename":"data/vaneerConsumption/TaQuonMarshallreturnstostartingrolependinghealth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/04/19/Videos/4486264.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_taquon-marsh_4b67439c237a70c36494af508bcc721e__1540909223.html","title":"TaQuon Marshall returns to starting role, pending health","title_page":"TaQuon Marshall returns to starting role, pending health","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia Tech quarterback TaQuon Marshall will return to his starting role this week, coach Paul Johnson said Sunday on his weekly teleconference. Johnson had indicated as much following the Yellow Jackets’ 49-28 win over Virginia Tech on Thursday, when backup Tobias Oliver ran for 215 yards and three touchdowns.\n“Yeah,” Johnson said. “I don’t see why he wouldn’t. We’ll work through that, but (Marshall) was the starter.”\nThe Jackets will return to practice Monday to prepare for its Saturday game at North Carolina.\nMarshall had been cleared against Virginia Tech, but did not play. Johnson gave the start to Oliver, as is his policy, because Marshall’s practice time had been limited prior to the game as he was returning from an upper-body injury suffered in the Duke game.\n“My way of doing things, it’s not fair to the guy who practices all the time not to let him play,” Johnson said after the game.\nJohnson added the caveat that Marshall will return to his No. 1 role as long as he is healthy.\n“I have no reason to believe he can’t (practice) because he was released, but we’ll sort it out,” Johnson said. “They’ll probably both play.”\nJohnson was asked if he might consider playing both quarterbacks in a manner similar to how he shared playing time between Tevin Washington and Vad Lee in the latter portion of the 2012 season, when Washington played the first two series, Lee the next two with their performance determining playing time for the remainder of the game.\n“I don’t know that we’re there,” Johnson said. “They’re both going to play.”\nIn Tech’s first seven games, Marshall started with Oliver coming in in some capacity in six of them, either in relief of Marshall in games that were lopsided or to sub for him due to injury.","url":"https://www.ajc.com/sports/college/taquon-marshall-returns-starting-role-pending-health/5V9uDXSRmD64mEOUZ6SgfJ/"}
