{"authors":["Richard Spillett","Duncan Gardham For Mailonline"],"date_download":"2018-10-23 01:59:26","date_modify":"2018-10-23 01:59:26","date_publish":"2016-01-29 16:17:05","description":"Tareena Shakil, who used to live in Burton upon Trent in Staffordshire, fled to the war-torn region in October 2014 after telling her family she was going on holiday to Turkey.","filename":"data/vaneerConsumption/TareenaShakilfoundGUILTYoftakinghersontoSyriatojoinISIS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B494FD00000578-0-image-a-2_1454089161060.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423048_British-mother-GUILTY-taking-toddler-son-Syria-join-ISIS_1540259966.html","title":"Tareena Shakil found GUILTY of taking her son to Syria to join ISIS","title_page":"Tareena Shakil found GUILTY of taking her son to Syria to join ISIS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shakil used to enjoy watching The Only Way is Essex and lived in Staffordshire before becoming radicalised and travelling to Syria\nShe's the first British woman to be convicted after returning from warzone\nTareena Shakil has been found guilty of taking her son and joining ISIS and encouraging terror on the internet\nA British mother has been found guilty of taking her toddler son to Syria to join terror group ISIS.\nTareena Shakil fled to the war-torn region in October 2014 after telling her family she was going on holiday to Turkey.\nShe was found guilty of terror offences at Birmingham Crown Court today, becoming the first British woman to be convicted after returning from the extremist heartland.\nThe court heard the 26-year-old, who used to live in Burton upon Trent in Staffordshire and adored watching The Only Way is Essex, posed her boy for pictures wearing an ISIS-branded balaclava before returning home claiming she'd 'made a mistake'.\nDuring a two-week trial at Birmingham Crown Court, Shakil had denied the charges, claiming she only travelled to Syria because of a wish to live under the rule of sharia law.\nHowever, the jury did not believe her account after seeing tweets, messages and photographs, including images of the black flag of ISIS and passages calling on people to 'take up arms', and stating her wish to become a 'martyr'.\nShe was found guilty of being a member of ISIS and encouraging acts of terror, becoming the first British woman to be convicted after return from the terror heartland.\nJudge Melbourne Inman QC told Shakil - who looked stunned by the verdicts - that she would be sentenced on Monday.\nThe Recorder of Birmingham said: 'You may go down and be remanded in custody until Monday's sentence.'\nShakil initially told police that she was kidnapped from a beach by a man she met on holiday in Turkey, taken to Syria and forced to send out propaganda Tweets for the organisation.\nShakil sent photographs of her son in Syria, including one image showing him sitting next to an AK-47 machinegun. The caption of the picture describes him as 'Abu Jihad al-Britani'\nThe 26-year-old also posed with her son wearing a black balaclava bearing the slogan of ISIS\nBut in court she admitted she had been in an abusive relationship with the boy's father and was seeking to start a new life.\nDetectives believe she was married off to an ISIS fighter as a jihadi bride and that the marriage went sour within weeks.\nShakil, pictured at East Midlands Airport with her toddler before they boarded a flight to Turkey en route to Syria\nIn a conversation with her father on WhatsApp, in mid-December 2014 while living under ISIS rule, she told him: 'I want to die here as a martyr.'\nShe later claimed these messages were sent under duress by female ISIS minders.\nJurors heard that before going to Syria, Shakil had chatted online with 'prominent IS member' Fabio Pocas.\nShe was also in touch with Sally Ann Jones, the British widow of Birmingham jihadi Junaid Hussain who was killed in a drone strike in Syria last year.\nThere were further signs of growing radicalisation, including searches for videos of Anwar al Awlaki, an al-Qaeda-linked extremist who was killed in a US drone strike in Yemen in 2011.\nThe 26-year-old also changed the status of her Facebook page - emblazoned with the black flag of ISIS - to read: 'If you don't like the current events in Sham (Syria) take to arms and not the keyboard.'\nAfter going to Turkey, she secretly fled across the border into Syria, where she was later taken to Raqqa, the de facto ISIS capital.\nPhotographs of her in a flat in the city, suggest she had gone through a marriage ceremony and been allowed to move out of the house where single women without male guardians are forced to live in Raqqa.\nExplaining her reason for wanting to return home, Shakil complained that the rules in the women's house were too strict and she had her mobile phone taken off her.\nShakil told Birmingham Crown Court: 'Your phone was taken off you and there was this evil Saudi woman' who ran the house for single women, known as a maqqa.\nShakil in her police interview. She claimed she was kidnapped but later admitted wanting to start a new life\nA blurred photo posted online by Shakil shows an unidentified woman wielding a Kalashnikov rifle\nShakil listed the rules: 'No phones, no ipads - if you get caught there are big problems – rules if you are not Syrian and not married, how she expected you to act, taking turns cooking and cleaning and womanly duties.'\nIn a message discovered on her phone, she advised another single woman thinking of joining ISIS: 'I'm married ukhti [sister]. Life is hard 4 single sisters, too many sisters run. Please don't come alone, u have to be married here ukhti. Trust me, u r young, look after ur parents and tell all single sisters, I said don't come alone.'\nSpeaking after the verdict, Assistant Chief Constable Marcus Beale, who leads on counter-terrorism across the West Midlands, said: 'Tareena Shakil had self-radicalised by viewing extremist material on the internet, before leaving the UK in October 2014.\n'Our assessment is that she was not naive; she had absolutely clear intentions when she left the UK, sending tweets encouraging the public to commit acts of terrorism here and then taking her young child to join Daesh in Syria.'\nAssistant Chief Constable Beale added: 'Photographs seized from her phone showed Ms Shakil posing with a firearm and wearing a Daesh balaclava. Another showed a rucksack with a Daesh logo and person holding a handgun. These were taken while she was in Syria.\n'Ms Shakil had already incited others to commit terrorist acts on social media and having spent months living under Daesh, she no doubt presented a real threat on her return to the UK from the country early last year.\n'Thanks to proactive counter-terrorism policing, we were able to intercept Shakil at the airport and put the necessary measures in place to protect her child from their mother's extremist ideology.'\nPhotos shown to the jury showed Shakil posing in an ISIS balaclava and with a Kalashnikov rifle\nShakil's Facebook page under the name Tameena al Amirah where she started posting extremist messages\nShakil told Birmingham Crown Court: 'Your phone was taken off you and there was this evil Saudi woman' who ran the house for single women, known as a maqqa\n'YOU ARE HANGING OVER THE GATES OF HELL': TAREENA SHAKIL'S TROUBLED ROUTE TO RADICAL ISLAM Tareena Shakil's father was from Pakistan and her mother was white and from Australia, but only converted to Islam four years ago. Her family were not religious but she was sent to the mosque for religious education between the ages of eight and 12. She attended Victoria Primary School and then De Ferrers High School in Burton-on-Trent, Staffordshire, where she passed eight GCSEs and went on to get two Bs in media and film and a D grade in psychology at Burton College where she did her A-levels. While at college she also worked part-time for Morrisons supermarket and then for the New Look high street fashion chain. Shakil went on to study counselling and psychology at Wolverhampton University from 2009 to 2010 but dropped out of the course after getting married. Her new husband had become jealous of other men on the course and 'it became difficult with the accusations. My marriage was not too good and I decided it was not worth the headache,' she said. After leaving university, she found a job as a rehabilitation support worker in Hinkley, Leicestershire, for a year, working with patients with burn injuries, however, Shakil was soon pregnant with her son and left work to become a fulltime parent. Shakil's father was violent and often in trouble with police, she said, while her older brother followed his father in getting into trouble and was thrown out of school. Her mother ran away from home on one occasion but Shakil added: 'He got her back, he found out where she was and turned up. She was in hospital due to injuries. I was 11 or 12.' She had met her husband, Samim, on a night out with her friends in June 2010. He was married but she didn't find out for five months, when she also discovered that he had two children by two different women. However he got a divorce in January 2011 and by February she had moved into his flat in Moseley Road, Balsall Heath in Birmingham. 'From the beginning it took a rapid downward spiral fuelled by alcohol – on his part not mine- within a week of moving in together,' she said. Shakil was asked by Tim Moloney QC, defending, if the relationship was violent and said: 'There was a lot of violence. He's done various things - very serious and it got worse.' They got married in July but in October 2011, police were called to the house they were sharing after an anonymous caller reported a disturbance. Officers found broken furniture and smashed plates and found Shakil hiding in a cupboard in the bedroom 'visibly shaking and upset' after Samim had allegedly pulled her hair, slapped her and punched her. At the end of 2012, she fell pregnant and the baby was born in August 2013. 'Samim used to kick me out and throw my clothes over the balcony. It wasn't secure to live in that situation so I got a place of my own,' she said. 'Samim's violence was fuelled by alcohol, he would come home paralytic drunk. He might pick up my son and drop him. I can't control him when he's sober, let alone when he's drunk. 'I gave him the option, I said, you need to stop and he said when the baby was born he wasn't going to drink but two weeks after he was back out partying. He'd been saying the same thing for four years.' But even with her own place, her husband would turn up at her flat in Sparkhill, Birmingham. 'I didn't have a peaceful life in Birmingham, he would come knocking on my door,' she said, explaining that she spent much of her time back at home in Burton-on-Trent. At the end of July 2014, her husband left for Yemen to go to his sister's daughter's wedding, with members of the family flying in from America. 'He would say he was getting married again and starting a new life out there and he didn't want to live in England any more. 'Because we had got a child together, I wouldn't want him to start a life there. I have been through a lot with this man.' She said she was also upset that he had ruined her 'chance' of a better life by forcing her to drop out of university and turning down an opportunity to go and work with her grandfather in Australia. 'I thought, you are going to leave me here, broken, just leave me, lost,' Shakil said. With her husband in Yemen, Shakil started to join the campaign to Free Palestine and re-started her Facebook account which she hadn't used since leaving university four years earlier. 'I was always interested in going to live in another country, for no other reason than I just wanted to,' Shakil said. She said she was contacted by a man calling himself Abu T who said he was in 'Sham' she said. 'At the time, I didn't even know where Sham was,' she said. 'He explained what hijra [emigrating] was and staying in the land of the non-believers. He said you can't live where there is not shariah [Islamic law] its haram [forbidden]. 'He said, 'Look sister, while you are in England, you are hanging over the gates of Jahannam [hell]. If you die, the gates will open, that's where you're going.'\nTrial of runaway mother hears she is one of about SIXTY British women who have gone to join ISIS\nThe jury which convicted Tareena Shakil of travelling with her child to join ISIS was told that about 60 British females were thought to have gone to Syria.\nDuring her trial at Birmingham Crown Court, Dr Florence Gaub an expert on the subject of conflicts in the Arab world estimated the latest figure for the number of British women who have joined the brutal terror group.\nDr Gaub said evidence suggested the total number of women from Europe, North America and Australia who had gone to the self-declared caliphate was about 600.\nA senior analyst for the European Union Institute for Security Studies, Dr Gaub said it was thought that about 5,000 Western 'foreign fighters' - a number including women, although they cannot bear arms for IS - were now in Syria.\nThat figure makes up roughly a quarter of the 40,000-strong military force which IS was estimated to have, based on data from summer 2014.\nShe added that half of that figure were classed as foreign fighters, those who were neither Syrian nor Iraqi, and included those who had come from countries like Tunisia and Saudi Arabia.\nDr Gaub said all of the information had come from sources including Western military and domestic intelligence services data, and analysis of other sources like media reporting.\nTurning to the subject of defections from ISIS, she said somewhere between a third and a half had left to either return home or depart ISIS-occupied territory.\nShe said: 'Between 1,500 and 2,500 individuals from the European Union, UK and North America are said to have left ISIS territory.'\nThe jury which convicted Tareena Shakil (pictured back, centre) of travelling with her child to join ISIS was told that about 60 British females were thought to have gone to Syria\nThe brutal terror group in Syria and Iraq have reported attracted 60 British women to their cause\nShe added the number of women defectors was thought to be between 80 or 90.\nSeparately, the Government has estimated 800 Britons have gone into Syria in the past four years, with half still believed to be in the country.\nSpeaking on a visit to Turkey earlier in January, Foreign Secretary Philip Hammond said the security services had stopped 600 British nationals from entering the war-torn Middle Eastern state trying to join ISIS and other jihadists.","url":"https://www.dailymail.co.uk/news/article-3423048/British-mother-GUILTY-taking-toddler-son-Syria-join-ISIS.html"}
