{"authors":["Emma Lord"],"date_download":"2018-10-31 01:48:01","date_modify":"2018-10-31 01:48:01","date_publish":"2018-09-11 14:40:50","description":"As a person who gets flack for tweeting about pumpkin spice mania in July, I really should know better than to do this, but I feel it is my civic duty to inform you that you can purchase holiday decor from Target. While Target has by no means made a…","filename":"data/vaneerConsumption/TargetHolidayDecorIsAvailableToPurchaseOnlineIfYoureEagerToGetIntoTheSpirit.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/fc5ad1a8-cb1f-4600-8df8-7d8279356422-screen-shot-2018-09-11-at-103149-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_target-holiday-decor-is-available-to-purchase-online-if-youre-eager-to-get-into-the-spirit-11854714_1540950481.html","title":"Target Holiday Decor Is Available To Purchase Online, If You're Eager To Get Into The Spirit","title_page":"Target Holiday Decor Is Available To Purchase Online, If You're Eager To Get Into The Spirit","title_rss":"NULL","source_domain":"bustle.com","text":"As a person who gets flack for tweeting about pumpkin spice mania in July, I really should know better than to do this, but I feel it is my civic duty to inform you that you can purchase holiday decor from Target. While Target has by no means made a hard launch of new 2018 products or attempted to market them to human beings — in fact, these products are available on Target's website year-round — I, resident holiday trash of Bustle dot com, was perusing the Target website when Frosty the Snowman body-snatched me and led me down a link hole to find a slew of products that are listed and available to buy right now.\nIf you're also leaning a little too early into the holiday glow, the good news is, you (kind of!) have science on your side: a study from 1989 in the Journal of Environmental Psychology indicates that people with holiday decorations are perceived as more socially accessible in their neighborhoods, with the study's authors concluding that it may be a good way to make friends with people on your block. But even if you don't have more friends, you will have adorable themed holiday plates, which are sometimes far more useful than friendships anyway.\nAll this is to say: no judgment, if you end up with half of this in your cart and come home from work next week with the makings of a winter wonderland at your feet. Sometimes you just gotta live your life like the unrepentant Santa stan you are. Here are a few things available at Target right now to get you started.\n1. Ice Skating Dogs Rug\n2. NFL Christmas Tree Skirt\n3. Glitter Artificial Christmas Trees\n4. Purple Ornaments\n5. Merry & Bright Throw Pillow\nThrow Pillow Rizzy Home Green Red White $9.79 Target There is a huge array of throw pillows to choose from on Target's website, so make sure that you are making an INFORMED throw pillow decision before you impulse buy this admittedly very cute one. Buy Now\n6. Fiber Optic Christmas Tree\nAnyway, I assume Target will drop its 2018 line in a big, official way sometime in the coming weeks — right now it's mostly throw pillows, ornaments, and trees, and there seems to be very little for Hanukkah or New Year's — but for now, here's a little taste to tide you over while we all get our Halloween heebie-jeebies on. Happy decorating!","url":"https://www.bustle.com/p/target-holiday-decor-is-available-to-purchase-online-if-youre-eager-to-get-into-the-spirit-11854714"}
