{"authors":["Marlen Komar"],"date_download":"2018-10-31 01:40:13","date_modify":"2018-10-31 01:40:13","date_publish":"2018-09-06 17:45:07","description":"Now that it's officially September, it's time to put the floaty summer dresses and short shorts away and start planning your fall wardrobe. One big box store is here to help, with the launch of Target's new Prologue line, a minimalist, upscale…","filename":"data/vaneerConsumption/TargetsNewPrologueLineWillBeAMinimalistLoversDream.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/9d0a2030-96a0-4778-a412-aef78bf7e4b8-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_targets-new-prologue-line-will-be-a-minimalist-lovers-dream-11775870_1540950013.html","title":"Target's New Prologue Line Will Be A Minimalist Lover's Dream","title_page":"Target's New Prologue Line Will Be A Minimalist Lover's Dream","title_rss":"NULL","source_domain":"bustle.com","text":"Now that it's officially September, it's time to put the floaty summer dresses and short shorts away and start planning your fall wardrobe. One big box store is here to help, with the launch of Target's new Prologue line, a minimalist, upscale range. Comparable to the kind of pieces you would expect to see on the racks of Zara, Prologue (sizes range from 0-26W) has pieces that are grown up, sleek, and quietly elegant in a way that you wouldn't believe came from the same place you could buy detergent and Doritos from.\nTarget announced the launch on their website, A Bullseye View, on Sept. 5, sharing the aesthetic they were going for when creating the range. \"In this case, less really is more,\" the release reads. \"It’s fashion you’d see on the runway or straight from the streets of London, Copenhagen or Tokyo, made with luxurious, elevated materials (oh hi, matte satin, sleek crepe and textured twill) at an only-at-Target value.\"\nZeroing in on the latest fall trends and whipping together timeless essentials, you can shop everything from blouses to pants, skirts to coats, which you can deftly mix and match together or easily incorporate into your existing wardrobe. And the best part is that none of it will break the bank.\nTarget\nWhile it looks and feels luxe with its satin and twill separates, it still sticks to the affordable price range that Target is known for. The pieces range between $12.99 to $49.99 and come in an extended size range, though the plus size options will only be available online for the time being. The in-store size selection goes from 0-16, while many pieces will be available up to 26W online.\nPrologue was specifically created to capture shoppers who like the upscale, minimalist look. \"With Prologue, we’re looking to inspire — and win over — women who are drawn to a more modern, minimal style… which, by the way, is not the easiest look to create on a budget,\" Julie Guggemos, senior vice president, Product Design & Development, shared. \"It can require a ton of time and effort to curate, and many of the well-designed, contemporary collections are simply out-of-reach for many. That’s where Target comes in.\"\nSince the designs and silhouettes are so simple, the label decided to really focus on expensive looking and feeling fabrics to elevate the looks. Check out some picks below to get a sneak peek of what to expect.\nThis asymmetrical wrap skirt looks like something straight out of Mango, and looks especially chic paired with a turtleneck and faux leather jacket.\nThis black leather sleeveless dress is the perfect layering piece for fall.\nThis tunic top is a great transitional piece to take you from summer to fall, and looks especially chic paired with tailored cargo pants. (Who would have ever thought cargo pants would be back in?)\nIf you love these pieces, you don't have long to wait until Prologue launches. It will debut in select Target stores and Target.com starting Sept. 14.","url":"https://www.bustle.com/p/targets-new-prologue-line-will-be-a-minimalist-lovers-dream-11775870"}
