{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:36:23","date_modify":"2018-10-30 19:36:23","date_publish":"2015-10-21 17:50:45","description":"Star Wars fans are accusing retail giant Target of sexism this week, after a T-shirt being sold in the chain’s stores featured and image that was altered to replace Princess Leia with Luke Skywalker.","filename":"data/vaneerConsumption/TargetStoresAccusedofSexismforSellingTShirtthatReplacesPrincessLeiawithLukeSkywalker.json","image_url":"https://media.breitbart.com/media/2015/10/Vader-pointing-Lucasfilm-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_21__1540928183.html","title":"Target Stores Accused of Sexism for Selling T-Shirt that Replaces Princess Leia with Luke Skywalker","title_page":"Target Stores Accused of Sexism for Selling T-Shirt that Replaces Princess Leia with Luke Skywalker | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Star Wars fans are accusing retail giant Target of sexism this week, after a T-shirt being sold in the chain’s stores featured an image that was altered to replace Princess Leia with Luke Skywalker.\nThe original image was taken during a scene in 1977’s Star Wars Episode IV: A New Hope, when former Jedi Knight and Sith Lord Darth Vader threatened rebel Princess Leia Organa (Carrie Fisher) for working with rebel spies.\nWatch the scene below:\nFranchise fans know the moment well, and were shocked last week upon seeing an image of the famed encounter revised to include Skywalker (Mark Hamill).\nThe Mirror newspaper gathered an assortment of responses to Target on Twitter, from fans who accused the chain store of being motivated by sexism:\n@Target Why don't you put Leia back on that Star Wars t-shirt first? Then we'll talk. — Burlap Bean Tyrant (@favomancer) October 15, 2015\n@Target you could not have made a more sexist tshirt #starwars. Removing Leia and replacing her with Luke? Shame on you — Kim Vander Dussen (@wwfan7ana) October 17, 2015\n@AskTarget You did not put Luke in Leia's place on a Star Wars scene on a \"boys\" t-shirt. That royally sucks! How sexist can you be,Target? — KHub (@krishub) October 16, 2015\nTarget responded to the criticism from one Star Wars fan on Twitter Thursday Oct. 15, writing, “It’s never our intention to leave anyone out! We’ll share your thoughts with the right teams.”\nStar Wars: The Force Awakens, the seventh film in the series, will debut in December.\nEarly tickets for the film went on sale Monday.\nWatch the trailer below:","url":"https://www.breitbart.com/entertainment/2015/10/21/target-stores-accused-of-sexism-for-selling-t-shirt-that-replaces-princess-leia-with-luke-skywalker/"}
