{"authors":["Emma Lord"],"date_download":"2018-10-31 01:50:11","date_modify":"2018-10-31 01:50:11","date_publish":"2018-09-13 21:36:32","description":"SOUND THE ALARM, Y'ALL: Chrissy Teigen, Patron Saint of Ridiculously Delicious Food and the reason why my dreams are constantly haunted by massive amounts of pasta being swirled around in cheese bowls, just formed a partnership that has every…","filename":"data/vaneerConsumption/TargetsCravingsByChrissyTeigenExclusiveLineOfTablewareKitchenwareIsTooStunningForMortalEyes.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/9b1df9f2-0f41-41e7-88e5-9722333c18e3-chriss.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_targets-cravings-by-chrissy-teigen-exclusive-line-of-tableware-kitchenware-is-too-stunning-for-mortal-eyes-11914237_1540950611.html","title":"Target's \"Cravings By Chrissy Teigen\" Exclusive Line Of Tableware & Kitchenware Is Too Stunning For Mortal Eyes","title_page":"Target's \"Cravings By Chrissy Teigen\" Exclusive Line Of Tableware & Kitchenware Is Too Stunning For Mortal Eyes","title_rss":"NULL","source_domain":"bustle.com","text":"SOUND THE ALARM, Y'ALL: Chrissy Teigen, Patron Saint of Ridiculously Delicious Food and the reason why my dreams are constantly haunted by massive amounts of pasta being swirled around in cheese bowls, just formed a partnership that has every appliance in your kitchen shaking. Chrissy Teigen is launching an exclusive Target line for kitchen and tabletop wares — and if the preview pictures are any indication, it is not just a thing of beauty, but of every foodie's dreams.\nAccording to a Target press release, the line — dubbed the Cravings by Chrissy Teigen collection — will be available in stores and online starting on Sept. 30, so set all 15 of your Google calendar alerts right the heck now. The line features the same items that Teigen uses in her own kitchen, from Dutch ovens to glassware, all of which you are stalkerish-ly familiar with if you, like me, are a frequent lurker on her Instagram stories. The press release also shares that there will be over 40 items in the collection to choose from, which range from $4 to $140 — the latter of which is a 12-piece cookware set.\nAnd, to top it all off, Teigen has yet another book in the works; Cravings: Hungry for More, a follow-up to 2016's Cravings, will arrive just ahead of the line, with a Target-exclusive edition dropping in stores and online on Sept. 18.\nTarget\n\"I’ve always wanted people to love what they’ve cooked from my books. Creating a collection was a natural extension of my passion for food, and I am so excited for everyone to be proud of and truly love their kitchen and tools,\" Teigen said in an interview included in the Target press release.\nIf you're overwhelmed by the prospect of 40+ items and have no idea what to prioritize on your dash to collect them all, Teigen also has some insight to offer — according to her, the knife in this collection is a must-have.\n\"The 'Go To' knife really is my everything! It was the first thing we created,\" she shared in the press release. \"I have so many knives in my own kitchen, but always found myself gravitating towards my 7-inch chef’s and serrated knives. I always wished they would morph into one, so we did just that. It slices juicy tomatoes, steak and rustic loaves of bread perfectly. I truly love it.\"\nAlso top on Teigen's list? The organic plates and bowls, which have a homey, rustic vibe, but still look extra sophisticated.\n\"I wanted to make sure everything in the line felt unique and special, and each piece has little marks of character — like raw edges and flecks of glaze that differ from piece to piece,\" said Teigen. \"They’re timeless but have character, and they look beautiful both on a table and stacked on a shelf.\"\nYou can see that aesthetic weaved through all of the items in the line, which, TBH, might just turn me into a person who cooks at long, long last. (RIP, my Seamless account!)\nThe best part is that many of the pieces seem to have that extra special Chrissy Teigen touch to them, emblazoned with the Cravings logo or with Teigen's own signed name. Now you can play host with the most as you pay homage to the ACTUAL host with the most.\nAnyway, if you're a person who's always wanted to make Chrissy Teigen cry, I have excellent news for you: \"I think I’ll cry when people start tagging me in Instagram photos of them filled with their delicious food!\" she shared in the Target press release. So get yourself to a Target on Sept. 30, y'all — 2018 is officially the Year Of Delicious Cooking, and the Year We All Make Chrissy Teigen Cry.","url":"https://www.bustle.com/p/targets-cravings-by-chrissy-teigen-exclusive-line-of-tableware-kitchenware-is-too-stunning-for-mortal-eyes-11914237"}
