{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:39:02","date_modify":"2018-10-30 20:39:02","date_publish":"2016-06-28 02:27:36","description":"Al-Qaeda is disseminating a guide urging all Muslims in America, \"regardless of their affiliation,\" to carry out more “lone wolf” attacks.","filename":"data/vaneerConsumption/TargetAngloSaxonCommunity.json","image_url":"https://media.breitbart.com/media/2015/04/Yemini-Al-Qaeda-militant-holding-flag-AP-PhotoHani-Mohammed.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_27__1540931942.html","title":"Target 'Anglo-Saxon Community'","title_page":"Al-Qaeda to U.S. Muslims: Target 'Anglo-Saxon Community'","title_rss":"NULL","source_domain":"breitbart.com","text":"The Yemen-based al-Qaeda in the Arabian Peninsula (AQAP) is disseminating a guide urging all Muslims in America, “regardless of their affiliation,” to carry out more “lone wolf” attacks that mirror the recent massacre in Orlando, FL, and to target “areas where the Anglo-Saxon community is generally concentrated.”\nTitled “Inspire guide: Orlando Operation,” the four-page document says:\nWe finally call upon the Muslims in America to take up arms in defense of their religion and the Islamic Ummah [community]. Lone Jihad is not monopolized by al-Qaida or any other group, therefore we call upon all active Jihadi groups, to adopt and build upon the idea of Lone Jihad and call towards it. We call upon every single Muslim in Western countries or in other countries who are able to travel to the West to follow upon the footsteps of our hero Umar Mateen and his likes. To rise and strike America, the head of kufr [unbelievers].\nThe publication, which was reportedly posted on Telegram on June 23, provides advice and directions for U.S. Muslims to follow in the footsteps of Omar (or Umar) Mateen, the jihadist behind the terrorist assault that left 50 people dead, including himself, and 53 others wounded at a gay nightclub in Orlando on June 12. It has been deemed the deadliest terrorist attack since 9/11.\nJihadists should focus on killing white Americans to avoid having the U.S. federal government and media mislabel the “real motives” of operations, declared AQAP, in an apparent reference to the Orlando attack being deemed a hate crime.\nThe executer specifically chose a homosexual nightclub, and even though the killing of such people is the most binding duty and closer to human nature, but better than this is to avoid targeting areas where minorities are found. This is in order not to deviate the essence of the operation and letting it be termed as a small issue as the American media is trying to portray in the case of Mateen… The media tried to portray the operation motives to be against a particular group of people in order to turn the American public away from the real motives of the operation. Most of the individuals present at pulse nightclub were Latino. We recommend — And Allah knows best — that it is better to avoid targeting places and crowds where minorities are generally found in America. knowingly that the federal government will be the one taking full responsibility. Therefore we advise targeting areas where the Anglo-Saxon community is generally concentrated. This class of the American community is the majority and it is the one that is in the American leadership.\nAlthough he pledged allegiance to al-Qaeda rival the Islamic State (ISIS/ISIL), Mateen is praised as a “lone Jihad hero” in the guide.\nAs for us, we welcome this blessed operation and call for more similar Lone Jihad operations. We stand by and support all Muslims who attack America in their homeland regardless of their affiliation to any group or loyalty. We call upon all those oppressed by America, be it a Muslim or not, to retaliate and take back their rights by any possible means (under the umbrella of Shariah) from this oppressive state.\nShariah (sharia law) refers to strict Islamic laws that governs the life of every Muslim.\nThe guide was reportedly released in addition to AQAP’s periodical propaganda magazine Inspire, with a direct message to “target the general populations in America (Combatant Public), who are generally at war with Islam… we no longer view them as civilians in America.”\nAQAP urges Muslims to particularly target “general gatherings.”\nThe Inspire guide reminds readers to move forward “in continuation” of the teachings of al-Qaeda mastermind Osama bin Laden who advocated “global jihad” and “lone wolf”-style attacks.\nIn the guide, Mateen’s attack in Orlando is described as one “the most successful Lone Jihad operations” that “will inspire others to wage similar operations.”","url":"https://www.breitbart.com/national-security/2016/06/27/al-qaeda-us-muslims-attack-anglo-saxons/"}
