{"authors":[],"date_download":"2018-10-30 01:24:38","date_modify":"2018-10-30 01:24:38","date_publish":"2018-07-23 00:05:19","description":null,"filename":"data/vaneerConsumption/TariffsStuckontheSpinCycle.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/hp-laundry-image-1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862678.html","title":"Tariffs Stuck on the Spin Cycle","title_page":"Tariffs Stuck on the Spin CycleThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"(Debra Saunders is off this week.)\nAmerican firms cheering for protectionism in the form of tariffs on their foreign competitors should be careful what they wish for. As they say, “What goes around comes around.” Case in point: The American washer and dryer manufacturer Whirlpool Corp.\nLast January, the Trump administration imposed a penalty on Americans who buy foreign-made washers. The administration argued that the need to protect our domestic washer makers from competition required the imposition, for a period of three years, of a 20 percent duty on the first 1.2 million imported washing machines each year and a 50 percent duty on quantities above that threshold. Whirlpool loved the idea of getting a leg up on two of its most fierce competitors and increasingly consumer darlings, South Korean Samsung Electronics Co. and LG Electronics Inc. Why bother trying to produce goods that your consumers want to buy when Uncle Sam can make your competitors’ stuff artificially more expensive?\nMarc Bitzer, the chief executive officer of Whirlpool, touted this protection as “without any doubt, a positive catalyst for Whirlpool.” Of course, it’s not so good for American consumers who must now pay a penalty if they insist on buying the foreign-made washers that they prefer over American-made washers. One result of this penalty, according to the Wall Street Journal, is that washer prices have risen by about 20 percent since January. From Whirlpool’s standpoint, the policy seemed like a raging success. Imports of large residential washers fell from a monthly average of 350,000 in 2017 to an average of 161,000 each month of 2018 through April.\nBut it’s not only American consumers who are harmed by Trump’s tariffs. American businesses also get hurt in the process when consumers, having to fork over hundreds of dollars more for washers, must forgo the purchase of other products that they would have otherwise bought. This isn’t surprising since tariffs always divert resources toward government-protected (read: favored) businesses and away from unprotected ones (read: everyone else).\nHere’s the thing: When you cheer for protectionism, you never know when you might become the victim of the next round of consumer-punishing tariffs. That’s what happened to Whirlpool, which is now a victim of the 25 percent steel tariffs imposed by the administration to protect the steel industry from foreign competition.\nIt’s funny how that works. Whirlpool isn’t too happy about this particular version of protectionism. The steel tariffs increase the company production costs for washers and dryers. And some of these higher production costs are covered in the form of higher prices for consumers. As a result, since the Trump tariffs were announced and set in place, prices have gone up across brands and the demand for washers has fallen.\nMeanwhile, appliance-repair businesses are making a killing as consumers put off the purchase of new appliances in favor of the expensive (but relatively cheaper) repairs they wouldn’t have purchased in a not-so-long-ago pre-tariff past. Poor protect-me-but-not-thee Whirlpool; this sad turn of events has forced the company to reconsider many of its hopes for expansion.\nWith imports down, the company planned to add workers at its washer plant in expectation of a new rush of tariff-induced washer sales. Not so fast. Thanks to the many tariffs applied to over $90 billion of imports from China and other places (including inputs and raw materials like steel), Whirlpool not only didn’t add 1,300 workers to its Clyde factory in Ohio; it has actually reduced its production. It’s therefore unsurprising that Whirlpool’s share price is down 15 percent since the washer tariffs were put in place. That’s in spite of the massive cut in the corporate income tax rate from 35 to 21 percent and other tax cuts.\nThe bottom line is that a government that’s powerful enough to protect some producers against foreign competitors is powerful enough to protect other producers — protection that winds up inflicting net damage on most or even all producers. As for the 6.5 million workers in America’s steel-consuming manufacturing plants (including Whirlpool’s), they can be added — along with all consumers — to the laundry list of long-suffering victims of cronyism that the Washington, D.C., swamp has left out to dry.\nVeronique de Rugy is a senior research fellow at the Mercatus Center at George Mason University. To find out more about Veronique de Rugy and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate webpage at www.creators.com.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/tariffs-stuck-on-the-spin-cycle/"}
