{"authors":["Duncan Gardham For Mailonline"],"date_download":"2018-10-23 05:14:02","date_modify":"2018-10-23 05:14:02","date_publish":"2016-01-28 21:12:38","description":"Tarik Hassane, 22, is on trial at the Old Bailey along with three other men accused of plotting to carry out a drive-by shooting on soldiers, the police and the public in London.","filename":"data/vaneerConsumption/TarikHassaneaccusedofISISinspiredshootingposedwithgunandOsamabinLadenbook.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30ACF46100000578-0-image-a-35_1454013889528.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421628_Medical-student-accused-ISIS-inspired-drive-shooting-posed-gun-Osama-bin-Laden-book-plotted_1540271642.html","title":"Tarik Hassane accused of ISIS-inspired shooting 'posed with gun and Osama bin Laden book'","title_page":"Tarik Hassane accused of ISIS-inspired shooting 'posed with gun and Osama bin Laden book' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A medical student accused of plotting an ISIS-inspired drive-by shooting was pictured posing with a firearm and a copy of a book about Osama bin Laden, a court heard.\nTarik Hassane - who called himself The Surgeon - sent a picture of himself posing with a firearm holding Michael Scheuer's 2011 book on the Al Qaeda leader to alleged gang member Suhaib Majeed.\nMetropolitan Police officers found it after arresting the four-strong gang, who had allegedly dubbed themselves the Turnup Terror Squad, in West London.\nTarik Hassane, 22, is pictured holding what appears to be a gun and a book about Osama bin Laden\nHassane, pictured, is accused of plotting terror attacks in London and is on trial at the Old Bailey\nHassane, 22, and Majeed, 21, along with Nyall Hamlett, 25, and Nathan Cuffy, 26, all from West London, allegedly plotted to kill soldiers, police officers and members of the public in a drive-by shooting in London.\nThey are standing trial at the Old Bailey accused of conspiracy to murder and preparation of terrorist acts while some are also charged with firearms offences. They deny all the allegations.\nImages shown to the jury show them under surveillance as they allegedly obtained another weapon.\nWhen police raided a council flat in West London a handgun was thrown out of the window, along with a silencer and a magazine full of bullets.\nHassane, of Ladbroke Grove, had just finished his medical exams when he messaged a Telegram chat group called the 'Turnup Terror Squad' on July 10, 2014, saying: 'Make dua [pray] that Tarik gets a free fat strap' – referring to a cool gun.\nBut a few minutes later he messaged: 'I'm such a tank [idiot]… I have a strap.'\nSuhaib Majeed, pictured, is also accused of the plot and was allegedly using an encrypted message service called 'Mujahideen Secrets' to communicate with someone overseas\nAn image of him with a firearm was later found on Majeed's phone, thought to have been taken three months earlier.\nA firearms expert who looked at the two images was unable to say one way or the other if the gun was real or imitation or what type of gun it was, the Old Bailey was told.\nHowever Majeed, a physics undergraduate at King's College, London, had allegedly helped Hassane get hold of another handgun in London.\nHamlett and Cuffy were said to be involved in the arms deal for a Baikal IZH 79-8 self-loading pistol, a silencer and seven 9mm cartridges in a magazine.\nHowever the men were under surveillance in early September as Majeed sat under a tree in Regent's Park with his laptop, allegedly using an encrypted message service called 'Mujahideen Secrets' to communicate with someone overseas.\nThree weeks later, on September 23, officers watched Hamlett as he met Cuffy on Westbourne Park Road and allegedly took delivery of the Baikal handgun.\nAt the same time, Hassane, who was in Sudan, asked Majeed: 'Oi bruv…Wag1 [what's going on] with the creps [trainers]…??' – allegedly using code for the gun.\nHe would later deny this was code, telling officers he was interested because he could get they cost a lot in Sudan.\nMajeed and Hassane, pictured, were both under police surveillance before their arrest\nNathan Cuffy, centre, is allegedly pictured here handing over a plastic bag containing a handgun to Nyall Hamlett, right\nHamlett was then seen walking back into the stairwell of his home with a plastic drawstring bag, which allegedly contained the firearm.\nMajeed was also under surveillance as he rode his moped along Westbourne Park Road shortly afterwards, on his way to Hamlett's house.\nHamlett met him on the walkway and the pair went inside, and then, five minutes later, at 9.33pm, both men emerged.\n'As he rode off, the back of the jacket Majeed was wearing appeared to be bulky, because it was doubtless concealing the weapon and the accessories inside the bag,' Brian Altman QC, prosecuting, said.\nMajeed then sent a message to a Telegram account being used by Hassane saying: 'Got it.'\nArmed officers were stationed outside Majeed's family home in a council block in Lisson Grove when police raided it the next day.\nWithin five seconds of the armed officers entering the premises, the officers stationed outside saw the blind on the second floor window crack open and from under the blind they saw a hand throwing the gun, a magazine containing six rounds of ammunition, one loose round of ammunition, and a silencer.\nThe items, thrown out of the window in three goes, made a metallic sound as they hit the ground, the court heard.\nHamlett was then pictured meeting Majeed later still carrying the bag. The four allegedly called themselves the Turnup Terror Squad\nA gun and ammunition, pictured, were thrown out of a window at a West London flat when police raided Majeed's family home\nSome time later one of the officers saw a 'large built figure' pull up the blind to the window of Majeed's bedroom and look out.\nFirearms experts examined the weapon and found it was a converted Russian-made Baikal model IZH79-8 self-loading pistol, originally designed to fire blank or tear gas cartridges.\nThe serial number had been filed down and the barrel had been replaced with a rifled barrel, which was also threaded at the muzzle end, to allow a silencer to be fitted.\nTwo of the cartridges in the magazine had been chambered in the gun to show that they could be loaded before the weapon was fired.\nWhen officers searched the flat they found an Asus laptop which had been used to access a document showing legal guidance from the Crown Prosecution Service on the criminal offences for possessing a firearm.\nHassane returned to Britain after the arrests but was allegedly determined to continue with the plot and downloaded images of the police station at Shepherd's Bush and the Parachute Regiment Territorial Army barracks in White City.\nBrian Altman QC has told the jury that 'with their arrests, the police successfully disrupted a plot to kill a police officer, a solider or possibly even a civilian, in one or more terrorist attacks which, if the plot had been allowed to run its course, would have resulted in a terrorist murder or murders on the streets of London according to the warped ideology of the defendants, in the cause, and for the sake of Allah.'\nHassane, Majeed, Hamlett, Cuffy deny conspiracy to murder and preparing acts of terrorism.","url":"https://www.dailymail.co.uk/news/article-3421628/Medical-student-accused-ISIS-inspired-drive-shooting-posed-gun-Osama-bin-Laden-book-plotted.html"}
