{"authors":["Hannah Moore For Daily Mail Australia"],"date_download":"2018-10-22 23:59:23","date_modify":"2018-10-22 23:59:23","date_publish":"2017-03-16 08:29:14","description":"Adelaide mother-of-three and body positive ambassador Taryn Brumfitt has spoken about her journey to self acceptance, explaining it was a choice, not something that happened overnight.","filename":"data/vaneerConsumption/TarynBrumfitttalksaboutherjourneytoselfacceptance.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E5295CA00000578-0-image-a-12_1489652900803.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318854_Taryn-Brumfitt-talks-journey-self-acceptance_1540252763.html","title":"Taryn Brumfitt talks about her journey to self-acceptance","title_page":"Taryn Brumfitt talks about her journey to self-acceptance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian mother-of-three Taryn Brumfitt is known for her strong stance when it comes to loving your body as it is.\nShe encourages women to embrace their lives and bodies, move past their fears in the expectation they will be happier.\nMs Brumfitt says it's starting to appear that more and more people are beginning to agree, with the Adelaide woman telling the Sydney Morning Herald that more women had begun to rally against the 'toxic ideal' of a perfect figure.\nTaryn Brumfitt is known for her strong stance when it comes to loving your body as it is but says it didn't overnight\n'We receive hundreds and hundreds of messages every single week at the Body Image Movement from people who used to hate their bodies and lives and have now decided to embrace their bodies and lives,' she said.\nThe motivational speaker says these stories are right at the core of what she hopes to achieve with the movement - help women move past their body image issues and focus on leading great, full lives.\n'We have a choice – we can choose to spend our life at war with our body and having a battle or we can choose to embrace it and have a rich and abundant and fulfilling life when we do,' she says.\nThe 38-year-old shot to fame after posting a before and after picture of herself, with the after picture being her post-baby body, markedly softer than her chiseled bodybuilder frame\nMs Brumfitt, 38, became an Internet sensation in 2014, when she posted a muscle-bound 'before' and more curvaceous 'after' photos on Facebook.\nIn the caption, she told the world: 'Having the perfect body isn't all it's cracked up to be'.\nHer post was viewed over 3.6 million times and shared by nearly 20,000 Facebook users in two weeks, sparking an international conversation about body image.\n'It's not like it happened overnight, where I woke up and loved my body,' she explained.\n'But I flicked the switch and that's what everyone has access to, everyone can make the choice and that's what I did and then it grew – it's like a muscle that grows and it takes effort but it's so very worth it.'\nMs Brrumfitt has made an international success of herself through disrespecting what she calls 'toxic' body ideals and embracing her life\nIn the five years since, Ms Brumfitt has enjoyed a plethora of celebrity support. She has also started conversations about body image around the globe.\nShe runs the Body Image Movement and has published a book called Embrace, which helps women who are struggling with their body image.\nThe book was later turned into a documentary, and she has taken the concept on a speaking tour around the world.","url":"https://www.dailymail.co.uk/femail/article-4318854/Taryn-Brumfitt-talks-journey-self-acceptance.html"}
