{"authors":["Rosie Narasaki"],"date_download":"2018-10-30 22:52:50","date_modify":"2018-10-30 22:52:50","date_publish":"2014-08-14 17:00:02","description":"Tavi Gevinson recently covered NYMag, and, despite it being the fashion issue, this time it wasn't about clothes. The recent high school grad was promoting her Broadway-bound production of This Is Our Youth (she stars alongside Scott Pilgrim and…","filename":"data/vaneerConsumption/TaviGevinsonCoversNewYorkMagazineWithBrilliantBlueEyeShadowHeresHowToRecreateHer60sInspiredLook.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a9f2e48d-b7b0-452e-a1d9-1f4ad40db59b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35654-tavi-gevinson-covers-new-york-magazine-with-brilliant-blue-eye-shadow-heres-how-to-recreate_1540939970.html","title":"Tavi Gevinson Covers 'New York Magazine' With Brilliant Blue Eye Shadow - Here's How To Recreate Her '60s-Inspired Look","title_page":"Tavi Gevinson Covers 'New York Magazine' With Brilliant Blue Eye Shadow — Here's How To Recreate Her '60s-Inspired Look","title_rss":"NULL","source_domain":"bustle.com","text":"Tavi Gevinson recently covered NYMag, and, despite it being the fashion issue, this time it wasn't about clothes. The recent high school grad was promoting her Broadway-bound production of This Is Our Youth (she stars alongside Scott Pilgrim and Wallace Wells — I mean, Michael Cera and Kieran Culkin), which is currently showing at Steppenwolf. Give me a brief second to fangirl, because the Kenneth Lonergan-penned play is one of my favorites, ever. Like, it might only be second to Twelfth Night in my book (or maybe Death of a Salesman).\nBut we're not here to talk theatre today, no matter how long I could wax poetic on This Is Our Youth. We're here to talk beauty. Specifically, Tavi's amazing cover look — somehow it manages to be fetchingly retro in both a '60s and Victorian way, it's soft and understated enough for daytime wear, it features a take on blue eyeshadow that doesn't look like it needs to be exorcized back to the '80s, and it's just goshdarn pretty. In other words? It's an all-around win.\n1. Start with the basics\nYou know, foundation, blush, browliner, etc:\nFor foundation, I'd go for light coverage, if you're able, since Tavi is so young and dewy (I used Bourjois Healthy Mix Serum Foundation).\nI tried to make my eyebrows a little skinnier to mirror Tavi's expertly groomed/impressively arched brows, but they were too straight and caterpillar-y for it to have any real effect. If you're a little more blessed in the eyebrow department, make sure to emphasize your arch, and lengthen a little to get her look.\nFor blush, I used a plummy color, because it felt fittingly retro to me (it was TheBalm in Cabana Boy).\n2. Go blue\nStart with your blue eyeshadow of choice! Gevinson's is quite pale (yet vibrant), a tad sheer, and matte. I had to improvise a bit — I mixed a cornflower blue Urban Decay shade (Peace) with a matte white NYX shadow to tone it down a bit, and give it that soft look Gevinson's rocking.\nAnd don't worry too much about getting it perfect: If you'll notice, hers has a rather artfully undone look to it, so it's okay if your application isn't the most precise.\n3. Add some liner (and mascara!)\nI added a subtle cat-eye — and if you're more skilled with a brush than me, you might want to do an even thinner one.\nWhen it comes to the mascara, try for a lengthening formula. I made the mistake of using a volumnizing one, so I don't have the feathery, almost spidery lashes that Tavi's sporting. Oh, and go for the bottom lashes too, if you have them (I don't).\n4. Line your lower lashes, too\nGo for a delicate line in a dark brown, going a little thicker at the outer corners for some added impact. I used MAC Eye Kohl in Teddy, which was well up to the task of creating a subtle/old fashioned/romantic/doe-eyed look!\n5. Finish off with lipstick\nI had a bit of a problem with the lipstick, because, well... my lips are not pink like Ms. Gevinson's here. They are purple, and as such, no matter how hard I tried, I could not get the lovely pinky-berry color she has going on. Seriously, all the king's horses and all the king's men... I tried about a dozen shades, mixed colors, even tried masking my own lip color with concealer.\nAfter some serious lip alchemy, the closest I could get was with Revlon Glossy Balm Stain in Whimsical, which I proceeded to sheer out with a lip brush for a more faded look. The lesson here? Don't stress about exactly copying your favorite celeb's makeup routine. Instead, adapt the look to suit your own skintone.\nAnd that's about it! It's a classic, easy-to-wear look, and the blue gives it a nice twist.\nOh, and here's my best attempt at Tavi's doe-eyed pouty look:\n... I think I should keep my day job.\nImages: NYMag, Rosie Narasaki (5)","url":"https://www.bustle.com/articles/35654-tavi-gevinson-covers-new-york-magazine-with-brilliant-blue-eye-shadow-heres-how-to-recreate"}
