{"authors":["Simon Black","Sovereign Man"],"date_download":"2018-10-30 23:39:38","date_modify":"2018-10-30 23:39:38","date_publish":"2018-07-18 00:00:00","description":"The IRS said this month that they sent at least 362,000 names to the State Department to start denying or revoking passports. The FAST Act allows the IRS to deny or revoke passports of people who owe enough in taxes, or more than $51,000.","filename":"data/vaneerConsumption/TaxesIRStodenypassportrenewaltosomeAmericanswhoowetaxes.json","image_url":"https://amp.businessinsider.com/images/5b4f8b33f47d34ac148b45d8-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_taxes-irs-to-deny-passport-renewal-to-some-americans-who-owe-taxes-2018-7_1540942778.html","title":"Taxes: IRS to deny passport renewal to some Americans who owe taxes","title_page":"    Taxes: IRS to deny passport renewal to some Americans who owe taxes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Internal Revenue Service Acting Commissioner David Kautter gathers his papers as he prepares to testify before the Senate Finance Committee on Capitol Hill in Washington, Wednesday, Feb. 14, 2018, on President Donald Trump's fiscal year 2019 budget proposal. AP/Susan Walsh\nAbout two and a half years ago, I told you about a particularly nasty piece of legislation that President Obama quietly signed into law towards the end of his administration.\nThey called it the \"FAST Act\", which stood for Fixing America's Surface Transportation.\nYet despite $300 billion earmarked for infrastructure repairs, they didn't manage to fix very much of America's surface transportation.\nThe legislation did, however, have two major effects:\n1) The FAST Act authorized the US government to plunder excess capital from the Federal Reserve… which is about as stupid as thing as anyone could possibly do.\nThe Federal Reserve is America's central bank; they control the value and fate of the US dollar… which is still the most dominant currency in the world.\nYou'd think that having some excess cash on the Federal Reserve's balance sheet would be viewed as wise and conservative.\nBut not Congress.\nThese guys are so broke, they'll grab every penny they can get. Even from their own central bank.\nSo they buried a provision into the FAST Act demanding that the Federal Reserve hand over any excess capital to the Treasury Department at the end of every calendar year.\nThey started doing that almost immediately, in December 2015. And in 2016. And in 2017.\nThis is one of the reasons why, to this day, the Federal Reserve is borderline insolvent… which hardly inspires confidence.\nNow, I could go on for quite some time about what an idiotic idea this was.\nBut believe it or not, there was an even worse section of the FAST Act- one they only started implementing recently:\n2) Section 32101 of the FAST Act required the US State Department to revoke or deny the passport of any taxpayer that the IRS deems to have \"seriously delinquent tax debt.\"\nThey define seriously delinquent tax debt as owing $50,000 or more.\nWell, it took them a couple of years, but the IRS has finally started enforcing this law.\nEarlier this month the IRS acknowledged that they had sent at least 362,000 names to the State Department to start revoking or denying passports.\nAnd that's just the beginning.\nThe IRS is sending these names out 'in batches', so there will be many more to follow. They hope to be finished by the end of the year.\nNow, there are so many things wrong with this.\nFor starters, it's pretty clear there's no due process here. It's purely an administrative matter. Which means there's limited oversight.\nYour name could accidentally end up on some list because the IRS couldn't keep its own records straight. Or there was a problem with the data integrity. Or someone simply mismatched one John Smith for another.\nThe IRS literally has billions of records being managed by antiquated technology that's prone to data breaches.\nThe idea that they could come up with a list of hundreds of thousands of people without making a single mistake is just farcical.\nBut, again, there are few real checks and balances. You end up on a list… at which point you're arguing with an entirely different agency about why your passport has been revoked. It's a bureaucratic nightmare.\nThe larger point, though, is what this really means about citizenship.\nThink about it- a passport is the most common document to evidence an individual's citizenship.\nAnd… poof… they can take it away from you with the click of a button.\nTo me, if they can take something away so easily, then it wasn't really yours to begin with.\nIt's like property.\nIf you own your home… think again. Even if you have your mortgage fully paid off, you still have to pay property tax.\nThis means that it's ultimately the government who really owns your property. You're just renting it from them.\nAnd if they believe (in their sole discretion) that you owe them property tax, they'll take the property away from you.\nLikewise, the enforcement of the FAST Act shows that you're not even really a citizen. You're just renting your citizenship from the government.\nAnd if they believe (in their sole discretion) that you owe them income tax, they'll take it away from you.","url":"https://www.businessinsider.com/taxes-irs-to-deny-passport-renewal-to-some-americans-who-owe-taxes-2018-7"}
