{"authors":["Charlie Moore For Mailonline"],"date_download":"2018-10-23 02:29:33","date_modify":"2018-10-23 02:29:33","date_publish":"2017-03-10 11:36:11","description":"Urs Schwarzenbach, 68, denies intentionally avoiding import duty by secretly transporting art to his Swiss Dolder Grand hotel on his private jet. Officials launched an investigation in 2012.","filename":"data/vaneerConsumption/Taxmanseizes40martcollectionfromUrsSchwarzenbach.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22BC8A00000578-0-image-a-80_1489147963067.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300926_Taxman-seizes-40million-art-collection-billionaire_1540261773.html","title":"Taxman seizes £40m art collection from Urs Schwarzenbach","title_page":"Taxman seizes £40m art collection from Urs Schwarzenbach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 30 works of art have been seized from a billionaire financier and friend of Prince Charles accused of tax avoidance.\nUrs Schwarzenbach, 68, denies intentionally avoiding import duty by secretly transporting art to his Swiss hotel on his private jet.\nTaxmen raided his lavish five-star Dolder Grand Hotel in Zurich after he failed to pay fines claiming he is 'asset rich but cash poor'.\nClose friends: Urs Schwarzenbach with team-mate Prince Charles at Polo At Cirencester Park In Gloucestershire in 2000\nUrs Schwarzenbach with wife Francesca, a former Miss Australia, at the Cartier Queen's Cup Final 2016 held at Guards Polo Club\nThe hotel boasts 150 works including Joan Miró's Personage II, Andy Warhol's Big Retrospective Painting and pieces by Jean Dubuffet and Niki de Saint Phalle.\nAmong those seized was Woman With Fruit by Colombian sculptor Fernando Botero.\nSwiss officials, who launched an investigation in 2012, last year demanded duties and fines totalling £9.8 million but the tycoon, said to be worth £1billion, has failed to pay.\nSchwarzenbach told newspaper Blick: 'It is always said that he who has one billion according to the balance sheet can pay 12 million from the purse.\n'I am asset rich and cash poor. Owning a lot of wealth does not automatically mean that you have a lot of money flowing. Not even 12 million.'\nPieces have been taken from the lavish five-star Dolder Grand hotel in Zurich after Swiss officials launched an investigation in 2012\nShowpiece: Among the works of art at the hotel is Andy Warhole's Big Retrospective Painting\nThe restaurant at The Dolder Grand Hotel from where some works of art have been taken\nAsked how much he was worth, he replied 'no idea'.\nSchwarzenbach's lawyers said it was an 'overreaction' for tax authorities to raid the hotel and take 'the most beautiful works of art' from the reception and restaurant.\nThe Britain-based currency trader owns the entire village of Hambleden in Buckinghamshire which formed the backdrop to Midsomer Murders.\nHe lives in Culham Court near Henley which he bought in 2006 for £35 million.\nFriends with Prince Charles from the polo circuit, he hosted Prince Harry on his Redbank ranch in New South Wales, Australia during the prince's gap year in 2003.\nHe has been accused of failing to properly declare at least 123 artworks to customs officials.\nThe reception of the The Dolder Grand Hotel owned by billionaire financier Urs Schwarzenbach\nSchwarzenbach lives in Culham Court near Henley which he bought in 2006 for £35 million\nAmong the works Schwarzenbach reportedly transported illegally was a Giovanni Segantini painting worth £1.2m and a Kazimir Malevich piece valued at £13.3m.\nAs a result of the probe Schwarzenbach has been ordered to repay import tax of £8.2m and awarded a further fine of £3.7m.\nSchwarzenbach's lawyers say he denies any intentional wrongdoing.\nA member of staff at The Dolder Grand Hotel told MailOnline that around thirty pieces were seized from around the hotel in the raid on Tuesday.\nGap year 2003: Prince Harry rides his horse Guardsman with the team mustering herd bulls at Tooloombilla in Queensland, Australia","url":"https://www.dailymail.co.uk/news/article-4300926/Taxman-seizes-40million-art-collection-billionaire.html"}
