{"authors":["Rachel Simon"],"date_download":"2018-10-30 23:24:31","date_modify":"2018-10-30 23:24:31","date_publish":"2014-08-13 18:47:54","description":"For those hoping to see The Giver 's Taylor Swift pick up an Oscar nomination later this year for her work in the film, sorry to disappoint; while the singer surely holds her own against co-star Jeff Bridges as former Receiver Rosemary, she appears…","filename":"data/vaneerConsumption/TaylorSwiftExplainsWhySheDidTheGiverHerReasonMakesPerfectSense.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/deca9b17-55b8-4dbf-899a-09b634db5efd.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35641-taylor-swift-explains-why-she-did-the-giver-her-reason-makes-perfect-sense_1540941871.html","title":"Taylor Swift Explains Why She Did 'The Giver' & Her Reason Makes Perfect Sense","title_page":"Taylor Swift Explains Why She Did 'The Giver' & Her Reason Makes Perfect Sense","title_rss":"NULL","source_domain":"bustle.com","text":"For those hoping to see The Giver 's Taylor Swift pick up an Oscar nomination later this year for her work in the film, sorry to disappoint; while the singer surely holds her own against co-star Jeff Bridges as former Receiver Rosemary, she appears on-screen for less time than it takes to say \"we are never getting back together. Like, ever.\" Yet surprisingly, according to Swift, that's exactly why she was drawn to the role in the first place.\n\"For me, it was just an unbelievable concept that I would get to do this dream scenario where I'd get to have a very small role that has a pivotal part of the story, but isn't jumping into too deep water,\" Swift said at a Tuesday press conference for the film.\nThe singer has been a fan of Lois Lowry's novel since elementary school, and she credits reading it with changing her perspective on life.\n\"When I read it, I was in probably fifth grade, and I didn't do a lot of thinking about the distant future as far as our society goes at that point in my life,\" she said. \"And this really switched that up for me, and really blew my mind in a way that's stuck with me.\"\nSwift loved the book's themes, especially its emphasis on the importance of culture.\n\"The fact that it celebrates all the things that I hold really dear and are most important to me, like our history and our music and our art and our intellect and our memories, I think that really had a great deal to do with why I wanted to be a part of this,\" she said.\nSo when she was offered a role in the movie adaptation, saying yes was an easy choice.\n\"I just immediately thought, I'm gonna say yes to this,\" Swift said. \"If it's anything like the effect the book had on me, then I'm gonna do this.\"\nAnd it's good she did; while Rosemary has little time on-screen, the character's legacy is felt in several crucial scenes between the Giver and both Jonas and the Chief Elder, played by Brenton Thwaites and Meryl Streep, respectively. The screen-time Swift does have is eerie and moving, an effective way of showing the pressure put on Jonas and the pain still faced by the Giver for a decision Rosemary made a decade ago. As the singer (and now actress) said, it's a very small role, but it's one of the most vital parts there is in the entire movie, and while it's hard to imagine Swift putting aside music to pursue acting more seriously, it's certainly a promising start to an unexpected career.\nCheck out a clip of Swift in The Giver below:","url":"https://www.bustle.com/articles/35641-taylor-swift-explains-why-she-did-the-giver-her-reason-makes-perfect-sense"}
