{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:43:13","date_modify":"2018-10-22 23:43:13","date_publish":"2017-03-10 04:07:03","description":"Her fans are notoriously die-hard. But it seems that one Mohammed Jaffar apparently took his fandom a bit too far recently, when the 29-year-old was arrested after stalking Taylor Swift over a","filename":"data/vaneerConsumption/TaylorSwiftsstalkerarrestedinNYC.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E2011FD00000578-0-image-a-31_1489122045408.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299850_Taylor-Swift-stalker-arrested-NYC_1540251793.html","title":"Taylor Swift's stalker arrested in NYC","title_page":"Taylor Swift's stalker arrested in NYC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her fans are notoriously die-hard.\nBut it seems that one Mohammed Jaffar took his fandom a bit too far recently, when the 29-year-old was arrested after allegedly stalking Taylor Swift over a number of months in New York City.\nAccording to legal documents procured by Page Six, Mohammed started his campaign when he went to the 27-year-old pop songstress's building in December and demanded to meet her.\nScroll down for video\nBad Blood: It seems that one Mohammed Jaffar apparently took his fandom a bit too far recently, when the 29-year-old was arrested after stalking Taylor Swift over a number of months in New York City (Swift pictured in February 2016)\nAfter being turned away, he returned to the ritzy address, which is also home to the likes of Orlando Bloom and director Steven Soderbergh, four more times in the next two months, the final visit being on February 15th.\nDuring a February 6th incursion, he is said to have managed to sneak his way into the corridor outside of Taylor's unit, and also onto the roof of the building in the middle of the night.\nHe also allegedly resorted to ringing the Shake It Off singer's buzzer for an hour straight, before coming back the next day to do it again for another 45 minutes.\nAfter being turned away, he returned to the ritzy address, which is also home to the likes of Orlando Bloom and director Steven Soderbergh, four more times in the next two months, the final visit being on February 15th\nWe love you Taylor: Numerous fans are often seen waiting outside the building for the singer (above)\nCracking down: However on Friday Taylor's security team (R) were seen clamping down on the matter and asked fans to leave (above) in the interest of safety following her stalker's arrest\nWhat a snap! Her fans are notoriously die-hard, thanks to her friendly interactions (pictured October 2014)\nApparently, not satisfied with the progress he was making in-person, the suspect also contacted Swift's management via phone an astonishing 59 times between January 27th and February 16th.\nJaffar was finally arrested on March 6th for burglary and stalking, and is currently being held on $20,000 bond.\nA restraining order keeping him away from Swift was also granted.\nTrouble down South: She's had multiple stalkers, including Frank Andrew Hoover, who followed her motorcade after a November 2016 concert in Austin, Texas (pictured)\nOf course this isn't the first time the leggy singer has had to contend with an overzealous follower.\nShe's had multiple stalkers, including Frank Andrew Hoover, who followed her motorcade after a November 2016 concert in Austin, Texas.\nHe reportedly wanted to get a photo with the superstar and 'possibly accompany Taylor wherever she goes,' according to TMZ.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299850/Taylor-Swift-stalker-arrested-NYC.html"}
