{"authors":["Lia Beck"],"date_download":"2018-10-30 22:28:58","date_modify":"2018-10-30 22:28:58","date_publish":"2014-08-15 15:46:32","description":"I've seen it. You've seen it. We've all seen it. I'm talking about Taylor Swift's ridiculous award show dancing. Second only to Swift's award show surprised face in cringey-ness, Swift's award show dancing is the word \"Really?!\" personified.…","filename":"data/vaneerConsumption/TaylorSwiftsReasonforHerAwardShowDancingWillMakeYouFeelBadforMakingFunVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/dd6412ef-78cd-491c-8a2e-a08dca579f22.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35916-taylor-swifts-reason-for-her-award-show-dancing-will-make-you-feel-bad-for-making-fun_1540938538.html","title":"Taylor Swift’s Reason for Her Award Show Dancing Will Make You Feel Bad for Making Fun - VIDEO","title_page":"Taylor Swift’s Reason for Her Award Show Dancing Will Make You Feel Bad for Making Fun — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"I've seen it. You've seen it. We've all seen it. I'm talking about Taylor Swift's ridiculous award show dancing. Second only to Swift's award show surprised face in cringey-ness, Swift's award show dancing is the word \"Really?!\" personified. Really?! That's what you're doing? Really?! While most celebrities sit calmly at award shows, Swift moves and groves as if she's never heard music before — which is to say she dances both passionately and without much skill. But if you ever made fun of Swift's dancing, you are about to feel embarrassed for ever feeling embarrassed for her because Swift has a great reason for her enthusiasm.\nOn Thursday night's episode of Late Night, Swift explained her dancing to host Seth Meyers and it makes a hell of a lot of sense. Basically, other celebrities are boring fools who refuse to accept that they get to sit front-row at what amounts to an amazing concert for free. As Swift puts it,\nI used to get really nervous at awards shows because, seemingly, they're a huge pressure cooker. And everybody seems to be sitting there trying to look more unaffected by being at this award show than the next person next to them. That can have an affect on you, and so you're in the front row and you're sitting there like, 'Maybe I should sit here like this.' A couple years ago I just decided, 'No. This is the coolest concert you could ever go to. This is like all these incredible acts playing their biggest songs and I get to be front row and I'm going to dance during this 'cause I feel like it — and not 'cause it looks cool, 'cause it doesn't.'\nYouTube\nShe's totally right! Going to an award show is an amazing opportunity. The whole being-constantly-filmed-while-there thing is a little intimidating, but I truly appreciate Swift deciding to just go for it with her dancing. She's right, it's not like the other guests are sitting there dancing nicely and making her cray-cray dancing looks nuts and annoying, they aren't dancing at all. Someone needs to show these dummies that they should take full advantage of this opportunity, and Swift is that person. Her flailing arms and shimmying are simply trying to show people the way. So I say, go forth, Taylor! Show 'em whatcha got!\nImage: awkwardtaylorswiftdancing/Tumblr","url":"https://www.bustle.com/articles/35916-taylor-swifts-reason-for-her-award-show-dancing-will-make-you-feel-bad-for-making-fun"}
