{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:31:29","date_modify":"2018-10-30 22:31:29","date_publish":"2014-08-15 13:48:27","description":"Backstage on late night television is where all of the antics really happen. It's the only place — except for maybe the Hollywood DMV — where you'll have a handful of celebrities that have nothing to do with one another sitting together and waiting.…","filename":"data/vaneerConsumption/TaylorSwiftBoyGeorgeSelfieIsAmazingFeaturesLotsofEyelinerPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/586be5b4-b967-4755-9fb7-ceabb2838197.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35903-taylor-swift-boy-george-selfie-is-amazing-features-lots-of-eyeliner-photo_1540938689.html","title":"Taylor Swift & Boy George Selfie Is Amazing, Features Lots of Eyeliner - PHOTO","title_page":"Taylor Swift & Boy George Selfie Is Amazing, Features Lots of Eyeliner — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Backstage on late night television is where all of the antics really happen. It's the only place — except for maybe the Hollywood DMV — where you'll have a handful of celebrities that have nothing to do with one another sitting together and waiting. So now, behold: a selfie of Taylor Swift and Boy George, courtesy of Late Night With Seth Meyers. Seriously — this is the stuff late night TV selfie dreams are made of, and it's definitely one of the best celebrity selfies taken on television. It holds a place in the Selfie Hall of Fame next to that one Bill Murray and David Letterman took with Lady Gaga.\nI mean, check out that dueling eyeliner.\nIt goes without saying that Boy George looks like a Madden bro (is there some sort of secret celebrity gene pool?), and his face also looks a bit like the face of Sansa Stark (remember that one, Internet?). It also seems imperative to note that Boy George is also CLEARLY a T. Swift fan, but then again, who isn't? I thought for a hot second that T. Swift's music was too tween for my taste, but then I got a zit and it was like my tween years came spiraling back to me, and I got really into Red. Also, Swift is the human celebrity incarnation of an angel and yeah, she became even cooler for hanging out with Boy George. Karma chameleon, my friends!","url":"https://www.bustle.com/articles/35903-taylor-swift-boy-george-selfie-is-amazing-features-lots-of-eyeliner-photo"}
