{"authors":["Mary Kate Mcgrath"],"date_download":"2018-10-31 01:49:54","date_modify":"2018-10-31 01:49:54","date_publish":"2018-08-27 17:34:00","description":"The Reputation tour continues to bring surprises for fans. As Rolling Stone pointed out, Taylor Swift performed with Faith Hill and Tim McGraw in Nashville on Saturday, and the moment had special meaning for the star. The concert took place at the…","filename":"data/vaneerConsumption/TaylorSwiftsPerformanceWithTimMcGrawFaithHillWasSuchAFullCircleMomentVIDEOS.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/5b369c2c-d605-4cdb-8c97-e0af72d110c8-getty-956298740.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_taylor-swifts-performance-with-tim-mcgraw-faith-hill-was-such-a-full-circle-moment-videos-10246631_1540950594.html","title":"Taylor Swift's Performance With Tim McGraw & Faith Hill Was Such A Full-Circle Moment - VIDEOS","title_page":"Taylor Swift's Performance With Tim McGraw & Faith Hill Was Such A Full-Circle Moment — VIDEOS","title_rss":"NULL","source_domain":"bustle.com","text":"The Reputation tour continues to bring surprises for fans. As Rolling Stone pointed out, Taylor Swift performed with Faith Hill and Tim McGraw in Nashville on Saturday, and the moment had special meaning for the star. The concert took place at the Nissan Stadium, and the singer took the opportunity to return to her country roots. During a performance of \"Tim McGraw,\" Swift was joined on stage by Hill. The surprise got even better — the real McGraw came to the stage, and the two country icons helped sing the song's final verse and chorus.\n\"Tim McGraw\" was the debut single off Swift's first album, which was released in 2006. Hill and McGraw, who are married as well as being musical collaborators, had a major influence on the pop star's early music. It's sweet that Swift took the opportunity to honor her roots, since she moved to Nashville at 11 to begin her career. She started the song solo on the piano before her guests joined her. It's unlikely the singer could've imagined this collaboration when she penned the song as a teenager, and it shows just how far her career has come.\nOn Instagram, Swift posted pictures from the guest appearance and captioned it with a special message about growing up in the city. She wrote:\n\"Nashville, last night was the first time I got to headline that stadium. Every second of the show meant so much to me, and I’m so grateful to Tim McGraw and Faith Hill for coming out to sing ‘Tim McGraw’ with me. I first came to this city in search of a record deal when I was 11! I’m just as enamored by being here now all these years later. Thanks for an unforgettable night.\"\nJenn Gresta on YouTube\nIt wasn't the only moment from the evening where the star paid tribute to her musical roots. According to Rolling Stone, she also performed \"Better Man\" for the first time on the tour. While Swift wrote the ballad for country music group Little Big Town, playing the song was likely a nod to her early days songwriting in the country music-oriented city.\nMcGraw and Hill's meaningful appearance isn't the first surprise that Swift planned on the tour. In June, Swift surprised the crowd at Wembley Stadium in London with an appearance by Niall Horan. In early August, Swift brought Bryan Adams on stage in Toronto to sing a rendition of his 1985 hit \"Summer of '69.\"\nOver the course of the tour, other pop stars including Shawn Mendes, Troye Sivan, and Hayley Kiyoko have also made appearances. There are still a couple months and lots of dates left on the Reputation tour, with stops in the midwestern and southern U.S. continuing through August and September. Swift will then leave for dates in Australia, New Zealand, and Japan, with the international stadium tour coming to a finish in November.\nIt's difficult to predict which guests Swift will invite for future dates, but given how the rest of the tour has gone, more musical collaborations are likely in store. It's no surprise that her stop in Nashville featured a few country music legends, and fans will just have to wait to find out about the next big surprise.","url":"https://www.bustle.com/p/taylor-swifts-performance-with-tim-mcgraw-faith-hill-was-such-a-full-circle-moment-videos-10246631"}
