{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 23:44:17","date_modify":"2018-10-30 23:44:17","date_publish":"2014-08-13 14:00:03","description":"Taylor Swift sure can accessorize like nobody's bidness, and I don't mean her oft-present pearls, her signature red lips (which she ditches in favor of pink more often than you'd think), or her adorbs cats Meredith and Olivia. T. Swizzle is fond of…","filename":"data/vaneerConsumption/TaylorSwiftRocksRainbowGlassesThatAreWayCoolerThanYourAverageTortoiseshell.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2bba8495-6d66-409d-a562-ce3657c83cff.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35571-taylor-swift-rocks-rainbow-glasses-that-are-way-cooler-than-your-average-tortoiseshell_1540943057.html","title":"Taylor Swift Rocks Rainbow Glasses That Are Way Cooler Than Your Average Tortoiseshell","title_page":"Taylor Swift Rocks Rainbow Glasses That Are Way Cooler Than Your Average Tortoiseshell","title_rss":"NULL","source_domain":"bustle.com","text":"Taylor Swift sure can accessorize like nobody's bidness, and I don't mean her oft-present pearls, her signature red lips (which she ditches in favor of pink more often than you'd think), or her adorbs cats Meredith and Olivia. T. Swizzle is fond of wayfarer sunnies when she's out and about to shield herself from the glare of the paparazzi flashbulbs and that vitamin D–producing thing that the earth revolves around. But it's the singer/songwriter/model bestie's rainbow-colored reading glasses, which she wore in a new Instagram snap from Lena Dunham that I am unashamedly coveting.\nSwift, who is planning to make a big announcement, likely about the follow up to her bazillion-selling Red album, on Monday, August 18, posed for the Girls star while nuzzling with Olivia. The kitty obscures her human mom's mouth, and while I can \"ooh\" and \"aah\" all day about Liv's infinite cuteness, it's Swift's glasses that I can't stop staring at.\nRather than don a thick x nerdy x trendy black specs, like she did, along with a pair of with loud-print PJs, in her \"We Are Never Ever Getting Back Together\" video, T. Swizzle showed off her alternative to \"boring\" tortoiseshell frames with a fresh pair, of which blue and red are the dominant colors.\nWith her long, sorta sideswept bangs and shaggy layers, the glasses work with her haircut and her face. The multicolored frames also call attention to her pretty peepers, bringing out the blue.\nThough the watercolor effect pairs well with Swift's dirty blonde strands, you can wear these frames with any hair color. They probably really pop against glossy brown and black hair, too.\nWant to copy T. Swiz? Here are a few similar pairs.\nThis pair has more black in the frame and a more rectangular shape, but these glasses rule.\nThese are more stripey, bolder, and brighter, but they also come with a cool case.\nOr you can grab this red and pink pair. These are not Rainbow Brite–style, but they are unique. They have adjusted lenses so you can always pop them out and take the frames to your preferred eye professional for your own prescription, since no one ever wears reading glasses when they have 20/20 vision, riiiiight?\nImages: Giphy (1); Lena Dunham/Instagram; Amazon (2); Staples","url":"https://www.bustle.com/articles/35571-taylor-swift-rocks-rainbow-glasses-that-are-way-cooler-than-your-average-tortoiseshell"}
