{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:04:45","date_modify":"2018-10-30 23:04:45","date_publish":"2014-08-14 12:12:41","description":"Jimmy Fallon's infamous Ew! sketch has returned to The Tonight Show and the latest celebrity to become \"Sara's\" new playmate is Taylor Swift. Posing as Natalie, a new friend from out of town with a poor sense of fashion and a Band-Aid collection,…","filename":"data/vaneerConsumption/TaylorSwiftHerExBoyfriendsareNeverEverEverGettingBackTogetherinHilariousJimmyFallonSketchVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b2a63db3-a304-4912-aef7-8296e04a2100.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35732-taylor-swift-her-ex-boyfriends-are-never-ever-ever-getting-back-together-in-hilarious-jimmy-fallon_1540940685.html","title":"Taylor Swift & Her Ex-Boyfriends are Never, Ever, Ever Getting Back Together in Hilarious Jimmy Fallon Sketch - VIDEO","title_page":"Taylor Swift & Her Ex-Boyfriends are Never, Ever, Ever Getting Back Together in Hilarious Jimmy Fallon Sketch — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Jimmy Fallon's infamous Ew! sketch has returned to The Tonight Show and the latest celebrity to become \"Sara's\" new playmate is Taylor Swift. Posing as Natalie, a new friend from out of town with a poor sense of fashion and a Band-Aid collection, Swift joined Fallon's nasal-voiced Sara on the set of Ew!, everyone's favorite fictional Teen Nick show. When Swift and Fallon joined forces for Ew!, comedy and pop culture references ensued.\nThere were two parts of the sketch that particularly stood out as hilarious. First, Sara asked if Natalie liked any TV shows, loudly shouting that her favorite show was Pretty Little Liars. Unfortunately, Natalie couldn't relate because, as she quietly put it, her \"mother hasn't let her watch television since Miley Cyrus twerked.\" Considering that happened in mid-2013, that means it's been over a year since Natalie has watched any television and A has been up to a lot of trouble in Rosewood since then. Sara is particularly disappointed because she thinks Natalie would really like Pretty Little Liars.\nSecond, Sara and Natalie played an Ew! speed round in which Sara removed pictures from a bag and then asked Natalie what she thought about them. One of the pictures was Getting Back Together, to which Swift responded with a very adamant. \"Ew! Never, ever, ever, ever, ever.\" The obvious reference to Swift's hit song is just one of the many ways that Swift has shown over the years that she has absolutely no problem poking fun at herself, like when Swift called herself an expert on dramatic males during the Teen Choice Awards.\nCheck out the video below.\nThe Tonight Show Starring Jimmy Fallon on YouTube\nImage: YouTube","url":"https://www.bustle.com/articles/35732-taylor-swift-her-ex-boyfriends-are-never-ever-ever-getting-back-together-in-hilarious-jimmy-fallon"}
