{"authors":["Rachel Simon"],"date_download":"2018-10-30 23:57:27","date_modify":"2018-10-30 23:57:27","date_publish":"2014-08-12 20:37:37","description":"All of the actors at The Giver's New York press conference were all smiles Tuesday morning, but for one of them, it was probably a short-lived moment; according to star Taylor Swift, happiness is just a momentary feeling, and for most people,…","filename":"data/vaneerConsumption/TaylorSwiftsViewsonHappinessAreReallyReallyDepressing.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/11da6b68-a729-486d-946f-693bbc6ac465.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35509-taylor-swifts-views-on-happiness-are-really-really-depressing_1540943847.html","title":"Taylor Swift's Views on Happiness Are Really, Really Depressing","title_page":"Taylor Swift's Views on Happiness Are Really, Really Depressing","title_rss":"NULL","source_domain":"bustle.com","text":"All of the actors at The Giver's New York press conference were all smiles Tuesday morning, but for one of them, it was probably a short-lived moment; according to star Taylor Swift, happiness is just a momentary feeling, and for most people, herself included, achieving it only happens once in a blue moon.\n\"I’m seeing so many of my fans and these people write to me on Instagram and Twitter and letters saying that they’re having such a tough time with love because they can’t imagine that we can experience such great pain, such intense loss, such insecurity,\" Swift said. \"And the thing that I just wish that I could tell them over and over again is that we live for these fleeting moments of happiness. Happiness is not a constant. It’s something that we only experience a glimpse of every once in awhile, but it's worth it.\"\nIf the darkness of that statement seems unexpected, it was; the original question asked what about The Giver made it the right project for Swift, and she began her answer by talking about how much she loved the book and its themes. Soon, though, she delved into deeper territory with this explanation of her views on happiness, which, apparently, are that it rarely exists. And it explains a lot; Swift hasn't written four albums based on how much fun she has and how ecstatic she is when she wakes up in the morning. Clearly, this girl's had her fair share of misery.\nStill, it's a bit troubling; is Swift truly an unhappy person? She's completely right that most people's lives aren't entirely filled with joy, but the phrasing of her response makes it seem like for her, experiencing happiness is incredibly rare. And as much as I like to cry along to \"All Too Well\" on repeat, I'd hate to think that the singer so often feels the way she describes in her most heartbreaking songs.\nSwift's presence at the press conference wasn't all doom and gloom, though; she spoke about her excitement over being in such a major movie, working with Jeff Bridges, and seeing a book that she cherished in childhood make it to the big screen. Still, it's her answer on happiness that made the biggest impression, and the one that fans will continue to ponder until they can start dissecting the emotions behind her (hopefully happy) next album.","url":"https://www.bustle.com/articles/35509-taylor-swifts-views-on-happiness-are-really-really-depressing"}
