{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:28:52","date_modify":"2018-10-30 22:28:52","date_publish":"2014-08-15 16:15:16","description":"On Thursday night's edition of Late Night with Seth Meyers, the host asked Taylor Swift a major question that's been plaguing a whole bunch of T. Swift fans: How the hell does she look so perfect when she's coming from the gym, a place known for…","filename":"data/vaneerConsumption/TaylorSwiftsWorkoutRoutineProbablyLooksSomethingLikeThis.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/17eff051-568c-47ad-adda-78f40e3748ad.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35925-taylor-swifts-workout-routine-probably-looks-something-like-this_1540938532.html","title":"Taylor Swift's Workout Routine Probably Looks Something Like This","title_page":"Taylor Swift's Workout Routine Probably Looks Something Like This","title_rss":"NULL","source_domain":"bustle.com","text":"On Thursday night's edition of Late Night with Seth Meyers, the host asked Taylor Swift a major question that's been plaguing a whole bunch of T. Swift fans: How the hell does she look so perfect when she's coming from the gym, a place known for making people sweaty and smell like sneakers? Swift replied that everybody looks like that when they're coming from the gym in New York City. She also mentioned that she. . . . drumroll, please . . . brings a change of clothes. So that's the explanation for her post-gym chicness. Ya-ha.\nOK, so there are a few points worth mentioning here: Many people look schmancy when they leave the gym in NYC. Swift is right. As a New Yorker myself, I have left the gym looking like a hundred bucks (I won't say a million, 'cause there's a higher likelihood that I'm wearing an H&M dress than a piece of legit couture). But when I do change after the gym, I often have a gym bag. A heaping, ginormous gym bag that's twice the size of my body and that smells like a gym locker room plus bag freshener. Swift is usually just holding a clutch, because Swift is not like you or me or Seth Meyers, who interjected that he is always wearing a tux when he comes from the gym because he works out in a tux. Obvs.\nSo do we think Swift works out in her high heels and dresses? MAYBE. Who knows — she's already an angel among humans with her good deed doing and her generous Chipotle donations. Swift does what we plebes cannot.\nBut as a frequent gym goer and spin class enthusiast myself, I must say that I'm fairly certain one of the only gym classes that permits wearing sky-high heels is stripper pole dancing classes. Still, let's imagine what classes T. Swift might be taking at the gym if she's dressed to the nines.\nRunning In Heels\nNot only a gym class, but a lifelong lesson for women who are frequently late! Run in heels, catch the bus, and get your heart rate pumping! BYO ankle brace in case you fall.\nHeel-Lates\nPilates . . . in heels. Whatevs, you're sitting/lying down, anyway. Just take it from that corgi doing pilates above. Who cares what you're wearin' when you're workin' your core!?\nSuper Barre\nA ballet barre class in fancy clothes. If ballet and barre work is all about your core, you don't really need to wear your Athleta gear, right?\nBroadway!\nYou know how everyone in a musical is always dressed in costumes and still manage to dance up a storm and those ladies have killer calves and abs? Yeah, that — but a class.\nSweat-Free Core Stuff\nSuck in . . . suck out. For 45 mins. WORKOUT. DONE.\nHeel Chi\nTai chi . . . but in heels. Talk about learning to balance stuff.\nJust Wall Squats\nMy ass hurts just thinking about that.\nPrancercise\nIt's for everyone. And look at that cardigan.\n\"The Gym\"\nBecause what is the gym, anyway? You can \"go to the gym\" and just have a smoothie, right? And \"the gym\" can just be, like, a metaphor. . . . Yes? No?\nYou can watch Swift, The Enigma of All Things Gym Fashion, chat with Seth Meyers about her gym habits below.\nYouTube\nImages: gameraboy/Tumblr; captainanalbead/Tumblr; dysphoricsylph/Tumblr; moviegifsandquotes/Tumblr; diamnats-bruts/Tumblr; gutsanduppercuts/Tumblr; trinity-stay-fit/Tumblr; doritosmakeherdance/Tumblr; dessertsong/Tumblr","url":"https://www.bustle.com/articles/35925-taylor-swifts-workout-routine-probably-looks-something-like-this"}
