{"authors":["Kelly Mclaughlin","Kalhan Rosenblatt For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 21:16:20","date_modify":"2018-10-22 21:16:20","date_publish":"2016-01-28 07:10:38","description":"Susan Jordan, the principal of Amy Beverland Elementary School for 22 years, is being hailed a hero after she was killed when a school bus suddenly lurched forward, fatally striking her.","filename":"data/vaneerConsumption/TeacherDebbieThiedescribesthemomentprincipalsacrificedherlife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A7503200000578-0-image-a-64_1453964940601.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420444_Teacher-describes-moment-elementary-principal-sacrificed-life-push-six-ten-children-way-oncoming-bus_1540242980.html","title":"Teacher Debbie Thie describes the moment principal sacrificed her life","title_page":"Teacher Debbie Thie describes the moment principal sacrificed her life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Susan Jordan (pictured), principal of Amy Beverland Elementary School for 22 years, died saving six to ten of her students on Tuesday by pushing them out of the way of an oncoming bus\nAn Indianapolis elementary school principal sacrificed her life to save six to ten of her students by pushing them out of the way of an oncoming bus, a teacher who witnessed the incident estimated on Wednesday.\nSusan Jordan, the principal of Amy Beverland Elementary School for 22 years, is being hailed a hero after she was killed when a school bus suddenly lurched forward, fatally striking her.\nThird-grade teacher Debbie Thie said she was standing on a sidewalk outside the school on Tuesday in front of a line of buses at about 2.45pm when the incident occured.\nAs students filed out, she saw a bus, which had a driver aboard, heave forward toward the children. Two ten-year-old students were injured and Jordan was killed in what authorities believe was an accident.\n'It was as if the bus wouldn't stop,' Thie said. 'The bus came up on the curb and kept going, across the sidewalk and into the grass. Susan immediately started saving the children. She backed up toward the school trying to beat the bus. She's grabbing kids and scooting them out of the way.'\nThie said she lost sight of Jordan and didn't see her get hit. Thie said she thought Jordan pushed six to ten children out of the way but she couldn't be certain because 'it all went so quickly'.\n'There weren't as many under the bus as some of us thought we saw,' she said.\nThe female driver of that bus said 'in the instant that the accident occurred' she witnessed Jordan's heroism as the principal push several students out of the way.\nScroll down for video\nAmy Bilyeu, left, and Deanna Renbarger speak during a news conference on Wednesday following Jordan's death\nDenna Renbarger (center, with Amy Bilyeu [left] and Jamie Strebing [right]), director of early childhood education for the school district, added that Jordan 'owned that school. She loved that school with every inch of her'\nThird-grade teacher Debbie Thie said she was standing on a sidewalk outside the school on Tuesday at about 2.45pm when the incident occured. The scene of the crash can be seen above\nThie said she lost sight of Jordan and didn't see her get hit, but thought Jordan pushed six to ten children out of the way\nThe unnamed school bus driver (pictured) told firefighters that she doesn't know what caused the bus to accelerate\nTwo ten-year-old children were hospitalized with serious but non-life-threatening injuries thanks to Ms Jordan's fast action.\n'At some point, the stationary bus lurched forward and jumped the curb. The bus was not moving at the time directly before it jumped the curb,' Reith said.\nThe bus driver told firefighters she was not sure what caused the bus to accelerate.\nThe driver and 25 students on the bus were examined by emergency responders but did not require treatment.\nPolice Sgt Kendale Adams said he didn't know whether there were any other witnesses.\nHours later, after the students had gone home with parents and the staff was waiting with grief counselors and clergy, Thie said she was holding out hope that Jordan somehow survived.\n'I kept thinking, she's going to pop up here,' she said. 'She has been our rock through everything. She always made things better no matter how bad it was.'\nTwo ten-year-olds went to the hospital with serious but non-life-threatening injures due to Jordan's heroism\nThe driver and 25 students on the bus were examined by emergency responders but did not require treatment\nSchool in the district has been canceled for Wednesday but four locations were said to be open for counsling\nSeveral officials were on scene at Amy Beverland Elementary School where Jordan was killed on Tuesday\nColleagues said Jordan, who had been principal at the school, Amy Beverland Elementary, made it a point to get to know every student and bring out the best in each.\nShe 'was going to do everything in her power to make sure that any child that attended that school is going to be successful,' Amy Bilyeu, president of the school's parent-faculty organization, said during a news conference.\nDenna Renbarger, director of early childhood education for the school district, added that Jordan 'owned that school. She loved that school with every inch of her'.\nJordan was loved by her staff and the school community, Lawrence Township Schools Superintendent Shawn Smith said at a news conference.\n'This is a great example of an educational leader in our state and our city,' Smith said. 'Just a phenomenal individual that truly cared about children.\n'This is a tragic situation that we have. This loss is going to ripple across our district of 15,000 students.'\nThe female driver of that bus said 'in the instant that the accident occurred' she witnessed Jordan's heroism as the principal push several students out of the way\nChildren are picked up by their parents after the bus accident that killed principal Jordan. Two students (not pictured) suffered non-life-threatening injuries in the incident\nLawrence Township school district officials canceled classes at all of the district's schools on Wednesday, but some students chose to go to the elementary school to make banners and write messages to remember their principal.\nFour facilities, including a transportation center, were kept open to provide emotional support to staff and families.\nPolice said an initial investigation found no mechanical problems on the bus. The investigation is ongoing, but authorities are 'going off the premise this was a tragic and unfortunate accident,' Adams said.\nThe bus driver, whose name has not been released, showed no visible signs of impairment, Adams said. She was given a blood test, which is standard procedure in collisions involving fatalities, but results from the toxicology test aren't expected for weeks, Adams said.\nSchool officials said the bus driver has no history of moving violations or discipline issues, and described her as a model employee. They wouldn't say how long she has been driving for the district.\nGov Mike Pence ordered flags to be flown at half-staff in Marion County on Saturday, the day of Jordan's funeral.\nOfficers from the Indianapolis area secured the site where Susan Jordan was killed after saving students\nJordan had been the principal of Amy Beverland Elementary School in Indianaplis for 22 years","url":"https://www.dailymail.co.uk/news/article-3420444/Teacher-describes-moment-elementary-principal-sacrificed-life-push-six-ten-children-way-oncoming-bus.html"}
