{"authors":["Press Association"],"date_download":"2018-10-22 21:38:28","date_modify":"2018-10-22 21:38:28","date_publish":"2016-01-29 07:41:45","description":"Teachers are facing physical violence in the classroom, with pupils kicking, punching, spitting and even using weapons in school, according to a survey. It s...","filename":"data/vaneerConsumption/Teachersfacingviolenceandabuseintheclassroom.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-40ed1cae-f1ff-412f-b8aa-ec5e4609ab2f-3bmscybNe842cce83474b5218f17-975_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421980_Teachers-facing-violence-abuse-classroom_1540244308.html","title":"Teachers 'facing violence and abuse in the classroom'","title_page":"Teachers 'facing violence and abuse in the classroom' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Teachers 'facing violence and abuse in the classroom'\nTeachers are facing physical violence in the classroom, with pupils kicking, punching, spitting and even using weapons in school, according to a survey.\nIt suggests that more than two-fifths (42.8%) of education workers have had to deal with violent pupils in the last year - while others have faced insults, threats, bullying and harassment.\nMany school staff blame a lack of boundaries at home for poor conduct in lessons, the Association of Teachers and Lecturers (ATL) poll found, while others suggested that a growing lack of respect in society for people in professional jobs was partly responsible.\nMany teachers have reported encountering disruptive behaviour\nOne special needs worker at a Bedfordshire primary school said she had been stabbed in the head with a pencil, while a teacher at a Suffolk secondary academy said they had been \"sprayed in the face with deodorant\". In a third case, a support worker at a secondary school in Cheshire said a chair had been thrown that hit her leg.\nA teaching assistant at a Rochdale primary school claimed: \"Staff are regularly verbally abused with very little consequences. Occasionally pupils physically attack members of staff, but this rarely leaders to a day's exclusion.\"\nThe survey, which questioned 1,250 education staff at UK state schools last autumn, found that nearly half (45.5%) think that pupils' behaviour has worsened in the past two years.\nOf those who said they had faced physical violence, more than three-quarters (76.5%) said they had experienced pushing and shoving, 37.4% had dealt with punching, 52.4% had faced kicking, 24.1% had dealt with spitting and 2.2% said that pupils had used a weapon, such as a knife.\nAround 89.1% of teachers and 90.1% of support workers said they had had to deal with challenging or disruptive behaviour from pupils in the last year. The most common type was verbal abuse - such as insults, threats, swearing, shouting, making accusations and being rude.\nJust over half (52.3%) said they had dealt with bullying - such as pupils isolating a classmate from a friendship group or spreading rumours, while a further 24.2% reported dealing with cyber-bullying and 15.1% had seen homophobic or transphobic bullying.\nNearly one in four (24.3%) had seen sexual or racial harassment by pupils.\nGiven a list of reasons for bad behaviour, 84.5% of those polled agreed that lack of boundaries at home were to blame. Many suggested that emotional or behavioural problems were responsible, while school staff also thought that relationship breakdown within a family and a lack of positive role models at home were key reasons for poor conduct.\nIn addition, nearly two-thirds (64.4%) thought that society becoming less respectful to people on front-line jobs was a reason for negative behaviour.\nATL general secretary Dr Mary Bousted said: \"Although the majority of pupils are well-behaved and a pleasure to teach, having to deal with challenging or disruptive behaviour is unfortunately par for the course for education staff.\n\"It is shocking that more than four in 10 (43%) education professionals have had to deal with physical violence from a pupil in the last year. No member of staff should be subjected to aggressive behaviour, in any form, while doing their job.\"\nA Department for Education spokesman said: \"Teachers and school staff have a right to feel safe while doing their jobs and violence towards them is completely unacceptable.\n\"We have taken decisive action to put teachers back in charge of the classroom by giving them the powers they need to tackle poor behaviour and discipline.\n\"We have scrapped 'no touch' rules that stopped teachers removing disruptive pupils from classrooms, and ensured schools' decisions on exclusions can no longer be overruled.\"\nKaren Leonard, GMB national lead officer for school support staff, said: \"GMB is committed to raising awareness of this issue.\n\"It is unacceptable to be kicked, punched, spat on or to have school equipment and even furniture thrown at them.\n\"We have recently launched a national campaign to highlight the problem.","url":"https://www.dailymail.co.uk/wires/pa/article-3421980/Teachers-facing-violence-abuse-classroom.html"}
