{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-22 22:18:29","date_modify":"2018-10-22 22:18:29","date_publish":"2016-01-28 10:15:00","description":"Former IT teacher at Coatbridge High School in North Lanarkshire, Stephen Lawrie, 56, has been banned from teaching after accessing explicit material which was seen by pupils.","filename":"data/vaneerConsumption/TeacherStephenLawriebannedfromschoolaftershowingporntoclass.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A82F3600000578-0-image-a-6_1453976420071.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420568_IT-teacher-banned-classrooms-accidentally-showing-porn-13-year-olds_1540246709.html","title":"Teacher Stephen Lawrie 'banned from school' after showing porn to class","title_page":"Teacher Stephen Lawrie 'banned from school' after showing porn to class | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former IT teacher has been banned from the profession after he accidentally broadcast explicit material to a class of teenage students.\nStephen Lawrie, 56, accessed an x-rated website on his computer while teaching - and the material on his monitor ended up on the interactive smartboard at the front of the class.\nFollowing an investigation, North Lanarkshire Council sacked Lawrie from his post in August 2015, and he was banned from the profession by the General Teaching Council in Edinburgh.\nStephen Lawrie (pictured) accessed an x-rated website on his computer while teaching - and the material on his monitor was projected on to the screen at the front of the class\nThe incident happened at Coatbridge High School, in North Lanarkshire, on April 27 last year.\nIt is understood the school received a complaints from a number of pupils, before Lawrie was suspended.\nAn investigation was carried out and four months later the IT teacher was sacked from his post.\nWhile the former teacher did not make an appearance at the hearing in Edinburgh, he confirmed approval for his removal in writing.\nHe said: 'I waive my right to have a full hearing and admit the following allegations made against me relating to my fitness to teach in full.\n'I freely and willingly consent to being removed from GTCS Register of Teachers in view of my admission of the allegations set out above and understand that I will be prohibited from applying for restoration to that register for a period of two years.'\nNorth Lanarkshire Council said it launched a four-month investigation following the incident, before terminating Mr Lawrie's contract in August 2015.\nA spokesman for the council added: 'Mr Stephen Lawrie was suspended from his post following allegations of inappropriate conduct.\n'A formal investigation was carried out, resulting in the termination of his contract and the council notifying the General Teaching Council.\n'Mr Lawrie left his employment on 13 August 2015.'\nThe allegations against Mr Lawrie stated: 'On 27 April 2015, whilst employed as a teacher by North Lanarkshire Council at Coatbridge High School, you did access an inappropriate pornographic website whilst teaching an S2 class and did cause the contents of the website to be projected onto the classroom smartboard and viewed by the class.'\nNorth Lanarkshire Council said it launched a four-month investigation following the incident, before terminating Mr Lawrie's contract at Coatbridge High School (pictured)\nAs a result of his admission and subsequent removal from the register, Mr Lawrie will be unable to apply for re-registration for two years.\nIf he does so, he will only be considered if he is accepted by a fitness to teach panel.\nThe GTCS have also referred Mr Lawrie under section eight of the Protection of Vulnerable Groups (Scotland) Act 2007.\nThis means that Scottish ministers must decide whether Mr Lawrie should be barred from working with children or protected adults in light of his conduct.\nOn the website Rate my Teacher, Lawrie received high ratings from pupils. One student described Lawrie as a 'nice friendly guy'.\nWriting in 2007, the pupil said: 'Nice friendly guy, just remember to square up your monitor.'\nAccording to its website, Coatbridge High School is a non-denominational co-educational comprehensive school.\nWith more than 1,000 students, the school serves the town of Coatbridge and surrounding areas.","url":"https://www.dailymail.co.uk/news/article-3420568/IT-teacher-banned-classrooms-accidentally-showing-porn-13-year-olds.html"}
