{"authors":[],"date_download":"2018-10-30 20:13:37","date_modify":"2018-10-30 20:13:37","date_publish":"2017-03-01 01:59:00","description":"A DeKalb County teacher was placed on administrative leave following claims from a female student that he touched her breast and made racial comments.","filename":"data/vaneerConsumption/Teacherallegedlymaderacialremarksinappropriatelytouchedstudent.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/17/Images/CRIME%20SCENE%20TAPE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_teacher-_d2acec436c714b8d4ae790547224d472__1540930417.html","title":"Teacher allegedly made racial remarks, inappropriately touched student","title_page":"Teacher allegedly made racial remarks, inappropriately touched student","title_rss":"NULL","source_domain":"ajc.com","text":"A DeKalb County high school teacher was placed on administrative leave following claims from a female student that he touched her breast and made racial comments toward her.\nThe parent of the 15-year-old girl told Channel 2 Action News that the Tucker High School teacher tried to intimidate the student when he said: “Hey little Mexican girl,” while touching her breasts, and “You are all the same thing. You are all immigrants.”\n“My child may not be the only child affected by this,” Nuvia Villeda said. “There could be other children.”\nIn a statement, DeKalb County Schools spokesman Quinn Hudson said the teacher was placed on administrative leave pending the outcome of an investigation.\n“We take seriously any allegations of staff misconduct and, as we have done in the past, we will investigate and respond appropriately after the facts are known,” Hudson said.\nThe teacher allegedly made the remarks when the teen was pulled for Individualized Education Program testing, Channel 2 reported. According to the school district’s website, IEP testing is done when students need learning accommodations at school. The girl suffers from epilepsy and takes medication for seizures, the accuser’s mother said through a translator.","url":"https://www.ajc.com/news/breaking-news/teacher-allegedly-made-racial-remarks-while-touching-student-inappropriately/SV66nuhpNLyugDF2RWyCiJ/"}
