{"authors":[],"date_download":"2018-10-30 01:25:29","date_modify":"2018-10-30 01:25:29","date_publish":"2015-07-07 08:00:00","description":null,"filename":"data/vaneerConsumption/TeacherTestingDoesNotEqualTeacherQuality.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/07/Mrs._Mary_Spangler2C_Woodrow_Wilson_High_School_teacher_8d41113v.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862729.html","title":"Teacher Testing Does Not Equal Teacher Quality","title_page":"Teacher Testing Does Not Equal Teacher QualityThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As high-stakes testing grows in K-12 education, it is no surprise the testing for teacher certifications is also becoming more high-stakes. The problem is, teacher testing is not a good indicator of teacher quality. An MIT study found “state mandated teacher testing is associated with increases in teacher wages, though we find no evidence of a corresponding increase in quality.”\nOne likely reason for this disconnect is simply poor choice of tests. This was evidenced in 2012 and again on Friday, June 4, when Federal Judge Kimba Wood, having found severe racial disparities in teacher test scores, ruled on the results of her directive that the state show how its teacher qualification tests, created by National Evaluation Systems (NES), matched the characteristics of successful teachers. It was unable to do so. “Instead of beginning with ascertaining the job tasks of New York teachers, the two LAST examinations began with the premise that all New York teachers should be required to demonstrate an understanding of the liberal arts,” Judge Wood wrote.\nScholarly studies have found differences among four factors that influence teacher quality: subject-matter knowledge, academic ability, experience, and professional certification and training. Teacher experience is the least predictive of the four factors, and certifications have mixed effectiveness results and vary greatly because each state has its own requirements.\nTeachers with higher academic ability, by contrast, show consistently higher student achievement. The measurements used to assess a teacher’s academic ability were their ACT or SAT scores, the rigor of the college they attended, and their grade point average (GPA).\nSimilarly, study after study confirms subject matter knowledge as an effective indicator of teacher quality. These studies show the greater the teacher’s knowledge of the course subject matter, the more effective the teacher.\nThese factors suggest a reliable strategy for improving teacher quality, and it doesn’t involve teacher tests. One is reform of teacher education training, and the other is recruitment of individuals with real mastery of subject matter.\nMy niece is an educator. When she was attending college she would relate how unprepared were the prospective math teachers in her classes. Many of the students—she estimated it was more than 50 percent—were unable to understand basic math principles, yet they were training to be math teachers. This is just one story, of course, and should not be taken as a generalization, but it exemplifies the problems afflicting teacher training today.\nSimply put, education training schools have to become more rigorous. This will necessarily involve setting higher standards for applicants and implementing more rigorous studies in the teacher training process. Students should not be allowed to graduate from a teacher college and receive a teaching certificate without a record of strong academic achievement.\nIn addition, schools and districts should make a concerted effort to attract subject-matter experts by aggressively recruiting them and providing alternative certifications that allow these experts to teach without having to sit through a four-year teacher education program. Scholars are just beginning to study the effects of such efforts, but so far they’ve shown improvement in educational outcomes.\nAlternative certification can also help schools increase the number of minority teachers entering the profession by recruiting individuals with the necessary subject-matter knowledge to fill specific classroom needs.\nStudies consistently show teachers’ educational achievements and subject matter knowledge are the most important factors in teacher quality. Schools and districts should start to focus on the real goals and not use testing as a crutch.","url":"https://spectator.org/63368_teacher-testing-does-not-equal-teacher-quality/"}
