{"authors":[],"date_download":"2018-10-22 21:42:29","date_modify":"2018-10-22 21:42:29","date_publish":"2014-06-06 07:18:05","description":"One of the students, Angelique Correa Henderson, said she felt \"pressured and scared\" as the teacher taped her mouth.","filename":"data/vaneerConsumption/TeacherTapesStudentsMouthsShutDuringQuietGame.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/491356/140605-teacher-duct-tape-2246_e4fa4cda172f192e2327cc35001f939b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_teacher-tapes-students-mouths-shut-during-quiet-game-n124236_1540244549.html","title":"Teacher Tapes Students' Mouths Shut During 'Quiet Game'","title_page":"Teacher Tapes Students' Mouths Shut During 'Quiet Game'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFROM NBC NEW YORK\nA substitute teacher in New Jersey won't be allowed to fill in again at an elementary school after she allegedly taped shut the mouths of several students last week, officials say.\nThe teacher was working at the Winfield Scott Elementary School in Elizabeth and placed decorative tape over the mouths of five students during a \"quiet game\" after lunch, according to parents and officials.\nOne of the students, Angelique Correa Henderson, said she felt \"pressured and scared\" as the teacher taped her mouth \"because we were jabbering too much.\"\n\"My heart kept on beating fast,\" she said.\nAngelique's father, Munford Henderson, is outraged.\n\"I don't understand what she was thinking,\" he said. \"We're talking about kids. You're sworn to protect and teach, not to hurt them and put them in fear.\"\nOther parents at the school were equally concerned.\n\"You don't do that to anybody, especially kids,\" said Marie Yacinthe. \"You don't do that.\"\nAs police and state officials investigate, Angelique's father wants to make sure the teacher is permanently barred from the classroom.\n\"She does not need to be teaching and being around kids if she can't control her emotions and the way she presents herself around kids,\" he said.\nThe teacher has been taken off the list of substitutes for consideration at the school, officials said. She had no previous record of issues or difficulties.","url":"https://www.nbcnews.com/news/us-news/teacher-tapes-students-mouths-shut-during-quiet-game-n124236"}
