{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 02:54:13","date_modify":"2018-10-23 02:54:13","date_publish":"2017-03-10 12:13:30","description":"Robert Roskelly also held topless fitness training sessions with his pupils at Winstanley Community College (pictured) in Braunstone, Leics, before he was prohibited from teaching indefinitely.","filename":"data/vaneerConsumption/TeacherwhotookMeowMeowwithapupilisstruckoff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22B7BD00000578-0-image-a-10_1489147892333.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300894_Teacher-took-Meow-Meow-pupil-struck-off_1540263253.html","title":"Teacher who took ‘Meow Meow’ with a pupil is struck off","title_page":"Teacher who took ‘Meow Meow’ with a pupil is struck off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A science teacher who took ‘Meow Meow’ with a pupil and hosted sleepovers at his home has been struck off.\nRobert Roskelly, 33, also held topless fitness training sessions with his pupils at Winstanley Community College in Braunstone, Leicestershire.\nHe befriended them on Facebook despite being warned not to and ended up resigning in 2014, prompting an investigation into his relationship with students.\nRoskelly admitted to taking the now banned drug Mephedrone with a 15-year-old pupil, and using Viagra.\nRobert Roskelly, 33, held topless fitness training sessions with his pupils at Winstanley Community College (pictured) in Braunstone, Leicestershire\nMephedrone, also known as 'Meow Meow', was banned in 2010 after it was linked to several sudden deaths across the country.\nIts side effects can cause agitation, hallucinations and even fits.\nHe forked out £100 to the kids on different occasions to go to the cinema and buy legal highs.\nRoskelly also held fitness classes during the summer holiday on school grounds and had pupils to stay the night at his home.\nOn other occasions he would crash at their houses when the parents were away.\nHe was once seen by a student in a room while another pupil was stripped down to their underpants.\n‘He states that he became involved with a group of people which led to him becoming involved in taking legal highs and this led to, \"poor decisions\" and \"poor choices\" relating to drug use,’ said panel chair Kathy Thompson.\n‘He was aged under 30 at the time and his representative submitted that his actions were immature and he did not realise the significance of them at the time.’\n‘He further states that he will have to live with the fact that, “having been able to make a difference in the lives of young people and been an excellent role model prior to this, both in and out of school, he will not have the opportunity to do so in the future which is something [he finds] deeply disappointing”.’\nThe panel concluded that Roskelly had to be prohibited from teaching indefinitely with no eligibility for restoration.\n‘The panel is of the view that prohibition is both proportionate and appropriate.’\n‘His breaching of direct management instructions to continue being friends with pupils and ex-pupils on Facebook, and undertaking drug taking activities with pupils was a significant factor in forming that opinion.\n‘Accordingly, the panel makes a recommendation to the Secretary of State that a prohibition order should be imposed with immediate effect.’\nRoskelly, was prohibited from teaching indefinitely and cannot teach in any school, sixth form college, relevant youth accommodation or children’s home in England.\nHe has 28 days to appeal the decision.","url":"https://www.dailymail.co.uk/news/article-4300894/Teacher-took-Meow-Meow-pupil-struck-off.html"}
