{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:21:20","date_modify":"2018-10-30 21:21:20","date_publish":"2016-02-25 21:37:24","description":"As Donald Trump dominates in early states, Sen. Marco Rubio’s campaign is reassuring donors, providing a power point presentation that includes a path to victory through a brokered convention. |","filename":"data/vaneerConsumption/TeamRubioPowerPointIllustratesPathToBrokeredConvention.json","image_url":"https://media.breitbart.com/media/2016/02/Rubio-roadmap-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_25__1540934480.html","title":"Team Rubio Power Point Illustrates Path To Brokered Convention","title_page":"Team Rubio Power Point Illustrates Path To Brokered Convention | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As Donald Trump dominates in early states, Sen. Marco Rubio’s campaign is reassuring donors, providing a power point presentation that includes a path to victory through a brokered convention.\nAccording to CNN’s MJ Lee, Rubio’s campaign manager Terry Sullivan shared two scenarios in a presentation with Manhattan donors last night, showing them what it would take for Rubio to win.\nThe first showed the number of states and delegates Rubio would need to clinch the nomination outright before July’s convention. The second was the scenario in which none of the candidates gain the simple majority delegates needed to clinch the nomination before the convention, unleashing a messy and potentially unpredictable battle where multiple candidates are vying for the title.\nSullivan has previously acknowledged that a brokered convention might be possible, even though a more rosy scenario for the campaign would be winning important winner-take-all states on March 15.\nAccording to sources at the meeting, Sullivan was confident that Rubio would still win his home state of Florida, something that the campaign repeated earlier today.","url":"https://www.breitbart.com/politics/2016/02/25/team-rubio-power-point-illustrates-path-to-brokered-convention/"}
