{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:48:23","date_modify":"2018-10-30 21:48:23","date_publish":"2016-06-14 11:31:06","description":"A new concept from the team behind a popular local restaurant is set to open this fall at Krog Stree...","filename":"data/vaneerConsumption/TeambehindMakantoopenBettyHsusBaosatKrogStreetMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/14/Images/WPIMAGE_cmgajcfoodandmore_8803.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_te_7bad23957e5800aff2fd535f50e4324b__1540936103.html","title":"Team behind Makan to open Betty Hsu's Baos at Krog Street Market","title_page":"Team behind Makan to open Betty Hsu's Baos at Krog Street Market","title_rss":"NULL","source_domain":"ajc.com","text":"A new concept from the team behind a popular local restaurant is set to open this fall at Krog Street Market.\nBetty Hsu's Baos, which will set up shop in the stall next to Jeni's Ice Cream, is being launched by partners Michael Lo and George Yu, whom also will serve as Betty Hsu’s executive chef. The pair also operates Makan Restaurant & Bar in Decatur and Mama Tiger at Emory University.\nBetty Hsu's will offer a selection of steamed buns, including the pork belly and roasted duck buns from Makan's menu, along with new seafood and vegetarian steamed bun options and other seasonal dishes.\nAnother upcoming Krog Street Market concept, c hef Todd Richards' Southern Fried, is also set to open soon .\nWith the addition of Betty Hsu's, Krog Street Market is now 97 percent leased. Read about some of the other things to do and eat at Krog Street Market here and here.\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter. Find us on Instagram @AJCdining.","url":"https://www.ajc.com/blog/atlanta-restaurants/team-behind-makan-open-betty-hsu-baos-krog-street-market/676X2SBKZlSnL9jga3hykL/"}
