{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:36:51","date_modify":"2018-10-30 18:36:51","date_publish":"2015-06-25 14:40:53","description":"President Obama has yet to react to the news that the Supreme Court upheld the legality of Obamacare subsidies, but many of his former staffers cheered as the the latest legal attempt against Obama’s signature healthcare law failed. |","filename":"data/vaneerConsumption/TeamObamaCelebratesSupremeCourtRulingAGoodDayForAmerica.json","image_url":"https://media.breitbart.com/media/2015/06/obama-military-jacket-smile-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_25__1540924611.html","title":"Team Obama Celebrates Supreme Court Ruling: ‘A Good Day For America’","title_page":"Team Obama Celebrates Supreme Court Ruling: ‘A Good Day For America’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama has yet to react to the news that the Supreme Court upheld the legality of Obamacare subsidies, but many of his former staffers cheered as the the latest legal attempt against Obama’s signature healthcare law failed.\nFormer Obama Senior Aide Dan Pfieffer called the news “A good day for America” on Twitter.\nFormer Obama speechwriter Jon Favreau called it a Supreme Court decision “that will save lives.”\n“Thank you SCOTUS,” wrote Obama’s former spokesman for the National Security Council Tommy Vietor.\n“Legacy issues are for another day,” wrote Obama’s former campaign manager David Axelrod, who said he was “tearing up” at the news. “SCOTUS ruling is a huge victory for millions of Americans whose health care was at risk.”\n“GOPers rail against ruling, but privately are relieved,” he added later. “If court had struck subsidies down, Rs would have been the dogs that caught the car.”\nEven former Attorney General Eric Holder weighed in on his new Twitter account to celebrate the news.\n“Congratulations to SG Don Verrilli and men and women of DOJ who crafted legal basis for successful arguments today,” he said. “Proud. One big one to go.”","url":"https://www.breitbart.com/politics/2015/06/25/team-obama-celebrates-supreme-court-ruling-a-good-day-for-america/"}
