{"authors":["Robert Cottingham For Mailonline"],"date_download":"2018-10-23 01:36:53","date_modify":"2018-10-23 01:36:53","date_publish":"2017-04-26 12:05:24","description":"Louis Smith knows the importance of landing your dismount more than most but the British gymnast appeared to forget the golden rule when roller-skating at a ramp park.","filename":"data/vaneerConsumption/TeamGBsLouisSmithfallstryingtolandskatebackflip.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EB1FD00000578-0-image-a-6_1493204022519.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_othersports_article-4447176_Team-GB-s-Louis-Smith-falls-trying-land-skate-flip_1540258613.html","title":"Team GB's Louis Smith falls trying to land skate back-flip","title_page":"Team GB's Louis Smith falls trying to land skate back-flip | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Louis Smith knows the importance of landing your dismount more than most but the gymnast appeared to forget that golden rule when roller-skating at a ramp park.\nIn a video posted his Instagram, the Team GB gymnast build up a head of steam on the skates by sliding down an incline before approaching another ramp for a jump.\nAnd at the peak of his speed Smith launched himself into an impressive leap, propelling himself backwards as he soared into the air.\nLouis Smith launches himself into a backflip by propelling himself off the skating ramp\nSmith completes the rotation with ease before gracefully heading back town to earth...\n...before crashing to his feet at the last moment and landing flat on his front on the ramp\nDespite the heavy fall Smith saw the funny side and emerged laughing from failed back-flip\nSmith completed a graceful back-flip with apparent ease which would have surely nailed a high score from any judge watching on.\nBut the 28-year-old was undone at the last - as he hit the ground with his skates before buckling and falling flat on his front.\nLuckily he appeared to take it well, smiling despite the heavy fall and bouncing straight back up to give the flip another go.\nSmith celebrates with his silver medal won at the 2016 Rio Olympics for the pommel horse\nThe two-time Olympic pommel horse silver medallist at London 2012 and Rio 2016 respectively, most recently to Team GB team-mate Max Whitlock.\nHe was recently runner-up again in the 2017 edition of ski-jumping show The Jump - and has also appeared on the 2012 edition of Strictly Come Dancing.\nSmith, was awarded an MBE in 2013 but was banned from the sport for two months in November 2016 after a video emerged of the gymnast appearing to mock Islam.\nThe Instagram video of the skating was shot at Adrenaline Alley skate park in Corby, around a half hour drive from Smith's birthplace of Peterborough.","url":"https://www.dailymail.co.uk/sport/othersports/article-4447176/Team-GB-s-Louis-Smith-falls-trying-land-skate-flip.html"}
