{"authors":[],"date_download":"2018-10-22 22:56:02","date_modify":"2018-10-22 22:56:02","date_publish":"2014-06-11 13:43:18","description":"\"Amnesty, at the end, was a clear differentiator between myself and Eric Cantor, but it fits into the whole narrative,\" of the campaign, Tea Party candidate says.","filename":"data/vaneerConsumption/TeaPartyWinnerSaysCantorWasOutofTouch.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/501226/140611-david-brat-campaign-4a_159fd392206216507a142880ae547287.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_tea-party-winner-says-cantor-was-out-touch-n128346_1540248962.html","title":"Tea Party Winner Says Cantor Was 'Out of Touch'","title_page":"Tea Party Winner Says Cantor Was 'Out of Touch'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe little-known Tea Party candidate who stunningly defeated one of the most powerful House Republicans Tuesday says that immigration was a “differentiator” in his race against Majority Leader Eric Cantor but that his victory was about broader philosophical differences.\n\"Amnesty, at the end, was a clear differentiator between myself and Eric Cantor, but it fits into the whole narrative\" of his campaign, economics professor and new Virginia congressional nominee Dave Brat told NBC’s Chuck Todd in an interview.\nDuring his campaign, Brat excoriated Cantor for his support for a DREAM Act-like proposal that would offer some children brought into the United States illegally a path to citizenship. The majority leader’s seismic loss led many to question if even supportive Republicans will abandon any efforts to overhaul the nation’s immigration system for fear of a similar gut punch at the ballot box.\nBut Brat said that Cantor’s biggest problem was an aloofness from the voters who first elected him in 2000.\n“Eric just has not been present in the district, and he was out of touch in supporting the Chamber [of Commerce] agenda on that one,” he said. “I was door-knocking, I know what’s on the mind of the folks.”\nThe Randolph-Macon College professor of economics declined to answer repeated questions about whether or not he believes there should be a minimum wage at all, saying he does not have “a well-crafted response on that one.”\nBut he appeared to argue generally against the notion, saying that “you cannot artificially make up wage rates, they have to be related to productivity.”","url":"https://www.nbcnews.com/politics/first-read/tea-party-winner-says-cantor-was-out-touch-n128346"}
