{"authors":["Ron Elving"],"date_download":"2018-10-22 23:03:43","date_modify":"2018-10-22 23:03:43","date_publish":"2014-06-04 00:00:00","description":"Political observers declared the Tea Party dead in May after it lost every major GOP primary it contested. Sen. Thad Cochran's performance against his Tea Party rival makes that judgment seem rash.","filename":"data/vaneerConsumption/TeaPartyStillPacksAPunchHowItHappenedInMississippi.json","image_url":"https://media.npr.org/assets/img/2014/06/04/ap818974394213_wide-065fc949be444680eeae9a22d1b387c2e030b871.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2014_06_04_318785534_tea-party-still-packs-a-punch-how-it-happened-in-mississippi_1540249423.html","title":"Tea Party Still Packs A Punch: How It Happened In Mississippi","title_page":"Tea Party Still Packs A Punch: How It Happened In Mississippi : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Tea Party Still Packs A Punch: How It Happened In Mississippi\nEnlarge this image toggle caption George Clark/AP George Clark/AP\nIn mid-May, many political observers in Washington and elsewhere were declaring the Tea Party dead after it had lost every major Republican primary it contested this spring. I know, I am one of them.\nThat judgment looked a bit rash at month's end, as a Tea Party favorite denied Republican David Dewhurst's bid for re-nomination as lieutenant governor in Texas, and Tea Party favorites did well elsewhere in the Lone Star State.\nAny dismissal of the Tea Party is even more difficult to defend, or even explain, today. That is because six-term Senate veteran Thad Cochran trailed his Tea Party challenger in the GOP Senate primary in Mississippi on Tuesday.\nTo be sure, Cochran has a chance to redeem himself later this month in the runoff against state Sen. Chris McDaniel. But for the moment, at least, all eyes are on McDaniel, and on the outside support that buoyed his bid.\nThis was as clear-cut a case of establishment GOP against insurgent conservative as we've seen since the latest round of Republican intraparty warfare got going in 2010. McDaniel embraced the Tea Party label and brought in as many of its stars as he could, including Sarah Palin. He also benefited from the dollar outlays of Tea Party allies such as the Club for Growth (which spent twice as much as McDaniel did) and Rick Santorum (who won the Republican presidential primary here in 2012).\nAnd so Tea Party true believers were celebrating not only in Mississippi but all over the country Tuesday night when McDaniel took the lead.\nLife In The Movement\nNone of this changes the actual nature of the political phenomenon known as the Tea Party, which is just a misnomer that stuck. As a political party, it is a nullity. It has no organization and no power to authorize or legitimize the many candidates and funding organs that claim its mantle.\nBut, as has also been noted in this space before, just because you aren't a political party doesn't mean you don't matter. Just because the Tea Party may lack any coherent sense of conventional organization, that doesn't mean there's no there there.\nThe energy and the excitement on the right that have been called the Tea Party can still be a movement, and there is clearly still life in that movement. It just doesn't take the form of a party the way the big league parties do. That is why Tea Party candidates are running in Republican primaries, to try to take over the Republican Party and make it theirs.\nAnd that is why they are so thrilled about McDaniel, despite his forays into immigration and gay marriage or grousing about federal spending for his own state's victims of Hurricane Katrina. After months of disappointing results, the hope for another trophy head has been revived.\n7 Lessons\nAnd so have the memories and lessons of previous Tea Party triumphs. Such as these:\n1. Low turnout plays hob with all other factors in a primary. Roughly 1 Mississippian in 10 took part in Tuesday's voting, and the number voting for McDaniel was about one-fifth of the number who turned out for Mitt Romney in November 2012. As much as this race came to fascinate the national media in May, this was not a Mississippi voter magnet.\n2. The lower the participation, the more likely the ideologically outspoken candidate can win. It's the scenario by which the guy with the most fanatical fans prevails, even if the other guy has more fans. In Utah in 2010, Republican Sen. Robert Bennett lost when a convention delegate process denied him a place on the primary ballot. In 2013, a Virginia GOP convention chose its ideological favorite over a more broadly popular alternative and probably sacrificed a chance to win the governorship.\n3. Age can be a sleeper issue. In the single-biggest Tea Party victory to date, Indiana's Senate icon Richard Lugar went down in 2012 in large part because he was 80 and visibly less vigorous when he had to come home to campaign. Bennett in Utah showed no signs of slowing down in 2010 but was 76, as Cochran is now. Some of the other establishment Republicans who have lost to upstart Tea Party candidates, like Mike Castle in Delaware (70 at the time), were also of the pre-boomer generation.\n4. While it speaks to health and forcefulness, the age issue also segues into style. The older fashion of politics, especially Republican politics, was to honor position and experience. The GOP in the South was at one time largely a country club phenomenon. But since Ronald Reagan's presidency, the trickle of independent populists and former Democrats into the GOP has become a flood. And many of them are angry about the changes they see in their world. So the courtly manners of an old-school, Ole Miss lawyer like Cochran are suspect. In contrast, McDaniel pummeled President Obama as \"the worst American president ever\" and asked what anti-Obama campaigns Cochran had spearheaded.\n5. The personal becomes the political. A conservative blogger was arrested for taking pictures of Cochran's wife in the nursing home where she has lived for 14 years with progressive dementia. That was a shocking development to those following the campaign both inside the state and nationally, and it heightened interest at home and nationally in unpredictable ways. McDaniel himself has not been implicated, and he has objected to suggestions he was involved. But the notion that the incident would be fatal to McDaniel was clearly off base, and it is possible the overall reaction was not as sympathetic to Cochran as expected.\n6. Incumbency is a double-edged sword in the changed environment of Republican primaries. A guy like Cochran, who has never won re-election with less than 60 percent, thrives on presumption. He rises to power with the promise that he will use it for his home state, sometimes shamelessly. A six-term senator becomes a gold mine, especially as chairman or ranking member of Senate Appropriations (as Cochran has been in the past). But the new conservative energy is so anti-Washington that even using Washington to help the state is suspect. A similar fate befell Senate Appropriations Chairman Warren Magnuson in 1980.\n7. In this climate, all the things an incumbent does to win become weapons against him in a jujitsu dynamic. Cochran has doubled down on his appropriator identity throughout this campaign, pointing to the buildings that bear his name on the campus of Ole Miss and other schools throughout the state. He has spoken of his efforts with former Sen. Trent Lott to heal the infrastructure wounds of Hurricane Katrina in 2005 and since. This has been a tradition in this state and others in the Deep South (and beyond), a sensible, time-tested strategy for incumbents — and Cochran could scarcely have run away from it; but openly owning all these outlays reinforced the impression that Cochran defines serving in government as spending money.","url":"https://www.npr.org/sections/itsallpolitics/2014/06/04/318785534/tea-party-still-packs-a-punch-how-it-happened-in-mississippi"}
