{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:34:23","date_modify":"2018-10-30 21:34:23","date_publish":"2015-09-20 21:24:51","description":"After considerable debate California’s Republican Party voted to adjust immigration stance Sunday in amendment authored by Marcelino Valdez.","filename":"data/vaneerConsumption/TeaPartyBacksMilderCAGOPImmigrationLanguage.json","image_url":"https://media.breitbart.com/media/2015/09/CPXvuJWUsAApWr8.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_09_20__1540935263.html","title":"Tea Party Backs Milder CA GOP Immigration Language","title_page":"Tea Party Backs Milder CA GOP Immigration Language","title_rss":"NULL","source_domain":"breitbart.com","text":"ANAHEIM — California’s Republican Party voted Sunday to change its stance on immigration with the adoption of an amendment authored by California GOP Central Valley Regional Vice Chairman Marcelino Valdez. The Tea Party caucus ultimately backed the amendment.\nA draft version of the amendment was approved in committee on Saturday at the California Republican Party convention in Anaheim. The early version sought to strike the words “illegal alien” from platform language, remove a stance that all election ballots and government documents be printed in English only, and remove a declaration “allowing illegal immigrants to remain in California undermines respect for the law,” according to the Sacramento Bee. Debate during Sunday’s floor vote led to significant adjustments. The Bee reports that the platform still supports English as the official language of government, but has dropped a demand that ballots be printed in English only. It also refers to illegal aliens as “people,” rather than as “otherwise law-abiding folks,” as originally proposed.\n“We are pleased to see that the immigration plank has been updated and the Party has adopted a stance that modernizes the platform while still maintaining the core values of the party,” Valdez said Sunday. “This is a great first step in the right direction towards growing the California Republican Party.”\nDuring the course of Sunday morning proceedings, the Tea Party California Caucus (TPCC) sent text messages to delegates reading, “TPCC asks that you vote ‘YES’ on suspending the rules for a separate recommendation of the Valdez Immigration amendment.” A subsequent text read, “TPCC asks you to vote ‘YES’ on Valdez Immigration Amendment with changes inc. ‘English Only’ and ‘Law Abiding Citizen’ language.”\nUltimately, TPCC suggested a “YES” vote on the revised Valdez immigration amendment.\nTea Party California Caucus Communications Director Robert Jeffers told Breitbart News, “Today was a big win for conservatives. The California Republican Platform is more conservative today than before, and will be so for four more years. We proved a coordinated voice, working with party leadership, can defend our principles.”\nBreitbart California Politics Editor Jon Fleischman said, “The original language ‘softening’ the platform was so amended at the convention that the final vote was nearly unanimous. The party’s fundamental positions on immigration were not changed, but language that could be considered divisive was revised.”\nAssemblyman Rocky Chavez (R-Oceanside), a candidate for U.S. Senate, commented to the Bee, “We’re evolving.” Fellow 2016 Republican Senate candidate Tom DelBecarro told Breitbart News, “Chavez’s preference for open borders and sanctuary cities is not the answer for America.”\nOn Friday, Valdez had stated, “The current immigration plank is out of step with the values of the California Republican Party of today. I’ve put forth an amendment that modernized the Platform, respects the rule of law, and the importance of a secure border while recognizing the necessity for a workable legal immigration policy.”\nCalifornia is one of six states that contain 60% of “unauthorized immigrants” between them, according to Pew Research. Texas, Florida, New York, New Jersey and Illinois are the other five.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/09/20/tea-party-backs-california-gop-immigration-shift/"}
