{"authors":[],"date_download":"2018-10-22 21:07:35","date_modify":"2018-10-22 21:07:35","date_publish":"2014-06-04 11:15:00","description":"Neither candidate appears able to get the 50 percent majority to win outright.","filename":"data/vaneerConsumption/TeaPartyvEstablishmentBattleEyesOvertimeinMississippi.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/486126/mississippi_primaries_senate-jpeg-0e6aa_c1f6590a18779fa1315199181e342009.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_tea-party-v-establishment-battle-eyes-overtime-mississippi-n122106_1540242455.html","title":"Tea Party v. Establishment Battle Eyes Overtime in Mississippi","title_page":"Tea Party v. Establishment Battle Eyes Overtime in Mississippi","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHATTIESBURG, MISSISSIPPI – The battle between incumbent Senator Thad Cochran and conservative challenger Chris McDaniel in Mississippi’s hard-fought Republican primary on Tuesday is almost certainly headed for a round two runoff. And for the next three weeks, Republicans here will be embroiled in the fight between the Tea Party groups helping to bankroll McDaniel’s campaign and the GOP establishment in the state and in Washington D.C.\nMcDaniel holds a narrow lead in the very tight contest, but neither candidate appears able to get the 50 percent majority to win outright. That means the two will likely face off in a runoff battle even though Mississippi officials have not yet announced the official results. A little-known third candidate, real estate agent Thomas Carey, collected more than 1 percent of the vote and appears to have denied both of the leading candidates a possible outright victory.\nA runoff would turn what was already perhaps the most-closely watched and contested GOP Senate primary in the country into even more of a spectacle ahead of the June 24 runoff. And it will test the resolve of the 76-year-old Cochran, who now faces an energized base of opposition that views him as extremely vulnerable.\n“Whether it’s tomorrow or three weeks from now, we will stand victorious,” McDaniel told a cheering crowd at his campaign’s election night event here, with his two young sons and wife on stage with him.\nKey Tea Party groups have already spent more than $5 million in this campaign, but some of their leaders, who attended McDaniel’s election night event, promised they would continue to invest in his campaign if it lasts three more weeks.\n“The grassroots has the advantage, we will show up. Runoffs go to the campaign with the most energy,” said FreedomWorks President Matt Kibbe, who flew from Washington for the last day of the campaign. FreedomWorks spent more than $300,000 to aid McDaniel.\nRob Collins, executive director of the National Republican Senatorial Committee, the campaign arm of Senate Republicans, said the group would still stand with the incumbent.\n\"Should Mississippi go to a runoff, we will expect a vigorous debate about the future of our country over the next three weeks and we will continue to fully support Thad Cochran. We look forward to him emerging victorious in the runoff,\" he said.","url":"https://www.nbcnews.com/politics/elections/tea-party-v-establishment-battle-eyes-overtime-mississippi-n122106"}
