{"authors":[],"date_download":"2018-10-30 00:51:23","date_modify":"2018-10-30 00:51:23","date_publish":"2018-08-09 16:33:22","description":"Facebook, Apple, Youtube, and Spotify have all banned conspiracy theorist Alex Jones of Infowars, citing hate speech violations.","filename":"data/vaneerConsumption/TechPlatformsBanInfowarsAlexJonesCitingHateSpeechViolations.json","image_url":"https://www.allsides.com/sites/default/files/logo-all-sides-20px_1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/allsides.com/blog_tech-platforms-ban-infowars-alex-jones-citing-hate-speech-violations_1540860683.html","title":"Tech Platforms Ban Infowars' Alex Jones, Citing Hate Speech Violations","title_page":"Tech Platforms Ban Infowars' Alex Jones, Citing Hate Speech Violations | AllSides","title_rss":"NULL","source_domain":"allsides.com","text":"Facebook, Apple, Youtube, and Spotify have all banned conspiracy theorist Alex Jones of Infowars, citing hate speech violations. Although Twitter CEO Jack Dorsey originally stated that the platform would not censor Jones' content, the company also Although Twitter CEO Jack Dorsey originally stated that the platform would not censor Jones' content, the company also removed several of his videos and tweets after a CNN article found them to be in violation of Twitter's standards. Supporters of the decision say that Jones' content incites violence against marginalized groups, while opponents claim that the tech companies are prejudiced against conservative speech.\nSnippets from the Left\nWashington Post\n\"The First Amendment states that 'Congress shall make no law . . . abridging the freedom of speech.' That’s it. It does not say that private companies are required to host your speech on their platforms, or that they must promote your content. You can say what you like, but no one else is obliged to help you get your message out.\n...\nWhen it comes down to it, false statements and purposeful conspiracy-mongering cause public harm. Often, a lot of harm. In December 2016, a man shot up the Comet Ping Pong pizzeria in Washington following a rumor, amplified by Jones, that it was hosting a pedophile ring. Parents of children murdered at Sandy Hook Elementary School can’t visit their children’s graves because they are hounded by Infowars-inspired harassers. In June, an armed man in an armored vehicle barricaded himself near the Hoover Dam in support of QAnon, only the latest of the cockeyed theories that Jones has promoted.\n...\nStill, there’s likely to be further fallout from Facebook, Apple and YouTube’s decisions. It’s possible the deplatforming of Jones will further excite those who claim that speech is being silenced, or who are looking for more evidence of “deep state” intervention. Of course, that would have happened anyway — conspiracists gonna conspire, after all.\nSnippets from the Center\nWall Street Journal\n\"Eliminating easy access to Infowars podcasts marks a rare, prominent foray for Apple into an issue confronting many major internet companies: how to remove hateful or conspiratorial messages from their platforms without infringing on free speech.\n...\nInfowars, a site that frequently promotes conspiracy theories, and its host Alex Jones have often been at the center of the debate over controversial content. In July, Facebook banned Mr. Jones from its platform for 30 days for posting comments that violated policies governing hate speech and bullying.\n...\nThe tech giant 'does not tolerate hate speech' and has 'clear guidelines that creators and developers must follow to ensure we provide a safe environment for all of our users,' Apple said in a statement. 'We believe in representing a wide range of views, so long as people are respectful to those with differing opinions.'\"\nSnippets from the Right\nWashington Times\n\"He’s well on his way to becoming a martyr — meaning, many of those who don’t even like his content or appreciate his style are gearing up, nevertheless, to defend his right to speak on these social media stations.\nThis seems counterproductive to those who would silence him, yes? Google “Jones” and what appears is a page filled with Alex Jones news. It’s not just free advertising for Infowars; it’s turning Jones himself into the cause celebre of the conservatives’ censorship fight.\n...\nGood for him. That’s not just the capitalistic way. It’s the classic way of getting back at one’s enemies. Rather than going away, Jones is growing larger.\n...\nNo doubt the tech giants and social media executives meant to silence Jones and make him go away. But what they’ve done instead is made him even more noticeable, more influential, more pertinent in today’s news cycles.\nThey’ve pretty much made him a martyr of the free speech movement.\"","url":"https://www.allsides.com/blog/tech-platforms-ban-infowars-alex-jones-citing-hate-speech-violations"}
