{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-31 00:31:51","date_modify":"2018-10-31 00:31:51","date_publish":"2018-07-09 00:00:00","description":"The US and China dominate global tech markets.","filename":"data/vaneerConsumption/Techs20largestcompaniesarebasedin2countries.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_techs-20-largest-companies-are-based-in-2-countries-2018-7_1540945911.html","title":"Tech's 20 largest companies are based in 2 countries","title_page":"    Tech's 20 largest companies are based in 2 countries - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Cafe X\nLarge companies can be located all over the globe.\nFor example, massive auto companies can be found practically anywhere on a map. Ford (USA), Toyota (Japan), Volkswagen (Germany), Hyundai (South Korea), Volvo (Sweden), Tata Motors (India), and Magna (Canada) are just some of the biggest companies involved in the production of vehicles or parts.\nWhile the banking, pharma, energy, and retail industries also have geographic spread as well, the same cannot be said for the rapidly-growing tech industry.\nTHE CLASH OF TECH TITANS\nThe most recent edition of Mary Meeker's famous Internet Trends 2018 report highlighted the top internet companies in the world by valuation, with an interesting and perhaps unintended outcome.\nOf the 20 largest tech giants globally, a total of zero are located outside of the United States and China.\nHere are the latest rankings of internet companies, using updated market caps for all public companies:\nUnknown\nUnknown\nIn total, the above list of companies is worth $5.9 trillion, with a 75%-25% split in terms of USA/China.\nIt's also worth noting that the list excludes Samsung, likely because the South Korean company is quite diversified in its manufacturing activities (TVs, refrigerators, air conditioners, batteries, microwave ovens, etc.).\nA STEEP DROPOFF\nAside from the USA-China duality, the other major noticeable aspect of the list of the world's largest tech giants is that it clearly shows a divide between top-tier companies and those further down the ladder. In fact, there is not a single company with a valuation between $200 billion and $450 billion.\nThe top seven companies on the list account for 81% of the total value of the list, and they are all above the $450B mark. These include behemoths like Apple, Alphabet, Amazon and Microsoft, but also two big Chinese companies as well (Tencent, Alibaba).\nMeanwhile, the bottom 14 companies muster up just 19% of the value - a fact that underlines how hard it is to vault a tech company into the upper echelon of the market.","url":"https://www.businessinsider.com/techs-20-largest-companies-are-based-in-2-countries-2018-7"}
