{"authors":[],"date_download":"2018-10-30 01:08:26","date_modify":"2018-10-30 01:08:26","date_publish":"2018-08-27 00:54:18","description":null,"filename":"data/vaneerConsumption/TechIsTryingtoRigPoliticsCompletely.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Jeff_Bezos_and_Ash_Carter-1.jpeg.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861706.html","title":"Tech Is Trying to Rig Politics Completely","title_page":"Tech Is Trying to Rig Politics CompletelyThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The past few weeks have shown an alarming series of developments when it comes to the compatibility of today’s tech sector with a free society. The most controversial of these, no doubt, was the banning of Infowars and its flagship host Alex Jones from multiple social media platforms, all at once, a decision that even the ACLU raised alarm bells about, albeit belatedly. Since then, yet more worrying signs have cropped up — in particular, the revelation that tech companies are planning a secret meeting on how to “counter manipulation of their platforms,” i.e., to stop such manipulation by anyone who is not a Democrat.\nThe danger of such actions should be obvious to anyone concerned with ensuring a fair marketplace of ideas. Erratic and bizarre though Jones himself was, no one ever voted to allow tech companies to censor cranks. In fact, it is one of the cornerstones of American legal and political culture that cranks cannot be censored, period. Freedom of the press means freedom of William Randolph Hearst to make up lies that led to the Spanish American War, and of newspapers in the 1980s to spread the entirely fictitious Satanic Panic, just as much as it means freedom of Alex Jones to broadcast whatever nonsense he likes. When major corporations, including some press outlets themselves, arrogate to themselves the right to act as censors where the government cannot, no matter how unsympathetic the target, the world becomes that much less free and our institutions that much less trustworthy.\nStill, at least the censorship of American political thought by tech companies is so ham-fisted as to be visible. But it is not merely the public discussion of politics that tech companies want to rig in their favor. It is also the method by which the spoils of political conflict are divided, including and especially government contracts.\nThe full extent of this is revealed in a recent bombshell article at Vanity Fair, normally reliable redoubt for Leftist causes, but in this case apparently too horrified to glance over the abuses involved. The story concerns a concerted campaign by Amazon and Jeff Bezos to try to literally rig the entire process by which the Department of Defense (DoD) transferred its data onto cloud computing servers.\nA little explanation is in order: like most federal agencies, the DoD has recently begun migrating its massive amount of data, including intelligence, official secrets, etc., to cloud computing servers, rather than storing all of it in-house. Needless to say, the kind of cloud computing networks required to hold all this data, and moreover to hold it securely, are vastly expensive to build and maintain. Which is why the DoD offered a $10 billion contract to whichever company they eventually chose to do the work.\nThere was just one problem. The requirements the DoD put forward for its cloud computing contract were specifically and deliberately skewed in such a way that very few companies other than Amazon could meet them, and for no apparent good reason. Why? Because the person writing those requirements was literally an ex-Amazon lobbyist named Sally Donnelly, who personally oversaw a meeting between Secretary of Defense Jim Mattis and Jeff Bezos, and whose firm was purchased by an investment firm with close ties to Amazon shortly after a cloud computing contract was being finalized. All this while Donnelly was ostensibly working for the Department of Defense as a disinterested analyst.\nIn short, Amazon funneled a yes-woman into DoD, had that yes-woman draw up the requirements for a $10 billion contract so that only they and a handful of other people could compete for it, and then used that woman as a go-between to try to rig the process even further by appealing to Mattis himself. To say this is unethical is obvious: what is less obvious is that it may even be illegal, at least according to Vanity Fair.\nThe point of this story is simple: whereas tech gets called out every other week when it tries to go for public power grabs, its attempt to privately control the levers of power in Washington thrives in the shadows, where this particular attempt would have very probably succeeded had it not been for the whistle being blown. These columns warned of the conflicts of interests among the people dedicated to choosing a cloud computing contractor for DoD some time ago, but now that we see how deep the rabbit hole really went, it is frightening indeed to see how close the Department of Defense came to becoming a subsidiary of Amazon, LLC.\nThis is why, flashy though the public controversies are, even more vigilance is required toward the tech sector attempting to co-opt Washington’s institutions, hollow them out, and render them dependent on their own products. Here in America we still believe in a government under the Constitution and the Bill of Rights, not under the End-User License Agreement. After this scandal, it has never been more clear that we need to keep it that way.","url":"https://spectator.org/tech-is-trying-to-rig-politics-completely/"}
