{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:46:49","date_modify":"2018-10-30 22:46:49","date_publish":"2018-07-30 00:00:00","description":"Tech stocks sold off broadly on Monday, dragging major US indexes lower, especially the Nasdaq 100, which lost as much as 1.5%. Amid the selling, options traders have pushed hedging costs to an all-time high, which could be a saving grace for the index.","filename":"data/vaneerConsumption/TechstockselloffRecordhedgingcostsshowtradersbraceforworst.json","image_url":"https://amp.businessinsider.com/images/5b5f357ce361c037008b4703-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_tech-stock-selloff-record-hedging-costs-show-traders-bracing-for-worst-2018-7_1540939609.html","title":"Tech stock sell-off: Record hedging costs show traders brace for worst","title_page":"    Tech stock sell-off: Record hedging costs show traders brace for worst - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Andrew Burton\nFresh off a rough week as the worst-performing group in the S&P 500, tech stocks are still feeling the pain.\nThe tech-heavy Nasdaq 100 index dropped as much as 1.9% on Monday, compared with a relatively tame 0.6% loss in the benchmark S&P 500.\nMuch of the selling pressure stemmed from weakness in the components of the so-called FAANG group — consisting of Facebook, Amazon, Apple, Netflix, and Google. Those companies hold large weightings in major equity indexes and exercise outsize influence on the broader market.\nThe group has faltered since Facebook's disastrous second-quarter earnings report last week, which saw the social-media titan forecast a growth slowdown, stoking investor fears that a similar situation could afflict other tech firms.\nAlso most likely weighing on investor sentiment are reports that Democratic Sen. Mark Warner of Virginia is charging ahead with proposals that would result in more tech regulation. Further, in a note to clients on Monday morning, Morgan Stanley's chief US equity strategist, Mike Wilson, said the tech sector was showing signs of \"exhaustion.\"\nBased on one gauge of market anxiety, investors are historically spooked. A measure called skew, or the premium options traders are paying to protect against a loss in the PowerShares QQQ Trust ETF over the next month, relative to wagers on an increase, has spiked to its highest level on record. (Note: QQQ is designed to track the Nasdaq 100.)\nIn other words, investors have never been more defensively positioned for a tech meltdown.\nBusiness Insider/Joe Ciolli/Andy Kiersz, data from Bloomberg\nThis nervousness may actually turn out to be a saving grace for the market, however, since the surge in hedging costs shows investors are braced for the worst. After all, one-month skew was never this elevated — even at the height of the tech bubble, when downside protection was needed most. Theoretically, this type of preemptive behavior could help stem a sell-off.\nFor further evidence of tech's importance to overall market strength, look no further than the impact it's had on the S&P 500's return this year. The index's top 10 contributors have accounted for 62% of the benchmark's 7% year-to-date return, according to Goldman Sachs data. Of those 10 companies, nine are in the tech sector.\nUntil tech's iron-clad grasp on US stock indexes loosens, expect deep swaths of selling — such as the one seen Monday — to continue roiling markets. But at the same time, find comfort in the fact that so much hedging is going on, and perhaps consider doing it yourself.\nNow read:","url":"https://www.businessinsider.com/tech-stock-selloff-record-hedging-costs-show-traders-bracing-for-worst-2018-7"}
