{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 21:43:59","date_modify":"2018-10-30 21:43:59","date_publish":"2017-01-04 19:02:12","description":"Sen. Ted Cruz (R-TX) and Rep. Ron DeSantis (R-FL) introduced a constitutional amendment Tuesday that would impose term limits on members of Congress, following up on a proposal made back in December.","filename":"data/vaneerConsumption/TedCruzIntroducesConstitutionalAmendmentonCongressionalTermLimits.json","image_url":"https://media.breitbart.com/media/2016/09/wi/ap_ted-cruz_ap-photo-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_04__1540935839.html","title":"Ted Cruz Introduces Constitutional Amendment on Congressional Term Limits","title_page":"Ted Cruz Introduces Constitutional Amendment on Congressional Term Limits | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Ted Cruz (R-TX) and Rep. Ron DeSantis (R-FL) introduced a constitutional amendment Tuesday that would impose term limits on members of Congress, following up on a proposal made back in December.\n“D.C. is broken,” Cruz said in a statement Tuesday evening. “The American people resoundingly agreed on Election Day, and President-elect Donald Trump has committed to putting government back to work for the American people. It is well past time to put an end to the cronyism and deceit that has transformed Washington into a graveyard of good intentions.”\nThe amendment would limit senators to two terms (12 years total) and representatives to three terms (6 years total), the Washington Examiner reported.\nPresident-elect Donald Trump made it a campaign promise that he would implement term limits on Congress, but it’s unclear if the incoming Trump administration has worked with Congress on the proposal, which was introduced during Congress’ first week in session of the new year.\nRepublican Sens. Deb Fischer of Nebraska, Ron Johnson of Wisconsin, Thom Tillis of North Carolina, Marco Rubio of Florida, Mike Lee of Utah and David Perdue of Georgia all co-sponsored the amendment.\nPeople seem to be in favor of term limits, as a Rasmussen survey found that 74 percent of Americans supported term limits while only 13 percent were not in favor of them.\n“President Trump, Speaker Ryan and huge majorities of the American people are demanding term limits,” said U.S. Term Limits President Philip Blumel. “Congress must listen and pass the Cruz-DeSantis amendment immediately.”","url":"https://www.breitbart.com/politics/2017/01/04/ted-cruz-introduces-constitutional-amendment-congressional-term-limits/"}
