{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:29:53","date_modify":"2018-10-30 18:29:53","date_publish":"2016-03-25 19:40:49","description":"2016 Presidential contender Ted Cruz is accusing Donald Trump of playing a part in accusations of infidelity launched against the Texas senator in the National Enquirer. |","filename":"data/vaneerConsumption/TedCruzAttacksFromDonaldTrumpHenchmenAreGarbage.json","image_url":"https://media.breitbart.com/media/2016/03/Ted-and-Heidi-Cruz-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_25__1540924193.html","title":"Ted Cruz: ‘Attacks’ From Donald Trump ‘Henchmen’ Are ‘Garbage’","title_page":"Ted Cruz: ‘Attacks’ From Donald Trump ‘Henchmen’ Are ‘Garbage’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"2016 Presidential contender Ted Cruz is accusing Donald Trump of playing a part in accusations of infidelity launched against the Texas senator in the National Enquirer.\nTed Cruz posted to Facebook on Friday:\nI want to be crystal clear: these attacks are garbage. For Donald J. Trump to enlist his friends at the National Enquirer and his political henchmen to do his bidding shows you that there is no low Donald won’t go. These smears are completely false, they’re offensive to Heidi and me, they’re offensive to our daughters, and they’re offensive to everyone Donald continues to personally attack. Donald Trump’s consistently disgraceful behavior is beneath the office we are seeking and we are not going to follow.\nThe National Enquirer piece cited an anonymous source and accused Cruz of multiple extramarital affairs. Cruz pointed out in a Friday morning press conference that the gossip magazine piece ran the day after Trump’s accusation against Cruz for the Make America Awesome PAC ad including the Melania Trump modeling photo.\nRoger Stone told USA Today via email:\nEverything I know about these allegations I heard from credible reporters for the MSM…I played no role in the placement of the story.\nTrump and Cruz have been locked in a battle over their wives since a Trump-opposing Super PAC ran an ad with partially nude modeling photos of Trump’s wife Melania aimed at Utah Mormon women. Trump accused Cruz of running the photo.\nBreitbart News reported on the exchange between the two top Republican presidential contenders that led Cruz to tell reporters on Thursday: “It’s not easy to tick me off. I don’t get angry often, but you mess with my wife, you mess with my kids, that’ll do it every time. Donald you’re a sniveling coward and leave Heidi the hell alone.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/03/25/ted-cruz-attacks-from-donald-trump-henchmen-are-garbage/"}
