{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:29:45","date_modify":"2018-10-30 18:29:45","date_publish":"2016-04-05 03:30:38","description":"Ted Cruz declared Monday that he has always been faithful to wife Heidi Cruz, following an accusatory report by gossip magazine National Enquirer that the Texas senator had five mistresses. | Politics","filename":"data/vaneerConsumption/TedCruzTellsMegynKellyIHaveAlwaysBeenFaithfultoMyWife.json","image_url":"https://media.breitbart.com/media/2016/03/wi/afp_e75178bb07aca3e7136b2a2f7bfabadd0911bed5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_04__1540924185.html","title":"Ted Cruz Tells Megyn Kelly ‘I Have Always Been Faithful to My Wife'","title_page":"Ted Cruz Tells Megyn Kelly ‘I Have Always Been Faithful to My Wife' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ted Cruz declared Monday that he has always been faithful to wife Heidi Cruz, following an accusatory report by gossip magazine National Enquirer that the Texas senator had five mistresses.\nMegyn Kelly hosted the special town hall that aired Monday night at 9 p.m. ET. Fox News Insider posted an early clip of an exchange between Kelly and Cruz in which she asked the presidential candidates directly, “Have you committed adultery in your marriage?”\n“I have not. That attack was complete and utter garbage. It was complete lies,” responded Cruz.\n“I have always been faithful to my wife. I love my wife. She is my best friend in the whole world. And this is the kind of garbage that the Trump campaign engages in.”\nCruz called the accusations “garbage” shortly after the story came out. The magazine used an anonymous source and at least two of the women publicly identified have explicitly denied the accusations.\nCruz suggested that GOP frontrunner Donald Trump had something to do with the story. He pointed to a connection between Trump and the magazine’s owner, as well as the timing. The story came out one day after Trump tweeted an accusation that Cruz ran a partially nude photo of Trump’s wife Melania in a Facebook ad that was intended to influence Utah’s Mormon voters.\nTrump spokeswoman Hope Hicks denied that Trump had anything to do with the National Enquirer story. Trump also denied any involvement in the adultery accusation story.\nCruz also denied any involvement in the Utah ad that was placed by anti-Trump Super PAC Make America Awesome. He did however respond to a tweet from Trump that reposted someone else’s tweet. The message displayed an unflattering photo of Cruz’s wife Heidi alongside Melania Trump. Cruz quickly responded, calling Trump’s wife “lovely” and calling Heidi Cruz the love of his life. Cruz followed up with comments to reporters demanding that Trump,”Leave Heidi the hell alone.”\nThe two top contenders for the Republican nomination have each indicated a desire to move on from the dispute and get back to discussing the issues.\nThe entire interview aired at 9 p.m. ET on Fox News channel.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/04/04/ted-cruz-tells-megyn-kelly-always-faithful-wife/"}
