{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:40:15","date_modify":"2018-10-30 18:40:15","date_publish":"2016-04-07 11:46:44","description":"Sen. Ted Cruz is facing an uphill battle in New York. | Politics","filename":"data/vaneerConsumption/TedCruzHoldsSmallBronxEventAfterCancelledSchoolAppearance.json","image_url":"https://media.breitbart.com/media/2016/04/Cruz-Bronx-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_07__1540924815.html","title":"Ted Cruz Holds Small Bronx Event After Cancelled School Appearance","title_page":"Ted Cruz Holds Small Bronx Event After Cancelled School Appearance | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Ted Cruz is facing an uphill battle in New York.\nFor example, an event in the Bronx garnered what the New York Post estimated to be just shy of 100 people on the same day that GOP frontrunner and New Yorker Donald Trump held a rally that brought in what Trump estimated to be 17,000.\nOn Tuesday afternoon there was an announcement for a Wednesday afternoon event at Bronx Lighthouse Charter School. Within hours the Cruz campaign released updated information for a Wednesday afternoon Bronx event that showed an entirely different Chinese-Dominican restaurant location.\nNews broke Wednesday that the Principal of the Bronx Charter School welcomed an opportunity to cancel the Cruz appearance upon receipt of a letter from a group of offended students. The student letter threatened a walkout and accused Cruz of “actively working to harm us, our community, and the people we love.”\nSome 70 ministers associated with Cruz attended the newly announced Sabrosura restaurant event as well as around a dozen New York voters according to the New York Post. One man made his way into the packed restaurant and shortly thereafter began to yell at the Texas senator calling him a racist bigot, climate change denier, a right-wing bigot and “not welcome here.” As he and another man left the event he yelled, “this is an immigrant community Ted Cruz.”\nCruz told the crowd remaining, “we need positive solutions, not the kind of anger that that man…I will make the confession as I said that I have the classic second generation immigrant challenge.” Video of the protesters cut off as he said that. Cruz is the son of a Cuban immigrant to the United States.\nTrump tweeted about his Wednesday Long Island event:\nUnbelievable evening. Just made a speech in front 17,000 amazing New Yorkers in Bethpage, Long Island— great to be home! — Donald J. Trump (@realDonaldTrump) April 7, 2016\nCruz made comments on “New York values” during a debate months ago and faced criticism from Trump. The Texas senator has since clarified and doubled down on his statements saying he was referring to New York liberals.\nDuring an afternoon press conference Cruz responded to a question regarding the “New York values” term and citing polls that put Cruz well behind Trump.\nCruz said that polling can change quickly as it did in Wisconsin flipping Cruz from well behind Trump to well ahead and ultimately pulling out a better than projected win. He went on to speak of the Hispanic and African American pastors present in his lunch event including pastor and Democratic Senator Ruben Diaz who said, according to Cruz:\nI know what you mean by New York values. We fight them every day in our community. We fight them. They’re the values that led, for example, mayor Bill de Blasio, liberal Democrat, getting elected mayor, one of the first things he did was try to shut down charter schools in Harlem because he is captive to the union bosses who control him, so one of his first actions was to try to throw young African American and Hispanic kids out of the schools that were giving them hope and giving them a lifeline.\nAs one reporter pressed the “New York values” issue Cruz moved to criticize Trump for funding the politicians he spoke of.\nLet’s be clear the people of New York know what those values are, they’re the values of liberal democratic politicians like Andrew Cuomo, like Anthony Weiner, like Eliot Spitzer, like Charlie Wrangle, all of whom Donald Trump has supported, given tens of thousands of dollars throughout the years. if you want to know what liberal democratic values are, follow Donald Trump’s checkbook. He has been funding these policies.\nTrump holds a commanding 52 percent lead in the latest Monmouth University poll. Ohio Gov. John Kasich came in with 25 percent in that poll and Cruz ranks far last at 17 percent. In Wisconsin Cruz overcame Trump in polling and results, but even with a surge in the last month his polling jump was 21 percent from 19 to 40 in a Marquette University Law School poll while Trump remained at 30 percent. That made the February gap in the Wisconsin Marquette poll 11 percent while the gap between the two in the new New York poll is a whopping 35 percent.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/04/07/ted-cruz-holds-small-bronx-event-after-cancelled-school-appearance/"}
