{"authors":["Ken Klukowski"],"date_download":"2018-10-30 19:48:35","date_modify":"2018-10-30 19:48:35","date_publish":"2016-03-19 00:54:20","description":"WASHINGTON—Ted Cruz released a statement through his campaign regarding President Barack Obama’s nomination of Judge Merrick Garland to take Justice |","filename":"data/vaneerConsumption/TedCruzOpposesJudgeMerrickGarlandNoHearingsNoVotes.json","image_url":"https://media.breitbart.com/media/2016/03/Merrick-Garland-and-Ted-Cruz.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_18__1540928915.html","title":"Ted Cruz Opposes Judge Merrick Garland: No Hearings, No Votes","title_page":"Ted Cruz Opposes Judge Merrick Garland: No Hearings, No Votes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Merrick Garland is exactly the type of Supreme Court nominee you get when you make deals in Washington D.C. A so-called “moderate” Democratic nominee is precisely the kind of deal that Donald Trump has told us he would make—someone who would rule along with other liberals on the bench like Justices Ginsburg and Sotomayor. Make no mistake, if Garland were confirmed, he would side predictably with President Obama on critical issues such as undermining the Second Amendment, legalizing partial-birth abortion, and propping up overreaching bureaucratic agencies like the EPA and the IRS. We cannot afford to lose the Supreme Court for generations to come by nominating or confirming someone that a dealmaker like Donald Trump would support. Washington dealmakers cannot be trusted with such crucial lifetime appointments.\nI proudly stand with my Republican colleagues in our shared belief—our advice and consent—that we should not vote on any nominee until the next president is sworn into office. The People will decide. I commend Mitch McConnell and Chuck Grassley for holding the line and ensuring that We the People get to exercise our authority to decide the direction of the Supreme Court and the Bill of Rights.","url":"https://www.breitbart.com/politics/2016/03/18/ted-cruz-opposes-judge-merrick-garland-no-hearings-no-votes/"}
