{"authors":["Matthew Boyle"],"date_download":"2018-10-30 19:22:05","date_modify":"2018-10-30 19:22:05","date_publish":"2015-05-21 05:09:52","description":"At the end of his filibuster that lasted nearly 12 hours, Sen. Rand Paul (R-KY) got some last-minute support from one of his fellow GOP U.S. Senators running for president: Sen. Ted Cruz (R-TX). |","filename":"data/vaneerConsumption/TedCruzStandswithRandPaulonNSAFilibuster.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ted-cruz_ap-photo2-1024x750.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_20__1540927325.html","title":"Ted Cruz Stands with Rand Paul on NSA Filibuster","title_page":"Ted Cruz Stands with Rand Paul on NSA Filibuster | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At the end of his filibuster that lasted nearly 12 hours, Sen. Rand Paul (R-KY) got some last-minute support from one of his fellow GOP U.S. Senators running for president: Sen. Ted Cruz (R-TX).\nCruz, who doesn’t entirely agree with Paul on National Security Agency (NSA) bulk data collection as contained in the PATRIOT Act’s Section 215, came to the floor to applaud Paul’s big move for liberty.\n“I thank the senator from Kentucky,” Cruz said when he took the floor. “I would note he and I agree on a great many issues, although we don’t agree entirely on this issue, but I want to take the opportunity to thank the senator from Kentucky for his passionate defense of liberty. His is a voice that this body needs to listen to.\n“I would note the senator from Kentucky’s father spent decades in the house of representatives. As a passionate advocate for liberty. And both his father’s voice and the senator from Kentucky’s voice has altered the debate in this chamber and has helped refocus the United States congress and the American people on the critical importance of defending our liberty. I think protecting the bill of rights is a fundamental responsibility of the federal government.”\nCruz continued by noting it is “heartbreaking” that the Obama administration during its tenure “not only fails to protect the bill of rights but that routinely violates the constitutional liberties of American citizens, routinely violates the Bill of Rights.”\n“You know, I listened to the learned remarks and questions from the senator from Utah where he noted that under the justifications for the current bulk collection of metadata that it is the position of the federal government that they have the full constitutional authority not only to collect metadata but to collect the positional location of every American if any of us carry our cell phone, wherever we go,” Cruz said. “It is the position of the Obama administration that the federal government has the full constitutional authority to track the location of every American citizen, no matter where we walk. That is a breathtaking assertion of power.”\nCruz, who supports the USA Freedom Act as it stands—Paul does not, and wants an open amendment process to the bill, which Senate Majority Leader Mitch McConnell isn’t agreeing to—noted his support for the bill.\n“It protects our privacy rights and the bill of rights of law-abiding citizens but ensures we have the tools to prevent acts of terrorism,” Cruz said of the USA Freedom Act. “Now, I would note two points that are important. There are a number of members of this body, including a number of members of my party and the party of the senator from Kentucky, who argue the PATRIOT Act should be reauthorized with no changes and they argue to do anything else would jeopardize our national security.\n“Well, there are two facts that are critical to assess to responding to that argument. Number one, members of this body have received confidential classified briefings from the national security officers of this administration. We are not at liberty to convey the specific details of those briefings. But the members of this body have been told, number one, that the U.S.A. Freedom act would provide effective tools so that we could prevent acts of terrorism. And indeed they have gone further to say that it is entirely possible that under the U.S.A. Freedom act, the national security team would have more effective tools to stop actual terrorists than they do today under the bulk metadata collection of law-abiding citizens. That’s worth underscoring.\n“The national security professionals advising this body have said the U.S.A. Freedom act could well be more effective in providing the tools to stop terrorists than the current status quo. That argument needs to sit in for everyone arguing we’ve got to maintain the status quo to stop terrorism if it is the case as we have been told that the U.S.A. Freedom act could be more effective, that argument suddenly falls to the ground.”\nCruz also called out his GOP colleagues who want such an open reauthorization of the PATRIOT Act—a blanket reauthorization—by noting there aren’t enough votes for it in the House or the Senate.\n“Even if that is their preference, it is abundantly, abundantly clear that a clean reauthorization of the PATRIOT Act ain’t passing this body and it certainly ain’t passing the house of representatives. I would note that the U.S.A. Freedom Act passed the House of Representatives 338-88. It wasn’t a narrow victory. It was overwhelming.\n“So even if members of this body would prefer to reauthorize the PATRIOT Act in its entirety, the votes ain’t there. So the choice they face is letting it expire altogether, losing the tools we have to prevent real terrorists from carrying out active terrorism or accepting a commonsense middle ground that protects the bill of rights while maintaining the tools to target the bad guys.”\nCruz also said there should be open debate and votes—what McConnell is blocking on Paul’s amendments and anyone’s amendments to the USA Freedom Act.\n“I will say this, with my friend the senator from Kentucky, I entirely agree that he is fully entitled to introduce his amendments to that bill, that this body should engage in a full and open debate considering amendments and the senator from Kentucky should be able to propose reasonable commonsense improvements to the U.S.A. Freedom act,” Cruz said. “We ought to debate them on the merits in a full and open process. There was a time not too long ago when this body was called the world’s greatest deliberative body.\n“Debate is what we’re supposed to do on the merits. And if the defenders of the PATRIOT Act right now are so confident of their position, they should be prepared to debate the senator from Kentucky on the merits, to debate each of the members of this body on the merits, and to arrive at the right policy that both protects our constitutional rights and ensures we have all the tools we need to protect the safety of American citizens against acts of terrorism.”\nCruz also discussed his and Paul’s history of filibusters.\n“I will note standing here that the senator from Kentucky, with the senator from Utah at 11:40 P.M., I’m reminded of the movie ‘The Blues Brothers’ saying, ‘Jake, we’ve got to get the band back together again,’” Cruz said. “I’m reminded of previous evenings standing here with this same band of brothers in the wee hours of the morning. And I’ll make a couple of final observations in this question. The first is the very first time I ever spoke on the Senate floor, when I was a brand-new freshman senator, was during the last time the senator from Kentucky was filibustering.\n“Senator Rand Paul was filibustering against the Obama administration’s policy of uncontrolled drone strikes and the refusal of the Obama administration to acknowledge that the constitution prohibits the federal government from using a drone to target a united States citizen with lethal force if that citizen does not pose an imminent threat on U.S. Soil.\n“When the the senator from Kentucky began that filibuster that morning, he had asked if I might come out and support him, and I told him at the time as a newbie in the body that I wanted to respect the traditions of the Senate. So initially I said no, I’m not going to come down. It’s not yet time for me to speak on the Senate floor, and he stood there and one hour and two hours passed. I could not stand back without joining him in that support and that epic fight.”\nCruz noted that when he spoke, he spoke of the Alamo—it was the anniversary of that Texas Revolution battle.\n“At that time I’m reminded it was an anniversary of the battle of the Alamo, so I had the opportunity to read to my friend William Barrett Travis’ letter from the Alamo and to give him the encouragement of Texans who gave their lives in — gave their lives in defense of liberty and indeed at the time to read tweets that were sent in support of the Senator from Kentucky,” Cruz said. “And I said many times I will go to my grave in debt to Senator Rand Paul at the first opportunity I had to speak on the Senate floor was in support of his epic filibuster.”\nCruz also said that Paul gave him “two pieces of advice” when he did his filibuster against Obamacare some months later in 2013.\n“Advice number one, he said, was wear comfortable shoes,” Cruz said. “And I would note Senator Paul observed that the last time he did that, he didn’t follow this advice. He hadn’t planned to speak as long as he had. He told me his feet hurt for two weeks. And I will confess it was to my great shame I’m wearing today my argument boots which I wear every day on the Senate floor. But when I filibustered on Obamacare, I shamefully left my boots in the closet and went and purchased black tennis shoes. And as the hours wore on, I was very, very grateful that I had abided by Senator Paul’s good advice and wore the tennis shoes.\n“And I would note as I’m sitting here today that the good senator is wearing tennis shoes today. So I’m glad to see that he followed his own advice, and I have no doubt that his calves and thighs will thank him tonight and in the morning.\n“The second bit of advice Senator Paul gave me was drink very, very little water. Now that was advice, he acknowledged, likewise he had not followed in his own filibuster. And I will note not too long ago I was sitting in the president’s chair presiding, and the entire hour I was there, there was a glass of water on Senator Paul’s desk and he did not drink a sip of it. I would note that was advice I endeavored to follow. It was good advice and I’m glad to see my friend is following it as well.”\nCruz wrapped his question to Paul—the procedure necessary to speak for as long as he did giving Paul a break—by noting that the NSA issue “is an exceptionally important issue that this body should be focused on.”","url":"https://www.breitbart.com/politics/2015/05/20/ted-cruz-stands-with-rand-paul-on-nsa-filibuster/"}
