{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 21:49:53","date_modify":"2018-10-30 21:49:53","date_publish":"2018-06-17 14:25:32","description":"Senator Ted Cruz (R-TX) defeated ABC late-night talk show host Jimmy Kimmel 11-9 on Saturday, in a game of one-on-one-basketball.","filename":"data/vaneerConsumption/TedCruzDefeatsJimmyKimmelinCharityBasketballGame.json","image_url":"https://media.breitbart.com/media/2018/06/AP-Cruz.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_06_17__1540936193.html","title":"Ted Cruz Defeats Jimmy Kimmel in Charity Basketball Game","title_page":"Ted Cruz Defeats Jimmy Kimmel in Charity Basketball Game | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senator Ted Cruz (R-TX) defeated ABC late-night talk show host Jimmy Kimmel 11-9 on Saturday, in a game of one-on-one-basketball.\nThe game, intended to benefit the charity of the winner, had been originally slated to end when the first player reached 15 points. However, because of the slow pace due to the relative lack of athletic grace on the floor, Cruz and Kimmel agreed to call it at 11.\nThy agreed to go to 11 instead of 15 because they were taking so long. https://t.co/hooMxg4fNf — Patrick Svitek (@PatrickSvitek) June 17, 2018\nThe idea for having the game sprung from a segment on Kimmel’s show — Jimmy Kimmel Live! — where the late-night host made fun of Cruz for appearing at a Rockets playoff game with a a “super cool T-shirt over the polo look.”\nThat jab prompted Cruz to issue a challenge to Kimmel, demanding that they “settle this man-to-man.”\n.@jimmykimmel All right, Big Guy…you talk a good game. You besmirched my support for the @HoustonRockets So let’s settle this man-to-man: one-on-one, hoops (or “ring-ball,” if you prefer). The loser gives $5k to the (non-political) charity of the winner’s choice. https://t.co/BWvAP5VOtM — Ted Cruz (@tedcruz) May 31, 2018\nAs if it wasn’t bad enough that Kimmel lost to a man who once famously referred to a basketball hoop as a “ring,” the late-night host couldn’t help but take one more jab at Cruz after the game:\n.@JimmyKimmel to @TedCruz, post-game: “You’re a good sport. I still think you’re a terrible senator.” — Patrick Svitek (@PatrickSvitek) June 17, 2018","url":"https://www.breitbart.com/sports/2018/06/17/ted-cruz-defeats-jimmy-kimmel-charity-basketball-game/"}
