{"authors":["Mike Flynn"],"date_download":"2018-10-30 19:53:42","date_modify":"2018-10-30 19:53:42","date_publish":"2015-12-09 03:22:34","description":"The Cleveland Plain Dealer has been trying to interview Democrat Senate candidate Ted Strickland about his views on gun control.","filename":"data/vaneerConsumption/TedStricklandTooBusyFundraisingtoDiscussGunControl.json","image_url":"https://media.breitbart.com/media/2015/04/strickland-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_08__1540929222.html","title":"Ted Strickland 'Too Busy Fundraising' to Discuss Gun Control","title_page":"Reporter: Ted Strickland 'Too Busy Fundraising' to Discuss Gun Control","title_rss":"NULL","source_domain":"breitbart.com","text":"Stephen Koff, Washington Bureau Chief for the Cleveland Plain Dealer has been trying to interview Democrat Senate candidate Ted Strickland about his views on gun control in light of the terrorist attack in San Bernardino.\nAccording to Koff, Strickland has “been too busy with meetings or traveling for fundraising to have that conversation with a reporter, his representatives say.”\nIt is hard to imagine any issue more prevalent in the minds of Ohio voters than the latest terrorist attack in America and possible legislative responses to this renewed threat. Whether it is proposals to limit refugees from Syria and Iraq or further restrict America’s gun laws, a candidate for public office ought to be able to discuss their position on these proposals.\nBeing unavailable for comment because of travel or fundraising just doesn’t cut it in our modern media world.\nFormer Ohio Governor Ted Strickland is challenging freshman GOP Sen. Rob Portman for the U.S. Senate in 2016. Strickland, who lost re-election to current Gov. John Kasich, was a top recruit for Senate Democrats hoping to wrest control of the Senate.\nStrickland’s views on new proposals by President Obama and other Democrats to further limit gun rights is especially important because he has a long history of supporting gun rights. While serving in the House of Representatives, Strickland voted against an assault weapons ban. He has consistently earned an A or A+ from the NRA.\nKoff notes that Strickland now says he supports new gun control measures and would even back a proposal to block people on the terror watch list from purchases firearms. As Koff notes, “that means he has changed his mind.”\nAccording to Koff, Strickland’s staff told the reporter that “he was thinking about the issue and finally changed his mind after December 2012 carnage that killed 20 first-graders and six adults at Sandy Hook Elementary School in Newtown, Connecticut.”\nThe Cleveland Plain Dealer is the largest newspaper in Ohio. If Strickland truly had a conversion on the gun issue, then he owes it to the citizens of Ohio to discuss his new position on gun rights. Converts to a position are usually eager to discuss their new beliefs.\nMoreover, the terrorist attacks in San Bernardino brought into full focus the renewed terrorist threat our nation faces. Ensuring public safety is the first duty of all elected officials. If the new gun control proposals are so important in the fight against terrorism, one would expect a seasoned candidate like Strickland to do all he could to promote the new policy.\nEven fundraising can take a back seat to such an important task.","url":"https://www.breitbart.com/politics/2015/12/08/reporter-ted-strickland-busy-fundraising-discuss-gun-control/"}
