{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:18:20","date_modify":"2018-10-30 20:18:20","date_publish":"2015-12-21 21:04:37","description":"Four people have been arrested in Texas for human trafficking of a sixteen-year-old girl. Three have also been charged with sexual assault.","filename":"data/vaneerConsumption/TeenageGirlSoldasSexSlaveinTexasfor4000SayPolice.json","image_url":"https://media.breitbart.com/media/2015/12/Empty-Bed.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_21__1540930700.html","title":"Teenage Girl Sold as Sex Slave in Texas for $4,000, Say Police","title_page":"Teenage Girl Sold as Sex Slave in Texas for $4,000, Say Police","title_rss":"NULL","source_domain":"breitbart.com","text":"Four people have been arrested in San Antonio for the alleged human trafficking of a sixteen-year-old teenage girl. Three of them have been charged with sexual assaulting her.\nThe girl told authorities a couple sold her to another couple for $4,000 when she would not have sex with other people, according to the San Antonio Express-News.\nThe pair who allegedly “bought” the girl, reportedly gave her drugs and got her intoxicated. They allegedly had sex with her and forced her to have sex with others.\nRebecca Nicole Alvarez (22), Christopher Castoreno (34), Veronica Ann Diaz (26), and Adrian Colon (44) have been charged with trafficking.\nAlvarez, Castoreno and Diaz have also been charged with sexual assault, and Colon has been charged with attempted sexual assault, according to the San Antonio publication.\nSan Antonio law enforcement officers responded to a call at a pawn shop where the 16-year-old victim told them that she was being followed by Alvarez and Castoreno. She told officers that she had been sexually assaulted and held against her will, said a SAPD spokesman to the local newspaper.\nA mutual friend was reported to have introduced the young girl to Colon and Diaz who allegedly forced her to have sex with them. They asked the teenager to have sex with others but after she refused, they were said to have sold her to Alvarez and Castoreno for $4,000.\nAlvarez and Castoreno then allegedly gave her drugs and got her intoxicated and then “forced her to have sex with other people at various locations around town,” the SAPD spokesman said.\nThe Express-News reported that area law enforcement officials are working to find any others who were involved in the reported trafficking of the minor girl.\nTexas Governor Greg Abbott signed Texas House Bill 10 into law in June. The bill amended Texas law as it relates to trafficking and prostitution laws for offenders, victims, and witnesses.\nAmong other things, HB 10 eliminated the statute of limitations for compelling prostitution of children. It also provides that evidence or testimony can be compelled from a trafficking offender; however, it would exempt them for prosecution except for aggravated perjury. Those convicted or adjudicated of the offense would also be subject to sex offender registration.\nThe bill, effective September 1, 2015, was authored by Representative Senfronia Thompson. The bill was sponsored by Senator Joan Huffman (R-Houston) and co-sponsored by Sen. Paul Bettencourt (R-Houston) and others.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/politics/2015/12/21/teenage-girl-sold-sex-slave-texas-4000-say-police/"}
