{"authors":["Press Association"],"date_download":"2018-10-23 02:12:53","date_modify":"2018-10-23 02:12:53","date_publish":"2017-03-10 11:08:05","description":"Nineteen-year-old Marcel Hesse made a comprehensive confession following his arrest.","filename":"data/vaneerConsumption/Teenageradmitskillingboyand22yearoldfriend.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/16/wire-197071-1489165090-625_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300826_Apartment-examined-second-body-amid-boy-killing-probe_1540260773.html","title":"Teenager `admits killing boy and 22-year-old friend´","title_page":"Teenager `admits killing boy and 22-year-old friend´ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 19-year-old man arrested over the death of a neighbour’s son has admitted killing the child as well as a 22-year-old acquaintance, prosecutors in western Germany said.\nThe suspect, identified as Marcel Hesse, is said to have blamed his actions on frustration over a rejected bid to join the German army and the recent loss of his internet connection.\nThe case shocked the western German city of Herne after the suspect allegedly circulated photos of the bloodied crime scenes online.\nHundreds of officers spent three days hunting the suspect before he gave himself up on Thursday night.\nA destroyed roller shutter hangs from a burnt-out apartment window in Herne (Marcel Kusch/dpa/AP)\nBochum prosecutor Danyal Maibaum said Hesse made a comprehensive confession following his arrest and is being held on suspicion of murder.\nHesse allegedly lured a nine-year-old boy out of his home under a pretext on Monday, Mr Maibaum said. The child’s body was found in a basement with 52 stab wounds, following a tip from a member of the public.\nHesse called police from a Greek restaurant on Thursday evening to turn himself in, and informed officers of a fire in a nearby apartment.\nPolice found the body of an adult male in the apartment, believed to be a 22-year-old acquaintance of Hesse’s.\nKlaus-Peter Lipphaus, the head of the police homicide department for Bochum, told reporters the suspect was speaking freely to investigators and was “ice cold, emotionless” as he detailed his alleged crimes.\nCandles, flowers and stuffed animals have been placed in front of the home of the murdered 9-year-old boy in Herne (Marcel Kusch/dpa/AP)\nDuring his interview with police, Hesse claimed that he had attempted to kill himself recently after his application to join the German army was rejected and a recent move to a new home resulted in him being unable to access the internet, Mr Lipphaus said.\nHesse said he spontaneously decided to kill somebody else after he failed to take his own life and sought out the neighbour’s child, Mr Lipphaus added.\nAfter killing the child, Hesse contacted a nearby friend, Mr Lipphaus said. They ate dinner and played computer games together before Hesse killed the 22-year-old the following morning, he said.","url":"https://www.dailymail.co.uk/wires/pa/article-4300826/Apartment-examined-second-body-amid-boy-killing-probe.html"}
