{"authors":[],"date_download":"2018-10-22 22:46:01","date_modify":"2018-10-22 22:46:01","date_publish":"2014-05-12 18:13:30","description":"The teen who allegedly plotted a school attack will undergo a psychological evaluation before the judge decides if he will be tried as an adult.","filename":"data/vaneerConsumption/TeenSaidtoHavePlottedSchoolAttackPleadsNotGuilty.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/415201/140501-john-ladue_-2237_59fbb10b9cec9b5e881004eca7cb1b0d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_teen-said-have-plotted-school-attack-pleads-not-guilty-n103411_1540248361.html","title":"Teen Said to Have Plotted School Attack Pleads Not Guilty","title_page":"Teen Said to Have Plotted School Attack Pleads Not Guilty","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe 17-year-old accused of plotting to kill his family and attack students at his Minnesota high school will have to undergo a psychological evaluation before a judge determines whether he will be tried as a juvenile or an adult.\nJohn LaDue submitted a \"denial\" plea to 12 counts brought against him when he was caught with an arsenal of explosives and firearms, and a book detailing a plot to kill \"as many students as he could\" on May 1, according to court documents.\nA denial plea is the juvenile court equivalent of a not guilty plea, but prosecutors are seeking to try LaDue as an adult to secure a maximum prison sentence. If tried as a child, LaDue would walk free in four years or less.\nThe judge in the case decided LaDue will partake in an extensive certification study to determine whether or not he should be charged as an juvenile, according to NBC affiliate KARE.\nThe study will include a psychological examination that is expected to take several weeks, KARE reported. The judge also ruled that while the study is conducted, LaDue will remain in a juvenile facility so that he can be close to his parents and continue his studies.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/us-news/teen-said-have-plotted-school-attack-pleads-not-guilty-n103411"}
