{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-22 23:28:32","date_modify":"2018-10-22 23:28:32","date_publish":"2016-01-28 12:22:13","description":"Daredevil skydiver Anastasia Barannik, 19, from Russia, showcased her unbelievable talent with an array of acrobatic dance moves as she plummeted through the air.","filename":"data/vaneerConsumption/Teenageskydivershowcasesheracrobaticdancemovesintheair.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9FEE300000578-0-image-a-16_1453981013739.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420790_Dancing-14-000-feet-Teenage-skydiver-showcases-graceful-acrobatic-moves-plummeting-earth_1540250912.html","title":"Teenage skydiver showcases her acrobatic dance moves in the air","title_page":"Teenage skydiver showcases her acrobatic dance moves in the air | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A daredevil skydiver showcased her unbelievable talent with an array of acrobatic dance moves as she plummeted through the air.\nAnastasia Barannik has racked up an impressive 500 jumps to date - despite having only two years' experience of competitive freestyle skydiving under her belt.\nThe 19-year-old Russian has also had to overcome personal tragedy after her former coach, Russia's national champion Vilegzhanin Nikolay, passed away after a BASE jump accident.\nPoint your toes: Daredevil skydiver Anastasia Barannik has racked up an impressive 500 jumps to date\nBrave: The 19-year-old Russian has had to overcome personal tragedy after her former coach passed away after a BASE jump accident\nTop of the world: Anastasia showcased her unbelievable talent with an array of acrobatic dance moves\nShe said: 'He taught me a lot in the wind tunnel. It's really hard for me to realise that he is no longer with us.\n'I'm sure he's is still watching and helping me from heaven.'\nBut despite the personal heartbreak and a year out of the sport, Anastasia is now hoping to follow in his footsteps by becoming the country's top freestyle skydiver.\nThe footage shows Anastasia competing during the 2015 freestyle skydiving World Cup in the Netherlands and in the Russian Nationals.\nAll smiles: The fearless teenager poses beside her trusted cameraman Igor Kalinin in Moscow, Russia\nBig dreams: Anastasia is now hoping to follow in the footsteps of her late trainer, Russia's national champion Vilegzhanin Nikolay, by becoming the country's top freestyle skydiver\nMulti-talented: Anastasia is a student at Sratov University of Economics in her native Russia and an accomplished gymnast and ballroom dancer\nAnastasia, who is a student at Sratov University of Economics in her native Russia, also revealed the preparation behind her acrobatic moves.\nShe said: 'I started a special programme to prepare and train some cool moves, it's really helped.'\nAn accomplished gymnast and ballroom dancer, the young skydiver has used her previous sporting experience to give her an edge against her competitors.\nShe said: 'My first competition took place in July 2015, this was an open cup of Moscow where I took second place. Next I went to the World Cup 2015 in Holland where I took fourth place.\nHopes: The skydiving student is determined to make the people that have helped her on her incredible journey proud by winning the World Championship\nProdigy: Anastasia, practising her acrobatic moves, said her late coach taught her a lot in the wind tunnel\n'This is a great victory for me, for the girl who started training recently.'\nWith a promising career ahead of her, the skydiving student is determined to make the people that have helped her on her incredible journey proud by winning the World Championship in Chicago later this year.\n'I have to live up to all those hopes of people helping me achieve the goal, supporting me and believing in me,' said Anastasia.\nThe athletic skydiver has used her previous sporting experience to give her an edge against her competitors","url":"https://www.dailymail.co.uk/news/article-3420790/Dancing-14-000-feet-Teenage-skydiver-showcases-graceful-acrobatic-moves-plummeting-earth.html"}
