{"authors":[],"date_download":"2018-10-22 22:52:00","date_modify":"2018-10-22 22:52:00","date_publish":"2014-05-12 21:49:03","description":"One teenager wanted to help a friend who lacked reliable electricity; her resulting invention could have implications for millions.","filename":"data/vaneerConsumption/TeenInventorsBrightIdeaMayLightUptheWorld.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437531/ann_hollowflashlight_18b2be347d56c8697954bc0f1b292136.1200;630;7;70;5.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_teen-inventors-bright-idea-may-light-world-n103601_1540248720.html","title":"Teen Inventor's Bright Idea May Light Up the World","title_page":"Teen Inventor's Bright Idea May Light Up the World","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAnn Makosinski grew up tinkering. Her parents encouraged her to explore her interests, which often involved taking apart her toys and gadgets to learn how they worked.\nBy the time she reached sixth grade, Ann had entered her first science fair and was on her way to becoming a budding inventor. So when she learned her friend in the Philippines was doing poorly in school because she lacked reliable electricity and light at night to study, Ann -- who is half Filipino -- started thinking: What if she could invent a reliable light source for her friend, one that didn’t need to be powered by the sun?\nShe got to work, and within months came up with an answer. She created a flashlight that could run off of the warmth of one’s hands. She called it “Hollow Flashlight” and won a 2013 Google Science Fair award for the creation.\nNow the 16-year-old teenager is participating this week in the Intel International Science and Engineering Fair in Los Angeles, Calif., with a new invention in tow. She’s created a head lamp that uses body heat and includes a charging unit, allowing it to store a charge during the day and be switched on when needed.\nAnd it was all sparked by her friend in the Philippines.\n\"When something happens to someone you know, it usually affects you more and it opens your eyes,\" Ann said. \"Something like this could happen to people all around the world.\"\nBelow, check out Harry Smith’s sneak peek of the gadget at Ann’s home in Victoria, British Columbia.","url":"https://www.nbcnews.com/nightly-news/teen-inventors-bright-idea-may-light-world-n103601"}
