{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:33:14","date_modify":"2018-10-30 23:33:14","date_publish":"2014-08-13 16:51:01","description":"Good news, those of you who enjoyed the original Teen Mom but thought Teen Mom 3 was an utter trainwreck! (A.K.A., me.) According to Us Weekly, most of the cast of the original Teen Mom is returning for a new season, meaning we've all got another…","filename":"data/vaneerConsumption/TeenMomSeason5IsHappeningButOneStarWontBeIncluded.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2969a0fa-71d6-49c5-a604-0eb499bb0853.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35617-teen-mom-season-5-is-happening-but-one-star-wont-be-included_1540942394.html","title":"'Teen Mom' Season 5 Is Happening, But One Star Won't Be Included","title_page":"'Teen Mom' Season 5 Is Happening, But One Star Won't Be Included","title_rss":"NULL","source_domain":"bustle.com","text":"Good news, those of you who enjoyed the original Teen Mom but thought Teen Mom 3 was an utter trainwreck! (A.K.A., me.) According to Us Weekly, most of the cast of the original Teen Mom is returning for a new season, meaning we've all got another chance to catch up with season 1 teen moms Catelynn Lowell, Maci Bookout, and Amber Portwood with all new episodes. Sure, it's not the whole gang, but considering that for it to be the whole gang, Farrah Abraham would have to be involved, I'm totally fine with that. Because she is awful.\nThe new season will include a whole bunch of new episodes, and will also include a very special catch-up special to fill us all in on what the girls have been doing since their last season aired in 2012. This should be interesting and fun to watch for any Teen Mom devotees, but really, we kind of already know what's been going on, don't we? Like...Amber Portwood was in prison. Maci has red hair, and a new boyfriend! Catelynn is pregnant again. There, now we're all caught up — can we have the new season now?\nSadly, not for a while: The new season won't air until 2015. But, still, it's happening, and, again, there's no Farrah Abraham involvement! That's something.","url":"https://www.bustle.com/articles/35617-teen-mom-season-5-is-happening-but-one-star-wont-be-included"}
