{"authors":["Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 03:07:13","date_modify":"2018-10-23 03:07:13","date_publish":"2017-04-26 14:35:08","description":"Jacob Arter, 18, died early Sunday morning at St. Joseph's Hospital in Breese, Illinois. He was rushed to the hospital after he was hit by a former football teammate and collapsed.","filename":"data/vaneerConsumption/Teendiesafterbeingpunchedbyformerfootballteammate.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FFA8E00000578-0-image-a-27_1493213839409.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447612_Teen-dies-punched-former-football-teammate_1540264033.html","title":"Teen dies after being punched by former football teammate","title_page":"Teen dies after being punched by former football teammate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An 18-year-old high school senior less than a month from graduation died this weekend, after being punched once by a former football teammate at a bonfire.\nJacob Arter was attending a large party at a rural clubhouse in Breese, Illinois early Sunday morning around 1.30am when a former football teammate, 17, approached him and hit him.\nThe Central Community High School student then collapsed to the ground and became unresponsive.\nAnother party-goer, Dakota Leroy, drove Arter to the hospital while another young man administered CPR in the back of his car.\nScroll down for video\nJacob Arter (pictured) died early Sunday morning after he was punched once by a former football teammate at a bonfire party in Breese, Illinois\nA 17-year-old suspect was arrested after the incident. He has not been named, but reportedly played football with Arter before losing eligibility due to his poor grades\n'I had a kid tell me that there was a kid messed up pretty bad on the ground, he was unconscious,' Leroy told KSDK. 'So, I ran over to him, tried to help him the best I could, tried to get everyone away from him to give him air, and told people to get two or three bigger guys, put him in the back seat of my car, I told another kid to give him CPR on the way to the hospital.'\nArter was later pronounced dead at the hospital, around 2.24am on Sunday.\nOn Monday, authorities announced that a suspect has been arrested and placed in juvenile hall.\nThe suspect has not been identified by name, but authorities say he played football with Arter at Central before he lost eligibility due to his poor grades and had to transfer to an alternative school.\nArter was just 20 days from graduating high school when he died. He planned to play football at Illinois College.\nCentral Community High School Superintendent Kevin Meyer called Arter a 'bright student' who was enrolled in upper level courses.\nAbove, a view of the 2016 Central Community High School football team. Arter is pictured right of center, in the front row, number 59\n'He was a good teammate and a bright young man just going through life,' Meyer told the Belleville News-Democrat. 'We send our sympathies and condolences to the family.'\nHis family were members of the Cross Victory Church in Pocahontas and Arter worked part-time at PJ's Restaurant in Breese.\n'He was very smart and nice. People liked to be around him and he was very involved in school. He played football and he did activities in school,' schoolmate Shawnee Zimmer told Fox 2 St. Louis. 'I was very shocked. I didn’t think that would ever happen here in the community.'\nClinton County police continue to investigate the incident. An autopsy took place on Monday but it will be several weeks before the medical examiner has the exact cause of death.\n'Our detectives have been working since I called them out this morning,' Sgt. Dennis Perez with the Clinton County Sheriff's Office said Monday. 'Diligently interviewing everyone that they can identify as having been at the party, whether they had seen anything or had not seen anything, so that we can determine if they have any evidentiary value to the case.'\nArter (left and right) was just 20 days away from graduation when he died. He planned to play football at Illinois College\nWhen the investigation is finished, they will turn it over to prosecutors.\nThe Clinton County State's Attorney John Hudspeth has appointed a special prosecutor to the case since he is related to the suspect.\n'I have had a close relationship with many members of the suspect’s family for decades,' Hudspeth said, according to the Belleville News-Democrat. 'In order to avoid any claim of error which might result from a conflict of interests, and to avoid the appearance of impropriety, I had no choice but to ask the court to appoint a special prosecutor.'\nArter's funeral has been scheduled for Thursday. He is survived by his parents James and Suzanne Arter and sister Brittany Arter.","url":"https://www.dailymail.co.uk/news/article-4447612/Teen-dies-punched-former-football-teammate.html"}
