{"authors":[],"date_download":"2018-10-30 17:57:30","date_modify":"2018-10-30 17:57:30","date_publish":"2018-06-27 15:54:30","description":"Atlanta police are investigating what led a teenager to run onto the runway of Hartsfield-Jackson At...","filename":"data/vaneerConsumption/TeenaccusedofrunningontoAtlantaairportrunwaygrantedbond.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Atlanta_Wsbtv/2018/06/27/Images/778179052_TarmacGuy4_1530053086860_12111657_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_teen-accused-run_f2ebfb3b5a8b74cbc4469b6eb936c6bc__1540922250.html","title":"Teen accused of running onto Atlanta airport runway granted bond","title_page":"Teen accused of running onto Atlanta airport runway granted bond","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta police are investigating what led a teenager to run onto the runway of Hartsfield-Jackson Atlanta International Airport.\nJhyrin Jones, 19, made his first appearance in court Wednesday morning.\nJones is accused of going over a fence and running up to a plane, where he jumped on the wing and pounded on windows.\nJones continued some of his bizarre behavior in court, sometimes staring at Channel 2’s Steve Gehlbach and our cameras.\nAt one point, he was even smiling.\nSuspect arrested after running onto runway at Hartsfield Jackson made 1st app in court. Judge gave 19 yo Jhyrin Jones $18k bond. See how the teen acted in the courtroom LIVE at 12p pic.twitter.com/nitGhsZI1d — Steve Gehlbach (@SteveGWSB) June 27, 2018\nHe was given an $18,000 bond.\nJones is charged with criminal trespassing, obstruction of law enforcement, damage to property and public indecency for exposing himself to passengers, police said.\nCell phone video from those on the Delta flight that had just landed at Hartsfield-Jackson Atlanta International Airport Tuesday afternoon shows Jones run up to the plane with bare feet and only wearing underwear.\nHe was eventually arrested by a swarm of officers and seemed to give up peacefully, the video showed.\nThe judge read part of Jones' arrest warrant Wednesday:\n“You made numerous attempts to get away from officers by kicking the patrol vehicle and throwing your body around, including a back flip while being placed into a patrol car,” a judge said.\nTRENDING STORIES:\nPolice said someone saw Jones scale a barbed wire fence and run onto the tarmac, and then the runway.\nThey called to report it, and Jones was taken into custody in a matter of minutes, police said.\nAtlanta police Maj. Timothy Peek said Wednesday he was pleased with the quick response to the incident.\n“I believe the system worked. Now we look and see if we can enhance it in any way,” Peek said.\nHe said police will review how it was all handled and see if there are any lessons for the future.\n\"Once it's all over and once we have all the facts and circumstances, we'll go back and have an after-action review,\" Peek said.\n“Five minutes is not a bad response time. Can we do better? That depends on the situation and the information we receive,” Peek added.\nJones was taken from the airport with some minor injuries, which police said included minor cuts and scrapes, Peek said.\nHe said Jones’ demeanor once he was taken into custody was unusual, and that police will look into what his motivation may have been, or if he was having some kind of an episode or has an illness.\nThere is camera footage of Jones jumping the barbed wire fence, which Peek said police will examine.\nHe said the first notification to the man on the tarmac, however, was from a vigilant employee.","url":"https://www.ajc.com/news/local/teen-accused-running-onto-atlanta-airport-runway-granted-bond/A6MfBGmyJXVkkgrsTX20sK/"}
