{"authors":[],"date_download":"2018-10-22 20:43:04","date_modify":"2018-10-22 20:43:04","date_publish":"2014-05-03 10:37:00","description":"Yahya Abdi, rhe 15-year-old stowaway who survived a 5 1/2-hour flight from California to Hawaii in a jet's wheel well, has left the state.","filename":"data/vaneerConsumption/TeenStowawayYahyaAbdiLeavesHawaii.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_25/369941/140421-hawaii-stowaway-flight-8a_bef75a5c07ca1158fe5510f88c725384.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hawaii-stowaway_teen-stowaway-yahya-abdi-leaves-hawaii-n96226_1540240984.html","title":"Teen Stowaway Yahya Abdi Leaves Hawaii","title_page":"Teen Stowaway Yahya Abdi Leaves Hawaii","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe 15-year-old stowaway who miraculously survived a 5 1/2-hour flight from California to Hawaii in a jet's wheel well has left the state, an official there said late Friday.\nHawaii Department of Human Services spokeswoman Kayla Rosenfeld said Yahya Abdi was \"no longer in Hawaii.\"\nHer brief emailed statement did not specify how or when Yahya Abdi left, who he traveled with or where he went.\n\"The State of Hawaii Department of Human Services, Child Welfare Branch has no further involvement in this case,\" she said.\nThe boy's father, Abdilahi Yusuf, arrived in Hawaii this week from the family's home in Santa Clara, California, to bring him back.\nRosenfeld had said previously that the teen was in a Honolulu hospital after being transferred to state custody from the Maui airport, where he was questioned by FBI and airport officials following the April 20 flight from san Jose airport.\nThe youth withstood the flight inside the Boeing 767's wheel well at 35,000 feet despite freezing cold and a lack of oxygen.\nThe Associated Press contributed to this report.\nJustin Kirschner and Alastair Jamieson","url":"https://www.nbcnews.com/storyline/hawaii-stowaway/teen-stowaway-yahya-abdi-leaves-hawaii-n96226"}
