{"authors":["Lauren Barbato"],"date_download":"2018-10-30 23:09:44","date_modify":"2018-10-30 23:09:44","date_publish":"2014-08-14 01:29:09","description":"Every kid's dream is to live at the mall — play with all the toys, try on all the clothes and sleep in the fancy display beds. While this Texas teenager didn't technically achieve that dream, he came pretty damn close. CBS Dallas/Fort Worth reported…","filename":"data/vaneerConsumption/TeenSetsUpWalmartFortLivesThereForTwoWholeDaysPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/16ae443e-25d3-4dea-b324-661bceb0174c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35711-teen-sets-up-walmart-fort-lives-there-for-two-whole-days-photos_1540940984.html","title":"Teen Sets Up Walmart Fort, Lives There For Two Whole Days - PHOTOS","title_page":"Teen Sets Up Walmart Fort, Lives There For Two Whole Days — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Every kid's dream is to live at the mall — play with all the toys, try on all the clothes and sleep in the fancy display beds. While this Texas teenager didn't technically achieve that dream, he came pretty damn close. CBS Dallas/Fort Worth reported that a teen lived inside a Dallas-area Walmart for two days before being caught by store employees. How did he pull off such a feat? With a makeshift fort, of course.\nThe 14-year-old runaway reportedly built not one, but two secret forts in the Walmart in Corsicana. The crafty campsites were constructed between aisles. According to CBS, one was behind boxes of baby strollers in the baby aisle, while the other was hidden behind stacks of toilet paper and paper towels. And because Walmart is huge and never runs out of stock, no one saw him for more than two days.\nBut it gets better: The teen made an opening in the wall of the food aisle so he could grab juice whenever he needed it. He also had a makeshift bed, and stowed away several different outfits so he could change his appearance to trick store employees. Not bad, kid.\nThere is one gross part of this story, however: The young Walmart inhabitant reportedly wore diapers instead of going to the store restroom because he was so afraid of getting caught. That's some commitment.\nA spokesperson for the retailer giant said the Walmart stowaway had his cover blown when an employee saw him leave his baby aisle fort. When the employee went to check the hideaway, he found a pile of trash and other items. \"Normally if there's a child missing in a store we're actively looking for that child. But it's a different matter when employees are unaware a child is missing,\" the spokesperson said, as quoted by The Associated Press.\nAuthorities said the 14-year-old ran away from his aunt's house on July 28, while his parents were out of town. The teen then went to the Corsicana Walmart, making it his home. The teen's mother was contacted. According to CBS Dallas/Fort Worth, authorities said the Child Protective Services were not contacted because he reportedly has a habit of running away from home, and there was no apparent abuse or harm in his case.\nIt's still unclear why the teen chose Walmart as his new home, but it makes sense — it really does have every little thing you need, and then some. Below are some more photos of the Texas teen's Walmart fort adventures . . .\nScreenshots: CBS Dallas/Fort Worth","url":"https://www.bustle.com/articles/35711-teen-sets-up-walmart-fort-lives-there-for-two-whole-days-photos"}
