{"authors":["Kate Snow"],"date_download":"2018-10-22 22:20:49","date_modify":"2018-10-22 22:20:49","date_publish":"2014-06-09 00:00:00","description":"Hunter Gandee and his younger brother, Braden, raised awareness about Cerebral Palsy during a two-day walk through heat and rain.","filename":"data/vaneerConsumption/TeenCarriesHisYoungerBrotherfor40Miles.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/458556/140521-today-carrying-brothers-2102_7d6b74afc4265b420f1765c3831d8297.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_making-a-difference_teen-carries-his-younger-brother-40-miles-n126616_1540246849.html","title":"Teen Carries His Younger Brother for 40 Miles","title_page":"Teen Carries His Younger Brother for 40 Miles  - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Play Facebook\nTwitter\nEmbed Two Brothers’ Unforgettable 40-Mile Journey 3:01 autoplay autoplay Copy this code to your website or blog\nBraden and Hunter Gandee already had a special brotherly bond. But it was made all the stronger this weekend.\nSeven-year-old Braden was born with cerebral palsy, a condition that makes the muscles in his legs difficult to control. He wears braces and can only walk with the aid of a walker. For years, his 14-year-old brother Hunter has been like a “second pair of legs” to Braden, their mom, Danielle Gandee, said. Hunter picks Braden up and carries him piggyback-style whenever the little guy needs a lift.\nOn Saturday, the two brothers set off on a 40-mile journey from their hometown near the Michigan-Ohio border to the University of Michigan campus in Ann Arbor -- with Braden once again on Hunter’s back -- to raise awareness about cerebral palsy.\nIt sure got people talking.\n@HunterGandee is one of the best big brothers ever to the awesome and hilarious Braden Gandee, who has Cerebral Palsy. #cerebralpalsyswagger — Benjamin Hannigan (@benji822) June 8, 2014\nthis is superman️ absolutely inspiring, glad to call him my friend @HunterGandee pic.twitter.com/Dht7wYra5v — Alexis Graham (@AlexissGrahamm) June 9, 2014\nAll along the route people joined in and cheered them on. Kids held up hand-made signs.\nThe brothers called their walk the \"Cerebral Palsy Swagger.\" It was not designed to raise money, though they encourage people who do want to contribute financially to CP research to go to the Cerebral Palsy Research Consortium of Michigan, based at the University of Michigan.\nInstead, the Gandee boys are simply hoping their journey will prompt researchers to find better ways to help children with CP.\nPlay Facebook\nTwitter\nEmbed My Brother Is the ‘Best Friend I Could Ever Have’ 1:29 autoplay autoplay Copy this code to your website or blog\n\"We just want people to know about cerebral palsy,\" Hunter Gandee said. \"There are a lot of people out there who have never heard of cerebral palsy. And then there is also a lot of people who have heard about cerebral palsy, but they're not really sure what exactly it is. We're just trying to inform them.\"\nWant to catch up on the day’s news? Sign up for the Nightly Perspective: one email each evening with the top stories from Brian Williams and the Nightly News team.","url":"https://www.nbcnews.com/feature/making-a-difference/teen-carries-his-younger-brother-40-miles-n126616"}
