{"authors":["John Binder"],"date_download":"2018-10-30 21:01:14","date_modify":"2018-10-30 21:01:14","date_publish":"2017-01-12 22:40:19","description":"A 14-year-old student allegedly hoaxed a Twitter threat from a social media account that she claimed was the Ku Klux Klan (KKK).","filename":"data/vaneerConsumption/TeenAllegedlyPostsKKKTwitterThreat.json","image_url":"https://media.breitbart.com/media/2017/01/kkktweet.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_01_12__1540933274.html","title":"Teen Allegedly Posts 'KKK' Twitter Threat","title_page":"Hate Hoax: Teen Allegedly Posts 'KKK' Twitter Threat","title_rss":"NULL","source_domain":"breitbart.com","text":"A 14-year-old student allegedly hoaxed a Twitter threat from a social media account that she claimed was the Ku Klux Klan (KKK).\nThe teenager has been charged by the Anne Arundel County Police Department with a juvenile citation after she allegedly tweeted out “We’re planning to attack tomorrow” from a Twitter account police say she created, named “@KoolkidsKlanKkk,” according to CBS Baltimore.\nAnne Arundel police said they worked with Twitter to find the identity of the individual who sent out the threatening message, ultimately leading them to the 14-year-old African-American student.\nPolice officials have interviewed the teenager, saying she admitted to creating the Twitter account and sending the threatening message.\nAfter being charged by police with a juvenile citation for allegedly disrupting school activities, the teenager was released to her parents.\n“I kind of felt unsafe at the school and a little hurt,” Arundel High School Freshman Taylor Nash told CBS Baltimore.\nAnne Arundel County Public Schools Superintendent George Arlotto said he was thankful police were able to identify the teenager who allegedly made the threat and Twitter account.\n“I want to thank Police Chief Tim Altomare, State’s Attorney Wes Adams, County Executive Steve Schuh, and their staffs for their thorough and expeditious work to identify a suspect in the online post that threatened violence at Arundel High School this week,” Arlotto said in the statement. “The anonymity of the internet provides a murky and complex disguise for many who want to threaten the safety and security of our communities.”\n“Our partners in the Police Department and county government peeled back that disguise quickly in this case, in the process reassuring parents, students, and staff that our schools are safe places in which to educate our children,” Arlotto continued.\nJohn Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/border/2017/01/12/hate-hoax-teen-allegedly-posts-kkk-twitter-threat/"}
