{"authors":["Associated Press"],"date_download":"2018-10-23 01:14:48","date_modify":"2018-10-23 01:14:48","date_publish":"2016-01-29 15:02:46","description":"LAGOS, Nigeria (AP) — The bombers in the northeastern town from which Boko Haram abducted scores of schoolgirls were men wearing hijabs with explosives strap...","filename":"data/vaneerConsumption/Teenagesuicidebomberkills8inNigeriaRedCross.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422765_Nigerian-army-Chibok-bombers-men-disguised-women_1540257288.html","title":"Teenage suicide bomber kills 8 in Nigeria _ Red Cross","title_page":"Teenage suicide bomber kills 8 in Nigeria _ Red Cross | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Teenage suicide bomber kills 8 in Nigeria _ Red Cross\nLAGOS, Nigeria (AP) — The bombers in the northeastern town from which Boko Haram abducted scores of schoolgirls were men wearing hijabs with explosives strapped to their backs to look like babies, Nigeria's military said Friday. A community leader said multiple explosions in Chibok killed 18 people.\nIn a new attack Friday, a teenage boy detonated himself at a market in northeast Gombi town, killing at least eight people and wounding 25, according to local Red Cross official Maikano Abdullahi.\nSuch attacks are blamed on Boko Haram Islamic extremists who have turned to suicide bombings of soft targets since troops last year forced them out of towns and villages.\nThe six-year insurgency has killed some 20,000, driven 2.5 million from their homes and spread across Nigeria's borders. On Monday, four suicide bombers attacked a market and town in northern Cameroon, killing at least 35 people and wounding 65, according to officials who said the bombers came from Nigeria. On Thursday, two female suicide bombers targeted a school in northern Cameroon. Officials said they killed only themselves and wounded some students.\nIn Nigeria's northeastern town of Chibok, one bomber was discovered to be a man wearing a woman's dress when bodies were brought to the hospital, according to a nurse who requested anonymity because he is not authorized to speak to reporters.\nCommunity leader Pogu Bitrus said the toll was higher than originally given: 17 civilians, one soldier and three suicide bombers died in explosions Wednesday.\nBitrus said six bombers entered the town. Military spokesman Col. Mustapha Ank confirmed two were disguised as women.\nChibok and Boko Haram came to the world's attention after the Islamic extremists' mass abduction of schoolgirls in April 2014.\n---","url":"https://www.dailymail.co.uk/wires/ap/article-3422765/Nigerian-army-Chibok-bombers-men-disguised-women.html"}
