{"authors":[],"date_download":"2018-10-22 22:34:56","date_modify":"2018-10-22 22:34:56","date_publish":"2014-05-11 19:26:53","description":"A Sheehan High School student had the prom she never could have imagined this weekend.","filename":"data/vaneerConsumption/TeenBattlingLifeThreateningDiseaseGetsDreamProm.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_teen-battling-life-threatening-disease-gets-dream-prom-n102591_1540247696.html","title":"Teen Battling Life-Threatening Disease Gets Dream Prom","title_page":"Teen Battling Life-Threatening Disease Gets Dream Prom","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Connecticut\nA Sheehan High School student had the prom she never could have imagined this weekend. She can't go to her high school prom because she is sick with cystic fibrosis. The prom she got was even better.\nNurses at Gaylord Hospital in Wallingford, knew Brianna Dragunoff will be missing her high school prom, so they pulled together to help create a special night for Brianna.\n\"We were in her room nine days ago, and just threw the idea out there, messaged our manager, she got back to us that night, and it just took off from there,\" said Nurses Margarita Norris and Courtney Fletcher.\nNorris and Fletcher are Brianna's nurses and have known her as she's been in and out of Gaylord Hospital fighting against the slow progression of cystic fibrosis. Although the illness is keeping her from her high prom, Brianna got one of her own in the hospital.\n\"It's hard not going to your prom, but I mean, it makes it 10 times better being with people you love,\" Brianna said.\nThe photographer, DJ, and catering all came together within hours after Brianna's nurses came up with the idea, but the guest list was left to her. Her friends, family, and people who have become like family to her were invited\n\"Staff that she specifically invited, her Gaylord guest list,\" Norris and Fletcher said.\nThis night to remember comes at a time when Brianna's health has been as challenging as ever.\n\"Her's has progressed very quickly and badly, and she's been critically ill since January,\" said, Cheryl Dragunoff, Brianna' mother.\nBrianna has had multiple surgeries and she's facing another one later this month.\nFor her prom, Brianna chose masquerade as the theme. A chance to be someone else for a night with the room covered in purple, the color of cystic fibrosis month.\n\"Obviously it's important to remember what I have and what I have to deal with, but being here and getting a break from being sick- it's amazing,\" Brianna said.","url":"https://www.nbcnews.com/news/us-news/teen-battling-life-threatening-disease-gets-dream-prom-n102591"}
