{"authors":["Phoebe Jackson-Edwards For Mail Online"],"date_download":"2018-10-23 02:55:21","date_modify":"2018-10-23 02:55:21","date_publish":"2016-01-11 15:28:02","description":"Lucas Hayward, 19, from Leicester, has facial dysplasia and struggles to speak to girls. He went on his first date with Alex, 17, on Channel 4's The Undateables. Alex thought he was 'cool' and 'funny'.","filename":"data/vaneerConsumption/TeenLucaswithfacialdysplasiagoesonhisfirstdateonTheUndateables.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A712D00000578-0-image-a-92_1452517903646.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393805_Teenager-called-elephant-man-facial-defect-fulfills-wish-life-going-date-Undateables_1540263321.html","title":"Teen Lucas with facial dysplasia goes on his first date on The Undateables","title_page":"Teen Lucas with facial dysplasia goes on his first date on The Undateables | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teenager who was called the 'elephant man' by his peers because of a facial defect has gone on his first ever date.\nLucas Hayward, 19, from Leicester, who has facial dysplasia which affects the symmetry and the structure of his face, appears on tonight's The Undateables on Channel 4.\nLucas, who has never had a girlfriend, went out with Alex, 17, and admitted he had a short bucket list - only wanting to go on one date during his lifetime.\nScroll down for video\nLucas Hayward has facial dysplasia which affects the symmetry and the structure of his face. He believes his appearance is part of why he's never had a girlfriend\nThe graphic designer said: 'All my life I've always had people staring and looking and I get very frustrated at the way people will sort of do double takes.\n'I know for a fact my appearance is a factor of not having a girlfriend.'\nAlthough Lucas enjoys to take risks on adventure sports like surfing, scuba diving and motor racing, he clams up and gets nervous when talking to women.\nHe said: 'I've asked a couple of girls to dance. That's when I start to worry. I don't know what to do after that.'\nHis mother Dawn asked him: 'Have you snogged anybody?'\nLucas replied: 'No not yet. I am hoping it's going to happen one day.'\nHis mother also revealed how Lucas was teased at school due to his appearance.\nLucas was perfectly matched with A-level student Alex, who was also on her first date. He appears on The Undateables tonight on Channel 4\nLucas' mother Dawn said he was teased as a child and called the 'elephant man' by other pupils. The teenager admits he was left feeling low and worthless from the name-calling\nDawn said: 'He had a hard time through school he was called 'elephant man' – the children taunting him and bullying him.\n'I know he's anxious, I know he's concerned about the way he looks and as a mum you want to just try and get in there and sort it out, I wish I could waft it away and do something about it.\n'It breaks my heart that he has to deal with that.'\nLucas admitted that his struggle with speaking to girls was partly down to the name-calling.\nHe said: 'I think the way that I look and the fact I've been teased for so many years... it makes me feel like I'm not worth it almost.'\nLucas was perfectly matched with A-level student Alex who was also on her first date, and thought he wads 'cool'.\nThe couple enjoyed an adventurous first meeting at an outdoor sports centre, with both donning harnesses and wearing GoPro cameras to capture the experience.\nLucas really wanted to go on a date and seemed to hit it off with Alex, who called him 'funny' which she said was one of the main things she looked for in the opposite sex\nLucas, right, was one of many people who appeared on the show to find love and he was able to fulfil his wish of going on a date\nAlex said: 'Obviously he's got a facial disfigurement but he looks cool. He's funny, that's what I look for in a guy.'\nOn the date, Alex asked Lucas if he has a bucket list.\nLucas said: 'I think the one thing I wanted to do was go on a date.'\nAlex replied: 'You've completed it.'\nTonight's episode also follows football fan James, from Essex, who has not had a girlfriend in more than ten years.\nThe 32-year-old has a learning disability which has caused found him struggling to meet women.\nTom, 24, from Hampshire, is also looking for love. He has autism and has never kissed a girl or asked a woman out.","url":"https://www.dailymail.co.uk/femail/article-3393805/Teenager-called-elephant-man-facial-defect-fulfills-wish-life-going-date-Undateables.html"}
