{"authors":["Press Association"],"date_download":"2018-10-23 05:09:56","date_modify":"2018-10-23 05:09:56","date_publish":"2017-04-26 16:39:10","description":"Had the bomb gone off, it would have exploded just as passengers were evacuated from the area, prosecutors said.","filename":"data/vaneerConsumption/TeenagerpackedrucksackwithballbearingsandsettimeronTubecourthears.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/21/wire-467721-1493237052-208_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448362_Teenager-packed-rucksack-ball-bearings-set-timer-Tube-court-hears_1540271396.html","title":"Teenager packed rucksack with ball bearings and set timer on Tube, court hears","title_page":"Teenager packed rucksack with ball bearings and set timer on Tube, court hears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A weapons-obsessed teenager plotted carnage in the capital when he planted a homemade bomb on the Tube, a court has heard.\nDamon Smith was 19 when he allegedly packed a rucksack with explosives and deadly ball bearing shrapnel and left it on a train timed to go off within minutes.\nHad the device worked, it would have exploded just as people were being ordered off the Jubilee Line platform at North Greenwich, jurors at the Old Bailey were told.\nThe court heard Smith had a keen interest in Islam, guns, explosives and gambling, and collected pictures of extremists, including the alleged mastermind of the 2015 Paris terror attacks.\nAfter he was arrested, the autistic student admitted making the device but claimed he only meant it to spew harmless smoke as a prank.\nProsecutor Jonathan Rees QC told how Smith grew up in Newton Abbot in Devon and moved to London with his mother in June last year before starting a London Metropolitan University computer course.\nCourt artist sketch of Damon Smith\nAn only child, Smith was diagnosed with Asperger’s syndrome, an autistic condition which can affect the way he interacts with people and result in a lack of empathy.\nBefore the Tube incident, Smith printed off an al Qaida article entitled Make A Bomb In The Kitchen Of Your Mom and made notes in green ink before shredding the sheets of paper, jurors were told.\nHe also allegedly searched the internet for an Islamic State magazine featuring an article about the bomb said to have brought down a Russian airliner in October 2015.\nA shopping list for “pressure cooker bomb materials” was also allegedly found on an iPad ending in a note to “keep this a secret between me and Allah #InspireTheBelievers”.\nOn October 20 last year, Smith boarded a train from Surrey Quays to Canada Water before getting on the westbound Jubilee Line, then going back on himself at Southwark.\nCCTV of Damon Smith on the platform of London Bridge (Metropolitan Police/PA)\nAt 10.49am the defendant, who had a freedom travel pass, got off at London Bridge, leaving behind his rucksack containing the bomb set to explode minutes later at 11.02am.\nThere were at least 10 passengers in the carriage at the time and some of them spotted the bag and reported it when they got to Canary Wharf.\nThe driver took the bag thinking it was lost property and carried on towards North Greenwich, Mr Rees said. It was while he was en route to the next stop that he noticed wire poking out of a clock.\nA search of Smith’s home in Rotherhithe, south London, uncovered a blank-firing self-loading pistol, a BB gun – both bought legally – as well as a knuckleduster and a knife which he showed off in an online video.\nSmith, now 20, denies possession of an explosive substance with intent, contrary to the Explosive Substances Act 1883 but has admitted the lesser offence of perpetrating a bomb hoax.","url":"https://www.dailymail.co.uk/wires/pa/article-4448362/Teenager-packed-rucksack-ball-bearings-set-timer-Tube-court-hears.html"}
