{"authors":["Jessica Calefati","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:25:49","date_modify":"2018-10-30 23:25:49","date_publish":"2016-12-22 01:23:10","description":"In California and across the country, suicide is the second leading cause of death among teens—a grim reminder that many high school students’ primary","filename":"data/vaneerConsumption/TeensuicideclusterspromptmandateforCaliforniaschoolstoconfronttabootopic.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/SUICIDE_PREVENTION_PHOTO-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941949.html","title":"Teen suicide clusters prompt mandate for California schools to confront taboo topic","title_page":"Teen suicide clusters prompt mandate for California schools to confront taboo topic | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In California and across the country, suicide is the second leading cause of death among teens—a grim reminder that many high school students’ primary barrier to adulthood is themselves. More young people take their own lives than the number killed by cancer, heart disease, birth defects, stroke, flu, pneumonia and chronic lung disease combined. And under legislation set to take effect in January, school systems up and down the state will be forced to confront the taboo topic head-on.\nAssembly Bill 2246, authored by Assemblyman Patrick O’Donnell, D-Long Beach, requires districts to adopt suicide prevention policies that target high-risk groups, such as students bereaved by a classmate’s death and LGBTQ youth. It was inspired by teen suicide clusters that have traumatized Palo Alto and San Diego in recent years.\nA string of suicides this school year among boys who attend the same Central Valley high school in Clovis is the latest example underscoring the urgent need to tackle this problem. The new law asks districts to attack it from all sides by promoting students’ emotional well-being, intervening when they’re in crisis and responding appropriately when tragedy strikes.\n“This is not a policy to write up and put on a shelf. It’s a lifesaving policy,” said Abbe Land, executive director of The Trevor Project, a nonprofit serving LGBTQ youth that sponsored the legislation. “One teacher reaching out at the right time because they were trained to see the warning signs can save a student’s life.”\nAfter declining steadily in the 1980s and 90s, the prevalence of suicide in this country began to rise once again around the turn of the century, increasing 24 percent between 1999 and 2014, according to a report published earlier this year by the Centers for Disease Control.\nThat analysis also revealed that the suicide rate among tween girls ages 10 to 14 had tripled over 15 years, alarming researchers.\nSurveys of California high school students have shown that one in five had seriously considered attempting suicide in the past year and that thoughts of suicide were most prevalent among female students and among students from multiracial, Native American and Pacific Islander backgrounds. Males, however, account for three out of every four deaths.\nO’Donnell knows this is an “uncomfortable topic” but said he felt an obligation as chair of the Assembly Education Committee to take it on.\nEarlier this year, the measure cleared the state Senate with unanimous support, but in the lower house, almost a dozen GOP members voted no, including Assembly Republican leader Chad Mayes, R-Yucca Valley.\nAsked about the recent group of suicides at Clovis West High School, including two in the last few weeks, O’Donnell called the cluster “beyond tragic” and said it’s proof of the new law’s relevance.\n“Not talking about this problem won’t make it go away,” said O’Donnell, who taught middle and high school before joining the Legislature. “These are our kids. This is a problem. This is a big deal. And we have a duty to act.”\nPalo Alto Superintendent Glenn “Max” McGee had only been on the job a few months in 2014 when a series of student suicides swept through the leafy Silicon Valley enclave like a deadly storm. It was the second cluster to hit the district in fewer than five years, a statistical aberration, leaving McGee almost paralyzed with emotion.\n“I felt such terrible sadness,” McGee said. “All I could think was, ‘What could have been done?’”\nThe district responded to this latest cluster—defined as a succession of deaths in close proximity to one another—by refining the prevention plan it had adopted after the first one and striking a better balance between the district’s storied academic rigor and students’ social and emotional wellbeing.\nMcGee finally started enforcing a 15 hour-per-week cap on homework that had been on the books for years and began promoting the value of sleep by moving the start of the school day back almost an hour to 8:25 a.m. The district also switched to block scheduling, opened wellness centers staffed by licensed therapists and taught students how to seek help for their friends.\nCommuter trains that roll past his office on the hour remind McGee of the work’s importance.\n“I still grimace when I hear the train whistle,” McGee said, referencing the preponderance of area students who killed themselves by stepping in front of an oncoming Caltrain.\nLegislative analysts predict it will cost hundreds of thousands of dollars for districts to develop these plans but noted that costs would be defrayed if they adopt a model policy the California Department of Education is drafting now. Palo Alto has also made its prevention policy available to other districts for free.\n“We know now that student wellness is a critical component to learning and that you can’t have one without the other,” McGee said. “We’re eager to share this work with any and everyone.”\nSix other states have already adopted similar legislation, and research published earlier this year in The Lancet found that schools have an important role to play in reducing the number of teen suicide attempts. But another study published in a different journal found that schools’ role in tackling the vexing problem has limits.\nA meta analysis of schools’ impact on teen suicide revealed that many treat self-harm as bad behavior, which discourages students who are depressed or suicidal from confiding in their teachers. It also found that bullying and stress over school performance can contribute to the problem.\nPalo Alto’s prevention plan doesn’t target LGBTQ teens, homeless youth or students with disabilities, but it will need to once the new state law takes effect. Surveys cited by the CDC show LGBTQ youth are bullied more than their straight peers and that they’re more than twice as likely to have attempted suicide.\nLast year, San Diego County endured a string of suicides by transgender youth. Max Disposti had worked with several of them at the LGBTQ resource center he runs in Oceanside and understands how much they struggled.\n“For these kids, it’s not about doing well on exams, it’s about survival,” Disposti said. “They leave the house each morning knowing their body doesn’t match who they are and that they’ll need to explain themselves over and over again. It’s a heavy load.”\nTaylor Alesana was one of them.\nSome of the videos posted to the 16-year-old transgender girl’s YouTube channel were bubbly makeup tutorials with tips on foundation application and contouring. Others were painful revelations about the hateful bullying she endured after posting a bikini selfie on Snapchat and watching it go viral.\nIn a December 2014 video, she told her followers she no longer felt safe at school.\n“Words kill. They do. I know people can say words are words, but words kill,” Alesana said. “It sucks that we live in a society where people use words like they’re nothing.”\nFour months later, the Fallbrook teen was gone. She took her life on April 2.","url":"https://calmatters.org/articles/teen-suicide-clusters-prompt-mandate-for-california-schools-to-confront-taboo-topic/"}
