{"authors":[],"date_download":"2018-10-22 21:14:20","date_modify":"2018-10-22 21:14:20","date_publish":"2014-06-04 16:21:57","description":"Philip Chism, 15, allegedly attacked a female employee at the detention center he was being held in after he was charged with killing his teacher.","filename":"data/vaneerConsumption/TeenChargedWithKillingTeacherAccusedofNewAssault.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/487211/140604-philip-chism-new-assault-ef-1218_e8533b04a69219361cc4fd976330909a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_teen-charged-killing-teacher-accused-new-assault-n122476_1540242860.html","title":"Teen Charged With Killing Teacher Accused of New Assault","title_page":"Teen Charged With Killing Teacher Accused of New Assault","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Massachusetts teenager charged with raping and murdering his teacher was being evaluated in a medical facility Wednesday after he allegedly assaulted a female employee at a state detention center.\nPhilip Chism, 15, is accused of attacking a woman at the Department of Youth Services in Dorchester on Monday, the Essex County Sheriff's Department told NBC affiliate NECN.\nChism was transported to Boston Medical Center, where a security detail has been assigned to his room while the teen is evaluated, according to the Sheriff's Department.\nThe victim was not seriously injured, but her coworkers had to relieve her during the attack, according to NBC affiliate WHDH.\n“The safety and well-being of our staff is of primary concern and a full review of this incident will be conducted to identify any necessary security enhancements at the facility,” Alec Loftus, a Department of Youth Services spokesman said in a statement.\nThe department is working with law enforcement to investigate the assault, Loftus added.\nChism will likely face new charges for the attack, WHDH reported.\nLast year, Chism pleaded not guilty to murder, aggravated rape and armed robbery charges for the October slaying of 24-year-old high school teacher Colleen Ritzer.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/crime-courts/teen-charged-killing-teacher-accused-new-assault-n122476"}
