{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:15:43","date_modify":"2018-10-22 20:15:43","date_publish":"2016-01-28 00:44:53","description":"The 23-year-old was spotting dining on french fries in Miami on Tuesday. Last week, the reality star underwent plastic surgery, including a reported Brazilian butt lift, a tummy tuck and breast implants.","filename":"data/vaneerConsumption/TeenMom2sKailynLowrypicturedenjoyingfrenchfriesinMiami.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A5EB1C00000578-0-image-a-11_1453941854178.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3419976_Teen-Mom-2-star-Kailyn-Lowry-pictured-enjoying-french-fries-Miami-just-ONE-WEEK-undergoing-Brazilian-Butt-Lift_1540239343.html","title":"Teen Mom 2's Kailyn Lowry pictured enjoying french fries in Miami","title_page":"Teen Mom 2's Kailyn Lowry pictured enjoying french fries in Miami | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kailyn Lowry may have undergone plastic surgery last week, but nothing is stopping her from enjoying a delicious meal.\nThe 23-year-old was spotted dining on french fries and a large blended drink on Tuesday in Miami Beach while casually dressed in leggings and a T-shirt.\nThe reality star is reportedly recovering from a discounted 'Brazilian Butt Lift' with a tummy tuck and breast implants by surgeon Dr. Michael Salzhauer.\nScroll down for video\nDelicious: The 23-year-old was spotted dining on french fries and a large blended drink on Tuesday in Miami Beach while casually dressed in leggings and a t-shirt\nThe Teen Mom 2 star enjoyed her meal while wearing a colorful sports bra and cropped black leggings.\nThe mother of two added embellished sandals and a small red wallet for her lunch outing, showing off her tattoo sleeve.\nKailyn sported a makeup free face and opted to pull her ombre locks back into a high bun with a brown headband.\nLast week, the reality star took to Twitter to clear up a rumor that she got a silicone-enhanced behind, writing: 'I did not get butt implants.'\nSnack time: The reality star is reportedly recovering from a discounted 'Brazilian Butt Lift' with a tummy tuck and breast implants by surgeon Dr. Michael Salzhauer\nShe showed off her sculpted derriere and hips in her skintight spandex while heading out of the establishment.\nThe first photos of her plastic surgery appeared on TMZ, which showed the starlet on an operating table before and after her procedures.\nKailyn is mom to six-year-old son Isaac with ex-boyfriend Joe Rivera and two-year-old son Lincoln with her husband, Javi Marroquin.\nOn the go: The Teen Mom 2 star dined on her meal while wearing a colorful sports bra, a loose t-shirt and cropped black leggings\nJavi defended her decision on Twitter last week, writing: 'Whatever is going to make her happy then I ride with her. Feel better babe @KailLowry.\nShe shared a photo while posing with Dr.Salzhauer to her 2.1 million Instagram followers on Tuesday, writing: 'Dr. Miami y'all! @therealdrmiami @drmiamiland.'\nThe makeup free TV star smiled wide while dressed in a Victoria's Secret Pink shirt with her hair in a casual braid.\nKailyn recently added author to her resume after her children's novel, Love Is Bubbleglum, was released in November.\nTeen Mom 2 was also recently renewed for a seventh season and is set to return to small screens this year.\nAll smiles: She shared a photo while posing with Dr.Salzhauer to her 2.1 million Instagram followers on Tuesday, writing: 'Dr. Miami y'all! @therealdrmiami @drmiamiland'\nMom life: Kailyn is mom to six-year-old son Isaac with ex-boyfriend Joe Rivera and two-year-old son Lincoln with her husband, Javi Marroquin","url":"https://www.dailymail.co.uk/tvshowbiz/article-3419976/Teen-Mom-2-star-Kailyn-Lowry-pictured-enjoying-french-fries-Miami-just-ONE-WEEK-undergoing-Brazilian-Butt-Lift.html"}
