{"authors":["Australian Associated Press"],"date_download":"2018-10-23 01:26:38","date_modify":"2018-10-23 01:26:38","date_publish":"2017-04-26 11:54:25","description":"A Victorian teenager who groped several women in the surf at a Gold Coast beach has avoided conviction. He has been placed on a two-year probation order.","filename":"data/vaneerConsumption/TeengropedwomeninthesurfataGoldCoastBeach.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F13A300000578-0-image-a-24_1493202926024.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447138_Teen-groped-women-surf-Gold-Coast-Beach_1540257998.html","title":"Teen groped women in the surf at a Gold Coast Beach","title_page":"Teen groped women in the surf at a Gold Coast Beach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Victorian teenager who groped several women in the surf at a Gold Coast beach has avoided conviction.\nThe boy, who was born overseas and whose actual age is unknown due to a lack of records, pleaded guilty to nine counts of sexual assault and three counts of common assault at a Children's Court hearing at Southport on Wednesday.\nHe has been placed on a two-year probation order for what Judge David Kent described as 'serious' offences.\nA teenage boy has escaped conviction after he groped eight women in the surf at Surfers Paradise beach (pictured) on a summer day\nThe court heard the boy touched eight women aged between 15 and 24 in the surf at Surfers Paradise beach on January 12, 2016.\nProsecutor Nicholas McGhee told the court the assaults variously included the boy touching his victims' buttocks, vaginas and breasts, sometimes under their bikinis.\nMr McGhee said after raising the alarm with a local lifeguard, several of the women identified the boy in the water swimming behind other complainants in 'quite a predatory manner'.\n'People should enjoy the right to enjoy the right to have fun at the beach without being sexually assaulted or assaulted by a stranger,' Mr McGhee said.\nSeveral of the women identified the boy in the water swimming behind other complainants in 'quite a predatory manner' at Surfers Paradise beach (pictured)\nJudge Kent ordered the boy to undergo a 'positive sexuality' course as part of his probation and said while his immersion in a new culture partially explained his actions, it didn't absolve him.\n'This is obviously unacceptable behaviour but it is also criminal behaviour,' he said.\n'Your behaviour had significant impact on at least two of the complainants.\n'The impacts on them have been considerable.'","url":"https://www.dailymail.co.uk/news/article-4447138/Teen-groped-women-surf-Gold-Coast-Beach.html"}
