{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 21:38:53","date_modify":"2018-10-22 21:38:53","date_publish":"2017-04-26 02:08:18","description":"She's the girl next door with bombshell looks and a sweet disposition who went on to become Miss Australia.","filename":"data/vaneerConsumption/TeganMartinflashessideboobonInstagram.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/00/3F9B434D00000578-0-image-a-24_1493163816553.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445766_Tegan-Martin-flashes-hint-boob_1540244333.html","title":"Tegan Martin flashes side boob on Instagram","title_page":"Tegan Martin flashes side boob on Instagram | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the girl next door with bombshell looks and a sweet disposition who went on to become Miss Australia.\nAnd on Wednesday Tegan Martin worked her assets in a series of behind the scenes images from a photo shoot.\nThe 24-year-old shared several photos to her Instagram story, posing in a ripped pink shirt that revealed a glimpse of side-boob.\nPretty in pink: n Wednesday Tegan Martin worked her assets in a series of behind the scenes images from a photo shoot\nThe shirt, which was emblazoned with the slogan 'On Wednesdays We Wear Pink', a quote from the movie Mean Girls, was torn wide open from the beauty's shoulder to her waist.\nA long line of her slender, tanned back was visible in the risque shirt, as was just a peek of side-cleavage.\nTegan's toned arms were crossed on her chest, and she shot a smouldering look at the camera, her mouth slightly agape.\nThe blonde paired either ripped jeans or denim shorts with the shirt, and was crowned with a bounty of bouncy waved hair.\nRipper: The shirt, which was emblazoned with the slogan On Wednesdays We Wear Pink, a quote from the movie Mean Girls, was torn wide open from the beauty's shoulder to her waist\nGlimpse: The 24-year-old shared several photos to her Instagram story, posing in a ripped pink shirt that revealed a glimpse of side-boob\nShe stuck to a neutral make up palette with just a touch of smoky eye shadow and a soft pink lip.\nIn another image posted that same day, Tegan posed with her good friend and fellow beauty pageant contestant Nia Sanchez.\nThe pair sat on the floor, their long legs crossed and intertwined and their heads pressed close as they clutched coffee cups.\nThe pair wore skimpy pastel toned sleep wear with a lace trim and matching shorts.\nBesties: In another image posted that same day, Tegan posed with a brunette friend on the floor, her long legs crossed in front of her as she clutched a coffee cup\nTegan is back at work after recently revealing that she suffered chronic fatigue after competing in the Miss Universe pageant, in January 2015.\nThe blonde appeared in a Youtube question and answer session with best friend and fellow competitor in the pageant, Nia Sanchez, saying too much exercise can leave her 'exhausted.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445766/Tegan-Martin-flashes-hint-boob.html"}
