{"authors":[],"date_download":"2018-10-30 20:23:27","date_modify":"2018-10-30 20:23:27","date_publish":"2015-11-23 11:45:40","description":"Atlantans awakened to the coldest temperatures in nearly eight months Monday, but highs will climb back into the low 60s by Thanksgiving, and there’s no rain in the forecast for the holiday week.","filename":"data/vaneerConsumption/Tempsdipbelowfreezingforfirsttimein8months.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/23/Videos/4628008692001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_temps-dip-below-freezing-for-first-time-months__1540931007.html","title":"Temps dip below freezing for first time in 8 months","title_page":"Temps dip below freezing for first time in 8 months","title_rss":"NULL","source_domain":"ajc.com","text":"Atlantans awakened to the coldest temperatures in nearly eight months Monday, but highs will climb back into the low 60s by Thanksgiving, and there’s no rain in the forecast for the holiday week.\nTemperatures at 7 a.m. Monday ranged from 27 in Alpharetta and Cartersville and 28 in Dunwoody and Dallas to 30 in Marietta, Chamblee and Peachtree City and 31 at Hartsfield-Jackson International Airport. In the mountains, it was 20 degrees in Blairsville and 23 in Blue Ridge.\nAtlanta’s normal low for Nov. 23 is 42 degrees, and the normal high is 61. The last time the mercury dipped below freezing at Hartsfield was on March 29, when the low was 31.\nChannel 2 meteorologist Karen Minton said afternoon readings Monday will be about 10 degrees below normal, topping out in the low 50s.\nTuesday and Wednesday will be a bit warmer, with highs around 57 degrees and morning lows in the mid-30s Tuesday and upper 30s Wednesday.\nMinton’s forecast for Thanksgiving calls for partly cloudy skies, highs in the low 60s and lows in the low 40s. Friday will also be partly cloudy, with highs in the mid-60s and lows in the low 50s.\nThe next chance for rain will be Saturday and Sunday, Minton said.\n» Check the full forecast and track changes","url":"https://www.ajc.com/weather/temps-dip-below-freezing-for-first-time-months/V1z18cU9cvea3V48p43RFN/"}
