{"authors":[],"date_download":"2018-10-22 21:20:08","date_modify":"2018-10-22 21:20:08","date_publish":"2014-06-05 00:03:04","description":"The average temperature in Nevada's capital city has risen 4.1 degrees since 1984.","filename":"data/vaneerConsumption/TemperaturesRisingCarsonCityLeadsNationinWarmingTrend.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/488426/140604-carson-city-jms-1954_b8cf181f404d47d4cc6c70e51823fa45.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_temperatures-rising-carson-city-leads-nation-warming-trend-n123041_1540243208.html","title":"Temperatures Rising: Carson City Leads Nation in Warming Trend","title_page":"Temperatures Rising: Carson City Leads Nation in Warming Trend","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCARSON CITY, Nev. — Don Quilici has snookered a few Carson City newcomers with bets that it would snow the week of his birthday in early May.\nUnsuspecting gamblers often don't know that a sliver of the western Nevada city's boundaries extend to Lake Tahoe and encompass Snow Valley Peak at a towering 9,214 feet.\n\"As an average, I'd win eight out of 10 years,\" said Quilici, 80, a Carson City native.\nLately, though, he hasn't been so lucky. That's because Nevada's capital city is getting hotter.\nAn Associated Press analysis of federal temperature records shows Carson City has warmed the most than any other city in the nation in the last 30 years.\nThe average temperature in Carson City has risen 4.1 degrees since 1984. Boise, Idaho, came in second, posting a rise of 4 degrees. Las Vegas, known for its sweltering summers, was sixth, with an increase of 3.4 degrees.\nBut it's the boost in summertime heat that really makes Carson City stand out.\nThe average temperature for June, July and August has soared 6.8 degrees over the last three decades, 2.2 degrees warmer than second-place Boise and 2.4 degrees higher than third-place Las Vegas.\nThe summertime average temperature is up from about 68 degrees to nearly 75.\nEarly Blooms, More ACs\nBecause the data on cities are based on one weather station and readings can be affected by urban heating and development, trends are not as scientifically robust as those of states or regions within states, but they do have value, said National Climatic Data Center monitoring chief Derek Arndt.\nThe change in Carson City is becoming noticeable in subtle ways.\nPlants and trees are prone to bloom earlier, and more people are installing air conditioners. The systems were a rarity even a decade ago, when many residents didn't want to spend the money when only a couple of weeks in August seemed insufferable.\n\"When we started here, usually there was a temperature swing between night and day of 45 degrees. Now we seem to be 35 degrees.\"\nJustin Anderson, owner of Anderson Heating & Air Conditioning, in operation for 32 years, said he \"never knew that so many people didn't have air conditioning before.\"\nDavid Ruf of Greenhouse Garden Center was surprised by the amount of warming that's taken place but not by the warming itself.\nRuf, whose father started the business 40 years ago, keeps meticulous weather records.\n\"When we started here, usually there was a temperature swing between night and day of 45 degrees,\" Ruf said. \"Now we seem to be 35 degrees.\"\nHot and Cold\nHe and other long-time residents note Carson City's geography. Nestled in a valley at the base of the Carson Range, the city is ringed by hills and mountains.\nAnd as the city has grown, more roads, asphalt, homes and commercial development have cropped up — ingredients for heat absorption and urban warming.\nIn 1984, about 35,000 people lived here, government data say, and today the population is 55,000. Instead of fields and meadows, there are houses and commercial complexes.\nSam Lompa, who lives on a ranch in the heart of Carson City, feels the warming effects.\n\"When I was a kid, we never had any air conditioners,\" said Lompa, 71, who grew up on the ranch. Now he uses fans and a swamp cooler but doesn't fret much about the temperature.\n\"If it's hot, it's hot, and if it's cold, it's cold,\" he said.\nRuf, too, is skeptical of putting too much emphasis on temperature shifts, even though this May seemed unusually warm, with temperatures in the 80s. \"Every time I say it's getting hotter, the next year gets colder,\" Ruf said. \"Mother Nature can still pack a wallop.\"\n— Sandra Chereb, The Associated Press","url":"https://www.nbcnews.com/science/environment/temperatures-rising-carson-city-leads-nation-warming-trend-n123041"}
