{"authors":["Press Association"],"date_download":"2018-10-22 21:38:07","date_modify":"2018-10-22 21:38:07","date_publish":"2016-01-29 07:36:43","description":"Recent summers have been the warmest in Europe in the past two millennia, scientists have said. Researchers from 13 countries including the UK have used info...","filename":"data/vaneerConsumption/Temperaturestudyoflasttwomillenniaconfirmsglobalwarmingareality.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-d8bf3547-7057-4824-b5d1-4d5ab3c0ab0b-3bmscybNe842cce83474b520b4ba-577_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421953_Temperature-study-two-millennia-confirms-global-warming-reality_1540244287.html","title":"Temperature study of last two millennia 'confirms global warming a reality'","title_page":"Temperature study of last two millennia 'confirms global warming a reality' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Temperature study of last two millennia 'confirms global warming a reality'\nRecent summers have been the warmest in Europe in the past two millennia, scientists have said.\nResearchers from 13 countries including the UK have used information from tree rings and historical records to reconstruct summer temperatures stretching back 2,100 years.\nThe data suggests greater natural variation in summer temperatures, seen in warm conditions in Roman times, cooler summers in the 4th to 7th centuries, a warm medieval period and a cold Little Ice Age from the 14th to 19th century, than previously thought.\nWarm summers in the past few decades have seen \"anomalously high\" temperatures\nAverage European summer temperatures in the 20th century were around the same as some earlier centuries, including the 1st, 2nd, 8th and 10th centuries, the research published in the journal Environmental Research Letters found.\nBut the warm summers in the past few decades, including heat waves in 2003, 2010 and 2015, have seen \"anomalously high\" temperatures, with no evidence that any period in the last 2,000 years has been so warm, the study said.\nResearchers said the findings that the past three decades were warmer than any previous natural variation, pointed to the role of human activity in pushing up temperatures.\nProfessor Neil Roberts from Plymouth University said: \"We have always known that temperatures have fluctuated over many centuries, but wanted to test whether the warm weather experienced in recent years was exceptional when viewed over a longer time-scale.","url":"https://www.dailymail.co.uk/wires/pa/article-3421953/Temperature-study-two-millennia-confirms-global-warming-reality.html"}
