{"authors":["Alex Swoyer"],"date_download":"2018-10-30 20:14:47","date_modify":"2018-10-30 20:14:47","date_publish":"2015-10-31 22:53:06","description":"Ten GOP presidential candidates spent their Halloween meeting with Iowa state voters at the GOP Growth and Opportunity Party in Des Moines.","filename":"data/vaneerConsumption/TenGOPCandidatesSpendHalloweenwithHawkeyeVoters.json","image_url":"https://media.breitbart.com/media/2015/10/Iowa-Halloween.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_31__1540930487.html","title":"Ten GOP Candidates Spend Halloween with Hawkeye Voters","title_page":"Ten GOP Candidates Spend Halloween with Hawkeye Voters","title_rss":"NULL","source_domain":"breitbart.com","text":"DES MOINES, Iowa — Ten GOP presidential candidates spent their Halloween meeting with Iowa state voters at the GOP Growth and Opportunity Party in Des Moines, Iowa.\nSen. Ted Cruz (R-TX) had the crowd fired up in the morning, while Sen. Marco Rubio (R-FL), Gov. Mike Huckabee, and Gov. Jeb Bush had the most focus in the afternoon.\nSen. Rand Paul (R-KY) spoke first, bashing Washington D.C. for its spending. “I’m not for adding one penny more in debt,” he told voters. “This deal was put together by the Republican establishment and President Obama,” he added, referring to the recent budget deal. “It allows President Obama unlimited ability to add debt in his last year. Anybody think that’s a good idea?”\nPaul gave examples of where government can cut spending. “We spent $15 million on free education for foreign students.” He said that’s not in the Constitution anywhere: “That’s crazy.” Paul added that the government spent $250,000 last year bringing 24 kids from Pakistan to send them to space camp in Alabama. “I know a lot of American kids that want to go to space camp,” he challenged.\n“People in Washington lack the courage to stop it,” Paul said of the spending. “We have the power to stop it.”\nSen. Ted Cruz (R-TX) followed Paul but mostly hit on the CNBC debate moderators being left wing operatives.\n“How ’bout we stop letting left wing liberals moderate Republican debates?” The crowd cheered in agreement. “Let me lay out a radical proposition. How about if we say from now on, if you have never voted in a Republican primary in your life, you don’t get to moderate a Republican primary debate?”\n“Could you imagine a debate moderated by Sean Hannity and Rush Limbaugh and Mark Levin? Millions of people would watch,” Cruz added. “What you wouldn’t have is a bunch of left wing operatives.”\nCruz said Republican voters need a nominee “who is the consistent conservative.” The crowd then yelled out his name –“Cruz!”\nNew Jersey Gov. Chris Christie came up next, but instead of using his time to make a speech to the Iowa voters, he decided to take questions from them, saying he wants to hear what Iowans want to hear about.\nA key moment for Christie came when he was asked about enforcing the law equally. He said he would “end sanctuary cities the first day [he is] President of the United States” and “make sure we support law enforcement.” People in the audience stood and cheered.\nLouisiana Gov. Bobby Jindal spent most of his time expressing frustration with Washington, D.C. and the Republican majority in Congress. “I’m actually angrier at the Republicans in D.C. than I am at the Democrats,” Jindal told the audience. “At least the Democrats are honest.”\n“The Republicans say one thing, they do another,” Jindal said, adding that the Republicans said they would get rid of Obamacare and amnesty but have done neither.\n“Nothing changed. This year it’s even worse,” he said, referencing how GOP leadership “waved [the] white flag of surrender” on being unable to defund Planned Parenthood.\n“What good is the Republican Party?” Jindal questioned, if it can’t stand up and protect innocent human life.\nSen. Marco Rubio (R-FL) said America needs to repeal and replace Obamacare if it wants to be “globally competitive again… We must repeal it and replace it” with a law that makes the people in charge of their healthcare. He said repealing Obamacare would help the private sector, which is responsible for creating jobs. “Politicians don’t create jobs,” he added.\nRubio also touched on foreign policy, saying that if he were President of the United Stats, “our allies [would] know they can trust us.”\nFormer Arkansas Gov. Mike Huckabee commented on the CNBC debate moderators who have been criticized for being too left leaning during last Wednesday’s debate in Colorado. “We won’t do any more debates on NBC if they’re going to run them like that,” he said. “We were asked ridiculous questions about each other.”\nHuckabee then talked about displaced American workers because of foreigners – something he mentioned during an exclusive interview with Breitbart News Friday while touring a factory in Audubon, Iowa.\nSen. Lindsey Graham (R-SC) took swings at Democratic frontrunner Hillary Clinton during his speech.\n“Hillary Clinton couldn’t be here today, I guess because we didn’t ask her,” he chuckled. “What Hillary Clinton said – that the problems with the VA were being exaggerated by the Republican Party…no they’re not, they’re real,” he said, adding that if she doesn’t understand the VA is broken, then she isn’t ready to be Commander in Chief.\nGraham also talked about the Benghazi hearing and said Clinton was the loser. “She never talked to her ambassador for an entire year,” he challenged.\nFormer Florida Gov. Jeb Bush talked about fluctuating poll numbers – something he has seen recently happening to his own campaign. “What I learned about Iowa is that Iowans are discerning voters,” he said, adding that they’re informed. He said poll numbers go up and down. “You learn from Iowa voters, so it is a joy to be here.”\nBush also spoke about his record as a pro-life governor.\nFlorida was the first state to have a Choose Life license plate, to fund adoption programs in the country now $20 million have gone to this. In Florida, we eliminated partial birth abortion a horrific procedure that is inhumane. In Florida, we triple digit increased the number of kids getting out of our foster care because we tore down the barriers for adoption so these children could get to loving homes. In Florida, we were the only state to provide government money to crisis pregnancy centers, so that women can have a loving choice when confronted with this difficult decision. And in Florida, I defunded Planned Parenthood.\nCarly Fiorina followed Bush onto the stage, taking a jab at Clinton – something she did during the CNBC debate – saying voters want to see her debate Clinton. “I hope a lot of you have already made up your minds to support me, but if you haven’t yet…it is true that in your heart of hearts you can just not wait to see me debate Hillary Clinton,” she said.\nFiorina also talked about her growing support in Iowa since her campaign first launched in May.\n“My candidacy was about two weeks old and a lot of the polls and the pundits and Washington, D.C. didn’t take me very seriously,” she began when she addressed Iowa voters, saying her mic got cut off at the last Iowa GOP event in May. “The second debate in September, I had to fight my way on the stage,” she said, but touted that last week she was right in the middle.\nFormer Pennsylvania Sen. Rick Santorum was the last to speak and went a bit too long as his mic was cut off at the end, but he stressed his ability to compromise: “Compromise is not a bad thing if it’s a good compromise, and I’ve learned from experience what a good compromise is,” he explained, saying America needs a president that “understands principles.”\nSantorum explained he won in a district that was more than 60 percent Democrat. “I’ve won race after race in a blue collar district because of my record of showing I stand for pro-growth” and limited government.\nSantorum also stressed how immigration and foreign workers negatively impact American workers and wages.\nMany of the candidates also spent part of the day at Rep. Steve King’s annual Col. Bud Day Pheasant Hunt near Akron, Iowa.","url":"https://www.breitbart.com/politics/2015/10/31/ten-gop-candidates-spend-halloween-hawkeye-voters-iowa-state-fairgrounds/"}
