{"authors":["Bill Chappell"],"date_download":"2018-10-23 01:00:33","date_modify":"2018-10-23 01:00:33","date_publish":"2017-01-31 00:00:00","description":"The idea got a standing ovation at the governor's State of the State address Monday night, with Democratic Leader Craig Fitzhugh saying, \"Actually I had hoped that we would do that earlier.\"","filename":"data/vaneerConsumption/TennGovernorSeeksFreeCommunityCollegeForAllAdults.json","image_url":"https://media.npr.org/assets/img/2017/01/31/ap_17031038202770_wide-848d02b01bf160f231e10d04cad3017a0c6601f1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_31_512617450_tenn-governor-seeks-free-community-college-for-all-adults_1540256433.html","title":"Tenn. Governor Seeks Free Community College For All Adults","title_page":"Tenn. Governor Seeks Free Community College For All Adults : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Tenn. Governor Seeks Free Community College For All Adults\nEnlarge this image toggle caption Mark Humphrey/AP Mark Humphrey/AP\nRecent high school graduates in Tennessee are already allowed to attend community college at no cost. Now Gov. Bill Haslam is looking to expand the year-old program to provide free community college educations to adults, as well.\nHaslam, a Republican who has been in office since 2011, made his pitch at Monday night's State of the State address. Afterward, he tweeted, \"Let's be the Tennessee we can be.\"\nThe pitch was well-received by members of both parties, as the governor pushes toward his goal of helping Tennessee have 55 percent of its 6.6 million citizens hold a postsecondary degree or certificate by the year 2025.\nThe state currently needs 871,000 postsecondary degrees or certificates to reach that goal, Haslam's office says. And it would help if free access to community college is given to adults — including the 900,000 Tennesseans who have taken some college classes but didn't get a degree.\n\"Since the fall of 2015, Tennessee has provided free community college for new high school graduates,\" Nashville Public Radio reports. \"Money for the program, known as Tennessee Promise, has come from a variety of sources, including federal Pell Grants and the state lottery.\"\nHaslam's initiative seems to have bipartisan support, with the NPR member station reporting that Democratic Leader Craig Fitzhugh responded by saying: \"Actually I had hoped that we would do that earlier. But I'm glad to see him doing that now.\"\nA billionaire whose father started the Pilot chain of gas stations and truck stops, Haslam was the president of his family's business before starting his political career as the mayor of Knoxville.\nTennessee's efforts to make it easier to get a degree led former President Barack Obama to choose the state as the site for a speech about making community colleges tuition-free in early 2015.\nThe idea of providing free community college education has spread in recent years. Around the U.S., the institutions vary widely, with yearly costs that range from $1,420 in California to $7,530 in Vermont, as NPR's Ed blog reported last summer.\nAlong with Oregon and Minnesota, Tennessee is one of three states with free community college programs, according to the National Conference of State Legislatures. Kentucky approved a similar program last year; other states are considering their own plans.\nHaslam's education plan earned a standing ovation at Monday night's address, but as Nashville Public Radio notes, many protesters were also at the Capitol, holding signs and chanting to register their anger over President Trump's immigration policies and to inform legislators that they would be watching their actions.","url":"https://www.npr.org/sections/thetwo-way/2017/01/31/512617450/tenn-governor-seeks-free-community-college-for-all-adults"}
