{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 20:18:56","date_modify":"2018-10-30 20:18:56","date_publish":"2016-02-23 23:19:32","description":"On the eve of his expected endorsement of Sen. Marco Rubio for president, Tennessee Governor Bill Haslam is trying to surreptitiously bury a migrant-stopping resolution that was passed overwhelmingly by the State Senate on Monday. |","filename":"data/vaneerConsumption/TennesseeGovBillHaslamTriestoBuryMigrantStoppingLawsuitBeforeEndorsingMarcoRubio.json","image_url":"https://media.breitbart.com/media/2015/08/Rubio-and-Gang-of-Eight-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_23__1540930736.html","title":"Tennessee Gov. Bill Haslam Tries to Bury Migrant-Stopping Lawsuit Before Endorsing Marco Rubio","title_page":"Tennessee Gov. Bill Haslam Tries to Bury Migrant-Stopping Lawsuit Before Endorsing Marco Rubio | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On the eve of his expected endorsement of Sen. Marco Rubio for president, Tennessee Governor Bill Haslam is trying to surreptitiously bury a migrant-stopping resolution that was passed overwhelmingly by the State Senate on Monday.\nThe measure, which sailed through the full State Senate Monday on a 27 to 5 vote, is now pending in the House of ‎Representatives, where it is expected to pass easily.\nBut because of parliamentary tricks, it first faces a long, back-room journey through multiple committees before it can be approved by the House.\n“When I saw [Speaker of the Tennessee House] Beth Harwell put it [Senate Joint Resolution 467] in two subcommittees and two full committees I knew that was afoot,” one State Representative tells Breitbart News.\nGovernor Haslam cannot veto the resolution, but he is apparently trying to bury the resolution, which requests the Tennessee Attorney General to initiate a lawsuit against the federal government’s operation of the refugee resettlement program in Tennessee on Tenth Amendment grounds.\nA spokesperson for Haslam neither confirmed nor denied reports that he had asked Speaker Harwell to bury the recently passed Senate Joint Resolution 467 in two subcommittees and two committees in the House.\n“The governor does have some concerns about the resolution, but he deferred to the will of the legislature on it. (Resolutions aren’t subject to veto),” a spokesperson for Governor Haslam tells Breitbart News Tuesday afternoon.\nIn Tennessee, the General Assembly (the State Senate and the House) can bring such a lawsuit on its own. Should the House not pass the resolution, the State Senate could file the lawsuit on its own, but sources tell Breitbart News at least 70 of the 99 members of the House of Representatives have already indicated their support for the resolution, the will of the House in favor of it is quite clear.\nThe Chattanooga Times Free Press reported early Tuesday that Governor Haslam says he opposes the resolution and would rather rely on the Obama administration’s assurances of refugee vetting.\n“Since the Governor can’t veto a resolution, his only option is to try and derail it in the House,” a source familiar with the Tennessee General Assembly tells Breitbart News.\n“This resolution deals specifically with a federally prescribed appropriation by the General Assembly but one which bypasses the state’s constitutionally required appropriations process,” the source continues.\n“For that reason, the resolution should have been assigned directly to the House Finance subcommittee and then go to the Finance full committee. The decision to assign the resolution to multiple subcommittees and committees would have had to been made by the Governor’s long-time ally, Speaker Beth Harwell,” the source concludes.\nAnother source confirms to Breitbart News that Governor Haslam is trying to derail the refugee lawsuit resolution.\n“This resolution puts Governor Haslam in a place to make a real decision, and he can’t do that,” a source familiar with the operation of the Tennessee House of Representatives tells Breitbart News.\n“We realize that, and will usurp him, and he realizes that,” the source adds.\n“He does not want to be weak so his option is to stall it in the weakest body, which is the House by far,” the source concludes.\nGovernor Haslam’s action comes just one week before Tennessee’s March 1 GOP Presidential preference primary, where GOP frontrunner Donald Trump, Sen. Ted Cruz, and Sen. Marco Rubio are the top three candidates.\nHaslam’s subterfuge on the resolution is further complicated by the fact that the Tennessee Associate Attorney General who has most prominently commented on the resolution before the Tennessee General Assembly, Bill Young, is running as a delegate to the Republican convention committed to Rubio.\nCritics of the governor could easily point to Young’s lack of objectivity in reviewing the resolution, given the fact that Rubio was one of eight co-sponsors of the pro-Amnesty Gang of Eight bill that failed in the U.S. Senate in 2013.\nHaslam has made no secret of his dislike for the two other GOP Presidential contenders, Donald Trump and Ted Cruz.\n“The timing of Governor Haslam’s response correlated with the probable endorsement of Rubio is more than just ironic,” former State Rep. Joe Carr tells Breitbart News.\n“Senator Mark Norris said it perfectly yesterday. This resolution to sue the federal government on Tenth Amendment grounds is ‘a declaration of our rights as a sovereign state,'” Carr adds.\nBreitbart News contacted Clerk of the House Joe McCord to confirm that the resolution has been assigned to two subcommittees and two committees, a highly unusual move, but has received no response.\nIn the State Senate, the resolution quickly moved through one committee, the Finance Committee, before going to the floor for an up-or-down vote Monday.\nBreitbart News also contacted Speaker Harwell for comment, but received no response.\n**UPDATE**\nA spokesperson for Speaker Harwell subsequently responded to Breitbart News, but would neither confirm nor deny the Speaker had assigned Senate Joint Resolution 467 to two committees and two subcommittees in the Tennessee House of Representatives at the request of Governor Haslam.\n“By established precedence, any and all resolutions that are substantive in nature are assigned to the appropriate subcommittee. Immigration bills have historically been assigned to the House State Government Committee,” the spokesperson told Breitbart News in an emailed statement.\n“Per our House rules, any and all legislation with a fiscal note must go through the House Finance, Ways and Means Committee (House Rule 72),” the statement concluded.","url":"https://www.breitbart.com/politics/2016/02/23/on-eve-of-expected-rubio-endorsement-tennessee-governor-haslam-tries-to-bury-refugee-lawsuit/"}
