{"authors":[],"date_download":"2018-10-30 18:30:18","date_modify":"2018-10-30 18:30:18","date_publish":"2017-01-10 19:17:55","description":"The state of Tennessee is craft brewery rich and Zack Roskop — known affectionately as Bus Brew Guy — is determined to prove it to the masses...","filename":"data/vaneerConsumption/TennesseeBeerRuntospotlight76craftbreweries.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/10/Images/skyWord.385496-calfkiller-tour2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/travel_tennessee-beer-run-spotlight-craft-breweries__1540924218.html","title":"Tennessee Beer Run to spotlight 76 craft breweries","title_page":"Love craft beer? Follow along with this beer tour in Tennessee","title_rss":"NULL","source_domain":"ajc.com","text":"Tennessee is rich with craft breweries and Zack Roskop — known affectionately as Bus Brew Guy — is determined to prove it to the masses beginning on Jan. 24 by leading the TN Beer Run through the state.\nSpanning a total of 1,400 miles to 76 breweries through to Feb. 13, Roskop will be manning a minibus with orchestrated stops in different regions of the state.\nSome of the stops are more well-known — Chattanooga, Knoxville, Franklin, Gatlinburg, Nashville, Memphis — and others not so well-known — Bristol, Lancing, Sparta, Tullahoma.\nEach of the carefully selected breweries have a \"unique product and unique story\" and Roskop and company wants to showcase the stories in live time.\nThe public is welcome to join Roskop and his four-person team at parties scheduled at various stops (check their website for details). And beer fans can also see some of the tours as they are broadcast on Facebook Live.\nCraft beer aficionados can follow along with the TN Beer Run when it launches later this month via their website, www.thetnbeerrun.com/ or their Facebook page, www.facebook.com/thetnbeerrun/.\n[","url":"https://www.ajc.com/travel/tennessee-beer-run-spotlight-craft-breweries/qkzxsQPhOejQlIy7sxf1eL/"}
