{"authors":["Associated Press"],"date_download":"2018-10-23 03:18:35","date_modify":"2018-10-23 03:18:35","date_publish":"2016-01-28 18:45:59","description":"LENOIR CITY, Tenn. (AP) — A man wanted on rape charges is dead after he was shot in Tennessee on Wednesday as deputies tried to arrest him. District Attorney...","filename":"data/vaneerConsumption/Tennesseedeputieskillsuspectwhileservingarrestwarrant.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421429_Tennessee-deputies-kill-suspect-serving-arrest-warrant_1540264715.html","title":"Tennessee deputies kill suspect while serving arrest warrant","title_page":"Tennessee deputies kill suspect while serving arrest warrant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tennessee deputies kill suspect while serving arrest warrant\nLENOIR CITY, Tenn. (AP) — A man wanted on rape charges is dead after he was shot in Tennessee on Wednesday as deputies tried to arrest him.\nDistrict Attorney General Russell Johnson said in a statement that Thongsavanh Vandarack had previously served 17 years in a Wisconsin prison for crimes that included attempted homicide.\nAccording to Johnson's account of events, because of Vandarack's violent history, four Loudon County deputies went to Vandarack's home to serve a warrant for a statutory rape charge after the 40-year-old was accused of having sex with a 13-year-old girl. Two deputies took up positions outside the home to prevent Vandarack from fleeing while two others were let inside by Vandarack's girlfriend.\nVandarack entered the room with his hands in his pockets, and when the deputies ordered him to remove them he brought out what appeared to be a handgun. Both investigators opened fire.\nVandarack was shot repeatedly and pronounced dead at a hospital.\nIn an interview after the shooting, Vandarack's girlfriend told investigators Vandarack did not want to return to prison. She said it was Vandarack's plan to provoke a \"suicide by cop\" situation.\nVandarack was of Laotian descent. Johnson did not name the officers or identify their race.","url":"https://www.dailymail.co.uk/wires/ap/article-3421429/Tennessee-deputies-kill-suspect-serving-arrest-warrant.html"}
