{"authors":["Associated Press"],"date_download":"2018-10-23 04:16:45","date_modify":"2018-10-23 04:16:45","date_publish":"2016-01-11 17:16:47","description":"Students and parents were not allowed to ask questions and received almost no information about the incident at Ooltewah High School despite flocking to attend a meeting last week.","filename":"data/vaneerConsumption/Tennesseehighschoolrefusedtoreleasedetailsafter3studentsrapedteammate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/07/03/2FAC5AC300000578-0-image-a-74_1452135758950.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394264_Tennessee-high-school-forced-apologize-refusing-release-details-three-male-students-arrested-raping-15-year-old-teammate_1540268205.html","title":"Tennessee high school refused to release details after 3 students 'raped teammate'","title_page":"Tennessee high school refused to release details after 3 students 'raped teammate' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Tennessee high school has apologized for how it handled the news that three basketball players were arrested for raping teammate in an apparent hazing.\nStudents and parents were not allowed to ask questions and received almost no information about the incident at Ooltewah High School despite flocking to attend an emergency meeting last week.\nResponding to outcry, Hamilton County school board chairman Jonathan Welch released a statement on Sunday vowing to provide more details and apologizing.\nAfter the three players were charged in the incident, school officials decided to cancel the rest of the season.\nSCROLL DOWN FOR VIDEO\nHorrific: Three students on the Ooltewah High School (above) basketball team were arrested and charged with raping a fellow player with a pool stick\nWelch said the board is determining whether the superintendent has responded appropriately, evaluating the roles of staff and volunteer chaperones who were with the team, confirming that district policies and procedures are being followed and engaging in open conversations with the community.\nHe urged parents and community members to attend two upcoming board sessions, one on January 14 and the other on January 21.\nHe said the first is a working session at which board members plan to discuss hazing and anti-bullying policies.\nA public forum will follow.\nThe second session is a regular board meeting and will include a public forum.\n'I cannot take back any of the mistakes made in trying to protect the integrity of the independent investigations and the rights and privacy of those involved — but we can work to do better in sharing what we are doing — and to listen even more carefully to parents, educators and taxpayers in our community as we move forward,' Welch said in the statement.\n'And that's we intend to do.'\nSuperintendent Rick Smith said on Wednesday that he was taking the 'very unusual step' to cancel the rest of the season at Ooltewah High School 'so that the criminal justice system can work the way we expect.'\nTennessee Secondary School Athletic Association Executive Director Bernard Childress said this is the first time he could remember a school canceling a season for disciplinary reasons.\nGatlinburg police said three teens face aggravated rape and aggravated assault charges in connection with injuries to a teammate, who underwent surgery after being assaulted while attending a basketball tournament.\nTennessee law defines aggravated rape as a rape in which the defendant either has a weapon, causes bodily injury or is aided or abetted by another.\nNone of the teens has been named because they're all juveniles.\nSmith said he canceled the rest of the season because he was concerned public speculation about the case 'could threaten the integrity' of the investigation.\n'This decision is not a reflection upon the coaching staff,' Smith said on News 12 Now.\n'Indeed, law enforcement officials have to date found no evidence any adult acted improperly. Likewise, this decision is not meant to punish the boys on the team who are innocent of any wrongdoing and simply want to play high school sports.'\nSmith spoke before the school board held a closed executive session. Board members then returned for a specially called meeting to discuss the issue, but they adjourned only a few minutes later after board chair Jonathan Welch offered brief remarks.\n'There are many questions that need to be answered,' Welch said.\n'Some of the questions unfortunately cannot be answered until all investigation is complete. At some point there will be questions for this board, and I believe the most important one we have to ask ourselves is what could have been done differently or better.'\nScott Bennett, the Hamilton County School District's attorney, said the district will study its anti-hazing policy and make sure it's being communicated to students.\nBennett also said law enforcement officials in Hamilton County and Sevier County, where Gatlinburg is, told the school district not to conduct its own investigation. Bennett said school district officials also were advised not to comment. Bennett said Sevier County juvenile justice officials have told him the three arrested players wouldn't return to the school.\nThe Hamilton County district attorney's office and the sheriff's office are investigating whether an 'ongoing pattern of assaults' may have been committed 'under the guise of hazing.'\nThe district attorney's office said in its release this week that nobody has reported any criminal behavior in Hamilton County by anyone associated with the team thus far.\nAwful: The young man had to undergo surgery at LeConte Medical Center (above) after the assault\nTwo women who attended Wednesday's meeting said they are mothers of Ooltewah players. They said their sons had been beaten by teammates during the trip to Gatlinburg.\n'I do want justice for the boy that was hospitalized and for my son and his other teammates who were assaulted,' said Miika Montgomery, the mother of a player.\n'Do I think that (the arrested player) needs to go to jail? Yes, I do. Do I think the act was malicious? Yes, I do. I think it was very malicious and predatorial.'\nAuthorities said the investigation is ongoing. Current charges pertain to one victim only.\nCurtis Bowe, an attorney representing Ooltewah coach Andre Montgomery, issued a statement this week saying that 'the issue affecting our community is not hazing or bullying' and instead 'is the unilateral decision of three individuals charged with a sexual offense.'\nMiika Montgomery, who said she isn't related to Andre Montgomery, said she 'didn't have any issues with the coach.'\nA group of more than 120 Ooltewah High School alumni have signed a letter requesting that an outside authority investigate the Gatlinburg incident.\nIn the letter, they said that 'we depend on you to create the right atmosphere for students. Instead of burying this incident of rape and assault, we ask that you address it head-on and as transparently as possible within the confines of the law.'\n'I actually was looking for a little more answers, a little more status of the investigation,' said Amanda DeFriese, an Ooltewah alumna who signed the letter and attended the meeting.","url":"https://www.dailymail.co.uk/news/article-3394264/Tennessee-high-school-forced-apologize-refusing-release-details-three-male-students-arrested-raping-15-year-old-teammate.html"}
