{"authors":["James Delingpole"],"date_download":"2018-10-30 20:06:25","date_modify":"2018-10-30 20:06:25","date_publish":"2015-04-23 12:59:33","description":"Yesterday evening UKIP leader Nigel Farage endured quite possibly the most brutal and malign encounter of his entire political career: an interview with a |","filename":"data/vaneerConsumption/TenReasonsWhyEvanDavissBBCInterviewWithNigelFarageWasTheWorstThingEver.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_04_23__1540929985.html","title":"Ten Reasons Why Evan Davis's BBC Interview With Nigel Farage Was The Worst Thing Ever","title_page":"Ten Reasons Why Evan Davis's BBC Interview With Nigel Farage Was The Worst Thing Ever | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Yesterday evening UKIP leader Nigel Farage endured quite possibly the most brutal and malign encounter of his entire political career: an interview with a top BBC man so grotesquely unjust, so nakedly biased that I’m surprised Farage didn’t walk out in disgust.\nHad he done so, of course, it would have represented a massive scalp to the media and political Establishment which is trying destroy him.\nHis feat in weathering it with humour and composure – while still getting across one or two key political points (despite the best efforts of interviewer Evan Davis to cut him short whenever he threatened to come across as reasonable, lucid and considered) – was truly remarkable.\nHere – for those of you who haven’t yet seen it, and also for those who did but want their own suspicions confirmed – is an analysis of why the methods deployed by Evan Davis were so disgracefully dishonest and underhand.\nPublic School\nDavis opened with a pretty straight forward ad hominem/straw man combo. Farage was privately educated (Dulwich College), so were various senior members of UKIP: therefore how could he possibly claim to represent the professed party of the anti-Establishment?\nThis was a classic, Owen-Jones-hard-left-style conflation of “the Establishment” with public school. It is, inevitably, the case – given the dumbing down inflicted by the left on our state school system over a period of decades, combined with the running-down of those great social levellers, the grammar schools – that a disproportionate number of people in power have been privately educated. It’s true of Labour (eg Tristram Hunt, Ed Balls); of the Lib Dems (Nick Clegg, etc); and, of course, of the Conservatives (from Old Etonian David Cameron downwards). And so what?\nIs Nigel Farage to be held responsible for the accident of birth by which his parents sought to give him a decent education? And how does this fact in any way undermine his case that Westminster is now controlled by an Establishment elite completely out of touch with the needs of the people they supposedly represent?\n‘Tone’ (7.17) (and again 12.14)\nAnother leftist trope, this. Evan Davis is taking great pains to avoid confronting Farage on issues of substance – eg UKIP’s sensible, fully-costed manifesto – and instead seeks to hammer him on the much more nebulous issue of style.\nMaybe what Farage is saying is right, Davis faux-generously half-concedes, but it sounds horrid and that’s the problem.\nThis – as Davis must know – is an almost impossible charge to refute because it derives not from facts or logic but from people’s feelings.\nIn the run up to the Second World War a lot of people felt that they didn’t want a war. Was that an argument for not confronting Hitler? Should a proto Evan Davis have gone round to Winston Churchill’s house, insisting that while no one objected in principle to the notion of rearmament it was the “tone” of his criticisms of Germany that people found offensive?\nThe Fox News Ambush (7.28)\nDavis’s researchers have found a clip from an interview Farage gave earlier this year, in which he talks about Muslim “ghettos” which are no-go areas for police and which operate under Sharia law.\nWhat Davis carefully neglects to mention is that Farage was speaking in the immediate aftermath of the Charlie Hebdo massacre in Paris, when tensions were high.\nFarage claims that he was speaking in response to a question about France. True.\nBut Davis is correct when he insists that in the clip shown Farage was speaking about Britain, not France.\nA fair cop, then?\nUp to a point. So long as you believe – as Evan Davis, like most of the liberal Establishment, including the mainstream political parties, clearly does – that telling the truth about the Islamisation of Europe (including Britain) is in such poor taste as to justify the character assassination of anyone who does it.\nWhich is worse:\na) Using a strong word like “ghettoes” in preference to a more polite euphemism such as, say, “enclaves” or “communities”?\nb) Ducking uncomfortable issues – like, say, that 1400 girls raped by Muslim gangs in Rotherham; or the near-decapitation of Lee Rigby; or the growth of parallel sharia courts all over Britain – altogether for fear that someone, somewhere might be offended?\nWith more time and under less hostile conditions Farage could have made this point. But I quite see why he didn’t allow himself to be drawn into the “ghetto” argument because that sound bite would have been used against him by the BBC ad nauseam.\nFifth column (13.05)\nHere begins Davis’s serious bid for the Disingenuous Tosser of the Year award.\nA “fifth columnist” is the enemy within: a member of your own community who seeks to destroy it. In no wise could this phrase be considered remotely inappropriate for that worrying percentage of our Muslim population which thinks, for example, that Lee Rigby had it coming to him and that ISIS are a cause worth fighting for.\nYet you’d think from the sneering triumphalism with which Davis quotes it that he’s just unearthed a recent statement from Farage saying: “I’m a racist bastard and I hate Muslims especially.”\nThis, for me, is the moment when Davis goes well beyond the bounds of combative interview technique into the realms of pure left-wing propagandising.\nIf Davis thinks that “fifth column” is so inaccurate a phrase that it demeans the person using it then the onus is on him, not on Farage, to justify himself because, outside the BBC, it’s something with which any reasonable person could not fail to agree.\nWho is this liberal metropolitan elite that says that patriotism is wrong? (16.20)\nYou, you tosser, Davis. You!\nHate (circa 17.00 onwards)\nFarage’s best counterstroke of the interview. He picks up Davis on his glib use of the word “hate” to describe how Farage feels about “multiculturalism”. In other words, he’s using Davis’s technique against him by exposing the pure bigotry and prejudice which has informed his line of questioning.\nThe pity is that he can’t use this tactic too often because, unfortunately, you can’t when the BBC holds the whip hand. It makes you look self-pitying and prevents you developing your political arguments.\nPaddington Bear (17.10)\nDavis now loses it completely: he invokes the “terrific” Paddington Bear movie to tell us how warm and gooey this made Evan Davis feel personally about “multiculturalism”. Farage’s barely disguised contempt for this line says all that needs to be said.\n“One of your local government candidates said…”\nNow Davis is really scraping the bottom of the barrel. As Farage rightly says, no other party is exposed by the BBC to this level of scrutiny: every party has had its share of paedophile and other criminal scandals or gaffes, yet the BBC seems only interested when it involves UKIP.\nPublic breastfeeding (20.15 onwards)\nMore barrel-scraping. Evans is misrepresenting what Farage said in response to the story about the breast-feeding mother in Claridges who was politely asked to conceal her modesty in order to avoid upsetting other customers who’d come out for an expensive high class tea…\nA rare question about economics (23.00 onwards)\nJust when you thought Davis had plunged the most Stygian depths of cant, disingenuousness and smearing character assassination, in comes his lowest blow yet.\n“There is a dynamic force with tax cuts,” says Farage.\nTo which Davis responds by putting on his finest bitchy, pantomime sarcasm voice (and to be fair it’s a good one: God knows what it’s like to be married to him but I certainly wouldn’t like to be the one who’s left the butter out of the fridge on a hot day in his household) to imply that this is the craziest thing he has ever heard.\n“Is that the basis of your argument?” chortles Davis ostentatiously. “That you’re going to cut taxes in the hope that more money comes in?”\nEvans, it ought to be noted, is an Oxford Politics, Philosophy and Economics graduate. Are we seriously expected to believe that on the Economics part of his course, or during his time at the Institute for Fiscal Studies, or during his long-running stint as the BBC’s economics correspondent, that he has never encountered concepts like the Laffer Curve or the notion that heavy taxation has a sclerotic effect on free markets while lower taxation can incentivise entrepreneurship and productivity?\nI really used to respect Evan Davis. This was the moment when he killed that respect for good.\nFarage describes the last leg of the election campaign as his “Beecher’s Brook” moment – after the most notoriously difficult fence the runners need to clear in the Grand National\nAfter seeing how well this magnificently courageous man performed in the face of such unconscionable, vindictive goading and after witnessing the bullying he gets simply for spelling out truths that the mass of decent British believe, I find it hard to imagine how anyone with a glimmer of soul or an ounce of intelligence could not be willing him to victory in his campaign in South Thanet. Parliament would be infinitely the poorer without him.","url":"https://www.breitbart.com/europe/2015/04/23/ten-reasons-why-evan-daviss-bbc-interview-with-nigel-farage-was-the-worst-thing-ever/"}
