{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:42:48","date_modify":"2018-10-30 18:42:48","date_publish":"2016-12-09 14:12:39","description":"Inboxes belonging to U.S. senators have been flooded with more than 22,000 emails over the past week urging them to back the Taylor Force Act.","filename":"data/vaneerConsumption/TensOfThousandsOfEmailsToSenatorsUrgeEndtoAidUntilPalestiniansStopFinancingTerrorism.json","image_url":"https://media.breitbart.com/media/2016/03/taylorforce1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_09__1540924968.html","title":"Tens Of Thousands Of Emails To Senators Urge End to Aid Until Palestinians Stop Financing Terrorism","title_page":"Tens Of Thousands Of Emails To Senators Urge End to Aid Until Palestinians Stop Financing Terrorism","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Inboxes belonging to U.S. senators have been flooded with more than 22,000 emails over the past week urging them to back the Taylor Force Act, a bill that would make aid to the Palestinian Authority conditional on its cutting off financial rewards to terrorists and their families, a major Christian group said on Monday.\nLast week, Breitbart reported that Christians United for Israel (CUFI), the largest pro-Israel organization in the United States, had launched a massive effort to promote the Taylor Force Act, named after the U.S. Army veteran and West Point graduate who was murdered by a Palestinian terrorist on a stabbing rampage in Jaffa, Israel in March of this year.\n“No American, regardless of political persuasion, should tolerate our tax dollars funding terror,” founder and chairman of Christians United for Israel (CUFI) Pastor John Hagee said in a statement. “This legislation ensures the PA cannot use our money to incentivize murder — it’s that simple.”\nHagee added that the matter was not a partisan one.\n“The Taylor Force Act isn’t about Democrat vs Republican, it’s about right and wrong. Every Member of Congress should back this legislation, and it should be one of the easiest decisions they make,” he said.\nCUFI director David Brog added, “The fact that CUFI members have sent over 22,000 emails to the Senate demonstrates how deeply this issue resonates with our membership and beyond. Americans don’t like their tax dollars going to entities that fund terrorism. Now that we know that the PA makes generous cash payments to terrorists, how can we continue to place US dollars in their hands?”\nAs well as terminating payments to terrorists or their families, the proposed legislation — sponsored by Sen. Lindsey Graham (R-SC) and several other Republican Senators — calls on the U.S. to freeze funds to the PA until the latter “publicly condemns” acts of violence and takes action to “bring the perpetrators to justice.”","url":"https://www.breitbart.com/middle-east/2016/12/09/tens-thousands-emails-sent-senators-urging-back-bill-ending-palestinian-aid-terrorists-stop-receiving-money/"}
