{"authors":[],"date_download":"2018-10-30 18:47:24","date_modify":"2018-10-30 18:47:24","date_publish":"2016-12-29 00:00:00","description":"Teachers and principals resigning for inappropriate comments were among the many DeKalb school news items","filename":"data/vaneerConsumption/TenthingsthathappenedinDeKalbCountySchoolsin2016.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/29/Images/frogs.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_from-2_bba066978835e423c492aec0d5702df7__1540925244.html","title":"Ten things that happened in DeKalb County Schools in 2016","title_page":"Ten things that happened in DeKalb County Schools in 2016","title_rss":"NULL","source_domain":"ajc.com","text":"Lakeside High School’s principal was suspended in late January after allegations he told a room filled with mostly minority custodial staffers he was leader of their “plantation.”\nIn May, about two dozen of the school’s students walked in graduation ceremonies but didn’t receive diplomas, having failed Georgia Milestones tests.\nThose were a few of the big stories out of the DeKalb County School District in 2016. Here’s a look at several more:\nDid a search firm get paid for nothing?: A search firm was paid more than $100,000 to find candidates for several jobs. Superintendent Steve Green selected people for those jobs mostly based off his and others’ recommendations.\nThe district declined on the state’s report card: The district’s high schools saw the only average boost in scores on the CCRPI — a 110-point school report card that grades schools on several factors, including student performance on standardized state tests.\nTeachers accused of post-Trump election vitriol: Two Cross Keys High School teachers were removed from their classes after allegations they’d made pro-deportation statements after Donald Trump’s presidential election win, as had many students and teachers across the country. Both later resigned.\nDistrict begins testing water for lead: Green called it an emergency action when he decided in September to test water in all district buildings for lead. He cited the Flint, Mich., water crisis as the cause, though water woes there have been ongoing for more than a year. Atlanta Public Schools officials, based on Flint, decided to test their water several months before DeKalb.\nHere, city, county and business community leaders hopes to build a state-of-the-art residential/retail/commercial metropolis may have been undermined by DeKalb County School District officials not participating in a tax district. (AJC FILE PHOTO)\nThe school district stayed out of the real estate business: The Doraville tax district was seen as revolutionary. It would be the foundation for a metropolis of sorts along the 285 corridor near Buford Highway. The DeKalb County School District would generate more than half the tax dollars. The district declined the invitation.\nDeKalb County Schools hires more than five dozen uncertified teachers: Human Capital Management czar Leo Brown says to help with hard-to-fill positions, the district has been using its new Strategic Waivers School System status to bring in people who may have the experience, but not the teacher certification. Several board members voiced concern with the practice during recent meetings.\nDeKalb County school bus drivers were involved in more than 200 wrecks in 2016: But that number isn’t accurate, as records show the district did not submit reports for accidents before July 21. The Georgia Department of Transportation requires bus accidents to be reported to them within 25 days. Last year, the district reported just two accidents. The year before? None.\nCross Keys sees an 18-point graduation rate increase: Principal Jason Heard couldn’t reach his parents. It wasn’t just that they weren’t involved in their child’s education. They didn’t understand it. At Cross Keys High School, 86 percent of the student population is Hispanic or Latino. Many of their parents speak English as a second language, if at all. A program in the school is helping many of them learn English. Parent participation, and the graduation rate, are up.\nThe AJC has created the The Ultimate Atlanta School Guide that lets you look at and compare critical data for every school in Georgia. You can find it at http://schools.myajc.com/#/schools.","url":"https://www.ajc.com/news/local-education/from-2016-dekalb-county-schools-made-plenty-news-both-good-and-bad/R9y0XUIbcL2VxjKXfRGmkM/"}
