{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 20:56:12","date_modify":"2018-10-30 20:56:12","date_publish":"2015-09-27 15:21:40","description":"The cartoonist behind an image of Mohammed that sparked bloody retribution worldwisde says he has \"no regrets” about drawing the picture","filename":"data/vaneerConsumption/TenYearsOnDanishMohammedCartoonistHasNoRegrets.json","image_url":"https://media.breitbart.com/media/2015/08/Norway.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_09_27__1540932972.html","title":"Ten Years On, Danish Mohammed Cartoonist Has 'No Regrets'","title_page":"Ten Years On, Danish Mohammed Cartoonist Has 'No Regrets'","title_rss":"NULL","source_domain":"breitbart.com","text":"The cartoonist behind an image of Mohammed which sparked bloody retribution worldwide has said that he has “no regrets” about drawing the picture, 10 years on from their first publication. Kurt Westergaard, 80, has received numerous death threats since his depiction of a Middle Eastern man with a bomb for a turban was first published by the daily paper daily Jyllands-Posten on September 30, 2005.\nHe now lives under police protection. In 2010 a man wielding a knife and an axe broke into his home, forcing him to take refuge in his panic room for ten minutes while the man pounded on the door. His five year old daughter was alone in the living room at the time. But far from regretting drawing the image, he says his overwhelming feeling about the affair is one of anger.\n“My basic feeling has been and still is anger. If you are threatened I think anger is a good feeling because it is like you mentally strike back,” he told AFP in a telephone interview.\nJyllands-Posten printed twelve cartoons, of which Westergaard’s was just one, as part of a debate about self-censorship and freedom of expression after a publisher found it impossible to find anyone willing to draw a picture of Mohammed to illustrate a children’s book on his life. Depictions of Mohammed are prohibited by Islam, and illustrators feared retaliation.\nPerhaps with good reason. The cartoons were met with fierce protest in the Muslim world as their media gave the matter prominent airtime. Danish flags and diplomatic offices alike were torched around the world by baying mobs. As many as 200 people are reported to have been killed during protests. Churches and Christians in those countries were also attacked, as were the diplomatic offices of other European countries.\n“I have no problems with Muslims as a whole, I will always fight for people’s right to have their religion and their beliefs. That is a private matter,” Westergaard said. An atheist himself, he added that the cartoon had not been intended as a criticism of Muslims in general, but of “terrorists who get their spiritual ammunition from parts of the Koran.\n“During the years I have made a lot of cartoons that criticise politicians and politics, so it was kind of a routine job. It was just another day at the office.”\nHe believes that the cartoons were only a catalyst for sentiments that had been brewing for some time. “Now it was the cartoons that started this confrontation or collision, but it might also have been a play, a book or something else,” he said.\nThe cartoons again had the spotlight turned on them in the wake of the massacre at the offices of satirical magazine Charlie Hebdo in Paris, in January, well known for printing irreverent images of everyone, including Mohammed. 12 people including five of the magazine’s cartoonists were killed in that attack. Al Qaeda later claimed responsibility, citing the motive as “revenge for the honour of” the prophet.\nBut despite its role as Denmark’s most right wing daily, and having never backed down from defending its own cartoons, Jyllands-Posten was the only major Danish daily not to carry any illustrations from Charlie Hebdo in the wake of the Paris attacks.\n“The truth is that for us it would be completely irresponsible to print old or new Prophet drawings right now,” editor Jorn Mikkelsen wrote.\nWestergaard, who retired from Jyllands-Posten in 2010 saying he hoped to lower the terror threat against the paper following several terror plots, said Mikkelsen’s decision illustrated how freedom of speech had suffered another set-back amid widespread fear of another attack.\n“I think the Danes today are very much afraid of terror, of these sudden attacks. And it is very difficult to admit that you are afraid,” he said.\nHe was particularly critical of recent remarks by the head of Denmark’s trade union for school head teachers, who recently said that it was unnecessary to show Mohammed cartoons in schools.\n“They say that now we must show tolerance and we must be very careful that we don’t offend our fellow Muslim citizens. But the fact is that it is fear, and that is something very deplorable. Of course I understand that people are afraid, I am also afraid, but I am more angry than I am afraid,” he said.\nAs the ten year anniversary of the cartoons’ publication nears, Westergaard said he was “excited” to see how they are commemorated, but added that he didn’t think there would be any new charicatures of Mohammed as it would be too dangerous.\nHowever, he is optimistic, believing the erosion of free speech to be temporary. “You can’t suppress or prevent journalists, intellectuals and creative people from using freedom of speech,”","url":"https://www.breitbart.com/europe/2015/09/27/ten-years-no-regrets-says-danish-mohammed-cartoonist/"}
