{"authors":[],"date_download":"2018-10-30 20:16:45","date_modify":"2018-10-30 20:16:45","date_publish":"2015-03-04 16:52:16","description":"»Veteran Fulton police officer ambushed, killed near Fairburn»PHOTOS: Metro Atlanta fallen officersAge: 48 Work: 22-year veteran of the Fulton County Police Department Education: Morris Brown College and the former Briarwood and Woodland high schools in East Point Survivors: Green is survived by his parents, Johnny and Bertha Green; four sons, Marquez, Isaiah, Emmanuel and Samuel; and an older brother, William.","filename":"data/vaneerConsumption/TerenceAveryGreen19662015.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_terence-avery-green-1966-2015__1540930605.html","title":"Terence Avery Green: 1966-2015","title_page":"Terence Avery Green: 1966-2015","title_rss":"NULL","source_domain":"ajc.com","text":"Age: 48\nWork: 22-year veteran of the Fulton County Police Department\nEducation: Morris Brown College and the former Briarwood and Woodland high schools in East Point\nSurvivors: Green is survived by his parents, Johnny and Bertha Green; four sons, Marquez, Isaiah, Emmanuel and Samuel; and an older brother, William.\nWhat they’re saying:\n“You could call him Officer Friendly. He had a bond in this community. He was a very friendly person — he didn’t meet any strangers.”\n— Cassandra Jones, Fulton County police chief\n…\n“This is a reminder of the risks our officers face every day on the job. Oftentimes there is little indication of which calls could leave officers facing eminent danger. At this time, I ask that you pray for Detective Green’s family as well for the men and women with whom he served.”\n— John Eaves, Fulton County commission chairman\n…\n“The guy carried himself professionally. As a personal friend, it was the same. He’s going to be missed.”\n— Carlton Gammage, longtime friend\n…\n“The APD sends heartfelt condolences to the Fulton County Police Department on the tragic loss of a police officer. May God Bless all first responders and their families.”\n— Atlanta Police Department\n…\n“This would’ve been the cop that you wanted to talk to. He would’ve worked the situation out with you.”\n— Mike Burns, longtime friend\n…\n“Our thoughts and prayers are with the Fulton County Police Department and their fallen officer’s family this morning.”\n— Gwinnett County Sheriff’s Office\n…\n“The Paulding County Sheriff’s Office would like to offer its deepest condolences to the Fulton County Police Department and the family of the officer who was killed in the line of duty last night. R.I.P.”\n— Paulding County Sheriff’s Office","url":"https://www.ajc.com/news/terence-avery-green-1966-2015/RUFVU227qWemvj6BMFNoHK/"}
