{"authors":["Benge Nsenduluka For Daily Mail Australia"],"date_download":"2018-10-22 21:20:43","date_modify":"2018-10-22 21:20:43","date_publish":"2017-04-26 01:46:16","description":"She gave birth to her second child four months ago.","filename":"data/vaneerConsumption/TeresaPalmershowsoffimpressivepostbabybody.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B72B400000578-0-image-a-49_1493167067995.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446042_Teresa-Palmer-shows-impressive-post-baby-body_1540243243.html","title":"Teresa Palmer shows off impressive post-baby body","title_page":"Teresa Palmer shows off impressive post-baby body | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She gave birth to her second child four months ago.\nAnd Teresa Palmer, 31, showed off her impressive post-baby body during a low-key stroll with her newborn son Forest Sage in Los Angeles on Tuesday.\nThe Hollywood actress displayed her toned pins and slender arms as she carried her precious bub on a suburban street.\nYummy mummy! Teresa Palmer showed off her impressive post-baby body during a low-key stroll with her newborn son Forest Sage in Los Angeles on Tuesday\nThe makeup-free beauty wore a chic black skirt paired with an oversized denim vest and flat lace-up shoes.\nDark designer shades added an element of mystery and she wore minimal accessories.\nHer luscious blonde locks were swept up in a loose bun, with a few strands framing her face.\nLow-key stroll: The Hollywood actress displayed her toned pins and slender arms as she carried her precious bub on a suburban street\nIn an effort to keep little Forrest entertained, the adorable bub played with her fingers as she made her way to an unknown destination.\nThe outing comes as the Hacksaw Ridge star opened up about her parenting methods.\nRevealing her strict parenting methods to Vogue, she described herself as 'totally flawed' because her kids Forest and Bodhi Rain, three, 'sometimes' get TV on the plane and even eat chocolate on 'rare occasions.'\n'Flawed': Teresa recently revealed that her strict parenting is 'flawed' because her kids get TV and chocolate on 'rare occasions'\nCommenting on her near-100 per cent conscious parenting, the blonde beauty told the publication it was part of her mother Paula's suffering at the hands of bipolar and schizophrenia allowed her to do 'anything she wanted.'\n'But I had a little too much freedom,' she insists, 'because my mum didn't have the tools to be able to know how to control me as a teenager.'\nNow, as a birth mother-of-two, and parent of three, including a child from hubby Mark Webber's previous marriage, Teresa appears to have learned to control her kids, but sometimes, things get past the goalkeeper.\n'I try as hard as I can to parent as consciously as I can, but for instance, my kids get free-for-all TV on the plane and my son, on rare occasions, will eat massive blocks of ice-creams and will have chocolates.'\n'Try as hard as I can: The 31-year-old added: 'I try as hard as I can to parent as consciously as I can, but for instance, my kids get free-for-all TV on the plane'\nBecause of that, the Hacksaw Ridge actress insists: 'I'm a totally flawed mum, and I have struggles just like every other person.\nThe beauty also insisted she was interested in the 'weirdest' things, like true crime dramas, UFOs and even underground rap from the 90's.\nShe told the publication that's why she's such a good match for fellow actor and director hubby Mark.\nSuffering: The blonde beauty also told the publication it was part of her mother's suffering at the hands of bipolar and schizophrenia allowed her to do 'anything she wanted.'\nToo free? 'But I had a little too much freedom,' she insists, 'because my mum didn't have the tools to be able to know how to control me as a teenager'\nThe family! The Hacksaw Ridge actress shares her two-kids Bodhi Rain, 3 and newborn Forest Sage with actor hubby Mark Webber (R)\nJust like her love for crime and mysteries, Teresa insists he's also got an 'edgy' side.\nStraight after that assertion, she also doted on her tattooed partner's love for meditation, being present and conscious as a parent, and natural birthing.\nEven edgier was the way the couple met, on the world's 7th most popular social media site (according Worldometers) 'Twitter.'\nPerfect match: The beauty also insisted she was interested in the 'weirdest' things, like true crime dramas, UFOs and even underground rap from the 90's, which is why the pair were a good match\nEdgy! Straight after that assertion, she also doted on her tattooed partner's love for meditation, being present and conscious as a parent, and natural birthing\nNice to Tweet you! Even edgier was the way the couple met, on the world's 7th most popular social media site 'Twitter'\nThe full Tweet read: 'So I just happened to stumble upon @likemark film trailer for @endoflovemovie I was so moved! This will be a must see- check it out guys.'\nMark responded directly to the star soon after: '@tez_palmer you're super awesome! Thanks for the support, made my day!'\nThe pair soon began writing letters to each other over email, while on opposite sides of the US, after the initial Twitter interaction, with Teresa claiming: 'Thank god I saw that trailer.'\nTeresa and Mark met in 2012 and married in Mexico in 2013 while she was pregnant with their first child, Bodhi.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446042/Teresa-Palmer-shows-impressive-post-baby-body.html"}
