{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 21:19:44","date_modify":"2018-10-30 21:19:44","date_publish":"2016-01-28 17:49:45","description":"Hamas' military wing confirmed Thursday afternoon that at least seven of its fighters were killed in a tunnel that collapsed in the northeast section of Gaza City.","filename":"data/vaneerConsumption/TerroristsBuriedAliveasHamasRebuildsTunnelsIntoIsraeliTerritory.json","image_url":"https://media.breitbart.com/media/2015/06/Hamas-terror-tunnel-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_01_28__1540934384.html","title":"Terrorists Buried Alive as Hamas Rebuilds Tunnels Into Israeli Territory","title_page":"Terrorists Buried Alive as Hamas Rebuilds Tunnels Into Israeli Territory","title_rss":"NULL","source_domain":"breitbart.com","text":"EILAT, Israel – Hamas’ military wing confirmed Thursday afternoon that at least seven of its fighters were killed in a tunnel that collapsed in the northeast section of Gaza City.\nThe dead are members of a Hamas commando unit, which was tasked with digging a tunnel into Israeli territory, Hamas sources tell Breitbart Jerusalem.\nThe incident occurred while Hamas forces were inspecting the renovation of a tunnel destroyed by Israel during the 2014 Gaza conflict. The tunnel collapsed due to weather conditions, the Hamas sources said.\n“Hamas jihadists’ attempts to recover the bodies are still ongoing, and involve the organization’s divers unit. One militant, who was critically wounded, was rushed to the hospital. Three others managed to escape moments before the collapse, the Hamas sources said.\nThe bodies are buried some 30 meters below ground. Hamas officials are following the efforts from a specially created situation room, the sources said.\nA spokesperson for the Izz ad-Din al-Qassam Brigades, Hamas’ military wing, declined to comment.\nIn November, Breitbart Jerusalem reported Hamas was in the process of building a sophisticated network of tunnels beneath​ the Gaza Strip, according to multiple sources with knowledge of the ​issue.\nThe tunnel infrastructure mirrors ​the network built by Hezbollah in Lebanon. The Iran-sponsored militia is known to have ​dug a vast underground tunnel ​complex replete with war rooms, internal communication lines, ventilation systems, and even missile silos.\nAsked for comment, a spokesperson for the Israel Defense Forces told Breitbart Jerusalem:","url":"https://www.breitbart.com/middle-east/2016/01/28/terrorists-buried-alive-as-hamas-rebuilds-tunnels-into-israeli-territory/"}
