{"authors":["Associated Press"],"date_download":"2018-10-23 02:16:14","date_modify":"2018-10-23 02:16:14","date_publish":"2016-01-29 16:44:45","description":"PARIS (AP) — A French prosecutor says terrorism has been ruled out in the arrest of a man who tried to bring two handguns into a hotel at Disneyland Paris. T...","filename":"data/vaneerConsumption/TerrorismruledoutingunarrestatDisneylandParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:95c0e8eff64f4260bd22e3b849bcd658-4PuZeKVXE7cd9005b2c876c54f31-895_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422983_Terrorism-ruled-gun-arrest-Disneyland-Paris_1540260974.html","title":"Terrorism ruled out in gun arrest at Disneyland Paris","title_page":"Terrorism ruled out in gun arrest at Disneyland Paris | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Terrorism ruled out in gun arrest at Disneyland Paris\nPARIS (AP) — A French prosecutor says terrorism has been ruled out in the arrest of a man who tried to bring two handguns into a hotel at Disneyland Paris.\nThe Meaux prosecutor Dominique Laurens said Friday that searches of the man's phone records and various locations turned up no link with terrorism. She said the man was moving house and feared his weapons would be misplaced or taken.\nThe man was detained Thursday along with his female partner, who was cleared of complicity, the statement said. He remained jailed Friday.\nFrench police officers patrol outside Disneyland Paris, in Marne-la-Vallee, east of Paris, Friday, Jan. 29, 2016. A man who tried to bring two handguns into a hotel at Disneyland Paris was detained Thursday Jan. 28 along with his female partner, authorities said, amid lingering jitters around the French capital following attacks last year. No one was hurt in the incident, and the park Europe's most-visited tourist attraction remained open after the arrests. (AP Photo/Michel Euler)\nNo one was hurt, and the park — Europe's most-visited tourist attraction — remained open after the arrests at the New York Hotel.","url":"https://www.dailymail.co.uk/wires/ap/article-3422983/Terrorism-ruled-gun-arrest-Disneyland-Paris.html"}
