{"authors":["Katie Mchugh"],"date_download":"2018-10-30 21:40:40","date_modify":"2018-10-30 21:40:40","date_publish":"2016-07-27 03:38:29","description":"Democratic Virginia Gov. Terry McAuliffe defied the Virginia Supreme Court during his Democratic National Convention speech by promising to unilaterally restore voting rights for violent felons — par for the course, considering he's a longtime ally of Hillary Clinton. | Politics","filename":"data/vaneerConsumption/TerryMcAuliffeDefiesVirginiaSupremeCourtsAuthorityinDNCSpeech.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-583555674.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_26__1540935640.html","title":"Terry McAuliffe Defies Virginia Supreme Court's Authority in DNC Speech","title_page":"Terry McAuliffe Defies Virginia Supreme Court's Authority in DNC Speech | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic Virginia Gov. Terry McAuliffe defied the Virginia Supreme Court during his Democratic National Convention speech by promising to unilaterally restore voting rights for violent felons — par for the course, considering he’s a longtime ally of Hillary Clinton.\n“[W]e are overcoming obstacles to deny hundreds of thousands of former felons the right to vote because history tells us that enemies of progress can slow the march toward justice and equality, but they cannot stop it,” he declared in Philadelphia.\nMcAuliffe is determined to deliver a swing-state victory to Democratic nominee Clinton by hook or by crook. A New York Times supporter reports:\nMcAuliffe is not giving up so easily. And the decision may have laid the groundwork for more legal and political maneuvering in a state that both presidential campaigns regard as a major prize. After the Virginia Supreme Court said on Friday that the governor could restore voting rights only on a case-by-case basis, Mr. McAuliffe said he would forgo his blanket declaration — and, instead, individually sign about 206,000 restoration orders for ex-felons, including 13,000 who had registered after his April order.\nMcAuliffe’s beneficiaries are not “former” felons: High-profile killers and sex offenders were “mistakenly” given voting rights, and his administration has repeatedly shot down Freedom of Information Act (FOIA) requests from officials seeking to clarify his blanket order.\nAs Breitbart News has previously reported: “McAuliffe’s order does more than grant felons the right to vote: It allows them to serve on juries, work as notaries, and run for office. It makes no exceptions — every felon from murderers, to rapists, to kidnappers, to child abusers, to burglars, and so forth has been giving the same rights as lifelong, law-abiding citizens.”","url":"https://www.breitbart.com/politics/2016/07/26/terry-mcauliffe-court-felons/"}
