{"authors":[],"date_download":"2018-10-23 05:52:13","date_modify":"2018-10-23 05:52:13","date_publish":"2015-02-25 00:00:00","description":"Regulations intended to block money from getting to terrorist groups has led the last bank that handles most money transfers from the United States to Somalia to pull out of the business.","filename":"data/vaneerConsumption/TerrorismFearsComplicateMoneyTransfersForSomaliAmericans.json","image_url":"https://media.npr.org/assets/img/2015/02/25/somali-money-2_wide-74f0e78207c7beda278f37b228be13f9c454a0ae.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=389037099_1540273933.html","title":"Terrorism Fears Complicate Money Transfers For Somali-Americans","title_page":"Terrorism Fears Complicate Money Transfers For Somali-Americans : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nMany Somalis here in the U.S. have effectively run out of options for getting money to their relatives back home. The last major bank that allowed these transfers has stopped them. So some Somali-Americans and the politicians who represent them are asking the Obama administration to find a solution. There's a meeting scheduled about this tomorrow here in Washington. NPR's Pam Fessler reports.\nPAM FESSLER, BYLINE: Omar Shekhey is like tens of thousands of Somali-Americans. Every month, the Georgia man pulls together a couple of hundred dollars and sends the money to his two sisters back in Somalia.\nOMAR SHEKHEY: This is like their paycheck - it's money that they need to survive. There are no jobs - nothing. They will starve. If they don't get this money, they will starve.\nFESSLER: And right now, he's extremely worried. This month, Merchants Bank of California, the last U.S. bank to handle most of these transactions, pulled out of the business. It cited concerns about meeting federal banking requirements which are intended to stop the flow of funds to criminals and terrorists.\nSHEKHEY: And I don't know where to go, and I don't know where to send that money. So - and this is facing not only me, but the whole community.\nNASIR WARSAMA: Well, the business - basically it's closed.\nFESSLER: Nasir Warsama is regional manager for Amal USA. It's a money transfer business that until last week, operated outside Atlanta. Warsama says his firm would collect small amounts of cash from people like Omar Shekhey, bundle it together and work through a U.S. bank to transfer the funds overseas where the money would be distributed. He says there are few other options in Somalia because the war-torn nation has no central banking system.\nWARSAMA: There's no functioning financial institutions, so the only way they can get support from outside is either through the United Nations or the NGOs or the support from their family members.\nFESSLER: And that support has been huge - an estimated 1.3 billion dollars a year from relatives around the world including more than 200 million dollars from the U.S. But U.S. authorities worry that some of the money could end up in the wrong hands, like those of Al-Shabab, the Somalia-based terrorist group that just released a video calling for attacks on Western shopping malls. So strict tracking rules have been imposed on these money transfers. Rob Rowe, a vice president at the American Bankers Association, says it's all but impossible for banks to comply in a country like Somalia.\nROB ROWE: It's very chaotic because of all the civil unrest, and so when a bank from the United States sends the money, they don't have the information or the transparency that they're required to have.\nFESSLER: Like knowing exactly where the money goes.\nROWE: Bankers are looking at all this, and they know that they're under the microscope, and if they don't do the right thing, they're going to be held accountable.\nFESSLER: Government regulators say they're trying to find a reasonable solution, that they recognize the hardship for Somalis and that the end of regulated transfers could cause more serious problems. That's why a group of lawmakers has asked for an emergency meeting tomorrow with representatives from the Treasury and State Departments and other agencies. Minnesota Democratic Congressman Keith Ellison says he fears that more economic disruption in Somalia will only help Al-Shabab.\nCONGRESSMAN KEITH ELLISON: The last thing that we want to do is push Somalis into the hands of these homicidal maniacs.\nFESSLER: Ellison says people have been talking about this issue for years, but maybe now with the crisis at hand, something will get done. Pam Fessler, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=389037099"}
