{"authors":[],"date_download":"2018-10-22 21:26:14","date_modify":"2018-10-22 21:26:14","date_publish":"2014-05-06 21:55:21","description":"Attacks on mass transit have killed more than 800 people around the world, from Madrid to Moscow to China, over the past decade.","filename":"data/vaneerConsumption/TerrorontheTracksATimeline.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/424716/140506-madrid-train-attack-1800_4c113c12acb34db01c7f16f8cf361550.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_terror-tracks-timeline-n98656_1540243574.html","title":"Terror on the Tracks: A Timeline","title_page":"Terror on the Tracks: A Timeline","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMass transit has become a favorite platform for terror attacks by Islamist militants around the world. A deadly incident last week in China is the latest in a string of assaults on trains and stations stretching back more than a decade that have wounded more than 2,000 people and killed more than 800, with at least 52 fatalities in just the past five months. The attacks have come both in far-flung corners of Russia and China and global hubs like Mumbai and Madrid, and the body count could have been far higher had plots in other major cities, including New York, not been thwarted. Though hardly exclusive to Islamist militants, the tactic seems to have surfaced in 2003 as Muslim separatists battled the Russian government:\nSept. 3, 2003\nA blast rips through a commuter train in Stavropol, a city in Southern Russia not far from the Caucasus. Seven are killed and 80 wounded in the attack. A Chechen rebel group is believed responsible and a Chechen militant was convicted in the bombing. It is part of a series of renewed Chechen rebel attacks against civilian targets in southern Russia and Moscow, coming three years after the Russian military seized Grozny, the capital of the breakaway republic of Chechnya, after a brutal siege.\nDec. 5, 2003\nAn explosion tears through a morning commuter train just outside Yessentuki, Russia, not far from Stavropol. Forty-six people are killed and more than 160 injured.\nAttackers used 11 pounds of explosives, which a suicide bomber carried in a bag. Three Chechen women were believed to have assisted in the attack.\nMar. 13, 2003\nTwelve are killed and 75 wounded by a bomb on a commuter train in Mumbai, India.\nFeb. 6, 2004\nA suicide bomber detonates a bulk explosive at the deepest point in Moscow’s subway system, killing 40 people. The attack is believed to be the work of a Saudi militant, Abu Walid, whose financing of Chechen rebels has given him great power within the Chechen separatist movement.\nThe attack occurs near the Avtozavodskaya metro station and is supposedly a revenge attack for alleged Russian troop atrocities against Chechen civilians in the town of Alda four years to the day earlier.\nMarch 11, 2004\nIn what many intelligence analysts describe as the most significant terrorist attack since Sept. 11, at least 10 bombs detonate on suburban trains and in rail stations at the height of the morning rush hour in southern Madrid. More than 190 die and more than 2000 are wounded in the attacks, quickly making it the second-largest attack since 9/11, surpassing incidents in Iraq only nine days earlier.\nAnalysts see the attacks as significant for several reasons:\nThe attacks were coordinated so that all the bombs went off within a 20-minute period, exhibiting a level of sophistication not previously seen anywhere.\nThe plans were put together in less than two months – unlike attacks such as Sept. 11, which took years.\nThe bombs were built from limited materials like cellphone detonators, explosives stolen from a quarry, and sports bags.\nThe plot was carried out not by al Qaeda or even an affiliate, but instead by radical Muslims who identified with al Qaeda and were led by a charismatic figure.\nRescue workers evacuating the body of a victim after a train exploded at the Atocha train station in Madrid on March 11, 2004. PIERRE-PHILIPPE MARCOU / AFP - Getty Images\nAug. 31, 2004\nA bombing at the entrance to the Rizhskaya metro station in northeastern Moscow kills 10. It may have been the work of a female suicide bomber who was the sister of a Chechen woman suspected of having blown up one of two airliners brought down on Aug. 24.\nMayor Yuri Luzhkov later attributes the attack to a female suicide bomber who sought to enter the metro station but turned around after seeing two policemen posted at the station’s entrance. The area outside the station was crowded when the bomb, apparently attached to the woman, went off. The blast killed at least 10 people, including the suspected bomber, and wounded more than 50, while setting several cars on fire and blowing out windows in nearby buildings.\nJune 15, 2005\nChechen rebels use explosives to derail a train on its way from Grozny to Moscow. The train leaves the tracks, but only 15 people are injured.\nJuly 7, 2005\nFour suicide bombers set off bombs on London Underground trains and a double-decker bus, killing 52 people in the worst terrorist attack ever in the U.K. and the country’s greatest civilian loss of life since the Blitz more than 60 years earlier. The bombers are all British nationals and three are British-born. Three are of Pakistani descent, the fourth a Jamaican who converted to Islam.\nA front view of the bus destroyed by a bomb in London on July 8, 2005. DYLAN MARTINEZ / AP\nJuly 21, 2005\nTwo weeks after the first London Underground bombing, four other would-be suicide bombers attempt an identical attack on three trains and a bus. The detonators explode, wounding one passenger, but the bombs fail to go off. Within days, all four men are identified and arrested. Again, all are British nationals, this time of East African descent.\nJuly 11, 2006\nMore than 130 die in a series of attacks on the Mumbai transit system during evening rush hour. Pressure cookers with a mixture of ammonium nitrate and RDX, an explosive more powerful than TNT, are placed on seven trains plying on the western line of the suburban commuter train network. The first blast reportedly takes place at 6:24 p.m., and the explosions continue for approximately 11 minutes. All the bombs had been placed in the first-class compartments of trains running from downtown Mumbai to the western suburbs.\nAug. 13, 2007\nAn explosion along the Moscow-St. Petersburg rail line derails an express train 200 kilometers south of St. Petersburg and injures 60 people. Authorities later arrest two suspects and search unsuccessfully for a third -- a former military officer.\nNov. 29, 2008\nGunmen enter the Chhatrapati Shivaji Terminus, Mumbai’s biggest train station, and open fire on commuters. Using AK-47’s, they kill 58 people and wound 104. It’s part of a well-planned and executed multi-day siege of the city. In 10 coordinated attacks across Mumbai, members of the Pakistan-based terror group Lashkar e Taiba kill at least 173 people and wound at least 308.\nNov. 27, 2009\nAnother bomb explodes along the Moscow-St. Petersburg rail line and derails an express train, killing 27 people. The bomb was homemade and was equivalent to 15 pounds of TNT.\nMarch 29, 2010\nTwo female suicide bombers kill at least 35 people at two Moscow metro stations, the third attack on the city’s rapid transit system since 2003 and the fifth attack on Russian transit targets. City officials reported that 23 people were killed in the first explosion at the Lubyanka station, and 12 people were killed 40 minutes later in a blast at the Park Kultury station. Dozens were injured.\nDec. 29, 2013\nA suicide bomber detonates a device filled with more than 20 pounds of TNT just inside the entrance hall of the Volgograd train station in Southern Russia. At least 16 people are killed and more than 50 wounded. Muslim radicals from the Caucasus are believed responsible. The attack came two days after a bomb detonated aboard a city bus, killing 14.\nMarch 1, 2014\nEight knife-wielding men and women enter the main train station in Kunming, China, and begin hacking passengers and employees with machete-like knives, killing 29 people. Another 140 people were wounded in the attack. There was no claim of responsibility but Chinese and U.S. officials have ascribed the attacks to Uighurs, a Muslim minority in the restive Chinese province of Xinjiang, at the country’s Western edge. The attack took place in the entrance hall and ticket lobby.\nMedical workers transport a man wounded in a deadly stabbing attack at a railway station to the emergency room in a hospital in Kunming in China's Yunnan province. WEN RUOYU / EPA\nApril 30, 2014\nAn explosion rocks the main train station in Urumqi, the capital of Xinjiang, killing three and wounding 79. Initial reports attributed the violence to another group of knife-wielding assailants, but it now appears that a suicide bomber may have been responsible. Details of the attack are still emerging. Adding to its significance, the attack came as Chinese President Xi Jinping was leaving the city, ending a four-day visit to the region.\nRelated: China's Terror Problem Worsens: Uighurs Stage First Suicide Bombing\nSecurity personnel inspect the explosion site outside Urumqi South Railway Station in Urumqi in northwest China's Xinjiang Uygur Autonomous Region, on April 30 after an explosion that killed three people and injured dozens. AN HE / EPA\nMay 6, 2010\nAt 11:30 a.m. local time, one or more assailants stabs travelers outside a train station in the southern Chinese city of Guangzhou. At least six people are injured. While initial reports describe four assailants, police say a single suspect acted alone. It is not yet known whether the incident is linked to the earlier Uighur attacks on train stations.","url":"https://www.nbcnews.com/news/investigations/terror-tracks-timeline-n98656"}
