{"authors":["Edward Harrison","Credit Writedowns"],"date_download":"2018-10-30 23:04:53","date_modify":"2018-10-30 23:04:53","date_publish":"2018-07-24 00:00:00","description":"The annualized burn rate for Tesla is $4 billion right now, and the next couple of quarters of earnings are critical for the company. The situation parallels Amazon in 2001 — but things won’t necessarily have as happy of an ending.","filename":"data/vaneerConsumption/Teslaisburningcashnextfewquarterscrucialtofixingfinances.json","image_url":"https://amp.businessinsider.com/images/5b57766fab32a627008b4767-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_tesla-is-burning-cash-next-few-quarters-crucial-to-fixing-finances-2018-7_1540940693.html","title":"Tesla is burning cash, next few quarters crucial to fixing finances","title_page":"    Tesla is burning cash, next few quarters crucial to fixing finances - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Amazon analogy I made last month really makes sense when talking about Tesla because we are nearing the end of this cycle. Now is the time to worry about cash flow because the potential for a sudden funding halt is increasing.\nTake a look at how this issue was framed as the bubble popped. Justin Fox gave a retrospective at HBR in 2013:\nIn March 2000, Barron's reported that 51 Internet companies were burning cash so fast that they'd be broke by the end of the end of the year. The article (it's behind a seemingly unbreachable paywall) has acquired the reputation of having marked the end of the dot-com boom. The Nasdaq composite index peaked on March 10 at 5132, and by the end of the month was in a full-on collapse (as I write this, it's only at 3155, despite years of gains).\nThe Burn Rate 51 was made up mostly of now-forgotten companies like drkoop.com and CDNow. But it also included a certain Internet bookseller from Seattle. The Barron's article mentioned that a 690 million euro convertible bond sale in February had bought Amazon some more time (the list was based on 1999 year-end data) — but that the company would still run out of cash in 21 months.\nSo what then-Lehman Brothers analyst Ravi Suria was saying about Amazon makes sense:\nWe believe that the low levels of working capital could trigger a creditor squeeze in the second half of the year, creating considerable downside risk to revenue and cash estimates for the second half.\nAmazon CEO Jeff Bezos was furious and sent his spokesman out to do damage control.\n\"He said we'd be out of cash by the time we'd paid our Christmas bills, I don't know if that was in his first wrong report last year or his second wrong report last year.\"\nCompare 2001 Amazon to 2018 Tesla then\nThe good thing is Amazon survived. And now it's the largest company by market capitalization in the entire world. It's a good message for Tesla on some level since the parallels are large.\nTesla will need to pay down a $230 million convertible bond this November if its stock doesn't reach a conversion price of $560.64, and a $920 million convertible note next March if the stock doesn't reach $359.87. Shares closed Friday at $313.58, and are down about 4.5% over the past 12 months.\nAnd some industry watchers are as concerned about Tesla as analysts were about Amazon in 2001. Witness these comments from the article linked above regarding Tesla's unusual request that suppliers rebate Tesla money to help ensure its profitability.\nDennis Virag, a manufacturing consultant who has worked in the automotive industry for 40 years, said a solicitation like Tesla's could put suppliers in financial peril and jeopardize its future supply of car parts.\n\"It's simply ludicrous and it just shows that Tesla is desperate right now,\" he said. \"They're worried about their profitability but they don't care about their suppliers' profitability.\"\nWatch the burn rate\nTesla has to refinance $1.2 billion in bonds by next March if its stock doesn't go up. And that will come directly from its cash. The annualized burn rate for Tesla is $4 billion right now. And it only had $2.7 billion of cash on hand a year ago. If you add the $4 billion to the $1.2 billion you get $5.2 billion, which far exceeds $2.7 billion. So you can see the problem.\nIf Tesla doesn't get that burn rate down, it is going to have funding problems. These next couple of quarters of earnings are critical for Tesla then. Amazon is a great historical parallel. But things won't necessarily end for Tesla the way they did for Amazon.","url":"https://www.businessinsider.com/tesla-is-burning-cash-next-few-quarters-crucial-to-fixing-finances-2018-7"}
