{"authors":["Matthew Debord"],"date_download":"2018-10-30 20:31:49","date_modify":"2018-10-30 20:31:49","date_publish":"2016-12-29 00:00:00","description":"As 2017 begins, shares could be more correctly priced, though that's no comfort to investors who bought in at the start of 2016.","filename":"data/vaneerConsumption/Teslastockdownfortheyear.json","image_url":"https://amp.businessinsider.com/images/58656ceaf10a9a13018b5ca8-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_tesla-stock-down-for-the-year-2016-12_1540931509.html","title":"Tesla stock down for the year","title_page":"    Tesla stock down for the year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"MarketsInsider The Wall Street Journal's Steven Russolillo tweeted Thursday that Tesla shares were down at the end of year for the first time since the carmaker's 2010 initial public offering.\nIt's an accurate observation, though one that should be taken with a rather large grain of salt. After all, the stock finished 2013 up by over 300%.\nTesla is indeed down just over 10% in 2016, after sliding by more than that for a time, but shares are also trading above $200, an important level if Tesla is to vindicate its more than $30 billion market cap and, even more important, establish a baseline that will make achieving Wall Street's more bullish prediction possible.\nIn fact, Tesla's slide in 2016 could be a positive thing. It was primed for a fall at the beginning of the year, starting at $240 and plunging to almost $140.\nTesla shares are down 10% this year, making 2016 the first time that $TSLA has dropped in a calendar year since its 2010 IPO. — Steven Russolillo (@srussolillo) December 29, 2016\nAs 2017 begins, shares could be more correctly priced, though that's no comfort to investors who bought in at the start of 2016 (investors who bought at the bottom are probably quite happy, however).\nThe coming year will be an interesting one for Tesla investors. It's unclear whether the stock will repeat its historic volatility — or whether it will settle into a more stable pattern.\nBear in mind that Tesla could also be tricky to properly value in 2017, as it merges the car business with the solar business through its recent acquisition of SolarCity.","url":"https://www.businessinsider.com/tesla-stock-down-for-the-year-2016-12"}
