{"authors":["Chriss W. Street"],"date_download":"2018-10-30 22:13:12","date_modify":"2018-10-30 22:13:12","date_publish":"2016-10-04 21:47:51","description":"California Department of Motor Vehicles formally issued draft regulation demanding Tesla Motors Inc. to cease and desist from using the terms “self-driving,” “automated” or “auto-pilot” in advertising, unless vehicles are capable of driving themselves without any human back-up. | Local","filename":"data/vaneerConsumption/TESLACaliforniaRegulatorstoDemandCeaseDesistAdvertisingAutopilot.json","image_url":"https://media.breitbart.com/media/2016/07/wi/ap_ap-photo-1653.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_10_04__1540937592.html","title":"TESLA: California Regulators to Demand Cease & Desist Advertising “Auto-pilot”","title_page":"TESLA: California Regulators to Demand Cease & Desist Advertising “Auto-pilot” | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California Department of Motor Vehicles formally issued draft regulation demanding Tesla Motors Inc. to cease and desist from using the terms “self-driving,” “automated,” or “auto-pilot” in advertising unless vehicles are capable of driving themselves without any human back-up.\nTesla has bet the farm on their “Autopilot System” as a disruptive innovation that allows its all-electric Model S and Model X SUV to independently travel, steer and brake along public streets and freeways.\nAlthough Tesla operators were noticed that they are supposed to be ready to grab the wheel and step on the break whenever an emergency presents itself, there are plenty of videos with Tesla drivers jumping in the back seat to play video games or take a nap.\nAs a consequence, there have been about a dozen Tesla Autopilot crashes. The worst incident was a fatal May 7 crash where a Tesla driver appears to have been watching a Harry Potter video while “Autopilot” drove his car into a T-bone with a commercial big rig.\nThe National Highway Traffic Safety Administration (NHTSA) Office of Defects probe’s initial report stated that the Tesla Model S on autopilot was speeding and never braked when the car approached a tractor trailer making a legal left turn.\nTesla’s CEO Elon Musk claims the coming updated Autopilot System will make vehicles more reliant on radar versus cameras, a move Musk called a “dramatic improvement’ that could have prevented the recent accidents.\nBut most Wall Street analysts believe that those changes are the result of Tesla’s key supplier of semi-autonomous car technology, Israeli-based Mobileye NV, canceling their joint-agreement to provide the computer chips and algorithms that drive “Autopilot.” Mobileye had warned Tesla not to promote the technology as capable of “self-driving.\nDespite dumping Tesla, Mobileye still has agreements to supply camera-based driver-assistance systems to over a dozen other auto makers including General Motors, Nissan Motor Co., BMW, AG, and Hyundai Motor that account for more than 60 percent of Mobileye’s sales.\nThe California DMV rates Tesla’s Autopilot as just a “level-two version” of self-driving technology, based on a five step scale adopted by the federal government and the auto industry. The DMV draft regulations will only allow vehicles rated at levels three, four or five to advertise they have any self-driving capable while functioning on “auto-pilot.”\n“Level-three” vehicles will be allowed to only drive themselves under limited conditions without a human occupant paying attention and ready to intervene. To be a level five vehicle, the car must be able to operate on a fully automated basis under the mot sever conditions.\nTesla’s spokeswoman e-mailed the San Francisco Chronicle, “Tesla is reviewing the draft regulations and will provide input to the DMV as appropriate.” She added “Autopilot makes driving safer and less stressful, and we have always been clear that it does not make a car autonomous any more than its namesake makes an aircraft autonomous.”\nTesla is pushing innovation, but Breitbart News reported in October 2015 that Consumer Reports pulled Tesla Model S’s perfect 100-point score as “best car ever,” after receiving 1,400 responses from owners over the following month that complained about squeaks, rattles, and multiple electric motor replacements. Consumer Reports revised its score for a new $127,820 Model S to a “worse than average” 43, after a study warned that 2/3 Tesla’ cars will need entire drivetrain replacements before they reach 60,000 miles.\nConsumer Reports in July of this year argued that Tesla should stop using the “Autopilot” name because, “It’s really a driver-assist technology. CR called the advertising it as “Autopilot — that was outrageous.” Consumer Watchdog, a nonprofit group that has been critical of Tesla’s Autopilot deployment, cheered the draft regulations, “The advertising regs are exactly what’s required.”\nCalifornia Governor Jerry Brown signed a bill into law on September 30 that does allow autonomous vehicles to operate on public roads without a driver, steering wheel or human-operated breaks. Companies can now test wat is expected to be driverless shuttles if they meet a 15-point federal safety assessment guidelines and have a two-way communication link between the vehicle’s passengers and a “remote operator.”","url":"https://www.breitbart.com/local/2016/10/04/tesla-california-regulators-demand-cease-using-self-driving/"}
