{"authors":["Matthew Debord"],"date_download":"2018-10-30 22:51:55","date_modify":"2018-10-30 22:51:55","date_publish":"2016-12-10 00:00:00","description":"Morgan Stanley's Adam Jonas thinks the Model 3 will be late. But it won't be.","filename":"data/vaneerConsumption/TeslasModel3wontbelate.json","image_url":"https://amp.businessinsider.com/images/57a12a9d88e4a714088bca08-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_teslas-model-3-wont-be-late-2016-12_1540939915.html","title":"Tesla's Model 3 won't be late","title_page":"    Tesla's Model 3 won't be late - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"I'll drink to that! Reuters/Noah Berger Tesla is about to close out its best-ever year for delivering cars.\nBy the time 2016 is in the books, around 80,000 Tesla vehicles should be in the hands of customers.\nThat's about 30,000 more deliveries than last year. But it's unlikely that CEO Elon Musk and his team will be satisfied.\nFor one thing, that's 10,000 fewer deliveries than the company guided to early in 2016. And for another, Tesla has to focus and focus hard on its next milestone: the on-time launch of the Model 3 mass-market sedan.\nLast week, Morgan Stanley lead auto analyst Adam Jonas — a reliable Tesla bull and a pretty out-there theorist on Wall Street when it comes to the future of transportation — published a research note in which he zeroed in on the Model 3 and its importance the the automaker.\n\"In our view, the Model 3 is a potential funding strategy for Tesla's bigger mission to accelerate the development of a highly safe and efficient transport utility,\" he wrote. \"However, 2017 is all about the later stages of development (and the possible commercial launch) of the Model 3.\"\nNo Model 3 until 2018?\nBut then Jonas reiterated what could be considered a controversial prediction.\n\"We do not expect the Model 3 to be launched in 2017,\" he wrote. [His emphasis.]\nAnd he added this, which I'm excerpting at length:\nWhile we cannot rule it out, we do not adopt as our base case a scenario in which Model 3 deliveries begin in 2017. We recognize that Tesla management has targeted a [second-half] launch date and that they will make every effort to satisfy high levels of preliminary demand and fill orders for the product as soon as possible. However, our base case is for a launch in late 2018. We have taken this conservative approach to allow for the probability that Tesla will choose to prioritize the quality, cost, performance and lifesaving technology of the vehicle. While Tesla still adopts a high level of vertical integration, we expect the Model 3 to rely even more extensively on 3rd party suppliers than the Model S, potentially increasing the scope of supply-related factors outside of the company's control.\nJonas has hit on a couple of critical issues here.\nFirst, Tesla won't want to launch a Model 3 that isn't, at some level, groundbreaking. It needs to turn heads and blow minds.\nBut that doesn't mean it has to be another Model X, a vehicle that was launched in late 2015 after delays of three years and that was so complicated in its design that Musk said the automaker had been hubristic in designing and engineering it. The Model 3 will be a mass-market sedan, at least at first (other types of vehicle will follow, chiefly a compact SUV). A major carmaker could get production rolling on such a car without breaking a sweat.\nThe Model 3. YouTube/Motor Trend\nSecond, I'm not sure Jonas is right about the supply chain questions. Yes, Tesla has been trying to deal with an assortment of supplier issues, and one of its solutions is to bring production of some components in-house. But again, the Model 3 doesn't have to be difficult build. With a factory in Northern California, Tesla is a bit off the normal, Midwest supplier and southern US grid. But that really just means adding in some additional transport time for parts.\nI reached out to Tesla for some comments on his qualified skepticism about a late 2017 Model 3 launch, but I didn't hear back immediately.\nNah, the Model 3 will be on time\nThe launch could easily slip into early 2018, but I don't think that will happen. Here's why.\nThe Model 3 was unveiled in March of 2016 (I was at the unveiling). These were prototype cars, but they were operational — they weren't auto-show-floor concepts that you could only look at, not touch or drive.\nAssuming that the basic design and engineering of the vehicle is set, then building it is simply a matter of adding the manufacturing capacity in Fremont, where the factory is located and where the Model S sedan and Model X SUV are assembled; setting up the suppliers and getting the parts in-bound; squaring away the labor and \"training\" the industrial robots that will do stuff like body welds; and having the proper stamping and tooling in place at the plant to put the cars together.\nNone of this is rocket science, and Tesla has hired an expert production executive from Audi to help make this transition from assembling around 100,000 vehicles annually to 500,000 by 2018. All completely doable.\nA pre-launch version of the Model X, spotted on a California road. YouTube/nbkagzw13\nWe'll be looking for some markers to tell us how well Tesla is doing at having Model 3's ready to roll by the end of 2017 — markers drawn from our experience with the Model X.\nBy spring 2017, we should start to see photos and videos — created both by Tesla and by amateurs — of the Model 3 being tested in the wild.\nBy summer, we should begin seeing vehicles that are closer to the production vehicle in appearance, on roads around Fremont. Around the time Tesla reports second-quarter earnings, Musk should have some comments about what its like to drive the Model 3, as he's usually the company's Number One tester. (Look for a lot of color on Autopilot features from Musk, by the way, when he doesn't start taking).\nThese will all be signs that the Model 3 is on schedule. Closer to launch, the automaker will have to give vehicle to government for crash-testing, so that will an additional tell.\nWhat Tesla is getting good at\nMusk should be smiling about the Model 3 in 2017. Lucy Nicholson/Reuters\nObviously, if Tesla misses some of these marks, then Jonas could have a point. But Tesla did manage to hit them with the Model X, once it got down to business on the vehicle, and the pre-launch process for that vehicle was much more fraught (the exotic, upswinging falcon-wing doors, for example, has to be re-engineered, as the rear seats were revamped at the eleventh hour). The car still showed up by the launch date.\nThe bottom line here is that that Tesla is getting much better at passing major tests. It's doing an effective job of selling, building, and delivering the Model S. After a long wait, the Model X is on track and, according to Tesla, making owners very happy. The Model 3 is, indeed, a Very Big Test. But Musk and his team have done the preparation.\nThey know how to build cars. They know how to build one on something resembling a traditional-automaker's schedule. And they've made enough mistakes to know how to not make them again.\nI don't think the Model 3 will be early. But if Tesla doesn't roll a couple off the assembly line in late 2017, I'll be shocked.","url":"https://www.businessinsider.com/teslas-model-3-wont-be-late-2016-12"}
