{"authors":["Marita Noon"],"date_download":"2018-10-30 20:48:01","date_modify":"2018-10-30 20:48:01","date_publish":"2015-10-26 03:43:36","description":"The American consumer resists marketing aimed at selling them electric and hybrid vehicles. For the first quarter of 2015, according to the Wall Street Journal (WSJ), Chevrolet sold 1,874 Volts—its electric car introduced in 2010 with “high expectations.” That roughly equals the number of Silverado pick-up trucks sold in one day. |","filename":"data/vaneerConsumption/TeslasSuccessaGreatExampleofHowRegulationsManipulateMarkets.json","image_url":"https://media.breitbart.com/media/2015/09/ap_franz-von-holzhausen-tesla-model-x_ap-photo-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_25__1540932481.html","title":"Tesla's 'Success' a Great Example of How Regulations Manipulate Markets","title_page":"Tesla's 'Success' a Great Example of How Regulations Manipulate Markets | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The American consumer resists marketing aimed at selling them electric and hybrid vehicles. For the first quarter of 2015, according to the Wall Street Journal (WSJ), Chevrolet sold 1,874 Volts—its electric car introduced in 2010 with “high expectations.” That roughly equals the number of Silverado pick-up trucks sold in one day.\nIn another report, WSJ states: “Through June, the market share in the U.S. for hybrid electric cars such as the Toyota Prius and C-Max and for electric vehicles such as the Leaf accounted for 2.8% of industry sales. That is down from 3.6% through the same period in 2014. Volumes of those vehicles fell 22% while overall industry volumes rose, according to researcher Edmunds.com.”\nWhile demand for electric vehicles has dropped, investment in them hasn’t. Earlier this year, USA Today noted: “Automakers have already invested billions to offer a wide spectrum of vehicle choices and improve fuel efficiency with turbocharged engines, batteries and electric motors, multi-gear transmissions, more aerodynamic designs and lighter materials. Companies have also spent heavily to market eco-friendly vehicles and have no plans to stop developing them.”\n“Why,” you might ask, “don’t manufacturers focus on building the cars consumers want?” The answer: government regulations in the form of the CAFE standard. The word CAFE here means “Corporate Average Fuel Economy” and is the measure manufacturers must meet to sell cars in the U.S.\nFirst enacted by Congress in 1975, CAFE standards sought reduce energy use, thus preventing an over-dependence on foreign oil and improving national security. In 2009, under the Obama administration, the program morphed to include a higher focus on tailpipe emissions with a two stage implementation process. Phase One demands a 23% improvement in pollution standards and a CAFE target of 34.1 miles per gallon (MPG) by model-year 2016. Phase two calls for a further increase of roughly 35% in pollution standards, equivalent to 54.5 miles per gallon by 2025.\nWhile the exact calculations are complicated, these standards are not meant to be met by each vehicle, but by the entire fleet produced by each manufacturer. So a company that makes small, fuel-efficient cars, such has Honda, easily meets the requirements. While a company like Chrysler, known for its Ram trucks and American muscle cars, faces an uphill climb. In fact, it is the CAFE Standards that made the Chrysler/Fiat marriage attractive, as the Fiat fleet includes a 40-MPG car. It is also what makes the Volt a good option for Chevy.\nManufacturers who don’t comply with the regulations face fines—or they can buy credits. Either way the costs ultimately get passed on to the consumer who dares to purchase a vehicle based on his or her personal preference rather than the fuel-efficient vehicles the government wants automakers to produce.\nThese government regulations manipulate the markets and make winners and losers that would not be the case if we had a true free market.\nInteresting stories emerge.\nOne is Ferrari, which by the nature of the car, can’t meet the U.S. government regulations. As one report on the topic declared: “Ferraris are beautiful. They are fast. They are nimble. And they are thirsty.” The hybrid LaFerrari gets 14 MPG.\nMost readers are not likely to buy one of the 499 LaFerrari cars built, but its story is illustrative of the market manipulation.\nSince 1969 Ferrari has been part of the Fiat family, but that will soon change as Ferrari is being spun off to make it an independent automaker. While the sale is reportedly being done “to finance expansion plans,” it will remove the gas-guzzler from the Fiat Chrysler fleet—making meeting CAFE easier. Yet, earlier this year, CEO Sergio Marchionne said: “the U.S. auto industry should ask the U.S. government to push back fuel economy targets.”\nWhile an independent Ferrari will have challenges meeting CAFE without Fiat to help create an acceptable average, another single focused manufacturer meets the requirements handily—so well, in fact, it has credits to sell. I am talking about Tesla, the car company that the Environmental Protection Agency smiles upon because it produces only electric cars.\nMost U.S. car companies—like Fiat Chrysler—want the federal fuel economy mandates to be watered down. Tesla wants the targets to be tougher.\nCompanies—like Ferrari—that don’t meet the fleet standards can purchase compliance credits. CNN Money reported: “Since Tesla sells nothing but electric cars, it is rolling in the credits and is one of the few sellers.” The Los Angeles Times (LAT) says: “Since 2008, the company has earned more than $534 million from the sale of environmental credits.” It adds: “Tesla has created a brisk market in credits, selling to automakers that either don’t produce electric cars or have made a strategic decision to buy credits and cap their own sales of such vehicles.”\nBut it is not just Ferrari that will have trouble meeting the 2025 standard. According to LAT, Mitch Bainwol, chief executive of the Alliance of Automobile Manufacturers—which represents companies like General Motors, Ford, Toyota, Fiat Chrysler, and others—said: “While consumers have more choices than ever in energy-efficient automobiles, if they don’t buy them in large volumes, we fall short.”\nWith the American car-buying public resistant to doing what the government wants them to do, making a car that few can afford and that many of those who can don’t like (On October 20 Consumer Reports pulled its “recommendation” of the Tesla Model S after owners complained about a “range of issues”), Tesla receives a huge windfall from its competitors while the standards drive up costs for consumers.\nAddressing the 54.5-MPG for the 2025 model year, Marchionne said: “There is not a single carmaker that cannot make the 54 number. The question is, at what price?”\nThe author of Energy Freedom, Marita Noon serves as the executive director for Energy Makes America Great Inc. and the companion educational organization, the Citizens’ Alliance for Responsible Energy (CARE). She hosts a weekly radio program: America’s Voice for Energy—which expands on the content of her weekly column. Follow her @EnergyRabbit.","url":"https://www.breitbart.com/politics/2015/10/25/teslas-success-a-great-example-of-how-regulations-manipulate-markets/"}
