{"authors":["Graham Rapier"],"date_download":"2018-10-31 00:10:16","date_modify":"2018-10-31 00:10:16","date_publish":"2018-07-12 00:00:00","description":"Also weighing on the stock Thursday was a report from Bloomberg which quoted employees saying they were forced to walk through raw sewage on the factory floor as Tesla ramped up Model 3 production.","filename":"data/vaneerConsumption/Teslastockpricefallasastaxcreditsendmeansmoreexpensivecars.json","image_url":"https://amp.businessinsider.com/images/5b478f1e50d5fd7c218b45d5-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_tesla-stock-price-tax-credit-end-means-more-expensive-cars-2018-7_1540944616.html","title":"Tesla stock price fallas as tax credit's end means more expensive cars","title_page":"    Tesla stock price fallas as tax credit's end means more expensive cars - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A Tesla worker in the company's factory in Fremont, California. Tesla\nShares of Tesla were down 1.7% in trading Thursday after it confirmed a lucrative tax credit will end next year, making its electric cars more expensive for potential customers. Additionally, a Bloomberg Businessweek profile outlined several possible safety hazards at Tesla's factory.\nCurrently, people who purchase Tesla cars are entitled to an electric-vehicle tax credit from the federal government of $2,500 to $7,500. As Tesla wrote in an annual report filed with the US Securities and Exchange Committee in February, its customers get the full $7,500. But two calendar quarters after a company sells its 200,000th electric vehicle in the US, the tax credit begins to phase out.\nFor the first six months of the phaseout, customers are eligible for 50% of the credit. That falls to 25% during the six months after that. After the full year, the company's customers are no longer eligible for that tax credit.\nThat means Tesla customers will be able to receive the full credit until January, when they will be eligible for half of the credit for six months. Starting next July, they can receive 25% of the credit. The credit will expire for Tesla customers in January 2020.\nTesla is the first automaker to begin the credit phaseout, which will impact some customers of its Model 3 sedan. The Model 3, which starts at $35,000, was designed to broaden Tesla's customer base beyond the luxury segment and accelerate the pace of electric-vehicle adoption.\nAlso on Thursday, Bloomberg Businessweek published a profile of Tesla's race to build enough Model 3 sedans to meet its self-imposed goals.\nTesla employees told the magazine they were forced to walk through raw sewage that had spilled on the factory floor over fear of causing production delays. \"Just walk through it,\" paint shop employee Dennis Duran said he was told by managers. \"We have to keep the line going.\"\nAnother production associate, Mikey Catura, said some employees have developed a \"zombie-like\" stare after drinking large amounts of Red Bull, provided for free by Tesla, in order to make it through the 12- to 16-hour shifts.\n\"Nothing is more important to us than the safety of our employees,\" a Tesla spokesperson told Business Insider.\nThe company said it hit its goal, producing 5,031 Model 3s during the final week of June, prompting Musk to tell employees, \"I think we just became a real car company.\"\nYou can read the full Bloomberg story here.\nMark Matousek contributed to this report.","url":"https://www.businessinsider.com/tesla-stock-price-tax-credit-end-means-more-expensive-cars-2018-7"}
