{"authors":["Emma Madden"],"date_download":"2018-10-31 01:43:04","date_modify":"2018-10-31 01:43:04","date_publish":"2018-08-27 22:06:17","description":"Strictly Come Dancing is not only an opportunity to see celebrities dance questionably each Saturday night, it's also a chance to see them don some of the most outrageous outfits on TV. There are frills, sparkles, and more glitter than you can shake…","filename":"data/vaneerConsumption/TessDalyClaudiaWinklemansStrictlyComeDancingLaunchFashionWasEverything.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/6b320843-1c6c-4dbf-ba60-59d42f73f499-getty-1024608926.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_tess-daly-claudia-winklemans-strictly-come-dancing-launch-fashion-was-everything-10255779_1540950184.html","title":"Tess Daly & Claudia Winkleman's 'Strictly Come Dancing' Launch Fashion Was Everything","title_page":"Tess Daly & Claudia Winkleman's 'Strictly Come Dancing' Launch Fashion Was Everything","title_rss":"NULL","source_domain":"bustle.com","text":"Strictly Come Dancing is not only an opportunity to see celebrities dance questionably each Saturday night, it's also a chance to see them don some of the most outrageous outfits on TV. There are frills, sparkles, and more glitter than you can shake a stick at. And you'll get to have your eyes delightfully assaulted again as Strictly returns to screens on Sept. 8. Although there was a taster of the flamboyance to come at last night's launch, presenters Tess Daly and Claudia Winkleman also came dressed to impress at the Strictly Come Dancing 2018 launch programme, and fans were totally here for it.\nThe launch sees the contestants and the show's professional dancers meeting alongside the judges at a glamorous red carpet ceremony prior to the competition. Before the show itself starts, on Aug. 31 you'll get to see which celeb gets paired up with which dancer. They'll then perform a group routine which they'll spend this week rehearsing. That way you'll get to pick out the stars from the, erm, more artistically challenged, before Strictly begins for another year.\nTim P. Whitby/Getty Images Entertainment/Getty Images\nDaly and Winkleman complemented one another like picture perfect prom dates at the launch of this year's Strictly Come Dancing. Held at BBC's Old Broadcasting House in London, the presenters seemed relatively pared down compared to the feathers and tutus donned by the contestants. That's not to say that they didn't look incredible though. Daly looked like a gorgeous silver statue as she wore a sequin satin dress with a black halter neck. Designed by Galvan, the dress' black side panels set off the sequins perfectly, and if you fancy getting your hands on the look, it's actually available at Net-a-Porter for a cool £950. Daly looked extra statuesque with her elegant Manolo Blahnik heels, with the presenter revealing on her Instagram that the whole look was pulled together by stylist James Yardley.\nWinkleman came looking a little more understated as she wore a delicate black blazer with simple yet stately black trousers. The deconstructed tuxedo look might even have been the biggest stand out of the night, as it added a touch of masculinity to a parade of delightfully feminine get ups. She paired the look with black heels and kept accessories minimal, opting only for classic gold hoop earrings.\nTogether the pair looked as though they could be couple goals, as they strutted down the runway together hand in hand. Daly sported a nude lip while Winkleman went for something a little bolder, but not enough to distract from her sharp outfit. Both presenters looked ecstatic to be there and to be starting a new series of Strictly together. It's set to start on a high, with iNews reporting that the September 8 launch will see performances from Nile Rodgers and Chic, Craig David, and Stefflon Don. But now there's been a glimpse of Winkleman in a dapper suit and Daly in an astonishing gown, I kind of just want to see those two waltzing on the ballroom floor together. Anyone with me?","url":"https://www.bustle.com/p/tess-daly-claudia-winklemans-strictly-come-dancing-launch-fashion-was-everything-10255779"}
