{"authors":["Kristin Tate"],"date_download":"2018-10-30 21:13:51","date_modify":"2018-10-30 21:13:51","date_publish":"2014-05-29 16:34:10","description":"Everything might be bigger in Texas, but that does not mean everything is more expensive. According to data from the Council for Community and Economic |","filename":"data/vaneerConsumption/TexasDominatesRankingofNationsMostAffordableCities.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/05/28/texas-flag-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_05_29__1540934031.html","title":"Texas Dominates Ranking of Nation's Most Affordable Cities","title_page":"Texas Dominates Ranking of Nation's Most Affordable Cities | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Everything might be bigger in Texas, but that does not mean everything is more expensive. According to data from the Council for Community and Economic Research’s (C2ER) 2014 Cost of Living Index, three of the nation’s 10 cheapest cities are in the Lone Star State.\nTexas is the only state that is home to more than one city in the top 10. Harlingen, which ranked number one, Wichita Falls, and Temple all made the cut. Other cities on the list, located around the nation, include: Pueblo, Colorado; Norman, Oklahoma; Memphis, Tennessee; Idaho Falls, Idaho; Youngstown, Ohio; Jonesboro, Arkansas; and Augusta, Georgia.\nAccording to Yahoo!News, two additional Texas cities–San Marcos, McAllen and San Antonio–did not make the top 10 list but came awfully close.\nThe C2ER analyzed 308 “urban areas” while compiling the rankings. “Items on which the Index is based have been carefully chosen to reflect the different categories of consumer expenditures,” the Cost of Living Index said.\nC2ER measured “relative price levels for consumer goods and services in participating areas.” It took into account the prices of various expenditures such as gas, housing, groceries, and healthcare.\nYahoo! compiled the data about Texas’ cities that made the top 10 list.\nTemple, Texas: Ranked 9th; cost of living is 12.9% below the U.S. average; the median household income is $51,192.\nWichita Falls, Texas: Ranked 8th; cost of living is 13.2% below the U.S. average; the median household income is $44,390.\nHarlingen, Texas: Ranked 1st; cost of living is 18.4% below the U.S. average; the median household income is $34,096.\nIt is easy to imagine why Texas cities ranked so highly on the affordability list. The state has consistently been one of the best places to start and expand businesses. Vance Ginn, an economist at the Texas Public Policy Foundation, told Breitbart Texas, “What we’ve seen is that the Texas model of low taxes, modest government spending, and stable regulations provides a business-friendly environment that gives incentives for businesses to move to the state.”\nLow regulation and less red tape allows companies to pass on savings to the consumer.\nTexas’ affordability has lead to people flocking to the state from around the nation, and indeed the world. Breitbart Texas reported earlier this month that the Lone Star State currently leads the nation in population growth.\nFollow Kristin Tate on Twitter @KristinBTate.","url":"https://www.breitbart.com/border/2014/05/29/Texas-Dominates-Ranking-of-Nations-Most-Affordable-Cities/"}
