{"authors":["Bob Price"],"date_download":"2018-10-30 18:18:40","date_modify":"2018-10-30 18:18:40","date_publish":"2016-09-21 17:03:34","description":"Texas Governor Greg Abbott said the State of Texas intends to withdraw from the federal refugee resettlement program.","filename":"data/vaneerConsumption/TexasThreatensWithdrawalfromRefugeeResettlementProgram.json","image_url":"https://media.breitbart.com/media/2016/09/GettyImages-599848564.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_09_21__1540923520.html","title":"Texas Threatens Withdrawal from Refugee Resettlement Program","title_page":"Texas Threatens Withdrawal from Refugee Resettlement Program","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas Governor Greg Abbott said the State of Texas intends to withdraw from the federal refugee resettlement program if additional security requirements are not met.\n“The federal government’s refugee settlement program is riddled with serious problems that pose a threat to our nation,” Governor Abbott said in a statement obtained by Breitbart Texas. “The Director of the Federal Bureau of Investigation and the Director of National Intelligence have repeatedly declared their inability to fully screen refugees from terrorist-based nations. Even with the inability to properly vet refugees from Syria and countries known to be supporters or propagators of terrorism, President Obama is now ineptly proposing a dramatic increase in the number of refugees to be resettled in the U.S.”\nThe Texas governor’s comments came following the announcement of a letter from the Texas Health and Human Services Commission, attached below, addressed to the director of the U.S. Office of Refugee Resettlement (ORR). The letter states:\nIn follow up to our request for approval of our application for an amended State Plan, I write to express the state of Texas’ intentions should you not unconditionally approve our application by September 30, 2016. The 2016 State Plan will no longer be current and continue in effect after September 30, 2016. That date is quickly approaching, and the Office of Refugee Resettlement has not yet approved our application for an amended State Plan. If you do not approve our State Plan as amended by September 30, 2016, we will interpret your silence as a rejection of the application. If our application is rejected -whether explicitly or by silence – the Health and Human Services Commission will be unable to certify that its State Plan is current and in effect, and will exit the Refugee Resettlement Program. We will notify contractors and impacted stakeholders that services and benefits will be provided for 120 days beyond October 1, 2016, or until January’ 31, 2017.\nGovernor Abbott stated the federal refugee resettlement plan is riddled with serious problems that create threats to this country. Breitbart Texas previously reported on testimony before Congress from some of the President’s top security advisors. The officials stated they believe that terrorists would attempt to infiltrate the refugee resettlement program.\n“We have certainly seen terrorist groups talk about, think about, exactly what you are describing, Mr. Smith,” Director of the National Counterterrorism Center Nicholas J. Rasmussen told Rep. Lamar Smith. “Trying to use available programs to get people not only into the United States, but into western European countries as well. So we know that they aspire to do that.” This testimony was made prior to the terrorist attacks in Paris where at least one Syrian refugee was involved, according to an article by Breitbart London.\nGovernor Abbott discussed the need for compassion and security.\n“Empathy must be balanced with security,” he said. “Texas has done more than its fair share in aiding refugees, accepting more refugees than any other state between October 2015 and March 2016. While many refugees pose no danger, some pose grave danger, like the Iraqi refugee with ties to ISIS who was arrested earlier this year after he plotted to set off bombs at two malls in Houston.”\n“Despite multiple requests by the State of Texas, the federal government lacks the capability or the will to distinguish the dangerous from the harmless, and Texas will not be an accomplice to such dereliction of duty to the American people,” the Texas governor concluded. “Therefore, Texas will withdraw from the refugee resettlement program. I strongly urge the federal government to completely overhaul a broken and flawed refugee program that increasingly risks American lives.”\nTexas is leading the United States in refugee resettlement, Breitbart Texas reported earlier this year. Nearly 3,000 refugees have been settled in Texas during this fiscal year.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.\nOffice of Refugee Resettlement Letter – Robert Carey","url":"https://www.breitbart.com/border/2016/09/21/texas-threatens-withdrawal-refugee-resettlement-program/"}
