{"authors":[],"date_download":"2018-10-22 21:14:00","date_modify":"2018-10-22 21:14:00","date_publish":"2014-05-06 15:26:55","description":"Robert James Campbell is scheduled to be put to death May 13.","filename":"data/vaneerConsumption/TexasInmateAsksforExecutionDelayCitingOklahomaDebacle.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/297241/140402-huntsville-prison-1440_f488c520984c4a02323d4462db7d57a6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_texas-inmate-asks-execution-delay-citing-oklahoma-debacle-n98221_1540242840.html","title":"Texas Inmate Asks for Execution Delay, Citing Oklahoma Debacle","title_page":"Texas Inmate Asks for Execution Delay, Citing Oklahoma Debacle","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Texas death-row asked a court Tuesday to stop his execution scheduled for next week, citing the bungled lethal injection of a prisoner in Oklahoma.\nTexas plans to use pentobarbital to kill convicted murderer Robert James Campbell — not the three-drug cocktail that Oklahoma used on Clayton Lockett on April 29.\nBut Campbell's lawyers said in court papers that the two cases are \"not apples and oranges\" because both states shroud their execution protocols in secrecy.\n“The botched execution in Oklahoma has made clear that the significant risk of a tortuous death is a very real threat when states aren't required to facilitate executions with transparency, accountability and disclosure of the sort sought — and denied — in Oklahoma,\" appeals lawyer Maurie Levin said.\nTexas officials have said that they don't expect the debacle in Oklahoma — in which Lockett appeared to regain consciousness and writhe in pain — would have any impact on their on execution system.\nOklahoma officials have blamed a vein failure — not the drugs — in Lockett's execution, which dragged on for 40 minutes before it was halted. He died minutes later.\nBut the complications have ignited new debate over how the death penalty is carried out and policies and laws that allow states to keep the source of the chemicals they use under wraps.\nCampbell, 41, was sentenced to die for the 1991 rape and murder of a young bank teller who was abducted from a gas station and shot to death.\nOn Monday, a different team of lawyers filed papers asking for his execution to be canceled on the grounds he has an intellectual disability and he had an incompetent appeals lawyer.\n— Tracy Connor","url":"https://www.nbcnews.com/storyline/lethal-injection/texas-inmate-asks-execution-delay-citing-oklahoma-debacle-n98221"}
