{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:19:50","date_modify":"2018-10-30 20:19:50","date_publish":"2016-09-27 14:00:39","description":"The Texas Attorney General filed a petition to the U.S. Supreme Court asking to fully reinstate the Lone Star State’s voter ID law.","filename":"data/vaneerConsumption/TexasAppealsVoterIDRulingtoSupremeCourt.json","image_url":"https://media.breitbart.com/media/2016/08/wi/ap_ap-photo-1204-e1474984381762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_09_27__1540930790.html","title":"Texas Appeals Voter ID Ruling to Supreme Court","title_page":"Texas Appeals Voter ID Ruling to Supreme Court","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas Attorney General Ken Paxton has filed a petition for a writ of certiorari in the U.S. Supreme Court asking the nation’s highest court to fully reinstate the Lone Star State’s voter ID law. The petition will not affect the November 2016 Election.\nSB 14 was signed into law in 2011 by then-Governor Rick Perry. The Texas Association of Hispanic County Judges and County Commissioners, Texas State Conference of NAACP Branches, Mexican American Legislative Caucus of the Texas House of Representatives, League of United Latin American Citizens, The United States of America, La Union Del Pueblo Entero, Inc., Texas League of Young Voters Education Fund, and others sued claiming the law was unconstitutionally discriminatory.\nThe two questions presented in the petition for writ of certiorari to the U.S. Supreme Court (attached below) are:\nWhether Texas’ voter-ID law ‘results in’ the abridgement of voting rights on account of race. Whether judgment should be rendered for petitioners on the claim that Texas’ voter-ID law was enacted with a racially discriminatory purpose.\nThe AG argues that the court of appeals affirmed the district court finding that “Plaintiffs have not demonstrated that any particular voter . . . cannot get the necessary ID or vote by absentee ballot under [Texas’ voter-ID law].” He also argues that there is no evidence that the law affected political participation by minority voters. This would be “fatal” to a “vote-denial” or “vote-abridgement” claim under section 2 of the Voting Rights Act, he reasons.\nThe U.S. Supreme Court should hear the case the State argues because the U.S. Court of Appeals for the Fifth Circuit (and later the Fourth Circuit) “created a split by holding that a voter-ID law violates §2 based solely on a statistical racial disparity in preexisting ID possession, the general correlation of race and socioeconomic status, and a nine-factor analysis developed for vote-dilution claims.”\nThe Fifth Circuit also went against multiple precedents of the U.S. Supreme Court by remanding plaintiffs’ discriminatory-purpose claim to the district court after vacating the district court’s finding. Even after the district court “eviscerated legislative privilege and granted unprecedented discovery, legislators produced thousands of documents, including internal confidential communications, and sat for lengthy depositions. But that discovery yielded no evidence of discriminatory purpose,” the State writes.\nAn interim remedial Order has been issued which applies to the November 8, 2016, election. The Order was intended to provide a temporary solution for State officials as it relates to the specified forms of ID allowed for voting.\nAn Obama appointee, Judge Nelva Gonzalez Ramos in Corpus Christi, Texas, issued the interim remedial Order on August 10th mandating that “Voters who appear on the official list of registered voters and present a valid voter registration certificate, a certified birth certificate, a current utility bill, a bank statement, a government check, a paycheck, or any other government document that displays the voter’s name and address and complete and sign a reasonable impediment declaration shall be permitted to vote using a regular ballot.” In addition to spending at least $2.5 million for informing voters of changes, the Court ordered that the State “shall continue to educate voters in subsequent elections concerning both voter identification requirements and the opportunity for voters who do not possess SB 14 ID and cannot reasonably obtain it to cast a regular ballot.”\nIn October 2014, Judge Ramos held that the Texas voter photo ID law, SB 14, violated the Voting Rights Act of 1965 because it had an impermissible discriminatory effect, including deliberate discrimination against blacks and Hispanics, violated the Equal Protection Clause, and unconstitutionally offended voting rights guaranteed under the Fifteenth Amendment, as reported by Breitbart Texas. The Obama appointee also ruled that the Texas law was an unconstitutional poll tax prohibited by the Twenty-Fourth Amendment because the law provided for a fee for issuing copies of birth certificates or other information needed for a voter ID.\nIn July, the U.S. Court of Appeals for the Fifth Circuit found that Texas’ voter photo ID law had a discriminatory effect under the Voting Rights Act, but reversed the district court’s finding of discriminatory purpose, as reported by Breitbart Texas. The 9-6 ruling also found that it did not constitute a poll tax but ruled that the lower court must put an “interim remedy” in place to mitigate the “discriminatory effects.” The Fifth Circuit also warned that the district judge should “ensure that any remedy acted ameliorates SB 14’s discriminatory effect, while respecting the Legislature’s stated objective to safeguard the integrity of elections by requiring more secure forms of voter identification.” The appellate court also remanded the case to the district court to later determine if the voter ID provisions were written to be intentionally discriminatory.\nJudge Edith Jones wrote the dissent to the Fifth Circuit en banc opinion which was joined by four judges. As reported by Breitbart News, Jones wrote, “Requiring a voter to verify her identity with a photo ID at the polling place is a reasonable requirement widely supported by Texans of all races and members of the public belonging to both political parties.”\nThe President Ronald Reagan nominated judge also wrote, “By keeping this latter claim alive, the majority flans the flames of perniciously irresponsible racial name-calling.” She also wrote that the Fifth Circuit’s “judge-made ‘solutions’” “will backfire.” The public will “question judges’ impartiality,” and “[l]awmakers at every level will be forced to be race-conscious, not race-neutral, in protecting the sanctity of the ballot and the integrity of the political process,” she explained.\nJones added that “these unauthorized and extra-legislative transfers of power to the judiciary disable the working of the democratic process, which for all its imperfections, best represents ‘we the people.’”\nIn a statement obtained by Breitbart Texas after Texas Attorney General Ken Paxton filed the petition for writ of certiorari, Paxton said, “Safeguarding the integrity of our elections is essential to preserving our democracy. Voter ID laws both prevent fraud and increase the public’s confidence in our elections. Texas enacted a common-sense voter ID law and I am confident that the U.S. Supreme Court will ultimately reinstate it.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nTexas AG Petition for Writ of Certiorari Voter ID Case","url":"https://www.breitbart.com/border/2016/09/27/texas-appeals-voter-id-ruling-supreme-court/"}
