{"authors":[],"date_download":"2018-10-22 21:04:09","date_modify":"2018-10-22 21:04:09","date_publish":"2014-06-04 01:15:05","description":"Authorities haven't released a motive as to why Ryan Walton, 20, allegedly murdered his father and mother in their $1.4 million Katy, Texas, home.","filename":"data/vaneerConsumption/TexasManChargedWithKillingParents.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/485746/140603-ryan-walton-jms-2005_6e23aa9cf009b011876a79eca8c108c7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_texas-man-charged-killing-parents-n121916_1540242249.html","title":"Texas Man Charged With Killing Parents","title_page":"Texas Man Charged With Killing Parents","title_rss":"NULL","source_domain":"nbcnews.com","text":"“He admitted to killing his parents,” said Fort Bend County Sheriff’s Office Public Information Officer Bob Haenel, but added that a motive is still undetermined.\nWhat is known is that the bodies of Michael Walton, 54, and his wife Lynda Walton, 52, were found by one of their other sons at their $1.4 million home in the gated Lake Point Estates subdivision, about 30 miles west of Houston, at about 5:15 p.m. Thursday.\nThey were last seen alive at 7 a.m. that morning, and Ryan Walton was seen leaving the community in his mother’s BMW at about 9 a.m., Haenel said.\nOn Tuesday, authorities searched the car, which Ryan was driving when he was arrested, and recovered a .22-caliber rifle. The gun will need to be tested to determine if it was the murder weapon, Haenel said.\nAuthorities said there wasn’t a history of domestic disturbances at the Walton home, but that lately there has been some friction. Ryan Walton moved out of the home about three weeks ago after some sort of conflict with his parents, Haenel said.\nRyan Walton is charged with two counts of murder and is being held without bail.\n— Phil Helsel","url":"https://www.nbcnews.com/news/us-news/texas-man-charged-killing-parents-n121916"}
