{"authors":[],"date_download":"2018-10-22 22:06:34","date_modify":"2018-10-22 22:06:34","date_publish":"2014-06-07 22:35:35","description":"The Texas GOP will recognize the \"legitimacy and efficacy\" of counseling for \"patients seeking healing and wholeness from their homosexual lifestyle.\"","filename":"data/vaneerConsumption/TexasGOPEndorsesReparativeTherapyforGays.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/494706/140607-texas-gop-1828_9019177336bb6148603aa9e72bb01e82.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_texas-gop-endorses-reparative-therapy-gays-n125471_1540245994.html","title":"Texas GOP Endorses 'Reparative Therapy' for Gays","title_page":"Texas GOP Endorses 'Reparative Therapy' for Gays","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Texas Republican Party now endorses so-called \"reparative therapy\" for gays, under a new platform given final approval at its annual convention Saturday.\nThe new anti-gay language never came up for debate before roughly 7,000 delegates ratified a Texas GOP platform that tea party groups succeeded in pushing further to the right, including winning a harder line on immigration.\nOne influential tea party group called Texas Eagle Forum had urged the party to support psychological treatments that seek to turn gay people straight. It comes after Republican New Jersey Gov. Chris Christie last fall signed a law banning such therapies on minors, and California has a similar law.\nThe Fort Worth Convention Hall cheered when party leaders announced that Christie finished a distant 11th in a 2016 presidential straw poll.\n\"There's a very, very small group of people who want to keep the party in the past. We were here today to try to pull the party into the future,\" said Rudy Oeftering, vice president of the gay conservative group Metroplex Republicans. \"The only way the party can go into the future is to start listening to young people, to start listening to people who have gay family members.\"\nOeftering and allies had lined up to speak against the therapy language that had been added earlier this week. But they never got a chance to address delegates, because a parliamentary motion to approve the full platform was called first.\nUnder the new plank, the Texas GOP recognizes \"the legitimacy and efficacy of counseling, which offers reparative therapy and treatment for those patients seeking healing and wholeness from their homosexual lifestyle.\"\nGay conservatives did come away with a rare victory at the convention: Winning the removal of decades-old language in the state party platform that states, \"homosexuality tears at the fabric of society.\" Hardliners were fighting to not only preserve it, but wanted to replace \"homosexuality\" with \"sexual sins.\"\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/texas-gop-endorses-reparative-therapy-gays-n125471"}
