{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:17:06","date_modify":"2018-10-30 20:17:06","date_publish":"2015-02-20 16:30:37","description":"Democrat Texas State Representative Ana Hernandez (D-Houston), has filed a bill that would require a Texas Supreme Court committee to develop an educational guide that would assist judges in determining which children are eligible for “special immigrant juvenile status\" (“SIJS”). Federal law gives special protections to eligible unaccompanied immigrant children (“UACs”) who have entered the country illegally. |","filename":"data/vaneerConsumption/TexasDemFilesBilltoMandateEducationMaterialsforJudges.json","image_url":"https://media.breitbart.com/media/2015/02/Screen-Shot-2015-02-20-at-10.28.59-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_02_20__1540930626.html","title":"Texas Dem Files Bill to Mandate Education Materials for Judges","title_page":"'Special Immigrant Juvenile Status': Texas Dem Files Bill to Mandate Education Materials for Judges","title_rss":"NULL","source_domain":"breitbart.com","text":"Democrat Texas State Representative Ana Hernandez (D-Houston), has filed a bill that would require a Texas Supreme Court committee to develop an educational guide that would assist judges in determining which children are eligible for “special immigrant juvenile status” (“SIJS”). Federal law gives special protections to eligible unaccompanied immigrant children (“UACs”) who have entered the country illegally.\nThe Permanent Judicial Commission for Children, Youth and Families established by the Texas Supreme Court would be charged with preparing and distributing these materials to the judges. According to the Commission’s website, the organization is a “multidisciplinary executive-level group led by judges created by The Supreme Court of Texas in 2007 to develop and coordinate efforts to improve court performance in child abuse and neglect cases.” The Commission also administers the federal Court Improvement Program (“CIP”) grants that funds its projects and staff.\nThe bill mandates that the publication include: educational information about the federal law governing SIJS; what courts have jurisdiction of these cases; definitions of terms used in the law; and the findings that are necessary in order for a child to be granted special immigrant juvenile status. SIJS is covered in federal law; specifically, 8 U.S.C. section 1101.\nThe publication would be distributed electronically to each court in Texas having jurisdiction over juvenile cases. Hard copies would be dispensed at judicial conferences and meetings, and upon request. It is unknown whether hard copies would also be distributed to lawyers in private practice who request them. The Act would take effect September 1st, 2015.\nBreitbart Texas has previously reported about legal education seminars held by Democrat Harris County Attorney Vince Ryan, Catholic Charities, and other groups. The purpose of the legal education, attended by Breitbart Texas, was to instruct lawyers how to provide volunteer representation to unaccompanied minors.\nAt the seminar, Texas Supreme Court Chief Justice Nathan Hecht noted that the topic of unaccompanied minors crossing the borders was a politically divisive one. He cited U.S. Department of Homeland Security statistics that unaccompanied minors from Central America had crossed the border in record numbers during the past year. The Chief Justice also noted that a Gallop Poll found that the single most important concern for Americans was illegal immigration. The jurist said these concerns were for Texans, “on our doorstep.”\nThe seminar was held in mid-August 2014 during the height of national media attention on the issue. In early June 2014, Breitbart Texas’ Managing Director Brandon Darby leaked internal federal government photos that showed the deplorable conditions in which unaccompanied minors were being warehoused in U.S. Border Patrol processing centers.\nSpecial immigration juvenile status comes into play when unaccompanied minors detained by Border Patrol Agents are transferred to the ORR (Office of Refugee Resettlement). The ORR places these children with parents, relatives, or friends who file an application with the ORR, a federally operated facility, or a facility that is licensed by the state. These children can then become the subject of Texas courts where there is a child protective services (“CPS”) investigation because an ORR sponsor has alleged abuse or neglect. CPS may file a Suit Affecting the Parent-Child Relationship (“SAPCR”) in the family courts when these claims are confirmed. The child can then be placed in foster care.\nState juvenile courts can also be petitioned by sponsors and facilities under federal contract. Legal findings can then be made that: (1) the unaccompanied minor has been abandoned, neglected or abused by their parents, and (2) reunification with the parents and return to their, or their parent’s country of origin, is not in their best interest. These findings are essential for obtaining permanent residency and are called “Special Immigrant Juvenile Status” or “SIJS” findings.\nIf a juvenile court judge makes these SIJS findings, this does not automatically subject these children to the same supervision as children in CPS cases. The federal government must approve of the SIJS findings made by the state juvenile court, and there must be a finding that these orders were not issued for the purpose of obtaining special immigration benefits (but because there was abandonment, neglect, or abuse). Federal immigration courts make the final decisions with regard to SIJS status.\nBreitbart Texas reported that the Texas Office of Court Administration was gathering statistics on how many cases involving unaccompanied minors have been filed. David Slayton, Director of the Courts of the Office of Court Administration released a chart in 2014, along with other information and statistics that detailed both the number of UACs and the number of applications for SIJS filed during the prior four fiscal years. Breitbart Texas will continue to follow the issue and will provide an update of statistics obtained from the Texas Office of Court Administration.\nThe House Judiciary and Civil Jurisprudence Committee is expected to hold a public hearing on the bill. The proposed legislation, House Bill 1439, can be tracked at Texas Legislature Online. The author of the Bill, Rep. Ana Hernandez, is a member of the Committee.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2015/02/20/special-immigrant-juvenile-status-texas-democrat-files-bill-to-mandate-education-materials-for-judges/"}
