{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:43:16","date_modify":"2018-10-30 19:43:16","date_publish":"2015-08-09 14:53:03","description":"An officer in Waller County has shot and killed a man. The county has been in the spotlight since Sandra Bland's death in the county jail.","filename":"data/vaneerConsumption/TexasPoliceOfficerReturnedFireKillingManFightingwithHisBrother.json","image_url":"https://media.breitbart.com/media/2015/08/Brookshire-police-shooting.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_08_09__1540928596.html","title":"Texas Police Officer Returned Fire, Killing Man Fighting with His Brother","title_page":"Texas Police Officer Returned Fire, Killing Man Fighting with His Brother","title_rss":"NULL","source_domain":"breitbart.com","text":"After being fired on by a suspect, a Waller County police officer returned fire and killed one of two brothers involved in a fight Saturday afternoon. The officer, a member of the SWAT team, told officers he did not want to fire on the man but felt he had to. Waller County has been in the spotlight since the death of Sandra Bland in the Waller County jail after her arrest on July 10, 2015.\nThe incident happened in Brookshire, Texas, in Waller County. In the shadow of Bland’s arrest and suicide, Brookshire Police Chief Brandal Jackson told reporters at the scene, “I can tell you one of the things the officer told me was that he was hesitant to fire back at the suspect and this is something we don’t want our officers to start doing.”\nAs reported by KHOU’s Josh Chapin in Houston, the officers responded to a call around 4 p.m. on Saturday. One of the suspects was firing at the officer’s car. It was reported that the police officer returned fire through his patrol car window in order to protect himself.\nChief Jackson told KHOU, “Our officer didn’t have a chance to retreat, so he fired several shots through the windshield of his vehicle at the suspect.”\nThe police chief said the officer had to respond with more force when someone else was shooting in his direction. “At that time, the officer exited his vehicle, went around it and grabbed his AR-15 and fired several more shots and the suspect was pronounced dead at the scene.”\nThe dead man, Roderick Burr, was fighting with his brother and reportedly had a long criminal record.\nA neighbor who heard the gunfire told KHOU, “They fight a lot. They always argue, but usually it doesn’t escalate to gun play because they are brothers,” said Mary Rae. “I heard like 10 gunshots and then my girlfriend had looked out the window and seen the cops outside armed with their guns.”\nThe Texas Rangers will be investigating the incident according to the police department.\nAlthough the neighbor was not an eyewitness to the incident, she told the media, “I feel like there’s a different way it could’ve went down than him having to die.”\nBreitbart Texas writers were at the other end of Waller County Saturday afternoon and evening for protests and fundraisers being carried out on behalf of Sandra Bland. After being arrested for allegedly assaulting a police officer in the town of Prairie View, Bland killed herself by hanging herself with a plastic trashbag in the county’s jail.\nAs reported by Breitbart Texas, a YouTube video message purportedly by the group Anonymous had issued a warning for Waller County police, and in particular, the Waller County Sheriff’s Department. The group planned protests in 35 cities throughout the U.S. on Saturday, August 8th. Breitbart Texas was on the scene of the protest scheduled to be held at the Waller County jail on Saturday evening. In a threatening demand, the group had told the Waller Sheriff’s Office, “We all know where you live. No mercy for murders.” The number of people who showed up for this protest was about equal to the number of journalists, bloggers and photographers who showed up to cover it.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served in Texas as a prosecutor and associate judge. Follow her on Twitter@LanaShadwick2","url":"https://www.breitbart.com/border/2015/08/09/texas-police-officer-returned-fire-killing-man-fighting-with-his-brother/"}
