{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:22:40","date_modify":"2018-10-30 21:22:40","date_publish":"2015-05-01 13:13:03","description":"Truancy convictions leave poor families facing heavy fines and jail time, and burden children with criminal records.","filename":"data/vaneerConsumption/TexasTruancyLawReformReceivesWidespreadSupport.json","image_url":"https://media.breitbart.com/media/2015/02/DSC_0477-1024x678.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_05_01__1540934560.html","title":"Texas Truancy Law Reform Receives Widespread Support","title_page":"Texas Truancy Law Reform Receives Widespread Support","title_rss":"NULL","source_domain":"breitbart.com","text":"Recently, the Texas Senate overwhelmingly passed SB 106, one of a handful of bills introduced into the 84th Legislature to reform antiquated state truancy laws. At present, Texas prosecutes K-12 children and their parents for the Failure to Attend School (FTAS), at more than double the rate of all 49 other states combined. Unlawful absenteeism affects youngsters from all walks of life, often leaving a criminal paper trail that jeopardizes their futures.\nBreitbart Texas has been following the truancy debate as part of the school-to-prison pipeline. SB 106 has since moved over to the Texas House, where it was read and sent to the Juvenile Justice and Family Issues Committee. A few new developments have transpired on the ground while the committee considers the bill.\nThe Houston-area Fort Bend Independent School District (FBISD) announced it was discontinuing its truancy policies on Monday, April 27. Superintendent Charles Dupre sent home a letter to approximately 70,000 student homes explaining the decision.\nDupre’s letter read, in part: “Over the years, we developed a truancy prevention program that is designed to serve our students and abide by the state attendance laws. With the recent expressed concerns about the way FBISD handles truancy matters, we believe it will be in the best interest of our students and the community for us to re-examine aspects of the system that might need to be improved.”\nThis magnanimous decision might have been prompted by the high-profile attention FBISD received for having some of the harshest truancy polices in the state. Fort Bend is one of two Texas counties with dedicated truancy courts, according to the Fort Bend Sun.\nDallas County is the other. Breitbart Texas reported that the US Department of Justice recently launched a probe into the practices of the Dallas County Truancy Court and Juvenile District Courts, based on concerns that constitutionally-required due process may not have been provided to all children when charged with FTAS, a Class C Misdemeanor criminal offense.\nHowever, KHOU 11 has since reported that 600 FBISD kids are still expected to appear in truancy court. The district plans community meetings to discuss the topic in May.\nStatewide, 210,000 Texas students and their parents were criminally charged with FTAS in 2013. KHOU 11 stated 50,000 of those cases came from Houston.\nAs the Justice Department investigates the Dallas court system, a few other related issues have been uncovered. DOJ found that mere tardiness can land first-grade children, and their parents, in court for truancy, as Courthouse News Service reported.\nFTAS cases are often tried in adult court. Defendants are not required to have attorneys, which leaves them ill-equipped to protect themselves against harsh sentences handed down by Justices of the Peace (JP) – elected officials whose job description does not require law school or a law degree.\nCollin County JP John Payton was the youngest judge ever elected, and he has only a two-year associate’s diploma from the local community college, according to the Dallas Morning News.\nLast year, Payton jailed 66 out of 90 minors in the affluent suburban county north of Dallas. These were mainly three-night-stays in adult jail, BuzzFeed reported.\nOn top of his detailed court orders, Payton doles out a laundry list of demands to his probational wards, including setting further court hearings, keeping detailed attendance logs, performing hours of community service, and same-day drug testing. In some cases, students are required to hand over passwords to all of their social media accounts. Payton insists he is trying to scare them back into the classroom, but some find his methods excessive.\nIn 2014, a federal judge found the truancy court of Hidalgo County JP Mary Alice Palacios violated two students’ constitutional rights, when she sentenced them to jail for accrued fines from truancy and other minor offenses, the Christian Science Monitor reported. The federal judge ruled the due process and equal protection rights of the teenagers were infringed because Palacios neglected to offer them a court-appointed attorney before imposing the jail sentences.\nIn 2013, Texas Appleseed cited over 115,000 truancy cases sent to adult criminal courts. Only about 1,000 truancy cases were handled in Texas juvenile courts that year. Fewer than 50,000 truancy cases were filed in the juvenile courts of all other states combined.\nIn March, the Houston Chronicle reported 50 percent of high school students slapped with truancy charges last year in FBISD were black, and 30 percent were Hispanic, even though they comprised only 32 and 23 percent of the high school student body, respectively.\nOne of the students included in Fort Bend’s total, 17-year-old Serena Vela, owed $2,700 in truancy-related fines, but couldn’t afford to pay them in 2013. The Hightower High School sophomore lived in a trailer with an unemployed mother who suffered from dementia. She made poor choices by not going to school, no doubt, but did those choices warrant nine days in adult lockup, debtor’s prison-style, to pay off $300-per-day fines?\nHer stern punishment did not correct her truancy problem, either. Vela accumulated more unexcused absences while sitting in jail. The district filed more charges. Lacking a car, or money for transportation, Vela was a no-show at her hearing. An arrest warrant was issued with one charge of missing school, plus another for missing court. Vela paid her new fines of $680 with two more nights in jail.\nWhen she returned to school, administrators kicked Vela out, according to the BuzzFeed report, where she was profiled to put a face on the 1,000-plus wayward Texas teenagers jailed over the past three years for FTAS.\nVela’s case happened on Superintendent Dupre’s watch. Vela recalled the school mailed her warning letters about her absences, and one truancy prevention class was ordered, but no school official ever made a personal effort to keep her in school.\nThese harsh punishments are intended to teach kids a lesson about cutting class, but filing charges may permanently damage the rest of their lives. Is that the right lesson to teach juvenile delinquents?\nProponents of the 1995 state truancy law say yes – it was intended to improve high school graduation rates by keeping offenders on the straight and narrow with punitive actions. They also argue that “tough love” laws hold parents to account… but do they?\nIn 2011, a North Texas family from the upscale Dallas suburb of Frisco were the unlucky recipients of truancy charges. The Pates had cleared two of 10 planned holiday vacation absences with their local school district for a Christmas break trip. They returned home to find themselves facing Class C Misdemeanor charges for the entire family – three youngsters plus mom and dad. They learned that neither “cleared” nor “approved” absences were necessarily excused.\n“We’re criminals because we took a vacation to see family,” said Leila Pate, who wanted her second-grader and kindergartner to visit ailing relatives in the farthest stretches of southern Italy, the Dallas Morning News reported.\nThe Pates opted to fight their charges in a jury trial, and lost. Subsequently, they were fined $267 per child, under a conviction that read “parent contributing to non-attendance.” The Pates pulled their children out of the district. Truancy currently carries a $500 fine.\nNational Public Radio (NPR) profiled five-year-old Travis County girl Fatima Yassin. The chronically sick kindergartener and her father went before a JP and were prosecuted for 23 unexcused absences. Fatima’s father did not realize he had done anything wrong by sending an absentee note to school signed by himself, rather than a doctor.\nTruancy charges create a criminal record that is visible to the public, if not sealed and expunged, which involves hiring an attorney to fill out court paperwork at substantial expense, as Breitbart Texas has reported. If truancy charges are not expunged, they can damage a young person’s prospects when filling out college and career applications.\nNot everyone wants to end the prosecution of minors for truancy. The Texas Association of School Administrators (TASA), the lobbyist group to which school administrators belong, support existing truancy laws. In the NPR broadcast that told five-year-old Fatima’s FTAS story, TASA’s top attorney defended the current public school truancy policies.\nJustices of the Peace, who hear the truancy cases, also want current laws to stay in place. Breitbart Texas reported that Montgomery County JP Wayne Mack flatly stated, “I don’t know one school district that is in favor of this bill.”\nDuring the recent Senate debate on SB 106, North Texas school district officials from Collin and Denton counties fiercely opposed decriminalizing truancy.\nOn March 13, Justice of the Peace Payton posted on his Facebook page, “We are AGAINST the bills and believe that the current system works and may need some things added.” He also listed the various reform proposals moving through the 84th Legislature.\nTruancy is a cash cow. The state banked just over $2 million in FY 2009, and nearly $1.8 million in FY 2011. Dallas raked in $3 million in 2013.\nIn Class, Not Court: Reconsidering Texas’ Criminalization of Truancy, state Supreme Court Chief Justice Nathan Hecht asked, “Playing hooky is bad, but is it criminal?”\n“There are reports for years that show early criminal convictions can lead to further criminal activity, and you just really worry you’re going to ruin a kid’s whole life,” Hecht told KVUE News.\nBack in Fort Bend County, Judge Kenneth Cannata, Prec. 3, told KHOU 11 that only 10 percent of the 700 cases he hears a year involved children skipping school for “no good reason” – there were usually other family issues involved. Cannata didn’t believe minors should be saddled with criminal records.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/05/01/texas-truancy-law-reform-receives-widespread-support/"}
