{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 00:51:18","date_modify":"2018-10-23 00:51:18","date_publish":"2016-01-29 14:17:38","description":"Fire crews were called to Marshall Middle School in Houston, Texas, at 10.30 yesterday morning after one student fainted while dozens of others reported feeling nauseous or suffered from headaches.","filename":"data/vaneerConsumption/Texasmiddleschoolstudentstreatedforcarbonmonoxidepoisoningaftergasleak.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30AD3A1100000578-0-image-a-14_1454076613105.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422798_Almost-200-students-staff-Texas-middle-school-treated-carbon-monoxide-poisoning-boiler-pumps-deadly-gas-classrooms_1540255878.html","title":"Texas middle school students treated for carbon monoxide poisoning after gas leak","title_page":"Texas middle school students treated for carbon monoxide poisoning after gas leak | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nearly 200 students and staff at a Texas middle school have been treated by medics after a broken boiler leaked deadly carbon monoxide into classrooms.\nAt least 145 people had to be taken to hospital from Marshall Middle School in Houston, Texas, yesterday morning while dozens more were treated at the scene.\nFire crews were called to the school at around 10.30am after one student lost consciousness, while others reported feeling nauseous and suffering from headaches.\nAlmost 220 students and staff at Marshall Middle School in Houston, Texas, had to be treated for carbon monoxide poisoning yesterday morning\nMedics and fire crews were called to the school after one pupil lost consciousness while dozens of others reported feeling nauseous or suffered from headaches\nWhen rescue workers arrived they tested the building and found high concentrations of carbon monoxide, a gas which is typically produced by burning fossil fuels.\nThe gas is odorless, colorless and tasteless and as such is almost impossible to detect without special instruments.\nA Beaumont Police Department spokesman told station KHOU: 'Students and faculty were evacuated to safe areas to be evaluated.\n'Numerous students and faculty members reported exposure symptoms such as nausea and headaches.\n'All students and faculty members that are exhibiting these symptoms were being transported as units are available.'\nNone of the students or staff suffered life-threatening injuries, the fire department confirmed.\nMarshall Middle School houses around 4,000 students in total.\nThose who were not taken to hospital were transported by bus to a nearby school for the rest of the day.\nAt least 145 people were taken to hospital for treatment, while others were treated at the scene. Those not affected were taken to a school nearby\nInvestigators traced the cause of the poisoning to a broken boiler in the school building which pumped the potentially-lethal gas into classrooms\nTHE SILENT KILLER: CARBON MONOXIDE POISONING Carbon monoxide is relatively harmless at low concentrations, but at high concentrations it can be fatal. Short-term exposure to the gas typically causes flu-like symptoms such as extreme fatigue, nausea, headaches and cramps. This is because carbon monoxide bonds to hemoglobin in red blood cells, the protein responsible for carrying oxygen around the body, slowly starving organs of the vital resource. At very high concentrations oxygen levels can drop so low it causes people to become disoriented and lose consciousness - and may even cause the body to completely shut down.\nClasses have been cancelled at Marshall today, with a notice on the school's website warning staff and students to remain at home.\nSchool authorities also raised the prospect of classes being cancelled on Monday as well, though said parents will be informed at a later date.\nFire chief Earl White said the school does not have carbon monoxide detectors installed, but added that the law does not require them.\nCarbon monoxide is relatively harmless at low concentrations, but at high concentrations it can be fatal.\nShort-term exposure to the gas typically causes flu-like symptoms such as extreme fatigue, nausea, headaches and cramps.\nThis is because carbon monoxide bonds to hemoglobin in red blood cells, the protein responsible for carrying oxygen around the body, slowly starving organs of the vital resource.\nMarshall Middle School remains closed today while officials deal with the source of the outbreak, while classes may also be disrupted on Monday\nCarbon monoxide is an odorless, tasteless and colorless gas produced by burning fossil fuels that is almost impossible to detect without special sensors\nAt very high concentrations oxygen levels can drop so low it causes people to become disoriented and lose consciousness - and may even cause the body to completely shut down.\nThe gas is thought to be behind at least four deaths during the recent snow storm on the east coast when people climbed into cars with tail pipes blocked by snow.\nMother Sasha Bonilla, 23, her daughter Saniyah, three, and brother Messiah, one, all died in New Jersey after getting in the car escape the cold while father Felix attempted to dig the vehicle out.\nCarbon monoxide poisoning is also believed to be behind the death of Angel Ginel, 44, in Brooklyn, who was found dead inside his car on Tuesday with the engine still running.","url":"https://www.dailymail.co.uk/news/article-3422798/Almost-200-students-staff-Texas-middle-school-treated-carbon-monoxide-poisoning-boiler-pumps-deadly-gas-classrooms.html"}
