{"authors":["Abc News","More Brendan"],"date_download":"2018-10-30 00:57:51","date_modify":"2018-10-30 00:57:51","date_publish":"2018-10-29 09:57:16","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/Texaspolicesearchformissing2yearoldgirlwhovanishedfromapark.json","image_url":"https://s.abcnews.com/images/US/Missing-GirL-AP-ER-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_texas-police-search-missing-year-girl-vanished-park_story_id=58826044_1540861071.html","title":"Texas police search for missing 2-year-old girl who vanished from a park","title_page":"Texas police search for missing 2-year-old girl who vanished from a park - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Police in Texas are searching for a 2-year-old girl who went missing in a park Sunday morning, and have arrested the girl’s mother in connection with the disappearance.\nThe College Station Police Department said Tiaundra Christon has been arrested and charged with making a false report and abandoning/endangering a child in connection with the search for her daughter, Hazana Anderson. Christon is being held in the Brazos County jail.\nPolice said Christon told them she took Hazana to Gabbard Park on Oct. 28, and went back to her car to get a bottle for the child shortly after arriving at the park. When she came back, she said she found that Hazana was not in her stroller.\nPolice said Christon “was not providing truthful information” when interviewed, and that she was charged with abandoning/endangering a child because she left Hazana close to a body of water, which police said was an environment that “posed a potential risk to the safety of the child.”\nLieutenant Craig Anderson with the College Station Police Department told ABC News that officers have completed a search of the park and surrounding neighborhoods, and were following up on leads in the case.\nBrazos County Jail\nOther law enforcement departments have assisted with the search, and the Harris County Sheriff’s Office contributed a boat and dive team to help search the lake in the park, according to Anderson. He added that volunteers with the Brazos Valley Child Abduction Response Team and the Search Dog Network of the Brazos Valley helped in the search as well.\nHazana’s extended family had also been searching for the girl and handing out flyers, according to ABC affiliate KTRK.\nPolice said Hazana is about 3 feet tall and weighs 28 pounds, with black hair, brown eyes and a dark-colored birthmark around the big toe on her left foot. She was last seen wearing an olive green jacket, a black “girl squad” shirt, cream-colored pants, pink socks, dark pink shoes, and a purple beanie.\nPolice have requested that anyone with information on Hazana call 979-764-3600.","url":"https://abcnews.go.com/US/texas-police-search-missing-year-girl-vanished-park/story?id=58826044"}
