{"authors":["Kelly Mclaughlin","Valerie Edwards For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 20:26:39","date_modify":"2018-10-22 20:26:39","date_publish":"2016-01-28 01:17:21","description":"James Freeman, 35, was pronounced dead at 6.30pm, 16 minutes after Texas prison officials began a lethal dose of pentobarbital. When asked if he had a final statement. 'No, I do not,' he replied.","filename":"data/vaneerConsumption/TexasinmateJamesFreemanexecuted8yearsaftershootingdeadJustinHurst.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A6157200000578-0-image-a-2_1453944699723.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420259_Texas-inmate-executed-eight-years-shooting-dead-game-warden-illegally-hunting_1540239999.html","title":"Texas inmate James Freeman executed 8 years after shooting dead Justin Hurst","title_page":"Texas inmate James Freeman executed 8 years after shooting dead Justin Hurst | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"James Freeman was executed on Wednesday for killing Texas Parks and Wildlife Game Warden Justin Hurst during a March 2007 shootout\nA Texas man was executed on Wednesday evening for fatally shooting a game warden nine years ago during a shootout after a 90-minute chase that began when he was suspected of poaching.\nJames Freeman, 35, was asked by the warden if he had a final statement, and replied: 'No, I do not.'\nHe was pronounced dead at 6.30pm, 16 minutes after Texas prison officials began a lethal dose of Pentobarbital.\nAs the Pentobarbital began taking effect, he snored about five times and coughed slightly once.\nThe lethal injection was the second in as many weeks in Texas, which carries out capital punishment more than any other state.\nThe US Supreme Court declined to review his case earlier this month, and no new appeals were filed in the courts to try to block the punishment.\nThe Texas Board of Pardons and Paroles on Monday declined a clemency petition from Freeman.\nFreeman was suspected of illegally hunting at night in Southeast Texas' Wharton County when a game warden spotted him.\nFreeman sped away in his pickup truck, leading authorities on a chase that reached 130 mph. It ended by a cemetery near his home in Lissie with Freeman stepping out of his truck and shooting at officers.\nHe emptied his 11-shot .357-caliber handgun, then switched to an AK-47 assault rifle with a 30-round clip.\nJustin Hurst was one of several authorities who joined the 90-minute chase in March 2007. He was fatally wounded and it was his 34th birthday\nSince game wardens began enforcing conservation laws, eighteen Texas game wardens have died, including Hurst (pictured)\nWhen the March 17, 2007, shootout was over, Freeman had been shot four times and Justin Hurst, a Texas Parks and Wildlife game warden who had joined in the pursuit, was fatally wounded. It was Hurst's 34th birthday.\nAbout 100 law enforcement officers, many of them Texas game wardens, stood outside the Huntsville prison during the execution.\nAlso outside were several motorcyclists who support law enforcement - the loud revving of their bikes clearly audible as the punishment was being carried out.\nHurst was an alligator and waterfowl specialist before moving to law enforcement. A state wildlife management area where he once worked in Brazoria County and about 60 miles south of Houston now carries his name.\nSteve Lightfoot, an agency spokesman who knew Hurst, said the married father of a four-month-old son represented 'the very essence of what this agency is about and what game wardens are about'.\n'He was very passionate in his role concerning the state's resources and protecting those resources,' Lightfoot said.\nFreeman's appeals lawyer, Don Vernay, said Freeman's lack of a previous criminal record should have influenced jurors and that he didn't deserve the death penalty, which in Texas requires a jury to find that a capital murder offender would be a continuing threat.\n'He never did anything wrong in his life other than a DUI. This kid was not a future danger, he was just a loser... He got drunk and got in a shooting,' the lawyer said.\nA psychologist testifying at trial said Freeman told him he drank about nine beers while watching a football game on TV at his home and then decided to drive around and shoot snakes and birds that night - something he enjoyed doing.\nFreeman's trial lawyer, Stanley Schneider, said heavy alcohol use and severe depression led the unemployed welder to try to commit 'suicide by cop' in his confrontation with officers.\n'It was totally senseless,' Schneider said of the fatal shooting. 'It really is very sad that it happened, that two families are suffering like this.'\nThe Texas Department of Criminal Justice has at least eight other inmates set to die through July.\nThe first of the year to die was Richard Masterson, 43, who was pronounced dead at 6.53pm on January 20, 25 minutes after the lethal injection began.\nMasterson had claimed his January 2001 strangulation of Darin Shane Honeycutt was accidental, and he had several appeals before the courts, including four with the US Supreme Court. His last-day efforts to stop his execution were rejected.\nMasterson had testified at his trial that the death of the 35-year-old Honeycutt in Houston happened accidentally during a chokehold that was part of a sex act. The two had met at a bar and then went to Honeycutt's apartment.\nHoneycutt was an entertainer who performed dressed as a woman. Honeycutt's stage name was Brandi Houston.\nLast year, 13 convicted killers were put to death in Texas, accounting for nearly half of all the 28 executions carried out nationwide.","url":"https://www.dailymail.co.uk/news/article-3420259/Texas-inmate-executed-eight-years-shooting-dead-game-warden-illegally-hunting.html"}
