{"authors":[],"date_download":"2018-10-30 22:24:41","date_modify":"2018-10-30 22:24:41","date_publish":"2014-08-15 18:16:06","description":"Last year, thousands gathered in Austin, Texas, to protest an omnibus abortion bill making its way through the Texas Senate. Despite the efforts of the orange-clad protestors and a spirited filibuster from Sen. Wendy Davis, the bill was passed and…","filename":"data/vaneerConsumption/TexasToughAntiAbortionLawHB2HingesOnOneJudgesRuling.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7f767b65-0077-4592-86e3-4d434af2a0d6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35946-texas-tough-anti-abortion-law-hb2-hinges-on-one-judges-ruling_1540938281.html","title":"Texas' Tough Anti-Abortion Law, HB2, Hinges On One Judge's Ruling","title_page":"Texas' Tough Anti-Abortion Law, HB2, Hinges On One Judge's Ruling","title_rss":"NULL","source_domain":"bustle.com","text":"Last year, thousands gathered in Austin, Texas, to protest an omnibus abortion bill making its way through the Texas Senate. Despite the efforts of the orange-clad protestors and a spirited filibuster from Sen. Wendy Davis, the bill was passed and signed by Gov. Rick Perry. But before it takes effect Sept. 1, the strict anti-abortion measure is facing legal scrutiny in a U.S. district court, where the judge is considering the burden it could pose to women.\nIf implemented as it is, House Bill 2 would mandate that all abortion providers make costly updates to their facilities to bring them up to ambulatory surgical center standards. This would effectively shutter all but seven abortion providers in a state that is larger than France and England combined.\nThe bill's opponents sued the state in an attempt to block parts of the law that they feel place an \"undue burden\" on women seeking abortions if they live outside of Texas' metro areas. If it goes into effect, the law would be particularly damaging for women in the western part of the state, who would have to drive over 500 miles to the nearest in-state abortion provider.\nClosing arguments were made in Austin on Wednesday, and while U.S. District Judge Lee Yeakel did not issue a ruling, he cast doubt that the law was designed to protect women, as its supporters have parroted throughout the process.\nJana Birchum/Getty Images News/Getty Images\n\"Would we allow that to stand for someone receiving an appendectomy or a sprained ankle? I have a problem believing it’s OK to send someone 150 miles away for care when they could get it closer,\" Yeakel said during closing arguments. \"I don’t think we would let this stand for any other minor medical procedure.\"\nYeakel is expected to issue the ruling in the coming weeks, with the Sept. 1 deadline looming. Though his comments seem like a glimmer of hope for the abortion-rights advocates, the defense has relied heavily on a decision from the U.S. 5th Circuit Court of Appeals this October that upheld HB2. The three-judge panel reversed a decision from a federal district court that found the law unconstitutional, saying that there was not enough evidence of an undue burden on women, and that the evidence did not indicate that HB2 would prevent women from obtaining an abortion.\nA key point to the defense's case is that 83 percent of Texas women would still live within 150 miles of an abortion provider. Even the women in West Texas, according to the defense, could easily obtain abortions in New Mexico. But the fact that there is even a small percentage of the population that must jump through hoops to undergo a simple procedure is problematic. Women should not have to have state lines define their right to abortion access.","url":"https://www.bustle.com/articles/35946-texas-tough-anti-abortion-law-hb2-hinges-on-one-judges-ruling"}
