{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 00:08:29","date_modify":"2018-10-23 00:08:29","date_publish":"2016-01-28 13:42:45","description":"Brittany Daniel was driving with a friend on the busy I-30 (pictured) in Arlington, Texas, when a man in the back seat of a car with tinted windows opened fire and shot her.","filename":"data/vaneerConsumption/TexashousekeeperisfatallyshotintoadrageincidentinFortWorth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC983600000578-0-image-a-32_1454001658839.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420957_Woman-26-fatally-shot-passenger-car-opened-fire-road-rage-dispute-Fort-Worth_1540253309.html","title":"Texas housekeeper is fatally shot in toad rage incident in Fort Worth","title_page":"Texas housekeeper is fatally shot in toad rage incident in Fort Worth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A manhunt is on the way for a man suspected of shooting a 26-year-old woman dead during a road rage attack in Texas.\nBrittany Daniel, from Fort Worth, was driving with a friend on the busy I-30 in Arlington when she became involved in a dispute with another car, police say.\nThe passenger in the back seat of the other vehicle then opened fire on Miss Daniel and she was struck by a bullet while driving at around 7pm last night.\nShe was on her way back from working a shift as a housekeeper at a local hotel and was taking some of her colleagues home.\nBrittany Daniel was shot and killed while behind the wheel of her car after a passenger in another vehicle opened fire during a road rage dispute in Arlington, Texas\nThe 26-year-old hotel worker (left with her brother and right) was the only girl in a family of five children. Her father said she would speak up when someone was driving erratically but it wouldn't be an excuse to shoot her\nThe passenger in the car called 911 and said was bleeding after being shot in what they described as a road range incident.\nEmergency services arrived on the scene but Miss Daniel was pronounced dead at the local hospital shortly afterwards.\nArlington Police are now appealing for help from the public to try and find those responsible.\nThe shooter is described as a light-skinned, black or Hispanic male with dark hair, possibly in his mid-20s.\nHe was in the rear passenger seat of a small four-door car with tinted windows.\nHer father told WFAA8 he had lost his 'baby girl'. He added she was his only daughter of five children.\nShe she had the personality to speak up if someone was driving erratically, he told the station, but insisted that nothing justifies killing someone.\nShe was driving with a friend on the busy I-30 in Artlington and was on the way back from her shift as a hotel housekeeper when she became involved in a dispute with another car, police say. The road is pictured the morning after the deadly incident","url":"https://www.dailymail.co.uk/news/article-3420957/Woman-26-fatally-shot-passenger-car-opened-fire-road-rage-dispute-Fort-Worth.html"}
