{"authors":[],"date_download":"2018-10-22 22:58:22","date_modify":"2018-10-22 22:58:22","date_publish":"2014-05-12 20:21:31","description":"Robert James Campbell filed a new round of appeals the day before his scheduled lethal injection.","filename":"data/vaneerConsumption/TexasInmateRobertJamesCampbellFiles11thHourAppeals.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/297241/140402-huntsville-prison-1440_f488c520984c4a02323d4462db7d57a6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_texas-inmate-robert-james-campbell-files-11th-hour-appeals-n103531_1540249102.html","title":"Texas Inmate Robert James Campbell Files 11th Hour Appeals","title_page":"Texas Inmate Robert James Campbell Files 11th Hour Appeals","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Texas killer scheduled for the nation's first execution since a botched lethal injection in Oklahoma filed a new round of appeals on Monday.\nRobert James Campbell, 41, asked the Fifth U.S. Circuit Court of Appeals to halt Tuesday's execution on the grounds that the state has refused to say where it obtained the deadly drugs.\nThe appeals panel has declined in the past to issue stays of execution because of drug-secrecy policies, but the new challenge is being pressed just a few weeks after the Oklahoma debacle focused new attention on how states kill death-row inmates.\nIn Oklahoma, where a new drug combination was used for the first time, Clayton Lockett appeared to regain consciousness and writhe and moan in pain mid-execution, witnesses said.\nPrison officials later said his vein collapsed, but no autopsy report has yet been issued. The state has halted executions while an investigation is under way.\nTexas, which uses a different drug, has said the problems in Oklahoma should not affect its executions, but at least one federal judge disagrees.\nIn a ruling late last week, District Judge Keith Ellison suggested Lockett's death \"requires sober reflection on the manner in which this nation administers the ultimate punishment.\"\nNevertheless, Ellison said he could not stop Campbell's execution because of earlier rulings by the Fifth Circuit.","url":"https://www.nbcnews.com/storyline/lethal-injection/texas-inmate-robert-james-campbell-files-11th-hour-appeals-n103531"}
