{"authors":["Alex Swoyer"],"date_download":"2018-10-30 20:14:40","date_modify":"2018-10-30 20:14:40","date_publish":"2015-11-16 16:54:46","description":"Michigan Gov. Rick Snyder said he wants to pause refugees coming into his state until screening procedures are reviewed by the DHS.","filename":"data/vaneerConsumption/TexasAlabamaMichiganIndianaTellObamaWeWontAcceptAnySyrianRefugees.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_16__1540930480.html","title":"Texas, Alabama, Michigan, Indiana Tell Obama: We Won't Accept Any Syrian Refugees","title_page":"Texas, Alabama, Michigan, Indiana Tell Obama: We Won't Accept Any Syrian Refugees | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Several governors are challenging President Obama, saying they won’t allow their states to receive any more Syrian refugees in light of the recent attack in Paris by ISIS. The Governors of Alabama, Michigan, Indiana and Texas are among those challenging Obama over refugees.\nThe decisions by state leaders come “amid reports that at least one of the Paris attackers slipped through Europe’s immigration system and concerns about ‘gaping holes’ impacting America’s screening process,” noted Fox News.\nMichigan Gov. Rick Snyder said he wants to pause refugees coming into his state until screening procedures are reviewed by the Department of Homeland Security.\n“Michigan is a welcoming state and we are proud of our rich history of immigration,” Snyder announced in a statement. “But our first priority is protecting the safety of our residents.” He added, “It’s also important to remember that these attacks are the efforts of extremists and do not reflect the peaceful ways of people of Middle Eastern descent here and around the world.”\nMichigan has reportedly taken in roughly 2,000 refugees, 200 of which were Syrian.\nAlabama’s Gov. Robert Bentley said his state won’t take in any refugees at this time after he thought about the impact following the attacks in Paris, saying “[a]fter full consideration of this weekend’s attacks of terror on innocent citizens in Paris … I will not stand complicit to a policy that places the citizens of Alabama in harm’s way.”\nTexas Gov. Greg Abbott is also announcing the Lone Star state won’t take in any Syrian refugees.\n“Given the tragic attacks in Paris and the threats we have already seen, Texas cannot participate in any program that will result in Syrian refugees – any one of whom could be connected to terrorism – being resettled in Texas,” Abbott wrote in his letter to Obama. “Effective today, I am directing the Texas Health & Human Services Commission’s Refugee Resettlement Program to not participate in the resettlement of any Syrian refugees in the State of Texas. And I urge you, as President, to halt your plans to allow Syrians to be resettled anywhere in the United States.”\n“Neither you nor any federal official can guarantee that Syrian refugees will not be part of any terroristic activity,” Abbott added. “As such, opening our door to them irresponsibly exposes our fellow Americans to unacceptable peril.”\nIndiana Gov. Mike Pence adds:\nIn the wake of the horrific attacks in Paris, effective immediately, I am directing all state agencies to suspend the resettlement of additional Syrian refugees in the state of Indiana pending assurances from the federal government that proper security measures have been achieved. Indiana has a long tradition of opening our arms and homes to refugees from around the world but, as governor, my first responsibility is to ensure the safety and security of all Hoosiers. Unless and until the state of Indiana receives assurances that proper security measures are in place, this policy will remain in full force and effect.\nGOP presidential candidate Louisiana Gov. Bobby Jindal wants answers from the Obama administration after reports emerged that refugees from Syria were recently taken into his state.\n“Louisiana has been kept in the dark about those seeking refuge in the state,” Jindal stated in a letter to Obama. “It is irresponsible and severely disconcerting to place individuals, who may have ties to ISIS, in a state without the state’s knowledge or involvement. … As governor of Louisiana, I demand information.”","url":"https://www.breitbart.com/politics/2015/11/16/texas-alabama-michigan-tell-obama-wont-accept-syrian-refugees/"}
