{"authors":["Bob Price"],"date_download":"2018-10-30 21:50:41","date_modify":"2018-10-30 21:50:41","date_publish":"2017-03-08 17:09:50","description":"A District Court Judge in Harris County ruled that the accused killer of Sheriff’s Deputy Darren Goforth is competent to stand trial.","filename":"data/vaneerConsumption/TexasJudgeRulesAllegedCopKillerCompetenttoStandTrial.json","image_url":"https://media.breitbart.com/media/2015/08/AP_395234572758.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_03_08__1540936241.html","title":"Texas Judge Rules Alleged Cop-Killer Competent to Stand Trial","title_page":"Texas Judge Rules Alleged Cop-Killer Competent to Stand Trial","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, TX – A District Court Judge in Harris County ruled that the accused killer of Sheriff’s Deputy Darren Goforth is competent to stand trial.\nThe ruling in the accused cop-killer’s competency comes just over a year and a half after Harris County Deputy Sheriff Darren Goforth was gunned down in cold blood outside a gas station convenience store. Goforth was in uniform and in the process of filling up his marked patrol unit when Shannon Miles allegedly walked up behind him and shot the deputy in the back of his head and the back about 15 times, Breitbart Texas reported.\n“It is one of the most disturbing videos I have seen in more than forty years of police work,” then-Harris County Sheriff Ron Hickman told Breitbart Texas. “As Deputy Goforth walked out of the store, the man we now know as Shannon Miles walked up behind him and shot him in the head and back.”\nThe matter of Miles’ competency to stand trial has gone back and forth over the past 18 months. In February 2016, Breitbart reported Judge Susan Brown ruled Miles temporarily incompetent and ordered him to be evaluated by a state mental facility.\n“We are disappointed by the news, but remain hopeful that the State will restore Shannon Miles’ competency promptly so justice can be sought,” the Harris County Sheriff’s Office said in a written statement. “It is a tragic reminder that we lost Deputy Goforth to an individual whose only apparent motive was that Darren wore the uniform of a law enforcement officer.”\nSeven months later, after being treated in a North Texas mental health facility, the judge ruled Miles was competent to stand trial.\nIn September 2016, Miles’ attorneys again raised the competency issue. In November, his lawyer claimed Miles was still incompetent. The judge ordered an independent review of Miles’ mental health condition.\nAfter hearing arguments in the case on Wednesday morning, the judge ruled Miles is competent to stand trial, KTRK ABC13 reported.\nBreitbart Texas was on the scene of Goforth’s murder shortly after it occurred in August 2015. While standing across the street from Mile’s home, located a few blocks away from Goforth’s murder, this reporter overheard deputies talking with Miles’ mother at about 3 a.m. “My boy would never do anything like this,” she told the deputies. Breitbart Texas observed the red truck seen leaving the murder scene in the driveway of the home.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2017/03/08/texas-judge-rules-alleged-cop-killer-competent-stand-trial/"}
