{"authors":["Merrill Hope"],"date_download":"2018-10-30 20:18:31","date_modify":"2018-10-30 20:18:31","date_publish":"2016-09-13 15:09:15","description":"For the eighth consecutive year, Texas educator-student sexual misconduct cases soared, hitting an all time high of 222 investigations.","filename":"data/vaneerConsumption/TexasTeacherSexualMisconductCasesHitAllTimeHigh.json","image_url":"https://media.breitbart.com/media/2016/07/grade-school-elementary-classroom-afp-e1475243273195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_09_13__1540930711.html","title":"Texas Teacher Sexual Misconduct Cases Hit All-Time High","title_page":"Texas Teacher Sexual Misconduct Cases Hit All-Time High","title_rss":"NULL","source_domain":"breitbart.com","text":"For the eighth consecutive year, Texas educator-student sexual misconduct cases soared, hitting an all time high of 222 investigations opened by the Texas Education Agency (TEA) in the 2015-16 school year. However, one education expert says this reflects deeper societal issues and he spoke with Breitbart Texas about some of the ways to curb the rampant problem.\nMonday, the TEA confirmed for Breitbart Texas the 222 cases, an 80 percent increase compared to the 2008-09 school year when the agency opened 123 investigations. In 2009-10, they reported 141 cases; in 2010-11, 152 cases; 2011-12, 156 cases; 2012-13, 163; 2013-14, 179; and 2014-15, 188. The 2014-15 spike was so troubling that some state lawmakers convened last winter to assess the role of social media in fostering improper educator-student relationships and seek policy solutions to present at the upcoming 85th Legislature.\nBreitbart Texas reports on education professionals in the Lone Star State who cross the line sexually with underage students. Not all of them are teachers; some are aides, coaches, and principals who betray the public trust by violating the school children they are supposed to protect. The problem is bigger than Texas, too. It is a deeply-rooted national epidemic, says Dr. Ernest Zarra, III, author of “Teacher-Student Relationships: Crossing into the Emotional, Physical, and Sexual Realms.”\nHe spoke to Breitbart Texas about new ways to resolve this ethical fracture, exacerbated by the breakdown of barriers between adults and students in an internet age where underlying psychological factors often influence why some adults form inappropriate bonds with students.\nLast year, TEA spokeswoman Debbie Ratcliffe told Breitbart Texas the majority of Texas education professionals behave in a moral and ethical way. Zarra noted that educators who know “where the lines are, are probably more likely to check themselves before stepping over” but little currently exists to stop wayward educators from crossing over. He says background checks are not enough these days and believes potential violators can be stopped through effective front end training and “reflective professional development.”\n“The problem today is that no school of education trains teachers to establish moral and ethical boundaries. Schools and districts do not train teachers how to establish and maintain these boundaries,” said the lifelong California educator, adjunct professor of education at California State University, Bakersfield, and author of four education books.\n“Teachers must become informed of the lines. Districts must lay down the policy clearly and train their teachers and coaches on what is appropriate and inappropriate between them,” he told Breitbart Texas, suggesting preventative measures like in-depth, new hiring screenings, and longer probationary periods for teachers before granting tenure to thwart classroom predators.\nZarra recommends questions for administrators to ask faculty if behavioral red flags emerge. This includes when a teacher spends inordinate amounts of time with a student, schedules one-to-one student meeting time for “apparently social reasons,” or overly communicates with a student via technology. Based on his expertise, Zarra developed a professional development training tool: “Addressing Appropriate and Inappropriate Teacher-Student Relationships.” It will run in the Fall issue of education journal CLEARVoz.\nBreitbart Texas reported that former U.S. Department of Education chief-of staff Terry Abbott blamed social media and secret electronic text messaging apps as an “open gateway” for teacher sexual perpetrators to engage in improper relationships with students “out of sight of parents and principals.” In 2014, Abbott’s Houston-based Drive West Communications found 35 percent of the nation’s inappropriate teacher-student entanglements involved social media.\nAbbott suggested banning all forms of teacher-student private communications as a fix to the problem. While Zarra agrees technology created “access for predators 24/7,” he suggests social media as symptomatic of society’s disintegrating social fabric. He told Breitbart Texas, “We live in a very connected world and when teachers and adults are trusted as friends socially, online or in person, we all tend to feel closer than we should. Boundaries and walls have come down and all of us can be rock stars online.”\nYet, even before the advent of social media, the issue existed. In 1991, grassroots organization S.E.S.A.M.E (Stop Educator Sexual Abuse Misconduct & Exploitation) formed. In 1998, Education Week reported on the same epidemic plaguing U.S. schools today. Then, the publication listed unverifiable sexual abuse allegations, uneven reporting of incidences by administrators, insufficient policing of the profession at state levels, questionable district recruitment practices, and even district agreements to “keep silent about allegations in exchange for the resignations” as methods that hindered efforts to curb the the predatory problem.\nIn August, Doug Phillips, director of educator investigation for the TEA, told Houston’s KPRC the case numbers could be higher. “We believe there are unreported teacher-student relationships,” he said, underscoring schools can make secret deals with teachers to keep the information under the radar and out of the news media spotlight.\nTexas scored a B” grade, in USA Today’s probe as to how well states conducted educator background checks, then tracked and shared educator discipline records to impede future misconduct cases. The nationwide practice of “passing the trash” allows educators to transfer to new schools where individuals often offend again. Texas Lt. Governor Dan Patrick called for an end to “passing the trash,” following a 2016 investigation by Dallas’ WFAA. Zarra underscored, “Transferring a teacher with a history of sexual complaints only shuffles the problem to a new location where it will affect more people.”\nFollow Merrill Hope, a member of the original Breitbart Texas team, on Twitter.","url":"https://www.breitbart.com/border/2016/09/13/texas-teacher-sexual-misconduct-cases-hit-time-high/"}
