{"authors":["Lana Shadwick"],"date_download":"2018-10-30 21:29:05","date_modify":"2018-10-30 21:29:05","date_publish":"2016-02-01 21:50:51","description":"County health officials in Texas are taking precautions and using diligence in protecting Texans from the Zika virus. State officials have already |","filename":"data/vaneerConsumption/TexasHealthOfficialsUrgeCautionProtectiontoAvoidZikaVirus.json","image_url":"https://media.breitbart.com/media/2016/02/Zika-spraying.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_01__1540934945.html","title":"Texas Health Officials Urge Caution, Protection to Avoid Zika Virus","title_page":"Texas Health Officials Urge Caution, Protection to Avoid Zika Virus","title_rss":"NULL","source_domain":"breitbart.com","text":"County health officials in Texas are taking precautions and using diligence in protecting Texans from the Zika virus. State officials have already confirmed six travel-related cases of the virus and are using caution to both protect and warn Texans about the dangers of the virus.\nThe Texas Department of State Health Services (TDSHS) confirmed as of late Friday, that six Texans have contacted the virus, as reported by Breitbart Texas’ Merrill Hope. There are four more suspected cases. All of these individuals contacted the virus when they were out of the United States.\nCounty officials are checking mosquito traps daily, reported the Dallas Morning News. The county has fortunately not found one mosquito that has tested positive for the Zika virus.\nDr. Mustapha Debboun, director of the Dallas County health department’s mosquito control division was reported to say, “With nature, you never know. But we’ll be prepared.”\nAn infectious disease epidemiologist at the UTHealth School of Public Health in Houston, Dr. Catherine Troisi, was reported by the Dallas news outlet to have said, “We will see [locally-acquired] cases, I can guarantee we will.”\nTwo women in Houston have been reported to have contacted the virus when they were in Columbia and El Salvador. The Houston area is home to about 104,000 El Salvadorans, 21,000 Columbians, and 3,300 Brazilians, reported the Morning News. Of course, some of these individuals travel back to their homeland for visits and are placing themselves at risk to contract the disease.\nThe TDSHS reports as of Monday morning that there has been no reported local transmission of the disease in the continental United States. However, as reported by Breitbart Texas’ Merrill Hope, the Texas Gulf Coast could be the “hardest hit” in any outbreak of the virus.\nMosquitoes are rampant in the spring and outbreaks of any disease are more likely at that time. Economically depressed areas in Texas are potential dangerous breeding grounds.\nThe danger of the virus in Texas and the states initially comes from travel to, or from those who have been in El Salvador, Brazil, and Columbia. These countries in particular have seen a huge outbreak of the virus.\nBreitbart News reported that Brazil launched a door-to-door campaign using 220,000 soldiers. There has been 4,000 fetus affected cases and approximately 200 more are diagnosed every week.\nBrazilian authorities ordered health workers to sterilize Rio de Janeiro’s Sambadrome. It will serve as the center of the 2016 Summer Olympics and officials are doing this to combat spread of the Zika virus, reported Breitbart News.\nPregnant women and their unborn children are the most susceptible to the virus, as reported by Breitbart Texas.\nThe Centers for Disease Control and Prevention has issued a travel advisory and have warned pregnant women to not travel to Latin and Central America – areas that have been hit hard by the disease.\nHealth authorities also ask that those returning from areas that have had an outbreak of the virus, be careful not to be bitten by mosquitoes even if they do not have symptoms, reported the Morning News.\nAs Merrill Hope reported, the virus is spread by the same two kinds of Aedes mosquitoes that carry Dengue fever which is prevalent on the Texas-Mexico border. These mosquitoes also carry Chikungunya which was first reported in Texas in 2014. As reported by Breitbart Texas, there were more cases reported last year.\nDr. Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine, told the Morning News that the Pan American Health Organization has been effective in addressing public health campaigns in the past. The organization serving the Americas has been effective in mosquito eradication programs by getting rid of freestanding water and by using chemicals that kill the insects and their eggs.\nAs reported by Breitbart Texas and Breitbart News, Planned Parenthood and elected officials have used the virus as an opportunity to promote, and grant women the ability to have an abortion. Abortion is illegal in many Latin American countries. As reported by Breitbart News’ Edwin Mora, leftist groups and government officials are pushing pregnant women in the Americas to abort their children affected with brain deformities connected with the virus.\nThe signs and symptoms of the Zika virus include fever, rash, joint pain, and red eyes, reports the Texas coastal region’s Galveston County Health District. The symptoms generally begin three to seven days after being bitten by an infected mosquito. Severe consequences to a non-pregnant individual is uncommon. Those infected generally suffer mild symptoms and recover after several days or a week.\nThe Galveston County Health District has advised those who have to travel to Brazil, Columbia, El Salvador, French Guiana, Guatemala, Haiti, Honduras, Martinique, Mexico, Panama, Paraguay, Suriname, Venezuela, and Puerto Rico, to prevent themselves from mosquito bites. Travelers are cautioned to wear long-sleeved shirts and long pants and use insect repellents containing DEET.\nIn order to curb spread of the disease and prevent any outbreak, the Texas Communicable Disease Prevention and Control Act requires health officials, dentists, and veterinarians to report any patient suspected of having the disease.\nThe Center for Disease Control has a link that addresses the most commonly asked questions about the Zika virus.\nThere have been two suspected cases of sexual transmission of the Zika virus, as reported by Breitbart News.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/national-security/2016/02/01/texas-health-official-urge-caution-protection-to-avoid-zika-virus/"}
