{"authors":[],"date_download":"2018-10-22 21:44:08","date_modify":"2018-10-22 21:44:08","date_publish":"2014-05-08 00:29:05","description":"A Texas family is celebrating the arrival of quadruplets born on their father's 36th birthday.","filename":"data/vaneerConsumption/TexasQuadrupletsBornonDadsBirthday.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427846/140507-quadruplets-jms-2007_9cd7eb45d83db7a0ad1578651b2e438c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_texas-quadruplets-born-dads-birthday-n99956_1540244648.html","title":"Texas Quadruplets Born on Dad's Birthday","title_page":"Texas Quadruplets Born on Dad's Birthday","title_rss":"NULL","source_domain":"nbcnews.com","text":"Just before 2 p.m. the boy, named Brooks, was the first of the four to arrive. Brooks was followed by his three sisters, Sadie, and identical twins Elle and Ivy. Brooks weighed in at 3 pounds 11 ounces, Sadie at 2 pounds 15 ounces, Elle at 3 pounds 6 ounces and Ivy at 3 pounds 5 ounces.\nAs is typical with quads, the babies were born premature and will require a stay in the Baylor NICU before being allowed to go home and join their two older sisters, ages 2 and 4.\n“We feel very blessed to welcome these four new children into our family,” said Joshua Hall.\nAccording to Dr. Sherri Kappler, medical director of the Level III Baylor Grapevine neonatal intensive care unit (NICU), the average set of quads is born at 29.5 weeks. \"Mrs. Hall was able to reach almost 32 weeks, which was great news for the babies,\" she said.\n\"Because these babies are often very small, they need special care to aid in growth and development before they can go home. Breathing and feeding may be difficult for these tiny patients,\" the hospital said in a news release Wednesday.\n\"We are just praying everybody is going to be good sleepers good eaters. It is going to be fun,\" added mother Anna.\nThe quads were the first born at the facility, which in 2013 delivered more than 2,500 babies.\n“Since this is the hospital's first set of quads, this birth is extra special to us,\" said Susan West, nurse manager of the Baylor Grapevine NICU.\nIn March, Steven and Michelle Seals gave birth to quintuplets, four girls and a boy, at Baylor University Medical Center in Dallas.\nThe Seals' babies were born at 29 weeks and spent several weeks in the NICU.","url":"https://www.nbcnews.com/news/us-news/texas-quadruplets-born-dads-birthday-n99956"}
