{"authors":["Mary Chastain"],"date_download":"2018-10-30 19:57:43","date_modify":"2018-10-30 19:57:43","date_publish":"2015-05-06 19:31:54","description":"According to an FBI report, Elton Simpson revealed in private messages on Twitter exactly how and when he decided to turn against the United States and embrace radical Islam.","filename":"data/vaneerConsumption/TexasShooterWantedtoJoinISISinSyria.json","image_url":"https://media.breitbart.com/media/2015/05/Elton-Simpson-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_06__1540929463.html","title":"Texas Shooter Wanted to Join ISIS in Syria","title_page":"Report: Texas Shooter Wanted to Join ISIS in Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"According to an FBI report, Elton Simpson revealed in private messages on Twitter exactly how and when he decided to turn against the United States and embrace radical Islam.\nABC News received a copy of the report and published a few of the findings:\n“Soon you won’t be able to live in America as a Muslim. The noose is tightening,” Elton Simpson wrote in a March 14 message seen by the FBI and obtained by ABC News. On April 10 he wrote, “Time is short.” Less than two weeks later he referenced the Mohammad drawing contest — the site of Sunday’s attack — saying, “When will they ever learn?” The messages show that Simpson had planned to travel to Syria to join ISIS last month and attempted to recruit others to join him. “Bring your passport. If you have $4,000, that’s enough to travel with,” he wrote on April 10. But his plans were disrupted when the FBI in San Diego and Minneapolis arrested some people he wanted to go with him, he said.\nAn anonymous “senior law enforcement official” told The New York Times the FBI did not monitor Simpson’s tweets because “there are so many like him,” even though they arrested his conspirators. They even ignored him despite his long history with al-Shabaab, a radical Islamic group in Somalia that attacked the Westgate Mall in Kenya in 2013.\nIn 2006, the FBI investigated Simpson because “of his radical leanings.” They sent an informant to Simpson’s mosque where they found out about his sympathetic nature towards al-Shabaab in Somalia. He spoke to the informant in 2009 about a possible trip to Somalia to join the terrorist group.\nAgents arrested him in 2010 after he made plans to travel to Somalia through South Africa “under the pretense of studying at a madrasa.” The FBI could not place him on the No Fly List and only charged him with making false statements.","url":"https://www.breitbart.com/national-security/2015/05/06/report-texas-shooter-wanted-to-join-isis-in-syria-before-attacks/"}
