{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:50:40","date_modify":"2018-10-30 21:50:40","date_publish":"2018-09-14 13:41:11","description":"A Texas teacher is accused of sending sexually explicit texts that allegedly led to a sexual relationship with a 14-year-old female student.","filename":"data/vaneerConsumption/TexasTeacherAllegedlySentSexualTextsto14YearOldStudentSayPolice.json","image_url":"https://media.breitbart.com/media/2018/09/Whitney-Anne-Laidlaw.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2018_09_14__1540936240.html","title":"Texas Teacher Allegedly Sent Sexual Texts to 14-Year-Old Student, Say Police","title_page":"Texas Teacher Allegedly Sent Sexual Texts to 14-Year-Old Student, Say Police","title_rss":"NULL","source_domain":"breitbart.com","text":"A Texas middle school teacher is accused of sending sexually explicit texts that allegedly led to a summertime sexual relationship with a 14-year-old female student.\nWhitney Grunder Laidlaw, a seventh grade teacher at Cornerstone Academy, was placed on administrative leave last week after school officials learned she was arrested on two counts of sexual misconduct, said Spring Branch Independent School District officials.\nLaidlaw, 32, was charged with the sexual assault of a child and having an improper relationship with a student. Purportedly, the teacher texted the seventh grader at the end of the school year and said she had feelings for the girl.\nHouston police investigators said Laidlaw exchanged cell phone numbers with the alleged victim, who was 14 at the time. The two communicated by text, Instagram, and Snapchat. The girl also told police that Laidlaw texted titillating photos and videos of herself and asked the purported victim to reciprocate. She refused. Court documents revealed the girl said Laidlaw also asked her to sneak out of her family’s Harris County apartment and meet with her, according to KTRK. The girl said she told the teacher she did not want to do that. Instead, Laidlaw allegedly showed up at the apartment on several mornings after the girl’s mother left for work. Apparently, on multiple occasions, they kissed in Laidlaw’s car. The student said the teacher also touched her inappropriately in the back seat.\nThe girl’s father discovered the sexual messages on his daughter’s cell phone, according to court documents. When asked about them, the student said they came from Laidlaw. She divulged about kissing the teacher and how Laidlaw allegedly fondled her.\nSpring Branch ISD released a statement:\nThe Houston Police Department (HPD) has notified Spring Branch ISD Police that HPD has arrested a Cornerstone Academy teacher, Whitney (Grunder) Laidlaw, for alleged crimes involving an improper relationship with a student. When the allegations came to the district’s attention last week, we immediately removed Mrs. Laidlaw from the classroom and placed her on administrative leave. The alleged incidents reportedly occurred during the summer break and did not occur on school property. We are outraged by this alleged conduct. The safety of every SBISD student is our very highest priority, and having a strong moral compass is a key district core value. We will never tolerate inappropriate actions on the part of any district employee who endangers or harms our students. These allegations, if true, are a complete breach of the trust our children, our community, and we place in our educators.\nSchool district officials continue to work closely with local law enforcement on this case. They said counselors will be available for students at Cornerstone. The academy is a public charter school within Spring Branch ISD. It serves students in grades six through eight. Reportedly, Laidlaw taught hip-hop.\nAs a condition of her bond, Laidlaw may not contact the victim or the victim’s family in person, electronically, or by mail. She may not have contact with anyone under the age of 17 and she cannot supervise or participate in any program with children younger than 16. Also, she must surrender her passport to the Harris County authorities.\nHouston police are asking individuals with information about this case to contact them or the school district’s campus police.\nFollow Merrill Hope, a member of the original Breitbart Texas team, on Twitter.","url":"https://www.breitbart.com/border/2018/09/14/texas-teacher-allegedly-sent-sexual-texts-to-14-year-old-student-say-police/"}
