{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:50:59","date_modify":"2018-10-30 19:50:59","date_publish":"2017-02-07 23:20:06","description":"New England Patriots star quarterback Tom Brady's Super Bowl jersey is missing and now the famed Texas Rangers have been put on the case to find it, reports reveal. | Sports","filename":"data/vaneerConsumption/TexasRangersontheCaseofTomBradysMissingSuperBowlJersey.json","image_url":"https://media.breitbart.com/media/2017/02/tom-brady4.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_02_07__1540929059.html","title":"Texas Rangers on the Case of Tom Brady's Missing Super Bowl Jersey","title_page":"Texas Rangers on the Case of Tom Brady's Missing Super Bowl Jersey | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New England Patriots star quarterback Tom Brady’s Super Bowl jersey is missing and now the famed Texas Rangers have been put on the case to find it, reports reveal.\nAfter Super Bowl LI went into the history books, host city Houston, Texas, found out that winning quarterback Tom Brady’s jersey turned up missing from his locker. After filing a report with the local police, Texas Lt. Governor Dan Patrick asked the Texas Rangers to get involved, Sporting News reported.\nBy order of the Lt. Gov, the Rangers will now be assisting the Houston Police Department in the case.\n“In Texas we place a very high value on hospitality and football,” the lieutenant governor said on Monday. “Tom Brady’s jersey has great historical value and is already being called ‘the most valuable NFL collectable ever.’ It will likely go into the Hall of Fame one day. It is important that history does not record that it was stolen in Texas. I’ve called Colonel Steve McCraw to ask that the Texas Rangers work with the Houston Police Department on this case.”\n“Whoever took this jersey should turn it in. The Texas Rangers are on the trail,” Patrick added.\nBy some estimates, the Super Bowl-worn jersey could be worth as much as $500,000 on the sports collectibles market. The high estimate includes the fact that Brady wore the jersey while winning his fifth Super Bowl ring, a feat never before achieved by a quarterback in the history of the game.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/sports/2017/02/07/texas-rangers-case-tom-bradys-missing-super-bowl-jersey/"}
