{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:23:48","date_modify":"2018-10-30 21:23:48","date_publish":"2015-04-19 15:01:10","description":"The Texas Senate moved forward this week in a bipartisan 26-5 vote to decriminalize truancy.","filename":"data/vaneerConsumption/TexasSenatePassesBilltoDecriminalizeTruancyMovestoHouse.json","image_url":"https://media.breitbart.com/media/2015/03/texastruancy-AP-Photo-Christian-Rodriguez.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_04_19__1540934628.html","title":"Texas Senate Passes Bill to Decriminalize Truancy, Moves to House","title_page":"Texas Senate Passes Bill to Decriminalize Truancy, Moves to House","title_rss":"NULL","source_domain":"breitbart.com","text":"The Texas Senate moved forward this week in a bipartisan 26-5 vote to decriminalize truancy. The Failure to Attend School (FTAS) or “truancy” is currently a juvenile Class C misdemeanor that carries fines and criminal marks on a student’s record for cutting class. It may soon be a thing of the past as the Texas Senate moved forward to decriminalize it through Senate Bill 106 (SB 106).\nThe legislation will next move to the House for a vote and if passed, will go to the Governor. SB 106 was authored by Sen. John Whitmire (D- Houston), chairman of the Criminal Justice Committee.\nDuring the Senate’s debate on Wednesday, Whitmire cited cases of mistreatment under the current truancy system including a 17-year-old who was handcuffed in school over an outstanding truancy charge. His parents were unaware he had received the charge five years earlier. A pregnant teen who skipped school because she had no maternity clothes was also charged with truancy. This resulted in mounting costs because of a court case that was brought against her.\nBreitbart Texas reported that the bill would end prosecuting students for cutting classes. Public school administrators and court judges would focus more on truancy prevention. The criminal charges would no longer be filed and affect a minor’s future well into adulthood. In the version of bill the Senate approved, it would leave an option to file charges against the parents and students could still face fines.\nMorgan Craven, staff attorney for Texas Appleseed, told Breitbart Texas, “Generally, we think that SB 106 has a lot of great components, especially those related to the decriminalization of Failure to Attend School and intervention measures for schools.”\nTexas Appleseed has been on the forefront of decriminalizing truancy. This is one of the practices on the school-to-prison pipeline, the result of those zero tolerance disciplinary policies in Texas public schools that criminalize student behavior and sets them on a dubious path. Unfortunately, they do not necessarily remediate the root of the problem. Texas is only one of two states that prosecutes minors for truancy.\nTruancy cuts across all demographics. It can affect suburban students, their parents and homeschoolers, too. Once charges are filed, they create a criminal paper trail and, if those documents are visible, they can wreak havoc on college and job applications, Breitbart Texas reported. This often requires the paid services of an attorney to seal and later expunge the records. Underprivileged juvenile violators cannot always afford the fines nor the lawyer. When they do not pay them, it can turn into arrest and jail time once those youths turn 17 years-old.\nBreitbart Texas also reported that, in 2014, nearly 100,000 Class C misdemeanors were doled out by school officials or full service campus police departments that are considered independent Texas police agencies. Often, they are dispatched by towns or larger municipalities. They are public sector employees and are compensated, in part, through taxpayer dollars.\nIn 2013, there were 115,000 tickets issued for truancy in Texas. During the 83rd Legislative session, also in 2013, lawmakers made it much more difficult to “ticket” frivolous kid and teen behaviors; however, truancy and other classes of misdemeanors has remained as crimes.\nThe DOJ launched an investigation into the due process practices of the Dallas County Truancy and Juvenile District Courts. Over the years, truancy has become a cash cow for Dallas County, with more than $3 million in fines being collected in those truancy courts. The Dallas courts put 110 students in jail or juvenile detention for truancy violations, Breitbart Texas reported.\nTexas public school districts also continue to support prosecuting minors, which often take place in adult courts. North Texas school district officials from the Collin County cities of Plano and McKinney, plus the City of Denton in Denton County opposed decriminalizing truancy at the Senate meeting.\nThe five state senators who voted against SB 106 were Brandon Creighton (R-Houston), Bob Hall (R-Rockwall), Kelly Hancock (R-North Richland Hills), Larry Taylor (R-Friendswood), and Van Taylor (R-Plano).\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/04/19/texas-senate-passes-bill-to-decriminalize-truancy-moves-to-house/"}
