{"authors":["Merrill Hope"],"date_download":"2018-10-30 20:53:04","date_modify":"2018-10-30 20:53:04","date_publish":"2014-12-15 14:55:00","description":"The U.S. Department of Education and the U.S. Department of Health and Human Services (HHS) jointly announced on December 10 that 18 states were awarded a |","filename":"data/vaneerConsumption/TexasMediaForgottoReport30MillionFedsGaveToPreK.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/17/emptyClass2jpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_12_15__1540932784.html","title":"Texas Media Forgot to Report $30 Million Feds Gave To Pre-K","title_page":"Texas Media Forgot to Report $30 Million Feds Gave To Pre-K | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S. Department of Education and the U.S. Department of Health and Human Services (HHS) jointly announced on December 10 that 18 states were awarded a huge prize — Big Ed’s Head Start Jr. — preschool development and expansion grants totaling more than $226 million under the Preschool Development Grants. It was all part of the Obama Administration’s Pre-K for All initiative originally announced during the President’s 2013 State of the Union address, which Breitbart Texas reported.\nTexas applied for an expansion grant but didn’t get the $120 million (over four years) universal pre-K package. The state did get a $30 million dollar pre-K award that was announced at the White House early education summit as part of the total $1 billion in federal early education grants awarded to states to expand their pre-K programs.\nBy and large, the Texas media did not report it.\nBreitbart Texas did. The Dallas Morning News reported on the portion of those HHS funds going to Dallas ($4.2 million) and Fort Worth ($900,000) area programs. Otherwise, statewide, it was quiet.\nSan Antonio, home to former Mayor Julian Castro’s Pre-K 4 SA, was awarded a healthy $7.4 million through HHS. It was divided among the City of San Antonio, Family Services Association of San Antonio, and Parent Child, Incorporated. This was not reported by the San Antonio Express-News.\nAnother $7.4 million went to the City of Edinburg through the University of Texas – Pan American. The Monitor picked up Associated Press’ (AP) news story out of Austin, lamenting vouchers and state costs for pre-K but it did not mention the HHS award. The Monitor also ran a nationally syndicated AP article that breezed over the $500 million in HHS funds but did mention them specifically to Edinburg.\nNationally, ABC News acknowledged that there were 40-plus states that were recipients of a total $500 million set aside by HHS to expand Early Head Start and child care programs for youngsters from birth to 3 years old. So did the PBS News Hour. The White House website included it under its new federal actions. The Office of Administration of Children & Families (ACF) Early Childhood Development division broke down the winners by state, city and awardee.\nThese federal funds were set aside for new Early Head Start-Child Care (EHS-CC) partnerships. The grants “will allow new or existing Early Head Start programs to partner with local child care centers and family child care providers serving infants and toddlers from low-income families, according to the ACF.\nTexas was one of 45 states, Puerto Rico, the Northern Mariana Islands, and the District of Columbia awarded this federal money through the EHS-CC Partnership and Early Head Start Expansion grants that are part of President Obama’s Early Learning Initiative that expand and improve preschool.\nBreitbart Texas spoke with Texas Education Agency (TEA) Director of Communications Debbie Ratcliffe who verified that Texas did receive the HHS grant. Although she could not address the omission of this information by state media, she said that the TEA was not eligible to apply for it and that these funds were awarded “at the local level.”\nIt remains unclear why so many Texas news outlets omitted reporting on the dollars that poured into the state. These funds will continue to bring early childhood federal Head Start programs into Texas.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2014/12/15/texas-media-forgot-to-report-30-million-feds-gave-to-pre-k/"}
