{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:18:04","date_modify":"2018-10-30 20:18:04","date_publish":"2016-12-31 14:16:16","description":"A bill pre-filed in the Texas Legislature on December 28 would put teeth into circumventing a \"faithless elector.\"","filename":"data/vaneerConsumption/TexasBillWillRemoveFaithlessElectorandVoidtheirVote.json","image_url":"https://media.breitbart.com/media/2016/12/Chris-Suprun-first-pitch-Rangers-2015-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_12_31__1540930684.html","title":"Texas Bill Will Remove 'Faithless Elector' and Void their Vote","title_page":"Texas Bill Will Remove 'Faithless Elector' and Void their Vote","title_rss":"NULL","source_domain":"breitbart.com","text":"A bill pre-filed in the Texas Legislature on December 28 would put teeth into circumventing a “faithless elector.” Any attempt by an elector to cast a vote for anyone other than the candidates that received the popular vote in the Lone Star State would be void. Moreover, casting the void vote would immediately create a vacancy in the elector’s position.\nHouse Bill 771 was filed by Michael “Mike” Schofield (R-Houston) in advance of the 85th Texas Legislature. The bill would amend the Texas Election Code to mandate that a presidential elector “must cast a ballot for a candidate for president or vice-president that corresponds to the candidates who received the most votes cast in this state for those offices.”\nThe bill, if passed, would not only mandate that the elector cast their ballot for the candidate for president or vice president who won the popular vote in Texas but provides that “An attempt to cast a ballot in a manner other than the manner required,” “is not valid and is not considered a vote cast by an elector.”\nRep. Schofield told Breitbart Texas, “Texas voters need to know that their vote actually counts. Our election doesn’t mean much if voters vote for one candidate and our state’s electoral votes go to somebody else. HB 771 will ensure that Texas’ electoral votes go to the candidate the voters chose when they went to the polls.”\nMoreover, under Schofield’s bill, the “attempt” to vote contrary to this law would “creat[e] a vacancy in the position of the elector attempting to cast the ballot.” A “replacement elector for a vacancy created” pursuant to this law would be filled from the list of alternate electors. The position of alternate electors would be created under this bill. The party’s state chair would provide a list of alternate electors for a vacancy in the manner, and in the number provided under the Election Code.\n“Under my bill, the electoral ballots would be public, just like other states do, and just like our elected representatives in the legislature are required to do,” Rep. Schofield told Breitbart Texas. He added, “If you’re representing other people with your vote; it’s not your private vote; people need to see how you’re representing them.”\nState Senator Paul Bettencourt (R-Houston) announced he will sponsor the bill in the senate. “The Electoral College is an important and unique feature of the American system of government,” Senator Bettencourt said in a statement obtained by Breitbart Texas. “Having served as a 2012 Presidential Elector, I know how important it is that these votes represent the choice of Texas voters in the Presidential Election.”\n“I commend Representative Schofield’s HB 771, which will ensure that Texas electors cast ballots that reflect the will of the voters in this state,” Bettencourt continued. “I look forward to being the Senate sponsor of HB 771 and assisting with its passage so that Texas electors will honor the voice of the people.”\nThe Act would take effect September 1, 2017.\nBreitbart Texas reported on December 21 that bills had been filed in both houses that would create penalties for electors who do not honor their pledge to cast a ballot for the winner of the presidential vote in the State. State Senator-elect Dawn Buckingham (R-Lakeway) pre-filed Senate Bill 394, the “Texas Elector Accountability Act.” House Bill 543, filed earlier this month by Texas State Representative John Raney (R-Bryan) provides:\nThat a faithless elector would be ineligible to serve as an elector in all subsequent elections.\nAt the meeting of electors, an elector shall vote for the candidates for president and vice-president receiving the most votes in the general election for state and county officers.\nAn elector who violates Subsection (a) is liable to this state for a civil penalty of $5,000.\nAs reported by Breitbart Texas:\nThe Texas electors signed an affidavit pledging to vote for the presidential candidate receiving the most votes. The electors are chosen by congressional district caucuses at the respective state party conventions in the summer leading up to the presidential election. The electors for the party whose candidates receive the most votes in the November General Election gather at the State Capitol to cast their official ballots for the President of the Unites States and a separate ballot for the Vice President of the United States. Texas law currently provides no penalty for an elector that fails to honor their pledge.\nGovernor Greg Abbott has vowed to sign a bill if it passes through the Texas Legislature next session. The bills come after two faithless electors in this month’s Electoral College vote in the Texas State Capitol refused to vote for the state’s winner. The Texas Governor tweeted on December 19th, “This charade is over.”\nChristopher Suprin, elector for Congressional District 30, made headlines when he announced he would cast his ballot for Ohio Governor John Kasich, as reported by Breitbart Texas and many other media outlets.\nWhile the actual ballot cast by electors in Texas is a secret ballot, one vote was cast for the Ohio governor during balloting. A second elector voted for former Texas Representative Ron Paul.\nAs reported prior to the Electoral College vote, “They are bound by affidavit to vote for the candidate who won the state,” Texas AG Spokesman Marc Rylander said. “There is no state law that binds them in this process; however, the electors are long-term party activists who historically hold the line.”\nElectors and any future alternate electors convene at the State Capitol at 2 p.m. on the first Monday after the second Wednesday in December following their election.\nEditor’s Note: This article was updated with a statement from State Senator Bettencourt.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nHouse Bill 771 by Rep. Mike Schofield by lanashadwick on Scribd","url":"https://www.breitbart.com/border/2016/12/31/ttexas-bill-will-remove-faithless-elector-and-void-their-vote-if-passed/"}
