{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:18:15","date_modify":"2018-10-30 20:18:15","date_publish":"2014-08-11 15:53:00","description":"HOUSTON, Texas -- Federal law gives eligible unaccompanied immigrant children (","filename":"data/vaneerConsumption/TexasLawyersBeingTrainedToHelpEligibleUACGetSpecialProtections.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/08/10/CheifJusticeSupremeCourtTX.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_08_11__1540930695.html","title":"Texas Lawyers Being Trained To Help Eligible UAC Get Special Protections","title_page":"Texas Lawyers Being Trained To Help Eligible UAC Get Special Protections | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — Federal law gives eligible unaccompanied immigrant children (“UACs”) who have entered the country illegally special protections. Hundreds of lawyers and others in Houston, Texas, recently attended a legal seminar hosted by Democrat Harris County Attorney Vince Ryan. Breitbart Texas was there. The program was co-sponsored by area law schools and law firms, and a number of non-profit organizations, including Catholic Charities. The purpose of the seminar was to instruct lawyers how to provide pro bono (volunteer) representation to unaccompanied minors in Texas juvenile and family courts.\nThe Chief Justice of the Texas Supreme Court, Nathan Hecht, noted that the topic of unaccompanied minors streaming over the borders is politically divisive but that the courts cannot take sides on the issue. He cited U.S. Department of Homeland Security statistics that unaccompanied children from Central America have crossed the border in record numbers – 57,525 during October and June of this past year – two times as many as during the same period the previous year. Hecht noted that nearly three times the number have crossed the Rio Grande border than during the previous year.\nThe Chief Justice stated that a recent Gallop Poll found that the single most important concern for Americans was immigration and illegal entry into the country. He said that these concerns were for Texans, “on our doorstep.”\nThe Supreme Court of Texas Permanent Judicial Commission for Children, Youth and Family, working with the Texas Office of Court Administration, the Texas Department of Family and Protective Services (“CPS”), and Texas judges, has provided a brief that gives an overview of the legal issues involved in the cases involving unaccompanied minors. The procedures used with unaccompanied minors are as follows.\nUnaccompanied minors who are detained by Border Patrol Agents are transferred to the ORR (Office of Refugee Resettlement). The ORR places these children with parents, relatives, or friends who apply to the ORR or to a federally operated facility or a facility that is licensed by the state.\nThese children can become the subject of Texas courts in instances where there is a CPS investigation because an ORR Sponsor alleges abuse or neglect. When these claims are confirmed, CPS may file a Suit Affecting the Parent-Child Relationship (“SAPCR”) in the family courts. The child can then be placed in foster care.\nState juvenile courts can also be petitioned by sponsors and facilities under federal contract to make legal findings that the unaccompanied minor has been abandoned, neglected or abused by their parents, and that reunification with the parents and return to their or their parent’s country of origin is not in their best interest. These findings are essential for obtaining permanent residency and are called Special Immigrant Juvenile Status (“SIJS”) findings.\nThe SIJS findings of the juvenile court judge do not automatically subject these children to the same supervision as children in CPS cases. The federal government must approve of the SIJS findings of the juvenile court. There must be a finding that these orders were not issued for the purpose of obtaining special immigration benefits but because there was abandonment, neglect, or abuse. The Texas Office of Court Administration is gathering statistics on how many cases involving unaccompanied minors are filed.\nMake Justice Happen, a service of the Houston Volunteer Lawyers division of the Houston Bar Association, and other organizations, have created websites to provide information for lawyers who want to provide pro bono representation for these children. A video of the seminar, and legal information from the Houston seminar, has been posted on the website of the Harris County Attorney.\nLana Shadwick is a 22 year lawyer who has been a family court associate judge, prosecutor, and CPS lawyer. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2014/08/11/texas-lawyers-being-trained-to-help-eligible-uac-get-special-protections/"}
