{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 03:52:49","date_modify":"2018-10-23 03:52:49","date_publish":"2016-01-28 19:33:10","description":"DJ Williams was dubbed 'The Manger Baby' after shocked parishioners found him hidden inside St. Anne Catholic Church's nativity scene in Houston, Texas in 1971 - then just a few days old.","filename":"data/vaneerConsumption/TexasbabyabandonedinNativityscenemangerreuniteswithbiologicalfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD30C000000578-0-image-a-2_1454015596640.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421391_Baby-abandoned-church-Nativity-scene-manger-44-years-ago-finally-reunites-biological-family_1540266769.html","title":"Texas baby abandoned in Nativity scene manger reunites with biological family","title_page":"Texas baby abandoned in Nativity scene manger reunites with biological family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"But Williams always longed to find his birth parents and\nA real life babe in a manger has finally reunited with his biological family decades after he was abandoned in a Houston, Texas, church.\nDJ Williams was dubbed 'The Manger Baby' after shocked parishioners found him hidden inside St. Anne Catholic Church's nativity scene in 1971 - then just a few days old, ABC 13 reports.\nHe was adopted by a couple in Dayton, Texas, and said he'd had a happy, loving upbringing but he never felt like he fit in.\nScroll down for video\nDJ Williams was dubbed 'The Manger Baby' after shocked parishioners found him hidden inside a nativity scene in 1971 - then just a few days old\nWilliams had an emotional and tear-filled reunion with his three half-sisters and half-brother\n'I felt like an outsider in the family even though I knew they loved me,' he told the Houston Chronicle. 'I felt alone.'\nHe said that part of him always wondered about the parents who had abandoned him.\nWhen his adoptive parents passed away, he decided to try and track down his biological family.\nWilliams, who lives in Baltimore, Maryland, with his partner Mike and their six-year-old son Zephyr, put out a desperate appeal last summer asking for anyone who knew about the Manger Baby or his family to get in touch.\nTragically, it was too late for his birth parents who have passed away but today the 44 year old has been reunited with some of family for the first time.\nAll Williams had to go on about his ignominious beginnings was a newspaper report and a picture of him being held by a social worker after he was discovered (left). But he was quickly adopted and had a happy loving childhood (right)\nWilliams was discovered in December 1971 inside a manger at St. Anne Catholic Church in Houston, Texas\nWilliams had always dreamed of tracking down his biological parents and made a public appeal to anyone who knew anything about the Manger Baby left at the church (pictured) or his family to come forward\n'I had honestly given up hope for the longest time,' Williams told ABC 13 Houston after finally connecting with his three half-sisters and half-brother in an emotional and tear-filled reunion. 'I just can't believe it. That's amazing.'\nWilliams said he may never know why his parents left him in a manger, but said he believes his birth mother made the right decision to drop him off in a safe place, in the arms of the church.\nToday he is simply happy to have been able to connect with his blood relatives.\n'For me, it was about finding that connection,' he said. 'You're just floating in the sea and you don't have any anchor to hold onto, and so now I have something to hold onto, and I'm not letting go.'\nWilliams, 44, traveled through Germany, Idaho, Utah, Florida and Nashville before he settled in Baltimore, after leaving high school in Dayton.\nIn 2006, when he first began tracing his relatives he faced a daunting task.\nAll he had to go on was a news clipping from December 1971 featuring the story of The Manger Baby.\nOverwhelmed: The family reunites with their brother for the first time after Williams tracked down his siblings\nWilliams, who lives in Baltimore, Maryland with his partner Mike and their six-year-old son Zephyr, was overjoyed when he got a hit on a DNA database\nTwo women passing the Nativity scene had discovered him wrapped in a blanket and crying in the manger and alerted church officials.\nDoctors at the time said he was well-fed and healthy at the time he was dumped.\nThe search seemed hopelessly daunting until Williams saw the story of another abandoned baby, a woman who was left in a New York City phone booth, who was reunited with her family with the help of investigative genealogist Pam Slaton.\nAt the urging of Slaton, Williams made a public appeal for help in tracking down his family and submit a DNA test to Family Tree DNA, a genetic testing company based in Houston.\nIncredibly, he got two hits straight away - both close, blood relatives.\nA little further research found that they were his mother's brother, and her daughter - Williams' half-sister - Rose. She was born just two years after he was left in the church.\nThrough Rose, he found another two half-sisters and a half-brother who were overjoyed to be reunited with the long-lost brother they never knew was missing.","url":"https://www.dailymail.co.uk/news/article-3421391/Baby-abandoned-church-Nativity-scene-manger-44-years-ago-finally-reunites-biological-family.html"}
