{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 04:24:41","date_modify":"2018-10-23 04:24:41","date_publish":"2016-01-11 17:24:36","description":"A wire holding up one side of the suspended platform at the city's Chase Tower broke at 10.20am (Central Time) on Monday, leaving at least two men stranded.","filename":"data/vaneerConsumption/Texaswindowwashersrescuedafterbeingstuck71storieshighonChaseTower.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D40DB00000578-0-image-a-14_1452533072869.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394269_Two-window-washers-dangle-perilously-75-story-skyscraper-Houston-scaffolding-snapped_1540268681.html","title":"Texas window washers rescued after being stuck 71 stories high on Chase Tower","title_page":"Texas window washers rescued after being stuck 71 stories high on Chase Tower | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two window washers have been rescued after dangling perilously 71 stories high from the tallest building in Texas.\nThe men were stuck at the top of the 1,100-foot-tall JPMorgan Chase Tower in Houston for more than 40 minutes on Monday morning.\nA wire holding up one side of the suspended platform snapped at 10.40am (Central Time) on Monday, leaving the men clinging for their lives.\nScroll down for video\nTwo window washers have been rescued after dangling 71 stories high from the tallest building in Texas\nThis is a shot of the scaffolding platform after one of the wires snapped on Monday morning in Houston, Texas\nThe town is the tallest building in Texas, scaling a staggering 1,049 feet\nAt least two men could be seen clinging to the metal contraption as they hung over the city\nAlmost an hour later, fire fighters were still scrambling to reach the cleaners before finally dragging them through an open window.\nIt is not clear whether anybody has been injured.\nAccording to ABC, the workers had a 'motor malfunction' when they reached the 71st floor.\nThey radioed for help but within seconds their scaffolding had snapped.","url":"https://www.dailymail.co.uk/news/article-3394269/Two-window-washers-dangle-perilously-75-story-skyscraper-Houston-scaffolding-snapped.html"}
