{"authors":["Kristin Tate"],"date_download":"2018-10-30 21:13:52","date_modify":"2018-10-30 21:13:52","date_publish":"2014-08-18 14:03:35","description":"HOUSTON, Texas -- While the national unemployment rate rose during the last month, Texas' remained relatively low at just 5.1 percent, according to new |","filename":"data/vaneerConsumption/TexasJobMarketFlourishingasNationalUnemploymentRateIncreases.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/TexasFlagjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_08_18__1540934032.html","title":"Texas Job Market Flourishing as National Unemployment Rate Increases","title_page":"Texas Job Market Flourishing as National Unemployment Rate Increases | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — While the national unemployment rate rose during the last month, Texas’ remained relatively low at just 5.1 percent, according to new data from the Texas Workforce Commission (TWC).\nTexas’ current unemployment rate is well below the national average, which currently sits at 6.2 percent.\nMidland is home to Texas’ lowest unemployment rate; according to the TWC, only 2.9 percent of the population there is jobless.\nSara Higgins, a spokeswoman with the City of Midland, previously told Breitbart Texas, “We have issues filling our jobs. … The low unemployment has made it hard to find workers in the service sector. To remain competitive, the starting wages are incredibly high for retail and restaurants here, but we see more people going into oil because it’s more lucrative. Some restaurants have had to reduce hours because they cannot hire enough staff to keep it open full time.”\nWhile Higgins mentioned that gas and oil are the “backbone” of Midland’s economy, the area is becoming more diversified in terms of thriving industries. The rest of the state appears to be doing the same.\nTWC Chairman Andres Alcantar in a recent press release, “Texas employers continue to propel the Texas economy’s expansion by adding 396,200 jobs over the last year, a 3.5 percent annual growth rate. The Texas economic engine is strong, with every major industry posting positive annual growth in July.”\nIndeed, Breitbart Texas has closely reported on the diversification of Texas’ economy, which was almost entirely dependent on the gas and oil industry in the 1970’s.\nGas and oil economist Karr Ingham told Breitbart Texas, “The Texas economy in the 1970’s and 1980’s was troublesome. We went through years of economic hardship and a lot of it had to do with oil and gas, which was a much larger share of the Texas economy than it is now. Even though the oil industry and gas has been thriving in recent years, the Texas economy is no longer dependent on it for ups and downs.”\nEvery industry continues to expand in Texas. Many, including Texas Governor Rick Perry, claim that this growth was bolstered by the state’s low taxes and reliable regulation.\nIngham said, “The state economy is now a powerhouse. It is more than just an oil and gas economy; it is an industrial economy, a tech economy, a business economy, a manufacturing economy… Texas has a lot going for it.”\nFollow Kristin Tate on Twitter @KristinBTate.","url":"https://www.breitbart.com/border/2014/08/18/Texas-Job-Market-Flourishing-as-National-Unemployment-Rate-Increases/"}
