{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:18:03","date_modify":"2018-10-30 20:18:03","date_publish":"2016-12-12 17:32:37","description":"A bill that, if passed, would add a college or university ID to the list of forms of identification that could be used for voting in Texas.","filename":"data/vaneerConsumption/TexasDemPushesStudentCardsbeUsedforVoterID.json","image_url":"https://media.breitbart.com/media/2016/12/student-id-tamu.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_12_12__1540930683.html","title":"Texas Dem Pushes Student Cards be Used for Voter ID","title_page":"Texas Dem Pushes Student Cards be Used for Voter ID","title_rss":"NULL","source_domain":"breitbart.com","text":"A Democrat senator from Austin, Texas, has pre-filed a bill that if passed, would add a college or university ID to the list of forms of identification that could be used for voting in Texas.\nSenate Bill 284, filed on December 8, would amend the Texas Election Code to allow an ID “issued by a public institution of higher education located in this state that contains the person’s photograph.”\nThe bill pre-filed by Senator Kirk Watson (D-Austin) would also amend the Election Code to allow an identification card issued by a state agency in Texas. This ID, like an ID from a higher education institution, must have the person’s photograph on it in order to be used for voting.\nTexas Attorney General Ken Paxton filed a petition for a writ of certiorari in the U.S. Supreme Court in September asking the Court to fully reinstate the Lone Star State’s voter ID law, as reported by Breitbart Texas.\nSB 14 was signed into law in 2011 by then-Governor Rick Perry. The Texas Association of Hispanic County Judges and County Commissioners, Texas State Conference of NAACP Branches, Mexican American Legislative Caucus of the Texas House of Representatives, League of United Latin American Citizens, The United States of America, La Union Del Pueblo Entero, Inc., Texas League of Young Voters Education Fund, and others sued claiming the law was unconstitutionally discriminatory.\nThe two questions presented in the petition for writ of certiorari to the U.S. Supreme Court are:\nWhether Texas’ voter-ID law ‘results in’ the abridgement of voting rights on account of race. Whether judgment should be rendered for petitioners on the claim that Texas’ voter-ID law was enacted with a racially discriminatory purpose.\nTexas AG Paxton urged in his petition to the U.S. Supreme Court that the court of appeals affirmed the district court finding that “Plaintiffs have not demonstrated that any particular voter . . . cannot get the necessary ID or vote by absentee ballot under [Texas’ voter-ID law].” He also argued that there is no evidence that the law affected political participation by minority voters.\nAn interim remedial Order was issued which applied to the November 8, 2016, election. The Order was intended to provide a temporary solution for State officials as it related to the specified forms of ID allowed for voting.","url":"https://www.breitbart.com/border/2016/12/12/texas-dem-pushes-student-cards-used-voter-id/"}
