{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:52:25","date_modify":"2018-10-30 21:52:25","date_publish":"2016-02-16 15:56:31","description":"The same Texas public school board that stripped the historical namesakes of figures associated with the Confederacy from four campuses in January, the Houston Independent School District, voted to rebrand three more late last week.","filename":"data/vaneerConsumption/TexasSchoolBoardStripsHistoryfrom3MoreConfederateNamedCampuses.json","image_url":"https://media.breitbart.com/media/2016/02/DavisHighSchoolHouston.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_02_16__1540936345.html","title":"Texas School Board Strips History from 3 More ‘Confederate’ Named Campuses","title_page":"Texas School Board Strips History from 3 More ‘Confederate’ Named Campuses","title_rss":"NULL","source_domain":"breitbart.com","text":"The same Texas public school board that stripped the historical namesakes of figures associated with the Confederacy from four campuses in January, the Houston Independent School District, voted to rebrand three more late last week.\nThe Feb. 11 vote, characterized by the Houston Chronicle as nearly all falling along racial lines, with black and Hispanic board members in favor of the name changes, resulted in renaming Albert Sidney Johnston and Sidney Lanier middle schools, 5-4, respectively, and 6-3 to rebrand Jefferson Davis High School.\nBreitbart Texas reported former board president Rhonda Skillern-Jones, prompted by a letter from State Sen. Rodney Ellis (D-Houston), led the charge last year to change Houston ISD’s policy to allow the board of trustees to order campus name changes. The move followed the hate crime shootings of nine black parishioners in South Carolina. That tragedy spurned a national movement to shun symbols and historical figures that recalled the pre-Civil War South.\nIn January, trustees voted 5-4 to rename four of the district’s public schools presently named after Confederate-tied Stonewall Jackson, Robert E. Lee, Richard Dowling, and Henry Grady.\nContentious debates and concerns arose at last Thursday evening’s board meeting over costs associated with new monikers for the latest crop of campus rebrands. The board also intends to approve a name change for John Reagan High School in a future meeting, bringing the count of schools getting new names to eight.\nTrustees priced renaming costs at approximately $250,000 per school which may include new emblems, logos, team uniforms, school mascots and other related school spirit, pride and other booster branded materials. For potentially eight schools, this holds an estimated $2 million price tag at a time when Houston ISD has a $107 million budgetary shortfall.\nPublic comments netted mixed feelings on the proposed name changes. While many felt maintaining Confederate linked names sent a wrong message, a sizeable contingent of community members turned out to support Lanier Middle School in keeping its name. Lanier, a native Georgian, fought in the Confederate Army but later chronicled the “gruesome hardships of war” as a poet. The Poetry Foundation called him a “major contributor” to 19th Century American poetry. Despite the redemptive value of his work, trustee Jolanda Jones argued for a new middle school name.\nThis got ugly at times but board votes to change the names of Lanier and Johnston ms and Jeff Davis HS #khou11 pic.twitter.com/1cvcsm7kRS — Josh Chapin (@JoshChapinKHOU) February 12, 2016\n“I find incredibly interesting that the majority of the people that are proud of Sidney Lanier are white,” said Jones, who attended Lanier Middle School. The Houston Chronicle noted she also said: “I am offended that when black people talk about slavery and the vestiges, that people want us to get over it.”\nJones is an attorney and a former member of the Houston City Council. The Houston Chronicle reported cable network WE cast her on their upcoming reality TV show “Sisters in Law,” described as a program that follows the “close-knit group of elite high-powered black female lawyers as they juggle their families, busy careers and even more demanding social calendars.”\nAnna Eastman, the board member representing Jefferson Davis High School, debated Jones. Eastman proposed a motion to take renaming decisions out of the board’s hands and into the respective school communities. “There’s conflicting opinions there about whether or not the name should be changed,” Eastman said. “And so I think they deserve to go through a democratic decision-making process and bring us a recommendation.”\nEastman’s motion failed. Later, upset Lanier parent Adrienne Murry said about Jones to KHOU 11 (CBS): “She makes comments online, #HISDIsRacist, #segregated, #truth—she’s saying bad things about this community that she’s supposed to be representing and it’s very insulting to us.” Murry called it “reverse racism at its best.”\nLanier representatives plan to file a lawsuit to maintain the campus name, the Houston CBS-TV affiliate noted.\nIn December, the Houston ISD board approved the district borrowing $212 million to cover a shortfall in its $1.9 billion 2012 bond, the largest school bond in Texas history. This left the district with a $107 million budgetary gap. The matter is under investigation by an independent auditing firm. Regardless of costs associated with renaming campuses and the district’s deficit, trustee Skillern-Jones said: “I’ll take dignity over dollars.”\nHouston ISD is the largest school district in Texas and the seventh largest in the United States, serving approximately 215,000 students at 283 campuses. Its operating budget is $2,355,857,000, spending an average of $11,601 per student, according to Niche, which ranked the district 47th out of 82 best school districts in the Houston Metro area, and placed them at 605th in the state.\nIn December, 40 percent or 109 of Houston ISD’s schools rated as failing or low performing based on poor test scores or unacceptable ratings on the Texas Education Agency’s 2016-17 Public Education Grant (PEG) list, comprising the district with the most failing schools in the state.\nAll schools destined for new namesakes must form exploratory committees compromised of students, staff, parents, and alumni. They will bring their ideas to the board by May.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2016/02/16/3-more-houston-school-districts-dump-confederate-ties/"}
