{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:58:31","date_modify":"2018-10-30 19:58:31","date_publish":"2016-09-28 13:26:22","description":"The Harris County Sheriff's Office boasts an eight percent recidivism rate among military veteran offenders.","filename":"data/vaneerConsumption/TexasProgramforJailedVetsYields8Recidivism.json","image_url":"https://media.breitbart.com/media/2015/10/empty-jail-cell-prison-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_09_28__1540929511.html","title":"Texas Program for Jailed Vets Yields 8% Recidivism","title_page":"Texas Program for Jailed Vets Yields 8% Recidivism","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — The “Stars and Stripes” program at the Harris County Sheriff’s Office jail in Texas boasts an eight percent recidivism rate among military veteran offenders.\nThe national average recidivism rate is 67.8 percent.\n“We’re proud to offer the men and women that volunteered to serve our Country opportunities to better themselves after they’ve made choices that landed them in jail,” said Harris County Sheriff Ron Hickman. “You’ve made a sacrifice for the Country, now it’s our turn to give you the tools and support to turn your life around.”\nOver 75% of the veterans participating in the program have been diagnosed with Post Traumatic Stress Disorder. “We’ve given you the tools, now it’s up to you to change your future,” said Sheriff Hickman when he visited the jail.\nBreitbart Texas has reported that the Department of Veteran Affairs issued a Suicide Data Report in 2012 which chronicled that 22 veterans a day commit suicide. Many suffer from PTSD. As reported by Breitbart News on August 26th, 76-year-old Navy veteran Peter A. Kaisen, of Islip, New York, killed himself in the parking lot of the Northport Veterans Affairs Medical Center after reportedly being turned away for emergency care. The stress also sometimes brings poor choices which leads to incarceration.\nSheriff Hickman told Breitbart Texas, “Veterans are dumped into society after service and unless they find a way to hook-up with society, they can get into trouble.” Many of them do not know they have PTSD or anger issues. Many veterans engage in substance abuse as an escape mechanism. He said the program has been very helpful but while they have qualitative information on the success, the Sheriff looks forward to having more quantitative data.\nThe Sheriff of the third largest office in the United States paid a visit to the Stars and Stripes and Freedom Project cell blocks during a surprise inspection. He visited with inmates who are engaging in and benefiting from the programs. The Freedom Project is the civilian equivalent version of the Stars and Stripes program.\nThe program gives the participants the “duty and discipline that they get in the service,” Hickman told Breitbart Texas. They include U.S. Marine Corps Force Reconnaissance veterans and some sailors, he said. A handful of men in the group shared their stories about what the program has meant to them. Accountability is part of the program, he said “PTSD is a diagnosis not an excuse.” He told them to do the program “for yourself.”\nThe program offers veterans who are in the county jail medical and mental health care, group therapy, VA assistance as well as employment counseling and job skills training.\nThe Harris County Sheriff’s Office also has a program called the “Freedom Project”. It offers drug and alcohol rehabilitation in the jail. The Freedom Project has a very impressive 3% recidivism rate for the men who take part in the program.\n“Most often we see programs such as these operating in the State’s prison system,” explains Sheriff Ron Hickman. “Our belief is that county time shouldn’t be wasted. If you’re incarcerated in Harris County, either pre or post trial, I want you to have access to the services that will help you best reenter the community.”\nOnce the participants leave the programs, caseworkers and volunteers follow-up with them even after they leave. Hickman said they are given assistance and direction on making good choices for their new lives on the outside.\nThe Sheriff said he told them he was going to put up a sign in the jail that said, “You Are Not Welcome. Don’t Come Back.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2016/09/28/texas-program-jailed-vets-yields-8-recidivism/"}
