{"authors":["Bob Price"],"date_download":"2018-10-30 20:53:24","date_modify":"2018-10-30 20:53:24","date_publish":"2016-10-04 15:00:06","description":"An employee of a jewelry store in Conroe, Texas, pulled an AK-47 from behind the counter to stop four would-be armed robbers.","filename":"data/vaneerConsumption/TexasStoreEmployeeUsesAK47toStop4ArmedRobbers.json","image_url":"https://media.breitbart.com/media/2016/10/Jeffs-Jewelry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_10_04__1540932804.html","title":"Texas Store Employee Uses AK-47 to Stop 4 Armed Robbers","title_page":"Texas Store Employee Uses AK-47 to Stop 4 Armed Robbers","title_rss":"NULL","source_domain":"breitbart.com","text":"An employee of a jewelry store in Conroe, Texas, pulled an AK-47 from behind the counter to stop four would-be armed robbers. One of the armed robbers opened fire and multiple employees returned fire, killing the suspect.\nJeffery Turner, Jr., owner of Jeff’s Jewelry Store in Conroe, told police that four men entered his store and demanded jewelry, purses and other items. At least one of the robbers displayed a firearm, according to Montgomery County Police Reporter’s Scott Engle. One of Turner’s employees responded by pulling an AK-47 semi-automatic rifle from behind the counter. The gunman fired at the store employees and a firefight ensued. At least three employees were said to have fired weapons at the robbery suspects.\nThe suspect who began shooting was struck and killed in the gun fight. The other three suspects escaped in a white Dodge Charger. Police found the Charger not far from the scene of the robbery. The suspects in the failed robbery attempt had abandoned the car and remain at large, Engle reported.\nPolice have not yet released the identity of the deceased suspect.\nThe attempted robbery took place on Monday afternoon at about 12:30 p.m.\nTurner’s attorney, E. Tay Bond, spoke with the Conroe Courier’s Catherine Dominguez. “You always have a right to defend yourself, especially when the robber shoots at you.” Bond confirmed that Turner keeps an AK-47 in the store for defensive purposes.\nThe AK-47 rifle is manufactured in both automatic and semi-automatic models. In a semi-automatic weapon you must pull the trigger each time you want to fire. An automatic weapon will fire as long as you hold the trigger, until you run out of ammunition.\nConroe Police Department’s Lt. Dorcy McGinnis told the Conroe newspaper, “There was a lot of gunfire. She reported the store’s windows were broken out from the “bullet spray.”\nTexas’ “Castle Doctrine” laws allow a business owner or employee to have a weapon for self-defense and to use that weapon to protect their life and the lives of others.\nTurner’s store had previously been robbed in 2014 when a group of men smashed through the glass door with a sledgehammer. At that time, Dominguez reported, one of the employees grabbed a shotgun and the would-be robbers said, “They’ve got guns. Let’s get out of here.”\nThe store employees were able to successfully stop the robbery and protect the lives of other employees and customers who were threatened by the armed gunmen.\nA search for the suspects, which included support from a Drug Enforcement Agency helicopter, was not successful and the police manhunt continues. It has not been reported if any of the other suspects were injured in the hail of gunfire.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2016/10/04/texas-store-employee-uses-ak-47-stop-4-armed-robbers/"}
