{"authors":["Logan Churchwell"],"date_download":"2018-10-30 18:14:51","date_modify":"2018-10-30 18:14:51","date_publish":"2017-02-22 16:33:08","description":"Texas lawmakers and officials endorsed a bill that would make permanent a voter ID “safety net” allowing those without ID to cast a ballot.","filename":"data/vaneerConsumption/TexasLawmakersFasttrackVoterIDExpansion.json","image_url":"https://media.breitbart.com/media/2016/02/TX-Photo-Voter-ID-e1432914617861.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_02_22__1540923291.html","title":"Texas Lawmakers Fast-track Voter ID Expansion","title_page":"Texas Lawmakers Fast-track Voter ID Expansion","title_rss":"NULL","source_domain":"breitbart.com","text":"Leading Texas Republican lawmakers and officials publicly endorsed a bill that would make permanent a voter ID “safety net” allowing those without proper documentation to cast a regular ballot if they sign an affidavit.\nSenate Bill 5, filed by Houston area Senator Joan Huffman, would allow voters without driver’s licenses, passports, and other prescribed documents to cast a regular ballot at the polling place if they sign a declaration of impediment explaining their reason for noncompliance and provide a pre-approved, alternative form of identification. The bill would allow voters to claim lacking transportation, work schedule conflicts, lost/stolen IDs, disability, and other specified reasons on the form. In lieu of a photo ID, citizens are expected to provide a birth certificate, government document, or a bank statement.\nThe bill notes that any person who lies on the form could face a third-degree felony charge.\nMissing from the list of “impediments” a voter may claim under SB 5 that was previously available in 2016 is the “Other” option. Lawmakers tell Breitbart Texas that this omission is intended to curb abuse of the form.\nHuffman’s legislation also provides for additional voter assistance assets to be deployed throughout the state upon request. The Secretary of State would be required to design a voter ID mobile unit program in concert with the Texas Department of Public Safety for dispatch to community events or at the request of constituent groups at no charge. In years prior, State and DPS have sent similar mobile employees to regions of the state with high-density student populations or more rural areas without state offices.\nThe reform package comes days after an investigation by the Associated Press revealed that of the more than 13,000 similar affidavits signed during the 2016 Election, 500 and counting were improperly used. County officials reported scores of cases where voters refused to show ID, despite their admitted possession of an acceptable one, according to a previous Breitbart Texas report. Tarrant County and others are reportedly considering referrals to prosecutors where voters apparently abused the safety net.\nLieutenant Governor Dan Patrick’s decision to grant priority status to the bill is expected to clear many procedural roadblocks it might have otherwise faced. The legislation now maintains 19 co-authors.\nTexas Attorney General Ken Paxton lauded the bill, noting that the reform package would “make the changes necessary to comply with the Fifth Circuit ruling while ensuring the integrity of the voting process,” according to a prepared statement.\nPublic Interest Legal Foundation President and former Justice Department attorney J. Christian Adams praised the effort, adding that “making permanent the ‘safety net’ like the bill calls for will help those in genuine need and place strict penalties for those that wish to abuse it.” Adams previously told Breitbart Texas that if lawmakers “punted” on “strengthening the affidavit process, it [would] only engender a new breed of illegal behavior” and leave local election officials vulnerable to partisan lawsuits if they tried to report perjury cases on their own.\nDuring the 2015 legislative session, lawmakers unanimously approved SB 983, which made obtaining official copies of birth certificates free of charge to voters in need. Under SB 5, any Texan with a birth certificate in hand, yet lacking a photo ID could cast a regular ballot. The reform also would allow voters over age 70 to use an expired photo ID.\nBreitbart Texas previously reported in July 2016 that the U.S. Fifth Circuit Court of Appeals partially reversed a lower court’s finding that Texas’ voter ID law was crafted with discriminatory intent and effects, targeting minority residents. The judges found that while Texas’ intent to protect the ballot box from fraudulent behavior was reasonable, the mechanics of the law could unnecessarily sideline some voters without some concessions like seen in other states. The en banc panel returned the case to the district court in Corpus Christi “to ensure the implementation of an interim remedy for SB 14’s discriminatory effect that disrupts voter identification rules for the 2016 election season as little as possible, yet eliminates the [Voting Rights Act] Section 2 discriminatory effect violation.”\nIn August 2016, Breitbart Texas reported that U.S. District Court Judge Nelva Gonzales Ramos, an Obama appointee, inked an agreement between the State and the various defendants to allow for a “reasonable impediment declaration” be offered to voters in need. The core architecture of the August agreement appears to be transferred into SB 5.\nLogan Churchwell is a founding editor of the Breitbart Texas team. You can follow him on Twitter @LCChurchwell. He also serves as the communications director for the Public Interest Legal Foundation.","url":"https://www.breitbart.com/border/2017/02/22/texas-lawmakers-fast-track-voter-id-expansion/"}
