{"authors":[],"date_download":"2018-10-22 22:26:38","date_modify":"2018-10-22 22:26:38","date_publish":"2014-05-09 20:42:54","description":"Robert James Campbell is due to be executed next week — the first lethal injection since a debacle in Oklahoma last month.","filename":"data/vaneerConsumption/TexasJudgeReluctantlyDeniesStayofExecutionforRobertCampell.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/432976/140509-alejandra-rendon-1602_0fa742dc592981920c921678186ff8c6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_texas-judge-reluctantly-denies-stay-execution-robert-campell-n101811_1540247198.html","title":"Texas Judge Reluctantly Denies Stay of Execution for Robert Campell","title_page":"Texas Judge Reluctantly Denies Stay of Execution for Robert Campell","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA federal judge has reluctantly rejected a Texas inmate's bid to stop his lethal injection because the state won't disclose where it got the drugs, saying his hands were tied because of higher court rulings.\nBut in a two-page ruling, district judge Kenneth Ellison said a botched execution in Oklahoma two weeks ago \"requires sober reflection on the manner in which this nation administers the ultimate punishment.\"\nEllison's denial of a stay of execution for Robert James Campbell brought relief to his victim's family and outrage from his lawyers.\n\"I don't know if the execution will give us closure, but I'm hoping it will,\" said Israel Santana, cousin of Alejandra Rendon, the 20-year-old bank teller Campbell was convicted of raping and murdering in 1991.\nIf Campbell, 41, is executed on Tuesday, he will become the first U.S. prisoner put to death since last month's debacle in Oklahoma in which Clayton Lockett appeared to regain consciousness and writhe in pain.\nIn court papers, Campbell had cited Lockett's execution — which prompted the White House to order a federal review of state execution procedures — in asking for a reprieve.\nHe noted that like Oklahoma, Texas keeps the source of its execution drugs under wraps, blocking inmates from investigating whether the drugs were properly prepared.\nEllison, in his ruling, urged the U.S. Fifth Circuit Court of Appeals to reconsider previous rulings that upheld drug-secrecy and seemed \"to shield crucial elements of the execution process from open inquiry. \"\nNevertheless, he said, those rulings prevented him from halting Campbell's execution.\nThe outcome was cheered by Rendon's family, who were worried that the Oklahoma botch might buy Campbell more time.\n\"As far as the execution being cruel and inhumane, I don't see that,\" said Santana, a criminal defense lawyer. \"What she was put through was cruel and inhumane.\n\"I would love to tell Robert Campbell: Would you like to be put to sleep or would you rather be brutally raped and shot? My cousin was not given a choice. Nobody can even fathom the terror she went through.\"","url":"https://www.nbcnews.com/storyline/lethal-injection/texas-judge-reluctantly-denies-stay-execution-robert-campell-n101811"}
