{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:16:07","date_modify":"2018-10-30 20:16:07","date_publish":"2017-01-07 17:51:46","description":"A Texas state lawmaker has pre-filed a bill that would criminalize dismemberment abortions. The criminal penalty would be a state jail felony.","filename":"data/vaneerConsumption/TexasBillWouldCriminalizeDismembermentAbortions.json","image_url":"https://media.breitbart.com/media/2017/01/GettyImages-454438579-640x407.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_01_07__1540930567.html","title":"Texas Bill Would Criminalize Dismemberment Abortions","title_page":"Texas Bill Would Criminalize Dismemberment Abortions","title_rss":"NULL","source_domain":"breitbart.com","text":"A Texas state lawmaker has pre-filed a bill that would criminalize dismemberment abortions. If the law passes, it would be a crime for an abortion doctor to surgically dismember and extract a living baby while in the womb. The criminal penalty would be a state jail felony.\nMoreover, pursuant to the express provisions of Senate Bill 415, a state executive or administrative official may not decline to enforce the law, or “adopt a construction” of this law that “narrows its applicability, based on the official’s own beliefs concerning the requirements of the state or federal constitution.” The bill is authored by state Senator Charles Perry (R-Lubbock).\nUnder the law, a woman on whom a dismemberment abortion is performed, or an employee or agent of the physician, would not be subject to criminal penalties.\nA dismemberment abortion performed when “necessary in a medical emergency,” would not be a crime.\nThe bill defines “dismemberment abortion” as:\nan abortion in which a person, with the purpose of causing the death of an unborn child, dismembers the unborn child and extracts the unborn child one piece at a time from the uterus through the use of clamps, grasping forceps, tongs, scissors, or a similar instrument that, through the convergence of two rigid levers, slices, crushes, or grasps, or performs any combination of those actions on, a piece of the unborn child’s body to cut or rip the piece from the body. The term does not include an abortion that uses suction to dismember the body of an unborn child by sucking pieces of the unborn child into a collection container. The term includes a dismemberment abortion that is used to cause the death of an unborn child and in which suction is subsequently used to extract pieces of the unborn child after the unborn child’s death.\n“Each year in Texas, more than a thousand lives are ended by dismemberment abortions. As a society we should not allow a practice that literally pulls a living child apart in the womb,” said Senator Perry. “We know that children in the womb are capable of feeling pain, prohibiting this practice is long overdue.”\nAccording to a statement obtained by Breitbart Texas from Senator Perry’s office, six states have passed legislation to prohibit dismemberment abortion.\nSen. Perry’s Senate Bill 415 provides that nothing in the bill can be construed to create or recognize a right to abortion, or to a particular method of abortion.\nIf passed by the 2017 85th Texas Legislature, it would go into effect on September 1, 2017.\nIf the law is passed and later challenged in court, the express provisions of the bill make clear that the Legislative intent is to have it construed as a matter of state law:\nto be enforceable to the maximum possible extent consistent with but not further than federal constitutional requirements, even if that construction is not readily apparent, as such constructions are authorized only to the extent necessary to save the subchapter from judicial invalidation.\nIt also states that any judicial reformation of the language in the statute is “explicitly authorized only to the extent necessary to save the statutory provision from invalidity.” A state court must interpret the law in a way to avoid any constitutional vagueness problem and “shall enforce the provision to the maximum possible extent.”\nIf a federal court later finds any provision in the law to be unconstitutionally vague, and declines to impose the saving construction of the statute, then the Supreme Court of Texas shall provide a construction that avoids a constitutional problem while enforcing the statute’s restrictions “to the maximum possible extent.”\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nTexas Senate Bill 415 by Senator Charles Perry by lanashadwick on Scribd","url":"https://www.breitbart.com/border/2017/01/07/texas-bill-would-criminalize-dismemberment-abortions/"}
