{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:21:14","date_modify":"2018-10-30 21:21:14","date_publish":"2015-04-23 13:30:24","description":"A North Texas teen acted in self-defense when he was being bullied in the school showers. He was suspended for his actions. Now, his parents, upset over that suspension, filed a lawsuit against the school district.","filename":"data/vaneerConsumption/TexasBullyingVictimGetsSuspendedfromSchoolforDefendingSelfParentsSue.json","image_url":"https://media.breitbart.com/media/2015/04/Hebron-High-School-Baylor-University-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_04_23__1540934474.html","title":"Texas Bullying Victim Gets Suspended from School for Defending Self, Parents Sue","title_page":"Texas Bullying Victim Gets Suspended from School for Defending Self, Parents Sue","title_rss":"NULL","source_domain":"breitbart.com","text":"A North Texas teen acted in self-defense when he was being bullied in the school showers. He was suspended for his actions. Now, his parents, upset over that suspension, filed a lawsuit against the school district.\nIn the Dallas suburb of Carrollton, Scott and Karen Pittman are taking legal action against the Lewisville Independent School District (ISD) over what they believe was their son’s wrongful suspension, according to WFAA 8.\nThe Pittmans were perplexed and horrified when their son called home frantically for his mother’s help after he was urinated upon while a second boy spit on his face and body in the showers at Hebron High School on March 19. In an act of self-defense, the teen said he hit both alleged offenders to try and get away. The Pittmans told WFAA 8 that all of the teens involved, including their son, were suspended for fighting.\n“He’s the victim, and they will not hear that at all,” Scott Pittman said.\nHe and his wife called this an act of bullying and said that it had happened before to their son at school. They argued that their son, a straight-A student with no record of trouble, was trying to get away from danger and should not have a suspension on his permanent record. They were equally concerned that the school did not keep their son safe from danger.\nZero tolerance policies have changed all the rules in school. It no longer matters who started the fight. The Student Code of Conduct, the school’s behavioral bible, stipulates every move K-12 youngsters may or may not make throughout their schooling day. The document was built on the state’s 1995 Safe Schools Act and Chapter 37 of the Texas Education Code, which does make a provision for “self defense” in line item 37.001 (a)(4)(A). Bullying is included as a consideration to lift the suspension under 37.0001 (a)(7) but was not applied in this case.\nIt is impossible to know why not. School officials are not talking because of the federal law called the Family Education Rights & Privacy (FERPA) Act, which is meant to protect a student’s privacy and therefore, prohibits details to be released, sometimes even to a student’s parents. WFAA 8 also cited the pending litigation as the other reason.\nThe school did issue a statement: “Based upon the findings of an investigation, we followed the discipline clearly laid out in our Student Code of Conduct.”\nThe Pittmans had a legitimate concern over their son’s permanent record. In Texas, the Public Education Information Management System (PEIMS), a longitudinal database, tracks its student population. A 2011 Texas A&M University study identified that 30 percent of Texas students in grades 7-12 received an out-of-school suspension (OSS), while 15 percent were suspended or expelled at least 11 times, according to the Dallas Morning News. Education Commissioner Michael Williams called this rate too high.\nMost school disciplinary actions taken are discretionary, which means they are predicated on an administrator’s judgment call versus a decision based on a serious crime like bringing a weapon on campus. Breitbart Texas has reported on the school-to-prison pipeline, the unfortunate end result of these zero tolerance policies that breed never-ending instances of behavior-on-trial. Most affected are boys.\nIn March, the Washington Post reported on such a case. An 11-year-old Virginia boy in a gifted and talent program was suspended for one year when an assistant principal mistakenly identified a leaf in the boy’s backpack as marijuana. The school official(s) used discretionary action to force the youngster to attend its District Alternative Education Program (DAEP), a setting for behavioral management, during that year away from the classroom. It turned out that the tree leaf tested negative for marijuana three times. This resulted in the juvenile court dropping its case against the innocent 6th grader.\nLast year, a Bryan ISD high school senior in Central Texas got up to do the right thing in assisting a special needs friend who was being roughed up by some other boys, KBTX 3 reported. For his Good Samaritan bully-intervention actions, 18-year-old Christian Tumax was not heralded as a hero. He was suspended.\nThe Pittmans indicated that the lawsuit was pursued as a last resort. The district continued to maintain its position.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/04/23/texas-bullying-victim-gets-suspended-from-school-for-defending-self-parents-sue/"}
