{"authors":["Sarah Rumpf"],"date_download":"2018-10-30 20:20:04","date_modify":"2018-10-30 20:20:04","date_publish":"2015-03-17 16:08:01","description":"On Monday, the Texas House passed on second reading HB 10, an omnibus anti-human trafficking bill, with a unanimous, bipartisan vote. The bill still needs a third reading but is expected to easily pass Tuesday morning and will be the first bill passed by the House this Session. |","filename":"data/vaneerConsumption/TexasHouseApprovesAntiHumanTraffickingBill.json","image_url":"https://media.breitbart.com/media/2015/02/DSC_0596-1024x678.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_03_17__1540930804.html","title":"Texas House Approves Anti-Human Trafficking Bill","title_page":"Texas House Approves Anti-Human Trafficking Bill","title_rss":"NULL","source_domain":"breitbart.com","text":"The Texas House has passed HB 10, an omnibus anti-human trafficking bill. The bill passed on second reading on Monday and then third reading Tuesday morning. Both votes were unanimous and bipartisan.\nHB 10, was brought forward by a large bipartisan coalition of House Members, authored by Rep. Senfronia Thompson (D-Houston), Rep. Todd Hunter (R-Corpus Christi), Rep. Oscar Longoria (D-Mission), Rep. Tan Parker (R-Flower Mound), and Rep. Patricia Harless (R-Spring), and co-authored by Rep. Dwayne Bohac (R-Houston), Rep. Greg Bonnen (R-Friendswood), Rep. Angie Chen Button (R-Richardson), Rep. Byron Cook (R-Corsicana), Rep. Tony Dale (R-Cedar Park), Rep. Sarah Davis (R-West University Place), Rep. Marsha Farney (R-Georgetown), Rep. Allen Fletcher (R-Cypress), Rep. Mark Keough (R-The Woodlands), Rep. Phil King (R-Weatherford), Rep. Will Metcalf (R-Conroe), Rep. Rick Miller (R-Sugar Land), Rep. Sergio Muñoz, Jr. (D-Palmview), Rep. Dade Phelan (R-Beaumont), Rep. Debbie Riddle (R-Tomball), Rep. Phil Stephenson (R-Wharton), Rep. Hubert Vo (D-Houston), and Rep. James White (R-Woodville).\nHB 10 adds or amends several existing laws to make it easier to prosecute human trafficking and forced prosecution, and to provide additional resources to victims. The law is especially targeted to address child trafficking and includes several measures to provide additional protections and resources for child victims.\nOne key change is eliminating the statute of limitations for compelling prostitution of children. Previously, an indictment had to be brought within ten years of the child victim’s 18th birthday. HB 10 also gives prosecutors the ability to compel testimony from offenders, in exchange for immunity from prosecution. This is a useful tool for prosecutors to get valuable testimony from an accomplice to use against another more serious offender.\nThe bill also requires sex offender registration for anyone convicted of second-degree felony prostitution of a child, expands the eligibility for victims of child trafficking to receive compensation from the state’s crime victims compensation fund, requires judicial training to include information about human trafficking, and requires the Texas Education Agency to develop policies on reporting child trafficking.\nThe other two major functions of HB 10 are to create a Child Sex Trafficking Prevention Unit, which will fall under Governor Greg Abbott’s Criminal Justice Division and coordinate efforts between state agencies, and to extend the expiration date for the Human trafficking prevention task force until September 2017 and expand its mission.\nAfter HB 10 passed, Speaker Joe Straus (R-San Antonio) posted a tweet calling the vote “an important step toward ending the horrible crime of human trafficking.” Breitbart Texas reached out to Straus for additional comment.\n“Today the House united to stand with law enforcement, prosecutors, faith-based groups and others working to eradicate human trafficking,” said Straus. “Ms. Thompson has provided outstanding leadership on this issue and the House looks forward to working with the Senate to ensure that House Bill 10 becomes law.”\nBreitbart Texas’ Bob Price was on the House floor when HB 10 passed third reading. “It was great to see a bipartisan effort on such an important piece of legislation,” said Price. “Texas has unfortunately become a hub of human trafficking and this bill will strengthen Texas law on this issue.”\nFollow Sarah Rumpf on Twitter @rumpfshaker.","url":"https://www.breitbart.com/border/2015/03/17/texas-house-passes-anti-human-trafficking-bill/"}
