{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:55:49","date_modify":"2018-10-30 19:55:49","date_publish":"2016-12-28 18:49:00","description":"A Texas lawmaker has pre-filed a bill that will broaden the places a LTC holder can enter.","filename":"data/vaneerConsumption/TexasLawmakerPushesforReductionofGunFreeZones.json","image_url":"https://media.breitbart.com/media/2016/01/concealed-carry-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_12_28__1540929349.html","title":"Texas Lawmaker Pushes for Reduction of Gun-Free Zones","title_page":"Texas Lawmaker Pushes for Reduction of Gun-Free Zones","title_rss":"NULL","source_domain":"breitbart.com","text":"A Texas state lawmaker has pre-filed a gun bill that if passed, will broaden the places a licensed to carry (LTC) holder can enter and would bring the State closer to “constitutional carry,” the author says. He hopes to eliminate all “gun-free zones.”\nTexas State Representative Drew Springer, Jr. (R-Muenster) prefiled H.B. 560 that amends Texas Penal Code 30.06(e) to delete section 46.03 titled “Places Weapons Prohibited.”\nIt also amends 30.06(e) to delete reference to section 46.035 of the Texas Penal Code titled “Unlawful Carrying of Handgun by License Holder.”\nThe bill applies to the places where a person may carry a handgun if they hold a LTC as well as addresses certain related criminal offenses. It makes all government property open to gun owners, the author says. It also opens up hospitals and amusement parks to LTC holders.\nThe bill would not change a private property owner’s right to prohibit a licensed holder from entering the property upon proper legal notice as defined in section 30.06.\nRep. Springer told Breitbart Texas that licensed holders are substantially less likely to use guns or commit a crime. He also said he believes that it is “crazy” for a hospital to prohibit the lawful carrying by a licensed holder when there are no metal detectors at the facility.\nThe bill also adds to the 30.06 offense provision that relates to a school or educational institution, specifically the phrase “‘the portion of’ any grounds or building on which an activity sponsored by a school or educational institution is being conducted.” It does the same for the provision relating to the premises of an institution of higher education. It clarifies that the prohibition against carrying a firearm or prohibited weapon on the physical premises of a school or educational institution, including an institution of higher education, only applies to the part of (“portion of“) the grounds or building on which an activity sponsored by the school or educational institution is being conducted.","url":"https://www.breitbart.com/border/2016/12/28/texas-lawmaker-pushes-reduction-gun-free-zones/"}
