{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 20:08:13","date_modify":"2018-10-30 20:08:13","date_publish":"2015-12-04 15:22:31","description":"Texas Governor Greg Abbott (R) went to Cuba this week and failed to meet any of Cuba's political dissidents or human rights activists.","filename":"data/vaneerConsumption/TexasGovernorGregAbbottRDefectstoCuba.json","image_url":"https://media.breitbart.com/media/2014/12/Blue-State-Blues.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_04__1540930093.html","title":"Texas Governor Greg Abbott (R) Defects to Cuba","title_page":"Texas Governor Greg Abbott (R) Defects to Cuba - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas Governor Greg Abbott (R) went to Cuba this week to promote his state’s economic interests and the Obama administration’s new policy of engagement with the regime. He failed to meet, or seek, any of Cuba’s political dissidents or human rights activists.\nAs Bob Price of Breitbart Texas reported, “Abbott said he met with business leaders, small business owners and entrepreneurs, Cuba’s minister of foreign trade, and the vice president of Cuba.” But when asked directly about meeting with dissidents, the Texas governor tried to fudge his answer, saying that he had met with people with an entrepreneurial spirit.\nNo, that’s not the same.\nAbbott’s job, as he sees it, is “to look for potential opportunities and help Texas businesses capitalize on them.” But he also has a moral obligation to stand up for freedom, human rights, and democracy–and not to aid and abet the tyrants who are using the new U.S. policy to enrich themselves while continuing to arrest dissidents, persecute opposition, and promote anti-American hatred.\nIt is true that half a century of hostility has not produced regime change in Cuba. It is also true that the Obama administration’s new policy probably won’t, either.\nIn fact, quite the opposite: instead of promoting freedom in Cuba, the new policy is damaging freedom in America.\nFor example, The Obama administration is doing everything it can to lift restrictions on Cuba through executive action that bypasses Congress and flouts the Constitution. The Castro regime is cheering him on, and demanding more.\nWe are getting nothing in return for re-establishing relations with Cuba. Instead, our leaders are debasing themselves in front of the regime.\nSecretary of State John Kerry declined to invite dissidents to the re-opening of the U.S. embassy in Havana, where he gushed: “I feel very much at home here”–in a country whose residents cannot leave.\nMeanwhile, Cuba continues warm relations with America’s enemies, such as Iran, and sends goons to Venezuela to defend the anti-American regime against democratic protests.\nAbbot effectively endorsed Obama’s policy by traveling to Cuba.\nNo, it is not the Texas governor’s job to conduct foreign policy. But he does not need to give his stamp of approval to a policy that is undermining America’s ideals and helping our enemies.\nPrice, speaking to Gov. Abbott on a conference call with other reporters, asked Gov. Abbott about human rights in Cuba, and the governor assured everyone that the issue was very important to him.\nThat came as something of a surprise, because in five glowing press releases from Abbott’s office during the Cuba trip, there was no mention of human rights in Cuba whatsoever.\nThere, were, however a few other gems Abbott’s office was eager to share.\nThe governor dined, for example, at La Fontana Paladar, where Beyoncé and Jay-Z celebrated their fifth wedding anniversary. He also gave autographed Nolan Ryan baseballs to Cuban regime officials “as a sign of friendship.” He also joked: “The last two days we’ve been leaving a lot of cash in Cuba.”\nIt wasn’t all fun and games. “Texas has an abundance of (rice and other products), and a very easy ability to export from Texas to Cuba,” Abbott told his hosts.\nThat was the real business of the trip, for which Texas agricultural interests are, no doubt, grateful–though he did inform Cuban officials that lifting the remaining U.S. embargo is “not my job” as governor.\nBut as for human rights, democracy, and national security–well, amidst the lavish dinners and baseballs and cash, those topics just didn’t come up.\nThere was this curious tidbit in a pool report distributed by Abbott’s press office: “…there is little political risk, outside certain Cuban-American circles, still mostly concentrated in Florida, in the move toward closer economic relations with Cuba.”\nAs if the cause of human rights in Cuba is just another special interest. Like Texas rice.\nBefore he left for Cuba, Abbott said: “Opening the door to business with Texas will expand free enterprise and the freedom that flows from it.”\nOnce there, he happily obeyed the regime’s rules.","url":"https://www.breitbart.com/politics/2015/12/04/blue-state-blues-texas-governor-greg-abbott-defects-to-cuba/"}
