{"authors":["Merrill Hope"],"date_download":"2018-10-30 20:55:21","date_modify":"2018-10-30 20:55:21","date_publish":"2014-12-11 15:16:14","description":"US Secretary of Education Arne Duncan and Health and Human Services (HHS) Secretary Sylvia Burwell jointly announced on Wednesday, December 10 that 18 |","filename":"data/vaneerConsumption/TexasGets30MPreKConsolationPrizeFromFeds.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/12/11/Money.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_12_11__1540932921.html","title":"Texas Gets $30M Pre-K Consolation Prize From Feds","title_page":"Texas Gets $30M Pre-K Consolation Prize From Feds | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"US Secretary of Education Arne Duncan and Health and Human Services (HHS) Secretary Sylvia Burwell jointly announced on Wednesday, December 10 that 18 states were awarded preschool development and expansion grants totaling more than $226 million under the Preschool Development Grants that was part of the Obama administration’s Pre-K for All initiative originally announced during the President’s 2013 State of the Union address.\nTexas was not a winner of the big prize that would have garnered up to $120 million over four years for universal preschool.\nIn September, Commissioner of Education Michael Williams applied for the Big Pre-k grant competition that raised concerns for some Texans about student privacy, data-collection, and Common Core. Williams had promised he would only file for a grant that was in line with Texas values, Breitbart Texas reported.\nTexas did not walk away empty handed, though.\nHHS announced awards for Early Head Start-Child Care Partnership and Early Head Start Expansion grants designated for expanding and improving preschool.\nThe feds granted Texas programs approximately $30 million. The largest chunk of government dollars will go to San Antonio and Edinburg, each receiving $7.4 million. Dallas is set to get $4.2 million, followed by New Caney ($2.6 million), Bastrop ($1.6 million), Bellaire ($1.5 million), Houston ($1.5 million), Austin ($1.2 million), Crowell ($1.1 million), Fort Worth ($900,000), Laredo ($700,000), and Lubbock ($500,000).\nFrom the 36 applications received, five states will be awarded pre-k development grants: Alabama, Arizona, Hawaii, Montana and Nevada. Thirteen willreceive expansion grants: Arkansas, Connecticut, Illinois, Louisiana, Maine, Maryland, Massachusetts, New Jersey, New York, Rhode Island, Tennessee, Vermont and Virginia, according to the press release issued by the US Education Department.\nThe grants were part of more than $1 billion in new federal and private sector investments in early childhood education announced by President Obama during the White House Summit on Early Education, which also took place on December 10.\nThe President also announced Invest in US, a new public awareness campaign promoting public/private partnerships to build cradle-to-kindergarten “high quality” early education geared focused on school readiness, higher achievement and workforce preparedness.\nIt is in partnership with the First Five Years Fund, whose influential investors include the Bill and Melinda Gates Foundation, the premiere financier of the Common Core State Standards. Also on the list are the Buffett Early Childhood Fund, George Kaiser Family Foundation, WK Kellogg Foundation, Pritzker Children’s Initiative, David and Lucille Packard Foundation, and Heising-Simons Foundation.\nEarly Head Start is the pre-preschool version of Head Start. Head Start’s Program Standards or the National Institute for Early Education Research are cited as the program’s benchmarks, Breitbart Texas reported. This kind of pre-K also comes with a mandate for voluntary home visits.\nBreitbart News reported that Head Start findings have been dismal, showing no real lasting benefits.\nIn contrast to Big Pre-k, Texas Governor-elect Greg Abbott’s Educating Texans intends to take a more modest approach to pre-K through grade 3, improving existing programs and not just expanding them.\nThe plan points out that “while there is some evidence to suggest that high-quality pre-k increases a child’s chances of succeeding … high quality is far from universal.”\nFollow Merrill Hope on Twitter @OutOfTheBoxMom","url":"https://www.breitbart.com/border/2014/12/11/Texas-Gets-30M-Pre-K-Consolation-Prize-From-Feds/"}
