{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:02:33","date_modify":"2018-10-30 19:02:33","date_publish":"2017-01-12 16:53:02","description":"Texas House leadership is calling on the federal government to reimburse the State for the costs incurred to secure the Texas-Mexico Border.","filename":"data/vaneerConsumption/TexastoFedsReimburseUsfor28BinBorderSecurityExpenses.json","image_url":"https://media.breitbart.com/media/2016/11/DPS-Gunboats-on-RG-River.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_01_12__1540926153.html","title":"Texas to Feds: Reimburse Us for $2.8B in Border Security Expenses","title_page":"Texas to Feds: Reimburse Us for $2.8B in Border Security Expenses","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas House leadership wasted no time in calling on the federal government to reimburse the State for the costs–to the tune of $2.8 billion–incurred as a result of the Obama Administration’s failure or refusal to secure the Texas-Mexico Border.\nOn its second day of the 85th Legislative session, Texas State Representative Dennis Bonnen (R-Angleton) called on the federal government to reimburse the State for the billions that Texas taxpayers have had to pay as a result of inadequate border security seen during the Obama Adminstration. Rep. Bonnen serves as chairman of the Texas House Ways and Means Committee and Speaker Pro Tempore.\n“For years, Texas has stood in the gap where the federal government has failed,” Bonnen told Breitbart Texas on Wednesday evening. “With a new administration coming into office, we hope the tide will turn and Washington will do its duty, so that Texas can devote its limited resources to priorities reserved to the states under federalism.”\n“We have an obligation each session to look at every dime spent on border security and see what is working and what is not,” the chairman continued. “We will not sacrifice the safety and security of our citizens, and we will need some assurances that Washington is doing things differently.”\nTexans have had to shoulder the burden of stopping drug traffickers, human smugglers and those trying to smuggle weapons.\n“Today we make one final request of the Obama Administration: do your constitutional duty and reimburse Texas for your failure to secure the border,” Bonnen said in a written statement obtained by Breitbart Texas. “The drug epidemic, the growing sex trade and the surge in unaccompanied minors stem from a crisis of lawlessness on our southern border.”\n“Texas is proud to have gone beyond the call of duty in defending America’s border, but we have done so at great cost to our taxpayers,” said Rep. Tan Parker (R-Flower Mound). “If the Obama Administration refuses to meet our request, we are hopeful President-elect Trump will give it due consideration so that we can make our communities, schools and hospitals whole.”\nThe figures provided by Rep. Bonnen show that the State of Texas and local jurisdictions have been forced to spend almost $3 billion for border security operations; incarceration of criminal aliens; healthcare; education; and Texas Alcoholic Beverage Commission costs. The largest expense was to the Texas Department of Public Safety (DPS), coming in at $1,410,563,257.\nBy the Numbers\nThe Texas Parks and Wildlife Department has been forced to incur $20,268,215, and Texas Military Forces have spent almost $63,000 in border-related costs.\nTexas taxpayers have had to pay for education expenses to the tune of $181,185,708, and healthcare through the Texas Health and Human Services Commission, reaching $416,882,000.\nThe incarceration of criminal aliens in county jails cost Texans $265,563,826, but the Texas Department of Criminal Justice costs reached $463,278,833.\nThe call for reimbursement comes at a time when the State is facing a tighter budget.\nBreitbart Texas reported in June 2015 when Governor Greg Abbott signed what is claimed to be the toughest and most comprehensive border security plan of any state in the U.S. The legislative package provided historic levels of funding to secure the border, established a Child Sex Trafficking Prevention Unit, strengthened penalties for human traffickers, and increased funding for the border protection unit, and funded the anti-gang program. There are more than 20,000 dangerous gang members associated with cross-border crime traffic. The legislation also sought reimbursement from the federal government for monies Texans spent on border issues. The entire package was expected to cost the taxpayers over $800 million.\nGovernor Abbott declared the plan a legislative priority and one of his emergency legislative items during his 2015 State of the State address. The $800 million proposal doubled the 2013 biennium spending bill.\nPrevious administrations in the Lone Star State have also appealed to the federal government for reimbursement. Former Governor Rick Perry asked in 2011, but did not receive $349 million, reported the San Antonio Express-News.\nState leaders announced last summer a request to spend an additional $1 billion on border security. The budget was to be developed during the 2017 85th legislative session. During a briefing to a small number of journalists in December, Governor Abbott suggested that the Trump Administration’s pledge to secure the border could positively impact the State’s need to continue the spending at such high levels.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.","url":"https://www.breitbart.com/border/2017/01/12/texas-feds-reimburse-us-2-8b-border-security-expenses/"}
