{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:41:07","date_modify":"2018-10-30 20:41:07","date_publish":"2015-12-28 17:40:29","description":"Texas Governor Greg Abbott has declared a state of disaster for Texas counties affected by severe weather.","filename":"data/vaneerConsumption/TexasGovernorDeclaresStateofDisaster.json","image_url":"https://media.breitbart.com/media/2015/12/AP_169066026399.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_12_28__1540932067.html","title":"Texas Governor Declares State of Disaster","title_page":"Texas Governor Declares State of Disaster","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas Governor Greg Abbott has declared a state of disaster for Texas counties affected by severe weather.\nThese counties include counties in the northern part of the state hit by severe winds, storms, and tornadoes. As reported by Breitbart Texas, at least eleven are dead after tornadoes hit Texas near Dallas. The deadly storms left massive destruction in their wake and officials are still assessing the damage and death toll. Thousands of Texans were left without power.\nThe declaration applies to the following counties in Texas: Collin, Dallas, Ellis, and Rockwall counties.\nThe Texas Governor received a briefing from the Department of Public Safety’s State Operations Center and Breitbart Texas obtained a video from the press conference.\nThe Governor reiterated weather reports that the possibility of more tornadoes was not over.\nThe disaster proclamation authorizes “the use of all available resources of state government and of political subdivisions that are reasonably necessary to cope with this disaster.” As can be seen in the video of the Governor’s press conference, the Texas State Guard and the National Guard are included in these resources.\nThe Governor’s proclamation further provides, that “any regulatory statute prescribing the procedures for conduct of state business or any order or rule of a state agency that would in any way prevent, hinder or delay necessary action in coping with this disaster shall be suspended upon written approval of the Office of the Governor. However, to the extent that the enforcement of any state statute or administrative rule regarding contracting or procurement would impede any state agency’s emergency response that is necessary to protect life or property threatened by this declared disaster, I hereby authorize the suspension of such statutes and rules for the duration of this declared disaster.”\nCopies of the proclamation was filed with the applicable authorities.\nIn a statement received by Breitbart Texas, Abbott said, “Our heartfelt thoughts and prayers go out to those Texans who have been affected by this severe weather. “Please be assured that Texas is doing everything it can to assist in the challenges our citizens are currently facing.”\nGovernor Abbott added, “I want to thank the first responders and local officials on the ground and strongly encourage all Texans to heed their warnings in the coming the days.”\nAs reported by Breitbart Texas, winter storm Goliath is being called a historic blizzard. The storm is continuing to march across Texas leaving highways and roadways closed, snowdrifts that are massive, and power outages. Up to 16 inches of snow has been reported in Midland, Texas in west Texas, eastern New Mexico, and the Texas panhandle. Drifts of up to six feet have been reported in various locations across the region.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2015/12/28/texas-governor-declares-state-disaster/"}
