{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:43:14","date_modify":"2018-10-30 22:43:14","date_publish":"2014-08-14 20:04:13","description":"Yep, this has to be the strangest horror movie prequel idea I've ever heard of. Looks like the Texas Chainsaw Massacre franchise is going to pull a Psycho /A&E's Bates Motel with its main character Leatherface — y'know, Jed Sawyer, the guy that…","filename":"data/vaneerConsumption/TexasChainsawMassacreSequelHastheStrangestPlotIdeaoftheEntireFranchise.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/03cbb6df-b334-4d19-b70d-503c4d8fdb39.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35835-texas-chainsaw-massacre-sequel-has-the-strangest-plot-idea-of-the-entire-franchise_1540939394.html","title":"'Texas Chainsaw Massacre' Sequel Has the Strangest Plot Idea of the Entire Franchise","title_page":"'Texas Chainsaw Massacre' Sequel Has the Strangest Plot Idea of the Entire Franchise","title_rss":"NULL","source_domain":"bustle.com","text":"Yep, this has to be the strangest horror movie prequel idea I've ever heard of. Looks like the Texas Chainsaw Massacre franchise is going to pull a Psycho /A&E's Bates Motel with its main character Leatherface — y'know, Jed Sawyer, the guy that wears a mask made of human skin and kills people with a chainsaw? Him! — and will produce a Texas Chainsaw Massacre prequel focusing on Leatherface's teen years as the next film installment.\nIt will, according to The Wrap , be titled Leatherface, and will take place when he's just a young teen in the 1970s going through normal teen problems: Acne, dating, school, and resisting the urge to take a chainsaw to everyone around him then wear their skin on his face like a damn episode of American Horror Story: Asylum. Like I said: Normal stuff!\nWhile there's no director just yet, writer Seth M. Sherwood has been enlisted to pen the script, and production is expected to start as early as this winter. As for a star, no word on that yet either, and The Wrap specifies that it seems unlikely the previous film's star, True Detective star Alexandra Daddario, would appear in this prequel given she portrayed Leatherface's cousin decades later in the film. As another character, though, is a possibility.\nLeatherface as a teenager. What a weird thought.\nImage: Bryanston Pictures","url":"https://www.bustle.com/articles/35835-texas-chainsaw-massacre-sequel-has-the-strangest-plot-idea-of-the-entire-franchise"}
