{"authors":["Logan Churchwell"],"date_download":"2018-10-30 19:56:30","date_modify":"2018-10-30 19:56:30","date_publish":"2016-06-29 15:47:04","description":"The State of Texas renewed its commitment to serve veterans where Washington has failed them with a new round of grant opportunities for entities offering mental health care. Another $20 million is available to local nonprofits and governments to address needs “that are currently not being met.” | Border / Cartel Chronicles","filename":"data/vaneerConsumption/TexasPicksUpVAsSlackwith20MinMentalHealthGrantsforVets.json","image_url":"https://media.breitbart.com/media/2015/12/VA-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_06_29__1540929390.html","title":"Texas Picks Up VA's Slack with $20M in Mental Health Grants for Vets","title_page":"Texas Picks Up VA's Slack with $20M in Mental Health Grants for Vets","title_rss":"NULL","source_domain":"breitbart.com","text":"The State of Texas renewed its commitment to serve veterans where Washington has failed them with a new round of grant opportunities for entities offering mental health care. Another $20 million is available to local nonprofits and governments to address needs “that are currently not being met.”\nOriginally created by Texas Senator Jane Nelson (R-Flower Mound) in 2015, the Texas Veterans + Family Alliance was designed to fill the gaps in existing healthcare programs with the help of nonprofits and local government agencies. The grant process is administered by the Texas Health and Human Services Commission (HHSC) which requires that entities hoping to access public funds must match dollar-for-dollar, according to an HHSC announcement.\n“These worthy projects will make a positive difference in the lives of those struggling with PTSD and other mental health challenges, and I am pleased to report that more help is on the way,” Senator Nelson said in a written statement to Breitbart Texas.\nThe Texas agency reiterated its commitment to addressing the not-so-apparent ailments.\n“Not all wounds are visible, and the needs for our fighting men and women and their families are priority obligations for Texas,” Health and Human Services Executive Commissioner Charles Smith said.\nThe Houston-based nonprofit, The Lone Survivor Foundation, offers a sobering view of the troubles American veterans face. The organization reports that roughly one third of combat veterans suffer from trauma, traumatic brain injury, or both. Untreated Post-Traumatic Stress Disorder (PTSD) can directly impact immediate family members by disrupting a normal spousal relationship and foster anxiety issues for children in close proximity, the group claims. If left unmitigated, family units fracture – and have done so – at alarming rates in both the Vietnam and contemporary generations of vets. Lone Survivor notes that 38 percent of Vietnam era marriages failed within six months of a serviceman’s return to the U.S. Afghanistan and Iraq veterans have not broken the cycle, either.\nThe embattled U.S. Department of Veterans Affairs reports that one in ten patients seen demonstrate problems with alcohol and controlled substances as a consequence of PTSD. Further, 22 percent of all combat wounds received since 2001 are brain related.\nThe infamous VA Scandal saw new fuel added to a large fire in May 2016 when current Secretary Bob McDonald dismissed the length of time to receive an appointment as a valid measurement.\n“When you go to Disney, do they measure the number of hours you wait in line or what’s important? … What’s important is: What’s your satisfaction with the experience.”\nA bipartisan backlash followed with Rep. Tulsi Gabbard (D-HI) publicly stating that she became “pissed off” by the comment and demanded an apology, according to Breitbart News. Republican Congressional leadership stopped short of calling for Secretary McDonald’s resignation, however.\nTexas HHSC notes that applications for the next round of grants must be submitted to its Electronic State Business Daily website on or before August 1 to be considered.\nThe Texas Veterans + Family Alliance program distributed $1 million in 2015 to qualifying applicants.\nLogan Churchwell is a founding member of the Breitbart Texas team. You can follow him on Twitter @LCChurchwell.","url":"https://www.breitbart.com/border/2016/06/29/texas-picks-vas-slack-20m-mental-health-grants-vets/"}
