{"authors":["Bob Price"],"date_download":"2018-10-30 19:20:42","date_modify":"2018-10-30 19:20:42","date_publish":"2015-01-11 18:12:49","description":"Texas State Rep. Cecil Bell filed a bill in the Austin this week to protect the sovereignty of Texas and to defend traditional marriage.","filename":"data/vaneerConsumption/TexasRepIntroducesBilltoDefendTraditionalMarriageandStateSovereignty.json","image_url":"https://media.breitbart.com/media/2015/01/Same-Sex-Marriage-Protest-AP-Photo-David-Coates.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_01_11__1540927242.html","title":"Texas Rep Introduces Bill to Defend Traditional Marriage and State Sovereignty","title_page":"Texas Rep Introduces Bill to Defend Traditional Marriage and State Sovereignty","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas State Representative Cecil Bell (R-Magnolia) filed a bill in the State Capitol this week to protect the sovereignty of Texas and to defend traditional marriage in this state. The effect of the bill would be to prohibit the use of state or local funds to be used to license or support same-sex marriage. This would include blocking the salaries of any government employee engaged in subverting Texas law regarding marriage.\nRep. Bell told Breitbart Texas, “As someone who believes strongly in defending our traditional values, I filed HB 623 which affirms the right of the State to define marriage. The bill rebukes the federal government and federal courts for interfering with states’ rights and denies funding to same-sex ‘marriage’.” The bill is entitled as the Preservation of Sovereignty and Marriage Act.\nBell said he has received solid support from values based organizations and other state reps have offered to sponsor the legislation. “I will go to work on Wednesday to get the support to get this bill passed,” Bell explained. “The homosexual community across the nation has sent several thousand emails to my capitol email account. Less than 10 percent came from Texas, but this is their national cause and this bill alarms them.”\nBell said that to his knowledge, only South Carolina has made any effort to push back against these overreaching federal courts.\n“The 10th Amendment protects the right of Texas to pass Prop 2 [Texas’ traditional marriage constitutional amendment],” Bell wrote in a press release obtained by Breitbart Texas. “With the 84th Session around the corner, Texas will stand up and defend its constitutional right against federal overreach.”\nIn addition to stripping state and local funds or salaries from being utilized, the bill expressly prohibits state or local governments from recognizing, granting, or enforcing same-sex marriage licenses. Employees who violate the law may not receive salaries or taxpayer-funded pensions or benefits.\nIn February, 2014, Federal Judge Orlando Garcia ruled the Texas marriage definition law was unconstitutional. In December, Breitbart Texas’ Sarah Rumpf reported that Garcia issued a stay keeping the Texas law in place while the appeals process moves forward. The 5th Circuit Court of Appeals heard arguments on the matter last week in New Orleans. The case will likely end up at the U.S. Supreme Court for a final decision.\nBob Price is a senior political news contributor for Breitbart Texas and a member of the original Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2015/01/11/texas-rep-introduces-bill-to-defend-traditional-marriage-and-state-sovereignty/"}
