{"authors":["Lee Stranahan"],"date_download":"2018-10-30 19:57:39","date_modify":"2018-10-30 19:57:39","date_publish":"2015-05-07 20:56:45","description":"The Iman of the Phoenix, Arizona, mosque attended by Texas terror shooter Elton Simpson gathered members years ago to warn them about a potential danger in their midst--but it was not Simpson he warned them about. According to a recent New York Times article, the Iman warned others in the mosque that he was concerned that an FBI informant had infiltrated the Islamic Community Center of Phoenix. |","filename":"data/vaneerConsumption/TexasShootersImamWarnedMemberstoBeCarefulofFBIInformant.json","image_url":"https://media.breitbart.com/media/2015/05/Elton-Simpson-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_07__1540929459.html","title":"Texas Shooter's Imam Warned Members to 'Be Careful' of FBI Informant","title_page":"Texas Shooter's Imam Warned Members to 'Be Careful' of FBI Informant | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The imam of the Phoenix, Arizona, mosque attended by Texas terror shooter Elton Simpson gathered members years ago to warn them about a potential danger in their midst–but it was not Simpson he warned them about. According to a recent New York Times article, the imam warned others in the mosque that he was concerned that an FBI informant had infiltrated the Islamic Community Center of Phoenix.\nImam Mahmoud Sulaiman was correct: Dabla Deng was an FBI informant who had been assigned to gather information on Elton Simpson, who had raised concerns through his connection to a convicted terror supporter.\nThe Times makes clear that the Phoenix mosque was more concerned with the FBI than a potential terrorist:\nAt the mosque they both attended, the Islamic Community Center of Phoenix, Mr. Deng stood out. Usama Shami, president of the mosque, said the young Sudanese man came to his attention because he did not seem to care much about Islam. He asked few questions about Islamic rituals and rarely engaged with others. “He claimed to be a convert,” said Mr. Shami, an engineer of Palestinian heritage, “but he wasn’t interested in learning the faith, and that raised our suspicions.” …. Mr. Sulaiman called Mr. Shami and other members of the mosque and warned them to be careful around Mr. Deng, saying he was probably an informant and out to get someone, Mr. Shami recalled.\nThe Times provides no explanation regarding why the imam would warn others at the mosque to “be careful” around an FBI informant.\nInstead, the article notes that “many Muslims” oppose common law enforcement techniques like informants to combat terrorism:\nIn case after case, given the perplexing task of sorting out the talkers from the real terrorists, the FBI has relied on informants to tease out a suspect’s intentions. It is a tactic that many Muslims sharply criticize, saying it divides the community and undermines trust in law enforcement.\nThe Times claims the case against Simpson “fizzled.” The main evidence was Deng’s recorded conversations where Simpson talked about traveling to Somalia to fight with al-Shabaab. Ultimately, Simpson was convicted of lying to the FBI, but not of any terror-related crimes. The FBI also failed to place him on a no-fly list.\nEven after the attempted mass murder on Sunday, officials at the Arizona mosque that both killers attended still blamed the FBI and oppose the use of informants:\nWhen mosque leaders learned that Mr. Simpson had not been sent to prison, they figured that “the FBI had done their due diligence, that they thought he was fine and wasn’t a danger to our society,” Mr. Shami said. In retrospect, he said, “They probably were mistaken.” But even after Sunday’s shootout, which underscored the urgency of FBI efforts to identify dangerous people in the community, mosque leaders have not changed their opposition to the use of informants like Mr. Deng.\nThe article closes with a story about mosque President Usama Shami calling other recent attempts to use informants as “disappointing” and asking about the FBI: “If they think there’s someone else at the mosque who is a potential threat, why not work with us?” Of course, such cooperation would make the mosque itself an informant.\nThe Times report echoes a story of Simpson’s conviction published in a local Arizona publication, the Arizona Muslim Voice, which stated that the Council on American-Islamic Relations (CAIR) “sent out media alerts to advise our community to use caution when speaking with the FBI.” They did not send similar alerts warning of potential terrorists infiltrating the mosque.","url":"https://www.breitbart.com/national-security/2015/05/07/texas-shooters-imam-warned-members-to-be-careful-of-fbi-informant/"}
