{"authors":["Lana Shadwick"],"date_download":"2018-10-30 20:43:13","date_modify":"2018-10-30 20:43:13","date_publish":"2015-12-29 19:57:43","description":"Texas cops immediately went to work to help law enforcement officers whose lives were devasted by deadly tornadoes and looters.","filename":"data/vaneerConsumption/TexasCopsHelpOfficersDevastedbyTornadoesandLooters.json","image_url":"https://media.breitbart.com/media/2015/12/Tweet-Officers-Homes-Tornado.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_12_29__1540932193.html","title":"Texas Cops Help Officers Devasted by Tornadoes and Looters","title_page":"Texas Cops Help Officers Devasted by Tornadoes and Looters","title_rss":"NULL","source_domain":"breitbart.com","text":"Texas cops immediately went to work to help law enforcement officers whose homes or property were devastated by the deadly storms and tornadoes that hit northeast Texas. What was left in the devastation was in many cases taken by looters.\nThe Dallas Police Association (DPA) started a fundraising drive for the officers through the Assist the Officer Foundation (ATO). All donations received through January 3 will be set aside for officers who have been affected by the severe weather.\nFive police officers in Rowlett, Texas, had their homes destroyed by the tornadoes. Looters rifled through their homes after the initial devastation.\nMore than 17 officers were reported by CBS DFW to have experienced moderate to heavy damage to their homes in Ovilla, Red Oak, DeSoto, Sunnyvale, Garland and Rowlett.\n“The Dallas Police Association set up the Assist The Officer Foundation to take care of our officers during times of crisis,” said ATO Chairman Frederick Frazier to the local CBS affiliate. “The severe weather and tornadoes of this weekend were personally and financially catastrophic to many members of our police family. It is the goal of the Dallas Police Association and the Assist The Officer Foundation to help every impacted officer in dealing with this tragedy,” he said.\nAs reported by the local NBC affiliate, Detective David Campbell has helped others for the last 27 years. He and his wife have lived in Rowlett for nine years. Their home was destroyed by a tornado and he now needs help.\nCampbell told the NBC station that he had just gotten home from work when the tornado began. They ran into a small downstairs bedroom just in time.\nHe told the local news outlet, “My mother, my wife, four dogs, and me – we’re all in here, we’re all praying. Then the house explodes,” he said. “I’m standing behind that door, and there is the loudest, most ungodly, freight-train sound I’ve ever heard. And you just hear the house go, ‘Boom!”\n“We’re hearing voices outside. People are screaming. I go outside, I open the door, it’s like being on Mars,” Campbell said of the devastating affects on the homes in his neighborhood.\nHe then immediately ran to check on his neighbors. He said, “Neighbors help neighbors – whether you’re a mechanic, a reporter or a cop.”\nOfficer Campbell’s home has been totally destroyed. “I don’t know how you can help me,” he said, “but I know I need everything. When you live through something like this, you don’t know where to begin.”\nThe Assist The Officer Foundation is touring all of the officers’ homes and is giving them checks to help them. ATO Chairman Frazier was reported to say the foundation has given out more than $20,000 in emergency relief over the last two days. They still need the public to help.\nFrazier told the NBC station, “These officers live every day to help others, and here we are, we’re trying to help them. These are our friends, these are our peers. Some of them are our supervisors, or above. And you’ve got many of them that are displaced.”\nThe officers will be living in hotels and with family, and other officers have volunteered to cover shifts until the 17 officers are able to return to work.\n“The support has been overwhelming,” Officer Campbell said. “We’re going to put our lives back together.\nA donation came me made to assist these officers at the Assist The Officer Foundation website.","url":"https://www.breitbart.com/border/2015/12/29/texas-cops-help-officers-devasted-tornadoes-looters/"}
