{"authors":["Lana Shadwick"],"date_download":"2018-10-30 18:31:04","date_modify":"2018-10-30 18:31:04","date_publish":"2016-09-29 15:56:27","description":"Four state AGs filed a lawsuit to stop the Obama Administration from giving control of the Internet to an international organization.","filename":"data/vaneerConsumption/TexasLeadsLawsuittoStopObamaHandOverofInternet.json","image_url":"https://media.breitbart.com/media/2016/09/wi/afp_27e389355287e054bcb7e6edf5c9100fb6e31e0d-e1475164557962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_09_29__1540924264.html","title":"Texas Leads Lawsuit to Stop Obama Hand-Over of Internet","title_page":"Texas Leads Lawsuit to Stop Obama Hand-Over of Internet","title_rss":"NULL","source_domain":"breitbart.com","text":"Four state attorneys general filed a lawsuit in Texas to stop the Obama Administration from giving control of the Internet to an international organization that lists several authoritarian regimes as advisers on its board.\nTexas Attorney General Ken Paxton was joined by Arizona Attorney General Mark Brnovich, Oklahoma Attorney General Scott Pruitt, and Nevada Attorney General Adam Paul Laxalt. The lawsuit was filed in Texas in U.S. District Court Southern District of Texas, Galveston Division. The “Plaintiff States” are seeking declaratory and injunctive relief against the National Telecommunications and Information Administration (NTIA); the United States of America; the United States Department of Commerce; the Secretary of Commerce; and the Assistant Secretary for Communications and Information.\nThe complaint, attached below, states that “This suit involves the Federal Government Defendants’ stated plan to abandon NTIA’s option rights under its contract with the Internet Corporation for Assigned Names and Numbers (“ICANN”) … cancel its cooperative agreement with Verisign, Inc. (“Verisign”) … referred to as the “Cooperative Agreement”; delegate its authority to approve changes to the Internet’s root zone file; and otherwise take steps to cede U.S. government trusteeship over functions that it has deemed are ‘vital to the stability and correct functioning of the Internet,’ without statutory authority to do so and in violation of the Property Clause of the U.S. Constitution and the First Amendment.” These state attorneys general charge that “NTIA’s proposed actions are unlawful and should be temporarily restrained and enjoined.”\nICANN has always been overseen by the U.S. Commerce Department but the federal government’s contract with ICANN is set to expire on September 30th. The Obama Administration, Texas Attorney General Paxton says, “announced it plans to let ICANN become fully independent. As a result, authoritarian regimes like Russia, China, and Iran will now have the ability to interfere with what should be a free and open internet.”\nThe lawsuit argues that the Obama Administration plan “violates the Property Clause of the U.S. Constitution by giving away government property without congressional authorization, the First Amendment to the U.S. Constitution by chilling speech, and the Administrative Procedure Act by acting beyond statutory authority.”\n“Trusting authoritarian regimes to ensure the continued freedom of the Internet is lunacy,” Attorney General Paxton said. “The president does not have the authority to simply give away America’s pioneering role in ensuring that the Internet remains a place where free expression can flourish.”\nBreitbart Texas spoke to Arizona AG Mark Brnovich who stressed: “This is a very important issue, but unfortunately people are not paying attention to it. It is important to raise these issues and concerns which unfortunately should have been addressed by Congress.” He referred to the discussion of the threats as “a parade of horribles” that have been dismissed.\nThe Arizona AG said that there are real concerns as it relates to the First Amendment. He noted that other countries may resent our nation’s constitutional liberties and added, “I am very concerned that they will no longer be guaranteed.” He said other countries and “authoritarian regimes” “unfortunately, do not share our view.” He said we can look at what has happened in sports and pointed to the International Olympic Committee. He said they were “incompetent or corrupt.”\nAs reported by Breitbart News, President Obama’s push to hand-over control of Internet domains would give interests in China, Russia, Turkey, Saudi Arabia, and North Korea an ability to have authoritarian control over online speech. In July, the government in China banned online news reporting, leaving only the government to post “news.” Bloggers who criticize the regime can be charged with a crime, and people who live in the country know that they do not have freedom of speech on social media. Russia and China reportedly are working in partnership toward the goal of more controlled censorship of the Internet. Turkey has an outright ban on social media and it is a crime to insult the president. Public flogging and jail sentences are used to punish dissidents in Saudi Arabia and according to the article, Turkey is often seen as the world leader in blocking Twitter accounts. Saudi Arabia has about 400,000 websites blocked. North Korea’s “Internet” is essentially only for government propaganda and surveillance.\nNot surprisingly, Americans overwhelmingly oppose President Obama’s plan to hand control over to international interests. As reported by Breitbart News, 41 percent of Americans are against the move, and only 14 percent are in support, according to a Breitbart/Gravis poll of 1,493 likely voters released on August 26.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nThis article has been updated to include additional quotes.\nInternet Lawsuit Filed by States of Texas, Arizona, Oklahoma and Nevada","url":"https://www.breitbart.com/border/2016/09/29/texas-leads-lawsuit-stop-obama-hand-internet/"}
