{"authors":["Keith Griffith For Dailymail.Com"],"date_download":"2018-10-23 03:13:52","date_modify":"2018-10-23 03:13:52","date_publish":"2017-04-26 14:38:07","description":"The 16-year-old student in Moody, Texas was charged on Monday with felony counts of assault on a public servant, harassment of a public servant and obstruction or retaliation.","filename":"data/vaneerConsumption/Texasstudentaccusedofpeeinginhisteacherscup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FD77D00000578-0-image-a-8_1493213838732.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447848_Texas-student-accused-peeing-teacher-s-cup_1540264432.html","title":"Texas student accused of peeing in his teacher's cup","title_page":"Texas student accused of peeing in his teacher's cup | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A high school student is accused of perpetrating a sick crime against his teacher by peeing in her drinking cup.\nThe 16-year-old student in Moody, Texas was charged on Monday with felony counts of assault on a public servant, harassment of a public servant and obstruction or retaliation. He cannot be identified because he is a juvenile.\nThe incident took place on April 13 at Moody High School, when a teacher left her drinking container unattended and the teenager allegedly took the opportunity to pee in it.\n'She didn't find out about it until after the fact,' Moody Police Chief Roger Kennedy told the Waco Tribune-Herald. 'She thinks she (drank) it but she doesn't know 100 percent, because according to her statement, she made the comment that the water fountain always tastes funny.'\nA 16-year-old student in Moody, Texas is accused of peeing in his teacher's cup (stock image)\nRumors of the cup urination raced around the classroom, until two students came forward later that day and told the teacher her water had been tainted with pee, police said.\nThe teacher immediately emptied the cup.\nThe school's principal interviewed students and reviewed security camera footage to get to the bottom of the case, and disciplined the student on April 18 while cops continued their investigation.\n'We did charge him with three different offenses,' Chief Kennedy noted.\n'Unfortunately, students will make poor decisions at times,' Moody Independent School District superintendent Gary Martel said in a statement.\n'The district cannot keep all poor decisions from happening on our campuses but we will follow district policy so there are consequences and punitive results for those who choose to make bad decisions at school,' Martel continued.\n'We will continue focusing on the large majority of our students who are making great choices and being great role models each day.'","url":"https://www.dailymail.co.uk/news/article-4447848/Texas-student-accused-peeing-teacher-s-cup.html"}
