{"authors":["Rob Milford"],"date_download":"2018-10-30 21:21:56","date_modify":"2018-10-30 21:21:56","date_publish":"2015-05-03 16:30:42","description":"A 5-year-old was forced to change from a sundress to jeans and a t-shirt after Cy-Fair Independent Scholl District officials decided that showing her shoulders was “immoral”.","filename":"data/vaneerConsumption/Texas5YearOldSchoolGirlForcedtoChangeClothesShouldersTooSexySaysSchoolOfficial.json","image_url":"https://media.breitbart.com/media/2015/05/5-year-old-send-home-for-being-too-sexy.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_05_03__1540934516.html","title":"Texas 5-Year-Old School Girl Forced to Change Clothes, Shoulders Too Sexy Says School Official","title_page":"Texas 5-Year-Old School Girl Forced to Change Clothes, Shoulders Too Sexy Says School Official","title_rss":"NULL","source_domain":"breitbart.com","text":"A 5-year-old was forced to change from a sundress to jeans and a t-shirt after Cy-Fair Independent Scholl District officials decided that showing her shoulders was “immoral”. They also objected to her ankles showing as well.\nThe un-identified Cy-Fair school is a public school located in Northwest Houston.\nJef Rouner, father of the little girl an a writer for the Houston Press, bought the rainbow color spaghetti strap dress for his five year old daughter a few weeks back. She had already worn it to church, without objection, and since it was warm, she wanted to wear it to school.\nHer father had no problem with the choice or his daughters fashion style. That was before she got to school. But a teacher or principal saw the dress, and brought her to the office and made her “cover up” all the skin that was showing. Rouner wrote in the Houston Press:\nYou know what really grills my cheese about it? It’s not even the shirt they made her put on over her top, it’s the pants they made her wear underneath. It’s a full-length dress that she has to hold up to keep from getting wet in uncut grass. She even had a small set of shorts underneath because it was gym day. But because the top part of her dress apparently exposed the immoral sinfulness of her bare shoulders she also had to pull on jeans even though her legs remained completely covered as part of her punishment.\nThe father in Rouner was outraged that a five-year-old could be punished for something so seemingly innocent. His story in the Houston Press continued: “I didn’t pick up my daughter’s dress at ‘My First Stripperwear’. It’s not repurposed fetish gear from a store for very short people. It’s a dress from a mall chain store in her size. It covers everything but her shoulders and a small section of her upper chest and back. She’s worn it to church, and in the growing heat she was looking forward to wearing it a lot because it’s light and comfortable.”\nAs mentioned earlier, she even wore a small pair of shorts under the floor length dress since it was gym day, and the specter of little girls hanging upside down from the monkey bars is apparently more than school districts can handle.\nThe offending dress in question:\nRouner has vowed not to let this action by the schools stand. He finds the dress code for his daughter’s entire school district to be manifestly sexist and unequal: “Have you ever stopped to think how weird a school dress code really is? I went and checked out the one for my daughter’s school district and it’s amazing in how hard it tries not to say what it actually means. There are literally no male-specific guidelines anywhere on that list. I mean prohibitions against exposing the chest or torso could hypothetically apply to boys except that they don’t. Not really. They don’t sell boys clothes that do that. There’s nothing that is marketed to boys that is in anyway comparable to a skirt or a sun dress. Essentially, a school dress code exists to prevent girls from displaying too much of their bodies…”\nRouner has reported several times in his career of school dress code rights and mostly wrongs, he just didn’t think it would arrive in kindergarten. “I’m not surprised to see the dress code shaming come into my house,” he wrote. “I have after all been sadly waiting for it since the ultrasound tech said, “It’s a girl.” I didn’t think, though that it would make an appearance when she was five years old.”\nAnd he has plans for the rest of the school year; he intends to fight back with some help from his daughter:\n“Part of me very much wants to go buy a nice dress for myself and drop her off at school in it for the rest of the year to prove a point. In the meantime I think I’ll employ the greatest weapon a five-year-old possesses; the question “Why?” The next time the kid wants to wear her dress I’m going to let her, and I’m going to tell her that there’s nothing wrong with it or her because she is dressed in a perfectly normal manner and cute as a button to boot. I’m going to tell her that some people think a girl who shows too much skin is wrong or dangerous, but that those people are, for want of a better term, lackwitted thugs living in a bad place. And if anyone tells her to change I’m going to advise her to ask why and to keep on asking that person “Why?” until she gets an answer she likes.”\nDress code variances across Texas have taken some bizarre twists and turns over the years, at one time, certain NFL team colors (Oakland Raiders) have been banned or wearing a bandana of a certain color. T-shirts showing beer or liquor, guns of even military themes have also been sent home or at least turned inside-out for the remainder of the school day. Earlier this year, a Texas school suspended a 9-year-old boy because he wore an imaginary Hobbit ring to class. The school claimed the ring amounted to terrorism.\nRob Milford is a news contributor for Breitbart Texas. Follow him on Facebook.","url":"https://www.breitbart.com/border/2015/05/03/texas-5-year-old-school-girl-forced-to-change-clothes-shoulders-too-sexy-says-school-official/"}
