{"authors":["Sarah Rumpf"],"date_download":"2018-10-30 21:26:25","date_modify":"2018-10-30 21:26:25","date_publish":"2015-01-22 15:38:27","description":"On Wednesday, the Texas Senate voted on mostly partisan lines to throw out a nearly 70 year old rule that made it easier for Democrats to block bills in the Republican controlled chamber. Under the \"Two-Thirds Rule,\" bills could not be brought up for debate without the votes of two-thirds of the Senators, or 21 out of the 31 Senators. Republicans currently have a 20 to 11 majority, leaving them still needing the vote of at least one Democrat to advance legislation. |","filename":"data/vaneerConsumption/TexasSenateTossesTwoThirdsRule.json","image_url":"https://media.breitbart.com/media/2015/01/capitol-ser.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_01_22__1540934785.html","title":"Texas Senate Tosses 'Two Thirds' Rule","title_page":"Texas Senate Tosses 'Two Thirds' Rule","title_rss":"NULL","source_domain":"breitbart.com","text":"AUSTIN, Texas — On Wednesday, the Texas Senate voted on mostly partisan lines to throw out a nearly 70 year old rule that made it easier for Democrats to block bills in the Republican controlled chamber. Under the “Two-Thirds Rule,” bills could not be brought up for debate without the votes of two-thirds of the Senators, or 21 out of the 31 Senators. Republicans currently have a 20 to 11 majority, leaving them still needing the vote of at least one Democrat to advance legislation.\nSupporters of the Two-Thirds Rule have called it an important aspect of preserving the collegiality of the Senate, as well as providing cover for Senators on controversial bills. Besides giving Democrats a larger voice in the Senate, the rule also has been viewed as protecting minority interests where the issue is not partisan, but rather a regional or rural vs. urban divide. However, during the past few years, the Two-Thirds Rule has steadily lost favor among Republican elected officials and grassroots activists, with many blaming it for killing conservative legislation.\nLieutenant Governor Dan Patrick, sworn into office on Tuesday, made ending the Two-Thirds Rule a campaign issue. Patrick had first sought to toss out the rule on his first day in the Senate in 2007, but lost in a 30-1 vote.\nThis time, Patrick presided over a Senate that was far more supportive. Sen. Kevin Eltife (R-Tyler) presented the resolution he had authored, lowering the threshold from 21 to 19 votes — in essence, going from a Two-Thirds Rule to a Three-Fifths Rule, or 60 percent. The vote was 20 to 10, with Sen. Craig Estes (R-Wichita Falls) voting present and Sen. Eddie Lucio, Jr. (D-Brownsville) as the lone Democrat who voted in favor. According to a report by the Austin American-Statesman, Lucio supported the change because of several bills he supported where he had fallen one vote short, and had taken multiple legislative sessions to get his bills passed.\nIn his presentation about the rule change, Eltife noted that it would hopefully reduce the need for special sessions, referring to several moments during the 2013 special sessions as “not a pretty sight,” because controversial legislation would be more likely to move forward during a regular session. Also, argued Eltife, requiring 19 votes still meant that a “super majority” was needed to bring bills to the floor for debate and a vote.\nSen. Kirk Watson (D-Austin) disagreed, saying that it would make it easier to throw out rules that increased transparency. Eltife responded, “I do not believe going from 21 votes to 19 is a lack of transparency. It’s not one iota less transparent.” Sen. Rodney Ellis (D-Houston) called the vote “a sad day for the Texas Senate and one that we will look back on and regret,” describing it as “detonating decades of Senate tradition, tradition which has made the Texas State Senate a great deliberative body.”\nAfter the vote, Sen. Charles Perry (R-Lubbock) provided a statement to Breitbart Texas supporting the new rule, noting that the issue had been “a top priority of Lt. Gov. Patrick and a hallmark issue for Texans across the state throughout the campaign cycle.” Perry noted that the 60 percent threshold had been reached after “much deliberation” by the Senate. “A majority when merited should win the day, but never at the expense of the minority voice being shut out. This threshold should ensure protections for rural Texas, while simultaneously giving Republicans the votes necessary to the pass conservative legislation promised to voters.”\nAdvancing a conservative agenda was on the mind of Sen. Charles Schwertner (R-Georgetown), who posted several tweets that the new 60 percent rule “will improve [Texas] government,” “end the partisan gridlock that has stalled conservative legislation time [and] time again,” and “ensure that the concerns of the majority of Texans are heard clearly and addressed without delay.”\nSen. Brandon Creighton (R-Conroe) similarly praised the change, saying that it was “increasing transparency for the state of Texas.” Continued Creighton, “This change will put good conservative legislation at the forefront of the 84th legislative session and allow our constituents across the state an opportunity to hold us accountable for our voting record. I’m not afraid of that.”\nEmpower Texans President Michael Quinn Sullivan cheered at the result of the vote. “Dan Patrick campaigned specifically on the need to reform the rule by which legislation is considered,” said Sullivan. “That the leftists are going into an apocalyptic overdrive is indicative of just how important the Two-Thirds Rule was to them in killing conservative legislation — and how important it was for the Senate Rules to be reformed. Lt. Gov. Patrick and the Senate are to be complimented for doing what they promised.” [Disclosure: Sullivan is a Breitbart Texas contributor.]\nIn a statement provided to Breitbart Texas, Patrick “applaud[ed] the action by the Texas Senate today,” mentioning how he had opposed the two-thirds rule since he was first elected in 2007 and calling it a “bold decision.”\n“Today’s action will make the Texas Senate even better,” said Patrick. “And it will help us deliver a conservative agenda a majority of voters elected us to pass.”\nThe Texas Senate is at recess until 2:00 pm on Monday, January 26.\nFollow Sarah Rumpf on Twitter @rumpfshaker.","url":"https://www.breitbart.com/border/2015/01/22/texas-senate-tosses-two-thirds-rule-paving-way-for-conservative-agenda/"}
