{"authors":["Lana Shadwick"],"date_download":"2018-10-30 18:12:27","date_modify":"2018-10-30 18:12:27","date_publish":"2016-03-10 21:44:39","description":"The Harris County Sheriff's Office was accused of delaying a call for medical assistance for a local man who had passed out by the Houston area CAIR (Council of American Islamic Relations) in a press release and news conference.","filename":"data/vaneerConsumption/TexasSheriffShootsDownCAIRsWhining.json","image_url":"https://media.breitbart.com/media/2015/08/Hickman-at-presser.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_03_10__1540923147.html","title":"Texas Sheriff Shoots Down CAIR's Whining","title_page":"Texas Sheriff Shoots Down CAIR's Whining | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — The Harris County Sheriff’s Office was accused of delaying a call for medical assistance for a local man who had passed out by the Houston area CAIR (Council of American Islamic Relations) in a press release and news conference. A press release by the sheriff’s office shot down CAIR’s allegation with a factual timeline of the incident.\nCAIR has been declared a terrorist organization in the United Arab Emirates and was named by federal prosecutors as an unindicted co-conspirator in the Holy Land Foundation’s Hamas-funding operation.\nIn a statement obtained by Breitbart Texas, the Harris County Sheriff’s Office (HCSO) said they were informed of the allegation on Tuesday via a press release and news conference invitation distributed by CAIR-Houston.\nThe statement from the Texas sheriff also said that prior to the announcement in the CAIR-Houston news release, the “Harris County Sheriff’s Office had not been contacted to verify the details of the incident.”\nThe Sheriff shot down the allegation by releasing the following written public response and timeline.\nThe HCSO stated within its response that “While on routine patrol, the deputy observed the persons in need of assistance. Nine seconds elapsed between the initial contact, and the call for EMS to respond. Approximately 4 minutes later, Westlake EMS was contacted to respond, at 00:36:47 Westlake EMS advised en route.”\nDATE: February 28, 2016\nLOCATION: Fry Road at Franz Road TIMELINE:\n• 00:29:55 – Call for an Unknown Medical Emergency created by deputy on routine patrol\n• 00:30:04 – Unit advises HCSO Emergency Dispatch Center “NEED EMS FOR MALE PASSING OUT”\n• 00:30:06 – Backup Unit enroute to scene\n• 00:36:18 – Backup Unit on scene\n• 00:36:47 – Westlake EMS enroute\n• 00:47:12 – Westlake EMS on scene\nAccording to the HCSO, CAIR-Houston Executive Director Mustafaa Carroll was provided a copy of the timeline set out in the law enforcement department’s release.\nBreitbart Texas spoke with the local ABC affiliate that confirmed there was a press conference by CAIR in Houston. The station had a live feed of the event posted on their website. The man with the medical incident is on life support.\nA search of the CAIR Texas Houston Facebook page or Twitter feed at the time of publication, has no mention of the incident, or of a press conference. Moreover, beyond the Houston ABC affiliate, the press conference or the alleged incident does not appear to have been reported by any Houston area or other media outlet.\nSheriff Ron Hickman is the sheriff of Harris County (Houston), Texas. He was appointed sheriff earlier this year by Harris County Commissioners to fill the vacancy left by the resignation of now former Sheriff Adrian Garcia. Sheriff Garcia resigned to run a campaign for mayor of Houston that failed. Hickman recently won the primary nomination of the Republican Party in his bid to seek election to a full term as sheriff. He faces a Democrat opponent in November.\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2016/03/10/texas-sheriff-shoots-down-cairs-whining/"}
