{"authors":["Bob Price"],"date_download":"2018-10-30 20:51:37","date_modify":"2018-10-30 20:51:37","date_publish":"2016-07-13 16:00:45","description":"A man armed with an AK-47 is alleged to have entered a Waffle House in DeSoto, Texas, in the early morning hours last Thursday","filename":"data/vaneerConsumption/TexasWaffleHouseCustomerShootsRobberArmedwithAK47.json","image_url":"https://media.breitbart.com/media/2016/07/waffle-house-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_07_13__1540932697.html","title":"Texas Waffle House Customer Shoots Robber Armed with AK-47","title_page":"Texas Waffle House Customer Shoots Robber Armed with AK-47","title_rss":"NULL","source_domain":"breitbart.com","text":"A man armed with an AK-47 is alleged to have entered a Waffle House in DeSoto, Texas, in the early morning hours last Thursday. The robbery suspect was not counting on the presence of a Texan with a Handgun License to Carry.\nThe alleged robber, described as a black man in his mid-twenties, entered the DeSoto Waffle House at about 2:30 a.m. on July 7, while armed with an AK-47 rifle, information obtained by Breitbart Texas from the DeSoto Police Department revealed. After robbing several of the customers, the man walked out of the diner. One of the customers followed the man out of the restaurant and attempted to stop him.\nThe customer knew that his wife was on her way to the Waffle House and feared she might be in danger in the parking lot. He was afraid the armed man might harm her or others in the parking lot, officials said.\nAfter following the man out of the Waffle House, the customer called out to the robber who turned and pointed the rifle at him.\nThe customer fired several shots from his handgun and stopped the robber.\nPolice officers arrived on the scene a short time later and found the man lying in the parking lot. He was transported to a local hospital where he remains in critical condition. Originally, the suspect had not yet been identified and police were asking for the public’s assistance in figuring out who the man is. Overnight, the police learned the man is 26-year-old Antoine Devon Cooper of Dallas, Sergeant Nic Bristow told Breitbart Texas Thursday morning.\nCooper is covered in tattoos as can be seen in the photos above that were released by police.\nHe is reported to be in critical condition and on life support.\nThe customer was carrying a concealed handgun and was in possession of a Texas Handgun License to Carry. The license allows a qualified holder to carry a handgun concealed or openly under a wide range of conditions and locations. No charges have been filed against the customer. Texas law allows a person to use deadly force when they believe their life, or the lives of others are in danger of death or serious bodily injury.\nBob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2016/07/13/texas-waffle-house-customer-shoots-robber-armed-ak-47/"}
