{"authors":["Savannah O'Leary"],"date_download":"2018-10-30 22:38:41","date_modify":"2018-10-30 22:38:41","date_publish":"2014-08-14 21:41:54","description":"I've never been a dog person, but I became a pug person when the Texts from My Dog Tumblr began to personify these stocky, wrinkly little mammals. If all dogs had as much wit and sass as the little demon featured in this blog, I think I would ditch…","filename":"data/vaneerConsumption/TEXTSFROMMYDOGTumblrComestoLifeInaNewWebSeriesBecauseWeCantGetEnough.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2550932a-40f7-464d-8675-86251b853879.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35821-texts-from-my-dog-tumblr-comes-to-life-in-a-new-web-series-because-we-cant_1540939121.html","title":"\"TEXTS FROM MY DOG\" Tumblr Comes to Life In a New Web Series, Because We Can't Get Enough","title_page":"\"TEXTS FROM MY DOG\" Tumblr Comes to Life In a New Web Series, Because We Can't Get Enough","title_rss":"NULL","source_domain":"bustle.com","text":"I've never been a dog person, but I became a pug person when the Texts from My Dog Tumblr began to personify these stocky, wrinkly little mammals. If all dogs had as much wit and sass as the little demon featured in this blog, I think I would ditch humans altogether. Good news for those of you who feel the same! Remember how we used to get excited when novels became movies? Now we are even more ecstatic when Tumblrs become Web series, which is the way Texts from My Dog is going.\nSam Pepper, the cheeky British chap who previously gained fame on YouTube with his prank channel, is the brains behind the operation. Alongside him is his real-life pet, Chinston Pugsworth, who has already graced Instagram with his presence, and had massive success. Readers love the idea of their pugs sitting at home, contesting our anti-flea shampoo purchases, and snapping audition pics for the next Star Wars. Those enormous, watery eyes are always trying to tell us something — Texts from My Dog finally gave pugs the voice they deserve.\nThe series has four episodes thus far — some borrow from the hilarity that has already been published on Tumblr, while others feature brand-new content. Watch Sir Chinston attempt to name his owner, confuse the washing machine for the weather channel, and interrupt a dinner date with that notorious stare that digs into every guilty dog owners soul during mealtime.\nPug owners everywhere, beware — this is what your dog is really thinking.","url":"https://www.bustle.com/articles/35821-texts-from-my-dog-tumblr-comes-to-life-in-a-new-web-series-because-we-cant"}
