{"authors":[],"date_download":"2018-10-30 14:32:12","date_modify":"2018-10-30 14:32:12","date_publish":"2018-06-21 18:54:00","description":"Atlanta schools seek to make up for revenue lost to tax allocation districts","filename":"data/vaneerConsumption/TextsshowAtlantaandAPSnegotiatingincentivesforGulch.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/06/06/Images/newsEngin.22232518_072812-gulch-ba01a.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_texts-show-botto_d906b256088d9162ad72b977aa290f8f__1540909932.html","title":"Texts show Atlanta and APS negotiating incentives for Gulch","title_page":"Texts show Atlanta and APS negotiating incentives for Gulch","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta Mayor Keisha Lance Bottoms’ office has said for weeks a plan to end a development incentive for parts of Atlanta’s Eastside was about plugging a budget hole, dodging questions about whether the plan was tied to other initiatives, including an effort to provide taxpayer dollars to redevelop downtown’s Gulch.\nBut text messages and emails obtained by The Atlanta Journal-Constitution show Bottoms engaged in secret talks with Atlanta Public Schools to end the Eastside Tax Allocation District (TAD) to win APS’ support for lucrative incentives for the Gulch project. A TAD is a zone where governments freeze property tax collections and use future expected increases in property values over many years to fund infrastructure and other improvements in that zone.\nThe texts, obtained through an open records request, show city and APS staff held talks over the course of at least a month to hash out a plan. As of June 6, the texts show the city and APS were still ironing out what APS Superintendent Meria Carstarphen called “sticky points.”\n“I saw the email regarding the City’s request of the APS Board to consent to extend the Board’s participation in the Westside TAD, so that the City can fund the development of the Gulch area,” Carstarphen wrote to Bottoms on May 6.\n“I believe the Board may support the extension if the City will agree to the following,” Carstarphen said laying out the board’s terms, which included closure of the Eastside TAD.\nIn an email, Cartstarphen told Bottoms APS had not received financial gains promised from TADs. With a change to homestead exemptions threatening future APS tax revenue, APS pushed for closure of the Eastside TAD and other concessions to support the Gulch deal.\nThe documents offer a glimpse of high-stakes negotiations behind closed doors, the outcome of which will determine which neighborhoods get lucrative development dollars for their growth.\nBottoms’ office and APS declined comment.\nCritics say the proposal would eliminate a key subsidy for struggling Eastside neighborhoods such as historic Sweet Auburn in favor of a proposed downtown mini-city pitched as a possible second headquarters for tech giant Amazon.\nIf approved by the school board and City Council, an extension of the Westside TAD would allow the city and Gulch developer CIM Group to fund costly infrastructure through bonds repaid over nearly three decades by future expected increases in the tax digest. Directing more tax dollars to CIM and the Gulch initiative is controversial because the project is likely to receive consideration for other hefty incentives.\nBackers of the project supported a 2017 change in state law to aid major redevelopments in areas called “enterprise zones.” Robert Highsmith, a lobbyist and lawyer at Holland & Knight who represents CIM, helped push the new incentive through the state Legislature, which allows developers of projects of more than $400 million in depressed areas to collect sales taxes generated on site to fund new infrastructure.\nThe Gulch is considered as a potential enterprise zone.\nHighsmith, an ally of former Mayor Kasim Reed, has represented the city, Invest Atlanta, the Beltline and other groups. In 2017, Highsmith and his wife donated $5,400 to Bottoms’ campaign. Highsmith didn’t return messages and CIM declined comment.\nCity legislation to extend the Westside TAD’s life from 2038 to 2047 is pending, which would guarantee a stream of tax dollars for another nine years.\nJulian Bene, an Invest Atlanta board member, has been critical of city financing for big developers out of the Eastside TAD, and said he favors closing it. But he said he doesn’t support closing it to provide incentives for the Gulch that could lock up sales taxes as well as gains to the property tax digest.\n“I don’t think the Gulch deserves to be tax-free and I think that will cost the taxpayer because projects will be built there that would have been built in taxable areas, and the rest of us are going to have to fork out more in taxes to make up for it,” he said.\nThe maneuvers in favor of the Gulch and the Westside TAD also risk reigniting criticism that City Hall sides with big developers over African-American neighborhoods. It’s also likely to pit residents and businesses surrounding the Martin Luther King Jr. National Historical Park against Bottoms, APS and CIM, a noted California-based developer whose co-founder, Richard Ressler, is the brother of Hawks lead owner Tony Ressler.\nThe Eastside TAD, which opened in 2003, has failed to meet its eight goals for community development, according to a report commissioned by the city’s development agency, Invest Atlanta.\nMuch of the money has supported large developers elsewhere in the district rather than community groups. City Councilman Amir Farokhi, who represents the area, said Sweet Auburn and Edgewood should take priority.\n“We need to re-prioritize neighborhood redevelopment and make sure every neighborhood is a great place to live and work before we abandon those commitments to chase a big marquee project,” he said.\nCouncilwoman Natalyn Mosby Archibong, who represents East Atlanta, said she opposes closing the Eastside TAD. She said the city needs to have “a holistic approach” to all of its TADs.\n“It’s unfair to abort this mission for the newest and latest project on the (Westside) of town,” she said.\nInvest Atlanta board member Constance Lewis said the Gulch “is terribly important for our future and merits support, but not at the expense of Eastside development.”\n“Options exist that allow both areas to prosper,” she said.\nAsked earlier this month if the mayor’s office wanted to close the Eastside TAD to expand or create other TADs, Bottoms’ press secretary Michael Smith said “no.”\nIn a June 11 email, he said the Eastside district “would be recommended for closure irrespective of any other development plans,” and declined to confirm if TAD funds had been promised for the Gulch.\nBut five days earlier, Bottoms had texted the city’s terms to Carstarphen.\nBottoms told Carstarphen June 6 the city could support most of APS’ demands, including closing the Eastside TAD, “to extend the Westside TAD to 2047 and to ‘synthetically’ create a Gulch TAD within the Westside TAD.”\nIn return, APS would recapture about $7.1 million per year from the closed Eastside TAD, a memo shows. Bottoms said via text the city agreed to make payments in lieu of taxes to APS to cover some of the tax revenue lost from supporting extension of the Westside TAD.\nMtamanika Youngblood, who chairs the nonprofit Sweet Auburn Works, said officials told her the Eastside TAD needed to be closed to protect the city’s bond rating — not to help the Gulch.\n“We’ve been told they wanted to close it, but the reasons we were told why they wanted to close apparently weren’t true,” Youngblood said. “It’s really robbing Peter to pay Paul when Paul is better off than Peter.”\nGulch development\nThe Gulch is a sprawling bed of rail lines and parking lots that stretches from Mercedes-Benz Stadium to MARTA’s Five Points station that’s vexed downtown leaders for years.\nPlans for a rail hub fizzled, but the area has seen renewed interest in recent years after the city dedicated hundreds of millions of dollars to sports arenas.\nThe Falcons built the new Mercedes-Benz Stadium after the city agreed to public financing that is likely to total $700 million over the next three decades. In 2016, the Hawks agreed to stay at downtown, striking a deal to renovate Philips Arena with the help of $142.5 million in public funds.\nFormer Mayor Reed said then the Hawks deal would trigger more than $1 billion in private investment by CIM and others.\nIn December, CIM proposed more than 9 million square feet of office space, 1 million square feet of retail and restaurant space, 1,000 residences and 1,500 hotel rooms.\nThe project, likely to cost billions, is aimed at Amazon, which in January named Atlanta one of 20 communities on its shortlist for “HQ2” and 50,000 corporate jobs.\nCity withholds records\nOn June 8, the AJC requested from APS and the city all texts sent between Bottoms and Carstarphen since Jan. 1. APS promptly provided texts from May 3 to June 6, but said earlier messages were irretrievable because Carstarphen’s old phone was damaged.\nRequests to the city for Bottoms’ texts and documents related to negotiations went unfulfilled.\nState law says agencies must provide responsive records within three business days, or provide an estimated amount of time to fulfill the request if documents aren’t readily available.\nAgencies can also redact or deny records, but officials must cite appropriate exemptions to state law.\nSmith, Bottom’s spokesman, said Tuesday that city and APS’ lawyers said the city didn’t have to provide texts because APS did. Smith later reversed course and said records would be provided after the AJC informed him First Amendment experts said the city’s stance didn’t comply with state law. (Records weren’t provided as of press time.)\nIn March, the state launched a criminal probe of City Hall’s handling of open records requests after AJC and Channel 2 Action News revealed city efforts to stall records production. The news outlets later filed a complaint with the state Attorney General’s office.","url":"https://www.ajc.com/news/local/texts-show-bottoms-and-atlanta-schools-negotiating-gulch-incentives/KjTjK3JrdBqNgA4Hr8HlnO/"}
