{"authors":[],"date_download":"2018-10-23 01:16:47","date_modify":"2018-10-23 01:16:47","date_publish":"2017-03-16 11:13:14","description":"Thailand's junta on Thursday said any future civilian government will be legally bound to follow a 20-year \"masterplan\" for the country as generals seek to...","filename":"data/vaneerConsumption/Thaijuntalaysoutlegallybinding20yearmasterplan.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-227935-1489662796-15_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319752_Thai-junta-lays-legally-binding-20-year-masterplan_1540257407.html","title":"Thai junta lays out 'legally binding' 20-year masterplan","title_page":"Thai junta lays out 'legally binding' 20-year masterplan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Thailand's Prime Minister Prayut Chan-O-Cha, pictured in August 2014\nThailand's junta on Thursday said any future civilian government will be legally bound to follow a 20-year \"masterplan\" for the country as generals seek to entrench their political influence for decades to come.\nSoldiers have run Thailand since a 2014 coup, ushering in the country's most autocratic government in a generation.\nThe military said the coup was needed to end more than a decade of political instability, instigate reform and root out corruption.\nBut critics decry severely stifled freedoms, as promised deadlines to return to civilian rule keep slipping.\n\"Reforming the country needs time and a long-term strategy. So the government decided to have a 20-year national strategy as the master plan, as a strategy plan, for the country,\" Major General Werachon Sukondhapatipak said at a rare briefing for foreign diplomats and media in Bangkok on Thursday.\nIn an announcement heavy on aims but light on concrete policies, he said the 20-year plan would help Thailand becomes a high income country by tackling, among other things, corruption, a sclerotic civil service as well as boosting the country's flagging economy.\nThe masterplan would be \"legally binding\" within the country's military-drafted constitution and any future administration \"has to formulate its policies based on the national strategy\", Werachon said, without detailing specific sanctions for non-compliance.\nThe military has launched a dozen successful coups in the last century.\nAnalysts say the latest plan raises the prospect of a return to the kind of \"military-steered\" democracy that dominated Thailand for much of the 1980s where the army effectively controlled nominally civilian administrations.\n\"The plan is not just to control the nation's developmental direction but to control or get rid of elected government they don't like in the future,\" Puangthong Pawakapan, a politics expert at Chulalongkorn University told AFP.\nOnce one of Asia's tiger economies, Thailand has stumbled in the last decade, a period pockmarked by two coups, political violence and successive short-lived governments.\nThe kingdom already has the lowest growth rate in Southeast Asia with a World Bank report this week warning GDP will dip to 3.0 percent by the year 2021.\n\"Thailand no longer stands out,\" the report said. \"The pack of other countries has caught up with it on virtually all dimensions.\"\nThais are divided on the cause of the country's woes.\nSupporters of the military accuse the political parties of intransigence, incompetence and corruption.\nDetractors say the Bangkok based military elite's repeated meddling in politics ensured civilian administrations remained short-lived and ineffective.","url":"https://www.dailymail.co.uk/wires/afp/article-4319752/Thai-junta-lays-legally-binding-20-year-masterplan.html"}
