{"authors":[],"date_download":"2018-10-22 23:57:56","date_modify":"2018-10-22 23:57:56","date_publish":"2017-04-26 08:51:21","description":"Thai media came under fire Wednesday for publishing images of a man killing his infant daughter in a Facebook Live video, a grim case that sparked outrage...","filename":"data/vaneerConsumption/ThaimediarebukedoverFacebookliveofchildmurder.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463993-1493193083-528_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446662_Thai-media-rebuked-Facebook-live-child-murder_1540252676.html","title":"Thai media rebuked over Facebook live of child murder","title_page":"Thai media rebuked over Facebook live of child murder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Facebook has been urged to move more quickly to take down clips of grisly crimes and killings\nThai media came under fire Wednesday for publishing images of a man killing his infant daughter in a Facebook Live video, a grim case that sparked outrage and raised fears of copycat killings.\nThe video, filmed Monday on the southern resort island of Phuket, showed Wuttisan Wongtalay hang his 11-month daughter from an abandoned building before taking his own life, according to police in charge of the case.\nThe footage was online for hours before it was removed on Tuesday, prompting cries for Facebook to move more quickly to take down clips of grisly crimes and killings.\nAt least one major Thai daily also printed images of the suicide on its front page Tuesday.\nA media body has since slammed some news outlets, which it said showed graphic and \"inappropriate\" images of the crime.\n\"The News Broadcasting Council of Thailand received complaints about reporting on a man who killed his child and himself via Facebook Live,\" the organisation said in a statement.\n\"Those reports were inappropriate,\" it added, warning channels and newspapers against giving graphic coverage to similar crimes because they \"may lead to copycats with the understanding that those actions will draw attention.\"\nPolice said they believe the killing was motivated by a \"family feud\" and that the father was unhappy with his wife's child from another relationship.\n\"His wife has a boy aged about four years old from her previous relationship,\" Jullaus Suvannin, the case officer, told AFP.\nIn a statement late Tuesday Facebook described the incident as \"appalling\".\n\"There is absolutely no place for content of this kind on Facebook and it has now been removed,\" the social network told AFP.\nThe killing was only the latest grisly crime to be published on the social network.\nLast week Facebook chief Mark Zuckerberg vowed to work to keep the site's live-streaming function from being used to propagate harrowing acts after a man in the US state of Ohio broadcast footage of himself shooting a stranger dead.\nThe killer went on to fatally shoot himself after a massive manhunt and police chase.\nDuring a speech last Wednesday Zuckerberg conceded that Facebook had \"a lot of work\" to do on the issue.\n\"We are going to work on building common ground, not just getting more opinions out there,\" he added.\nFacebook already has a 24-hour team of moderators who decide whether to remove content that is reported to them. Suicides and crimes are prioritised.\nBut the network says they are limited by how quickly they can respond to the sheer volume of content posted online each day.\nThey add that there have been instances where reported videos of a suicide attempt have resulted in a person being saved by local law enforcement, including such a case in Thailand in January.","url":"https://www.dailymail.co.uk/wires/afp/article-4446662/Thai-media-rebuked-Facebook-live-child-murder.html"}
