{"authors":["John J. Xenakis"],"date_download":"2018-10-30 17:50:43","date_modify":"2018-10-30 17:50:43","date_publish":"2018-10-30 13:19:19","description":"Contents: Thailand and Thaksin Shinawatra prepare for new national elections; The shadow of Thaksin Shinawatra; Brief generational history of Thailand | National Security","filename":"data/vaneerConsumption/ThailandandThaksinShinawatraPrepareforNationalElections.json","image_url":"https://media.breitbart.com/media/2017/09/wi/afp/07/ouao64-e1540905550373.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_10_30__1540921843.html","title":"Thailand and Thaksin Shinawatra Prepare for National Elections","title_page":"Thailand and Thaksin Shinawatra Prepare for National Elections","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nThailand and Thaksin Shinawatra prepare for national elections\nThe shadow of Thaksin Shinawatra\nBrief generational history of Thailand\nThailand and Thaksin Shinawatra prepare for national elections\nSupporters hold a picture of Thaksin Shinawatra and his sister Yingluck in Bangkok on Aug 5, 2017. (AFP)\nThailand’s Prime Minister Prayuth Chan-ocha has announced that a new general election will be held in 2019, possibly on February 24. Prayuth himself is prime minister because he was appointed by a military junta that overthrew the elected government of Yingluck Shinawatra in 2014 in a coup. Under domestic and international pressure, Prayuth has promised five times to schedule a general election but has always failed to do so.\nIt is possible that he will not keep his promise this time, either. After the 2014 coup, he promised elections in early 2015, then in 2016, and then in November 2018. Now it is 2019 – maybe.\nThe reason that Prayuth may again kill election plans is that he knows that his side will almost certainly lose. The vast majority of the population are the dark-skinned lower class indigenous people, also called “Thai-Thai” and “red shirts,” comprising about 3/4 of the population, living mostly in the northern and northeastern regions of Thailand but who come to Bangkok mostly to work in menial jobs serving the Thai-Chinese.\nThe Thai-Chinese, also called “yellow shirts,” are the light-skinned descendants of a wave of Chinese workers that poured into the country to find jobs in the 1930s. They comprise 1/4 of the population, live mostly around Bangkok, and are extremely contemptuous of the indigenous Thai-Thai, whom they consider to be inferior. Prayuth hates the Thai-Thai people and knows that they will win a general election, which is why he will probably do all he can to avoid one. Straits Times and South China Morning Post (Hong Kong, 29-Dec-2017) and Channel News Asia\nThe shadow of Thaksin Shinawatra\nThe Pheu Thai Party (Puea Thai Party), originally called the Thai Rak Thai (TRT) party, is the party of the indigenous “red shirt” people, led by Thaksin Shinawatra. Thaksin was prime minister from 2001-2006 when he was ousted by a military coup. He then engineered a series of election victories for prime ministers from his Pheu Thai party but in each case the army used some artifice to overthrow the elected prime minister.\nIn one case, the elected prime minister Samak Sundaravej was thrown out of office by a court because he previously had a cooking show on tv, and that was a conflict of interest. ( “Thailand government collapses, ending crippling riots from class war”.)\nIn the most recent case, Thaksin’s sister Yingluck Shinawatra won the 2011 election as the first female prime minister, with her election campaign scripted by her brother Thaksin, who at that time was living in exile in Dubai. ( “Thailand’s Yingluck promises to use ‘femininity’ to resolve disputes”)\nHowever, Yingluck’s use of femininity during her time in office did not seem to work with the military junta that overthrew her in a coup in 2014. She was charged with corruption and convicted in 2017 but fled the country in August just before she was scheduled to be sentenced and jailed. Many observers believe that the army purposely looked the other way when she fled the country, fearing that if she were jailed there would be popular riots by her supporters. She was sentenced in absentia to five years in jail.\nThaksin and Yingluck are still extremely popular in Thailand, and they still yield a great deal of influence in the Pheu Thai party. According to one analyst, “You have to understand how powerful the Thaksin ‘brand’ is among his supporters. For his working class supporters, he is still seen as a hero who delivered to those people who voted for him what he promised until he was unjustly overthrown by the ‘elite’.”\nThaksin has been traveling to London, Hong Kong, and Singapore, remaining out of reach of the Thai authorities. He recently gave an interview in which he said that all the “pro-democracy parties,” including his own Pheu Thai, should unite behind a single candidate. “It’s time for [voters] to cast their ballots … to dump the dictatorship of Thailand.”\nAfter giving this interview, a member of the ruling military junta in Thailand urged the Election Commission to look into whether Thaksin exercises control over the affairs of the Pheu Thai party from abroad. If a probe takes place and finds that Thaksin still retains influence, it could lead to the dissolution of the party for several years. Bangkok Post and Nikkei and South China Morning Post and Al Jazeera\nBrief generational history of Thailand\nPart of Thailand’s history was made famous by Anna Leonowens, who came from London to Siam (as it was known then) to be the governess and teacher of the many children of King Mongkut (Rama IV) in the 1860s. In 1895, she wrote memoirs that were turned into a film, “Anna and the King of Siam” in 1946, and into the 1952 Rodgers and Hammerstein Broadway musical, “The King and I.”\nIf you have a few minutes, then watch the YouTube video of “The March of the Siamese Children,” from the 1956 film, “The King and I.” It depicts Anna’s first meeting with the children.\nThe play depicts a troubled king trying to lead a small country surrounded by large enemies and willing to use invasion, torture, and other atrocities.\nKing Rama had fought a generational crisis war in the early 1830s when he had invaded Laos and Cambodia, but ended up losing to a Vietnamese army.\nSiam’s next generational crisis war occurred in what is now southern Thailand. For centuries, Siam’s kings had felt that the Muslims in southern Siam were a major threat to the security of the country, mainly because resistance and rebellion against Thai government rule were so strong among the Muslim population and the southern Muslims had revolted during the 1830s crisis war.\nBy the late 1800s, this threat had been felt to be critical and in 1902 King Rama V invaded and annexed the Malay kingdom of Patani, consisting of the four provinces of Satun, Yala, Pattani, and Narathiwat. (Note: The kingdom is spelled “Patani,” while the province is spelled “Pattani.”) In 1909, an Anglo-Siamese Agreement established the present border between Thailand and Malaysia.\nDuring the next few decades, Siam (which became Thailand in 1939) was faced with the problem of trying to assimilate the southern Muslim population into what is essentially a Buddhist country. During the generational Awakening era that followed, the military coup of 1932 overthrew the absolute monarchy in Siam and replaced it with a constitutional monarchy. This was a representative form of government that promised a high degree of political participation of the Malay-Muslims in the South. However, as World War II (an Awakening era war for Thailand) approached, the country became more Thai-nationalistic, and the country adopted a policy of forced assimilation towards the Muslims, which had little success, as resistance and rebellion have continued since then.\nThe 1930s also saw a large influx of migrants from China, coming to the country to work. Over the decades, they were able to displace the indigenous people in positions of power in government and in control of businesses. This formed an ethnic fault line between the indigenous Thai-Thai majority and the elite Thai-Chinese minority.\nThe next generational crisis war was the Cambodian “killing fields” war, 1975-79, in which Pol Pot’s communist Khmer Rouge government, backed by China, killed almost ten million people in a massive genocide. The Cambodian war spilled over into Thailand in the form of a communist rebellion that had begun in the 1960s. King Bhumibol (Rama IX) became an essential figure in the fight against the communists, although his role became more controversial in the savage anti-leftist coup of 1976, in which dozens of students were brutally killed by the security forces and royal-backed militias, and thousands forced to flee to seek sanctuary with the Communist Party.\nThe Cambodian “killing fields” civil war took place on Thailand’s doorstep, though not on Thai soil. Still, it caused a split along the Thai-Thai versus Thai-Chinese fault line that continues to the present time. Today, Thailand is in a new generational Awakening/Unraveling era, and we are seeing a repeat of what happened in the 1930s.\nDuring the generational Awakening era of the 1930s, the military coup of 1932 overthrew the absolute monarchy in Siam and replaced it with a constitutional monarchy that gave some power to the southern Muslims, only to have it taken away a few years later.\nDuring the current era, the 1997 constitution guaranteed free elections for everyone, including the indigenous Thai-Thai, and now that’s being taken away by a military junta.\nHistory does not repeat itself, but it rhymes. Yale: Thailand’s Response to the Cambodian Genocide and Cornell: History and Politics of the Muslims in Thailand (PDF) and Communist Party of Thailand\nRelated Articles\nKEYS: Generational Dynamics, Thailand, Thaksin Shinawatra, Yingluck Shinawatra, Pheu Thai Party, Puea Thai Party, Thai Rak Thai, TRT, Prayuth Chan-ocha, Samak Sundaravej, Anna Leonowens, Siam, King Mongkut, Rama IV, Anna and the King of Siam, Rodgers and Hammerstein, The King and I, Rama V, Malaysia, Kingdom of Patani, Satun, Yala, Pattani, Narathiwat, China, Laos, Vietnam, Cambodia, Killing fields, King Bhumibol, Rama IX\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2018/10/30/world-view-thailand-and-thaksin-shinawatra-prepare-for-national-elections/"}
