{"authors":["Associated Press"],"date_download":"2018-10-23 02:33:24","date_modify":"2018-10-23 02:33:24","date_publish":"2017-04-26 13:40:51","description":"BANGKOK (AP) - Thai police on Wednesday arrested a taxi driver accused of raping a Brazilian woman who had just arrived at a Bangkok airport on an...","filename":"data/vaneerConsumption/ThaitaxidriverarrestedforallegedrapeofBrazilian.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447692_Thai-taxi-driver-arrested-alleged-rape-Brazilian_1540262004.html","title":"Thai taxi driver arrested for alleged rape of Brazilian","title_page":"Thai taxi driver arrested for alleged rape of Brazilian | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BANGKOK (AP) - Thai police on Wednesday arrested a taxi driver accused of raping a Brazilian woman who had just arrived at a Bangkok airport on an international flight, saying the suspect had a criminal record and had already confessed to the crime.\nThe 22-year-old victim arrived at Don Muang airport from Malaysia on Tuesday afternoon and had asked to be driven to central Bangkok, Police Lt. Col. Terdthai Sukthai said. Instead she was driven to an area outside Bangkok, where the driver is accused of beating and raping her before leaving her by the side of the road, he said.\nThe driver was arrested in a northern suburb of Bangkok after being traced through security footage from the airport, Terdthai said. The woman has been hospitalized with injuries, he said.\nPolice arrested the driver on charges of rape, illegal detention, and theft with violence. Police investigator Lt. Col. Somchit Charoensalung said the driver had already confessed. Somchit also said the suspect has a criminal record.\nThailand tries to regulate taxi drivers making pick-ups at Bangkok's airports, mostly in an effort to identify any who try to cheat passengers. Tourism is a major revenue earner for Thailand, which hosted an estimated 32.6 million visitors last year.","url":"https://www.dailymail.co.uk/wires/ap/article-4447692/Thai-taxi-driver-arrested-alleged-rape-Brazilian.html"}
