{"authors":[],"date_download":"2018-10-22 20:24:12","date_modify":"2018-10-22 20:24:12","date_publish":"2014-06-01 08:02:04","description":"The military has banned political gatherings of five people or more.","filename":"data/vaneerConsumption/ThaiForcesDescendonCentralBangkoktoStifleCoupProtests.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/479826/thailandjune1_8181cec7290088b8dffba04834576a5a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_thai-forces-descend-central-bangkok-stifle-coup-protests-n119526_1540239852.html","title":"Thai Forces Descend on Central Bangkok to Stifle Coup Protests","title_page":"Thai Forces Descend on Central Bangkok to Stifle Coup Protests","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBANGKOK - Thailand's military government sent thousands of troops and police into central Bangkok on Sunday to stop any demonstrations against its seizure of power, and some shopping malls and train stations closed to avoid trouble.\nAuthorities were anticipating that protesters would gather at several spots in the capital including an area in the center where big malls are located. The military has banned political gatherings of five people or more.\nThe military took over on May 22 after the government of Prime Minister Yingluck Shinawatra had been weakened by months of protests that had forced ministries to close for weeks on end, hurt business confidence and caused the economy to shrink.\nProtests against the coup have taken place in Bangkok most days since then although they have been small and brief.\nDeputy police chief Somyot Poompanmoung told Reuters 5,700 police and soldiers were being sent into central Bangkok and rapid deployment units were ready to stop protests that might spring up elsewhere.","url":"https://www.nbcnews.com/news/world/thai-forces-descend-central-bangkok-stifle-coup-protests-n119526"}
