{"authors":["Associated Press"],"date_download":"2018-10-23 03:16:04","date_modify":"2018-10-23 03:16:04","date_publish":"2017-03-10 12:44:11","description":"BANGKOK (AP) - Religious and law enforcement authorities on Friday appealed to Thailand's ecclesiastical supervisory board to defrock a senior Buddhist monk...","filename":"data/vaneerConsumption/ThailawenforcementseeksdefrockingofBuddhistmonk.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196261-1489153756-502_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301180_Thai-law-enforcement-seeks-defrocking-Buddhist-monk_1540264564.html","title":"Thai law enforcement seeks defrocking of Buddhist monk","title_page":"Thai law enforcement seeks defrocking of Buddhist monk | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BANGKOK (AP) - Religious and law enforcement authorities on Friday appealed to Thailand's ecclesiastical supervisory board to defrock a senior Buddhist monk they've been unable to arrest on charges of accepting $40 million embezzled funds for his temple.\nAlso Friday, police entered the vast compound of the Dhammakaya sect's headquarters temple to search for 72-year-old Phra Dhammajayo with the permission of the senior monks there. A similar three-day search three weeks ago failed to find Dhammajayo, and police have besieged the site north of Bangkok since then.\nThe Supreme Sangha Council accepted the case against Dhammajayo forwarded by the state's National Office of Buddhism from the Department of Special Investigation, Thailand's FBI. The council could order Dhammajayo defrocked, but resolving the case could take years if it is appealed in the courts, Deputy Prime Minister Wissanu Krea-ngam said Friday.\nA monk follows an officer inspecting a medical center on the Wat Dhammakaya temple compound in Pathum Thani province, Thailand, Friday, March 10, 2017. Thai police have concluded a weeks-long search for the controversial Buddhist temple's senior monk, wanted on criminal charges over tens of millions in embezzled money. (AP Photo/Dake Kang)\nThe sect has said it was unaware of the origin on the embezzled funds and has made an effort at returning them. Dhammajayo has also been charged with land encroachment involving some of the sect's temples, charges that were added after he failed to surrender on the charges involving accepting embezzled money. His followers said he was too sick to turn himself in.\nSome devotees believe Dhammajayo is being persecuted for political reasons because the temple and its followers are seen as supporters of former Prime Minister Thaksin Shinawatra, who was deposed in a 2006 military coup. They believe Thailand's ruling military junta is acting to consolidate its power.\nBoth sides said Friday's search of some central temple buildings was the last such effort by the authorities. More than 100 soldiers and officers from the Department of Special Investigation found nothing of interest, and the security forces around the site are supposed to be withdrawn by Monday.\n\"DSI have searched all remaining areas,\" said Police Col. Paisit Wongmuang. \"The next step is intelligence and investigation.\"\nA monk who serves as a spokesman for the temple, Phra Pasura Dantamano, said he hoped the government would revoke the emergency order allowing it to tightly restrict access to the area.\n\"We already made an effort to trust them, and I think they also tried to make an effort to trust us. Now, each and every one of us is getting closer to a final solution for everything to end in peace,\" he said. \"Although the future is unpredictable, right now the signs are pretty good, we have to wait and see what will happen.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4301180/Thai-law-enforcement-seeks-defrocking-Buddhist-monk.html"}
