{"authors":[],"date_download":"2018-10-22 21:26:10","date_modify":"2018-10-22 21:26:10","date_publish":"2014-05-07 08:09:53","description":"\"Transferring government officials must be done in accordance with moral principle,\" the court said in its ruling, read aloud on live television for almost 90 minutes. \"Transferring with a hidden agenda is not acceptable.\"","filename":"data/vaneerConsumption/ThaiPrimeMinisterYingluckShinawatraOrderedtoStepDown.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/425346/140507-yingluck-shinawatra-430a_da3584076b88c475edcfb2a4a9cc8817.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_thai-prime-minister-yingluck-shinawatra-ordered-step-down-n98961_1540243570.html","title":"Thai Prime Minister Yingluck Shinawatra Ordered to Step Down","title_page":"Thai Prime Minister Yingluck Shinawatra Ordered to Step Down","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBANGKOK -- Thailand's prime minister was ordered to step down Wednesday along with part of her Cabinet after the Constitutional Court found her guilty in an abuse of power case, pushing the country deeper into political turmoil.\nPrime Minister Yingluck Shinawatra was charged with abusing her authority by transferring a senior civil servant in 2011 to another position. The court ruled that the transfer was carried out to benefit her politically powerful family and, therefore, violated the constitution — an accusation she has denied.\n\"Transferring government officials must be done in accordance with moral principle,\" the court said in its ruling, read aloud on live television for almost 90 minutes. \"Transferring with a hidden agenda is not acceptable.\"\n\"The Constitutional Court has ruled unanimously that (Yingluck) has used her status as the prime minister to intervene for her own and others' benefits to (transfer) a government official,\" which violated Article 268 of the Constitution, and ended her rule as prime minister, the court said in its verdict.","url":"https://www.nbcnews.com/news/world/thai-prime-minister-yingluck-shinawatra-ordered-step-down-n98961"}
