{"authors":[],"date_download":"2018-10-22 22:03:37","date_modify":"2018-10-22 22:03:37","date_publish":"2014-06-08 08:20:47","description":"Thailand's junta has prepared a force of over 6,000 troops and police for deployment in Bangkok Sunday to smother protests and prevent opposition to the May 22 coup from gaining momentum.","filename":"data/vaneerConsumption/ThaiJuntaReadiesForBangkokProtestsWith6000Troops.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/494871/140608-world-thai-protest-6000-soldiers-415a_668d40ce7d3bdb99b00753bd7b28e1c9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_thai-junta-readies-bangkok-protests-6-000-troops-n125531_1540245817.html","title":"Thai Junta Readies For Bangkok Protests With 6,000 Troops","title_page":"Thai Junta Readies For Bangkok Protests With 6,000 Troops","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBANGKOK - Thailand's junta has prepared a force of over 6,000 troops and police for deployment in Bangkok Sunday to smother protests and prevent opposition to the May 22 coup from gaining momentum.\nThe military has cracked down hard on pro-democracy dissidents and supporters since it ousted Prime Minister Yingluck Shinawatra last month, seeking to mute criticism and nip protests in the bud.\nA heavy security force presence at potential flashpoints in Thailand's largest cities since the coup has limited protesters to small gatherings, which are often coordinated through social media and mostly located around shopping malls.\nAuthorities were focusing on five possible protest sites in Bangkok on Sunday, said deputy police chief Somyot Poompanmoung.\nThey included the country's main international airport and the downtown area around the Grand Palace, as well as sites where protests have previously taken place, he said. The palace is one of Bangkok's top tourist attractions.","url":"https://www.nbcnews.com/news/world/thai-junta-readies-bangkok-protests-6-000-troops-n125531"}
