{"authors":["Associated Press"],"date_download":"2018-10-22 23:58:11","date_modify":"2018-10-22 23:58:11","date_publish":"2017-04-26 09:00:23","description":"PHUKET, Thailand (AP) - The wife of a Thai man who hanged their 11-month-old daughter on Facebook Live said Wednesday her husband is the only person to blame...","filename":"data/vaneerConsumption/ThaiwomanhasnoangertowardFacebookaftergirlskilling.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464689-1493204441-188_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446672_Thai-woman-no-anger-Facebook-girls-killing_1540252691.html","title":"Thai woman has no anger toward Facebook after girl's killing","title_page":"Thai woman has no anger toward Facebook after girl's killing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PHUKET, Thailand (AP) - The wife of a Thai man who hanged their 11-month-old daughter on Facebook Live said Wednesday her husband is the only person to blame and she bears no anger toward the social media site or the users who shared the horrific video.\nThe video showed 20-year-old Wuttisan Wongtalay killing his child by hanging her at an abandoned hotel. The video was livestreamed Monday evening and made inaccessible by Facebook late Tuesday afternoon.\nPolice said the man later killed himself. The video was apparently available for viewing online for almost 24 hours until Facebook pulled it down.\nChiranut Trairat, mother of an 11-month-old baby girl, sits in front of her daughter's coffin at Si Sunthon temple in Phuket, Thailand, Wednesday, April 26, 2017. Her husband upset with her hanged their daughter on Facebook Live and then killed himself, police said. (AP Photo)\n\"I am not angry at Facebook or blaming them on this,\" Chiranut Trairat, 21, told The Associated Press. \"I understand that people shared the video because they were outraged and saddened by what happened.\"\nShe said her husband had been abusive in the past and spent two years in prison before they started dating.\nFacebook has been seeking ways to block videos as quickly as possible after a series of gruesome images, including murder and sexual assault, were livestreamed or posted.\n\"This is an appalling incident and our hearts go out to the family of the victim. There is absolutely no place for content of this kind on Facebook and it has now been removed,\" Facebook said in a statement on the Thai incident.\nFacebook founder Mark Zuckerberg said last week that his company has \"a lot of work\" to do on the problem.\nThe murder in Phuket came less than two weeks after a man in Cleveland, Ohio, posted on Facebook a video of himself shooting a man to death.\nIn Thailand, the potential for problems with Facebook Live became an issue last May when local media used the platform to broadcast live video of a university lecturer who was locked in a six-hour standoff with police who were seeking him in the shooting deaths of two colleagues. After negotiations for his surrender failed, he fatally shot himself, a moment that was shown live.","url":"https://www.dailymail.co.uk/wires/ap/article-4446672/Thai-woman-no-anger-Facebook-girls-killing.html"}
