{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:25:26","date_modify":"2018-10-30 20:25:26","date_publish":"2015-02-24 17:06:04","description":"Two actors in Thailand will spend the next two years behind bars, after a court found them guilty of insulting the country’s royal monarchs during a 2013 student performance.","filename":"data/vaneerConsumption/ThaiStudentActorsGetPrisonTimeTheatrePerformance.json","image_url":"https://media.breitbart.com/media/2015/02/Thai-Actor-Prison-AP-Photo-Sakchai-Lalit.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_02_24__1540931126.html","title":"Thai Student Actors Get Prison Time Theatre Performance","title_page":"Thai Student Actors Get Prison Time Theatre Performance","title_rss":"NULL","source_domain":"breitbart.com","text":"Two actors in Thailand will spend the next two years behind bars, after a court found them guilty of insulting the country’s royal monarchs during a 2013 student performance.\nPatiwat Saraiyaem, 23, and Pornthip Munkong, 26, were each handed separate five-year sentences Tuesday by Bangkok central court, after authorities claimed the pair broke strict “lèse majesté” laws. However, after confessions from Saraiyaem and Munkong, those sentences were both reduced to terms of two and a half years.\nThailand’s “lèse majesté” laws, which are designed to protect monarchs from being insulted, are the world’s most severely imposed, according to BBC News.\nBoth actors have been incarcerated since shortly after their performance at a university in A Wolf’s Bride, a theatre act set in a fantasy kingdom.\nThe pair both played major roles in the act, which dramatized the story of a fictional king and his advisor and was performed on the eve of the 40th anniversary of a previous pro-democracy uprising at the same university.\nWhile the show was performed only once at the school on Oct. 13, 2013, it was recorded and shared on social media.\nRupert Abbott, research director for Amnesty International’s Southeast Asia and the Pacific spoke of the ruling, reports Variety:\nThis is an assault on freedom of expression. It is appalling that Patiwat Saraiyaem and Pornthip Mankong have been jailed just for staging a play. Since taking power last year, Thailand’s military authorities have made unprecedented use of the lèse-majesté law to silence and target critics who are simply peacefully exercising their human rights. The pair should never have had to stand trial in the first place, and the verdict should be overturned and sentences expunged. Their guilty plea should not be considered as an admission of criminal responsibility as the courts regularly reduce sentences for defendants who have pleaded guilty.\n“Lèse majesté” laws are being strictly enforced by Thailand’s new military regime, which took power in May 2014 and looks to curtail dissent of the official glorification of King Bhumibol, reports BBC.","url":"https://www.breitbart.com/entertainment/2015/02/24/thai-student-actors-to-spend-two-years-in-jail-for-theatre-performance/"}
