{"authors":[],"date_download":"2018-10-22 23:53:10","date_modify":"2018-10-22 23:53:10","date_publish":"2017-04-26 08:46:21","description":"Thailand on Wednesday appointed Serbian Milovan Rajevac as the new coach of the national football team, plumping for the man who guided Ghana to an unlikely...","filename":"data/vaneerConsumption/ThaispickexGhanacoachRajevactorevivefortunes.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463961-1493192782-915_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446656_Thais-pick-ex-Ghana-coach-Rajevac-revive-fortunes_1540252390.html","title":"Thais pick ex-Ghana coach Rajevac to revive fortunes","title_page":"Thais pick ex-Ghana coach Rajevac to revive fortunes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Thailand have appointed Serbian Milovan Rajevac as the new coach of their national football team\nThailand on Wednesday appointed Serbian Milovan Rajevac as the new coach of the national football team, plumping for the man who guided Ghana to an unlikely quarter-final spot at the 2010 World Cup.\nThe former Red Star Belgrade defender was available after leaving his as Algeria coach last year after just two games.\nHe will replace fan favourite Kiatisuk Senamuang -- nicknamed Zico -- who left the Thai national side after a series of heavy defeats in their World Cup qualifying campaign.\nThailand are at the bottom of their qualification group with one point from seven matches.\nThe 63-year-old Serb was picked from a shortlist that included the former Brazil coach and World Cup winning captain Dunga and former Barcelona manager Frank Rijkaard -- all of whom would have demanded handsome salaries for their services.\n\"The association spent almost one month looking for a coach, with capable coaches from around the world expressing interest,\" the Football Association of Thailand (FAT) said in a statement.\n\"Milovan Rajevac... has been chosen,\" after consideration for his \"plan and working philosophy, readiness for work as well as his staff.\"\nRajevac took control of Ghana in 2008 and led the last eight of the 2010 World Cup where they lost a shoot-out to Uruguay after striker Asamoah Gyan missed a last-minute penalty that would have taken them to the semi-finals.\nRajevac has also had brief stints in charge of Qatar and Algeria since.\n\"He will immediately have to look for players who play his style,\" Withaya Laohakul, vice president of the FAT told reporters. \"He will be able to fix our team's weak points.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4446656/Thais-pick-ex-Ghana-coach-Rajevac-revive-fortunes.html"}
