{"authors":["Associated Press"],"date_download":"2018-10-23 02:29:40","date_modify":"2018-10-23 02:29:40","date_publish":"2017-03-10 11:39:08","description":"BANGKOK (AP) - A sea turtle in Thailand that swallowed almost a thousand coins thrown into its pool by people seeking good luck is recovering well, four days...","filename":"data/vaneerConsumption/Thaiturtlegetspostoprehabilitationaftercoinsremoved.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195763-1489146572-978_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300966_Thai-turtle-gets-post-op-rehabilitation-coins-removed_1540261780.html","title":"Thai turtle gets post-op rehabilitation after coins removed","title_page":"Thai turtle gets post-op rehabilitation after coins removed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BANGKOK (AP) - A sea turtle in Thailand that swallowed almost a thousand coins thrown into its pool by people seeking good luck is recovering well, four days after an operation that removed the 5 kilograms (11 pounds) of money from its stomach.\nVeterinarians in Bangkok put \"Bank,\" as the green sea turtle is nicknamed, back into water for the first time Friday to see how well she could move. The turtle was gently lowered into a large plastic tank and very quickly began swimming as best as she could in the restricted space.\nThe 25-year-old turtle was rescued from a pool by the Thai navy after it became ill from swallowing coins thrown to her by passers-by who believed doing so would bring them good luck.\n25-year-old green sea turtle \"Bank\" receives rehabilitation treatment at the Chulalongkorn University in Bangkok, Thailand, Friday, March 10, 2017. Veterinarians operated on Bank Monday to remove 915 coins weighing 5 kilograms (11 pounds) from her stomach, which she swallowed after misguided human passers-by tossed coin into her pool for good luck in eastern Thailand. (AP Photo/Sakchai Lalit)\n25-year-old green sea turtle \"Bank\" prepare clean surgical scar at Chulalongkorn University in Bangkok, Thailand, Friday, March 10, 2017. Veterinarians operated on Bank Monday to remove 915 coins weighing 5 kilograms (11 pounds) from her stomach, which she swallowed after misguided human passers-by tossed coin into her pool for good luck in eastern Thailand. (AP Photo/Sakchai Lalit)\nHead of Chulalongkorn University's veterinary medical aquatic animal research center Nantarika Chansue treats 25-year-old green sea turtle named \"Bank\" in Bangkok, Thailand, Friday, March 10, 2017. Veterinarians operated on Bank Monday to remove 915 coins weighing 5 kilograms (11 pounds) from her stomach, which she swallowed after misguided human passers-by tossed coin into her pool for good luck in eastern Thailand. (AP Photo/Sakchai Lalit)\nHead of Chulalongkorn University's veterinary medical aquatic animal research center Nantarika Chansue, left, injects saline solution as part of rehabilitation treatment for 25-year-old green sea turtle \"Bank\" in Bangkok, Thailand, Friday, March 10, 2017. Veterinarians operated on Bank Monday to remove 915 coins weighing 5 kilograms (11 pounds) from her stomach, which she swallowed after misguided human passers-by tossed coin into her pool for good luck in eastern Thailand. (AP Photo/Sakchai Lalit)","url":"https://www.dailymail.co.uk/wires/ap/article-4300966/Thai-turtle-gets-post-op-rehabilitation-coins-removed.html"}
