{"authors":[],"date_download":"2018-10-23 01:51:05","date_modify":"2018-10-23 01:51:05","date_publish":"2017-03-10 10:23:10","description":"Aided by a jazz soundtrack, Thai artisans work against the clock scratching, moulding and shaping the intricate clay sculptures that will adorn the funeral...","filename":"data/vaneerConsumption/Thaiartisanscraftforkingsfuneral.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/10/wire-195331-1489141393-768_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300696_Thai-artisans-craft-kings-funeral_1540259465.html","title":"Thai artisans craft for king's funeral","title_page":"Thai artisans craft for king's funeral | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The sculptures include the Hindu god Brahma, elephants, lions and a towering Garuda -- a half-bird, half-human creature of Hindu and Buddhist lore which will carry Bhumibol's spirit\nAided by a jazz soundtrack, Thai artisans work against the clock scratching, moulding and shaping the intricate clay sculptures that will adorn the funeral pyre of Thailand's revered former King Bhumibol Adulaydej.\nThe sculptures, of animals, gods and mythical creatures, will decorate the spectacular 50 metre (165 foot) pyre that is set to provide a final stage for Bhumibol, who died last October.\nThe exact date of his funeral is not yet known, with Bhumibol's heir, King Maha Vajiralongkorn, to decide on an auspicious time, expected to be in late 2017.\nThailand plunged into intense mourning for the passing Bhumibol, a monarch who strode over 70 years of Thai history.\nThe exact date of his funeral is not yet known, though it is expected to be in late 2017\nThe new king will have his coronation after his father's funeral, which promises to be a sombre yet magnificent affair heavily laced with symbols and ritual.\nAt a cavernous studio an hour outside Bangkok dozens of artisans are making the huge, life-like sculptures which will stud the pyre, which is being built in Bangkok's historic heart.\nIt is the work of a lifetime, says team leader Pitak Chalermlao, an expert from the Fine Arts Department, told AFP.\n\"I feel great that I can do this for him (Bhumibol). All of the artisans here are working with love and pride... we are doing it for our father,\" he said, adding volunteers have boosted the ranks of the trained artisans.\nResin moulds will be made from the finished clay sculptures.\nThe works, two to four metres-high, include the Hindu god Brahma, elephants, lions and a towering Garuda -- a half-bird, half-human creature of Hindu and Buddhist lore which will carry Bhumibol's spirit to Mount Meru.\nResin moulds will be made from the finished clay sculptures\nMeru is the allegorical centre of the universe in Buddhist, Hindu and Jain cosmology.\nBhumibol's body, currently in the Grand Palace, will be placed at the centre of the pyre and set alight allowing his spirit to travel to the mountain.","url":"https://www.dailymail.co.uk/wires/afp/article-4300696/Thai-artisans-craft-kings-funeral.html"}
